{
  "chapter": "القارعة",
  "text": "القارعة",
  "translations": [
    {
      "translation": "THE STARTLING CALAMITY.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Calamity!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (unprecedented) crash!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The event that terrifies the hearts!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Al-Qari`ah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The terrible calamity!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Clatterer!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Calamity!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Clatterer!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Striking!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Catastrophe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (Day) of Noise and Clamour:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Al-Qari'ah (the striking Hour i.e. the Day of Resurrection),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Clatterer (the Day of Judgement)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Shocker.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Striking Calamity -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[101:1] The Clattering Blow, the Resurrection that will make hearts clatter by its terrors.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Calamity! What is the Calamity?): '(Calamity!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nعن أبي خالد عن زيد بن علي عليهما السّلام في قوله تعالى: { ٱلْقَارِعَةُ مَا ٱلْقَارِعَةُ } فالقارعةُ: هي الداهيةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلْقَارِعَةُ } [القارعة: 1] أي: الساعة التي تقرع الأسماع من هولها وهيبتها، وتدهش العقول من شدتها وصولتها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { القارعةُ ما القارعةُ } القرع هو الضرب باعتماد، بحيث يحصل منه صوت شديد وهي القيامة التي مبدؤها النفخة الأولى، ومنتهاها فصل القضاء بين الخلائق، سُميت بها لأنها تقرع القلوب والأسماع بفنون الأفزاع والأهوال\n وهي مبتدأ، خبرها: قوله: ما القارعةُ على أنَّ \" ما \" استفهامية خبر والقارعة مبتدأ، لا بالعكس لما مرّ من أنَّ محط الإفادة هو الخبر لا المبتدأ\n ولا ريب في أنَّ مدار إفادة الهول والفخامة هاهنا هو \" ما القارعة \" أيّ شيء عجيب هي في الفخامة والفظاعة، وقد وقع الظاهر موضع الضمير تأكيداً للتهويل\n { وما أدراك ما القارعةُ } هو تأكيد لهولها وفضاعتها، ببيان خروجها عن دائرة علوم الخلق، أي: أيُّ شيء أعلمك ما شأن القارعة؟ ومن أين علمت ذلك؟ و \" أدري \" يتعدى إلى مفعولين علقت عن الثاني بالاستفهام\n ثم بيّن شأنها فقال: { يومَ يكونُ الناسُ كالفراش المبثوثِ } أي: هي يوم، على أنَّ \" يوم \" مبني لإضافته إلى الفعل وإن كان مضارعاً على رأي الكوفيين، والمختار أنه منصوب باذكر، كأنه قيل بعد تفخيم أمر القارعة وتشويقه عليه الصلاة والسلام إلى معرفتها: اذكر يوم يكون الناس كالفراش المبثوث في الكثرة والانتشار والضعف والذلّة والاضطراب والتطاير إلى الداعي كتطاير الفراش إلى النار\n والفراش: صِغار الجراد، ويسمى: غوغاء الجراد، وبهذا يوافق قوله تعالى:\n\n[القمر:7] وقال أبو عبيدة: الفراش: طير لا بعوض ولا ذباب، والمبثوث: المتفرق\n وقال الزجاج: الفراش ما تراه كصغار البق يتهافت في النار\n هـ\n والمشهور أنه الطير الذ يتساقط في النار، ولا يزال يقتحم على المصباح، قال الكواشي: شبّه الناسَ عند البعث بالفراش لموج بعضهم في بعض، وضعفهم وكثرتهم، وركوب بعضهم بعضاً لشدة ذلك اليوم، كقوله:\n\n[القمر:7] وسمي فراشاً لتفرُّشه وانتشاره وخفته\n هـ\n واختار بعضهم أن يكون هذا التشبيه للكفار لأنهم هم الذين يتهافتون في النار تهافت الفراش المنتشر\n { وتكونُ الجبالُ كالعِهْنِ المنفوشِ } كالصوف الملون بالألوان المختلفة في تفرُّق أجزائها وتطايرها في الجو، حسبما نطق به قوله تعالى:\n\n[النمل:88] الآية، وكلا الأمرين من آثار القارعة بعد النفخة الثانية عند حشر الخلق، يُبدِّل الله الأرضَ غير الأرض بتغيير هيئاتها وتسير الجبال سيراً عن مقارها على ما ذكر من الهيئة الهائلة ليشاهدها أهل المحشر، وهي وإن اندكت وتصدّعت عند النفخة الأولى، لكن تسيير وتسويتها يكونان بعد النفخة الثانية، كما ينطق به قوله تعالى:\n\n[طه:105] الآية، ثم قال:\n\n[طه:108] وقوله تعالى:\n\n[إبراهيم:48]، الآية، فإنَّ اتباع الداعي وهو إسرافيل، وبروز الخلق لله تعالى لا يكون إلاَّ بعد النفخة الثانية\n\n\nقاله أبو السعود\n قلت: دكّ الأرض كلها مع بقاء جبالها غريبَ مع أنَّ قوله تعالى:\n\n[الحاقة:14] الخ صريح في دك الجبال وتسويتها مع دك الأرض قبل البعث، ويمكن الجمع بأن بعضها تدك مع دك الأرض، وهو ما كان في طريق ممر الناس للمحشر وبعضها تبقى ليشاهدها أهلُ المحشر، وهو ما كان جانباً، والله تعالى أعلم بما سيفعل وسَتَرِد وترى\n ولمّا ذكر ما يَعُمّ الناس ذَكَر ما يخص كل واحد، فقال: { فأمَّا مَن ثَقُلَتْ موازينه } باتباعه الحق، وهو جمع \" موزون \" ، وهو العمل الذي له وزن وخطر عند الله أو جمع ميزان، قال ابن عباس رضي الله عنه: هو ميزان له لسان وكفّتان، تُوزن فيه الأعمال، قالوا: تُوضع فيه صحائف الأعمال، فينظر إليه الخلائق، إظهاراً للمعدلة، وقطعاً للمعذرة\n قال أنس: \" إنَّ ملكاً يوُكّل يوم القيامة بميزان ابن آدم، يُجاء به حتى يوقف بين كفي الميزان، فيُوزن عمله، فإن ثقلت حسناته نادى بصوت يُسْمِع جميعَ الخلائق باسم الرجل: إلاَ سَعِدَ فلان سعادة لا يشقى بعدها أبداً، وإن خفّت موازينه نادى: شَقِيَ فلان شقاوة لا يسعد بعدها أبداً \" وقيل: الوزن عبارة عن القضاء السَّوي، والحكم العَدْل، وبه قال مجاهد والأعمش والضحاك، واختاره كثير من المتأخرين، قالوا: الميزان لا يتوصل به إلى معرفة مقادير الأجسام، فكيف يُمكن أن يعرف مقادير الأعمال\n هـ\n والمشهور أنه محسوس\n وقد رُوي عن ابن عباس أنه يُؤتى بالأعمال الصالحة على صورة حسنة، وبالأعمال السيئة على صورة قبيحة فتُوضع في الميزان فمَن ترجحت موازين حسناته { فهو في عيشةٍ راضيةٍ } أي: ذات رضاً، أو مرضية، { ومَن خَفَّتْ موازينُه } باتباعه الباطل، فلم يكون له حسنات يُعتد بها، أوترجحت سيئاته على حسناته، { فأُمُّهُ هاويةٌ } ، هي من أسماء النار، سُميت بها لغاية عمقها وبُعد مداها، رُوي أنَّ أهل النار يهووا فيها سبعين خريفاً\n وعبَّر عن المأوى بالأم لأنَّ أهلها يأوون إليها كما يأوي الولد إلى أمه، وعن قتادة وغيره: فأم رأسه هاوية، لأنه يُطرح فيها منكوساً\n والأول هو الموافق لقوله: { وما أدراك مَا هِيَهْ } فإنه تقرير لها بعد إبهامها، وللإشعار بخروجها عن الحدود المعهودة للتفخيم والتهويل، وهي ضمير الهاوية، والهاء للسكت، ثبت وصلاً ووقفاً، لثبوتها في المُصحف، فينبغي الوقف ليوافق ثبوتها، ثم فسَّرها فقال: { نارٌ حامية } بلغت النهاية في الحرارة، قيل: وصفها بحامية تنبيهاً على أنَّ نار الدنيا بالنسبة إليها ليست بحامية فإنَّ نار الدنيا جزء من سبعين جزءاً منها، كما في الحديث\n الإشارة: القارعة هي سطوات تجلِّي الذات عند الاستشراف على مقام الفناء، لأنها تقرع القلوب بالحيرة والدهش في نور الكبرياء، ثم قال: { يوم يكون الناس كالفراش المبثوث } أو كالهباء في الهواء، إن فتشته لم تجده شيئاً ووجد الله عنده، يعني: إنَّ الخلق يصغر من جهة حسهم في نظر العارف، فلم يبعد في قلبه منهم هيبة ولا خوف\n\n\nوتكون الجبال، جبال العقل، كالعهن المنفوش، أي: لا تثبت عند سطوع نور التجلِّي لأنّ نور العقل ضعيف كالقمر، عند طلوع الشمس، فأمّا مَن ثقُلت موازينه بأن كان حقاً محضاَ إذ لا يثقل في الميزان إلاَّ الحق، والحق لا يُصادم باطلاً إلاَّ دمغه، فهو في عيشة راضية، لكونه دخل جنة المعارف، وهي الحياة الطيبة، وأمّا مَن خفّت موازينه باتباع الهوى فأُمُّه هاوية، نار القطيعة ينكس فيها ويُضم إليها، يحترق فيها بالشكوك والأوهام والخواطر، وحر التدبير والاختيار\n ورُوي في بعض الأثر: إنما ثقلت موازين مَن ثقلت موازينُهم يوم القيامة باتباعهم الحق وثقله في الدنيا وحُقَّ لميزان لا يوضع فيه إلاَّ الحق أن يَثقل، وإنما خفَّتْ موازينُ مَن خفت موازينُهم باتباعهم الباطلِ وخفته في الدنيا، وحُق لميزان لا يُوضع فيه إلاَّ الباطل أن يخف\n هـ\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ]
}