{
  "chapter": "التكاثر",
  "text": "ثم لتسـلن يومئذ عن النعيم",
  "translations": [
    {
      "translation": "Then on that day you will surely be asked about the verity of pleasures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on that Day, you will be called to account for all the bounties you enjoyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on that day, you will be questioned about the bounties (of God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on that day, you will surely be questioned regarding the favours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then on that Day you shall be asked about the delights!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then on that day you shall most certainly be questioned about the boons.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then you shall be questioned that day concerning true bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on that day, ye will be asked concerning pleasure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then on that Day you shall be questioned about your worldly favours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on that Day, ye shall surely be asked of the delights.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on that day, you will surely be questioned concerning the Blessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, shall ye be questioned that Day about the joy (ye indulged in!).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on that Day, you shall be asked about the delight (you indulged in, in this world)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, you shall be questioned about the pleasures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, on that Day, you will be questioned about the Bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you will surely be asked that Day about pleasure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[102:8] Then, on that day, the day you see it, you will assuredly be questioned (la-tus’alunna: the nūn of the indicative has been omitted because of one nūn coming after the other; likewise [omitted] is the wāw indicating the plural person [of the verb] because of two unvocalised consonants coming together) about the comforts [of the world], the health, leisure, security, food, drink and other things which one enjoys in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, on that day) on the Day of Judgement, (ye will be asked concerning pleasure) you will be asked about whether you gave thanks for all the bounties you enjoyed, of food, drink, clothing, etc'. And of the surah in which the Declining Day is mentioned, which is all Meccan, and consists of 3 verses, 14 words and 68 letters. Surah 103: The Declining Day (al-'Asr) And of the surah in which the Declining Day is mentioned, which is all Meccan, and consists of 3 verses, 14 words and 68 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ ٱلنَّعِيمِ } عن الأَمنِ والصِّحةِ\n ويقال: عن الفَراغِ والصَّحةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ لَتُسْأَلُنَّ } أيها الناس الناسون لعهود الحق ومواثيقه { يَوْمَئِذٍ عَنِ ٱلنَّعِيمِ } [التكاثر: 8] الفاني الذي يُشغلكم عن الحق ويلهاكم عن طاعته وعبادته، فحينئذٍ ظهر عليكم خطأ آرائكم وفساد أهوائكم التي كنتم عليها في النشأة الأولى\n\n\n\n\nآتنا من لدنك رحمة إنك أنت الوهاب\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المتصف باليقين العلي بعموم المعتقدات الأخروية أن تكون على ذكر منها، بحيث يكون علمك بها عيناً قبل حلولها ونزولها، فعليك ألاَّ تركن إلى الدنيا: مزخرفاتها ونعيمها ولذاتها، وتقنع بالكفاف وتتصف بالعفاف، وتلازم العزلة والخمول والفرار عن أصحاب الفضول، فإن صحبة الأشرار يعوقك عن ملاحظة الأسرار ويمنعك عن مشاهدة الأنوار\n\n\n\n\nربنا هب لنا من لدنك جذبة تنجينا من فضول الكلام وتوصلنا إلى دار السلام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم لتُسألُن يومئذٍ عن النعيم } أي: عن النعيم الذي ألهاكم الالتذاذ به عن الدين وتكاليفه، فإنَّ الخطاب مخصوص بمَن عكفت همته على استيفاء اللذات، ولم يعش إلاَّ ليأكل الطَيّب، ويلبس الطَيّب، وقطع أوقاته في اللهو والطرب، لا يعبأ بالعلم والعمل، ولا يحمل نفسه على مشاق الطاعة، فأمّا مَن تمتّع بنعمة الله تعالى، وتقوّى بها على طاعته، قائماً بالشكر، فهو من ذلك بمعزلٍ بعيد\n وفي الحديث:\n\n \" يقول الله تبارك وتعالى: ثلاث من النعم لا اسأل عبدي عن شكرهن، وأسأله عما سواه: بيت يكنُّه وما يُقيم به صلبه من الطعام، وما يُواري به عورَته من اللباس \" \n\nفالخلائق مسؤولون يوم القيامة عما أنعم عليهم به في الدنيا\n والله تعالى أعلم بحالهم، فالكافر يُسأل تبكيتاً وتوبيخاً على شِركه بمَن أنعم عليه، والمؤمن يُسأل عن شكر ما أنعم عليه\n هـ\n قلت: فكل مَن استعمل الأدب في تناول النعمة، بأن شَهِدَها من المنعِم بها، وذكر الله عند أخذها أو أَكْلِها وشكر عند تمامها، فلا يتوجه إليه سؤال أو يتوجه إظهاراً لمزيته وشرفه، وعليه يتنزّل قوله صلى الله عليه وسلم:\n\n\n\n \" هذا من النعيم الذي تُسألون عنه \" \n\nفي حديث أبي الهيثم\n والله تعالى أعلم\n الإشارة: ألهاكم التكاثر بالأموال والأولاد، أو بالعلوم الرسمية، عن التوجُّه إلى الله، لتحصيل معرفة العيان، حتى متُّم غافلين، كلاَّ سوف تعلمون عاقبةَ أمركم، حين يرتفع أهل العيان مع المقربين، وتبقوا معاشر أهل الدليل مع عامة أهل اليمين، كلاَّ لو تعلمون علم اليقين لتوجهتم إليه بكل حال لَترون الجحيم، أي: نار القطيعة ثم لَترونها عين اليقين، ثم لتُسألن يومئذ عن النعيم، هل قمتم بشكره أو لا، وشكره: شهود المنعِم في النعمة، فقد رأيتُ في عالم النوم شيخين كبيرين، فقلت لهما: ما حقيقة الشكر؟ فقال أحدهما: ألاَّ يُعصى بنعمه، فقلت: هذا شكر العوام، فما شكر الخواص؟ فسكتا، فقلت لهما: شكر الخواص: الاستغراق في شهود المنعِم\n هـ\n وهو كذلك لأنَّ عدم العصيان بالنِعم يحصل من بعض الأبرار كالعُبَّاد والزُهَّاد، بخلاف الاستغراق في الشهود، فإنه خاص بأهل العرفان، أهل الرسوخ والتمكين وقد تقدّم في سورة المعارج التفريق بين علم اليقين وعين اليقين وحق اليقين\n وبالله التوفيق، وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ]
}