{
  "chapter": "العصر",
  "text": "الا الذين ءامنوا۟ وعملوا۟ الصلحت وتواصوا۟ بالحق وتواصوا۟ بالصبر",
  "translations": [
    {
      "translation": "except for those who have iman and do right actions and urge each other to the truth and urge each other to steadfastness.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe, and do good and enjoin truth on one another, and enjoin one another to bear with fortitude (the trials that befall).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save those who have faith and do righteous deeds, and counsel each other to hold on to truth and counsel each other to be steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except the righteously striving believers who exhort each other to truthful purposes and to patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who accepted faith, and did good deeds and urged one another to the truth – and urged one another to have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe and do righteous deeds, and recommend one another to the truth, and recommend one another to patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe and do good, and enjoin on each other truth, and enjoin on each other patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save those who believe, and do righteous deeds, and counsel each other unto the truth, and counsel each other to be steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those who believe and do good works, and exhort one another to truth and exhort one another to endurance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except for those who believe and do good deeds and exhort one another to hold fast to the Truth, and who exhort one another to stead-fastness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But not those who themselves believe and work righteous works, and enjoin upon each other the truth, and enjoin upon each other endurance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who have faith and do righteous deeds, and enjoin one another to [follow] the truth, and enjoin one another to patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except such as have Faith, and do righteous deeds, and (join together) in the mutual teaching of Truth, and of Patience and Constancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe (in Islamic Monotheism) and do righteous good deeds, and recommend one another to the truth (i.e. order one another to perform all kinds of good deeds (Al-Ma'ruf) which Allah has ordained, and abstain from all kinds of sins and evil deeds (Al-Munkar) which Allah has forbidden), and recommend one another to patience (for the sufferings, harms, and injuries which one may encounter in Allah's Cause during preaching His religion of Islamic Monotheism or Jihad, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who believe and do good works and charge one another with the truth and charge one another with patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe, and do good works, and encourage truth, and recommend patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who have believed and done righteous deeds and advised each other to truth and advised each other to patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[103:3] except those who believe and perform righteous deeds, they are not in [a state of] loss, and enjoin one another to [follow] the truth, faith, and enjoin one another to patience, in [maintaining] obedience and in refraining from [acts of] disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Save those who believe) in Muhammad (pbuh) and the Qur'an (and do good works) and do acts of obedience privately between them and their Lord, (and exhort one another to truth) to belief in Allah's divine Oneness; and it is said to the Qur'an (and exhort one another to endurance) in performing the obligations imposed by Allah and in avoiding transgressions and also in enduring misfortunes and calamities, because the believers are unlike the disbelievers'. And of the surah in which the Traducers are mentioned, which is all Meccan and consists of 9 verses, 84 words and 161 letters: Surah 104: The Traducers (al-Humazah) And of the surah in which the Traducers are mentioned, which is all Meccan and consists of 9 verses, 84 words and 161 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَوَاصَوْاْ بِٱلْحَقِّ وَتَوَاصَوْاْ بِٱلصَّبْرِ } معناه تَحاثُوا عليهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إلاَّ الذين آمنوا } بالله الإيمان العلمي اليقيني وعرفوا أن لا مؤثر إلا الله وبرزوا عن حجاب الدهر { وعملوا الصالحات } الباقيات من الفضائل والخيرات، أي: اكتسبوها فربحوا بزيادة النور الكمالي على النور الاستعدادي الذي هو رأس مالهم { وتواصوا بالحق } أي: الثابت الدائم الباقي على حاله أبداً من التوحيد والعدل، أي: التوحيد الذاتي والوصفي والفعلي فإنه الحق الثابت فحسب { وتواصوا بالصبر } معه وعليه عن كل ما سواه بالتمكين والاستقامة، فإن الوصول إلى الحق سهل\n وأما البقاء عليه والصبر معه بالاستقامة في العبودية فأعزّ من الكبريت الأحمر والغراب الأبيض، فالفحوى أن نوع الإنسان في خسر إلا الكاملين في العلم والعمل، المكملين بهما\n ويجوز أن يؤخذ العصر بمعنى المصدر من عصر يعصر أي: وعصر الله الإنسان بالبلاء والمجاهدة والرياضة حتى تصفو نقاوته، إن الإنسان الباقي مع الثفل الواقف مع حجاب البشرية في خسر إلا الذين اتصفوا بالعلم والعمل وتواصوا بالحق الثابت الذي هو الاعتقاد اليقيني اللازم للصفاوة الباقية بعد ذهاب الثفل وتواصوا بالصبر على العصر والانعصار بالبلاء والرياضة، ولهذا قال عليه السلام:\n\n \" البلاء موكل بالأنبياء ثم الأولياء ثم الأمثل فالأمثل \" \n\n، وقال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ } الموقنين { ٱلَّذِينَ آمَنُواْ } بوحدة الحق، وتفطنوا باستقلاله في التصرفات الجارية في ملكه وملكوته { وَ } مع الإيمان والإذعان { عَمِلُواْ ٱلصَّالِحَاتِ } الدالة على إخلاصهم ويقينهم ونياتهم { وَ } مع ذلك { تَوَاصَوْاْ بِٱلْحَقِّ } أي: أوصى بعضهم بعضاً لسلوك طريق الحق وتوحيده وَتَوَاصَوْاْ } أيضاً { بِٱلصَّبْرِ } [العصر: 3] على مشاق الطاعات ومتاعب الرياضات الطارئة عليهم، من قطع المألوفات الإماكنية، وترك اللذات البهيمية اللازمة للقوى البشرية\n\n\n\n\nوفقنا الله على قلعها وقطعها\n\n\n\n\nخاتمة السورة\n\n\n\nعليكم أيها المحمدي القاص لقطع العلائق الإمكانية أن تتصبر على عموم البلوى العارضة لك في نشأتك الأولى، وتسترجع إلى الله في جميعها، وتسنده إليه سبحانه أولاً وبالذات بلا رؤية الوسائل في البين، وتوطن قلبك مع ربك في جميع حالاتك، وترضى عن الله في عموم ما جرى عليك في مقتضيات قضائه، وبالجملة: كن فانياً في الله تفز بخير الدارين وفلاح النشأتين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "90:17",
      "similarity": 0.8466857824695473
    },
    {
      "verse": "36:50",
      "similarity": 0.6244525422872879
    },
    {
      "verse": "51:53",
      "similarity": 0.5947132124957406
    },
    {
      "verse": "6:153",
      "similarity": 0.49413389452351897
    },
    {
      "verse": "29:8",
      "similarity": 0.45653293683784113
    }
  ]
}