{
  "chapter": "العصر",
  "text": "الا الذين ءامنوا۟ وعملوا۟ الصلحت وتواصوا۟ بالحق وتواصوا۟ بالصبر",
  "translations": [
    {
      "translation": "except for those who have iman and do right actions and urge each other to the truth and urge each other to steadfastness.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe, and do good and enjoin truth on one another, and enjoin one another to bear with fortitude (the trials that befall).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save those who have faith and do righteous deeds, and counsel each other to hold on to truth and counsel each other to be steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except the righteously striving believers who exhort each other to truthful purposes and to patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who accepted faith, and did good deeds and urged one another to the truth – and urged one another to have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe and do righteous deeds, and recommend one another to the truth, and recommend one another to patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe and do good, and enjoin on each other truth, and enjoin on each other patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save those who believe, and do righteous deeds, and counsel each other unto the truth, and counsel each other to be steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those who believe and do good works, and exhort one another to truth and exhort one another to endurance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except for those who believe and do good deeds and exhort one another to hold fast to the Truth, and who exhort one another to stead-fastness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But not those who themselves believe and work righteous works, and enjoin upon each other the truth, and enjoin upon each other endurance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who have faith and do righteous deeds, and enjoin one another to [follow] the truth, and enjoin one another to patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except such as have Faith, and do righteous deeds, and (join together) in the mutual teaching of Truth, and of Patience and Constancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe (in Islamic Monotheism) and do righteous good deeds, and recommend one another to the truth (i.e. order one another to perform all kinds of good deeds (Al-Ma'ruf) which Allah has ordained, and abstain from all kinds of sins and evil deeds (Al-Munkar) which Allah has forbidden), and recommend one another to patience (for the sufferings, harms, and injuries which one may encounter in Allah's Cause during preaching His religion of Islamic Monotheism or Jihad, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who believe and do good works and charge one another with the truth and charge one another with patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe, and do good works, and encourage truth, and recommend patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who have believed and done righteous deeds and advised each other to truth and advised each other to patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[103:3] except those who believe and perform righteous deeds, they are not in [a state of] loss, and enjoin one another to [follow] the truth, faith, and enjoin one another to patience, in [maintaining] obedience and in refraining from [acts of] disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِلَّا الَّذِينَ آَمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ (3)وأعقب بالاستثناء بقوله : { إلا الذين آمنوا } الآية فيتقرر الحكم تاماً في نفس السامع مبيناً أن الناس فريقان : فريق يلحقه الخسران ، وفريق لا يلحقه شيء منه ، فالذين آمنوا وعملوا الصالحات لا يلحقهم الخسران بحال إذا لم يتركوا شيئاً من الصالحات بارتكاب أضدادها وهي السيئات .ومن أكبر الأعمال الصالحات التوبة من الذنوب لمقترفيها ، فمن تحقق فيه وصف الإِيمان ولم يعمل السيئات أو عملها وتاب منها فقد تحقق له ضد الخسران وهو الربح المجازي ، أي حسن عاقبة أمره ، وأما من لم يعمل الصالحات ولم يتب من سيئاته فقد تحقق فيه حكم المستثنى منه وهو الخسران .وهذا الخسر متفاوت فأعظمه وخالده الخسر المنجر عن انتفاء الإِيمان بوحدانية الله وصدق الرسول صلى الله عليه وسلم ودون ذلك تكونُ مراتب الخسر متفاوتة بحسب كثرة الأعمال السيئة ظاهرها وباطنها . وما حدده الإِسلام لذلك من مراتب الأعمال وغفران بعض اللمم إذا ترك صاحبه الكبائر والفواحشَ وهو ما فسر به قوله تعالى : { إن الحسنات يذهبن السيئات } \\[ هود : 114 \\] .وهذا الخبر مراد به الحصول في المستقبل بقرينة مقام الإِنذار والوعيد ، أي لفي خسر في الحياة الأبدية الآخرة فلا التفات إلى أحوال الناس في الحياة الدنيا ، قال تعالى : { لا يغرنك تقلب الذين كفروا في البلاد متاع قليل ثم مأواهم جهنم وبئس المهاد } \\[ آل عمران : 196 ، 197 \\] .وتنكير { خسر } يجوز أن يكون للتنويع ، ويجوز أن يكون مفيداً للتعظيم والتعميم في مقام التهويل وفي سياق القسَم .والمعنى : إن الناس لفي خسران عظيم وهم المشركون .والتعريف في قوله : { الصالحات } تعريف الجنس مراد به الاستغراق ، أي عملوا جميع الأعمال الصالحة التي أمروا بعملها بأمر الدين وعَمل الصالحات يشمل ترك السيئات . وقد أفاد استثناء المتصفين بمضمون الصلة ومعطوفها إيماء إلى علة حكم الاستثناء وهو نقيض الحكم الثابت للمستثنى منه فإنهم ليسوا في خسر لأجل أنهم آمنوا وعملوا الصالحات .فأما الإِيمان فهو حقيقة مقُول على جزئياتها بالتواطىء . وأما الصالحات فعمومها مقول عليه بالتشكك ، فيشير إلى أن انتفاء الخسران عنهم يتقدر بمقدار ما عملوه من الصالحات وفي ذلك مراتب كثيرة .وقد دل استثناء الذين آمنوا وعملوا الصالحات من أن يكونوا في خُسر على أن سبب كون بقية الإِنسان في خسر هو عدم الإِيمان والعمل الصالح بدلالة مفهوم الصفة . وعُلم من الموصول أن الإِيمان والعمل الصالح هما سبب انتفاء إحاطة الخسر بالإِنسان .وعُطف على عَمل الصالحات التواصي بالحق والتواصي بالصبر وإن كان ذلك من عمل الصالحات ، عَطْف الخاص على العام للاهتمام به لأنه قد يُغفل عنه ، يُظن أن العمل الصالح هو ما أثرُه عمل المرء في خاصته ، فوقع التنبيه على أن من العمل المأمور به إرشادَ المسلم غيره ودعوتَه إلى الحق ، فالتواصي بالحق يشمل تعليم حقائق الهدى وعقائد الصواب وإراضة النفس على فهمها بفعل المعروف وترك المنكر .والتواصي بالصبر عطف على التواصي بالحق عطف الخاص على العام أيضاً وإن كان خصوصه خصوصاً من وجهٍ لأن الصبر تحمَّل مشقة إقامة الحق وما يعترض المسلم من أذى في نفسه في إقامة بعض الحق .وحقيقة الصبر أنه : منع المرء نفسه من تحصيل ما يشتهيه أو من محاولة تحصيله ( إن كان صعبَ الحصول فيترك محاولة تحصيله لخوْف ضر ينْشأ عن تناوله كخوف غضب الله أو عقاب ولاة الأمور ) أو لرغبة في حصول نفع منه ( كالصبر على مشقة الجهاد والحج رغبة في الثواب والصبر على الأعمال الشاقة رغبة في تحصيل مال أو سمعة أو نحو ذلك ) .ومن الصبر الصبر على ما يلاقيه المسلم إذا أمَرَ بالمعروف من امتعاض بعض المأمورين به أو مِن أذاهم بالقول كمن يقول لآمره : هَلاّ نظرت في أمر نفسك ، أو نحو ذلك .وأما تحمل مشقة فعل المنكرات كالصبر على تجشّم السهر في اللهو والمعاصي ، والصبر على بشاعة طعم الخمر لشاربها ، فليس من الصبر لأن ذلك التحمل منبعث عن رجحان اشتهاء تلك المشقة على كراهية المشقة التي تعترضه في تركها .وقل اشتمل قوله تعالى : { وتواصوا بالحق وتواصوا بالصبر } على إقامة المصالح الدينية كلها ، فالعقائد الإِسلامية والأخلاق الدينية مندرجة في الحق ، والأعمال الصالحة وتجنب السيئات مندرجة في الصبر .والتخلق بالصبر ملاك فضائل الأخلاق كلها فإن الارتياض بالأخلاق الحميدة لا يخلو من حمل المرء نفسه على مخالفة شهوات كثيرة ، ففي مخالفتها تعب يقتضي الصبرَ عليه حتى تصير مكارم الأخلاق ملكه لمن راض نفسه عليها ، كما قال عمرو بن العاص: ... إذا المرءُ لم يَترُكْ طعاماً يُحبُّهولم يَنْهَ قلباً غاوياً حيثُ يمَّما ... فيوشِك أن تُلفَى له الدَّهرَ سُبّةٌإذا ذُكِرَتْ أمثالُها تَمْلأ الفَمَا ... وكذلك الأعمال الصالحة كلها لا تخلو من إكراه النفس على ترك ما تميل إليه . وفي الحديث : \" حُفَّت الجنة بالمكارِهِ وحُفّت النار بالشهوات \" . وعن علي بن أبي طالب : «الصبر مطية لا تكبو» .وقد مضى الكلام على الصبر مشبعاً عند قوله تعالى : { استعينوا بالصبر والصلاة } في سورة البقرة ( 45 ) .وأفادت صيغة التواصي بالحق وبالصبر أن يكون شأن حياة المؤمنين قائماً على شيوع التآمر بهما ديدناً لهم ، وذلك يقتضي اتصاف المؤمنين بإقامة الحق وصبرهم على المكاره في مصالح الإِسلام وأمته لما يقتضيه عرف الناس من أن أحداً لا يوصي غيره بملازمة أمر إلا وهو يرى ذلك الأمر خليقاً بالملازمة إذ قلّ أن يُقدم أحد على أمر بحق هو لا يفعله أو أمر بصبر وهو ذو جزع ، وقد قال الله تعالى توبيخاً لبني إسرائيل : { أتأمرون الناس بالبر وتنسون أنفسكم وأنتم تتلون الكتاب أفلا تعقلون } \\[ البقرة : 44 \\] ، وقد تقدم هذا المعنى عند قوله تعالى : { ولا تحاضون على طعام المسكين } في سورة الفجر ( 18 ) .\n\n",
      "translations": [
        {
          "translation": "(Save those who believe) in Muhammad (pbuh) and the Qur'an (and do good works) and do acts of obedience privately between them and their Lord, (and exhort one another to truth) to belief in Allah's divine Oneness; and it is said to the Qur'an (and exhort one another to endurance) in performing the obligations imposed by Allah and in avoiding transgressions and also in enduring misfortunes and calamities, because the believers are unlike the disbelievers'. And of the surah in which the Traducers are mentioned, which is all Meccan and consists of 9 verses, 84 words and 161 letters: Surah 104: The Traducers (al-Humazah) And of the surah in which the Traducers are mentioned, which is all Meccan and consists of 9 verses, 84 words and 161 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَوَاصَوْاْ بِٱلْحَقِّ وَتَوَاصَوْاْ بِٱلصَّبْرِ } معناه تَحاثُوا عليهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - exalted be He - \"And enjoin upon one another truth and enjoin upon one another patience\" - its meaning is that you should exhort one another to it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أي: اكتسبوها فربحوا بزيادة النور الكمالي على النور الاستعدادي الذي هو رأس مالهم { وتواصوا بالحق } أي: الثابت الدائم الباقي على حاله أبداً من التوحيد والعدل\n أي: التوحيد الذاتي والوصفي والفعلي فإنه الحق الثابت فحسب { وتواصوا بالصبر } معه وعليه عن كل ما سواه بالتمكين والاستقامة\n فإن الوصول إلى الحق سهل\n وأما البقاء عليه والصبر معه بالاستقامة في العبودية فأعزّ من الكبريت الأحمر والغراب الأبيض\n فالفحوى أن نوع الإنسان في خسر إلا الكاملين في العلم والعمل\n المكملين بهما\n ويجوز أن يؤخذ العصر بمعنى المصدر من عصر يعصر أي: وعصر الله الإنسان بالبلاء والمجاهدة والرياضة حتى تصفو نقاوته\n إن الإنسان الباقي مع الثفل الواقف مع حجاب البشرية في خسر إلا الذين اتصفوا بالعلم والعمل وتواصوا بالحق الثابت الذي هو الاعتقاد اليقيني اللازم للصفاوة الباقية بعد ذهاب الثفل وتواصوا بالصبر على العصر والانعصار بالبلاء والرياضة\n ولهذا قال عليه السلام:\n \" البلاء موكل بالأنبياء ثم الأولياء ثم الأمثل فالأمثل \" \n\n وقال:\n \" البلاء سوط من سياط الله يسوق به عباده إليه \"\n ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتفطنوا باستقلاله في التصرفات الجارية في ملكه وملكوته { وَ } مع الإيمان والإذعان { عَمِلُواْ ٱلصَّالِحَاتِ } الدالة على إخلاصهم ويقينهم ونياتهم { وَ } مع ذلك { تَوَاصَوْاْ بِٱلْحَقِّ } أي: أوصى بعضهم بعضاً لسلوك طريق الحق وتوحيده وَتَوَاصَوْاْ } أيضاً { بِٱلصَّبْرِ } [العصر: 3] على مشاق الطاعات ومتاعب الرياضات الطارئة عليهم\n من قطع المألوفات الإماكنية\n وترك اللذات البهيمية اللازمة للقوى البشرية\n\n\nوفقنا الله على قلعها وقطعها\n\n\nخاتمة السورة\n\nعليكم أيها المحمدي القاص لقطع العلائق الإمكانية أن تتصبر على عموم البلوى العارضة لك في نشأتك الأولى\n وتسترجع إلى الله في جميعها\n وتسنده إليه سبحانه أولاً وبالذات بلا رؤية الوسائل في البين\n وتوطن قلبك مع ربك في جميع حالاتك\n وترضى عن الله في عموم ما جرى عليك في مقتضيات قضائه\n وبالجملة: كن فانياً في الله تفز بخير الدارين وفلاح النشأتين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { وتواصَوْا بالحق } بيان لتكميلهم لغيرهم\n أي: وصَّى بعضُهم بعضاً بالأمر الثابت\n الذي لا سبيل إلى إنكاره ولا زوال في الدارين لمحاسن آثاره\n وهو الخير كله\n من الإيمان بالله عزّ وجل\n واتباع كتبه ورسله في كل عقد وعمل\n { وتواصَوْا بالصبرِ } عن المعاصي التي تُساق إليها النفس الأمّارة\n وعلى الطاعة التي يشق عليها أداؤها\n وعلى البلية التي تتوجه إليه من جهة قهريته تعالى\n وعلى النعمة بالقيام بتمام شكرها\n وتخصيص هذا التواصي بالذكر\n مع اندراجه تحت التواصي بالحق لإبراز كمال الاعتناء به\n أو: لأن الأول عبارة عن رتبة العبادة\n التي هي فعل ما يُرضي الله عزّ وجل\n والثاني عن العبودية التي هي الرضا بما فعل اللهُ تعالى\n فإنَّ المراد ليس مجرد حبس النفس عمّا تتوق إليه من فعلٍ وترك\n بل هو تلقي ما يَرِد منه تعالى بالجميل والرضا ظاهراً وباطناً\n قاله أبو السعود\n الإشارة: والعصر\n أي: عصر الذاكرين\n إنَّ الإنسان لفي خُسر\n حيث احتجب عن ربه بنفسه وبرؤيته وجوده\n إلاّ الذين آمنوا إيمان الخصوص\n وعملوا عمل الخصوص\n وهو خرق العوائد واكتساب الفوائد\n حتى وصلوا إلى كشف الحجاب\n فلم يروا مع الله غيره\n غابوا عن أنفسهم\n وعن وجودهم ووجود غيرهم في شهود محبوبهم فلمّا تكملوا اشتغلوا بتكميل غيرهم\n كما قال تعالى: { وتواصَوْا بالحق } أي: بفعل الحق\n وهو ما يثقل على النفس حتى لا يثقل عليها شيء\n أو بالإقبال على الحق\n وتواصَوْا على مشاق السير\n ثم على عكوف الهم في حضرة الحق\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله وصحبه\n وسلّم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "90:17",
      "similarity": 0.8466857824695473
    },
    {
      "verse": "36:50",
      "similarity": 0.6244525422872879
    },
    {
      "verse": "51:53",
      "similarity": 0.5947132124957406
    },
    {
      "verse": "6:153",
      "similarity": 0.49413389452351897
    },
    {
      "verse": "29:8",
      "similarity": 0.45653293683784113
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/103003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/103003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/103:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}