{
  "chapter": "العصر",
  "text": "والعصر",
  "translations": [
    {
      "translation": "By the Late Afternoon,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "TIME AND AGE are witness\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the time!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the time (of the advent of Islam),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By oath of this era of yours (O dear Prophet Mohammed – peace and blessings be upon him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Al-`Asr.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by the time,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the afternoon!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the declining day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by the passage of time,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the time,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Time!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By (the Token of) Time (through the ages),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Al-'Asr (the time).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the time of the afternoon!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By time,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[103:1] By Time! — or [it ‘asr can mean the period] from the declining of the sun to sunset, or [it may denote] the afternoon prayer.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَالْعَصْرِ (1) أقسم الله تعالى بالعصر قسماً يراد به تأكيد الخبر كما هو شأن أقسام القرآن .والمقسَم به من مظاهر بديع التكوين الرباني الدال على عظيم قدرته وسعة علمه .وللعصر معاننٍ يتعين أن يَكون المراد منها لا يعدو أن يكون حالة دالة على صفة من صفات الأفعال الربانية ، يتعين إما بإضافته إلى ما يُقدر ، أو بالقرينة ، أو بالعهد ، وأيَّاً ما كان المرادُ منه هنا فإن القسم به باعتبار أنه زمن يذكِّر بعظيم قدرة الله تعالى في خلق العالم وأحواله ، وبأمور عظيمة مباركة مثل الصلاة المخصوصة أو عصرٍ معين مبارك .وأشهر إطلاق لفظ العصر أنه علَم بالغلبة لوقتتٍ ما بين آخر وقت الظهر وبين اصفرار الشمس فمبدؤه إذا صار ظل الجسم مثلَه بعد القَدْر الذي كان عليه عند زوال الشمس ويمتد إلى أن يصير ظلُّ الجسم مثلَيْ قدرِه بعد الظل الذي كان له عند زوال الشمس . وذلك وقت اصفرار الشمس ، والعصر مبدأ العشيّ . ويعقبه الأصيل والاحمرار وهو ما قبل غروب الشمس ، قال الحارث بن حِلزة :آنستْ نبأة وأفزَعها القَنَّ ... اصُ عَصراً وقَدْ دَنَا الإِمساءفذلك وقت يؤذن بقرب انتهاء النهار ، ويذكر بخلقة الشمس والأرض ، ونظام حركة الأرض حول الشمس ، وهي الحركة التي يتكون منها الليل والنهار كل يوم وهو من هذا الوجه كالقسم بالضحى وبالليل والنهار وبالفجر من الأحوال الجوية المتغيرة بتغير توجه شعاع الشمس نحو الكرة الأرضية .وفي ذلك الوقت يتهيأ الناس للانقطاع عن أعمالهم في النهار كالقيام على حقولهم وجنَّاتهم ، وتجاراتهم في أسواقهم ، فيذكر بحكمة نظام المجتمع الإِنساني وما ألهم الله في غريزته من دأب على العمل ونظاممٍ لابتدائه وانقطاعه . وفيه يتحفز الناس للإِقبال على بيوتهم لمبيتهم والتأنس بأهليهم وأولادهم . وهو من النعمة أو من النعيم ، وفيه إيماء إلى التذكير بمَثَل الحياة حين تدنو آجال الناس بعد مضي أطوار الشباب والاكتهال والهَرم .وتعريفه باللام على هذه الوجوه تعريف العهد الذهني أي كل عَصْر .ويطلق العصر على الصلاة الموقتة بوقت العَصر . وهي صلاة معظمة . قيل : هي المراد بالوسطى في قوله تعالى : { حافظوا على الصلوات والصلاة الوسطى } \\[ البقرة : 238 \\] . وجاء في الحديث : « من فاتته صلاة العصر فكأنما وُتِرَ أهلَه ومالَه » . وورد في الحديث الصحيح : « ثلاثة لا يكلمهم الله يوم القيامة » فذَكَر « ورجل حلف يميناً فاجرة بعد العصر على سلعة لقد أعطي بها ما لم يُعْطَ » وتعريفه على هذا تعريف العهد وصار علَماً بالغلبة كما هو شأن كثير من أسماء الأجناس المعرفة باللام مثل العَقَبَة .ويطلق العصر على مدة معلومة لوجود جِيل من الناس ، أو مَلِك أو نبيء ، أو دين ، ويعيَّن بالإِضافة ، فيقال : عصر الفِطَحْل ، وعصر إبراهيم ، وعصر الإِسكندر ، وعصر الجاهلية ، فيجوز أن يكون مراد هذا الإِطلاق هنا ويكون المعنيّ به عصرَ النبي صلى الله عليه وسلم والتعريف فيه تعريف العهد الحضوري مثل التعريف في ( اليوم ) من قوْلك : فعلت اليوم كذا ، فالقسم به كالقسم بحياته في قوله تعالى :{ لعمرك } \\[ الحجر : 72 \\] . قال الفخر : فهو تعالى أقسم بزمانه في هذه الآية وبمكانه في قوله تعالى : { وأنت حل بهذا البلد } \\[ البلد : 2 \\] وبعمره في قوله : { لعمرك } . اه .ويجوز أن يراد عصر الإِسلام كلِه وهو خاتمة عصور الأديان لهذا العالم وقد مثَّل النبي صلى الله عليه وسلم عصر الأمة الإِسلامية بالنسبة إلى عصر اليهود وعصر النصارى بما بعد صلاة العصر إلى غروب الشمس بقوله : « مثل المسلمين واليهود والنصارى كمثل رجل استأجر أجراء يعملون له يوماً إلى الليل فعملت اليهود إلى نصف النهار ثم قالوا : لا حاجة لنا إلى أجرك وما عملنا باطل ، واستأجر آخرين بعدهم فقال : أكملوا بقية يومكم ولكم الذي شرطت لهم فعملوا حتى إذا كان حين صلاة العصر قالوا : لك ما عملنا باطل ولك الأجر الذي جعلتَ لنا ، واستأجر قوماً أن يعملوا بقيةَ يومهم فعملوا حتى غابت الشمس واستكملوا أجر الفريقين كليهما فأنتم هُم » . فلعل ذلك التمثيل النبوي له اتصال بالرمز إلى عصر الإِسلام في هذه الآية .ويجوز أن يفسر العصر في هذه الآية بالزمان كله ، قال ابن عطية : قال أبي بن كعب : سألت رسول الله صلى الله عليه وسلم عن العصر فقال : أقسم ربكم بآخر النهار . وهذه المعاني لا يفي باحتمالها غير لفظ العصر .ومناسبة القَسَم بالعَصر لغرض السورة على إرادة عصر الإِسلام ظاهرة فإنها بينت حال الناس في عصر الإِسلام بين مَن كفر به ومن آمن واستوفى حظه من الأعمال التي جاء بها الإِسلام ، ويعرف منه حالُ من أسلموا وكان في أعمالهم تقصير متفاوت ، أما أحوال الأمم التي كانت قبل الإِسلام فكانت مختلفة بحسب مجيء الرسل إلى بعض الأمم ، وبقاء بعض الأمم بدون شرائع متمسكة بغير دين الإِسلام من الشرك أو بدين جاء الإِسلام لنسخه مثل اليهودية والنصرانية قال تعالى : { من يبتغ غير الإسلام ديناً فلن يقبل منه وهو في الآخرة من الخاسرين } في سورة آل عمران ( 85 ) .وتعريف الإنسان } تعريف الجنس مراد به الاستغراق وهو استغراق عرفي لأنه يستغرق أفراد النوع الإِنساني الموجودين في زمن نزول الآية وهو زمن ظهور الإِسلام كما علمت قريباً . ومخصوص بالناس الذين بلغتهم الدعوة في بلاد العالم على تفاوتها . ولما استُثني منه الذين آمنوا وعملوا الصالحات بقي حكمه متحققاً في غير المؤمنين كما سيأتي . . .والخُسر : مصدر وهو ضد الربح في التجارة ، استعير هنا لسوء العاقبة لمن يظن لنفسه عاقبةً حسنة ، وتلك هي العاقبة الدائمة وهي عاقبة الإِنسان في آخرته من نعيم أو عذاب .وقد تقدم في قوله تعالى { فما ربحت تجارتهم } في سورة البقرة ( 16 ) وتكررت نظائره من القرآن آنفاً وبَعيداً .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said about the interpretation of Allah's saying (By the declining day): (By the declining day) Allah swears by the 'Asr prayer; and it is also said by the hardships of time,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nعن أبي خالد عن الإِمام زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَٱلْعَصْرِ إِنَّ ٱلإِنسَانَ لَفِى خُسْرٍ } فالعَصرُ: الدَّهرُ\n والعَصرانُ: الغَداةُ والعِشيُّ\n والإِنسانُ: في مَعنى الجَمع\n والخُسُرُ: النُقصُانُ\n\n",
      "translations": [
        {
          "translation": "\n\nThis is from Abu Khalid from Imam Zaid ibn Ali, peace be upon them, in his saying, \"Indeed, man is in loss,\" {And [by] time. Indeed, mankind is in loss} [Qur'an, 103:1-2]. So time is the life of this world.\n\n\nAnd the two 'Asr prayers: the morning prayer and the afternoon prayer.\n\n\nAnd mankind: in the sense of the collective.\n\n\nAnd the loser: the shortfall",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nأقسم بالعصر أي: بامتداد بقاء الزمان وما فيه وما يحدث معه بمبدعه وعلّته الذي هو الدهر\n الناس يضيفون تغيرات الأمور والأحوال إليه ويجعلونه مؤثراً فيه عقولهم:\n[الجاثية\n الآية:24]\n والمؤثر بالحقيقة هو الله تعالى كما قال عليه السلام:\n \" لا تسبّوا الدهر فإنّ الله هو الدهر \" \n\n تعظيماً له لظهوره تعالى بصفاته وأفعاله في مظهره على أن المحجوب به عنه في خسر وهو الإنسان لخسارته برأس ماله الذي هو نور الفطرة والهداية الأصلية من الاستعداد الأزليّ باختيار الحياة الدنيا واللذات الفانية والاحتجاب بها وبالدهر وإضاعة الباقي في الفاني\n { إلاَّ الذين آمنوا } بالله الإيمان العلمي اليقيني وعرفوا أن لا مؤثر إلا الله وبرزوا عن حجاب الدهر { وعملوا الصالحات } الباقيات من الفضائل والخيرات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلْعَصْرِ } [العصر: 1] أقسم سبحانه بالعصر والدهر الذي هو عبارة عن بقاء الوجود الأزلي الأبدي ودوامه السرمدي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { والعَصْرِ } أقسم تعالى بصلاة العصر لفضلها الباهر\n إذ قيل: هِي الصلاة الوسطى\n أو: بالعشيِّ الذي هو مابين الزوال والغروب\n كما أقسم بالضُحى\n أو بعصر النبوة\n لظهور فضله على سائر الأعصار\n أو بالدهر مطلقاً لانطوائه على تعاجيب الأمور النافعة والضارة\n وجوابه: { إِنَّ الإِنسانَ لفي خُسْرٍ } لفي خسران في متاجرهم ومساعيهم\n وصرف أعمارهم في حظوظهم وأمانيهم\n { إلاَّ الذين آمنوا وعملوا الصالحات } فإنهم اشتروا الآخرة بالدنيا\n فربحوا وسعدوا\n أو: فإنهم في تجارةٍ لن تبور\n حيث باعوا الفاني الخسيس\n وآثروا الباقي النفيس\n واستبدلوا الباقيات الصالحات بالعاديات الرائحات فيا لها من صفقة ما أربحها!\n وهذا بيان لتكميلهم لأنفسهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:49",
      "similarity": 0.4953968957441658
    },
    {
      "verse": "2:266",
      "similarity": 0.4182396061697694
    },
    {
      "verse": "78:14",
      "similarity": 0.2819732363436916
    },
    {
      "verse": "12:36",
      "similarity": 0.21185990582968686
    },
    {
      "verse": "99:3",
      "similarity": 0.004532621918838009
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/103001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/103001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/103:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}