{
  "chapter": "الفيل",
  "text": "فجعلهم كعصف ماكولۭ",
  "translations": [
    {
      "translation": "And turned them into pastured fields of corn?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and made them like straw eaten up (by cattle).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to turn them into (something) like the left-over grass grazed by cattle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He made them like the leftover devoured leaves of farms?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He made them like `Asf, Ma'kul.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He rendered them like straw eaten up?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He made them like green blades devoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made them like green crops devoured (by cattle)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus He made them like stubble cropped by cattle?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then He rendered them as stubble devoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "thus making them like chewed-up straw?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then did He make them like an empty field of stalks and straw, (of which the corn) has been eaten up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made them like an empty field of stalks (of which the corn has been eaten up by cattle).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He made them like straw eaten (by cattle).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leaving them like chewed-up leaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He made them like eaten straw.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[105:5] thus making them like devoured blades?, like the leaves of crops which have been consumed, trampled and destroyed by animals. God destroyed each one of them with his own stone, inscribed with his name, larger than a lentil [in size] but smaller than a chick-pea, able to pierce through an egg, a man, or an elephant and go through the ground. This took place in the year of the Prophet’s birth (s).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And made them like green crops devoured) by worms?' And of the surah in which Quraysh is mentioned, which is all Meccan and consists of 4 verses, 17 words and 73 letters: Surah 106: Quraysh And of the surah in which Quraysh is mentioned, which is all Meccan and consists of 4 verses, 17 words and 73 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَجَعَلَهُمْ } من كثرة ما ترميهم بها { كَعَصْفٍ مَّأْكُولٍ } [الفيل: 5] أي: كتبن يأكله الأنعام وتروث به، فتفرقه الرياح؛ أي: صاروا من شدة غضب الله إياهم هباءً منثوراً\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها السالك الخائف من بطش الله، المتحترز عن مقتضى قهره وجلاله أن تكون في عموم أحوالك وأطوارك بين الخوف والرجاء عن جلال الله وجماله، بحيث لا يجري عليك نفَس من أنفاسك، وأنت فيه خالٍ عن كلا النقيضين\n\n\n\n\nوبالجملة: لا تيأس من روح الله، ولا تتكل على كرمه، فاعلم أنه سبحانه يرقبك في حالاتك، ويعلم منك ما لم تعلم من نفسك، فكن المخلصين ولا تكن من القانطين، فإن ناقدك خبير بصير\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فجعلهم كعَصْفٍ مأكولٍ } كورَق زرع وقع فيه الأكل، أي: أكلته الدود، أو: كَتِبن أكلته الدواب فراثته، فجمع لهم الخسة والمهانة والتلف، أو: كتبن علفته الدواب وشتته\n فائدة: قال الغزالي عن غير واحد من الصالحين وأرباب القلوب: إنه مَن قرأ في ركعتي الفجر في الأولى بالفاتحة و \" ألم نشرح \" ، والثانية بالفاتحة و \" ألم تر \" قََصرت يد كُل عدو عنه، ولو يُجعل لهم إليه سبيلاً قال: وهذا صحيح لا شك فيه\n ذكره في الجواهر\n الإشارة: قلب العارف هو كعبة الوجود، وهو بيت الرب، وجيوش الخواطر والوساوس تطلب تخريبه، فيحميه اللهُ منهم، كما حمى بيتَه من أبرهة، فيقال: ألم ترَ أيها السامع كيف فعل ربك بأصحاب الفيل، وهم الأخلاق البهيمية والسبعية، والخواطر الردية، ألم يجعل كيدهم في تضليل، وأرسل عليهم طير الواردات الإلهية، فرمتهم بحجارة الأذكار وأنوار الأفكار، فأسْحقتهم فجعلتهم كعصفٍ مأكول\n والله تعالى أعلم، وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ]
}