{
  "chapter": "الفيل",
  "text": "الم تر كيف فعل ربك باصحب الفيل",
  "translations": [
    {
      "translation": "Do you not see what your Lord did with the Companions of the Elephant?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "HAVE YOU NOT seen how your Lord dealt with the people of the elephants?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how your Lord dealt with the people of the elephants?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered how your Lord dealt with the people of the elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him), did you not see how did your Lord deal with the People of the Elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how your Lord dealt with the Owners of the Elephant\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered how your Lord dealt with the possessors of the elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how thy Lord did with the Men of the Elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how thy Lord dealt with the owners of the Elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how your Lord dealt with the people of the elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not observed what wise thy Lord dealt with the fellows of the elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded how your Lord dealt with the army of the elephants?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not how thy Lord dealt with the Companions of the Elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you (O Muhammad (Peace be upon him)) not seen how your Lord dealt with the Owners of the Elephant? [The elephant army which came from Yemen under the command of Abrahah Al-Ashram intending to destroy the Ka'bah at Makkah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how Allah dealt with the companions of the Elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered how your Lord dealt with the People of the Elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered, [O Muhammad], how your Lord dealt with the companions of the elephant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[105:1] Have you not considered (an interrogative meant to provoke marvel, in other words, ‘marvel at’) the way in which your Lord dealt with the Men of the Elephant?, who was named Mahmūd, and the men were Abraha, King of Yemen and his troops. He had built a church in San‘ā’ in order to divert pilgrims away from Mecca to it. A man from among the Banū Kināna defecated in it and stained its prayer niche with a deflowered virgin’s blood, in contempt of it. Abraha then swore that he would knock down the Ka‘ba. So he approached Mecca with his troops riding Yemeni elephants with Mahmūd at the vanguard. But when they turned to destroy the Ka‘ba, God unleashed upon them what He relates in His words:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ (1)استفهام تقريري وقد بيّنّا غير مرة أن الاستفهام التقريري كثيراً ما يكون على نفي المقرَّر بإثباته للثقة بأن المقرَّر لا يسعه إلا إثبات المنفي وانظر عند قوله تعالى : { ألم تر إلى الذين خرجوا من ديارهم } في سورة البقرة ( 243 ) . والاستفهام التقريري هنا مجاز بعلاقة اللزوم وهو مجاز كثر استعماله في كلامهم فصار كالحقيقة لشهرته . وعليه فالتقرير مستعمل مجازاً في التكريم إشارة إلى أن ذلك كان إرهاصاً للنبيء فيكون من باب قوله : { لا أقسم بهذا البلد وأنت حل بهذا البلد } \\[ البلد : 1 ، 2 \\] ، وفيه مع ذلك تعريض بكفران قريش نعمة عظيمة من نعم الله عليهم إذ لم يزالوا يعبدون غيره .والخطاب للنبيء صلى الله عليه وسلم كما يقتضيه قوله : { ربك } . فمهيع هذه الآية شبيه بقوله تعالى : { ألم يجدك يتيماً فآوى } \\[ الضحى : 6 \\] الآيات وقوله : { لا أقسم بهذا البلد وأنت حل بهذا البلد } \\[ البلد : 1 ، 2 \\] على أحد الوجوه المتقدمة .فالرؤية يجوز أن تكون مجازية مستعارة للعلم البالغ من اليقين حد الأمر المرئي لتواتر ما فعل الله بأصحاب الفيل بين أهل مكة وبقاء بعض آثار ذلك يشاهدونه . وقال أبو صالح : رأيت في بيت أم هاني بنتتِ أبي طالب نحواً من قفيزين من تلك الحجارة سُوداً مخططة بحمرة . وقال عتاب بن أسِيدْ : أدركت سائس الفيل وقائده أعميين مُقْعَدين يستطعمان الناس . وقالت عائشة : لقد رأيْتُ قائد الفيل وسائقه أعمَيين يستطعمان الناس . وفعل الرؤية معلق بالاستفهام .ويجوز أن تكون الرؤية بصرية بالنسبة لمن تجاوز سنهُ نيفاً وخمسين سنة عند نزول الآية ممن شهد حادث الفيل غلاماً أو فتى مثل أبي قحافة وأبي طالب وأبي بن خلف .و { كيف } للاستفهام سَدّ مسدّ مفعوليْ أو مفعول { تَر } ، أي لم تر جواب هذا الاستفهام ، كما تقول : علمتُ هل زيد قائم؟ وهو نصب على الحال من فاعل { تَر } . ويجوز أن يكون { كيف } مجرداً عن معنى الاستفهام مراداً منه مجرد الكيفية فيكون نصباً على المفعول به .وإيثار { كيف } دون غيره من أسماء الاستفهام أو الموصول فلم يقل : ألم تر ما فعل ربك ، أو الذي فعل ربك ، للدلالة على حالة عجيبة يستحضرها من يعلم تفصيل القصة .وأوثر لفظ { فعل ربك } دون غيره لأن مدلول هذا الفعل يعم أعمالاً كثيرة لا يدل عليها غيره .وجيء في تعريف الله سبحانه بوصف ( رب ) مضافاً إلى ضمير النبي صلى الله عليه وسلم إيماء إلى أن المقصود من التذكير بهذه القصة تكريم النبي صلى الله عليه وسلم إرهاصاً لنبوءته إذ كان ذلك عام مولده .وأصحاب الفيل : الحَبشة الذين جاءوا مكة غازين مضمِرين هدم الكعبة انتقاماً من العرب من أجل ما فعله أحد بني كنانة الذين كانوا أصحاب النسيء في أشهر الحج .وكان خبر ذلك وسببه أن الحبشة قد ملكوا اليمن بعد واقعة الأخدود التي عَذَّب فيها الملكُ ذو نواس النصارى ، وصار أمير الحبشة على اليمن رجلاً يقال له : ( أبرهة ) وأن أبرهة بنى كنيسة عظيمة في صنعاء دعاها القَلِيس ( بفتح القاف وكسر اللام بعدما تحتية ساكنة ، وبعضهم يقولها بضم القاف وفتح اللام وسكون التحتية ) . وفي «القاموس» بضم القاف وتشديد اللام مفتوحة وسكون الياء . وكتبه السهيلي بنون بعد اللام ولم يضبطه وزعم أنه اسم مأخوذ من معاني القَلْس للارتفاع . ومنه القلنسوة واقتصر على ذلك ولم أعرف أصل هذا اللفظ فإما أن يكون اسم جنس للكنيسة ولعل لفظ كنيسة في العربية معرّب منه ، وإما أن يكون علماً وضعوه لهذه الكنيسة الخاصة وأراد أن يصرف حج العرب إليها دون الكعبة فروي أن رجلاً من بني فُقَيم من بني كنانة وكانوا أهل النسيء للعرب كما تقدم عند قوله تعالى : { إنما النسيء زيادة في الكفر } في سورة براءة ( 37 ) ، قَصد الكنانيُّ صنعاء حتى جاء القليس فأحدث فيها تحقيراً لها ليتسامَعَ العربُ بذلك فغضب أبرهة وأزمع غزو مكة ليهدم الكعبة وسار حتى نزل خارج مكة ليلاً بمكان يقال له المُغَمَّس ( كمعظم موضع قرب مكة في طريق الطائف ) أو ذو الغميس ( لم أر ضبطه ) وأرسل إلى عبد المطلب ليحذره من أن يحاربوه وجرى بينهما كلام ، وأمر عبد المطلب آله وجميع أهل مكة بالخروج منها إلى الجبال المحيطة بها خشية من معرة الجيش إذا دخلوا مكة . فلما أصبح هيّأ جَيْشه لدخول مكة وكان أبرهة راكباً فيلاً وجيشه معه فبينا هو يَتهيّأ لذلك إذ أصاب جنده داء عضال هو الجُدريّ الفتاك يتساقط منه الأنامل ، ورأوا قبل ذلك طيراً ترميهم بحجارة لا تصيب أحداً إلا هلك وهي طير من جند الله فهلك معظم الجيش وأدبر بعضهم ومرض ( أبرهة ) فقفل راجعاً إلى صنعاء مريضاً ، فهلك في صنعاء وكفى الله أهل مكة أمر عدوّهم . وكان ذلك في شهر محرم الموافق لشهر شباط ( فبراير ) سنة 570 بعد ميلاد عيسى عليه السلام ، وبعد هذا الحادث بخمسين يوماً ولد النبي على أصح الأخبار وفيها اختلاف كثير .والتعريف في الفيل } للعهد ، وهو فيل أبرهة قائد الجيش كما قالوا للجيش الذي خرج مع عائشة أم المؤمنين أصحاب الجَمل يريدون الجمل الذي كانت عليه عائشة ، مع أن في الجيش جمالاً أخرى . وقد قيل : إن جيش أبرهة لم يكن فيه إلا فيل واحد ، وهو فيل أبرهة ، وكان اسمه محمود . وقيل : كان فيه فِيَلَة أخرى ، قيل ثمانية وقيل : اثنا عشر . وقال بعضٌ : ألف فيل . ووقع في رجز ينسب إلى عبد المطلب :أنتَ منعتَ الحُبْشَ والأفْيالا ... فيكون التعريف تعريف الجنس ويكون العهد مستفاداً من الإِضافة .والفيل : حيوان عظيم من ذوات الأربع ذواتتِ الخف ، من حيوان البلاد الحارة ذات الأنهار من الهند والصين والحبشة والسودان ، ولا يوجد في غير ذلك إلا مجلوباً ، وهو ذكي قابل للتأنس والتربية ، ضخم الجثة أضخم من البعير ، وأعلى منه بقليل وأكثر لحماً وأكبر بطناً .وخف رجله يشبه خف البعير وعنقه قصير جداً له خرطوم طويل هو أنفه يتناول به طعامه وينتشق به الماء فيفرغه في فيه ويدافع به عن نفسه يختطف به ويلويه على ما يريد أذاه من الحيوان ، ويلقيه على الأرض ويدوسه بقوائمه . وفي عينيه خزر وأذناه كبيرتان مسترخيتان ، وذَنبه قصير أقصر من ذنب البعير وقوائمه غليظة . ومناسمه كمناسم البعير وللذكر منه نابان طويلان بارزان من فمه يتخِذ الناس منها العاجَ . وجلده أجرد مثل جلد البقر ، أصهب اللون قاتم كلون الفار ويكون منه الأبيض الجلد . وهو مركوبٌ وحاملُ أثقال وأهل الهند والصين يجعلون الفيل كالحصن في الحرب يجعلون محفة على ظهره تسع ستة جنود . ولم يكن الفيل معروفاً عند العرب فلذلك قلّ أن يُذكر في كلامهم وأول فيل دخل بلاد العرب هو الفيل المذكور في هذه السورة .وقد ذكرت أشعار لهم في ذكر هذه الحادثة في السيرة . ولكن العرب كانوا يسمعون أخبار الفيل ويتخيلونه عظيماً قوياً ، قال لبيد :ومقاممٍ ضيِّق فرَّجْتُه ... ببياننٍ ولسان وجَدللو يقومُ الفيلُ أوفَيَّالُه ... زل عن مثل مقامي ورحلوقال كَعب بن زهير في قصيدته :لقَدْ أقومُ مقاماً لو يقوم به ... أرى وأسمع ما لو يسمع الفيللظلَّ يَرْعد إلا أنْ يكون له ... من الرسول بإذن الله تنويلوكنت رأيْتُ أنّ . . . . قال إن أمه أرته أو حدثته أنها رأت روث الفيل بمكة حول الكعبة ولعلهم تركوا إزالته ليبقى تذكرة .وعن عائشة وعتاب بن أسيد : رأيت قائد الفيل وسائسه بمكة أعميين مقعدين يستطعمان الناس .والمعنى : ألم تعلم الحالة العجيبة التي فعلها الله بأصحاب الفيل ، فهذا تقرير على إجمال يفسره ما بعده .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said about the interpretation of Allah's saying (Hast thou not seen): '(Hast thou not seen) i.e. have you not been informed, O Muhammad, in the Qur'an (how thy Lord dealt with) how your Lord punished and destroyed (the owners of the Elephant) the people of the Negus who intended to destroy the House of Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ألم تر كيف فعل ربّك بأصحاب الفيل } قصة أصحاب الفيل مشهورة وواقعتهم كانت قريبة من عهد رسول الله صلى الله عليه وسلم وهي إحدى آيات قدرة الله وأثر من سخطه على من اجترأ عليه بهتك حرمه وإلهام الطيور والوحوش أقرب من إلهام الإنسان لكون نفوسهم ساذجة وتأثير الأحجار بخاصية أودعها الله تعالى فيها ليس بمستنكر\n ومن اطلع على عالم القدرة وكشف له حجاب الحكمة عرف لمية أمثال هذه\n وقد وقع في زماننا مثلها من استيلاء الفأر على مدينة ابيورد وإفساد زروعهم ورجوعها في البرية إلى شطّ جيحون وأخذ كل واحدة منها خشبة من الأيكة التي على شطّ نهرها وركوبها عليها وعبورها بها من النهر وهي لا تقبل التأويل كأحوال القيامة وأمثالها\n وأما التطبيق فاعلم أن أبرهة النفس الحبشية لما قصد تخريب كعبة القلب الذي هو بيت الله بالحقيقة والاستيلاء عليها وأراد أن يصرف حجاج القوى الروحانية إلى قلس الطبيعة الجسمانية التي بناها وأراد تعظيمها فخرأ فيها قرشي العاقلة العملية بإلقاء فضلة الغذاء العقلي فيها من صور التأديب المخصوص بالأمور الطبيعية كالعادات الجميلة والآداب المحمودة أوقع فيها شراراً من نار الشوق التي أوقدها عير قريش القوى الروحانية فأحرقها بالرياضة فساق جنوده وعبى جيوشه من جنس القوى النفسانية وصفاتها الظلمانية بالطبع كالغضب والشهوة وأمثال ذلك\n وقدم فيل شيطان الوهم الذي لا ينهزم عن جنود العقل ويعارضه في الحرب والشيطان أكثر ما يتشكل يكون بصورة الفيل كما رآه معاذ في زمن رسول الله صلى الله عليه وسلم\n ولهذا قال عليه السلام:\n \" إن الشيطان ليضع خرطومه على قلب ابن آدم فإذا ذكر الله خنس \"\n ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } ولم تعلم يقيناً علمياً حاصلاً لك من طريق السمع إلى حيث وصل إلى مرتبة اليقين العيني من كثرة السماع من الثقات\n وتكرره { كَيْفَ فَعَلَ رَبُّكَ } الذي ربَّاك يا أكمل الرسل لرسالته\n وأظهر دينك على الأديان كلها\n ونصرك على عموم أعدائك بقدرته الغالبة { بِأَصْحَابِ ٱلْفِيلِ } [الفيل: 1] وهو جيش أبرهة بن الصباح الأشرم ملك اليمن من قِبل أصمحة النجاشي\n\n\nقصد هدم الكعبة عمَّرها الله\n فخرج معه جيشه\n ومعه فيل كثيرة\n لكن فيها فيل عظيم جسيم في غاية الجسامة\n مسمى بـ \" محمود \" كانوا يأمرون له بهدم البنيان\n فيهدمها في الحال\n ولهذا سمُّوه بهذا الاسم\n\n\nوسبب هذا القصد أن أبرهة بنى كنيسة بصنعاء\n فسماها قُليس\n فعزم أن يصرف الحاج من مكة إليها\n فلمَّا انتشر الخبر\n ذهب رجل من كنانة إلى قُليس ذات ليلة\n فتغوط فيها ولطخ بها محاربها\n فوصل الخبر إلى أبرهة فغار غيرة شديدة\n فحلف: والله لأهدمن الكعبة\n\n\nفخرج مع جيشه وفيله\n حتى وصل إلى حوالي الحرم\n وأراد أن يأمر اليل بهدمها\n فبرك ولم يبرح نحوها\n فضربوه وشددوا عليه\n فلم يفد\n فكانوا إذا وجهوه إلى جهة غير جهة البيت هرول وأسرع\n وأمَّا نحوها فلم يمش قط\n فصاروا متحيرين في شأنه\n\n\nكما قال سبحانه: { أَلَمْ يَجْعَلْ كَيْدَهُمْ } الذي كادوا به لهدم البيت وانصراف الزوار عنه نحو بيتهم الذي قد بنوا { فِي تَضْلِيلٍ } [الفيل: 2] ضياع وهلاك؟!\n\n{ وَ } كيف لا يكون في الضياع والخسار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ألم تَرَ كيف فَعَلَ ربُّكَ بأصحابِ الفيل } الخطاب للرسول عليه الصلاة والسلام\n أو لكل سامع\n والهَمزة للتقرير\n و \" كيف \" معلقة لفعل الرؤية\n منصوبة بما بعدها\n والرؤية: علمية\n أي: ألم تعلم علماً ضرورياً مزاحماً للمشاهدة والعيان باستماع الأخبار المتواترة\n ومعاينة الآثار الظاهرة\n وتعليق الرؤية بكيفية فعله ـ عزّ وجل ـ لا بنفسه\n بأن يُقال: ألم ترَ ما فعل ربُّك لتهويل الحادثة والإيذان بوقوعها على كيفية هائلة وهيئة عجيبة\n دالة على عِظم قدرة الله عزّ وجل\n وكمال عِلمه وحكمته\n وعزة بيته\n وشرف رسوله صلى الله عليه وسلم فإنَّ ذلك مِن الإرهاصات له\n لِما رُوي أنَّ الوقعة وقعت في السنة التي وُلد فيها صلى الله عليه وسلم\n وتفصيلها: إنَّ أُبرهة بن الصَبَّاح الأشرم\n مالك اليمن من قِبل النجاشي\n بنى بصنعاء كنيسة\n سماها القُلَّيس\n وأراد أن يصرف إليها الحاج\n فخرج رجل من كنانة\n فأحدث فيها ليلاً\n وذكر الواقدي: أنَّ الرجل لطّخ قبلتها بالعذرة\n ورمى فيها الجيف\n قال: واسمه \" نفيل الحضرمي \" فغضب أبرهة\n وحلف ليهدمنّ الكعبة\n فخرج من الحبشة\n ومعه فيل\n اسمه \" محمود \" وكان قويًّا عظيماً\n بعثه النجاشي إليه\n ومعه اثنا عشر فيلاً غيره\n وقيل: ثمانية\n فلما بلغ \" المُغَمسَ \" خرج إليه عبد المطلب وعرض عليه ثلث أموال تهامة ليرجع\n فأبى وعبّأ جيشه\n وقدّم الفيل\n فأخذ نفيل بن حبيب بأُذنه\n وقال: أبرك محمود\n فإنك في حرم الله\n وارجع من حيث جئت راشداً\n فبرك فكان كُلما وجَّهوه إلى الحرم برك ولم يبرح\n وإذا وجَّهوه إلى اليمن أو إلى غيره من الجهات هرول\n فأرسل اللهُ عليهم سحابة من الطير خرجت من البحر\n مع كل طائر حجر في منقاره\n وحجر في رجليه\n أكبر من العدسة\n وأصغر من الحمّصَةِ\n فكان الحجرُ يقع على رأس الرجل\n ويخرج من دُبره\n وعلى كل حجر اسم مَن يقع عليه\n ففرُّوا وهلكوا في كل طريق ومنهل\n ورُمي أبرهة فتساقطت أنامله وآرابه\n وما مات حتى انصدع صدره عن قلبه\n وانفلت وزيره \" أبو يسكوم \" \n وطائر يُحلّق فوقه\n حتى بلغ النجاشي\n فقصّ عليه القصة\n فلما أتمها وقع عليه الحجر\n فخرّ ميّتاً بين يديه\n ورُوي: أن أبرهة أخذ لعبد المطلب مائتي بعير\n فخرج إليه في شأنها\n فلما رآه أبرهة عَظُمَ في عينه\n وكان وسيماً جسيماً فقيل له: هذا سيّد قريش\n وصاحب عير مكّة\n الذي يُطعم الناس في السهل\n والوحوش في رؤوس الجبال\n فنزل أبرهة عن سريره\n وجلس معه على بساطه\n وقيل: أَجلسه معه\n وقال لترجمانه: قل له: ما حاجتك؟ فلما ذكر له حاجته\n وهو: أن يرد إليه إبله\n قال: سَقَطت من عيني\n جئتُ لأهدم البيت\n الذي هو دينك ودين آبائك\n وعِصمتكم\n وشرفكم في قديم الدهر\n لا تكلمني فيه\n ألهاك عنه ذود أُخذت لك؟ فقال عبد المطلب: أنا ربّ الإبل\n وإنَّ للبيت ربًّا يحيمه\n قال أبرهة: ما كان ليحميه مني\n فقال: ها أنت وذلك\n\nثم رجع وأتى باب الكعبة وأخذ بحلقته\n ومعه نفر من قريش\n فدعوا الله عزّ وجل\n فالتفت وهو يدعو\n فإذا هو بطير من نحو اليمن\n فقال: والله إنها لطير غريبة\n ما هي نجدية ولا تهامية\n فأرسل حلقة الباب\n ثم انطلق مع أصحابه ينظرون ماذا يفعل أبرهة\n فأرسل الله تعالى عليهم الطير\n فكان ما كان\n وقيل: كان أبرهة جد النجاشي\n الذي كان في زمن النبي صلى الله عليه وسلم\n وعن عائشة رضي الله عنها: رأيت قائد الفيل وسائقه أعميَيْن مُقعدين يستطعمان\n وقوله تعالى: { ألم يجعل كَيْدَهُمْ في تضليلٍ } بيان إجمالي لما فعل اللهُ بهم والهمزة للتقرير كما سبق ولذلك عطف على الجملة الاستفهامية ما بعدها\n كأنه قيل: جعل كيدهم للكعبة وتخريبها في تضييع وإبطال بأن دَمَّرهم أشد تدمير\n يقال: ضلّ كيده\n أي: جعله ضالاًّ ضائعاً\n وقيل لامرىء القيس: الملِك الضلّيلِ لأنه ضيّع ملك أبيه باشتغاله بالهوى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:6",
      "similarity": 0.05862951089568751
    },
    {
      "verse": "14:45",
      "similarity": 0.04047032422129679
    },
    {
      "verse": "22:44",
      "similarity": 0.03719388830910941
    },
    {
      "verse": "29:19",
      "similarity": 0.034976759723759666
    },
    {
      "verse": "25:45",
      "similarity": 0.033241721804059335
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/105001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/105001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/105:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}