{
  "chapter": "قريش",
  "text": "لايلف قريش",
  "translations": [
    {
      "translation": "In acknowledgment of the established tradition of Quraysh,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "SINCE THE QURAISH have been united,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Since the Quraysh became accustomed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For God's favors to them during their summer and winter journeys,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of giving alliances to the Quraish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the Ilaf of the Quraysh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the protection of the Qureaish--\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the composing of Koraish,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the taming of Qureysh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the security of the Quraysh:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the keeping of the Quraish\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[In gratitude] for solidarity among the Quraysh,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the covenants (of security and safeguard enjoyed) by the Quraish,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is a great Grace and Protection from Allah), for the taming of the Quraish,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the custom of the Koraysh,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the security of Quraish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the accustomed security of the Quraysh -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[106:1] (Meccan or Medinese, consisting of 4 verses.) [In gratitude] for the security of Quraysh,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said about the interpretation of Allah's saying (For the taming of Quraysh): '(For the taming of Quraysh) he says: command Quraysh to be tamed to Allah's divine Oneness; and it is also said this means: mention My blessings to Quraysh so that they be tamed to Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nقوله تعالى: { لإِيلاَفِ قُرَيْشٍ } معناه نِعمتي عَلَى قُريشٍ\n\n",
      "translations": [
        {
          "translation": " The saying of the Most High: {In return for the Quraysh} means my favor upon the Quraysh.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لإِيلاَفِ قُرَيْشٍ } [قريش: 1] أي: ائتلافهم وتآلفهم فيما بينهم، واتفاقهم على أن ينصرفوا من حوالي بيت اله حين { إِيلاَفِهِمْ } واتفاقهم على الظعن والارتحال { رِحْلَةَ ٱلشِّتَآءِ وَٱلصَّيْفِ } [قريش: 2] يعني: يرتحلون في كل سنة مرتين: مرة في الشتاء نحو اليمن ومرة في الصيف إلى الشام، والباعث على ترحالهم: فقد الزاد في مكة: إذ هي بواد غير ذي زرع، فيشق عليهم الأمر، فيتجروا في كل سنة مرتين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: لإيلافِ: متعلق بقوله: \" فليعبدوا \" ، والفاء لِما في الكلام من معنى الشرط، إذ المعنى: أنَّ نعم الله تعالى على قريش غير محصورة، فإن لم يَعبدوا لسائر نِعَمه فليعبدوا لإيلافهم الرحلتين، وجاز أن يعمل ما بعد الفاء فيما قبلها لانها زائدة غير عاطفة، ولو كانت عاطفة لم يجز التقديم وقيل: يتعلق بمُضمر أي: فعلنا من إهلاك أصحاب الفيل لإيلاف قريش، وقيل: بما قبله من قوله:\n\n[الفيل:5]، ويؤيده: أنهما في مصحف \" أُبيّ \" سورة واحدة بلا فصل، والمعنى: أهلك مَن قصدهم مِن الحبشة ليتسامع الناس بذلك فيتهيبوا لهم زيادة تهيُّب ويحترموهم فضل احترام حتى يتنظم لهم الأمن في رحلتيهم\n يقول الحق جلّ جلاله: { لإِيلافِ قريشٍ } أي: فلتعبد قريش رب هذا البيت لأجل إيلافهم الرحتلين، وكانت لقريش رحلتان، يرحلون في الشتاء إلى اليمن، وفي الصيف إلى الشام، فيمتارون ويتّجرون، وكانوا في رحلتهم آمنين لأنهم أهل حرم الله وولاة بيته العزيز فلا يُتَعرّض لهم، والناس بين مختطف ومنهوب\n والإيلاف: مصدر، من قولهم: ألفت المكان إيلافاً وإلافاً وإلفاً\n وقريش: ولد النضر بن كنانة، وقيل: ولد فهر بن مالك، سُمُّوا بتصغير القِرْش، وهو دابة عظيمة في البَحر، تعبث بالسفن فلا تطاق إلا بالنار، والتصغير للتفخيم، سُمُّوا بذلك لشدتهم ومنعتهم تشبيهاً بها\n وقيل: مِن القَرْش، وهو الجمع والكسب لأنهم كانوا كسّابين بتجارتهم وضربهم في البلاد\n وقوله تعالى: { إِيلافهم رحلةَ الشتاءِ والصيف } بدل من الأول، أطلق الإيلاف، ثم أبدل منه المقيّد بالرحلتين تفخيماً لأمر الإيلاف، وتذكيراً لعظيم هذه النعمة\n و \" رحلة \": مفعول بإيلاف وأراد رحلتي الشتاء والصيف، فأفرد لأمن الإلباس\n { فليعبدوا رَبَّ هذا البيت الذي أَطْعَمَهم } بسبب تينك الرحلتين اللتين تمكنوا منها بواسطة كونهم من جيرانه، { من جوعٍ } شديد كانوا فيه قبلهما\n قال الكلبي: أول مَن حمل السمراء من الشام ورحل إليها: هاشم بن عبد مناف\n هـ\n ولمّا بعث اللهُ نبيه، الذي هو نبي الرحمة، وأسلمت قريش، أراح اللهُ الناسَ من تعب الرحلتين، وجلبت إلى مكة الأرزاق من كل جانب، ببركة طلعته صلى الله عليه وسلم\n قال مالك بن دينار: ما سقطت أُمة من عين الله إلاّ ضرب أكبادهم بالجوع\n وكان عليه الصلاة والسلام يقول:\n\n \" اللهم إني أعوذ بك من الجوع، فإنه بئس الضجيع \" \n\nوالمذموم هو الجوع المفرط، الذي لم يصحبه في الباطن قوة ولا تأييد، وإلاَّ فالجوع ممدوح عند الصوفية، أعني الوسط\n ثم قال تعالى: { وآمنهم من خوف } أي: من خوف عظيم وهو خوف أصحاب الفيل، أو: من خوف الناس في أسفارهم أو: من القحط في بلدهم\n وقيل: كان أصابتهم شدة حتى أكلوا الجِيَف والعظام المحرقة، فرفعه الله عنهم بدعوته صلى الله عليه وسلم، فهذا معنى: { أطعمهم من جوع وآمنهم من خوف } ، وقيل: الجذام، فلا يصيبهم ببلدهم، وذلك بدعاء إبراهيم عليه السلام بقوله:\n\n\n\n[البقرة:126] الآية\n الإشارة: كما أمَّن اللهُ أهل بيته أمَّن أهل نسبته، فلا تجد فقيراً متجرداً إلاّ آمناً حيث ذهب، والناس يُختطفون من حوله\n قلت: وقد رأينا هذا الأمر عامَ حصر \" سلامة \" على تطوان، فكان كل مَن خرج من تطوان يُنتهب أو يُقتل، ونحن نذهب حيث شئنا آمنين بحفظ الله، وهذا إذا لبسوا زي أهل النسبة، من المُرقَّعة والسبحة والعصا، فإن ترك زيَّه وأُخذ فقد ظلم نفسه، وقد ترك بعضُ الفقراء زيَّه، وسافر فتكشّط فقال له شيخه: أنت فرَّطت، والمفرط أولى بالخسارة\n هـ\n ويُقال لأهل النسبة: فليعبدوا رَبَّ هذا البيت، أي: بيت الحضرة التي طلبتموها، أو: بيت النسبة التي سكنتم فيها، الذي أطعمكم من جوعٍ، حيثما توجتهم، مائدتكم منصوبة، وآمنكم من خوفٍ حيث سِرتم\n والله تعالى أعلم، وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:63",
      "similarity": 0.09027388197000834
    },
    {
      "verse": "97:3",
      "similarity": 0.08835945507893339
    },
    {
      "verse": "3:124",
      "similarity": 0.08561959072323186
    },
    {
      "verse": "22:47",
      "similarity": 0.08468468017395117
    },
    {
      "verse": "2:243",
      "similarity": 0.08376781328091411
    }
  ]
}