{
  "chapter": "الماعون",
  "text": "ولا يحض على طعام المسكين",
  "translations": [
    {
      "translation": "And does not induce others to feed the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and urges not the feeding of the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and never encourages the feeding of the destitute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And does not urge to feed the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And urges not the feeding of Al-Miskin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And does not urge (others) to feed the poor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and urges not the feeding of the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And urgeth not the feeding of the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and who does not urge the feeding of the poor?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And urgeth not the feeding of the poor,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and does not urge the feeding of the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And encourages not the feeding of the indigent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And urges not the feeding of AlMiskin (the poor),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and does not urge others to feed the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And does not encourage the feeding of the poor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And does not encourage the feeding of the poor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[107:3] and does not urge, either himself or others [to], the feeding of the needy: this was revealed regarding al-‘Āsī b. Wā’il or al-Walīd b. al-Mughīra.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And urgeth not) nor observe (the feeding of the needy) giving alms to the needy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة بخله وخساسته وإمساكه المفرط { لاَ يَحُضُّ } لا يحث أحداً { عَلَىٰ طَعَامِ ٱلْمِسْكِينِ } [الماعون: 3] يعني: هو لا يطعم ولا يرضى أيضاً بإطعام الغير من شدة شحه وإمساكه، هذا أمارة تكذيبه بالدين والجزاء بحسب الظاهر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا يَحُضُّ } أهلَه وغيرهم من الموسرين { على طعام المسكين } فأَولى هو لا يُطعمه، جعل علامة التكذيب بالجزاء: منع المعروف، والإقدام على أذى الضعيف إذ لو آمن بالجزاء، وأيقن بالوعيد، لخشي عقاب الله وغضبه\n { فويل للمُصَلِّين الذي هم عن صلاتهم ساهون } غير مبالين بها، { الذين هم يُراؤون } الناس بأعمالهم، ليُمدحوا عليها، { ويمنعونَ الماعونَ } أي: الزكاة\n نزلت في المنافقين لأنهم كانوا يسهون عن فعل الصلاة، أي: لا يُبالون بها، لأنهم لا يعتقدون وجوبها\n قال الكواشي عن بعضهم: ليس المراد السهو الواقع في الصلاة الذي لا يكاد يخلو منه مسلم، فإنَّ رسولَ الله صلى الله عليه وسلم كان يسهو، ويُعضد هذا ما رُوي عن أنس أنه قال: الحمد لله الذي لم يقل \" في صلاتهم \" لأنهم لمّا قال: \" عن صلاتهم \" كان المعنى: أنهم ساهون عنها سهو ترك وقلة مبالاة والتفات إليها ولو قال \" في صلاتهم \" كان المعنى: أنّ السهو يعتريهم وهم في الصلاة، والخلوص من هذا شديد\n وقيل \" عن \" بمعنى \" في \" ، أي: في صلاتهم ساهون\n ثم قال عن ابن عطاء: ليس في القرآن وعيد صعب إلاّ وبعده وعيد لطيف، غير قوله: { فويل للمصلِّين\n\n } الآية، ذكر الويل لمَن صلاّها بلا حضور في قلبه، فكيف بمَن تركها رأساً؟ فقيل له: ما الصلاة؟ فقال: الاتصال بالله من حيث لا يعلم إلاّ الله\n ثم قال الكواشي: ومما يدل على أنَّ مَن شَرَعَ في الصلاة خالصاً لله، واعترضه السهو مع تعظيمه للصلاة ولشرائع الإسلام، ليس بداخل مع هؤلاء: أنه وصفهم بقوله: { الذين هم يراؤون }\n ثم قال: وفي اجتناب الرياء صُعوبة عظيمة، وفي الحديث:\n\n \" الرياء أخفى من دبيب النملة السوداء، في الليلة الظلماء، على المسح الأسود \" \n\nوقال بعضهم: هم الذين لا يُخلصون لله عملاً، ولا يُطالبون أنفسهم بحقيقة الإخلاص ولا يَرِد عليهم وارد من ربهم يقطعهم عن رؤية الخلق والتزيُّن لهم\n\n\nهـ\n { ويمنعون الماعُونَ } قيل: الماعون: كل ما يُرتفق به، كالفأس والماء والنار، ونحوها، أي: الماعون المعروف كله، حتى القِدْر والقصعة، أو: ما لا يحل منعه، كالماء والملح والنار، قالوا: ومَنْع هذه الأشياء محظور شرعاً، إذا استعيرت عن ضرورة، وقُبْح في المروءة إذا استعيرت في غير حال الاضطرار\n قال عكرمة: ليس الويل لمَن منع هذه الأشياء، إنما الويل لمَن جمعها فراءى في صلاته وسهى عنها ومَنَع هذه الأشياء\n هـ\n قال ابن عزيز: الماعون في الجاهلية: كل عطية ومنفعة، والماعون في الإسلام: الزكاة والطاعة، وقيل: هو ما ينتفع به المسلم من أخيه، كالعارية والإغاثة ونحوهما، وقيل: الماعون: الماء، نقله الفراء، وفي البخاري: الماعون: المعروف كله، أعلاه الزكاة، وأدناه عارية المتاع\n والله تعالى أعلم\n الإشارة: الدين هو إحراز الإسلام والإيمان والإحسان، فمَن جمع هذه الثلاث تخلّص باطنه، فكان فيه الشفقة والرأفة والكرم والسخاء، وتحقق بمقام الإخلاص، وذاق حلاوة المعاملة وأمّا مَن لم يظفر بمقام الإحسان فلا يخلو باطنه من عُنف وبُخل ودقيق رياء، ربما يصدق عليه قوله تعالى: { أرأيت الذي يُكذِّب بالدين فذلك الذي يَدُعُّ اليتيم\n\n } الخ\n وقال القشيري في قوله تعالى: { فويل للمُصلّين الذين هم عن صلاتهم ساهون }: يُشير إلى المحجوبين عن أسرار الصلاة ودقائقها، الساهين عن شهود مطالعها وطرائقها الغافلين الجاهلين عن علومها وأحكامها، { الذين هم يُراؤون } في أعمالهم وأحوالهم، بنسبتها وإضافتها إلى أنفسهم الظلمانية، { ويمنعون الماعون } أي: ما يُفيد السالك إلى طريق الحق، من الإرشاد والنُصح، وانظر عبارته نقلتها بالمعنى\n وبالله التوفيق، وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ]
}