{
  "chapter": "الكوثر",
  "text": "ان شانئك هو الابتر",
  "translations": [
    {
      "translation": "It is the one who hates you who is cut off without an heir.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is surely your opponents whose line will come to end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily your enemy alone has been cut off from the roots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever hates you will himself remain childless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is your enemy who is bereft of all goodness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For he who hates you, he will be cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your enemy is the one who shall be without posterity,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely he that hates thee, he is the one cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! it is thy insulter (and not thou) who is without posterity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the one who hates you who has been cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily it is thy traducer who shall be tail-less.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is your enemy who is without posterity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For he who hateth thee, he will be cut off (from Future Hope).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For he who makes you angry (O Muhammad (Peace be upon him)), - he will be cut off (from every good thing in this world and in the Hereafter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, he who hates you, he is the most severed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who hates you is the loser.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your enemy is the one cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[108:3] Indeed it is your antagonist, your hater, who is the severed one, refraining from all [acts of] good, or the one whose line of offspring will be severed [by his not having any]: this was revealed regarding al-‘Āsī b. Wā’il, who called the Prophet (s) al-abtar, ‘the severed one’, when his son al-Qāsim died. Meccan or Medinese, consisting of 6 verses; this was revealed when a band of idolaters said to the Prophet (s), ‘What if you worship our gods for one year, and we worship your God the next?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! It is thy insulter) the one who despises you ((and not thou) who is without posterity) he will be without family, children, wealth or any goodness; he will not be mentioned after his death, i.e. al-'As Ibn Wa'il al- Sahmi, while you will be mentioned with every good. This is because, when his son 'Abdullah died, they said: \"Muhammad (pbuh) is without posterity\".' And of the surah in which Disbelievers are mentioned, which is all Meccan and consists of 6 verses, 26 words and 74 letters: Surah 109: Disbelievers (al-Kafirun) And of the surah in which Disbelievers are mentioned, which is all Meccan and consists of 6 verses, 26 words and 74 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ شَانِئَكَ هُوَ ٱلأَبْتَرُ } معناه مُبغضُكَ وعَدوكَ الذي لا عَقِبَ لَهُ\n وذلكَ العاص بن وائل السّهمي\n ويقالُ: كَعبُ بن الأَشرف اليهودي\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Indeed, your enemy is the one who is cut off} [means] that He hates you and your enemy is the one who has no successor.\n\n\nThis is the 'As bin Wail al-Sahmi.\n\n\nIt is said that the Ka'aba was built by the Jewish patriarch Abraham.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ شَانِئَكَ } الذي يشينك ويبغضك في شأنك وأمرك هذا { هُوَ ٱلأَبْتَرُ } [الكوثر: 3] المقطوع العقب والأثر من كل خير، وأثرك يبقى إلى قيام الساعة\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي القاصد للورود إلى الحوض والكوثر والشرب منها أن تتوجه في عموم أوقاتك وحالاتك إلى الله على وجه التبتل والإخلاص، وتميت بهيمة بدنك بالموت الإرادي، وتهديها في طريق الحق؛ تقرباً إليه سبحانه؛ لتنال خير الدارين وفلاح النشأتين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ شَانِئَكَ } أي: مُبغضك كانئاً مَن كان { هو الأبْتَرُ } الذي لا عَقِب له، حيث لم يبق له نسْل، ولا حُسن ذكر، وأمّا أنت فتبقى ذريتك، وحُسن صيتك وآثار فضلك إلى يوم القيامة، لأنَّ كل مَن يُولد مِن المؤمنين فهم أولادك وأعقابك، وذِكْرك مرفوع على المنابر، وعلى لسان كل عالم وذاكر، إلى آخر الدهر، يبدأ بذكر الله ويُثني بذكرك، ولك في الآخرة ما لا يندرج تحت البيان، فمثلك لا يقال فيه أبتر إنما الأبتر شانئك المَنْسي في الدنيا والآخرة\n\n\nقيل: نزلت في العاص بن وائل، كان يُسَمِّي النبيَّ صلى الله عليه وسلم حين مات ابنه \" عبد الله \": أبتر، ووقف مع النبي صلى الله عليه وسلم، فقيل له: مع مَن كنت واقفاً؟ فقال: مع ذلك الأبتر، وكذلك سمّته قريش أبتر وصُنبوراً، ولمّا قَدِمَ كعب بن الأشرف ـ لعنه الله ـ لمكة، يُحرِّض قريشاً عليه صلى الله عليه وسلم قالوا له: نحن أهل السِّقايةِ والسِّدَانة، وأنت سَيِّدُ أهل المدينة، فنحن خير أمْ هذا الصنبور المُنْبَتِر من قومه؟ فقال: أنتم خير، فنزلت في كعب:\n\n[النساء:51]، الآية، ونزلت فيهم: { إن شانئك هو الأبتر }\n الإشارة: يُقال لخليفة الرسول، الذي تَخلَّق بخُلقه، وكان على قدمه: إنَّا أعطيناك الكوثر: الخير الكثير، لأنَّ مَن ظفر بمعرفة الله فقد حاز الخير كله \" ماذا فقد مَن وجدك \" فَصَلّ لربك صلاة القلوب، وانحر نفسك وهواك، إنَّ شانئك ومُبغضك هو الأبتر وأمَّا أنت فذكرك دائم وحياتك لا تنقطع لإنَّ موت أهل التُقى حياة لا فناء بعدها\n وقال الجنيد: إن شانئك هو الأبتر، إي: المنقطع عن بلوغ أمله فيك\n هـ\n وصلّى الله على سيدنا محمد، وآله\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:8",
      "similarity": 0.36350685457317106
    },
    {
      "verse": "5:2",
      "similarity": 0.25963370566731264
    },
    {
      "verse": "36:3",
      "similarity": 0.0011369996845181508
    },
    {
      "verse": "92:12",
      "similarity": 0.0011354220398962864
    },
    {
      "verse": "15:77",
      "similarity": 0.0011351228936945105
    }
  ]
}