{
  "chapter": "الكوثر",
  "text": "ان شانئك هو الابتر",
  "translations": [
    {
      "translation": "It is the one who hates you who is cut off without an heir.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is surely your opponents whose line will come to end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily your enemy alone has been cut off from the roots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever hates you will himself remain childless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is your enemy who is bereft of all goodness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For he who hates you, he will be cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your enemy is the one who shall be without posterity,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely he that hates thee, he is the one cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! it is thy insulter (and not thou) who is without posterity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the one who hates you who has been cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily it is thy traducer who shall be tail-less.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is your enemy who is without posterity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For he who hateth thee, he will be cut off (from Future Hope).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For he who makes you angry (O Muhammad (Peace be upon him)), - he will be cut off (from every good thing in this world and in the Hereafter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, he who hates you, he is the most severed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who hates you is the loser.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your enemy is the one cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[108:3] Indeed it is your antagonist, your hater, who is the severed one, refraining from all [acts of] good, or the one whose line of offspring will be severed [by his not having any]: this was revealed regarding al-‘Āsī b. Wā’il, who called the Prophet (s) al-abtar, ‘the severed one’, when his son al-Qāsim died. Meccan or Medinese, consisting of 6 verses; this was revealed when a band of idolaters said to the Prophet (s), ‘What if you worship our gods for one year, and we worship your God the next?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ (3)استئناف يجوز أن يكون استئنافاً ابتدائياً . ويجوز أن تكون الجملة تعليلاً لحرف { إنّ } إذا لم يكن لرد الإِنكار يكثر أن يفيد التعليل كما تقدم عند قوله تعالى : { قالوا سبحانك لا علم لنا إلا ما علمتنا إنك أنت العليم الحكيم } في سورة البقرة ( 32 ) .واشتمال الكلام على صيغة قصر وعلى ضمير غائب وعلى لفظ الأبتر مؤذن بأن المقصود به ردُّ كلام صادر من معيَّن ، وحكايةُ لفظٍ مرادٍ بالرد ، قال الواحدي : قال ابن عباس : إن العاصي بن وائل السهمي رأى رسول الله صلى الله عليه وسلم في المسجد الحرام عند باب بني سهم فتحدث معه وأناسٌ من صناديد قريش في المسجد فلما دخل العاصي عليهم قالوا له : من الذي كنت تتحدث معه فقال : ذلك الأبترُ ، وكان قد توفّي قبل ذلك عبدُ الله ابنُ رسول الله صلى الله عليه وسلم بعد أن مات ابنه القاسم قبلَ عبد الله فانقطع بموت عبد الله الذكورُ من ولده صلى الله عليه وسلم يومئذ ، وكانوا يَصِفون من ليس له ابن بأبتر فأنزل الله هذه السورة ، فحصل القصر في قوله { إن شانئك هو الأبتر } لأن ضمير الفصل يفيد قصر صفة الأبتر على الموصوف وهو شانىء النبي صلى الله عليه وسلم قصرَ المسند على المسند إليه ، وهو قصر قلب ، أي هو الأبتر لا أنت .و { الأبتر } : حقيقته المقطوع بعضه وغلب على المقطوع ذَنبه من الدواب ويستعار لمن نقص منه ما هو من الخير في نظر الناس تشبيهاً بالدَّابة المقطوع ذَنَبها تشبيه معقول بمحسوس كما في الحديث : \" كل أمر ذي بال لا يبدأ فيه باسم الله فهو أبتر \" يقال : بَتر شيئاً إذا قطع بعضَه وبَتر بالكسر كفرِح فهو أبتر ، ويقال للذي لا عقب له ذكوراً ، هو أبتر على الاستعارة تشبيه متخيل بمحسوس شبهوه بالدابة المقطوع ذنبها لأنه قُطع أثره في تخيُّل أهللِ العرف .ومعنى الأبتر في الآية الذي لا خير فيه وهو رد لقول العاصي بن وائل أو غيره في حق النبي صلى الله عليه وسلم فبهذا المعنى استقام وصف العاصي أو غيره بالأبتر دون المعنى الذي عناه هو حيث لمز النبي صلى الله عليه وسلم بأنه أبتر ، أي لا عقب له لأن العاصي بن وائل له عقب ، فابنه عمرو الصحابي الجليل ، وابن ابنه عبد الله بن عمرو بن العاص الصحابي الجليل ولعبد الله عقب كثير . قال ابن حزم في «الجمهرة» عقبه بمكة وبالرهط .فقوله تعالى : { هو الأبتر } اقتضت صيغة القصر إثبات صفة الأبتر لشانىء النبي صلى الله عليه وسلم ونفيها عن النبي صلى الله عليه وسلم وهو الأبتر بمعنى الذي لا خير فيه .ولكن لما كان وصف الأبتر في الآية جيء به لمحاكاة قول القائل : «محمد أبتر» إبطالاً لقوله ذلك ، وكانَ عرفهم في وصف الأبتر أنه الذي لا عقب له تعيّن أن يكون هذا الإِبطال ضرباً من الأسلوب الحكيم وهو تلقي السامع بغير ما يترقب بحمل كلامه على خلاف مراده تنبيهاً على أن الأحقَّ غيرُ ما عناه من كلامه كقوله تعالى : { يسألونك عن الأهلة قل هي مواقيت للناس والحج } \\[ البقرة : 189 \\] . وذلك بصرف مراد القائل عن الأبتر الذي هو عديم الابن الذكر إلى ما هو أجدر بالاعتبار وهو الناقص حظّ الخير ، أي ليس ينقص للمرء أنه لا ولد له لأن ذلك لا يعود على المرء بنقص في صفاته وخلائقه وعقله . وهب أنه لم يولد له البتة ، وإنما اصطلح الناس على اعتباره نقصاً لرغبتهم في الولد بناء على ما كانت عليه أحوالهم الاجتماعية من الاعتماد على الجهود البدنية فهم يبتغون الولد الذكور رجاء الاستعانة بهم عند الكبر وذلك أمر قد يعرض ، وقد لا يعرض أو لمحبة ذِكر المرء بعد موته وذلك أمر وهمي ، والنبي صلى الله عليه وسلم قد أغناه الله بالقناعة ، وأعزّه بالتأييد ، وقد جعل الله له لسان صدق لم يجعل مثله لأحد من خلقه ، فتمحض أن كماله الذاتي بما عَلِمه الله فيه إذ جعل فيه رسالته ، وأن كماله العرضي بأصحابه وأمته إذ جعله الله أولى بالمؤمنين من أنفسهم .وفي الآية محسن الاستخدام التقديري لأن سوق الإبطال بطريق القصر في قوله : { هو الأبتر } نفيُ وصف الأبتر عن النبي صلى الله عليه وسلم لكن بمعنًى غير المعنى الذي عناه شانئه فهو استخدام ينشأ من صيغة القصر بناء على أن ليس الاستخدام منحصراً في استعمال الضمير في غير معنى معاده ، على ما حققه أستاذنا العلامة سالم أبو حاجب وجعله وجهاً في واو العطف من قوله تعالى : { وجاء ربك والملك } \\[ الفجر : 22 \\] لأن العطف بمعنى إعادة العامل فكأنه قال : وجاء الملك وهو مجيء مغاير لمعنى مجيء الله تعالى ، قال : وقد سَبقنا الخفاجي إلى ذلك إذ أجراه في حرف الاستثناء في «طراز المجالس» في قول محمد الصالحي من شعراء الشام: ... وحديثُ حُبّي ليسَ بالْمَنْسُوخ إلاّ في الدَّفاتر ... والشانىء : المبغض وهو فاعل من الشناءة وهي البغض ويقال فيه : الشنآن ، وهو يشمل كل مبغض له من أهل الكفر فكلهم بتر من الخير ما دام فيه شنآن للنبيء صلى الله عليه وسلم فأما من أسلموا منهم فقد انقلب بعضهم محبة له واعتزازاً به .\n\n",
      "translations": [
        {
          "translation": "(Lo! It is thy insulter) the one who despises you ((and not thou) who is without posterity) he will be without family, children, wealth or any goodness; he will not be mentioned after his death, i.e. al-'As Ibn Wa'il al- Sahmi, while you will be mentioned with every good. This is because, when his son 'Abdullah died, they said: \"Muhammad (pbuh) is without posterity\".' And of the surah in which Disbelievers are mentioned, which is all Meccan and consists of 6 verses, 26 words and 74 letters: Surah 109: Disbelievers (al-Kafirun) And of the surah in which Disbelievers are mentioned, which is all Meccan and consists of 6 verses, 26 words and 74 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ شَانِئَكَ هُوَ ٱلأَبْتَرُ } معناه مُبغضُكَ وعَدوكَ الذي لا عَقِبَ لَهُ\n وذلكَ العاص بن وائل السّهمي\n ويقالُ: كَعبُ بن الأَشرف اليهودي\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Indeed, your enemy is the one who is cut off} [means] that He hates you and your enemy is the one who has no successor.\n\n\nThis is the 'As bin Wail al-Sahmi.\n\n\nIt is said that the Ka'aba was built by the Jewish patriarch Abraham.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فلا تكون أبتر في وصولك وحالك واتصال أمتك الذين هم ذريتك بك { إنّ } مبغضك الذي على خلاف حالك المنقطع عن الحق { هو الأبتر } لا أنت\n فإنك الباقي ببقائه الدائم المتصل بك ذرياتك الحقيقية من أهل الإيمان أبد الآبدين المذكور فيهم دهر الداهرين وهو الفاني بالحقيقة الهالك الذي لا يوجد ولا يذكر ولا ينسب إليه ولد حقيقة\n والله أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ شَانِئَكَ } الذي يشينك ويبغضك في شأنك وأمرك هذا { هُوَ ٱلأَبْتَرُ } [الكوثر: 3] المقطوع العقب والأثر من كل خير\n وأثرك يبقى إلى قيام الساعة\n\n\nخاتمة السورة\n\nعليك أيها المحمدي القاصد للورود إلى الحوض والكوثر والشرب منها أن تتوجه في عموم أوقاتك وحالاتك إلى الله على وجه التبتل والإخلاص\n وتميت بهيمة بدنك بالموت الإرادي\n وتهديها في طريق الحق\n تقرباً إليه سبحانه\n لتنال خير الدارين وفلاح النشأتين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ شَانِئَكَ } أي: مُبغضك كانئاً مَن كان { هو الأبْتَرُ } الذي لا عَقِب له\n حيث لم يبق له نسْل\n ولا حُسن ذكر\n وأمّا أنت فتبقى ذريتك\n وحُسن صيتك وآثار فضلك إلى يوم القيامة\n لأنَّ كل مَن يُولد مِن المؤمنين فهم أولادك وأعقابك\n وذِكْرك مرفوع على المنابر\n وعلى لسان كل عالم وذاكر\n إلى آخر الدهر\n يبدأ بذكر الله ويُثني بذكرك\n ولك في الآخرة ما لا يندرج تحت البيان\n فمثلك لا يقال فيه أبتر إنما الأبتر شانئك المَنْسي في الدنيا والآخرة\n\nقيل: نزلت في العاص بن وائل\n كان يُسَمِّي النبيَّ صلى الله عليه وسلم حين مات ابنه \" عبد الله \": أبتر\n ووقف مع النبي صلى الله عليه وسلم\n فقيل له: مع مَن كنت واقفاً؟ فقال: مع ذلك الأبتر\n وكذلك سمّته قريش أبتر وصُنبوراً\n ولمّا قَدِمَ كعب بن الأشرف ـ لعنه الله ـ لمكة\n يُحرِّض قريشاً عليه صلى الله عليه وسلم قالوا له: نحن أهل السِّقايةِ والسِّدَانة\n وأنت سَيِّدُ أهل المدينة\n فنحن خير أمْ هذا الصنبور المُنْبَتِر من قومه؟ فقال: أنتم خير\n فنزلت في كعب:\n[النساء:51]\n الآية\n ونزلت فيهم: { إن شانئك هو الأبتر }\n الإشارة: يُقال لخليفة الرسول\n الذي تَخلَّق بخُلقه\n وكان على قدمه: إنَّا أعطيناك الكوثر: الخير الكثير\n لأنَّ مَن ظفر بمعرفة الله فقد حاز الخير كله \" ماذا فقد مَن وجدك \" فَصَلّ لربك صلاة القلوب\n وانحر نفسك وهواك\n إنَّ شانئك ومُبغضك هو الأبتر وأمَّا أنت فذكرك دائم وحياتك لا تنقطع لإنَّ موت أهل التُقى حياة لا فناء بعدها\n وقال الجنيد: إن شانئك هو الأبتر\n إي: المنقطع عن بلوغ أمله فيك\n هـ\n وصلّى الله على سيدنا محمد\n وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:8",
      "similarity": 0.36350685457317106
    },
    {
      "verse": "5:2",
      "similarity": 0.25963370566731264
    },
    {
      "verse": "36:3",
      "similarity": 0.0011369996845181508
    },
    {
      "verse": "92:12",
      "similarity": 0.0011354220398962864
    },
    {
      "verse": "15:77",
      "similarity": 0.0011351228936945105
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/108003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/108003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/108:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}