{
  "chapter": "الكافرون",
  "text": "لكم دينكم ولى دين",
  "translations": [
    {
      "translation": "You have your deen and I have my deen.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To you your way, to me my way\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To you is your religion, and to me, my religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You follow your religion and I follow mine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you is your religion, and for me is mine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To you be your religion, and to me my religion.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall have your religion and I shall have my religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To you your religion, and to me my religion!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto you your religion, and unto me my religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have your religion and I have mine.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yours shall be your requital, and mine shall be my requital.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To you your religion, and to me my religion.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To you be your Way, and to me mine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To you be your religion, and to me my religion (Islamic Monotheism).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To you your religion, and to me my Religion'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have your way, and I have my way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you is your religion, and for me is my religion.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[109:6] You have your religion, idolatry, and I have a religion’, Islam: this was [revealed] before he was commanded to wage war [against the idolaters] (all seven Qur’ānic readers omit the yā’ of the genitive possessive construction [in wa-liya dīni] whether with a pause or without; Ya‘qūb, however, retains it in both cases).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto you your religion) of disbelief and ascribing partners to Allah, (and unto me my religion) Islam and faith in Allah. The verses of fighting then abrogated this and the Prophet (pbuh) did fight them' And of the surah in which Succour is mentioned which is all Meccan and consists of 3 verses, 23 words and 77 letters: Surah 110: Succour (al-Nasr) And of the surah in which Succour is mentioned which is all Meccan and consists of 3 verses, 23 words and 77 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَكُمْ دِينُكُمْ وَلِيَ دِينِ } قال الإِمام زيد بن علي عليهما السلامُ: وذَلكَ أنَّ قريشاً قالتْ للنبي صلى الله عليهِ وعَلَى آلهِ وسلَّمَ إنْ سَركَ أن نَتبعَكَ فارجعْ إلى دينِنَا عاماً وَنرجعُ إلى دينِكَ عاماً\n فأنزلَ الله تَعالى هذهِ الآيةِ\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah {For you is your religion, and for me is my religion} Imam Zaid bin Ali, peace be upon them both, said: That the Quraish said to the Prophet, may Allah's peace and blessings be upon him and his family: \"If your intention is that we follow you, then return to our religion for a year, and we will return to your religion for a year.\"\n\n\nAnd then God sent down this verse.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { لَكُمْ دِينُكُمْ } الذي أنتم عليه، وطريقكم الذي تتوجهون إليه بعدما لم يفوقكم الحق على الهداية والإيمان { وَلِيَ دِينِ } [الكافرون: 6] الذي أنا عليه، لا تتركوا دينكم بديني، ولا أنا أيضاً تارك ديني بدينكم، بل لكم دينكم ولي ديني، والتوفيق بيد الله والهداية والضلال\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الموحد المحمدي الحنيف، المائل عن كل الأديان والمذاهب المنافية لصرافة شرب التوحيد ألاَّ تجالس مع أهل الغفلة والضلال، المترددين في أودية الجهلات بأنواع الخيالات الباطلة، والأوهام العاطلة المترتبة على هوياتهم العدمية وتعيناتهم الوهمية، ولا تصاحبهم في حال من الأحوال، فإن صحبتك معهم تبعدك عن الحق وتغريك نحو الباطل، فإن النفوس الإنسانية أسرع عدواً وأشد ميلاً إلى البدع والأهواء الفاسدة والآراء العاطلة الباطلة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:46",
      "similarity": 0.7417755757224077
    },
    {
      "verse": "83:11",
      "similarity": 0.7339900457267512
    },
    {
      "verse": "1:4",
      "similarity": 0.7336511347740973
    },
    {
      "verse": "56:56",
      "similarity": 0.6919822599681539
    },
    {
      "verse": "95:7",
      "similarity": 0.6817620212031201
    }
  ]
}