{
  "chapter": "يونس",
  "text": "قل يايها الناس قد جاءكم الحق من ربكم فمن اهتدى فانما يهتدى لنفسه ومن ضل فانما يضل عليها وما انا۠ عليكم بوكيل",
  "translations": [
    {
      "translation": "Say: 'Mankind! the truth has come to you from your Lord. Whoever is guided is only guided for his own good. Whoever is misguided is only misguided to his detriment. I have not been set over you as a guardian.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O men, the truth has come to you from your Lord, so he who follows the right path does so for himself, and he who goes astray errs against himself, and I am not a guardian over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them (O Muhammad): 'Men! Truth has come to you from your Lord. Whosoever, then, follows the true guidance does so for his own good; and whosoever strays, his straying will be to his own hurt. I am no custodian over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"People, truth has certainly come to you from your Lord. One who seeks guidance does so for his own good and One who goes astray will find himself lost. I am not your keeper\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O people! The truth* has come to you from your Lord; so whoever came to guidance, has come to guidance for his own benefit; and whoever strayed, has strayed for his own harm; and I am not a trustee over you.” (* Prophet Mohammed – peace and blessings be upon him, or Islam or the Qur’an.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O people! Now the truth has come to you from your Lord. So whoever receives guidance, he does so for the good of himself. And whoever goes astray, he does so at his own loss. And I am not set over you as a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O people! indeed there has come to you the truth from your Lord, therefore whoever goes aright, he goes aright only for the good of his own soul, and whoever goes astray, he goes astray only to the detriment of it, and I am not a custodian over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O men, the truth has come to you from your Lord. Whosoever is guided is guided only to his own gain, and whosoever goes astray, it is only to his own loss. I am not a guardian over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O mankind! Now hath the Truth from your Lord come unto you. So whosoever is guided, is guided only for (the good of) his soul, and whosoever erreth erreth only against it. And I am not a warder over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Mankind, Truth has come to you from your Lord! Anyone who accepts guidance is guided only for his own sake; and he who goes astray does so at his own peril. I am not appointed as your keeper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: O mankind! the truth hath surely come unto you from your Lord: whosoever then is guided, is guided only for himself, and whosoever strayeth, strayeth only against himself; and am not over you a trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘O mankind! The truth has already come to you from your Lord. Whoever is guided, is guided only for [the good of] his own soul, and whoever goes astray, goes astray only to its detriment, and it is not my business to watch over you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O ye men! Now Truth hath reached you from your Lord! those who receive guidance, do so for the good of their own souls; those who stray, do so to their own loss: and I am not (set) over you to arrange your affairs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": ". Say: \"O you mankind! Now truth (i.e. the Quran and Prophet Muhammad SAW), has come to you from your Lord. So whosoever receives guidance, he does so for the good of his own self, and whosoever goes astray, he does so to his own loss, and I am not (set) over you as a Wakil (disposer of affairs to oblige you for guidance).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O people! The truth has come to you from your Lord. Whosoever is guided is guided only for himself, and whosoever goes astray, he is astray for himself. I am not a guardian over you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O people, the truth has come to you from your Lord. Whoever accepts guidance is guided for his own soul; and whoever strays only strays to its detriment. I am not a guardian over you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O mankind, the truth has come to you from your Lord, so whoever is guided is only guided for [the benefit of] his soul, and whoever goes astray only goes astray [in violation] against it. And I am not over you a manager.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:108] Say: ‘O people, that is, people of Mecca, the Truth has come to you from your Lord. So whoever is guided, is guided only for the sake of his own soul, since the reward of his being guided will be his, and whoever errs, errs only against it, since the evil consequence of his erring shall befall [only] it [his soul]. And I am not a guardian over you’, that I might then compel you to [accept] guidance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say: O mankind!) O people of Mecca! (Now hath the Truth) the Scripture and Messenger (from your Lord come unto you. So whosoever is guided) by the Scripture and Messenger, (is guided only for (the good of) his soul) i.e. its reward goes to him, (and whosoever erreth) and whoever disbelieves in the Scripture and Messenger (erreth only against it) i.e. the onus of his disbelief goes to him. (And I am not a warder) a trustee (over you). This was abrogated by the verse of fighting. 225\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا من بُعث لكافة البرايا وأُرسل إليهم بالتوحيد الذاتي الذي ختم به أمر التشريع والإرسال والإنزال، بلغ إليهم ما جئت به من ربك، منادياً عليهم ليقبل بقبوله: { يٰأَيُّهَا ٱلنَّاسُ } المكلفون بالعبادة والعرفان { قَدْ جَآءَكُمُ ٱلْحَقُّ } الصريح { مِن رَّبِّكُمْ } وهو الإسلام المبين لشعائر المعرفة والتوحيد { فَمَنِ ٱهْتَدَىٰ } بالإسلام إلى التوحيد { فَإِنَّمَا يَهْتَدِي لِنَفْسِهِ } ويكتسب الهداية لها ونال ثوابها إليها { وَمَن ضَلَّ } ولم يهتدِ بنور الإسلام { فَإِنَّمَا يَضِلُّ عَلَيْهَا } ويقترف الضلالة لنفسها، فعاد وبالها عليها، قل لهم أيضاً: { وَمَآ أَنَاْ عَلَيْكُمْ بِوَكِيلٍ } [يونس: 108] حفيظ، كفيل لأموركم ضمين لها، بل ما أنا إلا بشير ونذير أبلغكم ما أرسلت به، فلكم الخيار وعليكم الاختيار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}