{
  "chapter": "يونس",
  "text": "ويعبدون من دون الله ما لا يضرهم ولا ينفعهم ويقولون هؤلاء شفعؤنا عند الله قل اتنبـون الله بما لا يعلم فى السموت ولا فى الارض سبحنه وتعلى عما يشركون",
  "translations": [
    {
      "translation": "They worship, instead of Allah, what can neither harm them nor help them, saying, 'These are our intercessors with Allah.' Say: 'Would you inform Allah of something about which He does not know either in the heavens or on the earth?' May He be glorified and exalted above what they associate with Him!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship those besides God who cannot do them harm or bring them gain, and say: \"These are our intercessors with God.\" Say: \"Do you want to inform God of things in the heavens and the earth He does not know?\" Glorious is He, and too exalted for what they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship, beside Allah, those who can neither harm nor profit them, saying; 'These are our intercessors with Allah.' Tell them (O Muhammad): 'Do you inform Allah of something regarding whose existence in the heavens or on the earth He has no knowledge? Holy is He and He is exalted far above what they associate with Him in His divinity'.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some people) worship things other than God which harm nor benefit them. They say, \"These (idols) are our intercessors before God.\" (Muhammad), tell them, \"Are you trying to tell God about something that He does not find in the heavens or earth? God is too Glorious to be considered equal to idols.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship the thing other than Allah, which neither harms them nor benefits them*, and they say, “These are our intercessors** before Allah”; say, “What! You inform Allah of something which in His knowledge does not exist in the heavens or in the earth?” Purity and Supremacy are to Him, above their association. (* Some things like the sun, stars, trees are useful but they too are created by Allah. Their worship will not benefit – in fact it is harmful ** Only the virtuous will be granted permission by Allah to intercede.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship besides Allah things that harm them not, nor profit them, and they say: \"These are our intercessors with Allah.\" Say: \"Do you inform Allah of that which He knows not in the heavens and on the earth\" Glorified and Exalted is He above all that which they associate as partners (with Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they serve beside Allah what can neither harm them nor profit them, and they say: These are our intercessors with Allah. Say: Do you (presume to) inform Allah of what He knows not in the heavens and the earth? Glory be to Him, and supremely exalted is He above what they set up (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They serve, apart from God, what hurts them not neither profits them, and they say, 'These are our intercessors with God.' Say: 'Will you tell God what He knows not either in the heavens or in the earth?' Glory be to Him! High be He exalted above that they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship beside Allah that which neither hurteth them nor profiteth them, and they say: These are our intercessors with Allah. Say: Would ye inform Allah of (something) that He knoweth not in the heavens or in the earth? Praised be He and High Exalted above all that ye associate (with Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Instead of God they worship what neither harms nor benefits them, and they say: \"These are our intercessors with God.\" Say, \"Do you inform God about something in heavens and on earth that He does not know? Glory be to Him; may He be Exalted over whatever they associate [with Him]!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship, beside Allah, that which harmeth them not, nor profiteth them, and they say: these are our intercessors with God: Say thou: apprise ye Allah of that which He knoweth not in the heavens nor in the earth? Hallowed be He and Exalted far above that which ye associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship besides Allah that which neither causes them any harm, nor brings them any benefit, and they say, ‘These are our intercessors with Allah.’ Say, ‘Will you inform Allah about something He does not know in the heavens or on the earth?’ Immaculate is He and exalted above [having] any partners that they ascribe [to Him]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They serve, besides Allah, things that hurt them not nor profit them, and they say: \"These are our intercessors with Allah.\" Say: \"Do ye indeed inform Allah of something He knows not, in the heavens or on earth?- Glory to Him! and far is He above the partners they ascribe (to Him)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship besides Allah things that hurt them not, nor profit them, and they say: \"These are our intercessors with Allah.\" Say: \"Do you inform Allah of that which He knows not in the heavens and on the earth?\" Glorified and Exalted be He above all that which they associate as partners with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship, other than Allah, that which can neither harm nor benefit them, and say: 'These are our intercessors with Allah' Say: 'Will you tell Allah of something He does not know about either in the heavens or earth? Exaltations to Him! Exalted be He above what they associate'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship, besides God, what neither harms them nor benefits them. And they say, “These are our intercessors with God.” Say, “Are you informing God about what He does not know in the heavens or on earth?” Glorified be He, High above the associations they make.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship other than Allah that which neither harms them nor benefits them, and they say, \"These are our intercessors with Allah \" Say, \"Do you inform Allah of something He does not know in the heavens or on the earth?\" Exalted is He and high above what they associate with Him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:18] And they worship, besides God, that is, other than Him, that which can neither hurt them, should they not worship it, nor profit them, if they do worship it — and these are the idols; and they say, of them: ‘These are our intercessors with God’. Say, to them: ‘Would you tell, would you inform, God of what He does not know in the heavens or in the earth?’ (the interrogative is meant as a disavowal), for if He had a partner, He [Himself] would know it, since nothing can be hidden from Him. Glory be to Him!, in [affirmation of] His transcendence, and High be He exalted above what they associate! with Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They worship) i.e. the disbelievers of Mecca (beside Allah that which neither hurteth them) in this life or in the Hereafter, if they did not worship it, (nor profiteth them) in this life or in the Hereafter if they worshipped it, (and they say: These) i.e. these idols (are our intercessors) which will intercede for us (with Allah. Say) to them, O Muhammad: (Would ye inform Allah of (something) that He knoweth not in the heavens or in the earth) i.e. He knows there does not exist a god who hurts and benefits except Him? (Praised be He) He exalted Himself far above having a son or partner (and high exalted above) and absolves Himself from (all that ye associate (with Him)) of idols!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يفلحون ويفوزون بالفلاح { وَ } هم من شدة ضلالهم { يَعْبُدُونَ مِن دُونِ ٱللَّهِ } المتوحد بذاته\n المستقل بألوهيته { مَا لاَ يَضُرُّهُمْ وَلاَ يَنفَعُهُمْ }؟! لأنهم ليسوا من ذوي القدرة والإرادة\n بل من جملة الجمادات المعطلة التي لا شعور لها أصلاً { وَيَقُولُونَ } من كمال غفلتهم وضلاتهم: { هَـٰؤُلاۤءِ } الأجسام والتماثيل العاطلة { شُفَعَاؤُنَا عِندَ ٱللَّهِ } ينقذوهم من بأس الله وبطشه إن تحقق وقوعه { قُلْ } لهم يا أكمل الرسل تسفيهاً وتحميقاً: { أَتُنَبِّئُونَ } تخبرون بقولكم هذا { ٱللَّهَ } العالم بالسرائر والخفايا { بِمَا لاَ يَعْلَمُ } من الأمور الكائنة لا { فِي ٱلسَّمَٰوَٰتِ وَلاَ فِي ٱلأَرْضِ } من الكوائن فيها\n مع أنه سبحانه لا يعزب عن حيطة علمه شيء في الأرض ولا في السماء { سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ } [يونس: 18] من الأوثان والتماثيل التي لا شعور لها أصلاً\n مع أنها من أدون المظاهر\n وأخس المخلوقات\n وبالجملة: ما قدروا الله أولئك الحمقى حق قدره\n لذلك نسبوا إليه ما هو منزه عنه\n تعالى عمَّا يقول الظالمون علواً كبيراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:48",
      "similarity": 0.5728507921811496
    },
    {
      "verse": "21:66",
      "similarity": 0.5053253785977879
    },
    {
      "verse": "20:109",
      "similarity": 0.4955913828894123
    },
    {
      "verse": "5:76",
      "similarity": 0.4952210407083073
    },
    {
      "verse": "30:13",
      "similarity": 0.46324941326603125
    }
  ]
}