{
  "chapter": "يونس",
  "text": "وان يمسسك الله بضر فلا كاشف له الا هو وان يردك بخير فلا راد لفضله يصيب به من يشاء من عباده وهو الغفور الرحيم",
  "translations": [
    {
      "translation": "Should God bring you harm there is none but He who could deliver you from it, and if He wish you good there is none who could take away His blessings: He showers them on those of His creatures as He please, and He is forgiving and kind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah afflicts you with any hardship, none other than He can remove it; and if He wills any good for you, none can avert His bounty. He bestows good upon whomsoever of His servants He wills. He is AllForgiving, All-Merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), if God afflicts you with hardship, no one besides Him can save you. If God grants you a favor, no one can prevent you from receiving His favors. God bestows His favors upon whichever of His servants He wants. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And if Allah afflicts you with some suffering, there is none who can remove it except Him; and if He wills good for you, there is none who can repel His munificence; He bestows it upon whomever He wills from among His bondmen; He is the Oft Forgiving, the Most Merciful.” (* Help, cure, monetary aid etc., whatever benefit derived from any source, reaches us because Allah has given the source this power and is actually through the grace and mercy of Allah.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah touches you with harm, there is none who can lift it but He. And if He intends good for you, then none can repel His favor which He causes to reach whom He wills among His servants. And He is the Pardoning, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah should afflict you with harm, then there is none to remove it but He; and if He intends good to you there is none to repel His grace; He brings it to whom He pleases of His servants; and He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if God visits thee with affliction, none can remove it but He; and if He desires any good for thee, none can repel His bounty; He causes it to fall upon whomsoever He will of His servants.\" He is the All-forgiving, the All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah afflicteth thee with some hurt, there is none who can remove it save Him; and if He desireth good for thee, there is none who can repel His bounty. He striketh with it whom He will of his bondmen. He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God inflicts harm on you, no one can remove it but He, and if He intends good for you, no one can withhold His bounty; He grants His bounty to any of His servants whom He will. He is the Most Forgiving, and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah toucheth thee with hurt there is no remover thereof but he, and if He intendeth any good there is no averter of His grace. He letteth it befall on whomsoever of His bondmen He will; and He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should Allah visit you with some distress, there is no one to remove it except Him; and should He desire any good for you, none can stand in the way of His grace: He grants it to whomever He wishes of His servants, and He is the All-forgiving, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah do touch thee with hurt, there is none can remove it but He: if He do design some benefit for thee, there is none can keep back His favour: He causeth it to reach whomsoever of His servants He pleaseth. And He is the Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah touches you with hurt, there is none who can remove it but He; and if He intends any good for you, there is none who can repel His Favour which He causes it to reach whomsoever of His slaves He will. And He is the Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah touches you an affliction none can remove it except He; and if He wills any good for you, none can repel His Bounty. He causes it to fall upon whosoever of His worshippers that He will. He is the Forgiving, the Most Merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God afflicts you with harm, none can remove it except He. And if He wants good for you, none can repel His grace. He makes it reach whomever He wills of His servants. He is the Forgiver, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah should touch you with adversity, there is no remover of it except Him; and if He intends for you good, then there is no repeller of His bounty. He causes it to reach whom He wills of His servants. And He is the Forgiving, the Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:107] And if God afflicts you, smites you, with some hurt, such as impoverishment or illness, there is none who can remove it save Him; and if He desires good for you, there is none who can repel His bounty, that [bounty] which He has intended for you. He strikes with it, that is, with [such] good, whomever He will of His servants.” He is the Forgiving, the Merciful’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If Allah afflicteth thee with some hurt) with hardship or a disliked matter, (there is none who can remove it) i.e. the harm (save Him; and if He desireth) and if He bestows upon you (good for thee) a blessing or pleasant matter, (there is none who can repel His bounty) there is none who can stop His gift, (He striketh with it) He favours with His bounty (whom He will of His bondmen) whoever deserves it. (He is the Forgiving) He forgives those who repent, (the Merciful) towards those who die in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف تدعي وتثبت لغيره وجوداً وأثراً { إِن يَمْسَسْكَ ٱللَّهُ } الرقيب عليك ويصيبك { بِضُرٍّ } يسوءك ويحزنك { فَلاَ كَاشِفَ لَهُ } ولا يدفع عنك ضرره { إِلاَّ هُوَ } إذ لا شيء سواه ولا إله إلا هو { وَإِن يُرِدْكَ بِخَيْرٍ } يسرك تفضلاً عليك وامتناناً لك { فَلاَ رَآدَّ } ولا دافع { لِفَضْلِهِ } عنك { يُصَيبُ بِهِ } أي: بالفضل والحسنى { مَن يَشَآءُ مِنْ عِبَادِهِ وَ } ولا يمنع فضله جرائمهم وعصيانهم؛ إذ { هُوَ ٱلْغَفُورُ } لذنوبهم بعد استغفارهم ورجوعهم { ٱلرَّحِيمُ } [يونس: 107] عليهم يقبل توبتهم ويتجاوز عن سيئاتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  ثم بيَّن من يستحق العبادة والدعاء، وهو الله تعالى فقال: { وإن يمسسك الله } أي: يصيبك { بضر فلا كاشف له }: لا رافع له { إلا هُو } أي: الله، { وإن يُردكَ بخيرٍ فلا رادَّ }: لا دافع { لفضله } الذي أرادك له\n قال البيضاوي: ولعله ذكر الإرادة مع الخير، والمس مع الضر، مع تلازم الأمرين للتنبيه على أن الخير مراد بالذات، وأن الضر إنما مسهم لا بالقصد الأول، ووضع الفضل موضع الضمير للدلالة على أنه متفضل بما يريد بهم من الخير لا لاستحقاق لهم عليه، ولم يستثن لأن مراد الله لا يمكن رده\n هـ\n { يصيب به } بذلك الخير { من يشاء من عباده وهو الغفور الرحيم } ، فتعرّضوا لخيره بالتضرع والسؤال، ولا يمنعكم من ذلك ما اقترفتم من العصيان والزلل، فإنه غفور رحيم\n الإشارة: ينبغي لمن تمسك بطريق الخصوص، وانقطع بكليته إلى مولاه، أن يقول لمن خالفه في ذلك: إن كنتم في شك من ديني ـ من طريقي ـ فلا أعبدُ ما تعبدون من دون الله، من متابعة الهوى والحرص على الدنيا، ولكن أعبدُ الله الذي يتوفاكم، وأمرت أن أكون من المؤمنين، وأن اقيم وجهي للدين حنيفاً مائلاً عن دينكم ودنياكم، كما قال القائل:\n\nقال آخر:\n\n{ ولا تدع من دون الله ما لا ينفعك ولا يضرك } ، وهو ما سوى الله، فليس بيد أحد ضر، ولا نفع، ولا جلب ولا دفع، قال في الحكم: \" لا ترفعنَّ إلى غيره حاجة هو مُوردها عليك، فكيف يرفع إلى غيره ما كان هو له واضعا؟! من لا يستطيع أن يرفع حاجته عن نفسه فكيف يستطيع أن يكون لها عن غيره رافعاً؟! \"\n قال بعضهم: من اعتمد على غير الله فهو في غرور لأن الغرور ما لا يدوم، ولا يدوم شيء سواه، وهو الدائم القديم، لم يزل ولا يزال، عطاؤه وفضله دائمان، فلا تعتمد إلا على من يدوم عليك منه الفضل والعطاء، في كل نفس وحين وأوان وزمان\n هـ\n  وقال وهب بن منبّه: أوحى الله إلى داود عليه السلام:\n\n \" يا داود أما وعزتي وجلالي وعظمتي لا ينتصر بي عبد من عبادي دون خلقي، أعلم ذلك من نيته فتكيده السماوات السبع ومن فيهن، والأرضون السبع ومن فيهن، إلا جعلت له منهن فرجاً ومخرجاً، أما وعزتي وجلالي لا يعتصم عبد من عبادي بمخلوق دوني، أعلم ذلك من نيته إلا قطعت أسباب السماوات من يده، وأسخطتُّ الأرض من تحته ولا أُبالي في أي وادٍ هلك \" \n\nهـ\n وقال بعضهم: قرأت في بعض الكتب: أن الله عز وجل يقول:\n\n \" وعزتي وجلالي، وجودي وكرمي، وارتفاعي فوق عرشي في عُلو مكاني، لأقطعن آمال كل مؤمّل لغيري بالإياس، ولأكسونه ثوب المذلة بين الناس، ولأنحينَّه من قربي، ولأقطعنه من وصلي، أيؤمِّل غيري في النوائب، والشدائدُ بيدي، وأنا الحي، ويُرجى غيري ويقرع بالفكر باب غيري، وبيدي مفاتح الأبواب، وهي مغلقة وبابي مفتحوح لمن دعاني، ومن ذا الذي أملني لنائبة فقطعت به دونها؟ ومن ذا الذي رجاني بعظيم جرمه فقطعت رجاءه مني؟ ومن ذا الذي قرع بابي فلم أفتح له؟ جَعلت آمال خلقي بيني وبينهم متصلة، فقطعت بغيري، وجعلت رجاءهم مدخُوراً لهم عندي، فلم يرضوا بحفظي، وملأت سماواتي بمن لا يملُّون تسبيحي من ملائكتي، وأمرتهم ألا يغلقوا الأبواب بيني وبين عبادي، فلم يثقوا بقولي، ألم يعلم من طرقَتْه نائبة من نوائبي أنه لا يملك كشفها أحدٌ غيري؟ فما لي أراه بآماله مُعرضاً عني؟ وما لي أراه لاهياً إلى سواي، أعطيته بجودي ما لم يسألني ثم انتزعته منه فلم يسألني رده\n وسأل غيري، أفتراني أبداً بالعطية قبل المسألة ثم أسأل فلا أجيب سائلي؟ أبخيل أنا فيبخلني خلقي؟ أليس الدنيا والآخرة لي؟ أوَليس الجود والكرم لي؟ أوَليس أنا محل الآمال؟ فمن ذا الذي يقطعها دوني؟ وما عسى أن يؤمل المؤملون لو قُلت لأهل سمواتي وأهل أرضي: أمِّلوني، ثم أعطيتُ كل واحد منهم من الفكر مثل ما أعطيت الجميع، ما انتقص ذلك من ملكي عضو ذرَّة، وكيف ينقص ملك كامل أنا فيه؟\n فيا بؤس القانطين من رحمتي، ويا بؤسَ من عصاني ولم يراقبني، وثَبَ على محارمي ولم يَسْتَحِ منٍّي \"\n \n\nثم أزاح عذرهم بإرسال النذير، فقال: { قُلْ يٰأَيُّهَا ٱلنَّاسُ قَدْ جَآءَكُمُ ٱلْحَقُّ مِن رَّبِّكُمْ }\n\n",
      "translations": []
    }
  ]
}