{
  "chapter": "يونس",
  "text": "قل انظروا۟ ماذا فى السموت والارض وما تغنى الءايت والنذر عن قوم لا يؤمنون",
  "translations": [
    {
      "translation": "Say: 'Look at what there is in the heavens and on the earth.' But Signs and warnings are of no avail to people who have no iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Observe all there is in the heavens and the earth.\" But signs or warnings will be of no avail to those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: 'Observe carefully all that is in the heavens and the earth.' But no signs and warnings can avail those who are bent on not believing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them to consider that which is in the heavens and the earth. Evidence and warnings are of no avail to the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Observe what is in the heavens and the earth”; and the signs and the Noble Messengers do not benefit the people who are not destined to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Behold all that is in the heavens and the earth.\" But neither Ayat nor warners benefit those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Consider what is it that is in the heavens and the earth; and signs and warners do not avail a people who would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Behold what is in the heavens and in the earth!' But neither signs nor warnings avail a people who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Behold what is in the heavens and the earth! But revelations and warnings avail not folk who will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Look at whatever [exists] in heavens and on earth.\" But signs and warnings do not benefit the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: behold that which is in the heavens and the earth; and signs and warnings avail not those who will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Observe what is in the heavens and the earth.’ But neither signs nor warnings avail a people who have no faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Behold all that is in the heavens and on earth\"; but neither Signs nor Warners profit those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Behold all that is in the heavens and the earth,\" but neither Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) nor warners benefit those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'See what is in the heavens and the earth' But neither signs nor warnings help the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Look at what is in the heavens and the earth.” But signs and warnings are of no avail for people who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Observe what is in the heavens and earth.\" But of no avail will be signs or warners to a people who do not believe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:101] Say, to the disbelievers of Mecca: ‘Behold what is in the heavens and in the earth!’, of signs indicating God’s Oneness, exalted be He. But signs and warners (nudhur is the plural of nadhīr, that is, messengers) do not avail a folk who will not believe, according to God’s knowledge, in other words, these [signs and warners] will not benefit them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Behold what is in the heavens): the sun, the moon and the stars (and the earth) what is in the earth: the trees, beasts, mountains and oceans! These are all signs for you. (But revelations and warnings) the messengers (avail not folk who will not believe) as it is in Allah's foreknowledge.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلِ } لهم يا أكمل الرسل على مقتضى مرتبة النبوة؛ تهييجاً لهم وتحريكاً على استعدادهم وقابليتهم: { ٱنظُرُواْ } أيها المجبولون على النظر والتأمل { مَاذَا } أي: أي شيء وذات ظهر بجسب أسمائه وصفاته { فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: العلويات والسفليات والغيوب والشهادات { وَ } إن كان { مَا تُغْنِي } وتكفي { ٱلآيَاتُ } الدالة على وحدة الذات المتجلي في جميع الكوائن والجهات { وَٱلنُّذُرُ } المبين للآيات، المنبهين على مدلولاتها { عَن قَوْمٍ لاَّ يُؤْمِنُونَ } [يونس: 101] أي: لم يتعلق إرادة الله بإيماهم وتوحيدهم وعرفانهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ماذا إن كانت استفهامية علقت انظروا عن العمل، وإن كانت موصولة فمفعول به، وما تغني الآيات: يحتمل الاستفهام في محل نصب بتُغني، أو النفي\n ثم ننجي معطوف على محذوف دل عليه: إلا مثل أيام أي: فكانت عادتنا معهم أن نهلك المكذبين، ثم ننجي رسلنا ومن آمن معهم، و \" كذلك \" مصدر معمول لننجي، وحقاً اعتراض بينهما، وهو مصدر لفعل محذوف، أي: مثل ذلك الإنجاء ننجي المؤمنين يحق ذلك حقاً، وعلى هذا يوقف على: الذين آمنوا، ثم يُبْتدأ بقوله: كذلك حقاً\n\n\n الخ\n وقيل: خبر عن الذين آمنوا أي: والذين آمنوا مثلهم في الإنجاء، وهو ضعيف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:85",
      "similarity": 0.5713567017421944
    },
    {
      "verse": "7:110",
      "similarity": 0.5532935061091776
    },
    {
      "verse": "27:28",
      "similarity": 0.5285544495735166
    },
    {
      "verse": "4:39",
      "similarity": 0.50084105713194
    },
    {
      "verse": "26:35",
      "similarity": 0.4945912588171987
    }
  ]
}