{
  "chapter": "يونس",
  "text": "ثم ننجى رسلنا والذين ءامنوا۟ كذلك حقا علينا ننج المؤمنين",
  "translations": [
    {
      "translation": "Then We will rescue Our Messengers and those who have iman as well. It is incumbent upon Us to rescue the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We deliver our apostles and those who believe. As a matter of duty We save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, (when Allah's wrath falls upon the wicked) We save our Messengers and also those who believe. It is incumbent on Us to deliver the believers.' set fire to the whole city and its environs. The Assyrian king set his own palace ablaze and was himself burnt to death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We saved Our Messengers and those who believed; We must save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall save Our Noble Messengers and the believers – this is it; it is incumbent upon Our mercy to save the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We save Our Messengers and those who believe! Thus it is incumbent upon Us to save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We deliver Our apostles and those who believe-- even so (now), it is binding on Us (that) We deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall deliver Our Messengers and the believers. Even so, as is Our bounden duty, We shall deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then shall We save Our messengers and the believers, in like manner (as of old). It is incumbent upon Us to save believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall save Our messengers and those who believe. Thus We have made it incumbent upon Ourself to save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter We delivered Our apostles and those who believed. Even so, as incumbent upon us, We deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall deliver Our apostles and those who have faith. Thus, it is a must for Us to deliver the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the end We deliver Our messengers and those who believe: Thus is it fitting on Our part that We should deliver those who believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then (in the end) We save Our Messengers and those who believe! Thus it is incumbent upon Us to save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then we shall save Our Messengers and the believers. It is Our obligated duty, We shall save those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We save Our messengers and those who believe. It is binding on Us to save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will save our messengers and those who have believed. Thus, it is an obligation upon Us that We save the believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:103] Then We shall deliver (nunajjī: the imperfect tense is [being used] to narrate a past situation) Our messengers and the believers, from the chastisement. In like manner, to [that] deliverance, it is incumbent upon Us to deliver the believers, the Prophet (s) and his Companions, when [the time comes for] chastising the idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then shall We save Our messengers and the believers) in these messengers after the destruction of their people, (in like manner (as of old)) thus. (It is incumbent upon Us to save believers) with their messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:53",
      "similarity": 0.6037121987971661
    },
    {
      "verse": "41:18",
      "similarity": 0.6037121987971661
    },
    {
      "verse": "70:14",
      "similarity": 0.5705987067365985
    },
    {
      "verse": "10:86",
      "similarity": 0.5200012250515661
    },
    {
      "verse": "26:169",
      "similarity": 0.4633956433228047
    }
  ]
}