{
  "chapter": "يونس",
  "text": "واذا تتلى عليهم ءاياتنا بينت قال الذين لا يرجون لقاءنا ائت بقرءان غير هذا او بدله قل ما يكون لى ان ابدله من تلقائ نفسى ان اتبع الا ما يوحى الى انى اخاف ان عصيت ربى عذاب يوم عظيم",
  "translations": [
    {
      "translation": "When Our Clear Signs are recited to them, those who do not expect to meet Us say, 'Bring a Qur'an other than this one or change it.' Say: 'It is not for me to change it of my own accord. I follow nothing except what is revealed to me. I fear, were I to disobey my Lord, the punishment of a Dreadful Day.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear messages are recited to them, those who do not hope to meet Us, say: \"Bring a different Qur'an, or make amendments to this one.\" Say: \"It is not for me to change it of my will. I follow (only) what is revealed to me. If I disobey my Lord, I fear the punishment of an awful Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever Our clear revelations are recited to them, those who do not expect to meet Us say: 'Bring us a Qur'an other than this one, or at least make changes in it. Tell them (O Muhammad): 'It is not for me to change it of my accord. I only follow what is revealed to me. Were I to disobey my Lord, I fear the chastisement of an Awesome Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever Our authoritative revelations are recited to those who do not wish to meet Us in the life hereafter, say, \"Bring us another book besides this one or change it.\" (Muhammad), tell them, \"I can not change it myself. I only follow what is revealed to me. I fear that for disobeying my Lord I shall be punished on the great (Day of Judgment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear verses are recited to them, the people who do not expect to meet Us say, “Bring a Qur’an other than this one, or change it”; say (O dear Prophet Mohammed – peace and blessings be upon him), “I do not have the right to change it on my own; I only follow what is divinely revealed to me; if I were to disobey my Lord*, then I fear the punishment of the Great Day (of Resurrection). (* Which is impossible.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear Ayat are recited unto them, those who hope not for their meeting with Us, say: \"Bring us a Qur'an other than this, or change it.\" Say: \"It is not for me to change it on my own accord; I only follow that which is revealed unto me. Verily, I fear the torment of the Great Day (the Day of Resurrection) if I were to disobey my Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear communications are recited to them, those who hope not for Our meeting say: Bring a Quran other than this or change it. Say: It does not beseem me that I should change it of myself; I follow naught but what is revealed to me; surely I fear, if I disobey my Lord, the punishment of a mighty day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our signs are recited to them, clear signs, those who look not to encounter Us say, 'Bring a Koran other than this, or alter it.' Say: 'It is not for me to alter it of my own accord. I follow nothing, except what is revealed to me. Truly I fear, if I should rebel against my Lord, the chastisement of a dreadful day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear revelations are recited unto them, they who look not for the meeting with Us say: Bring a Lecture other than this, or change it. Say (O Muhammad): It is not for me to change it of my accord. I only follow that which is inspired in me. Lo! if I disobey my Lord I fear the retribution of an awful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear revelations are recited to them, those who do not expect to meet Us say, \"Bring us a different Quran, or make some changes in it.\" Say, \"It is not for me to change it of my own accord. I follow only what is revealed to me. I fear, if I were to disobey my Lord, the punishment on a Dreadful Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever Our manifest revelations are rehearsed unto them, those who hope not for the meeting with Us, say: bring us a Qur'an other than this, or change it. Say thou: it lieth not with me to change it of my own accord; I only follow that which is Revealed unto me; verily I fear, if I disobey my Lord, the torment of the Mighty Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our manifest signs are recited to them, those who do not expect to encounter Us say, ‘Bring a Quran other than this, or alter it.’ Say, ‘I may not alter it of my own accord. I follow only what is revealed to me. Indeed should I disobey my Lord, I fear the punishment of a tremendous day.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when Our Clear Signs are rehearsed unto them, those who rest not their hope on their meeting with Us, Say: \"Bring us a reading other than this, or change this,\" Say: \"It is not for me, of my own accord, to change it: I follow naught but what is revealed unto me: if I were to disobey my Lord, I should myself fear the penalty of a Great Day (to come).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Verses are recited unto them, those who hope not for their meeting with Us, say: Bring us a Quran other than this, or change it.\"Say (O Muhammad SAW): \"It is not for me to change it on my own accord; I only follow that which is revealed unto me. Verily, I fear if I were to disobey my Lord, the torment of the Great Day (i.e. the Day of Resurrection).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our verses, clear verses, are recited to them, those who do not reckon to meet Us say: 'Bring a Koran other than this, or make changes in it' Say: 'It is not for me to change it by myself. I follow nothing, except what is sent down to me. Indeed, if I should rebel against my Lord I fear the punishment of a Great Day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear revelations are recited to them, those who do not hope to meet Us say, “Bring a Quran other than this, or change it.” Say, “It is not for me to change it of my own accord. I only follow what is revealed to me. I fear, if I disobeyed my Lord, the torment of a terrible Day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to them as clear evidences, those who do not expect the meeting with Us say, \"Bring us a Qur'an other than this or change it.\" Say, [O Muhammad], \"It is not for me to change it on my own accord. I only follow what is revealed to me. Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:15] And when Our clear, manifest (bayyināt is a circumstantial qualifier), verses, [from] the Qur’ān, are recited to them, those who do not expect to encounter Us, those who do not fear the Resurrection, say, ‘Bring a Qur’ān other than this, one in which our gods are not denigrated, or change it’, of your own accord. Say, to them: ‘It is not for me to change it of my own accord. I only follow that which is revealed to me. Truly I fear, if I should disobey my Lord, by changing it, the chastisement of a dreadful day’, that is, the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Our clear revelations) detailing commands and prohibitions (are recited unto them) are recited by you unto the scoffers: al-Walid Ibn al-Mughirah and his host (they who look not for the meeting with Us) those who do not fear resurrection after death while at the same time scoff (say: Bring) Muhammad (a Lecture other than this, or change it) putting the verses of mercy in the place of the verses of chastisement and the verses of chastisement in place of the verses of mercy. (Say) to them, Muhammad: (It is not for me) it is not permissible for me (to change it of my own accord. I only follow that which is inspired in me) I do not say or do except that which is revealed to me in the Qur'an. (Lo! If I disobey my Lord) by changing the revelation (I fear) I know (the retribution of an awful Day) a severe Day.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم كانوا من شدة انهماكهم في الغفلة والضلال { إِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ } أي: مع كونها مبينات لأحوال النشأة الأخرى وأهوال عذابها ونكالها { قَالَ } الكافرون: { ٱلَّذِينَ لاَ يَرْجُونَ لِقَآءَنَا } بل ينكرون الحشر والنشر\n والثواب والعقاب\n وجميع ما يترتب على النشأة الأخرى\n فكيف لقاءنا فيها { ٱئْتِ } أيها الداعي من عند ربك { بِقُرْآنٍ غَيْرِ هَـٰذَآ } القرآن إن أردت أن نؤمن لك { أَوْ بَدِّلْهُ } وغيِّر بعض آياته المشتملة على الإنذارات والتخويفات الشديدة\n فإنا لا طاقة لنا بها\n\n\nإنما يقصدون بقولهم هذا استهزاءً وسخريةً برسول الله\n واستخفافاً بكتاب الله { قُلْ } يا أكمل الرس في جوابهم: { مَا يَكُونُ } أي: ما يصح ويجوز { لِيۤ أَنْ أُبَدِّلَهُ } وأحرفه { مِن تِلْقَآءِ نَفْسِيۤ } على مقتضى أهويتكم الفاسدة { إِنْ أَتَّبِعُ } أي: ما أتبع وانتطر { إِلاَّ مَا يُوحَىۤ إِلَيَّ } وليس في وسعي وطاقتي سوى الاتباع والانتظار\n وكيف أتصرف فيه { إِنِّيۤ أَخَافُ } بمجرد استماع قولكم هذا العصيان على نفسي\n فكيف { إِنْ عَصَيْتُ } بقصد التبديل والتغير؟ { رَبِّي } استوجبت { عَذَابَ يَوْمٍ عَظِيمٍ } [يونس: 15] كما استوجبتم بسوئكم هذا على سبيل الاقتراح والإلحاح\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وإذا تُتلى عليهم } يعني كفار قريش { آياتُنا بينات قال الذين لا يرجون لقاءنا } من المشركين { ائْتِ بقرآن غيرِ هذا } أي: بكتاب آخر ليس فيه ما نستبعده من البعث والحساب\n والعقاب بعد الموت\n أو ما ذكره من سب آلهتنا\n وعيب ديننا\n أو اجعل هذا الكلام الذي من قِبَلك على اختيارنا\n فأحل ما حرمته\n وحرم ما أحللته ليكون أمرنا واحداً وكلمتنا متصلة\n { أوبدِّلْه } بأن تجعل مكان الآية المشتملة على ذلك آية أخرى\n { قل } لهم يا محمد: { ما يكون }: ما يصح { لي أن أبدِّله من تلقاء نفسي }: من قِبل نفسي\n وإنما اكتفى بالجواب المذكور عن التبديل لاستلزام امتناعه امتناع الإتيان بقرآن آخر\n قل لهم: { إنْ } أي: ما { أتبعُ إلا ما يوحى إليَّ } \n لا أقدر أن أقول شيئاً من عندي\n قال البيضاوي: هو تعليل لما يكون\n فإن المتبع لغيره في أمر لم يستبد بالتصرف فيه بوجه\n وجواب للنقض بنسخ بعض الآيات لبعض\n ورد لما عَرّضوا له بهذا السؤال من أن القرآن كلامه واختراعُه\n ولذلك قيد التبديل في الجواب وسماه عصياناً فقال: { إني أخاف إن عصيتُ ربي عذاب يوم عظيم } يوم القيامة\n وفيه إيماء بأنهم استوجبوا العذاب بهذا الاقتراح\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:15",
      "similarity": 0.416946717259948
    },
    {
      "verse": "39:13",
      "similarity": 0.416946717259948
    },
    {
      "verse": "18:110",
      "similarity": 0.39452831535150384
    },
    {
      "verse": "28:86",
      "similarity": 0.3578586486138428
    },
    {
      "verse": "29:5",
      "similarity": 0.3369027283000816
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/10:15.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/10:15.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/10:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}