{
  "chapter": "يونس",
  "text": "فهل ينتظرون الا مثل ايام الذين خلوا۟ من قبلهم قل فانتظروا۟ انى معكم من المنتظرين",
  "translations": [
    {
      "translation": "What are they waiting for but the same fate as those who passed away before them? Say: 'Wait. I will be among the people waiting with you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can they expect anything but what the people before them had known? Say: \"Then wait. I am waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are they waiting for except to witness the repetition of the days of calamity that their predecessors witnessed? Tell them: 'Wait; I too am waiting with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What can they expect other than the kind of (punishment that befell the disbelieving people) who had gone before them? (Muhammad), tell them, \"Wait and I too will be waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So what are they waiting for, except the days similar to the days of those who passed away before them? Say, “Then wait! I too am waiting with you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do they wait save for the likes of the days of men who passed away before them Say: \"Wait then, I am waiting with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do they wait for then but the like of the days of those who passed away before them? Say: Wait then; surely I too am with you of those who wait.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do they watch and wait for aught but the like of the days of those who passed away before them? Say: 'Then watch and wait; I shall be with you watching and waiting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What expect they save the like of the days of those who passed away before them? Say: Expect then! I am with you among the expectant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What can they be waiting for but the punishment that came to those before them? Say, \"So wait; I am one of those waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wait they then aught but the days of those who have passed away before them. Say thou: wait then, verily I am with you among those who wait.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they await anything except the like of the days of those who passed away before them? Say, ‘Then wait! I too am waiting along with you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then expect (any thing) but (what happened in) the days of the men who passed away before them? Say: \"Wait ye then: for I, too, will wait with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do they wait for (anything) save for (destruction) like the days of the men who passed away before them? Say: \"Wait then, I am (too) with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they watch and wait for anything except for days similar to those who passed away before them? Say: 'Wait; I shall be with you among those who arewaiting'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they expect anything but the likes of the days of those who passed away before them? Say, “Then wait, I will be waiting with you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do they wait except for like [what occurred in] the days of those who passed on before them? Say, \"Then wait; indeed, I am with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:102] What do they await, when they deny you, but the like of the days of those who passed away before them?, of communities, that is, the like of chastisements that befell them. Say: ‘Then await, this: I shall indeed be with you among the waiting’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(What expect they) is there any sign left for them (save the like of the days of those who passed away) except the punishment of those who passed away (before them) among the disbelievers? (Say) Muhammad: (Expect then!) the descent of punishment and my own destruction! (I am with you among the expectant) of the descent of punishment and destruction upon you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَهَلْ يَنتَظِرُونَ } أي: ما ينتظرون أولئك المتمردون على الإيمان { إِلاَّ مِثْلَ } ما وقع على أمثالهم من الخسف والكسف والغرق وغير ذلك من المعايب التي وقعت في { أَيَّامِ } المشركين { ٱلَّذِينَ خَلَوْاْ } ومضوا { مِن قَبْلِهِمْ } فإن عارضوا معك بمثل ما عارضت معهم مثل ما سلف من أسلافهم مع أنبيائهم ورسلهم { قُلْ } لهم تبكيتاً وإلزاماً: { فَٱنْتَظِرُوۤاْ } لمقتي وهلاكي { إِنِّي مَعَكُمْ مِّنَ ٱلْمُنْتَظِرِينَ } [يونس: 102] لكن لمقتكم وهلاككم\n فالأمر بيد الله وقبضة قدرته ومشيئته\n\n\n{ ثُمَّ } بعدما أهلكنا الأمم الماضية بتكذيبهم الرسل وإصرارهم على الكفر والشرك { نُنَجِّي } مما أصابهم { رُسُلَنَا } الذين أرسلناهم إليهم { وَ } ننجي أيضاً { ٱلَّذِينَ آمَنُواْ } بنا وصدقوا رسلنا وانقادوا بما جاءوا به { كَذَلِكَ } أي: مثل إنجائنا إياهم { حَقّاً عَلَيْنَا } تفضلاً منا وامتناناً على عبادنا { نُنجِ } جميع { ٱلْمُؤْمِنِينَ } [يونس: 103] المنقادين لرسلنا المتدينين بديننا\n على ذلك جرت سنتنا\n\n\n{ قُلْ } يا أكمل الرسل للمتردين في أمرك ودينك المتمردين عن إطاعتك وانقيادك: { يٰأَيُّهَا ٱلنَّاسُ } المجبولون على الغفلة والنسيان { إِن كُنتُمْ فِي شَكٍّ } وريب { مِّن دِينِي } الذي هو أسدّ الأديان وأصحها وأشملها وأشرف الملل وأكملها\n إذ هو مرجع كل الأديان كما هو مبدؤه\n لابتنائه على توحيد الذات التي اضمحلت دونها جميع الكثرات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يقول الحق جل جلاله: { قل } للمشركين الذين طلبوا منك الآية: { انظروا ماذا في السماوات والأرضِِ } من الآيات والعِبَر، وعجائب الصنع ليدلكم على وحدانية الله تعالى، وكمال قدرته، ثم بيَّن أن الآيات لا تفيد من سبق عليه الشقاء، فقال: { وما تُغني الآياتُ والنُّذُرُ عن قوم لا يؤمنون } في علم الله وحُكمه، ثم هددهم بالهلاك فقال: { هل ينتظرون إلا مثل أيام الذين خلوا من قبلهم } أي: مثل وقائعهم ونزول العذاب بهم إذ لا يستحق غيره، فهو من قولهم: أيام العرب، لوقائعها\n { قل } لهم: { فانتظروا } هلاككم { إني معكم من المنتظِرِين } لذلك، أو فانتظروا هلاكي إني معكم من المنتظرين هلاككم، { ثم نُنَجِّي رُسُلَنا } أي: عادتنا أن ننجي رسلنا { والذين آمنوا } معهم من ذلك الهلاك، { كذلك حقاً علينا ننج المؤمنين } من أصحاب محمد صلى الله عليه وسلم حين نُهلك المجرمين حقاً واجباً علينا كما هي عادتنا مع من تحبب إلينا بالإيمان والطاعة\n الإشارة: أمر الحق ـ جل جلاله ـ أهل النظر والاستبصار بأن ينظروا ماذا في السماوات والأرض من الأسرار والأنوار، أمرهم أن يشاهدوا أسرار الذات وأنوار الصفات، دون الوقوف مع الأجرام الحسِّيات، أمرهم أن ينظروا المعاني خلف رقة الأواني، لا أن يقفوا مع الأواني، وإليه أشار ابن الفارض في خمريته، حيث قال:\n\nفالأكوان كلها أواني حاملة للطف المعاني، وأصل الأواني معاني، تحسست وتكثفت فمن لطَّف الأواني وذوّبها بفكرته رجعت معاني، واتصلت المعاني بالمعاني، وغابت حينئذٍ الأواني، ولا يعرف هذا إلا من صحب أهل المعاني، وهم أهل الفناء والبقاء، ومن لم يصحبهم فحسبه الوقوف مع الأجرام الحسية، ويستعمل فكرة التصديق والإيمان، وهي عبادة التفكر والاعتبار والأولى فكرة أهل الشهود والاستبصار، وفي أمثالهم قال الشاعر:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:4",
      "similarity": 0.5758919169832871
    },
    {
      "verse": "24:34",
      "similarity": 0.5121711214888394
    },
    {
      "verse": "35:24",
      "similarity": 0.5072554331925923
    },
    {
      "verse": "46:18",
      "similarity": 0.5064846136473159
    },
    {
      "verse": "2:14",
      "similarity": 0.48725156885740445
    }
  ]
}