{
  "chapter": "يونس",
  "text": "ولقد اهلكنا القرون من قبلكم لما ظلموا۟ وجاءتهم رسلهم بالبينت وما كانوا۟ ليؤمنوا۟ كذلك نجزى القوم المجرمين",
  "translations": [
    {
      "translation": "We destroyed generations before you when they did wrong. Their Messengers brought them the Clear Signs, but they were never going to have iman. That is how We repay evildoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations did We lay low before you when they became wilfully unjust. Their apostles had brought clear proofs to them, yet they never believed. So We punished the sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We destroyed the nations (which had risen to heights of glory in their times) before you when they indulged in wrong-doing and refused to believe even when their Messengers brought clear signs to them. Thus do We recompense the people who are guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We destroyed certain generations who lived before you because of their injustice. Our Messengers came to them and showed them miracles, but they would not believe. Thus do We punish the criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We destroyed several generations before you when they crossed the limits – and their respective Noble Messengers came to them with clear proofs, but they were not such as would believe; this is how We reward the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We destroyed generations before you when they did wrong, while their Messengers came to them with clear proofs, but they were not such as to believe! Thus do We requite the people who are criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We did destroy generations before you when they were unjust, and their apostles had come to them with clear arguments, and they would not believe; thus do We recompense the guilty people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We destroyed the generations before you when they did evil, and their Messengers came to them with the clear signs, but they would not believe; so We recompense the people of the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We destroyed the generations before you when they did wrong; and their messengers (from Allah) came unto them with clear proofs (of His Sovereignty) but they would not believe. Thus do We reward the guilty folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, before your time We destroyed [whole] generations when they [persistently] did evil; their messengers came to them with clear signs, but they would not believe. Thus We requite the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have destroyed the generations before you when they did wrong, while their apostles came unto them with the evidences, and they were not such as to believe. In this wise We requite the sinning people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We destroyed generations before you when they perpetrated wrongs: their apostles brought them manifest proofs, but they would not have faith. Thus do We requite the guilty lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Generations before you We destroyed when they did wrong: their messengers came to them with clear-signs, but they would not believe! thus do We requite those who sin!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We destroyed generations before you, when they did wrong while their Messengers came to them with clear proofs, but they were not such as to believe! Thus do We requite the people who are Mujrimun (disbelievers, polytheists, sinners, criminals, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We destroyed generations before you when they did evil. (When) their Messengers came to them with clear verses they would not believe; so We recompense the sinning nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We destroyed generations before you when they did wrong. Their messengers came to them with clear signs, but they would not believe. Thus We requite the sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had already destroyed generations before you when they wronged, and their messengers had come to them with clear proofs, but they were not to believe. Thus do We recompense the criminal people\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:13] And indeed We have destroyed generations, communities, before you, O people of Mecca, when they did evil, by way of idolatry, and, indeed, their messengers brought them clear proofs, indicating their truthfulness; but they would not believe (wa-mā kānū li-yu’minū: this is a supplement to zalamū, ‘they did evil’). So, just as We destroyed those, We shall requite the sinning, the unbelieving, folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "213 (We destroyed the generations before you when they did wrong) when they disbelieved; (and their messengers (from Allah) came unto them with clear proofs) with commands, prohibitions and signs (but they would not believe) He says: they did not believe in that which they disbelieved in on the day of the covenant. (Thus do We reward the guilty folk) We reward the idolaters with destruction:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه مهدداً مقسماً: { وَ } الله يا أهل مكة { لَقَدْ أَهْلَكْنَا } بمقتضى قهرنا وجلالنا { ٱلْقُرُونَ } الماضية { مِن قَبْلِكُمْ لَمَّا ظَلَمُواْ } أي: حين ظلموا مثل ظلمكم، وخرجوا عن إطاعة الله وإقامة حدوده مثل خروجكم { وَ } هم أيضاً أمثالكم، قد { جَآءَتْهُمْ رُسُلُهُم بِٱلْبَيِّنَاتِ } بالبراهين القاطعة، والحجج الساطعة الدالة على صدقهم؛ إنما جاءهم ليمتنعوا عمَّا هم عليه من الظلم والفساد { وَمَا كَانُواْ } أي: أولئك الأمم { لِيُؤْمِنُواْ } لهم، ويصدقوهم فيما جاءوا به أمثالكم، بل كذبوهم وأصروا لهم على ما هم عليه، بل زادوا عليها؛ عناداً ومكابرةً، فأخذناهم بظلمهم، وأهلكناهم بإصرارهم بعدما نبهنا عليهم فلم ينتبهوا { كَذٰلِكَ نَجْزِي ٱلْقَوْمَ ٱلْمُجْرِمِينَ } [يونس: 13] المصرين على الجرم مع ورود الزواجر والروادع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:78",
      "similarity": 0.4874653502985496
    },
    {
      "verse": "28:43",
      "similarity": 0.4726093846899121
    },
    {
      "verse": "44:37",
      "similarity": 0.455414148807649
    },
    {
      "verse": "37:51",
      "similarity": 0.45122551950864653
    },
    {
      "verse": "36:31",
      "similarity": 0.44161190222328317
    }
  ]
}