{
  "chapter": "يونس",
  "text": "فمن اظلم ممن افترى على الله كذبا او كذب بـايته انه لا يفلح المجرمون",
  "translations": [
    {
      "translation": "Who could do greater wrong than someone who invents lies against Allah or denies His Signs? Evildoers are certainly not successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than he who imputes lies to God or denies His revelations? The sinners will surely not be reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, then, is a greater wrong-doer than he who forges a lie against Allah or rejects His signs as false? Surely the guilty shall not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than one who invents falsehood against God or calls His revelations lies? The criminals will certainly have no happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who is more unjust than one who fabricates a lie concerning Allah and denies His signs? Indeed the guilty shall never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who does more wrong than he who forges a lie against Allah or denies His Ayat Surely, the criminals will never be successful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is then more unjust than who forges a lie against Allah or (who) gives the lie to His communications? Surely the guilty shall not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who forges against God a lie, or cries lies to His signs? Surely the sinners do not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doeth greater wrong than he who inventeth a lie concerning Allah and denieth His revelations? Lo! the guilty never are successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than the man who invents a falsehood about God or denies His signs? Surely, the guilty shall never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who then is a greater wrong doer than he who fabricateth a lie against Allah or belieth His revelations? Verily He will not let the culprits fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who is a greater wrongdoer than him who fabricates a lie against Allah, or denies His signs? Indeed the guilty will not be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doth more wrong than such as forge a lie against Allah, or deny His Signs? But never will prosper those who sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who does more wrong than he who forges a lie against Allah or denies His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.)? Surely, the Mujrimun (criminals, sinners, disbelievers and polytheists) will never be successful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater evil than he who forges a lie about Allah or belies His verses? Indeed, the evildoers do not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than someone who fabricates lies about God, or denies His revelations? The guilty will never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who is more unjust than he who invents a lie about Allah or denies His signs? Indeed, the criminals will not succeed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:17] And who, that is, no one, does greater evil than he who invents a lie against God, by ascribing a partner to Him, or denies His signs?, [denies] the Qur’ān. Surely, it is that, the sinners, the idolaters, shall not prosper, they shall [never] find happiness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who doeth greater wrong) who is more insolent and daring vis-a-vis Allah (than he who inventeth a lie concerning Allah and denieth His revelations) Muhammad (pbuh) and the Qur'an? (Lo! the guilty) the idolaters (never are successful) they will never be saved or safe from Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَمَنْ أَظْلَمُ مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً } ونسب إليه ما لم يصدر عنه\n افتراءً ومراءً { أَوْ كَذَّبَ بِآيَـٰتِهِ } التي صدرت عنه\n ونزلت على رسله وأنبيائه\n لإصلاح أحوال عباده\n وإرشادهم مبدأه ومعاده\n وبالجملة: { إِنَّهُ } سبحانه { لاَ يُفْلِحُ ٱلْمُجْرِمُونَ } [يونس: 17] المفترون عليه بالأباطيل الزائفة\n المكذبون كلامه المنزل من عنده على رسله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:21",
      "similarity": 0.8838980852906965
    },
    {
      "verse": "10:69",
      "similarity": 0.7810682596279714
    },
    {
      "verse": "3:94",
      "similarity": 0.5095269033278541
    },
    {
      "verse": "16:105",
      "similarity": 0.4969907301104509
    },
    {
      "verse": "2:5",
      "similarity": 0.48311860697043746
    }
  ]
}