{
  "chapter": "يونس",
  "text": "الر تلك ءايت الكتب الحكيم",
  "translations": [
    {
      "translation": "Alif Lam Ra Those are the Signs of the Wise Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALIF LAM RA. These are the verses of the authoritative Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. These are the verses of the Book overflowing with wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. These are the verses of the Book of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra*; these are verses of the Book of wisdom. (*alphabets of the Arabic language; Allah and to whomever He reveals, know their precise meanings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra. These are the verses of the Book (the Qur'an) Al-Hakim.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra. These are the verses of the wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra. Those are the signs of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. These are verses of the Wise Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra. These are the verses of the Book of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra. These are the verses of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Ra. These are the signs of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A. L. R. These are the ayats of the Book of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]. These are the Verses of the Book (the Quran) Al-Hakim [showing lawful and unlawful things, explaining Allah's (Divine) Laws for mankind, leading them to eternal happiness by ordering them to follow the true Islamic Monotheism, - worshipping none but Allah Alone - that will guide them to Paradise and save them from Hell].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "AlifLaamRa. Those are the verses of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Ra. These are the Verses of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Ra. These are the verses of the wise Book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:1] Alif lām rā’: God knows best what He means by these [letters]. Those, namely, these signs, are the signs of the wise Book, that is, the Qur’ān (the genitive annexation [āyāt al-kitāb] has the meaning of min [sc. min āyāti’l-kitāb, ‘from among the verses of the Book’]), which has been made clear.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتقدم القول في الحروف الواقعة في فواتح بعض السور في أول سورة البقرة فهي بمنزلة الأعداد المسرودة ، لا محل لها من الإعراب ، ولا يُنطق بها إلا على حال السكت ، وحالُ السكت يعامَل معاملة الوقف ، فلذلك لا يُمد اسم رَا في الآية ، وإن كان هو في اللغة بهمزة في آخره لأنه بالسكت تحذف الهمزة كما تحذف في الوقف لثقل السكوت على الهمزة في الوقف والسكت ، فبذلك تصير الكلمة على حرفين فلا تمد . ولذلك أجمع القراء على عدم مد الحروف : را . ها . يا . طا . حا . التي في أوائل السور وإن كانت تلك الأسماء ممدودة في استعمال اللغة .اسم الإشارة يجوز أن يكون مراداً به جميع آي القرآن التي نزلت قبل هذه السورة باعتبار حضور تلك الآيات في أذهان الناس من المؤمنين وغيرهم ، فكأنها منظورة مشاهدة ، فصحت الإشارة إليها إذ هي متلوة محفوظة فمن شاء أن يسمعها ويتدبرها أمكنه ذلك ولأن الخوض في شأنها هو حديث الناس في نواديهم وأسمارهم وشغلهم وجدالهم ، فكانت بحيث تتبادر إلى الأذهان عند ورود الإشارة إليها .واسمُ الإشارة يُفسر المقصودَ منه خبرُه وهو { آيات الكتاب الحكيم } كما فسره في قوله تعالى : { فهذا يومُ البعث } \\[ الروم : 56 \\] وقوله تعالى : { قال هذا فراقُ بيني وبينك } \\[ الكهف : 78 \\]. قال في «الكشاف» : تصَوَّر فراقاً بينهما سيقع قريباً فأشار إليه بهذا .وقد تقدم شيء من هذا المعنى عند قوله تعالى : { ذلك هدى الله يهدى به من يشاء من عباده } في سورة \\[ الأنعام : 88 \\]. فالمقصود من الإشارة إما الحث على النظر في آيات القرآن ليتبين لهم أنه من عند الله ويعلموا صدق من جاءهم به . وإما إقناعهم من الآيات الدالة على صدق النبي بآيات الكتاب الحكيم فإنهم يسألون النبي آيةً على صدقه ، كما دل عليه قوله في هذه السورة \\[ يونس : 15 \\] { وإذا تتلى عليهم آياتنا بينات قال الذين لا يرجون لقاءنا ائتتِ بقرآن غير هذا أو بَدله } فقيل لهم { تلك آيات الكتاب الحكيم } ، أي ما هو آية واحدة بل آيات كثيرة ، فإن الإعجاز حاصل بكل سورة منه .ولأنه اشتمل على الحقائق السامية والهدى إلى الحق والحكمة؛ فرجل أمي ينشأ في أمة جاهلة يجيء بمثل هذا الهدى والحكمة لا يكون إلا موحى إليه بوحي إلهي ، كما دل عليه قوله تعالى : { وما كنت تتلو من قبله من كتاب ولا تخطه بيمينك إذاً لارْتاب المبطلون } \\[ العنكبوت : 48 \\].وعليه فاسم الإشارة مبتدأ و { آيات } خبره . وإضافة { آيات } إلى { الكتاب } إضافة شبيهة بالبيانية وإن كان الكتاب بمنزلة الظرف للآيات باختلاف الاعتبار ، وهو معنى الإضافة البيانية عند التحقيق .ويجوز أن تجعل الإشارة ب { تلك } إلى حروف { ألر } لأن المختار في الحروف المقطعة في فواتح السور أن المقصود من تعدادها التحدي بالإعجاز ، فهي بمنزلة التهجي للمتعلم .فيصح أن يجعل ( ألر ) في محل ابتداء ويكون اسم الإشارة خبراً عنه . والمعنى تلك الحروف آيات الكتاب الحكيم ، أي من جنسها حروف الكتاب الحكيم ، أي جميع تراكيبه من جنس تلك الحروف .والمقصود تسجيل عجزهم عن معارضته بأن آيات الكتاب الحكيم كلها من جنس حروف كلامهم فما لكم لا تستطيعون معارضتها بمثلها إن كنتم تكذّبون بأن الكتاب منزل من عند الله ، فلولا أنه من عند الله لكان اختصاصه بهذا النظم المعجز دون كلامهم محالاً إذ هو مركب من حروف كلامهم .والكتاب : القرآن . فالتعريف فيه للعهد . ويجوز جعل التعريف دالاً على معنى الكمال في الجنس ، كما تقول : أنتَ الرجل .والحكيم : وصف إما بمعنى فاعل ، أي الحاكم على الكتب بتمييز صحيحها من محرفها ، مثل قوله : { ومُهيمِناً عليه } \\[ المائدة : 48 \\] ، وقوله : { وأنزل معهم الكتاب بالحق ليحكم بين الناس فيما اختلفوا فيه } \\[ البقرة : 213 \\].وإما بمعنى مُفعَل بفتح العين ، أي مُحكَم ، مثل عَتِيد ، بمعنى مُعَد .وإما بمعنى ذي الحِكمة لاشتماله على الحكمة والحق والحقائق العالية ، إذ الحكمة هي إصابة الحق بالقول والعمل فوُصف بوصف ذي الحكمة من الناس على سبيل التوسع الناشىء عن البليغ كقول الأعشى: ... وغريبةٍ تأتي الملوك حَكِيمةقد قلتُها ليقال مَن ذَا قالها ... وإما أن يكون وُصِفَ بوصف منزّله المُتكلم به ، كما مشَى عليه صاحب «الكشاف» عند قوله تعالى : { يس والقرآن الحكيم إنك لمن المرسلين } \\[ يس : 1 ، 3 \\]واختيار وصف { الحكيم } من بين أوصاف الكمال الثابتة للقرآن؛ لأن لهذا الوصف مزيد اختصاص بمقام إظهار الإعجاز من جهة المعنى بعد إظهار الإعجاز من جهة اللفظ بقوله : { الر تلك آيات الكتاب الحكيم } ، ولِما اشتملت عليه السورة من براهين التوحيد وإبطال الشرك .وإلى هذا المعنى يشير قوله بعد هذا : { قل لو شاء الله ما تلوته عليكم ولا أدراكم به فقد لبثتُ فيكم عمراً من قبله أفلا تعقلون } \\[ يونس 16 \\].\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning Allah's saying (Alif. Lam. Ra): '(Alif. Lam. Ra.) Allah says: I am Allah: I see; it is also said that it is an oath by which Allah swore. (These are verses of the wise Scripture) this surah consists of the verses of the clear Qur'an, expositing the lawful and the prohibited.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الر } إشارة إلى الرحمة التي هي الذات المحمدية لقوله تعالى:\n[الأنبياء\n الآية: 107]\n و ا ل مرّ ذكرهما { تلك } أي: ما أُشير إليه بهذه الحروف أركان كتاب الكل ذي الحكمة أو المحكم المتقن تفاصيله أو أقسم بالله باعتبار الهوية الأحدية جمعاً وباعتبار الصفة الواحدية تفصيلاً في باطن الجبروت وظاهر الرحموت على ما ذكر أو على أن تلك الآيات المذكورة في السورة { آيات الكتاب } ذي الحكمة { أكان للناس عجباً } إلى آخره",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ الۤر } أيها الإنسان اللبيب\n الرشيد\n اللائق للرسالة العامة\n والرئاسة الكلية الكاملة الشاملة على كافة البرايا { تِلْكَ } الآيات المنزلة في هذه السورة { آيَاتُ ٱلْكِتَابِ ٱلْحَكِيمِ } [يونس: 1] أي: بعض آيات الكتاب الإلهي الذي هو حضرة علمه ولوح قضائه\n ناطقة بالصدق والصواب على مقتضى الحكمة المتقنة الإلهية\n نازلة من عنده\n لتصديقك وتأييدك يا أكمل الرسل في تبشيراتك وإنذاراتك\n ونبوتك ورسالتك وإرشادك لأهل الغي والضلال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: عجباً خبر كان\n واسمها: أن أوحينا\n ومن قرأ بالرفع فالأمر بالعكس\n أو كان تامة\n واللام متعلقة بعجباً\n وهو مصدر للدلالة على أنهم جعلوه أعجوبة لهم\n يتوجهون نحوه بإنكارهم واستهزائهم\n  قال في المغني: المصدر الذي ليس في تقدير حرف الموصول وصلته لا يمنع التقديم عليه\n على أن السعد قال في المطوّل: إن معمول المصدر إذا كان ظرفاً أو شبهة\n الأظهر أنه جائز التقديم\n قال تعالى:\n[الصافات: 102]\n\n[النور: 2] مثل هذا كثير في الكلام\n وليس كل ما أول بشيء حكمُه حكم ما أول به\n مع أن الظرف مما يكفيه رائحة الفعل لأن له شأناً ليس لغيره لتنزله من الشيء منزلة نفسه لوقوعه فيه وعدم انفكاكه عنه\n ولهذا اتسع في الظروف ما لم يتسع في غيرها\n هـ\n يقول الحق جل جلاله: أيها الرسول المجتبى المختار { تلك } الآيات التي تنزل عليك هي { آياتُ الكتاب الحكيم } \n الذي اشتمل على الحكم الباهرة والعبر الظاهرة\n أو المحكم الذي لم ينسخ منه شيء بكتاب آخر بعده\n أو كلام حكيم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:2",
      "similarity": 1.0
    },
    {
      "verse": "12:1",
      "similarity": 0.6514322170691536
    },
    {
      "verse": "26:2",
      "similarity": 0.6514322170691536
    },
    {
      "verse": "28:2",
      "similarity": 0.6514322170691536
    },
    {
      "verse": "24:18",
      "similarity": 0.6314875031096583
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}