{
  "chapter": "يونس",
  "text": "قل لو شاء الله ما تلوته عليكم ولا ادرىكم به فقد لبثت فيكم عمرا من قبله افلا تعقلون",
  "translations": [
    {
      "translation": "Say: 'Had Allah so wished, I would not have recited it to you nor would He have made it known to you. I lived among you for many years before it came. Will you not use your intellect?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Had God pleased I would never have recited it to you, nor would He have given you comprehension of it. (Remember that I am one of you) and have lived a whole life with you before (its revelation). Even then you do not understand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: 'Had Allah so willed, I would not have recited the Qur'an to you, nor would Allah have informed you of it. I have spent a lifetime among you before this. Do you, then, not use your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"Had God wanted I would not have recited it (the Book) to you nor would I have told you anything about it. I lived among you for a whole life-time before it was revealed. Will you then not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Had Allah willed I would not have recited it to you nor would He have made it known to you; so before this* I have spent an age among you; so do you not have sense?” (* Before Allah’s command to recite the Qur’an to you.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If Allah had so willed, I should not have recited it to you nor would He have made it known to you. Verily, I have stayed among you a lifetime before this. Have you then no sense\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If Allah had desired (otherwise) I would not have recited it to you, nor would He have taught it to you; indeed I have lived a lifetime among you before it; do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Had God willed I would not have recited it to you, neither would He have taught you it; I abode among you a lifetime before it -- will you not understand?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If Allah had so willed I should not have recited it to you nor would He have made it known to you. I dwelt among you a whole lifetime before it (came to me). Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If God had so wished, I would not have recited it to you, nor would He have brought it to your knowledge. Indeed, I have spent a whole lifetime among you before it came to me. How can you not use your reason?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: had Allah so willed. Would not have rehearsed it unto you, nor would He have acquainted you therewith. Of a surety I have tarried among you a lifetime before it. Would ye not then reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Had Allah [so] wished, I would not have recited it to you, nor would He have made it known to you, for I have dwelled among you for a lifetime before it. Do you not exercise your reason?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If Allah had so willed, I should not have rehearsed it to you, nor would He have made it known to you. A whole life-time before this have I tarried amongst you: will ye not then understand?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"If Allah had so willed, I should not have recited it to you nor would He have made it known to you. Verily, I have stayed amongst you a life time before this. Have you then no sense?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (Prophet Muhammad): 'Had Allah willed, I would not have recited it to you, nor would He have made it known to you. I lived among you all my life before it (was sent down). Will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Had God willed, I would not have recited it to you, and He would not have made it known to you. I have lived among you for a lifetime before it. Do you not understand?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If Allah had willed, I would not have recited it to you, nor would He have made it known to you, for I had remained among you a lifetime before it. Then will you not reason?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:16] Say: ‘If God had willed I would not have recited it to you, nor would He have made it known to you, [nor] would He have made you aware of it (the lā [of wa-lā adrākum] is for negation, and is a supplement to what preceded; a variant reading has the lām [sc. la-adrākum, ‘He would have made it known to you’] as the response to the [conditional] law, ‘if’, in other words, He would have made it known to you by the tongue of someone other than myself). For I have already dwelt among you a [whole] lifetime, of forty years, before this [Qur’ān], not relating to you anything [of the sort], so will you not understand?’, that this [Qur’ān] is not from myself?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (If Allah had so willed) i.e. for me not to be a Messenger (I should not have recited it to you) I should not have recited the Qur'an to you (nor would He have made it known to you) and He would not have made the Qur'an known to you. (I dwelt among you a whole lifetime) 40 years (before it) before the revelation of the Qur'an, and before that I never said anything. (Have ye then no sense?) do you not have the sense to understand that it is not of my accord?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } أيضاً لهم إلزاماً وتبكيتاً: { لَّوْ شَآءَ ٱللَّهُ } أي: لو تعلق مشيئته غير هذا المتلو { مَا تَلَوْتُهُ } أنا\n وما أوحاه علي\n وما أجراه على لساني { عَلَيْكُمْ وَلاَ أَدْرَاكُمْ بِهِ } وأعلمكم على لساني\n ولكن تعلق بمشيئته بهذا فأوحاه وأجراه { فَقَدْ لَبِثْتُ فِيكُمْ عُمُراً } مدة أربعين سنة { مِّن قَبْلِهِ } أي: قبل وحي القرآن بلا تلاوة وإدراء وإعلام { أَفَلاَ تَعْقِلُونَ } [يونس: 16] وتستعملون عقولكم في هذا الأمر\n ولا تدبرون وتدربون فيه مع أنكم متدربون بأساليب الكلام\n متبالغون فيه أقصى الغاية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل لو شاءَ اللهُ ما } أرسلني إليكم\n ولا { تلوتُه عليكم ولا أدْرَاكم } أي: أعلمكم { به } على لساني\n وفي قراءة ابن كثير: ولأدراكم\n بلام التأكيد\n أي: لو شاء الله ما تلوته عليكم ولأعلمكم به على لسان غيري\n والمعنى أنه الحق لا شك فيه\n لو لم أُرْسَل به أنا لأرسل به غيري\n وحاصل المعنى: أن الأمر بمشيئة الله لا بمشيئتي\n حتى أجعله على نحو ما تشتهون\n ثم قرر ذلك بقوله: { فقدْ لبثتُ فيكم عُمُراً } منذ أربعين سنة { مِن قبله } أي: من قبل نزول هذا القرآن\n لا أتلوه ولا أعلم منه شيئاً\n وفيه إشارة إلى القرآن معجز خارق للعادة\n فأن من عاش بين أظهرهم أربعين سنة لم يدرس فيها علماً\n ولا يشاهد عالِماً\n ولم ينشد قريضاً ـ أي: شعراً ـ ولا خطبة\n ثم قرأ عليهم كتاباً أعجزت فصاحتُه كل منطيق\n وفاق كل منظوم ومنثور\n واحتوى على قواعد عِلْمي الأصول والفروع\n وأعرب عن أَقاصيص الأولين وأحاديث الآخرين على ما هي عليه\n عُلم انه معلم به من عند الله\n قاله البيضاوي\n فكل من له عقل سليم أدرك حقِّيته\n ولذلك قرعهم بقوله: { أفلا تعقلون } أي: أفلا تستعملون عقولكم بالتدبر والتفكر\n فتعلموا أنه ليس من طوْق البشر\n بل هو من عند الحكيم العليم الواحد القهار\n الإشارة: إذا ظهر أهل التربية الداعون إلى الله بطريق صعبة على النفوس\n يُسيرون الناس عليها\n كخرق العوائد وتخريب الظواهر والتجريد\n قال من لا يرجو الوصول إلى الله ـ لغلبة الهوى عليه: ائتونا بطريق غير هذا لنتبعكم عليه\n يكون سهلاً على النفوس\n موافقاً لعوائدنا\n أو بدلوا هذا بطريق أسهل\n وأما هذا الذي أتيتم به\n فلا نقدر عليه\n وربما رموه بالبدعة\n فيقولون لهم: ما يكون لنا أن نبدله من تلقاء أنفسنا\n إن نتبع إلا ما سلك عليه أشياخنا وأشياخهم\n فما ربَّوْنا به نُربّي به من تبعنا\n فإن خالفنا طريقهم خفنا من عقاب الله\n حيث غششنا من اتبعنا\n ولقد مكثنا معكم قبل صحبة أشياخنا سنين\n فلم تروا علينا شيئاً من ذلك حتى صحبناهم\n فدل ذلك على أنه موروث عن أشياخهم وأشياخ أشياخهم\n أفلا تعقلون؟\n\nثم سجل الظلم على من كذَب أو كذّب\n فقال: { فَمَنْ أَظْلَمُ مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:18",
      "similarity": 0.4580739339913214
    },
    {
      "verse": "52:4",
      "similarity": 0.4141437901091566
    },
    {
      "verse": "23:114",
      "similarity": 0.3499022090052286
    },
    {
      "verse": "101:10",
      "similarity": 0.331471968362356
    },
    {
      "verse": "69:3",
      "similarity": 0.3254874395370073
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}