{
  "chapter": "يونس",
  "text": "واذا مس الانسن الضر دعانا لجنۢبه او قاعدا او قائما فلما كشفنا عنه ضره مر كان لم يدعنا الى ضر مسه كذلك زين للمسرفين ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "When harm touches man, he calls on Us, lying on his side or sitting down or standing up. Then when We remove the harm from him he carries on as if he had never called on Us when the harm first touched him. In that way We make what they have done appear good to the profligate.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When man is afflicted with adversity he calls to Us, whether lying on his side, or sitting or standing. But when We take away his troubles, he moves away, as though he had never called to Us in affliction. In the same way, attractive have been made their deeds to the prodigals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (such is man that) when an affliction befalls him, he cries out to Us, reclining and sitting and standing. But no sooner than We have removed his affliction, he passes on as though he had never cried out to Us to remove his affliction. Thus it is that the misdeeds of the transgressors are made fair-seeming to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the human being is affected by hardship, he starts to pray while lying on his side, sitting or standing, but when We relieve him from hardship, he starts to act as though he had never prayed to Us to save him from the misfortune. This is how transgressors' deeds are made attractive to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when some hardship reaches man he prays to Us, while reclining and sitting and standing; and when We remove his hardship, he goes away as if he had never prayed to Us because of any hardship; this is how the deeds of the transgressors are made seeming good to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm touches man, he invokes Us, lying on his side, or sitting or standing. But when We have removed his harm from him, he passes on as if he had never invoked Us for a harm that touched him! Thus it is made fair seeming to the wasteful that which they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when affliction touches a man, he calls on Us, whether lying on his side or sitting or standing; but when We remove his affliction from him, he passes on as though he had never called on Us on account of an affliction that touched him; thus that which they do is made fair-seeming to the extravagant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When affliction visits a man, he calls Us on his side, or sitting, or standing; but when We have removed his affliction from him, he passes on, as if he never called Us to an affliction that visited him. So decked out fair to the prodigal is that they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if misfortune touch a man he crieth unto Us, (while reclining) on his side, or sitting or standing, but when We have relieved him of the misfortune he goeth his way as though he had not cried unto Us because of a misfortune that afflicted him. Thus is what they do made (seeming) fair unto the prodigal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever any trouble befalls a person, he prays to Us all the time, lying on his side, sitting or standing; but when We remove his trouble, he goes on his way as if he had never prayed to Us for the removal of his trouble. Thus it is that the doings of the transgressors are made to look fair to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm toucheth man, he calleth us on his side, or sitting or standing; then when We have removed his harm from him, he passeth on as though he had never called Us to a harm that touched him. In this wise is made fairseeming unto the extravagant that which they have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When distress befalls man, he supplicates Us, [lying] on his side, sitting, or standing; but when We remove his distress, he passes on as if he had never supplicated Us concerning the distress that had befallen him. What they have been doing is thus presented as decorous to the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When trouble toucheth a man, He crieth unto Us (in all postures)- lying down on his side, or sitting, or standing. But when We have solved his trouble, he passeth on his way as if he had never cried to Us for a trouble that touched him! thus do the deeds of transgressors seem fair in their eyes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm touches man, he invokes Us, lying down on his side, or sitting or standing. But when We have removed his harm from him, he passes on his way as if he had never invoked Us for a harm that touched him! Thus it seems fair to the Musrifunthat which they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When affliction befalls a man, he supplicates to Us (lying) on his side, sitting or standing. But as soon as We relieve him from his affliction, he continues (in the same way), as though he never supplicated to Us when harm touched him. So it is, that which the sinners were doing seem fairly decorated to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever adversity touches the human being, he prays to Us—reclining on his side, or sitting, or standing. But when We have relieved his adversity from him, he goes away, as though he had never called on Us for trouble that had afflicted him. Thus the deeds of the transgressors appear good to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when affliction touches man, he calls upon Us, whether lying on his side or sitting or standing; but when We remove from him his affliction, he continues [in disobedience] as if he had never called upon Us to [remove] an affliction that touched him. Thus is made pleasing to the transgressors that which they have been doing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:12] If misfortune, illness or poverty, should befall a, disbelieving, man, he calls upon Us on his side, that is, lying down, or sitting or standing, in other words, in every state; but when We have relieved him of his misfortune, he passes on, in his unbelief, as if (ka-an is softened, its subject omitted, in other words [read as] ka-annahu) he had never called upon Us because of a misfortune that befell him. So, in the same way that supplication during misfortune and abstention [from supplication] in times of comfort were adorned for him, is adorned for the prodigal, the idolaters, that which they do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if misfortune touch a man) when hardship or sickness befalls the disbeliever, the reference here is to Hisham Ibn al-Mughirah and al-Makhzumi (he cries unto Us, (while reclining) on his side, or sitting or standing, but when We have relieved him of the misfortune) when We relieved him of the hardship and misfortune which befell him (he goeth his way) he carries on his abstention from making supplication to Us (as though he had not cried unto Us because of a misfortune) a hardship (that afflicted him. Thus is what they do) in their state of idolatry of making supplications in times of hardship and abstaining from so making supplication to Allah in times of ease (made (seeming) fair unto the prodigal) unto the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة عمههم وطغيانهم { إِذَا مَسَّ } وعرض { ٱلإِنسَانَ ٱلضُّرُّ } أي: ما يضره من مرض مؤلم وأمر مفجع مفزع { دَعَانَا } متشكياً إلينا\n باثاً شكواه عندنا\n ملقياً { لِجَنبِهِ } إن لم يقدر على غيره { أَوْ قَاعِداً أَوْ قَآئِماً } متضرعاً متفجعاً مستكشفاً { فَلَمَّا كَشَفْنَا عَنْهُ ضُرَّهُ } وعجلنا له مراده تجاوز عنا وعن أمرنا\n ولم يتلفت إلينا أصلاً\n وصار من شدة عمهه وغفلته { مَرَّ كَأَن لَّمْ يَدْعُنَآ إِلَىٰ } كشف { ضُرٍّ مَّسَّهُ كَذٰلِكَ } أي: مثل ما سمعت { زُيِّنَ } أي: حبب وحسن { لِلْمُسْرِفِينَ } المنهمكين في الغي والضلال { مَا كَانُواْ يَعْمَلُونَ } [يونس: 12] من مخالفة أمر الله\n ومخاصمة رسوله والمؤمنين المتابعين له\n والإصرار على ما هم عليه من العتو والعناد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: لجنبه: متعلق بحال محذوفة، أي: مضطجعاً لجنبه، وكأن مخففة. يقول الحق جل جلاله: { وإذا مسَّ الإنسان الضُّرُّ } في بدنه أو ماله أو أحبابه، { دعانا } لإزالته مخلصاً فيه، وتضرع إلينا حال كونه مضطجعاً { لجَنْبِه أو قاعداً أو قائماً } ، وفائدة الترديد تقسم الدعاء لجميع الأحوال أو لأصناف المضار، { فلما كشفنا عنه ضُرَّه مرَّ } أي: مضى على طريقه واستمر على كفره، ولم يشكر الله على دفعه، أو مرَّ عن موقف الدعاء، ولم يرجع إليه. { كأن لم يَدْعُنَا } أي: كأنه لم يدعنا { إلى } كشف { ضُرّ مسَّهُ } قط:\n[الزمر:8] { كذلك زُيّنَ للمسرفين } أي: مثل هذا التزيين زين للمسرفين { ما كانوا يعلمون } من الانهماك في الشهوات، والإعراض عن شكر المنعم عند المسرات وذهاب العاهات. وفي الآية تهديد لمن تشبه بهذه الحالة، بل الواجب على العبد دوام التجائه إلى ربه، والشكر له عند ظهور إجابته وإسدال عافيته. الإشارة: من حسن الأدب السكون تحت مجاري الأقدار، والتسليم لأحكام الواحد القهار، \" فليس الشأن تُرزق الطلب، إنما الشأن أن تُرزق حسن الأدب \" ، وحسن الأدب: هو الفهم عن الله فإذا شرح صدرك للدعاء، فادع ولا تكثر، فإن المدعو قريب، ليس بغافل فيُنبه، ولا ببعيد فتنادي عليه، فإذا دعوته وأجابك فاشكره، وإن أخَّر عنك الإجابة فاصبر فقد ضمن الإجابة فيما يريد، لا فيما تريد، وفي الوقت الذي يريد لا في الوقت الذي تريد. والله تعالى أعلم. ثم هدد من أساء الأدب، فقال: { وَلَقَدْ أَهْلَكْنَا ٱلْقُرُونَ مِن قَبْلِكُمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:68",
      "similarity": 0.3729296895553445
    },
    {
      "verse": "11:95",
      "similarity": 0.364418150176843
    },
    {
      "verse": "7:92",
      "similarity": 0.35003671561071736
    },
    {
      "verse": "10:45",
      "similarity": 0.3439193648671432
    },
    {
      "verse": "6:17",
      "similarity": 0.3224805837739573
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/10:12.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/10:12.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}