{
  "chapter": "يونس",
  "text": "ثم ننجى رسلنا والذين ءامنوا۟ كذلك حقا علينا ننج المؤمنين",
  "translations": [
    {
      "translation": "Then We will rescue Our Messengers and those who have iman as well. It is incumbent upon Us to rescue the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We deliver our apostles and those who believe. As a matter of duty We save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, (when Allah's wrath falls upon the wicked) We save our Messengers and also those who believe. It is incumbent on Us to deliver the believers.' set fire to the whole city and its environs. The Assyrian king set his own palace ablaze and was himself burnt to death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We saved Our Messengers and those who believed; We must save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall save Our Noble Messengers and the believers – this is it; it is incumbent upon Our mercy to save the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We save Our Messengers and those who believe! Thus it is incumbent upon Us to save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We deliver Our apostles and those who believe-- even so (now), it is binding on Us (that) We deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall deliver Our Messengers and the believers. Even so, as is Our bounden duty, We shall deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then shall We save Our messengers and the believers, in like manner (as of old). It is incumbent upon Us to save believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall save Our messengers and those who believe. Thus We have made it incumbent upon Ourself to save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter We delivered Our apostles and those who believed. Even so, as incumbent upon us, We deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall deliver Our apostles and those who have faith. Thus, it is a must for Us to deliver the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the end We deliver Our messengers and those who believe: Thus is it fitting on Our part that We should deliver those who believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then (in the end) We save Our Messengers and those who believe! Thus it is incumbent upon Us to save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then we shall save Our Messengers and the believers. It is Our obligated duty, We shall save those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We save Our messengers and those who believe. It is binding on Us to save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will save our messengers and those who have believed. Thus, it is an obligation upon Us that We save the believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:103] Then We shall deliver (nunajjī: the imperfect tense is [being used] to narrate a past situation) Our messengers and the believers, from the chastisement. In like manner, to [that] deliverance, it is incumbent upon Us to deliver the believers, the Prophet (s) and his Companions, when [the time comes for] chastising the idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nو { ثم ننجّي رسلنا } عطف على جملة : { فهل ينتظرون إلا مثل أيام الذين خلوا } لأن مثل تلك الأيام يومُ عذاب . ولما كانوا مهددين بعذاب يحل بموضع فيه الرسول صلى الله عليه وسلم والمؤمنون عجل الله البشارة للرسول صلى الله عليه وسلم والمؤمنين بأنه ينجيهم من ذلك العذاب بقدرته كما أنجى الرسل من قبله .وجملة : { كذلك حقاً علينا ننجِّي المؤمنين } تذييل . والإشارة ب { كذلك } إلى الإنجاء المستفاد من { ثم ننجِّي }.و { حقّاً علينا } جملة معترضة لأن المصدر بدل من الفعل ، أي حق ذلك علينا حقاً .وجعله اللّهُ حقاً عليه تحقيقاً للتفضل به والكرامة حتى صار كالحق عليه .وقرأ الجمهور { نُنَجّي المؤمنين } بفتح النون الثانية وتشديد الجيم على وزان { ننجي رسلنا }. وقرأ الكسائي ، وحفص عن عاصم { نُنْجي المؤمنين } بسكون النون الثانية وتخفيف الجيم من الإنجاء . فالمخالفة بينه وبين نظيره الذي قبله تفنن ، والمعنى واحد .وكتب في المصحف { ننج المؤمنين } بدون ياء بعد الجيم على صورة النطق بها للاتقاء الساكنيْن . ”\n\n",
      "translations": [
        {
          "translation": "(Then shall We save Our messengers and the believers) in these messengers after the destruction of their people, (in like manner (as of old)) thus. (It is incumbent upon Us to save believers) with their messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { كذلك حقاً علينا ننج المؤمنين } من أصحاب محمد صلى الله عليه وسلم حين نُهلك المجرمين حقاً واجباً علينا كما هي عادتنا مع من تحبب إلينا بالإيمان والطاعة\n الإشارة: أمر الحق ـ جل جلاله ـ أهل النظر والاستبصار بأن ينظروا ماذا في السماوات والأرض من الأسرار والأنوار\n أمرهم أن يشاهدوا أسرار الذات وأنوار الصفات\n دون الوقوف مع الأجرام الحسِّيات\n أمرهم أن ينظروا المعاني خلف رقة الأواني\n لا أن يقفوا مع الأواني\n وإليه أشار ابن الفارض في خمريته\n حيث قال:\nفالأكوان كلها أواني حاملة للطف المعاني\n وأصل الأواني معاني\n تحسست وتكثفت فمن لطَّف الأواني وذوّبها بفكرته رجعت معاني\n واتصلت المعاني بالمعاني\n وغابت حينئذٍ الأواني\n ولا يعرف هذا إلا من صحب أهل المعاني\n وهم أهل الفناء والبقاء\n ومن لم يصحبهم فحسبه الوقوف مع الأجرام الحسية\n ويستعمل فكرة التصديق والإيمان\n وهي عبادة التفكر والاعتبار والأولى فكرة أهل الشهود والاستبصار\n وفي أمثالهم قال الشاعر:\nوقد ذكر في الحِكَم هذه الإشارة فقال \" أباح لك أن تنظر ما في المُكَوِّنات\n وما أباح لك أن تَقِفَ مع ذوات المكونات\n قل انظروا ماذا في السماوات فتح لك باب الأفهام\n ولم يقل: انظروا السماوات لئلا يدلك على وجود الأجرام \"\n ومن سبق له في العلم القديم الخذلان لا يخرج عن دائرة الأكوان\n فلا يؤمن بوجود أهل الشهود والعيان\n فما ينتظر مثل هذا إلا ما نزل بأمثالهِ\n من هجوم الحِِمام قبل خروجه من سجن الأجرام\n فإنه لا ينجو من سجن الأكوان إلا من صحب أهل العرفان\n الذين أفضوا إلى فضاء الشهود والعيان وقليل ما هم\n ثم أمر نبيه بالتبرء من الشرك وأهله\n فقال: { قُلْ يٰأَيُّهَا ٱلنَّاسُ إِن كُنتُمْ فِي شَكٍّ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:53",
      "similarity": 0.6037121987971661
    },
    {
      "verse": "41:18",
      "similarity": 0.6037121987971661
    },
    {
      "verse": "70:14",
      "similarity": 0.5705987067365985
    },
    {
      "verse": "10:86",
      "similarity": 0.5200012250515661
    },
    {
      "verse": "26:169",
      "similarity": 0.4633956433228047
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010103.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010103.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:103.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}