{
  "chapter": "يونس",
  "text": "وما كان لنفس ان تؤمن الا باذن الله ويجعل الرجس على الذين لا يعقلون",
  "translations": [
    {
      "translation": "No self can have iman except with Allah's permission. He places a blight on those who do not use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you going to compel the people to believe except by God's dispensation? He puts doubt in (the minds of) those who do not think.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one can believe except by Allah's leave, and Allah lays abomination on those who do not use their understanding. and conduct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one can have faith without the permission of God. God will cast down filth on those who have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no soul can accept faith except by the command of Allah; and He sets the punishment upon those who do not have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any person to believe, except by the leave of Allah, and He will put the Rijs on those who do not reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not for a soul to believe except by Allah's permission; and He casts uncleanness on those who will not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any soul to believe save by the leave of God; and He lays abomination upon those who have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any soul to believe save by the permission of Allah. He hath set uncleanness upon those who have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul can believe except by the will of God. He will place the filth [of doubt] upon those who do not use their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any soul that it should believe save with Allah's will, and He layeth the abomination upon those who reflect not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul may have faith except by Allah’s leave, and He lays defilement on those who do not exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul can believe, except by the will of Allah, and He will place doubt (or obscurity) on those who will not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any person to believe, except by the Leave of Allah, and He will put the wrath on those who are heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul can believe except by the permission of Allah. Upon those who do not understand lays His punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No soul can believe except by God’s leave; and He lays disgrace upon those who refuse to understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not for a soul to believe except by permission of Allah, and He will place defilement upon those who will not use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:100] And it is not for any soul to believe save by the permission of God, by His will, and He causes abomination, chastisement, to fall upon those who have no understanding, [those who do not] reflect upon God’s signs.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is not for any) disbelieving (soul to believe) in Allah (save by the permission of Allah) save by Allah's will and given success. (He hath set uncleanness) He leaves denial (upon those) in the hearts of those (who 224 have no sense) who do not apprehend Allah's divine Oneness. This verse was revealed about Abu Talib. The Prophet (pbuh) was so keen that he believes, but Allah did not want him to believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { مَا كَانَ لِنَفْسٍ } أي: ما تيسر ووسع في وسعها وطاقتها { أَن تُؤْمِنَ } بالله باختبارها { إِلاَّ بِإِذْنِ ٱللَّهِ } وتوفيقه وإقداره، فعليك يا أكمل الرسل ألا تجهد نفسك في إهداء من أراد الله إضلاله؛ لأنك\n\n[القصص: 56] وهو العزيز الحكيم { وَ } من حكمته أنه { يَجْعَلُ ٱلرِّجْسَ } أي: الخذلان والحرمان { عَلَى } الكافرين { ٱلَّذِينَ لاَ يَعْقِلُونَ } [يونس: 100] أي: لا يستعملون عقولهم التي هي مناط التكاليف إلى ما خُلق لأجله، ولا يتفكرون ويتأملون في الآثار الصادرة من القادر المختار حتى ينكشفوا بتوحيده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال البيضاوي: وترتيب الإكراه على المشيئة بالفاء، وإيلاؤها حرف الاستفهام الإنكاري، وتقديم الضمير على الفعل، للدلالة على أن خلاف المشيئة مستحيل، فلا يمكنه تحصيله بالإكراه فضلاً عن الحث والتحريض عليه، إذ روي أنه ـ عليه الصلاة والسلام ـ كان حريصاً على إيمان قومه، شديد الاهتمام به، فنزلت، ولذلك قرره بقولة: { وما كان لنفسٍ أن تُؤمن إلا بإذن الله } بمشيئته وألطافه وتوفيقه فلا تجهد نفسك في هداها، فإنه إلى الله تعالى\n { ويجعلُ الرِّجْسَ }: العذاب أو الخذلان فإنه سببه { على الذين لا يعقلون }: لا يستعملون عقولهم بالنظر في الحجج والآيات، أو لا يعقلون دلائل القرآن وأحكامه لِمَا على قلوبهم من الطبع، ويؤيده الأول قوله: { قل انظروا\n\n\n } الخ\n هـ\n الإشارة: في الآية تسلية لأهل التذكير حين يرون الناس لم ينفع فيهم تذكيرهم، وفيها تأديب لمن حرص على هداية الناس كلهم، أو يتمنى أن يكونوا كلهم خصوصاً، فإن هذا خلاف حكمته تعالى\n قال تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:125",
      "similarity": 0.6061125770431514
    },
    {
      "verse": "9:95",
      "similarity": 0.49640404432999186
    },
    {
      "verse": "7:71",
      "similarity": 0.48589243082117806
    },
    {
      "verse": "33:33",
      "similarity": 0.3470666263954461
    },
    {
      "verse": "6:125",
      "similarity": 0.28238253431890564
    }
  ]
}