{
  "chapter": "يونس",
  "text": "ولا تدع من دون الله ما لا ينفعك ولا يضرك فان فعلت فانك اذا من الظلمين",
  "translations": [
    {
      "translation": "Do not call on something besides Allah which can neither help nor harm you. If you do, you will then be wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not to invoke any other than God, who can neither help nor hurt me; for if I do, I would surely be unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not call upon any apart from Allah on those who have no power to benefit or hurt you. For if you call upon others than Allah you will be reckoned among the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor to seek help from anyone other than God [who can neither benefit nor harm me], lest I become of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And other than Allah, do not worship that which cannot benefit you nor cause you harm; then if you do so, you would be of the unjust.” (* Some things like the sun, stars, trees are useful but they too are created by Allah. Their worship will not benefit – in fact it is harmful.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not invoke besides Allah what will not benefit you nor harm you. For if you did, you would certainly be one of the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not call besides Allah on that which can neither benefit you nor harm you, for if you do then surely you will in that case be of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and do not call, apart from God, on that which neither profits nor hurts thee, for if thou dost, then thou wilt surely be of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cry not, beside Allah, unto that which cannot profit thee nor hurt thee, for if thou didst so then wert thou of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and do not invoke besides God what can neither help nor harm you. If you do, you will be one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And invoke not beside Allah that which can neither profit thee nor hurt thee; then if thou dost so, thou art forthwith of the wrong- doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor invoke besides Allah that which neither benefits you nor can do you any harm. For if you do so, then you will indeed be among the wrongdoers.’’ ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor call on any, other than Allah;- Such will neither profit thee nor hurt thee: if thou dost, behold! thou shalt certainly be of those who do wrong.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And invoke not besides Allah, any that will neither profit you, nor hurt you, but if (in case) you did so, you shall certainly be one of the Zalimun (polytheists and wrong-doers).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not pray to, other than Allah, to anything that can neither help nor harm you, for if you do, you will become a harmdoer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not call, apart from God, on what neither benefits you nor harms you. If you do, you are then one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not invoke besides Allah that which neither benefits you nor harms you, for if you did, then indeed you would be of the wrongdoers.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:106]   and do not call upon, [do not] worship, besides God, that which can neither profit you, should you worship it, nor hurt you, should you not worship it; for if you do, this, hypothetically speaking, then you will surely be of the evildoers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And cry not) worship not, (beside Allah, unto that which cannot profit thee) in the life of this world or in the Hereafter if you were to worship it (nor hurt thee) if you did not worship it, (for if thou didst so) for if you worshipped it (then wert thou of the wrong-doers) of those who harm themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } متى عرفت حقيقة الحال وظهر عندك حلية المقال { لاَ تَدْعُ مِن دُونِ ٱللَّهِ } الواجب وجوده { مَا لاَ يَنفَعُكَ } من الموجودات الباطلة والأضلال الزائلة { وَلاَ يَضُرُّكَ } أيضاً\n إذ لا أثر لها من ذاتها ولا وجود لها من نفسها { فَإِن فَعَلْتَ } وادعيت وجود غير الحق { فَإِنَّكَ إِذاً مِّنَ ٱلظَّالِمِينَ } [يونس: 106] الذين يظلمون على الله بادعاء الوجود والأثر لغيره\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تَدْعُ من دون الله ما لا ينفعكُ ولا يضرُّكَ } بنفسه ولا بدَعْوَته\n { فإن فعلتَ } ودعَوْتَهُ { فإنك إذاً من الظالمين } \n وهو تنفير وتحذير للغير من الميل إليه\n  ثم بيَّن من يستحق العبادة والدعاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:12",
      "similarity": 0.778492980793938
    },
    {
      "verse": "21:66",
      "similarity": 0.7426168239095576
    },
    {
      "verse": "5:76",
      "similarity": 0.6788542354707131
    },
    {
      "verse": "26:73",
      "similarity": 0.6546741165534343
    },
    {
      "verse": "25:55",
      "similarity": 0.6461511418513896
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/10:106.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/10:106.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/10:106.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}