{
  "chapter": "يونس",
  "text": "ثم جعلنكم خلئف فى الارض منۢ بعدهم لننظر كيف تعملون",
  "translations": [
    {
      "translation": "Then We appointed you after them to be khalifs on the earth so We might observe how you would act.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We appointed you leaders in the land after them to see how you behaved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We have appointed you as their successors in the earth to see how you act.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made you their successors in the land so that We could see how you behaved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We appointed you as caliphs in the earth after them, in order that We might see what deeds you perform.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made you successors after them, generations after generations in the land, that We might see how you would work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made you successors in the land after them so that We may see how you act.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We appointed you viceroys in the earth after them, that We might behold how you would do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We appointed you viceroys in the earth after them, that We might see how ye behave.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made you their successors in the land, so that We might observe how you would conduct yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We appointed you as successors in the land after them, that We might see how ye would work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made you successors on the earth after them that We may observe how you will act.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made you heirs in the land after them, to see how ye would behave!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made you follow after them, generations after generations in the land, that We might see how you would work!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After them We made you their successors in the earth, so that We might see how you would do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made you successors on earth after them, to see how you would behave.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made you successors in the land after them so that We may observe how you will do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:14] Then We made you, O people of Mecca, successors (khalā’if is the plural of khalīfa) in the earth after them, that We might behold how you would behave, in it, and whether you would take heed from their example and believe in Our messengers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We appointed you) Community of Muhammad (pbuh) (vicegerents) successors (in the earth after them) after their destruction, (that We might see how ye behave) what you will do of goodness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعد إهلاكهم واستئصالهم { جَعَلْنَاكُمْ خَلاَئِفَ } أي: استخلفناكم، فهم خلفائه { فِي ٱلأَرْضِ مِن بَعْدِهِم } مختبرين، مبتلين أمثالهم { لِنَنظُرَ كَيْفَ تَعْمَلُونَ } [يونس: 14] أتعملون الخير فيجازيكم خيراً، أم تعملون الشر فيجازيكم شراً، مثل ما جزيناهم؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}