{
  "chapter": "يونس",
  "text": "وما كان الناس الا امة وحدة فاختلفوا۟ ولولا كلمة سبقت من ربك لقضى بينهم فيما فيه يختلفون",
  "translations": [
    {
      "translation": "Mankind was only one community but then they differed, and had it not been for a prior Word from your Lord, they would already have been judged in respect of the differences between them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men were once a community of one faith; but they differed (and followed different ways). Had it not been for the word proclaimed by your Lord before, their differences would have been resolved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Once all men were but a single community; then they disagreed (and formulated different beliefs and rites). Had it not been that your Lord had already so ordained, a decisive judgement would have been made regarding their disagreements.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All people (once) followed one belief. Then they began to follow different beliefs. Had not a word of your Lord (His decision to give every one time and free will) been decreed, God would already have settled their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were only one nation* and then they differed, and had it not been for a promise** from your Lord, the matters in which they differed would have been decided here itself. (* On one proper faith. ** The account on the Last Day.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were but one community, then they differed (later); and had not it been for a Word that went forth before from your Lord, it would have been settled between them regarding what they differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And people are naught but a single nation, so they disagree; and had not a word already gone forth from your Lord, the matter would have certainly been decided between them in respect of that concerning which they disagree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were only one nation, then they fell into variance. But for a word that preceded from thy Lord, it had been decided between them already touching their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were but one community; then they differed; and had it not been for a word that had already gone forth from thy Lord it had been judged between them in respect of that wherein they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was only one community, but then they differed, and had it not been for a prior word from your Lord, their differences would have been settled for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mankind were not but a single ccmmunity then they differed. And had not a word from thy Lord gone forth, it would have been decreed between them in respect of that wherein they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were but a single [religious] community; then they differed. And were it not for a prior decree of your Lord, decision would have been made between them concerning that about which they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was but one nation, but differed (later). Had it not been for a word that went forth before from thy Lord, their differences would have been settled between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were but one community (i.e. on one religion - Islamic Monotheism), then they differed (later), and had not it been for a Word that went forth before from your Lord, it would have been settled between them regarding what they differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Before) mankind were but one nation, then they differed with one another. But for a Word that preceded from your Lord, it (the matters) over which they differed had already been decided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was a single community; then they differed. Were it not for a prior decree from your Lord, the matters over which they had disputed would have been settled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mankind was not but one community [united in religion], but [then] they differed. And if not for a word that preceded from your Lord, it would have been judged between them [immediately] concerning that over which they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:19] Mankind was but one community, following one religion, that is submission [to the One God], from the time of Adam to the time of Noah; but it is also said [that this was the case] from the time of Abraham to that of ‘Amr b. Luhayy; then they differed, some of them remaining firmly [upon belief in One God], while others disbelieved. And had it not been for a word that had already preceded from your Lord, [to the effect] that requital would be deferred until the Day of Resurrection, it would have been decided between them, that is, [between] mankind, in this life, regarding that over which they differed, in religion, by the disbelievers being punished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Mankind) in the time of Abraham, and it is said in the time of Noah (were but one community) following one religion: the religion of disbelief, and so Allah sent prophets as warners and bringers of glad tidings; (then they differed) two parties emerged: believers and disbelievers; (and had it not been for a word) to delay the punishment of this nation (that had already gone forth from thy Lord) that had already been enjoined by your Lord (it had been judged between them) they would have been destroyed (about that) about religion (wherein they differ) they opposed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما كان الناس إلا أمّة واحدة } على الفطرة التي فطر الله الناس عليها\n متوجهين إلى الوحدة\n متنوّرين بنور الهداية الأصلية { فاخْتَلفوا } بمقتضيات النشأة واختلاف الأمزجة والأهوية والعادات والمخالطات\n { ولولا كلمة سَبَقت من ربّك } أي: قضاء سبق في الأزل بتعيين الآجال والأرزاق وتمادي كل واحد من الشقي والسعيد إلى حيث قدر له فيما يزاوله { لقضي بينهم فيما فيه يختلفون } عاجلاً ولميز السعيد من الشقي\n والحق من الباطل من أديانهم ومللهم ولكن حكمة الله اقتضت أن يبلغ كل منهم وجهته التي ولى وجهه إليها بأعماله التي يزاولها هو وإظهار ما خفي في نفسه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا كَانَ ٱلنَّاسُ } المجبولون على مظهرية الحق\n المنعكسون من أظلال أسمائه الحسنى وصفاته العليا { إِلاَّ أُمَّةً وَاحِدَةً } ملتجئة إلى الله\n مقتبسة من أنوار تجلياته { فَٱخْتَلَفُواْ } أي: الأظلال الهالكة باختلاف صور الأسماء المتقابلة\n والأوصاف المتضادة المتخالفة حسب الشئون والتجليات المتجددة في الكمالات المترتبة عليها { وَلَوْلاَ كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ } يا أكمل الرسل\n لتسويتهم وتعديلهم في النشاة الأخرى { لَقُضِيَ بَيْنَهُمْ } بالعدالة والقسط { فِيمَا فِيهِ يَخْتَلِفُونَ } [يونس: 19] في هذه النشأة بلا تأخير إلى أخرى\n لكن الحكمة المتقنة الإلهية تقتضي تأخيرها\n ولذلك أخرت أمرهم وحسابهم وعذابهم\n لئلا يبطل سر التكاليف والأوامر والنواهي\n\n\n{ وَيَقُولُونَ } بعدما اقترحوا عنه بالآيات ولم تنزل: { لَوْلاَ } أي: هلا { أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ } من الآيات المقترحة\n مع أنه دعواه أن الله قادر على جميع المقدورات والمرادات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { وما كان الناس إلا أمةً واحدةً } موحَّدين، على الفطرة الأصلية، أو متفقين على الحق، وذلك في عهد آدم، إلى أن قتل قابيل أخاه هابيل، أو بعد الطوفان إلى زمان اختلافهم، أو الأرواح حيث استخرجهم واستشهدهم، فاتفقوا على الإقرار، ثم اختلفوا، في عالم الأشباح باتباع الهوى والأباطيل، أو ببعثة الرسل فتبعتهم طائفة وكفرت اخرى. { ولولا كلمة سبقتْ من ربك } في اللوح المحفوظ، بتأخير الحكم، أو العذاب الفاصل بينهم إلى يوم القيامة، فإنه يوم الفصل والجزاء، { لقُضي بينهم } عاجلاً { فيما فيه يختلفون } بإهلاك المُبْطِل وإبقاء المحق. الإشارة: اختلاف الناس على الأولياء كاختلافهم على الأنبياء، أمر سبق به الحكم الأزلي لا محيد عنه، فمن طلب اتفاقهم عليه فهو جاهل بالله وبطريق أهل الله. والله تعالى أعلم. ثقم ذكر اقتراحهم الآيات، فقال: { وَيَقُولُونَ لَوْلاَ أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:110",
      "similarity": 0.5520428750612012
    },
    {
      "verse": "41:45",
      "similarity": 0.5520428750612012
    },
    {
      "verse": "37:171",
      "similarity": 0.5107043740621996
    },
    {
      "verse": "8:68",
      "similarity": 0.4441599424309585
    },
    {
      "verse": "15:5",
      "similarity": 0.42877985609147645
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/10:19.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/10:19.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}