{
  "chapter": "يونس",
  "text": "الر تلك ءايت الكتب الحكيم",
  "translations": [
    {
      "translation": "Alif Lam Ra Those are the Signs of the Wise Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALIF LAM RA. These are the verses of the authoritative Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. These are the verses of the Book overflowing with wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. These are the verses of the Book of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra*; these are verses of the Book of wisdom. (*alphabets of the Arabic language; Allah and to whomever He reveals, know their precise meanings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra. These are the verses of the Book (the Qur'an) Al-Hakim.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra. These are the verses of the wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra. Those are the signs of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. These are verses of the Wise Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra. These are the verses of the Book of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra. These are the verses of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Ra. These are the signs of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A. L. R. These are the ayats of the Book of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]. These are the Verses of the Book (the Quran) Al-Hakim [showing lawful and unlawful things, explaining Allah's (Divine) Laws for mankind, leading them to eternal happiness by ordering them to follow the true Islamic Monotheism, - worshipping none but Allah Alone - that will guide them to Paradise and save them from Hell].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "AlifLaamRa. Those are the verses of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Ra. These are the Verses of the Wise Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Ra. These are the verses of the wise Book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:1] Alif lām rā’: God knows best what He means by these [letters]. Those, namely, these signs, are the signs of the wise Book, that is, the Qur’ān (the genitive annexation [āyāt al-kitāb] has the meaning of min [sc. min āyāti’l-kitāb, ‘from among the verses of the Book’]), which has been made clear.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning Allah's saying (Alif. Lam. Ra): '(Alif. Lam. Ra.) Allah says: I am Allah: I see; it is also said that it is an oath by which Allah swore. (These are verses of the wise Scripture) this surah consists of the verses of the clear Qur'an, expositing the lawful and the prohibited.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الر } إشارة إلى الرحمة التي هي الذات المحمدية لقوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ الۤر } أيها الإنسان اللبيب، الرشيد، اللائق للرسالة العامة، والرئاسة الكلية الكاملة الشاملة على كافة البرايا { تِلْكَ } الآيات المنزلة في هذه السورة { آيَاتُ ٱلْكِتَابِ ٱلْحَكِيمِ } [يونس: 1] أي: بعض آيات الكتاب الإلهي الذي هو حضرة علمه ولوح قضائه، ناطقة بالصدق والصواب على مقتضى الحكمة المتقنة الإلهية، نازلة من عنده، لتصديقك وتأييدك يا أكمل الرسل في تبشيراتك وإنذاراتك، ونبوتك ورسالتك وإرشادك لأهل الغي والضلال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: عجباً خبر كان، واسمها: أن أوحينا، ومن قرأ بالرفع فالأمر بالعكس، أو كان تامة، واللام متعلقة بعجباً، وهو مصدر للدلالة على أنهم جعلوه أعجوبة لهم، يتوجهون نحوه بإنكارهم واستهزائهم\n  قال في المغني: المصدر الذي ليس في تقدير حرف الموصول وصلته لا يمنع التقديم عليه، على أن السعد قال في المطوّل: إن معمول المصدر إذا كان ظرفاً أو شبهة، الأظهر أنه جائز التقديم، قال تعالى:\n\n[الصافات: 102]،\n\n[النور: 2] مثل هذا كثير في الكلام، وليس كل ما أول بشيء حكمُه حكم ما أول به، مع أن الظرف مما يكفيه رائحة الفعل لأن له شأناً ليس لغيره لتنزله من الشيء منزلة نفسه لوقوعه فيه وعدم انفكاكه عنه، ولهذا اتسع في الظروف ما لم يتسع في غيرها\n هـ\n يقول الحق جل جلاله: أيها الرسول المجتبى المختار { تلك } الآيات التي تنزل عليك هي { آياتُ الكتاب الحكيم } ، الذي اشتمل على الحكم الباهرة والعبر الظاهرة، أو المحكم الذي لم ينسخ منه شيء بكتاب آخر بعده، أو كلام حكيم",
      "translations": []
    }
  ]
}