{
  "chapter": "يونس",
  "text": "واتبع ما يوحى اليك واصبر حتى يحكم الله وهو خير الحكمين",
  "translations": [
    {
      "translation": "Follow what has been revealed to you and be steadfast until Allah's judgement comes. He is the Best of Judges.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what is revealed to you, and persist until God pronounce His judgement; for He is the best of all judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow, (O Prophet!), whatever is revealed to you, and remain patient until Allah brings forth His judgement. He is the best of those who judge.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), follow what is revealed to you and have patience until God issues His Judgment; He is the best Judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (O dear Prophet Mohammed – peace and blessings be upon him) follow what is divinely revealed to you, and have patience till Allah gives His command; and He is the Best of Rulers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow what is revealed to you, and be patient until Allah gives judgment. And He is the best of the judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow what is revealed to you and be patient till Allah should give judgment, and He is the best of the judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow thou what is revealed to thee; and be thou patient until God shall judge; and He is the best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (O Muhammad) follow that which is inspired in thee, and forbear until Allah give judgment. And He is the Best of Judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what is revealed to you, [O Prophet], and be steadfast until God gives His judgement. He is the Best of Judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow thou whatsoever is revealed unto thee, and endure until Allah judgeth, and He is the Best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow that which is revealed to you, and be patient until Allah issues [His] judgement, and He is the best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow thou the inspiration sent unto thee, and be patient and constant, till Allah do decide: for He is the best to decide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (O Muhammad SAW), follow the inspiration sent unto you, and be patient till Allah gives judgement. And He is the Best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what is revealed to you, and be patient till Allah shall judge, and He is the Best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow what is revealed to you, and be patient until God issues His judgment, for He is the Best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow what is revealed to you, [O Muhammad], and be patient until Allah will judge. And He is the best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:109] And follow what is revealed to you, from your Lord, and endure [patiently], the Call and their hurting [you], until God give judgement, concerning them, by giving His command, and He is the Best of Judges, the fairest of them: he [the Prophet] endured patiently until God judged that the idolaters be fought and that the People of the Scripture pay the jizya-tax. Meccan, except for verses 12, 17, and 114, which are Medinese; it consists of 123 verses, and was revealed after Yūnus.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And) Muhammad (follow that which is inspired in thee) that which you are commanded in the Qur'an regarding the conveyance of the message, (and forbear) in this conveyance (until Allah give judgement) until Allah judges between them and you, i.e. through their killing and destruction on the Day of Badr. (And He is the Best of Judges) He is the strongest of Judges: He is able to destroy them and make you triumphant'. And of the surah in which Hud is mentioned, which is Meccan in its entirety, and consists of 123 verses, 1,625 words and 6,950 letters: Surah 11: Hud And of the surah in which Hud is mentioned, which is Meccan in its entirety, and consists of 123 verses, 1,625 words and 6,950 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱتَّبِعْ } يا أكمل الرسل { مَا يُوحَىٰ إِلَيْكَ } من ربك وامض عليه\n وبلغ الناس { وَ } لا تبالي بإعراضهم وتكذيبهم\n بل { ٱصْبِرْ } على أذاهم وتحمل مكروهاتهم\n ولا تفتر عن دعوتك إياهم { حَتَّىٰ يَحْكُمَ ٱللَّهُ } المتولي لأمورك بنصرك وغلبتك عليهم بالقتال وبنسخ دينك جميع الأديان وينشره في جميع الأقطار { وَهُوَ خَيْرُ ٱلْحَاكِمِينَ } [يونس: 109] إذ هو مطلع على سرائر الأمور وخفاياها\n قادر على جميع الانتقام لمن أراد مقتك وأعرض عنك\n\n\nربِّ احكم بالخير والحسنى ووفقنا على متابعة سيد الورى\n\n\nخاتمة السورة\n\nعليك أيها الطالب لتحقيق الحق\n العازم على طريق التوحيد والعرفان\n المستكشف عن رموز أهل الكشف وأرباب المحبة والولاء - أنجح الله آمالك\n ويسر الله مآلك ويصونك عما عليك - أن تحافظ على شعائر دين الإسلام الذي هو الحق الصريح المنزل على خير الأنام بالعزيمة الصحيحة الخالصة عن شوب الرياء والسمعة\n الصافية على قدر الغفلة والهوى\n وتلازم الاستفادة والاسترشاد من كتاب الله وأحاديث رسوله - صلوات الله عليه وسلام - وما سمحت به أكابر الصحابة\n سيما الحضرة الرضوية المرتضوية وأولاده الكرام - سلام الله عليهم وكرم الله وجوههم - والتابعين لهم بإحسان - رضوان الله عليهم أجمعين - وما جاد به المشايخ العظام والأماجد الكرام\n أنار الله براهنيهم\n وقدس أسرارهم\n\nوكن في عزمك هذا متوجهاً إلى قبلة التوحيد وكعبة الذات مائلاً عن الأديان الباطلة والآراء الفاسدة\n مصفياً قلبك عن إمارات الكثرة والتعدد إلى حيث ارتفع عنك الالتفات إلى نفسك وشأنك حتى يحل عليك الحيرة المغنية لهويتك في هوية الحق المسقطة لتعينك رأساً\n ولا يتيسر لك هذا إلا بالركون عن لوازم الطبيعة والخروج عنها وعما يترتب عليها من اللذات الوهمية والمشتهيات البهيمية التي هي مقتضيات التعينات العدمية واشخصيات الهيولانية\n\n\nومتى صفت سرك وسيرتك عن أمثال هذه المزخرفات العائقة عن الاستغراق في بحر الذات\n فزت بما فزت\n وصرت بما صرت\n وحكم الله عليك بالخير والحسنى وأسكنك عند سدرة المنتهى\n عندها جنة المأوى\n وليس وراء الله مرمى\n لا حول ولا قوةإلا بالله\n هو يقول الحق\n وهوي يهدي السبيل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:13",
      "similarity": 0.5153045479228962
    },
    {
      "verse": "49:5",
      "similarity": 0.5145680762385524
    },
    {
      "verse": "7:87",
      "similarity": 0.4839621580163186
    },
    {
      "verse": "42:3",
      "similarity": 0.4751698140672789
    },
    {
      "verse": "33:2",
      "similarity": 0.4601352279691962
    }
  ]
}