{
  "chapter": "يونس",
  "text": "فلما انجىهم اذا هم يبغون فى الارض بغير الحق يايها الناس انما بغيكم على انفسكم متع الحيوة الدنيا ثم الينا مرجعكم فننبئكم بما كنتم تعملون",
  "translations": [
    {
      "translation": "But then, when He does rescue them, they become rebellious in the earth without any right to do so. then you will return to Us and We will inform you about what you did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He rescues them, they commit excesses in the land unjustly again. Your rebellion, O people, shall recoil back on your own selves. The joys of the world (are only ephemeral): You have to come back to Us in the end. We shall then inform you what you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no sooner than He delivers them than they go about committing excesses on the earth, acting unjustly. Men! The excesses you commit will be of harm only to yourselves, (Enjoy, if you will) the fleeting pleasure of this world; in me end you shall all return to Us, and then We shall tell you what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We saved you, you started to rebel unjustly in the land. People, your rebellion will only harm yourselves. You may enjoy the worldly life but to Us you will all return and We will let you know all that you had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when He rescues them, they start wrongfully committing oppression in the earth; O mankind! Your oppression is only a torment against yourselves; derive the benefit until you live in this world; you have then to return to Us and thereupon We shall show you your misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He delivers them, behold! They rebel (disobey Allah) in the earth wrongfully. O mankind! Your rebellion is only against yourselves, -- a brief enjoyment of this worldly life, then (in the end) unto Us is your return, and We shall inform you of that which you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He delivers them, lo! they are unjustly rebellious in the earth. O men! your rebellion is against your own souls-- provision (only) of this world's life-- then to Us shall be your return, so We will inform you of what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nevertheless when He has delivered them behold, they are insolent in the earth, wrongfully. O men, your insolence is only against yourselves; the enjoyment of this present life, then unto Us you shall return, then We shall tell you what you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when He hath delivered them, behold! they rebel in the earth wrongfully. O mankind! Your rebellion is only against yourselves. (Ye have) enjoyment of the life of the world; then unto Us is your return and We shall proclaim unto you what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He has delivered them, they begin, wrongfully to commit excesses in the land. O you men, your excesses only affect your own selves. Have the enjoyment of the present life. Then to Us you shall return; and We will inform you of all that you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when He delivereth them. they forthwith rebel in the earth without justice. O ye! your rebellion is only against yourselves: a brief enjoyment of the life of the world; thereafter unto Us is Your return; then We will declare unto you that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He delivers them, behold, they commit violations on the earth unduly! O mankind! Your violations are only to your own detriment. [These are] the wares of the life of this world; then to Us will be your return, whereat We will inform you concerning what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he delivereth them, behold! they transgress insolently through the earth in defiance of right! O mankind! your insolence is against your own souls,- an enjoyment of the life of the present: in the end, to Us is your return, and We shall show you the truth of all that ye did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He delivered them, behold! They rebel (disobey Allah) in the earth wrongfully. O mankind! Your rebellion (disobedience to Allah) is only against your ownselves, - a brief enjoyment of this worldly life, then (in the end) unto Us is your return, and We shall inform you that which you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He has saved them, see how they become wrongfully insolent in the land. People, your insolence is only against yourselves; the enjoyment of this present life, then to Us you shall return and We shall tell you what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But then, when He has saved them, they commit violations on earth, and oppose justice. O people! Your violations are against your own souls. It is the enjoyment of the present life. Then to Us is your return, and We will inform you of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He saves them, at once they commit injustice upon the earth without right. O mankind, your injustice is only against yourselves, [being merely] the enjoyment of worldly life. Then to Us is your return, and We will inform you of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:23] Yet when He has delivered them, behold! they are insolent in the earth wrongfully, by associating others with God. O mankind, your insolence, wrongdoing, is only against yourselves, since the sin thereof shall fall against them; it is [but], the enjoyment of the life of this world, which you will enjoy for a short while, then to Us is your return, after death, and We shall inform you of what you used to do, and then requite you for it (a variant reading [for nominative matā‘u] has accusative matā‘a, ‘an enjoyment’, in other words [read as with an omitted verb such as] tatamatta‘ūna, ‘[one which] you shall enjoy’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Yet when He hath delivered them) from the storm and drowning, (behold! they rebel) they become insolent (in the earth wrongfully) without any right. (0 mankind!) people of Mecca! (Your rebellion) your transgression and insolence with one another (is only against yourselves) i.e. its onus is only against you. ((Ye have) enjoyment of the life of the world) the benefits of the life of this world perish and are not lasting; (then unto Us is your return) after death (and We shall proclaim unto you) inform you about (what ye used to do) and say of good and evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنما بغْيكم على أنفسكم } إلى آخره، البغي ضدّ العدل، فكما أن العدل فضيلة شاملة لجميع الفضائل وهيئة وجدانية لها فائضة من نور الوحدة على النفس فالبغي لا يكون إلا عن غاية الانهماك في الرذائل بحيث يستلزمها جميعاً فصاحبها في غاية البعد عن الحق ونهاية الظلمة كما قال:\n\n \" الظلم ظلمات يوم القيامة \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّآ أَنجَاهُمْ } إجابةً لدعائهم، وكشفنا لضرهم وبلائهم { إِذَا هُمْ } يفاجئون إلى الكفران ويسارعون إلى الطغيان، حيث { يَبْغُونَ } ويطلبون الفساد { فِي ٱلأَرْضِ } المعدة للعبادة والصلاح { بِغَيْرِ ٱلْحَقِّ } أي: بلا رخصة شرعكية، بل عن بغي وعناد، التفت سبحانه من الخطاب إلى الغيبة؛ تنبيهاً على بعدهم وطردهم عن ساحة عز الحضور، لذلك أبعدهم بالغيبة بعدما قربهم بالخطاب\n\n\n\n\nثم قال سبحانه: { يٰأَيُّهَا ٱلنَّاسُ } الناسين نعمة الإنجاء والخلاص عن ورطة الهلاك { إِنَّمَا بَغْيُكُمْ } وكفرانكم الذي فاجأتم به، بدل الشكر والإطاعة في النشأة الأولى وبال عائد { عَلَىٰ أَنفُسِكُمْ } في النشأة الأخرى؛ إذ { مَّتَاعَ ٱلْحَيَاةِ ٱلدُّنْيَا } أي: التمتع بلذاتها وشهواتها، والركون إلى مزخرفاتها قليل حقير ونزر يسير؛ لا ينبغي للعاقل أن يترك الباقي لأجل الفاني، واللذة الروحانية الدائمة المستمرة للذة الجسمانية المتناهية القصيرة { ثُمَّ } بعد انقضاء النشأة الأولى { إِلَينَا } لا إلى غيرنا؛ إذ لا غير معنا { مَرْجِعُكُمْ } ومصريكم رجوع الأضلال والأضواء والعكوس إلى الشمس { فَنُنَبِّئُكُمْ } أي: نخبركم ونعمل بكم { بِمَا كُنتُمْ تَعْمَلُونَ } [يونس: 23] أي: بمقتضى عملكم، إن خيراً فخير وإن شراً فشر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قاله البيضاوي: قلت: وفي كونه بغياً نظر، والأظهر أن قوله: { بغير الحق } تأكيد لا مفهوم له\n  { يا أيها الناس إنما بَغْيُكم على أنفسكم } فإن وباله عائد عليكم، أو على أبناء جنسكم، وذلك { متاع الحياة الدنيا } تتمتعون به ساعة، { ثم إلينا مرجعكم } في القيامة { فنُنبئكم بما كنتم تعملون } بالجزاء عليه\n الإشارة: وإذا أذقنا الناس حلاوة المعرفة والعلم، بعد ضرر الجهل والغفلة، إذا لهم مكر في آياتنا وهم الأولياء والمشايخ، الذين فتح الله بسببهم عليهم ـ بالطعن عليهم والانتقال عنهم، كما يفعله بعض المريدين، أو جُلُّ طلبة العلم، بنسيان مشايخهم ونسيان العهد إليهم، قل الله أسرع مكراً بهم، فيريهم أن الأمداد باقية، تجري عليهم استدراجاً، ثم يحبس ذلك عنهم فتيبس أشجار معانيهم، وتظلم قلوبهم\n ثم قال تعالى: { هو الذي يُسيركم } إليه في بر الشريعة، وبحر الحقيقة، فيقع السير بينهما، فإذا كانت الشريعة أقوى نقص له منها وزاد في حقيقته، وإذا قويت حقيقته نقص له منها إلى شريعته، هكذا حتى تعتدلا، فتكمل تربيته، فإذا ركبوا سفن الأفكار وساروا بأرواحهم في تيار البحار، فخاضوا بأفكارهم بحار التوحيد وأسرار التفريد، وجرت أفكارهم في عالم الملكوت بريح طيبة ـ وهي ريح السلوك ـ جاءتها ريح عاصف، وهي الواردات الإلهية، تأتي من حضرة القهار، لا تصادم شيئاً إلا دمغته، فإذا خافوا على نفوسهم صدمات الجذب او المحْو دََعوا الله مخلصين له الدين، فلما ردهم إلى السلوك اشتغلوا برياضة نفوسهم بالمجاهدة والمكابدة، فبغوا عليها كما بغت عليهم في أيام غفلتهم\n وبالله التوفيق\n ثم حذَّر من زهرة الدنيا، فقال: { إِنَّمَا مَثَلُ ٱلْحَيَاةِ ٱلدُّنْيَا كَمَآءٍ أَنزَلْنَاهُ مِنَ ٱلسَّمَآءِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:70",
      "similarity": 0.4266451282345513
    },
    {
      "verse": "5:105",
      "similarity": 0.388630443460806
    },
    {
      "verse": "42:42",
      "similarity": 0.344796267756692
    },
    {
      "verse": "40:39",
      "similarity": 0.34352493205388046
    },
    {
      "verse": "6:164",
      "similarity": 0.33656826296233777
    }
  ]
}