{
  "chapter": "يونس",
  "text": "ويوم نحشرهم جميعا ثم نقول للذين اشركوا۟ مكانكم انتم وشركاؤكم فزيلنا بينهم وقال شركاؤهم ما كنتم ايانا تعبدون",
  "translations": [
    {
      "translation": "On the Day We gather them all together, We will say then to those who associated others with Allah, 'To your place, you and your partner-gods!' Then We will sift them out, and their partner-gods will say, 'It was not us you worshipped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We shall gather them all together We shall say to the idolaters: \"Take your stand with the compeers you worshipped as the equals of God.\" We shall then create a rift between them, and the compeers will say: \"You did not worship us;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day when We shall muster them all together, We shall say to those who associated others with Allah in His divinity: 'Keep to your places - you and those whom you associated with Allah.' Then We shall remove the veil of foreignness separating them. Those whom they had associated with Allah will say. 'It was not us that you worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will tell the pagans on the day when every one is resurrected, \"Stand with your idols wherever you are.\" Then We will separate them (from their idols) and their idols will protest against them saying, \"You did not worship us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We raise all of them together, then say to the polytheists, “Stay in your place – you and your partners (false deities)”; so We shall separate them from the believers, and their partners will say to them, “When did you ever worship us!?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day whereon We shall gather them all together, then We shall say to those who did set partners in worship with Us: \"Stop at your place! You and your partners.\" Then We shall separate them, and their partners shall say: \"It was not us that you used to worship.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We will gather them all together, then We will say to those who associated others (with Allah): Keep where you are, you and your associates; then We shall separate them widely one from another and their associates would say: It was not us that you served:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day We shall muster them all, then We shall say to those who associate other gods with God: 'Get you to your place, you and your associates!' Then We shall set a space between them, and their associates will say, 'Not us you were serving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We gather them all together, then We say unto those who ascribed partners (unto Us): Stand back, ye and your (pretended) partners (of Allah)! And We separate them, the one from the other, and their (pretended) partners say: It was not us ye worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We gather them all together, We shall say to those who ascribed partners to God, \"Keep to your places, you and your partners!\" Then We shall separate them from one another and their partner-gods will say, \"It was not us that you worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the Day whereon We shall gather them together, then We shall say un to those who associated: keep your place, ye and your associate gods. Then We shall cause split between them: and their associate-gods will say: it was not us that ye were worshipping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We gather them all together, We shall say to those who ascribe partners [to Allah], ‘Stay where you are—you and your partners!’ Then We shall set them apart from one another, and their partners will say, ‘It was not us that you worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day shall We gather them all together. Then shall We say to those who joined gods (with Us): \"To your place! ye and those ye joined as 'partners' We shall separate them, and their \"Partners\" shall say: \"It was not us that ye worshipped!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day whereon We shall gather them all together, then We shall say to those who did set partners in worship with Us: \"Stop at your place! You and your partners (whom you had worshipped in the worldly life).\" then We shall separate them, and their (Allah's so-called) partners shall say: \"It was not us that you used to worship.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when We assemble them all together, We shall say to those who associated (other gods with Allah): 'Go to your place, you and your associates' Then, We will separate them, and their associates will say (to them): 'It was not us that you worshipped'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We will gather them altogether, then say to those who ascribed partners, “To your place, you and your partners.” Then We will separate between them, and their partners will say, “It was not us you were worshiping.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], the Day We will gather them all together - then We will say to those who associated others with Allah, \"[Remain in] your place, you and your 'partners.' \" Then We will separate them, and their \"partners\" will say, \"You did not used to worship us,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:28] And, mention, the day on which We shall gather them, that is, creation, all together, then We shall say to those who associated others [with God]: ‘In your place! (makānakum is in the accusative because ilzamū, ‘adhere to’, is implied [sc. ilzamū makānakum]). You (antum: this emphasises the [second person plural] subject concealed in the implied verb [ilzamū], and allows for the supplement [that follows]:) and your associates!’, that is, the idols. Then We shall make a separation, We shall distinguish, between them, and the believers, as [is stated] in the verse, wa’mtāzū’l-yawma ayyuhā’l-mujrimūn, ‘Now be separate, you sinners, upon this day!’ [Q. 36:59]; and their associates will say, to them: ‘It was not us that you were worshipping (mā [of mā-kuntum, ‘you were not …’] is for negation; the direct object [iyyānā, ‘us’] precedes the verb in order [to accord] with the end-rhyme [of the Qur’ānic verse];\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذه الجملة معطوفة على جملة { والذين كسبوا السيئات } \\[ يونس : 27 \\] باعتبار كونها معطوفة على جملة { للذين أحسنوا الحسنى } \\[ يونس : 26 \\] فإنه لما ذكر في الجملتين السابقتين ما يختص به كل فريق من الفريقين من الجزاء وسماته جاءت هذه الجملة بإجماللِ حالةٍ جامعةٍ للفريقين ثم بتفصيل حَالة يمتاز بها المشركون ليحصل بذلك ذكر فظيع من أحوال الذين بلغوا الغاية في كسب السيئات ، وهي سيئة الإشراك الذي هو أكبر الكبائر ، وبذلك حصلت المناسبة مع الجملة التي قبلها المقتضية عطفها عليها .والمقصود من الخبر هو ذكر حشرهم جميعاً ، ثم ما يقع في ذلك الحشر من افتضاح الذين أشركوا ، فكان مقتضى الظاهر أن يقال ، ونحشرهم جميعاً . وإنما زيد لفظ { يوم } في صدر الجملة لأن ذلك اليوم لما كان هو زمن الحشر وأعماللٍ عظيمة أريد التذكير به تهويلاً وموعظة .وانتصاب { يوم نحشرهم } إما على المفعولية بتقدير : اذْكر ، وإما على الظرفية لفعل مقدر يدل عليه قوله : { ثم نقول للذين أشركوا مكانكم } والتقدير : ونقول للذين أشركوا مكانكم يوم نحشر الناس جميعاً . وضمير { نحشرهم } للذين تقدم الكلام عليهم وهم الذين أحسنوا والذين كسبوا السيئات . وقوله : { جميعاً } حال من الضمير البارز في { نحشرهم } للتنصيص على إرادة عموم الضمير . وذلك أن الحشر يعم الناس كلهم . ومن نكت ذِكر حشر الجميع هُنا التنبيهُ على أن فظيعَ حال المشركين وافتضاحهم يكون بمرأى ومسمع من المؤمنين ، فتكون السلامة من تلك الحالة زيادة في النعمة على المسلمين وتقوية في النكاية للمشركين .والحشر : الجمع من أمكنة إلى مكان واحد . وتقدم في قوله تعالى : { وحشرنا عليهم كل شيء } في سورة \\[ الأنعام : 111 \\].وقوله : { مكانَكم } منصوب على المفعولية بفعل محذوف تقديره : الزموا مكانكم ، واستعماله هذا شائع في كلام العرب في الأمر بالملازمة مع التزام حذف العامل فيه حتى صار بمنزلة أسماء الأفعال الموضوعة للأمر ، نحو : صَهْ ، ويقترن بضمير مناسب للمخاطب من إفراد وغيره ، قال عمرو بن الأطنابةمكانَككِ تحمدي أو تستريحي: ...وأمرُهم بملازمة المكان تثقيف وحَبس . وإذ قد جمع فيه المخاطَبون وشركاؤهم عُلِم أن ذلك الحبس لأجل جريمة مشتركة بين الفريقين ، وهي كون أحد الفريقين عابداً والآخرِ معبوداً .وقوله : { أنتم } تأكيد للضمير المتصل المقدر في الفعل المقدر ، وهو المسوغ للعطف عليه وبهذا العطف صار الشركاء مأمورين باللبث في المكان .والشركاء : الأصنام . وصفوا بالشركاء لاعتقاد المخاطبين ذلك ، ولذلك أضيف إلى ضميرهم ، أي أنتم والذين زَعمتم أنهم شركاء . فإضافة شركاء إلى ضمير المخاطبين تهكم .وعطف { فزيلْنا } بفاء التعقيب لإفادة حصول ذلك في عقب وقت الأمر باللبث . ولما كانت الفاء تقتضي الترتيب الزمني في حصول معطوفها إثر المعطوف عليه وكان المقصود هنا أن التزييل حصل مقارناً لإلزامهم المكان عبر عن فعل التزييل بصيغة الماضي لإفادة تحقيق وقوع التزييل كقوله :{ أتى أمر الله } \\[ النحل : 1 \\].وزيَّل : مضاعف زال المتعدي . يقال : زَاله عن موضعه يَزِيله بمعنى أزاله فجعلوه يائي العين للتفرقة بينه وبين زال القاصر الذي هو واوي العين ، فزيَّل فعل للمبالغة في الزيْل مثل فَرَّق مبالغة في فرق . والمعنى وقع بينهم تفريق قوي بحيث انقطعت جميع الوِصَل التي كانت بينهم . والتزييل هنا مجازي فيشمل اختلاف القول .وتعليق التزييل بالأصنام باعتبار خلق معناه فيها حين أنطقها الله بما يخالف زعم عبّادها .وجملة { وقال شركاؤهم } عطف على جملة : { فزيلنا } فهو في حيز التعقيب ، ويجوز جعلها حالاً .ويقول الشركاء هذا الكلام بخَلق نطق فيها خارق للعادة يفهمه الناس لإشعار أولئك العابدين بأن أصنامهم تبرأوا منهم ، وذلك مما يزيدهم ندامة . وكلام الأصنام يفيد نفي أن يكونوا عبدوهم بل عبدوا غيرهم . وفي استقامة ذلك إشكال لأن الواقع أنهم عبدوهم وعبدوا غيرهم فكيف ينفي كلامهم عبادتهم إياهم وهو كلام خلقه الله فيهم فكيف يكون كذباً . وقد تأول المفسرون هذا بوجوه لا ينثلج لها الصدر .والذي ظهر لي أن يكون آخر كلام الأصنام مُبيناً لما أجمله أوله بأنهم نفوا أن يكونوا عبدوهم عبادةً كاملة وهي العبادة التي يقصِد منها العابد امتثال أمر المعبود وإرضاءه فتقتضي أن يكون المعبود عالماً وآمراً بتلك العبادة . ولما كانت الأصنام غير عالمين ولا آمرين استقام نَفْيهم أن يكون عبدتهم قد عبدوهم تلك العبادة وإنما عبدوا غيرهم ممن أمروهم بالعبادة وهم الشياطين ولذلك قالوا : { إنْ كنا عن عبادتكم لغافلين } كما تفسره الآية الأخرى وهي قوله تعالى : { أهؤلاء إياكم كانوا يعبُدون قالوا سبحانك أنت ولينا من دونهم بل كانوا يعبدون الجن أكثرهم بهم مؤمنون } \\[ سبأ : 40 ، 41 \\].فالمراد بالشركاء الأصنام لا غيرها ، ويجوز أن يكون نُطقها بجحد عبادة المشركين هو أن خلق لها عقولاً فكانت عقولها مستحدثة يومئذٍ لم يتقرر فيها علم بأن المشركين عَبدوها . ويفسر هذا قولهم بعد ذلك { إن كنا عن عبادتكم لغافلين }.\n\n",
      "translations": [
        {
          "translation": "(On the day when We gather them) the disbelievers and their gods (all together, then We say unto those who ascribed partners) to Allah: idols: (Stand back) stop, (ye and your (pretended) partners (of Allah)) you and your idols! (And We separate them, the one from the other) We separated them from their idols; and the disbelievers said: \"these have commanded us to worship them instead of worshipping You\"; (and their (pretended) partners say) and their idols respond: (It was not us ye worshipped) we did not command you to worship us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويوم نحشرهم جميعاً } في المجمع الأكبر عين جمع الوجود المطلق { ثم نقول للذين أشركوا } منهم أي: المحجوبين الواقفين مع الغير بالمحبة والطاعة { مكانكم } أي: الزموا مكانكم { أنتم وشركاؤكم } ومعناه: وقفوا مع ما وقفوا معه في الموقف مع قطع الوصل والأسباب التي هي سبب محبتهم وعبادتهم وتبرّء المعبود من العابد لانقطاع الآلات البدنية والأغراض الطبيعية التي توجب تلك الوصل وهو معنى قوله: { فزيلنا بينهم } أي: مع كونهم في الموقف معاً فرقنا بينهم في الوجهة وذلك عند علوّ رتبة المعبود ودنوّ رتبة العابد وتباين حاليهما إذا كان المعبود شريفاً كالملائكة والمسيح وعزير وأمثالهم ممن له السابقة عند الله كما قال تعالى:\n[الأنبياء\n الآية: 101]\n { وقال شركاؤهم ما كنتم إيانا تعبدون } بل تعبدون الشيطان بطاعتكم إياه وما اخترعتموه في أوهامكم من أباطيل فاسدة وأماني كاذبة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر لهم يا أكمل الرسل { يَوْمَ نَحْشُرُهُمْ } أي: كلا الفريقين { جَمِيعاً } في يوم العرض والجزاء { ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُواْ } بنا غيرنا من التماثيل والأصنام: الزموا { مَكَانَكُمْ } واستقروا عليها { أَنتُمْ وَشُرَكَآؤُكُمْ } حتى تسألوا عمَّا أجرمتم { فَزَيَّلْنَا } فرَّقنا وفصلنا { بَيْنَهُمْ } أي: رفعنا رابطة العابدية والمعبودية التي بها وصلتهم وارتباطهم { وَقَالَ شُرَكَآؤُهُمْ } مخاطبين إياه مشافهةً\n برءة لنفوسهم: { مَّا كُنتُمْ } أيها الضالون\n المنهمكون في الغي والضلال { إِيَّانَا تَعْبُدُونَ } [يونس: 28] بعلمنا وأمرنا\n إذ لسنا من ذوي العلم وأولي الأمر\n بل تعبدون أنتم أهواءكم وشياطينكم الكامنة في نفوسكم قد افتريتم علينا ونسبتم بنا\n عناداً ومكابرةً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: مكانكم: مفعول\n أي: الزموا مكانكم\n وأنتم تأكيد للضمير المنتقل إليه\n وشركاؤكم عطف عليه\n يقول الحق جل جلاله: { و } اذكر { يوم نحشرهم جميعاً } يعني فريق الحسنى\n وفريق النار\n { ثم نقول للذين أشركوا } الزموا { مكانَكم } من الخزي والهوان\n حتى تنظروا ما يُفعل بكم\n { أنتم شركاؤُكم } معكم\n تمثيل حينئذ معهم\n { فزَيَّلنا }: فرَّقنا { بينهم } وقطعنا الوُصل التي كانت بينهم\n { وقال شركاؤهم } \n ينطقها الله تعالى تكذيباً لهم فتقول: { ما كنتم إيانا تعبدون } \n وإنما عبدتم في الحقيقة أهواؤكم لأنها الأمارة لكم بالإشراك\n وقيل: المراد بالشركاء: الملائكة والمسيح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:40",
      "similarity": 0.5870964237661739
    },
    {
      "verse": "11:118",
      "similarity": 0.579713553382504
    },
    {
      "verse": "9:110",
      "similarity": 0.5321453481708851
    },
    {
      "verse": "40:34",
      "similarity": 0.3703579012387275
    },
    {
      "verse": "34:24",
      "similarity": 0.3398921601457618
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}