{
  "chapter": "يونس",
  "text": "والذين كسبوا۟ السيـات جزاء سيئةۭ بمثلها وترهقهم ذلة ما لهم من الله من عاصم كانما اغشيت وجوههم قطعا من اليل مظلما او۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "But those who earn evil shall be punished to an equal degree as their evil, and they will be covered with shame, and will have none to protect them against God: Their faces shall be blackened as though with patches of the night. They are the people of Hell, where they will abide for ever,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do evil deeds, the recompense of an evil deed is its like, and humiliation shall spread over them and there will be none to protect them from Allah. Darkness will cover their faces as though they were veiled with the dark blackness of night. These are the people of the Fire and in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense for the evil deeds will be equally evil (not more) and the faces of the evil-doers will suffer from disgrace. No one can protect them from the wrath of God. Their faces will become dark as if covered by the pitch-darkness of night. They will be the dwellers of hell wherein they will remain forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (for) those who earned evil*, the recompense of evil is equal to it – and disgrace will come upon them; they will have no one to save them from Allah; as if their faces are covered with pieces of the dark night; it is they who are the people of the fire; they will remain in it forever. (* The disbelievers.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have earned evil deeds, the recompense of an evil deed is the like thereof, and humiliating disgrace will cover them (their faces). No defender will they have from Allah. Their faces will be covered as it were with pieces from the darkness of night. They are the dwellers of the Fire, they will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who have earned evil, the punishment of an evil is the like of it, and abasement shall come upon them-- they shall have none to protect them from Allah-- as if their faces had been covered with slices of the dense darkness of night; these are the inmates of the fire; in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for those who have earned evil deeds the recompense of an evil deed shall be the like of it; abasement shall overspread them, neither have they any defender from God, as if their faces were covered with strips of night shadowy. Those are the inhabitants of the Fire, therein dwelling forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who earn ill-deeds, (for them) requital of each ill-deed by the like thereof; and ignominy overtaketh them - They have no protector from Allah - as if their faces had been covered with a cloak of darkest night. Such are rightful owners of the Fire; they will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who have done evil deeds, the recompense shall be in proportion. They will have none to defend them against God. Ignominy shall cover them, as though their faces were veiled by the night's own darkness. It is they who are destined for the fire, where they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have earned misdeeds -the requital of a misdeed is the like thereof and abjection will cover them; no protector they shall have from Allah, though their faces were over cast with pieces of night pitch-dark. These are the fellows of the Fire: therein they will be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who have committed misdeeds, the requital of a misdeed shall be its like, and they shall be overcast by abasement. They shall have no one to protect [them] from Allah. [They will be] as if their faces were covered with dark patches of the night. They shall be the inmates of the Fire, and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have earned evil will have a reward of like evil: ignominy will cover their (faces): No defender will they have from (the wrath of) Allah: Their faces will be covered, as it were, with pieces from the depth of the darkness of night: they are companions of the Fire: they will abide therein (for aye)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have earned evil deeds, the recompense of an evil deed is the like thereof, and humiliating disgrace will cover them (their faces). No defender will they have from Allah. Their faces will be covered, as it were, with pieces from the darkness of night. They are dwellers of the Fire, they will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have earned evil deeds, evil shall be recompensed with its like. Abasement will cover them, they shall have none to defend them from Allah as though their faces were covered with parts of the blackness of night. Those, they are the companions of the Fire, in it they shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have earned evil deeds: a reward of similar evil, and shame will cover them. They will have no defense against God—as if their faces are covered with dark patches of night. These are the inmates of the Fire, abiding therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they who have earned [blame for] evil doings - the recompense of an evil deed is its equivalent, and humiliation will cover them. They will have from Allah no protector. It will be as if their faces are covered with pieces of the night - so dark [are they]. Those are the companions of the Fire; they will abide therein eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:27] And for those (wa’lladhīna is a supplement to li’lladhīna ahsanū, ‘for those who do good’, so [understand it as] wa-li’lladhīna, ‘and for those’) who earn evil deeds, by practising idolatry, [there shall be] the requital of an evil deed by the like thereof; ignominy shall overcome them — they have no protector, no defender, against God — as if their faces had been covered with, cloaked [in], strips of darkest night (read qita‘an, as the plural of qit‘a; or qit‘an, meaning juz’an, ‘a part’). Those, they are the inhabitants of the Fire: therein they will abide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who earn ill deeds) those who associate partners with Allah, ((for them) requital of each ill deed by the like thereof) Allah says: the retaliation for associating partners with Allah is hell; (and ignominy overtaketh them) grief and gloominess will appear on their faces. (They have no protector) no one to save them (from Allah) from the punishment of Allah. (As if their faces had been covered with a cloak of darkest night) i.e. of darkness. (Such are rightful owners of the Fire) the folk of hell; (they will abide therein) for ever.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قِطَعاً مِّنَ ٱلْلَّيْلِ مُظْلِماً } معناه بعضٌ\n والجَمعُ أَقطاعٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ كَسَبُواْ ٱلسَّيِّئَاتِ } من طغيان نفوسهم، ولم يلتفتوا إلى ما أمرهم الحق، وهداهم إليه رسله، يجيزون على مقتضى ما افترقوا { جَزَآءُ سَيِّئَةٍ بِمِثْلِهَا } عدلاً منه سبحانه { وَتَرْهَقُهُمْ ذِلَّةٌ } أي: تغطاهم غبار المذلة والخذلان، بدل ما اكتسبوا من البغي والعدوان { مَّا لَهُمْ } حينئذٍ { مِّنَ ٱللَّهِ } أي: من عذابه وعقابه { مِنْ عَاصِمٍ } حافظ يحفظهم، أو شفيع يشفع لهم ويخفف عنهم، بل صاروا من ظلمة كفرهم وفسقهم { كَأَنَّمَا أُغْشِيَتْ } سترت وأحيطت { وُجُوهُهُمْ قِطَعاً مِّنَ ٱلْلَّيْلِ مُظْلِماً } في غاية الظلمة لعدم استنارتهم بنور الإيمان والعمل الصالح { أُوْلَـٰئِكَ } الأشقياء، الهالكون في تيه الغي والضلال { أَصْحَابُ ٱلنَّارِ } المعدة لأهل الغفلة والأهواء { هُمْ فِيهَا خَالِدُونَ } [يونس: 27] جزاءً بما كانوا يكسبون من الكفر والمعاصي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: والذين: مبتدأ على حذف مضاف، أي: جزاء الذين كسبوا، وجزاء: خبر، أو على تقدير \" لهم \" أو معطوف على للذين أحسنوا على مذهب من يُجوز: في الدار زيد والحجرةِ عمرو\n أو جزاء: مبتدأ، وبمثلها: خبر، والجملة حينئذٍ كبرى\n ومن قرأ قِطعَاً بفتح الطاء فجمع قطيع، وهو مفعول ثان، ومظلماً: حال من الليل، ومن قرأ قِطعَاً بالسكون فمصدر، ومظلماً نعت له، أو حال منه أو من الليل\n  يقول الحق جل جلاله: { والذين كسَبوا السيئات } كالكفر والشرك، وما يتبعهما من المعاصي، جزاؤهم { سيئة بمثلها } لا يزاد عليها، فلا تضاعف سيئاتهم، عدلاً منه سبحانه، { وترهقُهم ذِلةٌ } أي: هوان عند حشرهم للنار، { ما لهم من الله من عاصم } يعصمهم من عذاب الله وغضبه، { كأنما أُغشيَت وجوهُهُم قِطعَاً من الليل مظلماً } ، أي: يحشرون مسودة وجوههم، كأنما أُكْسِيَتْ وجوههم قطْعاً كثيرة من الليل المظلم، أو قطْعاً مظلماً من الليل { أولئك أصحابُ النار هم فيها خالدون }\n قال البيضاوي: هذا مما يحتج به الوعيدية ـ يعني المعتزلة ـ في تخليد العصاة\n والجواب: أن الآية في الكفار لاشتمال السيئات على الكفر والشرك، ولأن الذين أحسنوا يتناول الكثير من أهل القبلة، فلا يتناوله قسيمُه\n هـ\n الإشارة: جزاء المعاصي البُعد والهوان، وتسْويد وجوه القلوب والأبدان، كما أن جزاء الطاعة التقريب والإبرار، وتنوير وجوه القلوب والأسرار والإحسان، وفي ذلك يقول ابن النحوي في منفرجته:\n",
      "translations": []
    }
  ]
}