{
  "chapter": "يونس",
  "text": "ويوم نحشرهم جميعا ثم نقول للذين اشركوا۟ مكانكم انتم وشركاؤكم فزيلنا بينهم وقال شركاؤهم ما كنتم ايانا تعبدون",
  "translations": [
    {
      "translation": "On the Day We gather them all together, We will say then to those who associated others with Allah, 'To your place, you and your partner-gods!' Then We will sift them out, and their partner-gods will say, 'It was not us you worshipped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We shall gather them all together We shall say to the idolaters: \"Take your stand with the compeers you worshipped as the equals of God.\" We shall then create a rift between them, and the compeers will say: \"You did not worship us;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day when We shall muster them all together, We shall say to those who associated others with Allah in His divinity: 'Keep to your places - you and those whom you associated with Allah.' Then We shall remove the veil of foreignness separating them. Those whom they had associated with Allah will say. 'It was not us that you worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will tell the pagans on the day when every one is resurrected, \"Stand with your idols wherever you are.\" Then We will separate them (from their idols) and their idols will protest against them saying, \"You did not worship us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We raise all of them together, then say to the polytheists, “Stay in your place – you and your partners (false deities)”; so We shall separate them from the believers, and their partners will say to them, “When did you ever worship us!?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day whereon We shall gather them all together, then We shall say to those who did set partners in worship with Us: \"Stop at your place! You and your partners.\" Then We shall separate them, and their partners shall say: \"It was not us that you used to worship.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We will gather them all together, then We will say to those who associated others (with Allah): Keep where you are, you and your associates; then We shall separate them widely one from another and their associates would say: It was not us that you served:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day We shall muster them all, then We shall say to those who associate other gods with God: 'Get you to your place, you and your associates!' Then We shall set a space between them, and their associates will say, 'Not us you were serving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We gather them all together, then We say unto those who ascribed partners (unto Us): Stand back, ye and your (pretended) partners (of Allah)! And We separate them, the one from the other, and their (pretended) partners say: It was not us ye worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We gather them all together, We shall say to those who ascribed partners to God, \"Keep to your places, you and your partners!\" Then We shall separate them from one another and their partner-gods will say, \"It was not us that you worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the Day whereon We shall gather them together, then We shall say un to those who associated: keep your place, ye and your associate gods. Then We shall cause split between them: and their associate-gods will say: it was not us that ye were worshipping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We gather them all together, We shall say to those who ascribe partners [to Allah], ‘Stay where you are—you and your partners!’ Then We shall set them apart from one another, and their partners will say, ‘It was not us that you worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day shall We gather them all together. Then shall We say to those who joined gods (with Us): \"To your place! ye and those ye joined as 'partners' We shall separate them, and their \"Partners\" shall say: \"It was not us that ye worshipped!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day whereon We shall gather them all together, then We shall say to those who did set partners in worship with Us: \"Stop at your place! You and your partners (whom you had worshipped in the worldly life).\" then We shall separate them, and their (Allah's so-called) partners shall say: \"It was not us that you used to worship.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when We assemble them all together, We shall say to those who associated (other gods with Allah): 'Go to your place, you and your associates' Then, We will separate them, and their associates will say (to them): 'It was not us that you worshipped'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We will gather them altogether, then say to those who ascribed partners, “To your place, you and your partners.” Then We will separate between them, and their partners will say, “It was not us you were worshiping.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], the Day We will gather them all together - then We will say to those who associated others with Allah, \"[Remain in] your place, you and your 'partners.' \" Then We will separate them, and their \"partners\" will say, \"You did not used to worship us,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:28] And, mention, the day on which We shall gather them, that is, creation, all together, then We shall say to those who associated others [with God]: ‘In your place! (makānakum is in the accusative because ilzamū, ‘adhere to’, is implied [sc. ilzamū makānakum]). You (antum: this emphasises the [second person plural] subject concealed in the implied verb [ilzamū], and allows for the supplement [that follows]:) and your associates!’, that is, the idols. Then We shall make a separation, We shall distinguish, between them, and the believers, as [is stated] in the verse, wa’mtāzū’l-yawma ayyuhā’l-mujrimūn, ‘Now be separate, you sinners, upon this day!’ [Q. 36:59]; and their associates will say, to them: ‘It was not us that you were worshipping (mā [of mā-kuntum, ‘you were not …’] is for negation; the direct object [iyyānā, ‘us’] precedes the verb in order [to accord] with the end-rhyme [of the Qur’ānic verse];\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when We gather them) the disbelievers and their gods (all together, then We say unto those who ascribed partners) to Allah: idols: (Stand back) stop, (ye and your (pretended) partners (of Allah)) you and your idols! (And We separate them, the one from the other) We separated them from their idols; and the disbelievers said: \"these have commanded us to worship them instead of worshipping You\"; (and their (pretended) partners say) and their idols respond: (It was not us ye worshipped) we did not command you to worship us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويوم نحشرهم جميعاً } في المجمع الأكبر عين جمع الوجود المطلق { ثم نقول للذين أشركوا } منهم أي: المحجوبين الواقفين مع الغير بالمحبة والطاعة { مكانكم } أي: الزموا مكانكم { أنتم وشركاؤكم } ومعناه: وقفوا مع ما وقفوا معه في الموقف مع قطع الوصل والأسباب التي هي سبب محبتهم وعبادتهم وتبرّء المعبود من العابد لانقطاع الآلات البدنية والأغراض الطبيعية التي توجب تلك الوصل وهو معنى قوله: { فزيلنا بينهم } أي: مع كونهم في الموقف معاً فرقنا بينهم في الوجهة وذلك عند علوّ رتبة المعبود ودنوّ رتبة العابد وتباين حاليهما إذا كان المعبود شريفاً كالملائكة والمسيح وعزير وأمثالهم ممن له السابقة عند الله كما قال تعالى:\n",
      "translations": [
        {
          "translation": "\n\nOn the Day when We will gather them all together, We will ask those who worshipped others {as partners with God} among them: \"Where are your {partners} now?\" They will have no answer but to say: \"By God, we were not {worshippers of others}\". {We will then separate them} from one another, and their {partners} will say: \"It was not us that you {worshipped}\".",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر لهم يا أكمل الرسل { يَوْمَ نَحْشُرُهُمْ } أي: كلا الفريقين { جَمِيعاً } في يوم العرض والجزاء { ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُواْ } بنا غيرنا من التماثيل والأصنام: الزموا { مَكَانَكُمْ } واستقروا عليها { أَنتُمْ وَشُرَكَآؤُكُمْ } حتى تسألوا عمَّا أجرمتم { فَزَيَّلْنَا } فرَّقنا وفصلنا { بَيْنَهُمْ } أي: رفعنا رابطة العابدية والمعبودية التي بها وصلتهم وارتباطهم { وَقَالَ شُرَكَآؤُهُمْ } مخاطبين إياه مشافهةً؛ برءة لنفوسهم: { مَّا كُنتُمْ } أيها الضالون، المنهمكون في الغي والضلال { إِيَّانَا تَعْبُدُونَ } [يونس: 28] بعلمنا وأمرنا؛ إذ لسنا من ذوي العلم وأولي الأمر، بل تعبدون أنتم أهواءكم وشياطينكم الكامنة في نفوسكم قد افتريتم علينا ونسبتم بنا؛ عناداً ومكابرةً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:40",
      "similarity": 0.5870964237661739
    },
    {
      "verse": "11:118",
      "similarity": 0.579713553382504
    },
    {
      "verse": "9:110",
      "similarity": 0.5321453481708851
    },
    {
      "verse": "40:34",
      "similarity": 0.3703579012387275
    },
    {
      "verse": "34:24",
      "similarity": 0.3398921601457618
    }
  ]
}