{
  "chapter": "يونس",
  "text": "اكان للناس عجبا ان اوحينا الى رجل منهم ان انذر الناس وبشر الذين ءامنوا۟ ان لهم قدم صدق عند ربهم قال الكفرون ان هذا لسحر مبين",
  "translations": [
    {
      "translation": "Do people find it so surprising that We should reveal to a man among them: 'Warn mankind and give good news to those who have iman that they are on a sure footing with their Lord'? The kafirun say, This is downright magic!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are the people astonished that a man who is one of them was commanded by Us to warn them and to bring glad tidings to those who believe that they have a true precedence with their Lord? (Yet) the unbelievers say: \"He is a clear sorcerer.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it seem strange to people that We should have revealed to a man from among themselves, directing him to warn the people (who lie engrossed in heedlessness); and to give good news to the believers that they shall enjoy true honour and an exalted status with their Lord? (Is this so strange that) the deniers of the truth should say: 'This man is indeed an evident sorcerer'?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should it seem strange to mankind that We sent revelations to a mortal among them, who would warn others and give to the believers the glad news of their high rank in the sight of God. The unbelievers have said, \"He (Muhammad) is certainly a magician.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are people amazed that We have sent to a man among them, the divine revelation that “Warn the people and convey glad tidings to the believers that for them with their Lord is the place* of truth”? The disbelievers say, “Indeed he is an open magician.” (* Positions of honour on the Day of Resurrection or in heaven.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it a wonder for mankind that We have sent Our revelation to a man from among themselves (saying): \"Warn mankind, and give good news to those who believe that they shall have with their Lord the rewards of their good deeds\" (But) the disbelievers say: \"This is indeed an evident sorcerer!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! is it a wonder to the people that We revealed to a man from among themselves, saying: Warn the people and give good news to those who believe that theirs is a footing of firmness with their Lord. The unbelievers say: This is most surely a manifest enchanter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Was it a wonder to the people that We revealed to a man from among them: 'Warn the people, and give thou good tidings to the believers that they have a sure footing with their Lord'? The unbelievers say, 'This is a manifest sorcerer.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it a wonder for mankind that We have inspired a man among them, saying: Warn mankind and bring unto those who believe the good tidings that they have a sure footing with their Lord? The disbelievers say: Lo! this is a mere wizard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it seem strange to people that We have sent revelation to a man from among themselves, saying, \"Warn mankind and give glad tidings to the believers that they have a true rank [of honour] with their Lord?\" Those who deny the truth say, \"This man is clearly a sorcerer.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is a matter of wonderment to the mankind that we should reveal unto a man among them saying: warn thou the man kind, and bear those who have believed the glad tidings that theirs shall be a sure footing. with their Lord! The infidels say: verily this in a sorcerer manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it seem odd to these people that We have revealed to a man from among themselves, [declaring], ‘Warn mankind, and give good news to the faithful that they are in good standing with their Lord’? The faithless say, ‘This is indeed a plain magician.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it a matter of wonderment to men that We have sent Our inspiration to a man from among themselves?- that he should warn mankind (of their danger), and give the good news to the Believers that they have before their Lord the lofty rank of truth. (But) say the Unbelievers: \"This is indeed an evident sorcerer!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it wonder for mankind that We have sent Our Inspirationto a man from among themselves (i.e. Prophet Muhammad SAW) (saying): \"Warn mankind (of the coming torment in Hell), and give good news to those who believe (in the Oneness of Allah and in His Prophet Muhammad SAW) that they shall have with their Lord the rewards of their good deeds?\" (But) the disbelievers say: \"This is indeed an evident sorcerer (i.e. Prophet Muhammad SAW and the Quran)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it a wonder to the people that We revealed to a man from among themselves: 'Warn mankind, and bear the glad tidings to those who believe that they stand firm with their Lord' (Yet) the unbelievers say: 'This is a clear sorcerer'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it a wonder to the people that We inspired a man from among them: “Warn mankind, and give good news to those who believe that they are on a sound footing with their Lord”? The disbelievers said, “This is a manifest sorcerer.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have the people been amazed that We revealed [revelation] to a man from among them, [saying], \"Warn mankind and give good tidings to those who believe that they will have a [firm] precedence of honor with their Lord\"? [But] the disbelievers say, \"Indeed, this is an obvious magician.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:2] Is it for the people, the people of Mecca (this interrogative is meant as a disavowal; the preposition [li-, ‘for’] and its dependent genitive noun [al-nās, ‘the people’] constitute a circumstantial qualifier of His saying): a wonder (‘ajaban: read in the accusative as a predicate of kāna; or if read in the nominative [‘ajabun] as its subject: its predicate, which is also its subject if read according to the former [accusative] reading, is [the following, an awhaynā]) that We have inspired a man from among them, Muhammad (s), [saying] (an, ‘that’, is explicative): ‘Warn, threaten, the people, the disbelievers, with chastisement, and give good tidings to those who believe that they have a prior, a preceding, [promise of] truth with their Lord’?, that is a [preceding] fair reward, in return for the deeds they have sent forward. The disbelievers say, ‘Truly this, Qur’ān that comprises all of that [mentioned], is manifest sorcery’: a variant reading [for la-sihrun] has lasāhirun, ‘a sorcerer’, where it is the Prophet (s) to whom they are referring [as being ‘a manifest sorcerer’].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is it a wonder for mankind) for the people of Mecca (that We have inspired a man among them) a human being like them, (saying: Warn mankind) warn the people of Mecca by means of the Qur'an (and bring unto those who believe the good tidings that they have a sure footing) a good reward; it is also said that their faith in the life of this world is their sure footing with their Lord in the Hereafter; it is also said that this means: they have a true prophet; as it is said that this means: they have a true intercessor (with their Lord? The disbelievers) the disbelievers of Mecca (say: Lo! This) Qur'an (is a mere wizard) a mere lie.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحَدثنا أَبو جعفر، قالَ: حدثنا علي بن أحمد، قال: حدثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليه السلام في قولِه تعالى: { لَهُمْ قَدَمَ صِدْقٍ عِندَ رَبِّهِمْ } معناهُ سَابقةٌ\n ويقالُ: ثَوابُ صِدقٍ\n\n",
      "translations": [
        {
          "translation": "\n\nWe were told by Abu Ja'far that he said: We were told by Ali ibn Ahmad that he said: It was narrated to us by 'Ata' ibn al-Sa'ib from Abu Khalid from Zayd ibn Ali that he said regarding the words of Allah, {They have preceded [in faith] with a good precedent} [i.e. they have been true to their covenant with Allah], its meaning is that they are ahead [of others].\n The reward of a truth is truth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أنكر عجبهم لكون سنّة الله جارية أبداً على هذا الأسلوب في الإيحاء على الرجال وإنما كان تعجبهم لبعدهم عن مقامه وعدم مناسبة حالهم لحاله ومنافاة ما جاء به لما اعتقدوه { أنّ لهم قدم صِدْق عنْدَ ربّهم } أي: سابقة بحسب العناية الأولى عظيمة أو مقاماً من قربه ليس لأحد مثله خصصهم الله به في الأزل بمحض الاجتباء وإلا لما آمنوا به { قال الكافرون } الذين حجبوا عن الله فلم يطلعوا على ظهور صفاته في النفس المحمدية { إنّ هذا } الذي جاء به { لسحرٌ مبين } أي: شيء خارج عن قدرة البشر ليس إلا من عمل الشياطين\n قالوا ذلك لغلبة الشيطنة عليهم واحتجابهم بها عن الله وعبادتهم الشيطان بحيث لم يصلوا إلى طور من الروحانيات وراءه في القدرة\n فلذلك نسبوا ما تجاوز عن حدّ البشرية إليه بالطبع",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَكَانَ لِلنَّاسِ } الناسين بطلان هوياتهم { عَجَباً أَنْ أَوْحَيْنَآ } ألهمنا من محض فضلنا وجودنا { إِلَىٰ رَجُلٍ } ناشئ { مِّنْهُمْ } وظهر من جنسهم وبني نوعهم { أَنْ أَنذِرِ ٱلنَّاسَ } المنهمكين في الغي والضلال بمقتضى أهوية هوياتكم الباطلة\n وماهياتهم العاطلة\n تعجباً ناشئاً عن محض الغفلة والنسيان\n والإعراض عن الحق\n والانحراف عن طريق التوحيد وجادة الإسلام { وَبَشِّرِ } منهم أهل المحبة والولاء\n يعني: { ٱلَّذِينَ آمَنُوۤاْ } وأيقنوا برسالتك وإرشادك بوحدة ذات الحق واستقلاله في الوجود\n وما يترفع عليه من الأسماء والصفات\n والآثار المترتبة عليها\n والشئون المتجددة بها { أَنَّ لَهُمْ } أي: بأن لهم { قَدَمَ صِدْقٍ } أي: إقدام صادق\n وقدم راسخ ثابت في جادة التوحيد\n وإرادة خالصة\n\n\nوصاروا { عِندَ رَبِّهِمْ } من السابقين المقربين الذين لا خوف عليهم ولا هم يحزنون\n ثم لمَّا ظهر أمر الرسالة وعلا قدره\n وشاع دينه وكثر أتباعه { قَالَ ٱلْكَافِرُونَ } المصرون على الشرك والفساد من خبث طينتهم\n وشدة بغضهم وشكيمتهم بعدما أبصروا منه خوارق عجزوا عنها\n سيما القرآن الكامل في الإعجاز البالغ أعلى مراتب البلاغة: { إِنَّ هَـٰذَا } المدعي للنبوة والرسالة { لَسَاحِرٌ مُّبِينٌ } [يونس: 2] ظاهر متفرد في فن السحر\n وحيد في عصره فيه\n ومن قرأ السحر أراد به القرآن المعجز لجمهور البلغاء مع توفر دواعيهم في معارضته\n وصاروا من عجزهم بحيث لم يقدروا على إتيان أقصر آية منه\n\n\nوكيف يعارضون مع رسوله والكتاب المنزل من عنده سبحانه؟! { إِنَّ رَبَّكُمُ } أيها المؤمنون { ٱللَّهُ ٱلَّذِي خَلَقَ } أي: قدر ببسط عكوس أسمائه\n ومد أظلال أوصافه { ٱلسَّمَاوَاتِ } أي: العلويات التي هي الأعيان الثابتات { وَٱلأَرْضَ } أي: عالم الطبيعة القابلة للانعكاس منها { فِي سِتَّةِ أَيَّامٍ } أي: ستة جهات\n إذ يتوهم الامتداد والأبعاد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أَكَانَ للناس } أي: كفار قريش وغيرهم { عَجَباً أن أوحينا إلى رجل منهم } ولم يكن من عظمائهم؟ والاستفهام للإنكار\n والرد على من استبعد النبوة\n أو تعجب من أن يبعث الله رجلاً من وسط الناس\n قيل: كانوا يقولون: العجب أن الله تعالى لم يجد رسولاً يرسله إلى الناس إلا يتيم أبي طالب\n وهذا من فرط حماقتهم\n وقصور نظرهم على الأمور العاجلة\n وجهلهم بحقيقة الوحي والنبوة\n هذا\n\n وأنه ـ عليه الصلاة والسلام ـ لم يكن يقْصر عن عظمائهم فيما يعتبرونه\n إلا في المال\n وخفةُ الحال أعون شيء في هذا الباب\n ولذلك كان أكثر الأنبياء قبله كذلك ـ أي خفافاً من المال ـ وقيل: تعجبوا من أنه بشراً رسولاً\n كما سبق في سورة الأنعام\n قاله البيضاوي\n  ثم فسَّر الوحي المذكور فقال: { أن أنذر الناس } أي: أوحينا إليه بأن أنذر الناس أي: خوفهم من غضب ربهم\n { وبشّر الذين آمنوا } \n عمم الإنذار\n ليس من أحد إلا وفيه ما ينبغي أن ينذر منه\n وخصص البشارة إذ ليس للكفار ما يصح أن يبشروا به\n قاله البيضاوي\n  أي: بشر المؤمنون بأنَّ { لهم قَدَمَ صدْقٍ عند ربهم } أي: سابقة ومنزلة رفيعة\n سميت قدَماً لأن السبق يكون بها\n كما سميت النعمة يداً لأنها تُعْطى باليد\n وأضيفت إلى الصدق لتحققها وللتنبيه على أنهم إنما ينالونها بصدق القول والنية\n قال ابن جزي: أي: عمل صالح قدموه\n وقال ابن عباس: السعادة السابقة لهم في اللوح المحفوظ\n هـ\n وقال ابن عطية: والصدق في هذه الآية بمعنى الصلاح\n كما تقول: رجل صدقٍ ورجل سوْءٍ\n\nهـ\n  { قال الكافرون إنَّ هذا } الكتاب\n أو ما جاء به الرسول\n { لسحر مبين } أي: بيَّن ظاهر\n وقرأ ابن كثير والكوفيون: { لساحر } \n على أن الإشارة إلى الرسول\n وفيه اعتراف بأنهم صادفوا من الرسول أموراً خارقة للعادة\n معجزة لهم عن المعارضة\n وكلامهم هذا يحتمل أن يكون تفسيراً لما ذكره قبلُ من تعجبهم\n أويكون مستأنفاً\n الإشارة: تعجبُ الناس من أهل الخصوصية سُنة ماضية\n فكما خفي عن أعين الكفار سر النبوة\n خفي عن أعين الخفافيش سر الخصوصية\n فلا يطلع عليها إلا من سبق له قدم صدق عند ربه\n فسبحان من ستر سر الخصوصية بظهور وصف البشرية فلم يدل عليها إلا من أراد أن يوصله إلى مشاهدة عظمة الربوبية\n قال في لطائف المنن: فأولياء الله أهل كهف الإيواء\n فقليل من يعرفهم\n وسمعت الشيخ أبا العباس رضي الله عنه يقول: معرفة الولي أصعب من معرفة الله\n فإنَّ الله تعالى معروف بكماله وجماله\n ومتى تعرف مخلوقاً مثلك يأكل كما تأكل\n ويشرب كما تشرب؟\n وإذا أراد الله أن يعرفك بولي من أوليائه طوى عنك وجود بشريته\n وأشهدك وجود خصوصيته\n هـ\n ثم فسّر عظمة ربوبيته\n فقال: { إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَاوَاتِ وَٱلأَرْضَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:4",
      "similarity": 0.6197134061338172
    },
    {
      "verse": "7:63",
      "similarity": 0.5560044151630849
    },
    {
      "verse": "50:2",
      "similarity": 0.49948324495047414
    },
    {
      "verse": "38:5",
      "similarity": 0.4193239112279776
    },
    {
      "verse": "53:59",
      "similarity": 0.403081296449838
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}