{
  "chapter": "يونس",
  "text": "للذين احسنوا۟ الحسنى وزيادة ولا يرهق وجوههم قتر ولا ذلة او۟لئك اصحب الجنة هم فيها خلدون",
  "translations": [
    {
      "translation": "Those who do good will have the best and more! Neither dust nor debasement will darken their faces. They are the Companions of the Garden, remaining in it timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who do good there is goodness and more, and no blot or disgrace will cover their faces. They are people of Paradise, where they will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who do good there is good reward and more besides; neither gloom nor humiliation shall cover their faces. They are the people of the Garden and in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteous will receive good reward for their deeds and more. Their faces will suffer no disgrace or ignominy. They will be the dwellers of Paradise wherein they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the people of virtue, is goodness and more than that; and neither will the blackness nor disgrace come upon their faces; it is they who are the people of Paradise; they will abide in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who have done good is the best, and even more. Neither darkness nor dust nor any humiliating disgrace shall cover their faces. They are the dwellers of Paradise, they will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who do good is good (reward) and more (than this); and blackness or ignominy shall not cover their faces; these are the dwellers of the garden; in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the good-doers the reward most fair and a surplus; neither dust nor abasement shall overspread their faces. Those are the inhabitants of Paradise, therein dwelling forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who do good is the best (reward) and more (thereto). Neither dust nor ignominy cometh near their faces. Such are rightful owners of the Garden; they will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do good works shall have a good reward and more besides. No darkness and no ignominy shall cover their faces. They are destined for Paradise wherein they shall dwell forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto those who have done good is the good (reward) and an increase: neither darkness nor abjection will cover their faces. These are the fellows of the Garden: therein they will be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are virtuous shall receive the best reward and an enhancement. Neither dust nor abasement shall overcast their faces. They shall be the inhabitants of paradise, and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who do right is a goodly (reward)- Yea, more (than in measure)! No darkness nor shame shall cover their faces! they are companions of the garden; they will abide therein (for aye)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who have done good is the best (reward, i.e. Paradise) and even more (i.e. having the honour of glancing at the Countenance of Allah) Neither darkness nor dust nor any humiliating disgrace shall cover their faces. They are the dwellers of Paradise, they will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for those who do good is a fine reward and a surplus. Neither dust nor shame shall cover their faces. Those are the companions of Paradise in it they shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who have done good is goodness, and more. Neither gloom nor shame will come over their faces. These are the inhabitants of Paradise, abiding therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them who have done good is the best [reward] and extra. No darkness will cover their faces, nor humiliation. Those are companions of Paradise; they will abide therein eternally\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:26] For those who do good, by having faith, is the fairest reward, Paradise, and more, which is to contemplate God, exalted be He, as [reported] in a hadīth by Muslim [in his Sahīh]; neither dust, soot, nor ignominy, grief, shall overcome, envelop, their faces. Those, they are the inhabitants of Paradise: therein they will abide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For those who do good) for those who profess Allah's divine Oneness (is the best (reward)) i.e. Paradise (and more (thereto)) i.e. beholding Allah's Countenance; it is also said that 'more' means: greater reward. (Neither dust) darkness and gloominess (nor ignominy) grief (comes near their faces) are seen on their 215 faces. (Such are rightful owners of the Garden) the folk of Paradise; (they will abide therein).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِّلَّذِينَ أَحْسَنُواْ ٱلْحُسْنَىٰ وَزِيَادَةٌ } فالحُسنى: الجَنةُ والزِّيادةُ: غُرفةٌ من لُؤلؤةٍ لَهَا أَربعةُ أَبوابٍ\n ويقالُ الزِّيادةُ: الحَسنةُ بعشرِ أَمثالِهَا\n ويقال الزِّيادةُ: مَغفرةٌ ورِضوانٌ\n ويقالُ الزِّيادةُ: نِعمُ الله تَعالى التي أَنعمَ عَليهِم\n\n\n\n\nوقوله تعالى: { وَلاَ يَرْهَقُ وُجُوهَهُمْ قَتَرٌ } معناهُ لاَ يَغْشَاهَا\n والقَترُ: الغُبَارُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {For those who have done good is the best [reward] and an increase [in goodness].} So the best thing is Paradise and the increase is a room of pearls, having four doors.\n\n\nThis is called \"the increase\": the good deed is multiplied by ten.\n\n\nAnd it is said that increase: forgiveness and pleasure\n\n\nThe increase is said to be: Yes, Allah be praised, who has bestowed such bounties upon them.\n\n\nAnd His saying - {And let not their faces be covered with dust} - means that He will not let them be covered in darkness.\n\n\nThe Qatari: The dust",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك قال سبحانه: { لِّلَّذِينَ أَحْسَنُواْ } في هذه النشأة مع الله ورسله، وامتثلوا جميع ما جاء من عنده في كتبه؛ تعبيراً وانقياداً، إيماناً واحتساباً { ٱلْحُسْنَىٰ } أي: المثوبة العظمة الدرجة العلا، بدل إحسانهم في الدنيا؛ عدلاً من الله { وَزِيَادَةٌ } عليها، وهي رضوان الله منهم غايةً وتفضلاً { وَ } صاروا من صغاء عقائدهم وإحسانهم مع الله { لاَ يَرْهَقُ } ويلحق { وُجُوهَهُمْ قَتَرٌ } غيار الغفلة والندامة { وَلاَ ذِلَّةٌ } صغار وهوان من التواني والتكاسل في احتمال التكاليف الإلهية { أُوْلَـٰئِكَ } السعداء، المقبولون عند الله { أَصْحَابُ ٱلْجَنَّةِ } المعدة لأرباب الفضل والعنابة { هُمْ فِيهَا خَالِدُونَ } [يونس: 26] جزاءً بما كانوا يعملون من الخيرات والمبرات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { للذين أحسنوا } فيما بينهم وبين ربهم بتوحيده وعبادته، وفيما بينهم وبين عباده بكف أذاهم وحمل جفاهم، لهم { الحسنى } أي: المثوبة الحسنى، وهي الجنة وزيادة، وهي النظر إلى وجهه الكريم، أو الحسنى: ما يثيب به على العمل، والزيادة: ما يزيد على ما يستحق العبد تفضلاً كقوله\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "80:41",
      "similarity": 0.842339505830896
    },
    {
      "verse": "25:67",
      "similarity": 0.5917197130454211
    },
    {
      "verse": "17:100",
      "similarity": 0.5082100358584798
    },
    {
      "verse": "2:236",
      "similarity": 0.4635168566707029
    },
    {
      "verse": "70:44",
      "similarity": 0.4568950781189358
    }
  ]
}