{
  "chapter": "يونس",
  "text": "واذا اذقنا الناس رحمة منۢ بعد ضراء مستهم اذا لهم مكر فى ءاياتنا قل الله اسرع مكرا ان رسلنا يكتبون ما تمكرون",
  "translations": [
    {
      "translation": "When We let people taste mercy after hardship has afflicted them, immediately they plot against Our Signs. Say: 'Allah is swifter at plotting.' Your plotting is recorded by Our messengers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We let them taste Our mercy after affliction, they contrive against Our signs. Say: \"God is swifter at contriving,\" for Our angels record everything you plan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No sooner than We bestow mercy on a people after hardship has hit them than they begin to scheme against Our signs. Tell them: 'Allah is swifter in scheming. Our angels are recording all your intriguing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When people are granted mercy after having suffered hardship, they begin to plot against Our revelations. Say, \"God is the most swift in His plans.\" Our angelic messengers record all that you plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We give mankind the taste of mercy after some hardship which had afflicted them, they immediately start conspiring against Our signs; proclaim, “The secret plan of Allah is the fastest”; indeed Our angels record your scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We let mankind taste mercy after some adversity has afflicted them, behold! They take to plotting against Our Ayat! Say: \"Allah is more swift in planning!\" Certainly, Our messengers (angels) record all of that which you plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We make people taste of mercy after an affliction touches them, lo! they devise plans against Our communication. Say: Allah is quicker to plan; surely Our apostles write down what you plan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We let the people taste mercy after hardship has visited them, lo, they have a device concerning Our signs. Say: 'God is swifter at devising; surely Our messengers are writing down what you are devising.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We cause mankind to taste of mercy after some adversity which had afflicted them, behold! they have some plot against Our revelations. Say: Allah is more swift in plotting. Lo! Our messengers write down that which ye plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever We let mankind taste mercy after some adversity has afflicted them, they forthwith turn to devising false arguments against Our signs. Say, \"God is swifter in His devising! Our angels are recording your intrigues.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We let mankind taste of mercy after an adversity hath touched them, forthwith they have a plot with regard to his signs. Say thou: Allah is swifter in plotting. Verily Our mesengers write down that which ye plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We let people taste [Our] mercy after a distress that has befallen them, behold, they scheme against Our signs! Say, ‘Allah is more swift at devising.’ Indeed Our messengers write down what you scheme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We make mankind taste of some mercy after adversity hath touched them, behold! they take to plotting against Our Signs! Say: \"Swifter to plan is Allah!\" Verily, Our messengers record all the plots that ye make!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We let mankind taste of mercy after some adversity has afflicted them, behold! They take to plotting against Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.)! Say: \"Allah is more Swift in planning!\" Certainly, Our Messengers (angels) record all of that which you plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We let people taste (Our) mercy after they had been afflicted by hardship, they devise against Our verses. Say: 'Allah is more swift in devising' Indeed, Our Messengers (the angels) are writing down whatever you devise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We make the people taste mercy after some adversity has touched them, they begin to scheme against Our revelations. Say, “God is swifter in scheming.” Our envoys are writing down what you scheme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We give the people a taste of mercy after adversity has touched them, at once they conspire against Our verses. Say, \"Allah is swifter in strategy.\" Indeed, Our messengers record that which you conspire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:21] And when We made people, that is, the disbelievers of Mecca, taste of mercy, [of] rain and fertility, after adversity, misery and drought, that had afflicted them, behold! they have some plot concerning Our signs, in the way of mockery and denial. Say, to them: ‘God is swifter at plotting, at requiting; surely Our, guardian, messengers are writing down that which you are plotting’ (tamkurūn, is also read yamkurūn, ‘they are plotting’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We cause mankind) when We enable the idolaters (to taste of mercy) blessings (after some adversity) hardship (which had afflicted them, behold! they have some plot against) they give the lie to (Our revelations) Muhammad (pbuh) and the Qur'an. (Say: Allah is more swift in plotting) Allah's punishment is more severe. Allah destroyed them on the Day of Badr. (Lo! Our messengers) who record the deeds of mankind (write down that which you plot) the lies you utter and the transgressions you commit.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذا أذقنا الناس رحمة من بعد ضراء } قد مرّ أن أنواع البلاء من الضراء والبأساء وصنوف اللأواء تكسر شرّة النفس، وتلطف القلب بكشف حجب صفات النفس وترقيق كثافات الطبع ورفع غشاوات الهوى، فلذا تنزع قلوبهم بالطبع إلى مبدئها في تلك الحالة لرجوعها إلى مقتضى فطرتها حينئذ وعودها إلى نوريتها الأصلية وقوتها الفطرية وميلها إلى العروج الذي هو في سنخها لزوال المانع بل الميل إلى الجهة العلوية والمبادئ النورية مفطور في طباع القوى الملكوتية كلها\n حتى النفس الحيوانية لو تزكت عن الهيئات البدنية الظلمانية فإن التسفل من العوارض الجسمانية حتى أن البهائم والوحوش إذا اشتدت الحال عليها في أوقات المحل وأيام الجدب اجتمعت رافعة رؤوسها إلى السماء كأن ملكوتها يشعر بنزول الفيض من الجهة العلوية فتستمدّ منها فكذا إذا توافرت على الناس النِعَم الظاهرة وتكاملت عليهم الأمداد الطبيعية والمرادات الجسمانية قويت النفس من مدد الجهة السفلية واستطالت قواها بالترفع على القلب وتكاثف الحجاب وغلظ وتسلط الهوى وغلب، وصارت السلطنة للطبيعة الجسمانية، وارتكمت الهيئات البدنية الظلمانية فتشكل القلب بهيئة النفس وقسا وغلظ وطغى، وأبطرته النعمة فكفر وعمى ومال إلى الجهة السفلية لبعده عن الهيئة النورية حينئذ\n وبقدر استيلاء النفس على القلب يستولي الوهم على العقل، فتستولي الشيطنة لكون القوة العاقلة أسيرة في قيد الوهم مأمورة له يستعملها في مطالبه ويستسعيها في مآربه من تحصيل لذات النفس وإمدادها من عالم الرجس وتقوية صفاتها بأهب عالم الطبع وعدد مواد الحظ بالفكر، فيحتجب القلب بالرين عن قبول صفات الحق بالكلية، وذلك معنى قوله: { إذا لهم مكر في آياتنا قل الله أسرع مكراً } بإخفاء القهر الحقيقي في هذا اللطف الصوري وتعبية عذاب نيران الحرمان وحيات هيئات الرذائل والعقارب السود ولباس القطران في هذه الرحمة الظاهرة\n  { إن رُسُلنا يَكْتبون ما تمكرون } قد علمت أن الملكوت السماوية تنتقش بكل حادثة تقع في هذا العالم فكل عمل حسن أو قبيح يصدر عن أحد فقد كتب عليه في تلك الألواح وقد اتصل ملكوت كل بدن بتلك المبادئ الملكوتية فمتى هممنا بحسنة أو سيئة ارتسمت صورته في ملكوت أبداننا على سبيل الخاطر أولاً ثم أخذنا في الفكر فيه، فإن استحكم النقش وانبعثت منه العزيمة حتى امتثلنا الخاطر الأول بالإرادة الجازمة انطبع بإقدامنا على الفعل إلا أنه إن كان حسنة انطبع في الحال في جهة القلب التي تلي الروح ولوح الفؤاد المنوّر بنوره وكتبته القوة العاقلة العملية التي هي صاحب اليمين من الملكين الموكلين المشار إليهما بقوله تعالى:\n\n[ق، الآية: 17] إذ الفؤاد هو الجانب الأقوى منه وإن كان سيئة لا ينطبع في الحال لبعد الهيئة الظلمانية من القلب وعدم مناسبته إياها بالذات، فإن أدركه التوفيق وتلألأ عليه نور من أنوار الهداية الروحانية ندم واستغفر فمحى عنه، وعفى له، وإن لم يتداركه بقي متلجلجاً حتى أمدّته النفس بظلمة صفاتها فاستقرّ في لوح الصدر الذي هو وجه القلب الذي يلي النفس المظلم بظلمة النفس الغالبة عليه في صدور هذا الفعل منه وكتبته القوة المتخيلة التي هي صاحب الشمال إذ هذا الجانب هو الأضعف وهذا هو المراد من قولهم: صاحب الشمال لا يكتب السيئة حتى تمضي ست ساعات فإن استغفر فيها صاحبها لم تكتب، وإن أصرّ كتبته\n\n\nويفهم من هذا التقرير إيتاء الكتاب بيمين المسلم وشمال الكافر، وأما صورة الإيتاء وكيفيته فقد تجيء في موضعها إن شاء الله تعالى\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على سبيل التوبيخ والتقريع للمسرفين: { وَإِذَآ أَذَقْنَا ٱلنَّاسَ رَحْمَةً } خلاصاً ونجاةً { مِّن بَعْدِ ضَرَّآءَ مَسَّتْهُمْ } واضطرتهم إلى الرجوع والتوجه نحونا { إِذَا لَهُمْ مَّكْرٌ } أي: ما جاءوا بعد نزول الرحمة إلى المكر والخديعة مع نبينا، والطعن { فِيۤ آيَاتِنَا قُلِ } لهم يا أكمل الرسل نيابةً عنا: { ٱللَّهُ } المطلع لضمائركم ومخايلكم { أَسْرَعُ مَكْراً } وأشد تدبيراً وانتقاماً على مكركم وخداعكم، أعد لكم عذاب مكركم، وأشهد عليكم الملائكة، كما قال: { إِنَّ رُسُلَنَا } الموكلون عليكم، المراقبون لأحوالكم { يَكْتُبُونَ } في صحائف أعمالكم { مَا تَمْكُرُونَ } [يونس: 21] وتحيلون مع الله ورسوله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جاءتها \" إذا \" وجملة دعوا: بدل من \" ظنوا \" بدل اشتمال لأن دعاءهم من لوازم الظن\n يقول الحق جل جلاله: { وإذا أذقنا الناسَ رحمةً } ، كصحة وعافية وخصب، { من بعد ضراءَ مَستْهم } ، كمرض أو قحط { إذا لهم مكرٌ في آياتنا } بالطعن فيها، والاحتيال في دفعها، فقد قحط أهل مكة حتى أكلوا الجلود والميتة، ثم رحمهم بالغيث، فطعنوا في آياته بالتكذيب، وكادوا رسوله ـ عليه الصلاة والسلام - { قل اللهُ أسرعُ مكراً } منكم، فقد دبر عقابكم قبل أن تدبروا كيدكم، ووصف مكر الله بالسرعة وإن كان الاستدراج يمهلهم لأنه متيقن واقع لا محالة، وكل آت قريب\n { إنَّ رسلنا } الحفظة { يكتبون ما تمكرون } فنجازيكم عليه\n قال البيضاوي: هو تحقيق للانتقام، وتنبيه على أن ما يدبرون في إخفائه لم يَخفْ على الحفظة فضلاً أن يخفى على الله\n وعن يعقوب: \" يمكرون \" بالياء ليوافق ما قبله\n هـ\n قال ابن جزي: هذه الآية للكفار، وتتضمن النهي لمن كان كذلك عن غيرهم، والمكر هنا: الطعن في آيات الله وترك شكره، ومكر الله الموصوف بالسرعة هو عقابه لهم، سماه مكراً مشاكلة لفعلهم، وتسمية للعقوبة باسم الذنب\n هـ\n  فنزول الرحمة بعد الشدة آية تدل على كمال قدرته\n وقد وَرَدَ أنه لما نزل بهم القحط التجأوا إليه صلى الله عليه وسلم وقالوا: يا محمد إنك جئت تأمر بمكارم الأخلاق، وإن قومك قد هلكوا، فادع الله يغيثنا، فدعا، فنزل عليهم الغيث، فكانت معجزة له ـ عليه الصلاة والسلام ـ",
      "translations": []
    }
  ]
}