{
  "chapter": "يونس",
  "text": "ويقولون لولا انزل عليه ءاية من ربه فقل انما الغيب لله فانتظروا۟ انى معكم من المنتظرين",
  "translations": [
    {
      "translation": "They say. 'Why has a Sign not been sent down to him from his Lord?' Say: 'The Unseen belongs to Allah alone. So wait, I am waiting with you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"How is it that no sign was sent by his Lord (to His Prophet)?\" Tell them: \"Unknown things are only known to God. So watch and wait (for the sign); I am waiting and expecting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Why was a sign not sent down upon the prophet from His Lord? Tell (such people): 'The realm of the Unseen belongs to Allah. Wait, then; I shall wait along with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (unbelievers) say, \"Why has his Lord not given him some miracles to (support his claim of being His Messenger)?\" Say \"(The knowledge) of the unseen certainly belongs to God. Wait and I too shall be waiting with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Why is not a sign sent down upon him from his Lord?” Proclaim, (O dear Prophet Mohammed – peace and blessings be upon him), “The hidden is only for Allah, therefore wait; I too am waiting with you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"How is it that not a sign is sent down on him from his Lord\" Say: \"The Unseen belongs only to Allah, so wait you, verily, I am with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Why is not a sign sent to him from his Lord? Say: The unseen is only for Allah; therefore wait-- surely I too, with you am of those who wait.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'Why has a sign not been sent down upon him from his Lord?' Say: 'The Unseen belongs only to God. Then watch and wait; I shall be with you watching and waiting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will say: If only a portent were sent down upon him from his Lord! Then say, (O Muhammad): The Unseen belongeth to Allah. So wait! Lo! I am waiting with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask, \"Why has no sign been sent down to him from his Lord?\" Tell them, \"God alone has knowledge of the unseen. So wait; I too will wait with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: wherefore is not a sign sent down unto him from his Lord! Say thou: the Hidden belongeth unto Allah alone; so wait, verily I am with you among those who wait.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘Why has not some sign been sent down to him from his Lord?’ Say, ‘[The knowledge of] the Unseen belongs only to Allah. So wait. I too am waiting along with you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Why is not a sign sent down to him from his Lord?\" Say: \"The Unseen is only for Allah (to know), then wait ye: I too will wait with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"How is it that not a sign is sent down on him from his Lord?\" Say: \"The unseen belongs to Allah Alone, so wait you, verily I am with you among those who wait (for Allah's Judgement).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Why has no sign been sent down to him from his Lord' Say: 'The Unseen belongs to Allah alone. Wait if you will I am one of those who wait'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “If only a miracle was sent down to him from his Lord.” Say, “The realm of the unseen belongs to God; so wait, I am waiting with you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Why is a sign not sent down to him from his Lord?\" So say, \"The unseen is only for Allah [to administer], so wait; indeed, I am with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:20] And they, the people of Mecca, say, ‘Why has a sign not been sent down on him, on Muhammad (s), from his Lord?’, as was the case with [previous] prophets, in the way of a she-camel, a staff or a [glowing] hand. Then say, to them: ‘The Unseen, that which is concealed from servants, in other words, its affair, belongs only to God, and it is from this [Unseen] that signs come forth; therefore He alone can bring them forth: mine is only to covey the Message. So wait, for the chastisement, if you do not believe. I am waiting with you’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "214 (And they will say) i.e. the disbelievers of Mecca: (If only a portent) a sign (were sent down upon him) i.e. to Muhammad (pbuh) (from his Lord!) to vouchsafe his claim. (Then say) Muhammad: (The Unseen) regarding the sending of such a sign (belongeth to Allah. So wait) for my destruction! (Lo, I am waiting with you) for your destruction.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لا يخرج عن حيطة قدرته شيء { فَقُلْ } في جوابهمه: بلى\n إن الله قادر على جميع المقدورات\n ومن جملة مقترحاتكم\n إلا أن في عدم إنزالها وإنجائها حكمة غيبية ومصلحة خفية\n لا يعلمها إلا هو { إِنَّمَا ٱلْغَيْبُ } كله { للَّهِ } وفي حيطة حضرة علمه { فَٱنْتَظِرُوۤاْ } بتعليق إرادته بمقترحاتكم { إِنِّي مَعَكُمْ } أيضاً بلا تفاوت بيني وبينكم في عدم الاطلاع على غيبه { مِّنَ ٱلْمُنتَظِرِينَ } [يونس: 20]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:50",
      "similarity": 0.4983821168830876
    },
    {
      "verse": "13:7",
      "similarity": 0.47394417268341915
    },
    {
      "verse": "6:8",
      "similarity": 0.4686057468826497
    },
    {
      "verse": "82:16",
      "similarity": 0.455387928097064
    },
    {
      "verse": "6:37",
      "similarity": 0.4428110162109477
    }
  ]
}