{
  "chapter": "يونس",
  "text": "قل من يرزقكم من السماء والارض امن يملك السمع والابصر ومن يخرج الحى من الميت ويخرج الميت من الحى ومن يدبر الامر فسيقولون الله فقل افلا تتقون",
  "translations": [
    {
      "translation": "Say: 'Who provides for you out of heaven and earth? Who controls hearing and sight? Who brings forth the living from the dead and the dead from the living? Who directs the whole affair?' They will say, 'Allah.' Say, 'So will you not have taqwa?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: \"Who gives you food and sustenance from the skies and the earth? Or, who is the lord of ear and eye? And who brings forth the living from the dead, the dead from the living? And who directs all affairs?\" They will say: \"God.\" So tell them: \"Why do you not fear Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: 'Who provides you with sustenance out of the heavens and the earth? Who holds mastery over your hearing and sight? Who brings forth the living from the dead and the dead from the living? Who governs all affairs of the universe?' They will surely say: 'Allah.' Tell them: 'Will you, then, not shun (going against reality)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Who gives you sustenance from the heavens and earth, who truly possesses (your) hearing and seeing abilities, who brings the living out of the dead and the dead out of the living and who regulates (the whole Universe)? They will reply, \"God.\" Ask them, \"Why, then, do you not have fear of Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, (O dear Prophet Mohammed – peace and blessings be upon him), “Who provides you sustenance from the sky and the earth? Or Who is the Owner of the ears and the eyes? And Who brings forth the living from the dead and Who brings forth the dead from the living? And Who plans all matters?” So they will now say, “Allah”; therefore say, “Then why do you not fear?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who provides for you from the sky and the earth Or who owns hearing and sight And who brings out the living from the dead and brings out the dead from the living And who disposes of the affairs\" They will say: \"Allah.\" Say: \"Will you not then be afraid (of Allah's punishment)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who gives you sustenance from the heaven and the earth? Or Who controls the hearing and the sight? And Who brings forth the living from the dead, and brings forth the dead from the living? And Who regulates the affairs? Then they will say: Allah. Say then: Will you not then guard (against evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who provides you out of heaven and earth, or who possesses hearing and sight, and who brings forth the living from the dead and brings forth the dead from the living, and who directs the affair?' They will surely say, 'God.' Then say: 'Will you not be godfearing?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them, O Muhammad): Who provideth for you from the sky and the earth, or Who owneth hearing and sight; and Who bringeth forth the living from the dead and bringeth forth the dead from the living; and Who directeth the course? They will say: Allah. Then say: Will ye not then keep your duty (unto Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who provides [sustenance] for you from heaven and earth? Who is it who controls the ears and the eyes? Who brings forth the living from the dead, and the dead from the living? And who governs all affairs?\" They will say, \"God\". Then say, \"Will you not then fear Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: who provideth for you from the heaven and the earth, or who owneth the hearing and the sight, and who bringeth forth the living from the lifeless and bringeth forth the lifeless from the living, and who disposeth the affair! They will then surely say: Allah. Say thou: will ye not then fear Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Who provides for you out of the sky and the earth? Who controls [your] hearing and sight, and who brings forth the living from the dead and brings forth the dead from the living, and who directs the command?’ They will say, ‘Allah.’ Say, ‘Will you not then be wary [of Him]?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is it that sustains you (in life) from the sky and from the earth? or who is it that has power over hearing and sight? And who is it that brings out the living from the dead and the dead from the living? and who is it that rules and regulates all affairs?\" They will soon say, \"Allah\". Say, \"will ye not then show piety (to Him)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O MuhammadSAW): \"Who provides for you from the sky and from the earth? Or who owns hearing and sight? And who brings out the living from the dead and brings out the dead from the living? And who disposes the affairs?\" They will say: \"Allah.\" Say: \"Will you not then be afraid of Allah's Punishment (for setting up rivals in worship with Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who provides for you from heaven and earth, or who owns the hearing and the sight? Who brings forth the living from the dead, and the dead from the living' Who directs the affair? Surely, they will say: 'Allah' Then say: 'Then, will you not be fearful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who provides for you from the heaven and the earth? And who controls the hearing and the sight? And who produces the living from the dead, and produces the dead from the living? And who governs the Order?” They will say, “God.” Say, “Will you not be careful?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who provides for you from the heaven and the earth? Or who controls hearing and sight and who brings the living out of the dead and brings the dead out of the living and who arranges [every] matter?\" They will say, \"Allah,\" so say, \"Then will you not fear Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:31] Say, to them: ‘Who provides for you, rain, out of the heaven, and, plants [out of], the earth, or Who owns hearing, meaning the ability to make hear, that is, the creation of this [faculty], and sight, and Who brings forth the living from the dead and brings forth the dead from the living, and Who directs affairs?’, between creatures? They will surely say, ‘It is He, God.’ Then say, to them: ‘Will you not then fear?’, Him, and believe?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to the disbelievers of Mecca, O Muhammad: (Who provideth for you from the sky) through rain (and the earth) by means of vegetation and fruit, (or Who owneth hearing and sight) He says: who is able to create hearing and sight; (and Who bringeth forth the living from the dead) who is able to bring forth the living from the dead, i.e. living creatures and beasts from sperm drops; it is also said that this means: who can bring a bird from an egg or a spike from a grain (and bringeth forth the dead from the living) sperm drops from living creatures and beasts; it is also said that this means: an egg from a bird or a grain from a spike; (and Who directeth the course) and who can direct and look into the affairs of His servants and sends the angels with revelation, Scriptures and misfortunes? (They will say: Allah. Then say) O Muhammad: (Will ye not then keep your duty (unto Him)) will you not then obey Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمن أنكر توحيد الحق، واستقلاله في الآثار والتدبيرات الواقعة في الأقطار إلزاماً لهم وتبكيتاً: { مَن يَرْزُقُكُم مِّنَ ٱلسَّمَآءِ } بإمطار الأمطار، وتصعيد البخار { وَٱلأَرْضِ } بالإنبات والإخراج { أَمَّن يَمْلِكُ } ويستطيع أن يخلق { ٱلسَّمْعَ وٱلأَبْصَارَ } اللتين هما من أعظم أسباب حفظكم وحضانتكم { وَمَن يُخْرِجُ ٱلْحَيَّ } الحيوان السوي { مِنَ ٱلْمَيِّتِ } أي: النطفة { وَيُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَيِّ } أي: النطفة الجامدة من الحيوان { وَ } بالجملة: { مَن يُدَبِّرُ ٱلأَمْرَ } في عالم الأسباب والمسببات { فَسَيَقُولُونَ } اضطراراً لغاية ظهوره ووضوحه، لا يمكنهم أن يكابروا: { ٱللَّهُ } المدبر لجميع الأمور الكائنة في الآفاق والأنفس؛ إذ من غاية ظهوره لا يعاندون، ولا يكابرون { فَقُلْ } لهم بعدما اعترفوا بالله المدبر لجميع الكوائن والفواسد؛ توبيخاً وتقريعاً: { أَفَلاَ تَتَّقُونَ } [يونس: 31] وتحذرون من بطشه وانتقامه، تشركون له ما لايسمع ولا يضر، ولا يغني من الحق شيئاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلاله: { قل } لهم: { من يرزقُكُم من السماء } بإنزال الأمطار، وإنبات الحبوب، فإن الأرزاق تحْصل بأسباب سماوية ومواد أرضية، أو من كل واحد منهما توسعة عليكم، أو من السماء لأهل التوكل، { و } من { الأرض } لأهل الأسباب\n وقل لهم أيضاً: { أمَّن يملك السمعَ والأبصارَ } أي: من يستطيع خلقهما وتسويتهما، أو من يحفظهما من الآفات مع كثرتهما، وسرعة انفعالهما من أدنى شيء، أو مَن أمرهُما بيده، إن شاء ذهب بهما؟ وقل لهم أيضاً: { ومن } يقدر أن { يُخرج الحيَّ من الميت ويخرجُ الميت من الحيَّ } ، فيخرج الحيوان من النطفة من الحيوان؟ وهكذا\n وقل لهم أيضاً: { ومن يُدبَّرُ الأَمرَ } أي: ومن يلي تدبير العالم، من عرشه إلى فرشه؟ وهو تعميم بعد تخصيص، { فسيقولون الله } ، لا محيص لهم عن الإقرار بسواه إذ لا يقدرون على المكابرة والعناد في ذلك لفرط وضوحُه\n { فقل أفلا تتقون } عقاب الله وغضبه؟ بسبب إشراككم معه ما لا يشاركه في شيء من ذلك، { فذلكم الله ربكم الحقُّ } أي: المتولي لهذه الأمور هو ربكم، الذي يستحق أن تعبدوه، الثابت ربوبيته، لأنه هو الذي أنشأكم وأحياكم ورزقكم ودبر أموركم، دون من تعبدوه، الثابت ربوبيته، لأنه هو الذي أنشأكم وأحياكم ورزقكم ودبر أموركم، دون من تعبدونه من الأوثان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:5",
      "similarity": 0.4168576486955097
    },
    {
      "verse": "23:68",
      "similarity": 0.41009070794905045
    },
    {
      "verse": "59:12",
      "similarity": 0.352070487283918
    },
    {
      "verse": "37:90",
      "similarity": 0.3402441268368429
    },
    {
      "verse": "23:72",
      "similarity": 0.3378405331140167
    }
  ]
}