{
  "chapter": "يونس",
  "text": "وما كان هذا القرءان ان يفترى من دون الله ولكن تصديق الذى بين يديه وتفصيل الكتب لا ريب فيه من رب العلمين",
  "translations": [
    {
      "translation": "This Qur'an could never have been devised by any besides Allah. Rather it is confirmation of what came before it and an elucidation of the Book which contains no doubt from the Lord of all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Qur'an is not such (a writ) as could be composed by anyone but God. It confirms what has been revealed before, and is an exposition of (Heaven's) law. Without any doubt it's from the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Qur'an is such that it could not be composed by any unless it be revealed from Allah. It is a confirmation of the revelation made before it and a detailed exposition of the Book. Beyond doubt it is from the Lord of the universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one could have composed this Quran besides God. This confirms the existing Book (the Bible) and explains itself. There is no doubt that it is from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this noble Qur’an is not such that anyone can invent it, without Allah revealing it – but it surely is a confirmation of the Books preceding it and is an explanation of all that is written on the (preserved) tablet – there is no doubt in it – it is from the Lord Of The Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Qur'an is not such as could ever be produced by other than Allah but it is a confirmation of (the revelation) which was before it, and a full explanation of the Book -- wherein there is no doubt -- from the Lord of all that exists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Quran is not such as could be forged by those besides Allah, but it is a verification of that which is before it and a clear explanation of the book, there is no doubt in it, from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Koran could not have been forged apart from God; but it is a confirmation of what is before it, and a distinguishing of the Book, wherein is no doubt, from the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Qur'an is not such as could ever be invented in despite of Allah; but it is a confirmation of that which was before it and an exposition of that which is decreed for mankind - Therein is no doubt - from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran is not such as could have been produced by anyone but God. It fulfills that [the predictions] which came before it and gives a fuller explanation of the [earlier] Revelations. There is no doubt about it: it is from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Qur'an is not such as could be fabricated as against Allah. But it is a confirmation of that a which is before it, and and a d etailing of the Decree, whereof there is no doubt, from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran could not have been fabricated by anyone besides Allah; rather, it is a confirmation of what was [revealed] before it, and an elaboration of the Book, there is no doubt in it, from the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Qur'an is not such as can be produced by other than Allah; on the contrary it is a confirmation of (revelations) that went before it, and a fuller explanation of the Book - wherein there is no doubt - from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Quran is not such as could ever be produced by other than Allah (Lord of the heavens and the earth), but it is a confirmation of (the revelation) which was before it [i.e. the Taurat (Torah), and the Injeel (Gospel), etc.], and a full explanation of the Book (i.e. laws and orders, etc, decreed for mankind) - wherein there is no doubt from the the Lord of the 'Alamin (mankind, jinns, and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Koran could not have been forged by other than Allah. It confirms what was before it; a distinguishing Book, in which there is no doubt, from the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran could not have been produced by anyone other than God. In fact, it is a confirmation of what preceded it, and an elaboration of the Book. There is no doubt about it—it is from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was not [possible] for this Qur'an to be produced by other than Allah, but [it is] a confirmation of what was before it and a detailed explanation of the [former] Scripture, about which there is no doubt, from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:37] And this Qur’ān is not such as could ever be produced, that is, [it could not be] a fabrication, [by anyone] besides God; but it is, revealed [as], a confirmation of what is before it, of Scriptures, and a detailing of the Book, a exposition of the rulings and other matters which God has prescribed — wherein is no doubt, no uncertainty — from the Lord of the Worlds (min rabbi’l-‘ālamīn is semantically connected to tasdīqa, ‘a confirmation’, or to an omitted unzila, ‘revealed’; a variant reading [for accusative tasdīqa] has the nominative tasdīqu and nominative tafsīlu, ‘a detailing’, [for the accusative tafsīla] by [reading] an implied huwa, ‘it is’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلما كان الغرض الأول في هذه السورة إبطال تعجب المشركين من الإيحاء بالقرآن إلى النبي صلى الله عليه وسلم وتبيين عدم اهتدائهم إلى آياته البينات الدالة على أنه من عند الله ، وكيف لم ينظروا في أحوال الرسول الدالة على أن ما جاء به وحي من الله ، وكيف سألوه مع ذلك أن يأتي بقرآن غيره أو يبدل آياته بما يوافق أهواءهم . ثم انتقل بعد ذلك إلى سُؤَالهم أن تنزل عليه آية أخرى من عند الله غير القرآن ، وتخلل ذلك كلَّه وصفُ افترائهم الكذب في دعوى الشركاء لله وإقامة الأدلة على انفراد الله بالإلهية وعلى إثبات البعث ، وإنذارهم بما نال الأمم من قبلهم ، وتذكيرهم بنعم الله عليهم وإمهالهم ، وبيان خطئهم في اعتقاد الشرك اعتقاداً مبنياً على سوء النظر والقياس الفاسد ، لا جرم عاد الكلام إلى قولهم في القرآن بإبطال رأيهم الذي هو من الظن الباطل أيضاً بقياسهم أحوالَ النبوءة والوحي بمقياس عاداتهم كما قاسُوا حقيقة الإلهية بمثل ذلك ، فقارعتهم هذه الآيةُ بذكر صفات القرآن في ذاته الدالة على أنه حق من الله وتحدتهم بالإعجاز عن الإتيان بمثله .فجملة : { وما كان هذا القرآن أن يفترى من دون الله } يجوز أن تكون معطوفة على جملة : { وما يتبع أكثرهم إلا ظناً } \\[ يونس : 36 \\] بمناسبة اتباعهم الظن في الأمرين : شؤون الإلهية وفي شؤون النبوءة ، ويجوز أن تكون معطوفة على مجموع ما تقدم عطف الغرض على الغرض والقصة على القصة ، وهو مفيد تفصيل ما أجمله ذكر الحروف المقطعة في أول السورة والجمل الثلاث التي بعد تلك الحروف . ويجوز أن تكون الجملة معطوفة على جملة : { قل ما يكون لي أن أبدله من تلقاء نفسي } \\[ يونس : 15 \\] تكملة للجواب عن قولهم { ائت بقرآن غير هذا أو بدله } \\[ يونس : 15 \\] وهذا الكلام مسوق للتحدي بإعجاز القرآن ، وهي مفيدة للمبالغة في نفي أن يكون مفترى من غير الله ، أي منسوباً إلى الله كذباً وهو آتتٍ من غيره ، فإن قوله : { ما كان هذا القرآن أن يفترى } أبلغ من أن يقال : ما هو بمفترى ، لما يدل عليه فعل الكون من الوجود ، أي ما وجد أن يفترى ، أي وجوده مناف لافترائه ، فدلالة ذاته كافية في أنه غير مفترى ، أي لو تأمل المتأمل الفطن تأملاً صادقاً في سور القرآن لعلم أنه من عند الله وأنه لا يجوز أن يكون من وضع البشر ، فتركيب ما كان أن يفترى بمنزلة أن يقال : ما كان ليفترى ، بلام الجحود ، فحُذف لام الجحود على طريقة حَذْف الجار اطراداً مع ( أنْ ) ، ولما ظهرت ( أنْ ) هنا حذف لام الجحود وإن كان الغالب أن يذكر لام الجحود وتقدر ( أنْ ) ولا تذكر ، فلما ذكر فعل ( كان ) الذي شأنه أن يذكر مع لام الجحود استغني بذكره عن ذكر لام الجحود قصداً للإيجاز .وإنما عدل عن الإتيان بلام الجحود بأن يقال : ما كان هذا القرآن ليفترى ، لأن الغالب أن لام الجحود تقع في نفي كون عن فاعل لا عن مفعول بما تدل عليه اللام من معنى الملك .واعلم أن الإخبار ب { أن } والفعل يساوي الإخبار بالمصدر ، وهو مصدر بمعنى المفعول لأن صلة { أن } هنا فعل مبني للنائب . والتقدير ما كان هذا القرآن افتراءَ مُفتر ، فآل إلى أن المصدر المنسبك من ( أن ) مصدر بمعنى المفعول كالخَلْق بمعنى المخلوق ، وهو أيضاً أقوى مبالغة من أن يقال : ما كان مفترًى ، فحصلت المبالغة في جهتين : جهة فعل ( كَان ) وجهة ( أن ) المصدرية .و ( من ) في قوله : { من دون الله } للابتداء المجازي متعلقة ب { يفترى } أي أن يفتريه على الله مفتر . فقوله : { من دون الله } حال من ضمير { يفترى } وهي في قوة الوصف الكاشف .والافتراء : الكذب ، وتقدم في قوله : { ولكنَّ الذين كفروا يفترون على الله الكذب } في سورة \\[ العقود : 103 \\].ولما نفي عن القرآن الافتراء أخبر عنه بأنه تصديق وتفصيلٌ ، فجرت أخباره كلها بالمصدر تنويهاً ببلوغه الغاية في هذه المعاني حتى اتحد بأجناسها .وتصديق الذي بين يديه } كونُه مصدقاً للكتب السالفة ، أي مبيّناً للصادق منها ومييزاً له عما زيد فيها وأسيء من تأويلها كما قال تعالى : { مصدقاً لما بين يديه من الكتاب ومهيمناً عليه } كما تقدم في سورة \\[ العقود : 48 \\]. وأيضاً هو مصدَّق ( بفتح الدال ) بشهادة الكتب السالفة فيما أخذت من العهد على أصحابها أن يؤمنوا بالرسول الذي يجيء مصدقاً وخاتماً . فالوصف بالمصدر صالح للأمرين لأن المصدر يقتضي فاعلاً ومفعولاً .والتفصيل : التبيين بأنواعه . والظاهر أن تعريف الكتاب } تعريف الجنس فيستغرق الكتب كلها . ومعنى كون القرآن تفصيلاً لها أنه مبين لما جاء مجملاً في الكتب السالفة ، وناسخ لما لا مصلحة للناس في دوام حكمه ، ودافع للمتشابهات التي ضل بها أهل الكتاب ، فكل ذلك داخل في معنى التفصيل ، وهو معنى قوله تعالى : { ومهيمناً عليه } في سورة \\[ العقود : 48 \\]. وهذا غير معنى قوله : { وتفصيلَ كل شيء } \\[ يوسف : 111 \\] في الآية الأخرى .وجملة : { لا ريب فيه مستأنفة ردت مزاعم الذين زعموا أنه مفترى باقتلاع دعوى افترائه ، وأنها مما لا يروج على أهل الفِطن والعقوللِ العادلة ، فالريب المنفي عنه هو أن يكون من أحواله في ذاته ومقارناته ما يثير الريب ، ولذلك كان ريب المرتابين فيه ريباً مزعوماً مدعًى وهو لو راجعوا أنفسهم لوجدوها غير مرتابة . وقد تقدم القول في نظير هذا في طالعة سورة \\[ البقرة : 2 \\].وموقع قوله : { من رب العالمين } محتمل وجوهاً أظهرها أنه ظرف مستقر في موضع الخبر عن مبتدإ محذوف هو ضمير القرآن ، والجملة استئناف ثان ، و ( مِن ) ابتدائية تؤذن بالمجيء ، أي هو وارد من رب العالمين ، أي من وحيه وكلامِه ، وهذا مقابل قوله : { من دون الله }.\n\n",
      "translations": [
        {
          "translation": "(And this Qur'an) which is recited to you by Muhammad (pbuh) (is not such as could ever be invented in despite of Allah; but it is a confirmation of that which was before it) it is a confirmation of the Torah, the Gospel, the Psalms and all other Scriptures in that they all call to the profession of divine Oneness and contain the traits and description of Muhammad (pbuh) (and an exposition of that which is decreed for mankind) the Qur'an exposits the lawful and the prohibited, the commands and prohibitions. (Therein is no doubt from the Lord of the Worlds) from the Master of all worlds.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما كان هذا القرآن } اختلاقاً { من دون الله ولكن تصديق الذي بين يديه } من اللوح المحفوظ { وتفصيل الكتاب } الذي هو الأمّ له كقوله تعالى:\n[الزخرف\n الآية: 4] أي: كيف يكون مختلقاً وقد أثبت قبله في كتابين من علم مفصلاً كما هو في اللوح المحفوظ ومجملاً في أمّ الكتاب الذي هذا تفصيله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المبين لهم قواعد دين الإسلام { أَن يُفْتَرَىٰ } ويخيل أنه صدر { مِن دُونِ ٱللَّهِ } العليم الحكيم\n وكيف يصدر هذا من غير الله\n إذ هو في أعلى مراتب البلاغة\n ونهاية درجات الإعجاز\n! لصدوره عن الحكمة المتقنة الإلهية التي كلت الأفهام دونها\n وعجزت المدارك والآلات عن دركها\n فلا يتوهم صدوره عن غير الله أصلاً { وَلَـٰكِن تَصْدِيقَ ٱلَّذِي بَيْنَ يَدَيْهِ } مطابقاً\n كما نزل من عنده في الكتب السالفة\n بل هو أعلى حكمة\n وأتم به فائدة منها { وَتَفْصِيلَ ٱلْكِتَابِ } الذي من عمله ولوحه قضائه\n وبالجملة: { لاَ رَيْبَ فِيهِ } أنه نازل { مِن رَّبِّ ٱلْعَالَمِينَ } [يونس: 37] ليس في وسع بشر أن يأتي بمثله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" تصديق \": مصدر\n والعامل فيه \" كان \" محذوفة\n أو \" أنزل \" \n و \" لا ريب \": خبر ثالث لها\n و \" من رب العالمين \": خبر آخر\n أي: كائناً من رب العالمين\n أو متعلق بتصديق أو بتفصيل\n و \" لا ريب \": اعتراض\n أو بالفعل المعلل بهما ـ وهو \" نزل \" ـ ويجوز أن يكون حالاً من \" الكتاب \" \n أو من الضمير في \" فيه \" \n: و \" أم \": منقطعة بمعنى بل مع الاستفهام الإنكاري\n و \" كيف \" خبر كان\n يقول الحق جل جلاله: { وما كان هذا القرآنُ أن يفترى من دون الله } أي: صح له أن يفترى من الخلق\n إذ لا قدرة له على ذلك\n { ولكن } كان { تصديقَ الذي بين يديه } من الكتب\n أو: ولكن أنزله تصديقاً لما سلف قبله من الكتب الإلهية\n المشهود على صدقها لأنه مطابق لها\n فلا يكون كذباً\n كيف وهو لكونه معجزاً عيار عليها\n شاهد على صحتها؟ { وتفصيلَ الكتاب } أي: وأنزله تفصيلَ ما حقق وأثبت من العقائد والشرائع\n التي تضمنها الكتاب\n { لا ريبَ فيه }: لا ينبغي أن يرتاب فيه لما احتفّت به من شواهد الحق\n وارتياب الكفار فيه كلا ريب\n كائناً { من رب العالمين } \n أول نزل منه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:2",
      "similarity": 0.42550593317497903
    },
    {
      "verse": "2:2",
      "similarity": 0.39800510517923854
    },
    {
      "verse": "45:26",
      "similarity": 0.37920445962558247
    },
    {
      "verse": "41:3",
      "similarity": 0.37143444023924804
    },
    {
      "verse": "40:59",
      "similarity": 0.37094999931000106
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010037.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010037.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}