{
  "chapter": "يونس",
  "text": "ام يقولون افترىه قل فاتوا۟ بسورة مثله وادعوا۟ من استطعتم من دون الله ان كنتم صدقين",
  "translations": [
    {
      "translation": "Do they say, 'He has invented it'? Say: 'Then produce a sura like it and call on anyone you can besides Allah if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say (of the Prophet) that: \"He has composed it?\" Say to them: \"Bring a Surah like this, and call anyone apart from God you can (to help you), if what you say is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say that the Messenger has himself composed the Qur'an? Say: 'In that case bring forth just one surah like it and call on all whom you can, except Allah, to help you if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say that Muhammad has invented it? (Muhammad), tell them, \"If your claim is true, compose only one chapter like it and call on anyone besides God for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! They dare say that “He has fabricated it”? Say, “Then bring one chapter like it and, other than Allah, call everyone you can if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say: \"He has forged it\" Say: \"Bring then a Surah like unto it, and call upon whomsoever you can besides Allah, if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say: He has forged it? Say: Then bring a chapter like this and invite whom you can besides Allah, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, 'Why, he has forged it'? Say: 'Then produce a sura like it, and call on whom you can, apart from God, if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: He hath invented it? Say: Then bring a surah like unto it, and call (for help) on all ye can besides Allah, if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say, \"He has fabricated it?\" Say, \"Bring me one chapter like it. Call on whom you may besides God to help you, if what you say be true!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say they: he hath fabricated it! Say thou: then bring ye a Surah like thereunto, and call whomsoever ye can beside Allah, if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say, ‘He has fabricated it?’ Say, ‘Then bring a surah like it, and invoke whomever you can, besides Allah, should you be truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, \"He forged it\"? say: \"Bring then a Sura like unto it, and call (to your aid) anyone you can besides Allah, if it be ye speak the truth!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say: \"He (Muhammad SAW) has forged it?\" Say: \"Bring then a Surah (chapter) like unto it, and call upon whomsoever you can, besides Allah, if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say: 'He has forged it'. Say: 'Compose one chapter like it, and call upon whom you will, other than Allah (to help you), if what you say is true'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, “He has forged it”? Say, “Then produce a single chapter like it, and call upon whomever you can, apart from God, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say [about the Prophet], \"He invented it?\" Say, \"Then bring forth a surah like it and call upon [for assistance] whomever you can besides Allah, if you should be truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:38] Or do they say, ‘He has invented it’?, Muhammad (s) has invented it. Say: ‘Then bring a sūra like it, in terms of the clarity and the rhetorical excellence of its language, by way of invention, for you are eloquent speakers of Arabic like me; and call upon whom you can, for help in this [matter], besides God, that is, other than Him, if you are truthful’, in [saying] that this is an invention. But they were not able to do this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or say they) rather, the disbelievers of Mecca say: (He hath invented it) Muhammad (pbuh) invented the Qur'an himself? (Say) to them, O Muhammad: (Then bring a surah like unto it) like the surahs of the Qur'an, (and call (for help) on all ye can) seek help for this purpose from those idols you worship (besides Allah, if ye are truthful) that Muhammad (pbuh) has invented the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأيشكون نزوله على رسول الله صلى الله عليه وسلم { أَمْ يَقُولُونَ ٱفْتَرَاهُ } واخترعه من عنده، ونسبه إلى الله ترويجاً وتعظيماً؟ { قُلْ } لهم يا أكمل الرسل: بعدما شككتم أنه من عند الله، بل جزمتم بأه من عند غيره { فَأْتُواْ بِسُورَةٍ } قصيرة { مِّثْلِهِ } في الفصاحة ورعاي المقتضيات والحكم والمطابقات، ووجوه الدلالات والتمثيلات، والتشبيهات والمجازات والكنايات { وَ } إن عجزتم أنتم { ٱدْعُواْ } واستظهروا { مَنِ ٱسْتَطَعْتُمْ } واستوثقتهم به { مِّن دُونِ ٱللَّهِ إِن كُنتُمْ صَادِقِينَ } [يونس: 38] في دعواكم أنه من كلام البشر مفترى على الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم }: بل { يقولون افتراه } محمد من عند نفسه؟ { قل فأتُوا } أنتم { بسورةٍ مثله } في البلاغة وحسن النظم، وجودة المعنى، فإنكم مثلي في العربية والفصاحة، { وادعوا من استطعتم }: مَنْ قدرتم عليه من الجن والإنس، يُعينكم على ذلك، { من دون الله } فإنه وحده قادر على ذلك، { إن كنتم صادقين } أنه مفترىً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:13",
      "similarity": 0.8712574949326423
    },
    {
      "verse": "2:23",
      "similarity": 0.6955520305274653
    },
    {
      "verse": "9:124",
      "similarity": 0.5073678197298199
    },
    {
      "verse": "43:53",
      "similarity": 0.4478948911708441
    },
    {
      "verse": "24:1",
      "similarity": 0.44073313528607705
    }
  ]
}