{
  "chapter": "يونس",
  "text": "بل كذبوا۟ بما لم يحيطوا۟ بعلمه ولما ياتهم تاويله كذلك كذب الذين من قبلهم فانظر كيف كان عقبة الظلمين",
  "translations": [
    {
      "translation": "No, the fact is that they have denied something which their knowledge does not embrace and the the final fate of the wrongdoers!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, they deny what is beyond the reach of their knowledge, whose explanation has not reached them yet. So had those who have gone before them denied; but look at the fate of the unjust\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact they arbitrarily rejected as false whatever they failed to comprehend and whose final sequel was not apparent to them. Likewise had their predecessors rejected the truth, declaring it falsehood. Do observe, then, what was the end of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They call a lie something that is beyond the limit of their knowledge and whose interpretation has not yet been revealed. Some people who lived before them also called Our revelations lies. Consider how terrible was the end of the unjust people!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the contrary, they denied the thing the knowledge of which they could not master, whereas they have not yet seen its outcome; similarly those before them had denied, therefore see what sort of fate befell the unjust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they have belied the knowledge whereof they could not comprehend and what has not yet been fulfilled. Thus those before them did belie. Then see what was the end of the wrongdoers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they reject that of which they have no comprehensive knowledge, and the final sequel of it has not yet come to them; even thus did those before them reject (the truth); see then what was the end of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No; but they have cried lies to that whereof they comprehended not the knowledge, and whose interpretation has not yet come to them. Even so those that were before them cried lies; then behold how was the end of the evildoers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they denied that, the knowledge whereof they could not compass, and whereof the interpretation (in events) hath not yet come unto them. Even so did those before them deny. Then see what was the consequence for the wrong-doers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they are denying something which they cannot comprehend; the reality not yet having dawned on them. Likewise those before them rejected the truth. But see what was the end of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! they have belied that of which the knowledge they comprehended not and of which the fulfilment hath not come to them. Likewise belied those who were before them; behold then in what wise hath been the end of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they deny something whose knowledge they do not comprehend, and whose explanation has not yet come to them. Those who were before them denied likewise. So observe how was the fate of the wrongdoers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they charge with falsehood that whose knowledge they cannot compass, even before the elucidation thereof hath reached them: thus did those before them make charges of falsehood: but see what was the end of those who did wrong!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they deny that; the knowledge whereof they could not compass and whereof the interpretation has not yet come unto them. Thus those before them did deny. Then see what was the end of the Zalimun (polytheists and wrong-doers, etc.)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have belied that which they did not understand of its knowledge, nor has its interpretation reached them. Those who were before also belied. But see how was the end of the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, they deny what is beyond the limits of their knowledge, and whose explanation has not yet reached them. Thus those before them refused to believe. So note the consequences for the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, they have denied that which they encompass not in knowledge and whose interpretation has not yet come to them. Thus did those before them deny. Then observe how was the end of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:39] God, exalted be He, says: Nay, but they denied that, the knowledge whereof they did not comprehend, that is, [they denied] the Qur’ān and did not reflected upon it; and whereof the interpretation, the consequence of the threats [made] therein, has not yet come to them. So, in the same [manner of] denial, those who were before them denied, their messengers. Behold then what was the consequence for the evildoers!, for denying the messengers, in other words, [behold] how their affair was concluded, by their being destroyed. In a similar manner, We shall destroy these [people].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but they denied that, the knowledge whereof they could not compass) they denied that which their knowledge could not embrace, (and whereof the interpretation) the consequence of what the Qur'an promised them (hath not yet come unto them. Even so) just as your people deny the Scriptures and messengers (did those before them deny) the Scriptures and messengers. (Then see) O Muhammad (what was the consequence for the wrong-doers!) what was the end result of the idolaters who denied the Scriptures and messengers and never worshipped Allah. It is also said that this was a consolation from Allah, glorified and Mighty is He, to His Prophet (pbuh) so that he endures their harm.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { بل كذبوا بما لم يحيطوا بعلمه } أي: لما جهلوا كيفية ثبوته في علم الله ونزوله على سيدنا محمد عليه الصلاة و السلام وقصر علمهم عن ذلك كذبوا به { ولما يَأْتِهِم تَأْوِيله } أي: ظهور ما أشار إليه في مواعيده وأمثاله مما يؤول أمره وعلمه إليه فلا يمكنهم التكذيب لأنه إذا ظهرت حقائقه لا يمكن لأحد تكذيبه\n مثل ذلك التكذيب العظيم { كذّب الذين من قَبْلهم فانْظُر كيفَ كَانَ } عاقبتهم لما ظلموا بالتكذيب { ومنهم من يؤمن به } أي: سيؤمن به لرقة حجابه { ومنهم من لا يؤمن به } أبداً لغلظ حجابه { ومنهم من يستمعون إليك } ولكن لا يفهمون إما لعدم الاستعداد في الأصل وإما لرسوخ الهيئات المظلمة الحاجبة لنور الاستعداد فيهم وإما لاجتماع الأمرين كالأصم الذي لا عقل له فلا يسمع ولا يتفطن للإشارة\n فكيف يمكن إفهامه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أو لم يقروا بأنه معجز ليس من كلام البشر { بَلْ كَذَّبُواْ } بادروا إلى الرد والتكذيب { بِمَا } أي: بشيء { لَمْ يُحِيطُواْ بِعِلْمِهِ } ولم يعلموا ويفهموا ما فيه من قرائحهم { وَلَمَّا يَأْتِهِمْ تَأْوِيلُهُ } من معلم وملهم\n بل كابروا في تكذيبه بلا سند عقلي ونقلي { كَذَلِكَ } أي: مثل تكذيبهم هذا { كَذَّبَ ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } أنبياءهم وكتبهم التي جاءوا به { فَٱنْظُرْ كَيْفَ كَانَ عَاقِبَةُ ٱلظَّالِمِينَ } [يونس: 39] الخارجين عن مقتضى الأوامر\n المبادرين إلى تكذيب الله وتكذيب كتبه ورسله\n وما جرى عليهم من المصيبات الهائلة\n فانتظر يا أكمل الرسل لهؤلاء المكذبين\n المكابرين أمثالها\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { بل كذّبوا } أي: سارعوا إلى التكذيب { بما لم يُحيطُوا بعلمه } وهو القرآن\n بحيث لم يستمعوه\n ولم يتدبروا آياته ويحيطوا بالعلم بشأنه\n حتى يعلموا أحق هو أم لا\n أو بما جهلوه ولم يحيطوا به علماً\n من ذكر البعث والجزاء\n وسائر ما يخالف دينهم\n { ولمَّا يأتهم تأويلُهُ } أي: ولم يقفوا بعدُ على تأويله\n ولم تبلغ أذهانهم معانيه\n أو لم يأتهم بعدُ تأويلُ ما فيه من الإخبار بالغيوب\n حتى يتبين لهم أنه صدق أو كذب\n والمعنى: أن القرآن معجز من جهة اللفظ والمعنى\n ثم إنهم فاجئوا تكذيبه قبل أن يتدبروا نظمه\n ويتصفحوا معناه\n ومعنى التَّوقع في { لمَّا }: أنه قد ظهر بالآخرة إعجازه لمّا كرر عليهم التحدَّي فزادوا أذْهانهم في معارضته فتضاءلت دونها\n أو لمّا شاهدوا وقوع ما أخبر به طبق ما أخبر مراراً فلم يقلعوا عن التكذيب تمرداً وعناداً\n قاله البيضاوي\n قال ابن جزي: لمَّا يأتهم ما فيه من الوعيد لهم\n أي: وسيأتيهم يوم القيامة أو قبله\n\n{ كذلك كذَّب الذين من قبلهم } أنبياءهم\n { فانظر كيف كان عاقبةُ الظالمين } \n فيه وعيد لهم بمثل ما عوقب به من قبلهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:68",
      "similarity": 0.520657828785728
    },
    {
      "verse": "27:84",
      "similarity": 0.4758598756149134
    },
    {
      "verse": "4:126",
      "similarity": 0.4621013214505727
    },
    {
      "verse": "48:21",
      "similarity": 0.4529719125606571
    },
    {
      "verse": "20:110",
      "similarity": 0.4378308885481114
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010039.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010039.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}