{
  "chapter": "يونس",
  "text": "هنالك تبلوا۟ كل نفس ما اسلفت وردوا۟ الى الله مولىهم الحق وضل عنهم ما كانوا۟ يفترون",
  "translations": [
    {
      "translation": "Then and there every self will be tried for what it did before. They will be returned to Allah, their Master, the Real, and what they invented will abandon them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then each will see what he had done in the past; and they will turn to God, their true Lord, and all the lies they had fabricated will be of no avail to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon everyone shall taste the recompense of his past deeds. All shall be sent back to Allah, their true Lord, and then all the falsehoods they had fabricated will have forsaken them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There every soul will experience the result of all that it had done. They will be brought into the presence of God, their true Lord, and all that they falsely invented will vanish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here will every soul come to know what it has sent ahead, and they will be returned to Allah – their true Master, and they will lose all that they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There! Every person will know (exactly) what he had earned before and they will be brought back to Allah, their rightful Mawla (Lord), and their invented false deities will vanish from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall every soul become acquainted with what it sent before, and they shall be brought back to Allah, their true Patron, and what they devised shall escape from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There every soul shall prove its past deeds; and they shall be restored to God, their Protector, the True, and there shall go astray from them that they were forging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There doth every soul experience that which it did aforetime, and they are returned unto Allah, their rightful Lord, and that which they used to invent hath failed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then every soul shall realize what it has done. They shall be returned to God, their true Master, and anything they had invented will forsake them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein every soul shall prove that which it sent before, and they shall be brcught back to Allah, their rightful Owner, and there shall stray from them that which they were wont to fabriCate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There every soul will examine what it has sent in advance, and they will be returned to Allah, their real master, and what they used to fabricate will forsake them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will every soul prove (the fruits of) the deeds it sent before: they will be brought back to Allah their rightful Lord, and their invented falsehoods will leave them in the lurch.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There! Every person will know (exactly) what (all) he had earned before, and they will be brought back to Allah, their rightful Lord (Maula), and their invented false deities will vanish from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There, each soul shall prove its past deeds. They shall be restored to Allah, their Guardian, the True, and that which they forged will escape from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There, every soul will experience what it had done previously; and they will be returned to God, their True Master; and what they used to invent will fail them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There, [on that Day], every soul will be put to trial for what it did previously, and they will be returned to Allah, their master, the Truth, and lost from them is whatever they used to invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:30] There, that is, on that day, every soul shall experience (tablū derives from balwā, ‘a trial’; a variant reading has tatlū, ‘it shall recite’, derived from tilāwa, ‘recitation’) what it did before, [what] it offered in the way of   deeds, and they shall be returned to God, their rightful, [their] established, everlasting, Lord, and that which they were inventing, [of lies] against Him, in the way of associates, shall fail them, shall be absent [before them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There) at this juncture (doth every soul experience) know; and according to another variant: read (that which it did aforetime) of good or evil, (and they are returned unto Allah, their rightful Lord) their true God, (and that which they used to invent) to wrongfully worship (hath failed them) being too preoccupied to pay any attention to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { هُنَالِكَ } أي: حين أحضروا للسؤال والجواب، والجزاء والحساب { تَبْلُواْ } أي: تختبر وتتفطن { كُلُّ نَفْسٍ } جزاء { مَّآ أَسْلَفَتْ } وكسبت فيما سبقت { وَ } بعد تفطنهم وتنبههم { رُدُّوۤاْ } جميعاً { إِلَى ٱللَّهِ } المتوحد المتفرد للجزاء؛ إذ هو { مَوْلاَهُمُ } ومولى أمورهم { ٱلْحَقِّ } وما سواه من الآلهة الكاذبة الباطلة، ومع بطلانها { وَضَلَّ عَنْهُمْ } أي: غاب عنهم وضاع عنهم { مَّا كَانُواْ يَفْتَرُونَ } [يونس: 30] ظلماً وزوراً، وسموهم آلهة وشفعاء، ولم يبقَ إلا الله الواحد القهار، ولو كوشفوا بوحدة الحق في جميع الأحيان والأحياز لتحققوا بتوحيده دائماً بلا توقف إلى يوم القيامة، إلا أنهم لا نهماكهم في الغفلة والضلال لم ينتبهوا في النشأة الأولى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:56",
      "similarity": 0.5366237737106668
    },
    {
      "verse": "18:44",
      "similarity": 0.4731593823313054
    },
    {
      "verse": "7:119",
      "similarity": 0.3990367857763444
    },
    {
      "verse": "40:78",
      "similarity": 0.3978572337685457
    },
    {
      "verse": "33:11",
      "similarity": 0.38466030508558413
    }
  ]
}