{
  "chapter": "يونس",
  "text": "كذلك حقت كلمت ربك على الذين فسقوا۟ انهم لا يؤمنون",
  "translations": [
    {
      "translation": "In that way the Word of your Lord is realised against those who are deviators, in that they do not have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the word of your Lord about those who disobey comes true, that they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the word of your Lord is fulfilled concerning the transgressors that they shall not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The decree of your Lord that the evil-doers will not have faith has already been issued.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is how the Word of your Lord is proved concerning the sinful, so they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus is the Word of your Lord justified against those who rebel (disobey Allah), that they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus does the word of your Lord prove true against those who transgress that they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the word of thy Lord is realized against the ungodly that they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus is the Word of thy Lord justified concerning those who do wrong: that they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the Word of your Lord is proved true against those who are disobedient. They will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this wise is the word of thy Lord justified on those who transgress: that they shall not come to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the word of your Lord became due against those who transgress, that they shall not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus is the word of thy Lord proved true against those who rebel: Verily they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus is the Word of your Lord justified against those who rebel (disobey Allah) that they will not believe (in the Oneness of Allah and in Muhammad SAW as the Messenger of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the Word of your Lord is realized against the evildoers that they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus your Lord’s Word proved true against those who disobeyed, for they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the word of your Lord has come into effect upon those who defiantly disobeyed - that they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:33] Thus, just as those are turned away from faith so, the Word of your Lord is justified concerning those who are wicked, [those who] disbelieve, and this [Word] is [either] the verse, [Q. 32:13]‘Verily I shall fill Hell [with jinn and mankind, together]’, or it is [the following:] that they do not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus is the Word of your Lord) to impose His chastisement (justified) enjoined (concerning those who do wrong) concerning the disbelievers: (that they believe not) as it is in Allah's foreknowledge. 216\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَذَلِكَ } أي: كما ثبت الربوبية والألوهية للحق سباحنه { حَقَّتْ كَلِمَتُ رَبِّكَ } أي: ثبتت وتمت صدقاً وعدلاً لا مبدل لكلماته { عَلَى ٱلَّذِينَ فَسَقُوۤاْ } أي: خرجوا من عبادة الله ظلماً وعدواناً { أَنَّهُمْ لاَ يُؤْمِنُونَ } [يونس: 33] أي: لا يوقنون بالله، ولا يصلون إلى مرتبة التوحيد أصلاً، لا علماً ولا عيناً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { كذلك حقت كلمة ربك من الذين فسقوا أنهم لا يؤمنون } أي: كما حق الحق في الاعتقادات { كذلك حقتْ } أي: وجبت وثبتت ـ { كلمةُ ربك } في اللوح المحفوظ { أنهم لا يؤمنون } ، وذلك في قوم مخوصين\n قال البيضاوي: أي: كما حقت الربوبية لله، أو أن الحق بعده الضلال، أو أنهم مصروفون عن الحق، كذلك حقت كلمة الله وحكمه، { على الذين فسقوا }: تمردوا في كفرهم، وخرجوا عن حد الإصلاح { أنهم لا يؤمنون } ، وهو بدل من الكلمة، أو تعليل لها، والمراد بها العِدَة بالعذاب\n وقرأ نافع وابن عامر: \" كلمات \" بالجمع هنا، وفي آخر السورة، وفي غافر\n هـ\n الإشارة: قل من يرزقكم من سماء الأرواح علوم الأسرار والحقائق\n\n\nومن أرض النفوس علوم الشرائع والطرائق؟ أمَّن يملك السمع والابصار فيصرفهما إلى سماع الوعظ والتذكار، ونظر التفكر والاعتبار ليلتحق صاحبهما بالمقربين والأبرار، وقدَّم السمع لأنه أنفع لإيصال النفع إلى القلب من البصر\n أم من يخرج الحي من الميت، فيخرج العارف من الجاهل، والذاكر من الغافل، أو يخرج القلب الحي من الميت بحيث يحييه بالمعرفة بعد الجهل؟ ومن يدبر الأمر لخواص عباده؟ أي: تدبيراً خاصاً، بحيث يقوم لهم بتدبير شؤونهم، حيث لم يدبروا معه\n فمن لم يدبر دبر له، فالفاعل لهذه الأمور هو الحق المنفرد بالوجود، فكل ما سواه باطل، كما قال القائل:\n\nقال صلى الله عليه وسلم:\n\n \" أَصْدَقُ كَلِمَةُ قَالَها الشاعِرُ كَلَِمَةُ لَبيدٍ: أَلا كُلُ شيءٍ\n\n\n \" \n\nالخ\n فكل من صُرف عن شهود الحق إلى نظر السِّوى فهو في ضلال\n قال تعالى: { فماذا بعد الحق إلا الضلال فأنى تصرفون } ، لكن من حقت عليه كلمة الشقاء لا يُؤمن بأهل الفناء والبقاء، فلا يزال في تعب وشقاء إذ لا طريق إلى شهود الحق وإفراده بالوجود إلا بصحبة أهل الفناء والبقاء، الموصوفين بالكرم والجود، واعلم أن كل من لم يصل إلى مقام الشهود، فهو ضال عندهم في مذهبهم، وبالله التوفيق\n ثم ذكر عجز آلهتهم، احتجاجاً عليهم، فقال: { قُلْ هَلْ مِن شُرَكَآئِكُمْ مَّن يَبْدَأُ ٱلْخَلْقَ ثُمَّ يُعِيدُهُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:96",
      "similarity": 0.6435314768319836
    },
    {
      "verse": "40:6",
      "similarity": 0.5724583314690113
    },
    {
      "verse": "32:18",
      "similarity": 0.5514526364636894
    },
    {
      "verse": "3:82",
      "similarity": 0.509982957590211
    },
    {
      "verse": "59:19",
      "similarity": 0.47020667551478007
    }
  ]
}