{
  "chapter": "يونس",
  "text": "ان ربكم الله الذى خلق السموت والارض فى ستة ايام ثم استوى على العرش يدبر الامر ما من شفيع الا منۢ بعد اذنه ذلكم الله ربكم فاعبدوه افلا تذكرون",
  "translations": [
    {
      "translation": "Your Lord is Allah, Who created the heavens and the earth in six days and then established Himself firmly on the Throne. He directs the whole affair. No one can intercede except with His permission. That is Allah your Lord, so worship Him. Will you not pay heed?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is God who created the heavens and the earth in six spans, then assumed His power, dispensing all affairs. None can intercede with Him except by His leave. He is God, your Lord, so worship Him. Will you not be warned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord is Allah, Who created the heavens and the earth in six days, then established Himself on the Throne (of His Dominion), governing all affairs of the universe. None may intercede with Him except after obtaining His leave. Such is Allah, your Lord; do therefore serve Him. Will you not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is your Lord who has created the heavens and the earth in six days and established His Dominion over the Throne. He maintains order over the creation. No one can intercede for others without His permission. It is God who is your only Lord. Worship only Him. Will you then not think?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord is Allah Who created the heavens and the earth in six days, then as befits His Majesty, established Himself upon the Throne* – He plans all matters; there is no intercessor except after His permission;* such is Allah, your Lord – therefore worship Him; so do you not ponder? (* Of Control over everything.** Prophet Mohammed (peace and blessings be upon him) will be the first to be granted permission to intercede.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, your Lord is Allah Who created the heavens and the earth in six Days and then rose over (Istawa) the Throne, arranging the affair [of all things]. No intercessor (can plead with Him) except after He permits. That is Allah, your Lord; so worship Him (alone). Then, will you not remember\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord is Allah, Who created the heavens and the earth in six periods, and He is firm in power, regulating the affair, there is no intercessor except after His permission; this is Allah, your Lord, therefore serve Him; will you not then mind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord is God, who created the heavens and the earth in six days, then sat Himself upon the Throne, directing the affair. Intercessor there is none, save after His leave that then is God, your Lord; so serve Him. Will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! your Lord is Allah Who created the heavens and the earth in six Days, then He established Himself upon the Throne, directing all things. There is no intercessor (with Him) save after His permission. That is Allah, your Lord, so worship Him. Oh, will ye not remind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, your Lord is God who created the heavens and the earth in six days [periods], then He ascended the Throne, disposing the whole affair. No one may intercede with Him save with His permission. Such is God, your Lord, so worship Him alone. Will you not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily your Lord is Allah who hath created the heavens and the earth in six days, then established Himself on the Throne disposing the affair; no in tercessor is there, except after His leave. That is Allah, your Lord; so worship Him. Would ye then not be admonished!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord is Allah, who created the heavens and the earth in six days, and then settled on the Throne, directing the command. There is no intercessor, except by His leave. That is Allah, your Lord! So worship Him. Will you not then take admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily your Lord is Allah, who created the heavens and the earth in six days, and is firmly established on the throne (of authority), regulating and governing all things. No intercessor (can plead with Him) except after His leave (hath been obtained). This is Allah your Lord; Him therefore serve ye: will ye not receive admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, your Lord is Allah Who created the heavens and the earth in six Days and then Istawa (rose over) the Throne (really in a manner that suits His Majesty), disposing the affair of all things. No intercessor (can plead with Him) except after His Leave. That is Allah, your Lord; so worship Him (Alone). Then, will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your Lord is Allah, who, in six days created the heavens and the earth and then willed to the Throne, directing affairs. There is no intercessor except by His permission. Such is Allah your Lord, therefore worship Him. Will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is God, who created the heavens and the earth in six days, then settled over the Throne, governing all things. There is no intercessor except after His permission. Such is God, your Lord—so serve Him. Will you not reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your Lord is Allah, who created the heavens and the earth in six days and then established Himself above the Throne, arranging the matter [of His creation]. There is no intercessor except after His permission. That is Allah, your Lord, so worship Him. Then will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:3] Truly your Lord is God Who created the heavens and the earth in six days, of the days of this world, that is,   in the same measure [of time], since there was no sun or moon then: had He willed He could have created them in an instant, but the reason for His not having done so is that He wanted to teach His creatures to be circumspect; then He presided upon the Throne, a presiding befitting of Him, directing affairs, among creatures. There is no (mā min indicates a relative clause) intercessor, to intercede for anyone, save after His permission: a refutation of their saying, ‘The idols intercede for us!’; that, Creator and Director, is God, your Lord, so worship Him, affirm His Oneness. Will you not remember? (tadhakkarūna: the original tā’ [of tatadhakkarūna] has been assimilated with the dhāl).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! your Lord is Allah Who created the heavens and the earth in six days) of the days of the life of this world at its beginning. The first day is Sunday and the last is Friday, and each day the equivalent of one thousand years, (then He established Himself upon the Throne) it is also said that this means: the Throne was filled by Him, (directing all things) directing the matters of His servants; it is also said that this means: He looks into the affairs of the servants; and it is also said that this means: He sends the angels with revelations and misfortunes. (There is no intercessor (with Him)) no close angel and no sent prophet will intercede for anyone (save after His permission) save after Allah's leave. (That is Allah, your Lord) it is your Lord Who does thus, (so worship Him) profess His divine Oneness. (Oh, will ye not remind?) will you not take heed?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يعارضون مع رسوله والكتاب المنزل من عنده سبحانه؟! { إِنَّ رَبَّكُمُ } أيها المؤمنون { ٱللَّهُ ٱلَّذِي خَلَقَ } أي: قدر ببسط عكوس أسمائه، ومد أظلال أوصافه { ٱلسَّمَاوَاتِ } أي: العلويات التي هي الأعيان الثابتات { وَٱلأَرْضَ } أي: عالم الطبيعة القابلة للانعكاس منها { فِي سِتَّةِ أَيَّامٍ } أي: ستة جهات؛ إذ يتوهم الامتداد والأبعاد، والأقطار فيها { ثُمَّ ٱسْتَوَىٰ } بلا توهم التراخي والزمان والمهلة، على ما يقتضيه لفظه \" ثم \" ، \" بل \" بلا أين وكيف وكم؟\n\n\n\n\n{ عَلَى ٱلْعَرْشِ } المعروش المبسوط من انعكاس أسمائه وأوصافه { يُدَبِّرُ ٱلأَمْرَ } أي: الحوادث الكائنة بالاستقلال { مَا مِن شَفِيعٍ } من المظاهر والمصنوعات { إِلاَّ مِن بَعْدِ إِذْنِهِ } وإمضاء مشيئته، وإنفاذ قضائه { ذٰلِكُمُ ٱللَّهُ } أي: الموصوف المتفرد، المتوحد في ذاته بالألوهية، المستقل في آثاره وتدبيراته بالربوبية { رَبُّكُمْ } أي: مربيكم وموجودكم { فَٱعْبُدُوهُ } حق عبادته حتى تعرفوه حق معرفته { أَفَلاَ تَذَكَّرُونَ } [يونس: 3] وتتفكرون وحدة ذاته، وعظمة أسمائه وصفاته أيها العقلاء المجبولون على التفكر والتذاكر في آلاء الله ونعمائه؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { إن ربكم } الذي يستحق العبادة وحده هو { اللهُ } الذي أظهر الكائنات من العدم إلى الوجود، وبه رد على من أنكر النبوة، كأنه يقول: إنما أدعوكم إلى عبادة الله الذي خلق الأشياء، فكيف تنكرون ذلك وهو الحق المبين؟ ثم فصَّل ذلك فقال: { الذي خلق السماوات والأرض } التي هي أصول الكائنات، { في } مقدار { ستةِ أيام } من أيام الدنيا، ولم يكن حينئذٍ ليل ولا نهار، والجمهور: أن ابتداء الخلق يوم الأحد، وفي حديث مسلم: يوم السبت، وأنه خلق الأرض، ثم استوى إلى السماء فسواهن سبع سماوات، ثم دحا الأرض بعد ذلك\n { ثم استوى على العرش } استواء يليق به، كاستواء الملك على سريره ليُدير أمر مملكته، ولذلك رتب عليه: { يُدَبِّر الأمرَ } ، وقد تقدم الكلام عليه في الأعراف\n  قال البيضاوي: يُدبر أمر الكائنات على ما تقتضيه حكمته، وسبقت به كلمته، بتحريك أفلاكها، وتهيئ أسبابها، والتدبير: النظر في عواقب الأمور لتجيء محمودة العاقبة\n هـ\n { ما من شفيع } تُقبل شفاعته { إلا من بعد إِذْنِه } له في الشفاعة، وهو تقرير لعظمته وعزة جلاله، ورد على من يزعم أن آلهتهم تشفع لهم عند الله، وفيه إثبات الشفاعة لمن أذن له، كالأنبياء والعلماء الأتقياء\n { ذلكم الله } أي: الموصوف بتلك الصفات المقتضية للألوهية والربوبية هو { الله ربكم } لا غير إذ لا يشاركه أحد في شيء من ذلك، { فاعبدوه }: أفردوه بالعبادة { أفلا تذكرون } أي: تتفكرون أدنى تفكر، فتعرفون أنه المستحق للربوبية والعبادة، لا ما تعبدون من الأصنام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:4",
      "similarity": 0.8777066400484137
    },
    {
      "verse": "25:59",
      "similarity": 0.7413409176098051
    },
    {
      "verse": "11:7",
      "similarity": 0.6259010988659406
    },
    {
      "verse": "57:4",
      "similarity": 0.4839913989719472
    },
    {
      "verse": "58:4",
      "similarity": 0.3531721501940812
    }
  ]
}