{
  "chapter": "يونس",
  "text": "وما يتبع اكثرهم الا ظنا ان الظن لا يغنى من الحق شيـا ان الله عليمۢ بما يفعلون",
  "translations": [
    {
      "translation": "Most of them follow nothing but conjecture. Conjecture is of no use whatsoever against the truth. Allah",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of them follow nothing but illusion; yet illusion cannot replace the reality. God verily knows what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of them only follow conjectures; and surely conjecture can be no substitute for truth. Allah is well aware of whatever they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of the unbelievers follow only conjecture which certainly cannot serve as a substitute for the Truth. God knows well what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them do not follow anything except assumptions; indeed assumption does not serve the least purpose (in place) of the truth; indeed Allah knows their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them follow nothing but conjecture. Certainly, conjecture can be of no avail against the truth. Surely, Allah is All-Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them do not follow (anything) but conjecture; surely conjecture will not avail aught against the truth; surely Allah is cognizant of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the most of them follow only surmise, and surmise avails naught against truth. Surely God knows the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of them follow not but conjecture. Assuredly conjecture can by no means take the place of truth. Lo! Allah is Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of them follow nothing but mere conjecture. But conjecture is of no use against the Truth. God is well aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them follow naught but an opinion; verily opinion availeth not against the truth; verily Allah is the Knower of that which they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of them just follow conjecture; indeed conjecture is no substitute for the truth. Indeed Allah knows best what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But most of them follow nothing but fancy: truly fancy can be of no avail against truth. Verily Allah is well aware of all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them follow nothing but conjecture. Certainly, conjecture can be of no avail against the truth. Surely, Allah is All-Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of them follow nothing except conjecture. But conjecture does not help against the truth. Allah knows the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of them follow nothing but assumptions; and assumptions avail nothing against the truth. God is fully aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them follow not except assumption. Indeed, assumption avails not against the truth at all. Indeed, Allah is Knowing of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:36] And most of them, in worshipping idols, follow nothing but conjecture, since they imitate their fathers therein; truly conjecture avails nothing against truth, when what is sought is knowledge. Surely God is Knower of what they do, and will requite them for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Most of them follow) worship (naught but conjecture) i.e. except through conjecture. (Assuredly conjecture) their worship through conjecture (can by no means take the place of truth) can by no means dispense them from Allah's chastisement. (Lo! Allah is Aware of what they do) in their state of idolatry, in terms of worshipping idols, and other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { مَا يَتَّبِعُ أَكْثَرُهُمْ } أي: أكثر المشركين في إشراك هؤلاء المنحطين عن درجة الاعتبار مع الله المنزه عن الشريك مطلقاً { إِلاَّ ظَنّاً } وتخميناً ناشئاً من تخيلات فسادة\n وتوهمات كاسدة من إنشاء الآثار إلى ظواهر الأسباب\n مع الغفلة عن المسبب الموجد لها\n و { إِنَّ ٱلظَّنَّ } والتخمين الذي تشبثوا وتمسكوا به { لاَ يُغْنِي } ولا يفيد { مِنَ ٱلْحَقِّ } الصريح الذي هو مناط الإيمان والاعتقاد { شَيْئاً } من الإغناء { إِنَّ ٱللَّهَ } المطلع لجميع مخايلهم { عَلَيمٌ } خبير بصير { بِمَا يَفْعَلُونَ } [يونس: 36] على مقتضى ظنونهم وخيالاتهم وأوهامهم\n فيجازيهم على مقتضى علمه وخبرته\n\n\nوبعدما نبه سبحانه على بطلان اعتقاداتهم وظنونهم وجهالاتهم\n أراد أن ينبه أن مستند أهل الإيمان الذي هو القرآن الموضح لهم طريق التوحيد والعرفان ليس كذلك\n فقال: { وَمَا كَانَ هَـٰذَا ٱلْقُرْآنُ } المنزل على خير الأنام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { وما يتبع } أكثر المشركين في اعتقادهم { إلا ظَنّاً } مستنداً إلى خيالات فارغة وأقيسة فاسدة، كقياس الغائب على الشاهد، والخالق على المخلوق، بأدنى مشاركة موهوبة. والمراد بالأكثر الجميع، أو من ينتسب منهم إلى تمييز ونظر، ولم يرضى بالتقليد الصرف، { إن الظن لا يغنى من الحق } من علم التحقيق { شيئاً } ، أو { من } الاعتقاد { الحق شيئاً } من الإغناء. قال البيضاوي: وفيه دليل على أن تحصيل العلم في الأصول واجب، وأن الاكتفاء بالتقليد والظن غير جائز. هـ. وعدم الاكتفاء بالظن إنما هو في الأصول، وأما الفروع فالظن فيها كاف. { إن الله عليم بما يفعلون } هذا وعيد لهم على اتباعهم الظن، وإعراضهم عن النظر والاستدلال، وعلى عدم اتباعهم من يدلهم على الحق. والله تعالى أعلم.  الإشارة: الناس على قسمين: أهل تصديق وإيمان، وأهل شهود وعيان. فأهل التصديق والإيمان هم عامة أهل اليمين، وهم أكثر المسلمين من العلماء الصالحين، يستندون في معرفتهم بالله إلى الدليل والبرهان، فتارة يقوى عندهم الدليل فيترقَّون عن اتباع الظن إلى الجزم والتصميم، وتارة يضعف فيرجعون إلى اتباع الظن الراجح.  وأما أهل الشهود والعيان، فقد غابت عنهم الأكوان في شهود المكوّن، فصاروا يستدلون بالله على وجود غيره، فلا يجدونه، حتى قال بعضهم: لو كُلفت أن أرى غيره لم أستطع فإنه لا غير معه حتى اشهده، محال أن تشهده وتشهد معه سواه. وقال شاعرهم:\nوقال آخر:\nوقال في الحكم: \" شتان بين من يستدل به أو يستدل عليه، المستدل به عرف الحق لأهله، فأثبت الأمر من وجود أصله، والاستدلال عليه من عدم الوصول إليه، وإلا... فمتى غاب حتى يستدل عليه، ومتى بَعُدَ حتى تكون الآثار هي التي توصل إليه! \". ولا مطمع لأحد في التطهير من الظنون والأوهام إلا بصحبة شيخ كامل عارف بالله، فيلقي إليه نفسه، فلا يزال يسير به، حتى يقول له: ها أنت وربك، فحينئذٍ ترتفع عنه الشكوك والظنون والأوهام، ويبلغ في مشاهدة الحق إلى عين اليقين وحق اليقين. وأما قول الجنيد رضي الله عنه: أدركت سبعين صديقاً، كلهم يعبدون الله على الظن والوهم، حتى الشيخ أبا يزيد، ولو أدرك صبياً من صبياننا لأسلم على يديه. فقال الشيخ أبو العباس المرسي رضي الله عنه: معنى كلامه: أنهم ظنوا وتوهموا أنهم بلغوا إلى مقام النهاية، بحيث لا مقام فوق ذلك، ولو أدرك أحدهُم صبيَّاً لنبههم على أن ما فاتهم أكثر مما أدركوا ولانقادوا له. هـ. بالمعنى. والله تعالى أعلم. ولما ذكر أن اتباع الظن غير كاف، ذكر ما يجب اتباعه وهو القرآن، فقال: { وَمَا كَانَ هَـٰذَا ٱلْقُرْآنُ أَن يُفْتَرَىٰ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:28",
      "similarity": 0.8558127949817234
    },
    {
      "verse": "37:87",
      "similarity": 0.4577295555203789
    },
    {
      "verse": "26:186",
      "similarity": 0.39451210177535184
    },
    {
      "verse": "75:28",
      "similarity": 0.35684275591030346
    },
    {
      "verse": "69:20",
      "similarity": 0.35050405478180485
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/10:36.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/10:36.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}