{
  "chapter": "يونس",
  "text": "قل هل من شركائكم من يهدى الى الحق قل الله يهدى للحق افمن يهدى الى الحق احق ان يتبع امن لا يهدى الا ان يهدى فما لكم كيف تحكمون",
  "translations": [
    {
      "translation": "Say: 'Can any of your partner-gods guide to the truth?' Say: 'Allah guides to the truth. Who has more right to be followed - He who guides to the truth, or he who cannot guide unless he is guided? What is the matter with you? How do you reach your judgement?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask: \"Is there one among those you associate with God who can show the way to the truth?\" Say: \"It is God who shows the way to truth.\" Then who is more worthy of being followed -- He who guides to the truth, or he who cannot find the path until shown the way? What has happened to you that you judge in such a wise?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: 'Are there among ones whom you associate with Allah in His divinity those who can guide to the truth? Say: 'It is Allah alone Who guides to the truth.' Then, who is more worthy to be followed - He Who guides to the truth, or he who cannot find the right way unless others guide him to it? What is wrong with you? How ill do you judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Can any of your idols guide you to the Truth?\" Say, \"Only God guides to the Truth.\" Is the one who guides to the Truth a proper guide or one who himself cannot find guidance unless he is guided (by others)? What is wrong with you that you judge (so unjustly)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Is there any among your partners that shows the right path?” Say, “Allah shows the right path; so who should be obeyed – the One Who shows the right path, or one who does not even find the right path unless he is guided? So what has happened to you? What sort of a judgement you impose!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Is there of your partners one that guides to the truth\" Say: \"It is Allah Who guides to the truth. Is then He Who guides to the truth more worthy to be followed, or he who finds not guidance (himself) unless he is guided Then, what is the matter with you How judge you\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Is there any of your associates who guides to the truth? Say: Allah guides to the truth. Is He then Who guides to the truth more worthy to be followed, or he who himself does not go aright unless he is guided? What then is the matter with you; how do you judge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Is there any of your associates who guides to the truth?' Say: 'God -- He guides to the truth; and which is worthier to be followed -- He who guides to the truth, or he who guides not unless he is guided? What then ails you, how you judge?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Is there of your partners (whom ye ascribe unto Allah) one that leadeth to the Truth? Say: Allah leadeth to the Truth. Is He Who leadeth to the Truth more deserving that He should be followed, or he who findeth not the way unless he (himself) be guided. What aileth you? How judge ye?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Does any of your partner-gods guide one to the Truth?\" Say, \"It is God who guides to the truth. Then, is He who guides to the truth more worthy to be followed or one who cannot find the way himself unless he be guided? What is the matter with you? How ill you judge!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: is there any of your associate-gods who guideth you to the truth! Say thou: Allah guideth unto the truth. Is He, then, who guideth to the truth more worthy to be followed, or one who findeth not the guidance unless he is guided. What aileth ye then? How ill ye judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Is there anyone among your partners who may guide to the truth?’ Say, ‘Allah guides to the truth. Is He who guides to the truth worthier to be followed, or he who is not guided unless shown the way? What is the matter with you? How do you judge?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Of your 'partners' is there any that can give any guidance towards truth?\" Say: \"It is Allah Who gives guidance towards truth, is then He Who gives guidance to truth more worthy to be followed, or he who finds not guidance (himself) unless he is guided? what then is the matter with you? How judge ye?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Is there of your (Allah's so-called) partners one that guides to the truth?\" Say: \"It is Allah Who guides to the truth. Is then He, Who gives guidance to the truth, more worthy to be followed, or he who finds not guidance (himself) unless he is guided? Then, what is the matter with you? How judge you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Do any of your partners guide you to the truth' Say: 'Allah, He guides to the truth. Who then is worthier to be followed He who guides to the truth or he who cannot guide unless he (himself) is guided? What is the matter with you, how then can you judge'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Can any of your partners guide to the truth?” Say, “God guides to the truth. Is He who guides to the truth more worthy of being followed, or he who does not guide, unless he himself is guided? What is the matter with you? How do you judge?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Are there of your 'partners' any who guides to the truth?\" Say, \"Allah guides to the truth. So is He who guides to the truth more worthy to be followed or he who guides not unless he is guided? Then what is [wrong] with you - how do you judge?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:35] Say: ‘Is there of those whom you associate [with God] one that guides to the truth?’, by [means of] setting up [definitive] arguments and creating guidance. Say: ‘God guides to the truth; is One Who guides to the truth — and this is God — more deserving of being followed, or one who does not guide, [one who] is not [himself] guided, unless he is guided?, more deserving of being followed? (the interrogative is meant as an affirmation and a rebuke, in other words, the former is more deserving). So what is wrong with you, how do you judge?’, [how do you make] this corrupt judgement, one where what does not deserve to be followed is followed?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا تكرير آخر بعد قوله : { قل هل من شركائكم من يَبدأ الخلق ثم يعيده } \\[ يونس : 34 \\]. وهذا استدلال بنقصان آلهتهم عن الإرشاد إلى الكمال النفساني بنشر الحق ، وبأن الله تعالى هو الهادي إلى الكمال والحق ، ومجموع الجملتين مفيد قَصْر صفة الهداية إلى الحق على الله تعالى دون آلهتهم قصرَ إفراد ، كما تقدم في نظيره آنفاً . ومعلوم أن منة الهداية إلى الحق أعظم المنن لأن بها صلاح المجتمع وسلامة أفراده من اعتداء قويّهم على ضعيفهم ، ولولا الهداية لكانت نعمة الإيجاد مختلة في مضمحلة .والمراد بالحق الدين ، وهو الأعمال الصالحة ، وأصوله وهي الاعتقاد الصحيح .وقد أتبع الاستدلال على كمال الخالق ببدء الخلق وإعادته بالاستدلال على كماله بالهداية كما في قول إبراهيم عليه السلام { الذي خلقني فهو يهدين } \\[ الشعراء : 78 \\] وقول موسى عليه السلام { ربّنا الذي أعطى كل شيء خلقه ثم هَدى } \\[ طه : 50 \\] وقوله تعالى : { سبح اسم ربك الأعلى الذي خلق فسوى والذي قدّر فهدى } \\[ الأعلى : 1 3 \\]. وذلك أن الإنسان الذي هو أكمل ما على الأرض مركب من جسد وروح ، فالاستدلال على وجود الخالق وكماله بإيجاد الأجساد وما فيها هو الخلق ، والاستدلال عليه بنظام أحوال الأرواح وصلاحها هو الهداية .وقوله : { أفمن يهدي إلى الحق أحق من يتبع } إلى آخره تفريع استفهام تقريري على ما أفادته الجملتان السابقتان من قصر الهداية إلى الحق على الله تعالى دون آلهتهم . وهذا مما لا ينبغي أن يختلف فيه أهل العقول بأن الذي يهدي إلى الحق يوصل إلى الكمال الروحاني وهو الكمال الباقي إلى الأبد وهو الكون المصون عن الفساد فإن خلق الأجساد مقصود لأجل الأرواح ، والأرواح مراد منها الاهتداء ، فالمقصود الأعلى هو الهداية . وإذ قد كانت العقول عرضة للاضطراب والخطأ احتاجت النفوس إلى هدي يتلقى من الجانب المعصوم عن الخطإ وهو جانب الله تعالى ، فلذلك كان الذي يهدي إلى الحق أحق أن يتبع لأنه مصلح النفوس ومصلح نظام العالم البشري ، فاتباعه واجب عقلاً واتباع غيره لا مصحح له ، إذ لا غاية ترجى من اتباعه . وأفعال العقلاء تصان عن العبث .وقوله : { أمّن لا يَهدّي إلا أن يُهدى } أي الذي لا يهتدي فضلاً عن أن يَهدي غيره ، أي لا يقبل الهداية فكيف يهدي غيره فلا يحق له أن يتبع .والمراد ب { من لا يهدي } الأصنام فإنها لا تهتدي إلى شيء ، كما قال إبراهيم { يا أبتتِ لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئاً } \\[ مريم : 42 \\].وقد اختلف القراء في قوله : { أمَّن لا يَهدي } فقرأ نافع ، وابن كثير ، وابن عامر ، وأبو عمرو بفتح التحتية وفتح الهاء على أن أصله يهتدي ، أبدلت التاء دالاً لتقارب مخرجيهما وأدغمت في الدال ونقلت حركة التاء إلى الهاء الساكنة ( ولا أهمية إلى قراءة قالون عن نافع إلى قراءة أبي عمرو بجعل فتح الهاء مختلساً بين الفتح والسكون لأن ذلك من وجوه الأداء فلا يعد خلافاً في القراءة ).وقرأ حفص عن عاصم ، ويعقوبُ بفتح الياء وكسر الهاء وتشديد الدال على اعتبار طرح حركة التاء المدغمة واختلاف كسرة على الهاء على أصل التخلص من التقاء الساكنين . وقرأ أبو بكر عن عاصم بكسر الباء وكسر الهاء بإتباع كسرة الياء لكسرة الهاء . وقرأ حمزة والكسائي وخلف بفتح الياء وسكون الهاء وتخفيف الدال على أنه مضارع هَدَى القاصر بمعنى اهتدى ، كما يقال : شَرى بمعنى اشترى .والاستثناء في قوله : { إلا أن يُهدى } تهكم من تأكيد الشيء بما يشبه ضده . وأريد بالهَدْي النقل من موضع إلى موضع أي لا تهتدي إلى مكان إلا إذا نقلها الناس ووضعوها في المكان الذي يريدونه لها ، فيكون النقل من مكان إلى آخر شبه بالسير فشبه المنقول بالسائر على طريقة المكنية ، ورُمز إلى ذلك بما هو من لوازم السير وهو الهداية في { لا يهدي إلا أن يهدى }.وجوز بعض المفسرين أن يكون فعل { إلا أن يهدى } بمعنى إهداء العروس ، أي نقلها من بيت أهلها إلى بيت زوجها ، فيقال : هديت إلى زوجها .وجملة : { فمالكم كيف تحكمون } تفريع استفهام تعجيبي على اتباعهم من لا يهتدي بحال . واتباعهم هو عبادتهم إياهم .ف { ما } استفهامية مبتدأ ، و { لكم } خبر ، واللام للاختصاص . والمعنى : أي شيء ثبت لكم فاتبعتم من لا يهتدي بنفسه نقلاً من مكان إلى مكان .وقوله العرب : مالك؟ ونحوه استفهام يعامل معاملة الاستفهام في حقيقته ومجازه . وفي الحديث أن رجلاً قال للنبيء صلى الله عليه وسلم دُلني على عمل يُدخلني الجنة ، فقال الناس : «مَا لَه مَا لَه» فقال رسول الله صلى الله عليه وسلم \" أرَبٌ مَّا له \" . فإذا كان المستفهم عنه حالاً ظاهرة لم يحتج إلى ذكر شيء بعد ( مَا له ) كما وقع في الحديث .وجعل الزجاج هذه الآية منه فقال : { ما لكم } : كلام تام ، أي أي شيء لكم في عبادة الأوثان .قال ابن عطية : ووقف القراء { فما لكم } ثم يبدأ { كيف تحكمون }.وإذا كان بخلاف ذلك أتبعوا الاستفهام بحال وهو الغالب كقوله تعالى : { ما لكم لا تناصرون } \\[ الصافات : 25 \\] { فما لهم عن التذكرة معرضين } \\[ المدثر : 49 \\] ولذلك قال بعض النحاة : مثل هذا الكلام لا يتم بدون ذكر حال بعده ، فالخلاف بين كلامهم وكلام الزجاج لفظي .وجملة : { كيف تحكمون } استفهام يتنزل منزلة البيان لما في جملة : { ما لكم } من الإجمال ولذلك فصلت عنها فهو مثله استفهام تعجيبي من حكمهم الضال إذ حكموا بإلهية من لا يهتدي فهو تعجيب على تعجيب . ولك أن تجعل هذه الجملة دليلاً على حال محذوفة .\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Is there of your partners) is there of your idols ((whom ye ascribe unto Allah) one that leadeth to the Truth) and guidance? If they answer, fine, if not, (Say: Allah leadeth to the Truth) and guidance. (Is He Who leadeth to the Truth) and guidance (more deserving that He should be followed) worshipped and obeyed, (or he who findeth not the way) he who does not guide to the Truth or guidance (unless he (himself) be guided) carried and taken wherever one wants. (What aileth you? How judge ye) evil is that which you judge for yourselves?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مث عزير وعيسى { فَمَا } عرض ولحق { لَكُمْ } أيها العقلاء\n والمعزولون عن مقتضى العقل { كَيْفَ تَحْكُمُونَ } [يونس: 35] بألوهيتهم وشركتهم\n مع أن بديهة العقل يأبى عن ذلك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فأولى ألا يهدي غيره { إِلا أن يُهدى }؟ أي: إلا أن يهديه غيره\n وهي معبوداتهم\n كالملائكة والمسيح وعزير\n فلا يستطيعون أن يهدوا أنفسهم إلا أن يهديهم الله\n وحمل ابن عطية الآية على الأصنام\n وقال: معنى قوله: { أمن لا يهدي إلا أن يهدى } هي عبارة عن أنها لا تنتقِل إلا أن تنقلَ\n قال: ويحتمل أن يكون ما ذكره الله من تسبيح الجمادات هو اهتداؤه\n ويحتمل أن يكون الاستثناء في اهتدائها إشارة إلى مناكرة الكفار يوم القيامة حسبما مضى في هذه السورة\n هـ\n { فما لكم كيف تحكمون } أي: أيُّ شيء حصل لعقولكم\n فكيف تحكمون بشيء يقتضي العقل بطلانه بأدنى تفكر؟\n  اِلإشارة: في الآية تحريض على رفع عن السِّوى\n إلى من بيده البدء والإعادة\n والإرشاد والهداية\n إلا من جعل على يديه الإرشاد والهداية\n وهم الأنبياء والأولياء والعلماء الأتقياء\n فالخضوع إليهم خضوع إلى الله على الحقيقة\n واتباعهم اتباع لله على الحقيقة\n وكل من تبع غيرهم فإنما يتبع الظن والهوى دون الحق\n كما أبان ذلك بقوله تعالى: { وَمَا يَتَّبِعُ أَكْثَرُهُمْ إِلاَّ ظَنّاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:154",
      "similarity": 0.4224811271958572
    },
    {
      "verse": "68:36",
      "similarity": 0.4224811271958572
    },
    {
      "verse": "3:86",
      "similarity": 0.3716893203449945
    },
    {
      "verse": "68:41",
      "similarity": 0.3358465912187163
    },
    {
      "verse": "6:81",
      "similarity": 0.3351498788289128
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010035.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010035.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}