{
  "chapter": "يونس",
  "text": "وما كان هذا القرءان ان يفترى من دون الله ولكن تصديق الذى بين يديه وتفصيل الكتب لا ريب فيه من رب العلمين",
  "translations": [
    {
      "translation": "This Qur'an could never have been devised by any besides Allah. Rather it is confirmation of what came before it and an elucidation of the Book which contains no doubt from the Lord of all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Qur'an is not such (a writ) as could be composed by anyone but God. It confirms what has been revealed before, and is an exposition of (Heaven's) law. Without any doubt it's from the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Qur'an is such that it could not be composed by any unless it be revealed from Allah. It is a confirmation of the revelation made before it and a detailed exposition of the Book. Beyond doubt it is from the Lord of the universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one could have composed this Quran besides God. This confirms the existing Book (the Bible) and explains itself. There is no doubt that it is from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this noble Qur’an is not such that anyone can invent it, without Allah revealing it – but it surely is a confirmation of the Books preceding it and is an explanation of all that is written on the (preserved) tablet – there is no doubt in it – it is from the Lord Of The Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Qur'an is not such as could ever be produced by other than Allah but it is a confirmation of (the revelation) which was before it, and a full explanation of the Book -- wherein there is no doubt -- from the Lord of all that exists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Quran is not such as could be forged by those besides Allah, but it is a verification of that which is before it and a clear explanation of the book, there is no doubt in it, from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Koran could not have been forged apart from God; but it is a confirmation of what is before it, and a distinguishing of the Book, wherein is no doubt, from the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Qur'an is not such as could ever be invented in despite of Allah; but it is a confirmation of that which was before it and an exposition of that which is decreed for mankind - Therein is no doubt - from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran is not such as could have been produced by anyone but God. It fulfills that [the predictions] which came before it and gives a fuller explanation of the [earlier] Revelations. There is no doubt about it: it is from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Qur'an is not such as could be fabricated as against Allah. But it is a confirmation of that a which is before it, and and a d etailing of the Decree, whereof there is no doubt, from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran could not have been fabricated by anyone besides Allah; rather, it is a confirmation of what was [revealed] before it, and an elaboration of the Book, there is no doubt in it, from the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Qur'an is not such as can be produced by other than Allah; on the contrary it is a confirmation of (revelations) that went before it, and a fuller explanation of the Book - wherein there is no doubt - from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this Quran is not such as could ever be produced by other than Allah (Lord of the heavens and the earth), but it is a confirmation of (the revelation) which was before it [i.e. the Taurat (Torah), and the Injeel (Gospel), etc.], and a full explanation of the Book (i.e. laws and orders, etc, decreed for mankind) - wherein there is no doubt from the the Lord of the 'Alamin (mankind, jinns, and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Koran could not have been forged by other than Allah. It confirms what was before it; a distinguishing Book, in which there is no doubt, from the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran could not have been produced by anyone other than God. In fact, it is a confirmation of what preceded it, and an elaboration of the Book. There is no doubt about it—it is from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was not [possible] for this Qur'an to be produced by other than Allah, but [it is] a confirmation of what was before it and a detailed explanation of the [former] Scripture, about which there is no doubt, from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:37] And this Qur’ān is not such as could ever be produced, that is, [it could not be] a fabrication, [by anyone] besides God; but it is, revealed [as], a confirmation of what is before it, of Scriptures, and a detailing of the Book, a exposition of the rulings and other matters which God has prescribed — wherein is no doubt, no uncertainty — from the Lord of the Worlds (min rabbi’l-‘ālamīn is semantically connected to tasdīqa, ‘a confirmation’, or to an omitted unzila, ‘revealed’; a variant reading [for accusative tasdīqa] has the nominative tasdīqu and nominative tafsīlu, ‘a detailing’, [for the accusative tafsīla] by [reading] an implied huwa, ‘it is’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And this Qur'an) which is recited to you by Muhammad (pbuh) (is not such as could ever be invented in despite of Allah; but it is a confirmation of that which was before it) it is a confirmation of the Torah, the Gospel, the Psalms and all other Scriptures in that they all call to the profession of divine Oneness and contain the traits and description of Muhammad (pbuh) (and an exposition of that which is decreed for mankind) the Qur'an exposits the lawful and the prohibited, the commands and prohibitions. (Therein is no doubt from the Lord of the Worlds) from the Master of all worlds.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما كان هذا القرآن } اختلاقاً { من دون الله ولكن تصديق الذي بين يديه } من اللوح المحفوظ { وتفصيل الكتاب } الذي هو الأمّ له كقوله تعالى:\n[الزخرف\n الآية: 4] أي: كيف يكون مختلقاً وقد أثبت قبله في كتابين من علم مفصلاً كما هو في اللوح المحفوظ ومجملاً في أمّ الكتاب الذي هذا تفصيله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المبين لهم قواعد دين الإسلام { أَن يُفْتَرَىٰ } ويخيل أنه صدر { مِن دُونِ ٱللَّهِ } العليم الحكيم\n وكيف يصدر هذا من غير الله\n إذ هو في أعلى مراتب البلاغة\n ونهاية درجات الإعجاز\n! لصدوره عن الحكمة المتقنة الإلهية التي كلت الأفهام دونها\n وعجزت المدارك والآلات عن دركها\n فلا يتوهم صدوره عن غير الله أصلاً { وَلَـٰكِن تَصْدِيقَ ٱلَّذِي بَيْنَ يَدَيْهِ } مطابقاً\n كما نزل من عنده في الكتب السالفة\n بل هو أعلى حكمة\n وأتم به فائدة منها { وَتَفْصِيلَ ٱلْكِتَابِ } الذي من عمله ولوحه قضائه\n وبالجملة: { لاَ رَيْبَ فِيهِ } أنه نازل { مِن رَّبِّ ٱلْعَالَمِينَ } [يونس: 37] ليس في وسع بشر أن يأتي بمثله\n\n\nأيشكون نزوله على رسول الله صلى الله عليه وسلم { أَمْ يَقُولُونَ ٱفْتَرَاهُ } واخترعه من عنده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" تصديق \": مصدر\n والعامل فيه \" كان \" محذوفة\n أو \" أنزل \" \n و \" لا ريب \": خبر ثالث لها\n و \" من رب العالمين \": خبر آخر\n أي: كائناً من رب العالمين\n أو متعلق بتصديق أو بتفصيل\n و \" لا ريب \": اعتراض\n أو بالفعل المعلل بهما ـ وهو \" نزل \" ـ ويجوز أن يكون حالاً من \" الكتاب \" \n أو من الضمير في \" فيه \" \n: و \" أم \": منقطعة بمعنى بل مع الاستفهام الإنكاري\n و \" كيف \" خبر كان\n يقول الحق جل جلاله: { وما كان هذا القرآنُ أن يفترى من دون الله } أي: صح له أن يفترى من الخلق\n إذ لا قدرة له على ذلك\n { ولكن } كان { تصديقَ الذي بين يديه } من الكتب\n أو: ولكن أنزله تصديقاً لما سلف قبله من الكتب الإلهية\n المشهود على صدقها لأنه مطابق لها\n فلا يكون كذباً\n كيف وهو لكونه معجزاً عيار عليها\n شاهد على صحتها؟ { وتفصيلَ الكتاب } أي: وأنزله تفصيلَ ما حقق وأثبت من العقائد والشرائع\n التي تضمنها الكتاب\n { لا ريبَ فيه }: لا ينبغي أن يرتاب فيه لما احتفّت به من شواهد الحق\n وارتياب الكفار فيه كلا ريب\n كائناً { من رب العالمين } \n أول نزل منه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:2",
      "similarity": 0.42550593317497903
    },
    {
      "verse": "2:2",
      "similarity": 0.39800510517923854
    },
    {
      "verse": "45:26",
      "similarity": 0.37920445962558247
    },
    {
      "verse": "41:3",
      "similarity": 0.37143444023924804
    },
    {
      "verse": "40:59",
      "similarity": 0.37094999931000106
    }
  ]
}