{
  "chapter": "يونس",
  "text": "اليه مرجعكم جميعا وعد الله حقا انه يبدؤا۟ الخلق ثم يعيده ليجزى الذين ءامنوا۟ وعملوا۟ الصلحت بالقسط والذين كفروا۟ لهم شراب من حميم وعذاب اليمۢ بما كانوا۟ يكفرون",
  "translations": [
    {
      "translation": "Each and every one of you will return to Him. Allah's promise is true. He brings creation out of nothing and then regenerates it so that he can repay with justice those who had iman and did right actions. Those who were kafir will have a drink of scalding water and a painful punishment because of their kufr.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him will you all return: God's promise is true. It is He who originates creation, then will revert it, so that He may reward those who believe and do good things in all justice. But those who deny the truth will receive boiling water to drink and grievous punishment, for they disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is your return. This is Allah's promise that will certainly come true. Surely it is He Who brings about the creation of all and He will repeat it so that He may justly reward those who believe and do righteous deeds; and that those who disbelieve may have a draught of boiling water and suffer a painful chastisement for their denying the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, you will all return to God. The promise of God is true; He creates all things and (after their death) brings them to life again so that He may justly reward the righteously striving believers. The disbelievers will drink boiling filthy water and suffer painful torment as a recompense for their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Towards Him only you all are to return; the promise of Allah; indeed He creates for the first time and then after its extinction creates it again, in order to give those who believe and do good deeds, the reward of justice; and for the disbelievers, boiling water to drink and a painful punishment – the recompense of their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is the return of all of you. The promise of Allah is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is your return, of all (of you); the promise of Allah (made) in truth; surely He begins the creation in the first instance, then He reproduces it, that He may with justice recompense those who believe and do good; and (as for) those who disbelieve, they shall have a drink of hot water and painful punishment because they disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him shall you return, all together -- God's promise, in truth. He originates creation, then He brings it back again that He may recompense those who believe and do deeds of righteousness, justly. And those who disbelieve -- for them awaits a draught of boiling water, and a painful chastisement, for their disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him is the return of all of you; it is a promise of Allah in truth. Lo! He produceth creation, then reproduceth it, that He may reward those who believe and do good works with equity; while, as for those who disbelieve, theirs will be a boiling drink and painful doom because they disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him you shall all return. God's promise is true; He originates Creation, then He restores it, so that He may reward with justice those who believe and do good works. Those who have denied the truth shall have boiling water to drink, and a painful punishment, because of their denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him is the return of you all--the promise of Allah is truth. Verily He beginneth the creation, then He shall repeat it, that he may recompense those who believed and did righteous works with equity. And those who disbelieved -- for them shall be draught of boiling water and a torment afflictive for they were wont to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him will be the return of you all; [that is] Allah’s true promise. Indeed, He originates the creation, then He will bring it back that He may reward with justice those who have faith and do righteous deeds. As for the faithless, they shall have boiling water for drink, and a painful punishment because of what they used to defy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him will be your return- of all of you. The promise of Allah is true and sure. It is He Who beginneth the process of creation, and repeateth it, that He may reward with justice those who believe and work righteousness; but those who reject Him will have draughts of boiling fluids, and a penalty grievous, because they did reject Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is the return of all of you. The Promise of Allah is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed (in the Oneness of Allah - Islamic Monotheism) and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him all of you will return together. This is, in truth, the promise of Allah. He originates creation, then He revives it so that He may recompense those who believe and do righteous deeds. As for the unbelievers, theirs is a drink of boiling water and a painful punishment for their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is your return, altogether. The promise of God is true. He originates creation, and then He repeats it, to reward those who believe and do good deeds with equity. As for those who disbelieve, for them is a drink of boiling water, and agonizing torment, on account of their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is your return all together. [It is] the promise of Allah [which is] truth. Indeed, He begins the [process of] creation and then repeats it that He may reward those who have believed and done righteous deeds, in justice. But those who disbelieved will have a drink of scalding water and a painful punishment for what they used to deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:4] To Him, exalted be He, is the return of all of you: God’s promise, in truth (both [wa‘da and haqqan] are verbal nouns, and in the accusative because of the verbs implicit in them). Truly He (read innahu as a new sentence, or annahu with an implied lām [sc. li-annahu, ‘Because He’] originates creation, that is, He began it by originating [it], then recreates it, through resurrection, that He may requite, reward, those who believe and perform righteous deeds, justly. And those who disbelieve, for them will be a draught of boiling water and a painful chastisement because they disbelieved.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Him is the return of all of you) after death; (it is a promise of Allah in truth) this is the Truth which will surely take place. (Lo! He produceth creation) from a sperm drop, (then reproduces it) after death, (that He may reward those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) between themselves and their Lord (with equity) with justice: [i.e. they will earn as a reward] Paradise; (while, as for those who disbelieve) in Muhammad (pbuh) and in the Qur'an, (theirs will be a boiling drink and painful doom) whose pain will reach to their hearts (because they disbelieved) in Muhammad (pbuh) and in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَهُمْ شَرَابٌ مِّنْ حَمِيمٍ } فالحَميمُ: الحَارُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"For them is a drink of boiling water\" - the boiling water being hot.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا تتفكرون آلاءه؛ إذ { إِلَيْهِ } لا إلى غيره؛ إذ لا غير معه سبحانه في الوجود { مَرْجِعُكُمْ جَمِيعاً } كما وعدكم بقوله:\n\n[يونس: 23]،\n\n[الغاشية: 25]،\n\n[الأنبياء: 35] إلى غير ذلك من الآيات\n\n\n\n\n{ وَعْدَ ٱللَّهِ } الذي لا يخلف ميعاده أصلاً { حَقّاً } ثابتاً لازماً بلا تغيير وتبديل، وكيف لا يكون وعده حقاً؛ إذ هو قادر على جميع المقدورات والمرادات، ومن كمال قدرته { إِنَّهُ يَبْدَؤُاْ ٱلْخَلْقَ } ويظهره من العدم إظهاراً إبداعياً بلا سبق مادة ومدة، ثم يعدمه؛ إظهاراً لقدرته أيضاً { ثُمَّ يُعِيدُهُ } في النشأة الأخرى لإظهار أسرار تكليفاته التي كلف بها عباده في النشأة الأولى { لِيَجْزِيَ ٱلَّذِينَ آمَنُواْ } بتوحيده، وصدقوا رسله { وَعَمِلُواْ ٱلصَّالِحَاتِ } المأمورة من عنده بألسنة كتبه ورسله { بِٱلْقِسْطِ } والعدل القويم، وتفضل على من تفضل عنايته منه { وَٱلَّذِينَ كَفَرُواْ } بالله، وأشركوا له شيئاً من مظاهر { لَهُمْ } في يوم العرض والجزاء، بعدما يحاسبوا { شَرَابٌ مِّنْ حَمِيمٍ } بدل ما يتلذذون بالأشربة المحرمة في النشأة الأولى { وَعَذَابٌ أَلِيمٌ بِمَا كَانُواْ يَكْفُرُونَ } [يونس: 4] بالله، ويكذبون رسله؛ عناداً وإصراراً، وكيف يكفرون بالله أولئك الحمقى، العمي، الهالكون في تيه الغفلة الضلال، وظلمة الجهل وسوء الفعال؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { إليه مرجعكم } بالبعث { جميعاً } فيجازيكم على أعمالكم، ويعاقبكم على شرككم، { وعد الله حقاً }\n مصدر مؤكد لنفسه لأن قوله: { إليه مرجعكم } وعدٌ من الله\n { إنه يبدأ الخلق } بإظهاره في الدنيا { ثم يُعيده } بعد إهلاكه في الآخرة\n { ليجزي الذين آمنوا وعملوا الصالحات } ، تعليل للعودة وهي البعثة، وقوله: { بالقسط } أي: بالعدل بأن يعدل في جزائهم، فلا يظلم مثقال ذرة، أو بعدلهم وقيامهم على العمل في أمورهم، أو بإيمانهم لأنه العدل القويم، كما أن الشرك ظلم عظيم\n وهو الأوجه لمقابلة قوله: { والذين كفروا لهم شراب من حميم وعذاب أليم } بسبب كفرهم وشركهم ـ الذي هو الظلم العظيم ـ لكنه غيَّر النظم للمبالغة في استحقاقهم العذاب والتنْبيه على أن المقصود بالذات من الإبداء والإعادة هو الإثابة، وأما العقاب فإنما هو الواقع بالعرض، وأنه تعالى يتولى إثابة المؤمنين بما يليق بلطفه وكرمه، ولذلك لم يعينه، وأما عقاب الكفرة، فإنه إنما ساقه إليهم سوء اعتقادهم وشوم أفعالهم\n  والآية كالدليل لقوله: { إليه مرجعكم جميعاً } ، فإنَّه لمَّا كان المقصود من الإبداء والإعادة مجازاة الله المكلفين على أعمالهم، كان مرجع الجميع إليه لا محالة، ويؤيده قراءة من قرأ: \" أنه يبدأ \" بالفتح، أي: لأنه، ويجوز أن يكون منصوباً بما نصب \" وعد الله \"\n\n\nقاله البيضاوي\n الإشارة: تقدم بعض إشارة هذه الآية في الأعراف، وقال الورتجبي هنا: جعل العرش مرآة تجلي قدسه ومأوى أرواح أحبابه لقوله: { ثم استوى\n\n\n } الآية، ثم قال: ثم دعاهم إلى عبادته بعد معرفته بقوله: { فاعبدوه }\n وقال القشيري: { ذلكم الله ربكم } تعريف، وقوله: { فاعبدوه } تكليف، فحصولُ التعريف بتحقيقه، والوصولُ إلى ما وَرَدَ به التكليف بتوفيقه\n هـ\n وقال في قوله: { إليه مرجعكم جميعاً }: الرجوع يقتضي ابتداء، والأرواح قبل حصولها في الأشباح كان لها في مواطن التسبيح والتقديس إقامة، والغائب إذا رجع إلى وطنه من سفره فلقدومه أثر عند مُحبيِّه وذويه، وأنشدوا:\n\nوفي الإحياء: كل من نسي الله أنساه ـ لا محالة ـ نفسه، ونزل إلى رتبة البهائم، وترك الترقي إلى أُفق الملأ الأعلى، وخان في الأمانة التي أودعها له تعالى، وأنعم بها عليه، وكان كافراً لنعمته، ومتعرضاً لنقمته فإن البهيمة تتخلص بالموت، وأما هذا فعنده أمانة سترجعُ ـ لا محالة ـ إلى مُودعها، فإليه مرجع الأمانة ومصيرها، وتلك الأمانة كالشمس الزاهرة، وإنما هبطت إلى هذا القالب الفاني وغربت فيه، وستطلع هذه الشمس عند خراب هذا القالب من مغربها، وتعود إلى بارئها وخالقها، إما مظلمة مُنكسة، وإما زاهرة مشرقة، والزاهرة المشرقة غير محجوبة عن حضرة الربوبية، والمظلمة أيضاً راجعة إلى الحضرة إذ المرجع ومصير الكل إليه، إلا أنها ناكسة رؤوسها عن جهة أعلى عليين، إلى جهة أسفل سافلين، ولذلك قال تعالى:\n\n[السجدة: 12] فبيَّن أنهم عند ربهم منكسون منحوسون، قد انقلبت وجوههم إلى اقفيتهم، وانتكست رؤوسهم عن جهة فوق إلى جهة أسفل، وذلك حكم الله تعالى فيمن حَرمَهُ توفيقه، ولم يهده طريقه فنعوذ بالله من الضلال والنزول في منازل الجُهال\n هـ\n قلت: ظاهر كلامه: أن الروح لا ترجع إلى وطنها وتتصل بحضرة ربها إلا بعد خراب هذا البدن، والحق إنها ترجع لأصلها، وتتصل بحضرة ربها مع قيام هذا البدن إذا كمل تطهيرها وتمت تصفيتها من بقايا الحس، وانقطع عنها علائق هذا العالم الجسماني، فتتصل حينئذٍ بالعالم الروحاني، مع قيام العالم الجسماني، كما هو مقرر عند أهل التحقيق، والله تعالى أعلم\n ثم ذكر حكمة إيجاد النيريْن، فقال: { هُوَ ٱلَّذِي جَعَلَ ٱلشَّمْسَ ضِيَآءً }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:11",
      "similarity": 0.537112982780428
    },
    {
      "verse": "7:29",
      "similarity": 0.5149654234239862
    },
    {
      "verse": "85:13",
      "similarity": 0.4642717362183177
    },
    {
      "verse": "29:19",
      "similarity": 0.44579954494883206
    },
    {
      "verse": "34:49",
      "similarity": 0.4418081347860266
    }
  ]
}