{
  "chapter": "يونس",
  "text": "ومنهم من يستمعون اليك افانت تسمع الصم ولو كانوا۟ لا يعقلون",
  "translations": [
    {
      "translation": "Some of them listen to you: But can you make the deaf hear who do not understand a thing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them some seem to give heed to you; will you, then, make the deaf hear even though they understand nothing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them will listen to you, but are you supposed to make the deaf hear even if they have no understanding?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who listen to you; so will you make the deaf hear even if they do not have any sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who listen to you, but can you make the deaf to hear -- even though they apprehend not\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are those of them who hear you, but can you make the deaf to hear though they will not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of them give ear to thee; what, wilt thou make the deaf to hear, though they understand not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who listen unto thee. But canst thou make the deaf to hear even though they apprehend not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them appear to be listening to you; but can you make the deaf hear, incapable as they are of understanding?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who hearken unto thee, so canst thou make the deaf hear, even though they apprehend not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some of them who prick up their ears at you. But can you make the deaf hear even if they do not exercise their reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are some who (pretend to) listen to thee: But canst thou make the deaf to hear,- even though they are without understanding?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who listen to you, but can you make the deaf to hear, even though they apprehend not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them listen to you. But can you make the deaf hear you, even though they cannot understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who listen to you. But can you make the deaf hear, even though they do not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who listen to you. But can you cause the deaf to hear, although they will not use reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:42] And of them are some who listen to you, when you recite the Qur’ān. But will you make the deaf to hear — He likens them [the Meccan disbelievers] to these [the deaf] because they are not able to benefit from what is recited to them — even though, with their deafness, they do not understand?, [even though they do not] reflect?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of them) of the Jews (are some who listen unto thee) listen to your words and speech; it is also said that this means: of the Arab idolaters who listen to your words and speech. (But canst thou) Muhammad (make the deaf to hear even though they apprehend not) even though they have no desire to apprehend?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْهُمْ مَّن يَسْتَمِعُونَ إِلَيْكَ } استهزاءً، وأنت تلتفت إلى أسماعهم، وتبالغوا فيه؛ ليتعظوا، وهم لا يسمعون ولا يفقهون؛ لأكنة قلوبهم وصمم أسماعهم { أَفَأَنتَ تُسْمِعُ ٱلصُّمَّ } وتجتهد في إصغائهم وإسماعهم { وَلَوْ كَانُواْ لاَ يَعْقِلُونَ } [يونس: 42] لجهلهم المركوز في جبلتهم { وَمِنهُمْ مَّن يَنظُرُ إِلَيْكَ } ويعاين دلائل نبوتك ويشاهد أماراتها، ومع ذكل ينكر بك وبنبوتك { أَفَأَنْتَ تَهْدِي ٱلْعُمْيَ } وتقدر على أسماعه { وَلَوْ كَانُواْ } مجبولين بأنهم { لاَ يُبْصِرُونَ } [يونس: 43] لتعامي بصائرهم وأبصارهم، وقساوة قلوبهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" من \" الموصولة لفظها مفرد، معناها واقع على الجمع أو غيره، فإن عاد الضمير عليها جاز فيه مراعاة المعنى ومراعاة اللفظ، فقوله: { ومنهم من يستمعون } راعى جانب المعنى، وقوله: { ومنهم من ينتظر } راعى جانب اللفظ، فإن راعى أولاً اللفظ جاز أن يرجع إلى مراعاة المعنى، كقوله:\n",
      "translations": []
    }
  ]
}