{
  "chapter": "يونس",
  "text": "اليه مرجعكم جميعا وعد الله حقا انه يبدؤا۟ الخلق ثم يعيده ليجزى الذين ءامنوا۟ وعملوا۟ الصلحت بالقسط والذين كفروا۟ لهم شراب من حميم وعذاب اليمۢ بما كانوا۟ يكفرون",
  "translations": [
    {
      "translation": "Each and every one of you will return to Him. Allah's promise is true. He brings creation out of nothing and then regenerates it so that he can repay with justice those who had iman and did right actions. Those who were kafir will have a drink of scalding water and a painful punishment because of their kufr.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him will you all return: God's promise is true. It is He who originates creation, then will revert it, so that He may reward those who believe and do good things in all justice. But those who deny the truth will receive boiling water to drink and grievous punishment, for they disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is your return. This is Allah's promise that will certainly come true. Surely it is He Who brings about the creation of all and He will repeat it so that He may justly reward those who believe and do righteous deeds; and that those who disbelieve may have a draught of boiling water and suffer a painful chastisement for their denying the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, you will all return to God. The promise of God is true; He creates all things and (after their death) brings them to life again so that He may justly reward the righteously striving believers. The disbelievers will drink boiling filthy water and suffer painful torment as a recompense for their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Towards Him only you all are to return; the promise of Allah; indeed He creates for the first time and then after its extinction creates it again, in order to give those who believe and do good deeds, the reward of justice; and for the disbelievers, boiling water to drink and a painful punishment – the recompense of their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is the return of all of you. The promise of Allah is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is your return, of all (of you); the promise of Allah (made) in truth; surely He begins the creation in the first instance, then He reproduces it, that He may with justice recompense those who believe and do good; and (as for) those who disbelieve, they shall have a drink of hot water and painful punishment because they disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him shall you return, all together -- God's promise, in truth. He originates creation, then He brings it back again that He may recompense those who believe and do deeds of righteousness, justly. And those who disbelieve -- for them awaits a draught of boiling water, and a painful chastisement, for their disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him is the return of all of you; it is a promise of Allah in truth. Lo! He produceth creation, then reproduceth it, that He may reward those who believe and do good works with equity; while, as for those who disbelieve, theirs will be a boiling drink and painful doom because they disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him you shall all return. God's promise is true; He originates Creation, then He restores it, so that He may reward with justice those who believe and do good works. Those who have denied the truth shall have boiling water to drink, and a painful punishment, because of their denial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him is the return of you all--the promise of Allah is truth. Verily He beginneth the creation, then He shall repeat it, that he may recompense those who believed and did righteous works with equity. And those who disbelieved -- for them shall be draught of boiling water and a torment afflictive for they were wont to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him will be the return of you all; [that is] Allah’s true promise. Indeed, He originates the creation, then He will bring it back that He may reward with justice those who have faith and do righteous deeds. As for the faithless, they shall have boiling water for drink, and a painful punishment because of what they used to defy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him will be your return- of all of you. The promise of Allah is true and sure. It is He Who beginneth the process of creation, and repeateth it, that He may reward with justice those who believe and work righteousness; but those who reject Him will have draughts of boiling fluids, and a penalty grievous, because they did reject Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is the return of all of you. The Promise of Allah is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed (in the Oneness of Allah - Islamic Monotheism) and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him all of you will return together. This is, in truth, the promise of Allah. He originates creation, then He revives it so that He may recompense those who believe and do righteous deeds. As for the unbelievers, theirs is a drink of boiling water and a painful punishment for their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is your return, altogether. The promise of God is true. He originates creation, and then He repeats it, to reward those who believe and do good deeds with equity. As for those who disbelieve, for them is a drink of boiling water, and agonizing torment, on account of their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him is your return all together. [It is] the promise of Allah [which is] truth. Indeed, He begins the [process of] creation and then repeats it that He may reward those who have believed and done righteous deeds, in justice. But those who disbelieved will have a drink of scalding water and a painful punishment for what they used to deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:4] To Him, exalted be He, is the return of all of you: God’s promise, in truth (both [wa‘da and haqqan] are verbal nouns, and in the accusative because of the verbs implicit in them). Truly He (read innahu as a new sentence, or annahu with an implied lām [sc. li-annahu, ‘Because He’] originates creation, that is, He began it by originating [it], then recreates it, through resurrection, that He may requite, reward, those who believe and perform righteous deeds, justly. And those who disbelieve, for them will be a draught of boiling water and a painful chastisement because they disbelieved.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقع أمرهم بعبادته عقب ذكر الجزاء إنذاراً وتبشيراً ، فالجملة كالدليل على وجوب عبادته ، وهي بمنزلة النتيجة الناشئة عن إثبات خلقه السماوات والأرض لأن الذي خلق مثل تلك العوالم من غير سابق وجود لا يعجزه أن يعيد بعض الموجودات الكائنة في تلك العوالم خلقاً ثانياً . ومما يشير إلى هذا قوله : { إنه يبدأ الخلق ثم يعيده } ، فبَدء الخلق هو ما سبق ذكره ، وإعادتُه هي ما أفاده قوله : { إليه مرجعكم جميعاً } ولذلك فصلت عن التي قبلها لما بينهما من شبه كمال الاتصال ، على أنها يجوز كونها خبراً آخر عن قوله : { إن ربكم } \\[ يونس : 3 \\] ، أو عن قوله : { ذلكم الله ربكم } \\[ يونس : 3 \\].وقد تضمنت هذه الجملة إثبات الحشر الذي أنكروه وكذبوا النبيءَ صلى الله عليه وسلم لأجله .وفي تقديم المجرور في قوله : { إليه مرجعكم } إفادة القصر ، أي لا إلى غيره ، قطعاً لمطامع بعضهم القائلين في آلهتهم { هؤلاء شفعاؤنا عند الله } \\[ يونس : 18 \\] يريدون أنهم شفعاء على تسليم وقوع البعث للجزاء ، فإذا كان الرجوع إليه لا إلى غيره كان حقيقاً بالعبادة وكانت عبادة غيره باطلاً .والمرجع : مصدر ميمي بمعنى الرجوع . وقد تقدم في قوله : { إلى الله مرجعكم جميعاً فينبئكم بما كنتم تعملون } في سورة \\[ العقود : 105 \\].و { جميعاً } حال من ضمير المخاطبين المضاف إليه المصدر العامل فيه .وانتصب { وعدَ الله } على المفعولية المطلقة توكيداً لمضمون الجملة المساوية له ، ويسمى موكِّداً لنفسه في اصطلاح النحاة ، لأن مضمون { إليه مرجعكم } الوعد بإرجاعهم إليه وهو مفاد وعد الله ، ويقدر له عامل محذوف لأن الجملة المؤكدة لا تصلح للعمل فيه . والتقدير : وعدَكم اللّهُ وعداً حقاً .وانتصب { حقاً } على المفعولية المطلقة المؤكدة لمضمون جملة { وعد الله } باعتبار الفعل المحذوف . ويسمى في اصطلاح النحاة مؤكداً لغيره ، أي موكداً لأحد معنيين تحتملهما الجملة المؤكدة .وجملة : { إنه يبدأ الخلق } واقعة موقع الدليل على وقوع البعث وإمكانه بأنه قد ابتدأ خلق الناس ، وابتداء خلقهم يدل على إمكان إعادة خلقهم بعد العدم ، وثبوت إمكانه يدفع تكذيب المشركين به ، فكان إمكانه دليلاً لقوله : { إليه مرجعكم جميعاً } ، وكان الاستدلال على إمكانه حاصلاً من تقديم التذكير ببدء خلق السماوات والأرض كقوله تعالى : { وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه } \\[ الروم : 27 \\].وموقع ( إن \\] تأكيد الخبر نظراً لإنكارهم البعث ، فحصل التأكيد من قوله : { ثم يعيده } أما كونه بدأ الخلق فلا ينكرونه .وقرأ الجمهور { إنه يبدأ الخلق } بكسر همزة ( إنه ). وقرأه أبو جعفر بفتح الهمزة على تقدير لام التعليل محذوفة ، أي حق وعده بالبعث لأنه يبدأ الخلق ثم يعيده فلا تعجزه الإعادة بعد الخلق الأول ، أو المصدر مفعول مطلق منصوب بما نصب به { وعْدَ الله } أي وَعَدَ الله وعداً بَدْءَ الخلق ثم إعادته فيكون بدلاً من { وعْد الله } بدلاً مطابقاً أو عطف بيان .ويجوز أن يكون المصدر المنسبك من ( أنَّ ) وما بعدها مرفوعاً بالفعل المقدر الذي انتصب ( حقاً ) بإضماره . فالتقدير : حَقَّ حقاً أنه يبدأ الخلق ، أي حق بدؤه الخلق ثم إعادته .والتعليل بقوله : { ليجزى الذين آمنوا } الخ إبداءٌ لحكمة البعث وهي الجزاء على الأعمال المقترفة في الحياة الدنيا ، إذ لو أرسل الناس على أعمالهم بغير جزاء على الحسن والقبيح لاستوى المُحسن والمسيء ، وربما كان بعضُ المسيئين في هذه الدنيا أحسن فيها حالاً من المحسنين . فكان من الحكمة أن يلقَى كل عامل جزاء عمله . ولم يكن هذا العالم صالحاً لإظهار ذلك لأنه وُضع نظامه على قاعدة الكون والفساد ، قابلاً لوقوع ما يخالف الحق ولصرف الخيرات عن الصالحين وانهيالِها على المفسدين والعكس لأسباب وآثار هي أوفق بالحياة المقررة في هذا العالم ، فكانت الحكمة قاضية بوجود عالم آخر متمحض للكون والبقاء وموضوعاً فيه كل صنف فيما يليق به لا يعدوه إلى غيره إذ لا قبل فيه لتصرفات وتسببات تخالف الحق والاستحقاق . وقدم جزاء الذين آمنوا وعملوا الصالحات لشرفه ولياقته بذلك العالم ، ولأنهم قد سلكوا في عالم الحياة الدنيا ما خلق الله الناس لأجله ولم يتصرفوا فيه بتغليب الفساد على الصلاح .والباء في { بالقسط } صالحة لإفادة معنى التعدية لفعل الجزاء ومعنى العِوض . والقسط : العدل . وهو التسوية بين شيئين في صفة والجزاء بما يساوي المجْزي عليه . وتقدم في قوله : { قائماً بالقسط } في أول \\[ آل عمران : 18 \\]. فتفيد الباء أنهم يُجزون بما يعادل أعمالهم الصالحة فيكون جزاؤهم صلاحاً هنالك وهو غاية النعيم ، وأن ذلك الجزاء مكافاة على قسطهم في أعمالهم في عَدلهم فيها بأن عملوا ما يساوي الصلاح المقصود من نظام هذا العالم .والإجمال هنا بين معنيي الباء مفيد لتعظيم شأن جزاء الذين آمنوا وعملوا الصالحات مع الإشارة إلى أنه جزاء مماثل لصلاح أعمالهم .وإنما خص بذلك جزاء المؤمنين مع أن الجزاء كله عدل ، بل ربما كانت الزيادة في ثواب المؤمنين فضلاً زائداً على العدل لأمرين : أحدهما : } تأنيس المؤمنين وإكرامهم بأن جزاءهم قداستحقوه بما عملوا ، كقوله : { ادخلوا الجنة بما كنتم تعملون } \\[ النحل : 32 \\]. ومن أعظم الكرم أن يُوهم الكريم أن ما تفضل به على المكرَم هو حقه وأن لا فضل له فيه .الأمر الثاني : الإشارة إلى أن جزاء الكافرين دون ما يقتضيه العدل ، ففيه تفضل بضرب من التخفيف لأنهم لو جُوزوا على قدر جُرمهم لكان عذابهم أشد ، ولأجل هذا خولف الأسلوب في ذكر جزاء الذين كفروا فجاء صريحاً بما يعم أحوال العذاب بقوله : { لهم شراب من حميم وعذاب أليم } \\[ الأنعام : 70 \\]. وخص الشراب من الحميم بالذكر من بين أنواع العذاب الأليم لأنه أكره أنواع العذاب في مألوف النفوس . { أولئك الذين أبسلوا بما كسبوا لهم شراب من حميم وعذاب أليم بما كانوا يكفرون }في سورة \\[ الأنعام : 70 \\]. والباء في قوله :وشراب الحميم تقدم في قوله تعالى : { بما كانوا يكفرون } للعِوض .وجملة : { والذين كفروا } إلى آخرها استئناف بياني لأنه لما ورد ذكر جزاء المؤمنين على أنه العلة لرجوع الجميع إليه ولم يذكر في العلة ما هو جزاء الجميع لا جرم يتشوف السامع إلى معرفة جزاء الكافرين فجاء الاستئناف للإعلام بذلك .ونكتة تغيير الأسلوب حيث لم يعطف جزاء الكافرين على جزاء المؤمنين فيقال : ويَجزي الذين كفروا بعذاب الخ كما في قوله : { لينذر بأساً شديداً من لدنه ويُبشر المؤمنين } \\[ الكهف : 2 \\] هو الإشارة إلى الاهتمام بجزاء المؤمنين الصالحين وأنه الذي يبادر بالإعلام به وأن جزاء الكافرين جدير بالإعراض عن ذكره لولا سؤال السامعين .\n\n",
      "translations": [
        {
          "translation": "(Unto Him is the return of all of you) after death; (it is a promise of Allah in truth) this is the Truth which will surely take place. (Lo! He produceth creation) from a sperm drop, (then reproduces it) after death, (that He may reward those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) between themselves and their Lord (with equity) with justice: [i.e. they will earn as a reward] Paradise; (while, as for those who disbelieve) in Muhammad (pbuh) and in the Qur'an, (theirs will be a boiling drink and painful doom) whose pain will reach to their hearts (because they disbelieved) in Muhammad (pbuh) and in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَهُمْ شَرَابٌ مِّنْ حَمِيمٍ } فالحَميمُ: الحَارُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"For them is a drink of boiling water\" - the boiling water being hot.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ إليه مرجعكم جميعاً } بالعود إلى عين الجمع المطلق في القيامة الصغرى كما هو الآن أو إلى عين جمع الذات بالفناء فيه عند القيامة الكبرى. { وعد الله حقاً إنه يَبْدأ الخلق } في النشأة الأولى { ثم يُعِيده } في النشأة الثانية { ليجزي } المؤمن والكافر على حسب إيمانهم وعملهم الصالح وكفرهم وعملهم الفاسد وهذا على التأويل الأول، وعلى الثاني: يبدأ الخلق باختفائه وإظهارهم ثم يعيدهم بإفنائهم وظهوره ليجزي الذين آمنوا به وعملوا الصالحات ما يصلحهم للقائه من الأعمال الرافعة لحجبهم المقربة إياهم { بالقِسْط } بحسب ما بلغوا من المقامات بأعمالهم من مواهبه الحالية والذوقية التي يقتضيها مقامهم وشوقهم، أو ليجزي الذين آمنوا الإيمان الحقيقي وعملوا بالله الأعمال التي تصلح العباد، أي جزاء بالتكميل بقسطهم أي بسبب عدلهم في زمان الاستقامة أو جزاء بحسب رتبتهم ومقامهم في الاستقامة { والذين } حجبوا في أي مقام كان { لهم شرابٌ من حَمِيم } لجهلهم بما فوقه وشكهم واضطرابهم إذ لو وصلوا إلى اليقين لذاقوا برده { وعذابٌ أليم } من الحرمان والهجران وفقدان روح الوجدان بسبب احتجابهم.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { إِلَيْهِ } لا إلى غيره\n إذ لا غير معه سبحانه في الوجود { مَرْجِعُكُمْ جَمِيعاً } كما وعدكم بقوله:\n[يونس: 23]\n\n[الغاشية: 25]\n\n[الأنبياء: 35] إلى غير ذلك من الآيات\n\n\n{ وَعْدَ ٱللَّهِ } الذي لا يخلف ميعاده أصلاً { حَقّاً } ثابتاً لازماً بلا تغيير وتبديل\n وكيف لا يكون وعده حقاً\n إذ هو قادر على جميع المقدورات والمرادات\n ومن كمال قدرته { إِنَّهُ يَبْدَؤُاْ ٱلْخَلْقَ } ويظهره من العدم إظهاراً إبداعياً بلا سبق مادة ومدة\n ثم يعدمه\n إظهاراً لقدرته أيضاً { ثُمَّ يُعِيدُهُ } في النشأة الأخرى لإظهار أسرار تكليفاته التي كلف بها عباده في النشأة الأولى { لِيَجْزِيَ ٱلَّذِينَ آمَنُواْ } بتوحيده\n وصدقوا رسله { وَعَمِلُواْ ٱلصَّالِحَاتِ } المأمورة من عنده بألسنة كتبه ورسله { بِٱلْقِسْطِ } والعدل القويم\n وتفضل على من تفضل عنايته منه { وَٱلَّذِينَ كَفَرُواْ } بالله\n وأشركوا له شيئاً من مظاهر { لَهُمْ } في يوم العرض والجزاء\n بعدما يحاسبوا { شَرَابٌ مِّنْ حَمِيمٍ } بدل ما يتلذذون بالأشربة المحرمة في النشأة الأولى { وَعَذَابٌ أَلِيمٌ بِمَا كَانُواْ يَكْفُرُونَ } [يونس: 4] بالله\n ويكذبون رسله\n عناداً وإصراراً\n وكيف يكفرون بالله أولئك الحمقى\n العمي\n الهالكون في تيه الغفلة الضلال\n وظلمة الجهل وسوء الفعال؟!",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { إليه مرجعكم } بالبعث { جميعاً } فيجازيكم على أعمالكم\n ويعاقبكم على شرككم\n { وعد الله حقاً }\n مصدر مؤكد لنفسه لأن قوله: { إليه مرجعكم } وعدٌ من الله\n { إنه يبدأ الخلق } بإظهاره في الدنيا { ثم يُعيده } بعد إهلاكه في الآخرة\n { ليجزي الذين آمنوا وعملوا الصالحات } \n تعليل للعودة وهي البعثة\n وقوله: { بالقسط } أي: بالعدل بأن يعدل في جزائهم\n فلا يظلم مثقال ذرة\n أو بعدلهم وقيامهم على العمل في أمورهم\n أو بإيمانهم لأنه العدل القويم\n كما أن الشرك ظلم عظيم\n وهو الأوجه لمقابلة قوله: { والذين كفروا لهم شراب من حميم وعذاب أليم } بسبب كفرهم وشركهم ـ الذي هو الظلم العظيم ـ لكنه غيَّر النظم للمبالغة في استحقاقهم العذاب والتنْبيه على أن المقصود بالذات من الإبداء والإعادة هو الإثابة\n وأما العقاب فإنما هو الواقع بالعرض\n وأنه تعالى يتولى إثابة المؤمنين بما يليق بلطفه وكرمه\n ولذلك لم يعينه\n وأما عقاب الكفرة\n فإنه إنما ساقه إليهم سوء اعتقادهم وشوم أفعالهم\n  والآية كالدليل لقوله: { إليه مرجعكم جميعاً } \n فإنَّه لمَّا كان المقصود من الإبداء والإعادة مجازاة الله المكلفين على أعمالهم\n كان مرجع الجميع إليه لا محالة\n ويؤيده قراءة من قرأ: \" أنه يبدأ \" بالفتح\n أي: لأنه\n ويجوز أن يكون منصوباً بما نصب \" وعد الله \"\n\nقاله البيضاوي\n الإشارة: تقدم بعض إشارة هذه الآية في الأعراف\n وقال الورتجبي هنا: جعل العرش مرآة تجلي قدسه ومأوى أرواح أحبابه لقوله: { ثم استوى\n\n\n } الآية\n ثم قال: ثم دعاهم إلى عبادته بعد معرفته بقوله: { فاعبدوه }\n وقال القشيري: { ذلكم الله ربكم } تعريف\n وقوله: { فاعبدوه } تكليف\n فحصولُ التعريف بتحقيقه\n والوصولُ إلى ما وَرَدَ به التكليف بتوفيقه\n هـ\n وقال في قوله: { إليه مرجعكم جميعاً }: الرجوع يقتضي ابتداء\n والأرواح قبل حصولها في الأشباح كان لها في مواطن التسبيح والتقديس إقامة\n والغائب إذا رجع إلى وطنه من سفره فلقدومه أثر عند مُحبيِّه وذويه\n وأنشدوا:\nوفي الإحياء: كل من نسي الله أنساه ـ لا محالة ـ نفسه\n ونزل إلى رتبة البهائم\n وترك الترقي إلى أُفق الملأ الأعلى\n وخان في الأمانة التي أودعها له تعالى\n وأنعم بها عليه\n وكان كافراً لنعمته\n ومتعرضاً لنقمته فإن البهيمة تتخلص بالموت\n وأما هذا فعنده أمانة سترجعُ ـ لا محالة ـ إلى مُودعها\n فإليه مرجع الأمانة ومصيرها\n وتلك الأمانة كالشمس الزاهرة\n وإنما هبطت إلى هذا القالب الفاني وغربت فيه\n وستطلع هذه الشمس عند خراب هذا القالب من مغربها\n وتعود إلى بارئها وخالقها\n إما مظلمة مُنكسة\n وإما زاهرة مشرقة\n والزاهرة المشرقة غير محجوبة عن حضرة الربوبية\n والمظلمة أيضاً راجعة إلى الحضرة إذ المرجع ومصير الكل إليه\n إلا أنها ناكسة رؤوسها عن جهة أعلى عليين\n إلى جهة أسفل سافلين\n ولذلك قال تعالى:\n[السجدة: 12] فبيَّن أنهم عند ربهم منكسون منحوسون\n قد انقلبت وجوههم إلى اقفيتهم\n وانتكست رؤوسهم عن جهة فوق إلى جهة أسفل\n وذلك حكم الله تعالى فيمن حَرمَهُ توفيقه\n ولم يهده طريقه فنعوذ بالله من الضلال والنزول في منازل الجُهال\n هـ\n قلت: ظاهر كلامه: أن الروح لا ترجع إلى وطنها وتتصل بحضرة ربها إلا بعد خراب هذا البدن\n والحق إنها ترجع لأصلها\n وتتصل بحضرة ربها مع قيام هذا البدن إذا كمل تطهيرها وتمت تصفيتها من بقايا الحس\n وانقطع عنها علائق هذا العالم الجسماني\n فتتصل حينئذٍ بالعالم الروحاني\n مع قيام العالم الجسماني\n كما هو مقرر عند أهل التحقيق\n والله تعالى أعلم\n ثم ذكر حكمة إيجاد النيريْن\n فقال: { هُوَ ٱلَّذِي جَعَلَ ٱلشَّمْسَ ضِيَآءً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:11",
      "similarity": 0.537112982780428
    },
    {
      "verse": "7:29",
      "similarity": 0.5149654234239862
    },
    {
      "verse": "85:13",
      "similarity": 0.4642717362183177
    },
    {
      "verse": "29:19",
      "similarity": 0.44579954494883206
    },
    {
      "verse": "34:49",
      "similarity": 0.4418081347860266
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}