{
  "chapter": "يونس",
  "text": "ولكل امة رسول فاذا جاء رسولهم قضى بينهم بالقسط وهم لا يظلمون",
  "translations": [
    {
      "translation": "Every nation has a Messenger and when their Messenger comes everything is decided between them justly. They are not wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every people there is an apostle; and when their apostle is come the matter is decided between them equitably, and no one is wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Messenger is sent to every people; and when their Messenger comes, the fate of that people is decided with full justice; they are subjected to no wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Messenger is appointed for all people. When the Messenger for them came he judged among them fairly and they were not wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in every nation was a Noble Messenger (from Allah); so when their Noble Messenger came to them, they were judged with fairness, and they were not wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every Ummah there is a Messenger; when their Messenger comes, the matter will be judged between them with justice, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every nation had an apostle; so when their apostle came, the matter was decided between them with justice and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every nation has its Messenger; then, when their Messenger comes, justly the issue is decided between them, and they are not wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation there is a messenger. And when their messenger cometh (on the Day of Judgment) it will be judged between them fairly, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every nation has a messenger. Once their messenger has come, judgement will be passed upon them in all fairness and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for each community there hath been sent an apostle; and when their apostle hath arrived, the matter between them is decreed in equity, and they are not wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is an apostle for every nation; so when their apostle comes, judgement is made between them with justice, and they are not wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every people (was sent) a messenger: when their messenger comes (before them), the matter will be judged between them with justice, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every Ummah (a community or a nation), there is a Messenger; when their Messenger comes, the matter will be judged between them with justice, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every nation has its Messenger. Then, when their Messenger comes the matter is justly decided between them; they are not wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every community has a messenger. When their messenger has come, judgment will be passed between them with fairness, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation is a messenger. So when their messenger comes, it will be judged between them in justice, and they will not be wronged\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:47] And for every community, of the communities [of this world], there is a messenger. And when their messenger comes, to them, and they deny him, judgement is passed between them justly, fairly, such that they are punished and the messenger, and all those who accepted his truthfulness, are delivered; and they are not wronged, by being punished for no crime: similarly, We shall deal with these [disbelievers of your community].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And for every nation) for the adherents of each religion (there is a messenger) who calls them to Allah and to His religion. (And when their messenger cometh) to them and they deny (it will be judged between them) and the Messenger (fairly) with justice: those people will perish and the Messenger will be saved, (and they will not be wronged) their good works will not be decreased nor will their evil deeds be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أن { لِكُلِّ أُمَّةٍ } أي: فرقةٍ وطائفة { رَّسُولٌ } مرسل من عند الله على مقتضى حكمته وحكمه؛ ليهديهم إلى توحيده { فَإِذَا جَآءَ رَسُولُهُمْ قُضِيَ بَيْنَهُمْ بِٱلْقِسْطِ } والعدل الموضوع من عند الله لإصلاح أحوال عباده { وَهُمْ لاَ يُظْلَمُونَ } [يونس: 47] في يوم الجزاء، ولا ينقصون من أجور أعمالهم بل يجازون مقدار ما يقترفون من المعاصي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولكل أُمة } من الأمم الماضية { رسولٌ } يبعثه إليهم، يدعوهم إلى الحق، { فإذا جاء رسولُهم } بالمعجزات \" فكذبوه \" { قُضِيَ بينهم بالقسط }: بالعدل، فأنجى الرسولَ ومن تبعه، وأهلك المكذبين { وهم لا يُظلمون } ، حيث أعذر إليهم على ألسنة الرسل\n وقيل معناه: لكل أمة يوم القيامة رسول تنسب إليه\n كقوله:\n\n[الإسراء: 71] فإذا جاء رسولهم الموقفَ ليشهد عليهم بالكفر أو الإيمان { قضي بينهم } بإنجاء المؤمنين وعقاب الكافرين، كقوله:\n\n[الزمر: 69]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:18",
      "similarity": 0.5276768215394783
    },
    {
      "verse": "3:21",
      "similarity": 0.46330216646334577
    },
    {
      "verse": "55:9",
      "similarity": 0.4619020301339333
    },
    {
      "verse": "60:8",
      "similarity": 0.36244506605590504
    },
    {
      "verse": "10:54",
      "similarity": 0.33645957339226157
    }
  ]
}