{
  "chapter": "يونس",
  "text": "ويوم يحشرهم كان لم يلبثوا۟ الا ساعة من النهار يتعارفون بينهم قد خسر الذين كذبوا۟ بلقاء الله وما كانوا۟ مهتدين",
  "translations": [
    {
      "translation": "On the day We gather them together - when it will seem if they had tarried no more than an hour of a single day - they will recognise one another. Those who denied the meeting with Allah will have lost. They were not guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day He will gather them together it will appear to them that they had lived (in the world) but an hour of a day to make each other's acquaintance. Verily those who deny the meeting with God will be lost, and not find the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(But today they are oblivious of everything except enjoyment of worldly life.) And on the Day when He will muster all men together, they will feel as though they had been in the world no more than an hour of the day to get acquainted with one another. (It will then become evident that) those who called the lie to meeting with Allah were utter losers and were not rightly-directed. underlies this sharp remark is the faint hope that perhaps such people would be shaken out of their slumber.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when they will be resurrected, their worldly life will seem to them only as an hour of a day and they all will recognize each other. Those who called the receiving of mercy from God a lie are certainly lost. They did not have the right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when He will raise all of them together, as if they had never stayed on earth except for a moment during the day, they will recognise one another; for completely ruined are those who denied the meeting with Allah and were not on guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when He shall gather them together, (it will be) as if they had not stayed (in the life of this world and graves) but an hour of a day. They will recognize each other. Ruined indeed will be those who denied the meeting with Allah and were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when He will gather them as though they had not stayed but an hour of the day, they will know each other. They will perish indeed who called the meeting with Allah to be a lie, and they are not followers of the right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day He shall muster them, as if they had not tarried but an hour of the day, mutually recognizing one another; lost will be those who cried lies to the encounter with God, and were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when He shall gather them together, (when it will seem) as though they had tarried but an hour of the day, recognising one another, those will verily have perished who denied the meeting with Allah and were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when He shall gather them together, it will seem to them as if they had not tarried in the world longer than an hour of a day. They will recognize one another; lost indeed will be those who considered it a lie that they were destined to meet God, and did not follow the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the Day whereon He shall gather them, as though they had tarried not save an hour of he day they shall mutually recognize. Lost surely are those who belie the meeting with Allah and they were not such as to be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day He will gather them [it will be] as if they had not remained [in the world] except for an hour of the day getting acquainted with one another. They are certainly losers who deny the encounter with Allah, and they are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day He will gather them together: (It will be) as if they had tarried but an hour of a day: they will recognise each other: assuredly those will be lost who denied the meeting with Allah and refused to receive true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when He shall gather (resurrect) them together, (it will be) as if they had not stayed (in the life of this world and graves, etc.) but an hour of a day. They will recognise each other. Ruined indeed will be those who denied the meeting with Allah, and were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when He will gather them, (it will be) as though they had lingered but an hour of the Day and they will recognize one another. Lost are those who belied the meeting with their Lord and were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He rounds them up—as if they had tarried only one hour of a day—they will recognize one another. Those who denied the meeting with God will be the losers. They were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when He will gather them, [it will be] as if they had not remained [in the world] but an hour of the day, [and] they will know each other. Those will have lost who denied the meeting with Allah and were not guided\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:45] And on the day when He shall gather them, it is, as if they had not tarried, in this world, or in the grave, but an hour of the day, because of the terror of what they see (the comparative sentence is a circumstantial qualifier referring to the [third person] pronoun); recognising one another, knowing one another, upon their being resurrected, but thereafter the recognition ceases on account of the severity of the terrors (the [last] sentence is either an implied circumstantial qualifier or one connected to the adverbial qualifier [yawma, ‘on the day’]); those will verily have lost who denied the encounter with God, through resurrection, for they were not guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And on the day when He shall gather them) i.e. the Jews, the Christians and the idolaters (together, (when it will seem) as though they had tarried) in their graves (but an hour of the day, recognizing one another) recognising one another in some places and not recognising one another in others, (those will verily have perished) have lost (who denied the meeting with Allah) who denied resurrection after death, because they have lost both this world and the Next (and were not guided) from disbelief and error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر لهم يا أكمل الرسل { يَوْمَ يَحْشُرُهُمْ } أي: أهواله المتطاولة وشدائده المترادفة المتتالية إلى حيث يصور عندهم مدة حياتهم في الدنيا { كَأَن لَّمْ يَلْبَثُوۤاْ } فيها { إِلاَّ سَاعَةً مِّنَ ٱلنَّهَارِ } لطول ذلك اليوم وشدة أهواله { يَتَعَارَفُونَ بَيْنَهُمْ } أي: وهم يعرف بعضهم بعضاً هذا في أول النشر، ثم يشتد عليهم الأمر ويرتفع التعارف والالتفات، ويصير كل منهم رهينة ما كسبت، وبالجملة: { قَدْ خَسِرَ } وخاب خيبة عظيمة { ٱلَّذِينَ كَذَّبُواْ بِلِقَآءِ ٱللَّهِ } في الآخرة، وأصروا على ما هم عليه من اقتراف المعاصي، ولم يلتفتوا إلى الأنبياء والذي جاءوا به من عند الله؛ لإصلاح أحوالهم في مبدئهم ومعادهم { وَمَا كَانُواْ } أيضاً { مُهْتَدِينَ } [يونس: 45] بطريق الصلاح والصواب من تلقاء نفوسهم بلا إرشاد مرشد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كأن لم يلبثوا }: حال، أي: نحشرهم مشبهين بمن لم يلبث إلا ساعة\n أو صفة ليوم، والعائد محذوف، أي: كأن لم يلبثوا قبله، أو لمصدر محذوف، أي: حشراً كأن لم يلبثوا قبله\n وجملة: { يتعارفون }: حال أخرى مقدرة، أو بيان لقوله: { كأن لم يلبثوا } ، أو لتعلق الظرف، والتقدير: يتعارفون يوم نحشرهم: \" وإما \": شرط، و { نرينك } فعله، { أو نتوفينك }: عطف عليه",
      "translations": []
    }
  ]
}