{
  "chapter": "يونس",
  "text": "واما نرينك بعض الذى نعدهم او نتوفينك فالينا مرجعهم ثم الله شهيد على ما يفعلون",
  "translations": [
    {
      "translation": "Whether We show you something of what We have promised them or take you back to Us, they will still return to Us. Then Allah will be witness against what they are doing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you some of the promise (of punishment in wait) for them, or take you to Ourself, their returning is to Us in the end; and God is a witness to all they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We let you see (during your lifetime) some of the chastisement with which We threaten them, or We call you unto Us (before the chastisement strikes them), in any case they are bound to return to Us. Allah is witness to all what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When if We show you them suffering Our retribution or you die before their suffering, (they will not be able to escape Our punishment) they will all return to Us. God bears witness to whatever they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whether We show you (O dear Prophet Mohammed – peace and blessings be upon him) part of what We promise them or whether We call you towards Us before it – in any case they have to return to Us – then Allah is the Witness of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you some of what We promise them (the torment), or We cause you to die -- still unto Us is their return, and moreover Allah is Witness over what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We show you something of what We threaten them with, or cause you to die, yet to Us is their return, and Allah is the bearer of witness to what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show thee a part of that We promise them, or We call thee unto Us, to Us they shall return; then God is witness of the things they do\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We let thee (O Muhammad) behold something of that which We promise them or (whether We) cause thee to die, still unto Us is their return, and Allah, moreover, is Witness over what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you something of what We have promised them or cause you to die [before that], to Us they shall return. God is Witness to all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whether We shew thee soome of that which We have promised them, or We cause thee to die, Unto us is their return, and Allah is witness of that which they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you a part of what We promise them, or take you away [before that], [in any case] their return will be to Us and Allah will be witness to what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show thee (realised in thy life-time) some part of what We promise them,- or We take thy soul (to Our Mercy) (Before that),- in any case, to Us is their return: ultimately Allah is witness, to all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you (in your lifetime, O Muhammad SAW) some of what We promise them (the torment), - or We cause you to die, - still unto Us is their return, and moreover Allah is Witness over what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We let you see some of that with which We promised them, or We call you to Us, to Us they shall return. Allah is witness of the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you some of what We promise them, or take you, to Us is their return. God is witness to everything they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whether We show you some of what We promise them, [O Muhammad], or We take you in death, to Us is their return; then, [either way], Allah is a witness concerning what they are doing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:46] And whether (wa-immā: the nūn of the conditional particle in has been assimiliated with the extra mā) We show you something of that which We promise them, of chastisement, during your lifetime (the response to the conditional statement has been omitted, in other words [understand it as being] fa-dhāka, ‘then so shall it be’), or We take you [to Us], before punishing them, to Us they shall return, and God, moreover, is Witness, Aware, of what they do, in the way of their denials and disbelief, and so will chastise them with the severest punishment.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكانَ ذكر تكذيبهم الذي جاء في صدر السورة بقوله : { قال الكافرون إنّ هذا لسحر مبين } \\[ يونس : 2 \\] ، ثم الوعيد عليه بعذاب يحل بهم ، والإشارةُ إلى أنهم كذبوا بالوعيد في قوله : { ولو يعجل الله للناس الشر إلى قوله : { لننظر كيف تعملون } \\[ يونس : 11 14 \\] منذراً بترقب عذاب يحل بهم في الدنيا كما حل بالقرون الذين من قبلهم ، وكان معلوماً من خلق النبي صلى الله عليه وسلم رأفتُه بالناس ورغبتُه أن يتم هذا الدين وأن يهتدي جميع المدعوين إليه ، فربما كان النبي يحذر أن ينزل بهم عذاب الاستئصال فيفوت اهتداؤهم . وكان قوله : { ولو يعجل الله للناس الشر استعجالهم بالخير لقضي إليهم أجلهم فنذر الذين لا يرجون لقاءنا في طغيانهم يعمهون } \\[ يونس : 11 \\] تصريحاً بإمكان استبقائهم وإيماءً إلى إمهالهم . جاء هذا الكلام بياناً لذلك وإنذاراً بأنهم إن أمهلوا فأبقي عليهم في الدنيا فإنهم غير مفلتين من المصير إلى عقاب الآخرة حين يرجعون إلى تصرف الله دون حائل .وجاء الكلام على طريقة إبْهام الحاصل من الحالين لإيقاع الناس بين الخوف والرجاء وإن كان المخاطب به النبي صلى الله عليه وسلموالمرادُ ب { بعض الذي نعدهم } هو عذاب الدنيا فإنهم أوعدوا بعذاب الدنيا وعذاب الآخرة ، قال تعالى : { وإن للذين ظلموا عذاباً دون ذلك }. فالمعنى إن وقع عذاب الدنيا بهم فرأيتَه أنت أو لم يقع فتوفاك الله فمصيرهم إلينا على كل حال .فمضمون { أو نتوفينك } قسيم لمضمون { نرينك بعضَ الذي نعدهم }.والجملتان معاً جملتا شرط ، وجواب الشرط قوله : { فإلينا مرجعهم }.ولما جعل جواب الشرطين إرجاعَهم إلى الله المكنَّى به عن العقاب الآجِل ، تعين أن التقسيم الواقع في الشرط ترديد بين حالتين لهما مناسبة بحالة تحقق الإرجاع إلى عذاب الله على كلا التقديرين ، وهما حالة التعجيل لهم بالعذاب في الدنيا وحالة تأخير العذاب إلى الآخرة . وأما إراءة الرسول تعذيبهم وتوفيه بدون إرائته فلا مناسبة لهما بالإرجاع إلى الله على كلتيهما إلا باعتبار مقارنة إحداهما لحالة التعجيل ومناسبة الأخرى لحالة التأخير .وإنما كُني عن التعجيل بأن يريد اللّهُ الرسولَ للإيماء إلى أن حالة تعجيل العذاب لا يريد الله منها إلا الانتصاف لرسوله بأن يريه عذاب معانديه ، ولذلك بُني على ضد ذلك ضدّ التعجيل فكُني بتوفيه عن عدم تعجيل العذاب بل عن تأخيره إذْ كانت حكمة التعجيل هي الانتصافَ للرسول صلى الله عليه وسلمولما جعل مضمون جملة : { نتوفينك } قسيماً لمضمون جملة : { نرينك } تعين أن إراءته ما أوعدوا به من عذاب الدنيا إنما هو جزاء عن تكذيبهم إياه وأذَاهُم له انتصاراً له حتى يكون أمره جارياً على سنة الله في المرسلين ، كما قال نوح :{ رب انصرني بما كذبون } \\[ المؤمنون : 26 \\] وقد أشار إلى هذا قوله تعالى عقبه : { ولكل أمة رسول } \\[ يونس : 47 \\] الآية وقوله : { ويقولون متى هذا الوعد إن كنتم صادقين } \\[ يونس : 48 \\]. وقد أراه الله تعالى بعض الذي توعدهم بما لقوا من القحط سبع سنين بدعوته عليهم ، وبما أصابهم يوم بدر من الإهانة ، وقتل صناديدهم ، كما أشار إليه قوله تعالى : { فارتقب يوم تأتي السماء بدخان مبين يغشى الناس هذا عذاب أليم ربنا اكشف عنا العذاب إنا مؤمنون أنى لهم الذكرى وقد جاءهم رسول مبين ثم تولوا عنه وقالوا معلّم مجنون إنا كاشفوا العذاب قليلاً إنكم عائدون يوم نبطش البطشة الكبرى إنا منتقمون } \\[ الدخان : 10 16 \\].والدخان هو ما كانوا يرونه في سنين القحط من شبه الدخان في الأرض . والبطشة الكبرى : بطشة يوم بدر .وتأمَّلْ قوله : { ثم تولوا عنه } وقوله : { إنا منتقمون }.ثم كف الله عنهم عذاب الدنيا إرضاء له أيضاً إذ كان يود استبقاء بقيتهم ويقول : لعل الله أن يخرج من أصلابهم من يعبده .فأما الكفر بالله فجزاؤه عذاب الآخرة .فطوي في الكلام جمل دلت عليها الجمل المذكورة إيجازاً محكماً وصارت قوة الكلام هكذا : وإمّا نعجل لهم بعض العذاب فنرينك نزوله بهم ، أو نتوفينك فنؤخر عنهم العذاب بعد وفاتك ، أي لانتفاء الحكمة في تعجيله فمرجعهم إلينا ، أي مرجعهم ثابت إلينا دوماً فنحن أعلم بالحكمة المقتضية نفوذ الوعيد فيهم في الوقت المناسب في الدنيا إن شئنا في حياتك أو بعدك أو في الآخرة .وكلمة { إما } هي ( إن ) الشرطية و ( ما ) المؤكدة للتعليق الشرطي . وكتبت في المصحف بدون نون وبميم مشددة محاكاة لحالة النطق ، وقد أكد فعل الشرط بنون التوكيد فإنه إذا أريد توكيد فعل الشرط بالنون وتعينت زيادة ( ما ) بعد ( إن ) الشرطية فهما متلازمان عند المبرد والزجاج وصاحب «الكشاف» في تفسير قوله تعالى : { فإما نرينّك } في سورة \\[ غافر : 77 \\] ، فلا يقولون : إن تكرِمَنِّي أكرمك بنون التوكيد ولكن تقولون : إن تُكْرِمْني بدون نون التوكيد كما أنه لا يقال : إما تكرمني بدون نون التوكيد ولكن تقول : إن تكرمني . وشذ قول الأعشى: ... فإما تريْنِي ولي لِمةفإنَّ الحوادث أودَى بها ... ثم أكد التعليق الشرطي تأكيداً ثانياً بنون التوكيد وتقديم المجرور على عامله وهو مرجعهم } للاهتمام . وجملة : { إلينا مرجعهم } اسمية تفيد الدوام والثبات ، أي ذلك أمر في تصرفنا دوماً .وجملة : { ثم الله شهيد على ما يفعلون } معطوفة على جملة : { فإلينا مرجعهم }. وحرف { ثم } للتراخي الرُّتبي كما هو شأن ( ثم ) في عطفها الجمل . والتراخي الرتبي كون الجملة المعطوفة بها أعلى رتبةً من المعطوفة عليها فإن جملة : { ثم الله شهيد على ما يفعلون } لاشتمالها على التعريض بالجزاء على سوء أفعالهم كانت أهم مرتبة في الغرض وهو غرض الإخبار بأن مرجعهم إلى الله ، لأن إرجاعهم إلى الله مجمل واطلاعه على أفعالهم المكنى به عن مؤاخذتهم بها هو تفصيل للوعيد المجمل ، والتفصيل أهم من الإجمال .وقد حصل بالإجمال ثم بتفصيله تمام تقرير الغرض المسوق له الكلام وتأكيد الوعيد . وأما كون عذاب الآخرة حاصلاً بعد إرجاعهم إلى الله بمهلة جمع ما فيه من تكلف تقرر تلك المهلة هو بحيث لا يناسب حمل الكلام البليغ على التصدي لذكره .وقوله : { الله شهيد على ما يفعلون } خبر مستعمل في معناه الكنائي ، إذ هو كناية عن الوعيد بالجزاء على جميع ما فعلوه في الدنيا بحيث لا يغادر شيئاً .والشهيد : الشاهد ، وحقيقته : المخبر عن أمر فيه تصديق للمخبر ، واستعمل هنا في العالم علم تحقيق .وعبر بالمضارع في قوله : { يفعلون } للإشارة إلى أنه عليم بما يحدث من أفعالهم ، فأما ما مضى فهو بعلمه أجدر .\n\n",
      "translations": [
        {
          "translation": "(Whether We let thee) O Muhammad (behold something of that which We promise them) of chastisement (or (whether We) cause thee to die) before We show you, O Muhammad, that which We promise them of chastisement, (still unto Us is their return) after they die, (and Allah, moreover, is Witness over what they do) of good and evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والسلوك في سبيل الصواب والسداد { أَوْ نَتَوَفَّيَنَّكَ } قبل وصولهم إلى فنائك\n ليسترشدوا منك\n ويستهدوا من زلال هدايتك\n ويسترشحوا من رشحات فيضك وجودك ليصفوا من كدر هوياتهم ورين أنانياتهم { فَإِلَيْنَا مَرْجِعُهُمْ } جميعاً\n ضالاً وهادياً\n رجوع الأظلال إلى الشمس { ثُمَّ } بعد رجوعهم { ٱللَّهُ } المظهر لهم من كتم العدم\n لحكمية العبودية والعرفان { شَهِيدٌ } مطلع حاضر بعلمه الحضوري { عَلَىٰ مَا يَفْعَلُونَ } [يونس: 46] من المعرفة والضلال\n والإيمان والطغيان يجازيهم على مقتضى علمه وخبرته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { نرينك } فعله\n { أو نتوفينك }: عطف عليه\n { فإلينا } جواب { نتوفينك } \n وجواب الأول محذوف\n أي: إن أريتك بعض عذابهم في الدنيا فذاك\n وإن توفيناك قبل ذلك فإلينا مرجعهم\n يقول الحق جل جلاله: { و } اذكر { يومَ نحشُرهم } ونجمعهم للحساب\n فتقصر عندهم مدة لبثهم في الدنيا وفي البرزخ\n { كأن لمْ يلبثوا إلا ساعةً من النهار } يستقصرون مدة لبثهم في الدنيا\n أو في القبور لهول ما يرون\n حال كونهم { يتعارفون بينهم } أي: يعرف بعضهم بعضاً\n كأن لم يتفارقوا إلا قليلاً\n وهذا في أول حشرهم\n ثم ينقطع التعارف لشدة الأمر عليهم لقوله:\n[المعارج: 10]  { قد خَسِرَ الذين كذَّبُوا بلقاءِ الله } خسرانا لا ربح بعده { وما كانوا مهتدين } إلى طريق الربح أصلاً\n أو إلى طريق توصلهم إلى معرفة الله ورضوانه\n لترك استعمال ما منحوه من العقل فيما يوصل إلى الإيمان بالله ورسله\n فاستكسبوا جهالات أدت بهم إلى الرّدى والعذاب الدائم\n { وإما نُرينّك } أي: مهما نبصرنك { بعضَ الذي نَعِدُهم } من العذاب في حياتك\n كما أراه يوم بدر\n { أو نتوفينَّك } قبل أن نريك { فإلينا مَرجِعُهم } فنريكه في الآخرة\n { ثم اللهُ شهيدٌ على ما يفعلون } \n فيجازيهم عليه حينئذٍ\n فالترتيب إخباري\n وقال البيضاوي\n تبعاً للزمخشري: ذكر الشهادة وأراد نتيجتها ومقتضاها\n وهو العقاب\n ولذلك رتبها على الرجوع بثم\n أو مؤدِّ شهادته على أفعالهم يوم القيامة\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:77",
      "similarity": 0.8669903887866905
    },
    {
      "verse": "23:93",
      "similarity": 0.6967409530256474
    },
    {
      "verse": "7:115",
      "similarity": 0.5452267722266347
    },
    {
      "verse": "76:3",
      "similarity": 0.5305615569739225
    },
    {
      "verse": "20:65",
      "similarity": 0.5256918823892643
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010046.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010046.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:46.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}