{
  "chapter": "يونس",
  "text": "ومنهم من يؤمن به ومنهم من لا يؤمن به وربك اعلم بالمفسدين",
  "translations": [
    {
      "translation": "Some of them will believe in it, some will not. Your Lord knows the transgressors well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those some will believe and others will not. Your Lord knows best the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them believe in the Quran and others do not. Your Lord knows best the evil doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is one who accepts faith in it, and among them is one who does not accept faith in it; and your Lord well knows the mischievous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there are some who believe therein; and of them there are some who believe not therein, and your Lord is All-Aware of the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them is he who believes in it, and of them is he who does not believe in it, and your Lord best knows the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of them believe in it, and some believe not in it. Thy Lord knows very well those who do corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them is he who believeth therein, and of them is he who believeth not therein, and thy Lord is Best Aware of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them will believe in it [the Quran], while others will not. And your Lord is fully aware of the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who will believe therein, and of them are some who will not believe therein; and thy Lord is the Best Knower of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them believe in it, and some of them do not believe in it, and your Lord best knows the agents of corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them there are some who believe therein, and some who do not: and thy Lord knoweth best those who are out for mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there are some who believe therein, and of them there are some who believe not therein, and your Lord is All-Aware of the Mufsidun (evil-doers, liars, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some believe in it, while others do not believe it. Your Lord knows well the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are those who believe in it, and among them are those who do not believe in it. Your Lord is fully aware of the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are those who believe in it, and of them are those who do not believe in it. And your Lord is most knowing of the corrupters\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:40] And of them, that is, [of] the people of Mecca, are some who believe in it, God being aware of this in their case, and some who would never believe therein. And your Lord knows very well the corrupters: this is a threat for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of them) of the Jews (is he who believeth therein) he who believes in Muhammad (pbuh) and the Qur'an, i.e. before his death, (and of them) of the Jews (is he who believeth not therein) does not believe in 217 Muhammad (pbuh) or in the Qur'an and dies in a state of disbelief, (and your Lord is best aware of the corrupters) of the Jews, and of those who believe and those who do not believe; it is also said that this verse was revealed about the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنهُمْ } أي: من المكذبين المكابرين { مَّن يُؤْمِنُ بِهِ } أي: بالقرآن، ويصدق بإعجازه في نفسه ويصر على التكذيب؛ عناداً ومكابرةً { وَمِنْهُمْ مَّن لاَّ يُؤْمِنُ بِهِ } لغلط غشاوته، وشدة قساوته وشكيمته { وَ } بالجملة: { رَبُّكَ } يا أكمل الرسل { أَعْلَمُ بِٱلْمُفْسِدِينَ } [يونس: 40] المكذبين المعاندين الذين يفسدون في الأرض بأنواع الفسادات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومنهم } من المكذبين { من يؤمن به } أي: يصدق به في نفسه ويعلم أنه حق ولكن يعاند، أو مَن يؤمن به ويتوب عن كفره، { ومنهم من لا يؤمن به } في نفسه لفرط غباوته وقلة تدبره، أو لا يؤمن فيما يستقبل فيموت على كفره، { وربك أعلم بالمفسدين }: بالمعاندين أو المصرين\n الإشارة: إذا تطهرت القلوب من الأغيار، وتصفّتْ من الأكدار، أوحى إليها بدقائق العلوم والأسرار، وما كان لتلك العلوم أن تُفترى من دون الله ولكن تكون تصديقاً لما قبلها من علوم القوم وأسرارها، التي يهبها الله لأوليائه، وفيها تفصيل طريق السير، وما أوجبه الله على المريدين من الآداب، وشروط المعاملة، فمن طعن في ذلك فليأت بشيء من ذلك من عند نفسه، ويستعنْ على ذلك بأبناء جنسه، بل كذَّب بما لم يُحط به علمُه، ولم يبلغه عقلُه وفهمُه، فإن كشفت عند الله الحقائق ظهر تأويل ما ينطق به أهل الحقائق، ومن الناس من يؤمن بهذه الأسرار، ومنهم من لا يؤمن بها ويطعن على أهلها، حتى ربما رموهم بالزندقة لأجلها، وربك أعلم بالمفسدين\n ثم أمر نبيه بالبراءة ممن كذبه، فقال: { وَإِن كَذَّبُوكَ فَقُل لِّي عَمَلِي وَلَكُمْ عَمَلُكُمْ }\n\n",
      "translations": []
    }
  ]
}