{
  "chapter": "يونس",
  "text": "وان كذبوك فقل لى عملى ولكم عملكم انتم بريـون مما اعمل وانا۠ برىء مما تعملون",
  "translations": [
    {
      "translation": "If they deny you, say, 'I have my actions and you have your actions. You are not responsible for what I do and I am not responsible for what you do.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they (still) call you a liar, tell them: \"For me my actions, for you yours. You are not answerable for my deeds, nor I for what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they reject you as false, tell them: 'My deeds are for myself and your deeds for yourselves. You will not be held responsible for my deeds, nor I for your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they call you a liar, tell them, \"Let each one of us follow his own way. You will not be responsible for what I do and I will not be responsible for what you do\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny you, say, “For me are my deeds, and for you are your deeds; you have no concern with what I do, and I have no relation with what you do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they belie you, say: \"For me are my deeds and for you are your deeds! You are innocent of what I do, and I am innocent of what you do!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they call you a liar, say: My work is for me and your work for you; you are clear of what I do and I am clear of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they cry lies to thee, then do thou say: 'I have my work, and you have your work; you are quit of What I do, and I am quit of what you do.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny thee, say: Unto me my work, and unto you your work. Ye are innocent of what I do, and I am innocent of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they should reject you, say, \"My deeds are mine and your deeds are yours. You are not accountable for my actions, nor am I accountable for what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they belie thee, say thou: unto me my work, and unto you your work: ye are quit of that which I work and am quit of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they deny you, say, ‘My deeds belong to me and your deeds belong to you: you are absolved of what I do and I am absolved of what you do.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they charge thee with falsehood, say: \"My work to me, and yours to you! ye are free from responsibility for what I do, and I for what ye do!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they belie you, say: \"For me are my deeds and for you are your deeds! You are innocent of what I do, and I am innocent of what you do!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they belie you, say: 'I have my work, you have your work. You are quit of what I do, and I am quit of what you do'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they accuse you of lying, say, “I have my deeds, and you have your deeds. You are quit of what I do, and I am quit of what you do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny you, [O Muhammad], then say, \"For me are my deeds, and for you are your deeds. You are disassociated from what I do, and I am disassociated from what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:41] If they deny you, then say, to them: ‘Unto me is my work, and to you your work, that is, for each there will be a [due] requital of his deeds; you are innocent of what I do, and I am innocent of what you do’: this was abrogated by the ‘sword’ verse [Q. 9:5].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if they deny thee) and if your people deny, Muhammad, what you say, (say: Unto me my work) my religion, (and unto you your work) your religion. (You are innocent of what I do) and follow as religion, (and I am innocent of what ye do) and follow as religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن كَذَّبُوكَ } وأصروا على تكذيبك، مع وضوح دلائل صدقك { فَقُل } تبرياً وتنزيهاً: { لِّي عَمَلِي } أنا أُجزى بما أعلم { وَلَكُمْ عَمَلُكُمْ } تُجزون أنتم أيضاً بما تعملون { أَنتُمْ بَرِيۤئُونَ مِمَّآ أَعْمَلُ } منكرون له { وَأَنَاْ } أيضاً { بَرِيۤءٌ مِّمَّا تَعْمَلُونَ } [يونس: 41] بأضعاف براءتكم، فانتظروا بجزاء أعمالكم، وأنا أيضاً أنتظر بجزاء عملي حتى يأتي وقت الجزاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "98:7",
      "similarity": 0.78796627892932
    },
    {
      "verse": "26:216",
      "similarity": 0.699365204708497
    },
    {
      "verse": "12:53",
      "similarity": 0.6800649353887303
    },
    {
      "verse": "43:26",
      "similarity": 0.6459968032864326
    },
    {
      "verse": "11:35",
      "similarity": 0.6052031145973661
    }
  ]
}