{
  "chapter": "يونس",
  "text": "قل لا املك لنفسى ضرا ولا نفعا الا ما شاء الله لكل امة اجل اذا جاء اجلهم فلا يستـخرون ساعة ولا يستقدمون",
  "translations": [
    {
      "translation": "Say: 'I possess no power to harm or help myself except as Allah wills. Every nation has an appointed time. When their appointed time comes, they cannot delay it a single hour or bring it forward.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I have no power over my own gain or loss other than what God may please.\" Every people have a certain term. When their time is come they can neither delay it an hour nor advance it a moment forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: 'I have no power to harm or benefit even myself, except what Allah may will. There is an appointed term for every people; and when the end of their term comes, neither can they put it off for an hour, nor can they bring it an hour before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"I have no control over my suffering or benefits unless God wills. Every nation is destined to live for an appointed time. They can neither delay that time nor can they cause it to come sooner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I have no autonomy to benefit or hurt myself, except what Allah wills*; for every nation is a fixed promise; when their promise comes, they cannot postpone it nor can they advance it one moment. (* To empower me.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I have no power over any harm or profit for myself except what Allah may will. For every Ummah, there is a term appointed; when their term comes, neither can they delay it nor can they advance it an hour (or a moment).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I do not control for myself any harm, or any benefit except what Allah pleases; every nation has a term; when their term comes, they shall not then remain behind for an hour, nor can they go before (their time).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I have no power to profit for myself, or hurt, but as God will. To every nation a term; when their term comes they shall not put it back by a single hour nor put it forward.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I have no power to hurt or benefit myself, save that which Allah willeth. For every nation there is an appointed time. When their time cometh, then they cannot put it off an hour, nor hasten (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I have no control over any harm or benefit to myself, except by the will of God. For every people, however, there is an appointed term. When the end of their term arrives, they cannot postpone it for an hour, nor can they advance it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: I own not any power of hurt or benefit unto myself, save that which Allah may will. For each community is a term; when their term hath arrived, not an hour can they stay behind nor can they advance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I have no control over any benefit for myself nor [over] any harm except what Allah may wish. There is a time for every nation: when their time comes, they shall not defer it by a single hour nor shall they advance it.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I have no power over any harm or profit to myself except as Allah willeth. To every people is a term appointed: when their term is reached, not an hour can they cause delay, nor (an hour) can they advance (it in anticipation).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"I have no power over any harm or profit to myself except what Allah may will. For every Ummah (a community or a nation), there is a term appointed; when their term is reached, neither can they delay it nor can they advance it an hour (or a moment).\" (Tafsir Al-Qurtubi).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I have no power to benefit or harm myself except as Allah wills. To every nation is a fixed term and when their term comes they cannot delay it for an hour, nor can they bring it forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I have no power to harm or benefit myself, except as God wills. To every nation is an appointed time. Then, when their time arrives, they can neither postpone it by one hour, nor advance it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I possess not for myself any harm or benefit except what Allah should will. For every nation is a [specified] term. When their time has come, then they will not remain behind an hour, nor will they precede [it].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:49] Say: ‘I have no power to, avert, hurt, from, myself, or to, bring, benefit, except as God might will, to give me power over: so how could I possess the power to bring about the chastisement? For every community there is an appointed time, a fixed period until they perish. When their time comes, they cannot put it off, they will not miss it, by a single hour, nor bring it forward, [nor] overtake it’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "218 (Say) to them, Muhammad: (I have no power to) avoid (hurt or) bring (benefit) to (myself, save that which Allah willeth) of hurt or benefit. (For every nation there is an appointed time) a respite and determined time. (When their time cometh) when the time of their destruction comes, (then they cannot put it off an hour) after the appointed time, (nor hasten (it)) before the appointed time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } يا أكمل الرسل: { لاَّ أَمْلِكُ لِنَفْسِي } ولا أقدر أن أكتسب عليها ولها { ضَرّاً وَلاَ نَفْعاً إِلاَّ مَا شَآءَ ٱللَّهُ } وقدره في سباق قضائه، ومتى لم أقدر على أحوال نفسي، فكيف لي قدرة على استعجال ما في مشيئة الله في غيبه وتعيين وقته؟ مع أنه لم يأذن لي، ولم يوح إلي من عنده سوى أن { لِكُلِّ أُمَّةٍ } من الأمم سواء كانوا محقين أو مبطلين { أَجَلٌ } معين، ووقت مقدر، مقرر في علم الله { إِذَا جَآءَ أَجَلُهُمْ } الذي عيَّنه الحق؛ لإهلاكهم فيه لا يمكن التخلف فيه إذن لا استعجال ولا استئجار { فَلاَ يَسْتَأْخِرُونَ سَاعَةً وَلاَ يَسْتَقْدِمُونَ } [يونس: 49] أي: لا يمكنهم طلب التأخير لمحةً وطرفةً؛ إذ الساعة مصروفة إلى مطلق الزمان؛ ليدفعوا الضر، ولا يمكنهم أيضاً طلب التقديم؛ ليجلبوا النفنع، بل الأمر حتم في وقته، لا يتجاوز عنه أصلاً، فانتظروا فسيجيء أجلكم ووقتكم، وينجز وعدكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}