{
  "chapter": "يونس",
  "text": "ومنهم من ينظر اليك افانت تهدى العمى ولو كانوا۟ لا يبصرون",
  "translations": [
    {
      "translation": "Among them there are some who look at you. But can you guide the blind, even though they cannot see?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them look toward you: But can you show the blind the way even when they cannot see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them some look towards you; will you, then, guide the blind, even though they can see nothing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them will look at you, but are you supposed to guide the blind even if they have no vision?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is one who gazes at you; so will you guide the blind* even if they cannot perceive? (* Deaf or blind to guidance.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who look at you, but can you guide the blind -- even though they see not\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are those of them who look at you, but can you show the way to the blind though they will not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of them look unto thee; what, wilt thou then guide the blind, though they do not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them is he who looketh toward thee. But canst thou guide the blind even though they see not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them look fixedly at you; but can you make the blind see, bereft as they are of sight?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who look at thee, so canst thou guide the blind, even though they see not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some of them who observe you. But can you guide the blind even if they do not perceive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who look at thee: but canst thou guide the blind,- even though they will not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who look at you, but can you guide the blind, even though they see not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them look to you. But can you guide the blind, even though they do not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who look at you. But can you guide the blind, even though they do not see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who look at you. But can you guide the blind although they will not [attempt to] see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:43] And of them are some who look toward you. But will you guide the blind, even though they do not see? — He likens them [the Meccan disbelievers] to these [the blind] because they fail to be guided, nay, [they are] much worse [since God says]: It is not the eyes that are blind, but blind are the hearts within the breasts [Q. 22:46].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n<!-- TODO:DUPLICATE -->\n\nلما سبق تقسيم المشركين بالنسبة إلى اعتقادهم في الأصنام إلى من يتبع الظن ومن يوقن بأن الأصنام لا شيء ، وتقسيمهم بالنسبة لتصديق القرآن إلى قسمين : من يؤمن بصدقه ومن لا يؤمن بصدقه؛ كمُل في هذه الآية تقسيمهم بالنسبة للتلقي من النبي صلى الله عليه وسلم إلى قسمين : قِسم يحضرون مجلسه ويستمعون إلى كلامه ، وقسم لا يحضرون مجلسه وإنما يتوسمونه وينظرون سمته . وفي كلا الحالين مسلك عظيم إلى الهدى لو كانوا مهتدين؛ فإن سماع كلام النبي وإرشادِه ينير عقول القابلين للهداية ، فلا جرم أن كان استمرار المشركين على كفرهم مع سماعهم كلام النبي أو رؤية هديه مؤذناً ببلوغهم الغاية في الضلالة مَيئوساً من نفوذ الحق إليهم ، وليس ذلك لقصور كلامه عن قوة الإبلاغ إلى الاهتداء ، كما أن التوسم في سمته الشريف ودلائل نبوءته الواضحة في جميع أحواله كاف في إقبال النفس عليه بشراشرها ، فما عُدم انتفاع الكفار الذين يعاينون ذاته الشريفة بمعاينتها إلا لشدة بغضهم إياه وحسدهم ، وقد أفاد سياق الكلام أنهم يستمعون إليه وينظرون إليه ولا ينتفعون بذلك من جهة أن المستمعين إليه والناظرين إليه هنا استمروا على الكفر كما دل عليه قوله : { وَمِنْهُمْ } في الموضعين ، فطويت جملة : ولا ينتفعون أو نحوها لِلإيجاز بدلالة التقسيم . وجيء بالفعل المضارع دون اسم الفاعل للدلالة على تكرر الاستماع والنظر . والحرمان من الاهتداء مع ذلك التكرر أعجب .فجملة : { أَفَأَنتَ تُسْمِعُ الصم وَلَوْ كَانُواْ لاَ يَعْقِلُونَ } تفريع على جملة : { مَّن يَسْتَمِعُونَ إِلَيْكَ } مع ما طوي فيها . وفي هذا التفريع بيان لسبب عدم انتفاعهم بسماع كلام النبي صلى الله عليه وسلم وتسلية له وتعليم للمسلمين ، فقُربت إليهم هذه الحالة الغريبة بأن أولئك المستمعين بمنزلة صُم لا يعقلون في أنهم حُرموا التأثر بما يسمعون من الكلام فساووا الصم الذين لا يعقلون في ذلك ، وهذه استعارة مصرحة إذ جعلهم نفس الصم .وبُني على ذلك استفهام عن التمكن من إسماع هؤلاء الصم وهدي هؤلاء العمي مع أنهم قد ضموا إلى صَممهم عدم العقل وضموا إلى عَماهم عدم التبصر . وهذان الاستفهامان مستعملان في التعجيب من حالهم إذ يستمعون إلى دعوة النبي صلى الله عليه وسلم ولا يعقلونها ، وإذ ينظرون أعماله وسِيرته ولا يهتدون بها ، فليس في هذين الاستفهامين معنى الإنكار على محاولة النبي إبلاغهم وهديهم لأن المقام ينبُو عن ذلك .وهذه المعاني المجازية تختلف باختلاف المقام والقرائن ، فلذلك لم يكن الاستفهامان إنكاراً ، ولذلك لا يتوهم إشكال بأن موقع ( لو ) الوصلية هنا بعدما هو بمعنى النفي بحيث تنتقض المبالغة التي اجتلبت لها ( لو ) الوصلية ، بل المعنى بالعكس .وفي هذين الاستفهامين ترشيح لاستعارة الصم والعمي لهؤلاء الكافرين ، أي أن الله لما خلق نفوسهم مفطورة على المكابرة والعناد وبغضاء من أنعم الله عليه وحسده كانت هاته الخصال حوائل بينهم وبين التأثر بالمسموعات والمبصرات فجيء بصيغة الاستفهام التعجيبي المشتملة على تقَوّي الخبر بتقديم المسند إليه على الخبر الفعلي بقوله : { أفأنت تسمع } وقوله : { أفأنت تهدي } دون أن يقال : { أتسمع الصم } و { أتهدي العمي } ، فكان هذا التعجيب مؤكداً مقوى .و ( لو ) في قوله : { ولو كانوا لا يعقلون } وقوله : { ولو كانوا لا يبصرون } ، وصلية دالة على المبالغة في الأحوال ، وهي التي يكون الذي بعدها أقصى ما يعلق به الغرض . ولذلك يقدرون لتفسير معناها جملة قبل جملة ( لو ) مضمونها ضِد الجملة التي دخلت عليها ( لو ) ، فيقال هنا : أفأنت تسمع الصم لَوْ كانوا يعقلون بل ولو كانوا لا يعقلون .ولما كان الغرض هنا التعجيب من حالهم إذ لم يصلوا إلى الهدى كان عدم فهمهم وعدم تبصرهم كناية عن كونهم لا يعقلون وكونهم لا بصائر لهم . فمعنى : { لا يعقلون } ليس لهم إدراك العقول ، أي ولو انضم إلى صممهم عدم عقولهم فإن الأصم العاقل ربما تفرس في مخاطَبِه واستدل بملامحه .وأما معنى : { لا يبصرون } فإنهم لا بصيرة لهم يتبصرون بها . وهو الذي فسر به «الكشاف» وهو الوجه ، إذ بدونه يكون معنى : { لا يبصرون } مساوياً لمعنى العمى فلا تقع المبالغة ب ( لو ) الوصلية موقعها ، إذ يصير أفأنت تهدي العمي ولو كانوا عمياً . ومقتضى كلام «الكشاف» أنه يقال : أبصر إذا استعمَل بصيرته وهي التفكير والاعتبار بحقائق الأشياء . وكلامُ «الأساس» يحوم حوله . وأيَّاً ما كان فالمراد بقوله : { لا يبصرون } معنى التأمل ، أي ولو انضم إلى عَمى العُمي عدم التفكير كما هو حال هؤلاء الذين ينظرون إليك سواء كان ذلك مدلولاً لفعل { يبصرون } بالوضع الحقيقي أو المجازي . فبهذا النظم البديع المشتمل على الاستعارة في أوله وعلى الكناية في آخره وعلى التعجيب وتقويته في وسطه حصل تحقيق أنهم لا ينتفعون بأسماعهم ولا بأبصارهم وأنهم لا يعقلون ولا يتبصرون في الحقائق .وقد علم أن هذه الحالة التي اتصفوا بها هي حالة أصارَهم الله إليها بتكوينه وجعلها عقاباً لهم في تمردهم في كفرهم وتصلبهم في شركهم وإعراضهم عن دعوة رسوله ولذلك جعلهم صماً وعمياً . فليس المعنى أن الله هو الذي يسمعهم ويهديهم لا أنت لأن هذا أمر معلوم لا يحتاج للعبارة .وقد أورد الشيخ ابن عرفة سؤالاً عن وجه التفرقة بين قوله : { من يستمعون } وقوله : { من يَنظر } إذ جيء بضمير الجمع في الأول وبضمير المفرد في الثاني . وأجاب عنه بأن الإسماع يكون من الجهات كلها وأما النظر فإنما يكون من الجهة المقابلة . وهو جواب غير واضح لأن تعدد الجهات الصالحة لأحد الفعلين لا يؤثر إذا كان المستمعون والناظرون متحدين ولأن الجمع والإفراد هنا سواء لأن مفاد ( مَن ) الموصولة فيهما هو من يصدر منهم الفعل وهم عدد وليس الناظر شخصاً واحداً .والوجه أن كلا الاستعمالين سواء في مراعاة لفظ ( من ) ومعناها ، فلعل الابتداء بالجمع في صلة ( مَن ) الأولى الإشارة إلى أن المراد ب ( من ) غير واحد معيَّن وأن العدول عن الجمع في صلة ( من ) الثانية هو التفنن وكراهية إعادة صيغة الجمع لثقلها لا سيما بعد أن حصل فهم المراد ، أو لعل اختلاف الصيغتين للمناسبة مع مادة فعلي ( يستمع ) و ( ينظر ). ففعل ( ينظر ) لا تلائمه صيغة الجمع لأن حروفه أثقل من حروف ( يَستمع ) فيكون العدول استقصاء لمقتضى الفصاحة .\n\n",
      "translations": [
        {
          "translation": "(And of them) of the Jews; and it is said: of the idolaters (is he who looketh towards you. But canst thou guide) lead to guidance (the blind even though they see not) even though they do not desire to see the Truth and guidance?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ومنهم من ينظر إليك } ولكن لا يبصر الحق ولا حقيقتك لأحد الأمرين المذكورين أو كليهما كالأعمى الذي انضمّ إلى فقدان بصره فقدان البصيرة فلا يبصر ولا يستبصر فكيف تمكن هدايته\n { إنّ الله لا يظلم الناس شيئاً } لما ذكر الصمم والعمى اللذين يدلان على عدم استعداد الإدراك أشعر الكلام بوقوع الظلم لوجود الاستعداد لبعض وعدمه لبعض فسلب الظلم عن نفسه لأن عدم الاستعداد في الأصل ليس ظلماً لعدم إمكان ما هو أجود منه بالنسبة إلى خصوصية ذلك وهويته فكان عينه مقتضياً له في رتبة من مراتب الإمكان كما لا يمكن للحمار مع حماريته استعداد الإدراك الإنساني وكان عينه مستدعياً لما هو عليه من الاستعداد الحماري ولا يطلب منه وراء ما في استعداده فلا ظلم هذا إذا لم يكن في الأصل وأما إذا بطل برسوخ الهيئات المظلمة فلا كلام فيه وكلاهما ظالم لنفسه\n أما الأول فلقصوره في درجات الإمكان ونقصانه بالإضافة إلى ما فوقه كقصور الحمار مثلاً عن الإنسان ونقصانه بالإضافة إليه لا في نفسه فإنه في حدّ نفسه ليس بقاصر ولا ناقص",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومنهم من ينظر إليك } أي: يعاينون دلائل نبوتك\n ولكن لا يصدقون\n كأنهم عمي عنها\n { أفأنت تهدي العُمْيَ }: تقدر على هدايتهم { ولو كانوا لا يُبصرون } أي: وإن انضم إلى عدم البصرَ عدم البصيرة\n فإن المقصود من الإبصار هو الاعتبار والاستبصار\n والعمدة في ذلك البصيرة\n فإذا فقدت فلا اعتبار ولا استبصار\n ولذلك يُحدس الأعمى المتبصر\n ويتفطن لما لا يدركه البصير الأحمق\n والآية كالتعليل للأمر بالتبري\n { إن الله لا يظلم الناسَ شيئاً } بسلب حواسهم وعقولهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:19",
      "similarity": 0.6901364757430427
    },
    {
      "verse": "80:2",
      "similarity": 0.649616080704492
    },
    {
      "verse": "20:125",
      "similarity": 0.6164495299805561
    },
    {
      "verse": "17:72",
      "similarity": 0.5900501895783109
    },
    {
      "verse": "27:81",
      "similarity": 0.5823849117015714
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}