{
  "chapter": "يونس",
  "text": "قل ارءيتم ما انزل الله لكم من رزق فجعلتم منه حراما وحللا قل ءالله اذن لكم ام على الله تفترون",
  "translations": [
    {
      "translation": "Say: 'What do you think about the things Allah has sent down to you as provision which you have then designated as halal and haram?' Say: 'Has Allah given you authority to do this or are you inventing lies against Allah?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Have you thought of what God has sent you for food, of which you have labelled some as lawful and some forbidden?\" And ask: \"Has God commanded this, or you are imputing lies to God?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you consider that the sustenance which Allah had sent down for you of your own accord you have declared some of it as unlawful and some as lawful? Ask them: 'Did Allah bestow upon you any authority for this or do you forge lies against Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, \"Have you considered that out of the sustenance which God has given you, you made some of it lawful and some unlawful? Did God permit you to do this or are you ascribing falsehood to Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What is your opinion – (regarding) the sustenance that Allah has sent down for you? So you have, on your own, deemed lawful and unlawful in it!”; say, “Has Allah given you permission for it, or do you fabricate a lie against Allah?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me, what provision Allah has sent down to you! And you have made of it lawful and unlawful.\" Say: \"Has Allah permitted you (to do so), or do you invent a lie against Allah\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Tell me what Allah has sent down for you of sustenance, then you make (a part) of it unlawful and (a part) lawful. Say: Has Allah commanded you, or do you forge a lie against Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Have you considered the provision God has sent down for you, and you have made some of it unlawful, and some lawful?' Say: 'Has God given you leave, or do you forge against God?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have ye considered what provision Allah hath sent down for you, how ye have made of it lawful and unlawful? Hath Allah permitted you, or do ye invent a lie concerning Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered the provision God has sent down for you, and have you made some of it unlawful and some lawful?\" Say, \"Has God given you permission [to do this], or are you inventing falsehoods about God?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: bethink ye of that which Allah hath sent down unto you of provision, and ye have then made thereof allowable and forbidden? Say thou: is it that Allah hath given you leave, or fabricate ye a lie against Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Have you regarded what Allah has sent down for you of [His] provision, whereupon you have made some of it unlawful and [some] lawful?’ Say, ‘Did Allah give you the sanction [to do so], or do you fabricate a lie against Allah?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"See ye what things Allah hath sent down to you for sustenance? Yet ye hold forbidden some things thereof and (some things) lawful.\" Say: \"Hath Allah indeed permitted you, or do ye invent (things) to attribute to Allah?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to these polytheists): \"Tell me, what provision Allah has sent down to you! And you have made of it lawful and unlawful.\" Say (O Muhammad SAW): \"Has Allah permitted you (to do so), or do you invent a lie against Allah?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Have you considered the provision that Allah has sent down for you, and some you have made unlawful and some lawful' Say: 'Has Allah given you His permission, or do you forge (falsehood) against Allah'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered the sustenance God has sent down for you, some of which you made unlawful, and some lawful?” Say, “Did God give you permission, or do you fabricate lies and attribute them to God?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you seen what Allah has sent down to you of provision of which you have made [some] lawful and [some] unlawful?\" Say, \"Has Allah permitted you [to do so], or do you invent [something] about Allah?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:59] Say: ‘Have you considered, inform me, what provision God has revealed, has created, for you, how you have made some of it unlawful and some lawful?’, as in the case of [the camels called] al-Bahīra or al-Sā’iba, and carrion. Say: ‘Has God given you permission, to make that lawful or unlawful? No! Or do you, nay [you], invent lies concerning God?’, by attributing that to Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca: (Have ye considered what provision) what crops and cattle (Allah hath sent down for you) Allah has created for you, (how ye have made of it lawful) for men (and unlawful) for women: i.e. the benefit of al-Bahirah, al-Sa'ibah and al-Ham? (Say) to them, Muhammad: (Hath Allah permitted you) has Allah commanded this, (or do ye invent a lie concerning Allah) indeed you are inventing lies?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قل أرأيتم ما أنزل الله } إلى آخره، أي: أخبروني ما أنزل الله من رزق معنوي كالحقائق والمعارف والأحوال والمواهب وكالآداب والشرائع والمواعظ والنصائح { فجعلتم } بعضه { حراماً } كالقسم الأول { و } بعضه { حلالاً } كالقسم الثاني { قل الله أذن لكم } في الحكم بالتحريم والتحليل { أم على الله تفترون وما ظنّ الذين يفترون على الله الكذب يوم القيامة } الوسطى بتجرّد القلب عن ملابس النفس وحصول اليقين أو يوم القيامة الكبرى بالتوحيد الذاتي وظهور العيان، أي: لا يبقى ظنهم وليس شيئاً حينئذ أو يوم القيامة الصغرى بالموت وحصول الحرمان أي: يكون ظنهم وبالاً وعذاباً حينئذ { إنّ الله لذو فضل على الناس } بصنفي العلمين وإفاضتهما وتوفيق القبول لهما وتهيئة الاستعداد لقبولهما { ولكن أكثرهم لا يشكرون } نعمته فيستعملون ما وهب لهم من الاستعداد والعلوم في تحصيل المنافع الجزئية والمطالب الحسية ويكفرون نعمته فيمنعون عن الزيادة\n { ألا إن أوليَاء الله } المستغرقين في عين الهوية الأحدية بفناء الأنية { لا خوف عليهم } إذ لم يبق منهم بقية خافوا بسببها من حرمان ولا غاية وراء ما بلغوا فيخافوا من حجبه { ولا هم يحزنون } لامتناع فوات شيء من الكمالات واللذات منهم، فيحزنوا عليه\n وعن سعيد بن جبير رضي الله عنه: إن رسول الله صلى الله عليه وسلم سُئل من هم؟ فقال:\n\n \" هم الذين يذكروا الله برؤيتهم \" \n\nوهذا رمز لطيف منه عليه السلام\n وعن عمر رضي الله عنه: سمعت رسول الله صلى الله عليه وسلم يقول:\n\n \" إن من عباد الله عباداً ما هم بأنبياء ولا شهداء يغبطهم الأنبياء والشهداء يوم القيامة لمكانهم من الله \" ، قالوا: يا رسول الله، أخبرنا من هم وما أعمالهم؟ فلعلنا نحبهم\n قال: \" هم قوم تحابّوا في الله على غير أرحام بينهم ولا أموال يتعاطونها، فوالله إن وجوههم لنور وإنهم لعلى منابر من نور، لا يخافون إذا خاف الناس ولا يحزنون إذا حزن الناس \" \n\n \n\nثم قرأ الآية\n قوله: وإنهم لعلى منابر من نور، يريد به اتصالهم بالمبادئ العالية الروحانية كالعقل الأول وما يليه\n { الذين آمنوا وكانوا يتّقون } إن جعل صفة لأولياء الله فمعناه الذين آمنوا بالإيمان الحقيّ وكانوا يتقون بقاياهم وظهور تلويناتهم\n { لهم البُشْرى في الحياة الدنيا } بوجود الاستقامة في الأعمال والأخلاق المبشرة بجنة النفوس { وفي الآخرة } بظهور أنوار الصفات والحقائق الروحانية والمعارف الحقّانية عليهم المبشرة بجنة القلوب وحصول الذوق بهما واللذة { لا تبديل لكلمات الله } لحقائقه الواردة عليهم وأسمائه المنكشفة لهم وأحكام تجلياته النازلة بهم، وإن جعل كلاماً برأسه مبتدأ فمعناه الذين آمنوا الإيمان اليقيني وكانوا يتقون حجب صفات النفس وموانع الكشف من التشكيكات الوهمية والوساوس الشيطانية { لهم البشرى في الحياة الدنيا } بوجدان لذة برد اليقين في النفس واطمئنانها بنزول السكينة وفي الآخرة بوجدان ذوق تجليات الصفات وأثر أنوار المكاشفات لا تبديل لكلمات الله من علومهم اللدنية وحكمهم اليقينية أو فطرتهم التي فطرهم الله عليها فإن كل نفس كلمة\n\n",
      "translations": [
        {
          "translation": "\n\nWhat do you think of what Allah has sent down to the end?,\n\n{ } Tell me what God has revealed of spiritual provisions, such as truths, knowledge, affairs, talents, and manners, { } some of which you have made { } unlawful, like the first category, { } and some of which you have made { } lawful, like the second category. { } Say, \"God has permitted you to judge between what is unlawful and what is lawful.\" { } Or do you attribute to God that which you invent, while those who attribute falsehoods to God on the Day of Judgment will have no success? { } The middle way is to purify the heart from the clothing of the self and to attain certainty, or on the Day of Judgment, to achieve self-unification and the manifestation of vision.,\n\nThis means that their opinion will be of no value or consequence on the Day of Judgment, and they will die and be deprived {of Allah's mercy}. Rather, their opinion will be of value and they will be punished {for their ingratitude}. The scholars and those who accept them are the ones who will benefit from this, and they will be accepted and prepared {for Allah's mercy}, but most people do not thank {Allah} for His blessings and instead use what He has given them in terms of preparation and knowledge to pursue worldly gains and desires, and they disbelieve in His blessings by preventing others from benefiting.\n\n{ Indeed, the } companions of Allah { will have no fear } when they are drowned in the unity of the One { and no grief } when they remain no more, because they feared due to what they were deprived of and had no desire for anything beyond what they reached, so they feared being cut off { and they will not grieve } when they are prevented from anything of the perfections and pleasures that are with them., They grieved for him\n\n\nAnd on the authority of Sa'eed ibn Jubayr, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, was asked: \"Who are the people?\" He replied:\n \"They are the ones who remember Allah with their vision.\"\n\n\nThis is a lovely code from him, peace be upon him.\n\n\nI heard the Messenger of Allah (peace and blessings of Allah be upon him) say: \"The best of you are those who are {the best} to their wives, and I am the best of you to my wives.\"\n\n\n\"Among the servants of Allah are those who are neither prophets nor martyrs, but who are nonetheless beloved by the prophets and martyrs on the Day of Resurrection. Their place with Allah is special.\", They said: O Messenger of Allah,\n\nTell us about who they are and what they do? Perhaps we will love them.\n He said, \"They are a people who love each other for the sake of God, without any kinship or wealth between them.\",\n\nBy Allah, their faces are radiant with light, and they are on a platform of light.,\n\nThey are neither afraid when people are afraid, nor do they grieve when people grieve.\n\n\nThen read the verse.\n They are on {minbars} of Light., He wants to connect with their higher spiritual principles, like the first mind, and what follows it.\n\n\n{Those who believe and are mindful of God} - this refers to those who have faith in the true faith, and are mindful of Him in their words and deeds.\n\n\n{They have the good news in this life} with the stability in deeds and good character {and in the Hereafter} with the appearance of the lights of divine attributes and realities, and true knowledge {of Allah's words} which are manifested to them, and His decrees which are revealed to them.,\n\nAnd if one were to make a statement with its head starting point, then its meaning would be those who believed with certain faith, and they were pious, {they have good news in this life}, with a consciousness of pleasure in the cold of faith in the self, and its assurance with the descent of serenity, and in the Hereafter with a taste of the manifestations of the attributes and the effect of the lights of the unveilings, there is no change in the words of Allah from their worldly knowledge and their certain ruling, or their nature which Allah created them with; for every self is a word",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ أَرَأَيْتُمْ } أي: أخبروني كيف كفرتم في { مَّآ أَنزَلَ ٱللَّهُ لَكُمْ } لمعاشكم وتقوية مزاجكم { مِّن رِّزْقٍ } مسوق إليكم محصل بأسباب سماوي مباح لكم { فَجَعَلْتُمْ } من تلقاء أنفسكم { مِّنْهُ حَرَاماً وَحَلاَلاً } أي: حرمتم بعضه وحللتم بعضاً آخر بلا ورود شرع { قُلْ } لهم يا أكمل الرسل إلزاماً وتقريعاً: { ءَآللَّهُ أَذِنَ لَكُمْ } بهذه التفرقة والقسمة { أَمْ عَلَى ٱللَّهِ تَفْتَرُونَ } [يونس: 59] بنسبتها إليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ما أنزل: نصب بأنزل أو بأرأيتم لأنه بمعنى اخبروني\n  يقول الحق جل جلاله: { قل أرأيتم }: أخبروني { ما أنزل الله لكم من رزقٍ } بقدرته، وإن سترها بالأسباب العادية، وقوله: { لكم } دل على أن المراد منه: ما حلّ، ولذلك وبَّخ على التبعيض بقوله: { فجعلتم منه حراماً وحلالاً } كالبحائر وأخواتها،\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:87",
      "similarity": 0.4003879811129644
    },
    {
      "verse": "5:88",
      "similarity": 0.3930412960296905
    },
    {
      "verse": "66:1",
      "similarity": 0.3854670063331413
    },
    {
      "verse": "16:116",
      "similarity": 0.3842090270542097
    },
    {
      "verse": "34:8",
      "similarity": 0.3560153081005916
    }
  ]
}