{
  "chapter": "يونس",
  "text": "يايها الناس قد جاءتكم موعظة من ربكم وشفاء لما فى الصدور وهدى ورحمة للمؤمنين",
  "translations": [
    {
      "translation": "Mankind! admonition has come to you from your Lord and also healing for what is in the breasts and guidance and mercy for the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, a warning has come to you from your Lord, a remedy for the (doubts) of the heart, and a guidance and grace for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men! Now there has come to you an exhortation from your Lord, a healing for the ailments of the hearts, and a guidance and mercy for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, good advice has come to you from your Lord a (spiritual) cure, a guide and a mercy for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! The advice has come to you from your Lord and a cure for the hearts – and guidance and mercy for believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! There has come to you good advice from your Lord, and a cure for that which is in your breasts, -- a guidance and a mercy for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! there has come to you indeed an admonition from your Lord and a healing for what is in the breasts and a guidance and a mercy for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, now there has come to you an admonition from your Lord, and a healing for what is in the breasts, and a guidance, and a mercy to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! There hath come unto you an exhortation from your Lord, a balm for that which is in the breasts, a guidance and a mercy for believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! There has come to you an admonition from your Lord, a cure for what is in the hearts, and a guide and a blessing to true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Mankind! now there hath come unto you an exhortation from your Lord and a healing for that which is in Your breasts, and a guidance and a mercy for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! There has certainly come to you an advice from your Lord, and a cure for what is in the breasts, and a guidance and mercy for the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! there hath come to you a direction from your Lord and a healing for the (diseases) in your hearts,- and for those who believe, a guidance and a Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! There has come to you a good advice from your Lord (i.e. the Quran, ordering all that is good and forbidding all that is evil), and a healing for that (disease of ignorance, doubt, hypocrisy and differences, etc.) in your breasts, - a guidance and a mercy (explaining lawful and unlawful things, etc.) for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, an admonition has now come to you from your Lord, and a healing for what is in the chests, a guide and a mercy to believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! There has come to you advice from your Lord, and healing for what is in the hearts, and guidance and mercy for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, there has to come to you instruction from your Lord and healing for what is in the breasts and guidance and mercy for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:57] O people, that is, inhabitants of Mecca, there has come to you an admonition from your Lord, a Book which contains [mention] of that which is [permissible] for you and that which is enjoined on you, and this [Book] is the Qur’ān; and a healing, a cure, for what is in the breasts, of corrupt beliefs and uncertainties, and a guidance, from error, and a mercy for those who believe, in it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O mankind!) O people of Mecca! (There hath come unto you an exhortation) a warning (from your Lord) regarding that which you are now in, (a balm) an exposition (for that which is in the breasts) of blindness, (a guidance) from error (and a mercy) which brings relief from punishment (for believers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الناس قد جاءتكم موعظة } أي: تزكية لنفوسكم بالوعد والوعيد والإنذار والبشارة والزجر عن الذنوب المورطة في العقاب والتحريض على الأعمال الموجبة للثواب لتعملوا على الخوف والرجاء { وشفاء لما في الصدور } أي: القلوب من أمراضها كالشك والنفاق والغلّ والغش وأمثال ذلك بتعليم الحقائق والحكم الموجبة لليقين وتصفيتها لقبول المعارف والتنوّر بنور التوحيد\n والتهيئ لتجليات الصفات { وهدىً } لأرواحكم إلى الشهود الذاتي { ورحمة } بإفاضة الكمالات اللائقة بكل مقام من المقامات الثلاث بعد حصول الاستعداد في مقام النفس بالموعظة ومقام القلب بالتصفية ومقام الروح بالهداية { للمؤمنين } بالتصديق أولاً ثم باليقين ثانياً ثم بالعيان ثالثاً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّاسُ } الناسين المنشأ الأصلي والوطن الحقيقي { قَدْ جَآءَتْكُمْ } لإيقاظكم وانتباهكم { مَّوْعِظَةٌ } وتذكير { مِّن رَّبِّكُمْ وَشِفَآءٌ لِّمَا فِي ٱلصُّدُورِ } أي: تشفيه لغليلكم وأكنتكم المستكنة في صدوركم { وَهُدًى } هادياً لأرباب الغاية والوصول إلى مقر التوحيد { وَرَحْمَةٌ } عامة شاملة { لِّلْمُؤْمِنِينَ } [يونس: 57] من أصحاب البر والتقوى فعليكم أن تتعظوا وتتذكروا بأحكامه\n وتتأملوا في رموزه وإشاراته\n وتدبروا في مفاتحه ومطعاله\n حتى تنكشفوا منه بقدر وسعكم وطاقتكم ما تنكشفوا\n والله الهادي إلى جنابه من يشاء من عباده وهو العزيز الحكيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: بفضل الله يتعلق بمحذوف\n يفسره ما بعده\n أي: ليفرحوا بفضل الله\n أو بقوله: \" فليفرحوا \"\n وكرر قوله: فبذلك تأكيداً والفاء بمعنى الشرط\n كأنه قال: إن فرحوا بشيء فبهما فليفرحوا\n يقول الحق جل جلاله: { يا أيها الناسُ قد جاءتكم موعظة من ربكم } يعنى القرآن العظيم\n { وشفاء لما في الصدور } من الشك والجهل\n { وهُدىً ورحمةٌ للمؤمنين } هداية في بواطنهم بأنوار التحقيق\n ورحمة في ظواهرهم بآداب التشريع\n قال البيضاوي: قد جاءكم كتاب جامع للحكمة العملية\n الكاشف عن محاسن الأعمال وقبائحها\n والراغبة في المحاسن\n والزاجرة عن القبائح\n والحكمة النظرية التي هي شفاء لما في الصدور من الشكوك وسوء الاعتقاد\n وهدى إلى الحق واليقين\n ورحمة للمؤمنين حيث أنزلت عليهم فنجوا من ظلمات الضلال بنور الإيمان\n وتبدلت مقاعدهم من طبقات النيران بمصاعد من درجات الجنان\n والتنكير فيها للتعظيم\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:14",
      "similarity": 0.7307537103529363
    },
    {
      "verse": "17:82",
      "similarity": 0.7077058994607722
    },
    {
      "verse": "26:80",
      "similarity": 0.7054986356131838
    },
    {
      "verse": "16:69",
      "similarity": 0.3812688985090723
    },
    {
      "verse": "41:44",
      "similarity": 0.3308368775689365
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/10:57.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/10:57.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:57.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}