{
  "chapter": "يونس",
  "text": "الا ان لله ما فى السموت والارض الا ان وعد الله حق ولكن اكثرهم لا يعلمون",
  "translations": [
    {
      "translation": "Yes, everything in the heavens and earth belongs to Allah. Yes, Allah's promise is true but most of them do not know it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For all that is in the heavens and the earth belongs to God. Remember, the promise of God is true. But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed all that is in the heavens and the earth belongs to Allah. And most certainly Allah's promise will be fulfilled, though most men are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth certainly belongs to God and His promise is true, but many people do not know this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pay heed! Indeed everything that is in the heavens and the earth belongs only to Allah; pay heed! Indeed Allah’s promise is true, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No doubt, surely, all that is in the heavens and the earth belongs to Allah. No doubt, surely, Allah's promise is true. But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now surely Allah's is what is in the heavens and the earth; now surely Allah's promise is true, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, surely to God belongs everything that is in the heavens and earth. Why, surely God's promise is true; but the most of them have no knowledge\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! verily all that is in the heavens and the earth is Allah's. Lo! verily Allah's promise is true. But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly, everything that is in the heavens and on the earth belongs to God. Assuredly, God's promise is true. Yet most of them do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! verily Allah's is whatsoever is In the heavens and the earth, Lo! verily Allah's promise is true; but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look! To Allah indeed belongs whatever is in the heavens and the earth. Look! Allah’s promise is indeed true; but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not (the case) that to Allah belongeth whatever is in the heavens and on earth? Is it not (the case) that Allah's promise is assuredly true? Yet most of them understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No doubt, surely, all that is in the heavens and the earth belongs to Allah. No doubt, surely, Allah's Promise is true. But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, to Allah belongs everything in the heavens and the earth. Indeed, the promise of Allah is true though most of them do not have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly, to God belongs everything in the heavens and the earth. Assuredly, the promise of God is true. But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unquestionably, to Allah belongs whatever is in the heavens and the earth. Unquestionably, the promise of Allah is truth, but most of them do not know\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:55] Why, surely to God belongs all that is in the heavens and the earth. Why, surely God’s promise, of resurrection and requital, is true, [is] fixed, but most of them, people, do not know, this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! verily all that is in the heavens and the earth) of created beings and marvels (is Allah's. Lo! verily Allah's promise is true) resurrection after death will truly take place. (But most of them know not) most of them do not believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلاۤ إِنَّ للَّهِ } وحيطة قدرته وعلمه { مَا } ظهر { فِي ٱلسَّمَاوَاتِ وَ } ما ظهر في { ٱلأَرْضِ } من الكائنات والفسادات يعذب به من يشاء عدلاً منه\n ويرحم على من يشاء فضلاً { أَلاَ إِنَّ وَعْدَ ٱللَّهِ } الذي وعد لعباده من الثواب والعقاب { حَقٌّ } محقق ثابت لا محالة\n إذ لا يجري الخلف في وعده أصلاً { وَلَـٰكِنَّ أَكْثَرَهُمْ } لقصور فهمهم\n وقلة تدبرهم في أحكامه المبرمة وحكمته المتقنة { لاَ يَعْلَمُونَ } [يونس: 55] حقية وعده\n ولا يؤمنون بها جهلاً وعناداً\n\n\nوكيف يشكون ويرددون أولئك المصرون المعاندون في سعة قدرته\n وتستبعدون منه إنجاز ما وعده\n إذ { هُوَ يُحْيِـي } أي: يظهر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:64",
      "similarity": 0.5691050152504413
    },
    {
      "verse": "2:12",
      "similarity": 0.5182352253155976
    },
    {
      "verse": "30:6",
      "similarity": 0.4878787767082559
    },
    {
      "verse": "10:62",
      "similarity": 0.4648153987023995
    },
    {
      "verse": "37:151",
      "similarity": 0.46148123718087547
    }
  ]
}