{
  "chapter": "يونس",
  "text": "قل ارءيتم ان اتىكم عذابه بيتا او نهارا ماذا يستعجل منه المجرمون",
  "translations": [
    {
      "translation": "Say: 'What do you think? If His punishment came upon you by night or day, what part of it would the evildoers then try to hasten?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Have you ever thought if His punishment befalls you at night or in the day, what would the sinners do to despatch it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: 'Did you consider (what you would do) were His chastisement to fall upon you suddenly by night or by day? So why are the culprits seeking to hasten its coming?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, \"What benefit can criminals get from their demand that God must punish them immediately if His words are true?\" Whether His punishment befalls them during the day or night (they will not be able to escape).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What is your opinion – if His punishment comes upon you at night or during the day, so what is there in it for which the guilty are being hasty?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me, if His torment should come to you by night or by day, which portion thereof would the criminals hasten on\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Tell me if His punishment overtakes you by night or by day! what then is there of it that the guilty would hasten on?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Have you considered? If His chastisement comes upon you by night or day, what part of it will the sinners seek to hasten?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have ye thought: When His doom cometh unto you as a raid by night, or in the (busy) day; what is there of it that the guilty ones desire to hasten?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If His punishment comes upon you in the dead of night, or by the light of day, how will the guilty escape it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: bethink ye, if His torment come on you by night or by day which Portion thereof would the culprlts hasten on?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me, should His punishment overtake you by night or day, [you will not be able to avert it]; so what part of it do the guilty seek to hasten?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Do ye see,- if His punishment should come to you by night or by day,- what portion of it would the sinners wish to hasten?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me, - if His torment should come to you by night or by day, - which portion thereof would the Mujrimun (disbelievers, polytheists, sinners, criminals) hasten on?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Have you considered? Should His punishment come upon you by night or by day, what (part) of it would the sinners try to hasten'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered? If His punishment overtakes you by night or by day, what part of it will the guilty seek to hasten?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered: if His punishment should come to you by night or by day - for which [aspect] of it would the criminals be impatient?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:50] Say: ‘Have you considered?, [Say] inform me: If His, God’s, chastisement comes upon you by night or day, what, part, is there of it, that is, [of] the chastisement, that the sinners, the idolaters, seek to hasten? (an overt noun [al-mujrimūn, ‘the sinners’] has replaced the [second person, ‘you’] pronominalisation. The interrogative sentence is the response to the conditional, as [in the case where] you might say, ‘If I come to you, what would you give me?’; the intention here is to provoke terror [in them], in other words: how awful is that which they seek to hasten!)\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca: (Have ye thought: When His doom) Allah's chastisement (cometh unto you as a raid by night, or in the (busy) day) what you will do? (what is there of it) of Allah's chastisement (that the guilty ones) the idolaters (desire to hasten?) and then say: we believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولم يمكن لأحد أن يعين وقته { قُلْ } لهم توبيخاً وتقريعاً: { أَرَأَيْتُمْ } أي: أخبروني أيها المجرمون المستعجلون للعذاب والنكال { إِنْ أَتَاكُمْ عَذَابُهُ بَيَاتاً } أي: حال كونكم بائتين في الليل { أَوْ نَهَاراً } حال كونكم مترددين فيها\n وعلى أي شأن وكل حال يصعب عليك أمره\n إذ هو يفزعكم ويفجعكم\n وإذ اكان حالكم عند نزوله وحلوله هذا { مَّاذَا يَسْتَعْجِلُ مِنْهُ } سبحاه من طوله\n إذ كله مكروه { ٱلْمُجْرِمُونَ } [يونس: 50] المستحقون لأنواع العقوبة والعذاب\n أتنكرون وتكذبون له وتصرون على ما أنتم عليه من الكفر والشرك إلى وقت حلول العذاب؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { ماذا يستعجل منه المجرمون } وضع المظهر موضع المضمر\n أي: ماذا تستعجلون منه؟\n\n والجملة الاستفهامية جواب الشرط\n كما يقال: إن أتيتك ماذا تعطيني؟\n أو محذوف\n أي: إن أتاكم ألكم منه منعة أو به طاقة فماذا تستعجلون منه؟ وقال الواحدي: الاستفهام للتهويل والتفظيع\n أي: ما أعظم ما تستعجلون منه\n كما تقول: أعلمت ماذا تجْني على نفسك؟",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:85",
      "similarity": 0.4342871939285522
    },
    {
      "verse": "7:110",
      "similarity": 0.4225498883063489
    },
    {
      "verse": "31:11",
      "similarity": 0.4212440999146164
    },
    {
      "verse": "4:39",
      "similarity": 0.39137362983756147
    },
    {
      "verse": "26:35",
      "similarity": 0.38587886934843757
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010050.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010050.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:50.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}