{
  "chapter": "يونس",
  "text": "هو الذى جعل الشمس ضياء والقمر نورا وقدره منازل لتعلموا۟ عدد السنين والحساب ما خلق الله ذلك الا بالحق يفصل الءايت لقوم يعلمون",
  "translations": [
    {
      "translation": "It is He who appointed the sun to give radiance, and the moon to give light, assigning it phases so you would know the number of years and the reckoning of time. Allah did not create these things except with truth. We make the Signs clear for people who know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who gave the sun its radiance, the moon its lustre, and appointed its stations so that you may compute years and numbers. God did not create them but with deliberation. He distinctly explains His signs for those who can understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who gave the sun radiance and the moon light, and determined the stages (for the waxing and waning of the moon) that you may learn the calculation of years and the reckoning of time. Allah has created all this with a rightful purpose (rather than out of play). He expounds His signs for the people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has made the sun radiant and the moon luminous and has appointed for the moon certain phases so that you may compute the number of years and other reckonings. God has created them for a genuine purpose. He explains the evidence (of His existence) to the people of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who created the sun radiating and the moon shining and appointed positions for it, for you to know the number of the years, and the account; Allah has not created it except with the truth; He explains the verses in detail for the people of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who made the sun a shining thing and the moon as a light and measured out for it stages that you might know the number of years and the reckoning. Allah did not create this but in truth. He explains the Ayat in detail for people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who made the sun a shining brightness and the moon a light, and ordained for it mansions that you might know the computation of years and the reckoning. Allah did not create it but with truth; He makes the signs manifest for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the sun a radiance, and the moon a light, and determined it by stations, that you might know the number of the years and the reckoning. God created that not save with the truth, distinguishing the signs to a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who appointed the sun a splendour and the moon a light, and measured for her stages, that ye might know the number of the years, and the reckoning. Allah created not (all) that save in truth. He detaileth the revelations for people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the sun radiate a brilliant light and the moon shed its lustre, and ordained for it stages so that you may learn to count out the years and [to make other such] reckoning of time. God has not created all these without a purpose. He makes plain His revelations to men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who hath made the sun a glow and the moon a light, and hath determined mansions for her that ye may know the number of the years and the reckoning Allah hath not created all this except with a purpose; He detaileth these signs unto those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the sun a radiance and the moon a light, and ordained its phases that you might know the number of years and the calculation [of time]. Allah did not create all that except with justice. He elaborates the signs for a people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who made the sun to be a shining glory and the moon to be a light (of beauty), and measured out stages for her; that ye might know the number of years and the count (of time). Nowise did Allah create this but in truth and righteousness. (Thus) doth He explain His Signs in detail, for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who made the sun a shining thing and the moon as a light and measured out its (their) stages, that you might know the number of years and the reckoning. Allah did not create this but in truth. He explains the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) in detail for people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He that made the sun a brightness and the moon a light, and determined it in phases so that you might know the number of years and the reckoning. Allah did not create them except in truth, and distinguishes the verses to a nation who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the sun radiant, and the moon a light, and determined phases for it—that you may know the number of years and the calculation. God did not create all this except with truth. He details the revelations for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the sun a shining light and the moon a derived light and determined for it phases - that you may know the number of years and account [of time]. Allah has not created this except in truth. He details the signs for a people who know\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:5] He it is Who made the sun a radiance, that is, emitting light, and the moon a light, and determined it, with respect to its movement, in stations: 28 stations in 28 nights every month, becoming concealed for two nights when a particular month has 30 days, or [concealed] for one night, when it has 29 days, so that you might know, thereby, the number of the years and the reckoning. God did not create that, which is mentioned, save in truth, not in vain, exalted be He above such things. He details (read yufassilu or nufassilu, ‘We detail’) the signs for a people who know, who reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is who appointed the sun a splendour) for mankind during the daytime (and the moon a light) for them at night, (and measured for her stages) He made it consist of phases, (that ye might know the number of the years, and the reckoning) that you might know the counting of months and days. (Allah created not (all) that save in truth) in order to expound the Truth and the error. (He detaileth the revelations) He details 212 the verses of the Qur'an with signs of divine Oneness (for people who have knowledge) for people who believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هُوَ ٱلَّذِي جَعَلَ ٱلشَّمْسَ ضِيَآءً } ليكون دليلاً على كمال ظهوره وإشراقه\n وجلائه وانجلائه { وَٱلْقَمَرَ نُوراً } منيراً في ظلمات الليل\n ليكون دليلاً على إنارته وإضاءته سبحانه في مشكاة التعينات وظلمات الهوايات { وَقَدَّرَهُ } أي: للقمر { مَنَازِلَ } في السماوات\n تسهيلاً لكم في أموركم { لِتَعْلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلْحِسَابَ } التي تحتاجون إليها في معاملاتكم وتجاراتكم وحرثكم\n كما قدر منازل نور النبوة والولاية في مشكاة الأنبياء والأولياء الوارثين منهم\n لتقتبسوا أنوار الإيمان المزيحة لظلم الكفر والعصيان من مصابيح أولئك الأمناء الكرام\n وتتوسلوا بهم إلى أن تستضيئوا بضياء الشمس الحقيقي التي لا أقول لها أصلاً\n\n\nثم قال سبحانه ترغيباً لعباده\n وتنبيهاً لهم علىأصل فطرتهم: { مَا خَلَقَ ٱللَّهُ ذٰلِكَ إِلاَّ بِٱلْحَقِّ } أي: ما أظهر وأوجد سبحانه ما أظهر في عالم الغيب والشهادة\n حسب أسمائه وأوصافه إلا بالحق الثابت الصريح بلا احتياج إلى الدلائل والشواهد\n إذ لا شيء أظهر من ذاته سبحانه حتى يجعل دليلاً عليه\n وإنما { يُفَصِّلُ ٱلآيَاتِ } المنبهة عليها { لِقَوْمٍ يَعْلَمُونَ } [يونس: 5] يتحققون بمرتبة اليقين العلمي\n ليترقوا منها إلى اليقين العيني والحقي\n وأما المحجوبون فهم من عداد البهائم والأنعام\n لا يرجى منهم الفلاح\n لخباثة طينتهم ورداءة فطرتهم\n\n\n{ إِنَّ فِي ٱخْتِلاَفِ ٱلَّيلِ } وإيلاجه في النهار { وَٱلنَّهَارِ } وإيلاجه في الليل { وَمَا خَلَقَ ٱللَّهُ فِي } أوضاع { ٱلسَّمَٰوَٰتِ } من الأمور المقتضية لاختلافهما { وَٱلأَرْضِ } من المكونات الكائنة فيها على مقتضى تربية العلويات وتدبيراتها { لآيَاتٍ } دلائل واضحات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" ضياء \": مفعول ثان، أي: ذات ضياء، وهو مصدر كقيام، أو جمع ضوء كسياط، والياء منقلبة عن الواو، وفي رواية عن ابن كثير بهمزتين في كل القرآن على القلب، بتقديم اللام على العين، والضمير في \" قدره \" للشمس والقمر، كقوله:\n\n[التوبة: 26]، أو للقمر فقط\n يقول الحق جل جلاله: { هو الذي جعل الشمس ضياء } أي: ذات ضوء وإشراق أصلي، { والقمرَ نوراً } أي: ذا نور عارض، مقتبس من نور الشمس عند مقابلته إياها، ولذلك يزيد نوره وينقص، فقد نبه سبحانه بذلك على أنه خلق الشمس نيرة في ذاتها، والقمر نوراً بعرض مقابلة الشمس والاكتساب منها، فالنور أعم من الضياء، والضياء أعظم من النور\n { وقدَّره منازلَ } أي: قدر سير كل واحد منهما منازل، أو القمر فقط، وخصصه بالذكر لسرعة سيره، ومعاينة منازله، وإناطة أحكام الشرع به\n ولذلك علله بقوله: { لتعلموا عددَ السنينَ والحسابَ } أي: حساب الأوقات من الأشهر والأيام والليالي في معاملتكم وتصرفاتكم: { ما خلق اللَّهُ ذلك } الذي تقدم من أنواع المخلوقات { إلا بالحق } أي: ملتبساً بالحق، مراعياً فيه مقتضى الحكمة البالغة، لا عبثاً عارياً عن الحكمة، أو ما خلق ذلك إلا ليُعرف فيها، فما نُصب الكائنات لتراها، بل لترى فيها مولاها\n وقال الشيخ أبو العباس المرسي رضي الله عنه: الحق الذي خلق الله به كل شيء كلمة \" كن \"\n قال سبحانه:\n\n[الأنعام: 73]\n هـ\n وهو بعيد هنا\n { نُفَصِّلُ الآياتِ لقوم يعلمون } فإنهم المنتفعون بالنظر فيها والاعتبار بها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:48",
      "similarity": 0.5290454643863062
    },
    {
      "verse": "2:17",
      "similarity": 0.4602320670791305
    },
    {
      "verse": "2:20",
      "similarity": 0.3536588827125603
    },
    {
      "verse": "55:5",
      "similarity": 0.3494555926324334
    },
    {
      "verse": "28:71",
      "similarity": 0.31615927898511903
    }
  ]
}