{
  "chapter": "يونس",
  "text": "قل بفضل الله وبرحمته فبذلك فليفرحوا۟ هو خير مما يجمعون",
  "translations": [
    {
      "translation": "Say: 'It is the favour of Allah and His mercy that should be the cause of their rejoicing. That is better than anything they accumulate.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is the blessing and mercy of God; so rejoice in it. It is better than all that you amass.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them (O Prophet!): 'Let them rejoice in Allah's grace and mercy through which this (Book) has come to you. It is better than all the riches that they accumulate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"To be happy with the favors and mercy of God is better than whatever you accumulate\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Upon Allah’s munificence and upon His mercy – upon these should the people rejoice”; that is better than all their wealth and possessions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"In the bounty of Allah, and in His mercy; therein let them rejoice.\" That is better than what (the wealth) they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: In the grace of Allah and in His mercy-- in that they should rejoice; it is better than that which they gather.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'In the bounty of God, and His mercy -- in that let them rejoice; it is better than that they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: In the bounty of Allah and in His mercy: therein let them rejoice. It is better than what they hoard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"In the grace and mercy of God let them rejoice, for these are better than the worldly riches which they hoard.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: in the grace of Allah and in His mercy--therein let them therefore rejoice: far better it is than that which they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘In Allah’s grace and His mercy—let them rejoice in that! It is better than what they amass.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"In the bounty of Allah. And in His Mercy,- in that let them rejoice\": that is better than the (wealth) they hoard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"In the Bounty of Allah, and in His Mercy (i.e. Islam and the Quran); -therein let them rejoice.\" That is better than what (the wealth) they amass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'In the Bounty of Allah and His Mercy let them rejoice, it (the Koran) is better than that which they hoard'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “In God’s grace and mercy let them rejoice. That is better than what they hoard.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"In the bounty of Allah and in His mercy - in that let them rejoice; it is better than what they accumulate.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:58] Say: ‘In the bounty of God, [that is] Islam, and in His mercy, the Qur’ān, in that, bounty and mercy, let them rejoice: it is better than what they hoard’, in this world (read yajma‘ūn, ‘they hoard’, and tajma‘ūn, ‘you hoard’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "219 (Say) Muhammad, to your Companions: (In the bounty of Allah) in the Qur'an with which Allah has honoured you (and in His mercy) the religion of Islam, which Allah has given you success to follow: (therein) i.e. in the Qur'an and Islam (let them rejoice. It is better) i.e. the Qur'an and Islam (than what they hoard) is better than what the Jews and idolaters amass of wealth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قُلْ بِفَضْل الله } أي: بتوفيقه للقبول في المقامات الثلاثة { وبرحمته } بالمواهب الخلقية والعلمية والكشفية في المراتب الثلاث فليعتنوا وإن كانوا يفرحون { فبذلك فليفرحوا } لا بالأمور الفانية القليلة المقدار، الدنيئة القدر والوقع { هو خيرٌ مما يجمعون } من الخسائس الفاسدة والمحقرات الزائلة من جملة الحطام إن كانوا أصحاب دراية وفطنة وأرباب قدر وهمة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمن تبعك إرشاداً لهم وتذكيراً: { بِفَضْلِ ٱللَّهِ } وحسن قبوله وشرف عزه وحضوره { وَبِرَحْمَتِهِ } الواسعة المتسعة لجميع مظاهره فليتشرفوا ولينكشفوا { فَبِذَلِكَ } التلذذ والحضور الحقيقي { فَلْيَفْرَحُواْ } بدل ما لم يتلذذوا ولم يفرحوا بالمستلذات الجسمانية الفانية المتناهية { هُوَ } أي: فرحكم وسروركم الروحاني { خَيْرٌ مِّمَّا يَجْمَعُونَ } [يونس: 58] من أهوية نفوسكم ومقتضيات هوياتكم إن كنتم موقنني مخلصين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:50",
      "similarity": 0.5456864831373719
    },
    {
      "verse": "13:26",
      "similarity": 0.43727543080850695
    },
    {
      "verse": "27:36",
      "similarity": 0.41387804570032694
    },
    {
      "verse": "3:188",
      "similarity": 0.4109188131088651
    },
    {
      "verse": "42:48",
      "similarity": 0.39416611444843946
    }
  ]
}