{
  "chapter": "يونس",
  "text": "ثم قيل للذين ظلموا۟ ذوقوا۟ عذاب الخلد هل تجزون الا بما كنتم تكسبون",
  "translations": [
    {
      "translation": "Then it will be said to those who did wrong, 'Taste the punishment of eternity! Have you been repaid for anything other than what you earned?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will the sinners be told: \"Now taste everlasting torment. Should you be rewarded for anything else but what you did?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wrong-doers will then be told: 'Suffer now the abiding chastisement. How else can you be rewarded except according to your deeds?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unjust will be told, \"Suffer the everlasting torment. Do you expect a recompense other than what you deserve?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the unjust will be told, “Taste the punishment forever; and you will be repaid only what you used to earn.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it will be said to them who wronged themselves: \"Taste you the everlasting torment! Are you recompensed (aught) save what you used to earn\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it shall be said to those who were unjust: Taste abiding chastisement; you are not requited except for what you earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it will be said to the evildoers: 'Taste the chastisement of eternity! Are you recompensed for aught but that you have been earning?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will it be said unto those who dealt unjustly Taste the torment of eternity. Are ye requited aught save what ye used to earn?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the evil-doers will be told, \"Taste the everlasting punishment. Have you not been rewarded according to your deeds?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter, it will be said unto those who wronged themselves: taste the torment everlasting: ye are requited not save for that which ye have been earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it will be said to those who were wrongdoers, ‘Taste the everlasting punishment. Shall you not be requited for what you used to earn?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At length will be said to the wrong-doers: 'Taste ye the enduring punishment! ye get but the recompense of what ye earned!'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it will be said to them who wronged themselves: \"Taste you the everlasting torment! Are you recompensed (aught) save what you used to earn?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it shall be said to the evildoers: 'Taste the punishment of eternity! Shall you be recompensed except according to what you earned'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it will be said to those who did wrong, “Taste the torment of eternity. Will you be rewarded except for what you used to do?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it will be said to those who had wronged, \"Taste the punishment of eternity; are you being recompensed except for what you used to earn?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:52] Then will it be said to those who were evildoers: ‘Taste the everlasting chastisement!, that is, the one in which you shall abide. Are you, you are not, requited for anything but, the requital of, what you used to earn?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then will it be said unto those who dealt unjustly) the idolaters: (Taste the torment of eternity. Are ye requited) in the Hereafter (aught save what ye used to earn) do and say in the life of this world?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ قِيلَ لِلَّذِينَ ظَلَمُواْ } بالله بالخروج عن مقتضى أوامره وتكذيب رسله: { ذُوقُواْ } بدل ذوقكم واستلذاذكم بتكذيب الرسل\n الاستهزاء بهم { عَذَابَ ٱلْخُلْدِ } المستمر الدائم الذي لا ينقطع أبد الآباد { هَلْ تُجْزَوْنَ } به { إِلاَّ بِمَا كُنتُمْ تَكْسِبُونَ } [يونس: 52] في النشأة الأولى من الجرائم العظام والمعاصي والآثام\n\n\n{ وَ } بعد تبليغك إليهم مآل أمرهم وعاقبة حالهم\n أنهم { يَسْتَنْبِئُونَكَ } ويستخبرونك على مقتضى أكنتهم المستكنة في قلوبهم: { أَحَقٌّ هُوَ } أي: ما أخبرت به من الوعيدات الهائلة\n يعني: أجد هو أم هزل وتخويف؟ { قُلْ } مبالغاً في تحقيقه وتقريره: { إِي وَرَبِّيۤ } أقسم بربي { إِنَّهُ لَحَقٌّ } ثابت محقق عندي بوحي الله والهامه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:24",
      "similarity": 0.5501589837767084
    },
    {
      "verse": "7:39",
      "similarity": 0.5412134958806317
    },
    {
      "verse": "45:22",
      "similarity": 0.46535018380158005
    },
    {
      "verse": "34:17",
      "similarity": 0.44093900129663427
    },
    {
      "verse": "41:27",
      "similarity": 0.439423939491579
    }
  ]
}