{
  "chapter": "يونس",
  "text": "ولا يحزنك قولهم ان العزة لله جميعا هو السميع العليم",
  "translations": [
    {
      "translation": "Do not be grieved by what they say. All might belongs to Allah. He is the All-Hearing, the All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You should not be grieved by what they say. All glory is wholly for God: He is the one who hears and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet!) Let not the utterances of the opponents distress you. Indeed all honour is Allah's. He is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), let not their words disappoint you; all dignity belongs to God. He is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not grieve at their speech (O dear Prophet Mohammed – peace and blessings be upon him); indeed all honour is for Allah and He is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not grieve over their speech, for all power and honor belong to Allah. He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their speech grieve you; surely might is wholly Allah's; He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not let their saying grieve thee; the glory belongs altogether to God; He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their speech grieve thee (O Muhammad). Lo! power belongeth wholly to Allah. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let their words grieve you. Surely, all might and glory belongs to God alone; He is the  all-hearing, the all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their saying grieve thee. Verily honour is Allah's wholly. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not grieve at their remarks; indeed all might belongs to Allah; He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not their speech grieve thee: for all power and honour belong to Allah: It is He Who heareth and knoweth (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their speech grieve you (O Muhammad SAW), for all power and honour belong to Allah. He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let their speech grieve you. All might belongs to Allah. He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their sayings dishearten you. All power is God’s. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their speech grieve you. Indeed, honor [due to power] belongs to Allah entirely. He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:65] And let not what they say, to you, that you have not been sent [as a prophet] or otherwise, grieve you. Truly (inna: indicates a new sentence) power, might, belongs wholly to God. He is the Hearer, of speech, the Knower, of deeds, and will requite them and grant you victory.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالجملة معطوفة على جملة { ألا إن أولياء الله لا خَوف عليهم ولا هم يحزنون } \\[ يونس : 62 \\] عطف الجزئي على الكلي لأن الحزن المذكور هنا نوع من أنواع الحزن المنفي في قوله : { ولا هُم يحزنون } \\[ يونس : 62 \\] ، ولأن الرسول عليه الصلاة والسلام من أولياء الله الذين لا خوف عليهم ولا هم يحزنون . فكان مقتضى الظاهر أن يعطف بفاء التفريع لأن دفع هذا الحزن يتفرع على ذلك النفي ولكن عُدل إلى العطف بالواو ليعطي مضمون الجملة المعطوفة استقلالاً بالقصد إليه فيكون ابتداء كلام مع عدم فوات معنى التفريع لظهوره من السياق . والحزن المنهي عن تطرقه هو الحزن الناشىء عن أذى المشركين محمداً صلى الله عليه وسلم بأقوالهم البذيئة وتهديداتهم . ووجه الاقتصار على دحضه أن النبي صلى الله عليه وسلم لم يكن يلقى من المشركين محزناً إلا أذى القول البذئي .وصيغة { لا يحزنك قولهم } خطاب للنبيء صلى الله عليه وسلم وظاهر صيغته أنه نهي عن أن يحزن النبي صلى الله عليه وسلم كلام المشركين ، مع أن شأن النهي أن يتوجه الخطاب به إلى من فعل الفعل المنهي عنه ، ولكن المقصود من مثل هذا التركيب نهي النبي عليه الصلاة والسلام عن أن يتأثر بما شأنه أن يُحزن الناس من أقوالهم ، فلما وجه الخطاب إليه بالنهي عن عمل هو من عمل غيره تعين أن المراد بذلك الكناية عن نهيه هو عن حصول ذلك الحزن في نفسه بأن يصرف عن نفسه أسبابه وملزوماته فيؤول إلى معنى لا تترك أقوالهم تُحزنك ، وهذا كما يقولون : لا أريَنَّك تفعل كذا ، ولا أعرفنَّك تفعل كذا ، فالمتكلم ينهى المخاطب عن أن يراه المتكلم فاعلاً كذا . والمراد نهيه عن فعل ذلك حتى لا يراه المتكلم فهو من إطلاق الملزوم وإرادة اللازم . والمعنى : لا تفعلن كذا فأراك تفعله . ومعنى { لا يحزنك قولهم } لا تحزن لقولهم فيحزنك .ومعلوم أن أقوال المشركين التي تحزن النبي هي أقوال التكذيب والاستهزاء ، فلذلك حذف مفعول القول لأن المصدر هنا نزل منزلة مصدر الفعل اللازم .وجملة : { إن العزة لله جميعاً } تعليل لدفع الحزن عنه ، ولذلك فصلت عن جملة النهي كأنَّ النبي يقول : كيف لا أحزن والمشركون يتطاولون علينا ويتوعدوننا وهم أهل عزة ومنعَة ، فأجيب بأن عزتهم كالعدم لأنها محدودة وزائلة والعزة الحق لله الذي أرسلك . وهي أيضاً في محل استئناف بياني . وكل جملة كان مضمونها علة للتي قبلها تكون أيضاً استئنافاً بيانياً ، فالاستئناف البياني أعم من التعليل . وافتتحت بحرف التأكيد للاهتمام بها ، ولأنَّه يفيد مفاد لام التعليل وفاء التفريع في مثل هذا المقام الذي لا يقصد فيه دفع إنكار من المخاطب .ويحسن الوقف على كلمة { قولهم } لكي لا يتوهم بعض من يسمع جملة { إنّ العزة لله جميعاً } فيحسبه مقولاً لقولهم فيتطلب لماذا يكونُ هذا القول سبباً لحزن الرسول صلى الله عليه وسلم وكيف يحزن الرسول صلى الله عليه وسلم من قولهم : { إنّ العزّة لله } وإن كان في المقام ما يهدي السَّامع سريعاً إلى المقصود .ونظير هذا الإيهام ما حكي أنّ ابن قتيْبة ( وهو عبد الله بن مسلم بن قُتيبة ) ذكر قراءة أبي حيْوة { أنّ العزّة لله } بفتح همزة ( أن ) وأعرب بدلاً من ( قولُهم ) فحكم أنّ هذه القراءة كُفر . حكى ذلك عنه ابن عطيَّة . وأشار إلى ذلك في «الكشاف» فقال : «ومن جعله بدلاً من ( قولُهم ) ثم أنكره فالمنكر هو تخريجه» .ولعل ابن قتيبة أراد أن كسر الهمزة وإن كان محتملاً لأن تكون الجملة بعدها معمولة ل { قولهم } لأن شأن ( إن ) بعد فعل القول أن لا تكون بفتح الهمزة لكن ذلك احتمال غير متعيَّن لأنَّه يحتمل أيضاً أن تكون الجملة استئنافاً ، والسياق يعيّن الاحتمال الصحيح .فأمَّا إذا فتحت الهمزة كما قرأ أبو حَيْوَة فقد تعيَّنت أن تكون معمولة لما ذكر قبلها وهو لفظ { قولُهم } ولا محمل لها عنده إلا أنها أي المصدر المنسبك . منها بدل من كلمة { قولهم } ، فيصير المعنى : أنّ الله نهى نبيئه عن أن يحزن من قول المشركين { العزةُ لله جميعاً } وكيف وهو إنَّما يدعوهم لذلك . وإذ كان النهي عن شيء يقتضي تجويز تلبس المنهي بالشيء المنهى عنه اقتضى ذلك تجويز تلبس النبي عليه الصلاة والسلام بالحَزن لمن يقول هذا القول وهذا التجويز يؤول إلى كفر من يجوزه على طريقة التكفير باللازم ، ومقصده التَّشنيع على صاحب هذه القراءة .وإنَّما بنى ابن قتيبة كلامه على ظاهر لفظ القرآن دون تقدير حرف قبل ( أنّ ) لعلَّه راعى أنّ التقدير خلاف الأصل أو أنَّه غير كاف في دفع الإيهام . فالوجه أنّ ابن قتيبة هوّل ما له تأويل ، ورد العلماء عليه رد أصيل .والتَّعريف في { العزّة } تعريف الجنس المفيد للاستغراق بقرينة السِّياق .واللام في قوله : { لله } للملك . وقد أفاد جعل جنس العزة ملكاً لله أنّ جميع أنواعها ثابت لله ، فيفيد أنّ له أقوى أنواعها وأقصاها . وبذلك يفيد أنّ غير الله لا يملك منها إلاّ أنواعاً قليلة ، فما من نوع من أنواع العزة يوجد في مِلك غيره فإن أعظم منه من نوعه ملك لله تعالى . فلذلك لا يكون لما يملكه غير الله من العزة تأثير إذا صادم عزة الله تعالى ، وأنه لا يكون له تأثير إلا إذا أمهله الله ، فكل عزّة يستخدمها صاحبها في مناواة من أراد الله نصره فهي مدحوضة مغلوبة ، كما قال تعالى : { كتب الله لأغلبنّ أنا ورُسلي إنّ الله قوي عزيز } \\[ المجادلة : 21 \\] وإذ قد كان النبي عليه الصلاة والسلام يعلم أنّ الله أرسله وأمره بزجر المشركين عمَّا هم فيه كان بحيث يؤمن بالنصر إذا أعلمه الله بأنه مراده ، ويعلم أنّ ما للمشركين من عزة هو في جانب عزة الله تعالى كالعدم .و { جميعاً } حال من { العزّة } موكّدة مضمونَ الجملة قبلها المفيدَ لاختصاصه تعالى بجميع جنس العزّة لدفع احتمال إرادة المبالغة في ملك ذلك الجنس .وجملة : { هو السَّميع العليم } مستأنفة وإجراء هذا الخبر على اسم الجلالة الواقع ركناً في الجملة التعليلية يجر معنى التعليل إلى هذه الجملة فتفيد الجملة تعليلاً آخر أو تكملة للتعليل الأوّل ، لأنه إذا تذكر المخاطب أنّ صاحب العزة يعلم أقوالهم وأحوالهم زاد ذلك قوة في دفع الحُزن مِن أقوالهم عن نفسه لأنّ الذي نهاه عن الحزن من أقوالهم وتطوالهم أشد منهم قوة ومحيط علمه بما يقولونه وبأحوالهم . فهو إذا نهاك عن الحزن من أقوالهم ما نهاك إلا وقد ضمن لك السَّلامة منهم مع ضعفك وقوتهم لأنه يمدُّك بقوته وهو أعلم بتكوين أسباب نصرك عليهم .والمراد ب { السميع } العالم بأقوالهم التي من شأنها أن تسمع ، وب { العليم } ما هو أعم من أحوالهم التي ليست بمسموعات فلا يطلق على العلم بها اسم ( السَّميع .\n\n",
      "translations": [
        {
          "translation": "(And let not their speech) their denial of you (grieve thee) O Muhammad. (Lo! Power) might and invincibility (belongeth wholly to Allah) Who is able to destroy them. (He is the Hearer) of what they say, (the Knower) of what they do as well as of their punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولا يحزنك قولهم } أي: لا تتأثر به فإنه مراء وشاهد عزة الله وقهره لتنظر إليهم بنظر الفناء وترى أعمالهم وأقوالهم وما يهددونك به كالهباء فمن شاهد قوة الله وعزته يرى كل القوة والعزة لا قوة لأحد ولا حول\n { هو السمِيعُ } لأقوالهم فيك فيجازيهم { العَلِيم } لما ينبغي أن يفعل بهم ثم بين ضعفهم وعجزهم وامتناع غلبتهم عليه بقوله: { ألا إن لله من في السموات ومن في الأرض } كلهم تحت ملكته وتصرّفه وقهره لا يقدرون على شيء بغير إذنه ومشيئته وإقداره إياهم { وما يتبع الذين يدعون من دون الله شركاء } وأي شيء يتبع الذين يدعون من دون الله شركاء",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما تحققت يا أكمل الرسل بولاية الله واتصفت بولائه وفزت بما فزت { لاَ يَحْزُنكَ قَوْلُهُمْ } الباطل بالكفر والإشراك بالله وتكذيب كتابه\n ومنه أنزل إليه\n ولا تغتم بتهديدهم إياك ولا تبالِ مفاخرتهم وخيلاءهم بالمال والجاه عليك { إِنَّ ٱلْعِزَّةَ } المعتبرة العظيمة { لِلَّهِ } المتعزز برداء العظمة والجلال\n المتوحد بنعوت الكمال والجمال { جَمِيعاً } لا يعتد بعزة هؤلاء الغواة والعصاة\n وسيخذلهم الله عن قريب بالقهر والانتقام\n وبنصرك عليهم بالغلبة والاستيلاء\n إذ { هُوَ ٱلسَّمِيعُ } لأقوالهم الكاذبة الباطلة { ٱلْعَلِيمُ } [يونس: 65] بنياتهم الفاسدة يجازيهم على مقتضى علمه\n وينتقم عنهم وفق خبرته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: إن: استئناف، ومن قرأ بالفتح فعلى إسقاط لام العلة. يقول الحق جل جلاله لنبيه صلى الله عليه وآله وسلم: { ولا يحزنُكَ قولُهم } في جانب الربوبية، أو جانبك بالطعن والشتم والتهديد، فالعاقبة لك بالنصر والعز فإن الله يُعز أولياءه، { إِنَّ العزَّة لله جميعاً } أي: إن الغلبة لله جميعاً، لا يملك غيرُه منها شيئاً، فهو يقهرهم وينصرك عليهم، { هو السميع } لأقوالهم، { العليم } بمكائدهم فيجازيهم عليها.  الإشارة: الداخل على الله منكور، فكل من رام الخصوصية فليعوِّلْ على الطعن والإنكار، وليتسلَّ بما تسلى به النبي المختار، ولينتظر العز والنصر من الواحد القهار، فإن الأمر كله بيده، كما قال: { أَلاۤ إِنَّ للَّهِ مَن فِي ٱلسَّمَاوَات وَمَنْ فِي ٱلأَرْضِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:13",
      "similarity": 0.5588418907025482
    },
    {
      "verse": "43:68",
      "similarity": 0.5259811143793945
    },
    {
      "verse": "6:48",
      "similarity": 0.4321237039189539
    },
    {
      "verse": "10:62",
      "similarity": 0.42610721865874285
    },
    {
      "verse": "41:30",
      "similarity": 0.41969491866229064
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}