{
  "chapter": "يونس",
  "text": "الا ان اولياء الله لا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "Yes, the friends of Allah will feel no fear and will know no sorrow:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, there is neither fear nor regret for the friends of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Oh, surely the friends of Allah have nothing to fear, nor shall they grieve -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The friends of God will certainly have nothing to fear, nor will they be grieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pay heed! Indeed upon the friends of Allah is neither any fear, nor any grief. (The friends of Allah are the best in the creation.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! The Awliya' of Allah, no fear shall come upon them nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now surely the friends of Allah-- they shall have no fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God's friends -- no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! verily the friends of Allah are (those) on whom fear (cometh) not, nor do they grieve?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are close to God shall certainly have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! verily the friends of Allah! no fear shall come upon them nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look! The friends of Allah will indeed have no fear nor will they grieve\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! verily on the friends of Allah there is no fear, nor shall they grieve;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No doubt! Verily, the Auliya' of Allah [i.e. those who believe in the Oneness of Allah and fear Allah much (abstain from all kinds of sins and evil deeds which he has forbidden), and love Allah much (perform all kinds of good deeds which He has ordained)], no fear shall come upon them nor shall they grieve,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, there shall be neither fear nor sorrow upon the guided by Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unquestionably, God’s friends have nothing to fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:62] Assuredly God’s friends, no fear shall befall them, neither shall they grieve, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف للتصريح بوعد المؤمنين المعرَّض به في قوله : { إلاَّ كنا عليكم شهوداً إذ تفيضون فيه وما يعزب عن ربك } \\[ يونس : 61 \\] الآية ، وبتسلية النبي صلى الله عليه وسلم على ما يلاقيه من الكفار من أذى وتهديد ، إذ أعلن الله للنبيء والمؤمنين بالأمن من مخافة أعدائهم ، ومن الحزن من جراء ذلك ، ولمح لهم بعاقبة النصر ، ووعدهم البشرى في الآخرة وعداً لا يقبل التغيير ولا التخلف تطميناً لنفوسهم ، كما أشعر به قوله عقبه { لا تَبديل لكلمات الله }.وافتتاح الكلام بأداة التنبيه إيماء إلى أهمية شأنه ، كما تقدم في قوله : { ألا إنهم هم المفسدون } في سورة \\[ البقرة : 12 \\] ، ولذلك أكدت الجملة بإنَّ } بعد أداة التنبيه .وفي التعبير ب { أولياء الله } دون أن يؤتى بضمير الخطاب كما هو مقتضى وقوعه عقب قوله : { وما تعملون من عمل } \\[ يونس : 61 \\] يؤذن بأن المخاطبين قد حق لهم أنهم من أولياء الله مع إفادة حكم عام شملهم ويشمل من يأتي على طريقتهم .وجملة : { لا خوف عليهم ولا هم يحزنون } خبر { إن }.والخوف : توقع حصول المكروه للمتوقِّع ، فيتعدى بنفسه إلى الشيء المتوقَّع حصوله . فيقال : خاف الشيْء ، قال تعالى : { فلا تخافوهم وخَافون } \\[ آل عمران : 175 \\]. وإذا كان توقع حصول المكروه لغير المتوقع يقال للمتوقَّع : خاف عليه ، كقوله تعالى : { إني أخاف عليكم عذاب يوم عظيم } \\[ الشعراء : 135 \\].وقد اقتضى نظم الكلام نفي جنس الخوف لأن ( لا ) إذا دخلت على النكرة دلت على نفي الجنس ، وأنها إذا بني الاسم بعدها على الفتح كان نفي الجنس نصاً وإذا لم يُبنَ الاسم على الفتح كان نفي الجنس ظاهراً مع احتمال أن يراد نفي واحد من ذلك الجنس إذا كان المقام صالحاً لهذا الاحتمال ، وذلك في الأجناس التي لها أفراد من الذوات مثل رجل ، فأما أجناس المعاني فلا يتطرق إليها ذلك الاحتمال فيستوي فيها رفع اسم ( لا ) وبناؤه على الفتح ، كما في قول إحدى نساء حديثثِ أم زرع «زوجي كلَيْللِ تهامة لا حَرّ ولا قرّ ولا مخافة ولا سآمة» فقد رويت هذه الأسماء بالرفع وبالبناء على الفتح .فمعنى { لا خوف عليهم } أنهم بحيث لا يخاف عليهم خائف ، أي هم بمأمننٍ من أن يُصيبهم مكروه يُخاف من إصابة مِثلِه ، فهم وإن كانوا قد يهجس في نفوسهم الخوف من الأعداء هجساً من جبلة تأثر النفوس عند مشاهدة بوادر المخافة ، فغيرهم ممن يَعلم حالهم لا يَخَاف عليهم لأنه ينظر إلى الأحوال بنظر اليقين سَليماً من التأثر بالمظاهر ، فحالهم حال من لا ينبغي أن يخاف ، ولذلك لا يَخاف عليهم أولياؤهم لأنهم يأمنون عليهم من عاقبة ما يتوجَّسون منه خيفة ، فالخوف الذي هو مصدر في الآية يقدر مضافاً إلى فاعله وهو غيرهم لا محالة ، أي لا خوف يخافه خائف عليهم ، وهم أنفسهم إذا اعتراهم الخوف لا يلبث أن ينقشع عنهم وتحل السكينة محله ، كما قال تعالى :{ وضاقت عليكم الأرض بما رحبت ثم وليتم مدبرين ثم أنزل الله سكينته على رسوله وعلى المؤمنين } \\[ التوبة : 25 ، 26 \\] ، وقال لموسى : { لا تَخاف دَرَكا ولا تخشى } \\[ طه : 77 \\] ، وقال : { إن الذين اتقوا إذا مسهم طائف من الشيطان تذكروا فإذا هم مبصرون }. وكان النبي صلى الله عليه وسلم يوم بدر يدعو الله بالنصر ويكثر من الدعاء ويقول : « اللهم إن تهلك هذه العصابة لم تعبد في الأرض » ثم خرج وهو يقول : { سيهزم الجمع ويولون الدبر } \\[ القمر : 45 \\].ولهذا المعنى الذي أشارت إليه الآية تغير الأسلوب في قوله : { ولا هم يحزنون } فأسند فيه الحزن المنفي إلى ضمير { أولياء الله } مع الابتداء به ، وإيراد الفعل بَعده مسنداً مفيداً تقوي الحكم ، لأن الحزن هو انكسار النفس من أثر حصول المكروه عندها فهو لا توجد حقيقته إلا بعد حصوله ، والخوف يكون قبل حصوله ، ثم هم وإن كانوا يحزنون لما يصيبهم من أمور في الدنيا كقول النبي صلى الله عليه وسلم « وإنّا لفراقك يا إبراهيم لمحزنون » فذلك حزن وجداني لا يستقر بل يزول بالصبر ، ولكنهم لا يلحقهم الحزن الدائم وهو حزن المذلة وغلبة العدو عليهم وزوال دينهم وسلطانهم ، ولذلك جيء في جانب نفي الحزن عنهم بإدخال حرف النفي على تركيب مفيد لتقوي الحكم بقوله : { ولا هم يحزنون } لأن جملة : { هم يحزنون } يفيد تقديم المسند إليه فيها تقوي الحكم الحاصل بالخبر الفعلي ، فالمعنى لا يحصل لهم خوف متمكن ثابت يبقى فيهم ولا يجدون تخلصاً منه .فالكلام يفيد أن الله ضمن لأوليائه أن لا يحصل لهم ما يخافونه وأن لا يحل بهم ما يحزنهم . ولما كان ما يُخاف منه من شأنه أن يُحزن من يصيبه كان نفي الحزن عنهم مؤكِّداً لمعنى نفي خوف خائف عليهم . وجمهور المفسرين حملوا الخوف والحزن المنفيين على ما يحصل لأهل الشقاوة في الآخرة بناء على أن الخوف والحزن يحصلان في الدنيا ، كقوله : { فأوجس في نفسه خيفة موسى } \\[ طه : 67 \\]. وقد علمت ما يُغني عن هذا التأويل ، وهو يبعد عن مفاد قوله : { لهم البشرى في الحياة الدنيا وفي الآخرة }.والولي : الموالي ، أي المحالف والناصر . وكلها ترجع إلى معنى الوَلْي ( بسكون اللام ) ، وهو القرب وهو في معنى الولي كلها قرب مجازي . وتقدم في قوله تعالى : { قل أغير الله اتخذ ولياً } في سورة \\[ الأنعام : 14 \\]. وهو قرب من الجانبين ، ولذلك فسروه هنا بأنه الذي يتولى الله بالطاعة ويتولاه الله بالكرامة .\n\n",
      "translations": [
        {
          "translation": "(Lo! verily the) believing (friends of Allah are (those) on whom fear (cometh) not) regarding any future punishment, (nor do they grieve) about that which they have left behind.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ألا إن أوليَاء الله } المستغرقين في عين الهوية الأحدية بفناء الأنية { لا خوف عليهم } إذ لم يبق منهم بقية خافوا بسببها من حرمان ولا غاية وراء ما بلغوا فيخافوا من حجبه { ولا هم يحزنون } لامتناع فوات شيء من الكمالات واللذات منهم\n فيحزنوا عليه\n وعن سعيد بن جبير رضي الله عنه: إن رسول الله صلى الله عليه وسلم سُئل من هم؟ فقال:\n \" هم الذين يذكروا الله برؤيتهم \" \nوهذا رمز لطيف منه عليه السلام\n وعن عمر رضي الله عنه: سمعت رسول الله صلى الله عليه وسلم يقول:\n \" إن من عباد الله عباداً ما هم بأنبياء ولا شهداء يغبطهم الأنبياء والشهداء يوم القيامة لمكانهم من الله \" \n قالوا: يا رسول الله\n أخبرنا من هم وما أعمالهم؟ فلعلنا نحبهم\n قال: \" هم قوم تحابّوا في الله على غير أرحام بينهم ولا أموال يتعاطونها\n فوالله إن وجوههم لنور وإنهم لعلى منابر من نور\n لا يخافون إذا خاف الناس ولا يحزنون إذا حزن الناس \" \n \nثم قرأ الآية\n قوله: وإنهم لعلى منابر من نور\n يريد به اتصالهم بالمبادئ العالية الروحانية كالعقل الأول وما يليه\n { الذين آمنوا وكانوا يتّقون } إن جعل صفة لأولياء الله فمعناه الذين آمنوا بالإيمان الحقيّ وكانوا يتقون بقاياهم وظهور تلويناتهم\n { لهم البُشْرى في الحياة الدنيا } بوجود الاستقامة في الأعمال والأخلاق المبشرة بجنة النفوس { وفي الآخرة } بظهور أنوار الصفات والحقائق الروحانية والمعارف الحقّانية عليهم المبشرة بجنة القلوب وحصول الذوق بهما واللذة { لا تبديل لكلمات الله } لحقائقه الواردة عليهم وأسمائه المنكشفة لهم وأحكام تجلياته النازلة بهم\n وإن جعل كلاماً برأسه مبتدأ فمعناه الذين آمنوا الإيمان اليقيني وكانوا يتقون حجب صفات النفس وموانع الكشف من التشكيكات الوهمية والوساوس الشيطانية { لهم البشرى في الحياة الدنيا } بوجدان لذة برد اليقين في النفس واطمئنانها بنزول السكينة وفي الآخرة بوجدان ذوق تجليات الصفات وأثر أنوار المكاشفات لا تبديل لكلمات الله من علومهم اللدنية وحكمهم اليقينية أو فطرتهم التي فطرهم الله عليها فإن كل نفس كلمة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلاۤ إِنَّ أَوْلِيَآءَ ٱللَّهِ } المنخلعين عن لوازم البشرية بالكلية المنسلخين عن مقتضيات أهوية نفوسهم رأساً { لاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ } [يونس: 62] إذ الخوف والحزن إنما هي من لوازم الطبيعة ومن ارتكاب مقتضياتها\n\n\nوبعدما انسلخوا عنها وتجردوا عن لوازمها وفانوا في هوية الحق وصاروا ما صاروا\n لم يبقَ فيهم مبدأ الخوف والحزن والأمن والسرور\n إلا لا يتصف الفاني بأمثال هذه الأضداد\n وهم { ٱلَّذِينَ آمَنُواْ } بالله في بداية سلوكهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" الذين آمنوا \": صفة للأولياء\n أو منصوب على المدح\n أو مرفوع به على تقدير: \" هم \" أو مبتدأ\n و \" لهم البشرى \": خبر\n يقول الحق جل جلاله: { ألا إن أولياءَ الله } الذين يتولونه بالطاعة\n وهو يتولاهم بالكرامة { لا خوفٌ عليهم } من لحوق مكروه\n { ولا هم يحزنون } بفوات مأمول\n ثم فسرهم بقوله: { الذين آمنوا وكانوا يتقون } \n فمن جمع بين الإيمان والتقوى فهو ولي ـ أعني الولاية العامة ـ وسيأتي بقية الكلام في الإشارة إن شاء الله\n { لهم البُشْرَى في الحياةِ الدنيا } وهو ما بشّر به المتقين في كتابه\n على لسان نبيه صلى الله عليه وسلم من الحفظ والعز والكفاية\n والنصر في الدنيا وما يثيبهم به في الآخرة\n أو ما يريهم من الرؤيا الصالحة يراها أو تُرى له\n رُوي ذلك عن رسول الله صلى الله عليه وسلم\n أو محبة الناس للرجل الصالح\n أو ما يتحفهم به من المكاشفات\n أو التوفيق لأنواع الطاعات\n أو بشرى الملائكة عند النزع\n أو رؤية المقعد قبل خروج الروح\n { وفي الآخرة } هي الجنة أو تلقي الملائكة إياهم عند الحشر بالبشرى والكرامة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:13",
      "similarity": 0.6265151679571791
    },
    {
      "verse": "43:68",
      "similarity": 0.6073494569375907
    },
    {
      "verse": "6:48",
      "similarity": 0.5139756024174631
    },
    {
      "verse": "41:30",
      "similarity": 0.486617709586499
    },
    {
      "verse": "10:55",
      "similarity": 0.4648153987023995
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}