{
  "chapter": "يونس",
  "text": "وما تكون فى شان وما تتلوا۟ منه من قرءان ولا تعملون من عمل الا كنا عليكم شهودا اذ تفيضون فيه وما يعزب عن ربك من مثقال ذرة فى الارض ولا فى السماء ولا اصغر من ذلك ولا اكبر الا فى كتب مبين",
  "translations": [
    {
      "translation": "You do not engage in any matter or recite any of the Qur'an or do any action without Our witnessing you while you are occupied with it. Not even the smallest speck eludes your Lord, either on earth or in heaven. Nor is there anything smaller than that, or larger, which is not in a Clear Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no state you are in, whether reading from the Qur'an, or doing something else, but We are watching you as you are engaged in it. There is not the weight of an atom on the earth and in the heavens that is hidden from your Lord, nor is there anything smaller or greater than this but is recorded in the perspicuous Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet!) Whatever you may be engaged in, whether you recite any portion of the Qur'an, or whatever else all of you are doing, We are witnesses to whatever you may be occupied with. Not even an atom's weight escapes your Lord on the earth or in the heaven, nor is there anything smaller or bigger than that, except that it is on record in a Clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), We bear witness to all your affairs; whatever you recite from the Quran and whatever you (people) do. Nothing in the heavens or the earth is hidden from your Lord, even that which is as small as an atom's weight or greater or smaller. All is recorded in the glorious Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever work you (O dear Prophet Mohammed – peace and blessings be upon him) are engaged in and recite a part of the Qur’an from Him, and whatever you people do, We are Witness upon you from the time you begin it; and there is nothing in the earth or in the heaven worth the weight of the smallest particle hidden from your Lord, nor anything smaller or greater than it, which is not recorded in a clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither you do any deed nor recite any portion of the Qur'an, nor you do any deed, but We are Witness thereof when you are doing it. And nothing is hidden from your Lord (so much as) the weight of a speck of dust on the earth or in the heaven. Not what is less than that or what is greater than that but is (written) in a Clear Record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you are not (engaged) in any affair, nor do you recite concerning it any portion of the Quran, nor do you do any work but We are witnesses over you when you enter into it, and there does not lie concealed from your Lord the weight of an atom in the earth or in the heaven, nor any thing less than that nor greater, but it is in a clear book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou art not upon any occupation, neither recitest thou any Koran of it, nor do you any work, without that We are witnesses over you when you press on it; and not so much as the weight of an ant in earth or heaven escapes from thy Lord, neither is aught smaller than that, or greater, but in a Manifest Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou (Muhammad) art not occupied with any business and thou recitest not a Lecture from this (Scripture), and ye (mankind) perform no act, but We are Witness of you when ye are engaged therein. And not an atom's weight in the earth or in the sky escapeth your Lord, nor what is less than that or greater than that, but it is (written) in a clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In whatever activity you may be engaged, and whichever part of the Quran you recite, and whatever deed you do, We are witness to it when you are engaged in it. Not the smallest particle on the earth or in heaven is hidden from your Lord; and there is nothing smaller or bigger but is recorded in a clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou art not engaged in any business, nor dost thou recite any part of the Qur'an, nor ye work any work, but We are witnesses over you when ye are engaged therein. And there escapeth not thy Lord the weight of an ant in the earth or the heavens, nor less than that nor greater, but it is in a Book luminous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You do not engage in any work, neither do you recite any part of the Quran, nor do you perform any deed without Our being witness over you when you are engaged therein. Not an atom’s weight escapes your Lord in the earth or in the sky, nor [is there] anything smaller than that nor bigger, but it is in a manifest Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In whatever business thou mayest be, and whatever portion thou mayest be reciting from the Qur'an,- and whatever deed ye (mankind) may be doing,- We are witnesses thereof when ye are deeply engrossed therein. Nor is hidden from thy Lord (so much as) the weight of an atom on the earth or in heaven. And not the least and not the greatest of these things but are recorded in a clear record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you (O Muhammad SAW) may be doing, and whatever portion you may be reciting from the Quran, - and whatever deed you (mankind) may be doing (good or evil), We are Witness thereof, when you are doing it. And nothing is hidden from your Lord (so much as) the weight of an atom (or small ant) on the earth or in the heaven. Not what is less than that or what is greater than that but is (written) in a Clear Record. (Tafsir At-Tabari. Vol. 11, Page 129).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are not engaged in any matter, neither do you recite any portion of the Koran, nor do you do any work, except that We are witnesses over you when you press upon it? Not even as much as the weight of an ant in earth or heaven escapes your Lord, nor is there anything smaller or greater, but it is (recorded) in a Clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You do not get into any situation, nor do you recite any Quran, nor do you do anything, but We are watching over you as you undertake it. Not even the weight of an atom, on earth or in the sky, escapes your Lord, nor is there anything smaller or larger, but is in a clear record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, [O Muhammad], you are not [engaged] in any matter or recite any of the Qur'an and you [people] do not do any deed except that We are witness over you when you are involved in it. And not absent from your Lord is any [part] of an atom's weight within the earth or within the heaven or [anything] smaller than that or greater but that it is in a clear register.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:61] And you, O Muhammad (s), are not occupied with any business, any matter, nor do you recite anything regarding it, that is, regarding such a matter — [or it means: nor do you recite anything] from God, by way of the Qur’ān, which He has revealed to you, nor do you perform any action, God is addressing him and his community, but We are witnesses, watchers, over you when you are engaged therein, that is, [in] the action. And not so much as the weight of an atom, [the weight of] the smallest ant, in the earth or in the heaven escapes, is hidden from, your Lord, nor what is less than that or greater, but it is in a clear, a manifest, Book, namely, the Preserved Tablet (al-lawh al-mahfūz).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thou art not) Muhammad (occupied with any business) any matter (and thou recitest not) on them (a lecture from this (Scripture)) a surah or a verse, (and ye (mankind) perform no act) whether good or evil, (but We are Witness) but We have knowledge (of you) and of your matter, recitation and works (when ye are engaged therein) i.e. in the Qur'an and its denial. (And not an atom's weight) of the servants' works (in the earth or in the sky escapeth) is hidden from (your Lord, nor what is less) nor what is lighter (than that or greater than that) or heavier, (but it is (written) in a clear Book) but it is written in the Guarded Tablet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ تُفِيضُونَ فِيهِ } معناهُ تُكْثرون فِيهِ\n\n\n\n\nوقوله تعالى: { وَمَا يَعْزُبُ عَن رَّبِّكَ } معناه يَغِيبُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"When you pour forth [in prayer]\" - its meaning is that you multiply [your prayers] therein.\n\n\nAnd His saying - {And nothing is hidden from your Lord} - its meaning is that He is unseen.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n خير أو شر { إِلاَّ كُنَّا } بذاتنا وأوصافنا وأسمائنا { عَلَيْكُمْ شُهُوداً } حضراء رقباء\n مطلعين على جميع ما جئتم به وقت { إِذْ تُفِيضُونَ } أي: تخوضون وتقصدون الشروع { فِيهِ } أول الذب عنه { وَ } كيف لا نطلع عليها ولا يحيط علمنا بها وشهودنا إياها\n إذ { مَا يَعْزُبُ } أي: لا يغيب ويبعد { عَن رَّبِّكَ } ومربيكم أيها المظهر الجامع لجميع المراتب الكونية والكيانية والمتخلق بجميع الأخلاق الإلهية { مِن مِّثْقَالِ ذَرَّةٍ } كائنةٍ { فِي } أقطار { ٱلأَرْضِ وَلاَ } كائنة { فِي ٱلسَّمَآءِ } وفضائها { وَ } كيف يعزب ويغيب عن حيطة علمه شيء\n إذ { لاَ أَصْغَرَ مِن ذٰلِكَ } المقدار { وَلاۤ أَكْبَرَ إِلاَّ فِي كِتَابٍ مُّبِينٍ } [يونس: 61] ظاهر الإبانة والظهور بالنسبة إلى أرباب الولاء\n الباذلين أرواحهم في طريق الفناء\n المستغرقين في بحر الوحدة\n الفانين عن هوياتهم بالمرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الضمير في { منه } يعود على القرآن، وإن لم يتقدم ذكره لدلالة ما بعده عليه، كأنه قال: وما تتلو شيئاً من القرآن، وقيل: يعود على الشأن، والأول أرجح لأن الإضمار قبل الذكر تفخيم للشيء. قاله ابن جزي. قلت: والأحسن أن يعود على الله تعالى لتقدم ذكره قبل، ومن قرأ: { ولا أصغر } ، { ولا أكبر } بالفتح فعطف على { مثقال } ممنوع من الصرف، أو مبني مع \" لا \" ، ومن قرأ بالرفع فعطف على موضعه، أو مبتدأ، و { إلا في كتاب }: خبر. يقول الحق جل جلاله: { وما تكون في شأنٍ } أي: أمر من الأمور، والخطاب للنبي صلى الله عليه وسلم والمراد هو وجميع الخلق، ولذلك قال في آخرها. { ولا تعملون من عمل } ، ومعنى الآية: إحاطة علم الله تعالى بكل شيء، { وما تتلو منه من قرآنٍ } أي: وما تتلو شيئاً من القرآن، أو وما تتلو من الله من قرآن، أي: تأخذه عنه. { ولا تعملون من عملٍ } أي عمل كان، وهو تعميم للخطاب بعد تخصيصه بمن هو رأسهم، ولذلك ذكر الحق تعالى، حيث خص بالذكر ما فيه فخامة وتعظيم، وذكر حيث عمم ما يتناول الجليل والحقير، أي: لا تعلمون شيئاً { إلا كنا عليكم شهوداً }: رقباء مطلعين عليه ظاهراً وباطناً، { إذ تُفيضون فيه }: حين تخوضون فيه وتندفعون إليه، يقال: أفاض الرجل في الأمر: إذا أخذ فيه بجد واندفع إليه، ومنه:\n[البقرة: 198]، { وما يَعْزُبُ عن ربك } أي: ما يغيب عنه { مثقال ذرةٍ }: ما يوازن نملة، { في الأرض ولا في السماء } والمراد: لا يغيب عنه شيء في الوجود بأسره، وخصهما لأن العامة لا تعرف غيرهما. قال في الكشاف: فإن قلت: لِمَ قدَّم هنا الأرض بخلاف سورة سبأ؟ فالجواب: أن السماء قدمت في سبأ لأن حقها التقديم، وقدمت الأرض هنا لما ذكرت الشهادةُ على أهل الأرض. هـ. { ولا أصغرَ من ذلك ولا أكبرَ إلا في كتاب مبين } أي: اللوح المحفوظ، أو علمه تعالى المحيط، المُبيّن للأشياء على ما هي عليه.  الإشارة: هذه الآية وأمثالها هي أصل المراقبة عند القوم، وهي على ثلاثة أقسام: مراقبة الظواهر، ومراقبة القلوب، ومراقبة السرائر. فالأولى للعوام، والثانية للخواص، والثالثة لخواص الخواص. فأما مراقبة الظواهر: فهي اعتقاد العبد أن الله يراه، ومطلع عليه في كل مكان، فينتجُ له الحياء من الله، فيستحيي أن يسيء الأدب معه وهو بين يديه، وفي بعض الأخبار القدسية:\n \" إن كنتم تعتقدون أني لا أراكم، فالخَللُ في إيمانكم، وإن كنتم تعتقدون أني أراكم فلِمَ جعلتموني أهون الناظرين إليكم؟ \". \nوقال ـ عليه الصلاة والسلامـ:\n \" أفضل الناس إيماناً من يعلم أن الله معه في كل مكان \" \n \nأو كما قال صلى الله عليه وسلم: ورُوي أن عبد الله بن عمر رضي الله عنه مرَّ براعي غنم، فقال له: أعطنا شاة من غنمك، فقال له: ليست لي. فقال له: لصاحبها أكلها الذئب، فقال له الراعي: وأين الله؟!. ورُويَ أن رجلاً خلا بجارية فراودها على المعصية، وقال لها: لا ترانا إلا الكواكب، فقالت له: وأين مُكوكُبها؟.  وأما مراقبة القلوب فهي: تحقيق العبد أن الله مطلع على قلبه، فيستحي منه أن يجول فيما لا يعني، أو يدبر ما لا يفيد ولا يجدي، أو يهم بسوء أدب فإنْ جال في ذلك استغفر وتاب. وأما مراقبة السرائر فهي: كشف الحجاب عن الروح، حتى ترى الله أقرب إليها من كل شيء، فتستحي أن تجول فيما سواه من المحسوسات، فإن فعلت بادرت إلى التوبة والاستغفار، فالتوبة لا تفارق أهل المراقبة مطلقاً، وقد تقدم في أول سورة النساء بعض الكلام على المراقبة، فمن لم يُحْكِم أمر المراقبة، لم يذق أسرار المشاهدة. فالمراقبة مفتاح المشاهدة، والمشاهدة مفتاح المعرفة، والمعرفة هي الولاية، التي أشار إليها بقوله: { أَلاۤ إِنَّ أَوْلِيَآءَ ٱللَّهِ لاَ خَوْفٌ عَلَيْهِمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:3",
      "similarity": 0.7208635501789498
    },
    {
      "verse": "55:29",
      "similarity": 0.3772543531124799
    },
    {
      "verse": "80:37",
      "similarity": 0.3655416155169778
    },
    {
      "verse": "24:62",
      "similarity": 0.35490519824031946
    },
    {
      "verse": "46:8",
      "similarity": 0.21211010308325948
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/10:61.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/10:61.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/10:61.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}