{
  "chapter": "يونس",
  "text": "وما ظن الذين يفترون على الله الكذب يوم القيمة ان الله لذو فضل على الناس ولكن اكثرهم لا يشكرون",
  "translations": [
    {
      "translation": "What will those who invent lies against Allah think on the Day of Rising? Allah shows favour to mankind but most of them are not thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do those who invent lies of God think about the Day of Reckoning? (Will they escape the judgement?) In fact God is gracious to men; but most of them are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think how those who invent lies against Him will be treated on, the Day of Judgement? Allah is bountiful to men yet most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do those who ascribe falsehood to God think of the Day of Judgment? God is generous to the human being, yet many do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what do they, who fabricate lies against Allah, assume will be their state on the Day of Resurrection? Indeed Allah is Most Munificent upon mankind, but most people are not thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what think those who invent a lie against Allah, on the Day of Resurrection Truly, Allah is full of bounty to mankind, but most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what will be the thought of those who forge lies against Allah on the day of resurrection? Most surely Allah is the Lord of grace towards men, but most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will they think, who forge falsehood against God; on the Day of Resurrection? God is bountiful to men; but most of them are not thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what think those who invent a lie concerning Allah (will be their plight) upon the Day of Resurrection? Lo! Allah truly is Bountiful toward mankind, but most of them give not thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will they think, those who invent falsehoods about God, on the Day of Resurrection? God is bountiful to men: yet most of them are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what imagine those who fabricate a lie against Allah of the Day of Resurrection? Verily Allah is the owner of grace unto mankind, but most of them return not thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is the idea of those who fabricate lies against Allah [concerning their situation] on the Day of Resurrection? Indeed Allah is gracious to mankind, but most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what think those who invent lies against Allah, of the Day of Judgment? Verily Allah is full of bounty to mankind, but most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what think those who invent lies against Allah, on the Day of Resurrection? [i.e. Do they think that they will be forgiven and excused! Nay, they will have an eternal punishment in the Fire of Hell]. Truly, Allah is full of Bounty to mankind, but most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will those who forged falsehood about Allah think on the Day of Resurrection? Allah is Bountiful to mankind; yet most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will they think—those who fabricate lies and attribute them to God—on the Day of Resurrection? God is bountiful towards the people, but most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what will be the supposition of those who invent falsehood about Allah on the Day of Resurrection? Indeed, Allah is full of bounty to the people, but most of them are not grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:60] And what do they suppose, those who invent lies concerning God, [will happen to them] on the Day of Resurrection?: do they reckon that He will not chastise them? No! Truly God is Bountiful to mankind, by granting them respite and bestowing graces upon them, but most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على { جملة قل أرأيتم } \\[ يونس : 59 \\] ، فهو كلام غير داخل في القول المأمور به ، ولكنه ابتداء خطاب لجميع الناس . و { ما } للاستفهام . والاستفهام مستعمل في التعجيب من حالهم . والمقصود به التعريض بالمشركين ليستفيقوا من غفلتهم ويحاسبوا أنفسهم .ولذلك كان مقتضى الظاهر أن يؤتى بضمير ( هم ) مضافاً إليه الظن إما ضميرَ خطاب أو غيبة . فيقال : وما ظنكم أو وما ظنهم ، فعدل عن مقتضى الظاهر إلى الإتيان بالموصول بالصلة المختصة بهم للتنبيه على أن الترْديد بين أن يكون الله أذن لهم فيما حرَّموه وبين أن يكونوا مفترين عليه قد انحصر في القسم الثاني ، وهو كونهم مفترين إذ لا مساغ لهم في ادعاء أنه أذن لهم ، فإذ تعين أنهم مفترون فقد صار الافتراء حالهم المختص بهم . وفي الموصول إيذان بعلة التعجيب من ظنهم بأنفسهم يوم القيامة .وحذف مفعولا الظن لقصد تعميم ما يصلح له ، أي ما ظنهم بحالهم وبجزائهم وبأنفسهم . وانتصب { الكذبَ } على المفعول المطلق ، واللام فيه لتعريف الجنس ، كأنه قيل كذباً ، ولكنه عرف لتفظيع أمره ، أي هو الكذب المعروف عند الناس المستقبح في العقول .و { يوم القيامة } منصوب على الظرفية وعامله الظن ، أي ما هو ظنهم في ذلك اليوم أي إذا رأوا الغضب عليهم يومئذٍ ماذا يكون ظنهم أنهم لاقون ، وهذا تهويل .وجملة : { إن الله لذو فضل على الناس } تذييل للكلام المفتتح بقوله : { يأيها الناس قد جاءتكم موْعظة من ربكم وشفاء لما في الصدور } \\[ يونس : 57 \\]. وفيه قطع لعذر المشركين ، وتسجيل عليهم بالتمرد بأن الله تفضل عليهم بالرزق والموعظة والإرشاد فقابلوا ذلك بالكفر دون الشكر وجعلوا رزقهم أنهم يكذبون في حين قابله المؤمنون بالفرح والشكر فانتفعوا به في الدنيا والآخرة .\n\n",
      "translations": [
        {
          "translation": "(And what think those who invent a lie concerning Allah) He will do with them (upon the Day of Resurrection? Lo! Allah truly is Bountiful) favourable (towards mankind) by delaying His punishment, (but most of them give not thanks) for it nor do they believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أي: لا يبقى ظنهم وليس شيئاً حينئذ أو يوم القيامة الصغرى بالموت وحصول الحرمان أي: يكون ظنهم وبالاً وعذاباً حينئذ { إنّ الله لذو فضل على الناس } بصنفي العلمين وإفاضتهما وتوفيق القبول لهما وتهيئة الاستعداد لقبولهما { ولكن أكثرهم لا يشكرون } نعمته فيستعملون ما وهب لهم من الاستعداد والعلوم في تحصيل المنافع الجزئية والمطالب الحسية ويكفرون نعمته فيمنعون عن الزيادة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا ظَنُّ } أي: أي شيء ظن أولئك المفترون { ٱلَّذِينَ يَفْتَرُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ } بأنهم لم يجاوزوا ولم يؤاخذوا { يَوْمَ ٱلْقِيَامَةِ } على افترائهم على الله ما لم يصدر عنه\n بل إنهم مؤاخذون على جرأتهم على الله وافترائهم به\n سيما بعد ورود الزواجر والروادع من الآيات الدالة على امتناعهم عنها فلم يمتنعوا { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { لَذُو فَضْلٍ } عظيم { عَلَى ٱلنَّاسِ } بإنزال الكتب وإرسال الرسل المنبهين على ما هو الأصلح لهم وأليق بحالهم { وَلَـٰكِنَّ أَكْثَرَهُمْ } بجهلهم وخبث باطنهم { لاَ يَشْكُرُونَ } [يونس: 60] نعمه بل ينكرون ويكفرون بها عناداً ومكابرة\n\n\n{ وَ } كيف ينكرون رسالتك ووحيك من الله وتأييدك من عنده سبحانه\n إذ { مَا تَكُونُ فِي شَأْنٍ } وأمر من ادعاء الرسالة من الله والتشريع من جانبه بلا إذن منه { وَمَا تَتْلُواْ مِنْهُ مِن قُرْآنٍ } مدعياً نزوله من عنده بلا وحيه وإنزاله { وَلاَ تَعْمَلُونَ } أنتم أضاً { مِنْ عَمَلٍ } صالح أو طالح",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما ظنّ الذين يفترون على الله الكذبَ يوم القيامة } \n أيُّ شيء ظنهم يفعل بهم\n أيحسبون أنه لا يجازيهم عليه؟ وفيه تهديد عظيم لهم\n { إن الله لذو فضل على الناس } \n حيث أنعم عليهم بالعقل\n وهداهم بإرسال الرسل وإنزال الكتب\n وشرع لهم الأحكام\n { ولكن أكثرهم لا يشكرون } هذه النعمة\n قال ابن عطية: ثنَّى بإيجاب الفضل على الناس في الإمهال لهم مع الافتراء والعصيان\n والإمهال داعية إلى التوبة والإنابة\n ثم استدرك من لا يرى حق الإمهال ولا يشكره\n ولا يبادر فيه على جهه الذم لهم\n والآية بعد هذا تعم جميع فضل الله\n وجميع تقصير الخلق في شكره\n لا رب غيره\n هـ\n  الإشارة: الوقوف مع حدود الشريعة\n والتمسك بالسنة النبوية قولاً وفعلاً\n وأخذاً وتركاً\n والاهتداء بأنوار الطريقة تخلية وتجلية\n هو السير إلى أسرار الحقيقة\n فمن تخطى شيئاً من ذلك فقد حاد عن طريق السير\n وبالله التوفيق\n ثم هددهم بمراقبته عليهم\n فقال: { وَمَا تَكُونُ فِي شَأْنٍ وَمَا تَتْلُواْ مِنْهُ مِن قُرْآنٍ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:73",
      "similarity": 0.6903601295678108
    },
    {
      "verse": "40:61",
      "similarity": 0.536032554071676
    },
    {
      "verse": "16:105",
      "similarity": 0.40414902605174724
    },
    {
      "verse": "72:5",
      "similarity": 0.37338297822666294
    },
    {
      "verse": "3:94",
      "similarity": 0.3686110414445082
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010060.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010060.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:60.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}