{
  "chapter": "يونس",
  "text": "هو الذى جعل لكم اليل لتسكنوا۟ فيه والنهار مبصرا ان فى ذلك لءايت لقوم يسمعون",
  "translations": [
    {
      "translation": "It is He who appointed the night for you, so that you could rest in it, and the day for seeing. There are certainly Signs in that for people who listen.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the night for you to rest, and made the day enlightening. Indeed there are signs in this for those who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah alone Who has made the night that you may rest in it, and has made the day light-giving. Surely in that there are signs for those who give heed (to the call of the Messenger).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has made the night for you to rest and has filled the day with light (as a means of visibility). In this there is evidence (of the existence of God) for the people who hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who created the night for you so that you may gain rest in it and the day giving sight; indeed in this are signs for the people who heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has appointed for you the night that you may rest therein, and the day to make things visible (to you). Verily, in this are Ayat for a people who listen (those who think deeply).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who made for you the night that you might rest in it, and the day giving light; most surely there are signs in it for a people who would hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made for you the night to repose in it, and the day, to see; surely in that are signs for a people who have ears.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath appointed for you the night that ye should rest therein and the day giving sight. Lo! herein verily are portents for a folk that heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made the night dark for you so that you may rest in it, and the day a source of light. Surely, there are signs in this for a people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who hath appointed for you the night that ye may repose therein and the day enlightening. Verily in that are signs for a people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the night for you, that you may rest in it, and the day to provide visibility. There are indeed signs in that for people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is That hath made you the night that ye may rest therein, and the day to make things visible (to you). Verily in this are signs for those who listen (to His Message).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has appointed for you the night that you may rest therein, and the day to make things visible (to you). Verily, in this are Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) for a people who listen (i.e. those who think deeply).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who has made the night for your rest and the day to see. Surely, in this there are signs for people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the night for your rest, and the daylight for visibility. Surely in that are signs for people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made for you the night to rest therein and the day, giving sight. Indeed in that are signs for a people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:67] He it is Who made for you the night that you should rest therein, and the day to see: the attribution of sight (ibsār) to ‘the day’ is figurative, since one is able to see during it. Surely in that are signs, indications of His Oneness, exalted be He, for a folk who are able to hear, hearing [in such a way so as] to reflect and be admonished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is) i.e. it is your Lord (who hath appointed) created (for you the night that you should rest therein and the day giving sight) and the day bright and clear so that you are able to come and go. (Lo! Herein) in that which I have mentioned (verily are portents) lessons (for a folk that heed) the admonitions of the Qur'an and who also obey.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكيف تغفلون عن الله أيها الجاهلون\n وكيف تشركون معه غيره أيها المحجوبون { هُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيلَ } بكمال قدرته وحكمته لباساً { لِتَسْكُنُواْ فِيهِ } وتستريحوا من المتاعب { وَ } جعل لكم { ٱلنَّهَارَ مُبْصِراً } لتهتدوا إلى مطالبكم في أمور معاشكم { إِنَّ فِي ذٰلِكَ } الجعل والتقدير { لآيَاتٍ } عظام ودلائل جسام على كمال قدرته ومتانة حكمه وحكمته وتوحده في ألوهيته\n وتفرده في ربوبيته واستقلاله في التصرف بلا مظاهرة أحد ومشاركة ضد وند { لِّقَوْمٍ يَسْمَعُونَ } [يونس: 67] سمع تدبر وتدرب واستكشاف تام بعزيمة صادقة صافية عن شوب الغفلة والذهول\n\n\nومن كثافة حجبهم وغشاوة قلوبهم وأسماعهم وأبصارهم ما قدروا الله حق قدره\n لذلك نسبوا إليه ما هو منزه عنه سبحانه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والنهارَ مبصراً } طلباً لمعاشكم\n وفيه تنبيه على كمال قدرته وعظيم نعمته\n ليدُلهم على تفرده باستحقاق العبادة { إن في ذلك لآيات لقوم يسمعون } سماع تدبر واعتبار\n الإشارة: كل من ركن إلى شيء دون الله\n محبة أو خوفاً أو طمعاً فيه\n فقد أشرك مع الله\n ولم يتبع إلا الظن والوهم\n وفي الحِكَم: \" ما قادك شيءٌ مثلُ الوهم\n أنت حرٌ مما أنت آيس\n وعبد لما أنت فيه طامع\n فكيف يترك العبد سيده الذي بيده ملك السماوات والأرض\n ويتعلق بعبد مثله حقير؟\n يترك الملك الكبير ويتعلق بالعبد الصغير \"\n هو الذي جعل ليل القبض لتسكنوا فيه عن التعلق بالغير\n ونهار البسط لتبصروا في انتشاركم الحقائق العرفانية والأسرار الربانية\n إن كنتم تسمعون به ومنه\n فتنزهونه عما لا يليق به\n كما قال تعالى: { قَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَداً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:86",
      "similarity": 0.8574233068888859
    },
    {
      "verse": "6:13",
      "similarity": 0.8322384761431388
    },
    {
      "verse": "40:61",
      "similarity": 0.6194451697475519
    },
    {
      "verse": "28:73",
      "similarity": 0.5562078086338675
    },
    {
      "verse": "71:5",
      "similarity": 0.5274214236519679
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/10:67.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/10:67.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:67.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}