{
  "chapter": "يونس",
  "text": "لهم البشرى فى الحيوة الدنيا وفى الءاخرة لا تبديل لكلمت الله ذلك هو الفوز العظيم",
  "translations": [
    {
      "translation": "there is good news for them in the life of this world and in the Next World. There is no changing the words of Allah. That is the great victory!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is good news in the life of the world and in the life to come. There is no changing the words of God. That will be the great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them are glad tidings in this world and in the Hereafter. The words of Allah shall not change. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "will receive glad news both in this life and in the life hereafter. The words of God do not change. This alone is the supreme triumph\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are good tidings for them in the life of this world and in the Hereafter; the Words of Allah cannot change; this is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is good news, in the life of the present world, and in the Hereafter. No change can there be in the Words of Allah. This is indeed the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have good news in this world's life and in the hereafter; there is no changing the words of Allah; that is the mighty achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for them is good tidings in the present life and in the world to come. There is no changing the words of God; that is the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Theirs are good tidings in the life of the world and in the Hereafter - There is no changing the Words of Allah - that is the Supreme Triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there is good news in this life and in the Hereafter: the Word of God shall never change. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto them is glad tidings in the life of the world and in the Hereafter. No changing is there in the words of Allah. That! it is the mighty achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is good news in the life of this world and in the Hereafter. (There is no altering the words of Allah.) That is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them are glad tidings, in the life of the present and in the Hereafter; no change can there be in the words of Allah. This is indeed the supreme felicity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them are glad tidings, in the life of the present world (i.e. righteous dream seen by the person himself or shown to others), and in the Hereafter. No change can there be in the Words of Allah, this is indeed the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there is for them glad tidings in this present life and in the Everlasting Life. The Word of Allah is unchanging, that is the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is good news in this life, and in the Hereafter. There is no alteration to the words of God. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them are good tidings in the worldly life and in the Hereafter. No change is there in the words of Allah. That is what is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:64] Theirs are good tidings in the life of this world: in a hadīth verified by al-Hākim this has been explained as [referring to] a propitious vision which an individual might have or [a vision] which another might have of that person; and in the Hereafter: Paradise and reward. There is no changing the Words of God, no failing of His promises; that, mentioned, is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Theirs are good tidings in the life of the world) through good dream visions which they see or are seen in their favour (and in the Hereafter) by entering Paradise. (There is no changing the Words of Allah) that they will enter Paradise (that) good tiding (is the Supreme Triumph) the abounding salvation: they earn Paradise and all that is in it and are saved from hell and all that is in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ووصلوا إلى ما أظهر الحق لأجله وهو المعرفة والشهود { لاَ تَبْدِيلَ لِكَلِمَاتِ ٱللَّهِ } التامات الناطقة بالكرامة والبشرى { ذٰلِكَ } التبشير الشامل للنشائين { هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ } [يونس: 64] واللطف الجسيم لأهل العناية من أرباب القبول\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا تبديل لكلماتِ الله } أي: لا تغيير لأقواله\n ولا اختلاف لمواعيده\n واستدل ابن عمر بالآية على أن القرآن لا يقدر أحد أن يُغيره\n { ذلك هو الفوز العظيم } الإشارة إلى كونهم مبشَّرين في الدارين\n أو لانتفاء الخوف والحزن عنهم مع ما بُشروا به\n والله تعالى أعلم\n الإشارة: الولاية على قسمين: ولاية عامة\n وولاية عرفية خاصة\n فالولاية العامة\n هي التي ذكرها الحق تعالى: فكل من حقق الإيمان والتقوى فله من الولاية على قدر ما حصًّل منها\n والولاية الخاصة خاصة بأهل الفناء والبقاء\n الجامعين بين الحقيقة والشريعة\n بين الجذب والسلوك مع الزهد التام والمحبة الكاملة\n وصحبة من تحققت ولايته\n فقد سئل ـ عليه الصلاة والسلام ـ عن أولياء الله الذين لا خوف عليهم ولا هم يحزنون\n فقال:\n \" الذينَ نَظَرُوا إلى بَاطِنِ الدنْيَا\n حينَ نَظََرَ النَّاسُ إلى ظََاهِرهَا\n واهْتَمُّوا بآجِلِ الدُّنيا حِين اهتَمَّ النَّاسُ بعَاجِلِها فأمَاتُوا منها ما خَشوا أن يُمِيتهم\n وتركوا منها ما عملوا أن سيتركُهُم\n فما عارضهم من نائلها عارض إلا رفضوه\n ولا خادعهم من رفعتها خادعٍ إلا وضعوه\n خلقتِ الدنيا في قلوبهم فما يجددونها وخربت بينهم فما يعمرونها\n وماتت في صدروهم فما يُحْيونها بل يهدمُونها\n فيبنون بها آخرتهم\n ويبيعونها فيشترون بها ما يبقى لهم\n نظروا إلى أهلها صرْعى قد حلَّت بهم المَثُلات\n فما يرون أماناً دون ما يرجون\n ولا خوفاً دون ما يجدون \"\n \nوفي حديث آخر: قيل: يا رسول الله مَنْ أولياء الله؟ قال:\n\n \" المتحابَّون في الله \" \nوقال القشيري رضي الله عنه: علامة الولي ثلاث: شغله بالله\n وفراره إلى الله\n وهمه الله\n هـ\n وقال أبو سعيد الخراز رضي الله عنه: إذا أراد الله أن يوالي عبداً من عباده فتح عليه باب ذكره\n فإذا اشتد ذكره فتح عليه باب القرب\n ثم رُفع إلى مجلس الأنس\n ثم أجلسه على كرسي التوحيد\n ثم رفع عنه الحجب وأدخله دار الفردانية\n وكشف له عن الجلال والعظمة\n فإذا عاين ذلك بقي بلا هو\n فحينئذٍ يفني نفسه ويبرأ من دعاويها\n هـ\n فأنت ترى كيف جعل الفناء هو نهاية السير والوصول إلى الولاية\n فَمن لا فناء له لا محبة له\n ومن لا محبة له لا ولاية له\n وإلى ذلك أشار ابن الفارض رضي الله عنه\n في تائيته بقوله:\nوقوله تعالى: { الذين أمنوا } أي: إيمان الخصوص\n { وكانوا يتقون } ما سوى الله فلا يطمئنون إلى شيء سواه\n { لهم البشرى في الحياة الدنيا } \n حلاوة الذوق والوجدان\n مع مقام الشهود والعيان\n { وفي الآخرة } بإدراك ما لا عين رأت\n ولا أذن سمعت\n ولا خطر ببال من المعارف والأسرار\n فمن أدرك هذا فليوطن نفسه على الإنكار\n ولذلك سلَّى نبيه\n وينسحب على ورثته مما يلقونه من أهل الإنكار\n فقال: { وَلاَ يَحْزُنكَ قَوْلُهُمْ إِنَّ ٱلْعِزَّةَ للَّهِ جَمِيعاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:60",
      "similarity": 0.5693129587222341
    },
    {
      "verse": "44:57",
      "similarity": 0.5374354716796557
    },
    {
      "verse": "40:9",
      "similarity": 0.5076691042636527
    },
    {
      "verse": "78:31",
      "similarity": 0.4805474022231292
    },
    {
      "verse": "33:71",
      "similarity": 0.42693947098132834
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/10:64.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/10:64.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:64.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}