{
  "chapter": "يونس",
  "text": "الا ان اولياء الله لا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "Yes, the friends of Allah will feel no fear and will know no sorrow:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, there is neither fear nor regret for the friends of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Oh, surely the friends of Allah have nothing to fear, nor shall they grieve -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The friends of God will certainly have nothing to fear, nor will they be grieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pay heed! Indeed upon the friends of Allah is neither any fear, nor any grief. (The friends of Allah are the best in the creation.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! The Awliya' of Allah, no fear shall come upon them nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now surely the friends of Allah-- they shall have no fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God's friends -- no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! verily the friends of Allah are (those) on whom fear (cometh) not, nor do they grieve?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are close to God shall certainly have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! verily the friends of Allah! no fear shall come upon them nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look! The friends of Allah will indeed have no fear nor will they grieve\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! verily on the friends of Allah there is no fear, nor shall they grieve;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No doubt! Verily, the Auliya' of Allah [i.e. those who believe in the Oneness of Allah and fear Allah much (abstain from all kinds of sins and evil deeds which he has forbidden), and love Allah much (perform all kinds of good deeds which He has ordained)], no fear shall come upon them nor shall they grieve,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, there shall be neither fear nor sorrow upon the guided by Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unquestionably, God’s friends have nothing to fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:62] Assuredly God’s friends, no fear shall befall them, neither shall they grieve, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! verily the) believing (friends of Allah are (those) on whom fear (cometh) not) regarding any future punishment, (nor do they grieve) about that which they have left behind.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ألا إن أوليَاء الله } المستغرقين في عين الهوية الأحدية بفناء الأنية { لا خوف عليهم } إذ لم يبق منهم بقية خافوا بسببها من حرمان ولا غاية وراء ما بلغوا فيخافوا من حجبه { ولا هم يحزنون } لامتناع فوات شيء من الكمالات واللذات منهم\n فيحزنوا عليه\n وعن سعيد بن جبير رضي الله عنه: إن رسول الله صلى الله عليه وسلم سُئل من هم؟ فقال:\n \" هم الذين يذكروا الله برؤيتهم \" \nوهذا رمز لطيف منه عليه السلام\n وعن عمر رضي الله عنه: سمعت رسول الله صلى الله عليه وسلم يقول:\n \" إن من عباد الله عباداً ما هم بأنبياء ولا شهداء يغبطهم الأنبياء والشهداء يوم القيامة لمكانهم من الله \" \n قالوا: يا رسول الله\n أخبرنا من هم وما أعمالهم؟ فلعلنا نحبهم\n قال: \" هم قوم تحابّوا في الله على غير أرحام بينهم ولا أموال يتعاطونها\n فوالله إن وجوههم لنور وإنهم لعلى منابر من نور\n لا يخافون إذا خاف الناس ولا يحزنون إذا حزن الناس \" \n \nثم قرأ الآية\n قوله: وإنهم لعلى منابر من نور\n يريد به اتصالهم بالمبادئ العالية الروحانية كالعقل الأول وما يليه\n { الذين آمنوا وكانوا يتّقون } إن جعل صفة لأولياء الله فمعناه الذين آمنوا بالإيمان الحقيّ وكانوا يتقون بقاياهم وظهور تلويناتهم\n { لهم البُشْرى في الحياة الدنيا } بوجود الاستقامة في الأعمال والأخلاق المبشرة بجنة النفوس { وفي الآخرة } بظهور أنوار الصفات والحقائق الروحانية والمعارف الحقّانية عليهم المبشرة بجنة القلوب وحصول الذوق بهما واللذة { لا تبديل لكلمات الله } لحقائقه الواردة عليهم وأسمائه المنكشفة لهم وأحكام تجلياته النازلة بهم\n وإن جعل كلاماً برأسه مبتدأ فمعناه الذين آمنوا الإيمان اليقيني وكانوا يتقون حجب صفات النفس وموانع الكشف من التشكيكات الوهمية والوساوس الشيطانية { لهم البشرى في الحياة الدنيا } بوجدان لذة برد اليقين في النفس واطمئنانها بنزول السكينة وفي الآخرة بوجدان ذوق تجليات الصفات وأثر أنوار المكاشفات لا تبديل لكلمات الله من علومهم اللدنية وحكمهم اليقينية أو فطرتهم التي فطرهم الله عليها فإن كل نفس كلمة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلاۤ إِنَّ أَوْلِيَآءَ ٱللَّهِ } المنخلعين عن لوازم البشرية بالكلية المنسلخين عن مقتضيات أهوية نفوسهم رأساً { لاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ } [يونس: 62] إذ الخوف والحزن إنما هي من لوازم الطبيعة ومن ارتكاب مقتضياتها\n\n\nوبعدما انسلخوا عنها وتجردوا عن لوازمها وفانوا في هوية الحق وصاروا ما صاروا\n لم يبقَ فيهم مبدأ الخوف والحزن والأمن والسرور\n إلا لا يتصف الفاني بأمثال هذه الأضداد\n وهم { ٱلَّذِينَ آمَنُواْ } بالله في بداية سلوكهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" الذين آمنوا \": صفة للأولياء\n أو منصوب على المدح\n أو مرفوع به على تقدير: \" هم \" أو مبتدأ\n و \" لهم البشرى \": خبر\n يقول الحق جل جلاله: { ألا إن أولياءَ الله } الذين يتولونه بالطاعة\n وهو يتولاهم بالكرامة { لا خوفٌ عليهم } من لحوق مكروه\n { ولا هم يحزنون } بفوات مأمول\n ثم فسرهم بقوله: { الذين آمنوا وكانوا يتقون } \n فمن جمع بين الإيمان والتقوى فهو ولي ـ أعني الولاية العامة ـ وسيأتي بقية الكلام في الإشارة إن شاء الله\n { لهم البُشْرَى في الحياةِ الدنيا } وهو ما بشّر به المتقين في كتابه\n على لسان نبيه صلى الله عليه وسلم من الحفظ والعز والكفاية\n والنصر في الدنيا وما يثيبهم به في الآخرة\n أو ما يريهم من الرؤيا الصالحة يراها أو تُرى له\n رُوي ذلك عن رسول الله صلى الله عليه وسلم\n أو محبة الناس للرجل الصالح\n أو ما يتحفهم به من المكاشفات\n أو التوفيق لأنواع الطاعات\n أو بشرى الملائكة عند النزع\n أو رؤية المقعد قبل خروج الروح\n { وفي الآخرة } هي الجنة أو تلقي الملائكة إياهم عند الحشر بالبشرى والكرامة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:13",
      "similarity": 0.6265151679571791
    },
    {
      "verse": "43:68",
      "similarity": 0.6073494569375907
    },
    {
      "verse": "6:48",
      "similarity": 0.5139756024174631
    },
    {
      "verse": "41:30",
      "similarity": 0.486617709586499
    },
    {
      "verse": "10:55",
      "similarity": 0.4648153987023995
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/10:62.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/10:62.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/10:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}