{
  "chapter": "يونس",
  "text": "وما ظن الذين يفترون على الله الكذب يوم القيمة ان الله لذو فضل على الناس ولكن اكثرهم لا يشكرون",
  "translations": [
    {
      "translation": "What will those who invent lies against Allah think on the Day of Rising? Allah shows favour to mankind but most of them are not thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do those who invent lies of God think about the Day of Reckoning? (Will they escape the judgement?) In fact God is gracious to men; but most of them are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think how those who invent lies against Him will be treated on, the Day of Judgement? Allah is bountiful to men yet most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do those who ascribe falsehood to God think of the Day of Judgment? God is generous to the human being, yet many do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what do they, who fabricate lies against Allah, assume will be their state on the Day of Resurrection? Indeed Allah is Most Munificent upon mankind, but most people are not thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what think those who invent a lie against Allah, on the Day of Resurrection Truly, Allah is full of bounty to mankind, but most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what will be the thought of those who forge lies against Allah on the day of resurrection? Most surely Allah is the Lord of grace towards men, but most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will they think, who forge falsehood against God; on the Day of Resurrection? God is bountiful to men; but most of them are not thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what think those who invent a lie concerning Allah (will be their plight) upon the Day of Resurrection? Lo! Allah truly is Bountiful toward mankind, but most of them give not thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will they think, those who invent falsehoods about God, on the Day of Resurrection? God is bountiful to men: yet most of them are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what imagine those who fabricate a lie against Allah of the Day of Resurrection? Verily Allah is the owner of grace unto mankind, but most of them return not thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is the idea of those who fabricate lies against Allah [concerning their situation] on the Day of Resurrection? Indeed Allah is gracious to mankind, but most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what think those who invent lies against Allah, of the Day of Judgment? Verily Allah is full of bounty to mankind, but most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what think those who invent lies against Allah, on the Day of Resurrection? [i.e. Do they think that they will be forgiven and excused! Nay, they will have an eternal punishment in the Fire of Hell]. Truly, Allah is full of Bounty to mankind, but most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will those who forged falsehood about Allah think on the Day of Resurrection? Allah is Bountiful to mankind; yet most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will they think—those who fabricate lies and attribute them to God—on the Day of Resurrection? God is bountiful towards the people, but most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what will be the supposition of those who invent falsehood about Allah on the Day of Resurrection? Indeed, Allah is full of bounty to the people, but most of them are not grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:60] And what do they suppose, those who invent lies concerning God, [will happen to them] on the Day of Resurrection?: do they reckon that He will not chastise them? No! Truly God is Bountiful to mankind, by granting them respite and bestowing graces upon them, but most of them do not give thanks.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And what think those who invent a lie concerning Allah) He will do with them (upon the Day of Resurrection? Lo! Allah truly is Bountiful) favourable (towards mankind) by delaying His punishment, (but most of them give not thanks) for it nor do they believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا ظَنُّ } أي: أي شيء ظن أولئك المفترون { ٱلَّذِينَ يَفْتَرُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ } بأنهم لم يجاوزوا ولم يؤاخذوا { يَوْمَ ٱلْقِيَامَةِ } على افترائهم على الله ما لم يصدر عنه، بل إنهم مؤاخذون على جرأتهم على الله وافترائهم به، سيما بعد ورود الزواجر والروادع من الآيات الدالة على امتناعهم عنها فلم يمتنعوا { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { لَذُو فَضْلٍ } عظيم { عَلَى ٱلنَّاسِ } بإنزال الكتب وإرسال الرسل المنبهين على ما هو الأصلح لهم وأليق بحالهم { وَلَـٰكِنَّ أَكْثَرَهُمْ } بجهلهم وخبث باطنهم { لاَ يَشْكُرُونَ } [يونس: 60] نعمه بل ينكرون ويكفرون بها عناداً ومكابرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:73",
      "similarity": 0.6903601295678108
    },
    {
      "verse": "40:61",
      "similarity": 0.536032554071676
    },
    {
      "verse": "16:105",
      "similarity": 0.40414902605174724
    },
    {
      "verse": "72:5",
      "similarity": 0.37338297822666294
    },
    {
      "verse": "3:94",
      "similarity": 0.3686110414445082
    }
  ]
}