{
  "chapter": "يونس",
  "text": "قالوا۟ اتخذ الله ولدا سبحنه هو الغنى له ما فى السموت وما فى الارض ان عندكم من سلطنۭ بهذا اتقولون على الله ما لا تعلمون",
  "translations": [
    {
      "translation": "They say, 'Allah has a son.' Glory be to Him! He is the Rich Beyond Need. Everything in the heavens and everything on the earth belongs to Him. Have you authority to say this or are you saying about Allah what you do not know?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"God has begotten a son.\" Immaculate is He and self-sufficient.\" Whatsoever is in the heavens and the earth belongs to Him. You have no proof for this (assertion): Why do you say things of God you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Allah has taken a son. Glory be to Him. He is self-sufficient! His is all that is in the heavens and all that is in the earth. Have you any authority to support (that Allah has taken a son)? Do you ascribe to Allah something of which you have no knowledge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some people have said that God has begotten a son. God is too Glorious to have a son! God is Self-sufficient and to Him belongs all that is in the heavens and the earth. In this, you (people) have no authority. Do you ascribe to God things of which you have no knowledge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Allah has created a son for Himself”- Purity is to Him! He is the Perfect (Unwanting, free of needs); to Him only belongs all whatever is in the heavens and all whatever is in the earth; “You do not have any proof of this; do you say a thing concerning Allah which you do not know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Allah has begotten a son.\" Glory is to Him! He is Rich (free of all needs). His is all that is in the heavens and all that is in the earth. No warrant have you for this. Do you say against Allah what you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Allah has taken a son (to Himself)! Glory be to Him: He is the Self-sufficient: His is what is in the heavens and what is in the earth; you have no authority for this; do you say against Allah what you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'God has taken to Him a son. Glory be to Him! He is All-sufficient; to Him belongs all that is in the heavens and in the earth; you have no authority for this. What, do you say concerning God that you know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Allah hath taken (unto Him) a son - Glorified be He! He hath no needs! His is all that is in the heavens and all that is in the earth. Ye have no warrant for this. Tell ye concerning Allah that which ye know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"God has begotten a son.\" Glory be to Him. He is the Self-Sufficient One; everything in the heavens and on the earth belongs to Him. Do you have any authority for this? Would you ascribe to God something which you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: God hath taken a son. Hallowed be He-He, the selfesufficient! His is whatsoever is in the heavens and whatsoever is in the earth. No warranty is there with you for this. Ascribe ye falsely unto Allah that which ye know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘Allah has taken a son!’ Immaculate is He! He is the All-sufficient. To Him belongs whatever is in the heavens and whatever is in the earth. You have no authority for this [statement]. Do you attribute to Allah what you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Allah hath begotten a son!\" - Glory be to Him! He is self-sufficient! His are all things in the heavens and on earth! No warrant have ye for this! say ye about Allah what ye know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (Jews, Christians and pagans) say: \"Allah has begotten a son (children).\" Glory be to Him! He is Rich (Free of all wants). His is all that is in the heavens and all that is in the earth. No warrant you have for this. Do you say against Allah what you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Allah has taken a son' Exaltations be to Him (Allah)! Rich is He. To Him belongs all that is in the heavens and the earth you have no authority for this! What, do you say of Allah what you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “God has taken a son.” Be He glorified. He is the Self-Sufficient. His is everything in the heavens and everything on earth. Do you have any proof for this? Or are you saying about God what you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said, \"Allah has taken a son.\" Exalted is He; He is the [one] Free of need. To Him belongs whatever is in the heavens and whatever is in the earth. You have no authority for this [claim]. Do you say about Allah that which you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:68] They, that is, the Jews and the Christians, and those who claim that the angels are the daughters of God, say, ‘God has taken [to Him] a son’. God, exalted be He, says to them: Glory be to Him!, [in affirmation of] His transcending having offspring. He is Independent, [without need] of anyone, for only he who has need of a child would desire [to have] one. To Him belongs all that is in the heavens and all that is in the earth, as possessions, creatures and servants. You have no warrant, [no] proof, for this, that you say. Do you say about God what you do not know? (an interrogative meant as a rebuke).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They) the disbelievers of Mecca (say: Allah hath taken (unto Him) a son) from the female angels. (Glorified be He!) Allah exonerates Himself from having sons or partners. (He hath no needs!) He has no need for a son or partners. (His is all that is in the heavens and all that is in the earth) of created beings and marvels. (Ye have no warrant) you have neither scripture nor proof (for this. Tell ye) indeed, you are saying (concerning Allah that which you know not) of lies?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنْ عِندَكُمْ مِّن سُلْطَانٍ بِهَـٰذَآ } معناهُ حُجةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن كثافة حجبهم وغشاوة قلوبهم وأسماعهم وأبصارهم ما قدروا الله حق قدره؛ لذلك نسبوا إليه ما هو منزه عنه سبحانه؛ حيث { قَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَداً سُبْحَانَهُ } وتعالى عما يقول الظالمون علواً كبيراً، كيف يكون له ولد { هُوَ ٱلْغَنِيُّ } بذاته عن التعدد مطلقاً، ليس لغيره وجود أصلاً، بل { لَهُ } مظاهر { مَا فِي ٱلسَّمَٰوَٰت وَمَا فِي ٱلأَرْضِ } ظهر عليها سبحانه حسب أسمائه الحسنى وصفاته العليا على مقتضى التجلي الحبي اللطفي بلا انصباغ لها بالكون والتحقق بالانعكاس؟ { إِنْ عِندَكُمْ } أي: ما عندكم أيها المجاهلون بمعرفة الله وحق قدره { مِّن سُلْطَانٍ } حجة وبرهان { بِهَـٰذَآ } الادعاء الكاذب والقول الباطل، بل تتكلمون به افتراء ومراء { أَتقُولُونَ } وتفترون أيها المفترون { عَلَى ٱللَّهِ مَا لاَ تَعْلَمُونَ } [يونس: 68] ولا تدركون لياقته لجنابه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:144",
      "similarity": 0.4528344572830981
    },
    {
      "verse": "16:100",
      "similarity": 0.4281655834085066
    },
    {
      "verse": "19:35",
      "similarity": 0.41921646026869913
    },
    {
      "verse": "44:19",
      "similarity": 0.41405686770219324
    },
    {
      "verse": "37:156",
      "similarity": 0.40789391311066076
    }
  ]
}