{
  "chapter": "يونس",
  "text": "فان توليتم فما سالتكم من اجر ان اجرى الا على الله وامرت ان اكون من المسلمين",
  "translations": [
    {
      "translation": "If you turn your backs, I have not asked you for any wage. My wage is the responsibility of Allah alone. I am commanded to be one of the Muslims.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you turn away from me (remember) I do not ask any recompense from you. My reward is with God; I have been commanded to be one of those who submit to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you turned your back on my admonition (what harm did you cause me?) I had asked of you no reward, for my reward lies only with Allah, and I am commanded to be of those who totally submit (to Allah)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you turn away from my preaching, it will not harm me; I shall receive my reward from God who has commanded me to become a Muslim.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Then if you turn away, I do not ask any fee from you; my reward is only upon Allah, and I am commanded to be of the Muslims.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you turn away, then no reward have I asked of you, my reward is only from Allah, and I have been commanded to be of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you turn back, I did not ask for any reward from you; my reward is only with Allah, and I am commanded that I should be of those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if you turn your backs, I have not asked you for any wage; my wage falls only on God, and I have been commanded to be of those that surrender.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if ye are averse I have asked of you no wage. My wage is the concern of Allah only, and I am commanded to be of those who surrender (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you turn away from me, remember I demand no recompense from you. Only God will reward me and I have been commanded to submit completely to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If then ye turn away, I have asked of you no hire, my hire is only with Allah, and I am commanded to be of those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you turn your back [on me], I do not ask any reward from you; my reward lies only with Allah and I have been commanded to be of those who submit [to Allah].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if ye turn back, (consider): no reward have I asked of you: my reward is only due from Allah, and I have been commanded to be of those who submit to Allah's will (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you turn away [from accepting my doctrine of Islamic Monotheism, i.e. to worship none but Allah], then no reward have I asked of you, my reward is only from Allah, and I have been commanded to be one of the Muslims (those who submit to Allah's Will).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, if you turn your backs, I have not asked of you a wage. My wage falls only on Allah. I am commanded to be from those who surrender (Muslims)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“But if you turn away, I have not asked you for any wage. My wage falls only on God, and I was commanded to be of those who submit.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you turn away [from my advice] then no payment have I asked of you. My reward is only from Allah, and I have been commanded to be of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:72] But if you turn away, from my reminding [you], I have not asked you for any wage, any reward for it, so turn [and go] away: my wage, my reward, falls only on God, and I have been commanded to be of those who submit [to God]’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلتفريع الكلام على الكلام فجملة الشرط وجوابه مفرعتان على الجملتين السابقتين ، ولما كان توليهم عن دعوته قد وقع واستمر تعين أن جعل التولي في جملة الشرط مرادٌ به ما كان حصل ليرتب عليه جواب الشرط الذي هو شيء قد وقع أيضاً . وإنما قُصد إقرارهم به قطعاً لتعللاتهم واستقصاء لقطع معاذيرهم . والمعنى : فإن كنتم قد توليتم فقد علمتُم أني ما سألتكم أجراً فتتهموني برغبة في نفع ينجر لي من دعوتكم حتى تعرضوا عنها شُحَّا بأموالكم أو اتهاماً بتكذيبي ، وهذا إلزام لهم بأن توليهم لم يكن فيه احتمال تهمتهم إياه بتطلب نفع لنفسه . وبذلك برّأ نفسه من أن يكون سبباً لتولّيهم ، وبهذا تعين أن المعلق بهذا الشرط هو التحقق بين مضمون جملة الشرط وجملة الجزاء لا وقوعُ جملة الجزاء عند وقوع جملة الشرط . وذلك مثل قوله تعالى : { إن كنت قلته فقد علِمتَه } في آخر سورة \\[ العقود : 116 \\]. وقد تقدم عند قوله تعالى : { وإنْ كان طائفة منكم آمنوا بالذي أرسلت به ، وطائفة لم يؤمنوا فاصبروا حتى يحكم الله بيننا } في سورة \\[ الأعراف : 87 \\].وجملة : إن أجري إلا على الله } تعميم لنفي تطلبه أجراً على دعوتهم سواء منهم أم من غيرهم ، فالقصر حقيقي وبه يحصل تأكيد جملة : { فما سألتكم من أجر } مع زيادة التعميم . وطريقُ جزمه بأن الله يؤجره على ذلك هو وعد الله إياه به بما أوحى إليه .وأتى بحرف ( على ) المفيد لكونه حقاً له عند الله بناء على وعد الله إيَّاه وأعلمه بأن الله لا يخلف وعده ، فصار بالوعد حقاً على الله التزم الله به .والأجر : العوض الذي يعطى لأجل عمل يعمله آخذ العوض .وجملة : { وأمرت أن أكون من المسلمين } معطوفة على جملة الجواب ، والتقدير فإن توليتم فأمرت أن أكون من المسلمين ، أي أمرني الله أن أتبع الدين الحق ولو كنت وحدي . وهذا تأييس لهم بأن إجماعهم على التولي عنه لا يفل حده ولا يصده عن مخالفة دينهم الضلال .وبُني فعل { أمرت } للمجهول في اللفظ للعلم به ، إذ من المعلوم من سياق الكلام أنّ الذي أمره هو الله تعالى .وقوله : { أن أكون من المسلمين } أي من الفئة التي يصدق عليها هذا الوصف وهو الإسلام ، أي توحيد الله دون عبادة شريك ، لأنه مشتق من إسلام العبادة وتخليصها لله تعالى دون غيره . كما في قوله تعالى : { فقل أسلمت وجهي لله ومن اتبعنِ } \\[ آل عمران : 20 \\].وقد سمي التوحيد ودين الحق الخالص إسلاماً في مختلف العصور وسمَّى الله به سُنن الرسل فحكاه عن نوح عليه السلام هنا وعن إبراهيم بقوله تعالى : { إذ قال له ربه أسلم قال أسلمت لرب العالمين } \\[ البقرة : 131 \\] ، وعن إسماعيل{ ربنا واجعلنا مُسْلِمَين لك } \\[ البقرة : 128 \\] ، ويعقوب وبنيه إذ حكى عنهم { ونحن له مسلمون } \\[ البقرة : 133 \\] ، وعن يوسف { توفني مسلماً } \\[ يوسف : 101 \\] ، وعن موسى { وقال موسى يا قوم إن كنتم آمنتم بالله فعليه توكلوا إن كنتم مسلمين } \\[ يونس : 8 \\] ، وعن سليمان { أن لا تعلوا علي واتوني مسلمين } \\[ النمل : 31 \\] ، وعن عيسى والحواريين { قالوا آمنا واشهد بأننا مسلمون } \\[ المائدة : 111 \\]. وقد تقدم بيان ذلك مفصلاً عند قوله تعالى : { ربنا واجعلنا مسلمين لك } في سورة \\[ البقرة : 128 \\].وقوله : { أن أكون من المسلمين } أقوى في الدلالة على الاتصاف بالإسلام من : أن أكون مسلماً ، كما تقدم عند قوله تعالى : { واركعوا مع الراكعين } في سورة \\[ البقرة : 43 \\] ، وعند قوله : { يأيها الذين آمنوا اتقوا الله وكونوا مع الصادقين } في سورة \\[ براءة : 119 \\].\n\n",
      "translations": [
        {
          "translation": "(But if ye are averse) from believing in that which I brought (I have asked of you) in exchange for believing (no wage) no payment. (My wage) my reward for calling you to believe (is the concern of Allah only, and I am commanded to be of those who surrender (unto Him)) and to follow His religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن تَوَلَّيْتُمْ } وانصرفتم عن تذكيري { فَمَا سَأَلْتُكُمْ مِّنْ أَجْرٍ } أي: ليس بسبب توليكم وإعراضكم سؤالي منكم الجعل حتى يشق عليك إعطاؤه فانصرفتم وأعرضتم\n بل { إِنْ أَجْرِيَ } أي: ما أجري وجعلي { إِلاَّ عَلَى ٱللَّهِ } الذي أمرني به { وَأُمِرْتُ } من عنده { أَنْ أَكُونَ مِنَ ٱلْمُسْلِمِينَ } [يونس: 72] المسلمين الأمور كلها إليه\n المنقادين لحكمه وقضائه\n إذ الكل منه بدأ وإليه يعود\n\n\nومع ذلك النصح والشفقة والتليين التام المنبعث عن محض الحكمة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإن توليتم }: أعرضتم عن تذكيري\n { فما سألتُكم من أجرٍ } يوجب توليكم وإعراضكم لثقله عليكم\n واتهامكم إياي لأجله\n أو يفوتني إذا توليتم عني\n { إنْ أجْرِيَ }: ما ثوابي على الدعوة والتذكير { إلا على اللهِ } لا تعلق لي بشيء دونه\n آمنتم أو توليتم\n { وأُمرتُ أن أكون من المسلمين } المنقادين لحكمه\n لا أخالف أمره\n ولا أرجو غيره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:109",
      "similarity": 0.668288138083361
    },
    {
      "verse": "26:127",
      "similarity": 0.668288138083361
    },
    {
      "verse": "26:145",
      "similarity": 0.668288138083361
    },
    {
      "verse": "26:164",
      "similarity": 0.668288138083361
    },
    {
      "verse": "26:180",
      "similarity": 0.668288138083361
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010072.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010072.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:72.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}