{
  "chapter": "يونس",
  "text": "ثم بعثنا منۢ بعده رسلا الى قومهم فجاءوهم بالبينت فما كانوا۟ ليؤمنوا۟ بما كذبوا۟ به من قبل كذلك نطبع على قلوب المعتدين",
  "translations": [
    {
      "translation": "Afterwards We sent many messengers who brought clear proofs to their peoples. But they were not prepared to believe what they had once denied. That is how We seal the hearts of the iniquitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent forth after him other Messengers, each one to his people. They brought to them clear signs, but they were not such as to believe in what they had rejected earlier as false. Thus do We seal the hearts of those who transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After (Noah) We sent other Messengers to their people with clear authoritative evidence proving their prophetic claims). But how could the people believe what they had previously called lies? Thus do We seal the hearts of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after him, We sent other Noble Messengers to their respective people – so they came to them with clear proofs – so they were not such as to believe in what they had denied before; this is how We set seals upon the hearts of rebels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after him We sent Messengers to their people. They brought them clear proofs, but they would not believe what they had already rejected beforehand. Thus We seal the hearts of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then did We raise up after him apostles to their people, so they came to them with clear arguments, but they would not believe in what they had rejected before; thus it is that We set seals upon the hearts of those who exceed the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent forth, after him, Messengers to their people, and they brought them the clear signs; but they were not men to believe in that they had cried lies to before. So We seal the hearts of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after him, We sent messengers unto their folk, and they brought them clear proofs. But they were not ready to believe in that which they before denied. Thus print We on the hearts of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After him We sent other messengers to their respective peoples, and they brought them clear proofs. But they would not believe in the truth, because they had rejected it before. Thus We seal up the hearts of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We raised after him other apostles to their people, and they brought them evidences, but they were not such as to believe that which they had belied afore. Thus We seal the hearts of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after him We sent [other] apostles to their people. They brought them manifest proofs, but they would not believe something they had denied before. Thus do We seal the hearts of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after him We sent (many) messengers to their peoples: they brought them Clear Signs, but they would not believe what they had already rejected beforehand. Thus do We seal the hearts of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after him We sent Messengers to their people, they brought them clear proofs, but they would not believe what they had already rejected beforehand. Thus We seal the hearts of the transgressors (those who disbelieve in the Oneness of Allah and disobey Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After him We sent Messengers to their nation. They brought them clear signs, but they were not of those to believe because they had belied it previously. SoWe seal the hearts of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after him, We sent messengers to their people. They came to them with the clear proofs, but they would not believe in anything they had already rejected. Thus We set a seal on the hearts of the hostile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent after him messengers to their peoples, and they came to them with clear proofs. But they were not to believe in that which they had denied before. Thus We seal over the hearts of the transgressors\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:74] Then, after him, that is, [after] Noah, We sent messengers to their people, such as Abraham, Hūd and Sālih, and they brought them clear proofs, miracles, but it was not for them to believe in that which they had denied before, that is, before the sending of messengers to them. Thus do We seal, stamp [upon], the hearts of the transgressors — so that they cannot accept faith — in the same way that We sealed the hearts of those [before].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "221 (Then, after him) after the destruction of the folk of Noah, (We sent messengers unto their folk, and they brought them clear proofs) commands, prohibitions and signs. (But they were not ready to believe in that which they denied before) i.e. on the day of the covenant. (Thus print) seal (We on the hearts of the transgressors) who engage in the prohibited instead of the lawful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } لما ازداد الخلفاء الناجون، وتشعبوا أمماً وأحزاباً ودار عليم الأدوار فصاروا منصرفين عن طريق الحق، مائلين عن سبيل الرشاد { بَعَثْنَا } لإصلاح أحوالهم { مِن بَعْدِهِ } أي: بعد نوح { رُسُلاً } منهم كل واحد من الرسل { إِلَىٰ قَوْمِهِمْ فَجَآءُوهُمْ بِٱلْبَيِّنَٰتِ } الواضحة والمعجزات الساطعة القاطعة المثبتة لدعواهم { فَمَا كَانُواْ لِيُؤْمِنُواْ } أي: فما تيسر لهم وضح عندهم وثبت لديهم أن يؤمنوا ويصدقوا { بِمَا كَذَّبُواْ بِهِ مِن قَبْلُ } أي: قبل بعثة الرسل، بل أصروا على ما هوم عليه، واعتادوا له بلا تغيير وتبديل لتركيب جهلهم المركوز في جبلتهم وخباثة طينتهم { كَذَٰلِكَ نَطْبَعُ } ونخختم بختام الغفلة والنسيان { عَلَىٰ قُلوبِ ٱلْمُعْتَدِينَ } [يونس: 74] المجاوزين عن حدود الله، الراسخين على التجاوز والعدوان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: بما كذبوا به ذكر هنا الرابط، وحذفه في سورة الأعراف، إشارة إلى جواز الأمرين، وإليه أشار في الألفية، بقوله:\n",
      "translations": []
    }
  ]
}