{
  "chapter": "يونس",
  "text": "فكذبوه فنجينه ومن معه فى الفلك وجعلنهم خلئف واغرقنا الذين كذبوا۟ بـايتنا فانظر كيف كان عقبة المنذرين",
  "translations": [
    {
      "translation": "But they denied him so We rescued him, and all those with him, in the Ark and We made them the successors and We drowned the people who denied Our Signs. See the final fate of those who were warned!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even then they denied him; so We saved him and those with him, in the ark, and established them in the land, and drowned those who denied Our signs. So think of the fate of those who were warned (and took no heed).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they rejected Noah, calling him a liar. So We saved him and those who were with him in the Ark, and made them successors (to the authority in the land), and drowned all those who had rejected Our signs as false. Consider, then, the fate of those who had been warned (and still did not believe).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They rejected Noah. Then We saved him and his people in the Ark to make them the successors of the rest. The others, who had called Our revelations lies, were drowned. Consider the fate of those who (rejected) Our warnings!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In response they denied him, so We rescued him and those with him in the ship, and made them caliphs, and We drowned those who denied Our signs; therefore see what sort of fate befell those who had been warned!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They denied him, but We delivered him, and those with him in the ship, and We made them generations, replacing one after another, while We drowned those who belied Our Ayat. Then see what was the end of those who were warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they rejected him, so We delivered him and those with him in the ark, and We made them rulers and drowned those who rejected Our communications; see then what was the end of the (people) warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they cried him lies; so We delivered him, and those with him, in the Ark, and We appointed them as viceroys, and We drowned those who cried lies to Our signs; then behold how was the end of them that were warned!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied him, so We saved him and those with him in the ship, and made them viceroys (in the earth), while We drowned those who denied Our revelations. See then the nature of the consequence for those who had been warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they rejected him; then We delivered him and those with him in the Ark, and We made them successors; while We drowned the others who belied Our signs. Observe then the fate of those who had been forewarned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they belied him; then We delivered him and those with him in the ark, and We made them successors, while We drowned those who belied Our signs. Behold then what like hath been the end of those who were warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they impugned him. So We delivered him and those who were with him in the ark and We made them the successors, and We drowned those who denied Our signs. So observe how was the fate of those who were warned!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They rejected Him, but We delivered him, and those with him, in the Ark, and We made them inherit (the earth), while We overwhelmed in the flood those who rejected Our Signs. Then see what was the end of those who were warned (but heeded not)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They denied him, but We delivered him, and those with him in the ship, and We made them generations replacing one after another, while We drowned those who belied Our Ayat (proofs, evidences, lessons, signs, revelations, etc.). Then see what was the end of those who were warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they belied him. Therefore We saved him and those who were with him in the Ark, and We made them caliphs, and We drowned those who belied Our verses. See what was the end of those who were warned!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denounced him, so We saved him and those with him in the Ark, and We made them successors, and We drowned those who rejected Our signs. So consider the fate of those who were warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they denied him, so We saved him and those with him in the ship and made them successors, and We drowned those who denied Our signs. Then see how was the end of those who were warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:73] But they denied him, so We saved him and those with him in the Ark, and made them, that is, those with him, successors, in the earth, and We drowned those who denied Our signs, by [unleashing] the Flood. Behold then the nature of the consequence for those who had been warned!, in that they were destroyed: likewise We deal with those who deny.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But they denied him) i.e. they denied that which Noah had brought them, (so We saved him) from drowning (and those) believers who were (with him in the ship, and made them vicegerents) and inhabitants of the earth, (while We drowned those who denied Our revelations) We drowned those who denied Our Scripture and Messenger Noah. (See then) O Muhammad (the nature of the consequence for those who had been warned) the end result of those who were warned by the messengers but did not believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومع ذلك النصح والشفقة والتليين التام المنبعث عن محض الحكمة، والحجج والبراهين الدالة على صدقه في دعواه { فَكَذَّبُوهُ } عناداً ومكابرة، وأصروا على تكذيبه عتواً واستكباراص، فأخناهم بالطوفان؛ لانهماكهم في الغي والطغيان { فَنَجَّيْنَاهُ وَمَن } آمن { مَّعَهُ } من الغرق محفوظين { فِي ٱلْفُلْكِ } التي نحتها بيده بوحي الله إياه وتعليمه، وهم قد استهزؤوا معه حين اشتغل بتربيتها { وَجَعَلْنَاهُمْ } أي: أصحاب الفلك { خَلاَئِفَ } من الهالكين، وهم ثمانون مؤمنون بالله مصدقون لرسوله { وَأَغْرَقْنَا ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا فَٱنْظُرْ } أيها المعتبر الرائي { كَيْفَ كَانَ عَاقِبَةُ ٱلْمُنْذَرِينَ } [يونس: 73] المكذبين لنذيرهم؟ وإلى أين أدى إنكارهم واستكبارهم؟ فاعتبروا يا أولي الأبصار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فكذّبوه }: فأصروا على تكذيبه بعد إلزامهم الحجة، وتبين ان توليهم ليس إلا لعنادهم وتمرُّدهم فلا جرَم حقت عليهم كلمة العذاب، فهلكوا بالغرق، { فنجيناه ومن } آمن { معه في الفلك } ، وكانوا ثمانين، { وجعلناهم خلائفَ } عمروا الأرض بعد الهالكين وخلفوهم فيها، ولم يُعقب منهم إلا أولاد نوح عليه السلام، { وأغرقنا الذين كذَّبوا بآياتنا } بالطوفان، { فانظرْ كيف كان عاقبةُ المنذَرين } ، تعظيم لما جرى عليهم، وتحذير لمن كذب الرسول، وتسلية له\n والله تعالى أعلم\n الإشارة: لا يكون الرجل كامل اليقين حتى يسقط من قلبه خوف المخلوقين، فلا يبالي بهم ولو أجمعوا على كيده، إذ ليس بيدهم شيء، وإنما أمْرهم بيد الله، ويقول لهم كما قال نوح عليه السلام: { فأجمعوا أمركم وشركاءكم }\n وكما قال هود عليه السلام\n\n[هود: 55ـ 56]\n وفي الحديث:\n\n \" لو اجْتَمَعَ الخَلْقُ كَلُهمْ عَلَى أن يَضُرُّوكَ بِشَيءٍ لم يَضُرُّوكَ إلا بِشَيءٍ قَدَّرَهُ الله عَلَيكَ، جَفْتِ الأقلامُ وطُويت الصُّحُفُ \"\n \n\nوقال أيضاً صلى الله عليه وسلم\n\n \" لا يَكمُلُ إيمَانُ العَبدِ حتَّى يَكُون الناسُ عندَه كالأباعد \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:64",
      "similarity": 0.7130456473739025
    },
    {
      "verse": "23:28",
      "similarity": 0.4624896737147709
    },
    {
      "verse": "2:50",
      "similarity": 0.4437933064516593
    },
    {
      "verse": "21:77",
      "similarity": 0.43020162131683964
    },
    {
      "verse": "37:73",
      "similarity": 0.4191553017237896
    }
  ]
}