{
  "chapter": "يونس",
  "text": "فان توليتم فما سالتكم من اجر ان اجرى الا على الله وامرت ان اكون من المسلمين",
  "translations": [
    {
      "translation": "If you turn your backs, I have not asked you for any wage. My wage is the responsibility of Allah alone. I am commanded to be one of the Muslims.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you turn away from me (remember) I do not ask any recompense from you. My reward is with God; I have been commanded to be one of those who submit to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you turned your back on my admonition (what harm did you cause me?) I had asked of you no reward, for my reward lies only with Allah, and I am commanded to be of those who totally submit (to Allah)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you turn away from my preaching, it will not harm me; I shall receive my reward from God who has commanded me to become a Muslim.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Then if you turn away, I do not ask any fee from you; my reward is only upon Allah, and I am commanded to be of the Muslims.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you turn away, then no reward have I asked of you, my reward is only from Allah, and I have been commanded to be of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you turn back, I did not ask for any reward from you; my reward is only with Allah, and I am commanded that I should be of those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if you turn your backs, I have not asked you for any wage; my wage falls only on God, and I have been commanded to be of those that surrender.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if ye are averse I have asked of you no wage. My wage is the concern of Allah only, and I am commanded to be of those who surrender (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you turn away from me, remember I demand no recompense from you. Only God will reward me and I have been commanded to submit completely to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If then ye turn away, I have asked of you no hire, my hire is only with Allah, and I am commanded to be of those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you turn your back [on me], I do not ask any reward from you; my reward lies only with Allah and I have been commanded to be of those who submit [to Allah].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if ye turn back, (consider): no reward have I asked of you: my reward is only due from Allah, and I have been commanded to be of those who submit to Allah's will (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you turn away [from accepting my doctrine of Islamic Monotheism, i.e. to worship none but Allah], then no reward have I asked of you, my reward is only from Allah, and I have been commanded to be one of the Muslims (those who submit to Allah's Will).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, if you turn your backs, I have not asked of you a wage. My wage falls only on Allah. I am commanded to be from those who surrender (Muslims)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“But if you turn away, I have not asked you for any wage. My wage falls only on God, and I was commanded to be of those who submit.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you turn away [from my advice] then no payment have I asked of you. My reward is only from Allah, and I have been commanded to be of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:72] But if you turn away, from my reminding [you], I have not asked you for any wage, any reward for it, so turn [and go] away: my wage, my reward, falls only on God, and I have been commanded to be of those who submit [to God]’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But if ye are averse) from believing in that which I brought (I have asked of you) in exchange for believing (no wage) no payment. (My wage) my reward for calling you to believe (is the concern of Allah only, and I am commanded to be of those who surrender (unto Him)) and to follow His religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن تَوَلَّيْتُمْ } وانصرفتم عن تذكيري { فَمَا سَأَلْتُكُمْ مِّنْ أَجْرٍ } أي: ليس بسبب توليكم وإعراضكم سؤالي منكم الجعل حتى يشق عليك إعطاؤه فانصرفتم وأعرضتم\n بل { إِنْ أَجْرِيَ } أي: ما أجري وجعلي { إِلاَّ عَلَى ٱللَّهِ } الذي أمرني به { وَأُمِرْتُ } من عنده { أَنْ أَكُونَ مِنَ ٱلْمُسْلِمِينَ } [يونس: 72] المسلمين الأمور كلها إليه\n المنقادين لحكمه وقضائه\n إذ الكل منه بدأ وإليه يعود\n\n\nومع ذلك النصح والشفقة والتليين التام المنبعث عن محض الحكمة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإن توليتم }: أعرضتم عن تذكيري، { فما سألتُكم من أجرٍ } يوجب توليكم وإعراضكم لثقله عليكم\n واتهامكم إياي لأجله، أو يفوتني إذا توليتم عني، { إنْ أجْرِيَ }: ما ثوابي على الدعوة والتذكير { إلا على اللهِ } لا تعلق لي بشيء دونه، آمنتم أو توليتم، { وأُمرتُ أن أكون من المسلمين } المنقادين لحكمه، لا أخالف أمره\n ولا أرجو غيره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:109",
      "similarity": 0.668288138083361
    },
    {
      "verse": "26:127",
      "similarity": 0.668288138083361
    },
    {
      "verse": "26:145",
      "similarity": 0.668288138083361
    },
    {
      "verse": "26:164",
      "similarity": 0.668288138083361
    },
    {
      "verse": "26:180",
      "similarity": 0.668288138083361
    }
  ]
}