{
  "chapter": "يونس",
  "text": "قالوا۟ اجئتنا لتلفتنا عما وجدنا عليه ءاباءنا وتكون لكما الكبرياء فى الارض وما نحن لكما بمؤمنين",
  "translations": [
    {
      "translation": "They said, 'Have you come to us to turn us from what we found our fathers doing, and to gain greatness in the land? We do not believe you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you come,\" said they, \"to turn us back from what we found our ancestors doing, so that the two of you may attain supremacy in the land? We shall not believe in what you say.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied: 'Have you come to turn us away from the way of our forefathers that the two of you might become supreme in the land? We shall never accept what the two of you say.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They asked Moses, \"Have you come to turn us away from the faith of our fathers and to make yourselves the rulers in the land? We shall never accept your faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Have you two come to us to revert us from what we found our fathers upon, and that the leadership in the land may only be for you two? And we shall never believe in you both.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Have you come to us to turn us away from that we found our fathers following, and that you two may have greatness in the land We are not going to believe you two!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Have you come to us to turn us away from what we found our fathers upon, and (that) greatness in the land should be for you two? And we are not going to believe in you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Art thou come to us to turn us from that we found our fathers practising, and that the domination in the land might belong to you two? We do not believe you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Hast thou come unto us to pervert us from that (faith) in which we found our fathers, and that you two may own the place of greatness in the land? We will not believe you two.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Have you come to turn us away from what we found our forefathers following, so that the two of you might become supreme in this land? We will never believe in you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: art thou come unto us to turn us aside from that faith whereon We found our fathers, and that the greatness in the land shall be unto you twain! And for the sake of you twain we are not going to be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Have you come to us to turn us away from what we found our fathers following, so that supremacy may be yours in the land? We will not believe in the two of you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Hast thou come to us to turn us away from the ways we found our fathers following,- in order that thou and thy brother may have greatness in the land? But not we shall believe in you!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Have you come to us to turn us away from that (Faith) we found our fathers following, - and that you two may have greatness in the land? We are not going to believe you two!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'Have you come to turn us away from that which we found our fathers practicing (in order that) the domination of the land might belong to you two? We do not believe you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Did you come to us to divert us from what we found our ancestors following, and so that you become prominent in the land? We will never believe in you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Have you come to us to turn us away from that upon which we found our fathers and so that you two may have grandeur in the land? And we are not believers in you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:78] They said, ‘Have you come to us to divert us, to turn us away, from what we found our fathers following, and that yours both might be the greatness, the kingship, in the land, the land of Egypt? We will not believe you two’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said) to Moses: (Hast thou come unto us to pervert us from that (faith) in which we found our fathers) of idol worship, (and that you two may own the place of greatness) sovereignty and power (in the land) of Egypt? (We will not believe you two).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَجِئْتَنَا لِتَلْفِتَنَا } معناه لِتَصْرِفَنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُوۤاْ } على سبيل المكابرة بعدما سمعوا من موسى قوله ونصحه: { أَجِئْتَنَا } أيها الساحر الكذاب { لِتَلْفِتَنَا } وتصرفنا { عَمَّا وَجَدْنَا عَلَيْهِ آبَاءَنَا } وأسلافنا { وَ } اشتهيت أن { تَكُونَ لَكُمَا ٱلْكِبْرِيَآءُ } والعظمة { فِي ٱلأَرْضِ } التي كنا عليها مستقرين { وَ } اذهبا إلى حيث شئتما { مَا نَحْنُ لَكُمَا بِمُؤْمِنِينَ } [يونس: 78] مصدقين منقادين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا أجئتنا لِتَلْفتنا } لتصرفنا { عما وجدنا عليه آباءنَا } من عبادة الأصنام، { وتكون لكما الكبرياءُ في الأرض }: الملك فيها، سمي كبرياء لاتَّصاف الملوك بالتكبر، { وما نحن لكما بمؤمنين }: بمصدّقين\n الإشارة: السحر على قسمين: سحر يسحر القلوب إلى حضرة الرحمن، وسحر يسحرها إلى حضرة الشيطان، فالسحر الذي يسحر إلى حضرة الرَّحمن: هو ما جاءت به الأنبياء والرسل، وقامت به الأولياء بعدهم من الأمور التي تقرب إلى حضرة، إما ما يتعلق بالظواهر، كتبيين الشرائع، وإمّا ما يتعلق بالبواطن، كتبيين الطرائق والأمور التي تُشرق بها أسرارُ الحقائق، وأما السحر الذي يسحر إلى حضرة الشيطان: فكل ما يشغل عن ذكر الرَّحمن، ولذلك قال عليه السلام:\n",
      "translations": []
    }
  ]
}