{
  "chapter": "يونس",
  "text": "ثم بعثنا منۢ بعدهم موسى وهرون الى فرعون وملاي۟ه بـايتنا فاستكبروا۟ وكانوا۟ قوما مجرمين",
  "translations": [
    {
      "translation": "Then after them We sent Musa and Harun with Our Signs to Pharaoh and his ruling circle, but they were arrogant and were a people of evildoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them We sent Moses and Aaron with Our signs to the Pharaoh and his nobles; but they behaved arrogantly, for they were a people full of guilt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after them, We sent forth Moses and Aaron to Pharaoh and his chiefs with Our signs, but they waxed proud. They were a wickd people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Moses and Aaron with Our miracles to the Pharaoh and his people. These people also proved to be arrogant. They were wicked people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them, We sent Moosa and Haroon along with Our signs, to Firaun and his court members, so they were proud and were a guilty people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them We sent Musa and Harun to Fir`awn and his chiefs with Our Ayat. But they behaved arrogantly and were a people who were criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then did We send up after them Musa and Haroun to Firon and his chiefs with Our signs, but they showed pride and they were a guilty people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent forth, after them, Moses and Aaron to Pharaoh and his Council with Our signs, but they waxed proud, and were a sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after them, We sent Moses and Aaron unto Pharaoh and his chiefs with Our revelations, but they were arrogant and were a guilty folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent forth Moses and Aaron with Our signs to Pharaoh and his nobles, but they behaved arrogantly, for they were wicked people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after them, We raised Musa and Harun unto Fir'awn and his chiefs with Our signs, but they grew stiff-necked and they were a people guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after them, We sent Moses and Aaron to Pharaoh and his elite with Our signs, but they acted arrogantly and they were a guilty lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them sent We Moses and Aaron to Pharaoh and his chiefs with Our Signs. But they were arrogant: they were a people in sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them We sent Musa (Moses) and Harun (Aaron) to Fir'aun (Pharaoh) and his chiefs with Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.). But they behaved arrogantly and were Mujrimun (disbelievers, sinners, polytheists, criminals, etc.) folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after them We sent Moses and Aaron with Our signs to Pharaoh and his Council. But they were arrogant, for they were a sinful nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after them, We sent Moses and Aaron with Our proofs to Pharaoh and his dignitaries. But they acted arrogantly. They were sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent after them Moses and Aaron to Pharaoh and his establishment with Our signs, but they behaved arrogantly and were a criminal people\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:75] Then, after them, We sent Moses and Aaron to Pharaoh and his council, that is, his folk, with Our, nine, signs, but they were disdainful, to believe in them, and were a sinful folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, after them) after these messengers, (We sent Moses and Aaron unto Pharaoh and his chiefs with Our revelations) with Our Scripture; it is also said that this means: with Our nine signs: the hand, the staff, the deluge, the locusts, lice, frogs, blood, drought and shortage of harvests; it is also said that the revelations here mean: obliteration, (but they were arrogant) deeming themselves above faith, the Scripture, the Messenger and the revelations (and were a guilty folk) and were idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ } معناه أَشرافُ قَومهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {to Pharaoh and his people}, means the leadership of his people.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } لما عتوا منهم من عتوا وأخذنا منهم من أخذنا { بَعَثْنَا مِن بَعْدِهِمْ } أي: بعد أولئك الرسل الماضين { مُّوسَىٰ وَهَـٰرُونَ } الذي هو أخوه وظهيره { إِلَىٰ فِرْعَوْنَ } المبالغ في العتو والعناد إلى حيث ادعى الربوبية لنفسه بقوله: أنا ربكم الأعلى { وَمَلإِيْهِ } المؤمنين له المعاونين لشأنه { بِآيَـٰتِنَا } الدالة على استقلالنا في الآثار وتفردنا في الألوهية والربوبية وعلى صدق رسولنا في جميع ما جاء به من عندنا { فَٱسْتَكْبَرُواْ } عن الانقياد\n واستقبلوا بالتكذيب والعناد { وَ } هم في سابق علمنا: { كَانُواْ قَوْماً مُّجْرِمِينَ } [يونس: 75] بأعظم الجرائم مستحقين بأشد العذاب\n لذلك أظهروا ما في استعداداهم وقابليتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ثم بعثنا } ، من بعد هؤلاء الرسل { موسى وهارون إلى فرعون ومَلَئه بأياتنا } التسع، { فاستكبروا } عن اتباعها، { وكانوا قوماً مجرمين } معتادين الإجرام، فلذلك تهاونوا برسالة ربهم، واجترؤوا على ردها، { فلما جاءهم الحقُّ من عندنا } وعرفوه، وهو بعثه موسى عليه السلام لتظاهر المعجزات على يديه، القاهرة المزيحة للشك، { قالوا } من فرط تمردهم: { إنَّ هذا } الذي جئت به { لسحرٌ مبين }: ظاهر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:122",
      "similarity": 0.5527327963189586
    },
    {
      "verse": "26:48",
      "similarity": 0.5527327963189586
    },
    {
      "verse": "7:103",
      "similarity": 0.5360874331474158
    },
    {
      "verse": "37:120",
      "similarity": 0.5334294350813878
    },
    {
      "verse": "23:45",
      "similarity": 0.4949398971719012
    }
  ]
}