{
  "chapter": "يونس",
  "text": "واتل عليهم نبا نوح اذ قال لقومه يقوم ان كان كبر عليكم مقامى وتذكيرى بـايت الله فعلى الله توكلت فاجمعوا۟ امركم وشركاءكم ثم لا يكن امركم عليكم غمة ثم اقضوا۟ الى ولا تنظرون",
  "translations": [
    {
      "translation": "Recite to them the story of Nuh when he said to his people, 'My people, if my standing here and reminding you of Allah's Signs has become too much for you to bear, know that I have put my trust in Allah. So decide, you and your gods, on what you want to do and be open about it. Do with me whatever you decide and do not keep me waiting.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recount to them the story of Noah when he said to his people: \"O people, if you find my staying with you and warning through God's signs, unbearable to you, know that I have reposed my trust in God. So plan your move, and call your associates, and make certain of your plan; then do whatever you intend against me, allowing me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And narrate to them the story of Noah when he said to his people: 'My people! If my living in your midst and my effort to shake you out of heedlessness by reciting to you the revelations of Allah offend you, then remember that I have put all my trust in Allah. So draw up your plan in concert with those whom you associate with Allah in His divinity, leaving no part of it obscure, and then put it into effect against me, and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them the story of Noah who told his people, \"Even if my belief and my preaching of the revelation of God seem strange to you, I put my trust in Him. Unite yourselves and seek help from your idols. You should not regret what you want to do, but should execute your plans against me without delay\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read to them the story of Nooh; when he told his people, “O my people – if my standing here and reminding you of Allah’s signs have been intolerable for you – so I have trusted only Allah – then work jointly and strengthen your work along with your false deities, leaving no doubt regarding your work – then do whatever you can to me, and do not give me respite.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the news of Nuh. When he said to his people: \"O my people, if my stay (with you), and my reminding (you) of the Ayat of Allah is hard on you, then I put my trust in Allah. So devise your plot, you and your partners, and let not your plot be in confusion for you. Then pass your sentence on me and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the story of Nuh when he said to his people: O my people! if my stay and my reminding (you) by the communications of Allah is hard on you-- yet on Allah do I rely-- then resolve upon your affair and (gather) your associates, then let not your affair remain dubious to you, then have it executed against me and give me no respite:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the story of Noah when he said to his people, 'My people, if my standing here is grievous to you and my reminding you of the signs of God, in God have I put my trust; so resolve on your affair, with your associates, then let not your affair be a worry to you, but make decision unto me, and respite me not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite unto them the story of Noah, when he told his people: O my people! If my sojourn (here) and my reminding you by Allah's revelations are an offence unto you, in Allah have I put my trust, so decide upon your course of action you and your partners. Let not your course of action be in doubt for you. Then have at me, give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them the story of Noah. He said to his people, \"My people, if my presence among you and my preaching to you of God's revelations offends you, know that I put my trust in God, so agree on your course of action, along with your partner-gods, and let no hesitation deflect you from it, then put it into effect against me, and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rehearse thou unto them the story of Nuh, when he said unto his people: O my people! if my standing forth and my admonishment with the commandments of Allah be hard upon you, then on Allah I rely; so devise your affair, ye and your associate-gods and let not your affair be dubious unto you, then have it decreed against me, and respite me not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Relate to them the account of Noah when he said to his people, ‘O my people! If my stay [among you] be hard on you and [also] my reminding you of Allah’s signs, [for my part] I have put my trust in Allah. So conspire together, along with your partners, leaving nothing vague in your plan, then carry it out against me without giving me any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Relate to them the story of Noah. Behold! he said to his people: \"O my people, if it be hard on your (mind) that I should stay (with you) and commemorate the signs of Allah,- yet I put my trust in Allah. Get ye then an agreement about your plan and among your partners, so your plan be on to you dark and dubious. Then pass your sentence on me, and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the news of Nuh (Noah). When he said to his people: \"O my people, if my stay (with you), and my reminding (you) of the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah is hard on you, then I put my trust in Allah. So devise your plot, you and your partners, and let not your plot be in doubt for you. Then pass your sentence on me and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the story of Noah. He said to his nation: 'O my nation, if my standing here, reminding you of the verses of Allah grieves you, and in Allah I have put my trust; decide upon your affair with your associates, then do not let your affair worry you. Come to a decision about me, and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And relate to them the story of Noah, when he said to his people, “O my people, if my presence among you and my reminding you of God’s signs is too much for you, then in God I have put my trust. So come to a decision, you and your partners, and do not let the matter perplex you; then carry out your decision on me, and do not hold back.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the news of Noah, when he said to his people, \"O my people, if my residence and my reminding of the signs of Allah has become burdensome upon you - then I have relied upon Allah. So resolve upon your plan and [call upon] your associates. Then let not your plan be obscure to you. Then carry it out upon me and do not give me respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:71] And recite, O Muhammad (s), to them, that is, [to] the Meccan disbelievers, the story, the tale, of Noah (Nūhin is substituted by [the following, idh qāla]) when he said to his people, ‘O my people, if my sojourn, my stay among you, is too great [to bear], is a hardship, for you, as is my reminding you, my admonishing you, by the signs of God, in God have I put my trust; so decide upon your course of action, resolve upon what you will do to me, together with your associates (wa-shurakā’akum: the wāw [wa-] means here ‘with’), then let not your decision be a secret between you, concealed, nay, manifest it and proclaim it to me; then implement it against me, carry out what you desire, and do not put it off, [do not] give me respite, for I am not concerned by you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Recite unto them the story of Noah) in the Qur'an, (when he told his people: O my people! If my sojourn (here)) if my extended stay with you (and my reminding you) and my warning of you (by Allah's revelations) from the punishment of Allah (are an offence unto you, in Allah have I put my trust) I rely in and consign my matter to Allah, (so decide upon your course of action) unite upon one decision and one matter, (you and your partners) and seek the help of your idols. (Let not your course of action be in doubt for you) do not make your decision and matter too vague for yourselves. (Then come forth against me, give me no respite) do not wait.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ لاَ يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُمَّةً } معناهُ ظُلمةٌ وضِيقٌ\n\n",
      "translations": [
        {
          "translation": " And His saying - be glorified - \"So your affair is not { }\" means: darkness and hardship.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱتْلُ } يا أكمل الرسل { عَلَيْهِمْ } تذكيراً وتعريضاً { نَبَأَ نُوحٍ } أي: قصته مع قومه وقت { إِذْ قَالَ لِقَوْمِهِ } حين استعظموا أمره وقصدوا إهلاكه عناداً ومكابرة: { يٰقَوْمِ } أضافهم إلى نفسه على مقتضى شفقة النبوة { إِن كَانَ كَبُرَ } أي: شق وعظم { عَلَيْكُمْ مَّقَامِي } فيكم\n وحياتي بينكم { وَتَذْكِيرِي } إياكم { بِآيَاتِ ٱللَّهِ } الدالة على توحيده واستقلاله في ألوهيته وربوبيته { فَعَلَى ٱللَّهِ } لا على غيره\n إذ لا غير معه لا شيء سواه { تَوَكَّلْتُ } أي: وثقت به وفوضت أمري إليه { فَأَجْمِعُوۤاْ } أي: فعليكم أن تجمعوا { أَمْرَكُمْ } وتدابيركم في قتلي وإهلاكي { وَ } مع ذلك اجعوا { شُرَكَآءَكُمْ } مستظهرين لهم في دفعي { ثُمَّ } بعد تدبيركم واستظهاركم بهم أظهورا عليَّ بحيث { لاَ يَكُنْ أَمْرُكُمْ } أي: لم يبقَ فيه { عَلَيْكُمْ غُمَّةً } سترة تغتمو بها وتحزنون بسببها\n بل رتبوا أمركم على ما تقتضيه نفوسكم وترتضيه عقولكم { ثُمَّ ٱقْضُوۤاْ إِلَيَّ } واصرفوا نحوي ما هيأتم ودبرتم من الأسباب الموجبة لإهلاكي { وَلاَ تُنظِرُونَ } [يونس: 71] أي: لا تمهلوني طرفة بل امضوا على ما أنتم عليه من قتلي وإهلاكي\n فإني لا أبالي بكم وبتدابيركم وظهرائكم\n إذ الله حسبي وعليه توكلي وبه اعتمادي واعتصامي\n أذكر لكم بإذنه وأعظكم بوحيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وشركاءكم: مفعول معه\n أو بفعل محذوف\n أي: اعزموا أمركم وأجمعُوا شركاءكم ومن قرأ: \" اجمَعُوا \" بهمزة وصل فشركاءكم: معطوف\n و \" غمة \": خفيّا\n وفي الحديث: \" فَإنْ غُمَّ عَلَيكُمْ فَاقدَروا لَهُ \"\n يقول الحق جل جلاله: { واتل عليهم نبأ نوحٍٍ } أي: خبره مع قومه\n قيل: اسمه عبد الغفار\n وسمي نوحاً لكثرة نَوحه من هيبة ربه\n { إذ قال لقومه يا قوم إن كان كَبُرَ } أي: عَظُمَ وشقَّ { عليكم مقامي } أي: كوني بين أظهركم\n وإقامتي بينكم مدة مديدة أذكركم بالله\n أو قيامي علّيكم لوعظكم\n أو نفسي ووجودي بينكم\n { وتذكيري } لكم { بآيات الله } أدعوكم بها إلى الله\n { فعلى الله توكلتُ }: وثقت به\n فلا أبالي ببعدكم عني وتخويفكم إياي\n { فأجمعُوا أمرَكم } أي: اعزموا عليه\n { وشركاءَكم } مع شركائكم\n أو وأمر شركائكم\n أو أجْمِعُوا أمركم واتَّفَِقُوا عليه وأجمِعُوا شركاءكم\n والمعنى: أنه أمرهم بالعزم والإجماع على قصده\n والسعي في إهلاكه\n على أي وجه يمكنهم لشدة ثقته بالله وعدم مبالاته بهم\n  { ثم لا يكن أمرُكم } في قصد إهلاكي { عليكم غُمَّة }: مستوراً خفيَّاً\n بل اجعلوه ظاهراً مكشوفاً تتمكنون فيه\n لأن من يكتم أمراً ويخفيه لا يقدر أن يفعل ما يريد\n أو ثم لا يكن حالكم عليكم غمَّاً\n أي: لا يلحقكم غم إذا أهلكتموني وتخلصتم من ثقل مقامي وتذكيري\n { ثم اقْضُوا } أي: انفذوا قضاءكم { إليَّ } فيما تريدون\n وقرأ السري بن يَنْعَم: \" أفضوا \" بالفاء وقطع الهمزة\n أي: انتهوا إليَّ بشرِّكم\n { ولا تُنظرون }: ولا تمهلون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:210",
      "similarity": 0.60761550522422
    },
    {
      "verse": "21:88",
      "similarity": 0.526208416684681
    },
    {
      "verse": "25:25",
      "similarity": 0.5116762565332615
    },
    {
      "verse": "22:22",
      "similarity": 0.39566221179729816
    },
    {
      "verse": "2:57",
      "similarity": 0.2526024725458385
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/10:71.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/10:71.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}