{
  "chapter": "يونس",
  "text": "واتل عليهم نبا نوح اذ قال لقومه يقوم ان كان كبر عليكم مقامى وتذكيرى بـايت الله فعلى الله توكلت فاجمعوا۟ امركم وشركاءكم ثم لا يكن امركم عليكم غمة ثم اقضوا۟ الى ولا تنظرون",
  "translations": [
    {
      "translation": "Recite to them the story of Nuh when he said to his people, 'My people, if my standing here and reminding you of Allah's Signs has become too much for you to bear, know that I have put my trust in Allah. So decide, you and your gods, on what you want to do and be open about it. Do with me whatever you decide and do not keep me waiting.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recount to them the story of Noah when he said to his people: \"O people, if you find my staying with you and warning through God's signs, unbearable to you, know that I have reposed my trust in God. So plan your move, and call your associates, and make certain of your plan; then do whatever you intend against me, allowing me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And narrate to them the story of Noah when he said to his people: 'My people! If my living in your midst and my effort to shake you out of heedlessness by reciting to you the revelations of Allah offend you, then remember that I have put all my trust in Allah. So draw up your plan in concert with those whom you associate with Allah in His divinity, leaving no part of it obscure, and then put it into effect against me, and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them the story of Noah who told his people, \"Even if my belief and my preaching of the revelation of God seem strange to you, I put my trust in Him. Unite yourselves and seek help from your idols. You should not regret what you want to do, but should execute your plans against me without delay\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read to them the story of Nooh; when he told his people, “O my people – if my standing here and reminding you of Allah’s signs have been intolerable for you – so I have trusted only Allah – then work jointly and strengthen your work along with your false deities, leaving no doubt regarding your work – then do whatever you can to me, and do not give me respite.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the news of Nuh. When he said to his people: \"O my people, if my stay (with you), and my reminding (you) of the Ayat of Allah is hard on you, then I put my trust in Allah. So devise your plot, you and your partners, and let not your plot be in confusion for you. Then pass your sentence on me and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the story of Nuh when he said to his people: O my people! if my stay and my reminding (you) by the communications of Allah is hard on you-- yet on Allah do I rely-- then resolve upon your affair and (gather) your associates, then let not your affair remain dubious to you, then have it executed against me and give me no respite:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the story of Noah when he said to his people, 'My people, if my standing here is grievous to you and my reminding you of the signs of God, in God have I put my trust; so resolve on your affair, with your associates, then let not your affair be a worry to you, but make decision unto me, and respite me not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite unto them the story of Noah, when he told his people: O my people! If my sojourn (here) and my reminding you by Allah's revelations are an offence unto you, in Allah have I put my trust, so decide upon your course of action you and your partners. Let not your course of action be in doubt for you. Then have at me, give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them the story of Noah. He said to his people, \"My people, if my presence among you and my preaching to you of God's revelations offends you, know that I put my trust in God, so agree on your course of action, along with your partner-gods, and let no hesitation deflect you from it, then put it into effect against me, and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rehearse thou unto them the story of Nuh, when he said unto his people: O my people! if my standing forth and my admonishment with the commandments of Allah be hard upon you, then on Allah I rely; so devise your affair, ye and your associate-gods and let not your affair be dubious unto you, then have it decreed against me, and respite me not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Relate to them the account of Noah when he said to his people, ‘O my people! If my stay [among you] be hard on you and [also] my reminding you of Allah’s signs, [for my part] I have put my trust in Allah. So conspire together, along with your partners, leaving nothing vague in your plan, then carry it out against me without giving me any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Relate to them the story of Noah. Behold! he said to his people: \"O my people, if it be hard on your (mind) that I should stay (with you) and commemorate the signs of Allah,- yet I put my trust in Allah. Get ye then an agreement about your plan and among your partners, so your plan be on to you dark and dubious. Then pass your sentence on me, and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the news of Nuh (Noah). When he said to his people: \"O my people, if my stay (with you), and my reminding (you) of the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah is hard on you, then I put my trust in Allah. So devise your plot, you and your partners, and let not your plot be in doubt for you. Then pass your sentence on me and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the story of Noah. He said to his nation: 'O my nation, if my standing here, reminding you of the verses of Allah grieves you, and in Allah I have put my trust; decide upon your affair with your associates, then do not let your affair worry you. Come to a decision about me, and give me no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And relate to them the story of Noah, when he said to his people, “O my people, if my presence among you and my reminding you of God’s signs is too much for you, then in God I have put my trust. So come to a decision, you and your partners, and do not let the matter perplex you; then carry out your decision on me, and do not hold back.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the news of Noah, when he said to his people, \"O my people, if my residence and my reminding of the signs of Allah has become burdensome upon you - then I have relied upon Allah. So resolve upon your plan and [call upon] your associates. Then let not your plan be obscure to you. Then carry it out upon me and do not give me respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:71] And recite, O Muhammad (s), to them, that is, [to] the Meccan disbelievers, the story, the tale, of Noah (Nūhin is substituted by [the following, idh qāla]) when he said to his people, ‘O my people, if my sojourn, my stay among you, is too great [to bear], is a hardship, for you, as is my reminding you, my admonishing you, by the signs of God, in God have I put my trust; so decide upon your course of action, resolve upon what you will do to me, together with your associates (wa-shurakā’akum: the wāw [wa-] means here ‘with’), then let not your decision be a secret between you, concealed, nay, manifest it and proclaim it to me; then implement it against me, carry out what you desire, and do not put it off, [do not] give me respite, for I am not concerned by you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمن مقارعة المشركين بالحجج الساطعة على بطلان دينهم ، وبالدلائل الواضحة على تفنيد أكاذيبهم وتكذيبهم وما تخلل ذلك من الموعظة والوعيد بالعذاب العاجل والآجل والإرهاب ، إلى التعريض لهم بذكر ما حل بالأمم المماثلة أحوالها لأحوالهم ، استقصاء لطرائق الحجاج على أصحاب اللجاج؛ فإن نوحاً عليه السلام مع قومه مَثَل لحال محمد صلى الله عليه وسلم مع المشركين من قومه في ابتداء الأمر وتطوره ، ففي ذكر عاقبة قوم نوح عليه السلام تعريض للمشركين بأن عاقبتهم كعاقبة أولئك أو أنهم إنما يمتعون قليلاً ثم يؤخذون أخذة رابية ، كما متع قوم نوح زمناً طويلاً ثم لم يفلتوا من العذاب في الدنيا ، فذكر قصة نوح مع قومه عِظة للمشركين وملقياً بالوجل والذعر في قلوبهم ، وفي ذلك تأنيس للرسول صلى الله عليه وسلم وللمسلمين بأنهم إسوة بالأنبياء ، والصالحين من أقوامهم ، وكذلك قصة موسى عليه السلام عقبها كما ينبيء عن ذلك قولهُ في نهاية هذه القصص { أفأنت تكره الناس حتى يكونوا مؤمنين } \\[ يونس : 99 \\] الآيات . وقوله : { فإن كنت في شك مما أنزلنا إليك فاسأل الذين يقرأون الكتاب من قبلك } \\[ يونس : 94 \\] الآيات .وبهذا يظهر حسن موقع ( إذْ ) من قوله : { إذ قال لقومه يا قوم } إلى آخره ، فإن تقييد النبأ بزمن قوله : { لقومه } إيماء إلى أن محاورته قومه وإصرارهم على الإعراض هو محل العبرة ، لأنه وجه الشبه بين المشركين وبين قوم نوح عليه السلام في صم آذانهم عن دعوة رسولهم ، وقوله ذلك لهم إنما كان بعد أن كرر دعاءَهم زمناً طويلاً فكان ذلك آخر جدل بينه وبينهم ، والنبي صلى الله عليه وسلم قد دعا أهل مكة سنين وقت نزول هذه السورة ثم حاورهم وجادلهم ولأن ذلك الزمن هو أعظم موقف وقفه نوح عليه السلام مع قومه ، وكان هو الموقف الفاصل الذي أعقبه العذاب بالغرق .و { إذا } اسم للزمن الماضي . وهو هنا بدل اشتمال من { نبأ } أو من { نوح }. وفي ذكر قصة نوح عليه السلام وما بعدها تفصيل لما تقدم إجماله من قوله تعالى : { ولقد أهلكنا القرون من قبلكم لمَّا ظلموا وجاءتهم رسلهم بالبينات } \\[ يونس : 13 \\].وضمير { عليهم } عائد إلى { الذين يفترون على الله الكذب } \\[ يونس : 69 \\].والتلاوة : القراءة . وتقدمت في سورة الأنفال .والنبأ : الخبر . وتقدم في قوله : { ولقد جاءك من نبأ المرسلين } في سورة \\[ الأنعام : 34 \\].والتعريف بنوح عليه السلام وتاريخه مضى في أول آل عمران .وتعريف قوم نوح بطريق الإضافة إلى ضمير نوح في قوله : إذ قَال لقومه } إذ ليس ثمة طريق لتعريفهم غير ذلك إذ لم يكن لتلك الأمة اسم تعرف به ، فإنهم كانوا أمة واحدة في الأرض فلم يحصل داع إلى تسميتهم باسم جَد أو أرض إذ لم يكن ما يدعو إلى تمييزهم إذ ليس ثمة غيرهم ، ألا ترى إلى حكاية الله عن هود في قوله لقومه{ واذكروا إذ جعلكم خلفاء من بعد قوم نوح } \\[ الأعراف : 69 \\] ، ولما حكى عن صالح إذ قال لقومه : { واذكروا إذ جعلكم خلفاء من بعد عاد } \\[ الأعراف : 74 \\]وظرف { إذ } وما أضيف إليه في موضع الحال من { نبأ نوح }.وافتتاح خطاب نوح قومَه ب { يا قوم } إيذان بأهيمة ما سيلقيه إليهم ، لأن النداء طلب الإقبال . ولما كان هنا ليس لطلب إقبال قومه إليه لأنه ما ابتدأ خطابهم إلا في مجمعهم تعين أن النداء مستعمل مجازاً في طلب الإقبال المجازي ، وهو توجيه أذهانهم إلى فهم ما سيقوله .واختيار التعبير عنهم بوصف كونهم قومه تحبيب لهم في نفسه ليأخذوا قوله مأخذ قول الناصح المتطلب الخيرَ لهم ، لأن المرء لا يريد لقومه إلا خيراً . وحذفت ياء المتكلم من المنادى المضاف إليها على الاستعمال المشهور في نداء المضاف إلى ياء المتكلم .ومعنى : { إن كان كبُر عليكم مقامي } شق عليكم وأحرجكم .والكبَر : وفرة حجم الجسم بالنسبة لأمثاله من أجسام نوعه ، ويستعار الكبَر لكون وصف من أوصاف الذوات أو المعاني أقوى فيه منه في أمثاله من نوعه ، فقد يكون مدحاً كقوله تعالى : { وإنها لكبيرة إلا على الخاشعين } \\[ البقرة : 45 \\] ، ويكون ذماً كقوله : { كَبُرَتْ كلمة تخرج من أفواههم } \\[ الكهف : 5 \\] ، ويستعار الكبَر للمشقة والحرج ، كقوله تعالى : { كَبُرَ على المشركين ما تدعوهم إليه } \\[ الشورى : 13 \\] وقوله : { وإن كان كَبُر عليك إعراضهم } \\[ الأنعام : 35 \\] وكذلك هنا .والمقام مصدر ميمي مرادف للقيام . وقد استعمل هنا في معنى شأن المرء وحاله كما في قوله تعالى : { ولمَن خاف مقام ربه جنتان } \\[ الرحمن : 46 \\] ، وقوله : { قال الذين كفروا للذين آمنوا أي الفريقين خير مَقاماً } \\[ مريم : 73 \\] أي خير حالة وشأناً . وهو استعمال من قبيل الكناية ، لأن مكان المرء ومقامه من لوازم ذاته ، وفيهما مظاهر أحواله .وخَص بالذكر من أحواله فيهم تذكيره إياهم بآيات الله ، لأن ذلك من أهم شؤونه مع قومه ، فعطفه من عطف الخاص على العام . فمعنى : { كَبُر عليكم مقامي وتذكيري } سئمتم أحوالي معكم وخاصة بتذكيري بآيات الله .وتجهم الحق على أمثالهم شنشنة المتوغلين في الفساد المأسورين للهوى إذ تقع لديهم الدعوة إلى الإقلاع عنه والتثويب بهم إلى الرشاد موقعاً مُرّ المَذاق من نفوسهم ، شديد الإيلام لقلوبهم ، لما في منازعة الحق نفوسهم من صَولة عليها لا يستطيعون الاستخفاف بها ولا يطاوعهم هواهم على الإذعان إليها ، فيتورطون في حيرة ومنازعة نفسانية تثقل عليهم ، وتشمئز منها نفوسهم ، وتكدر عليهم صفو انسياقهم مع هواهم . وإضافة التذكير إلى ضميره من إضافة المصدر إلى فاعله .والباء في { بآيات الله } لتأكيد تعدية المصدر إلى مفعوله الثاني ، والمفعولُ الأول محذوف ، والتقدير : تذكيري إياكم .و { آيات الله } مفعول ثان للتذكير .يقال : ذكرته أمراً نسيه ، فتعديته بالباء لتأكيد التعدية كقوله تعالى : { وذكرهم بأيام الله } \\[ إبراهيم : 5 \\] ، وقول مسور بن زيادةَ الحارثي: ... أذَكَّر بالبقيا على من أصابنيوبقياي أني جاهد غير مؤتلي ... ولذلك قالوا في قوله تعالى : { وامسحوا برؤوسكم } \\[ المائدة : 6 \\] أن الباء لتأكيد اللصوق أي لصوق الفعل بمفعوله .وآيات الله : دلائل فضله عليهم ، ودلائل وحدانيته ، لأنهم لما أشركوا بالله فقد نسوا تلك الدلائل ، فكان يذكرهم بها ، وذلك يُبرمهم ويحرجهم .وجملة : { فعلى الله توكلت } جواب شرط { إن كان كبُر عليكم مقامي } باعتبار أن ذلك الشرط تضمن أن إنكاره عليهم قد بلغ من نفوسهم ما لا طاقة لهم بحمله ، وأنهم متهيئون لمدافعته فأنبأهم أن احتمال صدور الدفاع منهم ، وهم في كثرة ومنعَة وهو في قلة وضعف ، لا يصُده عن استمرار الدعوة ، وأنه وإن كان بينهم وحيداً فذلك يوهنه لأنه متوكل على الله . ولأجل هذا قدم المجرور على عامله في قوله : { فعلى الله توكلت } أي لا على غيره .والتوكل : التعويل على من يدبر أمره . وقد مر عند قوله : { فإذا عزمت فتوكل على الله } في سورة \\[ آل عمران : 159 \\].والفاء في فأجمعوا أمركم } للتفريع على جملة { على الله توكلت } فللجملة المفرعة حكم جواب الشرط لأنها مفرعة على جملة الجواب ، ألا ترى أنه لولا قصده المبادرة بإعلامهم أنه غير مكترث بمناواتهم لكان مقتضى ظاهر الكلام أن يقول : إن كان كبُر عليكم مقامي الخ ، فأجمعوا أمركم فإني على الله توكلت ، كما قال هود لقومه { فكيدوني جميعاً ثم لا تنظرون إني توكلت على الله ربي وربكم } \\[ هود : 55 ، 56 \\].وإجماع الأمر : العزم على الفعل بعد التردد بين فِعله وفعل ضده . وهوَ مأخوذ من الجمع الذي هو ضد التفريق ، لأن المتردد في ماذا يعمله تكون عنده أشياء متفرقة فهو يتدبر ويتأمل فإذا استقر رأيه على شيء منها فقد جَمَع ما كان متفرقاً . فالهمزة فيه للجعل ، أي جعلَ أمره جمعاً بعد أن كان متفرقاً .ويقولون : جاؤوا وأمرهم جميع ، أي مجموع غير متفرق بوجوه الاختلاف .والأمر : هو شأنهم من قصد دفعه وأذاه وترددهم في وجوه ذلك ووسائله .و { شركاءكم } منصوب في قراءة الجمهور على أنه مفعول معه . والواو بمعنى ( مع ) أي أجمعوا أمركم ومعكم شركاؤكم الذين تستنصرون بهم .وقرأ يعقوب { وشركاؤكم } مرفوعاً عطفاً على ضمير { فأجمعوا } ، وسوغه الفصل بين الضمير وما عطف عليه بالمفعول . والمعنى : وليجْمَع شركاؤكم أمرَهم .وصيغة الأمر في قوله : { فأجمعوا } مستعملة في التسوية ، أي أن عزمهم لا يضيره بحيث هو يغريهم بأخذ الأهبة التامة لمقاومته . وزاد ذكر شركائهم للدلالة على أنه لا يخشاها لأنها في اعتقادهم أشد بطشاً من القوم ، وذلك تهكم بهم ، كما في قوله تعالى : { قل ادعوا شركاءكم ثم كيدون فلا تنظرون } \\[ الأعراف : 195 \\].وعطْف جملة : { ثم لا يكن أمركم عليكم غُمة } ب { ثم } الدالة على التراخي في الرتبة لما تتضمنه الجملة الثانية من الترقي في قلة مبالاته بما يُهيئونه له من الضر بحيث يتصدى لهم تصدي المشير بما يسهل لهم البلوغ إلى الإضرار به الذي ينوونه وإزالة العوائق الحائلة دون مقصدهم .وجاء بما ظاهره نهي أمرهم عن أن يكون غمة عليهم مبالغة في نهيهم عن التردد في تبين الوصول إلى قصدهم حتى كأنّ شأنهم هو المنهي عن أن يكون التباساً عليهم ، أي اجتهدوا في أن لا يكون ذلك .والغمة : اسم مصدر للغم . وهو الستر . والمراد بها في مثل هذا التركيب الستر المجازي ، وهو انبهام الحال ، وعدم تبين السداد فيه ، ولعل هذا التركيب جرى مجرى المثل فقد قال طرفة من قبل: ... لعمرك ما أمري علي بغمةنهاري ولا ليلي علي بسرمد ... وإظهار لفظ الأمر في قوله : { ثم لا يكن أمركم عليكم غمة } مع أنه عين الذي في قوله : { فأجمعوا أمركم } لكون هذا التركيب مما جرى مجرى المثل فيقتضي أن لا تغير ألفاظه .و ( ثم ) في قوله : { ثم اقضوا إلي } للتراخي في الرتبة ، فإن رتبة إنفاذ الرأي بما يزمعون عليه من أذاهُ أقوى من تدبير ذلك ، ومن رتبة إجماع الرأي عليه فهو ارتقاء من الشيء إلى أعلى منه ، فعطف ب ( ثم ) التي تفيد التراخي في الرتبة في عطفها الجمل .و { اقضُوا } أمر من القضاء ، فيجوز أن يكون من القضاء بمعنى الإتمام والفصل ، أي انفذوا ما ترونه من الإضرار بي . ويجوز أن يكون من القضاء بمعنى الحكم ، وهو قريب من الوجه الأول ، أي أنفذوا حكمكم .وعدي ب ( إلى ) دون ( على ) لأنه ضمن معنى الإبلاغ والإيصال تنصيصاً على معنى التنفيذ بالفعل ، لأن القضاء يكون بالقول فيعقبه التنفيذ أو الإرجاء أو العفو ، ويكون بالفعل ، فهو قضاء بتنفيذ . ويسمى عند الفقهاء بالقضاء الفعلي .وقوله : { ولا تُنظرون } تأكيد المدلول التضمين المشار إليه بحرف ( إلى ). والإنظار التأخير ، وحذفت ياء المتكلم من { تنظرون } للتخفيف ، وهو حذف كثير في فصيح الكلام ، وبقاء نون الوقاية مشعر بها .\n\n",
      "translations": [
        {
          "translation": "(Recite unto them the story of Noah) in the Qur'an, (when he told his people: O my people! If my sojourn (here)) if my extended stay with you (and my reminding you) and my warning of you (by Allah's revelations) from the punishment of Allah (are an offence unto you, in Allah have I put my trust) I rely in and consign my matter to Allah, (so decide upon your course of action) unite upon one decision and one matter, (you and your partners) and seek the help of your idols. (Let not your course of action be in doubt for you) do not make your decision and matter too vague for yourselves. (Then come forth against me, give me no respite) do not wait.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ لاَ يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُمَّةً } معناهُ ظُلمةٌ وضِيقٌ\n\n",
      "translations": [
        {
          "translation": " And His saying - be glorified - \"So your affair is not { }\" means: darkness and hardship.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱتْلُ } يا أكمل الرسل { عَلَيْهِمْ } تذكيراً وتعريضاً { نَبَأَ نُوحٍ } أي: قصته مع قومه وقت { إِذْ قَالَ لِقَوْمِهِ } حين استعظموا أمره وقصدوا إهلاكه عناداً ومكابرة: { يٰقَوْمِ } أضافهم إلى نفسه على مقتضى شفقة النبوة { إِن كَانَ كَبُرَ } أي: شق وعظم { عَلَيْكُمْ مَّقَامِي } فيكم\n وحياتي بينكم { وَتَذْكِيرِي } إياكم { بِآيَاتِ ٱللَّهِ } الدالة على توحيده واستقلاله في ألوهيته وربوبيته { فَعَلَى ٱللَّهِ } لا على غيره\n إذ لا غير معه لا شيء سواه { تَوَكَّلْتُ } أي: وثقت به وفوضت أمري إليه { فَأَجْمِعُوۤاْ } أي: فعليكم أن تجمعوا { أَمْرَكُمْ } وتدابيركم في قتلي وإهلاكي { وَ } مع ذلك اجعوا { شُرَكَآءَكُمْ } مستظهرين لهم في دفعي { ثُمَّ } بعد تدبيركم واستظهاركم بهم أظهورا عليَّ بحيث { لاَ يَكُنْ أَمْرُكُمْ } أي: لم يبقَ فيه { عَلَيْكُمْ غُمَّةً } سترة تغتمو بها وتحزنون بسببها\n بل رتبوا أمركم على ما تقتضيه نفوسكم وترتضيه عقولكم { ثُمَّ ٱقْضُوۤاْ إِلَيَّ } واصرفوا نحوي ما هيأتم ودبرتم من الأسباب الموجبة لإهلاكي { وَلاَ تُنظِرُونَ } [يونس: 71] أي: لا تمهلوني طرفة بل امضوا على ما أنتم عليه من قتلي وإهلاكي\n فإني لا أبالي بكم وبتدابيركم وظهرائكم\n إذ الله حسبي وعليه توكلي وبه اعتمادي واعتصامي\n أذكر لكم بإذنه وأعظكم بوحيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وشركاءكم: مفعول معه\n أو بفعل محذوف\n أي: اعزموا أمركم وأجمعُوا شركاءكم ومن قرأ: \" اجمَعُوا \" بهمزة وصل فشركاءكم: معطوف\n و \" غمة \": خفيّا\n وفي الحديث: \" فَإنْ غُمَّ عَلَيكُمْ فَاقدَروا لَهُ \"\n يقول الحق جل جلاله: { واتل عليهم نبأ نوحٍٍ } أي: خبره مع قومه\n قيل: اسمه عبد الغفار\n وسمي نوحاً لكثرة نَوحه من هيبة ربه\n { إذ قال لقومه يا قوم إن كان كَبُرَ } أي: عَظُمَ وشقَّ { عليكم مقامي } أي: كوني بين أظهركم\n وإقامتي بينكم مدة مديدة أذكركم بالله\n أو قيامي علّيكم لوعظكم\n أو نفسي ووجودي بينكم\n { وتذكيري } لكم { بآيات الله } أدعوكم بها إلى الله\n { فعلى الله توكلتُ }: وثقت به\n فلا أبالي ببعدكم عني وتخويفكم إياي\n { فأجمعُوا أمرَكم } أي: اعزموا عليه\n { وشركاءَكم } مع شركائكم\n أو وأمر شركائكم\n أو أجْمِعُوا أمركم واتَّفَِقُوا عليه وأجمِعُوا شركاءكم\n والمعنى: أنه أمرهم بالعزم والإجماع على قصده\n والسعي في إهلاكه\n على أي وجه يمكنهم لشدة ثقته بالله وعدم مبالاته بهم\n  { ثم لا يكن أمرُكم } في قصد إهلاكي { عليكم غُمَّة }: مستوراً خفيَّاً\n بل اجعلوه ظاهراً مكشوفاً تتمكنون فيه\n لأن من يكتم أمراً ويخفيه لا يقدر أن يفعل ما يريد\n أو ثم لا يكن حالكم عليكم غمَّاً\n أي: لا يلحقكم غم إذا أهلكتموني وتخلصتم من ثقل مقامي وتذكيري\n { ثم اقْضُوا } أي: انفذوا قضاءكم { إليَّ } فيما تريدون\n وقرأ السري بن يَنْعَم: \" أفضوا \" بالفاء وقطع الهمزة\n أي: انتهوا إليَّ بشرِّكم\n { ولا تُنظرون }: ولا تمهلون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:210",
      "similarity": 0.60761550522422
    },
    {
      "verse": "21:88",
      "similarity": 0.526208416684681
    },
    {
      "verse": "25:25",
      "similarity": 0.5116762565332615
    },
    {
      "verse": "22:22",
      "similarity": 0.39566221179729816
    },
    {
      "verse": "2:57",
      "similarity": 0.2526024725458385
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010071.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010071.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}