{
  "chapter": "يونس",
  "text": "متع فى الدنيا ثم الينا مرجعهم ثم نذيقهم العذاب الشديد بما كانوا۟ يكفرون",
  "translations": [
    {
      "translation": "There is the enjoyment of this world. Then they will return to Us. Then We will let them taste the terrible punishment because they were kafir.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them profit by the world (while they may): In the end they will come back to Us. Then We shall make them taste severe punishment for having denied (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They may enjoy the life of this world, but in the end they must return to Us, and then We shall cause them to taste severe chastisement for their disbelieving.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They may consider it a means of enjoyment in this life but (on the Day of Judgment) they will all return to Us. Then they will suffer for their disbelief the most severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enjoying a little in the earth, they have then to return to Us – We will then make them taste a severe punishment, the recompense of their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(A brief) enjoyment in this world! and then unto Us will be their return, then We shall make them taste the severest torment because they used to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is only) a provision in this world, then to Us shall be their return; then We shall make them taste severe punishment because they disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some enjoyment in this world; then unto Us they shall return; then We shall let them taste the terrible chastisement, for that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This world's portion (will be theirs), then unto Us is their return. Then We make them taste a dreadful doom because they used to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their portion is short-lived enjoyment in this world; but to Us they shall return. Then We shall make them taste a severe punishment, because of their denial of truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A brief enjoyment in the world; then unto Us is their return; then We will make them taste a severe torment, in that they have been disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An enjoyment in this world; then to Us shall be their return, then We shall make them taste the severe punishment because of what they used to defy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A little enjoyment in this world!- and then, to Us will be their return, then shall We make them taste the severest penalty for their blasphemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A brief enjoyment in this world! - and then unto Us will be their return, then We shall make them taste the severest torment because they used to disbelieve [in Allah, belie His Messengers, deny and challenge His Ayat (proofs, signs, verses, etc.)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They take their) enjoyment in this world, but to Us they shall return, then, We shall let them taste the terrible punishment because they were unbelievers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some enjoyment in this world; then to Us is their return; then We will make them taste the severe punishment on account of their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[For them is brief] enjoyment in this world; then to Us is their return; then We will make them taste the severe punishment because they used to disbelieve\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:70] Theirs will be, enjoyment, [only] a little, in this world, which they will enjoy for the duration of their lives, then to Us is their return, at death, then We shall make them taste terrible chastisement, after death, because they used to disbelieve.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This world's portion (will be theirs)) they will live in the life of this world a little, (then unto Us is their return) after they die. (Then We make them taste a dreadful) a severe (doom because they used to disbelieve) in Muhammad (pbuh) and in the Qur'an and also because they invented lies about Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل يحصل لهم بافترائهم هذا { مَتَاعٌ } أي: تمتع قليل { فِي ٱلدُّنْيَا } من الرئاسة والجاه { ثُمَّ } بعد انقضاء النشأة الأولى { إِلَيْنَا مَرْجِعُهُمْ } في النشأة الأخرى { ثُمَّ } بعد تيقنهم وكشفهم فيها { نُذِيقُهُمُ ٱلْعَذَابَ ٱلشَّدِيدَ } بدل ما يتلذذون في النشأة الأولى { بِمَا كَانُواْ يَكْفُرُونَ } [يونس: 70] أي: بسبب كفرهم وشركهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم إلينا مرجعُهُم } بالموت\n فيلقون الشقاء المؤبد\n { ثم نُذيقهم العذاب الشديد بما كانوا يكفرون }\n الإشارة: إظهار الكائنات من الغيب إلى الشهادة كلها على حد سواء في الاختراع والافتقار\n ليس بعضها أقرب من بعض\n وأما قوله: ـ عليه الصلاة والسلام ـ: \" الخَلْقُ عِيَالُ اللَّهِ وَأَحَبُّ الخَلْقِِِ إلى اللَّهِ أَنفَعُهُم لِعِيَالِهِ \"\n فمعناه أنهم في حفظه وكفالته مفتقرون إليه في إيصال المادة\n كافتقار الولد إلى أبيه\n وأما قرب العبد من ربه بطاعته فمعناه قرب محبة ورضا\n لا قرب مسافة أو نسب إذ أوصاف العبودية غير مجانسة لأوصاف الربوبية\n بل هي بعيدة منها مع شدة قربها\n ولذلك قال في الحِكَم: \" إلهي ما أقربَكَ مِنَّي وما أَبعَدَني عنك\n\n\n \" الخ\n وقد تشرق على العبد أنوار الربوبية فتكسوه حتى يغيب عن حسه ورسمه فلا يرى إلا أنوار ربه\n فربما تغلبه الأنوار\n فيدَّعي الاتحاد أو الحلول\n وهو معذور عند أهل الباطن لسكره\n وقد رفع التكليف عن السكران\n فإذا صحى وبقي على دعواه قُتل شرعاً\n والله تعالى أعلم\n ثم ذكر بعض قصص الأنبياء عليهم السلام\n تسلية لرسوله صلى الله عليه وسلم\n فقال: { وَٱتْلُ عَلَيْهِمْ نَبَأَ نُوحٍ إِذْ قَالَ لِقَوْمِهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:21",
      "similarity": 0.5417497476984008
    },
    {
      "verse": "29:57",
      "similarity": 0.5332856481514157
    },
    {
      "verse": "41:27",
      "similarity": 0.49656968889382413
    },
    {
      "verse": "10:23",
      "similarity": 0.42664512823455114
    },
    {
      "verse": "8:14",
      "similarity": 0.4222897091414803
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/10:70.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/10:70.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:70.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}