{
  "chapter": "يونس",
  "text": "فلما القوا۟ قال موسى ما جئتم به السحر ان الله سيبطله ان الله لا يصلح عمل المفسدين",
  "translations": [
    {
      "translation": "When they had thrown, Musa said, 'What you have brought is magic. Allah will certainly prove it false. Allah does not uphold the actions of corrupters.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they had cast (their spell) Moses said: \"What you have cast is only a charm which God will surely nullify. God does not verily render the deeds of evil-doers righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they had cast (their staffs), Moses said: 'What you have produced is sheer sorcery. Allah will certainly reduce it to naught. Surely Allah does not set right the work of the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the magicians had thrown theirs, Moses said, \"What you have performed is magic. God will certainly prove it to be false; He will not make the deeds of the corrupt people righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore when they had cast, Moosa said, “This what you have brought, is magic; Allah will now make it void; indeed Allah does not make the works of the mischievous successful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they had cast down, Musa said: \"What you have brought is sorcery, Allah will surely make it of no effect. Verily, Allah does not set right the work of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they cast down, Musa said to them: What you have brought is deception; surely Allah will make it naught; surely Allah does not make the work of mischief-makers to thrive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they had cast, Moses said, 'What you have brought is sorcery; God will assuredly bring it to naught. God sets not right the work of those who do corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had cast, Moses said: That which ye have brought is magic. Lo! Allah will make it vain. Lo! Allah upholdeth not the work of mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had done so, Moses said, \"What you have wrought is mere sorcery. Surely, God will bring it to nothing. Truly, God does not support the work of mischief-makers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they had cast down, Musa said: that which ye have brought is magic, verily Allah will soon make it vain; verily Allah setteth not right the work of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they threw down [their sticks and ropes], Moses said, ‘What you have produced is magic. Indeed Allah will bring it to naught presently. Indeed Allah does not foster the efforts of those who cause corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they had had their throw, Moses said: \"What ye have brought is sorcery: Allah will surely make it of no effect: for Allah prospereth not the work of those who make mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they had cast down, Musa (Moses) said: \"What you have brought is sorcery, Allah will surely make it of no effect. Verily, Allah does not set right the work of Al-Mufsidun (the evil-doers, corrupts, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had cast, Moses said: 'What you have brought is sorcery. Surely, Allah will render it as nothing. Allah does not put right the work of the corrupt'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they threw, Moses said, “What you produced is sorcery, and God will make it fail. God does not foster the efforts of the corrupt.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had thrown, Moses said, \"What you have brought is [only] magic. Indeed, Allah will expose its worthlessness. Indeed, Allah does not amend the work of corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:81] Then, when they had cast, their ropes and staffs, Moses said, ‘What (mā is interrogative and the subject, its predicate being [the following, ji’tum bihi]) have you brought? Sorcery? (ā’l-sihru [a-al-sihru] is a substitute [for the predicate ji’tum bihi, ‘have you brought’]; a variant reading has al-sihru with a single hamza, making it predicative, in which case mā is the relative particle of the subject) Verily God will bring it to nothing, He will efface it. Truly God does not make right the work of those who do corruption.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقد طوي ذكر صورة سحرهم في هذه الآية ، لأن الغرض من العبرة في هذه الآية وصف إصرار فرعون وملئه على الإعراض عن الدعوة ، وما لقيه المستضعفون الذين آمنوا بموسى عليه السلام من اعتلاء فرعون عليهم وكيف نصر الله رسوله والمستضعفين معه ، وكيف كانت لهم العاقبة الحسنى ولمن كفروا عاقبة السوء ، ليكونوا مثلاً للمكذبين بمحمد صلى الله عليه وسلم ولذلك لم يعرّج بالذّكر إلا على مقالة موسى عليه السلام حين رأى سحرهم الدالة على يقينه بربّه ووعده ، وبأن العاقبة للحق . وذلك أهم في هذا المقام من ذكر اندحاض سحرهم تجاه معجزة موسى عليه السلام ، ولأجل هذا لم يذكر مفعول { ألقوا } لتنزيل فعل { ألقوا } منزلة اللازم ، لعدم تعلق الغرض ببيان مفعوله .ومعنى { جئتم به } أظهرتموه لنا ، فالمجيء قد استعمل مجازاً في الإظهار ، لأن الذي يجيء بالشيء يظهره في المكان الذي جاءه ، فالملازمة عرفية . وليس المراد أنهم جاؤوا من بقاع أخرى مصاحبين للسحر ، لأنه وإن كان كثير من السحرة أو كلِّهم قد أقبلوا من مدن عديدة ، غير أن ذلك التقدير لا يطرد في كل ما يعبر فيه بنحو : جاء بكذا ، فإنه وإن استقام في نحو { وجاءوا على قميصه بدَم كذب } \\[ يوسف : 18 \\] لا يستقيم في نحو { إنّ الذين جَاءوا بالإفك } \\[ النور : 11 \\].ونظم الكلام على هذا الأسلوب بجَعْللِ { ما جئتم } مسنداً إليه دون أن يجعل مفعولاً لفعللِ { سيبطله } ، وبجَعْله اسماً مُبهماً ، ثُم تفسيره بجملة { جئتم به } ثم بيانه بعطف البيان لقصد الاهتمام بذكره والتشويق إلى معرفة الخبر ، وهو جملة { إن الله سيبطله } ثم مَجيء ضمير السحر مفعولاً لفعل { سيبطله } ، كل ذلك إطناب وتخريج على خلاف مقتضى الظاهر ، ليتقرر الإخبار بثبوت حقيقة في السحر له ويتمكَّن في أذهان السامعين فَضل تمكن ويقع الرعب في نفوسهم .وقوله : { السحر } قرأه الجمهور بهمزة وصل في أوله هي همزة ( ال ) ، فتكون ( ما ) في قوله : { ما جئتم به } اسم موصول ، والسحرُ عطفَ بيان لاسم الموصول . وقرأه أبو عمرو ، وأبو جعفر { آلسحر } بهمزة استفهام في أوله وبالمد لتسهيل الهمزة الثانية ، فتكون ( ما ) في قوله : { ما جئتم به } استفهامية ويكون ( آلسحرَ ) استفهاماً مبيناً لِ ( ما ) الاستفهامية .وهو مستعم في التحقير . والمعنى : أنه أمر هين يستطيعه ناس كثيرون .و { إن الله سيبطله } خبر ( ما ) الموصولة على قراءة الجمهور ، واستئناف بياني على قراءة أبي عمرو ومن وافقه وتأكيد الخبر ب ( إن ) زيادة في إلقاء الرّوع في نفوسهم .وإبطاله : إظهار أنه تخييل ليس بحقيقة ، لأن إظهار ذلك إبطال لما أريد منه ، أي أن الله سيبطل تأثيره على الناس بفضح سره ، وأشارت علامة الاستقبال إلى قرب إبطاله ، وقد حصل ذلك العلم لموسى عليه السلام بطريق الوحي الخاص في تلك القضية ، أو العام باندراجه تحت قاعدة كلية ، وهي مدلول { إن الله لا يصلح عملَ المفسدين }.فجملة : { إن الله لا يصلح عمل المفسدين } معترضة ، وهي تعليل لمضمون جملة { إن الله سيبطله } ، وتذييل للكلام بما فيه نفي الإصلاح . وتعريف { المفسدين } بلام الجنس ، من التعميم في جنس الإصلاح المنفي وجنس المفسدين ليُعلم أن سحرهم هو من قبيل عمل المفسدين ، وإضافة { عمل } إلى { المفسدين } يؤذن بأنه عمل فاسد ، لأنه فعل مَنْ شأنُهم الإفساد فيكون نسجاً على منوالهم وسيرة على معتادهم ، والمراد بإصلاح عمل المفسدين الذي نفاه أنه لا يؤيده . وليس المراد نفي تصييره صالحاً ، لأن ماهية الإفساد لا تقبل أن تصير صلاحاً حتى ينفى تصييرها كذلك عن الله ، وإنما إصلاحها هو إعطاؤها الصلاح ، فإذا نفى الله إصلاحها فذلك بتركها وشأنَها ، ومن شأن الفساد أن يتضاءل مع الزمان حتى يضمحل .ولما قدم قوله : { إن الله سيبطله } عُلم أن المراد من نفي إصلاحه تسليط أسباب بطلانه عليه حتى يبطل تأثيره ، وأن عدم إصلاح أعمال أمثالهم هو إبطال أغراضهم منها كقوله تعالى : { ويُبطلَ الباطلَ } \\[ الأنفال : 8 \\] أي يظهرَ بطلانه .وإنما كان السحرة مفسدين لأن قصدهم تضليل عقول الناس ليكونوا مسخرين لهم ولا يعلموا أسباب الأشياء فيبقوا ءالة فيما تأمرهم السحرة ، ولا يهتدوا إلى إصلاح أنفسهم سبيلاً . أما السحرة الذين خاطبهم موسى عليه السلام فإفسادهم أظهر لأنهم يحاولون إبطال دعوة الحق والدين القويم وترويج الشرك والضلالات .\n\n",
      "translations": [
        {
          "translation": "(And when they had cast) their staffs and ropes, (Moses said) to them: (That which ye have brought) that which you have cast (is magic. Lo! Allah will make it vain) Allah will make it void. (Lo! Allah upholdeth not) Allah is not pleased with (the work of mischief-makers) of sorcerers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّآ أَلْقَواْ } ما جاءوا به من السحر واستحسنوا من فرعون واستأملوا منه الجعل الكثير وجزموا الغلبة { قَالَ مُوسَىٰ } بعدما رأى ما ألقوا: { مَا جِئْتُمْ بِهِ } أيها المفسدون المعاندون { ٱلسِّحْرُ إِنَّ ٱللَّهَ } المطلع لجميع مخايلكم { سَيُبْطِلُهُ } عن قريب\n ثمَّ ألقى موسى عصاه\n فإذا هي تلقف ما يأفكون\n فوقع الحق وبطل ما كانوا يعملون\n فانقلبوا هنالك صاغرين { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { لاَ يُصْلِحُ عَمَلَ ٱلْمُفْسِدِينَ } [يونس: 81] منهم\n لانهماكهم في الإفساد والإسراف\n المصرين على العتو والعناد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما ألقَوا } حبالهم وعصيهم\n فانقلبت حَيَّات في أعين الناس\n يركب بعضها بعضاً\n { قال } لهم { موسى ما جئتم به السحر } أي: الذي جئتم به هو السحر\n لا ما سماه فرعون وقومه سحراً من معجزات العصا\n وقرأ البصري: \" آلسحر \" أي: أيّ شيء جئتم به السحر هو؟ { إن الله سيُبْطلُه }: سيمحقه\n أو سيظهر بطلانه\n { إن الله لا يُصلح عملَ المفسدين } لا يثيبه ولا يديمُه\n وفيه دليل على أن السحر تمويه لا حقيقة له",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:80",
      "similarity": 0.554904216461765
    },
    {
      "verse": "47:33",
      "similarity": 0.40380398457963673
    },
    {
      "verse": "2:11",
      "similarity": 0.39678787084440714
    },
    {
      "verse": "10:77",
      "similarity": 0.3934861862672019
    },
    {
      "verse": "26:152",
      "similarity": 0.3827197125764207
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010081.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010081.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:81.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}