{
  "chapter": "يونس",
  "text": "وقال موسى ربنا انك ءاتيت فرعون وملاه زينة وامولا فى الحيوة الدنيا ربنا ليضلوا۟ عن سبيلك ربنا اطمس على امولهم واشدد على قلوبهم فلا يؤمنوا۟ حتى يروا۟ العذاب الاليم",
  "translations": [
    {
      "translation": "Musa said, 'Our Lord, You have given Pharaoh and his ruling circle finery and wealth in the life of this world, Our Lord, so that they may be misguided from Your Way. Our Lord, obliterate their wealth and harden their hearts so that they do not have iman until they see the painful punishment.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said: \"O Lord, have You bestowed on the Pharaoh and his nobles pomp and plenty in the life of this world that they might mislead people from Your path? Destroy their possessions, O Lord, and harden their hearts that they may not believe until they face the painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses prayed: 'Our Lord! You bestowed upon Pharaoh and his nobles splendour and riches in the world. Our Lord! Have You done this that they may lead people astray from Your path? Our Lord! Obliterate their riches and harden their hearts that they may not believe until they observe the painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"Lord, You have given the Pharaoh and his people great riches and splendor in this life and this makes them stray from Your path. Lord, destroy their wealth and harden their hearts in disbelief so that they will suffer the most painful torment\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moosa prayed, “Our Lord! You have given Firaun and his chiefs adornment and wealth in the life of this world, our Lord, that they may lead astray from Your path; our Lord! Destroy their riches and harden their hearts so that they may not accept faith until they witness the painful punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: \"Our Lord! You have indeed bestowed on Fir`awn and his chiefs splendor and wealth in the life of this world, our Lord! That they may lead men astray from Your path. Our Lord! Destroy their wealth, and harden their hearts, so that they will not believe until they see the painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: Our Lord! surely Thou hast given to Firon and his chiefs finery and riches in this world's life, to this end, our Lord, that they lead (people) astray from Thy way: Our Lord! destroy their riches and harden their hearts so that they believe not until they see the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, 'Our Lord, Thou hast given to Pharaoh and his Council adornment and possessions in this present life. Our Lord, let them go astray from Thy way; Our Lord, obliterate their possessions, and harden their hearts so that they do not believe, till they see the painful chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said: Our Lord! Lo! Thou hast given Pharaoh and his chiefs splendour and riches in the life of the world, Our Lord! that they may lead men astray from Thy way. Our Lord! Destroy their riches and harden their hearts so that they believe not till they see the painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses prayed, \"Our Lord, You have bestowed upon Pharaoh and his nobles pomp and wealth in the present life, whereby they lead people astray from Your path. Our Lord, destroy their riches and harden their hearts, so that they shall not believe until they are faced with grievous punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: our Lord! verily Thou! Thou hast vouchsafed unto Fir'awn and his chiefs adornment and riches in the life of the world, Our Lord, that they may lead men astray from Thine way. Our Lord! wipe out their riches, and harden their hearts, so that they may not believe until they behold the torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, ‘Our Lord! You have given Pharaoh and his elite glamour and wealth in the life of this world, our Lord, that they may lead [people] astray from Your way! Our Lord! Blot out their wealth and harden their hearts so that they do not believe until they sight the painful punishment.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses prayed: \"Our Lord! Thou hast indeed bestowed on Pharaoh and his chiefs splendour and wealth in the life of the present, and so, Our Lord, they mislead (men) from Thy Path. Deface, our Lord, the features of their wealth, and send hardness to their hearts, so they will not believe until they see the grievous penalty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa (Moses) said: \"Our Lord! You have indeed bestowed on Fir'aun (Pharaoh) and his chiefs splendour and wealth in the life of this world, our Lord! That they may lead men astray from Your Path. Our Lord! Destroy their wealth, and harden their hearts, so that they will not believe until they see the painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord' supplicated Moses. 'You have given Pharaoh and his Council adornments and possessions in this life. Our Lord, let them go astray from YourPath. Our Lord, destroy their possessions and harden their hearts so that they shall not believe until they see the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, “Our Lord, you have given Pharaoh and his chiefs splendor and wealth in the worldly life. Our Lord, for them to lead away from Your path. Our Lord, obliterate their wealth, and harden their hearts, they will not believe until they see the painful torment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said, \"Our Lord, indeed You have given Pharaoh and his establishment splendor and wealth in the worldly life, our Lord, that they may lead [men] astray from Your way. Our Lord, obliterate their wealth and harden their hearts so that they will not believe until they see the painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:88] And Moses said, ‘Our Lord, You have indeed given Pharaoh and his council splendour and riches in the life of this world. Our Lord, You have given them this, that they may lead [people] astray, as a consequence thereof, from Your way, [from] Your religion. Our Lord, obliterate, transform, their riches and harden their hearts, stamp upon them and shackle [them], so that they do not believe until they see the painful chastisement’: he [Moses] invoked God against them and Aaron said ‘Amen’ at the end of his invocation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Moses said: Our Lord!) O our Lord! (Lo! Thou hast given Pharaoh and his chiefs splendour) beauty (and riches) and abundant riches (in the life of the world, Our Lord!) O our Lord! (that they may lead men astray) that by means of it they may lead your servants astray (from Thy way) from Your religion and obedience. (Our Lord! Destroy their riches and harden their hearts so that they believe not) so that they will not believe (till they see the painful doom) their own drowning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱطْمِسْ عَلَىٰ أَمْوَالِهِمْ } معناه اذْهِبْ أَموالَهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Observe their wealth} means to take their wealth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَ مُوسَىٰ } بعدما تفرس القبول والإجابة للدعاء، داعياً على الأعداء { رَبَّنَآ إِنَّكَ } بفضلك وجودك { آتَيْتَ فِرْعَوْنَ وَمَلأَهُ زِينَةً } يتزينون { وَأَمْوَالاً } يميلون إليها ويفتخرون بها { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } ولم يشكروا لنعمك بكل يكفروا بها يا { رَبَّنَا } وإنما افتخروا وباهوا بحطامهم { لِيُضِلُّواْ عَن سَبِيلِكَ } ضعفاء المؤمنين المتلونين الذين لم يتمكنوا في مقر اليقين ولم يتوطنو في موطن التمكين { رَبَّنَا ٱطْمِسْ عَلَىٰ أَمْوَالِهِمْ } أي: امحها واتلفها؛ لئلا يتمكنوا على تضليل عبادك بها { وَٱشْدُدْ } ختمك وطبعك { عَلَىٰ قُلُوبِهِمْ فَلاَ يُؤْمِنُواْ } لا ينكشفوا بالإذعان والقبول { حَتَّىٰ يَرَوُاْ ٱلْعَذَابَ } المعد لهم لكفرهم وإصرارهم { ٱلأَلِيمَ } [يونس: 88] المؤلم في غاية الإيلام حين رأوا المؤمنين في سرور دائم ولذة مستمرة وجنة نعيم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: اللام في ليُضلوا لام كي، متعلقة بآتيت محذوفة، أو بالمذكورة، ولفظ ربنا تكرار، أو تكون لام الأمر، فيكون دعاء عليهم بلفظ الأمر، بما علم من قرائن أحوالهم أنه لا يكون غيره\n { فلا يؤمنوا }: جواب الدعاء أو عطف على ليضلوا\n يقول الحق جل جلاله: { وقال موسى ربنا إنك آتيت فرعون وملأهُ زينةً }: ما يتزين به من الملابس والمراكب، ونحوها، { وأموالاً }: أنواعاً من المال { في الحياة الدنيا } استدراجاً، { ربنا } آتيتهم ذلك { ليُضلوا عن سبيلك } طغياناً وبطراً بها، وصرفها في غير محلها، أو ربنا اجعلهم ضالين في سبيلك، كقول نوح عليه السلام\n\n[نوح:24] لما أيس من إيمانهم، { ربنا اطمسْ على أموالهم } أي: أهلكها وامحقها، { واشْدُدْ على قلوبهم } بالقسوة، واطبع عليها حتى لا تنشرح للإيمان، { فلا يؤمنوا حتى يَرَوا العذابَ الأليم } أي: إن تطمس على أموالهم وتشدد على قلوبهم لا يؤمنوا إلا قهراً\n وفي الآية دليل على جواز الدعاء على الظالم بالمعصية، أو الكفر، وقد فعله سعد بن أبي وقاص على الذي شهد فيه بالباطل، ووجْهُ جوازه مع استلزامه وقوع المعاصي: أنه لم يُعتبر من حيث تاديته إلى المعاصي، ولكن من حيث تأديته إلى نِكاية الظالم وعقوبته، وهذا كما قيل في تمني الشهادة أنه مشروع، وإن كان يؤدي إلى قتل الكافر للمسلم، وهو معصية ووهن في الدين، ولكن الغرض من تمنى الشهادة ثوابُها، لا نفسها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:8",
      "similarity": 0.6224723534269694
    },
    {
      "verse": "36:66",
      "similarity": 0.5910479847359841
    },
    {
      "verse": "54:37",
      "similarity": 0.5226687639492861
    },
    {
      "verse": "4:47",
      "similarity": 0.47522461422748424
    },
    {
      "verse": "43:46",
      "similarity": 0.2404293894392288
    }
  ]
}