{
  "chapter": "يونس",
  "text": "قال قد اجيبت دعوتكما فاستقيما ولا تتبعان سبيل الذين لا يعلمون",
  "translations": [
    {
      "translation": "He said, 'Your request is answered, so go straight and do not follow the way of those who have no knowledge.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said (the Lord): \"Your prayer is answered. Therefore persist and do not follow the path of those who are ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah responded: 'The prayer of the two of you is accepted. So keep steadfast, and do not follow the path of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord replied, \"Moses, the prayer of your brother and yourself has been heard. Both of you must be steadfast (in your faith) and must not follow the ignorant ones.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “The prayer of you two is accepted, therefore remain firm, and do not follow the way of the unwise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: \"Verily, the invocation of you both is accepted. So you both keep to the straight way, and follow not the path of those who know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: The prayer of you both has indeed been accepted, therefore continue in the right way and do not follow the path of those who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Your prayer is answered; so go you straight, and follow not the way of those that know not.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Your prayer is heard. Do ye twain keep to the straight path, and follow not the road of those who have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, \"Your prayer is granted, so continue, then, both of you, steadfastly on the right path, and do not follow the path of those who have no knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: surely the petition of you twain is accepted, so keep straight on, and follow not the path of those who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, ‘Your supplication has already been granted. So be steadfast, and do not follow the way of those who do not know.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: \"Accepted is your prayer (O Moses and Aaron)! So stand ye straight, and follow not the path of those who know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: \"Verily, the invocation of you both is accepted. So you both keep to the Straight Way (i.e. keep on doing good deeds and preaching Allah's Message with patience), and follow not the path of those who know not (the truth i.e. to believe in the Oneness of Allah, and also to believe in the Reward of Allah: Paradise, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) said: 'Your supplication is answered; so go straight and do not follow the way of those who do not know'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Your prayer has been answered, so go straight, and do not follow the path of those who do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"Your supplication has been answered.\" So remain on a right course and follow not the way of those who do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:89] He, [God] exalted be He, said, ‘Your prayer has been answered: thus their riches were transformed into stones and Pharaoh did not believe until he was about to drown. So the two of you remain upright, with the Message and the Call until such time as chastisement befalls them, and do not follow the way of those who have no knowledge’, when they seek to hasten on My judgement — it is reported that he [Moses] remained [alive] a further forty years thereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Allah said to Moses and Aaron: (Your prayer is heard. Do ye twain keep to the straight path) of faith, obedience of Allah and conveyance of the message, (and follow not the road) the religion (of those who have no knowledge) regarding Allah's divine Oneness and do not believe in Him. The reference here is to Pharaoh and his folk.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } سبحانه مبشراً لموسى: { قَدْ أُجِيبَتْ دَّعْوَتُكُمَا } ووقع مناجاتكما في محل القبول\n ثنَّى الضمير\n لأن هارون يؤمن حين دعا { فَٱسْتَقِيمَا } على ما أتنما عليه من الدعوة وإلزام الحجة ولا تفتروا في أمركما هذا\n والزما الصبر\n إذ الأمور مرهونة بأوقاتها { وَلاَ تَتَّبِعَآنِّ } في الاستعجال والاستسراع { سَبِيلَ ٱلَّذِينَ لاَ يَعْلَمُونَ } [يونس: 89] الأدب مع الله في إلحاحهم واقترحاتهم في طلبه الحاجات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } تعالى: { قد أجيَبت دعوتُكما } يعني موسى وهارون\n وكان يُؤمِّن على دعاء أخيه\n { فاستقيما } أي: اثبتا على ما أنتما عليه من الاستقامة والدعوة وإلزام الحجة\n ولا تستعجلا\n فإن ما طلبتما كائن ولكن في وقته\n روي أنه مكث فيهم بعد الدعاء أربعين سنة\n { ولا تتبعانِّ سبيلَ الذين لا يعلمون }: طريق الجهلة في استعجال الأشياء قبل وقتها\n أو في عدم الوثوق والاطمئنان بوعدنا\n وقرأ ابن ذكوان: \" ولا تتبعان \" بالنون الخفيفة وكسرها لالتقاء الساكنين\n وهو قليل\n قال ابن مالك:\nويحتمل أن تكون نون الرفع\n و \" لا \" نافية\n أي: والأمر لا تتبعان سبيل الذين لا يعلمون\n  الإشارة: دعاء الأولياء على الظالم مشروع بعد الإذن الإلهامي على ما يفهمونه\n وقد مكث الشيخ أبو الحسن سنين لم يدع على ابن البراء حتى كان سنة في عرفة\n فقال: الآن أًذن لي في الدعاء على ابن البراء\n\n\n الخ فإن لم يكن إذن فالصبر أوْلى\n بل الأولى الدعاء له بالهداية\n حتى يأخذ الله بيده وهذا مقام الصديقين\n فإذا وقع الدعاء مطلقاً وتأخرت الإجابة فلا يستعجل\n فيكون تبع سبيل الذين لا يعلمون\n وفي الحكم: \" لا يكن تأخرُ أمدِ العطاءِ مع الإلحاحِ في الدعاء موجباً ليأسك\n فقد ضمن لك الإحابة فيما يختار لك لا فيما تختار أنت لنفسك\n وفي الوقت الذين يريد\n لا في الوقت الذي تريد \" \n وقال أيضاً: \" لا يشككنَّك في الوعد عدم وقوع الموعود وإن تعين زمنه لئلا يكون ذلك قَدْحاً في بصيرتك\n وإخماداً لنور سريرتك \" وبالله التوفيق\n ثم أجاب دعاءهما\n فقال: { وَجَاوَزْنَا بِبَنِيۤ إِسْرَائِيلَ ٱلْبَحْرَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:194",
      "similarity": 0.5433753945612073
    },
    {
      "verse": "28:64",
      "similarity": 0.5420963480618239
    },
    {
      "verse": "28:50",
      "similarity": 0.48366168322199354
    },
    {
      "verse": "11:14",
      "similarity": 0.474453439646314
    },
    {
      "verse": "46:5",
      "similarity": 0.4722028729583841
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010089.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010089.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:89.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}