{
  "chapter": "يونس",
  "text": "فلما القوا۟ قال موسى ما جئتم به السحر ان الله سيبطله ان الله لا يصلح عمل المفسدين",
  "translations": [
    {
      "translation": "When they had thrown, Musa said, 'What you have brought is magic. Allah will certainly prove it false. Allah does not uphold the actions of corrupters.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they had cast (their spell) Moses said: \"What you have cast is only a charm which God will surely nullify. God does not verily render the deeds of evil-doers righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they had cast (their staffs), Moses said: 'What you have produced is sheer sorcery. Allah will certainly reduce it to naught. Surely Allah does not set right the work of the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the magicians had thrown theirs, Moses said, \"What you have performed is magic. God will certainly prove it to be false; He will not make the deeds of the corrupt people righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore when they had cast, Moosa said, “This what you have brought, is magic; Allah will now make it void; indeed Allah does not make the works of the mischievous successful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they had cast down, Musa said: \"What you have brought is sorcery, Allah will surely make it of no effect. Verily, Allah does not set right the work of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they cast down, Musa said to them: What you have brought is deception; surely Allah will make it naught; surely Allah does not make the work of mischief-makers to thrive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they had cast, Moses said, 'What you have brought is sorcery; God will assuredly bring it to naught. God sets not right the work of those who do corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had cast, Moses said: That which ye have brought is magic. Lo! Allah will make it vain. Lo! Allah upholdeth not the work of mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had done so, Moses said, \"What you have wrought is mere sorcery. Surely, God will bring it to nothing. Truly, God does not support the work of mischief-makers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they had cast down, Musa said: that which ye have brought is magic, verily Allah will soon make it vain; verily Allah setteth not right the work of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they threw down [their sticks and ropes], Moses said, ‘What you have produced is magic. Indeed Allah will bring it to naught presently. Indeed Allah does not foster the efforts of those who cause corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they had had their throw, Moses said: \"What ye have brought is sorcery: Allah will surely make it of no effect: for Allah prospereth not the work of those who make mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they had cast down, Musa (Moses) said: \"What you have brought is sorcery, Allah will surely make it of no effect. Verily, Allah does not set right the work of Al-Mufsidun (the evil-doers, corrupts, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had cast, Moses said: 'What you have brought is sorcery. Surely, Allah will render it as nothing. Allah does not put right the work of the corrupt'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they threw, Moses said, “What you produced is sorcery, and God will make it fail. God does not foster the efforts of the corrupt.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had thrown, Moses said, \"What you have brought is [only] magic. Indeed, Allah will expose its worthlessness. Indeed, Allah does not amend the work of corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:81] Then, when they had cast, their ropes and staffs, Moses said, ‘What (mā is interrogative and the subject, its predicate being [the following, ji’tum bihi]) have you brought? Sorcery? (ā’l-sihru [a-al-sihru] is a substitute [for the predicate ji’tum bihi, ‘have you brought’]; a variant reading has al-sihru with a single hamza, making it predicative, in which case mā is the relative particle of the subject) Verily God will bring it to nothing, He will efface it. Truly God does not make right the work of those who do corruption.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they had cast) their staffs and ropes, (Moses said) to them: (That which ye have brought) that which you have cast (is magic. Lo! Allah will make it vain) Allah will make it void. (Lo! Allah upholdeth not) Allah is not pleased with (the work of mischief-makers) of sorcerers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّآ أَلْقَواْ } ما جاءوا به من السحر واستحسنوا من فرعون واستأملوا منه الجعل الكثير وجزموا الغلبة { قَالَ مُوسَىٰ } بعدما رأى ما ألقوا: { مَا جِئْتُمْ بِهِ } أيها المفسدون المعاندون { ٱلسِّحْرُ إِنَّ ٱللَّهَ } المطلع لجميع مخايلكم { سَيُبْطِلُهُ } عن قريب، ثمَّ ألقى موسى عصاه، فإذا هي تلقف ما يأفكون، فوقع الحق وبطل ما كانوا يعملون، فانقلبوا هنالك صاغرين { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { لاَ يُصْلِحُ عَمَلَ ٱلْمُفْسِدِينَ } [يونس: 81] منهم؛ لانهماكهم في الإفساد والإسراف، المصرين على العتو والعناد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:80",
      "similarity": 0.554904216461765
    },
    {
      "verse": "47:33",
      "similarity": 0.40380398457963673
    },
    {
      "verse": "2:11",
      "similarity": 0.39678787084440714
    },
    {
      "verse": "10:77",
      "similarity": 0.3934861862672019
    },
    {
      "verse": "26:152",
      "similarity": 0.3827197125764207
    }
  ]
}