{
  "chapter": "يونس",
  "text": "وقال موسى ربنا انك ءاتيت فرعون وملاه زينة وامولا فى الحيوة الدنيا ربنا ليضلوا۟ عن سبيلك ربنا اطمس على امولهم واشدد على قلوبهم فلا يؤمنوا۟ حتى يروا۟ العذاب الاليم",
  "translations": [
    {
      "translation": "Musa said, 'Our Lord, You have given Pharaoh and his ruling circle finery and wealth in the life of this world, Our Lord, so that they may be misguided from Your Way. Our Lord, obliterate their wealth and harden their hearts so that they do not have iman until they see the painful punishment.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said: \"O Lord, have You bestowed on the Pharaoh and his nobles pomp and plenty in the life of this world that they might mislead people from Your path? Destroy their possessions, O Lord, and harden their hearts that they may not believe until they face the painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses prayed: 'Our Lord! You bestowed upon Pharaoh and his nobles splendour and riches in the world. Our Lord! Have You done this that they may lead people astray from Your path? Our Lord! Obliterate their riches and harden their hearts that they may not believe until they observe the painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"Lord, You have given the Pharaoh and his people great riches and splendor in this life and this makes them stray from Your path. Lord, destroy their wealth and harden their hearts in disbelief so that they will suffer the most painful torment\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moosa prayed, “Our Lord! You have given Firaun and his chiefs adornment and wealth in the life of this world, our Lord, that they may lead astray from Your path; our Lord! Destroy their riches and harden their hearts so that they may not accept faith until they witness the painful punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: \"Our Lord! You have indeed bestowed on Fir`awn and his chiefs splendor and wealth in the life of this world, our Lord! That they may lead men astray from Your path. Our Lord! Destroy their wealth, and harden their hearts, so that they will not believe until they see the painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: Our Lord! surely Thou hast given to Firon and his chiefs finery and riches in this world's life, to this end, our Lord, that they lead (people) astray from Thy way: Our Lord! destroy their riches and harden their hearts so that they believe not until they see the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, 'Our Lord, Thou hast given to Pharaoh and his Council adornment and possessions in this present life. Our Lord, let them go astray from Thy way; Our Lord, obliterate their possessions, and harden their hearts so that they do not believe, till they see the painful chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said: Our Lord! Lo! Thou hast given Pharaoh and his chiefs splendour and riches in the life of the world, Our Lord! that they may lead men astray from Thy way. Our Lord! Destroy their riches and harden their hearts so that they believe not till they see the painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses prayed, \"Our Lord, You have bestowed upon Pharaoh and his nobles pomp and wealth in the present life, whereby they lead people astray from Your path. Our Lord, destroy their riches and harden their hearts, so that they shall not believe until they are faced with grievous punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: our Lord! verily Thou! Thou hast vouchsafed unto Fir'awn and his chiefs adornment and riches in the life of the world, Our Lord, that they may lead men astray from Thine way. Our Lord! wipe out their riches, and harden their hearts, so that they may not believe until they behold the torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, ‘Our Lord! You have given Pharaoh and his elite glamour and wealth in the life of this world, our Lord, that they may lead [people] astray from Your way! Our Lord! Blot out their wealth and harden their hearts so that they do not believe until they sight the painful punishment.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses prayed: \"Our Lord! Thou hast indeed bestowed on Pharaoh and his chiefs splendour and wealth in the life of the present, and so, Our Lord, they mislead (men) from Thy Path. Deface, our Lord, the features of their wealth, and send hardness to their hearts, so they will not believe until they see the grievous penalty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa (Moses) said: \"Our Lord! You have indeed bestowed on Fir'aun (Pharaoh) and his chiefs splendour and wealth in the life of this world, our Lord! That they may lead men astray from Your Path. Our Lord! Destroy their wealth, and harden their hearts, so that they will not believe until they see the painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord' supplicated Moses. 'You have given Pharaoh and his Council adornments and possessions in this life. Our Lord, let them go astray from YourPath. Our Lord, destroy their possessions and harden their hearts so that they shall not believe until they see the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, “Our Lord, you have given Pharaoh and his chiefs splendor and wealth in the worldly life. Our Lord, for them to lead away from Your path. Our Lord, obliterate their wealth, and harden their hearts, they will not believe until they see the painful torment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said, \"Our Lord, indeed You have given Pharaoh and his establishment splendor and wealth in the worldly life, our Lord, that they may lead [men] astray from Your way. Our Lord, obliterate their wealth and harden their hearts so that they will not believe until they see the painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:88] And Moses said, ‘Our Lord, You have indeed given Pharaoh and his council splendour and riches in the life of this world. Our Lord, You have given them this, that they may lead [people] astray, as a consequence thereof, from Your way, [from] Your religion. Our Lord, obliterate, transform, their riches and harden their hearts, stamp upon them and shackle [them], so that they do not believe until they see the painful chastisement’: he [Moses] invoked God against them and Aaron said ‘Amen’ at the end of his invocation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف بقية ما جرى في القصة مما فيه عبرة وموعظة . وهذا مقدمة لخبر خروج موسى ومَن معه من أرض مصر . فهذه المقدمة لتعريف كرامة موسى عليه السلام على ربه بأن استجاب له دعاءه ، وأنفذ برسالته مُراده تعالى من إنقاذ بني إسرائيل من الاستعباد .ومهَّد موسى لدعائه تمهيداً يدل على أن ما سأله من الله لزجر فرعون وملئه إنما هو لمصلحة الدين لا للانتقام منه لقومه ولنفسه ، فسأل الله سلب النعمة عن فرعون وملئه وحلولَ العذاب بهم لخضد شوكتهم وتذليل تجبرهم ليرجعوا عن ضلالهم ويسهل قبولهم الإيمان .ولما كانت النعمة مغرية بالطغيان لأهل الجهالة والخباثة جعل موسى إمداد فرعون بالنعمة مغرياً لفرعون بالاسترسال على الإعراض عن الدين فكان دعاء موسى عليهم استصلاحاً لهم وتطلباً لإيمانهم بوسائل التشديد عليهم ، ولكن الله علم من قلوبهم ما لم يعلمه موسى وقضى عليهم بالاستئصال .وافتتح الدعاءُ بالنداء لمناسبته لمقام الدعاء . ونودي الله بوصف الربوبية تذللاً لإظهار العبودية .وقوله : { إنك آتيت فرعون وملأه زينة وأموالاً } توطئة للدعاء عليهم فليس المقصود به حقيقة الإخبار ضرورة أن موسى يوقن بأن الله يعلم ذلك فتعين أن الخبر مستعمل في التمهيد لطلب سلب النعمة عنهم في قوله : { ليضلوا عن سبيلك }. ثم الانتقال إلى الدعاء بسلب ما أوتوه .فاقتران الخبر بحرف ( إنّ ) في قوله : { إنَّك آتيت فرعون } الخ مقصود به الاهتمام بهذا المعنى الذي استعمل فيه الخبر إذ ليس المقام مقام دفع تردد أو دفع إنكار .وقد تردد المفسرون في محل اللام في قوله : { ليضلوا عن سبيلك }. والذي سلكه أهل التدقيق منهم أن اللام لام العاقبة . ونُقل ذلك عن نحاة البصرة : الخليل وسيبويه ، والأخفش ، وأصحابهما ، على نحو اللام في قوله تعالى : { فالتقطه آل فرعون ليكون لهم عدواً وحزناً } \\[ القصص : 8 \\] فاللام الموضوعة للتعليل مستعارة لمعنى الترتب والتعقيب الموضوع له فاء التعقيب على طريقة الاستعارة التبعية في متعلق معنى الحرف فشبه ترتب الشيء على شيء آخر ليس علةً فيه بترتب المعلول على العلة للمبالغة في قوة الترتب حتى صار كأنه مقصود لمن ظهر عنده أثره ، فالمعنى : إنك آتيت فرعون وملأه زينة وأموالاً فضلوا بذلك وأضلوا .وللمفسرين وجوه خمسة أخرى :أحدها : أن يكون للتعليل ، وأن المعنى : إنك فعلت ذلك استدراجاً لهم ، ونسب إلى الفراء ، وفسر به الطبري .الثاني : أن الكلام على حذف حرف ، والتقدير : لئَلا يضلوا عن سبيلك أي فضلُّوا . حكاه الفخر .الثالث : أن اللام لام الدعاء . روي هذا عن الحسن . واقتصر عليه في «الكشاف» . وقاله ابن الأنباري . وهو أبعد الوجوه وأثقلها .الرابع : أن يكون على حذف همزة الاستفهام . والتقدير : أليضلوا عن سبيلك آتيناهم زينة وأموالاً تقريراً للشنعة عليهم ، قاله ابن عطية .ويكون الاستفهام مستعملاً في التعجب ، قاله الفخر .الخامس : تأويل معنى الضلال بأنه الهلاك ، قاله الفخر . وهي وجوه ضعيفة متفاوتة الضعف فلا نطيل بتقريرها .والزينة : ما يتزين به الناس ، وما يحسن في أنظارهم من طرائف الدنيا ، كالحلي والجواهر والمباني الضخمة . قال تعالى : { زيَّن للناس حب الشهوات } \\[ آل عمران : 14 \\] وقال : { المال والبنون زينة الحياة الدنيا } \\[ الكهف : 46 \\] وقال : { ولكم فيها جمال حين تريحون وحين تسرحون } \\[ النحل : 6 \\].والأموال : ما به قوام المعاش ، فالزينة تلهيهم عن اتباع المواعظ ، وتعظّم شأنهم في أنظار قومهم ، والأموال يسخِّرون بها الرعيَّة لطاعتهم ، وقد كان للفراعنة من سعة الرزق ورفاعية العيش ما سار ذكره في الآفاق . وظهرت مُثل منه في أهرامهم ونواويسهم .وأعيد النداء بين الجملة المعلِّلة والجملة المعلَّلة لتأكيد التذلل والتعرض للإجابة ولإظهار التبرؤ من قَصد الاعتراض .وقرأ نافع ، وابن كثير ، وأبو عمرو ، وابن عامر ، وأبو جعفر ، ويعقوب { ليَضلوا } بفتح الياء . وقرأ عاصم ، وحمزة ، والكسائي بضم الياء على معنى سعيهم في تضليل الناس .والمعنى الحاصل من القراءتين متحد لأنهم إذا ضَلوا في أنفسهم وهم قادة قومهم كان ضلالهم تضليلاً لغيرهم ، وكذلك إذا أضلوا الناس فإنهم ما أضلوهم إلا وهم ضالون مثلهم . وقد علمت آنفاً أن الزينة سبب ضلالهم والأموال سبب إضلال الناس .وأعيد النداء ثالثَ مرة؛ لزيادة تأكيد التوجه والتضرع .وجملة : { اطمس على أموالهم } هي المقصود من هذا الكلام ، والنداء يقوم مقام وصل الجملة بما قبلها بمنزلة حرف العطف .والطمْس : المَحْو والإزالة . وقد تقدم في قوله : { من قبل أن نَطْمس وجوهاً } في سورة \\[ النساء : 47 \\]. وفعله يتعدى بنفسه كما في آية سورة النساء ، ويُعدى بحرف ( على ) كما هنا . وقوله تعالى : { ولو نشاء لطمسنا على أعينهم } في سورة \\[ يس : 66 \\]. ولعل تعديته ب ( على ) لإرادة تمكن الفعل من المفعول ، أو لتضمين الطمس معنى الاعتلاء بآلة المحو والإزالة ، فطمس الأموال إتلافها وإهلاكها .وأما قوله : واشدد } فأحسب أنه مشتق من الشد ، وهو العسر . ومنه الشدة للمصيبة والتحرج ، ولو أريد غير ذلك لقيل : واطبع ، أو واختم ، أو نحوهما ، فيكون شدّ بمعنى أدخل الشدّ أو استعمله مثل جَد في كلامه ، أي استعمَل الجد .وحرف ( على ) مستعار لمعنى الظرفية استعارة تبعية لإفادة تمكن الشدة . والمعنى : أدخل الشدة في قلوبهم .والقلوب : النفوس والعقول . والمعنى : أنه يدعو عليهم بالأنكاد والأحزان التي تجعل قلوبهم في ضيق وحرج أي اجعلهم في عناء وبلبلة بال ما داموا في الكفر . وهذا حرص منه عليه السلام على وسائل هدايتهم رجاء أنهم إذا زالت عنهم النعم وضاقت صدورهم بكروب الحياة تفكروا في سبب ذلك ، فعجَّلوا بالنَّوبة إلى الله كما هو معتاد النفوس الغافلة قال تعالى : { وإذا مسّ الإنسان ضر دعا ربَّه منيباً إليه } \\[ الزمر : 8 \\].ويجوز أن يكون { اشدد } من الشد ، وهو الهجوم .يقال : شد عليه ، إذا هجم ، وذلك أن قلوبهم في حالة النعمة والدعة آمنة ساكنة فدعا الله أن يشد عليهم بعذابه ، تمثيلاً لحال إصابة نفوسهم بالأكدار والأحزان بحال من يَشُد على عدوّه ليقتله وهو معنى قوله تعالى : { وأجْلب عليهم بخيلك ورجلك } \\[ الإسراء : 64 \\] أي طوّعهم لحكمك وسَخّرهم .وبهذا يظهر أن موقع الفاء في قوله : { فلا يؤمنوا حتى يروا العذاب الأليم } أن تكون فاء السببية في جواب الدعاء ، أي افعَلْ بهم ذلك ليؤمنوا . والفعل منصوب بأن مضمرة إضماراً واجباً بعد فاء السببية .فقوله : { فلا يؤمنوا حتى يروا العذاب } في قوة أن يقال : فيؤمنوا حين يرون العذاب لا قَبْل ذلك .وإنما عدل عن إيقاع جواب الدعاء بصيغة إثبات الإيمان ، إلى إيراده بصيغة نفي مُغيّا بغاية هي رؤية العذاب سلوكاً لأسلوب بديع في نظم الكلام لأنه أراد أن يجمع بين ترتيب الجواب على الدعاء وبين ما استبان له من طبع نفوسهم بطبع أنهم لا تنفع فيهم الحجج وأن قساوة قلوبهم وشراسة نفوسهم لا تذللها إلا الآلام الجسدية والنفسانية ، وكل ذلك علاجٌ بما هو مظنة إيصالهم من طرق الضغط والشدة حيث لم تُجْد فيهم وسائل الحجة ، فقال : { فلا يؤمنوا حتى يروا العذاب الأليم } أي أن شأنهم ذلك ، وهذا إيجاز بديع إذ جمع في هذا التركيب جواب الدعاء وبيانَ علة الدعاء عليهم بذلك . وأصل الكلام : فيؤمنوا فإنهم لا يؤمنون إلا إذا رأوا العذاب الأليم .والمقصود من جواب فعل الدعاء هو غاية الجواب التي بعد حتى ، فتلك هي مصب الجواب . وهذا الوجه في تفسير الآية وجه لا ترهقه غبرة الإشكال ، ولا يعسر معه المنال ، ويجوز أن يكون قوله : { فلا يومنوا } الخ عطفاً على قوله : { ليضلوا عن سبيلك } وجملة الدعاء بينهما معترضة .والمعنى : ليضلوا عن سبيلك فيستمر ضلالهم حتى يروا العذاب الأليم . وهذا تأويل المبرد والزجاج . والمراد بالعذاب الأليم عذاب الفقر والجوع وعذاب النكد في النفس .والرؤية مستعملة في الإحساس على وجه المجاز المرسل ، أو مستعملة كناية عن حلول العذاب بهم لأن المشاهدة ملازمة لحلول الشيء المشاهد .\n\n",
      "translations": [
        {
          "translation": "(And Moses said: Our Lord!) O our Lord! (Lo! Thou hast given Pharaoh and his chiefs splendour) beauty (and riches) and abundant riches (in the life of the world, Our Lord!) O our Lord! (that they may lead men astray) that by means of it they may lead your servants astray (from Thy way) from Your religion and obedience. (Our Lord! Destroy their riches and harden their hearts so that they believe not) so that they will not believe (till they see the painful doom) their own drowning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱطْمِسْ عَلَىٰ أَمْوَالِهِمْ } معناه اذْهِبْ أَموالَهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Observe their wealth} means to take their wealth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَ مُوسَىٰ } بعدما تفرس القبول والإجابة للدعاء\n داعياً على الأعداء { رَبَّنَآ إِنَّكَ } بفضلك وجودك { آتَيْتَ فِرْعَوْنَ وَمَلأَهُ زِينَةً } يتزينون { وَأَمْوَالاً } يميلون إليها ويفتخرون بها { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } ولم يشكروا لنعمك بكل يكفروا بها يا { رَبَّنَا } وإنما افتخروا وباهوا بحطامهم { لِيُضِلُّواْ عَن سَبِيلِكَ } ضعفاء المؤمنين المتلونين الذين لم يتمكنوا في مقر اليقين ولم يتوطنو في موطن التمكين { رَبَّنَا ٱطْمِسْ عَلَىٰ أَمْوَالِهِمْ } أي: امحها واتلفها\n لئلا يتمكنوا على تضليل عبادك بها { وَٱشْدُدْ } ختمك وطبعك { عَلَىٰ قُلُوبِهِمْ فَلاَ يُؤْمِنُواْ } لا ينكشفوا بالإذعان والقبول { حَتَّىٰ يَرَوُاْ ٱلْعَذَابَ } المعد لهم لكفرهم وإصرارهم { ٱلأَلِيمَ } [يونس: 88] المؤلم في غاية الإيلام حين رأوا المؤمنين في سرور دائم ولذة مستمرة وجنة نعيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: اللام في ليُضلوا لام كي\n متعلقة بآتيت محذوفة\n أو بالمذكورة\n ولفظ ربنا تكرار\n أو تكون لام الأمر\n فيكون دعاء عليهم بلفظ الأمر\n بما علم من قرائن أحوالهم أنه لا يكون غيره\n { فلا يؤمنوا }: جواب الدعاء أو عطف على ليضلوا\n يقول الحق جل جلاله: { وقال موسى ربنا إنك آتيت فرعون وملأهُ زينةً }: ما يتزين به من الملابس والمراكب\n ونحوها\n { وأموالاً }: أنواعاً من المال { في الحياة الدنيا } استدراجاً\n { ربنا } آتيتهم ذلك { ليُضلوا عن سبيلك } طغياناً وبطراً بها\n وصرفها في غير محلها\n أو ربنا اجعلهم ضالين في سبيلك\n كقول نوح عليه السلام\n[نوح:24] لما أيس من إيمانهم\n { ربنا اطمسْ على أموالهم } أي: أهلكها وامحقها\n { واشْدُدْ على قلوبهم } بالقسوة\n واطبع عليها حتى لا تنشرح للإيمان\n { فلا يؤمنوا حتى يَرَوا العذابَ الأليم } أي: إن تطمس على أموالهم وتشدد على قلوبهم لا يؤمنوا إلا قهراً\n وفي الآية دليل على جواز الدعاء على الظالم بالمعصية\n أو الكفر\n وقد فعله سعد بن أبي وقاص على الذي شهد فيه بالباطل\n ووجْهُ جوازه مع استلزامه وقوع المعاصي: أنه لم يُعتبر من حيث تاديته إلى المعاصي\n ولكن من حيث تأديته إلى نِكاية الظالم وعقوبته\n وهذا كما قيل في تمني الشهادة أنه مشروع\n وإن كان يؤدي إلى قتل الكافر للمسلم\n وهو معصية ووهن في الدين\n ولكن الغرض من تمنى الشهادة ثوابُها\n لا نفسها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:8",
      "similarity": 0.6224723534269694
    },
    {
      "verse": "36:66",
      "similarity": 0.5910479847359841
    },
    {
      "verse": "54:37",
      "similarity": 0.5226687639492861
    },
    {
      "verse": "4:47",
      "similarity": 0.47522461422748424
    },
    {
      "verse": "43:46",
      "similarity": 0.2404293894392288
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010088.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010088.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:88.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}