{
  "chapter": "يونس",
  "text": "ان الذين ءامنوا۟ وعملوا۟ الصلحت يهديهم ربهم بايمنهم تجرى من تحتهم الانهر فى جنت النعيم",
  "translations": [
    {
      "translation": "But as for those who have iman and do right actions, their Lord will guide them by their iman. Rivers will flow under them in Gardens of Delight.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and act for a beneficial end will be guided by their Lord for their good faith. At their feet shall flow streams of running water in gardens of delight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who believe (in the truths revealed in the Book) and do righteous deeds their Lord will guide them aright because of their faith. Rivers shall flow beneath them in the Gardens of Bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteously striving believers receive, through their faith, guidance from their Lord to the bountiful gardens wherein streams flow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who accepted faith and did good deeds, their Lord will guide them due to their faith; rivers will flow beneath them in the Gardens of favours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe and do deeds of righteousness, their Lord will guide them through their faith; under them will flow rivers in the Gardens of delight (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who believe and do good, their Lord will guide them by their faith; there shall flow from beneath them rivers in gardens of bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who believe, and do deeds of righteousness, their Lord will guide them for their belief; beneath them rivers flowing in gardens of bliss;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who believe and do good works, their Lord guideth them by their faith. Rivers will flow beneath them in the Gardens of Delight,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do good deeds will be guided by their Lord because of their faith. Rivers shall flow at their feet in the Gardens of Bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who believe and do righteous works, their Lord will guide them because of their faith. Beneath them will flow rivers in Gardens of Delight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who have faith and do righteous deeds, their Lord guides them by the means of their faith. Streams will run for them in gardens of bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and work righteousness,- their Lord will guide them because of their faith: beneath them will flow rivers in gardens of bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe [in the Oneness of Allah along with the six articles of Faith, i.e. to believe in Allah, His Angels, His Books, His Messengers, Day of Resurrection, and Al-Qadar (Divine Preordainments) - Islamic Monotheism], and do deeds of righteousness, their Lord will guide them through their Faith; under them will flow rivers in the Gardens of delight (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who believe and do righteous works, their Lord will guide them for their belief, beneath them rivers will flow in gardens of bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good deeds, their Lord guides them in their faith. Rivers will flow beneath them in the Gardens of Bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have believed and done righteous deeds - their Lord will guide them because of their faith. Beneath them rivers will flow in the Gardens of Pleasure\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:9] Truly those who believe and perform righteous deeds, their Lord will guide them, He will lead them, through their faith, in Him, by appointing for them a light with which they will be able to find their way on the Day of Resurrection. Rivers will flow beneath them in the Gardens of Bliss,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who believe) in Muhammad, Allah, bless him and give him peace, and in the Qur'an (and do good works) they do works of obedience, in that which is between them and their Lord, (their Lord guideth them) makes them enter Paradise (by their faith. Rivers) of wine, water, honey and milk (will flow beneath them) beneath their trees and habitations (in the Gardens of Delight),\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته المستمرة من تعقيب الوعيد بالوعد، وبالعكس: { إِنَّ ٱلَّذِينَ آمَنُواْ } بالله وتوحيده { وَعَمِلُواْ ٱلصَّالِحَاتِ } المأمورة من عنده؛ لإصلاح أحوالهم { يَهْدِيهِمْ رَبُّهُمْ } إلى فضاء توحيده { بِإِيمَانِهِمْ } ويقينهم العلمي { تَجْرِي مِن تَحْتِهِمُ ٱلأَنْهَارُ } أي: جداول المعارف والحقائق المنتشئة من بحر التوحيد، من صبغة باليقين العيني والحقي { فِي جَنَّاتِ ٱلنَّعِيمِ } [يونس: 9] أي: هم مخلدون في مستلذاتهم الروحانية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: تجري: جملة استئنافية، أو خبر ثان لإنَّ، أو حال من الضمير المنصوب في { يهديهم }\n ودعواهم: مبتدأ، وسبحانك: مقول للخبر ـ أي: قولهم سبحانك\n والتحية مأخوذة من تمني الحياة والدعاء بها، حياة تحية، ويقال للوجه: مُحيا لوقوع التحية عند رؤيته، وآخر: مبتدأ، وأن الحمد لله: خبر، وأن مخففة\n  يقول الحق جل جلاله: { إن الذين آمنوا وعملوا الصالحات يَهْدِيهمْ ربُّهم } أي: يسددهم { بإيمانهم } بسبب إيمانهم إلى الاستقامة والنظر، أوْ إلى سلوك سبيل يؤدي إلى الجنة، أوْ إلى إدراك الحقائق العرفانية، كما قال ـ عليه الصلاة والسلام\n\n \" مَنْ عَمِلَ بما علِم أَوْرَثه اللهُ علْمَ ما لَمْ يَعْلَمْ \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:14",
      "similarity": 0.7507796282844921
    },
    {
      "verse": "3:136",
      "similarity": 0.7202989425024194
    },
    {
      "verse": "14:23",
      "similarity": 0.6936425152944958
    },
    {
      "verse": "85:11",
      "similarity": 0.6828283728305967
    },
    {
      "verse": "4:122",
      "similarity": 0.5635861527609092
    }
  ]
}