{
  "chapter": "يونس",
  "text": "ولا تكونن من الذين كذبوا۟ بـايت الله فتكون من الخسرين",
  "translations": [
    {
      "translation": "And do not be one of those who deny the signs of God, or you will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or reject the signs of Allah as false, for then you shall be among those who will be in utter loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor be of those who have called God's revelations lies lest you become lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never be of those who denied the signs of Allah, for you will then be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not one of those who belie the Ayat of Allah, for then you shall be one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you should not be of those who reject the communications of Allah, (for) then you should be one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor be of those who cry lies to God's signs so as to be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not thou of those who deny the revelations of Allah, for then wert thou of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "do not be one who rejects God's signs, for then you would become one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not thou of those who belie Allah's signs, lest thou be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be of those who deny the signs of Allah, [for] then you shall be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor be of those who reject the signs of Allah, or thou shalt be of those who perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not one of those who belie the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah, for then you shall be one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be among those who belie the verses of Allah, for then you would be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be of those who deny God’s revelations, lest you become one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never be of those who deny the signs of Allah and [thus] be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:95] And do not be of those who deny God’s signs and so be of the losers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And be not thou of those who deny the revelations of Allah) Allah's Book and Messenger, (for then wert thou of the losers)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعت ما سمعت { وَلاَ تَكُونَنَّ } ألبتة { مِنَ } المسرفين { ٱلَّذِينَ كَذَّبُواْ بِآيَاتِ ٱللَّهِ } الدالة على كمال قدرته ومتانة علمه وحكمته { فَتَكُونَ مِنَ ٱلْخَاسِرِينَ } [يونس: 95] الساقطين عن مرتبة الخلافة، النازلين عن درجة أهل المعرفة والتوحيد\n\n\n\n\nوأمثال هذه الخطابات والعتابات من الله العليم الحيكم لحبيبه الذي ظهر على الخلق العظيم، وتمكن على الصراط المستقيم، إنما هو حث وترغيب للمؤمنين على ملازمة كتاب الله ومحافظة أوامره ونواهيه، وتثبيت لهم في إيماهم وتصديقهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}