{
  "chapter": "يونس",
  "text": "فان كنت فى شك مما انزلنا اليك فسـل الذين يقرءون الكتب من قبلك لقد جاءك الحق من ربك فلا تكونن من الممترين",
  "translations": [
    {
      "translation": "If you are in any doubt about what We have sent down to you, then ask those who were reciting the Book before you. The truth has come to you from your Lord, so on no account be one of the doubters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are in doubt of what We have sent down to you, then ask those who have been reading the Book (for a long time) before you. The truth has indeed come to you from your Lord, so do not be one of those who doubt,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, if you are in doubt concerning what We have revealed to you, then ask those who have been reading the Book before you. It is the truth that has come to you from your Lord, so do never become one of those who doubt,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you (people) have any doubt about what We have revealed to you (about the Day of Judgment and other matters of belief), ask those who read the Book that was revealed (to the Prophets who lived) before you. The truth has certainly come to you from your Lord. Thus, do not doubt it (in your heart),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you, O listener, have any doubt in what We have sent down towards you, then question those who have read the Book before you; undoubtedly, towards you has come the truth from your Lord, therefore do not be of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you are in doubt concerning that which We have revealed unto you, then ask those who are reading the Book before you. Verily, the truth has come to you from your Lord. So be not of those who doubt (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you are in doubt as to what We have revealed to you, ask those who read the Book before you; certainly the truth has come to you from your Lord, therefore you should not be of the disputers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, if thou art in doubt regarding what We have sent down to thee, ask those who recite the Book before thee. The truth has come to thee from thy Lord; so be not of the doubters,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thou (Muhammad) art in doubt concerning that which We reveal unto thee, then question those who read the Scripture (that was) before thee. Verily the Truth from thy Lord hath come unto thee. So be not thou of the waverers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are in any doubt concerning what We have sent down to you, then question those who have read the Book before you: the Truth has come to you from your Lord, so do not be one of the doubters --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thou be in doubt concerning that which We have sent down unto thee, then ask those who have read the Books before thee. Assuredly hath the truth come unto thee from thy Lord, so be not then of the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you are in doubt about what We have sent down to you, ask those who read the Book [revealed] before you. The truth has certainly come to you from your Lord; so do not be among the skeptics.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou wert in doubt as to what We have revealed unto thee, then ask those who have been reading the Book from before thee: the Truth hath indeed come to thee from thy Lord: so be in no wise of those in doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you (O Muhammad SAW) are in doubt concerning that which We have revealed unto you, [i.e. that your name is written in the Taurat (Torah) and the Injeel (Gospel)] then ask those who are reading the Book [the Taurat (Torah) and the Injeel (Gospel)] before you. Verily, the truth has come to you from your Lord. So be not of those who doubt (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are in doubt of what We have sent down to you, ask those who recite the Book before you. The truth has come to you from your Lord, therefore do not be of the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are in doubt about what We revealed to you, ask those who read the Scripture before you. The truth has come to you from your Lord, so do not be of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you are in doubt, [O Muhammad], about that which We have revealed to you, then ask those who have been reading the Scripture before you. The truth has certainly come to you from your Lord, so never be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:94] So, if you, O Muhammad (s), are in doubt concerning what We have revealed to you, of stories — hypothetically speaking — then question those who read the Scripture, the Torah, before you, for it is confirmed [therein] with them and they can inform you of its truth. The Prophet (s) said, ‘I have no doubt, nor will I question’. Verily the Truth from your Lord has come to you; so do not be of the waverers, [of] those who have doubts about it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if thou) Muhammad (art in doubt concerning that which We reveal unto thee) concerning that with which We sent Gabriel, i.e. the Qur'an, (then question those who read the Scripture) i.e. the Torah ((that was) before you) 'Abdullah Ibn Salam and his followers. The Prophet (pbuh) did not ask nor was he ever in doubt about the Qur'an. Rather, Allah was addressing with these words the people of the Prophet. (Verily the Truth from thy Lord) i.e. Gabriel with the Qur'an from your Lord, containing the events of past nations (hath come unto thee) Muhammad. (So be not thou of the waverers) be not of the doubters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن كُنتَ } يا أكمل الرسل { فِي شَكٍّ } وريب { مِّمَّآ أَنزَلْنَآ إِلَيْكَ } في كتابك من قصصهم وأخبارهم { فَاسْأَلِ ٱلَّذِينَ يَقْرَءُونَ ٱلْكِتَابَ مِن قَبْلِكَ } وارجع إليهم لإزالة شكك وحل شبتهك\n وتفحص عنهم حتى تنكشف لك ويتحقق عندك { لَقَدْ جَآءَكَ ٱلْحَقُّ مِن } عند { رَّبِّكَ } الصريح المطابق للواقع { فَلاَ تَكُونَنَّ } فيه { مِنَ ٱلْمُمْتَرِينَ } [يونس: 94] إذ ليس هذا محلاً للشك والارتياب\n إذ\n\n[فصلت: 42] لأنه تنزيل من حكيم عليم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { فإن كنتَ } يا محمد { في شكٍ مما أنزلنا إليك فاسألِ الذين يقرؤون من قَبلِكَ } الخطاب للرسول صلى الله عليه وسلم\n والمراد به: من وقع له شك\n فإن الملك إذا إراد أن يُعرض بأحد خاطب كبير القوم وهو يريد غيره\n فهو كقول العامة: الكلام مع السارية وافهمي يا جارية\n وأما النبي صلى الله عليه وسلم فهو بعيد من الشك لأنه عين اليقين\n وهو الذي علَّم الناس اليقين\n ولذلك قال ـ عليه الصلاة والسلام ـ لما نزلت\n \" لا أشُكُ وَلاَ أَسأَل \" \nوالمراد بالذين يقرؤون الكتاب: من أسلم منهم\n كعبد الله بن سلام وغيره\n أو فإن كنت أيها المستمع في شك مما أنزلنا إليك على لسان فاسأل\n\n\n الخ\n وفيه تنبيه على أن من خالجته شبهة في الدين ينبغي أن يسارع إلى حلها\n بالرجوع إلى أهل اليقين إن كانت في التوحيد\n أو إلى أهل العلم إن كانت في الفروع\n قال ابن عطية: الخواطر التي لا ينجو منها أحد\n هي خلاف الشك الذي يحال فيه على الاستشفاء بالسؤال\n هـ\n أي: فإنها معفوّ عنها\n ثم قال تعالى: { لقد جاءك الحقُّ من ربك } واضحاً لا مدخل للمرية فيه بالآيات القاطعة { فلا تكوننَّ من الممتَرين }: الشاكِّين بالتزلزل على ما أنت عليه من الجزم واليقين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:147",
      "similarity": 0.5443163730732677
    },
    {
      "verse": "3:60",
      "similarity": 0.5121256145586728
    },
    {
      "verse": "38:8",
      "similarity": 0.4956280857115527
    },
    {
      "verse": "6:114",
      "similarity": 0.4929333992578511
    },
    {
      "verse": "15:63",
      "similarity": 0.48149618299277125
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010094.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010094.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:94.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}