{
  "chapter": "يونس",
  "text": "فلولا كانت قرية ءامنت فنفعها ايمنها الا قوم يونس لما ءامنوا۟ كشفنا عنهم عذاب الخزى فى الحيوة الدنيا ومتعنهم الى حين",
  "translations": [
    {
      "translation": "How is it that there has never been a city that had iman, whose iman then brought it benefit, except the people of Yunus? When they had iman We removed from them the punishment of disgrace in the life of this world and We let them have enjoyment for a time.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why has there been no habitation that believed and profited by their faith, except the people of Jonah? When they came to believe, We removed from them the affliction of shame in the world, and made them prosperous for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did it ever happen that the people of a town believed on seeing God's chastisement and its believing profited them? (There is no such instance) except of the people of Yunus. When they believed We granted them reprieve from humiliating chastisement in this world, and We let them enjoy themselves for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did no one except the people of Jonah believe (in their punishment before their death) so that they could have benefitted from their faith? When the people of Jonah believed, We saved them from a disgraceful torment in this life and provided them with the means of enjoyment for an appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if only had there been one dwelling* that believed and its belief would have benefited it – except the nation of Yunus (Jonah)! When they accepted faith, We removed the disgraceful punishment in the life of this world from them, and let them enjoy for a while. (* That was destroyed after being warned.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Was there any town (community) that believed (after seeing the punishment), and its faith (at that moment) saved it (from the punishment)-- except the people of Yunus; when they believed, We removed from them the torment of disgrace in the life of the (present) world, and permitted them to enjoy for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wherefore was there not a town which should believe so that their belief should have profited them but the people of Yunus? When they believed, We removed from them the chastisement of disgrace in this world's life and We gave them provision till a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why was there never a city that believed, and its belief profited it? -- Except the people of Jonah; when they believed, We removed from them the chastisement of degradation in this present life, and We gave unto them enjoyment for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only there had been a community (of all those that were destroyed of old) that believed and profited by its belief as did the folk of Jonah! When they believed We drew off from them the torment of disgrace in the life of the world and gave them comfort for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why was there no other people, save the people of Jonah, who should have believed so that their belief would have benefited them. Once they believed, We lifted the torment of shame from them during their worldly life and let them enjoy Our provision for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why then was there not a township which believed, so that its faith might have profited it, except the people of Yunus! When they believed, We removed from them the torment of humiliation in the life of the world, and We let them enjoy for a season.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why has there not been any town that might believe, so that its belief might benefit it, except the people of Jonah? When they believed, We removed from them the punishment of disgrace in the life of this world, and We provided for them for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why was there not a single township (among those We warned), which believed,- so its faith should have profited it,- except the people of Jonah? When they believed, We removed from them the penalty of ignominy in the life of the present, and permitted them to enjoy (their life) for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Was there any town (community) that believed (after seeing the punishment), and its Faith (at that moment) saved it (from the punishment)? (The answer is none,) - except the people of Yunus (Jonah); when they believed, We removed from them the torment of disgrace in the life of the (present) world, and permitted them to enjoy for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, was there never a village that believed and its belief benefited them? Except Jonah's nation, when they believed, We spared them from a degrading punishment in this life and We gave them enjoyment for awhile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only there was one town that believed and benefited by its belief. Except for the people of Jonah. When they believed, We removed from them the suffering of disgrace in the worldly life, and We gave them comfort for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then has there not been a [single] city that believed so its faith benefited it except the people of Jonah? When they believed, We removed from them the punishment of disgrace in worldly life and gave them enjoyment for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:98] If only there had been one town — meaning its inhabitants — that believed, before chastisement befell it, and profited by its belief — except for the people of Jonah: when they believed, after seeing a portent of the chastisement, for they did not wait [to believe] until it came to pass, We removed from upon them the chastisement of degradation in the life of this world and We gave them comfort for a while, until the conclusion of their terms [of life].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالفاء لتفريع التغليط على امتناع أهل القرى من الإيمان بالرسل قبل أن ينزل بهم العذاب على الإخبار بأن الذين حقت عليهم كلمة الله أن لا يؤمنوا لا يؤمنون حتى يروا العذاب فإن أهل القرى من جملة الذين حقت عليهم الكلمة بأن لا يؤمنوا . والغرض من ذكر أهل القرى التعريض بالمقصود ، وهم أهل مكة فإنهم أهل قرية فكان ذلك كالتخلص بالتعريض إلى المخصوصين به ، وللإفضاء به إلى ذكر قوم يونس فإنهم أهل قرية .و ( لولا ) حرف يرد لمعان منها التوبيخ ، وهو هنا مستعمل في لازم التوبيخ كناية عن التغليط ، لأن أهل القرى قد انقضوا ، وذلك أن أصل معنى ( لولا ) التحضيض ، وهو طلب الفعل بحَثّ ، فإذا دخلت على فعل قد فات وقوعه كانت مستعملة في التغليط والتنديم والتوبيخ على تفويته ، ويكون ما بعدها في هذا الاستعمال فعل مضي مثل قوله تعالى : { ولَولا إذ سمعتموه قلتم ما يكون لنا أن نتكلم بهذا } \\[ النور : 16 \\]. وإذا توجه الكلام الذي فيه ( لولا ) إلى غير صاحب الفعل الذي دخلت عليه كانت مستعملة في التعجيب من حال المتحدث عنه ، كقوله : { لولا جاءوا عليه بأربعة شهداء } \\[ النور : 13 \\] وقوله : { فلولا إذ جاءهم بأسنا تضرعوا } \\[ الأنعام : 43 \\] وهذه الآية أصرح في ذلك لوجود ( كان ) الدالة على المضي والانقضاء . والمقصود : التعريض بأن مشركي أهل مكة يوشك أن يكونوا على سنَن أهل القرى . قال تعالى : { ما آمنتْ قبلهم من قرية أهلكناها أفَهُم يؤمنون } \\[ الأنبياء : 6 \\] ، ونظير هذه الآية استعمالاً ومعنى قوله تعالى : { فلولا كان من القرون من قبلكم أولُوا بقيّة ينهون عن الفساد في الأرض إلا قليلاً ممن أنجينا منهم } \\[ هود : 116 \\] ، وذلك تعريض بتحريض أهل مكة على الإيمان قبل نزول العذاب .والمستخلص من الروايات الواردة في قوم يونس أنهم بادروا إلى الإيمان بعد أن فارقهم يونس ، توقعاً لنزول العذاب ، وقبل أن ينزل بهم العذاب ، وذلك دليل على أن معاملة الله إياهم ليست مخالفة لما عامل به غيرهم من أهل القرى ، وأن ليست لقوم يونس خصوصية ، وبذلك لا يكون استثنائهم استثناءاً منقطعاً .وإذ كان الكلام تغليطاً لأهل القرى المعرضين عن دعوة الرسل ، وتعريضاً بالتحذير مما وقعوا فيه . كان الكلام إثباتاً صريحاً ووقوع قرية وهو نكرة في مساق الإثبات أفاد العموم بقرينة السياق مثل قول الحريري : «يا أهل ذا المغْنَى وقيتم ضُراً» أي كل ضر لا ضراً معيناً ، وبقرينة الاستثناء فإنه معيار العموم ، وهذا الاستثناء من كلام موجب فلذلك انتصب قوله : { إلا قومَ يونس } فهذا وجه تفسير الآية . وجرى عليه كلام العُكبري في «إعراب القرآن» ، والكواشي في «التخليص» وجمهور المفسرين جعلوا جملة : { فلولا كانت قرية آمنت } في قوة المنفية ، وجعلوا الاستثناء منقطعاً منصوباً ولا داعي إلى ذلك .وجملة : { لمّا آمنوا } مستأنفة لتفصيل مجمَل معنى الاستثناء . وفي الآية إيماء إلى أن أهل مكة يعاملهم الله معاملة قوم يونس إذ آمنوا عند رؤية العذاب . وذلك حالهم عندما تسامعوا بقدوم جيش غزوة الفتح الذي لا قبل لهم به عدة وعُدة ، فيكاد يحل بهم عذاب استئصال لولا أنهم عجّلوا بالإيمان يوم الفتح . فقال لهم النبي صلى الله عليه وسلم « أنتُم الطلقاء »وقوم يونس هم أهل قرية نَيْنَوَى من بلاد العراق . وهم خليط من الأشوريين واليهود الذين كانوا في أسر ملوك بابل بعد بختنصر . وكانت بعثة يونس إليهم في أول القرى الثامن قبل المسيح . وقد تقدم ذكر يونس وترجمته في سورة الأنعام .ولما كذّبه أهل نَيْنَوَى توعدهم بخسف مدينتهم بعد أربعين يوماً ، وخرج من المدينة غاضباً عليهم ، فلمّا خرج خافوا نزول العذاب بهم فتابوا وآمنوا بالله فقبل الله إيمانهم ولم يعذّبهم . والمذكور أنهم رأوا غيماً أسود بعد مضي خمسة وثلاثين يوماً من حين توعدهم يونس عليه السلام بحلول العذاب فعلموا أنه مقدمة العذاب فآمنوا وخضعوا لله تعالى فأمسك عنهم العذاب . وسيجيء ذكر ما حل بيونس عليه السلام في خروجه ذلك من ابتلاع الحوت إياه في سورة الأنبياء .والكشف : إزالة ما هو ساتر لشيء ، وهو هنا مجاز في الرفع . والمراد : تقدير الرفع وإبطال العذاب قبل وقوعه فعبر عنه بالكشف تنزيلاً لمقاربة الوقوع منزلة الوقوع .والخزي : الإهانة والذل . وإضافة العذاب إلى الخزي يجوز كونها بيانية لأن العذاب كله خزي ، إذ هو حالة من الهلاك غير معتادة فإذا قدرها الله لقوم فقد أراد إذلالهم ، ويجوز أن تكون الإضافة حقيقية للتخصيص ، ويكون المراد من الخزي الحالة المتصورة من حلوله . وهي شناعة الحالة لمن يشاهدهم مثل الخسف والحرق والغرق ، وأشنع الخزي ما كان بأيدي أناس مثلهم ، وهو عذاب السيف الذي حل بصناديد قريش يوم بدر ، والذي كاد أن يحل بجميع قريش يوم فتح مكة فنجاهم الله منه كما نجّى قوم يونس .و { في الحياة الدنيا } صفة ل { عذاب الخزي } للإشارة إلى أن العذاب الذي يحل بالأمم الكافرة هو عقاب في الدنيا وبعده عقاب في الآخرة ، وأن الأمم التي لم تعذب في الدنيا قد أدخر لها عذاب الآخرة .والتمتيع : الإمهال .وإبهام { حين } لأنه مختلف باختلاف آجال أحادهم ، والمراد به التمتيع بالحياة لا بكشف العذاب ، لأنهم بعد موتهم ناجون من العذاب إذ كانوا قد آمنوا وأخلصوا .ولعل الحكمة في نجاة قوم يونس تتمثل في أمرين :أحدهما : أن الله علم أن تكذيبهم يونس عليه السلام في ابتداء دعوته لم يكن ناشئاً عن تصميم على الكفر واستخفاف بعظمة الله ، ولكنه كان شكاً في صدق يونس عليه السّلام . ولعل ذلك أنهم كانوا على بقية من شريعة موسى عليه السّلام وإنما حرّفوا وحادوا عن طريق الإيمان مما يعلمه الله ، فإن في نَيْنَوَى كثيراً من أسرى بني إسرائيل الذين كانوا في أسر الأشوريين كما علمت آنفاً ، فلما أوعدهم يونس عليه السّلام بالعذاب بعد أربعين يوماً ورأوا أماراته بعد خمسة وثلاثين يوماً اهتدَوا وآمنوا إيماناً خالصاً .وثانيهما : أن يونس عليه السّلام لمّا صدرت منه فلتة المغاضبة كان قد خلط في دعوته شيئاً من حظ النفس وإن كان لفائدة الدين ، فقدر الله إيمان قومه لعلمه كمال الإيمان والصبر والتسليم لله ، وهذا عتاب وتأديب بينه وبين ربه ، ولذلك حذّر رسول الله صلى الله عليه وسلم الأمةَ من توهم أنّ ما جرى ليونس عليه السّلام من المغاضبة والمعاقبة ينقص من قدره فقال صلى الله عليه وسلم « لا ينبغي لأحد أن يقول أنَا خير من يونس بن متّى » يعني في صحة الرسالة لا في التفاضل فيها .وقد كان حال أهل مكة كحال قوم يونس إذ بادروا إلى الإيمان بمجرد دخول جيش الفتح مكة وقبل أن يقعُوا في قبضة الأسر ، ولذلك لم ينج منهم عبدُ الله بن خطل ، لأنه لم يأت مُؤمناً قبل أن يتمكن منه المسلمون ولم ينفعه التعلق بأستار الكعبة لأن ذلك التعلق ليس بإيمان وإنما هو من شعار العوذ في الجاهلية بما أبطله الإسلام إذ قال النبي صلى الله عليه وسلم « إن الحرم لا يعيذ عاصياً » وقد بيّنّا في آخر سورة غافر ( 84 ) عند قوله تعالى : { فلمّا رأوا بأسنا قالوا آمنا بالله وحده } إلى آخر السورة فانظره .\n\n",
      "translations": [
        {
          "translation": "(If only there had been a community (of all those that were destroyed of old) that believed) if only the people of a township believed when the punishment befell them (and profited by its belief) He says: their faith did not benefit them upon the descent of punishment (as did the folk of Jonah) except the folk of Jonah who benefited from their belief. (When they believed We drew off) We diverted (from them the torment of disgrace) the severe punishment (in the life of the world and gave them comfort for a while) We left them without punishment until they died.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَوْلاَ } أي: فهلا { كَانَتْ قَرْيَةٌ } من القرى التي أُهلكوا بظلمهم { آمَنَتْ } حين حلول العذاب عليهم\n وظهر أماراته كما آمن فرعون حين غشية اليم { فَنَفَعَهَآ } في تلك الحالة { إِيمَانُهَا } ونُحي به عن العذاب { إِلاَّ قَوْمَ يُونُسَ لَمَّآ آمَنُواْ } حين ظهر عليهم أمارات العذاب ولاح علامات الغضب الإلهي\n وأخلصوا لله مخبتين خاضعين { كَشَفْنَا عَنْهُمْ عَذَابَ ٱلخِزْيِ } الذي يفتضحون به { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } لو لم نكشف { وَ } بعدما كشفنا العذاب عنهم { مَتَّعْنَاهُمْ } بأنواع التمتع مترفهين { إِلَىٰ حِينٍ } [يونس: 98] أي: حين حلول الأجل\n\n\nوذلك أنه لما بعث يونس إلى \" نينوى \" قرية من قرى الموصل\n كذبوه واستهزءوا به فوعدهم العذاب بعد ثلاث أو أربعين\n فلما قرب الموعد خرج من الأفق سحاب غليظ وغيم أسود ودخان شديد\n فغشي قريتهم\n فهابوا هيبة عظيمة\n فطلبوا يونس فلم يجدوه فأيقنوا صدقه وهموا إلى الإنابة والتضرع\n فلبسوا المسوح وخرجوا إلى الصحراء بأنفسهم ونسائهم وصبيانهم ودوابهم\n وفرَّقوا بين كل والدة وولدها\n وحنَّ بعضها إلى بعض فصرخوا\n وتضرعوا إلى حيث علت الأصوات والضجيج\n وأظهروا الندامة وأخلصوا التوبة\n فرحمهم الله وكشف عنهم\n وكان يوم عاشوراء\n يوم الجمعة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: فلولا: تحضيضية، وإلا قوم يونس: استثناء منقطع، ويجوز الاتصال فيكون الاستثناء من معنى النفي الذي تضمَّنَهُ حرف التحضيض لأن المراد بالقُرى: أهلها، كأنه قال: ما آمن أهل قرية من القرى الماضية فنفعها إيمانها إلا قوم يونس، ويؤيده قراءةُ الرفع. و \" يونس \": عجمي مثلث النون. يقول الحق جل جلاله: { فلولا كانت } هلاَّ وُجدت: { قريةٌ } من القرى التي أهلكناها { آمنتْ } قبل معاينة العذاب، ولم تؤخر الإيمان إلى نزوله كما فعل فرعون، { فَنَفَعَها } حينئذٍ { إيمانُها } بأن يقبله الله منها فيكشف عنها العذاب، { إِلا } لكن { قومَ يونسَ لما آمنوا كشفنا عنهم عذابَ الخزي في الحياة الدنيا } ، فرفعنا عنهم العذاب حين آمنوا بعد أن ظهرت مخايله، فنجوا { ومتعناهم إلى حين }: إلى تمام آجالهم. رُوي أن يونس عليه السلام بُعث إلى أهل نينوى من الموصل، فكذبوه وأصروا على تكذيبه، فوعدهم بالعذاب إلى ثلاث، فلما دنا الموعد وأغامت السماء غيماً أسود ذا دخان شديد فهبط حتى غشي مدينتهم، فهابوا، فطلبوا يونس فلم يجدوا فأيقنوا صدقه، فلبسوا المُسوح وبرزوا إلى الصعيد بأنفسهم ونسائهم وصبيانهم، ودوابهم، وفرقوا بين كل والدة وولدها، فحن بعضها إلى بعض وعلت الأصوات والضجيج، وأخلصوا التوبة والإيمان، وتضرعوا إلى الله تعالى، فرحمهم وكشف العذاب عنهم، وكان يوم عاشوراء ويوم الجمعة. والله تعالى أعلم. الإشارة: ينبغي للعبد أن يعتني بتربية إيمانه وتقوية إيقانه قبل فوات إبّانه، وهو انصرام أجله. وتربيته تكون بصحبة أهل اليقين، فإن لم يعثر بهم فبمطالعة كتبهم، والوقوف على أخبارهم ومناقبهم، مع دوام التفكر والاعتبار، والإكثار من الطاعة والخضوع والافتقار، والتمسك بالذل والانكسار، قال تعالى في بعض الأخبار:\n \" أنا عند المنكسرة قلوبُهم من أَجلِي \" \nوبالله التوفيق. كما أشار إلى ذلك بقوله: { وَلَوْ شَآءَ رَبُّكَ لآمَنَ مَن فِي ٱلأَرْضِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:139",
      "similarity": 0.6877733962529351
    },
    {
      "verse": "6:86",
      "similarity": 0.36805505921828807
    },
    {
      "verse": "4:163",
      "similarity": 0.28600152422409414
    },
    {
      "verse": "39:26",
      "similarity": 0.21407241945387312
    },
    {
      "verse": "44:12",
      "similarity": 0.2138178665250258
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010098.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010098.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:98.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}