{
  "chapter": "يونس",
  "text": "ولو شاء ربك لءامن من فى الارض كلهم جميعا افانت تكره الناس حتى يكونوا۟ مؤمنين",
  "translations": [
    {
      "translation": "If your Lord had willed, all the people on the earth would have come to believe, one and all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord so willed, all those who are on the earth would have believed. Will you, then, force people into believing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord wished, the whole of mankind would have believed in Him. (Muhammad), do you force people to have faith?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord willed, all those who are in the earth – everyone of them – would have accepted faith; so will you (O dear Prophet Mohammed – peace and blessings be upon him) force the people until they become Muslims?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had your Lord willed, those on earth would have believed, all of them together. So, will you then compel mankind, until they become believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord had pleased, surely all those who are in the earth would have believed, all of them; will you then force men till they become believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thy Lord had willed, whoever is in the earth would have believed, all of them, all together. Wouldst thou then constrain the people, until they are believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thy Lord willed, all who are in the earth would have believed together. Wouldst thou (Muhammad) compel men until they are believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord pleased, all the people on earth would have believed in Him, without exception. So will you compel people to become believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had thy Lord willed, those who are on the earth would have believed, all of them, together; canst thou then compel mankind until they become believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord wished, all those who are on earth would have believed. Would you then force people until they become faithful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If it had been thy Lord's will, they would all have believed,- all who are on earth! wilt thou then compel mankind, against their will, to believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had your Lord willed, those on earth would have believed, all of them together. So, will you (O Muhammad SAW) then compel mankind, until they become believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord willed, whosoever is in the earth, all would have believed. Would you then constrain people until they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord willed, everyone on earth would have believed. Will you compel people to become believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had your Lord willed, those on earth would have believed - all of them entirely. Then, [O Muhammad], would you compel the people in order that they become believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:99] And if your Lord willed, all who are in the earth would have believed together. Would you then compel people, to do what God did not will that they do, until they are believers? No!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if thy Lord willed) O Muhammad, (all who are in the earth would have believed together) all the disbelievers would have believed. (Wouldst thou (Muhammad) compel men) would you coerce people (until they are believers) to become believers?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لا تستبعد يا أكمل الرسل أمثال هذه الألطاف من الله الغفور الرحيم { لَوْ شَآءَ رَبُّكَ } وتعلق إرادته بالإيمان من على الأرض { لآمَنَ مَن فِي ٱلأَرْضِ كُلُّهُمْ } بحيث لم يبق على وجه الأرض كافر أصلاً بل يؤمنهم { جَمِيعاً } مجتمعين بلا اختلاف وتفرقة، لكن قضية الحكمة تقتضي الاختلاف والافتراق، والكفر والإيمان، والحق والباطل، والهداية والضلال؛ ليظهر سر التكليفات والتحميلات الواردة من الله على ألسنة رسله وسر المجازاة في النشأةالأخرى، وحكمة خلق الجنة والنار وجميع الأمور الأخروية ومتى جرت حكمة الله على هذا { أَفَأَنتَ } يا أكمل الرسل من كمال حرصك على تكثير المؤمنين { تُكْرِهُ ٱلنَّاسَ } وتلجئهم إلى الإيمان { حَتَّىٰ يَكُونُواْ مُؤْمِنِينَ } [يونس: 99] جميعاً، مع أن بعضهم مجبولون على الكفر، ولم يتعلق إرادة الله ومشيئته بإيمانهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ولو شاء ربُّك } هداية الخلق كلهم { لآمن من في الأرض كلُّهُم جميعاً } بحيث لا يتخلف عنه أحد، لكن حكمته اقتضت وجود الخلاف، فمن رام اتفاقهم على الإيمان فقد رام المحال، ولذلك قال: { أفأنت تُكرهُ الناسَ } بالقهر على ما لم يشأ الله منهم { حتى يكونوا مؤمنين } كلهم",
      "translations": []
    }
  ]
}