{
  "chapter": "يونس",
  "text": "فاليوم ننجيك ببدنك لتكون لمن خلفك ءاية وان كثيرا من الناس عن ءايتنا لغفلون",
  "translations": [
    {
      "translation": "Today We will preserve your body so you can be a Sign for people who come after you. Surely many people are heedless of Our Signs.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall preserve your body today that you may be a lesson for those who come after you; as many a man is heedless of Our signs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall now save your corpse that you may serve as a sign of warning for all posterity, although many men are heedless of Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will save your body on this day so that you may become evidence (of Our existence) for the coming generations; many people are unaware of such evidence.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This day We shall salvage your body so that you may be a sign for those after you; and indeed most people are neglectful of Our signs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day We shall deliver your (dead) body (out from the sea) that you may be a sign to those who come after you! And verily, many among mankind are heedless of Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We will this day deliver you with your body that you may be a sign to those after you, and most surely the majority of the people are heedless to Our communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today We shall deliver thee with thy body, that thou mayest be a sign to those after thee. Surely many men are heedless of Our signs.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But this day We save thee in thy body that thou mayst be a portent for those after thee. Lo! most of mankind are heedless of Our portents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We shall save your body this day, so that you may serve as a sign for those who come after you: for many people are indeed heedless of Our signs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day We deliver thee in thy body that thou mayest be a sign unto those after thee, and verily many of mankind are of our signs neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today We shall deliver your body so that you may be a sign for those who come after you.’ Indeed many of the people are oblivious to Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This day shall We save thee in the body, that thou mayest be a sign to those who come after thee! but verily, many among mankind are heedless of Our Signs!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day We shall deliver your (dead) body (out from the sea) that you may be a sign to those who come after you! And verily, many among mankind are heedless of Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall deliver you (Ramsis II) with your body this day, so that you may be a sign to those after you. Indeed many people pay no heed to Our signs!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today We will preserve your body, so that you become a sign for those after you. But most people are heedless of Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today We will save you in body that you may be to those who succeed you a sign. And indeed, many among the people, of Our signs, are heedless\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:92] But this day We shall save you, We shall bring you out of the sea, in your body, your lifeless corpse, that you may be, for those after you a sign, a lesson, that they might come to know your servitude and not venture upon deeds like yours. According to Ibn ‘Abbās, some of the Children of Israel doubted his death and so he was brought out [of the sea] for them to see. And truly most people, that is, the people of Mecca, are heedless of Our signs’, not learning the lesson therefrom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوالفاء التي في قوله : { فاليوم } فاء الفصيحة ، تفصح عن شرط مقدر في الكلام يدل عليه السياق . والمعنى : فإن رمتَ بإيمانك بعد فوات وقته أن أُنجيك من الغرق فاليوم ننجيك ببدنك ، والكلام جار مجرى التهكم ، فإطلاق الإنجاء على إخراجه من البحر استعارة تهكمية .وليس مسوغها التهكم المحض كما هو الغالب في نوعها ، بل فيها علاقة المشابهة ، لأن إخراجه إلى البر كاملاً بشكّته يشبه الإنجاء ، ولكنه ضد الإنجاء ، فكان بالمشابهة ، استعارة ، وبالضدية تهكماً ، والمجرور في قوله : { ببدنك } حال .والأظهر أن الباء من قوله : { ببدنك } مزيدة للتأكيد ، أي تأكيد آية إنجاء الجسد ، فيكون قوله : ( بدنك ) في معنى البدل المطابق من الكاف في { ننجيك } كزيادة الباء في قول الحريري : «فإذا هو أبو زيد بعينه ومَينه» .والبدَن : الجسم بدون روح وهذا احتراس من أن يظن المراد الإنجاء من الغرق . والمعنى : ننجيك وأنت جسم . كما يقال : دخلت عليه فإذا هو جثة ، لأنه لو لم يكن المقصود الاقتصار على تلك الحالة لما كان داع للبليغ أن يزيد ذلك القيد ، فإن كل زيادة في كلام البليغ يقصد منها معنى زائد ، وإلا لكانت حشوا في الكلام والكلام البليغ موزون ، ولغة العرب مبنية على أساس الإيجاز .و { لمن خلفك } أي من وراءك . والوراء : هنا مستعمل في معنى المتأخر والباقي ، أي من ليسوا معك . والمراد بهم من يخلفه من الفراعنة ومن معهم من الكهنة والوزراء ، أي لتكون ذاته آية على أن الله غالب من أشركوا به ، وأن الله أعظم وأقهر من فرعون وآلهته في اعتقاد القبط ، إذ يرون فرعون الإله عندهم طريحاً على شاطيء البحر غريقاً . فتلك ميتة لا يستطيعون معها الدجل بأنه رفع إلى السماء ، أو أنه لم يزل يتابع بني إسرائيل ، أو نحو ذلك من التكاذيب لأنهم كانوا يزعمون أن فرعون لا يُغلب ، وأن الفراعنة حين يموتون إنما ينقلون إلى دار الخلود . ولذلك كانوا يموّهون على الناس فيبنون له البيوت في الأهرام ويودعون بها لباسه وطعامه ورياشه وأنفَس الأشياء عنده ، فموته بالغرق وهو يُتبع أعداءه ميتَة لا تُوَوّلُ بشيء من ذلك ، فلذلك جعل كونه آية لمن خلفه علة لإخراجه من غمرة الماء ميتاً كاملاً ، فهم مضطرون إلى الاعتراف بأنه غرق إذا نظروا في تلك الآية .ولم يعدم فرعون فائدة من إيمانه ، فإن الله بحكمته قدر له الخروج من غمرات الماء ، فلم يبق في الماء أكلة للحيتان ولكن لفظته الأمواج ، وتلك حالة أقل خزياً من حالات سائر جيشه بها ظهر نفع ما له بما حصل لنفسه من الإيمان في آخر أحواله .وكلمة { فاليوم } مستعملة في معنى ( الآن ) لأن اسم اليوم أطلق على جزء من زمن الحال مجازاً بعلاقة الكلية والجزئية .وجملة : { وإنْ كثيراً من النّاس عن آياتنا لغافلون } تذييل لموعظة المشركين ، والواو اعتراضية ، أو واو الحال .والمراد منه : دفع توهم النقص عن آيات الله عندما يحرم كثير من الناس الاهتداء بها ، فهي في ذاتها دلائل هدى سواء انتفع بها بعض الناس أم لم ينتفعوا فالتقصير منهم .واعلم أن هذه الآية أصرح آية في القرآن دلالةً على أن فرعون الذي أرسل إليه موسى والذي أتبع بني إسرائيل بعد خروجهم من مصر قد أصابه الغرق . وقد أشارت إليه آية سورة الأعراف وآية سورة البقرة .وفرعون هذا هو منفطاح الثاني ، ويقال له ( مَيْرنْبَتَا ) بياء فارسية أو ( منفتاح ) ، أو ( منيفتا ) وهو ابن رعمسيس الثاني المعروف عند اليونان باسم ( سَيْزُوسْتريس ) ، من ملوك العائلة التاسعة عشرة من الأسر الفرعونية ، وكانوا في حدود سنة1491 قبل المسيح .قال ابن جُريج : كان فرعون هذا قصيراً أحمر فلا نشك في أن منفطاح الثاني مات غريقاً في البحر ، وأنه خرجت جثته بعد الغرق فدُفن في وادي الملوك في صعيد مصر . فذكر المنقبون عن الآثار أنه وجد قبرُه هناك ، وذلك يومىء إلى قوله تعالى : { فاليومَ نُنَجّيك ببدنك لتكونَ لمن خلفك آية }. ووجود قبر له إن صح بوجه محقق ، لا ينافي أن يكون مات غريقاً ، وإن كان مؤرخو القبط لم يتعرضوا لصفة موته ، وما ذلك إلا لأن الكهنة أجمعوا على إخفائها كيلا يتطرق الشك إلى الأمة فيما يمجد به الكهنة كل فرعون من صفات بنوة الآلهة .وخلفتْه في ملك مصر ابنته المسماة ( طوسير ) لأنه تركها وابناً صغيراً .وقد جاء ذكر غرق فرعون في التوراة في الإصحاح الرابع عشر من سفر الخروج بعبارات مختلفة الصراحة والإغلاق .ومن دقائق القرآن قوله تعالى : { فاليوم نُنجيك ببدنك لتكون لمن خلفك آية } وهي عبارة لم يأت مثلها فيما كتب من أخبار فرعون ، وإنها لمن الإعجاز العلمي في القرآن إذ كانت الآية منطبقة على الواقع التاريخي . والظاهر أن الأمواج ألْقَت جثّته على الساحل الغربي من البحر الأحمر فعثر عليه الذين خرجوا يتقصون آثاره ممن بقُوا بعده بمدينة مصر لما استبطأوا رجوعه ورجوع جيشه ، فرفعوه إلى المدينة وكان عبرة لهم .\n\n",
      "translations": [
        {
          "translation": "(But this day We save thee in your body) We save your cadaver in its armour (that thou mayst be a portent) 223 that you may be a lesson, such that they do not claim what you claimed and know that you are not a god (for those after thee) among the disbelievers. (Lo! most of mankind) i.e. the disbelievers (are heedless of) are deniers of (Our portents) Our Scripture and Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱلْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ } معناهُ نُلقِيكَ عَلَى نَجْوةٍ وهي الإِرتفاعُ مِن الأَرضِ\n والبَدنُ كَانَ يَلبَسهُ فِرعَونُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying: {So today We will save you in your body} means that We will raise you up to a high place, which is the height from the earth.\n\n\nThe body was clothed in Pharaoh's finery.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱلْيَوْمَ } لا ينفعك إيمانك { نُنَجِّيكَ } نخرجك من البحر { بِبَدَنِكَ } بلا روح ونسقطك على الساحل عرياناً { لِتَكُونَ لِمَنْ خَلْفَكَ } من المتجبرين المتكبرين { آيَةً } زاجرة وعبرة رادعة عن العتو والعناد\n صارفة عن الجور والفساد { وَإِنَّ كَثِيراً مِّنَ ٱلنَّاسِ } الناسين عهودنا وميثاقنا الذي عهدنا معهم في لوح قضائنا { عَنْ آيَاتِنَا } الدالة على أخذنا وانتقامنا { لَغَافِلُونَ } [يونس: 92] مثلك أيها الطاغي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاليوم نُنَجِّيك } أي: ننقذك مما وقع فيه قومك من قعر البحر\n ونجعلك طافياً على وجه الماء\n أو نلقيك على نجوة من الأرض ليراك الناس\n فيتحققوا بغرق من معك حال كونك { ببدنك } عارياً عن الروح\n أو عرياناً بلا لباس\n أو بدرعك\n وكانت له دُروع من ذهب يعرف بها\n وكان مظاهراً بينها\n { لتكونَ لمنَ خَلْفِكَ آيةً }: لمن وراءك علامة يعرفون أنك من الهالكين\n والمراد: بنو إسرائيل إذ كان نفوسهم من عظمته ما خيّل إليهم أنه لا يهلك حتى كذبوا موسى عليه السلام حين أخبرهم بغرقه\n إلى أن عاينوه منطرحاً على ممرهم من الساحل\n أو لمن يأتي بعدك من القرون إذا سمعوا مآل امرك\n فيكون ذلك عبرة ونكالاً للطغْيان\n أوْ حجة تدلهم على أن الإنسان على ما كان عليه من عظيم الشأن وكبرياء الملك مملوك مقهور\n بعيد عن مظانِّ الربوبية\n أو آية تدل على كمال قدرته وإحاطة علمه وحكمته\n فإن إفراده بالإلقاء إلى الساحل دون غيره يفيد أنه مقصود لإزاحة الشك في أمره\n { وإن كثيراً من الناس عن آياتنا لغافلون } لا يتفكرون فيها ولا يعتبرون بها\n والإخبار بهذا الأخذ الذي وقع في قعر البحر من أعلام النبوة إذ لا يمكن أن يخبر بها إلا عَلاَّم الغيوب الذي لا يخفى عليه شيء\n ولا يخلو منه مكان\n والله تعالى أعلم\n الإشارة: كل من دخل بحر التوحيد علماً ـ وهو فرعون برؤية نفسه ـ\n ولم يصحب من يغيبُه عنها غرق في بحر الزندقة والدعوى\n فإن رجع إلى الإيمان بعد معاينة الهلاك بسيف الشريعة قيل له: الآن وقد عصيت قبلُ وكنتَ من المفسدين؟ فإن تاب حقيقة رجى له النجاة\n وإن قتل كان آية ونكالاً لمن خلفه\n والله تعالى أعلم\n ثم ذكَّشر بني إسرائيل بما أنعم عليهم\n فقال: { وَلَقَدْ بَوَّأْنَا بَنِيۤ إِسْرَائِيلَ مُبَوَّأَ صِدْقٍ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:36",
      "similarity": 0.302021303041797
    },
    {
      "verse": "46:5",
      "similarity": 0.10571161460055296
    },
    {
      "verse": "27:93",
      "similarity": 0.1056778346576285
    },
    {
      "verse": "10:29",
      "similarity": 0.10425751180248549
    },
    {
      "verse": "21:1",
      "similarity": 0.10205956401730518
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010092.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010092.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:92.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}