{
  "chapter": "يونس",
  "text": "فاليوم ننجيك ببدنك لتكون لمن خلفك ءاية وان كثيرا من الناس عن ءايتنا لغفلون",
  "translations": [
    {
      "translation": "Today We will preserve your body so you can be a Sign for people who come after you. Surely many people are heedless of Our Signs.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall preserve your body today that you may be a lesson for those who come after you; as many a man is heedless of Our signs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall now save your corpse that you may serve as a sign of warning for all posterity, although many men are heedless of Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will save your body on this day so that you may become evidence (of Our existence) for the coming generations; many people are unaware of such evidence.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This day We shall salvage your body so that you may be a sign for those after you; and indeed most people are neglectful of Our signs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day We shall deliver your (dead) body (out from the sea) that you may be a sign to those who come after you! And verily, many among mankind are heedless of Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We will this day deliver you with your body that you may be a sign to those after you, and most surely the majority of the people are heedless to Our communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today We shall deliver thee with thy body, that thou mayest be a sign to those after thee. Surely many men are heedless of Our signs.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But this day We save thee in thy body that thou mayst be a portent for those after thee. Lo! most of mankind are heedless of Our portents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We shall save your body this day, so that you may serve as a sign for those who come after you: for many people are indeed heedless of Our signs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day We deliver thee in thy body that thou mayest be a sign unto those after thee, and verily many of mankind are of our signs neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today We shall deliver your body so that you may be a sign for those who come after you.’ Indeed many of the people are oblivious to Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This day shall We save thee in the body, that thou mayest be a sign to those who come after thee! but verily, many among mankind are heedless of Our Signs!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day We shall deliver your (dead) body (out from the sea) that you may be a sign to those who come after you! And verily, many among mankind are heedless of Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall deliver you (Ramsis II) with your body this day, so that you may be a sign to those after you. Indeed many people pay no heed to Our signs!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today We will preserve your body, so that you become a sign for those after you. But most people are heedless of Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today We will save you in body that you may be to those who succeed you a sign. And indeed, many among the people, of Our signs, are heedless\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:92] But this day We shall save you, We shall bring you out of the sea, in your body, your lifeless corpse, that you may be, for those after you a sign, a lesson, that they might come to know your servitude and not venture upon deeds like yours. According to Ibn ‘Abbās, some of the Children of Israel doubted his death and so he was brought out [of the sea] for them to see. And truly most people, that is, the people of Mecca, are heedless of Our signs’, not learning the lesson therefrom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But this day We save thee in your body) We save your cadaver in its armour (that thou mayst be a portent) 223 that you may be a lesson, such that they do not claim what you claimed and know that you are not a god (for those after thee) among the disbelievers. (Lo! most of mankind) i.e. the disbelievers (are heedless of) are deniers of (Our portents) Our Scripture and Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱلْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ } معناهُ نُلقِيكَ عَلَى نَجْوةٍ وهي الإِرتفاعُ مِن الأَرضِ\n والبَدنُ كَانَ يَلبَسهُ فِرعَونُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying: {So today We will save you in your body} means that We will raise you up to a high place, which is the height from the earth.\n\n\nThe body was clothed in Pharaoh's finery.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱلْيَوْمَ } لا ينفعك إيمانك { نُنَجِّيكَ } نخرجك من البحر { بِبَدَنِكَ } بلا روح ونسقطك على الساحل عرياناً { لِتَكُونَ لِمَنْ خَلْفَكَ } من المتجبرين المتكبرين { آيَةً } زاجرة وعبرة رادعة عن العتو والعناد\n صارفة عن الجور والفساد { وَإِنَّ كَثِيراً مِّنَ ٱلنَّاسِ } الناسين عهودنا وميثاقنا الذي عهدنا معهم في لوح قضائنا { عَنْ آيَاتِنَا } الدالة على أخذنا وانتقامنا { لَغَافِلُونَ } [يونس: 92] مثلك أيها الطاغي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:36",
      "similarity": 0.302021303041797
    },
    {
      "verse": "46:5",
      "similarity": 0.10571161460055296
    },
    {
      "verse": "27:93",
      "similarity": 0.1056778346576285
    },
    {
      "verse": "10:29",
      "similarity": 0.10425751180248549
    },
    {
      "verse": "21:1",
      "similarity": 0.10205956401730518
    }
  ]
}