{
  "chapter": "يونس",
  "text": "وجوزنا ببنى اسرءيل البحر فاتبعهم فرعون وجنوده بغيا وعدوا حتى اذا ادركه الغرق قال ءامنت انه لا اله الا الذى ءامنت به بنوا۟ اسرءيل وانا۠ من المسلمين",
  "translations": [
    {
      "translation": "We brought the tribe of Israel across the sea and Pharaoh and his troops pursued them out of tyranny and enmity. Then, when he was on the point of drowning, he said, 'I believe that there is no god but Him in whom the tribe of Israel believe. I am one of the Muslims.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We brought the people of Israel across the sea, but the Pharaoh and his army pursued them wickedly and maliciously till he was on the point of drowning, and he said: \"I believe that there is no god but He in whom the people of Israel believe, and I submit to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We led the Children of Israel across the sea. Then Pharaoh and his hosts pursued them in iniquity and transgression until Pharaoh cried out while he was drowning: 'I believe that there is no god but Allah in Whom the Children of Israel believe, and I am also one of those who submit to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We helped the children of Israel cross the sea safely. The Pharaoh and his army pursued the children of Israel with wickedness and hate until the Pharaoh was drowned. As he was drowning the Pharaoh said, \"I declare that there is no God but the One in whom the children of Israel believe and I have submitted to the Word of God\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We transported the Descendants of Israel across the sea, therefore Firaun and his army pursued them with rebellion and injustice; until when the drowning overcame him he cried, “I accept faith that there is no True God except the One in Whom the Descendants of Israel believe, and I am a Muslim.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We took the Children of Israel across the sea, and Fir`awn with his hosts followed them in oppression and enmity, till when drowning overtook him, he (Fira`wn) said: \"I believe that none has the right to be worshipped but He in Whom the Children of Israel believe, and I am one of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the children of Israel to pass through the sea, then Firon and his hosts followed them for oppression and tyranny; until when drowning overtook him, he said: I believe that there is no god but He in Whom the children of Israel believe and I am of those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We brought the Children of Israel over the sea; and Pharaoh and his hosts followed them insolently and impetuously till, when the drowning overtook him, he said, 'I believe that there is no god but He in whom the Children of Israel believe; I am of those that surrender.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We brought the Children of Israel across the sea, and Pharaoh with his hosts pursued them in rebellion and transgression, till, when the (fate of) drowning overtook him, he exclaimed: I believe that there is no Allah save Him in Whom the Children of Israel believe, and I am of those who surrender (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We brought the Children of Israel across the sea. Pharaoh and his troops pursued them arrogantly and aggressively. When he was about to drown, [Pharaoh] exclaimed, \"I believe that there is no deity save Him in whom the Children of Israel believe, and I am of those who surrender themselves to Him!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We led the Children of Isra'il across the sea; then Fir'awn and his hosts pursued them in rebellion and enmity, until, when the drowning over-took him, he said: I believe that verily He! there is no god but he, in whom the Children of Isra'il believe, and am of the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We carried the Children of Israel across the sea, whereat Pharaoh and his troops pursued them, out of defiance and aggression. When overtaken by drowning, he called out, ‘I believe that there is no god except Him in whom the Children of Israel believe, and I am one of those who submit [to Him]!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We took the Children of Israel across the sea: Pharaoh and his hosts followed them in insolence and spite. At length, when overwhelmed with the flood, he said: \"I believe that there is no god except Him Whom the Children of Israel believe in: I am of those who submit (to Allah in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We took the Children of Israel across the sea, and Fir'aun (Pharaoh) with his hosts followed them in oppression and enmity, till when drowning overtook him, he said: \"I believe that La ilaha illa (Huwa): (none has the right to be worshipped but) He,\" in Whom the Children of Israel believe, and I am one of the Muslims (those who submit to Allah's Will).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We brought the Children of Israel through the sea, and Pharaoh and his legions pursued them arrogantly and frantically. But as he was drowning he cried out: '(Now) I believe that there is no god except He in whom the Children of Israel believe. I am of those that surrender (Muslims)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered the Children of Israel across the sea. Pharaoh and his troops pursued them, defiantly and aggressively. Until, when he was about to drown, he said, “I believe that there is no god except the One the Children of Israel believe in, and I am of those who submit.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We took the Children of Israel across the sea, and Pharaoh and his soldiers pursued them in tyranny and enmity until, when drowning overtook him, he said, \"I believe that there is no deity except that in whom the Children of Israel believe, and I am of the Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[10:90] And We brought the Children of Israel across the sea; and Pharaoh pursued them, he caught up with them, together with his hosts, in insolence and transgression (baghyan wa-‘adwan: these constitute the [direct] object denoting reason), until, when the [fate of] drowning overtook him, he said, ‘I believe that (annahu is [to be understood as] bi-annahu; a variant reading has innahu, ‘truly it is …’ indicating a new sentence) there is no god save Him in whom the Children of Israel believe, and I am of those who submit [to Him]’: he reiterated this [his submission to God] so that it might be accepted from him, but it was not; and Gabriel thrust mud from the sea into his mouth, lest [God’s] mercy embrace him. And he [Gabriel] said to him:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمعطوفة على جملة { وأوحينا إلى موسى وأخيه أن تَتَبَوَّءا لقومكما بمصر بيوتاً } \\[ يونس : 87 \\] عطف الغرض على التمهيد ، أي ، أمرناهما باتخاذ تلك البيوت تهيئة للسفر ومجاوزة البحر .وجاوزنا ، أي قطعنا بهم البحر ، والباء للتعدية ، أي أقطعناهم البحر بمعنى جعلناهم قاطعين البحر . وتقدم نظيره في سورة الأعراف \\[ 138 \\]. ومجاوزتهم البحر تقتضي خوضهم فيه ، وذلك أن الله جعل لهم طرائق في البحر يمُرون منها .و { أتبعهم } بمعنى لحقهم . يقال : تَبعه فأتْبَعَه إذا سار خلفه فأدركه . ومنه { فأتبعَه شهابٌ ثاقب } \\[ الصافات : 10 \\]. وقيل : أتبع مُرادف تبع .والبغي : الظلم ، مصدر بغى . وتقدم عند قوله تعالى : { والإثم البغيَ بغير الحق } في \\[ الأعراف : 33 \\].والعَدْو : مصدر عدا . وهو تجاوز الحد في الظلم ، وهو مسوق لتأكيد البغي . وإنما عطف لما فيه من زيادة المعنى في الظلم باعتبار اشتقاق فعل عدا .والمعنى : أن فرعون دخل البحر يتقصّى آثارهم فسار في تلك الطرائق يريد الإحاطة بهم ومنْعَهم من السفر ، وإنما كان اتباعه إياهم ظلماً وعُدواناً إذ ليس له فيه شائبة حق ، لأن بني إسرائيل أرادوا مفارقة بلاد فرعون وليست مفارقة أحد بلده محظورة إن لم يكن لأحد عليه حق في البقاء ، فإن لذي الوطن حقاً في الإقامة في وطنه فإذا رام مغادرة وطنه فقد تخلى عن حق له ، وللإنسان أن يتخلى عن حقه ، فلذلك كان الخَلع في الجاهلية عقاباً ، وكان النفي والتغريب في الإسلام عقوبة لا تقع إلا بموجب شرعي ، وكان الإمساك بالمكان عقاباً ، ومنه السجن ، فليس الخروج من الوطن طوعاً بعُدوان . فلما رام فرعون منع بني إسرائيل من الخروج وشدّ للحاق بهم لردهم كرهاً كان في ذلك ظالماً معتدياً ، لأنه يبتغي بذلك إكراههم على البقاء ولأن غرضه من ذلك تسخيرهم .وحتى } ابتدائية لوقوع { إذا } الفُجائية بعدها . وهي غاية للإتباع ، أي استمر إتباعه إياهم إلى وقت إدراك الغرق إياه ، كل ذلك لا يفتأ يجدّ في إدراكهم إلى أن أنجى الله بني إسرائيل فاخترقوا البحر ، ورد الله غمرة الماء على فرعون وجنوده ، فغرقوا وهلك فرعون غريقاً ، فمنتهى الغاية هو الزمان المستفاد من ( إذا ) ، والجملة المضافة هي إليها وفي ذلك إيجاز حذففٍ . والتقدير : حتى أدركه الغرق فإذا أدركه الغرق قال آمنت ، لأن الكلام مسوق لكون الغاية وهي إدراك الغرق إياه فعند ذلك انتهى الإتباع ، وليست الغاية هي قوله : { آمنت } وإن كان الأمران متقارنين .والإدراك : اللحاق وانتهاء السير . وهو يؤذن بأن الغرق دنا منه تدريجياً بهول البحر ومصارعته الموج ، وهو يأمل النجاة منه ، وأنه لم يُظهر الإيمان حتى أيس من النجاة وأيقن بالموت ، وذلك لتصلبه في الكفر .وتركيب الجملة إيجاز ، لأنها قامت مقام خمس جمل :جملة : تفيد أن فرعون حاول اللحاق ببني إسرائيل إلى أقصى أحوال الإمكان والطمع في اللحاق .وجملة : تفيد أنه لم يلحقهم .وهاتان مستفادان من ( حتى ) ، وهاتان منَّة على بني إسرائيل .وجملة : تفيد أنه غمره الماء فغرق ، وهذه مستفادة من قوله : { أدركه الغرق } وهي عقوبة له وكرامة لموسى عليه السلام .وجملة : تفيد أنه لم يسعه إلا الإيمان بالله لأنه قهرته أدلة الإيمان . وهذه مستفادة من ربط جملة إيمانه بالظرف في قوله : { إذا أدركه الغرق }. وهذه منقبة للإيمان وأن الحق يغلب الباطل في النهاية .وجملة : تفيد أنه مَا آمن حتى أيس من النجاة لتصلبه في الكفر ومع ذلك غلبه الله . وهذه موعظة للكافرين وعزة لله تعالى .وقد بُني نظم الكلام على جملة : { إذا أدركه الغرق } ، وجعل ما معها كالوسيلة إليها ، فجعلت ( حتى ) لبيان غاية الإتْبَاع وجعلت الغاية أن قال : { آمنتُ } لأن إتباعه بني إسرائيل كان مندفعاً إليه بدافع حنقه عليهم لأجل الدين الذي جاء به رسولهم ليخرجهم من أرضه ، فكانت غايتُه إيمانَه بحقهم . ولذلك قال : { الذي آمنت به بنو إسرائيل } ليفيد مع اعترافه بالله تصويبه لبني إسرائيل فيما هُدوا إليه ، فجعل الصلة طريقاً لمعرفته بالله ، ولعدم علمه بالصفات المختصة بالله إلا ما تضمنته الصلة إذ لم يتبصر في دعوة موسى تمام التبصر ، ولذلك احتاج أن يزيد { وأنا من المسلمين } لأنه كان يسمع من موسى دعوتَه لأنْ يكون مسلماً فنطق بما كان يسمعه وجعل نفسه من زمرة الذين يحق عليهم ذلك الوصف ، ولذلك لم يقل : أسلمتُ ، بل قال أنا من المسلمين ، أي يلزمني ما التزموه . جاء بإيمانه مجملاً لضيق الوقت عن التفصيل ولعدم معرفته تفصيله .وسيأتي قريباً في تفسير الآية التي بعد هذه تحقيق صفة غرق فرعون ، وما كان في بقاء بدنه بعد غرقه .وقرأ الجمهور { آمنتُ أَنه } بفتح همزة ( أنه ) على تقدير باء الجر محذوفة . وقرأه حمزة والكسائي وخلف بكسر الهمزة على اعتبار ( إنّ ) واقعة في أول جملة ، وأنّ جملتها بدل من جملة { آمنت } بحذف متعلق فعل { آمنت } لأن جملة البدل تدل عليه .\n\n",
      "translations": [
        {
          "translation": "(And We brought the Children of Israel across the sea, and Pharaoh with his hosts pursued them in rebellion) with their words (and transgression) with the intention of killing them, (till, when the (fate of) drowning overtook him, he exclaimed: I believe that there is no God save Him in whom the Children of Israel) Moses and his companions (believe, and I am of those who surrender (unto Him)) following their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَتْبَعَهُمْ فِرْعَوْنُ } معناه تَبِعَهُم\n\n\n\n\nوقوله تعالى: { بَغْياً وَعَدْواً } معناهُ عُدوانٌ وطُغْيانٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"So Pharaoh followed them,\" means that he followed them.\n And His saying, {by aggression and by enmity}, means aggression and tyranny.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما تمرنوا بالصبر واستقاموا على ما أُمروا مختبئين\n فازوا بما ناجوا وطلبوا مؤملين حين { جَاوَزْنَا بِبَنِيۤ إِسْرَائِيلَ ٱلْبَحْرَ } أي: عبرناهم من البحر سالمين\n وذلك حين هم فرعون وملأه أن يكبوا على بني إسرائيل ويستأصلوهم بالمرة\n فأوحينا إلى مومسى أن أسر بعبادي ليلاً فأسرى بهم\n فأخبروا فخرجوا على الفور\n فأدركوهم على شاطئ البحر فأوحينا إلى موسى بضرب العصا فضرب\n فانفلق وافترق فرقاً\n فعيروا سالمين\n فلمَّا أبصروا انفلاق البحر وعبورهم سالمين { فَأَتْبَعَهُمْ فِرْعَوْنُ وَجُنُودُهُ } فاقتحموا في البحر بلا مبالاة وتأمل { بَغْياً وَعَدْواً } ظلماً وزوراً\n علواً واستكباراً\n فاجتمع البحر وعاد على ما كان فغرقوا { حَتَّىٰ إِذَآ أَدْرَكَهُ } أي: فرعون { ٱلْغَرَقُ } وآيس من حياته وجزم ألان نجاة له أصلا { قَالَ } في حالة الاضطرار\n مصرخاً صائحاً باكياً\n راجياً الخلاص بمجرد الإقرار: { آمَنتُ } واعترفت { أَنَّهُ } أي: بأنه { لاۤ إِلِـٰهَ } يعبد بالحق { إِلاَّ ٱلَّذِي آمَنَتْ بِهِ بَنوۤاْ إِسْرَائِيلَ وَأَنَاْ مِنَ ٱلْمُسْلِمِينَ } [يونس: 90] المنقادين لما جاء به رسوله\n\n\nوحين تفوه بها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: فأتبعهم أي: تبعهم\n يقال: تبع وأتبع لغتان\n يقول الحق جل جلاله: { وجاوزنا ببني إسرائيل البحرَ } أي: جوزناهم في البحر يبساً حتى بلغوا الشط الآخر حافظين لهم\n رُوي أن بني إسرائيل حين جاوزوا البحر كانوا ستمائة ألف\n وكان يعقوب عليه السلام قد دخل مصر في نيف وسبعين من ذريته\n فتناسلوا حتى بلغوا وقت موسى العدد المذكور\n  { فأتْبعهم }: فأدركهم { فرعونُ وجنودُه } \n رُوي أنهم كانوا ثمانمائة ألف أدهم\n سوى ما يناسبها من أواسط الخيل\n تبعهم { بغياً وعَدْواً }: باغين وعادين عليهم\n مستمراً على بغيه { حتى إذا أدركه الغرق قال آمنتُ أنه } أي: بأنه { لا إله إلا الذي آمنتْ به بنو إسرائيل وأنا من المسلمين } \n فآمن حين لا ينفع الإيمان بمعانية الموت\n ومن قال بصحة إيمانه فغلطٌ\n كالحاتمي فإنه قال في الفصوص: إنه من الناجين\n وذلك من جملة هفواته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:16",
      "similarity": 0.5338656928739075
    },
    {
      "verse": "7:138",
      "similarity": 0.4571623690411749
    },
    {
      "verse": "18:62",
      "similarity": 0.4226357346472606
    },
    {
      "verse": "26:61",
      "similarity": 0.2943910361697842
    },
    {
      "verse": "2:50",
      "similarity": 0.26891918178300356
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/010090.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/010090.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/10:90.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}