{
  "chapter": "النصر",
  "text": "ورايت الناس يدخلون فى دين الله افواجا",
  "translations": [
    {
      "translation": "And you see men enter God's discipline horde on horde,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you see people entering Allah's religion in multitudes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "you will see large groups of people embracing the religion of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see people entering the religion of Allah in multitudes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see that the people enter Allah's religion in crowds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see men entering the religion of Allah in companies,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and thou seest men entering God's religion in throngs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou seest mankind entering the religion of Allah in troops,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you see people entering God's religion in multitudes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou beholdest mankind entering the religion of Allah in crowds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you see the people entering Allah’s religion in throngs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou dost see the people enter Allah's Religion in crowds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see that the people enter Allah's religion (Islam) in crowds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you see people embracing the Religion of Allah in throngs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see the people entering God’s religion in multitudes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see the people entering into the religion of Allah in multitudes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[110:2] and you see people entering God’s religion, that is to say, Islam, in throngs, in large droves, after they had been entering one by one — this was after the conquest of Mecca, when the Arabs from all corners of the   land came to him willingly [in obedience to his command] —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And thou seest mankind) the people of Yemen and others (entering the religion of Allah) Islam (in troops) entire groups at a time, when this happens, know that you will die.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nقولهِ تعالى: { وَرَأَيْتَ ٱلنَّاسَ يَدْخُلُونَ فِي دِينِ ٱللَّهِ أَفْوَاجاً } يعني جماعاتٍ في تَفرقةٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ورأيت الناس يدخلون في دين الله } أي: التوحيد والسلوك على الصراط المستقيم بتأثير نورك فيهم عند فراغك من تكميل نفسك { أفواجاً } مجتمعين كأنهم نفس واحدة تستفيض من فيض ذاتك قائمة مقام نفسك وهم المستعدّون الذين كانت بين نفسه عليه السلام وأنفسهم علاقة مناسبة ورابطة جنسية توجب اتصالهم به بقبول فيضه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { ورأيتَ الناسَ } أي: أبصرتهم، أو علمتهم { يدخلون في دينِ الله } أي: ملة الإسلام، التي لا دين يُضاف إليه تعالى غيرها\n والجملة على الأول: حال من \" الناس \" ، وعلى الثاني: مفعول ثان لرأيت، و { أفواجاً } حال من فاعل \" يدخلون \" أي: يدخلون جماعة بعد جماعة، تدخل القبيلة بأسرها، والقوم بأسرهم، بعدما كانوا يدخلون واحداً واحداً، وذلك أنَّ العرب كانت تقول: إذا ظفر محمدٌ بالحرم ـ وقد كان آجرهم الله من أصحاب الفيل ـ فليس لكم به يدان، فلما فُتحت مكة جاؤوا للإسلام أفواجاً بلا قتال، فقد أسلم بعد فتح مكة بَشَرٌ كثير، فكان معه في غزوة تبوك سبعون ألفاً\n وقال أبو محمد بن عبد البر: لم يمت رسولُ الله صلى الله عليه وسلم وفي العرب كافر، وقد قيل: إنَّ عدد المسلمين عند موته: مائة ألف وأربعة عشر ألفاً\n هـ",
      "translations": []
    }
  ]
}