{
  "chapter": "النصر",
  "text": "فسبح بحمد ربك واستغفره انه كان توابۢا",
  "translations": [
    {
      "translation": "then glorify your Lord's praise and ask His forgiveness. He is the Ever-Returning,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then glorify your Lord and seek His forgiveness. Verily He is relenting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then extol the praise of your Lord and pray to Him for forgiveness. For He indeed is ever disposed to accept repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorify your Lord with praise and ask Him for forgivenes. He accepts repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then proclaim the Purity of your Lord while praising Him, and seek forgiveness from Him; indeed He is the Most Acceptor of Repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, glorify the praises of your Lord, and ask His forgiveness. Verily, He is the One Who accepts the repentance and Who forgives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then celebrate the praise of your Lord, and ask His forgiveness; surely He is oft-returning (to mercy).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then proclaim the praise of thy Lord, and seek His forgiveness; for He turns again unto men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hymn the praises of thy Lord, and seek forgiveness of Him. Lo! He is ever ready to show mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then glorify your Lord with His praise and seek His forgiveness. He is always ready to accept repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hallow the praise of thy Lord, and ask forgiveness of Him. Verily He is ever Relenting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "celebrate the praise of your Lord, and plead to Him for forgiveness. Indeed, He is all-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Celebrate the praises of thy Lord, and pray for His Forgiveness: For He is Oft-Returning (in Grace and Mercy).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glorify the Praises of your Lord, and ask for His Forgiveness. Verily, He is the One Who accepts the repentance and forgives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "exalt with the praise of your Lord and ask forgiveness from Him. For indeed, He is the Turner (for the penitent).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then celebrate the praise of your Lord, and seek His forgiveness. He is the Accepter of Repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then exalt [Him] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[110:3] then glorify with praise of your Lord, that is, continuously praising Him, and seek forgiveness from Him; for verily He is ever ready to relent. The Prophet (s), after this sūra had been revealed, would frequently repeat the words subhāna’Llāhi wa bi-hamdihi, ‘Glory and praise be to God’, and astaghfiru’Llāha wa-atūbu ilayhi, ‘I seek forgiveness from God and I repent to Him’; with [the revelation of] this [final sūra] he realised that his end was near. The victory over Mecca was in Ramadān of year 8; the Prophet (s) passed away in Rabī‘ I of the year 10. Meccan, consisting of 5 verses. When the Prophet (s) summoned his people and said, ‘I am a warner to you, [standing] before a terrible chastisement’, his uncle, Abū Lahab, said, ‘May you perish! Is that what you have called us out for?’, whereupon the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then hymn the praises of thy Lord) pray by the command of your Lord in gratitude for this, (and seek forgiveness of Him) from sins. (Lo! He is ever ready to show mercy) and forgiving. The Prophet (pbuh) was therefore informed in this surah that he was to die soon'. And of the surah in which Abu Lahab is mentioned, which is all Meccan and consists of 5 verses, 23 words and 77 letters: Surah 111: Palm Fibre (al-Masad) And of the surah in which Abu Lahab is mentioned, which is all Meccan and consists of 5 verses, 23 words and 77 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فسبح } أي: نزّه ذاتك من الاحتجاب بمقام القلب الذي هو معدن النبوّة بقطع علاقة البدن والترقي إلى مقام حق اليقين الذي هو معدن الولاية { بحمد ربّك } أي: حامداً له بإظهار كمالاته وأوصافه التامة عند التجريد بالحمد الفعلي { واستغفره } واطلب ستره ذاتك بذاته كما كان حال الفناء قبل الرجوع إلى الخلق أبداً { إنه كان توّاباً } قابلاً لرجوع من رجع إليه بإفنائه بنوره\n ولما كمل الدين واستقرّت دعوته التي كانت بعثته لأجلها أمره بالرجوع إلى مقام حق اليقين الذي لا يستمر إلا بعد الموت\n ولذلك\n \" لما نزلت فقرأها رسول الله صلى الله عليه وسلم استبشر الأصحاب وبكى ابن عباس فقال صلى الله عليه وسلم: \" ما يبكيك؟ \" قال: نعيت إليك نفسك! فقال عليه السلام: \" لقد أوتي هذا الغلام علماً كثيراً \"\n \n\n \" وروي أنها لما نزلت خطب رسول الله صلى الله عليه وسلم فقال: \" إنّ عبداً خيّره الله بين الدنيا وبين لقائه فاختار لقاء الله \" \n فعلم أبو بكر رضي الله عنه فقال: فديناك بأنفسنا وأموالنا وآبائنا وأولادنا \"\n \n\n \" وعنه أنه دعا فاطمة عليها السلام فقال: \" يا بنتاه! نعيت إلي نفسي \" فبكت فقال: \" لا تبكي فإنك أول أهلي لحوقاً بي \" \n فضحكت \" \nوتسمى هذه السورة سورة التوديع\n وروي أنه عاش بعدها سنتين ونزلت في حجة الوداع",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَسَبِّحْ بِحَمْدِ رَبِّكَ } يا أكمل الرسل\n شكراً لما أعطاك جميع ما وعدك\n وفتح عليك الآفاق\n وأتم ببعثتك وظهورك محاسن الشيم ومكارم الأخلاق { وَٱسْتَغْفِرْهُ } واطلب منه العفو والغفران من لدنه\n هضماً لنفسك وفرطاتك\n إذ قلمَّا يخلو المبشر من الخطر\n\n\n{ إِنَّهُ كَانَ تَوَّاباً } [النصر: 3] يغفر من استغفر له\n ويقبل توبة من أناب إليه أيضاً\n سيما إذا كانت مقرونة بالإخلاص\n\n\nوبعدما نزلت هذه السورة\n وأمر سبحانه صلى الله عليه وسلم بالحمد والاستغفار\n تغمم الأصحاب وتحزنوا\n وفهموا منها أن أجل رسول الله صلى الله عليه وسلم قد قرُب\n فودَّعه الحق\n وأمره بالحمد والاستغفار\n لذلك سما هذه السورة سورة التوديع أيضاً\n\n\nخاتمة السورة\n\nعليك أيها الطالب للنجاة الأخروية والراغب إلى اللذات اللدنية الروحانية الموعودة فيها أن تستغفر إلى الله\n وتسترجع نحوه في أوقاتك وحالاتك\n وتفوض أمورك كلها إليه\n وتتخذه وكيلاً\n وتجعله حسيباً وكفيلاً\n فلك أن تواظب على الطاعات والعبادات\n وتجتنب عن مطلق المحارم والمنكرات\n يحفظك الحق عن جميع الملمَّات ويوصلك إلى عموم المهمات بفضله ولطفه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فإذا رأيتَ ما ذكر من النصر والفتح { فَسَبِّح بحمد ربك } أي: قل سبحان الله\n حامداً له\n أو: فصلّ له { واستغفره } تواضعاً وهضماً للنفس\n أو: دُمْ على الاستغفار\n { إِنه كان } ولم يزل { تواباً } كثير القبول للتوبة\n\nروت عائشةُ رضي الله عنها أنَّ النبيّ صلى الله عليه وسلم: لَمّا فتح مكة\n وأسلمت العرب\n جعل يُكثر أن يقول:\n \" سبحانك اللهم وبحمدك\n وأستغفرك وأتوب إليك\n يتأوّل القرآن \" \nيعني في هذه السورة\n وقال لها مرة:\n \" ما أراه إلاَّ حضور أجلي \" \n\n وتأوَّله العباس وعمر رضي الله عنهما بذلك بمحضره صلى الله عليه وسلم فصدّقهما\n ونزع هذا المنزع ابن عباس وغيره\n الإشارة: إذا جاءتك أيها المريد نصر الله لك\n بأن قوّاك على خرق عوائد نفسك\n وأظفرك بها والفتح وهو دخول مقام الفناء\n وإظهار أسرار الحقائق ورأيت الناسَ يدخلون في طريق الله أفواجاً\n فسبّح بحمد ربك\n أي: نزّه ربك عن رؤية الغيرية والأثنينية في ملكه\n واستغفره من رؤية وجود نفسك\n قال القشيري: ويقال النصر من الله بأن أفناه عن نفسه\n وأبعد عنه أحكام البشرية\n وصفّاه من الكدورات النفسانية\n وأمّا الفتح فهو: أن رقَّاه إلى محل الدنو\n واستخلصه بخصائص الزلفة\n وألبسه لباس الجمع\n وعرّفه من كمال المعرفة ما كان جميع الخلق متعطشاً إليه\n هـ\n وقال الورتجبي فَسَبِّح بحمد ربك أي: سبِّحه بحمده لا بك\n أي: فسبِّحه بالحمد الذي حمد به نفسه\n واستغفِره من حمدك وثنائك وجميع أعمالك وعرفانك\n فإنّ الكل معلول إذ وصف الحدثان لا يليق بجمال الرحمن\n إنه كان قابل التوب من العجز عن إدراك كنه قدسه\n والاعتراف بالجهل عن معرفة حقيقة وجوده\n هـ\n وصلّى الله على سيدنا محمد وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:98",
      "similarity": 0.6444732658602799
    },
    {
      "verse": "64:1",
      "similarity": 0.5186800830519908
    },
    {
      "verse": "5:74",
      "similarity": 0.5156345504904318
    },
    {
      "verse": "37:182",
      "similarity": 0.47996968080659125
    },
    {
      "verse": "1:2",
      "similarity": 0.47506140263638413
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/110003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/110003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/110:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}