{
  "chapter": "النصر",
  "text": "فسبح بحمد ربك واستغفره انه كان توابۢا",
  "translations": [
    {
      "translation": "then glorify your Lord's praise and ask His forgiveness. He is the Ever-Returning,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then glorify your Lord and seek His forgiveness. Verily He is relenting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then extol the praise of your Lord and pray to Him for forgiveness. For He indeed is ever disposed to accept repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorify your Lord with praise and ask Him for forgivenes. He accepts repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then proclaim the Purity of your Lord while praising Him, and seek forgiveness from Him; indeed He is the Most Acceptor of Repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, glorify the praises of your Lord, and ask His forgiveness. Verily, He is the One Who accepts the repentance and Who forgives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then celebrate the praise of your Lord, and ask His forgiveness; surely He is oft-returning (to mercy).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then proclaim the praise of thy Lord, and seek His forgiveness; for He turns again unto men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hymn the praises of thy Lord, and seek forgiveness of Him. Lo! He is ever ready to show mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then glorify your Lord with His praise and seek His forgiveness. He is always ready to accept repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hallow the praise of thy Lord, and ask forgiveness of Him. Verily He is ever Relenting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "celebrate the praise of your Lord, and plead to Him for forgiveness. Indeed, He is all-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Celebrate the praises of thy Lord, and pray for His Forgiveness: For He is Oft-Returning (in Grace and Mercy).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So glorify the Praises of your Lord, and ask for His Forgiveness. Verily, He is the One Who accepts the repentance and forgives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "exalt with the praise of your Lord and ask forgiveness from Him. For indeed, He is the Turner (for the penitent).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then celebrate the praise of your Lord, and seek His forgiveness. He is the Accepter of Repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then exalt [Him] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[110:3] then glorify with praise of your Lord, that is, continuously praising Him, and seek forgiveness from Him; for verily He is ever ready to relent. The Prophet (s), after this sūra had been revealed, would frequently repeat the words subhāna’Llāhi wa bi-hamdihi, ‘Glory and praise be to God’, and astaghfiru’Llāha wa-atūbu ilayhi, ‘I seek forgiveness from God and I repent to Him’; with [the revelation of] this [final sūra] he realised that his end was near. The victory over Mecca was in Ramadān of year 8; the Prophet (s) passed away in Rabī‘ I of the year 10. Meccan, consisting of 5 verses. When the Prophet (s) summoned his people and said, ‘I am a warner to you, [standing] before a terrible chastisement’, his uncle, Abū Lahab, said, ‘May you perish! Is that what you have called us out for?’, whereupon the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا (3)وجملة : { فسبح بحمد ربك } جواب { إذا } باعتبار ما تضمنته من معنى الشرط ، وفعل { فسبح } هو العامل في { إذا } النصبَ على الظرفية ، والفاء رابطة للجواب لأنه فعل إنشاء .وقَرن التسبيح بالحمد بباء المصاحبة المقتضية أن التسبيح لاحقٌ للحمد لأن باء المصاحبة بمعنى ( مع ) فهي مثل ( مع ) في أنها تدخل على المتبوع فكان حمد الله على حصول النصر والفتح ودخول الناس في الإِسلام شيئاً مفروغاً منه لا يحتاج إلى الأمر بإيقاعه لأن شأن الرسول صلى الله عليه وسلم أنه قد فعله ، وإنما يحتاج إلى تذكيره بتسبيح خاص لم يحصل من قبل في تسبيحاته وباستغفار خاص لم يحصل من قبل في استغفاره .ويجوز أن يكون التسبيح المأمور به تسبيحَ ابتهاج وتعجب من تيسير الله تعالى له ما لا يخطر ببال أحد أن يتم له ذلك ، فإن سبحان الله ونحوه يستعمل في التعجب كقول الأعشى: ... قد قلتُ لما جاءني فخرُهسبحانَ من علقمةَ الفاخِر ... وفي تقديم الأمر بالتسبيح والحمد على الأمر بالاستغفار تمهيد لإجابة استغفاره على عادة العرب في تقديم الثناء قبل سؤال الحاجة كما قال ابن أبي الصلت: ... إذا أثنى عليك المرء يوماًكفاه عن تعرضه الثناء ... فإن رسول الله صلى الله عليه وسلم لم يكن يخلو عن تسبيح الله فأريد تسبيح يقارن الحمد على ما أعطيه من النصر والفتح ودخول الأمة في الإِسلام .وعطف الأمر باستغفار الله تعالى على الأمر بالتسبيح مع الحمد يقتضي أنه من حَيِّز جواب { إذا } ، وأنه استغفار يحصل مع الحمد مثل ما قرر في { فسبح بحمد ربك } فيدل على أنه استغفار خاص لأن الاستغفار الذي يعم طلب غفران التقصير ونحوه مأمور به من قبل وهو من شأن النبي صلى الله عليه وسلم فقد قال : \" إنه لَيُغَانَ على قلْبي فأستغفر اللَّه في اليوم والليلة مائة مرة \" فكان تعليق الأمر بالتسبيح وبالاستغفار على حصول النصر والفتح إيماءً إلى تسبيح واستغفار يحصل بهما تقرب لم يُنْو من قبل ، وهو التهيّؤ للقاء الله ، وأن حياته الدنيوية أوشكت على الانتهاء ، وانتهاء أعمال الطاعات والقربات التي تزيد النبي صلى الله عليه وسلم في رفع درجاته عند ربه فلم يبق إلا أن يسأل ربه التجاوز عما يعرض له من اشتغال ببعض الحظوظ الضرورية للحياة أو من اشتغال بمهم من أحوال الأمة يفوته بسببه أمر آخر هو أهم منه ، مثل فِداء أسرى بدر مع فوات مصلحة استئصالهم الذي هو أصلح للأمة فعوتِبَ عليه رسول الله صلى الله عليه وسلم بقوله تعالى : { ما كان لنبيء أن يكون له أسرى } \\[ الأنفال : 67 \\] الآية ، أو من ضرورات الإِنسان كالنوم والطعام التي تنقص من حالة شبهه بالملائكة الذين يسبحون الليل والنهار لا يفترون ، فكان هذا إيذاناً باقتراب وفاة رسول الله صلى الله عليه وسلم بانتقاله من حياة تحمل أعباء الرسالة إلى حياة أبدية في العلويات الملكية .والكلام من قبيل الكناية الرمزية وهي لا تنافي إرادة المعنى الصريح بأن يحمل الأمر بالتسبيح والاستغفار على معنى الإِكثار من قول ذلك . وقد دل ذوق الكلام بعضَ ذوي الأفهام النافذة من الصحابة على هذا المعنى وغاصت عليه مثل أبي بكر وعمر والعباس وابنه عبد الله وابن مسعود ، فعن مقاتل : \" لما نزلت قرأها النبي صلى الله عليه وسلم على أصحابه ففرحوا واستبشروا وبكى العباس فقال له النبي صلى الله عليه وسلم ما يبكيك يا عم؟ قال : نُعيتْ إليك نفسك . فقال : إنه لكَما تقول \" . وفي رواية : \" نزلت في منى فبكى عمر والعباس فقيل لهما ، فقالا : فيه نُعي رسول الله فقال النبي صلى الله عليه وسلم صدقتما نُعِيَتْ إليّ نفسي \" .وفي «صحيح البخاري» وغيره عن ابن عباس : «كان عمر يأذن لأهل بدر ويأذن لي معهم فوجد بعضهم من ذلك ، فقال لهم عمر : إنه مَن قد علمتم . قال : فأذن لهم ذات يوم وأذن لي معهم ، فسألهم عن هذه السورة : { إذا جاء نصر الله والفتح } فقالوا : أمر الله نبيئه إذا فتح عليه أن يستغفره ويتوب إليه فقال : ما تقول يا ابن عباس؟ قلت : ليس كذلك ولكن أخبر الله نبيئه حضور أجله فقال : { إذا جاء نصر الله والفتح } ، فذلك علامة موتك؟ فقال عمر : ما أعلم منها إلا ما تقول» فهذا فهم عمر والعباس وعبد الله ابنه .وقال في «الكشاف» : روي أنه لما نزلت خطب رسول الله صلى الله عليه وسلم فقال : \" إن عبداً خيّره الله بين الدنيا وبين ما عند الله فاختار ما عند الله عز وجل . فعلم أبو بكر فقال : فديناك بأنفسنا وأموالنا وآبائنا وأولادنا \" اه .قال ابن حجر في «تخريج أحاديث الكشاف» : الحديث متفق عليه إلا صدره دون أوله من كونه كان عند نزول السورة ا ه . ويحتمل أن يكون بكاء أبي بكر تكرر مرتين أولاهما عند نزول سورة النصر كما في رواية «الكشاف» والثانية عند خطبة النبي صلى الله عليه وسلم في مرضه .وعن ابن مسعود أن هذه السورة «تسمى سورة التوديع» أي لأنهم علموا أنها إيذان بقرب وفاة رسول الله صلى الله عليه وسلموتقديم التسبيح والحمد على الاستغفار لأن التسبيح راجع إلى وصف الله تعالى بالتنزه عن النقص وهو يجمع صفات السلب ، فالتسبيح متمحض لجانب الله تعالى ، ولأن الحمد ثناء على الله لإنعامه ، وهو أداء العبد ما يجب عليه لشكر المنعم فهو مستلزم إثبات صفات الكمال لله التي هي منشأ إنعامه على عبده فهو جامع بين جانب الله وحظ العبد ، وأما الاستغفار فهو حظ للعبد وحده لأنه طلبه اللَّه أن يعفو عما يؤاخذه عليه .ومقتضى الظاهر أن يقول : فسبح بحمده ، لتقدم اسم الجلالة في قوله : { إذا جاء نصر اللَّه } فعدل عن الضمير إلى الاسم الظاهر وهو { ربك } لما في صفة ( رب ) وإضافتها إلى ضمير المخاطب من الإِيماء إلى أن من حكمة ذلك النصر والفتح ودخول الناس في الإِسلام نعمةً أنعم الله بها عليه إذا حصل هذا الخير الجليل بواسطته فذلك تكريم له وعناية به وهو شأن تلطف الرب بالمربوب ، لأن معناه السيادة المرفوقة بالرفق والإِبلاغ إلى الكمال .وقد انتهى الكلام عند قوله : { واستغفره } . وقد روي : «أن النبي صلى الله عليه وسلم كان في قراءته يقف عند { واستغفره } ثم يكمل السورة» .{ واستغفره إِنَّهُ كَانَ } .تذييل للكلام السابق كله وتعليل لما يقتضي التعليل فيه من الأمر باستغفار ربه باعتبار الصريح من الكلام السابق كما سيتبين لك .وتوّاب : مثال مبالغة من تاب عليه . وفعل تاب المتعدي بحرف ( على ) يطلق بمعنى : وفّق للتوبة ، أثبته في «اللسان» و«القاموس» ، وهذا الإِطلاق خاص بما أسند إلى الله .وقد اشتملت الجملة على أربع مؤكدات هي : إنّ ، وكانَ ، وصيغة المبالغة في التوّاب ، وتنوين التعظيم فيه .وحيث كان توكيد ب ( إنَّ ) هنا غير مقصودٍ به ردُّ إنكار ولا إزالة تردد إذ لا يفرضان في جانب المخاطب صلى الله عليه وسلم فقد تمحض ( إنَّ ) لإفادة الاهتمام بالخبر بتأكيده .وقد تقرر أن من شأن ( إنَّ ) إذا جاءت على هذا الوجه أن تغني غَناء فاء الترتيب والتسبب وتفيد التعليل وربط الكلام بما قبله كما تفيده الفاء ، وقد تقدم غير مرة ، منها عند قوله تعالى : { إنك أنت العليم الحكيم } في سورة \\[ البقرة : 32 \\] ، فالمعنى : هو شديد القبول لتوبة عباده كثير قبوله إياها .وإذ قد كان الكلام تذييلاً وتعليلاً للكلام السابق تعين أن حذف متعلق { تواباً } يُقدر بنحو : على التائبين . وهذا المقدر مراد به العموم ، وهو عموم مخصوص بالمشيئة تخصصه أدلة وصف الربوبية ، ولما ذكر دليل العموم عَقب أمرِه بالاستغفار أفاد أنه إذا استغفره غفر له دلالة تقتضيها مستتبعات التراكيب ، فأفادت هذه الجملة تعليل الأمر بالاستغفار لأن الاستغفار طلب لغفر ، فالطالب يترقب إجابة طلبه ، وأما ما في الجملة من الأمر بالتسبيح والحمد فلا يحتاج إلى تعليل لأنهما إنشاء تنزيه وثناء على الله .ومن وراء ذلك أفادت الجملة إشارة إلى وعدٍ بحسن القبول عند الله تعالى حينما يقدم على العالم القدسي ، وهذا معنى كنائي لأن من عُرف بكثرة قبول توبة التائبين شأنه أن يكرم وفادة الوافدين الذين سَعوْا جهودهم في مرضاته بمنتهى الاستطاعة ، أو هو مجاز بعلاقة اللزوم العرفي لأن منتهى ما يخافه الأحبة عند اللقاء مرارة العتاب ، فالإِخبار بأنه توّاب اقتضى أنه لا يخاف عتاباً .فهذه الجملة بمدلولها الصريح ومدلولها الكنائي أو المجازي ومستتبعاتها تعليل لما تضمنته الجملة التي قبلها من معنى صريح أو كنائي يناسبه التعليل بالتسبيح والحمد باعتبارهما تمهيداً للأمر بالاستغفار كما تقدم آنفاً لا يحتاجان إلى التعليل ، أو يغني تعليل الممهد له بهما عن تعليلهما ولكنهما باعتبار كونهما رمزاً إلى مداناة وفاة رسول الله صلى الله عليه وسلم يكون ما في قوله : { إنه كان تواباً } من الوعد بحسن القبول تعليلاً لمدلولهما الكنائي ، وأما الأمر بالاستغفار فمناسبة التعليل له بقوله : { إنه كان تواباً } ناهضة باعتبار كلتا دلالتيه الصريحة والكنائيّة ، أي إنه متقبل استغفارك ومتقبلك بأحسن قبول ، شأنَ من عهد من الصفح والتكرم .وفعل { كان } هنا مستعمل في لازم معنى الاتصاف بالوصف في الزمن الماضي . وهو أن هذا الوصف ذاتي له لا يتخلف معموله عن عباده فقد دل استقراء القرآن على إخبار الله عن نفسه بذلك من مبدأ الخليقة قال تعالى : { فتلقى آدم من ربه كلمات فتاب عليه إنه هو التواب الرحيم } \\[ البقرة : 37 \\] .ومقتضى الظاهر أن يقال : إنه كان غفّاراً ، كما في آية : { فقلت استغفروا ربكم إنه كان غفاراً } \\[ نوح : 10 \\] فيُجرى الوصف على ما يناسب قوله : { واستغفره } ، فعُدل عن ذلك تلطفاً مع النبي صلى الله عليه وسلم بأنَّ أمره بالاستغفار ليس مقتضياً إثبات ذنب له لما علمت آنفاً من أن وصف ( تواب ) جاء من تاب عليه الذي يستعمل بمعنى وفقه للتوبة إيماء إلى أن أمره بالاستغفار إرشاد إلى مقام التأدب مع الله تعالى ، فإنه لا يُسأل عما يفعل بعباده ، لولا تفضله بما بيَّن لهم من مراده ، ولأن وصف ( توّاب ) أشد ملاءمة لإقامة الفاصلة مع فاصلة { أفواجاً } لأن حرف الجيم وحرف الباء كليهما حرف من الحروف الموصوفة بالشدة ، بخلاف حرف الراء فهو من الحروف التي صفتها بين الشدة والرِّخوة .وروي في «الصحيح» عن عائشة قالت : «ما صلى رسول الله صلى الله عليه وسلم صلاةً بعد أن نزلت عليه سورة : { إذا جاء نصر الله والفتح } إلا يقول : \" سبحانك ربّنا وبحمدك ، اللهم اغفر لي يتأول القرآن \" أي يتأول الأمر في قوله : { فسبح بحمد ربك واستغفره } على ظاهره كما تأوله في مقام آخر على معنى اقتراب أجله صلى الله عليه وسلم\n\n",
      "translations": [
        {
          "translation": "(Then hymn the praises of thy Lord) pray by the command of your Lord in gratitude for this, (and seek forgiveness of Him) from sins. (Lo! He is ever ready to show mercy) and forgiving. The Prophet (pbuh) was therefore informed in this surah that he was to die soon'. And of the surah in which Abu Lahab is mentioned, which is all Meccan and consists of 5 verses, 23 words and 77 letters: Surah 111: Palm Fibre (al-Masad) And of the surah in which Abu Lahab is mentioned, which is all Meccan and consists of 5 verses, 23 words and 77 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فسبح } أي: نزّه ذاتك من الاحتجاب بمقام القلب الذي هو معدن النبوّة بقطع علاقة البدن والترقي إلى مقام حق اليقين الذي هو معدن الولاية { بحمد ربّك } أي: حامداً له بإظهار كمالاته وأوصافه التامة عند التجريد بالحمد الفعلي { واستغفره } واطلب ستره ذاتك بذاته كما كان حال الفناء قبل الرجوع إلى الخلق أبداً { إنه كان توّاباً } قابلاً لرجوع من رجع إليه بإفنائه بنوره\n ولما كمل الدين واستقرّت دعوته التي كانت بعثته لأجلها أمره بالرجوع إلى مقام حق اليقين الذي لا يستمر إلا بعد الموت\n ولذلك\n \" لما نزلت فقرأها رسول الله صلى الله عليه وسلم استبشر الأصحاب وبكى ابن عباس فقال صلى الله عليه وسلم: \" ما يبكيك؟ \" قال: نعيت إليك نفسك! فقال عليه السلام: \" لقد أوتي هذا الغلام علماً كثيراً \"\n \n\n \" وروي أنها لما نزلت خطب رسول الله صلى الله عليه وسلم فقال: \" إنّ عبداً خيّره الله بين الدنيا وبين لقائه فاختار لقاء الله \" \n فعلم أبو بكر رضي الله عنه فقال: فديناك بأنفسنا وأموالنا وآبائنا وأولادنا \"\n \n\n \" وعنه أنه دعا فاطمة عليها السلام فقال: \" يا بنتاه! نعيت إلي نفسي \" فبكت فقال: \" لا تبكي فإنك أول أهلي لحوقاً بي \" \n فضحكت \" \nوتسمى هذه السورة سورة التوديع\n وروي أنه عاش بعدها سنتين ونزلت في حجة الوداع",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَسَبِّحْ بِحَمْدِ رَبِّكَ } يا أكمل الرسل\n شكراً لما أعطاك جميع ما وعدك\n وفتح عليك الآفاق\n وأتم ببعثتك وظهورك محاسن الشيم ومكارم الأخلاق { وَٱسْتَغْفِرْهُ } واطلب منه العفو والغفران من لدنه\n هضماً لنفسك وفرطاتك\n إذ قلمَّا يخلو المبشر من الخطر\n\n\n{ إِنَّهُ كَانَ تَوَّاباً } [النصر: 3] يغفر من استغفر له\n ويقبل توبة من أناب إليه أيضاً\n سيما إذا كانت مقرونة بالإخلاص\n\n\nوبعدما نزلت هذه السورة\n وأمر سبحانه صلى الله عليه وسلم بالحمد والاستغفار\n تغمم الأصحاب وتحزنوا\n وفهموا منها أن أجل رسول الله صلى الله عليه وسلم قد قرُب\n فودَّعه الحق\n وأمره بالحمد والاستغفار\n لذلك سما هذه السورة سورة التوديع أيضاً\n\n\nخاتمة السورة\n\nعليك أيها الطالب للنجاة الأخروية والراغب إلى اللذات اللدنية الروحانية الموعودة فيها أن تستغفر إلى الله\n وتسترجع نحوه في أوقاتك وحالاتك\n وتفوض أمورك كلها إليه\n وتتخذه وكيلاً\n وتجعله حسيباً وكفيلاً\n فلك أن تواظب على الطاعات والعبادات\n وتجتنب عن مطلق المحارم والمنكرات\n يحفظك الحق عن جميع الملمَّات ويوصلك إلى عموم المهمات بفضله ولطفه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فإذا رأيتَ ما ذكر من النصر والفتح { فَسَبِّح بحمد ربك } أي: قل سبحان الله\n حامداً له\n أو: فصلّ له { واستغفره } تواضعاً وهضماً للنفس\n أو: دُمْ على الاستغفار\n { إِنه كان } ولم يزل { تواباً } كثير القبول للتوبة\n\nروت عائشةُ رضي الله عنها أنَّ النبيّ صلى الله عليه وسلم: لَمّا فتح مكة\n وأسلمت العرب\n جعل يُكثر أن يقول:\n \" سبحانك اللهم وبحمدك\n وأستغفرك وأتوب إليك\n يتأوّل القرآن \" \nيعني في هذه السورة\n وقال لها مرة:\n \" ما أراه إلاَّ حضور أجلي \" \n\n وتأوَّله العباس وعمر رضي الله عنهما بذلك بمحضره صلى الله عليه وسلم فصدّقهما\n ونزع هذا المنزع ابن عباس وغيره\n الإشارة: إذا جاءتك أيها المريد نصر الله لك\n بأن قوّاك على خرق عوائد نفسك\n وأظفرك بها والفتح وهو دخول مقام الفناء\n وإظهار أسرار الحقائق ورأيت الناسَ يدخلون في طريق الله أفواجاً\n فسبّح بحمد ربك\n أي: نزّه ربك عن رؤية الغيرية والأثنينية في ملكه\n واستغفره من رؤية وجود نفسك\n قال القشيري: ويقال النصر من الله بأن أفناه عن نفسه\n وأبعد عنه أحكام البشرية\n وصفّاه من الكدورات النفسانية\n وأمّا الفتح فهو: أن رقَّاه إلى محل الدنو\n واستخلصه بخصائص الزلفة\n وألبسه لباس الجمع\n وعرّفه من كمال المعرفة ما كان جميع الخلق متعطشاً إليه\n هـ\n وقال الورتجبي فَسَبِّح بحمد ربك أي: سبِّحه بحمده لا بك\n أي: فسبِّحه بالحمد الذي حمد به نفسه\n واستغفِره من حمدك وثنائك وجميع أعمالك وعرفانك\n فإنّ الكل معلول إذ وصف الحدثان لا يليق بجمال الرحمن\n إنه كان قابل التوب من العجز عن إدراك كنه قدسه\n والاعتراف بالجهل عن معرفة حقيقة وجوده\n هـ\n وصلّى الله على سيدنا محمد وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:98",
      "similarity": 0.6444732658602799
    },
    {
      "verse": "64:1",
      "similarity": 0.5186800830519908
    },
    {
      "verse": "5:74",
      "similarity": 0.5156345504904318
    },
    {
      "verse": "37:182",
      "similarity": 0.47996968080659125
    },
    {
      "verse": "1:2",
      "similarity": 0.47506140263638413
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/110003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/110003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/110:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}