{
  "chapter": "اللهب",
  "text": "فى جيدها حبل من مسدۭ",
  "translations": [
    {
      "translation": "Will have a strap of fibre rope around her neck.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "upon her neck shall be a rope of palm-fibre.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and so too will his wife who (threw thorns and firewood in the Prophet's way). Around her neck will be a rope of palm fibre.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A rope made from palm fibre around her neck!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In her neck is a twisted rope of Masad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon her neck a halter of strongly twisted rope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "upon her neck a rope of palm-fibre.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will have upon her neck a halter of palm-fibre.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "with a rope of twisted fibre round her neck.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On her neck shall be a cord of twisted fibre.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "with a rope of palm fibre around her neck.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A twisted rope of palm-leaf fibre round her (own) neck!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In her neck is a twisted rope of Masad (palm fibre).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "shall have a rope of palmfiber around her neck!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Around her neck is a rope of thorns.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Around her neck is a rope of [twisted] fiber.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[111:5] with a rope of palm-fibre around her neck (fī jīdihā hablun min masadin is a circumstantial qualifier referring to hammālata’l-hatab, which in turn is [either] a description of imra’atahu, ‘his wife’, or the predicate of an implied subject). Meccan or Medinese, consisting of 4 or 5 verses. The Prophet (s) was asked about his Lord and the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Will have upon her neck a halter of palm fibre) and this halter strangulated her and she died as a result; it is also said that this means: she will have an iron chain on her neck'. And of the surah in which Unity is mentioned, which is all Meccan and consists of 4 verses, 15 words and 47 777 letters: Surah 112: The Sincerity (al-lkhlas) And of the surah in which Unity is mentioned, which is all Meccan and consists of 4 verses, 15 words and 47 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي جِيدِهَا } معناه في عُنقِها\n { حَبْلٌ مِّن مَّسَدٍ } معناه من لِيفٍ\n والمَسدُ: حَبلُ اللّيفِ\n ويقال: من حَديدٍ ويقال: قِلادةٌ من وَدعٍ\n ويقال: المسَدُ: حَديدُ البَكرةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فِي جِيدِهَا } وعنقها { حَبْلٌ } سلسلة متخذة { مِّن مَّسَدٍ } [المسد: 5] مفتول قد فُتل من الحديد، تحمل بها الحطب مع أنها من أشراف قريش، هي وزوجها أيضاً\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المعتبر المستبصر - عصمك الله من تباب الدارين وخسارهما ويوارهما - أن تتأمل في مرموزات القرآن من القصص والأحكام والعبر والأمثال، فتأخذ حظك منها مقدار ما يسر الله لك، وأودعه في وسعك وطاقتك\n\n\n\n\nفاعلم أن كل ما في القرآن إنما نزل للإرشاد والتكميل، فلك أن تأخذ من إشارات هذه السورة حسن المعاشرة وآداب المصاحبة، وحقارة مزخرفات الدنيا وما يترتب عليها من اللذات الوهمية، الساقطة عن درجة الاعتبار، الزائغة الزائلة بلا قرار ومدار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقُرىء \" ومُرَيَّتُه \" فالتصغير للتحقير، { في جِيدِها } في عُنقها { حَبْلٌ من مَسَد } والمسد: الذي فُتل من الحبال فتلاً شديداً من ليف المُقْل أو من أي ليفٍ كان وقيل: من لحاء شجر باليمن، وقد يكون من جلود الإبل وأوبارها\n قال الأصمعي: صلّى أربعة من الشعراء خلف إمام اسمه \" يحيى \" فقرأ: \" قل هو الله أحد \" فتعتع فيها، فقال أحدهم:\n\nوقال الثاني:\n\nوقال الثالث:\n\nوقال الرابع:\n\nوالمعنى: في جيدها حبل مما مُسد من الحبال، وأنها تحمل تلك الحزمة من الشوك، وتربطها في جيدها، كما يفعل الحطّابون، تحقيراً لها، وتصويراً لها، بصورة بعض الحطّابات، لتجزع من ذلك ويجزع بعلُها، وهما من بيت الشرف والعزّ\n رُوي أنها لمّا نزلت فيها الآية أتت بيتَه صلى الله عليه وسلم وفي يدها حجر، فدخلت على النبي صلى الله عليه وسلم، ومعه الصدّيق، فأعماها اللهُ عن رسول صلى الله عليه وسلم ولم ترَ إلاّ الصدّيق، قالت: أين محمد؟ بلغني أنه يهجوني، لئن رأيته لأضربن فاه بهذا الفِهر\n هـ\n ومن أين ترى الشمسَ مقلةٌ عمياء، وقيل: هو تمثيل وإشارة لربطها بخذلانها عن الخير، ولذلك عظم حرصها على التكذيب والكفر\n قال مُرة الهمداني: كانت أم جميل تأتي كل يوم بحزمة من حسك، فتطرحها في طريق المسلمين، فبينما هي ذات ليلة حاملة حزمة أعيت، فقعدت على حجر لتستريح، فجذبها الملك من خلفها بحبلها فاختنقت، فهلكت\n هـ\n الإشارة: إنما تبّت يدا أبي لهب، وخسر، وافتضح في القرآن على مرور الأزمان، لأنه أول مَن أظهر الكفر والإنكار، فكان إمام المنكِرين، فكل مَن بادر بالإنكار على أهل الخصوصية انخرط في سلك أبي لهب لا يُغني عنه مالُه وما كسب وسيصلى نارَ القطيعة والبُعد ذات احتراق ولهب، وامرأته، اي: نفسه، حمّالة حطب الأوزار، في جيدها حبل من مسد الخذلان\n وبالله التوفيق وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ]
}