{
  "chapter": "الإخلاص",
  "text": "ولم يكن له كفوا احدۢ",
  "translations": [
    {
      "translation": "And no one is comparable to Him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no one comparable to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and none is comparable to Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no one equal to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And there is none equal to Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none comparable to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And none is like Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and equal to Him is not any one.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none comparable unto Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there is nothing like Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there hath never been co-equal with Him anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor has He any equal.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none like unto Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none co-equal or comparable unto Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there is none equal to Him'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is nothing comparable to Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor is there to Him any equivalent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[112:4] Nor is there anyone equal to Him’, neither match nor comparison (lahu, ‘to Him’, is semantically connected to kufuwan, ‘equal’, but precedes it because it is the object of the intended negation; ahadun, ‘anyone’, which is the subject of yakun, ‘is there’, has been placed after the predicate of the latter [kufuwan, ‘equal’] in order to retain the harmony of the end-rhyme [of the verses]). Meccan or Medinese, consisting of 5 verses. This sūra and the next one were revealed when Labīd the Jew placed a spell on the Prophet (s) using a string with eleven knots. God informed him of this and of its place, and so it was brought before the Prophet (s) and he was commanded to ‘seek refuge [in God]’ by means of these two sūras; and so each time he recited a verse from them, a knot would become undone and he would sense an alleviation, until in the end all the knots had been undone and he stood up invigorated, as if he had previously been hobbled to the ground.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And there is none comparable unto Him) He says: He does not have an opposite, peer, or equal nor anyone who may resemble or begin to resemble Him; and it is also said this means: He does not have any co-equal who would compete with Him about dominion and sovereignty'. And of the surah in which Daybreak is mentioned, which is all Meccan-and it is also said it is Medinan-and consists of 5 verses, 23 words and 69 letters: Surah 113: Daybreak (al-Falaq) And of the surah in which Daybreak is mentioned, which is all Meccan — and it is also said it is Medinan — and consists of 5 verses, 23 words and 69 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولم يكن له كفواً أحد } إذ لا يكافىء العدم الصرف الوجود المحض، ولهذا سميت سورة الأساس، إذ أساس الدين على التوحيد بل أساس الوجود\n وعن أنس عن النبي صلى الله عليه وسلم أنه قال:\n\n \" أسست السماوات السبع والأرضون السبع على قل هو الله أحد \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } باجملة: هو سبحانه منفرد في توحده، متوحد في انفراده، ومستقل في استقلاقه، بحيث { لَمْ يَكُنْ لَّهُ كُفُواً أَحَدٌ } [الإِخلاص: 4] لا قبله ولا بعده، بل لا إله سواه، ولا موجود غيره\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الموحد المحمدي المنكشف بالتوحيد الذاتي - مكنك الله في مقر عزك وتمكينك - أن تصرف عنان عزمك وهمتك بعدما كوشفت بتوحيده الذاتي وكمالات أسمائه وصفاته نحو سوابغ آلائه ونعمائه الفائضة منه سبحانه حسب رقائق أسمائه الحسنى وأوصافه العظمة، وتشاهد آثار قدرته الغالبة التي تتحير منه العقول والآراء\n\n\n\n\nوإياك إياك أن تغفل عن الله طرفة، فإنها تورثك حسرة طويلة؛ إذ كل نفس من النفسات الإلهية التي جرت عليك في أوقات حياتك مشتملة على عجائب صنع الله وبدائع حكمته المتقنة البالغة، بحيث ما مضى مثلها أزلاً ولا سيأتي شبهها أبداً، فعليك أن تغتنم الفرصة وتتعرض للنفحات الإلهية، ولا يشغلك شيء منها\n\n\n\n\nجعلنا الله من المتعرضين بنفحات الحقن المستنشقين من نسمات روحه وراحته بمنِّه وجوده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والتصريح به مع كونهم معترفين بمضمونه لتقرير ما قبله وتحقيقه وللإشارة إلى أنهما متلازمان، إذ المعهود أنَّ ما يلد يولد، وما لا فلا، ومِن قضية الاعتراف بأنه لم يلد: الاعتراف بأنه لم يُولد، { ولم يكن له كُفُواً أحَدٌ } أي: ولم يكن أحد مماثلاً له ولا مشاكلاً، مِن صاحبة أو غيرها\n وله: متعلق بـ \" كُفُواً \" ، قدمت عليه للاهتمام بها لأنَّ المقصود نفي المكافأة عن ذاته تعالى، وأمّا تأخير اسم كان فلمراعاة الفواصل\n ووجه الوصل في هذه الجُمل غَنِي عن البيان\n هذا ولانطواء السورة الكريمة، مع تقارب قطريها، على أنواع المعارف الإلهية والأوصاف القدسية، والرد على مَن ألحد فيها، ورد في الحديث النبوي: أنها تعدل ثلث القرآن، فإنّ مقاصده منحصرة في بيان العقائد والأحكام والقصص، وقد استوفت العقائد لمَن أمعن النظر فيها\n عن النبي صلى الله عليه وسلم:\n\n \" أُسست السموات السبع والأرضون السبع على { قل هو الله أحد } \" \n\nأي: ما خلقت إلاَّ لتكون دلائل توحيده، ومعرفة ذاته، التي نطقت بها هذه السورة الكريمة\n وعنه صلى الله عليه وسلم أنه سمع رجلاً يقرؤها، فقال:\n\n \" \" وجبت \" فقيل: وما وجبت؟ فقال: \" الجنة \" ، وشكى إليه رَجُلٌ الفقرَ وضيق المعاش، فقال له صلى الله عليه وسلم: \" إذا دخلت بيتك فسَلِّم إن كان فيه أحد، وإلا فسَلِّم عليّ واقرأ: { قل هو الله أحد } \" ففعل الرجل، فأدرّ اللهُ عليه الرزق، حتى أفاض على جيرانه \" \n\n، وخرّج الترمذي: أنَّ رسولَ الله صلى الله عليه وسلم قال:\n\n \" من قرأ { قل هو الله أحد } مائتي مرة في يوم غُفرت له ذنوب خمسين سنة، إلاّ أن يكون عليه دَيْن \" \n\n، وفي الجامع الصغير أحاديث في فضل السورة تركناه خوف الإطناب\n الإشارة: قد اشتملت السورةُ على التوحيد الخاص، أعني: توحيد أهل العيان، وعلى التوحيد العام، أعني: توحيد أهل البرهان، فالتوحيد الخاص له مقامان: مقام الأسرار الجبروتية، ومقام الأنوار الملكوتية، فكلمة هو تُشير إلى مقام الأسرار اللطيفة الأصلية الجبروتية\n\n\nوالله يشير إلى مقام الأنوار الكثيفة المتدفقة من بحر الجبروت لأنّ حقيقة المشاهدة: تكثيف اللطيف، وحقيقة المعاينة: تلطيف الكثيف، فالمعاينة أرقّ، فشهود الكون أنواراً كثيفة فاضت من بحر الجبروت مشاهدة، فإذا لَطَّفها حتى اتصلت بالبحر اللطيف المحيط، وانطبق بحر الأحدية على الكل سُميت معاينةً، ووصفه تعالى بالأحدية والصمدية والتنزيه عن الولد والوالد يحتاج إلى استدلال وبرهان، وهو مقام الإيمان، والأول مقام الإحسان فالآية من باب التدلي\n قال القشيري: يقال كاشَفَ تعالى الأسرارَ بقوله هو والأرواحَ بقوله: الله وكاشف القلوبَ بقوله: أحد وكاشف نفوسَ المؤمنين بباقي السورة\n ويُقال: كاشف الوالهين بقوله: هو والموحِّدين بقوله: الله والعارفين بقوله: أحد والعلماء بالباقي، ثم قال: ويُقال: خاطب خاصة الخاص بقوله: هو فاستقلوا، ثم خاطب الخواص بقوله الله فاشتغلوا، ثم زاد في البيان لمَن نزل عنهم، فقال: أحد، ثم نزل عنهم بالصمد، وكذلك لمَن دونهم\n هـ\n وقال في نوادر الأصول: هو اسم لا ضمير، من الهوية، أي: الحقيقة\n انظر بقية كلامه\n قال شيخ شيوخنا، سيدي عبد الرحمن العارف: والحاصل: أنَّ الإشارة بـ \" هو \" مختصة بأهل الاستغراق والتحقُّق في الهوية الحقيقة، فلانطباق بحر الأحدية عليهم، وانكشاف الوجود الحقيقي لديهم، فقدوا مَن يشار إليه إلاّ هو، لأنّ المُشار إليه لمّا كان واحداً كانت الإشارة مطلقة لا تكون إلاّ إليه، لفقد ما سواه في شعورهم، لفنائهم عن الرسوم البشرية بالكلية، وغيبتهم عن وجودهم، وعن إحساسهم وأوصافهم الكونية، وذلك غاية في التوحيد والإعظام\n منحنا اللهُ ذلك على الدوام، وجعلنا من أهله، ببركة نبيه عليه الصلاة والسلام\n وبالله التوفيق، وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:152",
      "similarity": 0.029625791511217695
    },
    {
      "verse": "5:20",
      "similarity": 0.029246036139286863
    },
    {
      "verse": "90:7",
      "similarity": 0.029080332800666978
    },
    {
      "verse": "24:28",
      "similarity": 0.028586294599210194
    },
    {
      "verse": "5:27",
      "similarity": 0.027502756031335437
    }
  ]
}