{
  "chapter": "الإخلاص",
  "text": "قل هو الله احد",
  "translations": [
    {
      "translation": "Say: 'He is Allah, Absolute Oneness,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "SAY: \"HE IS God the one the most unique,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “He is Allah, the One and Unique;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"He is the only God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “He is Allah, He is One.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He is Allah, One.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He, Allah, is One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He is God, One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He is Allah, the One!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He is God, the One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: He is Allah, the One!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘He is Allah, the One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He is Allah, the One and Only;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad (Peace be upon him)): \"He is Allah, (the) One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He is Allah, the One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “He is God, the One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He is Allah, [who is] One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[112:1] Say: ‘He is God, One (Allāhu is the predicate of huwa, ‘He is’, and ahadun is its substitution or a second predicate).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Say: He is Allah, the One!): '(Say: He is Allah, the One!) the people of Quraysh asked the Prophet (pbuh): \"0 Muhammad! Describe for us your Lord; is He made of gold or silver?\" And so Allah revealed this surah to describe His attributes and traits, saying: say to Quraysh, Muhammad: He is Allah, the One, He has no son or partner.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nقولهِ تعالى: { قُلْ هُوَ ٱللَّهُ أَحَدٌ } معناه واحدٌ { ٱللَّهُ ٱلصَّمَدُ } ، فالصَّمدُ: هو السَّيدُ الذي لَيسَ فَوقَهُ أحدٌ\n ولا يُدانيهِ أحدٌ\n المَرغوبُ إليه عِندَ الرّغائبِ\n المَفزوعُ إليهِ في النَّوائبِ\n والصَّمدُ: الباقي الدَائمُ\n ويقال: هو الله أحدٌ: ليسَ مَعهُ شَريكٌ",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمن سأل عنك بقوله: صف لنا ربك ألذي تدعونا إلى الإيمان به وعبادته: { هُوَ ٱللَّهُ أَحَدٌ } [الإِخلاص: 1] أي: هو الذات المتصف بالألوهية الغيبية والشهادة، المتعالية عن كليهما بحسب ذاته المتصفة بالألوهية والربوبية، المستجمعة لجميع شرائط الكمال حسب الأسماء والصفات الكاملة، الكامنة في تلك الذات المتصفة بالأحدية المطلقة المنزهة عن التعدد والكثرة مطلقاً، المستقل في الوجود والحياة والقيومية المستلزمة للديمومية والبقاء الأزلي الأبدي السرمدي، الذي كان لا يكال بقاؤه ودوامه بمطلق الموازين والمقادير، ولا يحيط به وبقيوميته مطل التدابير والتقادير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { هو } ضمير الشأن مبتدأ، والجملة بعده خبر، ولا تحتاج إلى رابط لأنها نفس المبتدأ، فإنها عين الشأن الذي عبّر عنه بالضمير، ورفعه من غير عائد يعود عليه للإيذان بأنه الشُهرة والنباهة بحيث يستحضرة كلُّ أحد، وإليه يُشير كل مُشير وعليه يعود كل ضمير، كما يُنبىء عنه اسم الشأن الذي هو القصد\n والسر في تصدير الجملة به للتنبيه من أول الأمر على فخامة مضمونها وجلالة حيزها، مع ما فيه من زيادة تحقيقٍ وتقرير، فإنَّ الضمير لا يُفهم منه من أول الأمر إلاّ شأن مبهم، له خطر جليلٍ، فيبقى الذهن مترقباً لِما أمامه مما يفسره ويزيل إبهامه، فيتمكن عند وروده له فضل تمكُّن\n وكل جملة بعد خبره مقرِّره لِما قبلها على ما يأتي\n يقول الحق جلّ جلاله مجيباً للمشركين لَمّا قالوا: صِفْ لنا ربك الذي تدعونا إليه، وانسبه؟ فسكت عنهم صلى الله عليه وسلم فنزلت، أو اليهود، لَمّا قالوا: صِفْ لنا ربك وانسبه، فإنه وَصَفَ نفسه في التوراة ونَسَبَها، فارتعد رسولُ الله صلى الله عليه وسلم حتى خَرّ مغشيًّا عليه، فنزل جبريلُ عليه السلام بالسورة\n ويمكن أن تنزل مرتين كما تقدّم\n فقال جلّ جلاله: { قل هو اللهُ } المعبود بالحق، الواجب الوجود، المستحق للكمالات { أحَدٌ } لا شريك له في ذاته، ولا في صفاته، ولا في أفعاله، لا يتبعّض ولا يتجزّأ ولا يُحد، ولا يُحصَى، أول بلا بداية، وآخر بلا نهاية، ظاهر بالتعريف لكل أحد، باطن في ظهوره عن كل أحد\n وأصل { أحد } هنا \" وَحَد \" فأبدلت الواو همزة، وليست كأحد الملازم للنفي، فإنَّ همزة أصلية\n ووصفه تعالى بالوحدانية له ثلاث معان، الأول: أنه لا ثاني له، فهو نفي للعدد، والآخر: أنه واحد لا نظير له ولا شريك له، كما تقول: فلان واحد عصره، أي: لا نظير له، الثالث: أنه واحد لا ينقسم ولا يتبعّض\n والأظهر أن المراد هنا: نفي الشريك، لقصد الرد على المشركين\n انظر ابن جزي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:35",
      "similarity": 0.7324878206746122
    },
    {
      "verse": "89:25",
      "similarity": 0.6849031143157028
    },
    {
      "verse": "72:20",
      "similarity": 0.6066382369191171
    },
    {
      "verse": "5:115",
      "similarity": 0.597547392987788
    },
    {
      "verse": "18:38",
      "similarity": 0.5822343383470464
    }
  ]
}