{
  "chapter": "الإخلاص",
  "text": "قل هو الله احد",
  "translations": [
    {
      "translation": "Say: 'He is Allah, Absolute Oneness,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "SAY: \"HE IS God the one the most unique,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “He is Allah, the One and Unique;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"He is the only God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “He is Allah, He is One.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He is Allah, One.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He, Allah, is One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He is God, One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He is Allah, the One!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He is God, the One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: He is Allah, the One!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘He is Allah, the One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He is Allah, the One and Only;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad (Peace be upon him)): \"He is Allah, (the) One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He is Allah, the One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “He is God, the One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He is Allah, [who is] One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[112:1] Say: ‘He is God, One (Allāhu is the predicate of huwa, ‘He is’, and ahadun is its substitution or a second predicate).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ هُوَ اللَّهُ أَحَدٌ (1)افتتاح هذه السورة بالأمر بالقول لإِظهار العناية بما بعد فعل القول كما علمت ذلك عند قوله تعالى : { قل يا أيها الكافرون } \\[ الكافرون : 1 \\]ولذلك الأمر في هذه السورة فائدة أخرى ، وهي أنها نزلت على سبب قول المشركين : انْسُبْ لنا ربك ، فكانت جواباً عن سؤالهم فلذلك قيل له : { قل } كما قال تعالى : { قل الروح من أمر ربي } \\[ الإسراء : 85 \\] فكان للأمر بفعل { قل } فائدتان .وضمير { هو } ضمير الشأن لإِفادة الاهتمام بالجملة التي بعده ، وإذا سمعه الذين سألوا تطلعوا إلى ما بعده .ويجوز أن يكون { هو } أيضاً عائداً إلى الرب في سؤال المشركين حين قالوا : انسب لنا ربك .ومن العلماء من عَدّ ضمير { هو } في هذه السورة اسماً من أسماء الله تعالى وهي طريقة صوفية درج عليها فخر الدين الرازي في «شرح الأسماء الحسنى» نقله ابن عرفة عنه في «تفسيره» وذكر الفخر ذلك في «مفاتيح الغيب» ولا بد من المزج بين كلاميه .وحاصلهما قوله : { قل هو الله أحد } فيه ثلاثة أسماء لله تعالى تنبيهاً على ثلاثة مقامات .الأول : مقام السابقين المقربين الناظرين إلى حقائق الأشياء من حيث هِيَ هِيَ ، فلا جرم ما رأوا موجوداً سوى الله لأنه هو الذي لأجله يجب وجوده فما سوى الله عندهم معدوم ، فقوله : { هو } إشارة مطلقة . ولما كان المشار إليه معيناً انصرف ذلك المطلق إلى ذلك المعين فكان قوله : { هو } إشارة من هؤلاء المقربين إلى الله فلم يفتقروا في تلك الإِشارة إلى مميز فكانت لفظة { هو } كافية في حصول العرفان التام لهؤلاء .المقام الثاني : مقام أصحاب اليمين المقتصدين فهم شاهَدُوا الحق موجوداً وشاهدوا الممكنات موجودة فحصلت كثرة في الموجودات فلم تكن لفظة { هو } تامة الإِفادة في حقهم فافتقروا معها إلى مميز فقيل لأجلهم { هو اللَّه } .والمقام الثالث : مقام أصحاب الشمال وهم الذين يجوزون تعدد الإله فقُرن لفظ { أحد } بقوله : { هو اللَّه } إبطالاً لمقالتهم ا ه .فاسمه تعالى العلَم ابتدىء به قبل إجراء الأخبار عليه ليكون ذلك طريق استحضار صفاته كلّها عند التخاطب بين المسلمين وعند المحاجَّة بينهم وبين المشركين ، فإن هذا الاسم معروف عند جميع العرب فمسماه لا نزاع في وجوده ولكنهم كانوا يصفونه بصفات تَنَزَّه عنها .أما { أحد } فاسم بمعنى ( وَاحِد ) . وأصل همزته الواو ، فيقال : وحَد كما يقال : أحد ، قلبت الواو همزة على غير قياس لأنها مفتوحة ( بخلاف قلب واو وُجوه ) ومعناه منفرد ، قال النابغة: ... كأنَّ رحلي وقد زال النهارُ بنابذي الجليللِ على مستأنِسسٍ وَحَدِ ... أي كأني وضعتُ الرجل على ثورِ وحْششٍ أحَسَّ بأنسيّ وهو منفردٌ عن قطيعه .وهو صفة مشبهة مثل حَسَن ، يقال : وَحُد مثل كرُم ، ووَحِدَ مثل فرِح .وصيغة الصفة المشبهة تفيد تمكن الوصف في موصوفها بأنه ذاتيٌّ له ، فلذلك أوثر { أحد } هنا على ( واحد ) لأن ( واحد ) اسم فاعل لا يفيد التمكن .ف ( واحد ) و { أحد } وصفان مصوغان بالتصريف لمادة متحدة وهي مادة الوحدة يعني التفرد .هذا هو أصل إطلاقه وتفرعت عنه إطلاقات صارت حقائق للفظ ( أحد ) ، أشهرها أنه يستعمل اسماً بمعنى إنسان في خصوص النفي نحو قوله تعالى : { لا نفرق بين أحد من رسله } في البقرة ( 285 ) ، وقوله : { ولا أشرك بربي أحداً } في الكهف ( 38 ) وكذلك إطلاقه على العدد في الحساب نحو : أحد عشر ، وأحد وعشرين ، ومؤنثه إحدى ، ومن العلماء من خلط بين ( واحد ) وبين { أحد } فوقع في ارتباك .فوصف الله بأنه { أحد } معناه : أنه منفرد بالحقيقة التي لوحظت في اسمه العلَم وهي الإلهية المعروفة ، فإذا قيل : { اللَّه أحد } فالمراد أنه منفرد بالإلهية ، وإذا قيل : الله واحد ، فالمراد أنه واحد لا متعدد فمَن دونه ليس بإله . ومآل الوصفين إلى معنى نفي الشريك له تعالى في إلهيته .فلما أريد في صدر البعثة إثبات الوحدة الكاملة لله تعليماً للناس كلهم ، وإبطالاً لعقيدة الشرك وُصف الله في هذه السورة ب { أحد } ولم يوصف ب ( واحد ) لأن الصفة المشبهة نهايةُ ما يُمكن به تقريب معنى وحدة الله تعالى إلى عقول أهل اللسان العربي المبين .وقال ابن سينا في تفسير له لهذه السورة : إن { أحد } دالّ على أنه تعالى واحد من جميع الوجوه وأنه لا كثرة هناك أصلاً لا كثرةً معنوية وهي كثرة المقومات والأجناس والفصول ، ولا كثرة حسيّة وهي كثرة الأجزاء الخارجية المتمايزة عقلاً كما في المادة والصورة . والكثرة الحسية بالقوة أو بالفعل كما في الجسم ، وذلك متضمن لكونه سبحانه منزهاً عن الجنس والفصل ، والمادة والصورة ، والأعراض والأبعَاض ، والأعضاء ، والأشكال ، والألوان ، وسائر ما يُثلم الوحدة الكاملة والبَساطة الحَقَّة اللائقة بكرم وجهه عز وجل عن أن يشبهه شيء أو يساويه سبحانه شيء . وتبيينُه : أما الواحد فمقول على ما تحته بالتشكيك ، والذي لا ينقسم بوجه أصلاً أولى بالوحدانيَّة مما ينقسم من بعض الوجوه ، والذي لا ينقسم انقساماً عقليّاً أوْلَى بالوحدانية من الذي ينقسم انقساماً بالحسّ بالقوة ثم بالفعل ، ف { أحد } جامع للدلالة على الوحدانية من جميع الوجوه وأنه لا كثرة في موصوفه اه .قلت : قد فهم المسلمون هذا فقد روي أن بلالاً كان إذا عذب على الإِسلام يقول : أحَد أحد ، وكان شعار المسلمين يوم بدر : أحَد أحَد .والذي درج عليه أكثر الباحثين في أسماء الله تعالى أن { أحد } ليس ملحقاً بالأسماء الحسنى لأنه لم يرد ذكره في حديث أبي هريرة عند الترمذي قال : \" قال رسول الله صلى الله عليه وسلم إنَّ لله تسعة وتسعين اسماً من أحصاها دخل الجنة \" . وعدّها ولم يذكر فيها وصف أحد ، وذكر وصف واحد وعلى ذلك درج إمام الحرمين في كتاب «الإِرشاد» وكتاببِ «اللمع» والغزالي في «شرح الأسماء الحسنى» .وقال الفهري في «شرحه على لُمع الأدلة» لإِمام الحرمين عند ذكر اسمه تعالى «الواحد» . وقد ورد في بعض الروايات الأحد فلم يجمع بين الاسمين في اسم .ودرح ابن بَرَّجَان الإِشبيلي في «شرح الأسماء» والشيخ مُحمد بن محمد الكومي ( بالميم ) التونسي ، ولُطف الله الأرضرُومي في «معارج النور» ، على عدّ ( أحد ) في عداد الأسماء الحسنى مع اسمه الوَاحد فقالا : الواحد الأحد بحيث هو كالتأكيد له كما يقتضيه عدهم الأسماء تسعة وتسعين ، وهذا بناء على أن حديث أبي هريرة لم يقتضضِ حصر الأسماء الحسنى في التسعة والتسعين ، وإنما هو لبيان فضيلة تلك الأسماء المعدودة فيه .والمعنى : أن الله منفرد بالإلهية لا يشاركه فيها شيء من الموجودات . وهذا إبطال للشرك الذي يدين به أهل الشرك ، وللتثليث الذي أحدثه النصارى المَلْكانية وللثانوية عند المجوس ، وللعَدَد الذي لا يُحصى عند البراهمة .فقوله : { اللَّه أحد } نظير قوله في الآية الأخرى : { إنما الله إله واحد } \\[ النساء : 171 \\] . وهذا هو المعنى الذي يدركه المخاطبون بهذه الآية السائلون عن نسبة الله ، أي حقيقته فابتدىء لهم بأنه واحد ليعلموا أن الأصنام ليست من الإلهية في شيء .ثم إن الأحدية تقتضي الوجود لا محالة فبطل قول المعطلة والدُّهريين .وقد اصطلح علماء الكلام من أهل السنة على استخراج الصفات السلبية الربانية من معنى الأحدية لأنه إذا كان منفرداً بالإلهية كان مستغنياً عن المخصِّص بالإِيجاد لأنه لو افتقر إلى من يُوجده لكان من يوجده إلها أوَّلَ منه فلذلك كان وجود الله قديماً غير مسبوق بعدم ولا محتاج إلى مخصص بالوجُود بدَلاً عن العدم ، وكان مستعيناً عن الإمداد بالوجود فكان باقياً ، وكان غنياً عن غيره ، وكان مخالفاً للحوادث وإلا لاحتاج مثلَها إلى المخصص فكان وصفه تعالى : ب { أحد } جامعاً للصفات السلبية . ومثلُ ذلك يُقال في مرادفه وهو وصف وَاحد .واصطلحوا على أن أحدية الله أحدية واجبة كاملة ، فالله تعالى واحد من جميع الوجوه ، وعلى كل التقادير فليس لكُنْه الله كثرة أصلاً لا كثرة معنوية وهي تعدد المقوّمات من الأجناس والفصول التي تتقوم منها المواهي ، ولا كثرةُ الأجزاء في الخارج التي تتقوم منها الأجسام . فأفاد وصف { أحد } أنه منزه عن الجنس والفصل والمادة والصورة ، والأعراض والأبعاض ، والأعضاء والأشكال والألوان وسائر ما ينافي الوحدة الكاملة كما إشار إليه ابن سينا .قال في «الكشاف» : «وفي قراءة النبي صلى الله عليه وسلم { اللَّه أحد } بغير { قل هو } اه ، ولعله أخذه مما روي أن النبي صلى الله عليه وسلم قال من قرأ : { اللَّه أحد } كان بِعَدْل ثلثثِ القرآن ، كما ذكره بأثر قراءة أبيّ بدون { قل } كما تأوله الطيبي إذ قال : وهذا استشهاد على هذه القراءة .وعندي إن صح ما روي من القراءة أن النبي صلى الله عليه وسلم لم يقصد بها التلاوة وإنما قصد الامتثال لما أمر بأن يقوله ، وهذا كما كان يُكثر أن يقول : \" سبحان ربي العظيم وبحمده اللهم اغفر لي \" يَتأول قوله تعالى : { فسبح بحمد ربك واستغفره } \\[ النصر : 3 \\] .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Say: He is Allah, the One!): '(Say: He is Allah, the One!) the people of Quraysh asked the Prophet (pbuh): \"0 Muhammad! Describe for us your Lord; is He made of gold or silver?\" And so Allah revealed this surah to describe His attributes and traits, saying: say to Quraysh, Muhammad: He is Allah, the One, He has no son or partner.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nقولهِ تعالى: { قُلْ هُوَ ٱللَّهُ أَحَدٌ } معناه واحدٌ { ٱللَّهُ ٱلصَّمَدُ } ، فالصَّمدُ: هو السَّيدُ الذي لَيسَ فَوقَهُ أحدٌ\n ولا يُدانيهِ أحدٌ\n المَرغوبُ إليه عِندَ الرّغائبِ\n المَفزوعُ إليهِ في النَّوائبِ\n والصَّمدُ: الباقي الدَائمُ\n ويقال: هو الله أحدٌ: ليسَ مَعهُ شَريكٌ",
      "translations": [
        {
          "translation": "\nThe saying of the Most High: {Say, He is Allah , the One} its meaning is One {Allah is the Self-Sufficient} , so Al-Samad: He is the Lord who is not above him anyone\n No one can convict him.\n\n\nThe desired one is desired by those who desire.\n\nThe preposition \"to\" is assigned to him in the functions.\n\n\nAnd as-Samad is the Everlasting.\n\n\nIt is said: \"He is God, the One. He has no partner.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ قل هو الله أحد } قل، أمر من عين الجمع وارد على مظهر التفصيل هو عبارة عن الحقيقة الأحدية الصرفة أي: الذات من حيث هي بلا اعتبار صفة لا يعرفها إلا هو، والله بدل منه وهو اسم الذات مع جميع الصفات دال بالإبدال على أن صفاته تعالى ليست بزائدة على ذاته بل هي عين الذات لا فرق إلا بالاعتبار العقلي ولهذا سميت سورة الإخلاص لأن الإخلاص تمحيص الحقيقة الأحدية عن شائبة الكثرة، كما قال أمير المؤمنين عليه السلام: \" كمال الإخلاص له نفي الصفات عنه \" ، لشهادة كل صفة أنها غير الموصوف وشهادة كل موصوف أنه غير الصفة، وإياه عنى من قال: صفاته تعالى لا هو ولا غيره، أي: لا هو باعتبار العقل ولا غيره بحسب الحقيقة. وأحد: خبر المبتدأ، والفرق بين الأحد والواحد أن الأحد هو الذات وحدها بلا اعتبار كثرة فيها أي: الحقيقة المحضة التي هي منبع العين الكافوري بل العين الكافوري نفسه وهو الوجود من حيث هو وجود بلا قيد عموم وخصوص وشرط عروض ولا عروض، والواحد هو الذات مع اعتبار كثرة الصفات وهي الحضرة الأسمائية لكون الاسم هو الذات مع الصفة فعبر عن الحقيقة المحضة الغير المعلومة إلا له بـ \" هو \" ، وأبدل عنها الذات مع جميع الصفات دلالة على أنها عين الذات وحدها في الحقيقة وأخبر عنها بالأحدية ليدلّ على أن الكثرة الاعتبارية ليست بشيء في الحقيقة وما أبطلت أحديته وما أثرت في وحدته، بل الحضرة الواحدية هي بعينها الحضرة الأحدية بحسب الحقيقة كتوهم القطرات في البحر مثلاً.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمن سأل عنك بقوله: صف لنا ربك ألذي تدعونا إلى الإيمان به وعبادته: { هُوَ ٱللَّهُ أَحَدٌ } [الإِخلاص: 1] أي: هو الذات المتصف بالألوهية الغيبية والشهادة\n المتعالية عن كليهما بحسب ذاته المتصفة بالألوهية والربوبية\n المستجمعة لجميع شرائط الكمال حسب الأسماء والصفات الكاملة\n الكامنة في تلك الذات المتصفة بالأحدية المطلقة المنزهة عن التعدد والكثرة مطلقاً\n المستقل في الوجود والحياة والقيومية المستلزمة للديمومية والبقاء الأزلي الأبدي السرمدي\n الذي كان لا يكال بقاؤه ودوامه بمطلق الموازين والمقادير\n ولا يحيط به وبقيوميته مطل التدابير والتقادير\n\n\nفكيف كان سبحانه محلاً للتقدير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { هو } ضمير الشأن مبتدأ\n والجملة بعده خبر\n ولا تحتاج إلى رابط لأنها نفس المبتدأ\n فإنها عين الشأن الذي عبّر عنه بالضمير\n ورفعه من غير عائد يعود عليه للإيذان بأنه الشُهرة والنباهة بحيث يستحضرة كلُّ أحد\n وإليه يُشير كل مُشير وعليه يعود كل ضمير\n كما يُنبىء عنه اسم الشأن الذي هو القصد\n والسر في تصدير الجملة به للتنبيه من أول الأمر على فخامة مضمونها وجلالة حيزها\n مع ما فيه من زيادة تحقيقٍ وتقرير\n فإنَّ الضمير لا يُفهم منه من أول الأمر إلاّ شأن مبهم\n له خطر جليلٍ\n فيبقى الذهن مترقباً لِما أمامه مما يفسره ويزيل إبهامه\n فيتمكن عند وروده له فضل تمكُّن\n وكل جملة بعد خبره مقرِّره لِما قبلها على ما يأتي\n يقول الحق جلّ جلاله مجيباً للمشركين لَمّا قالوا: صِفْ لنا ربك الذي تدعونا إليه\n وانسبه؟ فسكت عنهم صلى الله عليه وسلم فنزلت\n أو اليهود\n لَمّا قالوا: صِفْ لنا ربك وانسبه\n فإنه وَصَفَ نفسه في التوراة ونَسَبَها\n فارتعد رسولُ الله صلى الله عليه وسلم حتى خَرّ مغشيًّا عليه\n فنزل جبريلُ عليه السلام بالسورة\n ويمكن أن تنزل مرتين كما تقدّم\n فقال جلّ جلاله: { قل هو اللهُ } المعبود بالحق\n الواجب الوجود\n المستحق للكمالات { أحَدٌ } لا شريك له في ذاته\n ولا في صفاته\n ولا في أفعاله\n لا يتبعّض ولا يتجزّأ ولا يُحد\n ولا يُحصَى\n أول بلا بداية\n وآخر بلا نهاية\n ظاهر بالتعريف لكل أحد\n باطن في ظهوره عن كل أحد\n وأصل { أحد } هنا \" وَحَد \" فأبدلت الواو همزة\n وليست كأحد الملازم للنفي\n فإنَّ همزة أصلية\n ووصفه تعالى بالوحدانية له ثلاث معان\n الأول: أنه لا ثاني له\n فهو نفي للعدد\n والآخر: أنه واحد لا نظير له ولا شريك له\n كما تقول: فلان واحد عصره\n أي: لا نظير له\n الثالث: أنه واحد لا ينقسم ولا يتبعّض\n والأظهر أن المراد هنا: نفي الشريك\n لقصد الرد على المشركين\n انظر ابن جزي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:35",
      "similarity": 0.7324878206746122
    },
    {
      "verse": "89:25",
      "similarity": 0.6849031143157028
    },
    {
      "verse": "72:20",
      "similarity": 0.6066382369191171
    },
    {
      "verse": "5:115",
      "similarity": 0.597547392987788
    },
    {
      "verse": "18:38",
      "similarity": 0.5822343383470464
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/112001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/112001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/112:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}