{
  "chapter": "الناس",
  "text": "من شر الوسواس الخناس",
  "translations": [
    {
      "translation": "from the evil of the insidious whisperer",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the evil of him who breathes temptations into the minds of men,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from the mischief of the whispering, elusive prompter who returns again and again,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "against the evil of the temptations of the satans,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“From the evil of the one who instils evil thoughts in the hearts – and stays hidden.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the evil of the whisperer who withdraws.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the evil of the whisperings of the slinking (Shaitan),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from the evil of the slinking whisperer\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the evil of the sneaking whisperer,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from the mischief of every sneaking whis-perer,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the evil of the sneaking whisperer\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from the evil of the sneaky tempter\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the mischief of the Whisperer (of Evil), who withdraws (after his whisper),-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the evil of the whisperer (devil who whispers evil in the hearts of men) who withdraws (from his whispering in one's heart after one remembers Allah),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from the evil of the slinking whisperer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the evil of the sneaky whisperer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the evil of the retreating whisperer -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[114:4] from the evil of the slinking whisperer, Satan — he is referred to by the name of the action [waswasa] on account of his repeated engaging in it — who slinks [away] and recoils from the heart whenever God is mentioned,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(From the evil of the sneaking whisperer) i.e. Satan who runs away and hides himself whenever Allah is mentioned,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nقولهِ تعالى: { ٱلْوَسْوَاسِ ٱلْخَنَّاسِ ٱلَّذِى يُوَسْوِسُ } ثم يَخنُسُ قال الإِمامُ زيد بن علي صلواتُ الله عليهِ: ما مِنْ مَولودٍ إلاّ وَعَلَى قَلبِهِ الوَسْوَاسُ الخَنّاسُ\n فإِذَا عَقَل فَذَكرَ الله تعالى خَرَجَ ذَلِكَ من قَلبِهِ\n\n",
      "translations": [
        {
          "translation": "\nThe Almighty said: {The Whisperer, the Slinker}, then he sinks. Imam Zaid ibn Ali, may Allah's blessings be upon him, said: There is no child but that the Whisperer, the Slinker, is on his heart.\n\n\nWhen one's mind is at peace, and they remember Allah, that peace will come from their heart.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ قل أعوذ بربّ الناس } ربّ الناس هو الذات مع جميع الصفات لأن الإنسان هو الكون الجامع الحاصر لجميع مراتب الوجود ربّه الذي أوجده وأفاض عليه كماله هو الذات باعتبار جميع الأسماء بحسب البداية المعبر عنها بالله، ولهذا قال تعالى:\n\n[ص، الآية:75] بالمتقابلين من الصفات كاللطف والقهر والجمال والجلال الشاملين لجميعها تعوّذ بوجهه بعدما تعوّذ بصفاته ولهذا تأخرت هذه السورة عن المعوّذة الأولى إذ فيها تعوّذ في مقام الصفات باسمه الهادي فهداه إلى ذاته. ثم بيّن ربّ الناس بملك الناس على أنه عطف بيان لأن الملك هو الذي يملك رقابهم وأمورهم باعتبار حال فنائهم فيه من قوله:\n\n[غافر، الآية:16] فالملك بالحقيقة هو الواحد القهار الذي قهر كل شيء بظهوره ثم عطف عليه { إله الناس } لبيان حال بقائهم بعد الفناء لأن الإله هو المعبود المطلق وذلك هو الذات مع جميع الصفات باعتبار النهاية. استعاذ بجنابه المطلق ففني فيه فظهر كونه ملكاً ثم ردّه إلى الوجود لمقام العبودية فكان معبوداً دائماً فتم استعاذته به. { من شرّ الوسواس } لأن الوسوسة تقتضي محلاً وجودياً كما قال: { الذي يوسوس في صدور الناس } ولا وجود في حال الفناء فلا صدور ولا وسواس ولا موسوس بل إن ظهر هناك تلوين بوجود الأنائية فقل: أعوذ بك منك، فلما صار معبوداً بوجود العابد ظهر الشيطان بظهور العابد كما كان أولاً موجوداً بوجوده. والوسواس اسم للوسوسة سمي به الموسوس لدوام وسوسته كأن نفسه وسواس، وإنما استعاذ منه بالإله دون بعض أسمائه كما في السورة الأولى لأن الشيطان هو الذي يقابل الرحمن ويستولي على الصورة الجمعية الإنسانية ويظهر في صور جميع الأسماء ويتمثل بها إلا بالله، فلم تكف الاستعاذة منه بالهادي والعليم والقدير وغير ذلك فلهذا لما تعوّذ من الاحتجاب والضلالة تعوّذ بربّ الفلق وها هنا تعوّذ بربّ الناس ومن هذا يفهم معنى قوله عليه السلام:\n\n \" من رآني فقد رآني فإن الشيطان لا يتمثّل بي \" \n\nالخناس، أي: الرجّاع لأنه لا يوسوس إلا مع الغفلة وكلما تنبه العبد وذكر الله خنس فالخنوس عادة له كالوسواس. عن سعيد بن جبير: إذا ذكر الإنسان ربّه خنس الشيطان وولى، وإذا غفل وسوس إليه. قوله: { من الجنة والناس } بيان للذي يوسوس، فإن الموسوس من الشيطان جنسان: جني غير محسوس كالوهم، وإنسي محسوس كالمضلين من أفراد الإنسان أما في صورة الهادي كقوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مِن شَرِّ ٱلْوَسْوَاسِ } الموسوس\n المثير للفتن في قلوب الناس { ٱلْخَنَّاسِ } [الناس: 4] الدفَّاع\n والرجَّاع للناس\n فإنه منبسط على قلب الإنسان\n فإذا ذكر الله تعالى خنس وانقبض وإذا غفل انبسط على قلبه\n فالتطارد بين ذكر الله تعالى ووسوسة الشيطان كالتطارد بين النور والظلام إذا جاء أحدهما طرد الآخر\n مثله كمثل الواهمة تساعد في المقدمات\n فإذا آل الأمر إلى النتيجة رجع وارتدع\n مثلاً إذا قيل: الميت جماد والجماد لا يخاف منه أقرت\n وإذا قيل: فالميت لا يخاف منه فرت\n[المدثر: 50-51]\n\n\n{ ٱلَّذِى يُوَسْوِسُ فِي صُدُورِ ٱلنَّاسِ } [الناس: 5] إذا غفلوا عن ذكر ربهم\n وجعلوا إنجاح قضية أهوائهم من همهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { قل أعوذُ بربِّ الناس } مربّيهم ومُصلحهم، { مَلِكِ الناس } مالكهم ومدبر أمورهم. وهو عطف بيان جيء به لبيان أنَّ تربيته تعالى ليست بطريق تربية سائر المُلاك لِما تحت أيديهم من ممالكهم، بل بطريق المُلك الكامل، والتصرُّف التام، والسلطان القاهر. وكذا قوله تعالى: { إِلهِ الناس } فإنه لبيان أنَّ مُلكه تعالى ليس بمجرد الاستيلاء عليهم، والقيام بتدبير أمور سياستهم، والمتولِّي لترتيب مبادىء حِفظهم وحمايتهم، كما هو قصارى أمر الملوك، بل هو بطريق العبودية، المؤسَّسة على الألوهية، المقتضية للقدرة التامة على التصرُّف الكلي فيهم، إحياءً وإماتةً، وإيجاداً وإعداماً. وتخصيص الإضافة إلى الناس مع انتظام جميع العالَمين في سلك ربوبيته تعالى وملكوته وألوهيته للإرشاد إلى مناهج الاستعاذة المرضية عنده تعالى، الحقيقة بالإعاذة، فإنَّ توسل العبد بربه، وانتسابه إليه تعالى بالمربوبية والملكية والمعبودية، في ضمن جنس هو فرد من أفراده، من دواعي الرحمة والرأفة. أمره تعالى بذلك من دلائل الوعد الكريم بالإعاذة لا محالة، ولأنَّ المستعاذ منه شر الشيطان، المعروف بعداوتهم، مع التنصيص على انتظامه في سلك عبوديته تعالى وملكوته، رمز إلى إنجائهم من ملكة الشيطان وتسلُّطه عليهم، حسبما ينطق به قوله تعالى:\n\n[الإسراء:65] فمَن جعل مدارَ تخصيص الإضافة مجرد كون الاستعاذة من المضار المختصة بالنفوس البشرية فقد قصر في توفية المقام حقه. وتكرير المضاف إليه لمزيد الكشف والتقرير والتشريف. قاله أبو السعود. والآية من باب الترقِّي، وذلك أنَّ الرب قد يُطلق على كثير من الناس، فتقول: فلان رب الدار، وشبه ذلك، فبدأ به لاشتراك معناه وأمَّا المَلك فلا يُوصف به إلاَّ آحاد من الناس، وهم الملوك، ولا شك أنهم أعلى من سائر الناس، فلذلك جيء به بعد الرب، وأمَّا الإله فهوأعلى من المَلك، ولذلك لا يَدَّعي الملوكُ أنهم آلهة، وإنما الإله واحد لا شريك له ولا نظير قاله ابن جزي. { من شَرَّ الوسواس } أي: الموسوس، فالوسواس مصدر، كالزلزال، بمعنى اسم الفاعل، أو سمي به الشيطان مبالغةً، كأنه نفس الوسوسة، و { الخناس } الذي عادته أن يخنس، أي: يتأخر عند ذكر الإنسان ربَّه، { الذي يُوَسْوِسُ في صدور الناس } إذا غفلوا عن ذكر الله، ولم يقل: في قلوب الناس لأنَّ الشيطان محله الصدور، ويمدّ منقاره إلى القلب، وأمّا القلب فهو بيت الرب، وهو محل الإيمان، فلا يتمكن منه كل التمكُّن، وإنما يحوم في الصدر حول القلب، فلو تمكّن منه لأفسد على الناس كلهم إيمانهم. قال ابن جزي: وسوسة الشيطان بأنواع كثيرة، منها: فساد الإيمان والتشكيك في العقائد، فإن لم يقدر على ذلك ثبّطه عن الطاعات، فإن لم يقدر على ذلك أدخل الرياء في الطاعات ليُحبطها، فإن سَلِمَ من ذلك أدخل عليه العجب بنفسه، واستكثار عمله، ومن ذلك: أنه يُوقد في القلب نار الحسد والحقد والغضب، حتى يقود الإنسان إلى سوء الأعمال وأقبح الأحوال.\n\nوعلاج وسوسته بثلاثة أشياء، وهي: الإكثار من ذكر الله والإكثار من الاستعاذة منه، ومن أنفع شيءٍ في ذلك: قراءة سورة الناس. هـ. قلت: لا يقلع الوسوسة من القلب بالكلية إلاّ صُحبة العارفين، أهل التربية، حتى يُدخلوه مقامَ الفناء، وإلاَّ فالخواطر لا تنقطع عن العبد. ثم بَيّن الموسوِس بقوله: { مِن الجِنة } أي: الجن { والناس } ووسواس النار أعظم لأنَّ وسواس الجن يذهب بالتعوُّذ، بخلاف وسوسة الناس، والمراد بوسوسة الناس: ما يُدخلون عليك من الشُبه في الدين وخوض في الباطن، أو سوء اعتقاد في الناس، أو غير ذلك. قال ابن جزي: فإن قلت: لِمَ ختم القرآن بالمعوذتين، وما الحكمة في ذلك؟ فالجواب من ثلاثة أوجه، الأول: قال شيخنا الأستاذ أبو جعفر بن الزبير: لمَّا كان القرأنُ من أعظم نِعم الله على عباده، والنعمة مظنة الحسد، ختم بما يُطفىء الحسد، من الاستعاذة بالله. الثاني: يَظهر لي أنَّ المعوذتين ختم بهما لأنّ رسول الله صلى الله عليه وسلم قال فيهما:\n\n \" أنزلت علي آيات لم يُر مثلهن قط \" \n\nكما قال في فاتحة الكتاب:\n\n \" لم ينزل في التوراة ولا في الإنجيل ولا في الفرقان مثلها \" \n\nفافتتح القرآن بسورة لم ينزل مثلها، واختتم بسورتين لم يرَ مثلهما للجمع بين حسن الافتتاح والاختتام. ألا ترى أن الخُطب والرسائل والقصائد، وغير ذلك من أنواع الكلام، يُنظر فيها إلى حسن افتتاحها واختتامها. والوجه الثالث: أنه لمّا أمر القارىء أن يفتح قراءته بالتعوُّذ من الشيطان الرجيم، ختم القرآن بالمعوذتين ليحصل الاستعاذة بالله عند أول القراءة وعند آخر ما يقرأ من القرآن، فتكون الاستعاذة قد اشتملت على طرفي الابتداء والانتهاء، فيكون القارىء محفوظاً بحفظ الله، الذي استعاذ به مِن أول أمره إلى آخره. هـ. الإشارة: لا يُنجي من الوسوسة بالكلية إلاّ التحقُّق بمقام الفناء الكلي، وتعمير القلب بأنوار التجليات الملكوتية والأسرار الجبروتيه، حتى يمتلىء القلب بالله فحينئذ تنقلب وسوسته في أسرار التوحيد فكرةً ونظرةً وشهوداً للذات الأقدس، كما قال الشاعر:\n\nوبالله التوفيق. وهو الهادي إلى سواء الطريق، ولا حول ولا قوة إلا بالله العلي العظيم، وصلّى الله على سيدنا محمد، وآله وصحبه وسلّم تسليماً. كَمِل \" البحر المديد في تفسير القرآن المجيد \" بحول الله وقوته. نسأل الله سبحانه أن يكسوه جلباب القبول ويُبلغ به كل مَن طالعه أو حصّله القصدَ والمأمول، بجاه سيد الأولين والآخرين، سيدنا ومولانا محمد، خاتم النبيين وإمام المرسلين. وعُمْدَتنا فيه: تفسير البيضاوي وأبي السعود، وحاشية شيخ شيوخنا سيدي عبد الرحمن الفاسي، وشيء من تفسير ابن جزي والثعلبي والقشيري. وكان الفراغ من تبييضه زوال يوم الأحد، سادس ربيع النبوي، عام واحد وعشرين ومائتين وألف، على يد جامعه العبد الضعيف، الفقير إلى مولاه أحمد بن محمد بن عجيبة الحَسَنِي، لطف الله به في الدارين. آمين وآخر دعوانا أن الحمد لله رب العالمين.\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "81:15",
      "similarity": 0.7888804047492218
    },
    {
      "verse": "114:5",
      "similarity": 0.41623964536264074
    },
    {
      "verse": "7:20",
      "similarity": 0.3608169939813962
    },
    {
      "verse": "20:120",
      "similarity": 0.3297493062829105
    },
    {
      "verse": "50:16",
      "similarity": 0.3230985701643876
    }
  ]
}