{
  "chapter": "هود",
  "text": "وكذلك اخذ ربك اذا اخذ القرى وهى ظلمة ان اخذه اليم شديد",
  "translations": [
    {
      "translation": "Such is the iron grip of your Lord when He seizes the cities which do wrong. His grip is painful, violent.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the punishment of your Lord when He seizes human settlements in the acts of wickedness. Surely His hold is grievous and terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the seizing of your Lord that when He does seize the towns immersed in wrong-doing, His seizing is painful, terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus was the punishment of your Lord when He punished the unjust people of the towns. The punishment of your Lord is certainly severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similar is the seizure of your Lord when He seizes the townships upon their injustice; indeed His seizure is painful, severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the punishment of your Lord when He seizes the (population of) towns while they are doing wrong. Verily, His punishment is painful (and) severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And such is the punishment of your Lord when He punishes the towns while they are unjust; surely His punishment is painful, severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the seizing of thy Lord, when He seizes the cities that are evildoing; surely His seizing is painful, terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even thus is the grasp of thy Lord when He graspeth the townships while they are doing wrong. Lo! His grasp is painful, very strong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the punishment of your Lord when He seizes the towns in the midst of their sins: His punishing grip is terrible and severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even such is the overtaking of thy Lord when He overtaketh the cities while they are wrong-doers; verily His overtaking is afflictive, severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the seizing of your Lord when He seizes the townships that are wrongdoing. Indeed His seizing is painful and severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the chastisement of thy Lord when He chastises communities in the midst of their wrong: grievous, indeed, and severe is His chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Seizure of your Lord when He seizes the (population of) towns while they are doing wrong. Verily, His Seizure is painful, and severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the seizing of your Lord, when He seizes the evildoing villages. His seizing is painful, stern.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the grip of your Lord when He seizes the towns in the midst of their sins. His grip is most painful, most severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus is the seizure of your Lord when He seizes the cities while they are committing wrong. Indeed, His seizure is painful and severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:102] Such, like that seizing, is the seizing of your Lord when He seizes the towns, meaning its inhabitants, while they are doing wrong, by way of sins: in other words, nothing can avail them in any way when He seizes them. Truly His seizing is painful, severe. The two Shaykhs [Bukhārī and Muslim] reported [by way of an isnād] from Abū Mūsā al-Ash‘arī that he said, ‘The Prophet (s) said, “God gives [extended] respite to the evildoer, but when He seizes him there is no escape for him”, whereupon the Prophet (s) recited the verse: Such is the seizing of your Lord [Q. 11:102, above]’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Even thus is the grasp of your Lord) the chastisement of your Lord (when He graspeth the townships) when He chastises the people of these townships (while they are doing wrong) when they are disbelievers and idolaters. (Lo! His grasp) His chastisement (is painful, very strong).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ } أي: مثل ما سمعت يا أكمل الرسل { أَخْذُ رَبِّكَ } أي: انتقامه وبطشه { إِذَا أَخَذَ ٱلْقُرَىٰ } أي: حين أخذ أهلها بظلمهم وعصيانهم { وَهِيَ ظَالِمَةٌ } خارجة عن مقتضى الأمر والإلهي ونهيه، وبالجملة: { إِنَّ أَخْذَهُ } للمسرفين الخارجين عن حيطة حدوده { أَلِيمٌ } مؤلم { شَدِيدٌ } [هود: 102] في غاية الشدة؛ لكونهم مبالغين في الإصرار والاستكبار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إن أخذه أليم شديد } وجيع عظيم، غير مرجو الخلاص منه، وهو مبالغة في التهديد والتحذير",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:117",
      "similarity": 0.414758745861918
    },
    {
      "verse": "18:59",
      "similarity": 0.4086174511373666
    },
    {
      "verse": "15:4",
      "similarity": 0.3744130191757329
    },
    {
      "verse": "15:50",
      "similarity": 0.3639404494984355
    },
    {
      "verse": "21:6",
      "similarity": 0.3620795894944198
    }
  ]
}