{
  "chapter": "هود",
  "text": "الا الذين صبروا۟ وعملوا۟ الصلحت او۟لئك لهم مغفرة واجر كبير",
  "translations": [
    {
      "translation": "Except those who endure with patience and do the right, who will have pardon and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who are patient and act righteously. Such shall have Allah's forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who exercise patience and do good works do not behave as such. They will receive forgiveness and a great reward (from the Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who patiently endured and did good deeds; for them is forgiveness, and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who show patience and do righteous good deeds: those, theirs will be forgiveness and a great reward (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who are patient and do good, they shall have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save such as are patient, and do deeds of righteousness; for them awaits forgiveness and a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those who persevere and do good works. Theirs will be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not so those who are patient and do good deeds. They shall have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not so are those who persevere and do righteous works. Those! theirs shall be forgivness and a great hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "excepting those who are patient and do righteous deeds. For such there will be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not so do those who show patience and constancy, and work righteousness; for them is forgiveness (of sins) and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who show patience and do righteous good deeds, those: theirs will be forgiveness and a great reward (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who are patient and do good deeds, for them awaits forgiveness and a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who are patient and do good deeds—these will have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who are patient and do righteous deeds; those will have forgiveness and great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:11] save, but, those who endure, misery, [patiently] and perform righteous deeds, during times of comfort; theirs will be forgiveness and a great reward, which is Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Save those) save Muhammad (pbuh) and his Companions (who persevere) in their faith (and do good works) acts of obedience between them and their Lord, for they are patient in times of hardship and give thanks when they receive a blessing. (Theirs will be forgiveness) of their sins in this world (and a great reward) in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ ٱلَّذِينَ صَبَرُواْ } على ما أصابهم من السيئات المملة المؤلمة، واسترجعوا إلى الله لكشفها { وَعَمِلُواْ ٱلصَّالِحَاتِ } وواظبوا على الخيرات والحسنات وداوموا على الإيثار والصدقات؛ شكراً لما أنعمنا عليها { أُوْلَـٰئِكَ } السعداء الصابرون عن البلاء، الشاكرون على النعماء عليهم { لَهُمْ مَّغْفِرَةٌ } أي: ستر ومحو لذنوبهم التي مضت عليهم { وَأَجْرٌ كَبِيرٌ } [هود: 11] هو الرضاء منهم تفضلاً عليهم وامتناناً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}