{
  "chapter": "هود",
  "text": "ولله غيب السموت والارض واليه يرجع الامر كله فاعبده وتوكل عليه وما ربك بغفل عما تعملون",
  "translations": [
    {
      "translation": "The Unseen of the heavens and the earth belongs to Allah and the whole affair is returned to Him. So worship Him and put your trust in Him. Your Lord is not unaware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the secrets of the heavens and the earth, and all things will go back to Him. So worship Him and put your trust in Him; your Lord is not heedless of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is hidden in the heavens and the earth lies within the power of Allah. To Him are all matters referred for judgement. So do serve Him, and place in Him all your trust. Your Lord is not heedless of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the knowledge of the unseen in the heavens and the earth and to Him do all affairs return. Worship Him and trust Him. Your Lord is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And for Allah only are the hidden of the heavens and of the earth, and towards Him only is the return of all matters – therefore worship Him and trust Him; and your Lord is not unaware of what you do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the Ghayb of the heavens and the earth, and to Him return all affairs (for decision). So worship Him and put your trust in Him. And your Lord is not unaware of what you (people) do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the unseen in the heavens and the earth, and to Him is returned the whole of the affair; therefore serve Him and rely on Him, and your Lord is not heedless of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the Unseen in the heavens and the earth. To Him the whole matter shall be returned; so serve Him, and put thy trust in Him. Thy Lord is not heedless of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the Invisible of the heavens and the earth, and unto Him the whole matter will be returned. So worship Him and put thy trust in Him. Lo! thy Lord is not unaware of what ye (mortals) do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The knowledge of the secret of the heavens and the earth belongs to God alone, and to Him shall all affairs be referred. So worship Him and put your trust in Him alone. Your Lord is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the Unseen of the heavens and the earth, and unto Him the whole affair shall be brought back. So worship Him thou and rely on Him; and thy Lord is not negligent of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the Unseen of the heavens and the earth, and to Him all matters are returned. So worship Him and trust in Him. Your Lord is not oblivious of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah do belong the unseen (secrets) of the heavens and the earth, and to Him goeth back every affair (for decision): then worship Him, and put thy trust in Him: and thy Lord is not unmindful of aught that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the Ghaib (unseen) of the heavens and the earth, and to Him return all affairs (for decision). So worship Him (O Muhammad SAW) and put your trust in Him. And your Lord is not unaware of what you (people) do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the unseen in the heavens and in the earth; to Him the matter, in its entirety, shall be returned. Worship Him, and put your trust in Him. Your Lord is not inattentive of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the future of the heavens and the earth, and to Him all authority goes back. So worship Him, and rely on Him. Your Lord is never unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belong the unseen [aspects] of the heavens and the earth and to Him will be returned the matter, all of it, so worship Him and rely upon Him. And your Lord is not unaware of that which you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:123] And to God belongs the Unseen of the heavens and the earth, that is, the knowledge of what is concealed within them, and to Him all matters are returned (read active yarji‘u, meaning ‘return’, or passive yurja‘u, meaning ‘[are] returned’) and He will exact retribution from those who were disobedient. So worship Him, affirm His Oneness, and rely on Him, trust in Him, for He is sufficient for you, and your Lord is not heedless of what they do, but He defers [dealing with] them until their [appointed] time (a variant reading has ta‘malūn, ‘[what] you do’). Meccan, except for verses 1, 2, 3 and 7, which are Medinese; it consists of 111 verses, and was revealed after sūrat Hūd.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Allah's is the Invisible of the heavens and the earth) that which is hidden from the servants, (and unto Him the whole matter will be returned) the matter of the servants will be returned to Him. (So worship Him) so obey Him (and put thy trust in Him) rely on Him. (Lo! thy Lord is not unaware of what ye (mortals) do) of transgressions; it is also said that this means: Allah will not fail to punish you for what you do nor is He oblivious to it'. And of the surah in which Joseph is mentioned, which is all Meccan and consists of 111 verses, 1,776 words and 7,196 letters: Surah 12: Joseph (Yusuf) And of the surah in which Joseph is mentioned, which is all Meccan and consists of 1 1 1 verses, 1,776 words and 7,196 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { وَلِلَّهِ } لا لغيره { غَيْبُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: الإطلاع عليهما وعلى مكنوناتهما { وَإِلَيْهِ } لا إلى غيره { يُرْجَعُ ٱلأَمْرُ كُلُّهُ } إذ لا شيء ولا أمر إلا هو { فَٱعْبُدْهُ } حق عبادته { وَتَوَكَّلْ عَلَيْهِ } حق التوكل والتفويض { وَمَا رَبُّكَ } يا أكمل الرسل المحيط علمه بجميع ذرائر الأكوان إحاطة حضور { بِغَافِلٍ عَمَّا تَعْمَلُونَ } [هود: 123] من الإخلاص في العبادة والتبتل والتوكيل والتفويض والرضاء ةالتسليم\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المأمور بتهذيب الأخلاق من الرذائل، والأوصاف من الذمائم، والأوصاف والأفعال من القبائح، والأقوال من الكواذب، والأطوار من المخالفة المنافية لصرافة التوحيد أن تستقيم بعزائمك هذه على الوجه المأمور لنبيك الذي هو قبلة لجميع مقاصدك بقوله تعالى: { فَٱسْتَقِمْ كَمَآ أُمِرْتَ } [هود: 112] أي: فاعتدل بجميع ما صدر عنك، فلك أن تقتفي أثره صلى الله عليه وسلم في جميع حالاتك من امتثال الأوامر واجتناب النواهي وتهذيب الأخلاق؛ إذ هو صلى الله عليه وسلم زبدة أرباب التوحيد الواصلين بمقعد الصدق ومنزل التفريد، والسابقون واللاحقون كلهم يقتبسون من مشكاة أنواره صلى الله عليه وسلم\n\n\n\n\nفعليك أيها المستعد المستشرد من الكلام المجيد أن تضبط جميع أحوالك على الاستقامة والاعتدال، وتجتنب عن كلا طرفي الإفراط والتفريط، وتستعيذ بالله عن مداخلة الرياء والسمعة المنافقيين للإخلاص\n\n\n\n\nواعلم أن خير فرينك في طريقك هذا الرضا والتسليم والتفويض إلى العزيز العليم، ولك العزلة عن الخلطة والانخراط في سلك أهل الثروة والغفلة، والقناعة بالكفاف والعزوبة بالعفاف\n\n\n\n\nوعليك ألاَّ تفرق خاطرك وهمك في أمور دنياك ولو لحظة حتى لا تورثك هماً كثيراً وحزناً طويلاً؛ ذ المسافر في منزله لا يتصرف إلا مقدار مقيله، أمَا تسمع قول النبي صلى الله عليه وسلم: \" كن في الدنيا كأنك غريب \"؟\n\n\n\n\nأو: \" اشدد حيازيمك للموت والرحيل كأنك عابر سبيل \"\n\n\n\n\nوبالجملة: لا تغتر بحياتك في دار الغرور، وعد نفسك من أصحاب القبور، فإنه دأب أهل السرور، ديدنة أرباب الحضور\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}