{
  "chapter": "هود",
  "text": "ولو شاء ربك لجعل الناس امة وحدة ولا يزالون مختلفين",
  "translations": [
    {
      "translation": "If your Lord had wanted to, He would have made mankind into one community but they persist in their differences,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if your Lord had pleased He could have made all human beings into one community of belief. But they would still have differed from one another,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord so willed, He would surely have made mankind one community. But as things stand, now they will not cease to differ among themselves and to follow erroneous ways\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord wanted, He would have made all people one united nation. They still have different beliefs\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had your Lord willed, He would have made mankind one nation – and they will always keep differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord had so willed, He could surely have made mankind one Ummah, but they will not cease to disagree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord had pleased He would certainly have made people a single nation, and they shall continue to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had thy Lord willed, He would have made mankind one nation; but they continue in their differences\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thy Lord had willed, He verily would have made mankind one nation, yet they cease not differing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If your Lord had wished, He would have made mankind into one community. As it is, they will not cease to dispute, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had thy Lord Willed, He would surely have made mankind of one community, and they will not cease differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord wished, He would have made mankind one community; but they continue to differ,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thy Lord had so willed, He could have made mankind one people: but they will not cease to dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord had so willed, He could surely have made mankind one Ummah [nation or community (following one religion only i.e. Islam)], but they will not cease to disagree,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord willed, He would have made mankind a single nation. But they continue in their differences\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord willed, He could have made humanity one community, but they continue to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord had willed, He could have made mankind one community; but they will not cease to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:118] Had your Lord willed, He would have made mankind one community, people of one religion, but they continue to differ, in religion,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلمّا كان النعي على الأمم الذين لم يقع فيهم من ينهون عن الفساد فاتّبعوا الإجرام ، وكان الإخبار عن إهلاكهم بأنّه ليس ظلماً من الله وأنهم لو كانوا مصلحين لَمَا أهلكوا ، لمّا كان ذلك كله قد يثير توهّم أن تعاصي الأمم عمّا أراد الله منهم خروج عن قبضة القُدرة الإلهية أعقب ذلك بما يرفع هذا التوهّم بأنّ الله قادر أن يجعلهم أمّة واحدة متفقة على الحق مستمرّة عليه كما أمرهم أن يكونوا .ولكن الحكمة التي أقيم عليها نظامُ هذا العالم اقتضت أن يكون نظام عقول البشر قابلاً للتطوّح بهم في مسلك الضّلالة أو في مسلك الهدى على مبلغ استقامة التفكير والنظر ، والسلامة من حجب الضلالة ، وأن الله تعالى لمّا خلق العقول صالحة لذلك جعل منها قبول الحق بحسب الفطرة التي هي سلامة العقول من عوارض الجهالة والضلال وهي الفطرة الكاملة المشار إليها بقوله تعالى : { كان الناس أمّةً واحدة } ، وتقدّم الكلام عليها في سورة \\[ البقرة : 213 \\]. لم يدّخرهم إرشاداً أو نصحاً بواسطة الرُّسُل ودعاة الخير ومُلقّنيه من أتباع الرسل ، وهم أولو البقية الذين ينهون عن الفساد في الأرض ، فمن الناس مهتد وكثير منهم فَاسِقُونَ ولو شاء لَخلق العقولَ البشرية على إلهام متّحد لا تَعْدوه كما خلق إدراك الحيوانات العُجم على نظام لا تتخطّاه من أوّل النشأة إلى انقضاء العالم ، فنجد حال البعير والشّاة في زمن آدم عليه السّلام كحالهما في زماننا هذا ، وكذلك يكون إلى انقراض العالم ، فلا شكّ أن حكمة الله اقتضت هذا النظام في العقل الإنساني لأنّ ذلك أوفى بإقامة مراد الله تعالى من مساعي البشر في هذه الحياة الدنيا الزائلة المخلوطة ، لينتقلوا منها إلى عالم الحياة الأبديّة الخالصة إن خيراً فخير وإن شراً فشر ، فلو خلق الإنسان كذلك لما كان العمل الصالح مقتضياً ثواب النعيم ولا كان الفساد مقتضياً عقاب الجحيم ، فلا جرم أنّ الله خلق البشر على نظام من شأنه طريان الاختلاف بينهم في الأخور ، ومنها أمر الصلاح والفساد في الأرض وهو أهمّها وأعظمها ليتفاوت الناس في مدارج الارتقاء ويَسْموا إلى مراتب الزلفى فتتميز أفراد هذا النوع في كل أنحاء الحياة حتى يعد الواحد بألف { ليميز اللّهُ الخبيث من الطيب } \\[ الأنفال : 37 \\].وهذا وجه مناسبة عطف جملة { وتمّت كلمة ربك لأملأنّ جهنم من الجِنة والناس أجمعين } على جملتي { ولا يزالون مختلفين } { ولذلك خلقهم }.ومفعول فعل المشيئة محذوف لأنّ المراد منه ما يُساوي مضمون جواب الشرط فحُذف إيجازاً . والتقدير : ولو شاء ربك أن يجعل الناس أمّة واحدة لجعلهم كذلك .والأمّة : الطائفة من الناس الذين اتّحدوا في أمر من عظائم أمور الحياة كالموطن واللّغة والنّسب والدّين .وقد تقدمت عند قوله تعالي : { كان الناس أمّةً واحدةً } في سورة \\[ البقرة : 213 \\]. فتفسر الأمّة في كل مقام بما تدل عليه إضافتها إلى شيء من أسباب تكوينها كما يقال : الأمّة العربيّة والأمّة الإسلاميّة .ومعنى كونها واحدة أن يكون البشر كلّهم متّفقين على اتّباع دين الحق كما يدل عليه السياق ، فآل المعنى إلى : لو شاء ربك لجعل الناس أهل ملّة واحدة فكانوا أمّة واحدة من حيث الدّين الخالص .وفهم من شرط ( لو ) أنّ جعلهم أمّة واحدة في الدّين منتفية ، أي منتف دوامها على الوحدة في الدّين وإنْ كانوا قد وُجدوا في أوّل النشأة متّفقين فلم يلبثوا حتّى طرأ الاختلاف بينَ ابنيْ آدم عليه السّلام لقوله تعالى : { كان النّاس أمّة واحدة } \\[ البقرة : 213 \\] وقوله : { وما كان النّاس إلاّ أمّةً واحدةً فاختلفوا } في سورة \\[ يونس : 19 \\] ؛ فعلم أنّ الناس قد اختلفوا فيما مضى فلم يكونوا أمّة واحدة ، ثم لا يدري هل يؤول أمرهم إلى الاتّفاق في الدّين فأعقب ذلك بأنّ الاختلاف دائم بينهم لأنّه من مقتضى ما جُبِلت عليه العقول .\n\n",
      "translations": [
        {
          "translation": "(And if thy Lord had willed, He verily would have made mankind one nation) He would have gathered them to follow one religion: the religion of Islam, (yet they cease not) but they will always be (differing) concerning religion and falsehood,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولو شاء ربك لجعل الناس أمّة واحدة } متساوية في الاستعداد متفقة على دين التوحيد ومقتضى الفطرة { ولا يزالون مختلفين } في الوجهة والاستعداد { إلا من رحم ربّك } بهدايته إلى التوحيد وتوفيقه للكمال\n فإنهم متفقون في المذهب والمقصد وموافقون في السيرة والطريقة\n قبلتهم الحق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكيف { وَلَوْ شَآءَ رَبُّكَ } من غاية لطفه لعباده { لَجَعَلَ ٱلنَّاسَ أُمَّةً وَاحِدَةً وَلاَ يَزَالُونَ مُخْتَلِفِينَ } [هود: 118] متفقة على التوحيد بلا مخالفة منهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الاستثناء من ضمير \" يزالون \"\n  يقول الحق جل جلاله: { ولو شاء ربك لجعل الناسَ أمةً واحدة } \n متفقين على الإيمان أو الكفران\n لكن مقتضى الحكمة وجود الاختلاف ليظهر مقتضيات الأسماء في عالم الشهادة فاسمه: الرحيم يقتضي وجود من يستحق الكرم والرحمة\n وهم: أهل الإيمان\n واسمه: المنتقم والقهار يقتضي وجود من يستحق الاتنقام والقهرية\n وهم أهل الكفر والعصيان\n قال البيضاوي: وفيه دليل ظاهر على أن الأمر غير الإرادة\n وأنه تعالى لم يرد الإيمان من كل أحد\n وأن ما أراد يجب وقوعه\n هـ\n  { ولا يزالون مختلفين } بعضهم على الحق\n وهم أهل الرحمة والكرم وبعضهم على الباطل\n وهم أهل القهرية والانتقام\n أو مختلفين في الأديان والملل والمذاهب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:110",
      "similarity": 0.6094007433558001
    },
    {
      "verse": "10:28",
      "similarity": 0.579713553382504
    },
    {
      "verse": "40:34",
      "similarity": 0.3906671379374459
    },
    {
      "verse": "2:217",
      "similarity": 0.34073887412881293
    },
    {
      "verse": "42:8",
      "similarity": 0.3258137057216528
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011118.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011118.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:118.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}