{
  "chapter": "هود",
  "text": "فلا تك فى مرية مما يعبد هؤلاء ما يعبدون الا كما يعبد ءاباؤهم من قبل وانا لموفوهم نصيبهم غير منقوص",
  "translations": [
    {
      "translation": "So be in no doubt about what these people worship. They only worship as their forebears worshipped previously. We will pay them their portion in full, with no rebate!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, you should not entertain any doubt about those whom they worship: They only worship what their fathers had worshipped before them. We shall verily give them their meed without diminution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[O Prophet!] Have no doubt about what they worship. For they worship what their fathers worshipped before. And (yet) We shall grant them their due portion in full, diminishing of it nothing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have no doubt that these people worship (idols). They worship what their fathers had worshipped before them. We will give them the exact recompense that they deserve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So O listener (followers of this Prophet), do not fall into doubt by what these disbelievers worship; they only worship just as their forefathers worshipped before; and indeed we shall pay them their due in full, undiminished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be not in doubt as to what these people (pagans and polytheists) worship. They worship nothing but what their fathers worshipped before (them). And verily, We shall repay them in full their portion without diminution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore be not in doubt as to what these worship; they do not worship but as their fathers worshipped before; and most surely We will pay them back in full their portion undiminished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be thou not in doubt concerning what these men serve; they serve only as their fathers served before; and We shall surely pay them in full their portion undiminished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be not thou in doubt concerning that which these (folk) worship. They worship only as their fathers worshipped aforetime. Lo! we shall pay them their whole due unabated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have no doubt as to what they worship. They worship nothing but what their fathers worshipped before [them]. We shall certainly give them their share in full, without diminishing anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be not thou in dubitation concerning that which these people worship. They worship not save as their fathers worshipped afore; and verily We will repay unto them in full their portion, undiminished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not be in doubt about what these worship: they worship just as their fathers worshiped before, and We shall surely pay them their full share, undiminished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be not then in doubt as to what these men worship. They worship nothing but what their fathers worshipped before (them): but verily We shall pay them back (in full) their portion without (the least) abatement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be not in doubt (O Muhammad SAW) as to what these (pagans and polytheists) men worship. They worship nothing but what their fathers worshipped before (them). And verily, We shall repay them in full their portion without diminution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore do no be doubtful as to what these worship. They worship only that which their fathers worshiped before them. We shall indeed pay them in full their undiminished measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be not in doubt regarding what these people worship. They worship only as their ancestors worshiped before. We will pay them their due in full, without any reduction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not be in doubt, [O Muhammad], as to what these [polytheists] are worshipping. They worship not except as their fathers worshipped before. And indeed, We will give them their share undiminished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:109] So do not be, O Muhammad (s), in doubt, in uncertainty, concerning what these [folk] worship, of idols: We will indeed chastise them as We did those before them — this is intended as solace for the Prophet (s). They worship only as their fathers worshipped — that is, in the same way — before, and indeed We chastised them; and We shall surely pay them, like those [fathers of theirs], their whole due, their portion of the chastisement, undiminished, that is, in full.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So be not thou in doubt concerning that which these (folk)) the people of Mecca (worship. They worship only as their fathers worshipped aforetime) before them and they were destroyed because of it. (Lo! We shall pay them their whole due) their chastisement (unabated) it is said that the last part of this verse was revealed about the Qadariyyah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي مِرْيَةٍ } معناهُ فِي شَكٍّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تبين حال السعداء المقبولين والأشقياء المردودين { فَلاَ تَكُ فِي مِرْيَةٍ } شك وتردد { مِّمَّا يَعْبُدُ هَـٰؤُلاۤءِ } المشركون، ألا يستجلب عليهم العذاب والنكال كما استجلب على أسلافهم؛ إذ هم { مَا يَعْبُدُونَ إِلاَّ كَمَا يَعْبُدُ آبَاؤُهُم } وأسلافهم { مِّن قَبْلُ } فسيلحقهم مثل ما لحقهم؛ لأن اشتراك الأسباب يوجب اشتراك المسببات { وَإِنَّا } وإن أمهلناهم زماناً في الدنيا { لَمُوَفُّوهُمْ نَصِيبَهُمْ } وحظهم من العذاب في الآخرة مثلهم { غَيْرَ مَنقُوصٍ } [هود: 109] من عذابهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:4",
      "similarity": 0.5317642563786924
    },
    {
      "verse": "7:130",
      "similarity": 0.42151995861160124
    },
    {
      "verse": "73:3",
      "similarity": 0.400282149765441
    },
    {
      "verse": "9:4",
      "similarity": 0.396432401958845
    },
    {
      "verse": "13:41",
      "similarity": 0.3915395191324791
    }
  ]
}