{
  "chapter": "هود",
  "text": "الر كتب احكمت ءايته ثم فصلت من لدن حكيم خبير",
  "translations": [
    {
      "translation": "Alif Lam Ra. A Book whose ayats are perfectly constructed, and then demarcated, coming directly from One who is All-Wise, All-Aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALIF LAM RA. This is a Book whose verses are indeclinable and distinct, which comes from One who is most wise and all-knowing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. This is a Divine Command whose contents have been made firm and set forth in detail from One Who is All-Wise, All-Aware\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. This is a Book from One who is All-wise and All-aware. Its verses are well composed and distinctly arranged (from one another)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra*; “This is a Book, the verses of which are full of wisdom – then explained in detail – from the Wise, the Well Aware.” (* Alphabets of the Arabic language; Allah and to whomever He reveals, know their precise meanings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra. (This is) a Book, the Ayat whereof are perfect (in every sphere of knowledge), and then explained in detail from One (Allah), Who is All-Wise Well-Acquainted (with all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra (This is) a Book, whose verses are made decisive, then are they made plain, from the Wise, All-aware:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra. A Book whose verses are set clear, and then distinguished, from One All-wise, All-aware:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. (This is) a Scripture the revelations whereof are perfected and then expounded. (It cometh) from One Wise, Informed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Ra. [This is] a Book, with verses which are fundamental [in nature], and then expounded in detail by One who is all wise and all aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Ra. A Book this, the verses whereof are guarded, and then detailed, from before the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam Ra. [This is] a Book, whose signs have been made definitive and then elaborated, from One [who is] all-wise, all-aware,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A. L. R. (This is) a Book, with verses basic or fundamental (of established meaning), further explained in detail,- from One Who is Wise and Well-acquainted (with all things):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Ra. [These letters are one of the miracles of the Quran and none but Allah (Alone) knows their meanings]. (This is) a Book, the Verses whereof are perfected (in every sphere of knowledge, etc.), and then explained in detail from One (Allah), Who is All-Wise and Well-Acquainted (with all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "AlifLaamRa. (This is) a Book whose verses are clear, and then distinguished from Him, the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Ra. A Scripture whose Verses were perfected, then elaborated, from One who is Wise and Informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Ra. [This is] a Book whose verses are perfected and then presented in detail from [one who is] Wise and Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:1] Alif lām rā’: God knows best what He means by these [letters]; this is, a Book whose verses have been set clear, through marvellous arrangement and wonderful meanings, and then detailed, expounded, through rulings, stories and admonitions, from One Wise, Informed, that is, [from] God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said in explanation of the word of Allah (Alif. Lam. Ra.): '(Alif. Lam. Ra.) Allah says: I am Allah, I see; as it is said that this is an oath by which Allah swore. ((This is) a Scripture) i.e. the Qur'an (the revelations whereof are perfected) expositing the lawful and the prohibited, the commands and prohibitions (and then exposited) and then elucidated. ((It cometh) from One Wise) Who has ruled that none should be worshiped but He, (Informed) of he who worships and him who worships not,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأَخبرنا أَبو جعفر قال: حدثنا علي بن أحمد، قال: حدثنا عطاء بن السائب عن أبي خالد الواسطي عن زيد بن علي عليهما السَّلامُ في قوله تعالى: { مِن لَّدُنْ } معناهُ مِنْ عِند\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far reported: Ali ibn Ahmad told us: Ata' ibn al-Sa'ib reported to us from Abu Khalid al-Wasiti from Zayd ibn Ali, peace be upon them, regarding the saying of Allah, Most High, \"from Our presence\" meaning \"from Our side.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ الۤر } أيها الإنسان الأحق الأليق لإعلاء الواء لوازم الألوهية وارتفاع رايات رموز أسرار الربوبية بين الأنام بالبيان والتبيان هذا { كِتَابٌ } أنزل إليك لتأييدك في أمرك، مصدق لما في الكتب السالفة جامع لأحكامها { أُحْكِمَتْ } ونظمت { آيَاتُهُ } أشد تنظيم وأبلغ إحكام وإتقان بحيث لا يعرضه خلل واختلال لا في معناه ولا في لفظه؛ لذلك عجزت عن معارضته جميع أرباب اللسن والفصاحة مع وفور وعيهم { ثُمَّ } بعد إحكامه لفظاً ومعنى { فُصِّلَتْ } وأوضحت فيه من المعارف والحقائق والأحكام المتعلقة بالعقائد والعلوم اليقينية، والقصص المشيرة إلى العبر والمواعظ والأمثال المشعرة إلى الرموز والإشارات { مِن لَّدُنْ حَكِيمٍ } متقن في أفعاله { خَبِيرٍ } [هود: 1] يصدر عنه الأفعال على وجه الخبرة والاعتبار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: كتاب: خبر، أي: هذا كتاب\n وأحكمت: صفة\n ومن لدن: خبر ثان، أو خبر \" كتاب \" إن جعل مبتدأ، أو صفة له، إن كان خبراً\n وأَلاَّ تعبدوا: \" أن \" مفسرة، أو مصدرية في موضع مفعول لأجله، أو بدل من الآيات أو مستأنف\n وأن استغفروا: عطف عليه\n وحين: متعلق بمحذوف، أي: ألا إنهم يثنونها حين يستغشون\n\n\n الخ\n ويعلم: استئناف لبيان النقض عليهم\n يقول الحق جل جلاله: أيها الرسول المصطفى، هذا الذي تقرؤه { كتابٌ أحكمت آياته } أتقنت، ونظمت نظماً محكماً، لا يعتريه خلل من جهة اللفظ ولا المعنى، أو أحكمت من النسخ بشريعة أخرى، أو أحكمت بالحُجج والبراهين، أو جعلت حكيمة لأنها مشتملة على أمهات الحكم العلمية\n { ثم فُصَّلتْ } بُينت لاشتمالها على بيان العقائد والأحكام والمواعظ والأخبار\n أو فصلت سورة سورة ليسهل حفظها\n وفُصلت بالإنزال نجماً نجماً، في أزمنة مختلفة\n أو فُصل فيها لُخص ما يحتاج إليه من الأحكام\n وثم: للتفاوت في الحكم لأن الأحكام صفة ذاتية، والتفصيل إنما هو بحسب من يفصل له\n نزل ذلك في الكتاب { من لَّدنْ حكيمٍ خبيرٍ } ، ولذلك كان محكماً مفصلاً بالغاً في ذلك الغاية لأن الحكيم الخبير لا يخفى عليه ما يخل بنظم الكلام\n قائلاً ذلك الكتاب: ألا تعبدوا معه غيره\n وقال في القوت: { كتاب أحكمت آياته } يعني: بالتوحيد، { ثم فصلت } أي: بالوعد والوعيد\n ثم قال: { من لدن حكيم } أي: بالإحكام للأحكام، { خبير } بالتفصيل للحلال والحرام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:6",
      "similarity": 0.6339501469360211
    },
    {
      "verse": "4:67",
      "similarity": 0.5967027630835726
    },
    {
      "verse": "18:65",
      "similarity": 0.5859271898895966
    },
    {
      "verse": "17:80",
      "similarity": 0.5010485294738491
    },
    {
      "verse": "18:2",
      "similarity": 0.4782048760151293
    }
  ]
}