{
  "chapter": "هود",
  "text": "افمن كان على بينة من ربه ويتلوه شاهد منه ومن قبله كتب موسى اماما ورحمة او۟لئك يؤمنون به ومن يكفر به من الاحزاب فالنار موعده فلا تك فى مرية منه انه الحق من ربك ولكن اكثر الناس لا يؤمنون",
  "translations": [
    {
      "translation": "But as for those who have clear evidence from their Lord followed up by a witness from Him - and before it the Book of Musa came as a model and a mercy - such people have iman in it. Any faction which rejects it is promised the Fire. Be in no doubt about it. It is the Truth from your Lord. But most people have no iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will he who has a clear proof from his Lord, which acts as evidence from Him, before which the Book of Moses was a way-giver and a grace, (not believe in it)? Whoever among the partisans does not believe in it shall have Hell as the promised award. So have no doubt about it, for surely it's the truth from your Lord, though most men may not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can it happen that he who takes his stand on a clear evidence from his Lord, subsequently followed by a witness from Him (in his support), and prior to that the Book of Moses was revealed as a guide and a mercy, (would even he deny the truth in the manner of those who adore the life of this world)? Rather, such men are bound to believe in it. The Fire shall be the promised resort of the groups that disbelieve. So be in no doubt about it for this indeed is the truth from your Lord although most people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they be compared with those whose Lord has given them a guidance which is testified by a witness from among their own people and by the Book of Moses, a guide and a mercy. Such people do believe in this guidance (in the Quran). Those who disbelieve (in the Quran) will have hell as their dwelling place. Thus, (Muhammad), have no doubt about it (the Quran). It is certainly the truth from your Lord, yet many people do not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So is the one who is upon the clear proof* from his Lord, and comes a witness upon it from Allah, and before it the Book of Moosa, a leader and a mercy; they accept faith in it; and whoever denies it from all the groups, then the fire is promised for him; so O listener, do not have any doubt concerning it; indeed it is the truth from your Lord; but most people do not believe. (* The Jews who accepted faith in the Qur’an.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can they who rely on a clear proof from their Lord, and whom a witness from Him recites (follows) it; and before it, came the Book of Musa, a guidance and a mercy, they believe therein, but those of the sects that reject it, the Fire will be their promised meeting place. So be not in doubt about it. Verily, it is the truth from your Lord, but most of mankind believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he then who has with him clear proof from his Lord, and a witness from Him recites it and before it (is) the Book of Musa, a guide and a mercy? These believe in it; and whoever of the (different) parties disbelieves in it, surely it is the truth from your Lord, but most men do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what of him who stands upon a clear sign from his Lord, and a witness from Him recites it, and before him is the Book of Moses for an ensample and a mercy? Those believe in it; but whosoever disbelieves in it, being one of the partisans, his promised land is the Fire. So be thou not in doubt of it; it is the truth from thy Lord, but most men do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he (to be counted equal with them) who relieth on a clear proof from his Lord, and a witness from Him reciteth it, and before it was the Book of Moses, an example and a mercy? Such believe therein, and whoso disbelieveth therein of the clans, the Fire is his appointed place. So be not thou in doubt concerning it. Lo! it is the Truth from thy Lord; but most of mankind believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can they be compared to those who possess a clear proof from their Lord, followed up by a witness from Him, preceded by the Book of Moses, as a guide and a mercy? These people believe in it; whereas those groups that deny its truth are promised the Fire. Therefore, have no doubt about it. It is the truth from your Lord, but most people do not believe it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he like unto him who resteth upon an evidence from His Lord, so and there rehearseth it a witness from Him And before it was the Book of Musa, a pattern and a mercy; these believe therein; and whosoever of the sects disbelieveth therein, the Fire is his promised place. Be then thou not in dubitation thereof, verily it is the truth from thy Lord, yet most of the mankind believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who stands on a manifest proof from his Lord, and whom a witness of his own [family] follows? And before him there was the Book of Moses, a guide and mercy. It is they who have faith in it, and whoever defies him from among the factions, the Fire is their tryst. So do not be in doubt about it; it is the truth from your Lord, but most people do not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can they be (like) those who accept a Clear (Sign) from their Lord, and whom a witness from Himself doth teach, as did the Book of Moses before it,- a guide and a mercy? They believe therein; but those of the Sects that reject it,- the Fire will be their promised meeting-place. Be not then in doubt thereon: for it is the truth from thy Lord: yet many among men do not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can they (Muslims) who rely on a clear proof (the Quran) from their Lord, and whom a witness [Prophet Muhammad SAW through Jibrael (Gabriel)] from Him follows it (can they be equal with the disbelievers); and before it, came the Book of Musa (Moses), a guidance and a mercy, they believe therein, but those of the sects (Jews, Christians and all the other non-Muslim nations) that reject it (the Quran), the Fire will be their promised meeting-place. So be not in doubt about it (i.e. those who denied Prophet Muhammad SAW and also denied all that which he brought from Allah, surely, they will enter Hell). Verily, it is the truth from your Lord, but most of the mankind believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then what of he who stands upon a clear proof from his Lord, recited by a witness from Him and before him is the Book of Moses for a guide and a mercy? Those believe in it. But as for those partisans who disbelieve in it, their promised land shall be the Fire. Therefore do not doubt it. It is the truth from your Lord, yet most people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who possesses a clear proof from his Lord, recited by a witness from Him, and before it the Book of Moses, a guide and a mercy? These believe in it. But whoever defies it from among the various factions, the Fire is his promise. So have no doubt about it. It is the truth from your Lord, but most people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So is one who [stands] upon a clear evidence from his Lord [like the aforementioned]? And a witness from Him follows it, and before it was the Scripture of Moses to lead and as mercy. Those [believers in the former revelations] believe in the Qur'an. But whoever disbelieves in it from the [various] factions - the Fire is his promised destination. So be not in doubt about it. Indeed, it is the truth from your Lord, but most of the people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:17] Is he who relies on a clear proof, a clear statement, from his Lord, meaning the Prophet (s), or the believers; it [the proof] being the Qur’ān, [a clear proof] which is followed by a witness, to it of its veracity [as being], from Him, that is, from God; he [the witness] being Gabriel, and before it, [before] the Qur’ān, was the Book of Moses, the Torah, also a witness to it, as an example and a mercy? (imāman wa-rahmatan is a circumstantial qualifier) [is such a person] like one who is not so? No! Those, that is, the ones who rely on a clear proof, they believe in it, that is, in the Qur’ān, and so for them will be Paradise; but he who disbelieves in it of the partisans, [namely] all the disbelievers, the Fire shall be his appointed place. So do not be in doubt, in uncertainty, concerning it, concerning the Qur’ān. Truly it is the Truth from your Lord, but most of mankind, that is, the people of Mecca, do not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is he (to be counted equal with them) who relieth on a clear proof from his Lord) is he who relies on a clear exposition, i.e. the Qur'an, from his Lord, (and a witness from Him) a witness from Allah, i.e. the angel Gabriel (reciteth it) recites to him the Qur'an, (and before it) before the Qur'an (was the Book of Moses) the Torah of Moses which Gabriel recited to him, (an example) to be emulated (and a mercy) to anyone who believes in it? (such) those who believe in the Book of Moses (believe therein) believe in Muhammad (pbuh) and the Qur'an; the reference here is to 'Abdullah Ibn Salam and his followers, (and Whoso disbelieveth therein) whoever disbelieves in Muhammad (pbuh) and in the Qur'an (of the clans) of all the disbelievers, (the Fire is his appointed place) the Fire is his destination. (So be not thou) Muhammad (in doubt concerning it) concerning the end result of the disbelievers. (Lo! it is the Truth from thy Lord) the destination of whosoever disbelieves in the Qur'an is hell; it is also said that this means: do not be in doubt about the Qur'an, it is Gabriel who brought it down; (but most of mankind) the people of Mecca (believe not).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَفَمَن كَانَ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِ } أي: تظنون وتحسبون أن من انكشف له برهان واضح وكشف صريح وشهود محقق من قبل ربه، وتحقق بمقام التوحيد، وبسريان وحدة الذات في جميع الكائنات والفاسدات { وَ } مع ذلك ش { يَتْلُوهُ } يطرأ عليه ويجري على لسانه { شَاهِدٌ } ناطق بتصديقه نازل { مِّنْهُ } أي: من عند ربه؛ امتناناً له وتفضلاً عليه، يريد ويقصد من أفعاله وأعماله الصادرة عنه ظاهراً مثل ما أراد أولئك المحجوبون المستورون عن الحق، وإحاطته وشموله واستقلاله في الآثار الظاهرة في الآفاق كلا وحاشا\n\n[الزمر: 9] وما يتذكر إلا أولوا الألباب\n\n\n\n\n{ وَ } كيف ينكرون شهادة القرآن على تصديق خير الأنام؛ إذ { مِن قَبْلِهِ } أي: من قبل القرآن جاء { كِتَابُ مُوسَىٰ } من قبل مصدقاً له في دعواه وصار من عموم حكمه { إِمَاماً } أي: قدروة لقاطبة الأنام { وَرَحْمَةً } شاملة للخواص والعوام؛ لإهدائهم إلى دار السلام { أُوْلَـٰئِكَ } أي: أهل التوراة، وهم الذين يؤمنون بها ويمتثلون بما فيها { يُؤْمِنُونَ بِهِ } أي: بحقية القرآن لكونه مذكوراً في التوراة المنزل عليه { وَمَن يَكْفُرْ بِهِ } أي: القرآن وبحقيته { مِنَ ٱلأَحْزَابِ } المتحزبين مع المحرفين للتوراة، المنحرفين عن جادة الإيمان { فَٱلنَّارُ مَوْعِدُهُ } لا بدَّ أن يرد عليها على مقتضى العدل الإلهي { فَلاَ تَكُ } يا أكمل الرسل { فِي مِرْيَةٍ } شك وارتياب { مِّنْهُ } أي: من ورودهم عليها إنجازاً لوعده { إِنَّهُ ٱلْحَقُّ } النازل { مِن رَّبِّكَ } لا بدَّ أن يتحقق وقوعه { وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ } لانهماكهم في الغفلة وغلظ حجابهم عن الله { لاَ يُؤْمِنُونَ } [هود: 17] بحقيته وحقية وعده وإنجازه الموعود؛ لذلك حرفوا ما جاء من عنده في كتابه، وزادوا عليه ما لم يجيء منه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أفمن كان: مبتدأ، والخبر محذوف، أي: كمن كان يريد الدنيا وزينتها\n يقول الحق جل جلاله: { أفمن كان على بينةٍ } ، طريقة واضحة { من ربه } وهو النبي صلى الله عليه وسلم والمؤمنون، كمن ليس كذلك، ممن همه الدنيا؟! والمراد بالبينة: ما أدرك صحتَه العقلُ والذوقُ، أي: على برهان واضح من ربه، وهو الدليل العقلي والأمر الجلي\n أو برهان من الله يدله على الحق والصواب فيما ياتيه ويذره، { ويتلُوه } ويتبع ذلك البرهان ـ الذي هو دليل العقل، { شاهدٌ منه } أي: من الله يشهد بصحته، وهو: القرآن، لأنه مصباح البصيرة والقلب فهو يشهد بصحة ما أدركه العقل من البرهان\n { ومن قبله } أي: من قبل القرآن، { كتابُ موسى } يعني: التوارة، فإنها أيضاً متلوة شاهدة بما عليه الرسول ومن تبعه من البينة الواضحة\n أو البينة: القرآن، والشاهد: جيريل عليه السلام، أو عَلِيٌّ ـ كرم الله وجهه ـ، أو الإنجيل، وهو حسن، لقوله: { ومن قبله كتابُ موسى } فإن التوراة قبل الإنجيل\n قال ابن عطية: وهنا اعتراض وهو أن الضمير قي \" قبله \" عائداً على القرآن، فَلِمَ لَمْ يذكر الإنجيل ـ وهو قبله ـ وبينه وبين كتاب موسى؟ فالانفصال عنه: أنه خَصَّ التوراة بالذكر لأن الملّتين متفقتان على أنها من عند الله، والإنجيل قد خالف فيها\n فكان الاستشهاد بما تقوم به الحجة على الكتابين أولى\n وهذا كقول الجن\n\n[الاحقاف: 30]\n وقول النجاشي: \" إن هذا والذي جاء به موسى ليخرج من مشكاه واحدة \" ،\n هـ\n وإذا فسرنا الشاهد بالإنجيل سقط الاعتراض\n ثم وصف التوراة بقوله: { إماماً }\n أي: مؤتماً به في الدين، لأجله، { ورحمةً } على المنزل عليهم\n { أولئك } أي: من كان على بينة من ربه، { يُؤمنون به } أي: بالقرآن، { ومن يكفرْ به من الأحزاب }: كأهل مكة، ومن تحزب منهم على رسول الله صلى الله عليه وسلم، { فالنارُ موعده } يدخلها لا محالة، { فلا تكُ في مريةٍ } شك { منه } أي: من ذلك الموعد، أو القرآن، { إنه الحقُ من ربك } الثابت وقوعه، { ولكن أكثرَ الناس لا يؤمنون } لقلة نظرهم، وإخلال فكرتهم\n الإشارة: لا يكون العبد على بينة من ربه حتى يتحقق فيه أمران، أولهما: التوبة النصوح، والثاني: الزهد التام\n فإذا تحقق فيه الأمران كان بينة من ربه\n وهي درجات أولها: بينة ناشئة عن صحيح النظر ولاعتبار، وهي لقوم نظروا في الحجج والبراهين العقلية والدلائل السمعية، فأدركوا وجود الحق من طريق الإيمان بالغيب، وهم: أهل الدليل والبرهان\n وثانيها: بينة ناشئة عن الرياضات والمجاهدات والاعتزال في الخلوات، فخرقت لهم العوائد الحسيات فرأوا كرامات وخوارق عادات، فأدركوا وجود الحق على وجه التحقيق والبيان، مع رقة الحجاب والوقوف بالباب\n\n\nوهم: العُبّاد، والزهاد، والصالحون من أهل الجد والاجتهاد\n وثالثها: بينة ناشئة عن الذوق والوجدان، والمكاشفة والعيان، وهي لقوم دخلوا في تربية المشايخ، فتأدبوا وتهذبوا، وشربوا خمرة غيبتهم عن حسهم ورسمهم فغابوا عن الأكوان بشهود المكون\n فهم يستدلون بالله على غيره\n قَدَّّسُوا الحق أن يحتاج إلى دليل، وهؤلاء هم الأفراد وخواص العباد، وإليهم أشار الشاعر بقوله:\n\nوقال في القوت: { أفمن كان على بينة من ربه } أي: من شهد مقام الله ـ عز وجل ـ بالبيان، فقام له بشهادة الإيقان، فليس هذا كمن زُين له سُوء عمله، واتبع هواه، فآثره على طاعة مولاه\n بل هذا قائم بشهادته، متبع لشهيده، مستقيم على محبة معبوده هـ\n وقال الورتجبي: تقدير الآية على وجه الاستفهام: أفمن كان على بينة من ربه كمن هو في الضلالة والجهالة؟ أفمن كان على معرفة من ربه، وولاية وسلامة وكرامة، وكل عارف إذا شاهد الحق سبحانه بقلبه وروحه، وعقله وسره، فأدرك فيض أنوار جماله، وقربه، يؤثر ذلك في هيكله حتى يبرز من وجهه نور الله الساطع، ويراه كل صاحب نظر، قال تعالى: { ويتلوه شاهد منه } ، والبينة: بصيرة المعرفة، والشاهد: بروز نور المشاهدة منه\n وأيضاً: البينة: كلام المعرفة\n والشاهد: الكتاب والسنة\n ثم قال عن الجنيد: البينة: حقيقة يؤيدها ظاهر العلم\n هـ\n  والحاصل: أن البينة أمر باطني، وهي: المعرفة، إما بالبرهان، أو بالعيان، والشاهد الذي يتلو هو العلم الظاهر، فيتفق ما أدركه العقل أو الذوق مع ما أفاده النقل، فتتفق الحقيقة مع الشريعة\n كلِّ في محله، الباطن منور بالحقائق، والظاهر مُؤيد بالشرائع\n وهذا غاية المطلوب والمرغوب\n رزقنا الله من ذلك الحظ الأوفر بمنِّه وكرمه\n ثم ذكر وعيد من كذب بها، فقال: { وَمَنْ أَظْلَمُ مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً }\n\n",
      "translations": []
    }
  ]
}