{
  "chapter": "هود",
  "text": "ومن اظلم ممن افترى على الله كذبا او۟لئك يعرضون على ربهم ويقول الاشهد هؤلاء الذين كذبوا۟ على ربهم الا لعنة الله على الظلمين",
  "translations": [
    {
      "translation": "Who could do greater wrong than those who invent lies against Allah? Such people will be arrayed before their Lord and the witnesses will say, 'Those are the ones who lied against their Lord.' Yes indeed! Allah's curse is on the wrongdoers,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more wicked than he who invents lies about God? Such men shall be arraigned before their Lord, and the witnesses will testify: \"These are those who imputed lies to God.\" Beware! The scourge of God will fall on the unjust,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is a greater wrong-doer than he who invents a lie against Allah? Such men will be set forth before their Lord and witnesses will say: 'These are the ones who lied against their Lord. Lo! Allah's curse be upon the wrong-doers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who are more unjust than those who ascribe falsehood to God? When such people are brought into the presence of their Lord, the witness will say, \"These are the ones who told lies about their Lord. Certainly God will condemn the unjust\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than the one who fabricates a lie against Allah? They will be presented before their Lord, and the witnesses* will say, “These are they who lied concerning their Lord; the curse of Allah be upon the unjust!” (* The Prophets and angels.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who invents a lie against Allah. Such will be brought before their Lord, and the witnesses will say,\"These are the ones who lied against their Lord!\" No doubt! The curse of Allah is on the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who forges a lie against Allah? These shall be brought before their Lord, and the witnesses shall say: These are they who lied against their Lord. Now surely the curse of Allah is on the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who forges against God a lie? Those shall be presented before their Lord, and the witnesses will say, 'Those are they who lied against their Lord.' Surely the curse of God shall rest upon the evildoers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doeth greater wrong than he who inventeth a lie concerning Allah? Such will be brought before their Lord, and the witnesses will say: These are they who lied concerning their Lord. Now the curse of Allah is upon wrong-doers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than the one who fabricates a lie against God? Such people shall be brought before their Lord, and the witnesses will say, \"These are the ones who lied about their Lord.\" Surely God's rejection is merited by such wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who doth greater wrong than he who fabricateth a lie against Allah! these shall be set before their Lord, and the witnesses shall say; these are they who lied against their Lord. Lo! the curse of Allah shall fall on the wrong-doers-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is a greater wrongdoer than him who fabricates a lie against Allah? Such shall be presented before their Lord, and the witnesses will say, ‘It is these who lied against their Lord.’ Behold! The curse of Allah is upon the wrongdoers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doth more wrong than those who invent a life against Allah? They will be turned back to the presence of their Lord, and the witnesses will say, \"These are the ones who lied against their Lord! Behold! the Curse of Allah is on those who do wrong!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who invents a lie against Allah. Such wi, l be brought before their Lord, and the witnesses will say, \"These are the ones who lied against their Lord!\" No doubt! the curse of Allah is on the Zalimun (polytheists, wrong-doers, oppressors, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is greater in evil than he who forges a lie against Allah? Those, they shall be brought before their Lord, and witnesses will say: 'Those are they who lied against their Lord' Indeed, the curse of Allah shall fall upon the evildoers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than he who fabricates lies about God? These will be presented before their Lord, and the witnesses will say, “These are they who lied about their Lord.” Indeed, the curse of God is upon the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who invents a lie about Allah? Those will be presented before their Lord, and the witnesses will say, \"These are the ones who lied against their Lord.\" Unquestionably, the curse of Allah is upon the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:18] And who, that is, none, does greater wrong than he who invents a lie concerning God?, by ascribing to Him partner and child. Those, they shall be brought before their Lord, on the Day of Resurrection, amid [the rest of] creation, and the witnesses (ashhād is the plural of shāhid) namely, the angels, who will bear witness that the messengers conveyed [the Message] and that the disbelievers denied [them], will say, ‘These are they who lied concerning their Lord’. Surely the curse of God is upon the wrong-doers, the idolaters;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who doeth greater wrong) who is more insolent and daring (than he who inventeth a lie concerning Allah? Such will be brought before their Lord) they will be dragged to their Lord, (and the witnesses) the angels and the prophets (will say: These) the disbelievers (are they who lied concerning their Lord. Now the curse of Allah) the chastisement of Allah (is upon wrong-doers) upon the idolaters,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ أَظْلَمُ } على الله { مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً } عمداً، وحرف كتابه بتنقيص شيء منه أو زيادة عليه { أُوْلَـٰئِكَ } المحرفون المجترئون على الله بتبديل آياته { يُعْرَضُونَ } في يوم العرض الأكبر { عَلَىٰ رَبِّهِمْ } ويُسألون عما فعلوا بكتاب الله، فينكرون ويستنزهون أنفسهم عنه { وَيَقُولُ ٱلأَشْهَادُ } من أعضائهم وجوارحهم إلزاماً لهم: { هَـٰؤُلاۤءِ } المسرفون المعاندون { ٱلَّذِينَ كَذَبُواْ عَلَىٰ رَبِّهِمْ } وحرفوا كتابه افتراء ومراء، ظلماً وعدواناً، وبعد إشهاد هؤلاء الأشهاد، نودي من وراء سرادقات العز والجلال، تفضيحاً لهم وتخذيلاً على رءوس الأشهاد: { أَلاَ لَعْنَةُ ٱللَّهِ } وطرده وإبعاده من سعة رحمته { عَلَى ٱلظَّالِمِينَ } [هود: 18] المجاوزين عن مقتضى حكمه وحكمته عناداً ومكابرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: مثلاً: تمييز\n يقول الحق جل جلاله: { ومن أظلمُ } أي: لا أحد أظلم { ممن افترى على الله كذباً } بأن أسند إليه ما لم يقله، وكذب بما أنزله، أو نسب لله ما لا يليق بجلاله\n { أولئك يُعرضون على ربهم } يوم القيامة، بأن يحبسُوا في الموقف، وتعرض عليهم أعمالهم على رؤوس الأشهاد، { ويقول الأشهادُ } من الملائكة والنبيين، أو كل من شهد الموقف: { هؤلاء الذين كذبوا على ربهم ألا لعنة الله على الظالمين } وهو تهويل عظيم لما يحيق بهم حينئذٍ، لظلمهم بالكذب على الله، ورد الناس عن طريق الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:60",
      "similarity": 0.4897870724562075
    },
    {
      "verse": "3:94",
      "similarity": 0.3922402597449267
    },
    {
      "verse": "2:161",
      "similarity": 0.368345288285912
    },
    {
      "verse": "15:35",
      "similarity": 0.36795976146244896
    },
    {
      "verse": "38:78",
      "similarity": 0.36795976146244896
    }
  ]
}