{
  "chapter": "هود",
  "text": "فلعلك تاركۢ بعض ما يوحى اليك وضائقۢ به صدرك ان يقولوا۟ لولا انزل عليه كنز او جاء معه ملك انما انت نذير والله على كل شىء وكيل",
  "translations": [
    {
      "translation": "Perhaps you are leaving aside part of what has been revealed to you and your breast is constricted by this because they say, 'Why has treasure not been sent down to him or an angel not accompanied him?' You are only a warner and Allah is Guardian over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may haply omit some of what has been revealed to you, and may be disheartened because they say: \"Why was no treasure sent down to him, or an angel accompanied him?\" Yet you have been sent to warn alone, for God takes care of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Messenger!) Let it not happen that you omit (to expound) a portion of what was revealed to you. And do not be distressed that they will say: 'Why was a treasure not bestowed upon him?' or 'Why did no angel accompany him?' For you are merely a warner, whereas Allah has control over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps you, (Muhammad), may by chance leave (untold) a part of that which is revealed to you and feel grieved because they say, \"Why has some treasure not been sent to him or an angel sent down with him?\" Say, \"I have come only to warn you.\" God is the Guardian of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will you forsake part of what is divinely revealed to you and be disheartened because they say, “Why has not a treasure been sent down along with him?”, or “An angel should have come with him”? You are purely a Herald of Warning*; and Allah is the Guardian over all things. (* Therefore do not grieve over their sayings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So perchance you may give up a part of what is revealed unto you, and that your breast feels straitened for it because they say, \"Why has not a treasure been sent down unto him, or an angel come with him\" But you are only a warner. And Allah is a Guardian over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, it may be that you will give up part of what is revealed to you and your breast will become straitened by it because they say: Why has not a treasure been sent down upon him or an angel come with him? You are only a warner; and Allah is custodian over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perchance thou art leaving part of what is revealed to thee, and thy breast is straitened by it, because they say, 'Why has a treasure not been sent down upon him, or an angel not come with him?' Thou art only a warner; and God is a Guardian over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A likely thing, that thou wouldst forsake aught of that which hath been revealed unto thee, and that thy breast should be straitened for it, because they say: Why hath not a treasure been sent down for him, or an angel come with him? Thou art but a warner, and Allah is in charge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may [feel the inclination] to leave aside a part of what is revealed to you and you may be distressed because they say, \"Why has no treasure been sent down to him, why has no angel come with him?\" But you are only to give warning. God is the guardian of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So hapoy thou mayest abandon part of that hich hath been revealed unto thee, and thy breast is straitened thereby, because they say: wherefore hath not a treasure been sent down unto him, or an angel come with him! Thou art but a warner, and of everything Allah is the Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Look out] lest you should disregard aught of what has been revealed to you, and be upset because they say, ‘Why has not a treasure been sent down to him, or [why does] not an angel accompany him?’ You are only a warner, and Allah watches over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perchance thou mayest (feel the inclination) to give up a part of what is revealed unto thee, and thy heart feeleth straitened lest they say, \"Why is not a treasure sent down unto him, or why does not an angel come down with him?\" But thou art there only to warn! It is Allah that arrangeth all affairs!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So perchance you (Muhammad SAW) may give up a part of what is revealed unto you, and that your breast feels straitened for it because they say, \"Why has not a treasure been sent down unto him, or an angel has come with him?\" But you are only a warner. And Allah is a Wakil (Disposer of affairs, Trustee, Guardian, etc.) over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps you are leaving part of what has been sent down to you, and your chest is straitened by it, because they say: 'Why has no treasure been sent down to him, or an angel come with him' You are only a warner, and Allah is a Guardian over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps you wish to disregard some of what is revealed to you, and you may be stressed because of it, since they say, “If only a treasure was sent down to him, or an angel came with him.” You are only a warner, and God is Responsible for all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then would you possibly leave [out] some of what is revealed to you, or is your breast constrained by it because they say, \"Why has there not been sent down to him a treasure or come with him an angel?\" But you are only a warner. And Allah is Disposer of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:12] Perhaps, O Muhammad (s), you might [think to] leave out some of what is revealed to you, such that you do not convey it to them, for they do not take it seriously, and that your breast should be straitened by it, by   reciting it to them, because they say, ‘Why has a treasure not been sent down for him, or an angel not come with him?’, to confirm his sincerity, as we had requested? You are but a warner, and yours is only to convey [the Message], not to produce what they have requested; and God is Guardian over all things, He is Preserver [of all things], so He will requite them [accordingly].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتفريع على قولِه { وَلَئِنْ قُلْت إنّكُمْ مَبْعُوثُونَ مِنْ بَعْد الْمَوْت إلَى قوله يَسْتَهْزئُون } \\[ هود : 7 ، 8 \\] مِن ذكر تكذيبهم وعنادهم . يشير هذا التّفريع إلى أنّ مضمون الكلام المفرع عليه سبب لتوجيه هذا التوقع لأنّ من شأن المفرع عليه اليأس من ارعوائهم لتكرر التكذيب والاستهزاء يأساً قد يَبْعَثُ على ترك دعائهم ، فذلك كله أفيد بفاء التفريع .والتوقع المستفاد من ( لعل ) مستعمل في تحذير من شأنه التبليغ . ويجوز أن يقدّر استفهام حذفت أداته . والتقدير : ألَعَلّكَ تارك . ويكون الاستفهام مستعملاً في النفي للتحذير ، وذلك نظير قوله تعالى : { لَعَلّكَ بَاخِعٌ نفسك ألاّ يكونوا مؤمنين } \\[ الشعراء : 3 \\].والاستفهام كناية عن بلوغ الحالة حداً يوجِبُ توقع الأمر المستفهَم عنه حتى أنّ المتكلّم يستفهم عن حصوله . وهذا أسلوب يقصد به التحريك من همة المخاطب وإلهابُ همته لدفع الفتور عنه ، فليس في هذا تجويز ترك النّبيّء صلى الله عليه وسلم تبليغ بعض ما يوحى إليه ، وذلك البعض هو مّا فيه دعوتهم إلى الإيمان وإنذارهم بالعذاب وإعلامهم بالبعث كما يدل عليه قوله تعالى في آية أخرى { وإذَا لَمْ تَأتِهِمْ بِآيَةٍ قَالوا لَوْلاَ اجْتَبَيْتهَا } \\[ الأعراف : 203 \\]. والمعنى تحذيره من التأثّر بعنادهم وتكذيبهم واستهزائهم ، ويستتبع ذلك تأييسَ المشركين من تركه ذكر البعث والإنذار بالعذاب ، فالخطاب مستعمل في حقيقته ومراد منه مع ذلك علم السامعين بمضمونه .{ وضائق } : اسم فاعل من ضاق . وإنما عدل عن أن يقال ( ضيّق ) هنا إلى { ضائق } لمراعاة النظير مع قوله : ( تارك ) لأنّ ذلك أحسن فصاحة . ولأنّ { ضائق } لاَ دَلالَة فيه على تمكّن وصف الضّيْق من صدره بخلاف ضيّق ، إذ هو صفة مشبهة وهي دالة على تمكن الوصف من الموصوف ، إيماء إلى أنّ أقْصَى ما يتوهّم توقعه في جانبه صلى الله عليه وسلم هو ضَيْق قليل يعرض له .والضيق مستعمل مجازاً في الغم والأسف ، كما استعمل ضده وهو الانشراح في الفرح والمسرة .و { ضائق } عطف على { تارك } فهو وفاعله جملة خبر عن ( لعلّك ) فيتسلط عليه التفريع .والباء في { بِه } للسببية ، والضمير المجرور بالباء عائد على ما بعده وهو { أن يقولوا }. و { أن يقولوا } بدل من الضمير . ومثل ذلك مستعمل في الكلام كقوله تعالى : { وأسروا النّجْوَى الّذينَ ظَلَموا } \\[ الأنبياء : 3 \\] ، فيكون تحذيراً من أن يضيق صدره لاقتراحهم الآيات بأن يقولوا : { لولا أنزل عليه كنزٌ أو جاء معه ملكٌ ، ويحصل مع ذلك التحذير من أن يضيق صدره من قولهم : { إن هذا إلاّ سِحْرٌ مبِين } \\[ هود : 7 \\] ، ومن قولهم : ما يَحْبس العذاب عنا ، بواسطة كون { ضائق } داخلاً في تفريع التحذير على قولَيْهم السّابقَيْن . وإنما جيء بالضمير ثم أبدل منه لقصد الإجمال الذي يعقبه التفصيل ليكون أشد تمكّناً في الذهن ، ولقصد تقديم المجرور المتعلق باسم الفاعل على فاعله تنبيهاً على الاهتمام بالمتعلّق لأنّه سبب صدور الفعل عن فاعله فجيء بالضمير المفسر فيما بعدُ لما في لفظ التفسير من الطول ، فيحصل بذكره بُعد بين اسم الفاعل ومرفوعه ، فلذلك اختصر في ضمير يعود عليه ، فحصَل الاهتمام وقُوّيَ الاهتمام بما يدل على تمكنه في الذهن .ومعظم المفسرين جعلوا ضمير { به } عائداً إلى { بعض ما يوحى إليك }. على أن ما يوحى إليه سبب لضيق صدره ، أي لا يضيق له صدرك ، وجعلوا { أن يقولوا } مجروراً بلام التعليل مقدرة . وعليه فالمضارع في قوله : { أن يقولوا } بمعنى المضي لأنهم قالوا ذلك . واللام متعلقة ب { ضائق } وليس المعنى عليه بالمتين .و { لولا } : للتحضيض ، والكنز : المال المكنوز أي المخبوء .وإنزاله : إتيانه من مكان عَال أي من السماء .وهذا القول صدر من المشركين قبل نزول هذه الآية فلذلك فالفعل المضارع مراد به تجدد هذا القول وتكرره منهم بقرينة العلم بأنه صدر منهم في الماضي ، وبقرينة التحذير من أن يكون ذلك سبباً في ضيق صدره لأن التحذير إنما يتعلق بالمستقبل .ومرادهم ب { جاء معه ملك } أن يجيء ملك من الملائكة شاهداً برسالته ، وهذا من جهلهم بحقائق الأمور وتوهمهم أنّ الله يعبأ بإعراضهم ويتنازل لإجابة مقترح عنادهم ، ومن قصورهم عن فهم المعجزات الإلهية ومَدى التأييد الربّاني .وجملة { إنّمَا أنْتَ نَذيرٌ } في موقع العلّة للتحذير من تركه بعض ما يوحى إليه وضيق صدره من مقالتهم . فكأنه قيل لا تترك إبلاغهم بعض ما يوحى إليك ولا يضق صدرك من مقالهم لأنك نذيرٌ لاَ وَكيل على تحصيل إيمانهم ، حتى يترتب على يأسك من إيمانهم تركُ دعوتهم .والقصر المستفاد من { إنما } قصر إضافي ، أي أنت نذير لا موكّل بإيقاع الإيمان في قلوبهم إذ ليس ذلك إليك بل هو لله ، كما دلّ عليه قوله قبله { فَلَعَلّك تَاركٌ بعضَ مَا يوحَى إلَيْكَ وَضَائِقٌ بِه صَدْرُكَ } فهو قصر قلب . وفيه تعريض بالمشركين برد اعتقادهم أنّ الرسول يأتي بما يُسأل عنه من الخوارق فإذا لم يأتهم به جعلوا ذلك سنداً لتكذيبهم إيّاه رداً حاصلاً من مستتبعات الخطاب ، كما تقدم عند قوله تعالى : { فَلَعَلّكَ تَاركٌ بَعْضَ مَا يُوحَى إلَيْكَ } إذ كثر في القرآن ذكر نحو هذه الجملة في مقام الردّ على المشركين والكافرين الذين سألوا الإتيان بمعجزات على وفق هواهم .وجملة { وَاللّه عَلَى كُلّ شَيْء وَكِيل } تذييل لقوله : { فَلَعَلّكَ تَاركٌ بَعْضَ مَا يُوحَى إلَيْكَ } إلى هنا ، وهي معطوفة على جملة { إنما أنت نذير } لما اقتضاه القصر من إبطال أن يكون وكيلاً على إلجائهم للإيمان . ومما شمله عموم { كل شيء } أن الله وكيل على قلوب المكذبين وهم المقصود ، وإنما جاء الكلام بصيغة العموم ليكون تذييلاً وإتياناً للغرض بما هو كالدّليل ، ولينتقل من ذلك العموم إلى تسلية النبي صلى الله عليه وسلم بأن الله مطلع على مكر أولئك ، وأنه وكيل على جزائهم وأن الله عالم ببذل النبي جهده في التبليغ .\n\n",
      "translations": [
        {
          "translation": "(A likely thing, that thou) Muhammad (wouldst forsake aught of that which hath been revealed unto thee) that which you were commanded in the Qur'an of conveying the message and of reviling and denigrating their idols, (and that thy breast should be straitened for it) and that you are annoyed with what you were commanded, (because they say) because the disbelievers of Mecca say: (Why hath not a treasure) wealth from heaven (been sent down for him) for Muhammad to support himself with, (or an angel come with him) to testify in his favour? (Thou art) Muhammad (but a warner) a warning Messenger, (and Allah is in charge) Allah is Custodian; it is also said this means: witness (of all things) of their saying and chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وهيّج قوته ونشاطه بقوله: { إنما أنت نذير } فلا يخلو إنذارك من إحدى الفائدتين إما رفع الحجاب بأن ينجع فيمن وفقه الله تعالى لذلك\n وإما إلزام الحجة لمن لم يوفق لذلك { والله على كل شيء وكيل } فكل الهداية إليه\n { من كان يريد الحياة الدنيا } أي: كل من يعمل عملاً وإن كان من أعمال الآخرة في الظاهر بنية الدنيا لا يريد به إلا حظاً من حظوظها يوفيه الله تعالى أجره فيها ولا يصل إليه من ثواب الآخرة شيء\n فإنّ لكل أحد نصيباً من الدنيا بمقتضى نشأته التي هو عليها ونصيباً من الآخرة بمقتضى فطرته التي فطر عليها\n فإذا لم يرد بعمله إلا الدنيا فقد أقبل بوجهه إليها وأعرض عن الآخرة وجعل النصيب الدنيوي بانجذابه وتوجهه إلى الجهة السفلية حجاب النصيب الأخروي حتى انتكست فطرته وتبعت النشأة واستخدمت نفسه القلب في طلب حظوظها فصار نصيبه من الآخرة منضماً إلى النصيب الدنيوي { وهم فيها } لا ينقصون أي: لا ينقص من ثواب أعمالهم في الدنيا شيء لأنه لما تشكل القلب بهيئة النفس تمثل حظه بصورة حظ النفس",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَعَلَّكَ } يا أكمل الرسل من غاية ودادك إيمانهم ومحبتك متابعتهم { تَارِكٌ بَعْضَ مَا يُوحَىٰ إِلَيْكَ } من عندنا\n مشتملاً على توبيخهم وتقريعهم وزجرهم وتشنيعهم\n كراهة أن يركنوا عنك ونصرفوا عن متابعتك { وَضَآئِقٌ } أي: بسبب وما يوحى إليك { بِهِ صَدْرُكَ } مخافة { أَن يَقُولُواْ } حين أظهرت عليهم بما أوحيت به: { لَوْلاَ } أي: هلا { أُنزِلَ عَلَيْهِ كَنزٌ } بدل هذه التوبيخات والتقريعات من عند ربه ليتابع الناس له { أَوْ جَآءَ مَعَهُ مَلَكٌ } مصدق لنوبته ورسالته ليطيعوا ويؤمنوا له طوعاً بلا كلفة\n لا تبالِ يا أكمل الرسل بهم وبقولهم { إِنَّمَآ أَنتَ نَذِيرٌ } بلغ ما أنزل إليك من إنذارهم وتخويفهم\n ولا تلتفت إلى ردهم وقبولهم\n وتوكل على دينك وثق به\n فإنه يكفي عنك مؤمنة شرورهم وضررهم { وَٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ } صدر عنهم { وَكِيلٌ } [هود: 12] عليهم يعلم منهم ما هو مستوجب العقوبة والعذاب\n وما هو قوي للنوال والثواب\n يجازيهم على مقتضى علمه وخبرته\n أو لم يكف بتصديقك القرآن المعجز لأرباب اللسن والبيا في تشددهم في المعارضة والمقاتلة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: لنبيه صلى الله عليه وسلم: { فلعلك تارك بعضَ ما يُوحى إليك } \n فلا تبلغه وهو ما فيه تشديد على المشركين\n مخافة ردهم واستهزائهم به\n ولا يلزم من توقع الشيء وقوعه\n فالعصمة مانعة من ذلك\n فالرسول ـ عليه الصلاة والسلام ـ لم يترك شيئاً من الوحي إلا بلغه\n ولكن الحق تعالى شجعه وحرضه على التبليغ في المستقبل\n ولو قوبل بالإنكار\n ثم قال له: { وضائق به صدرُكَ } أي: ولعله يعرض لك في بعض الأحيان ضيق في صدرك\n فلا تتلوه عليهم مخافة { أن يقول لولا أُنزل عليه كنز } ينفقه للاستتباع كالملوك\n أو يستغني به عن طلب المعاش\n { أو جاء معه ملكٌ } يشهد له\n والقصد تسليته صلى الله عليه وسلم عن قولهم\n حتى يُبلغ الرسالة ولا يبالي بهم\n وإنما قال: { ضائق } ليدل على اتساع صدره صلى الله عليه وسلم\n وقلة ضيقه في الحال\n { إنما أنت نذير } ليس عليك إلا الإنذار بما أوحي إليك\n ولا عليك ردوا أو اقترحوا\n فلا يضيق صدرك بذلك\n { والله تعالى على كل شيء وكيل } فتوكل عليه\n فإنه عالم بحالهم ومجازيهم على أقوالهم وأفعالهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:58",
      "similarity": 0.5189037437050439
    },
    {
      "verse": "25:8",
      "similarity": 0.4990598058173466
    },
    {
      "verse": "15:97",
      "similarity": 0.4400880166416209
    },
    {
      "verse": "26:13",
      "similarity": 0.34206302844921865
    },
    {
      "verse": "27:70",
      "similarity": 0.31464448006702384
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}