{
  "chapter": "هود",
  "text": "الا من رحم ربك ولذلك خلقهم وتمت كلمة ربك لاملان جهنم من الجنة والناس اجمعين",
  "translations": [
    {
      "translation": "except for those your Lord has mercy on. That is what He created them for - so that the Word of your Lord would be fulfilled: 'I will fill up Hell with the jinn and mankind all together.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those on whom your Lord had mercy for which He has created them. But fulfilled shall be the word of your Lord. \"I will fill up Hell with jinns and men.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except for those on whom your Lord has mercy. And it is for this (exercise of freedom of choice) that He has created them. And the word of your Lord was fulfilled: 'Indeed I will fill the Hell, with men and jinn, altogether.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those upon whom God has granted His mercy. God has created them to receive mercy. The decree of your Lord that He will fill hell with both jinn and human beings has already been ordained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those upon whom your Lord had mercy; and this is why He created them; and the Word of your Lord has been concluded that, “Indeed I will, surely, fill hell with jinns and men combined.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except him on whom your Lord has bestowed His mercy, and for that did He create them. And the Word of your Lord has been fulfilled (His saying): \"Surely, I shall fill Hell with Jinn and men all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those on whom your Lord has mercy; and for this did He create them; and the word of your Lord is fulfilled: Certainly I will fill hell with the jinn and the men, all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "excepting those on whom thy Lord has mercy. To that end He created them, and perfectly is fulfilled the word of thy Lord: 'I shall assuredly fill Gehenna with jinn and men all together.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save him on whom thy Lord hath mercy; and for that He did create them. And the Word of thy Lord hath been fulfilled: Verily I shall fill hell with the jinn and mankind together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to this end He has created them [all], except for those to whom your Lord has shown mercy. The word of your Lord shall be fulfilled, \"I will fill Hell with jinn and men all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save these on whom thy Lord hath mercy; and for that he hath created them. And fulfilled will be the word of thy Lord: surely I will fill Hell with the jinn and mankind together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those on whom your Lord has mercy—and that is why He created them—and the word of your Lord has been fulfilled: ‘I will surely fill hell with jinn and humans, all together!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those on whom thy Lord hath bestowed His Mercy: and for this did He create them: and the Word of thy Lord shall be fulfilled: \"I will fill Hell with jinns and men all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except him on whom your Lord has bestowed His Mercy (the follower of truth - Islamic Monotheism) and for that did He create them. And the Word of your Lord has been fulfilled (i.e. His Saying): \"Surely, I shall fill Hell with jinns and men all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those on whom your Lord shows mercy. For this end He has created them. The Word of your Lord shall be perfectly completed: 'I shall fillGehenna (Hell) with jinn and people, all together'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those on whom your Lord has mercy—for that reason He created them. The Word of your Lord is final: “I will fill Hell with jinn and humans, altogether.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except whom your Lord has given mercy, and for that He created them. But the word of your Lord is to be fulfilled that, \"I will surely fill Hell with jinn and men all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:119] except those on whom your Lord has mercy, [those] for whom He desires good, and so they do not differ in it — and that is why He created them, that is, [He created] those of difference for that [in other words, so   that they should differ] and those deserving mercy for that [in other words, so that they should receive mercy]. And the Word of your Lord has been fulfilled, namely: ‘I will surely fill Hell with jinn and mankind together’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nولمّا أشعر الاختلاف بأنه اختلاف في الدّين ، وأنّ معناه العدول عن الحق إلى الباطل ، لأنّ الحق لا يقبل التعدّد والاختلاف ، عُقّب عموم { ولا يزالون مختلفين } باستثناء من ثبتوا على الدين الحق ولم يخالفوه بقوله : { إلاّ من رحم ربك } ، أي فعصمهم من الاختلاف .وفهم من هذا أنّ الاختلاف المذموم المحذّر منه هو الاختلاف في أصول الدّين الذي يترتّب عليه اعتبار المخالف خارجاً عن الدين وإن كان يزعم أنّه من مُتّبعيه ، فإذا طرأ هذا الاختلاف وجب على الأمّة قصمه وبذل الوسع في إزالته من بينهم بكلّ وسيلة من وسائل الحقّ والعدل بالإرشاد والمجادلة الحسنة والمناظرة ، فإنْ لم ينجع ذلك فبالقتال كما فعل أبو بكر في قتال العرب الذين جحدوا وجوب الزكاة ، وكما فعل عليّ كرّم الله وجهه في قتال الحروريّة الذين كفّروا المسلمين . وهذه الآية تحذير شديد من ذلك الاختلاف .وأما تعقيبه بقوله : { ولذلك خلقهم } فهو تأكيد بمضمون { ولا يزالون مختلفين }. والإشارة إلى الاختلاف المأخوذ من قوله : { مختلفين } ، واللاّم للتعليل لأنّه لمّا خلقهم على جِبِلّة قاضية باختلاف الآراء والنزعات وكان مريداً لمقتضى تلك الجبلّة وعالماً به كما بيّناه آنفاً كان الاختلاف علّة غائية لخلقهم ، والعلّة الغائية لا يلزمها القصر عليها بل يكفي أنها غاية الفعل ، وقد تكون معها غايات كثيرة أخرى فلا ينافي ما هنا قولُه : { وما خلقت الجنّ والإنس إلاّ ليعبدون } \\[ الذاريات : 56 \\] لأنّ القصر هنالك إضافيّ ، أي إلاّ بحالة أن يعبدوني لا يشركوا ، والقصر الإضافي لا ينافي وجود أحوال أخرى غير ما قُصدَ الردّ عليه بالقصر كما هو بيّن لمن مارس أساليب البلاغة العربية .وتقديم المعمول على عامله في قوله : { ولذلك خلقهم } ليس للقصر بل للاهتمام بهذه العلّة ، وبهذا يَندفع ما يوجب الحيرة في التفسير في الجمع بين الآيتين .ثم أعقب ذلك بقوله : { وتمّت كلمة ربّك لأملأنّ جهنم من الجِنّة والنّاس أجمعين } لأنّ قوله : { إلاّ من رحم ربّك } يؤذن بأنّ المستثنى منه قوم مختلفون اختلافاً لا رحمة لهم فيه ، فهو اختلاف مضاد للرحمة ، وضدّ النعمة النقمة فهو اختلاف أوجب الانتقام .وتمام كلمة الرب مجاز في الصّدق والتحقّق ، كما تقدّم عند قوله تعالى : { وتمّت كلمات ربّك صدقاً وعدلاً } في سورة \\[ الأنعام : 115 \\] ، فالمختلفون هم نصيب جهنم .والكلمة هنا بمعنى الكلام . فكلمة الله : تقديره وإرادته . أطلق عليها كلمة } مجازاً لأنّها سبب في صدور كلمة ( كن ) وهي أمر التكوين . وتقدّم تفصيله في قوله تعالى : { وتمّت كلمات ربّك صدقاً وعدلاً } في سورة \\[ الأنعام : 115 \\].وجملة { لأملأنّ جهنّم } تفسير للكلمة بمعنى الكلام . وذلك تعبير عن الإرادة المعبّر عنها بالكلام النفسي .ويجوز أن تكون الكلمة كلاماً خَاطَبَ به الملائكةَ قبل خلق الناس فيكون { لأمْلأنّ جهنّم } تفسيراً ل { كلمة }.و { من الجِنّة والنّاس } تبعيض ، أي لأمْلأن جهنم من الفريقين . و { أجمعين } تأكيد لشمول تثنية كِلا النوعين لاَ لِشُمُول جميع الأفراد لمنافاته لمعنى التبعيض الذي أفادته { من }.\n\n",
      "translations": [
        {
          "translation": "(Save him on whom thy Lord hath mercy) except whom your Lord has saved from falsehood and other religions, and these are the believers; (and for that He did create them) He created the people of mercy for mercy, and created the people of difference for differing. (And the Word of thy Lord hath been fulfilled) the Word of your Lord has been decreed: (Verily I shall fill hell with the jinn and mankind together) with the disbelievers among the jinn and humans.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ودينهم التوحيد والمحبة { ولذلك } الاختلاف { خَلَقهم } ليستعدّ كل منهم لشأن وعمل\n ويختار بطبعه أمراً وصنعة\n ويستتبّ بهم نظام العالم\n ويستقيم أمر المعاش\n فهم محامل لأمر الله حمل عليهم حمول الأسباب والأرزاق وما يتعيش به الناس\n ورتّب بهم قوام الحياة الدنيا كما أن الفئة المرحومة مظاهر لكماله\n أظهر الله بهم صفاته وأفعاله وجعلهم مستودع حكمه ومعارفه وأسراره\n { وتمّت كلمة ربّك } أي: أحكمت وأبرمت وثبتت وهي هذه { لأملأنّ جهنم من الجِنّة والناس أجمعين } لأنّ جهنم رتبة من مراتب الوجود لا يجوز في الحكمة تعطيلها وإبقاؤها في كتم العدم مع إمكانها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ مَن رَّحِمَ رَبُّكَ } وجعل فطرته على صرافة التوحيد { وَلِذٰلِكَ } التوحيد والعرفان { خَلَقَهُمْ } وجبلهم { وَ } بالجملة: { تَمَّتْ كَلِمَةُ رَبِّكَ } بوضع الاختلاف بين استعدادات عباده حسب تجلياته وشئونه على مقتضى أوصافه وأسمائه المتقابلة بحسب الكمال { لأَمْلأَنَّ جَهَنَّمَ } التي أُعدت للأشقياء المردودين المنحرفين عن جادة العدالة الإلهية والقسط الحقيقي { مِنَ ٱلْجِنَّةِ } أي: الشياطين { وَٱلنَّاسِ } التابعين لهم والمقتفين أثرهم { أَجْمَعِينَ } [هود: 119] أي: منهما جميعاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا من رَّحِمَ ربك } إلا ناساً هداهم الله من فضله\n فاتفقوا على ما هو أصل الدين والعمدة فيه\n كالتوحيد والإيمان بجميع الرسل وبما جاؤوا به\n وهم المؤمنون\n  وقوله: { ولذلك خلقهم } إن كان الضمير للناس\n فالإشارة إلى الاختلاف\n واللام للعاقبة\n أي: ولتكون عاقبتهم الاختلاف خلقهم\n وإن كان الضمير يعود على \" من \" \n فالإشارة إلى الرحمة\n أي: إلا من رحم ربك وللرحمة خلقه\n { وتمت كلمة ربك } الأزلية على ما سبق له الشقاء\n أي: نفذ قضاؤه ووعيده في أهل الشقاء\n أو هي قوله للملائكة: { لأَملأَنِّ جهنم من الجَنَّة والناس أجمعين } أي من أهل العصيان منهما\n لا من جميعهما\n الإشارة: الاختلاف بين الناس حكم أزلي\n لا محيدَ عنه\n وقد وقع بين أهل الحق وبين أهل الباطل\n فقد اختلف هذه الأمة في الأصول والفروع\n أما الأصول فأهل توحيد الدليل وقع بينهم تخالف في صفات الحق\n كالمعتزلة والقدرية والجهمية والجبرية مع أهل السنة\n وأما الفروع فالاختلاف بينهم شهير\n فقد كان في أول الإسلام اثنا عشر مذهباً\n ولا تجد علماً من علوم إلا وبين أهله اختلاف\n إلا أهل التوحيد الخاص\n وهم: المحققون من الصوفية\n فكلهم متفقون في الأذواق والوجدان\n وإن اختلفت طرقهم\n وكيفية سيرهم\n فهم متفقون في النهايات\n التي هي معرفة الشهود والعيان\n على طريق الذوق والوجدان\n وفي ذلك يقول ابن البنا ـ رحمه الله ـ:\nوأما قول من قال: [ما زالت الصوفية بخير ما اختلفوا\n فإذا اتفقوا فلا خير فيهم]\n فالمراد بالاختلاف: تغيير بعضهم على بعض\n عند ظهور نقص أو عيب أو ذنب\n فإذا اتفقوا وسكت بعضهم عن بعض فلا خير فيهم\n وقوله عليه الصلاة والسلام:\n \" خلاف أمتي رحمة \" \nالمراد: الاختلاف في الفروع كاختلاف المذاهب ففي ذلك رخصة لأهل الاضطرار لأن من قلد عالماً لقي الله سالماً\n والله تعالى أعلم\n ثم ذكر حكمة سرد قصص الأنبياء: فقال: { وَكُـلاًّ نَّقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ ٱلرُّسُلِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:85",
      "similarity": 0.5359752836516803
    },
    {
      "verse": "32:13",
      "similarity": 0.5298528339017157
    },
    {
      "verse": "6:115",
      "similarity": 0.4644145759263118
    },
    {
      "verse": "6:154",
      "similarity": 0.4157039733133719
    },
    {
      "verse": "50:30",
      "similarity": 0.37699196808673446
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011119.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011119.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:119.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}