{
  "chapter": "هود",
  "text": "ولئن اذقنه نعماء بعد ضراء مسته ليقولن ذهب السيـات عنى انه لفرح فخور",
  "translations": [
    {
      "translation": "but if We let him taste blessings after hardship has afflicted him, he says, 'My troubles have gone away,' and he is overjoyed, boastful -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We let him taste Our favours after adversity, he says: \"Misfortune has left me,\" and begins to brag and exult,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We let him taste favour after harm has touched him, he says: 'All my ills are gone', and he suddenly becomes exultant and boastful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If after his hardship, We grant him a blessing, he grows proud and rejoicing and says, \"All my hardships have gone\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We bestow upon him the enjoyment of a favour after a misfortune that had befallen him, he will surely say, “The evils have gone away from me”; indeed he is jubilant, boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We let him taste good (favor) after evil (poverty and harm) has touched him, he is sure to say: \"Ills have departed from me.\" Surely, he is exultant and boastful (ungrateful to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We make him taste a favor after distress has afflicted him, he will certainly say: The evils are gone away from me. Most surely he is exulting, boasting;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We let him taste prosperity after hardship that has visited him, he will say, 'The evils have gone from me'; behold, he is joyous, boastful --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We cause him to taste grace after some misfortune that had befallen him, he saith: The ills have gone from me. Lo! he is exultant, boastful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if, after adversity, We let him taste good fortune he says, \"All my ills are gone.\" He becomes exultant and boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We let him taste favour after harm hath touched him, he saith: the ills have departed from me; verily he becometh elated, boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We let him have a taste of Our blessings after adversities have befallen him, he will surely say, ‘All ills have left me.’ Indeed, he becomes a vain braggart,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We give him a taste of (Our) favours after adversity hath touched him, he is sure to say, \"All evil has departed from me:\" Behold! he falls into exultation and pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We let him taste good (favour) after evil (poverty and harm) has touched him, he is sure to say: \"Ills have departed from me.\" Surely, he is exultant, and boastful (ungrateful to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if after adversity had come upon him, We let him taste prosperity, he says: 'Evil has left me' see, he is jubilant and boastful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We give him a taste of prosperity, after some adversity has afflicted him, he will say, “Troubles have gone away from me.” He becomes excited and proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We give him a taste of favor after hardship has touched him, he will surely say, \"Bad times have left me.\" Indeed, he is exultant and boastful -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:10] But if We cause him to taste prosperity after some misery, [such as] impoverishment and hardship, that had befallen him, assuredly he will say, ‘The ills, the afflictions, have gone from me’, when he had not anticipated that they would go away; yet still he does not give thanks for this; lo!, he is exultant, wanton, boastful, to people of what he has been given;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if We cause him) i.e. the disbeliever (to taste grace after some misfortune) after some hardship (that had befallen him, he saith) i.e. the disbeliever: (The ills) hardships (have gone from me. Lo! he is exultant) arrogant, (boastful) about Allah's blessings and does not give thanks;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَئِنْ أَذَقْنَاهُ } معناه أمسَسْنَاهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd if We were to give him a taste of Our punishment, {indeed, We would make him taste it} [i.e., make him experience it].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولئن أذقناه نعماءَ بعد ضراء مسَّتْه } كصحة بعد سقم\n وغنى بعد فقر\n أو علم بعد جهل\n { ليقولنَّ ذهب السيئاتُ }\n أي: المصائب التي مستني\n { عني } \n ونسي مقام الشكر\n { إنه لفرح } أي: بطر متعزز بها\n { فخورٌ } على الناس\n متكبر بها\n مشغول بذلك عن شكرها\n والقيام بحقها\n قال البيضاوي: وفي لفظ الإذاقة والمس تنبيه على ان ما يجده الإنسان في الدنيا من النعم والمحن كالأنموذج لما يجده في الآخرة\n وأنه يقع في الكفر والبطر بأدنى شيء لأن الذوق: إدراك المطعم\n والمس مبدأ الوصول إليه\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:14",
      "similarity": 0.45270558758101026
    },
    {
      "verse": "57:23",
      "similarity": 0.3915901193961771
    },
    {
      "verse": "4:36",
      "similarity": 0.3767593857530747
    },
    {
      "verse": "3:120",
      "similarity": 0.33823981781300694
    },
    {
      "verse": "42:48",
      "similarity": 0.28809414364847297
    }
  ]
}