{
  "chapter": "هود",
  "text": "وكلا نقص عليك من انۢباء الرسل ما نثبت به فؤادك وجاءك فى هذه الحق وموعظة وذكرى للمؤمنين",
  "translations": [
    {
      "translation": "We have given you all this news about the Messengers so We can make your heart firm by means of it. The truth has come to you in this and an admonishment and reminder to the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The histories of apostles that We relate to you are (meant) to strengthen your heart. Through them has the truth come to you, and guidance, and reminder to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad!) We narrate these anecdotes of Messengers to you that We may strengthen through them your heart. In these anecdotes come to you the truth, and an exhortation, and a reminder for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), We tell you all the stories of the Messengers which will strengthen your heart. In the Quran We have revealed the Truth to you with good advice and reminders for the faithful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We relate to you all the accounts of Noble Messengers, in order to steady your heart with it; and in this the truth has come to you, and for the Muslims a preaching and advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all that We relate to you of the news of the Messengers is in order that We may make strong and firm your heart thereby. And in this has come to you the truth, as well as an admonition and a reminder for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all we relate to you of the accounts of the apostles is to strengthen your heart therewith; and in this has come to you the truth and an admonition, and a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all that We relate to thee of the tidings of the Messengers is that whereby We strengthen thy heart; in these there has come to thee the truth and an admonition, and a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all that We relate unto thee of the story of the messengers is in order that thereby We may make firm thy heart. And herein hath come unto thee the Truth and an exhortation and a reminder for believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have told you the stories of the prophets to make your heart firm and in these accounts truth has come to you, with an exhortation and a reminder for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all that We recount unto thee of the stories of the apostles is in order that We may make firm thy heart thereby. And in this there hath come to thee truth and an exhortation and an admonition unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever We relate to you of the accounts of the apostles are those by which We strengthen your heart, and there has come to you in this [surah] the truth and an advice and admonition for the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that we relate to thee of the stories of the messengers,- with it We make firm thy heart: in them there cometh to thee the Truth, as well as an exhortation and a message of remembrance to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all that We relate to you (O Muhammad SAW) of the news of the Messengers is in order that We may make strong and firm your heart thereby. And in this (chapter of the Quran) has come to you the truth, as well as an admonition and a reminder for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all We relate to you of the tidings of the Messengers is that whereby We strengthen your heart and through these the truth has come to you, and anadmonition and a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything We narrate to you of the history of the messengers is to strengthen your heart therewith. The truth has come to you in this, and a lesson, and a reminder for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And each [story] We relate to you from the news of the messengers is that by which We make firm your heart. And there has come to you, in this, the truth and an instruction and a reminder for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:120] And all that (kullān is in the accusative because [it is the direct object] of naqussu, ‘We relate’; and the nunation compensates for a [missing] genitive annexation), that is, all that is necessary, We relate to you of the accounts of the messengers, that (mā substitutes for kullan, ‘all that’) with which We might strengthen, reassure, your heart. And in these, accounts, or verses, there has come to you the Truth and an admonition and a reminder to the believers: they are specifically mentioned here because they are the ones to benefit from them, through their belief [in them], in contrast to [the case with] the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا تذييل وحوصلة لما تقدّم من أنباء القرى وأنباء الرسل . . .فجملة { وكُلاّ نَقُصّ عليك من أنباء الرسل } إلى آخرها عطفُ الإخبار على الإخبار والقصة على القصة ، ولك أن تجعل الواو اعتراضيّة أو استئنافية . وهذا تهيئة لاختتام السورة وفذلكة لما سيق فيها من القصص والمواعظ .وانتصف { كُلاّ } على المفعولية لفعل { نقُصُّ }. وتقديمه على فعله للاهتمام ولِمَا فيه من الإبهام ليأتي بيانه بعده فيكون أرسخ في ذهن السامع .وتنوين { كُلاّ } تنوين عوض عن المضاف إليه المحذوف المبيّن بقوله : { من أنباء الرسل }. فالتقدير : وكلّ نبأ عن الرسل نقصّه عليك ، فقوله : { من أنباء الرسل } بيان للتّنوين الذي لحق ( كلاّ ). و { ما نثبّت به فؤادك } بدل من { كلاّ }.والقصص يأتي عند قوله تعالى : { نحن نقصّ عليك أحسن القصص } في أوّل سورة \\[ يوسف : 3 \\].والتثبيت : حقيقته التسكين في المكان بحيث ينتفي الاضطراب والتزلزل . وتقدّم في قوله تعالى : { لكان خيراً لهم وأشدّ تثبيتاً } في سورة \\[ النساء : 66 \\] ، وقوله : { فثبتوا الذين آمنوا } في سورة \\[ الأنفال : 12 \\] ، وهو هنا مستعار للتقرير كقوله : { ولكن ليطمئن قلبي } \\[ البقرة : 260 \\].والفؤاد : أطلق على الإدراك كما هو الشّائع في كلام العرب .وتثبيت فؤاد الرّسول صلى الله عليه وسلم زيادة يقينه ومعلوماته بما وعده الله لأن كل ما يعاد ذكره من قصص الأنبياء وأحوال أممهم معهم يزيده تذكراً وعلماً بأنّ حاله جار على سنن الأنبياء وازداد تذكراً بأنّ عاقبته النصر على أعدائه ، وتجدّد تسلية على ما يلقاه من قومه من التكذيب وذلك يزيده صبراً . والصبر : تثبيت الفؤاد .وأنّ تماثل أحوال الأمم تلقاء دعوة أنبيائها مع اختلاف العصور يزيده علماً بأنّ مراتب العقول البشريّة متفاوتة ، وأن قبول الهدي هو منتهى ارتقاء العقل ، فيعلم أن الاختلاف شنشنة قديمة في البشر ، وأنّ المصارعة بين الحق والباطل شأن قديم ، وهي من النواميس التي جُبِلَ عليها النظام البشري ، فلا يُحْزنه مخالفة قومه عليه ، ويزيده علماً بسمُوّ أتباعه الذين قبلوا هداه ، واعتصموا من دينه بعراه ، فجاءه في مثل قصة موسى عليه السّلام واختلاف أهل الكتاب فيه بيان الحق وموعظة وذكرى للمؤمنين فلا يقعوا فيما وقع فيه أهل الكتاب .والإشارة من قوله : { في هذه } قيل إلى السورة وروي عن ابن عبّاس ، فيقتضي أن هذه السورة كانت أوفى بأنباء الرسل من السور النازلة قبلها وبهذا يجري على قول من يقول : إنها نزلت قبل سورة يونس . والأظهر أن تكون الإشارة إلى الآية التي قبلها وهي { فلولا كان من القرون من قبلكم أولوا بقيّة ينهون عن الفساد في الأرض إلى قوله من الجنة والنّاس أجمعين } \\[ هود : 116 119 \\]. فتكون هذه الآيات الثلاث أول ما نزل في شأن النهي عن المنكر .على أن قوله : { وجاءك في هذه الحق } ليس صريحاً في أنه لم يجىء مثله قبل هذه الآيات ، فتأمل .ولعلّ المراد ب { الحق } تأمين الرسول من اختلاف أمته في كتابه بإشارة قوله : { فلولا كان من القرون من قبلكم أولوا بقيّة } \\[ هود : 116 \\] المفهم أنّ المخاطبين ليسوا بتلك المثابة ، كما تقدّمت الإشارة إليه آنفاً .وتعريفُه إشارة إلى حق معهود للنبيء؛ إمّا بأن كان يتطلّبه ، أو يسأل ربه .والموعظة : اسم مصدر الوعظ ، وهو التّذكير بما يَصُدّ المرء عن عمل مضرّ .والذكرى : مجرد التّذكير بما ينفع . فهذه موعظة للمسلمين ليحذروا ذلك وتذكيراً لهم بأحوال الأمم ليقيسوا عليها ويتبصّروا في أحوالها . وتنكير { موعظة وذكرى } للتعظيم .\n\n",
      "translations": [
        {
          "translation": "(And all that We relate unto thee) as We have explained to you (of the story of the messengers) of the events of the messengers (is in order that thereby We may make firm your heart) in order to gladden your heart, that what was done to you was also done to other prophets. (And herein hath come unto thee) in this surah (the Truth) the news of the Truth (and an exhortation) to avoid transgression (and a reminder) an admonition (for believers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وكلاًّ نَقُص عليكَ من أنْبَاء الرسل ما نُثبِت به فؤادك } أي: لما أطلعناك على مقاساتهم الشدائد من أمّتهم مع ثباتهم في مقام الاستقامة وعدم مزلتهم عنه وعلى معاتباتهم عند تلويناتهم وظهور شيء من بقياتهم كما في قصة نوح عليه السلام من سؤال إنجاء الولد\n وعلى قوة ثباتهم وشجاعتهم في يقينهم وتوكلهم كما في قصة هود عليه السلام من قوله:\n[هود\n الآية: 54] إلى قوله:\n[هود\n الآية: 56]\n وعلى كمال كرمهم وفضيلتهم في العتوّ كما في قصة لوط عليه السلام من تفدية البنات لحفظ الأضياف من السوء\n ثبت قلبك في ذلك كله واستحكمت استقامتك وقوي تمكينك بذهاب آثار التلوين عنك وقوي توكلك ورضاك ويقينك وشجاعتك\n وكَمُلَ خلقك وكرمك { وجاءك في هذه } السورة { الحق } أي: ما يتحقق به اعتقاد المؤمنين { ومَوْعظة } لهم يحترزون بها عما أهلك به الأمم\n وتذكير لما يجب أن يتدينوا به ويجعلوه طريقهم وسيرتهم والله أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكُـلاًّ } أي: كل قصة { نَّقُصُّ عَلَيْكَ } يا أكمل الرسل { مِنْ أَنْبَاءِ ٱلرُّسُلِ } العظام من جملة { مَا نُثَبِّتُ بِهِ } ونقرر على التوحيد { فُؤَادَكَ } إذ بكل قصة من القصص المذكورة ينشرح صدرك للتوحيد { وَجَآءَكَ فِي هَـٰذِهِ ٱلْحَقُّ } أي: الشهود والانكشاف التام خاصة { وَمَوْعِظَةٌ وَذِكْرَىٰ لِلْمُؤْمِنِينَ } [هود: 120] الذين يصدقونك ويقتفون أثرك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: \" وكُلاً \" مفعول \" نقص \" ، و \" ما نثبت به \": بدل، أو \" ما \" مفعول \" نَقُصُّ \" ، و \" كلا \": مصدر. أي: ونقص.  علك كُلاً من الاقتصاص ما نثبت به فؤادك. يقول الحق جل جلاله: وكل نبأ { نقص عليك } من أخبار الرسل، ونخبرك به { ما نثبت به فؤادك } ، ليزيدك يقيناُ وطمأنينة، وثباتاً بما تسمع من أخبارهم، وما جرى لهم مع قومهم، وما لقوا من الأذى منهم، فتتسلى بهم، وتثبت على أداء الرسالة، واحتمال أذى الكفار. { وجاءك في هذه } السورة، أو الأنباء المقتصة عليك، { الحق } أي: ما هو حق، { وموعظة وذكرى للمؤمنين } فيتحملون، ويصبرون لما يواجههم من الأذى والإنكار.  الإشارة: ذكر أحوال الصالحين، وسيرهم وكراماتهم جند من جنود القلب، وذكر أشعارهم ومواجيدهم جند من جنود الروح، وقد ورد: أن عند ذكرهم تنزل الرحمة، أي: رحمة القلوب باليقين والطمأنينة. والله تعالى أعلم. ثم أمر بتهديد من خالفه، فقال: { وَقُل لِّلَّذِينَ لاَ يُؤْمِنُونَ ٱعْمَلُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:66",
      "similarity": 0.47462886601401505
    },
    {
      "verse": "53:11",
      "similarity": 0.43029451155890597
    },
    {
      "verse": "104:7",
      "similarity": 0.3734060722651527
    },
    {
      "verse": "47:7",
      "similarity": 0.37275385668165595
    },
    {
      "verse": "14:27",
      "similarity": 0.3646325058638155
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011120.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011120.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:120.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}