{
  "chapter": "هود",
  "text": "ولو شاء ربك لجعل الناس امة وحدة ولا يزالون مختلفين",
  "translations": [
    {
      "translation": "If your Lord had wanted to, He would have made mankind into one community but they persist in their differences,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if your Lord had pleased He could have made all human beings into one community of belief. But they would still have differed from one another,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord so willed, He would surely have made mankind one community. But as things stand, now they will not cease to differ among themselves and to follow erroneous ways\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord wanted, He would have made all people one united nation. They still have different beliefs\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had your Lord willed, He would have made mankind one nation – and they will always keep differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord had so willed, He could surely have made mankind one Ummah, but they will not cease to disagree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord had pleased He would certainly have made people a single nation, and they shall continue to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had thy Lord willed, He would have made mankind one nation; but they continue in their differences\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thy Lord had willed, He verily would have made mankind one nation, yet they cease not differing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If your Lord had wished, He would have made mankind into one community. As it is, they will not cease to dispute, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had thy Lord Willed, He would surely have made mankind of one community, and they will not cease differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord wished, He would have made mankind one community; but they continue to differ,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thy Lord had so willed, He could have made mankind one people: but they will not cease to dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord had so willed, He could surely have made mankind one Ummah [nation or community (following one religion only i.e. Islam)], but they will not cease to disagree,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord willed, He would have made mankind a single nation. But they continue in their differences\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had your Lord willed, He could have made humanity one community, but they continue to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if your Lord had willed, He could have made mankind one community; but they will not cease to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:118] Had your Lord willed, He would have made mankind one community, people of one religion, but they continue to differ, in religion,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if thy Lord had willed, He verily would have made mankind one nation) He would have gathered them to follow one religion: the religion of Islam, (yet they cease not) but they will always be (differing) concerning religion and falsehood,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكيف { وَلَوْ شَآءَ رَبُّكَ } من غاية لطفه لعباده { لَجَعَلَ ٱلنَّاسَ أُمَّةً وَاحِدَةً وَلاَ يَزَالُونَ مُخْتَلِفِينَ } [هود: 118] متفقة على التوحيد بلا مخالفة منهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الاستثناء من ضمير \" يزالون \"\n  يقول الحق جل جلاله: { ولو شاء ربك لجعل الناسَ أمةً واحدة } ، متفقين على الإيمان أو الكفران، لكن مقتضى الحكمة وجود الاختلاف ليظهر مقتضيات الأسماء في عالم الشهادة فاسمه: الرحيم يقتضي وجود من يستحق الكرم والرحمة، وهم: أهل الإيمان\n واسمه: المنتقم والقهار يقتضي وجود من يستحق الاتنقام والقهرية، وهم أهل الكفر والعصيان\n قال البيضاوي: وفيه دليل ظاهر على أن الأمر غير الإرادة، وأنه تعالى لم يرد الإيمان من كل أحد، وأن ما أراد يجب وقوعه\n هـ\n  { ولا يزالون مختلفين } بعضهم على الحق، وهم أهل الرحمة والكرم وبعضهم على الباطل، وهم أهل القهرية والانتقام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:110",
      "similarity": 0.6094007433558001
    },
    {
      "verse": "10:28",
      "similarity": 0.579713553382504
    },
    {
      "verse": "40:34",
      "similarity": 0.3906671379374459
    },
    {
      "verse": "2:217",
      "similarity": 0.34073887412881293
    },
    {
      "verse": "42:8",
      "similarity": 0.3258137057216528
    }
  ]
}