{
  "chapter": "هود",
  "text": "ولا تركنوا۟ الى الذين ظلموا۟ فتمسكم النار وما لكم من دون الله من اولياء ثم لا تنصرون",
  "translations": [
    {
      "translation": "Do not rely on those who do wrong thus causing the Fire to afflict you, for you have no protector besides Allah; then you will not be helped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not lean towards the wicked, or you will be caught in the flames of Hell, and have none to befriend you other than God, nor will you be given help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not incline towards the wrong-doers lest the Fire might seize you and you will have none as your protector against Allah; and then you will not be helped from anywhere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be inclined towards the unjust ones lest you will be afflicted by the hell fire. Besides God, no one can be your protector nor will anyone be able to help you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not incline towards the unjust, for the fire will touch you – and you do not have any supporter other than Allah – then you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And incline not toward those who do wrong, lest the Fire should touch you, and you have no protectors other than Allah, nor would you then be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not incline to those who are unjust, lest the fire touch you, and you have no guardians besides Allah, then you shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lean not on the evildoers, so that the Fire touches you -- you have no protectors apart from God -- and then you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And incline not toward those who do wrong lest the Fire touch you, and ye have no protecting friends against Allah, and afterward ye would not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not incline toward those who do wrong, lest the Fire touch you. For [then] you would have none to protect you from God, and you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lean not toward those who do wrong, lest the Fire should touch you, and ye have no protectors beside Allah nor ye would then be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not incline toward the wrongdoers, lest the Fire should touch you, and you will not have any friend besides Allah; then you will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And incline not to those who do wrong, or the Fire will seize you; and ye have no protectors other than Allah, nor shall ye be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And incline not toward those who do wrong, lest the Fire should touch you, and you have no protectors other than Allah, nor you would then be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not incline to the wrongdoers lest you are touched by the Fire, for then you shall not be helped. You have no guardians other than Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not incline towards those who do wrong, or the Fire may touch you; and you will have no protectors besides God, and you will not be saved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not incline toward those who do wrong, lest you be touched by the Fire, and you would not have other than Allah any protectors; then you would not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:113] And do not incline toward the evildoers, through affection or adulation, or [by showing] satisfaction with their actions, lest the Fire touch, smite, you, and you have, besides God, other than Him, no protectors (min awliyā’: min is extra), to guard you from Him; and then you will not be helped, you will [not] be protected from His chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And incline not towards those who do wrong) themselves by means of disbelief, idolatry and transgression (lest the Fire touch you) as it has touched them, (and ye have no protecting friends) no relatives to help you (against Allah) against Allah's chastisement, (and afterward ye would not be helped) you will not be prevented from what is wanted with you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَرْكَنُوۤاْ } معناهُ ولا تَمِيلُوا\n\n",
      "translations": [
        {
          "translation": " And do not incline [to disbelief]",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولا تَرْكنوا إلى الذين ظَلموا } أي: أشركوا بهوى كامن، ناشئ عن وجود بقية خفية أو التفات خفيّ إلى إثبات غيره، فإنه هو الزيغ المقارن للطغيان في قوله:\n\n[النجم، الآية: 17]، { فتمسّكم } نار السخط والحرمان بالاحتجاب والتعذيب بالفراق من نيران غيرة المحبوب، كما قال تعالى لحبيبه صلى الله عليه وسلم:\n\n \" بشر المذنبين بأني غفور، وأنذر الصديقين بأني غيور \" \n\nولهذا المعنى قال:\n\n \" والمخلصون على خطر عظيم \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَرْكَنُوۤاْ } أي: لا تميلوا ميلة ولا تلفتوا التفاتاً قليلاَ أيها المستوون على صراط الله، المستقيمون لجادة عرفانه { إِلَى ٱلَّذِينَ ظَلَمُواْ } أي: خرجوا عن حدود الله الموضوعة لإصلاح أحوال عباده { فَتَمَسَّكُمُ ٱلنَّارُ } بأدنى الميل والالتفات { وَمَا لَكُمْ مِّن دُونِ ٱللَّهِ مِنْ أَوْلِيَآءَ } ينقذونكم من النار لو توالونهم أو تداومون الميل إليهم { ثُمَّ } اعلموا أنكم لو اخترتم موالاة الظلمة واتخذتموهم إخواناً كسائر المؤمنين { لاَ تُنصَرُونَ } [هود: 113] ولا نقذون من النار، فعليكم ألا تتخذوا الكافر أولياء من دون المؤمنين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تركنوا إلى الذين ظلموا }: لا تميلوا إليهم أدنى ميل فإن الركون: هو الميل اليسير، كالتزيي بزيهم، وتعظيم ذكرهم، وصحبتهم من غير تذكيرهم ووعظهم\n { فتمسَّكم النارُ } لركونهم إليهم\n قال الأوزاعي: ما من شيء أبغض إلى الله تعالى من عَالِم يَزورُ عَاملاً\n هـ\n وقال سفيان: في جهنم وادٍ لا يسكنه إلا القراء الزائرون للملوك\n هـ\n وقال رسول الله صلى الله عليه وسلم:\n\n \" من دَعَا لِظَالٍمٍ بالبَقَاءِ ـ أي بأن قال: بارك الله في عمرك ـ فَقَدْ أَحَبَّ أَنْ يُعْصَى الله في أرضهِ \" \n\nوسئل سفيان عن ظالم أشرف على الهلاك في برية، هل يسقى شربة ماء؟ فقال: لا\n فقيل له: يموت؟! فقال: دعه يموت\n هـ\n وهذا إغراق ولعله في الكافر المحارب، والله أعلم\n قال البيضاوي: وإذا كان الركون إلى من وجد منه ما يسمى ظلماً موجباً للنار، فما ظنك بالركون إلى الظالمين الموسومين بالظلم، ثم الميل إليهم، ثم بالظلم نفسه، والانهماك فيه\n ولعل الآية أبلغ ما يتصور في النهي عن الظلم والتهديد عليه\n وخطاب الرسول صلى الله عليه وسلم ومن معه من المؤمنين بها للتثبيت على الاستقامة التي هي العدل فإن الزوال عنها بالميل إلى أحد طرفي إفراط أو تفريط، ظلم على نفسه أو غيره، بل ظلم في نفسه\n\n\nهـ\n  { وما لكم من دون الله من أولياء } من أنصار يمنعون العذاب عنكم، { ثم لا تُنصرون }: ثم لا ينصركم الله إن سبق في حكمه أنه يعذبكم\n  ولمَّا كان الركون إلى الظلم، أو إلى من تلبس به فتنة، وهي تكفرها الصلاة، كما في الحديث، أمر بها أثره، فقال: { وأقم الصَّلاةَ طرفي النهار } غدوة وعشية، { وزلُفاً من الليل } ساعات منه قريبة من النهار\n والمراد بالصلاة المأمور بها: الصلوات الخمس\n فالطرف الأول: الصبح، والطرف الثاني: الظهر والعصر، والزلف من الليل: المغرب والعشاء، { إن الحسنات يُذهبن السيئات } يكفر بها قال ابن عطية: لفظ الآية عام في الحسنات خاص في السيئات لقوله صلى الله عليه وسلم:\n\n \" ما اجتنَبت الكَبَائِرُ \" \n\nثم قال: وروي أن رسول الله صلى الله عليه وسلم قال:\n\n \" الجُمُعَةُ إلى الجُمعَةِ كفَّارَة، والصَّلوَاتُ الخَمسُ، وَرَمَضانُ إِلى رَمَضانَ كفاره لِمَا بينَهُما ما اجتُنِبت الكبائر \" \n\nانظر تمامه في الحاشية\n قال ابن جزي:\n\n \" رُوي أن رجلاً قََبّل امراة، قلتُ: هو نبهان التمار، فذكر ذلك للنبي صلى الله عليه وسلم وصلَّى معه الصلاة، فنزلت الآية، فقال صلى الله عليه وسلم: \" أين السائل؟ \" فقال: ها أنا ذا، فقال: \" قدغَفَرَ اللَّهُ لَكَ بِصَلاتِكَ مَعَنا \"\n فقال الرجل: أَلِيَ خاصَّةً، أو للمسلمين عامة؟ فقال: \" للمسلمين عَامَّةً \" \n\nوالآية على هذا مدنية\n وقيل: إن الآية كانت قبل ذلك، وذكرها النبي صلى الله عليه وسلم للرجل مستدلاً بها\n والآية على هذا مكية كسائر السورة، وإنما تُذهب الحسناتُ ـ عند الجمهورـ الصغائر إذا اجتنبت الكبائر\n هـ\n قلت: وقيل: تكفر مطلقاً اجتُنِبَت الكبائر أم لا، وهو الظاهر،لأنه إذا حصل اجتناب الكبائر كفرت بلا سبب لقوله تعالى\n\n[النساء: 31] الآية\n وقوله عليه الصلاة والسلام:\n\n \" ما اجتنبت الكبائر \" \n\nمعناه: أن الصلوات والجمعة مكفرة لما عدا الكبائر\n والحاصل: أن من اجتنب الكبائر كفرت عنه الصغائر بلا سبب لنص الآية\n ومن ارتكب الكبائر والصغائر وصلى، كفرت الصغائر دون الكبائر، وبهذا تتفق الآية مع الحديث\n والله تعالى أعلم\n قال ابن عطية في قوله تعالى:\n\n[التوبة: 111] الآية: الشهادة ماحية لكل ذنب إلا لمظالم العباد\n وقد روي: \" أن الله يتحمل عن الشهيد مظالم العباد، ويجازيهم عنه \"\n ختم الله لنا بالحسنى\n انتهى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:39",
      "similarity": 0.8682712096562026
    },
    {
      "verse": "11:80",
      "similarity": 0.7958334240262498
    },
    {
      "verse": "17:74",
      "similarity": 0.7298425460610684
    },
    {
      "verse": "2:107",
      "similarity": 0.12936755103262865
    },
    {
      "verse": "19:45",
      "similarity": 0.1287334989342034
    }
  ]
}