{
  "chapter": "هود",
  "text": "واما الذين سعدوا۟ ففى الجنة خلدين فيها ما دامت السموت والارض الا ما شاء ربك عطاء غير مجذوذ",
  "translations": [
    {
      "translation": "As for those who are glad, they will be in the Garden, remaining in it timelessly, for ever, as long as the heavens and earth endure, except as your Lord wills: an uninterrupted gift.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are blessed will be in Paradise, where they will dwell so long as heaven and earth survive, unless your Lord wills otherwise: This will be a gift uninterrupted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who are blessed, they shall abide in the Garden as long as the heavens and the earth endure, unless your Lord may will otherwise. They shall enjoy an unceasing gift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The blessed ones will live in Paradise as long as the heavens and the earth exist, unless your Lord decides to grant endless rewards to whomever He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So those who are fortunate are in Paradise – abiding in it as long as the heavens and the earth remain, except as much as your Lord willed; this is the everlasting favour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are blessed, they will be in Paradise, abiding therein for all the time that the heavens and the earth endure, except as your Lord wills: a gift without an end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as to those who are made happy, they shall be in the garden, abiding in it as long as the heavens and the earth endure, except as your Lord please; a gift which shall never be cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the happy, they shall be in Paradise, therein dwelling forever, so long as the heavens and earth abide, save as thy Lord will -- for a gift unbroken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who will be glad (that day) they will be in the Garden, abiding there so long as the heavens and the earth endure save for that which thy Lord willeth: a gift unfailing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are blessed shall abide in the Garden; they will dwell therein as long as the heavens and the earth endure, except as your Lord wills. Such bounty shall be unending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who shall be blest, they shall be in the Garden, as abiders therein so long as the heavens and the earth remain, save as thy Lord may will. a gift unending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the felicitous, they will be in paradise. They will remain in it for as long as the heavens and the earth endure—except what your Lord may wish—an endless bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are blessed shall be in the Garden: They will dwell therein for all the time that the heavens and the earth endure, except as thy Lord willeth: a gift without break.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are blessed, they will be in Paradise, abiding therein for all the time that the heavens and the earth endure, except as your Lord will, a gift without an end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the happy, they shall live in Paradise for ever, so as long as the heavens and the earth endure, and as your Lord wills an unbroken gift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who are happy, they will be in Paradise, remaining therein for as long as the heavens and the earth endure, except as your Lord wills—a reward without end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who were [destined to be] prosperous, they will be in Paradise, abiding therein as long as the heavens and the earth endure, except what your Lord should will - a bestowal uninterrupted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:108] And as for those who are fortunate (read sa‘idū or su‘idū) they shall be in Paradise, abiding therein for as long as the heavens and the earth endure except, other than, what your Lord may will — as mentioned already [of increasing the duration], which in their case is indicated by His words, an endless bounty, [one not] to be cut off. The interpretation given above seems to be the clear and obvious one, devoid of affectation, but God knows best what it means.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And as for those who will be glad) those who were decreed to be felicitous ((that day) they will be in the Garden, abiding there) in Paradise (so long as the heavens and the earth endure save for that which thy Lord willeth) when He wills to turn them from felicity to damnation due to His saying (Allah effaceth what He will, and establishes [13:39]); it is also said: they will abide in Paradise for as long as the heavens and the earth subsist: the heaven of Paradise and the earth of Paradise unless Allah wills to torment some people before making them enter Paradise, such that He puts them first in hell and then gets them out of it and puts them in Paradise, to abide therein forever: (a gift) a reward for them (unfailing) undiminished and uninterrupted.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَطَآءً غَيْرَ مَجْذُوذٍ } معناهُ غَيرُ مَقطُوعٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {'Ata'an ghayr majdoodin} means \"uninterrupted.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَمَّا ٱلَّذِينَ سُعِدُواْ } في الدنيا\n وخرجوا على السعادة منها { فَفِي ٱلْجَنَّةِ } أي: هم في النشأة الأخرى في الجنة التي هي منازل السعداء الآمنين\n الذين لا خوف عليهم ولا هم يحزنون { خَالِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلأَرْضُ } متنعمين فيها مترفهين بأنواع النعم الجسام { إِلاَّ مَا شَآءَ رَبُّكَ } وتعلق إرادته بإعلاامها\n وهو الانكشاف الذاتي والتجلي الشهودي\n وذلك لمن يعطى { عَطَآءً غَيْرَ مَجْذُوذٍ } [هود: 108] أي: غير مقطوع\n إذ لا انقطاع للتجليات الذاتية ولا للذاتها المرتبة عليها بالنسبة إلى الفائزين بها\n جعلنا الله من خدامهم\n\n\nوبعدما تبين حال السعداء المقبولين والأشقياء المردودين { فَلاَ تَكُ فِي مِرْيَةٍ } شك وتردد { مِّمَّا يَعْبُدُ هَـٰؤُلاۤءِ } المشركون\n ألا يستجلب عليهم العذاب والنكال كما استجلب على أسلافهم\n إذ هم { مَا يَعْبُدُونَ إِلاَّ كَمَا يَعْبُدُ آبَاؤُهُم } وأسلافهم { مِّن قَبْلُ } فسيلحقهم مثل ما لحقهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال: ويؤيده هذا التأويل قوله بعدُ: { عطاء غير مَجذُوذ } أي: غير مقطوع\n وهذا قول الفراء\n فإنه يقدر الاستثناء المنقطع بسوى\n وسيبويه بلكن\n هـ\n وقال الورتجبي: قال ابن عطاء: { إلا ما شاء ربك } من الزوائد لأهل الجنة من الثواب\n ومن الزوائد لأهل النار من العقاب\n هـ\n { إن ربك فعال لما يريد } من غير حجر ولا اعتراض\n { وأما الذين سُعدوا ففي الجنة خالدين فيها ما دامت السماوات والأرض إلا ما شاء ربك } كما تقدم\n { عطاء غير مَجْذُوذٍ }: غير مقطوع\n وهو تصريح بأن الثواب غير مقطوع\n وتنبيه على أن المراد من الاستثناء تعليم الأدب فقط\n والله تعالى أعلم\n الإشارة: السعادة على قسمين: سعادة الظاهر\n وسعادة الباطن\n والشقاو ة كذلك\n أما سعادة الظاهر ففي الدنيا بالراحة من التعب\n وفي الآخرة بالنجاة من العذاب\n وأما سعادة الباطن ففي الدنيا براحة القلب من كد الهموم والأحزان\n واليقين والاطمئنان\n في حضرة الشهود والعيان\n وفي الآخرة بدوام النظر\n في مقعد صدق عند مليك مقتدر\n وشقاوة الظاهر باتصال الكد والتعب\n وشقاوة الباطن بالبعد عن الله\n وافتراقه عن حضرة مولاه\n قال في نوادر الأصول: الشقاوة: فراق العبد من الله\n والسعادة اندساسه إليه\n هـ\n وقال الشيخ أبو الحسن رضي الله عنه في حزبه الكبير: والسعيد من أغنيته عن السؤال منك\n والشقي حقاً من حرمته مع كثرة السؤال لك\n قال شيخ شيوخنا ـ سيدي عبد الرحمن الفاسي ـ في حاشيته عليه: ومدار السعادة: الجمع على الله والغيبة عمن سواه\n فيفنى العبد عن وجوده\n ويبقى بربه\n فيشغله استغراقه في شهوده عن الشعور بغيريته\n وينمحي عنه أمل شيء يرجى\n أو خوف شيء يُتقى\n فليس له عن سوى الحق إخبار\n ولا مع غيره قرار\n وعندما حل بهذه الحضرة\n وظفر بقُرة عينه\n وحياة روحه\n وسر حياته\n لا يتصور منه سُول\n ولا فوات مأمول\n \" أنت مع الأكوان ما لم تشهد المكون\n فإذا شهدته كانت الأكوان معك \" \n \" اشْتَاقَتْ الجَنَّةُ إِلى عَليِّ وعَمَّارٍ وسَلمَانَ وصهيب وبلال \" كما في الأثر\n\nنعم\n إن رد إليه تصور منه الدعاء على وجه العبودية\n وأداء الأمر وإظهار الفاقة\n لا على وجه الاقتضاء والسببية\n \" جل حكم الأزل أن ينضاف إلى الأسباب والعلل \"\n ثم قال: وعلى ما تقرر في السعادة\n فالشقاوة: احتجاب العبد بوجوده عن شهوده\n فلا يَنفَكُّ عن أمل\n ولا عن خوف عطب\n فيستحثه الطبع للسؤال جلباً أو دفعاً\n وهو في ذلك في شقاء\n سواء أعطى أو منع لفقده قرةَ عينه وراحة قلبه\n لأسْره في طبعه\n ومكابدة أمره وهلعه\n كما قال تعالى:\n[المعارج: 19ـ 22]\n فلم يستثن من كد الطبع ومكابدته غير أهل الصلاة الدائمة\n وهم أهل الوجهة لله\n المواجَهين بعناية الله\n المتحققين بذكر الله\n وقد وَرَدَ: \" هُمُ القَوْم لاَ يَشْقَى جَلِيسُهُم \" فضلاً عنهم\n وعلى الجملة: فالمراد بالسعادة والشقاوة في كلامه ـ أي الشاذلي ـ الباطنة لا الظاهرة\n والقلبية لا القالبية\n وإن كان قد تطلق على ذلك أيضاً\n لكن لكل مقام مقال\n وقد قال تعالى:\n[طه: 123]\n قال في نوادر الأصول: تَابعُ القرآن قد أجير من شقاء العيش في الدنيا لراحة قلبه من غموم الدنيا وظلماتها\n وسَيره في الأمور بقلبه في راحة لأنه منشرحُ الصدر واسعه\n وبدنه في راحة لأنه ميسر عليه أمور الدنيا\n تُهيأ له في يسر لضمان الله\n واكتنافه له\n وكذا يجار في الآخرة من شقاء العيش في سجون النيران\n أعاذنا الله من ذلك\n هـ\n ثم حذَّر من الشرك\n الذي هو سبب الخلود في النار\n فقال: { فَلاَ تَكُ فِي مِرْيَةٍ مِّمَّا يَعْبُدُ هَـٰؤُلاۤءِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:58",
      "similarity": 0.5634900770221842
    },
    {
      "verse": "11:105",
      "similarity": 0.5368648898445133
    },
    {
      "verse": "11:107",
      "similarity": 0.1917271662806796
    },
    {
      "verse": "70:23",
      "similarity": 0.16282372222271455
    },
    {
      "verse": "5:117",
      "similarity": 0.16149846895780193
    }
  ]
}