{
  "chapter": "هود",
  "text": "ذلك من انۢباء القرى نقصه عليك منها قائم وحصيد",
  "translations": [
    {
      "translation": "That is some of the news of the cities which We relate to you. Some of them are still standing, while others are now just stubble.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are a few accounts of settlements that We narrate to you. Some still survive, and some have been mowed down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is an account of some towns which We recount to you. Of them some are still standing and some have been mown down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such were the stories of the nations of the past which We tell to you, (Muhammad). Some of them were destroyed and some of them have survived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the tidings of the townships, which We relate to you (O dear Prophet Mohammed – peace and blessings be upon him) – some of them still stand and some are cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is some of the news of the (population of) towns which We relate unto you; of them, some are (still) standing, and some have been (already) reaped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an account of (the fate of) the towns which We relate to you; of them are some that stand and (others) mown down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is of the tidings of the cities We relate to thee; some of them are standing and some stubble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is (something) of the tidings of the townships (which were destroyed of old). We relate it unto thee (Muhammad). Some of them are standing and some (already) reaped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We relate to you such accounts of earlier towns: some of them are still standing; while others have ceased to exist;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is from the stories of the Cities which We recount unto thee: of them some are standing and some mown down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are from the accounts of the townships, which We recount to you. Of them, there are some that still stand, and some that have been mown down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are some of the stories of communities which We relate unto thee: of them some are standing, and some have been mown down (by the sickle of time).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are some of the news of the (population of) towns which We relate unto you (O Muhammad SAW); of them, some are standing, and some have been (already) reaped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, which We have related to you, is the news of the villages; some of them still stand, whereas others are stubble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are of the reports of the towns—We relate them to you. Some are still standing, and some have withered away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is from the news of the cities, which We relate to you; of them, some are [still] standing and some are [as] a harvest [mowed down].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:100] That, which is mentioned (dhālika is the subject, the predicate of which [follows]), is [something] of the tidings of the towns, which We relate to you, O Muhammad (s). Some of them, that is, [of] the towns, are standing, only its inhabitants having been destroyed, and some, of them, have been cut down, destroyed together with its inhabitants, such that there are no vestiges thereof, much like crops harvested with sickles.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) which I have mentioned (is (something) of the tidings of the townships) of the news of past nations in this world. (We relate it unto thee (Muhammad)) We send Gabriel down to you with their news. (Some of them are standing) and can be seen while their people have vanished (and some (already) reaped) and some of them have turned into ruin, the people and the townships.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } المذكور { مِنْ أَنْبَآءِ ٱلْقُرَىٰ } وأخبارهم وما جرى عليهم { نَقُصُّهُ عَلَيْكَ } بالوحي يا أكمل الرسل ليكون عبرة لك ولمن تبعك مشاهدة وتذكيراً { مِنْهَا } أي: من تلك القرى { قَآئِمٌ } جدرانها بلا سقوف { وَ } منها ما هو { حَصِيدٌ } [هود: 100] مدروس مندك، كالزرع المحصود، عفت آثاره واندرست أطلاله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ذلك: مبتدأ\n ومن أنباء: خبر، ونقصه: خبر ثان\n وجملة: منها قائم وحصيد: استئنافية لا حالية لعدم الرابط\n يقول الحق جل جلاله: { ذلك } النبأ الذي أخبرناك به في هذه السورة، هو { من أنباء القرى } الماضية المهلَكة، { نقصه عليك } ، ونخبرك به تهديداً لأمتك وتسلية لك\n { منها } ما هو { قائم } البناء باقي الأثر، { و } منها { حصيد } أي: محصود عافي الأثر، كالزرع المحصود\n أو: منها ما هو ساكن بقوم آخرين، قائم العمارة بغير من هلك، ومنها ما هو دارس عفى أثره، واندرست أطلالُه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:9",
      "similarity": 0.6442091244618532
    },
    {
      "verse": "21:15",
      "similarity": 0.3290125662108566
    },
    {
      "verse": "12:47",
      "similarity": 0.31938975731061064
    },
    {
      "verse": "7:101",
      "similarity": 0.3169151387459876
    },
    {
      "verse": "3:62",
      "similarity": 0.2798808115227919
    }
  ]
}