{
  "chapter": "هود",
  "text": "وما كان ربك ليهلك القرى بظلم واهلها مصلحون",
  "translations": [
    {
      "translation": "Your Lord would never have destroyed the cities wrongfully as long as their inhabitants were putting things right.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would not surely destroy unjustly human habitations so long as the people are righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is not such as would wrongfully destroy human habitations while their inhabitants are righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would not have destroyed those people (of the towns) for their injustice if they had tried to reform themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is not such as to destroy townships without reason, while their people are righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord would never destroy the towns wrongfully, while their people were doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it did not beseem your Lord to have destroyed the towns tyrannously, while their people acted well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet thy Lord would never destroy the cities unjustly, while as yet their people were putting things right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In truth thy Lord destroyed not the townships tyrannously while their folk were doing right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would never unjustly destroy communities while their people were trying to reform.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord is not one to destroy cities wrongously while the inhabitants thereof are rectifiers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would never destroy the townships unjustly while their inhabitants were bringing about reform.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor would thy Lord be the One to destroy communities for a single wrong-doing, if its members were likely to mend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord would never destroy the towns wrongfully, while their people were right-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would never destroy the villages unjustly, whilst their people were reforming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would never destroy the towns wrongfully, while their inhabitants are righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord would not have destroyed the cities unjustly while their people were reformers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:117] Yet your Lord would never destroy the towns through injustice, on His part, against them, while their inhabitants were righteous, that is, believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(In truth thy Lord destroyed not) the people of (the townships tyrannously) because of the tyranny they committed (while their folk were doing right) while there were among them those who enjoined good and forbade evil; it is also said that this means: your Lord would not have destroyed the people of the townships through an injustice from Him while their people were doing right, i.e. engaged in acts of obedience and holding firm to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا كَانَ رَبُّكَ } أي: ليس من سنته وجري عادته { لِيُهْلِكَ ٱلْقُرَىٰ بِظُلْمٍ } بشرك وكفر صدر عنهم { وَأَهْلُهَا مُصْلِحُونَ } [هود: 117] أي: والحال أن أهلها مصلحون على الأرض لا مفسدون فيها\n يعني: لا يأخذهم سبحانه بمجرد حق الله بلا انضمام حقوق العباد إليه\n بل إنما أخذهم الله حين فشا الفسوق والمراء\n وظهر الفساد والجدال بين العباد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { وما كان ربك ليُهلك القرى بظلم } أي: متلبساً بظلم، { وأهلُها مصلحون } ، فيعذبهم بلا جرم، أي: ما كان ليعذبهم ظالماً لهم بلا سبب\n أو ما كان ليهلك القرى بشرك وأهلها مصلحون فيما بينهم، لا يضمون إلى شركهم فساداً وبغياً، وذلك لفرط رحمته ومسامحته في حقوقه\n ومن ذلك قدَّم الفقهاءُ، عند تزاحم الحقوق، وحقوقَ العباد، وقال بعضهم: [الذنوب ثلاثة: ذنب لا يغفره الله، وهو الشرك، وذنب لا يعبأ الله به، وهو ما كان بينه وبين عباده، وذنب لا يتركه الله، وهو حقوق عباده]\n وقالوا: قد يبقى المُلك مع الشرك ولا يبقى مع الظلم\n الإشارة: أولو البقية الذين ينهون عن الفساد في الأرض هم: أهل النور المخزون المستودع في قلوبهم من نور الحق، إذا قابلوا منكراً دمغوه بالحال أو المقال، وإذا قابلوا فساداً أصلحوه، وإذا قابلوا فتنة أطفؤوها\n وإذا قابلوا بدعة أخمدوها، واجهوا ضالاً أرشده، أو غافلاً ذكروه، أو طالباً للوصول وصلوه، يمشون في الأرض بالنصيحة، لا يخافون في الله لومة لائم\n أولئك لهم الأمن وهم مهتدون\n قال رسول الله صلى الله عليه وسلم:\n\n \" والذي نفس محمد بيده لئن شئتم لأُقسمن لكم: إنَّ أحَبَّ عباد اللَّهِ إلى الله الذين يُحببون الله إلى عباده، ويحببون عباد الله إلى الله، ويمشون في الأرض بالنصيحة \" \n\n \n\nأما كونهم يحببون الله إلى عباده، فلأنهم يَذكرون لهم آلاءه وإحسانه وبره\n والنفسُ تحب بالطبع من أحسن إليها\n وأما كونهم يحببون عباد الله إلى الله فلأنهم يردونهم عن غيهم وحظوظهم، التي تبعدهم عن ربهم\n فإذا رجعوا إليه أحبهم\n  وسئل ذو النون المصري رضي الله عنه عن وصف الأبدال، فقال: سألتَ عن دياجي الظلام لأَكشفُ لك عنهم، وهم قوم ذكروا الله بقلوبهم، تعظيماً لربهم لمعرفتهم بجلاله، فهم حجج الله تعالى على خلقه، ألبسهم الله ـ تعالى ـ النور الساطع من محبته، ورفع لهم أعلام الهداية إلى مواصلته، وأقامهم مقام الأبطال لإرادته، وأفرغ عليهم من مخافته، وطهَّر أبدانهم بمراقبته، وطيبهم بطيب أهل معاملته، وكساهم حُللاً من نسج مودته، ووضع على رؤوسهم تيجان مبرته، ثم أودع القلوب من ذخائر الغيوب، فهي متعلقة بمواصلته، فهممهم إليه ثائرة، وأعينهم بالغيب ناظرة، قد أقامهم على باب النظر من رؤية، وأجلسهم على كراسي أطباء أهل معرفته، ثم قال لهم: إن أتاكم عليلٌ مَنْ فقدي فداووه، أو مريض من فراقي فعالجوه، أو خائف مني فانصروه، أو من آمن مني فحذِّروه، أو راغب في مواصلتي فمنُّوه، أو راحل نحوي فزودوه، أو جبان في متاجرتي فشجعوه، أو آيسٌ من فضلي فرجّوه، أو راج لإحساني فبشروه، أو حسن الظن بي فباسطوه، أو محب لي فواصلوه، أو معظم لقدرتي فعظموه، أو مسيء بعد إحساني فعاتبوه، أو مسترشد فأرشدوه\n هـ\n وهذا بقدر الله ومشيئته، كما قال تعالى: { وَلَوْ شَآءَ رَبُّكَ لَجَعَلَ ٱلنَّاسَ أُمَّةً وَاحِدَةً }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:4",
      "similarity": 0.7212715473495482
    },
    {
      "verse": "6:131",
      "similarity": 0.7107547114767019
    },
    {
      "verse": "21:6",
      "similarity": 0.7074937546095587
    },
    {
      "verse": "26:208",
      "similarity": 0.6948944144216638
    },
    {
      "verse": "18:59",
      "similarity": 0.6837354576873766
    }
  ]
}