{
  "chapter": "هود",
  "text": "من كان يريد الحيوة الدنيا وزينتها نوف اليهم اعملهم فيها وهم فيها لا يبخسون",
  "translations": [
    {
      "translation": "As for those who desire the life of the dunya and its finery, We will give them full payment in it for their actions. They will not be deprived here of their due.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who desire the life of this world and its many allures, We shall pay them in full for their acts herein and will not withold any thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who seek merely the present world and its adornment. We fully recompense them for their work in this world, and they are made to suffer no diminution in it concerning what is their due.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who choose the worldly life and its pleasures will be given proper recompense for their deeds in this life and will not suffer any loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the life of this world and its comforts, We shall give them the full reward for their deeds in it, and not make any reduction in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever desires the life of the world and its glitter, to them We shall pay in full (the wages of) their deeds therein, and they will have no diminution therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires this world's life and its finery, We will pay them in full their deeds therein, and they shall not be made to. suffer loss in respect of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso desires the present life and its adornment, We will pay them in full for their works therein, and they shall not be defrauded there;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso desireth the life of the world and its pomp, We shall repay them their deeds herein, and therein they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who desire the life of this world and all its finery shall be repaid in full in this life for their deeds -- nothing shall be denied them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever desireth the life of the world and the adornment thereof, We shall repay them in full their works therein, and in it they shall not be defrauded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who desire the life of this world and its glitter, We will recompense them fully for their works therein, and they shall not be underpaid in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who desire the life of the present and its glitter,- to them we shall pay (the price of) their deeds therein,- without diminution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever desires the life of the world and its glitter; to them We shall pay in full (the wages of) their deeds therein, and they will have no diminution therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall pay those who desire the present life and its adornments in full for the work they have done therein, they shall not be defrauded;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the worldly life and its glitter—We will fully recompense them for their deeds therein, and therein they will not be defrauded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the life of this world and its adornments - We fully repay them for their deeds therein, and they therein will not be deprived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:15] He who desires the life of this world and its adornment, by persisting in idolatry — it is said that this was [revealed] regarding the dissimulators — We shall repay them their deeds, that is, the requital of any good that they did, such as charity or kindness to kin, in it, by giving them abundant provision, and therein, that is, in this world, they shall not be defrauded, they shall [not] be made to suffer diminution in anything.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso desireth the life of the world) with his knowledge which Allah has made incumbent upon him (and its pomp) and its embellishment, (We shall repay them their deeds) We shall repay them the reward of their works (herein) in this world, (and therein) in the life of this world (they will not be wronged) the reward of their works will not be diminished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على سبيل العظة والتذكير: { مَن كَانَ } بارتكاب الأعمال واحتمال شدائدها ومتاعبها { يُرِيدُ ٱلْحَيَاةَ ٱلدُّنْيَا وَزِينَتَهَا } المزخرفة التي تترتب عليها من الأموال والأود { نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا } لأجلها { وَهُمْ فِيهَا لاَ يُبْخَسُونَ } [هود: 15] أي: لا ينقص شيء من أجور أعمالهم في النشأة الأولى إن كن غرضهم مقصوراً عليها\n محصوراً بها\n\n\nوأمَّا في النشأة الأخرى { أُوْلَـٰئِكَ } القاصرون المقصرون هم { ٱلَّذِينَ لَيْسَ لَهُمْ فِي ٱلآخِرَةِ } أي: لم يبقَ لهم مما يترتب على أعمالهم فيها { إِلاَّ ٱلنَّارُ } إذ حسناتهم تفوى إليهم في النشأة الأولى ولم يبقَ لهم إلا توفية السيئات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" ما صنعوا فيها \": الضمير يعود على الدنيا\n والظرف يتعلق بصنعوا\n أو يعود على الآخرة\n ويتعلق الظرف بحبط\n أي: حبط في الآخرة ما صنعوا من الأعمال في الدنيا\n يقول الحق جل جلاله: { من كان يريد } بعمله { الحياةَ الدنيا وزينتَها } \n فكان إحسانه وبره رياء وسمعَة\n { نُوفّ إليهم أعمالَهم فيها } أي: نوصل إليهم جزاء أعمالهم في الدنيا\n من الصحة والرئاسة\n وسعة الأرزاق\n وينالُون ما قصدوا من حمد الناس\n وإحسانهم وبرهم\n { وهم فيها لا يُبخسون } لا يُنقصون شيئاً من أجورهم\n فيحتمل: أن تكون الآية نزلت في أهل الرياء من المؤمنين الذين يراؤون بأعمالهم كما ورد في حديث الغازي والغني القارئ المرائين\n وأنهم أول من تُسعر بهم جهنم\n ويحتمل أن تكون نزلت في الكفار\n وهو أليق بقوله: { أولئك الذين ليس لهم في الآخرة إلا النارُ } لأنهم استوفواما تقضيه صور أعمالهم الحسنة\n وبقيت لهم أوزار العزائم السيئة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:13",
      "similarity": 0.5941063085710975
    },
    {
      "verse": "26:183",
      "similarity": 0.4946371207267911
    },
    {
      "verse": "7:85",
      "similarity": 0.4504928839600135
    },
    {
      "verse": "11:85",
      "similarity": 0.41342945635432676
    },
    {
      "verse": "2:212",
      "similarity": 0.22015509502399436
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011015.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011015.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}