{
  "chapter": "هود",
  "text": "ام يقولون افترىه قل فاتوا۟ بعشر سور مثله مفتريت وادعوا۟ من استطعتم من دون الله ان كنتم صدقين",
  "translations": [
    {
      "translation": "Or do they say, 'He has invented it?' Say, 'Then produce ten invented suras like this, and call on anyone you can besides Allah if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say (of the Prophet): \"He has forged (the Qur'an)?\" Say: \"Then bring ten Surahs like it, and call anyone except God to help you, if what you say is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say: 'He has invented this Book himself?' Say: 'If that is so, bring ten surahs the like of it of your composition, and call upon all (the deities) you can other than Allah to your help. Do so if you are truthful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they, (the unbelievers), say that (Muhammad) has falsely ascribed (the Quran) to God? Ask them, \"Compose ten chapters like (those of the Quran) and call on whomever you can for help besides God if you are true in your claim.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! They dare say that “He has fabricated it”? Say “Therefore bring ten fabricated chapters like these, and call on everyone you can other than Allah, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or they say, \"He forged it.\" Say: \"Bring you then ten forged Surahs like unto it, and call whomsoever you can, other than Allah, if you speak the truth!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do they say: He has forged it. Say: Then bring ten forged chapters like it and call upon whom you can besides Allah, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, 'He has forged it'? Say: 'Then bring you ten suras the like of it, forged; and call upon whom you are able, apart from God, if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or they say: He hath invented it. Say: Then bring ten surahs, the like thereof, invented, and call on everyone ye can beside Allah, if ye are truthful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they say, \"He has invented it himself.\" Say, \"If you are truthful, produce ten invented chapters like it, and call on whom you can besides God, to help you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: he hath fabricated it? Say thou: bring ye then ten Surahs the like thereunto fabricated, and call whomsoever ye can beside Allah, if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say, ‘He has fabricated it?’ Say, ‘Then bring ten surahs like it, fabricated, and invoke whomever you can, besides Allah, should you be truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or they may say, \"He forged it,\" Say, \"Bring ye then ten suras forged, like unto it, and call (to your aid) whomsoever ye can, other than Allah!- If ye speak the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or they say, \"He (Prophet Muhammad SAW) forged it (the Quran).\" Say: \"Bring you then ten forged Surah (chapters) like unto it, and call whomsoever you can, other than Allah (to your help), if you speak the truth!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say: 'He has forged it' Say (to them): 'Then produce ten forged chapters like it. Call, if you are able, upon other than Allah, if what you say is true'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, “He invented it?” Say, “Then produce ten chapters like it, invented, and call upon whomever you can, besides God, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, \"He invented it\"? Say, \"Then bring ten surahs like it that have been invented and call upon [for assistance] whomever you can besides Allah, if you should be truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:13] Or do they say, ‘He has invented it’?, that is, the Qur’ān. Say: ‘Then bring ten sūras the like thereof, in terms of clarity and rhetorical excellence, invented, for you are Arabs who speak [Arabic] eloquently, like myself — he challenged them to these [ten sūras] first, and then to one sūra — and call, in order [for them] to assist you, upon whom you can beside God, that is, [on] other than Him, if you are truthful’, about it [the Qur’ān] being an invention of lies.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "227 (Or they say) Nay, the disbelievers of Mecca say: (He hath invented it) Muhammad has invented the Qur'an and presented it to us. (Say) to them, Muhammad: (Then bring ten surahs, the like thereof) the like of a surah of the Qur'an, such as surah al-Baqarah, Al 'Imran, al-Nisa', al-Ma'idah, al-An'am, al-A'raf, al-Anfal, al- Tawbah, Yunus, or Hud, (invented) by you, (and call on everyone you can) seek the help of what you worship (beside Allah, if ye are truthful!) that Muhammad (pbuh) has invented it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ يَقُولُونَ } مكابرة وعناداً: { ٱفْتَرَاهُ } واختلقه من تلقاء نفسه ونسبه إلى الوحي { قُلْ } لهم يا أ:مل الرسل حين نسبوك إلى الافتراء والاختلاق: { فَأْتُواْ } أيها المكابرون المعاندون { بِعَشْرِ سُوَرٍ مِّثْلِهِ } أي: مثل أقصر سورة من سور القرآن { مُفْتَرَيَٰتٍ } مختلفات على ما زعمتم مع أنكم أحق باختلافها؛ لكثرة تمرنكم وتزاولكم في أمر الإنشاد والإنشاء، وتتبع كلام البغاء والتعود بممارسة القصص والقصائد، وإن عجزتم عن اختلاقها بأنفسكم، فاستظهروا بإخوانكم ومعاونيكم { وَٱدْعُواْ مَنِ ٱسْتَطَعْتُمْ مِّن دُونِ ٱللَّهِ } واتفقوا معهم في اختلافها { إِن كُنتُمْ صَادِقِينَ } [هود: 13] في ظنكم هذا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { أَمْ } بل { يقولون افتراه } أي: ما يوحى إليه، { قل } لهم: { فأتوا بعشر سُورٍ مثِلهِ } في البيان وحسن النظم\n تحداهم أولاً بعشر سور، فلما عجزوا سهل الأمر عليهم وتحداهم بسورة\n وتوحيد المثل باعتبار كل واحد\n { مُفتريات } مختلفات من عند أنفسكم، إن صح أني اختلقته من عند نفسي فإنكم عرب فصحاء مثلي\n { وادعوا من استطعتم من دون الله } للمعاونه على المعارضة، { إن كنتم صادقين } أنه مفترى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:38",
      "similarity": 0.8712574949326425
    },
    {
      "verse": "2:23",
      "similarity": 0.6091449044332454
    },
    {
      "verse": "9:124",
      "similarity": 0.4405208099144455
    },
    {
      "verse": "43:53",
      "similarity": 0.39428914610999666
    },
    {
      "verse": "24:1",
      "similarity": 0.38826628053743284
    }
  ]
}