{
  "chapter": "هود",
  "text": "خلدين فيها ما دامت السموت والارض الا ما شاء ربك ان ربك فعال لما يريد",
  "translations": [
    {
      "translation": "remaining in it timelessly, for ever, as long as the heavens and earth endure, except as your Lord wills. Your Lord is the Doer of what He wills.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Where they will dwell so long as heaven and earth endure, unless your Lord will otherwise. Verily your Lord does as He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall abide in it as long as the heavens and the earth endure, unless your Lord may will otherwise. Surely your Lord does whatsoever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for as long as the heavens and the earth exist, unless your Lord decides otherwise. Your Lord will certainly accomplish whatever He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remaining in it as long as the heavens and the earth remain, except as much as your Lord willed*; indeed your Lord may do whatever, whenever, He wills. (* Remaining forever even after the heavens and the earth are destroyed.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will dwell therein for all the time that the heavens and the earth endure, except as your Lord wills. Verily, your Lord is the doer of whatsoever He intends (or wills).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abiding therein so long as the heavens and the earth endure, except as your Lord please; surely your Lord is the mighty doer of what He intends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so long as the heavens and earth abide, save as thy Lord will; surely thy Lord accomplishes what He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abiding there so long as the heavens and the earth endure save for that which thy Lord willeth. Lo! thy Lord is Doer of what He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "remaining in it timelessly, for ever, as long as the heavens and earth endure, except as your Lord wills. Your Lord carries out whatever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abiders they shall be therein, so long as the heavens and the earth remain, save as thy Lord may will. Verily thy Lord is the Doer of whatsoever He intendeth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall remain in it for as long as the heavens and the earth endure—except what your Lord may wish; indeed your Lord does whatever He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will dwell therein for all the time that the heavens and the earth endure, except as thy Lord willeth: for thy Lord is the (sure) accomplisher of what He planneth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will dwell therein for all the time that the heavens and the earth endure, except as your Lord wills. Verily, your Lord is the doer of what He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there they shall live for ever, as long as the heavens and the earth endure, and as your Lord wills. Indeed, your Lord accomplishes whatsoever He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remaining therein for as long as the heavens and the earth endure, except as your Lord wills. Your Lord is Doer of whatever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They will be] abiding therein as long as the heavens and the earth endure, except what your Lord should will. Indeed, your Lord is an effecter of what He intends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:107] abiding therein for as long as the heavens and the earth endure, that is, [for] the length of the duration of both in this world, except, other than, what your Lord may will, in the way of adding to the duration of these two, such that it [their abiding] becomes indefinite: meaning that they will abide therein forever. Truly your Lord is Doer of what He desires.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Abiding there) they will stay in the Fire forever (so long as the heavens and the earth endure) for as long as the heavens and the earth remain, from the moment they were created until the moment they lapse (save for that which thy Lord willeth) and your Lord has willed that they will abide in the Fire forever; it is also said: those who are damned will abide therein forever for as long as the heavens, the earth and the children 239 of Adam subsist, except those whom Allah wills to change from damnation to felicity by His saying: (Allah effaceth what He will, and establishes [13:39]); it is also said that this means: they will abide in the Fire for as long as the heavens and the earth subsist: the heaven of the Fire and the earth of the Fire unless Allah wills to get the people who believed in Allah's divine Oneness out of it, those whose wretchedness was caused by a sin less than disbelief. Allah will enter these into Paradise because of their pure faith. (Lo! thy Lord is Doer of what He will) as He will.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ خَالِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلأَرْضُ } أي: ما تحقق الجهتان الحقيقيتان\n أي: الفوق والتحت { إِلاَّ مَا شَآءَ رَبُّكَ } أي: تعلق إرادته ومشيئته لأخراج بعض منها كفساق المؤمنين { إِنَّ رَبَّكَ فَعَّالٌ لِّمَا يُرِيدُ } [هود: 107] أي: له الاختيار التام في جميع مراداته ومقدوراته\n ومن جملتها: إخراج بعض العصاة من النار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { خالدين فيها ما دامت السماوات والأرض } أي سماوات النار وأرضها\n وهي دائمة أبداً\n ويدل عليه قوله تعالى:\n[إبراهيم: 48]\n أو يكون عبارة عن التأبيد: كقوله العرب: ما لاح كوكب وما ناح الحمام\n وشبه ذلك بما يقصد به الدوام\n وهذا أصح\n وقوله: { إلا ما شاء ربك } \n للناس هنا كلام واختلاف\n وأحسن ما قيل فيه ما ذكره البقاعي\n قال: والذي ظهر لي ـ والله أعلم ـ أنه لما تكرر الجزم بالخلود في الدارين\n وأن الشرك لا يغفر\n والإيمان موجب للجنة\n فكان ربما يُظن أنه لا يمكن غير ذلك\n كما ظنه المعتزلة\n لا سيما إذا تأمل القطع في مثل قوله:\n[النساء: 48]\n مع تقييد غيره بالمشيئة في قوله: { وَيَغفِر مَا دُونَ ذََلِكَ لِمَن يَشَآءُ } جاء هذا الاستثناء معلماً أن الأمر فيه إلى الله كغيره من الأمور\n له أن يفعل في كلها ما يشاء\n وإن جُزم القوم فيه\n لكنه لا يقع غير ما أخبره به\n وهذا كما تقول: اسكن هذه الدار عمرك ألا ما شاء زيد\n وقد لا يشاء زيد شيئاً\n فكما أن التعليق بدوام السماوات والأرض غير مراد الظاهر\n كذلك الاستثناء فلا يشاء الله قطع الخلود لأحد من الفريقين\n وسوقه هكذا أدل على القدرة وأعظم في تقليد المنة\n\nهـ\n  وقال الجلال السيوطي\n في \" البدور السافرة في أمور الآخرة \": اعلم أن للعلماء في هذا الاستثناء أقوالاً\n أشبهها بالصواب: أنه ليس باستثناء\n وإنما \" إلا \"\n بمعنى \" سوى \" كما تقول: لي عليك ألف درهم إلا ألفان\n التي لي عليك\n أي: سوى الألفين\n والمعنى: خالدين فيها قدر مدة السماوات والأرض في الدنيا سوى ما شاء ربك من الزيادة عليها\n فلا منتهى له\n وذلك عبارة عن الخلود\n والنكتة في تقديم ذكر مدة السماوات والأرض: التقريب إلى الأذهان بذكر المعهود أولاً\n ثم أردفه بما لا إحاطة للدهر به\n والجري على عادة العرب في قولهم في الإخبار عن دوام الشيء وتأبيده: لا آتيك ما دامت السماوات والأرض\n هـ\n ومثله لابن عطية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:23",
      "similarity": 0.8007477198538574
    },
    {
      "verse": "5:117",
      "similarity": 0.6416523126928243
    },
    {
      "verse": "13:35",
      "similarity": 0.558856852481583
    },
    {
      "verse": "19:31",
      "similarity": 0.5133141059119238
    },
    {
      "verse": "5:24",
      "similarity": 0.43453036017398045
    }
  ]
}