{
  "chapter": "هود",
  "text": "فاستقم كما امرت ومن تاب معك ولا تطغوا۟ انه بما تعملون بصير",
  "translations": [
    {
      "translation": "Go straight as you have been commanded, and also those who turn with you to Allah, and do not exceed the bounds. He sees what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, you and those who turned to God with you, should walk along the straight path as you have been commanded, and do not transgress, for He verily sees whatsoever you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remain, (O Muhammad), you and those who have returned with you (to the fold of faith and obedience from unbelief and rebellion) steadfast (in adhering to the straight way) as you were commanded. And do not exceed the limits of (service to Allah). For certainly He is aware of all what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), be steadfast (in your faith) just as you have been commanded. Those who have turned to God in repentance with you, should also be steadfast in their faith. Do not indulge in rebellion. God is certainly aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remain firm the way you are commanded to, and those who have turned along with you, and O people – do not rebel; indeed He is seeing your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So stand (ask Allah to make) you firm and straight as you are commanded and those who turn in repentance with you, and transgress not. Verily, He is All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Continue then in the right way as you are commanded, as also he who has turned (to Allah) with you, and be not inordinate (O men!), surely He sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go thou straight, as thou hast been commanded, and whoso repents with thee; and be you not insolent; surely He sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So tread thou the straight path as thou art commanded, and those who turn (unto Allah) with thee, and transgress not. Lo! He is Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore stand firm [in the straight path] as you are commanded, along with those who have turned to God with you, and do not exceed the bounds, for He sees everything you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So stand thou straight as thou hast been commanded, thou and whosoever repented with thee; and be not arrogant; verily He is of that which ye work Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be steadfast, just as you have been commanded—[you] and whoever has turned [to Allah] with you—and do not overstep the bounds. Indeed, He watches what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore stand firm (in the straight Path) as thou art commanded,- thou and those who with thee turn (unto Allah); and transgress not (from the Path): for He seeth well all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So stand (ask Allah to make) you (Muhammad SAW) firm and straight (on the religion of Islamic Monotheism) as you are commanded and those (your companions) who turn in repentance (unto Allah) with you, and transgress not (Allah's legal limits). Verily, He is All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So you and whosoever repents with you go straight as you have been commanded and do not be insolent, indeed, He sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be upright, as you are commanded, along with those who repented with you, and do not transgress. He is Seeing of everything you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remain on a right course as you have been commanded, [you] and those who have turned back with you [to Allah], and do not transgress. Indeed, He is Seeing of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:112] So remain upright, acting in accordance with the commandment of your Lord and supplicating Him, as you have been commanded, and, let him also remain upright, he who repents, [who] believes, with you; and do not transgress, [do not] overstep the bounds of God. Truly He sees what you do, and will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nترتب عن التسلية التي تضمّنها قوله : { ولقد آتينا موسى الكتاب فاختلف فيه } \\[ هود : 110 \\] وعن التثبيت المفاد بقوله : { فلا تك في مرية ممّا يَعبد هؤلاء } \\[ هود : 109 \\] الحضّ على الدّوام على التمسك بالإسلام على وجه قويم . وعبّر عن ذلك بالاستقامة لإفادة الدّوام على العمل بتعاليم الإسلام ، دواماً جماعهُ الاستقامة عليه والحذر من تغييره .ولمّا كان الاختلاف في كتاب موسى عليه السّلام إنّما جاء من أهل الكتاب عطف على أمر النّبيء صلى الله عليه وسلم بالاستقامة على كتابه أمرُ المؤمنين بتلك الاستقامة أيضاً ، لأنّ الاعوجاج من دواعي الاختلاف في الكتاب بنهوض فرق من الأمة إلى تبديله لمجاراة أهوائهم ، ولأنّ مخالفة الأمّة عمداً إلى أحكام كتابها إن هو إلاّ ضرب من ضروب الاختلاف فيه ، لأنّه اختلافها على أحكامه . وفي الحديث : \" فإنّما أهلكَ الذين من قبلكم كثرةُ مسائلهم واختلافُهم على أنبيائهم \" ، فلا جرم أن كانت الاستقامة حائلاً دون ذلك ، إذ الاستقامة هي العمل بكمال الشريعة بحيث لا ينحرف عنها قِيد شبر . ومتعلقها العمل بالشريعة بعد الإيمان لأنّ الإيمان أصل فلا تتعلّق به الاستقامة . وقد أشار إلى صحّة هذا المعنى قول النبي صلى الله عليه وسلم لأبِي عَمْرَةَ الثقفي لمّا قال له : «يا رسول الله قل لي في الإسلام قولاً لا أسأل عنه أحداً غيرك . قال : قل آمنت بالله ثم استَقِمْ» فجعل الاستقامة شيئاً بعد الإيمان .ووُجّه الأمر إلى النبي صلى الله عليه وسلم تنويهاً بشأنه ليبني عليه قوله : { كما أمرتَ } فيشير إلى أنّه المتلقّي للأوامر الشرعيّة ابتداء . وهذا تنويه له بمقام رسالته ، ثم أُعلم بخطاب أمّته بذلك بقوله : { ومن تاب معك }. وكاف التّشبيه في قوله : { كما أمرت } في موضع الحال من الاستقامة المأخوذة من ( استقم ). ومعنى تشبيه الاستقامة المأمور بها بما أمر به النبي صلى الله عليه وسلم لكون الاستقامة مماثلة لسائر ما أمر به ، وهو تشبيه المجمل بالمفصّل في تفصيله بأن يكون طبقه . ويؤول هذا المعنى إلى أن تكون الكاف في معنى ( على ) كما يقال : كن كما أنت . أي لا تتغيّر ، ولتشبه أحوالك المستقبلة حالتك هذه .{ ومن تاب } عطف على الضمير المتّصل في { أمرت }. ومصحّح العطف موجود وهو الفصل بالجار والمجرور .{ ومن تاب } هم المؤمنون ، لأنّ الإيمان توبة من الشّرك ، و { معك } حال من { تاب } وليس متعلّقاً ب { تاب } لأنّ النبي صلى الله عليه وسلم لم يكن من المشركين .وقد جمع قوله : { فاستقم كما أمرت } أصول الصّلاح الديني وفروعه لقوله : { كما أمرتَ }.قال ابن عبّاس : ما نزل على رسول الله صلى الله عليه وسلم آية هي أشدّ ولا أشق من هذه الآية عليه .ولذلك قال لأصحابه حين قالوا له : لقد أسرع إليك الشيب «شيبتني هود وأخواتها» . وسئل عمّا في هود فقال : قوله { فاستقم كما أمرت }.الخطاب في قوله : { ولا تطغوا } موجه إلى المؤمنين الذين صدق عليهم { ومن تاب معك }.والطغيان أصله التّعاظم والجراءة وقلة الاكتراث ، وتقدّم في قوله تعالى : { ويمدُّهم في طغيانهم يعمهون } في سورة \\[ البقرة : 15 \\]. والمراد هنا الجراءة على مخالفة ما أمروا به ، قال تعالى : { كلوا من طيبات ما رزقناكم ولا تطغوا فيه فيحلّ عليكم غضبي } \\[ طه : 81 \\]. فنهى الله المسلمين عن مخالفة أحكام كتابه كما نهى بني إسرائيل .وقد شمل الطغيان أصول المفاسد ، فكانت الآية جامعة لإقامة المصالح ودَرْء المفاسد ، فكان النهي عنه جامعاً لأحوال مصادر الفساد من نفس المفسد وبقي ما يخشى عليه من عدوى فساد خليطه فهو المنهى عنه بقوله بعد هذا : { ولا تركنوا إلى الذين ظلموا فتمسّكم النار } \\[ هود : 113 \\].وعن الحسن البصري : جعل الله الدّين بين لاءَيْن { ولا تطغوا } { ولا تركنوا } \\[ هود : 113 \\].وجملة { إنّه بما تعملون بصير } استئناف لتحذير من أخفى الطغيان بأن الله مطلع على كل عمل يعمله المسلمون ، ولذلك اختير وصف { بصير } من بين بقية الأسماء الحسنى لدلالة مادته على العلم البين ودلالة صيغته على قوته .\n\n",
      "translations": [
        {
          "translation": "(So tread thou the straight path) in obedience of Allah (as thou art commanded) in the Qur'an, (and those who turn (unto Allah) with thee) from disbelief into faith, let them also follow the straight path, (and transgress not) do not disbelieve and do not transgress over that which is in the Qur'an, i.e. from the lawful to the unlawful. (Lo! He is Seer of what ye do) of good and of evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فَاسْتَقِم كما أُمِرْت } في القيام بحقوق الله بالله\n فإنه عليه الصلاة والسلام مأمور بمحافظة حقوق الله والتعظيم لأمره والتسديد لخلقه بضبط أحكام التجليات الصفاتية بعد الرجوع إلى الخلق مع شهود الوحدة الذاتية بحيث لا يتحرك ولا يسكن ولا ينطق ولا يتفكّر إلا به من غير ظهور تلوين من بقايا صفاته أو ذاته ولا يخطر له خاطر بغيره من غير إخلال بشرط ما من شرائط التعظيم كما قال صلى الله عليه وسلم:\n \" أفلا أكون عبداً شكوراً؟ \" \nحين تورمت قدماه من قيام الليل وقيل له: أما بشرك الله بقوله:\n[الفتح\n الآية: 2]؟\n ولا بدقيقة من باب النهي عن المنكر والأمر بالمعروف والإنذار والدعوة وذلك في غاية الصعوبة\n ولهذا قال:\n \" \" شيبتني سورة هود \"\n قيل: رأى رسول الله صلى الله عليه وسلم بعض العرفاء في المنام\n فسأله عن ذلك وقال: لماذا يا رسول الله؟ ألقصص الأنبياء وما نزل بأممهم المكّذبين من العذاب وما كانوا يقاسون من أممهم؟\n قال: لا\n بل لقوله تعالى: { فاستقم كما أُمرت }\n \" \n{ ومن تَاب } عن أنيته وذنب وجوده { معكَ } من الموحدين الواصلين إلى شهود الكثرة في عين الوحدة ومقام البقاء بعد الفناء { ولا تَطْغوا } بالاحتجاب بحجاب الأنائية ونسبة الكمالات الإلهية المطلقة إلى أنائيتكم المشخصة المقيدة برؤيتها لكم\n الموجبة للاحتجاب بالتقيد عن الإطلاق\n فإن الهوية الإلهية لا تتقيد بإشارة الهذية والأنائية { إنه بما تعملون بصير } أتعملونه بي أم بأنفسكم؟",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتنبهت تنبيهاً وجدانياً حضورياً وانكشفت بها انكشافاً عينياً شهودياً { فَٱسْتَقِمْ } أي: فاعتدل في أوصافك و أفعالك وأقوالك { كَمَآ أُمِرْتَ } من ربك بوحيه عليك وإلهامه إليك\n وأمر أيضاً بالعدالة والاستقامة { وَمَن تَابَ مَعَكَ } وآمن لك واتخذ طريقط مسلكاً إلى الحق { وَ } بالجملة: { لاَ تَطْغَوْاْ } أي: لا تميلوا ولا تخرجوا أيها المتحققون بحقية التوحيد واستقامة صراطه ولا تنحرفوا عن سبيل السلامة التي هي جادة الشريعة والمصطفوية أصلاً { إِنَّهُ } سبحانه بذاته { بِمَا تَعْمَلُونَ } من جميع الأعمال الموجبة للعدالة والانحراف { بَصِيرٌ } [هود: 112] لا يخفى عليه شيء\n\n\nولصعوبة الامتثال بهذه الآية الكريمة قال صلى الله عليه وسلم:\n \" شيبتني سورة هود \"\n \n \nوقال أيضاً صلى الله عليه وسلم: \" هذه الآية قصمت ظهور أنبياء الله وأوليائه \"\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ومن تاب: عطف على فاعل استقم للفصل\n فَتَمَسَّكُمُ: جواب النهي\n ويقال: ركن يركن: كعَلِم يعلم\n وركن يركن: كدخل يدخل\n وثم لا تنصرون: مستأنف لا معطوف\n وطرفي: منصوب على الظرفية\n وزلفاً\n كقربة\n أزلفه: قربة\n يقول الحق جل جلاله: { فاستقمْ } يا محمد { كما أُمرت } \n { و } ليستقم { من تابَ معك } من الكفر وآمن بك\n وهي شاملة للاستقامة في العقائد\n كالتوسط بين التشبيه والتعطيل\n بحيث يبقى العقل مصوناً من الطرفين\n وفي الأعمال من تبليغ الوحي\n وبيان الشرائع كما أنزل\n والقيام بوظائف العبادات من غير تفريط ولا إفراط\n وهي في غاية العسر\n ولذلك قال عليه الصلاة والسلام:\n \" شَيَّبَتنِي هُود \" \nقاله البيضاوي\n قال المحشي الفاسي: واللائق أن إشفاقه ـ عليه الصلاة والسلام ـ من أجل أمته لا من أجل نفسه لأجل نفسه لأجل عصمته\n وإنما أشفق عليهم لتوعد اللعن لهم بقوله:\n[الأعراف: 16]\n هـ\n قلت: ولا يبعد أن يكون أشفق ـ عليه الصلاة والسلام ـ من صعوبة استقامته التي تليق به\n فبقدر ما يعلو المقام يطلب بزيادة الأدب\n وبقدر ما يشتد القرب يتوجه العتاب\n ولذلك كان الحق تعالى يعاتبه على ما لا يعاتب عليه غيره\n وقد قالوا: حسنات الأبرار سيئات المقربين\n وقد تقدم كلام الإحياء في قوله:\n[هود: 60]\n ثم قال تعالى: { ولا تَطْغَوا } ولا تخرجوا عما حد لكم\n { إنه بما تعملون بصير } \n فيجازيكم على النقير والقطمير\n وهو تهديد لمن لم يستقم\n وتعليل للأمر والنهي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:37",
      "similarity": 0.45603827755823795
    },
    {
      "verse": "53:52",
      "similarity": 0.4388246504480442
    },
    {
      "verse": "37:30",
      "similarity": 0.4232848408466146
    },
    {
      "verse": "68:31",
      "similarity": 0.41213501660998364
    },
    {
      "verse": "96:6",
      "similarity": 0.4042240086917065
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011112.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011112.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:112.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}