{
  "chapter": "هود",
  "text": "فالم يستجيبوا۟ لكم فاعلموا۟ انما انزل بعلم الله وان لا اله الا هو فهل انتم مسلمون",
  "translations": [
    {
      "translation": "If they do not respond to you then know that it has been sent down with Allah's knowledge and that there is no god but Him. So will you not become Muslims?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they do not answer you, then know it has been revealed with the knowledge of God, and that there is no god but He. (And say:) \"Will you now submit?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if (your deities) do not respond to your call for help then feel assured that this Book was revealed with the knowledge of Allah, and that there is no true god but Him. Will you, then, surrender (to this truth)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they will not respond to you, know that God has sent it with His knowledge and that He is the only God. Will you then become Muslims?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So O Muslims, if they are unable to reply to this challenge of yours, then know well that it is sent down only with the knowledge of Allah; and that except Him, there is no real God; so will you now accept?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If then they answer you not, know then that it is sent down with the knowledge of Allah and that there is no god besides Him! Will you then be Muslims\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they do not answer you, then know that it is revealed by Allah's knowledge and that there is no god but He; will you then submit?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, if they do not answer you, know that it has been sent down with God's knowledge, and that there is no god but He. So have you surrendered?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they answer not your prayer, then know that it is revealed only in the knowledge of Allah; and that there is no Allah save Him. Will ye then be (of) those who surrender?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they do not respond to you, then know that this [Quran] is sent down with God's knowledge and that there is no deity but Him. Will you then surrender yourselves to Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they respond you not, know that it hath been sent down only with the Knowledge of Allah, and that there is no god but he; are ye Muslims then?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they do not respond to you, know that it has been sent down by Allah’s knowledge, and that there is no god except Him. Will you, then, submit [to Allah]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If then they (your false gods) answer not your (call), know ye that this revelation is sent down (replete) with the knowledge of Allah, and that there is no god but He! will ye even then submit (to Islam)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If then they answer you not, know then that the Revelation (this Quran) is sent down with the Knowledge of Allah and that La ilaha illa Huwa: (none has the right to be worshipped but He)! Will you then be Muslims (those who submit to Islam)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they do not answer you, know that it has been sent down with the knowledge of Allah, and that there is no god except He. So, have you surrendered (become Muslims)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they fail to answer you, know that it was revealed with God’s knowledge, and that there is no god but He. Will you then submit?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they do not respond to you - then know that the Qur'an was revealed with the knowledge of Allah and that there is no deity except Him. Then, would you [not] be Muslims?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:14] Then, if they, that is, those on whom you call for assistance, do not answer you, know, this address is to the idolaters, that it has been revealed, enwrapped, only in God’s knowledge, not as an invention of lies against Him, and that (an is softened, in other words [understand it as] annahu) there is no god save Him. Will you then submit?, after this definitive argument; in other words: ‘Submit!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When they could not respond, Allah said: (And if they answer not your prayer) and if the wrong-doers do not answer you, (then know) disbelievers (that it is revealed) that Gabriel brought down the Qur'an (only in the knowledge of Allah) and with his command; (and that there is no God save Him. Will ye then be (of) those who surrender?) and believe in Muhammad (pbuh) and in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِلَّمْ يَسْتَجِيبُواْ لَكُمْ } أيها المؤمنون ولم يأتوا بماتحديتم لهم { فَٱعْلَمُوۤاْ } أيها المؤمنون واطمأنوا وتيقنوا { أَنَّمَآ أُنزِلَ بِعِلْمِ ٱللَّهِ } وبكمال قدرته وإرادته\n لا يمكن لأحد من مظاهره ومصنوعاته أن يأتي بمثله ويعارض معه\n وكيف لا يعراض معه\n إذ لا شيء سواه { وَأَن لاَّ إِلَـٰهَ } في الوجود { إِلاَّ هُوَ فَهَلْ أَنتُمْ مُّسْلِمُونَ } [هود: 14] مناقدون لحكمه مسلمون أموركم كلها إليه\n مخلصون مطمئنون\n متمكنون في جادة التوحيد\n بل أنتم أيها الموحدون المحمديون هكذا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاعلموا } أيها الرسول المؤمنون { إنما أُنزل بعلم الله } بإذنه\n أو بما لا يعلمه إلا الله من الغيوب\n والمعنى: دوموا على إيمانكم\n وزيدوا يقيناً فيه\n  قال البيضاوي: وجمع الضمير إما لتعظيم الرسول صلى الله عليه وسلم\n أو لأن المؤمنين كانوا يتحدونهم\n فكان أمر الرسول ـ عليه الصلا ة والسلام ـ متناولاً لهم من حيث إنه يجب اتباعه عليهم في كل أمر إلا ما خصه الدليل\n أو للتنبيه على أن التحدي مما يوجب رسوخ إيمانهم وقوة يقينهم\n ولذلك رتب عليه قوله: { فاعلموا أنما أُنزل بعلم الله } ملتبساً بما لا يعلمه إلا الله\n لأن العالم والقادر بما لا يعلم ولا يقدر عليه غيره\n { وأن لا إله إلا هو } لظهور عجز آلهتهم\n { فهل أنتم مسلمون }؟ ثابتون على الإسلام\n راسخون مخلصون فيه\n إذا تحقق عندكم إعجازه مطلقاً\n ويجوز أن يكون الكل خطاباً للمشركين\n والضمير في { يستجيبوا } لمن استطعتم\n أي: فإن لم يستجيبوا لكم\n أي: من استعنتم به على المعارضة لعجزهم\n وقد عرفتم من أنفسكم القصور عن المعارضة\n { فاعلموا } أنه نظم لا يعلمه إلا الله وأنه منزل من عنده\n وأن ما دعاكم إليه من التوحيد حق\n فهل أنتم داخلون في الإسلام بعد قيام الحجة القاطعة؟ وفي مثل هذا الاستفهام إيجاب بليغ لما فيه معنى الطلب\n والتنبيه على قيام الموجب\n وزوال العذر\n\nهـ\n وقال في الوجيز: فإن لم يستجيبوا لكم من تدعون إلى المعاونة\n ولا تهيأ لكم المعارضة\n فقد قامت عليكم الحجة\n { فاعلموا أنما أنزل بعلم الله } أي: أنزل والله عالم بإنزاله\n وعالم أنه من عنده\n { فهل أنتم مسلمون }؟ استفهام\n معناه الأمر\n كقوله\n[المائدة: 91]\n هـ\n الإشارة ينبغي لأهل الوعظ والتذكير أن يعمموا الناس في التذكير\n ولا يفرقوا بين أهل الصدق\n وأهل التنكير\n يل ينصحوا العباد كلهم\n ولا يتركوا تذكيرهم\n ومخافة الرد عليهم\n ولا تضيق صدورهم بما يسمعون منهم\n اقتداء بنبيهم صلى الله عليه وسلم\n وقد قال لقمان لابنه حين أمره بالتذكير\n[لقمان: 17]\n فإن طلبوا من المذكر الدليل فليقل: إنما أنا نذير\n والله على كل شيء وكيل: فإن قالوا: هذا الذي تذكر كلنا نعرفه\n فليقل: فأتوا بسورة من مثله\n أو بعشر سور من مثله\n والله تعالى أعلم\n ولا ينفع الوعظ والإنذار إن كانت همته كلها مصروفة للدنيا\n كما قال تعالى: { مَن كَانَ يُرِيدُ ٱلْحَيَاةَ ٱلدُّنْيَا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:64",
      "similarity": 0.5036091954590063
    },
    {
      "verse": "10:89",
      "similarity": 0.47445343964631415
    },
    {
      "verse": "28:50",
      "similarity": 0.45848898076858535
    },
    {
      "verse": "7:194",
      "similarity": 0.4482374472074922
    },
    {
      "verse": "6:36",
      "similarity": 0.40565204164878427
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/11:14.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/11:14.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/11:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}