{
  "chapter": "هود",
  "text": "ولقد ءاتينا موسى الكتب فاختلف فيه ولولا كلمة سبقت من ربك لقضى بينهم وانهم لفى شك منه مريب",
  "translations": [
    {
      "translation": "We gave Musa the Book and people differed concerning it and had it not been for a prior Word from your Lord, it would already have been decided between them. They are indeed in grave doubt about it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We gave to Moses the Book, but there was disagreement about it. Had the decree of your Lord (delaying it) not been issued the matter would have been settled between them. They are still suspicious of it and in doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly gave Moses the Book before, and there arose disagreements about it (even as there are disagreements now about the Book revealed to you). Had it not been for a decree that had already gone forth from your Lord, the matter would have long been decided between them. Indeed they are in a disquieting doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave the Book to Moses but people had different views about it. Had the Word of your Lord not been already ordained, He would have settled their differences (there and then). They are still in doubt about this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Moosa the Book, hence there was discord regarding it; and were it not for a Word that had been previously passed from your Lord, the matter would have immediately been decided regarding them; and indeed they are in an intriguing doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We gave the Book to Musa, but differences arose therein, and had it not been for a Word that had gone forth before from your Lord, the case would have been judged between them, and indeed they are in grave doubt concerning it (this Qur'an).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave the book to Musa, but it was gone against; and had not a word gone forth from your Lord, the matter would surely have been decided between them; and surely they are in a disquieting doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book; and there was difference regarding it, and but for a word that preceded from thy Lord, it had been decided between them; and they are in doubt of it disquieting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we verily gave unto Moses the Scripture, and there was strife thereupon; and had it not been for a Word that had already gone forth from thy Lord, the case would have been judged between them, and lo! they are in grave doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly gave the Book to Moses, but differences arose about it: had it not been that a word had gone forth before from your Lord, Judgement would indeed have been passed on them then and there: yet they are in grave doubt about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly vouchsafed unto Musa the Book, and disputation arose thereabout; and had not a word preceded from thy Lord, it would have been decreed between them. And verily they are concerning that in doubt disquieting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Moses the Book, but differences arose about it, and were it not for a prior decree of your Lord, a decision would have been made between them; indeed they are in grave doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly gave the Book to Moses, but differences arose therein: had it not been that a word had gone forth before from thy Lord, the matter would have been decided between them, but they are in suspicious doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We gave the Book to Musa (Moses), but differences arose therein, and had it not been for a Word that had gone forth before from your Lord, the case would have been judged between them, and indeed they are in grave doubt concerning it (this Quran).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Book, but they differed regarding it, but for a word that preceded from your Lord, it had been decided between them; and they are indisquieting doubt of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Scripture, but it was disputed. Were it not for a prior word from your Lord, it would have been settled between them. They are in serious doubt concerning it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had certainly given Moses the Scripture, but it came under disagreement. And if not for a word that preceded from your Lord, it would have been judged between them. And indeed they are, concerning the Qur'an, in disquieting doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:110] And We verily gave Moses the Scripture, the Torah, but differences arose concerning it, some believing, others denying, just as [is the case] with the Qur’ān; and were it not for a word that went forth from your Lord, to defer the reckoning and the requital for creatures to the Day of Resurrection, the case would have been decided between them, in this world, regarding that over which they differed; and truly they, that is, those who deny it, are in grave doubt concerning it, [doubt] creating [great] uncertainty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We verily gave unto Moses the Scripture) i.e. the Torah, (and there was strife thereupon) about the Scripture of Moses: some believed in it while others did not; (and had it not been for a Word that had already gone forth) enjoined (from thy Lord) to delay His chastisement from your nation, (the case would have been judged between them) their destruction would have already happened and chastisement would have seized them, (and Lo! they are in grave doubt) manifest doubt (concerning it).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا نوفي العذاب على المشركين { لَقَدْ آتَيْنَا } من عظيم جودنا { مُوسَىٰ ٱلْكِتَابَ } أي: التوراة حين فشا الجدال والمراء والكفر والفسوق بين بني إسرائيل واضمحلت العدالة الإلهية بالكلية { فَٱخْتُلِفَ فِيهِ } مثل اختلافهم في كتابك الذي هو أفضل الكتب علماً وإحاطة، وأجمعهم حكماً، وأشملهم معرفة، وأكملهم حقيقة وكشفاً { وَلَوْلاَ كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ } في أنظار هؤلاء الكفرة وإمهالهم إلى يوم القيامة { لَقُضِيَ } أي: حكم ورفرق { بَيْنَهُمْ } الآن، بحيث يتميز المحق من المبطل، فليلحق المبطلين وبال ما صنعوا، فهلكوا كما هلكوا { وَإِنَّهُمْ } أي: كفار قوموك، من غاية انهماكهم في الغفلة وتماديهم في العناد والاستكبار { لَفِي شَكٍّ } أي: من أمر القرآن مع أنهم عارضوا معه مراراً فأفحموا { مِّنْهُ مُرِيبٍ } [هود: 110] موقع المريب الشك للخرفاء المنحطين عن التأمل في مرمزاته والتدريب في إشارته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:45",
      "similarity": 0.9999999999999999
    },
    {
      "verse": "42:14",
      "similarity": 0.7557152778109018
    },
    {
      "verse": "10:19",
      "similarity": 0.5520428750612014
    },
    {
      "verse": "11:62",
      "similarity": 0.5049576076810209
    },
    {
      "verse": "38:8",
      "similarity": 0.4471836206958367
    }
  ]
}