{
  "chapter": "هود",
  "text": "او۟لئك الذين ليس لهم فى الءاخرة الا النار وحبط ما صنعوا۟ فيها وبطل ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "But such people will have nothing in the akhira but the Fire. What they achieved here will come to nothing. What they did will prove to be null and void.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet these are the people for whom there is nothing but Fire in the world to come. Fruitless will be what they have fashioned, and whatever they have done will perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who shall have nothing in the Hereafter except Fire. (There they shall come to know) that their deeds in the world have come to naught; and that whatever they have done is absolutely useless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such people will receive nothing in the next life except Hell fire. Their deeds will be made devoid of all virtue and their efforts will be in vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the ones for whom there is nothing in the Hereafter except the fire; and all that they did there has gone to waste and all their deeds are destroyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those for whom there is nothing in the Hereafter but Fire, and vain are the deeds they did therein. And of no effect is that which they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they for whom there is nothing but fire in the hereafter, and what they wrought in it shall go for nothing, and vain is what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those are they for whom in the world to come there is only the Fire; their deeds there will have failed, and void will be their works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they for whom is naught in the Hereafter save the Fire. (All) that they contrive here is vain and (all) that they are wont to do is fruitless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people who, in the world to come, shall have nothing but Hellfire and all that they used to do shall be in vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they for whom there is not in the Hereafter save the Fire; to naught shall come that which they have performed, and vain is that which they have been working\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones for whom there shall be nothing in the Hereafter but Fire: what they had accomplished in the world has failed, and their works have come to naught.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those for whom there is nothing in the Hereafter but the Fire: vain are the designs they frame therein, and of no effect and the deeds that they do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those for whom there is nothing in the Hereafter but Fire; and vain are the deeds they did therein. And of no effect is that which they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those are they who in the Everlasting Life will have only the Fire. There, their deeds will have failed and their works will be void.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These—they will have nothing but the Fire in the Hereafter. Their deeds are in vain therein, and their works are null.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones for whom there is not in the Hereafter but the Fire. And lost is what they did therein, and worthless is what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:16] Those are they for whom there is nothing in the Hereafter but the Fire; what they contrive will have failed, [will] be invalid, therein, that is, in the Hereafter, and will not be rewarded, and useless is that which they used to do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those are they) who worked for other than Allah (for whom is naught in the Hereafter save the Fire. (All) that they contrive here is vain) all the good works they did in the life of this world shall be given back to them (and (all) that they are wont to do is fruitless) and they will not be rewarded in the Hereafter for the good works they did in the life of this world, for they acted for the sake of other than Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أولئك الذين ليس لهم في الآخرة إلا النار } لتعذب قلوبهم بالحجب الدنيوية وحرمانها عن مقتضى استعدادها وتألمها بما لا يلائمها من مكسوباتها { وحَبط ما صَنَعوا } من أعمال البر في الآخرة لكونها بنية الدنيا لقوله صلى الله عليه وسلم:\n \" الأعمال بالنيّات ولكل امرئ ما نوى \" \nإلى آخر الحديث",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وليس توفية السيئات إلا بالنار وما يترتب عليها من العذاب والآلام { وَ } بالجملة: { حَبِطَ } وضاع واضمحل { مَا صَنَعُواْ فِيهَا } أي: في النشأة الأولى من الخيرات والمبرات بإرادتهم الأمور الدنيوية لأجلها { وَ } صار بعدم إصلاحهم وعكس مرادهم { بَاطِلٌ } فساد مقتضى { مَّا كَانُواْ يَعْمَلُونَ } [هود: 16] من الصالحات فيها\n وإن ظهر على صورة الصالحات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وحَبِطََ ما صنعوا فيها } أي: في الدنيا فكل ما صنعوا في الدنيا من الإحسان حبط يوم القيامة لأنهم لم يريدوا به وجه الله\n والعمدة في انتظار ثواب الأعمال هو الإخلاص\n { وباطلٌ ما كانوا يعملون } لأنه لم تتوفر فيه شروط الصحة التي من جملتها الإخلاص\n  الإشارة: في الحديث\n \" مَن كَان الدُّنيا هَمَّه: فَرَّق اللَّهُ عَليْهِ أَمْرَهُ\n وجَعَل فَقْرَه بَينَ عَينَيه\n وَلم يَأتِهِ مِنَ الدُّنيا إلا ما قُسِمَ له\n ومن كَانت الآخرةُ نيته: جمعَ اللَّهُ عَليه أَمْرَه\n وجَعَل غَناهُ في قَلبِه\n وأَتتهُ الدُّنيا وهِي صَاغِرة \"\n \nقلت: ومن كان الله همه كفاه هَم الدارين\n فطالبُ الدنيا أسير\n وطالب الآخرة أجير وطالب الحق أمير\n فارفع همتك أيها العبد عن الدار الفانية\n وعلق قلبك بالدار الباقية\n ثم ارفعها إلى شهود الذات العالية\n ولا تكن ممن قصرَ همته على هذه الدار فتكن ممن ليس له في الآخرة إلا النار\n وحصّن أعمالك بالإخلاص\n وإياك وملاحظة الناس فتبوأ بالخيبة والإفلاس\n وبالله التوفيق\n ثم ذكر ضد من تقدم\n فقال: { أَفَمَن كَانَ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:22",
      "similarity": 0.5565093097878505
    },
    {
      "verse": "7:147",
      "similarity": 0.5222011036909004
    },
    {
      "verse": "6:88",
      "similarity": 0.5079199593466593
    },
    {
      "verse": "47:9",
      "similarity": 0.48538500375180477
    },
    {
      "verse": "39:65",
      "similarity": 0.46104329760698576
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/11:16.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/11:16.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/11:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}