{
  "chapter": "هود",
  "text": "وان كلا لما ليوفينهم ربك اعملهم انه بما يعملون خبير",
  "translations": [
    {
      "translation": "Your Lord will pay each one of them in full for his actions. He is aware of what they do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord will reward everyone in accordance with his deeds. He is certainly aware of all they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord will recompense all to the full for their deeds. For indeed He is well aware of all what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will certainly recompense everyone according to their deeds; He knows well all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed to each and every one, your Lord will fully repay his deeds; He is Informed of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, to each of them your Lord will repay their works in full. Surely, He is All-Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord will most surely pay back to all their deeds in full; surely He is aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely each one of them -- thy Lord will pay them in full for their works; He is aware of the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! unto each thy Lord will verily repay his works in full. Lo! He is Informed of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord will reward each one of them in full for their deeds. He is well-aware of all their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily unto each will thy Lord repay their works in full; verily of that which they work He is Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord will indeed recompense everyone fully for their works. Indeed, He is well aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, of a surety, to all will your Lord pay back (in full the recompense) of their deeds: for He knoweth well all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, to each of them your Lord will repay their works in full. Surely, He is All-Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your Lord will pay each one of them in full for their deeds. He is aware of the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord will repay each one of them in full for their deeds. He is Aware of everything they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, each [of the believers and disbelievers] - your Lord will fully compensate them for their deeds. Indeed, He is Acquainted with what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:111] And assuredly (read wa-in or wa-inna) to each, that is, to all creatures, verily (la-mā: the mā is extra and   the lām is in the place of an implied oath or a separator; a variant reading has lammā, with the sense of illā, ‘but’, making the [preceding] in for negation), your Lord will pay for his works, that is, the requital thereof, in full. Truly He is Aware of what they do, knowing the inner and outer aspects thereof.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! unto each) each two parties (thy Lord will verily repay his works in full) the reward of his works in full: good with good and evil with evil. (Lo! He is Informed of what they do) of good and evil, reward and punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنَّ كُـلاًّ } أي: كلاً من المؤمنين المحقين والمبطلين الكافرين، والله { لَّمَّا لَيُوَفِّيَنَّهُمْ } ويوفون عليهم بلا زيادة وتنقيص؛ إظهاراً للقدرة الكاملة والعدالة التامة الشاملة { رَبُّكَ } الذي أظهرهم من كتم العدم بلا سبق مادة ومدة { أَعْمَالَهُمْ } أي: أجورها وجزاءها، إن خيراً فخير وإن شراً فشر { إِنَّهُ } سبحانه بذاته وأوصافه وأسمائه { بِمَا يَعْمَلُونَ } من الخير والشر والصلاح والفساد والعبادة وتركها { خَبِيرٌ } [هود: 111] على وجه الحضور، لا تغ يب عنه غائبة ولا تخفى عنه خافية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "100:11",
      "similarity": 0.5219330652861587
    },
    {
      "verse": "64:8",
      "similarity": 0.49912049533594965
    },
    {
      "verse": "39:70",
      "similarity": 0.48922845488341077
    },
    {
      "verse": "33:2",
      "similarity": 0.4824240912263898
    },
    {
      "verse": "63:11",
      "similarity": 0.37921560507598184
    }
  ]
}