{
  "chapter": "هود",
  "text": "ان فى ذلك لءاية لمن خاف عذاب الءاخرة ذلك يوم مجموع له الناس وذلك يوم مشهود",
  "translations": [
    {
      "translation": "There is certainly a Sign in that for anyone who fears the punishment of the Next World. That is a Day to which mankind will all be gathered. That is a Day which will be witnessed by everyone.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this surely is a sign for him who fears the torment of the Hereafter, the day when mankind will be assembled together, which will be a day when all things would become evident.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in that is a sign for him who fears the chastisement of the Hereafter. That will be a Day when all men shall be mustered together; that will be a Day when whatever happens shall be witnessed by all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this there is, certainly, a lesson for those who fear the torment of the next life in which all people will be gathered together\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in this is a sign for one who fears the punishment of the Hereafter; this is the day on which everyone will be gathered, and this is the Day of Attendance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in that (there) is a sure lesson for those who fear the torment of the Hereafter. That is a Day whereon mankind will be gathered together, and that is a Day when all will be present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely there is a sign in this for him who fears the chastisement of the hereafter; this is a day on which the people shall be gathered together and this is a day that shall be witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in that is a sign for him who fears the chastisement in the world to come; that is a day mankind are to be gathered to, a day to witness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! herein verily there is a portent for those who fear the doom of the Hereafter. That is a day unto which mankind will be gathered, and that is a day that will be witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that is a sign for him who fears the punishment of the Hereafter. That is a Day for which mankind shall be gathered together, a Day when all will be present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily herein is a sign unto him who feareth the torment of the Hereafter. That is a Day whereon mankind shall be gathered together, and that is a Day to be witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is indeed a sign in that for those who fear the punishment of the Hereafter. That is a day on which all mankind will be gathered, and it is a day witnessed [by all creatures].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that is a Sign for those who fear the penalty of the Hereafter: that is a Day for which mankind will be gathered together: that will be a Day of Testimony.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in that (there) is a sure lesson for those who fear the torment of the Hereafter. That is a Day whereon mankind will be gathered together, and that is a Day when all (the dwellers of the heavens and the earth) will be present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, for he who fears the punishment of the Everlasting Life that is a sign. That is a Day on which everyone shall be assembled. That shall be a witnessed Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that is a sign for whoever fears the punishment of the Hereafter. That is a Day for which humanity will be gathered together—that is a Day to be witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in that is a sign for those who fear the punishment of the Hereafter. That is a Day for which the people will be collected, and that is a Day [which will be] witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:103] There is indeed in that, which is mentioned of stories, a sign, a lesson, for him who fears the chastisement of the Hereafter: that, in other words, the Day of Resurrection, is a day to which, on which, mankind will be gathered, and that is a day witnessed, witnessed by all creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Herein) in that which We mentioned to you (verily there is a portent) a lesson (for those who fear the doom of the Hereafter) such that they do not follow in their footsteps. (That is a day) the Day of Resurrection (unto which mankind will be gathered) the first and last among mankind will be gathered, (and that is a day that will be witnessed) it will be witnessed by the dwellers of heaven and earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يوم مجموعٌ له الناسُ }: محشورون إليه أينما كانوا\n وعبَّر باسم المفعول دون الفعل للدلالة على الثبوت والاستقرار\n ليكون أبلغ لأن \" مجموع \" أبلغ من \" يجمع \"\n { وذلك يوم مشهود } أي: تشهده أهل السماوات وأهل الأرض لفصل القضاء\n ويحضره الأولون والآخرون\n لاقتضاء الثواب والعقاب\n فاليوم مشهود فيه\n فحذف الظرف اتساعاً\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:135",
      "similarity": 0.4426943015097865
    },
    {
      "verse": "100:7",
      "similarity": 0.379145789312204
    },
    {
      "verse": "11:26",
      "similarity": 0.36564325796618424
    },
    {
      "verse": "2:8",
      "similarity": 0.36501622964745917
    },
    {
      "verse": "26:39",
      "similarity": 0.36093063819397764
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/11:103.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/11:103.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:103.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}