{
  "chapter": "هود",
  "text": "الا الذين صبروا۟ وعملوا۟ الصلحت او۟لئك لهم مغفرة واجر كبير",
  "translations": [
    {
      "translation": "except for those who are steadfast and do right actions. They will receive forgiveness and a large reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who endure with patience and do the right, who will have pardon and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who are patient and act righteously. Such shall have Allah's forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who exercise patience and do good works do not behave as such. They will receive forgiveness and a great reward (from the Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who patiently endured and did good deeds; for them is forgiveness, and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who show patience and do righteous good deeds: those, theirs will be forgiveness and a great reward (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who are patient and do good, they shall have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save such as are patient, and do deeds of righteousness; for them awaits forgiveness and a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those who persevere and do good works. Theirs will be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not so those who are patient and do good deeds. They shall have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not so are those who persevere and do righteous works. Those! theirs shall be forgivness and a great hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "excepting those who are patient and do righteous deeds. For such there will be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not so do those who show patience and constancy, and work righteousness; for them is forgiveness (of sins) and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who show patience and do righteous good deeds, those: theirs will be forgiveness and a great reward (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who are patient and do good deeds, for them awaits forgiveness and a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who are patient and do good deeds—these will have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who are patient and do righteous deeds; those will have forgiveness and great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:11] save, but, those who endure, misery, [patiently] and perform righteous deeds, during times of comfort; theirs will be forgiveness and a great reward, which is Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاحتراس باستثناء من ( الإنسان ). والمراد بالّذين صبروا المؤمنون بالله لأنّ الصبر من مقارنات الإيمان فَكنيَ بالذين صبروا عن المؤمنين فإنّ الإيمان يَرُوضُ صاحبَه على مفارقة الهوى ونبذ معتاد الضلالة . قال تعالى : { إلاّ الّذينَ آمَنُوا وَعَملُوا الصّالحَات وَتَوَاصَوْا بالْحَقّ وَتَوَاصَوْا بالصّبْر } \\[ العصر : 3 \\].ومنْ معاني الصبر انتظار الفرج ولذلك أوثرَ هنا وصفُ ( صبروا ) دون ( آمنوا ) لأنّ المرادَ مقابلة حالهم بحال الكفّار في قوله : { إنّه ليؤوس كفور } \\[ هود : 9 \\]. ودل الاستثناء على أنّهم متّصفون بضد صفات المستثنى منهم . وفي هذا تحذير من الوقوع فيما يماثل صفات الكافرين على اختلاف مقادير . وقد نسجت الآية على هذا المنوال من الإجمال لتذهب نفوس السامعين من المؤمنين في طرق الحذر من صفتي اليأس وكفران النعمة ، ومن صفتي الفرح والفخر كل مذهب ممكن .وجملة { أولئك لهم مغفرة وأجْرٌ كبير } مستأنفة ابتدائية . والإتيان باسم الإشارة عقب وصفهم بما دل عليه الاستثناء وبالصبر وعمل الصالحات تنبيهٌ على أنّهم استحقوا ما يذكر بعد اسم الإشارة لأجْل ما ذكر قبله من الأوصاف كقوله : { أولَئكَ عَلَى هُدىً منْ رَبهمْ وأولئِكَ هُمْ الْمُفْلِحُون } \\[ البقرة : 5 \\].\n\n",
      "translations": [
        {
          "translation": "(Save those) save Muhammad (pbuh) and his Companions (who persevere) in their faith (and do good works) acts of obedience between them and their Lord, for they are patient in times of hardship and give thanks when they receive a blessing. (Theirs will be forgiveness) of their sins in this world (and a great reward) in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إلاّ الذين صَبَروا } استثناء من الإنسان أي هذا النوع يؤوس كفور فرح فخور في الحالين إلا الذين صبروا مع الله واقفين معه في حالة الضراء والنعماء والشدة والرخاء كما قال عمر رضي الله عنه: الفقر والغِنى مطيتان لا أبالي أيهما أمتطي\n { وعَمِلوا } في الحالين ما فيه صلاحهم مما ذكر { أولئك لهم مغفرة } من ذنوب ظهور النفس باليأس والكفران والفرح والفخر في الحالين { وأجرٌ كبير } من ثواب تجليات الأفعال والصفات وجنانها { فلعلك تارك بعض ما يوحى إليك } لما لم يقبلوا كلامه صلى الله عليه وسلم بالإرادة وأنكروا قوله بالاقتراحات الفاسدة وقابلوه بالعناد والاستهزاء ضاق صدره ولم ينبسط للكلام إذ الإرادة تجذب الكلام وقبول المستمع يزيد نشاط المتكلم ويوجب بسطه فيه\n وإذا لم يجد المتكلم محلاً قابلاً لم يتسهل له وبقي كرباً عنده فشجعه الله تعالى بذلك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ ٱلَّذِينَ صَبَرُواْ } على ما أصابهم من السيئات المملة المؤلمة\n واسترجعوا إلى الله لكشفها { وَعَمِلُواْ ٱلصَّالِحَاتِ } وواظبوا على الخيرات والحسنات وداوموا على الإيثار والصدقات\n شكراً لما أنعمنا عليها { أُوْلَـٰئِكَ } السعداء الصابرون عن البلاء\n الشاكرون على النعماء عليهم { لَهُمْ مَّغْفِرَةٌ } أي: ستر ومحو لذنوبهم التي مضت عليهم { وَأَجْرٌ كَبِيرٌ } [هود: 11] هو الرضاء منهم تفضلاً عليهم وامتناناً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { إلا الذين صبروا } على الضراء إيماناً بالله\n واستسلاماً لقضائه\n { وعملوا الصالحات } شكراً لآلائه\n سابقها ولاحقها\n { أولئك لهم مغفرة } لذنوبهم\n { وأجر كبير } أقلة الجنة\n وغايته النظرة\n والاستثناء من الإنسان لأن المراد به الجنس\n ومن حمله على الكافر ـ لسبق ذكرهم ـ جعله منقطعاً\n والله تعالى أعلم\n الإشارة: ينبغي للعبد أن يكون شاكراً للنعم\n صابراً عند النقم\n واقفاً مع المنعم دون النعم\n إن ذهبت من يدة نعمة رَجَى رجوعها\n وإن أصابته نقمة انتظر انصرافها\n والحاصل: ان يكون عبداً لله في جميع الحالات\n  حُكي أن سيدنا موسى عليه السلام قال: يا رب دلني على عمل إذا عملته رضيت عني\n قال: إنك لا تطيق ذلك\n فخر ساجداً متضرعاً\n فقال: يا ابن عمران إن رضاي في رضائك بقضائي\n هـ\n وقال ابن عباس رضي الله عنه أول شيء كتبه الله في اللوح المحفوظ: أنا الله لا إله إلا أنا\n محمد رسولي\n فمن استسلم لقضائي\n وصبر على بلائي\n وشكر نعمائي\n كتبته صديقاً\n وبعثته مع الصديقين\n ومن لم يستسلم لقضائي\n ولم يصبر على بلائي\n ولم يشكر نعمائي\n فليتخذ رباً سوائي\n هـ\n ورُوي عن ابن مسعود رضي الله عنه أنه قال: ثلاث من رزقهن رزق خير الدنيا والآخرة: الرضا بالقضاء\n والصبر على الأذى\n والدعاء في الرخاء\n هـ\n من جملة الأذى: التكذيب والإنكار\n كما أبان ذلك بقوله تعالى لنبيه ـ عليه الصلاة والسلام ـ:",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:7",
      "similarity": 0.6823320252847666
    },
    {
      "verse": "5:9",
      "similarity": 0.5788668642132047
    },
    {
      "verse": "17:9",
      "similarity": 0.5359165957416777
    },
    {
      "verse": "67:12",
      "similarity": 0.41048816547478023
    },
    {
      "verse": "74:7",
      "similarity": 0.3861208565980948
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}