{
  "chapter": "هود",
  "text": "ولقد ارسلنا نوحا الى قومه انى لكم نذير مبين",
  "translations": [
    {
      "translation": "We sent Nuh to his people: 'I am a clear warner to you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people (and he said): \"I give you a clear warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Such were the circumstances) when We sent forth Noah to his people. (He said): 'I have been sent to you to warn you plainly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people to give them the clear warning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nooh to his people that, “Indeed I am for you a clear Herald of Warning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nuh to his people (and he said): \"I have come to you as a plain warner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent Nuh to his people: Surely I am a plain warner for you:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Noah to his people: 'I am for you a warner, and a bearer of good tidings:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Noah unto his folk (and he said): Lo! I am a plain warner unto you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He said, \"I have come to you with a clear warning:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We sent Nuh unto his people saying: verily I am unto you a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Noah to his people [to declare]: ‘Indeed I am a manifest warner to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people (with a mission): \"I have come to you with a Clear Warning:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nuh (Noah) to his people (and he said): \"I have come to you as a plain warner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his nation. (He said:) 'I am a warner for you, and a bearer of glad tidings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people, “I am to you a clear warner.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had certainly sent Noah to his people, [saying], \"Indeed, I am to you a clear warner\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:25] And verily We sent Noah to his people [and he said]: ‘I am (annī: a variant reading has innī, in which case ‘he said’ has been omitted) for you a clear warner, one whose warning is plain.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We sent Noah unto his folk) and when he went to them he said: (I am a plain warner) a warning Messenger who speaks a language you understand (unto you) from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من عدم تذكر الإنسان وتوغله في الغفلة والنسيان { لَقَدْ أَرْسَلْنَا نُوحاً } الناجي عما سوى الحق، المنجي للهالكين في تيه الضلال { إِلَىٰ قَوْمِهِ } حين ظهر عليهم أمارات الكفر والعصيان، ولاح فيهم علامات الظلم والطغيان قائلاً لهم على وجه العظة والنصيحة: { إِنَّي } من غاية إشفاقي وعطفي { لَكُمْ نَذِيرٌ } أنذركم من طول العذاب ونزول غضبه بسبب ظلمكم وكفركم { مُّبِينٌ } [هود: 25] مظهر مبين لكم ما يوجب تعذيبكم من أفعالكم وأعمالكم الدالة على كفركم وشرككم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ: إني بالكسر، فعلى إرادة القول، ومن قرأ بالفتح، فعلى إسقاط الخافض، أي: بأني، وبادي الرأي: ظرف لـاتبعك، على حذف مضاف أي: وقت حدوث أول رأيهم\n وهو من البدء أي: الحدوث، أو من البُدُوِّ، أي: الظهور\n أي: اتبعوك في ظاهر الرأي دون التعمق في النظر\n يقول الحق جل جلاله: { ولقد أرسلنا نوحاً إلى قومه } فقال لهم: { إني لكم } ، أو بأني لكم { نذير مبينٌ } أي: بين ظاهر، أو أبين لكم موجبات العذاب، ووجه الخلاص منه، قائلاً: { ألا تعبدوا إلا الله } ، ولا تعبدوا معه غيره، { إني أخاف عليكم عذابَ يومٍ أليم } مُؤلم، وهو في الحقيقة صفة للعذاب، ووصف به زمانه على طريقة [جَدَّ جَدُّه، ونهاره صائم] للمبالغة\n { فقال الملأ الذين كفروا من قومه ما نَراك إلا بشراً مثلنا } لا مزية لك علينا تخصك بالنبوءة ووجوب الطاعة، { وما نراك اتبعك إلا الذين هم أراذلُنا } أخساؤنا وسُقَّاطنا جمع ارذل\n { بادِيَ الرأي } من أول الرأي من غير تفكر ولا تدبر، أي: اتبعك هؤلاء بادي الرأي من غير ترو\n أو ظاهراً رأيهم خفيفاً عقلهم، وإنما استرذلوهم، لأجل فقرهم، جهلاً منهم، واعتقاداً أن الشرف هو المال والجاه\n وليس الأمر كذلك\n بل الشرف إنما هو بالإيمان والطاعة، ومعرفة الحق\n وقيل: إنهم كانوا حاكة وحجامين\n وقيل: أراذل في أفعالهم، لقوله:\n",
      "translations": []
    }
  ]
}