{
  "chapter": "هود",
  "text": "فقال الملا الذين كفروا۟ من قومه ما نرىك الا بشرا مثلنا وما نرىك اتبعك الا الذين هم اراذلنا بادى الراى وما نرى لكم علينا من فضلۭ بل نظنكم كذبين",
  "translations": [
    {
      "translation": "The ruling circle of those of his people who were kafir said, 'We do not see you as anything but a human being like ourselves. We do not see anyone following you but the lowest of us, unthinkingly. We do not see you as superior to us. On the contrary, we consider you to be liars.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The leaders of the people who were unbelievers, replied: \"We see that you are but a man like us, and see that none among us follows you but the meanest and immature of judgement, and do not see any excellence in you above us. In fact, we think you are a liar.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The notables among Noah's own people, who had refused to follow him, responded: 'We merely consider you a human being like ourselves. Nor do we find among those who follow you except the lowliest of our folk, the men who follow you without any proper reason. We see nothing in you to suggest that you are any better than us. Rather, we believe you to be liars.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers among his people said, \"We do not believe that you are any better than the rest of us; we see that only the worthless hasty ones, the lowliest among us follow you. Thus, we do not think that you are superior to us, rather you are all liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of his people, who were disbelievers, said, “We see that you are just a mortal like us, and we do not see anyone following you except the most lowly among us, without insight; and we do not find any merit in you above us – in fact, we consider you liars.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs who disbelieved among his people said: \"We see you but a man like ourselves, nor do we see any follow you but the meanest among us and they (too) followed you without thinking. And we do not see in you any merit above us, in fact we think you are liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the chiefs of those who disbelieved from among his people said: We do not consider you but a mortal like ourselves, and we do not see any have followed you but those who are the meanest of us at first thought and we do not see in you any excellence over us; nay, we deem you liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the Council of the unbelievers of his people, 'We see thee not other than a mortal like ourselves, and we see no? any following thee but the vilest of us, inconsiderately. We do not see you have over us any superiority; no, rather we think you are liars.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chieftains of his folk, who disbelieved, said: We see thee but a mortal like us, and we see not that any follow thee save the most abject among us, without reflection. We behold in you no merit above us - nay, we deem you liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The leaders of his people, who refused to acknowledge the truth, said, \"We regard you only as a human being like ourselves. We do not see that anyone follows you but the lowliest of us, those of immature judgement. We see no superior merit in you; in fact we believe you are a liar.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of those who disbelieved among his people said: we behold thee except as a human being like us, and we behold not any follow thee except the meanest of us, by an immature opinion; nor We behold in you any exellency over us; nay! we deem you liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the elite of the faithless from among his people said, ‘We do not see you to be anything but a human being like ourselves, and we do not see anyone following you except those who are simpleminded riffraff from our midst. Nor do we see that you have any merit over us. Indeed, we consider you to be liars.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the chiefs of the Unbelievers among his people said: \"We see (in) thee nothing but a man like ourselves: Nor do we see that any follow thee but the meanest among us, in judgment immature: Nor do we see in you (all) any merit above us: in fact we think ye are liars!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of the disbelievers among his people said: \"We see you but a man like ourselves, nor do we see any follow you but the meanest among us and they (too) followed you without thinking. And we do not see in you any merit above us, in fact we think you are liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelieving Council of his nation said: 'We do not see you other than a human like ourselves. We see your followers are none but the lowliest amongst us, and their opinion is not to be considered. We do not see you superior to us, rather, we consider you liars'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The notables who disbelieved among his people said, “We see in you nothing but a man like us, and we see that only the worst among us have followed you, those of immature judgment. And we see that you have no advantage over us. In fact, we think you are liars.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the eminent among those who disbelieved from his people said, \"We do not see you but as a man like ourselves, and we do not see you followed except by those who are the lowest of us [and] at first suggestion. And we do not see in you over us any merit; rather, we think you are liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:27] The council, the respected elders, of his people who disbelieved, said: ‘We see you but a mortal like us, and you have no merit over us, and we see not that any follow you save the vilest among us, the riffraff among us, such as the weavers and the shoemakers, [through] rash opinion (bādiya’l-ra’ya: read with hamza or without [in both cases]), in other words, impulsively, without thinking you over (it [bādiya’l-ra’ya] is in the accusative because it is an adverbial clause, that is to say: at the time that their opinion first came into being). We do not see that you have any merit over us, for which you would deserve our following you; nay, we deem you liars’, with regard to your claim to [be bringing] a Message: they [the disbelievers] included his folk with him in their address [to him].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The chieftains of his folk) of Noah's folk, (who disbelieved, said: We see thee) Noah (but a mortal like us, and we see not that any follow you) believe in you (save the most abject among us) the lowly and weak among us, (without reflection) who have manifest weak judgement; it is said that this means: their bad judgement lead them to believe in you. (We behold in you no merit above us) in what you say: you eat and drink just as we do eat and drink (nay, we deem you liars) in what you say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَادِيَ ٱلرَّأْيِ } معناهُ ظَاهِرُ الرَّأَيّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سمعوا قوله وفهموا مراده استكبروا عليه واستبعدوا أمره { فَقَالَ ٱلْمَلأُ } أي: الأشراف { ٱلَّذِينَ كَفَرُواْ مِن قِوْمِهِ } مستكبرين عليه مستهزئين له: { مَا نَرَاكَ } يا نوح { إِلاَّ بَشَراً مِّثْلَنَا } كيف تدعي الرسالة والنيابة عن الله والوحي من جانبه { وَ } مع ذلك لا شوكة ولا استيلاء لك ولا قوة بسبب المكر والأعوان والأنصار حتى تدعي الرئاسة علينا؛ إذ { مَا نَرَاكَ ٱتَّبَعَكَ } منا { إِلاَّ ٱلَّذِينَ هُمْ أَرَاذِلُنَا } أي: أدنانا وأسافلنا عقلاً وجاهاً وسعة ومالاً { بَادِيَ ٱلرَّأْيِ } يظهر رذالتهم للناظرين في أو الفكر والنظر بلا احتياج إلى تعميق وتدبر { وَ } بالجملة: { مَا نَرَىٰ لَكُمْ } أيها السفلة والأرذال تابعاً ومتبوعاً { عَلَيْنَا مِن فَضْلٍ } زيادة في العقل والمال والجاه والرئاسة حتى نتبعكم ونقبل قولكم { بَلْ نَظُنُّكُمْ } ونعتقدكم { كَاذِبِينَ } [هود: 27] في دعواكم، مفترين فيه، طالبين الرئاسة بسببه بلا إظهار معجزة وبينة واضحة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الشعراء: 112]، ثم قالوا: { وما نَرى لكم } أي: لك ولمتبعيك { علينا من فضلٍ } يؤهلكم للنبوءة، واستحقاق المتابعة\n { بل نظنكم كاذبين } أنت في دعوى النبوءة، وهم في دعوى العلم بصدقك\n فغلب المخاطب على الغائبين\n الإشارة: تكذيب الصادقين سنة ماضية، وأتباع الخصوص موسومون بالذلة والقلة، وهم أتباع الرسل والأولياء وهم أيضاً جُل أهل الجنة لأن المصطفى صلى الله عليه وسلم قال:\n\n \" أَهلُ الجَنَّة كُلُّ ضَعِيفٍ مُستَضعَفٍ \"\n وقالت الجنة: مَا لِيَ لا يَدخُلُني إلا سُقَّطُ الناس؟ فقال لها الحق تعالى: \" أنتِ رَحمَتي أَرحَمُ بِك مَنْ أَشاء \" \n",
      "translations": []
    }
  ]
}