{
  "chapter": "هود",
  "text": "ان لا تعبدوا۟ الا الله انى اخاف عليكم عذاب يوم اليم",
  "translations": [
    {
      "translation": "Do not worship anyone but God; for I fear the punishment of a dreadful day for you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that you may worship none but Allah or else I fear for you the chastisement of a Grievous Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they should not worship anyone besides God. (Noah warned them), \"I am afraid that you will suffer the most painful torment\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“That you must worship none except Allah; indeed I fear the punishment of the calamitous day upon you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That you worship none but Allah; surely, I fear for you the torment of a painful Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That you shall not serve any but Allah, surely I fear for you the punishment of a painful day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Serve you none but God. I fear for you the chastisement of a painful day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That ye serve none, save Allah. Lo! I fear for you the retribution of a painful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "worship none but God. I fear lest punishment befall you on a woeful Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That ye shall worship none except Allah; verily I fear for you the torment of a Day afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship none but Allah. Indeed I fear for you the punishment of a painful day.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That ye serve none but Allah: Verily I do fear for you the penalty of a grievous day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That you worship none but Allah, surely, I fear for you the torment of a painful Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship none except Allah. I fear for you the punishment of a painful Day'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“That you shall worship none but God. I fear for you the agony of a painful Day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That you not worship except Allah. Indeed, I fear for you the punishment of a painful day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:26] That, you worship none but God. Lo! I fear for you, should you worship other than Him, the chastisement of a painful day’, painful in this world and in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That ye serve none) you confess the divine Oneness of none, (save Allah. Lo! I fear for you) I know that there shall come upon you if you do not believe (the retribution of a painful Day) which is drowning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفعليكم أيها المسرفون المفرطون { أَن لاَّ تَعْبُدُوۤاْ } ولا تتوجهوا { إِلاَّ ٱللَّهَ } الواحد الأحد الصمد، الذي لا شريك له ولا شيء سواه، ولا تشركوا به غيره { إِنِّيۤ أَخَافُ عَلَيْكُمْ } لو أشركتم بالله وكفرتم به { عَذَابَ يَوْمٍ أَلِيمٍ } [هود: 26] مؤلم مفزع، كأن ألم العذاب يسري في زمانه لفظاعته وشدته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}