{
  "chapter": "هود",
  "text": "ان الذين ءامنوا۟ وعملوا۟ الصلحت واخبتوا۟ الى ربهم او۟لئك اصحب الجنة هم فيها خلدون",
  "translations": [
    {
      "translation": "As for those who have iman and do right actions and humble themselves before their Lord, they are the Companions of the Garden, remaining in it timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do things good, and are humble before their Lord, are men of Paradise where they will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believed and acted righteously and dedicated themselves totally to their Lord -they are the people of Paradise, and there they shall abide forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteously striving believers who are humble before their Lord, will be the dwellers of Paradise wherein they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who believed and performed good deeds and directed themselves towards their Lord – they are the people of Paradise; they will abide in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe and do righteous good deeds, and humble themselves before their Lord, they will be the dwellers of Paradise to dwell therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as to) those who believe and do good and humble themselves to their Lord, these are the dwellers of the garden, in it they will abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe, and do righteous deeds, and have humbled themselves unto their Lord -- they shall be the inhabitants of Paradise, therein dwelling forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who believe and do good works and humble themselves before their Lord: such are rightful owners of the Garden; they will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have believed and done good deeds and humbled themselves before their Lord are destined for Paradise, and they will live in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who believed and worked righteous works and humbled themselves before their Lord--they shall be the fellows of the Garden: therein they shall be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who have faith and do righteous deeds and are humble before their Lord—they shall be the inhabitants of paradise, and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and work righteousness, and humble themselves before their Lord,- They will be companions of the gardens, to dwell therein for aye!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds, and humble themselves (in repentance and obedience) before their Lord, - they will be dwellers of Paradise to dwell therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereas those who believe and do good deeds and humble themselves before their Lord, they are the companions of Paradise, and there they shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good deeds, and humble themselves before their Lord—these are the inhabitants of Paradise, where they will abide forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they who have believed and done righteous deeds and humbled themselves to their Lord - those are the companions of Paradise; they will abide eternally therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:23] Truly those who believe and perform righteous deeds and humble themselves, [who] are at peace and feel reassured, or [who] repent, before their Lord: such will be the inhabitants of Paradise, abiding therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) and do acts of obedience between themselves and their Lord (and humble themselves before their Lord) and are sincere and surrendered to their Lord and are humbled before their Lord: (such are rightful owners of the Garden; they will abide therein) dwelling therein.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَخْبَتُوۤاْ } معناهُ أنابوا وتَواضعُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And be humble\" - its meaning is that you should submit and be humble.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن الذين آمنوا } الإيمان اليقيني الغيبي { وعملوا } الأعمال التي تصلحهم للقاء الله وتقرّبهم إليه من التوبة والزهد الحقيقي والإنابة والعبادة والصبر والشكر وما يناسبها من أعمال أهل السلوك ومقاماتهم { وأخبتوا إلى ربّهم } وتذللوا واطمأنوا إليه بالشوق وانقطعوا إليه متفانين فيه { أولئك أصحاب } جنة القلوب { هم فيها خالدون }\n { فقال الملأ الذين كفروا من قومه } أي: الإشراق المليئون بأمور الدنيا\n القادرون عليها\n الذين حجبوا بعقلهم ومعقولهم عن الحق\n { ما نراك إلاّ بشراً مثلنا } لكونهم ظاهريين واقفين على حد العقل المشوب بالوهم المتحير بالهوى الذي هو عقل المعاش لا يرون لأحد طوراً وراء ما بلغوا إليه من العقل غير مطلعين على مراتب الاستعدادات والكمالات طوراً بعد طور ورتبة فوق رتبة إلى ما لا يعلمه إلا الله\n فلم يشعروا بمقام النبوّة ومعناها { وما نراك اتّبعك إلاّ الذين هم أراذلنا } فقراؤنا الأدنون منّا\n إذ المرتبة والرفعة عندهم بالمال والجاه ليس إلا كما قال تعالى:\n[الروم\n الآية: 7]\n { بادي الرأي } أي: بديهة الرأي وأوله لأنهم ضعاف العقول\n عاجزون عن كسب المعاش\n ونحن أصحاب فكر ونظر قالوا ذلك لاحتجابهم بعقلهم القاصر عن إدراك الحقيقة والفضيلة المعنوية لقصر تصرّفه على كسب المعاش والوقوف على حدة\n وأما أتباع نوح عليه السلام فإنهم أصحاب همم بعيدة وعقول حائمة حول القدس غير متصرّفة في المعاش ولا ملتفتة إلى وجوه كسبه وتحصيله\n فلذلك استنزلوا عقولهم واستحقروها { وما نرى لكم علينا فضل } وتقدّم فيما نحن بصدده لكون الفضل عندهم محصوراً في التقدّم بالغنى والمال والجاه { بل نظنكم كاذبين } لعدم إدراك ما تثبتون وفهم ما تقولون مع وفور كياستنا { أرأيتم إن كنت على بيّنة من ربي } يجب عليكم من طريق العقل الإذعان له { وآتاني رحمة } أي: هداية خاصة كشفية متعالية عن درجة البرهان { من عنده } أي: فوق طور العقل من العلوم اللدنية ومقام النبوّة { فعميت عليكم } لاحتجابكم بالظاهر عن الباطن وبالخليقة عن الحقيقة ولا يمكن تلقيها إلا بالإرادة لأهل الاستعداد فكيف نلزمكموها ونجبركم عليها { وأنتم لها كارهون } أي: إن شئتم تلقيها فزكوا نفوسكم وصفوا استعدادكم إن وهب لكم واتركوا إنكاركم حتى يظهر عليكم أثر نور الإرادة فتقبلوها إن شاء الله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلَّذِينَ آمَنُواْ } بالله وفوضوا أمورهم كلها إليه { وَعَمِلُواْ ٱلصَّالِحَاتِ } المقربة لهم إلى جنابه { وَأَخْبَتُوۤاْ إِلَىٰ رَبِّهِمْ } أي: تضرعوا له مطمئنين خاشعين { أُوْلَـٰئِكَ } السعداء المقبولون الصالحون\n المصالحون الخاشعون المخبتون { أَصْحَابُ ٱلجَنَّةِ } التي هي دار السعداء { هُمْ فِيهَا خَالِدُونَ } [هود: 23] دائمون مطمئنون متمكنون لا خوف عليهم ولا هم يحزنون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو تابوا { إلى ربهم أولئك اصحابُ الجنة هم فيها خالدون } دائمون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:54",
      "similarity": 0.8902616376095301
    },
    {
      "verse": "22:34",
      "similarity": 0.5196116554097867
    },
    {
      "verse": "2:82",
      "similarity": 0.19771570604733882
    },
    {
      "verse": "46:14",
      "similarity": 0.15713712078125702
    },
    {
      "verse": "7:42",
      "similarity": 0.14174623488163413
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/11:23.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/11:23.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/11:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}