{
  "chapter": "هود",
  "text": "قال يقوم ارءيتم ان كنت على بينة من ربى وءاتىنى رحمة من عنده فعميت عليكم انلزمكموها وانتم لها كرهون",
  "translations": [
    {
      "translation": "He said, 'My people! What do you think? If I were to have clear evidence from my Lord and He had given",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people, think. If I have a clear proof from my Lord, and He has bestowed on me His grace, though unknown to you, can we force it upon you when you are averse?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said: 'My people! If I base myself on a clear evidence from my Lord, and I have also been blessed by His mercy to which you have been blind, how can we force it upon you despite your aversion to it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah replied, \"My people do you think - that if my Lord has sent me a miracle and granted me mercy but your ignorance has obscured them from your sight - we can force you to believe when you do not want to?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O my people! What is your opinion – if I am on a clear proof from my Lord and He has bestowed mercy upon me from Him, so you remained blind towards it; shall we force it upon you although you dislike it?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people! Tell me, if I have a clear proof from my Lord, and a mercy (prophethood) has come to me from Him, but that (mercy) has been obscured from your sight. Shall we compel you (to accept) it when you have a strong hatred for it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my people! tell me if I have with me clear proof from my Lord, and He has granted me mercy from Himself and it has been made obscure to you; shall we constrain you to (accept) it while you are averse from it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'O my people, what think you? If I stand upon a clear sign from my Lord, and He has given me mercy from Him, and it has been obscured for you, shall we compel you to it while you are averse to it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my people! Bethink you, if I rely on a clear proof from my Lord and there hath come unto me a mercy from His presence, and it hath been made obscure to you, can we compel you to accept it when ye are averse thereto?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"O my people, tell me: if I have clear evidence from my Lord and He has favoured me with grace from Himself, which you have been unable to recognize, can we force it on you against your will?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: bethink ye, O my people! if I rested upon an evidence from my Lord, and a mercy hath come unto me from Him, and that hath been obscured unto you, Shall we make you adhere to it while ye are averse thereto?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘O my people! Tell me, should I stand on a manifest proof from my Lord, and He has granted me His own mercy—though it should be invisible to you—shall we force it upon you while you are averse to it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people! See ye if (it be that) I have a Clear Sign from my Lord, and that He hath sent Mercy unto me from His own presence, but that the Mercy hath been obscured from your sight? shall we compel you to accept it when ye are averse to it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people! Tell me, if I have a clear proof from my Lord, and a Mercy (Prophethood, etc.) has come to me from Him, but that (Mercy) has been obscured from your sight. Shall we compel you to accept it (Islamic Monotheism) when you have a strong hatred for it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'What do you think my nation! If I have a clear proof from my Lord and He has given me mercy from Him, though it is hidden from you, can wecompel you to accept it when you hate it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O my people, Have you considered? If I stand on clear evidence from my Lord, and He has given me a mercy from Himself, but you were blind to it, can we compel you to accept it, even though you dislike it?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"O my people have you considered: if I should be upon clear evidence from my Lord while He has given me mercy from Himself but it has been made unapparent to you, should we force it upon you while you are averse to it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:28] He said, ‘O my people, have you considered: — inform me — if I am [acting] upon a clear proof, a clear statement, from my Lord and He has given me mercy — prophethood — from Him, and it has been   obscured, concealed, from you (‘amiyat, ‘obscured’, a variant reading has the passive ‘ummiyat), can we compel you to it, are we [able] to force you to accept it, while you are averse to it? We are not able to do that.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "229 (He said) Noah said: (0 my people! Bethink you, if I rely) if I am (on a clear proof from my Lord) on a clear exposition which has come down from my Lord (and there hath come unto me a mercy from His presence) He favoured me with prophethood and Islam, (and it hath been made obscure to you) and my prophethood and Islam have been made obscure to you, (can we compel you to accept it) can we inspire it or teach it to you (when ye are averse thereto) when you are deniers of it?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } نوح متحسراً آيساً منهم، قنوطاً عن إيمانهم بعدما سمع منهم ما سمع: { يٰقَوْمِ } أضافهم إلى نفسه بعد يأسه على مقتضى شفقة النبوة { أَرَأَيْتُمْ } أي: أخبروني { إِن كُنتُ } جئت لكم { عَلَىٰ بَيِّنَةٍ } واضحةٍ دالة على صدقي في دعواي نازلةٍ { مِّن رَّبِّيۤ } لتأييدي وتصديقي { وَ } مع ذلك { آتَانِي رَحْمَةً مِّنْ عِندِهِ } تفضلاً وامتناناً، مشعرة بنجاتتي وطهارتي وصدقي في قولي تذكيري { فَعُمِّيَتْ } أي: خفيت واشتبهت { عَلَيْكُمْ } الدلائل والشواهد مع وضوحها وسطوعها { أَنُلْزِمُكُمُوهَا } بها { وَ } الحال أنه { أَنتُمْ لَهَا كَارِهُونَ } [هود: 28] منكرون غير ملتفتين إليها، ولا متأملين فيها وفي إشاراتها ورموزها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:129",
      "similarity": 0.7085496804227542
    },
    {
      "verse": "17:13",
      "similarity": 0.5604686855591859
    },
    {
      "verse": "48:26",
      "similarity": 0.49855846817183613
    },
    {
      "verse": "25:77",
      "similarity": 0.2632546107408373
    },
    {
      "verse": "17:38",
      "similarity": 0.21506849384780802
    }
  ]
}