{
  "chapter": "هود",
  "text": "او۟لئك الذين خسروا۟ انفسهم وضل عنهم ما كانوا۟ يفترون",
  "translations": [
    {
      "translation": "Those are the people who have lost their own selves. What they invented has abandoned them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are verily those who exceeded themselves, and the (gods) they invented abandoned them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They caused utter loss to themselves, and all that they had invented failed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have lost their souls and their false deities will turn away from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who put their souls into ruin, and they lost all that they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who have lost their own selves, and that which they invented eluded them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have lost their souls, and what they forged is gone from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they that have lost their souls, and that they forged has gone astray from them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are they who have lost their souls, and that which they used to invent hath failed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is such as these who have ruined their souls, and that which they fabricated shall fail them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have lost their souls, and hath strayed from them that which they have been fabricating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who have ruined their souls, and what they used to fabricate has forsaken them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who have lost their own souls: and the (fancies) they invented have left them in the lurch!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who have lost their ownselves, and their invented false deities will vanish from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they that have lost their souls, and that which they forged has left them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones who lost their souls, and what they had invented has strayed away from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones who will have lost themselves, and lost from them is what they used to invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:21] Such are they who have lost their souls, for their journey’s end shall be to the Fire, made everlasting for them; and that which they used to invent, [of lies] concerning God, in the way of claiming [that He has] a partner, has failed them, is absent [before them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such) the leaders (are they who have lost their souls) and their families and servants in Paradise and the other believers have inherited all, (and that which they used to invent) that which they used to worship falsely beside Allah (hath failed them) are void and preoccupied with themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { أُوْلَـٰئِكَ } المعزولون عن استماع كلمة الحق وإبصار علاماته هم { ٱلَّذِينَ خَسِرُوۤاْ أَنْفُسَهُمْ } بالافتراء على الله بما لا يليق بجنابه بإشراك مصنوعاته معه في استحقاق العبادة { وَ } مع ذلك { ضَلَّ } وغاب { عَنْهُمْ مَّا كَانُواْ يَفْتَرُونَ } [هود: 21] من الآلهة الباطلة، ولم يبقَ لهم سوى الندامة والخسران\n\n\n\n\nلذلك { لاَ جَرَمَ أَنَّهُمْ فِي ٱلآخِرَةِ هُمُ ٱلأَخْسَرُونَ } [هود: 22] المقصرون على الخسران والحرمان، ألا ذلك هو الخسران المبين!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك الذين خسروا أنفسَهم } حين اشتروا عبادة الأصنام بعبادة الله، { وضل عنهم ما كانوا يفترون } من أن الأصنام تشفع لهم، أو خسروا بما بدلوا وضاع عنهم ما أملوا، فلم يبق لهم سوى الحسرة والندامة",
      "translations": []
    }
  ]
}