{
  "chapter": "هود",
  "text": "مثل الفريقين كالاعمى والاصم والبصير والسميع هل يستويان مثلا افلا تذكرون",
  "translations": [
    {
      "translation": "The likeness of the two groups is that of the blind and deaf and the seeing and hearing. Are they the same as one another? So will you not pay heed?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The semblance of these two groups is that of a man who is deaf and blind, and the other who can hear and see. Can they be equal? Why do you not reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of the two parties is that one is blind and deaf, and the other capable of seeing and hearing. Can the two be equals? Will you, then, not heed?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can the two groups, the blind and the deaf, be considered equal to those who have vision and hearing? Will you then not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of the two groups is like one being blind and deaf, and the other seeing and hearing; are they equal in condition? So do you not ponder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of the two parties is as the blind and the deaf and the seer and the hearer. Are they equal when compared Will you not then take heed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of the two parties is as the blind and the deaf and the seeing and the hearing: are they equal in condition? Will you not then mind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of the two parties is as the man blind and deaf, and the man who sees and hears; are they equal in likeness? Will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The similitude of the two parties is as the blind and the deaf and the seer and the hearer. Are they equal in similitude? Will ye not then be admonished?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These two groups are like the blind and the deaf as compared with those who can see and hear. Can the two be equal? Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of the two parties is as the blind and deaf, and the seeing and hearing. Are the twain equal in likeness? Admonished are ye not then?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of the two parties is that of one who is blind and deaf and one who sees and hears. Are they equal in comparison? Will you not then take admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These two kinds (of men) may be compared to the blind and deaf, and those who can see and hear well. Are they equal when compared? Will ye not then take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of the two parties is as the blind and the deaf and the seer and the hearer. Are they equal when compared? Will you not then take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of the two parties is as one who is blind and deaf, and one that sees and hears, are they equally alike, will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of the two groups is that of the blind and the deaf, and the seeing and the hearing. Are they equal in comparison? Will you not reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of the two parties is like the blind and deaf, and the seeing and hearing. Are they equal in comparison? Then, will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:24] The likeness, the description, of the two parties, the disbelievers and the believers, is as the blind and the deaf, this being the likeness of the disbeliever, and the one who sees and the one who hears, this being the likeness of the believer, are they equal in likeness? No! Will you not then remember? (tadhakkarūn: the original tā’ [of tatadhakkarūn] has been assimilated with the dhāl) [will you not then] be admonished?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nبعد أن تبين الاختلاف بين حال المشركين المفترين على الله كذباً وبين حال الذين آمنوا وعملوا الصالحات في منازل الآخرة أعقب ببيان التنظير بين حالي الفريقين المشركين والمؤمنين بطريقة تمثيل ما تستحقه من ذم ومدح .فالجملة فذلكة للكلام وتحصيل له وللتحذير من مواقعة سببه .والمَثل ، بالتحريك : الحالة والصفة كما في قوله تعالى : { مثَل الجنة التي وعد المتقون } الآية من سورة \\[ الرعد : 35 \\] ، أي حالة الفريقين المشركين والمؤمنين تشبه حال الأعمى الأصم من جهة وحال البصير السميع من الجهة الأخرى ، فالكلام تشبيه وليس استعارة لوجود كاف التشبيه وهو أيضاً تشبيه مفرد لا مركب .والفريقان هما المعهودان في الذكر في هذا الكلام ، وهما فريق المشركين وفريق المؤمنين ، إذ قد سبَق ما يؤذن بهذين الفريقين من قوله : { ومن أظلم ممن افترى على الله كذباً } \\[ هود : 18 \\]. ثم قوله : { إنّ الذين آمنوا وعملوا الصالحات وأخبتوا إلى ربهم } \\[ هود : 23 \\] الآية .والفريق : الجماعة التي تفارق ، أي يخالف حالها حال جماعة أخرى في عمل أو نحلة . وتقدم عند قوله تعالى : { فأيّ الفريقين أحق بالأمن إن كنتم تعلمون } في سورة \\[ الأنعام : 81 \\].شبه حال فريق الكفار في عدم الانتفاع بالنظر في دلائل وحدانية الله الواضحة من مخلوقاته بحال الأعمى ، وشبهوا في عدم الانتفاع بأدلة القرآن بحال من هو أصم .وشبه حال فريق المؤمنين في ضد ذلك بحال من كان سليم البصر ، سليم السمع فهو في هدى ويقين من مدركاته .وترتيب الحالين المشبه بهما في الذكر على ترتيب ذكر الفريقين فيما تقدم ينبىء بالمراد من كل فريق على طريقة النشر المرتب . والترتيب في اللف والنشر هو الأصل والغالب .وقد علم أن المشبهين بالأعمى والأصم هم الفريق المقول فيهم { ما كانوا يستطيعون السمع وما كانوا يبصرون } \\[ هود : 20 \\].والواو في قوله : { والأصَم } للعطف على { الأعمى } عطف أحد المشبهين على الآخر . وكذلك الواو في قوله : { والسميع } للعطف على { البصير }.وأما الواو في قوله : { والبصير } فهي لعطف التشبيه الثاني على الأول ، وهو النشر بعد اللف . فهي لعطف أحد الفريقين على الآخر ، والعطف بها للتقسيم والقرينة واضحة .وقد يظن الناظر أن المناسب ترك عطف صفة { الأصم } على صفة { الأعمى } كما لم يعطف نظيراهما في قوله تعالى : { صُمٌ بُكْمٌ عُمْيٌ } في سورة \\[ البقرة : 18 \\] ظناً بأن مورد الآيتين سواء في أن المراد تشبيه من جمعوا بين الصفتين . وذلك أحد وجهين ذكرهما صاحب الكشاف . وقد أجاب أصحاب حواشي الكشاف بأن العطف مبني على تنزيل تغاير الصفات منزلة تغاير الذوات . ولم يذكروا لهذا التنزيل نكتة ولعلهم أرادوا أنه مجرد استمال في الكلام كقول ابن زيابةيا لهف زيابة للحارب ال ... صابح فالغانم فالآيبوالوجه عندي في الداعي إلى عطف صفة الأصم } على صفة { الأعمى } أنه ملحوظ فيه أن لفريق الكفار حالين كل حال منهما جدير بتشبيهه بصفة من تينك الصفتين على حدة ، فهم يُشبهون الأعمى في عدم الاهتداء إلى الدلائل التي طريق إدراكها البصر ، ويُشْبهون الأصم في عدم فهم المواعظ النافعة التي طريق فهمها السمع ، فهم في حالتيْن كلُّ حال منهما مشبّه به ، ففي قوله تعالى : { كالأعمى والأصم } تشبيهان مُفرقان كقول امرىء القيس: ... كأنّ قلوب الطير رطباً ويابساًلدى وكرها العُنّاب والحشف البالي ... والذي في الآية تشبيه معقولين بمحسوسين ، واعتبار كل حال من حالي فريق الكفار لا محيد عنه لأن حصول أحد الحالين كاف في جر الضلال إليهم بله اجتماعِهما ، إذ المشبّه بهما أمر عدمي فهو في قوة المنفي .وأما الدّاعي إلى العطف في صفتي { البصير والسّميع } بالنسبة لحال فريق المؤمنين فبخلاف ما قررنا في حال فريق الكافرين لأن حال المؤمنين تشبه حالة مجموع صفتي { البصير السميع } ، إذ الإهتداء يحصل بمجموع الصفتين فلو ثبتت إحدى الصفتين وانتفت الأخرى لم يحصل الاهتداء إذ الأمران المشبه بهما أمران وجوديان ، فهما في قوة الإثبات؛ فتعين أن الكون الداعي إلى عطف { السميع } على { البصير } في تشبيه حال فريق المؤمنين هو المزاوجة في العبارة لتكون العبارة عن حال المؤمنين مماثلة للعبارة عن حال الكافرين في سياق الكلام ، والمزاوجةُ من محسنات الكلام ومرجعها إلى فصاحته .وجملة { هل يستويان مثلاً } واقعة موقع البيان للغرض من التشبيه وهو نفي استواء حالهما ، ونفي الاستواء كناية عن التفضيل والمفضل منهما معلوم من المقام ، أي معلوم تفضيل الفريق الممثل بالسميع والبصير على الفريق الممثل بالأعمى والأصم . والاستفهام إنكاري .وانتصب { مثلاً } على التمييز ، أي من جهة حالهما ، والمثل : الحال .والمقصود تنبيه المشركين لما هم فيه من الضلالة لعلهم يتداركون أمرهم فلذلك فرع عليه بالفاء جملةُ { أفلا تذكرون }.والهمزة استفهام وإنكار انتفاء تذكرهم واستمرارهم في ضلالهم .وقرأ الجمهور «تذّكرون» بتشديد الدال . وأصله تتذكرون ، فقلبت التاء دَالاً لِقرب مخرجيهما وليتأتّى الإدْغام تخفيفاً . وقرأه حفص ، وحمزة ، والكسائي بتخفيف الذال على حذف إحدى التاءين من أول الفعل .وفي مقابلة { الأعمى والأصم } ب { البصير والسميع } محسن الطباق .\n\n",
      "translations": [
        {
          "translation": "(The similitude of the two parties) the believer and the disbeliever (is as the blind and the deaf) He says: the disbeliever is like the blind person: he does not see the Truth or guidance, and he is also like the deaf person: he does not hear the Truth or guidance (and the seer and the hearer) Allah says: and the believer is like the seer, for he sees the Truth and guidance, just as he is like the hearer, for he hears the Truth and guidance. (Are they equal in similitude?) He says: are the believer and disbeliever equal in obedience and reward (Will ye not then be admonished?) will you not be admonished by the similes of the Qur'an such that you believe?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَثَلُ ٱلْفَرِيقَيْنِ } أي: المؤمن والكافر في السعادة والشقاوة والهداية والضلال { كَٱلأَعْمَىٰ وَٱلأَصَمِّ وَٱلْبَصِيرِ وَٱلسَّمِيعِ } كل مع نقيضتها { هَلْ يَسْتَوِيَانِ } كل من النقيضين { مَثَلاً } أيها العقلاء { أَفَلاَ تَذَكَّرُونَ } [هود: 24] التفاوت والتفاضل حتى تتنبهوا وتتفطنوا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { مَثَلُ الفريقين } المتقدمين فريق الكافر وفريق المؤمن: { كالأعمى والأصمّ والبصير والسميع } \n فمثل الكافر كمن جمع بين العمى والصمم\n ومثل المؤمن كمن جمع بين السمع والبصر\n فالواو لعطف الصفات\n ويجوز أن يكون شبه الكافر بمن هو أعمى فقط\n وبمن هو أصم فقط والمؤمن بضدهما\n فهو تمثيل للكافرين بمثالين\n قاله ابن جزي\n وقال البيضاوي: يجوز أن يراد به تشبيه الكافر بالأعمى لتعاميه عن آيات الله\n وبالأصم لتصاممه عن استماع كلام الله\n وتأبيه عن تدبره معانيه\n أو تشبيه المؤمن بالسميع والبصير لأن أمره بالضد\n فيكون كل منهما مشّبهاً باثنين باعتبار وصفين\n أو تشبيه الكافر بالجامع بين العمى والصمم\n والمؤمن بالجامع بين ضديهما\n والعاطف لعطف الصفة على الصفة\n كقوله: فالأيب الصَّابُح فالغانم\n فهذا من بيان اللف والطباق\n\nهـ\n { هل يستويان }: هل يستوي الفريقان؟ { مثلاً } أي: جهة التمثيل\n بل لا استواء بينهما\n { أفلا تذكرون } تتعظون بضرب الأمثال فترجعون عن غيكم\n  الإشارة: كل من ترامى على مراتب الرجال\n أو ادعى مقاماً من المقامات وهو لم يدركه\n يريد بذلك إمالة وجوه الناس إليه\n يُفضح يوم القيامة على رؤوس الأشهاد\n ويقال له: { هؤلاء الذين كَذَبوا على ربهم\n\n\n } الآية\n فكل آية في الكفار تجر ذيلها على عُصاة المؤمنين\n وقد تقدم أمارات من كان على بينة من ربه\n فمن ادعى مقاماً من تلك المقامات وهو يعلم أنه لم يصله نادى عليه الآية\n ثم شرع في ذكر قصص الأنبياء ـ عليهم السلام ـ تسلية لنبيه صلى الله عليه وسلم وتتميماً لقوله: لعلك تارك\n وضائق\n فقال: { وَلَقَدْ أَرْسَلْنَا نُوحاً إِلَىٰ قَوْمِهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:40",
      "similarity": 0.7411996090881853
    },
    {
      "verse": "47:23",
      "similarity": 0.7089291846984065
    },
    {
      "verse": "5:71",
      "similarity": 0.6527031960739321
    },
    {
      "verse": "25:73",
      "similarity": 0.5760076976560526
    },
    {
      "verse": "10:42",
      "similarity": 0.5714387369343092
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}