{
  "chapter": "هود",
  "text": "ويصنع الفلك وكلما مر عليه ملا من قومه سخروا۟ منه قال ان تسخروا۟ منا فانا نسخر منكم كما تسخرون",
  "translations": [
    {
      "translation": "He began to build the Ark and every time some nobles of his people passed him by, they ridiculed him. He said, 'Though you ridicule us now, we will certainly ridicule you as you do us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he built the ark; and when groups of his people passed by him, they scoffed at him. He said to them: \"Though you laugh at us (now), we shall laugh at you, as you are laughing at us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As Noah was building the Ark, whenever the leading men of his nation passed by him, they would scoff at him. He said: 'If you scoff at us, we too scoff at you in like manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Noah) started to build the Ark but whenever some of his people passed by, they would mock him. He in return would reply, \"Mock us, but just as you mock us, we, too, will mock you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Nooh builds the ship; and whenever the chiefs of his people passed by him, they used to laugh at him; he said, “If you laugh at us, then a time will come when we will laugh at you just as you laugh.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as he was constructing the ship, whenever the chiefs of his people passed by him, they mocked at him. He said: \"If you mock at us, so do we mock at you likewise for your mocking.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he began to make the ark; and whenever the chiefs from among his people passed by him they laughed at him. He said: If you laugh at us, surely we too laugh at you as you laugh (at us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he was making the Ark; and whenever a council of his people passed by him they scoffed at him, He said, 'If you scoff at us, we shall surely scoff at you, as you scoff\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he was building the ship, and every time that chieftains of his people passed him, they made mock of him. He said: Though ye make mock of Us, yet We mock at you even as ye mock;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he began to build the Ark, and whenever leaders of his people passed by, they scoffed at him. He said, \"If you are scoffing at us, we shall scoff at you [and your ignorance], just as you scoff at us:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he was making the ark; and whenever the chiefs of his people passed by him, they scoffed at him. He said: if ye scoff at us, verily we also scoff at you even as ye scoff at us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As he was building the ark, whenever the elders of his people passed by him, they would ridicule him. He said, ‘If you ridicule us [today], we shall ridicule you [tomorrow] just as you ridicule us [now].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forthwith he (starts) constructing the Ark: Every time that the chiefs of his people passed by him, they threw ridicule on him. He said: \"If ye ridicule us now, we (in our turn) can look down on you with ridicule likewise!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as he was constructing the ship, whenever the chiefs of his people passed by him, they made a mockery of him. He said: \"If you mock at us, so do we mock at you likewise for your mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever an assembly of his nation passed by him as he was building the Ark, they mocked him. Whereupon he said: 'If you mock us, we shall indeedmock you, just as you mock.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As he was building the ark, whenever some of his people passed by him, they ridiculed him. He said, “If you ridicule us, we will ridicule you, just as you ridicule.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he constructed the ship, and whenever an assembly of the eminent of his people passed by him, they ridiculed him. He said, \"If you ridicule us, then we will ridicule you just as you ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:38] And he was building the Ark (yasna‘ is narrating a past state [in the present tense]) and whenever a council, a group, of his people passed him, they scoffed at him, mocked him. He said, ‘Though you scoff at us, yet we scoff at you, even as you scoff, when we are saved, while you drown;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جملة { واصنع الفلك } \\[ هود : 37 \\] ، أي أوحي إليه { اصنع الفلك } ، وصَنَع الفلك . وإنما عبر عن صنعه بصيغة المضارع لاستحضار الحالة لتخييل السامع أن نوحاً عليه السلام بصدد العمل ، كقوله : { والله الذي أرسل الرياح فتثير سحاباً } \\[ فاطر : 9 \\] وقوله : { يجادلنا في قوم لوطٍ } \\[ هود : 74 \\] وجملة { وكلما مر عليه ملأ } في موضع الحال من ضمير { يصنع }.و { كلّما } كلمة مركبة من ( كل ) و ( ما ) الظرفية المصدرية ، وانتصبت ( كل ) على الظرفية لأنها اكتسبت الظرفية بالإضافة إلى الظرف ، وهو متعلّق { سخروا } ، وهو جوابه من جهة أخرى . والمعنى : وسَخر منه ملأ من قومه في كل زمن مرورهم عليه .و ( لما ) في ( كلما ) من العموم مع الظرفية أشربت معنى الشرط مثل ( إذا ) فاحتاجت إلى جواب وهو { سَخروا منه }.وجملة { قال إن تسخروا منا } حكاية لما يجيب به سخريتهم ، أجريت على طريقة فعل القول إذا وقع في سياق المحاورة ، لأن جملة { سخروا } تتضمن أقوالاً تنبني عن سخريتهم أو تبين عن كلام في نفوسهم .وجمع الضمير في قوله : { مِنّا } يشير إلى أنهم يسخرون منه في عمل السفينة ومن الذين آمنوا به إذْ كانوا حَوله واثقين بأنه يعمل عَملاً عظيماً ، وكذلك جمعه في قوله : { فإنّا نسخر منكم }.والسخرية : الاستهزاء ، وهو تعجب باحتقار واستحماق . وتقدم عند قوله تعالى : { فحَاق بالذين سَخروا منهم } في أول سورة \\[ الأنعام : 10 \\] ، وفعلها يتعدى ب ( من ).وسخريتهم منه حمل فعله على العبث بناء على اعتقادهم أن ما يصنعه لا يأتي بتصديق مدعاه .وسخرية نوح عليه السلام والمؤمنين ، من الكافرين من سفه عقولهم وجهلهم بالله وصفاته . فالسخريتان مقترنتان في الزمن .وبذلك يتضح وجه التشبيه في قوله : { كما تسخرون } فهو تشبيه في السبب الباعث على السخرية ، وإن كان بين السببيْن بَون .ويجوز أن تجعل كاف التشبيه مفيدة معنى التعليل كالتي في قوله تعالى : { واذكروه كما هداكم } \\[ البقرة : 198 \\] فيفيد التفاوت بين السخريتين ، لأن السخرية المعللة أحق من الأخرى ، فالكفار سخروا من نوح عليه السلام لعمل يجهلون غايته ، ونوح عليه السّلام وأتباعه سخروا من الكفار لعلمهم بأنهم جاهلون في غرور ، كما دل عليه قوله : { فسوف تعلمون من يأتيه عذاب يخزيه } فهو تفريع على جملة { فإنّا نسخر منكم } أي سيظهر مَن هو الأحق بأن يسخر منه .\n\n",
      "translations": [
        {
          "translation": "(And he was building the ship) and he started to construct the ship, (and every time that chieftains of his people passed him, they made mock of him) they derided him for so doing. (He said: Though ye make mock of us) today, (yet we mock at you) after today (even as ye mock) us now;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويصنع الفلك } إلى آخره\n تفسيره على ما دل عليه الظاهر حق يجب الإيمان به وصدق لا بدّ من تصديقه كما جاء في التواريخ من بيان قصة الطوفان وزمانه وكيفيته وكميته\n وأما التأويل فمحتمل بأن يؤوّل الفلك بشريعة نوح التي نجا بها هو ومن آمن معه من قومه كما قال النبي عليه الصلاة والسلام:\n \" مثل أهل بيتي مثل سفينة نوح\n من ركب فيها نجا ومن تخلّف عنها غرق \" \nوالطوفان باستيلاء بحر الهيولى وإهلاك من لم يتجرّد عنها بمتابعة نبيّ وتزكية نفس كما جاء في كلام إدريس النبيّ عليه السلام ومخاطباته لنفسه ما معناه: إنّ هذه الدنيا بحر مملوء ماء فإن اتخذت سفينة تركبها عند خراب البدن نجوت منها إلى عالمك وإلا غرقت فيها وهلكت\n فعلى هذا يكون معنى ويصنع الفلك يتخذ شريعة من ألواح الأعمال الصالحة ودسر العلوم التي تنظم بها الأعمال وتحكم\n { وكلما مرّ عليه ملأ من قومه سخروا منه } كما ترى من عادة الشطّار وذوي الخلاعة المشتهرين بالإباحة يستهزئون بالمتشرّعين والمتقيدين بقيودها { قال إن تسخروا منا } بجهلكم { فإنّا نسخر منكم } عند ظهور وخامة عاقبة كفركم واحتجابكم { كما تسخرون فسوف تعلمون } عند ذلك { من يأتيه عذابٌ يخزيه } في الدنيا من هلاك وموت أو مرض وضرّ أو شدة وفقر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بدما أوصاه الحق وأمره\n شرع { يَصْنَعُ ٱلْفُلْكَ } بتعليم جبرائيل عليه السلام إياه بإذن الله { وَ } كان { كُلَّمَا مَرَّ عَلَيْهِ مَلأٌ } طائف { مِّن قَوْمِهِ } حين اشتغل بالفلك { سَخِرُواْ مِنْهُ } واسهزءوا به\n لكونه في باديةٍ لا ماء فيها\n وقالوا على سبيل التهكم: صرت نجاراً بعدما كنت نبياً { قَالَ } لهم نوح المكشوف عنده مآل ما أمر الحق له: { إِن تَسْخَرُواْ مِنَّا } الآن لجهلكم بسر صنيعنا { } فَإِنَّا نَسْخَرُ مِنكُمْ حين كنا على الفكل وأنتم غرقى { كَمَا تَسْخَرُونَ } [هود: 38] اليوم منا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويصنعُ الفلكَ } \n حكي ما وقع بصيغة الحال استحضاراً لتلك الحال العجيبة\n { وكلمَّا مرَّ عليه ملأٌ }: جماعة { من قومه سَخرُوا منه }: استهزؤوا به: لأنه كان يعمل السفينة في برية بعيدة من الماء\n أو أن عزته تنفي صنعته\n فكان يضحكون منه\n ويقولون له: صرت نجاراً بعد أن كنت نبياً\n { قال } لهم: { إنْ تسخروا منا فإنا نسخرُ منكم كما تسخرون } \n فنسخر منكم حين يأخذكم في الدنيا الغرق\n وفي الآخرة الحرق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:41",
      "similarity": 0.4288759564060557
    },
    {
      "verse": "11:37",
      "similarity": 0.4193850445084989
    },
    {
      "verse": "26:129",
      "similarity": 0.3972782673948311
    },
    {
      "verse": "45:12",
      "similarity": 0.3951542566477726
    },
    {
      "verse": "14:32",
      "similarity": 0.3421765722408621
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}