{
  "chapter": "هود",
  "text": "قالوا۟ ينوح قد جدلتنا فاكثرت جدلنا فاتنا بما تعدنا ان كنت من الصدقين",
  "translations": [
    {
      "translation": "They said, 'Nuh, you have argued with us and argued much so bring us what you have promised us if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Noah, you have argued with us, and disputed at length; so bring that (retribution) you promise, if you speak the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'O Noah! Surely you have disputed with us and have prolonged your dispute. Now bring upon us the chastisement that you threaten us with; do so, if you are truthful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Noah, you have argued with us a great deal. Bring down on us whatever torment with which you have been threatening us if what you say is true\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Nooh, you have disputed with us and disputed in the extreme, therefore bring upon us what you promise us, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Nuh! You have disputed with us, and much have you prolonged the dispute with us, now bring upon us what you threaten us with, if you are of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Nuh! indeed you have disputed with us and lengthened dispute with us, therefore bring to us what you threaten us with, if you are of the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Noah, thou hast disputed with us and make much disputation with us. Then bring us that thou promisest us, if thou speakest truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Noah! Thou hast disputed with us and multiplied disputation with us; now bring upon us that wherewith thou threatenest us, if thou art of the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah,\" they replied, \"you have argued with us, and argued to excess. Now bring down upon us what you threaten us with, if you speak the truth!?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Nuh! surely thou hast disputed with us and hath multiplied the disputation with us; now bring us that wherewith thou threatenest us, if thou be of the truth-tellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O Noah, you have disputed with us already, and you have disputed with us exceedingly. Now bring us what you threaten us with, should you be truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Noah! thou hast disputed with us, and (much) hast thou prolonged the dispute with us: now bring upon us what thou threatenest us with, if thou speakest the truth!?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Nuh (Noah)! You have disputed with us and much have you prolonged the dispute with us, now bring upon us what you threaten us with, if you are of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'O Noah, you have disputed, and disputed too much, with us. Bring (down) upon us that which you promised us, if what you say is true'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Noah, you have argued with us, and argued a great deal. Now bring upon us what you threaten us with, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O Noah, you have disputed us and been frequent in dispute of us. So bring us what you threaten us, if you should be of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:32] They said, ‘O Noah, you have disputed with us and disputed with us at length, so bring upon us that wherewith you are threatening us, in the way of chastisement, if you are of the truthful’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Noah! Thou hast disputed with us) you have argued with us and called us to follow a religion other than that of our forefathers (and multiplied disputation with us) and dwelt at length in arguing with us and inviting us to your religion; (now bring upon Us that where with thou threatenest us) of chastisement, (if thou art of the Truthful) that it will befall us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعوا من نوح عليه السلام ما سمعوا { قَالُواْ } من فرط عتوهم وعنادهم: { يٰنُوحُ } نادوه استهانة واسحتقاراً { قَدْ جَادَلْتَنَا } وخاصمتنا بالمقدمات الكاذبة الوهمية { فَأَكْثَرْتَ } علينا { جِدَالَنَا } وبالغت فيها وتماديت { فَأْتِنَا } أيها المكثر المفرط { بِمَا تَعِدُنَآ } من العذاب\n فإنا لن نؤمن بك { إِن كُنتَ مِنَ ٱلصَّادِقِينَ } [هود: 32] في دعواك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:68",
      "similarity": 0.5772807796389889
    },
    {
      "verse": "22:8",
      "similarity": 0.4844779783807836
    },
    {
      "verse": "16:111",
      "similarity": 0.4750662808706785
    },
    {
      "verse": "18:54",
      "similarity": 0.4574067809542923
    },
    {
      "verse": "4:109",
      "similarity": 0.42885723177617496
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}