{
  "chapter": "هود",
  "text": "ولا اقول لكم عندى خزائن الله ولا اعلم الغيب ولا اقول انى ملك ولا اقول للذين تزدرى اعينكم لن يؤتيهم الله خيرا الله اعلم بما فى انفسهم انى اذا لمن الظلمين",
  "translations": [
    {
      "translation": "I do not say to you that I possess the treasuries of Allah; nor do I know the Unseen; nor do I say that I am an angel; nor do I say to those who are vile in your eyes that Allah will not give them any good. Allah knows best what is in their hearts. If I did, I would certainly be one of the wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I say not that I have the treasures of God, or that I possess the knowledge of the unknown. I do not claim to be an angel, nor can I say that God will not bestow any good on those you disdain, for God is cognisant of what is in their hearts. If I say this, I will surely be unjust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not say to you that I possess Allah's treasures, nor that I have access to the realm beyond the ken of sense-perception, nor do I claim to be an angel. Nor do I say regarding those whom you look upon with disdain that Allah will not bestow any good upon them. Allah knows best what is in their hearts. Were I to say so I would be one of the wrongdoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not say that God's treasures belong to me, that I know the unseen, or that I am an angel. Nor do I say about those whom you disdain that God will not give them any reward. God knows best what is in their hearts, for then I would be unjust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I do not say to you, ‘I have the treasures of Allah’ nor that ‘I gain knowledge of the hidden’, nor do I say that, ‘I am an angel’ nor do I say to those whom your sights consider lowly, that Allah will never give them any good; Allah well knows what is in their hearts; if I do so, I would then be of the unjust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not say to you that with me are the treasures of Allah, nor that I know the Ghayb; nor do I say I am an angel, and I do not say of those whom your eyes look down upon that Allah will not bestow any good on them. Allah knows what is in their inner selves. In that case, I should, indeed be one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not say to you that I have the treasures of Allah and I do not know the unseen, nor do I say that I am an angel, nor do I say about those whom your eyes hold in mean estimation (that) Allah will never grant them (any) good-- Allah knows best what is in their souls-- for then most surely I should be of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not remember? I do not say to you, \"I possess the treasuries of God\"; I know not the Unseen; and I do not say, \"I am an angel.\" Nor do I say to those your eyes despise, \"God will not give them any good\"; God knows best what is in their hearts. 'Surely in that case I should be among the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I say not unto you: \"I have the treasures of Allah\" nor \"I have knowledge of the Unseen,\" nor say I: \"Lo! I am an angel!\" Nor say I unto those whom your eyes scorn that Allah will not give them good - Allah knoweth best what is in their hearts - Lo! then indeed I should be of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not say to you that I possess God's treasures, or that I have knowledge of the unseen, or that I am an angel. Nor do I say concerning those upon whom you look with contempt, that God will not bestow any good upon them -- God knows best what is in their hearts. If I did, I would certainly be one of the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I say not unto you that with me are the treasures of Allah, nor that I know the Unseen; nor I say, I am an angel. And say not of those whom your eyes condemn that Allah shall not bestow on them good - -Allah knoweth best that which is in theeir souls. Verily in that case would be of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not say to you that I possess the treasuries of Allah, neither do I know the Unseen. I do not claim to be an angel, neither do I say of those who are despicable in your eyes that Allah will not grant them any good—Allah knows best what is in their hearts—for then I would indeed be a wrongdoer.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I tell you not that with me are the treasures of Allah, nor do I know what is hidden, nor claim I to be an angel. Nor yet do I say, of those whom your eyes do despise that Allah will not grant them (all) that is good: Allah knoweth best what is in their souls: I should, if I did, indeed be a wrong-doer.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not say to you that with me are the Treasures of Allah, \"Nor that I know the Ghaib (unseen); \"nor do I say I am an angel, and I do not say of those whom your eyes look down upon that Allah will not bestow any good on them. Allah knows what is in their inner-selves (as regards belief, etc.). In that case, I should, indeed be one of the Zalimun (wrong-doers, oppressors, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not say to you that I possess the treasuries of Allah, and I do not know the unseen. I do not say I am an angel, nor do I say to those whom you despise, Allah will not give them any good. Allah knows best what is in their hearts. Indeed, if this were so then I would be amongst the harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I do not say to you that I possess the treasures of God, nor do I know the future, nor do I say that I am an angel. Nor do I say of those who are despicable in your eyes that God will never give them any good. God is Aware of what lies in their souls. If I did, I would be one of the wrongdoers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not tell you that I have the depositories [containing the provision] of Allah or that I know the unseen, nor do I tell you that I am an angel, nor do I say of those upon whom your eyes look down that Allah will never grant them any good. Allah is most knowing of what is within their souls. Indeed, I would then be among the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:31] And I do not say to you, “I possess the treasure houses of God” nor, “I have knowledge of the Unseen”; nor do I say, “I am an angel”, nay, I am human like you. Nor do I say to those whom your eyes scorn that God will not give them any good — God knows best what is in their souls, [in] their hearts. Lo! if I were to say this, then indeed I would be of the evildoers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(I say not unto you: \"I have the treasures of Allah\") I have the keys to Allah's stores of provision (nor \"I have knowledge of the Unseen\",) when the chastisement shall descend or that which is hidden from me (nor say I: \"Lo! I am an angel!\") from heaven. (Nor say I unto those whom your eyes scorn) those whom you belittle (that Allah will not give them good) that Allah will not favour them with genuine faith. (Allah knoweth best what is their hearts) of belief. (Lo! then indeed) if drive them away (I should be of the wrong-doers) I should be of those who harm themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتقولون في حقهم: ما نراك اتبعك إلا الذين هم أراذلنا بادي الرأي: { لَن يُؤْتِيَهُمُ } ويعطيهم { ٱللَّهُ خَيْراً } في الدنيا والأخرة\n إذ حالهم ومآلهم من الغيوب التي استأثر الله بها ولم يطلعني عليها\n إذ { ٱللَّهُ أَعْلَمُ بِمَا فِيۤ أَنْفُسِهِمْ } من الإخلاص والرضا\n وما لي علم بحالهم إلا بوحي الله وإلهامه\n ولم يوخ إليَّ شيء من أحوالهم\n وإن تفوهت عنهم وعن أحوالهم بلا وحي { إِنِّيۤ إِذاً لَّمِنَ ٱلظَّٰلِمِينَ } [هود: 31] المجترئين على الله في ادعاء الاطلاع على غيبه رجماً به\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: قال نوح لقومه: { ولا أقول لكم عندي خزائنُ الله } حتى أنفق منها متى شئت، فأستغني عن مباشرة الأسباب، بل ما أنا إلا بشر، أو لا أدعي ما ليس لي فتنكروا قولي، أي: لا أفوه لكم، ولا أتعاطى غير ما ألهمني الله له، فلست أقول: عندي خزائن الله، أي: القوة التي توجد بها الأشياء بعد عدمها. أو: عندي خزائن الله التي يتنزل منها الأشياء، كالريح والمياه ونحوها، كما قال تعالى\n[الحجر: 21] فتبرأ عليه السلام من هذه الدعوى. ثم قال: { ولا أعلمُ الغيبَ } أي: ولا أقول: إني أعلم الغيب، فأعلم من أصحابي ما يسترونه عني في نفوسهم، فسبيلي قبول ما ظهر منهم. أو: لا أعلم أنهم اتبعوني في بادي الرأي عن غير بصيرة وعقد قلب { ولا أقولُ إني ملكٌ } حتى تقولوا: ما نراك إلا بشراً مثلنا. { ولا اقول للذين تزدري أعينُكم } أي: تحتقرهم. من زريت على الرجل: قصرت به. قلبت تاؤه دالاً لتجانس الزاي للتاء، والمراد بهم ضعفاء المؤمنين، أي: لا أقول في شأن من احتقرتموهم، لفقرهم: { لن يُؤتهم الله خيراً } فإنَّ ما أعد الله لهم في الآخرة خير مما آتاكم في الدنيا. { والله اعلم بما في أنفسكم } من خير أو غيره، { إني إِذاً } أي: إن قلتُ شيئاً من ذلك، { لَمِنَ لظالمين }. قال البيضاوي: وإسناده إلى الأعين للمبالغة، والتنبيه على أنهم استرذلوهم بادي الرأي من غير روية، مما عاينوه من رثاثة حالهم، وقلة منالهم، دون تأمل في معانيهم وكمالاتهم. وقال أيضاً: وإنما استرذلوهم لفقرهم لأنهم لمَّا لم يعلموا إلا ظاهراً من الحياة الدنيا كان الأحظ بها أشرف عندهم، والمحروم منها أرذل. هـ. الإشارة: لا يشترط في وجود الخصوصية ظهور الكرامة فقد تظهر الكرامة على من لم تكمل له الاستقامة، فلا يشترط فيه الاطلاع على خزائن الغيوب، وإنما يشترط فيه التطهير من نقائص العيوب، لا يشترط فيه الإنفاق من الغيب، وإنما يشترط فيه الثقة بما ضمن له في الغيب. والله تعالى أعلم. ثم استعجلوا العذاب، كما قال تعالى: { قَالُواْ يٰنُوحُ قَدْ جَادَلْتَنَا فَأَكْثَرْتَ جِدَالَنَا }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:50",
      "similarity": 0.15545799421853385
    },
    {
      "verse": "15:21",
      "similarity": 0.1364826770207281
    },
    {
      "verse": "38:9",
      "similarity": 0.12645083973283328
    },
    {
      "verse": "12:55",
      "similarity": 0.12611544656523124
    },
    {
      "verse": "52:37",
      "similarity": 0.12593870789410866
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011031.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011031.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:31.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}