{
  "chapter": "هود",
  "text": "وان استغفروا۟ ربكم ثم توبوا۟ اليه يمتعكم متعا حسنا الى اجل مسمى ويؤت كل ذى فضل فضله وان تولوا۟ فانى اخاف عليكم عذاب يوم كبير",
  "translations": [
    {
      "translation": "And that you should seek His forgiveness and turn towards Him. He will bestow the best things of life on you for a time ordained, and favour those with blessings who are worthy of grace. But if you turn away, I fear the punishment of a terrible Day for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that you may seek forgiveness of your Lord and turn to Him in repentance whereupon He will grant you a fair enjoyment of life until an appointed term, and will bestow favour on everyone who merits favour. But should you turn away (from the truth), I fear for you the chastisement of an Awesome Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek forgiveness from your Lord and turn to Him in repentance for your sins. He will provide you good sustenance for an appointed time and will reward everyone according to his merits. I am afraid that you will suffer torment on the great Day (of Judgment) if you turn away (from God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And ask forgiveness from your Lord and incline towards Him in repentance, He will provide you excellent sustenance until the appointed time and will bestow superiority to every one who excels; and if you turn away, I then fear the punishment of the Great Day upon you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (commanding you): \"Seek the forgiveness of your Lord, and turn to Him in repentance, that He may grant you good enjoyment, for a term appointed, and bestow His abounding grace to every owner of grace. But if you turn away, then I fear for you the torment of a Great Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you that ask forgiveness of your Lord, then turn to Him; He will provide you with a goodly provision to an appointed term and bestow His grace on every one endowed with grace, and if you turn back, then surely I fear for you the chastisement of a great day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and: 'Ask forgiveness of your Lord, then repent to Him, and He will give you fair enjoyment unto a term stated, and He will give of His bounty to every man of grace. But if you should turn your backs I fear for you the chastisement of a mighty day;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (bidding you): Ask pardon of your Lord and turn to Him repentant. He will cause you to enjoy a fair estate until a time appointed. He giveth His bounty unto every bountiful one. But if ye turn away, lo! (then) I fear for you the retribution of an awful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek forgiveness from your Lord; then turn towards Him [in repentance]. He will make generous provision for you for an appointed term and will bestow His grace on all who merit it! But if you turn away, then I fear for you the torment of a dreadful Day:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that: ask forgiveness of your Lord, then repent toward Him, He will let you enjoy a goodly enjoyment until a term appointed and will vouchsafe unto every owner of grace His grace. And if ye turn away, verily I fear for you the torment of a Great Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Plead with your Lord for forgiveness, then turn to Him penitently. He will provide you with a good provision for a specified term and grant His grace to every meritorious person. But if you turn your backs [on Him], indeed I fear for you the punishment of a terrible day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And to preach thus), 'Seek ye the forgiveness of your Lord, and turn to Him in repentance; that He may grant you enjoyment, good (and true), for a term appointed, and bestow His abounding grace on all who abound in merit! But if ye turn away, then I fear for you the penalty of a great day:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (commanding you): \"Seek the forgiveness of your Lord, and turn to Him in repentance, that He may grant you good enjoyment, for a term appointed, and bestow His abounding Grace to every owner of grace (i.e. the one who helps and serves needy and deserving, physically and with his wealth, and even with good words). But if you turn away, then I fear for you the torment of a Great Day (i.e. the Day of Resurrection).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask forgiveness of your Lord and then repent to Him. He will give you enjoyment till a stated term and will give of His Bounty to those of grace. But if you turn away, I fear for you the punishment of a Mighty Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And ask your Lord for forgiveness, and repent to Him. He will provide you with good sustenance until a stated term, and will bestow His grace on every possessor of virtue. But if you turn away, then I fear for you the punishment of a grievous Day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [saying], \"Seek forgiveness of your Lord and repent to Him, [and] He will let you enjoy a good provision for a specified term and give every doer of favor his favor. But if you turn away, then indeed, I fear for you the punishment of a great Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:3] And [bidding you]: ‘Ask forgiveness of your Lord, for [your] idolatry, then repent, return, to Him, through [acts of] obedience, and He will give you, in this world, fair enjoyment, in the way of pleasant living and abundant provision, until a time appointed, namely, death, and He will give, in the Hereafter, every person of merit, in deed, [the due for] his merit, his reward. But if you turn away (tawallaw: one of the two tā’ letters [of tatawallaw] has been omitted), in other words, if you object, I fear for you the chastisement of an awful day, namely, the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (bidding you): Ask pardon of your Lord) declare the divine Oneness of your Lord (and turn to Him repentant) betake yourselves to Him sincerely and repentant. (He will cause you to enjoy) He will make you live (a fair estate) free of chastisement (until a time appointed) i.e. death. (He giveth His bounty) in Islam (unto every bountiful one) his reward in the Hereafter. (But if ye turn away) from faith and repentance, (Lo! (then) I fear for you) I know that you shall incur (the retribution of an awful) a tremendous (Day).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } حكم فيه أيضاً { أَنِ ٱسْتَغْفِرُواْ } واسترجعوا في فرطاتكم { رَبَّكُمْ } الذي أوجدكم على فطرة المعرفة والتوحيد { ثُمَّ تُوبُوۤاْ إِلَيْهِ } وتوصلوا به بعد رفع حجب الأنانية عن البين، وكشف سدل التعينات الوهمية عن العين { يُمَتِّعْكُمْ } بعد اضمحلال رسومكم وتلاشي هوياتكم في هويته بالرزق المعنوي والغذاء الحقيقي من عنده { مَّتَاعاً حَسَناً } على مقتضى نشأته وأوصافه وأسمائه وتطورات تجلياته الجمالية والجلالية { إِلَىٰ أَجَلٍ مُّسَمًّى } هو الطامة الكبرى التي انقهرت دونها توهمات الأظلال وتخيلات السوى والأغيار\n\n\n\n\n{ وَ } بعد تسييركم وتنزيلكم من عالم الغيب متنازلين إلى عالم الشهادة لاقتراف الحقائق والمعارف، وترجيعكم منها إليها متصادعين إظهاراً لقدرته وبسطته { يُؤْتِ كُلَّ ذِي فَضْلٍ } أي: لؤت ويعط كلاً من ذوي العناية الموفقين على الهداية التي جبلوا لأجلها { فَضْلَهُ } أي: حقه وجزاءه، أي: قبل منهم ما اكتسبوا من الحقائق والمعارف والمكاشفات والمشاهدات وأقرهم في النهاية على مقر نزولا منه في الهداية { وَ } قل لهم يا أكمل الرسل إمحاضاً للنصح: { إِن تَوَلَّوْاْ } وتعرضوا وتنصرفوا أيها المجبولون على التكليف عن مقتضى إنذاري وتبشيري { فَإِنِّيۤ } في غاية إشفاقي لكم وتحنني نحوكم { أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَبِيرٍ } [هود: 4] أي: نزول العذاب يوم العرض الأكبر الذي أشرقت فيه شمس الذات إلى حيث اضمحلت الأظلال والعكوس مطلقاً، ونودي من وراء سرادقات العز والجلال بلا تزاحكم الأظلال والأغيار:\n\nواجباً أيضاً من ورائها:\n\n[غافر: 16]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأن استغفروا ربكم }: عطف على \" ألا تعبدوا \" ، { ثم توبوا إليه } ثم توصلوا إلى مطلبكم بالتوبة فإن المعرض عن طريق الحق لا بد له من رجوع\n وقيل: استغفروا من الشرك، ثم توبوا إليه بالطاعة، ويجوز أن يكون \" ثم \": للتفاوت بين الأمرين\n هـ\n قال ابن جزي: { استغفروا ربكم } مما تقدم من الشرك والمعاصي، ثم ارجعوا إليه بالطاعة والاستقامة\nهـ\n وقال الواحدي: { استغفروا ربكم } من ذنوبكم السابقة، { ثم توبوا إليه } من المستأنفة متى وقعت\n هـ\n { يمتعكم متاعاً حسناً } يحييكم حياة طيبة بالأرزاق والنعم والخيرات، فتعيشوا في أمن ودعة\n { إلى أجل مسمَّى } تمام أجلكم، فلا يستأصلكم بالعذاب، أو يمتعكم بالرجاء فيه والرضا بقضائه لأن الكافر قد يمتع بالأرزاق في الدنيا استدراجاً، { ويُؤتِ } في الآخرة { كلَّ ذي فضلٍ } عمل صالحاً، { فضله } أي: جزاء فضله، فيُوفي ثوابه عمله، أو يعطي كل ذي فضل في دينه جزاء فضله في الدنيا والآخرة\n\n\nوهو وعد للمؤمن التائب بخير الدارين\n  { وإن تَولَّوا } أي: وإن تتولوا عما أمرتكم به، { فإني أخاف عليكم عذاب يوم كبير } يوم القيامة، أو يوم الشدة بالقحط والجوع، وقد نزل بهم حتى أكلوا الجيف",
      "translations": []
    }
  ]
}