{
  "chapter": "هود",
  "text": "ويقوم من ينصرنى من الله ان طردتهم افلا تذكرون",
  "translations": [
    {
      "translation": "My people! Who would help me against Allah if I did drive them away? So will you not pay heed?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, who will save me from God if I drive them away? Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people! Were I to drive the men of faith away, who will protect me from (the chastisement of) Allah? Do you not understand even this much?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, who would protect me against God if I were to drive these people away? Will you then not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And O my people! Who would rescue me from Allah if I repel them? So do you not think?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Who will help me against Allah, if I drove them away Will you not then give a thought\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! who will help me against Allah if I drive them away? Will you not then mind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, who would help me against God, if I drive you away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! who would deliver me from Allah if I thrust them away? Will ye not then reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, who would support  me against God if I were to drive them off? Will you not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My people! who will succour me against Allah, if I drave them away! Admonished are ye not then?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Who would come to my help against Allah were I to drive them away? Will you not then take admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! who would help me against Allah if I drove them away? Will ye not then take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Who will help me against Allah, if I drove them away? Will you not then give a thought?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were I to drive you away my nation, who would help me from Allah? Will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people! Who will support me against God, if I dismiss them? Will you not give a thought?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people, who would protect me from Allah if I drove them away? Then will you not be reminded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:30] And O my people, who would help, [who would] defend, me against God, that is, [against] His chastisement, if I drive them away?, in other words, there is none to help me. Will you not then remember? (tadhakkarūn: the original second tā’ [in tatadhakkarūn] has been assimilated with the dhāl), [will you not then] be admonished?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And, my people! who would deliver me) who would save me (from Allah) from Allah's chastisement (if I thrust them away) due to what you say? (Will ye not then reflect) will you not be admonished by what I say and hence believe?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَيٰقَوْمِ } المكابرين المعاندين في طلب طرد المؤمنين الموقنين { مَن يَنصُرُنِي } ويدفع عني { مِنَ } عذاب { ٱللَّهِ } وبطشه وانتقامه { إِن طَرَدتُّهُمْ } اتبغاء لمرضاتهم ومواساة لكم بلا إذن وارد من قبل الحق، ووحي نازل من عنده { أَفَلاَ تَذَكَّرُونَ } [هود: 30] أيها المجبولون على العقل المفاض، المستلزم للتوحيد والعرفان لينكشف الأمر عنكم، وتعرفوا وخامة عاقبة التماسكم طرد المؤمنين وتوفيقكم الإيمان عليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويا قوم من ينصرني من الله }: من يدفع انتقامه عني { إن طردتهم } وهم بتلك الصفة الكاملة من الإيمان والخوف منه؟ { أفلا تذكرون } فتعلموا أن التماس طردهم، وتوقيف الإيمان عليه ليس بصواب\n  الإشارة: قال القشيري: قوله تعالى: { لا أسألكم عليه مالاً } ، فيه تنبيه للعلماء ـ الذين هم ورثة الأنبياء أن يتأدبوا بأنبيائهم، وألا يطلبوا من الناس شيئاً في بث علومهم، ولا يرتفقوا منهم بتعليمهم، والتذكير لهم، وما ارتفق من المستمعين في بث فائدة يذكر بها من الدين، ويعظ بها المسلمين فلا يبارك الله فيما يُسمعون به عن الله، ولا ينتفعون به، ويحصلون به على سخط من الله\n هـ\n  قلت: هذا إن كان له تشوف وتطلع بذلك، بحيث لو لم يعط لم يُعلم، أو لم يُذكر\n وأما إن كان يعلم ويذكر لله، ثم يتصدق عليه لله، فلا بأس به إن شاء الله\n وما زالت الأشياخ والأولياء يقبضون زيارات الفقراء، وكل من يأتيهم ويذكرونهم ويعرفونهم بالله، لأن ذلك ربح للمعطي وتقريب له، وما ربح الناس إلا من فلسهم ونفسهم بذلوها لله، فأغناهم الله\n وقد تقدم عند قوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:114",
      "similarity": 0.9560136842597894
    },
    {
      "verse": "11:29",
      "similarity": 0.8203598593667142
    },
    {
      "verse": "6:52",
      "similarity": 0.7147933773367033
    },
    {
      "verse": "11:63",
      "similarity": 0.08566139654235415
    },
    {
      "verse": "5:51",
      "similarity": 0.08291790862255531
    }
  ]
}