{
  "chapter": "هود",
  "text": "ولا ينفعكم نصحى ان اردت ان انصح لكم ان كان الله يريد ان يغويكم هو ربكم واليه ترجعون",
  "translations": [
    {
      "translation": "My counsel will not benefit you, for all my desire to counsel you, if Allah desires to lead you into error. He is your Lord and you will return to Him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if I wish to advise you aright, my counsel will not profit you if God intend that you go astray, for He is your Lord and to Him you will return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If I want to give you good advice that will not profit you if Allah Himself has decided to let you go astray. He is your Lord, and to Him will you be returned.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My advice will be of no benefit to you if God wants to let you go astray. He is your Lord and to Him you will all return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And my advice will not benefit you if I wish you good, when Allah wills to keep you astray; He is your Lord and to Him you will return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my advice will not profit you, even if I wish to give you good counsel, if Allah's will is to keep you astray. He is your Lord! and to Him you shall return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if I intend to give you good advice, my advice will not profit you if Allah intended that He should leave you to go astray; He is your Lord, and to Him shall you be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my sincere counsel will not profit you, if I desire to counsel you sincerely, if God desires to pervert you; He is your Lord, and unto Him you shall be returned.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My counsel will not profit you if I were minded to advise you, if Allah's will is to keep you astray. He is your Lord and unto Him ye will be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My advice will not benefit you, no matter how sincerely I want to advise you, if God lets you go astray. He is your Lord and you will all return to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor would my good counsel profit you, even though I wished to give you good counsel, if Allah willed to keep you astray. He is your Lord, and unto Him ye shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My exhorting will not benefit you, much as I may seek to exhort you, if Allah desires to consign you to perversity. He is your Lord, and to Him you shall be brought back.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of no profit will be my counsel to you, much as I desire to give you (good) counsel, if it be that Allah willeth to leave you astray: He is your Lord! and to Him will ye return!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my advice will not profit you, even if I wish to give you good counsel, if Allah's Will is to keep you astray. He is your Lord! and to Him you shall return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor will my sincere counsel benefit you if I sincerely desire to counsel you if Allah desires to lead you astray. He is your Lord, and to Him you shall return'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“My advice will not benefit you, much as I may want to advise you, if God desires to confound you. He is your Lord, and to Him you will be returned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my advice will not benefit you - although I wished to advise you - If Allah should intend to put you in error. He is your Lord, and to Him you will be returned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:34] And my counsel will not benefit you if I desire to counsel you when God desires to keep you astray (the response to the conditional is indicated by wa-lā yanfa‘ukum nushī, ‘and my counsel will not benefit you’). He is your Lord and to Him you will be brought back’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(My counsel will not profit you) my invitation and warning to you from Allah's chastisement will not benefit you (if I were minded to advise you) if I were to warn you and call you to profess Allah's divine Oneness, (if Allah's will is to keep you astray) from guidance. (He is your lord) and has better right over you than me (and unto Him ye will be brought back) after death and He will reward you according to your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ يَنفَعُكُمْ } اليوم { نُصْحِيۤ } لئلا يلحقكم ما سيلحقكم حين حلول العذاب { إِنْ أَرَدْتُّ } وأحببت { أَنْ أَنصَحَ لَكُمْ } لأحفظكم { إِن كَانَ ٱللَّهُ يُرِيدُ أَن يُغْوِيَكُمْ } أي: لا ينفعكم نصحي اليوم إن تعلق إرادة الله ومشيئته في سابق علمه لإغوائكم\n بل { هُوَ رَبُّكُمْ } ومولي أموركم { وَإِلَيْهِ } لا إلى غيره من الأظلال { تُرْجَعُونَ } [هود: 34] في جميع أموركم وحلااتكم\n\n\nأتريد يا نوح نصحهم وإشفاقهم\n وهم لا يقبلون منك { أَمْ } بل { يَقُولُونَ ٱفْتَرَاهُ } أي: اختلقه من عنده ونسبه إلى الوحي ترويجاً { قُلْ } لهم حين قالوا لك هذه مجاراة عليهم ومماراة: { إِنِ ٱفْتَرَيْتُهُ } واختلفت ما جئت به { فَعَلَيَّ إِجْرَامِي } أي: وبال أمري ونكاله { وَ } الحال أنه { أَنَاْ بَرِيۤءٌ مِّمَّا تُجْرِمُونَ } [هود: 35] وتنسبون إلي من الجرائم\n\n\n{ وَ } بعدما بالغوا في العتو والفساد والإصرار على ماهم عليه من الجور والفساد { أُوحِيَ } وألهم { إِلَىٰ نُوحٍ } حين ظهر عليهم أمارات الإنكار\n ولاح علامات الاستخفاف والاستكبار { أَنَّهُ لَن يُؤْمِنَ } لك أبداً بعد هذا { مِن قَوْمِكَ إِلاَّ مَن قَدْ آمَنَ } لك قبل هذا\n فاقنط عن إيمانهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إن اردت }: شرط حذف جوابه لتقدم ما يدل عليه\n وكذا إن كان الله يريد أن يُغويكم\n والتقدير: إن كان يريد أن يغويكم لا ينفعكم نصحي إن أردت ان أنصح لكم\n أي: فكذلك\n فهو من تعليق الشرط\n كقولك: إن دخلتِ الدار\n إن كلمت زيداً\n فأنتِ طالق\n فلا تطلق إلا بهما\n ثم استأنف: هو ربكم\n  يقول الحق جل جلاله: { قالوا يا نوحُ قد جادلتنا }: خاصمتنا { فأكثرت جِدالنا }: خصامنا ومخاطبتنا\n { فأتِنا بما تَعِدُنا } من العذاب\n { إن كنتَ من الصادقين } في الدعوى والوعيد\n فإن مناظرتك ووعظك لا يؤثر فينا\n { قال } نوح عليه السلام: { إنما يأتيكم به الله } دوني { إن شاءَ } عاجلاً أو آجلاً\n { وما أنتم بمعجزين } بدفع العذاب عنكم\n أو الهرب منه حتى تعجزوا القدرة الإلهية\n { ولا ينفعكم نُصحي إن أردتُ أن أنصح لكم } \n وأراد الله { ان يُغويكم } \n فإن النصح مع سابق الشقاء عنت\n وهذا جواب لما أوهموا من أن جداله كلام لا طائل تحته\n وهو دليل على أن إرادة الله تعالى يصح تعلقها بالإغواء\n وأن خلا ف مراد الله تعالى محال\n ولذلك قيل: مراد الله من خلقه ما هم عليه\n ثم قال: { هو ربُكمْ } خالقكم والمتصرف فيكم وفق إرادته\n { وإليه تُرجعون } فيجازيكم على أعمالكم\n  الإشارة: ينبغي لأهل الوغظ والتذكير أن لا يملوا ـ ولو أكثروا ـ إذا قابلهم الناس بالبعدُ والإنكار\n وليقولوا: ولا ينفعكم نصحنا إن أردنا ان ننصحكم { إن كان الله يريد أن يُغويكم\n\n\n } الآية\n ولما كان المقصود من القصة تسلية رسوله صلى الله عليه وسلم خاطبه في أثنائها بقوله: { أَمْ يَقُولُونَ ٱفْتَرَاهُ قُلْ إِنِ ٱفْتَرَيْتُهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:62",
      "similarity": 0.6173429148629522
    },
    {
      "verse": "7:68",
      "similarity": 0.6132378561626364
    },
    {
      "verse": "7:21",
      "similarity": 0.5805211956838277
    },
    {
      "verse": "7:79",
      "similarity": 0.5544631231938151
    },
    {
      "verse": "12:11",
      "similarity": 0.5470228449077857
    }
  ]
}