{
  "chapter": "هود",
  "text": "واوحى الى نوح انه لن يؤمن من قومك الا من قد ءامن فلا تبتئس بما كانوا۟ يفعلون",
  "translations": [
    {
      "translation": "It was revealed to Nuh: 'None of your people are going to have iman except for those who already have iman, so do not be distressed at what they do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Noah was informed through revelation: \"Apart from those who have come to believe already not one of your people is going to believe. So grieve not for what they are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was revealed to Noah that no more of your people, other than those who already believe, will ever come to believe. So do not grieve over their deeds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was revealed to Noah that besides those who had already accepted his faith, no one from his people would ever believe him. He was told not to be disappointed about what his people had done,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was divinely revealed to Nooh that “None of your people will become Muslims, except those who have already accepted faith – therefore do not grieve at what they do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was revealed to Nuh: \"None of your people will believe except those who have believed already. So be not sad because of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was revealed to Nuh: That none of your people will believe except those who have already believed, therefore do not grieve at what they do:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was revealed to Noah, saying, 'None of thy people shall believe but he who has already believed; so be thou not distressed by that they may be doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was inspired in Noah, (saying): No-one of thy folk will believe save him who hath believed already. Be not distressed because of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God's will was revealed to Noah, \"No more of your people will believe in you than those who already believe; do not grieve, therefore, over what they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was revealed unto Nuh: verily none of thy people will believe save those that have believed already; so be not distressed for that which they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was revealed to Noah: ‘None of your people will believe except those who already have faith; so do not sorrow for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was revealed to Noah: \"None of thy people will believe except those who have believed already! So grieve no longer over their (evil) deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was inspired to Nuh (Noah): \"None of your people will believe except those who have believed already. So be not sad because of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was revealed to Noah: 'None of your nation will believe except whosoever has already believed. Do not distress yourself with what they may do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was revealed to Noah: “None of your people will believe, except those who have already believed, so do not grieve over what they do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was revealed to Noah that, \"No one will believe from your people except those who have already believed, so do not be distressed by what they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:36] And it was revealed to Noah that: ‘None of your people will believe except he who has already believed. Do not be distressed, grieved, because of what they do, in the way of idolatry. So, he [Noah] invoked God against them with the words: My Lord, leave not [one of the disbelievers] upon the earth [Q. 71:26]. God responded to this invocation of his and said:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "230 (And it was inspired in Noah, (saying): No one of thy folk will believe save him who hath believed already. Be not distressed) do not be saddened for their destruction (because of what they do) in their state of disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما بالغوا في العتو والفساد والإصرار على ماهم عليه من الجور والفساد { أُوحِيَ } وألهم { إِلَىٰ نُوحٍ } حين ظهر عليهم أمارات الإنكار، ولاح علامات الاستخفاف والاستكبار { أَنَّهُ لَن يُؤْمِنَ } لك أبداً بعد هذا { مِن قَوْمِكَ إِلاَّ مَن قَدْ آمَنَ } لك قبل هذا، فاقنط عن إيمانهم، ولا تجتهد في نصحهم وإهدائهم { فَلاَ تَبْتَئِسْ } ولا تغتم من إهلاكهم ونزول العذاب عليهم إنهم مهلكون { بِمَا كَانُواْ يَفْعَلُونَ } [هود: 36] من الإعراض والإنكار والعتو والاستكبار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وأوحي إلى نوح انه لم يؤمن من قومك } بعد هذا { إلا من قد آمن } قبل، وكان هذا الوحي بعد ان مكث فيهم ألف سنة إلا خمسين عاماً يدعوهم إلى الله تعالى: فكان الرجل منهم يأتيه بابنه، ويقول: يا بُني لا تصدق هذا الشيخ، فهكذا عَهد إليَّ أبي وجَدّي\n فلما نزل الوحي وأيس من إيمانهم دعا عليهم\n وقال له تعالى\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:25",
      "similarity": 0.4542985684724931
    },
    {
      "verse": "23:23",
      "similarity": 0.44662265762796904
    },
    {
      "verse": "26:105",
      "similarity": 0.42669958922007034
    },
    {
      "verse": "51:46",
      "similarity": 0.39267246521482485
    },
    {
      "verse": "37:79",
      "similarity": 0.38828392624914676
    }
  ]
}