{
  "chapter": "هود",
  "text": "حتى اذا جاء امرنا وفار التنور قلنا احمل فيها من كل زوجين اثنين واهلك الا من سبق عليه القول ومن ءامن وما ءامن معه الا قليل",
  "translations": [
    {
      "translation": "So when Our command came, and water bubbled up from the earth, We said, 'Load into it a pair of every species, and your family - except for those against whom the Word was preordained - and all who have iman.' But those who had iman with him were only few.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our command was issued and the waters gushed forth from the source, We said: \"Take into (the ark) a pair of every species, and members of your family other than those against whom the sentence has been passed already, and those who come to believe.\" But only a few believed in him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus it was until Our command came to pass and the oven boiled over. We said: 'Take into the Ark a pair of every species; and take your own family except those who have already been declared (as unworthy); and also take everyone who believes. But those who, along with him, had believed were indeed just a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When at last Our decree was fulfilled, water gushed forth from the Oven (in Noah's house). We told him to carry in the Ark a pair (male and female) from every species, his family - except those who were destined to perish - and the believers. No one believed in him, except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the extent that when Our command came and the oven overflowed, We said, “Board into the ship a couple – male and female – from every kind, and your family members, except those upon whom the Word has been passed*, and all other Muslims”; and only a few Muslims were with him. (* Whose fate has been sealed.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(So it was) till when Our command came and the oven gushed forth (water like fountains from the earth). We said: \"Embark therein, of each kind two (male and female), and your family -- except him against whom the Word has already gone forth -- and those who believe. And none believed with him, except a few.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when Our command came and water came forth from the valley, We said: Carry in it two of all things, a pair, and your own family-- except those against whom the word has already gone forth, and those who believe. And there believed not with him but a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when Our command came, and the Oven boiled, We said, 'Embark in it two of every kind, and thy family -- except for him against whom the word has already been spoken and whosoever believes.' And there believed not with him except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Thus it was) till, when Our commandment came to pass and the oven gushed forth water, We said: Load therein two of every kind, a pair (the male and female), and thy household, save him against whom the word hath gone forth already, and those who believe. And but a few were they who believed with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our command came, and water gushed forth in torrents, We said to Noah, \"Take into the Ark a pair from every species, and your own family -- except those on whom the sentence has already been passed, and all the true believers.\" But only a few believed along with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus were they employed until when Our decree came and the oven boiled over, We said: carry thereon of every kind two, and thy household except him thereof against whom the word hath already gone forth, and whosoever hath believed. And there had not believed with him save a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our edict came and the oven gushed [a stream of water], We said, ‘Carry in it a pair of every kind [of animal], along with your family—except those [of them] against whom the edict has already been given—and those who have faith.’ And none believed with him except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At length, behold! there came Our command, and the fountains of the earth gushed forth! We said: \"Embark therein, of each kind two, male and female, and your family - except those against whom the word has already gone forth,- and the Believers.\" but only a few believed with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(So it was) till then there came Our Command and the oven gushed forth (water like fountains from the earth). We said: \"Embark therein, of each kind two (male and female), and your family, except him against whom the Word has already gone forth, and those who believe. And none believed with him, except a few.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came and the oven gushed (forth with water), We said (to Noah): 'Take on board (the Ark) a pair from every species and yourfamily, except he of whom the word has already been spoken, and those who believe. And none except a few believed with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when Our command came, and the volcano erupted, We said, “Board into it a pair of every kind, and your family—except those against whom the sentence has already been passed—and those who have believed.” But those who believed with him were only a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[So it was], until when Our command came and the oven overflowed, We said, \"Load upon the ship of each [creature] two mates and your family, except those about whom the word has preceded, and [include] whoever has believed.\" But none had believed with him, except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:40] Such that when (hattā represents the objective for [the action of] ‘building’) Our command came, for their destruction, and the, baker’s, oven gushed forth, with water — this was the sign for Noah — We said, ‘Load therein, in the ship, of every kind, [of every] male and female, that is, of every species of these two, two, a male and a female (ithnayn constitutes the direct object). According to the story, God gathered for Noah all the beasts of prey and birds and other [animals]; he [Noah] would go through every species [to select them] with his hands, and his right hand would fall upon a male and the left upon a female, whereupon he would take them aboard the ship; and your family — that is, his wife and children — save those against whom the Word has already gone forth, from among them, that they be destroyed: this was his wife and his son Canaan, in contrast with Shem, Ham and Japheth, whom he took aboard together with their three wives, and those who believe’. And none but a few believed with him: it is said that these were six men and their wives; it is also said that the number of all those aboard the ship was eighty, half of whom were men and the other half, women.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Thus it was) till, when Our commandment) the appointed time for Our chastisement (came to pass and the oven gushed forth water) it is also said this means: and the dawn broke, (We said: Load therein) aboard the ship (two of every kind, a pair) a male and a female, (and thy household, save him against whom the word hath gone forth already) except the one upon him the word has already been enjoined, (and those who believe) and carry with you also those who believed. (And but a few were they who believed with him) 80 people in all.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ حَتَّىٰ إِذَا جَآءَ أَمْرُنَا } وجان أجلنا الذي أجلنا لمقتهم وهلاكهم { وَفَارَ } أي: نبع حينئذٍ { ٱلتَّنُّورُ } المعهود في حضرة علمنا\n نبع ماء الطوفان\n وبعد فوران التنور وغليانه وأطلعت عليه امرأته فأخبرته إياه { قُلْنَا } له تفضيلاً عليه وامتناناً: { ٱحْمِلْ فِيهَا } أي: في السفينة { مِن كُلٍّ زَوْجَيْنِ } أي: من جنس ما يعيش في الهواء { ٱثْنَيْنِ } ذكراً وأنثى { وَ } احمل أيضاً عليها { أَهْلَكَ } أي: جميع أهل بيتك { إِلاَّ مَن سَبَقَ عَلَيْهِ ٱلْقَوْلُ } منا في سابق قضائنا بأنه كان من الكفارين المغرقين { وَ } احمل أيضاً عليها { مَنْ آمَنَ } لك من قومك { وَ } الحال أنه { مَآ آمَنَ مَعَهُ } من قومه { إِلاَّ قَلِيلٌ } [هود: 40] قيل: كانوا تسعة وسبعين وزوجته السملمة وبنوه الثلاثة: سام وحام ويافث ونساؤهم\n واثنان وسبعون رجلاً من غيرهم\n\n\nروي أنه عليه لسلام أتم السفينة وكان طولها ثلاثمائة ذراع\n وعرضها خمسين\n وجعل لها ثلاثة بطون\n فحمل في أسفلها الدواب والوحوش\n وفي أوسطها الإنس\n وفي أعلاها الطير\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: حتى: غاية لقوله: ويصنع الفلك، أو ابتدائية\n واثنين مفعول باحمل، وأهلك: عطف عليه\n يقول الحق جل جلاله: { حتى إذا جاء أمرُنا } بغرقهم، أو أمرنا للأرض بالفوران وللسحاب بالإرسال، { وفار التنورُ } نبع الماء منه وارتفع كالقدر تفور\n والتنور: تنور الخبز، ابتدأ منه النبوع، على خرق العادة، أرادت ابنته أن تسجره ففار الماء في النار، رُوي أنه كان تنور آدم، خلص إلى نوح فكان يوقد فيه، وقيل: كان في الكوفة في موضع مسجدها\n وقيل: في الهند، وقيل: التنور: وجه الأرض\n قاله ابن عباس\n  فلما فار بالماء { قلنا احْمِلْ فيها } في السفينة، { من كل زوجين اثنين } من كل نوع من الحيوان ذكراُ وأنثى ـ رُوي أن نوحاً عليه السلام وقف على باب السفينة، وحشر إليه الوحوش، فكان الذكر يقع في يمينه، والأنثى في شماله، وهو يُدخل في السفينة\n وآخر ما دخل الحمار، فتمسك الشيطان بذنبه فزجره نوح فلم ينعق، فدخل معه، فجلس عند مؤخر السفينة\n ورُوي أن نوحاً عليه السلام آذاه نتن الزبل والعذرة، فأوحى الله إليه: أن امسح على ذنب الفيل، فخرج من انفه خنزير وخنزيرة، فكفياه أمر ذلك الأذى\n ورُوي أن الفأر آذى الناس فاوحى الله إليه: أن امسح على جبهة الأسد ففعل، فعطس فخرج منه هرٌّ وهرَّة\n فكفياه أمر الفأر\n انظر ابن عطية\n { و } احمل أيضاً { أهْلكَ } أي: امرأتك وبنيك ونساءهم، { إلا من سبقَ عليه القولُ }: أنه من المغرقين يريد: ابنه كنعان وأمه وَاعِلة، فإنهما كانا كافرين\n { و } احمل { من آمن } بك\n قال تعالى: { وما آمن معه إلا قليلٌ } ، قيل: كانوا تسعةَ وسبعين: زوجته المسلمة، وبنوه الثلاثة: حام وسام ويافث، ونساؤهم، واثنان وسبعون رجلاً وامرأة من غيرهم\n وفي بعض الآثار: أن النبي صلى الله عليه وسلم قال:\n\n \" سام أبو العرب، ويافث أبو الروم، وحام أبوالحبش \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:27",
      "similarity": 0.8148077821026735
    },
    {
      "verse": "3:125",
      "similarity": 0.3316880453079058
    },
    {
      "verse": "67:7",
      "similarity": 0.3021651948021297
    },
    {
      "verse": "13:3",
      "similarity": 0.09601873685343439
    },
    {
      "verse": "68:18",
      "similarity": 0.08795485432198005
    }
  ]
}