{
  "chapter": "هود",
  "text": "وقيل يارض ابلعى ماءك ويسماء اقلعى وغيض الماء وقضى الامر واستوت على الجودى وقيل بعدا للقوم الظلمين",
  "translations": [
    {
      "translation": "It was said, 'Earth, swallow up your water!' and, 'Heaven, hold back your rain!' And the water subsided and the affair was concluded and the Ark came to land on al-Judi. And it was said, 'Away with the people of the wrongdoers!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it was said: \"O earth, swallow back your water; and, O sky, desist.\" And the water subsided, and the decree was accomplished. The ark came to rest on Judi (Mount Ararat), and it was said: \"Away with the cursed people!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the command was given: 'Earth! Swallow up your water'; and: 'Heaven! Abate!' So the water subsided, the command was fulfilled, and the Ark settled on Mount Judi, and it was said: 'Away with the wrong-doing folk!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the earth was told to swallow-up its water and the sky was ordered to stop raining. The water abated and God's command had been fulfilled. The Ark came to rest on Mount Judi. A voice said, \"The unjust people are far away from the mercy of God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was commanded, “O earth, swallow your water and, O sky, stop” – and the water was dried up and the matter was completed – and the ship stopped upon the mount Al-Judi and it was said, “Away with the unjust nation!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said: \"O earth! Swallow up your water, and O sky! Withhold (your rain).\" And the water was made to subside and the decree was fulfilled. And it rested on (Mount) Judi, and it was said: \"Away with the people who are wrongdoing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said: O earth, swallow down your water, and O cloud, clear away; and the water was made to abate and the affair was decided, and the ark rested on the Judi, and it was said: Away with the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said, 'Earth, swallow thy waters; and, heaven, abate!' And the waters subsided, the affair was accomplished, and the Ark settled on El-Judi, and it was said: 'Away with the people of the evildoers!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said: O earth! Swallow thy water and, O sky! be cleared of clouds! And the water was made to subside. And the commandment was fulfilled. And it (the ship) came to rest upon (the mount) Al-Judi and it was said: A far removal for wrongdoing folk!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A voice cried out, \"Earth, swallow up your waters. O sky, cease your rain.\" The waters receded. The command was fulfilled. The Ark came to rest on Mount Judi. It was said, \"Away with the wrong-doing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said: O earth! swallow up thy water, and cease, O heaven! And the water abated; and fulfilled was the decree. And it rested upon the Judi; and it was said: away with the wrong-doing people!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it was said, ‘O earth, swallow your water! O sky, leave off!’ The waters receded; the edict was carried out, and it settled on [Mount] Judi. Then it was said, ‘Away with the wrongdoing lot!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the word went forth: \"O earth! swallow up thy water, and O sky! Withhold (thy rain)!\" and the water abated, and the matter was ended. The Ark rested on Mount Judi, and the word went forth: \"Away with those who do wrong!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said: \"O earth! Swallow up your water, and O sky! Withhold (your rain).\" And the water was diminished (made to subside) and the Decree (of Allah) was fulfilled (i.e. the destruction of the people of Nuh (Noah). And it (the ship) rested on Mount Judi, and it was said: \"Away with the people who are Zalimun (polytheists and wrong-doing)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said: 'Earth, swallow up your waters. Heaven, cease' The water subsided and the matter was accomplished. And the Ark came to rest upon (the mountain of) AlJudi, and it was said: 'Be gone, evildoing nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said, “O earth, swallow your waters,” and “O heaven, clear up.” And the waters receded, and the event was concluded, and it settled on Judi, and it was proclaimed: “Away with the wicked people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said, \"O earth, swallow your water, and O sky, withhold [your rain].\" And the water subsided, and the matter was accomplished, and the ship came to rest on the [mountain of] Judiyy. And it was said, \"Away with the wrongdoing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:44] And it was said, ‘O earth, swallow your waters, that have sprung forth from you — and it reabsorbed it [all] except for what came down from the sky and formed rivers and seas — and O heaven, abate!’, withhold the   rain, and it did. And the waters subsided, decreased. And the affair was accomplished, the matter of the destruction of Noah’s people was complete, and it settled, [and] the ship came to rest, upon al-Jūdī, a mountain in Mespotamia (al-jazīra), near Mosul; and it was said: ‘Away with — perish — the evildoing, the disbelieving, folk!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And it was said: earth! Swallow your water) dry your water (and, sky! be cleared of clouds!) stop your 231 rain! (And the water was made to subside. And the commandment was fulfilled) the destruction of those people was accomplished, i.e. those who were supposed to be destroyed were destroyed and those who were supposed to be saved were saved. (And it) the ship (came to rest upon (the mount) Al-Judi) a mountain in Nisibin in the land of Mosul (and it was said: A far removal) from Allah's mercy (for wrong-doing folk!) for the idolaters, the people of Noah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَغِيضَ ٱلْمَآءُ } معناهُ نَقَصَ وَقَلَّ\n\n\n\n\nوقوله تعالى: { وَٱسْتَوَتْ عَلَى ٱلْجُودِيِّ } وهو جبلٌ بَقُربِ المَوصِلِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And the water subsided\" - this means it became less and decreased.\n\n\nAnd His saying, {And you will find the highest mountain} - which is a mountain near the city of Mecca.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n المانعة للحياة الحقيقية { وقضى } أمر الله بإنجاء من نجا وإهلاك من هلك { واسْتَوت } أي: استقامت شريعته { على } جودي وجود نوح واستقرّت { وقيل بُعْداً } أي: هلاكاً { للقوم الظالمين } الذين كذّبوا بآيات الله وعبدوا الهوى مكان الحق ووضعوا طريق الطبيعة مكان الشريعة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما انبسط الماء على وجه الأرض\n وعلا على أعالي الجبال وأقلال الرواسي وهلك من عليها { قِيلَ } من وراء سرادقات العز والجلال منادياً آمراً على الأرض والسماء مثل النداء على ذوي العقول المكلفين المبادرين إلى امتثال الأوامر: { يٰأَرْضُ } النابعة للماء المخرجة له { ٱبْلَعِي مَآءَكِ } أي: انشقي ما نبع عنك من الماء { وَيٰسَمَآءُ } الماطرة الهامرة { أَقْلِعِي } وأمسكي ماءكم ولا تمطري\n إذ يمطر لماء مثلما نبع من الأرض { وَ } بعد ورود الأمر الإلهي { غِيضَ ٱلْمَآءُ } ونقص بنشف الأرض وإمساك السماء { وَقُضِيَ ٱلأَمْرُ } الموعود الذي هو إهلاك الكفار وإنجاء المؤمنين { وَ } بعد انقضاء المأمور وإنجاز الموعود { ٱسْتَوَتْ } السفينة واستقرت { عَلَى ٱلْجُودِيِّ } جبل بالموصل\n وقيل: بالشام\n وقيل: أو آمل\n\n\nروي أنه عليه السلام ركب السفينة عاشر رجب\n ونزل عليها عاشر المحرم\n فصام ذلك اليوم\n فصار سنة له على من بعده\n وهو يوم عاشوراء { وَ } بعد إهلاك ألئك العصاة الغواة الكفرة { قِيلَ } من قبل الحق: { بُعْداً } أي: مقتاً وهلاكاً { لِّلْقَوْمِ ٱلظَّالِمِينَ } [هود: 44] الخارجين عن مقتضى الوحي الإلهي\n المكذبين لرسله\n وطرداً لهم عن ساحة الحضور بحيث لا يرجى قربهم أصلاً\n\n\n{ وَ } بعدما وقع ما وقع { نَادَى } وناجى { نُوحٌ رَّبَّهُ } باثاً له شكواه في حق ابنه { فَقَالَ رَبِّ إِنَّ ٱبْنِي } أيضاً { مِنْ أَهْلِي } وأنتم بفضلك وعدتني بإنجاء أهلي { وَإِنَّ وَعْدَكَ } الذي به { ٱلْحَقُّ } الصدق لا خلف فيه { وَأَنتَ أَحْكَمُ ٱلْحَاكِمِينَ } [هود: 45] أي: أقسطهم وأعدلهم بأحكام جميع الحكام راجع إليك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: بعداً: منصوب على المصدر، أي: أبعَدوا بعداً. يقول الحق جل جلاله: { وقيل } أي: قال الله: { يا ارضُ ابلعي ماءك } الذي خرج منك، فانفتحت أفواهاً، فرجع إليها ما خرج منها، { ويا سماءُ أَقلعي }: أمسكي عن الإمطار. رُوي أنها أمطرت من كل موضع. فبقي ما نزل منها بحاراً على وجه الأرض.  قال البيضاوي: نوديا بما ينادى به أولو العلم، وأُمرا بما يؤمنون به، تمثيلاً لكمال قدرته، وانقيادهما لما يشاء تكوينه فيهما، بالأمر المطاع، الذي يأمر المنقاد لحكمه، المبادر إلى امتثال أمره، مهابة من عظمته، وخشية من أليم عقابه. والبلع: النشف، والإقلاع: الإمساك. هـ. { وغيض الماءُ } نقص ولم ينشف ما خرج منها، { وقُضِيَ الأمرُ }: وأنجز ما وعد من إهلاك الكافرين، وإنجاء المؤمنين، { واستوتْ }: استقرت السفينة { على الجُودي } جبل بالموصل. وقيل: بالشام. وتقدم أنه نزل يوم عاشوراء، فصامه شكراً. وبقي ستة أشهر على الماء. { وقيل بُعداً للقوم الظالمين } هلاكاً لهم. يقال بعد، إذا بعد بعداً بعيداً، بحيث لا يرجى عوده، ثم استعير للهلاك. وخص بدعاء السوء. والآية ـ كما ترى ـ في غاية الفصاحة لفخامة لفظها وحسن نظمها، والدلالة على كنه الحال مع الإيجاز الخالي عن الإخلال. وإيراد الأخبار على البناء للمفعول دلالة على تعظيم الفاعل، وأنه متعين في نفسه، مستغن عن ذكره، إذ لا يذهب الوهم إلى غيره للعلم به، فإن مثل هذه الأفعال لا يقدر عليها سوى الواحد القهار. قاله البيضاوي.  فإن قلت: قد عم الغرق الدنيا كلها، مع أن دعوة نوح عليه السلام لم تكن عامة، وقد قال تعالى:\n[الإسراء: 15]؟ فالجواب: أن الكفر قد كان عم الموجودين في ذلك الزمان، مع تمكنهم من النظر والاستدلال على الصانع وتوحيده، ومع قدرتهم على الإتيان إلى نوح في أمر الشرائع، فقصروا في الجهتين. وأيضاً: لم تكن الأرض كلها معمورة بالناس، فكل من كان موجوداً سمع بدعوة نوح فجحدها. والله تعالى أعلم. وانظر ابن عطية عند قوله: { واصنعِ الفلك }. والله تعالى أعلم. الإشارة: إذا توالت على القلب الواردات الإلهية السماوية، والأحوال النفسانية المزعجة، خيف على العقل الاختطاف والاصطدام، فقيل: يا أرض النفس ابلعي ماءك واسكني، ويا سماء الواردات أقلعي، وغيض الماء، أي: نقص هيجان الحال، وقضي الأمر بالاعتدال، واستوت سفينة الفكرة على جبل العقل، فحاز الشرف والكمال لكونه برزخاً بين بحرين، يعطي الحقيقة حقها والشريعة حقها، فيعطي كل ذي حق حقه، ويوفى كل ذي قسط قسطه. وقيل: بُعداً لمن تخلف عن هذا المقام، وظلم نفسه بإلقائها في سجن الهوى وغيهب الظلام. والله تعالى أعلم. ولمّا غرق كنعان مع من غرق، استفهم نوح عليه السلام ربه عن الوعد الذي وعده بإنجاء أهله، كما قال تعالى: { وَنَادَى نُوحٌ رَّبَّهُ فَقَالَ رَبِّ إِنَّ ٱبْنِي مِنْ أَهْلِي }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:8",
      "similarity": 0.27265212720187787
    },
    {
      "verse": "38:31",
      "similarity": 0.2150227495994474
    },
    {
      "verse": "16:65",
      "similarity": 0.01838838667385048
    },
    {
      "verse": "45:17",
      "similarity": 0.01785550620840218
    },
    {
      "verse": "29:63",
      "similarity": 0.017479034430803345
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/11:44.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/11:44.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:44.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}