{
  "chapter": "هود",
  "text": "وقال اركبوا۟ فيها بسم الله مجر۪ىها ومرسىها ان ربى لغفور رحيم",
  "translations": [
    {
      "translation": "He said, 'Embark in it. In the name of Allah be its voyage and its landing! Truly my Lord is Ever-Forgiving,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (Noah) said: \"Embark. In the name of God be its course and mooring. My Lord is surely forgiving and kind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said: ' Embark in it. In the name of Allah is its sailing and its anchorage. My Lord is Ever Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Noah) said, \"Embark in it. It will sail in the name of God, in His Name it will sail and in His Name it will cast anchor. My Lord is All-forgiving and All-merciful\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, “Board it – upon Allah’s name is its movement and its stopping; indeed my Lord is surely Oft Forgiving, Most Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: \"Embark therein: in the Name of Allah will be its (moving) course and its (resting) anchorage. Surely, my Lord is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: Embark in it, in the name of Allah be its sailing and its anchoring; most surely my Lord is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Embark in it! In God's Name shall be its course and its berthing. Surely my Lord is All-forgiving, All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: Embark therein! In the name of Allah be its course and its mooring. Lo! my Lord is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said, \"Embark on it. In the name of God, it shall set sail and cast anchor. Truly, my Lord is forgiving and merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: embark therein; in the name of Allah be its course and its anchorage, verily my Lord is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Board it: In the Name of Allah it shall set sail and cast anchor. Indeed my Lord is all-forgiving, all-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he said: \"Embark ye on the Ark, In the name of Allah, whether it move or be at rest! For my Lord is, be sure, Oft-Forgiving, Most Merciful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he [Nuh (Noah)] said: \"Embark therein, in the Name of Allah will be its moving course and its resting anchorage. Surely, my Lord is Oft-Forgiving, Most Merciful.\" (Tafsir At-Tabari, Vol. 12, Page 43)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Noah) said: 'Embark. In the Name of Allah will be its course and berthing. Indeed, my Lord is Forgiving, the Most Merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Embark in it. In the name of God shall be its sailing and its anchorage. My Lord is indeed Forgiving and Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [Noah] said, \"Embark therein; in the name of Allah is its course and its anchorage. Indeed, my Lord is Forgiving and Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:41] And he, Noah, said, ‘Embark therein! In the Name of God be its course and its mooring (read majrāhā and marsāhā, or mujrāhā and mursāhā, both being verbal nouns, meaning, the length of its course and where it docks, in other words, the entire journey). Truly my Lord is Forgiving, Merciful’, for He did not destroy us.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he said) to them: (Embark therein) in the ship! (In the name of Allah be its course) wherever it sails to (and its mooring) wherever it stops. He says: Allah makes it sail wherever He wills and makes it stop wherever He wills. (Lo! my Lord is Forgiving, Merciful) towards the one who repents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِسْمِ ٱللَّهِ مَجْريٰهَا } معناهُ مَسيرُها\n ومن قرأ مُجْراها معناه أجريتُهَا أنا\n { وَمُرْسَاهَا } معناهُ وَقْفتُها\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما نبع التنور وانتشر الماء وانبسط على الأرض { قَالَ } نوح بوحي الله إياه: { ٱرْكَبُواْ فِيهَا } أي: صيروا في جوفها متمكنين، واستقروا عليها قائلين متيمنين: { بِسْمِ ٱللَّهِ } إذ هو سبحانه بحوله وقوته { مَجْريٰهَا وَمُرْسَاهَا } حيث أراد إجراءها وإرساءها { إِنَّ رَبِّي } الذي رباني بلطفه وأوصاني بصنعها { لَغَفُورٌ } لمن استغفر له { رَّحِيمٌ } [هود: 41] يقبل توبته ويمحو زلته ومنجو عن عذابه، فركبوا مسمين متيمنين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: مَجْريها ومرساها: مشتقان من الجري والإرسال، أي: الثبوت، وهما إما ظرفان زمانيان، أو مكانيان، وإما مصدران، والعامل فيهما: ما في بسم الله من معنى الفعل\n وإعراب \" بسم الله \": إما حال مقدرة من الضمير في \" اركبوا \" ، أي: اركبوا متبركين بسم الله، أو قائلين: بسم الله، وقت إجرائها وإرسائها\n أو مجراها ومرساها: مبتدأ، وبسم الله: خبر: فيوقف على فيها أي: إجراؤها وإرساؤها حاصل بسم الله\n يقول الحق جل جلاله: وقال نوح لمن كان معه: { اركبوا } في السفينة وسيروا فيها\n رُوي أنهم ركبوا أول يوم من رجب، وقيل: يوم العاشر منه، واستوت على الجودي يوم عاشوراء، { بسم الله مَجْريها ومُرْساها } أي: متبركين بسم الله وقت إجرائها، أو قائلين بسم الله وقت إجرائها وإرسائها، رُوي: أنه عليه السلام كان إذا أراد أن يجري السفينة قال: بسم الله، فتجري، وإن أراد أن يوقفها قال: بسم الله، فتوقف\n { أن ربي لغفور رحيم } ، فلولا مغفرته لما فرط منكم، ورحمته إياكم، لَما أنجاكم\n فركبوا مسلمين وساروا\n { وهي تجري بهم في موج كالجبال } ، والموج: ما يرتفع من الماء عند اضطرابه، أي: كل موجة من الطوفان كالجبال في تراكمها وارتفاعها، وما قيل من أن الماء أطبق ما بين السماء والأرض، وكانت السفينة تجري في جوفه، لم يثبت\n وكيف يكون الموج كالجبال؟ والمشهور أنه علا شوامخ الجبال، خمسة عشر ذراعاً، وإنْ صح ذلك فلعل ارتفاع الموج كالجبال كان قبل التطبيق",
      "translations": []
    }
  ]
}