{
  "chapter": "هود",
  "text": "قيل ينوح اهبط بسلم منا وبركت عليك وعلى امم ممن معك وامم سنمتعهم ثم يمسهم منا عذاب اليم",
  "translations": [
    {
      "translation": "It was said, 'Nuh, descend with peace from Us and with blessings on you and on the nations which will issue from those who are with you. But there are nations to whom we will give enjoyment and then a painful punishment from Us will afflict them.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And the Lord) said: \"O Noah, disembark with peace and safety from Us and blessings on you and the people with you. As for some (of them), We shall bestow advantages for a time, then send a grievous punishment on them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: 'Noah! Disembark, with Our peace, and with blessings upon you and upon those who are with you. There are also people whom We shall allow to enjoy themselves for a while, and then a painful chastisement from Us shall afflict them.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah was told, \"Get down from the Ark. Your Lord's peace and blessings are upon you and your followers. Your Lord will grant favors to other nations and then afflict them with a painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, “O Nooh! Alight from the ship along with peace from Us and the blessings that are upon you and upon some groups that are with you; and some groups are those whom We shall let enjoy this world and then a painful punishment from Us will reach them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: \"O Nuh! Come down (from the ship) with peace from Us and blessings on you and on the people who are with you (and on some of their offspring), but (there will be other) people to whom We shall grant their pleasures (for a time), but in the end a painful torment will reach them from Us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: O Nuh! descend with peace from Us and blessings on you and on the people from among those who are with you, and there shall be nations whom We will afford provisions, then a painful punishment from Us shall afflict them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, 'Noah, get thee down in peace from Us, and blessings upon thee and on the nations of those with thee; and nations -- We shall give them enjoyment, then there shall visit them from Us a painful chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said (unto him): O Noah! Go thou down (from the mountain) with peace from Us and blessings upon thee and some nations (that will spring) from those with thee. (There will be other) nations unto whom We shall give enjoyment a long while and then a painful doom from Us will overtake them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, \"Noah, go ashore in peace; Our blessings upon you and upon the people who are with you and upon some of the descendants of those who are with you. [As for the unrighteous] We shall grant provision for a time, then a grievous punishment from Us shall afflict them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: Nuh! get thou down with peace from us and blessings upon thee and the communities with thee. And there shall be communities whom we shall let enjoy themselves, and thereafter there shall befall them from us a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, ‘O Noah! Disembark in peace from Us and with [Our] blessings upon you and upon nations [to descend] from those who are with you, and nations whom We shall provide for, then a painful punishment from Us shall befall them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word came: \"O Noah! Come down (from the Ark) with peace from Us, and blessing on thee and on some of the peoples (who will spring) from those with thee: but (there will be other) peoples to whom We shall grant their pleasures (for a time), but in the end will a grievous penalty reach them from Us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: \"O Nuh (Noah)! Come down (from the ship) with peace from Us and blessings on you and on the people who are with you (and on some of their off spring), but (there will be other) people to whom We shall grant their pleasures (for a time), but in the end a painful torment will reach them from Us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: 'O Noah, descend with peace from Us and blessings on you and on the nations of those with you; and nations We shall give them enjoyment, and then from Us they shall be visited with a painful punishment'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, “O Noah, disembark with peace from Us; and with blessings upon you, and upon communities from those with you. And other communities We will grant prosperity, and then a painful torment from Us will befall them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, \"O Noah, disembark in security from Us and blessings upon you and upon nations [descending] from those with you. But other nations [of them] We will grant enjoyment; then there will touch them from Us a painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:48] It was said, ‘O Noah, go down, disembark from the ship, in peace, in safety, or with a greeting, from Us and blessings, good things, upon you and upon some communities [that will spring] from those with you, in the ship, that is, from their children and their seed, those who are [and those who will be] the believers. And [there will be other] communities (read umamun), [to spring] from those with you, to whom We shall give enjoyment, in this world, and then a painful chastisement will befall them’, in the Hereafter, and these will be the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It was said (unto him): Noah! Go thou down) get out of the ship (with peace from Us) with safety from Us (and blessings) good fortunes (upon you and some nations) some groups (from those with thee) in the ship among the felicitous. ((There will be other) nations) hosts of people from their offspring (unto whom We shall give enjoyment a long while) We will give them enjoyment after coming out of the loins of their parents (and then a painful doom from Us will overtake them) after they disbelieve, these are the damned among them. Ibn 'Abbas, may Allah be well pleased with him, said: \"Allah sent His revelation to Noah (pbuh) when the latter was 480 years old; he preached to his people for 120 years; he boarded the ship when he was 600 years old; he lived after the flood 350 years, and stayed on the ship for five months. The ship was 300 cubits (the measure of his arm) long, 50 cubits wide, and its height 30 cubits. It had three decks, some of which were lower than others. In the lower deck, he put beasts of prey and reptiles; in the intermediate deck wild animals and beasts; and in the higher deck people who were 80 in number: 40 men and 40 women. The men and the women were separated by the body of Adam (pbuh). Noah had three of his sons with him: Shem, Ham and Yapheth\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأمم } أي: وينشأ ممن معك أمم { سنُمَتعهم } في الحياة الدنيا لاحتجابهم بها ووقوفهم { ثم يمسّهم منا عذابٌ أليمٌ } بإهلاكهم بكفرهم وإحراقهم بنار الآثار\n وتعذيبهم بالهيئات\n وإن شئت التطبيق أوّلت نوحاً بروحك والفلك بكمالك العلمي والعملي الذي به نجاتك عند طوفان بحر الهيولى حتى إذا فار تنور البدن باستيلاء الرطوبة الغريبة والأخلاط الفاسدة وأذن بالخراب\n ركب هو فيها وحمل معه من كل صنفين من وحوش القوى الحيوانية والطبيعية وطيور القوى الروحانية اثنين\n أي: أصليهما وبنيه الثلاثة حام القلب\n وسام العقل النظري\n ويافث العقل العملي\n وزوجه النفس المطمئنة وأجراها باسم الله الأعظم فنجا بالبقاء السرمدي من الهلاك الأبدي بالطوفان وغرقت زوجه الأخرى التي هي الطبيعة الجسمانية وابنه منها الذي هو الوهم { لآوي إلى جبل } الدماغ\n وأوّلت استواءها على الجودي وهبوطه بمثل نزول عيسى عليه السلام في آخر الزمان",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قِيلَ } من بل الله بعدما غاض الماء واستوت السفينة وانكشفت الأرض ويبست: { يٰنُوحُ ٱهْبِطْ } انزل من السفينة أنت ومن معك وما معك مقروناً { بِسَلاَمٍ } أي: سلامة ونجاة وأمن ناشئ { مِّنَّا } عليك تفضلاً وامتناناً { وَبَركَاتٍ } أي: خيرات ومبرات كثيرة نازلةٍ منا { عَلَيْكَ } أصالة { وَعَلَىٰ أُمَمٍ مِّمَّن مَّعَكَ } تبعاً\n سماهم أمماً باعتبار المآل { وَ } من ذرية من معك { أُمَمٌ سَنُمَتِّعُهُمْ } ونربيهم في النشأة الأولى بأنواع النعم { ثُمَّ يَمَسُّهُمْ مِّنَّا } في النشأة الأخرى بسبب كفرهم وفسقهم { عَذَابٌ أَلِيمٌ } [هود: 48] مؤلم بدل ما يتلذذون بنعم الدنيا\n ويكفرون بها\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" تلك \": مبتدأ\n و \" من أنباء \": خبر\n و \" نُوحيها \": خبر ثان\n و \" ما كنت تعلمها \": خبر ثالث\n أو حال من الهاء\n أي: حال كونها مجهولة عندك وعند قومك\n  يقول الحق جل جلاله: { قيل يا نوحُ اهبط } من السفينة إلى عمارة الأرض { بسلامٍ منّا } \n أي: متلبساً بسلامة من المكاره\n من جهة حفظنا ورعايتنا\n أو مسلماً عليك\n { وبركات عليك } وزيادات في نسلك حتى تصير آدماً ثانياً\n فالبركة هي: الخير النامي\n أو: مباركاً عليك\n { وعلى أمم ممن معكَ } أي: هم الذين معك\n أو ناشئة ممن معك\n فقد تشعبت الأمم ممن معه من ذريته\n والمراد: المؤمنون\n بدليل قوله: { وأمم سنُمتعهم } في الدنيا\n ونوسع عليهم فيها\n { ثم يمسُّهُم منا عذابٌ أليم } في الآخرة\n وهم الكفار ممن نشأ من ذريته\n وقيل: هم قوم هود وصالح ولوط وشعيب\n والعذاب: ما نزل بهم في الدنيا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:24",
      "similarity": 0.5696350200861379
    },
    {
      "verse": "7:13",
      "similarity": 0.5137874090638576
    },
    {
      "verse": "2:38",
      "similarity": 0.4899559747548278
    },
    {
      "verse": "20:123",
      "similarity": 0.4713340436727864
    },
    {
      "verse": "2:36",
      "similarity": 0.3680961116612137
    }
  ]
}