{
  "chapter": "هود",
  "text": "وهى تجرى بهم فى موج كالجبال ونادى نوح ابنه وكان فى معزل يبنى اركب معنا ولا تكن مع الكفرين",
  "translations": [
    {
      "translation": "It sailed with them through mountainous waves, and Nuh called out to his son, who had kept himself apart, 'My son! Come on board with us. Do not stay with the kafirun!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It sailed on waves like mountains (high), and Noah called to his son who was separated from him: \"Embark with us, O my son, and be not one of those who do not believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Ark sailed along with them amid mountain-like waves. Noah, spotting his son at a distance, called out to him: 'My son. embark with us. and do not be with the unbelievers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Ark sailed on with them amid the mountainous waves, Noah called out to his son who kept away from them, \"My son, embark with us. Do not stay with the unbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the same carries them amid waves like mountains; and Nooh called out to his son whereas he was standing apart, “O my son! Embark along with us*, and do not be with the disbelievers.” (* As a Muslim.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it (the ship) sailed with them amidst waves like mountains, and Nuh called out to his son, who had separated himself (apart): \"O my son! Embark with us and be not with the disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it moved on with them amid waves like mountains; and Nuh called out to his son, and he was aloof: O my son! embark with us and be not with the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it ran with them amid waves like mountains; and Noah called to his son, who was standing apart, 'Embark with us, my son, and be thou not with the unbelievers!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it sailed with them amid waves like mountains, and Noah cried unto his son - and he was standing aloof - O my son! Come ride with us, and be not with the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Ark sailed along with them through mountainous waves. Noah called out to his son who stood apart, \"O my son! Embark with us and do not be among the deniers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it moved on with them amidst waves like mountains. And Nuh called out his son, and he was apart: O my son! embark with us, and be not with the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it sailed along with them amid waves [rising] like mountains. Noah called out to his son, who stood aloof, ‘O my son! ‘Board with us, and do not be with the faithless!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the Ark floated with them on the waves (towering) like mountains, and Noah called out to his son, who had separated himself (from the rest): \"O my son! embark with us, and be not with the unbelievers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it (the ship) sailed with them amidst the waves like mountains, and Nuh (Noah) called out to his son, who had separated himself (apart), \"O my son! Embark with us and be not with the disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so it (the Ark) ran with them amidst the mountainous waves, and Noah cried out to his son, who was standing apart, 'Embark with us, my son, do not be with the unbelievers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so it sailed with them amidst waves like hills. And Noah called to his son, who had kept away, “On my son! Embark with us, and do not be with the disbelievers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it sailed with them through waves like mountains, and Noah called to his son who was apart [from them], \"O my son, come aboard with us and be not with the disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:42] And it sailed with them amid waves like mountains, in terms of their height and size, and Noah called out to his son, Canaan, who was standing away, from the ship, ‘O my son, embark with us and do not be with the disbelievers!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And it sailed with them) with the people aboard (amid waves) in the water (like mountains) the size of huge mountains, (and Noah cried unto) and Noah called (his son) Canaan (and he was standing aloof) aloof from the ship and it is said: on the side of the mountain: (0 my son! Come ride with us) be saved with us by means of \"there is no god except Allah\", (and be not with the disbelievers) following their religion lest you drown.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَهِيَ } أي: السفينة { تَجْرِي بِهِمْ فِي } خلال { مَوْجٍ } وهو ما ارتفع من الماء من شدة الريح عالٍ { كَٱلْجِبَالِ } الشامخ { وَ } حينئذ { نَادَىٰ نُوحٌ ٱبْنَهُ } المسمى بكنعان { وَكَانَ فِي مَعْزِلٍ } من آبيه؛ أي: اعتزل عنه وانصرف عن دينه، فرآه بين الماء، فتحرك عطف الأبوة فصاح عليه: { يٰبُنَيَّ } صغره للشفقة والترحم { ٱرْكَبَ مَّعَنَا } لتنجو من الغرق { وَلاَ تَكُن مَّعَ ٱلْكَافِرِينَ } [هود: 42] حتلا لا نغرق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ونادى نوحٌ ابنَه } ، كان كنعمان\n وقيل: كان لغير رشدة، وهو خطأ لأن الأنبياء عُصمت من أن تزني أزواجهم\n والمراد بالخيانة في قوله:\n\n[التحريم: 10]\n في الدين\n { وكان في معزلٍ } في ناحية، عزل نفسه فيها عن أبيه، أو عن دينه، فقال له أبوه: { يا بُنيَّ اركب معنا } في السفينة، { ولا تكن مع الكافرين } في الدين أو في الأعتزال عنا، وكان يظنه مؤمناً، لإخفاء كفره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:43",
      "similarity": 0.44457755925193904
    },
    {
      "verse": "18:99",
      "similarity": 0.4315539805369187
    },
    {
      "verse": "44:21",
      "similarity": 0.36521179779268254
    },
    {
      "verse": "26:212",
      "similarity": 0.3628940135861092
    },
    {
      "verse": "10:22",
      "similarity": 0.31264586606433487
    }
  ]
}