{
  "chapter": "هود",
  "text": "قال ينوح انه ليس من اهلك انه عمل غير صلح فلا تسـلن ما ليس لك به علم انى اعظك ان تكون من الجهلين",
  "translations": [
    {
      "translation": "He said, 'Nuh, he is definitely not of your family. He is someone whose action was not righteous. Do not, therefore, ask Me for something about which you have no knowledge. I admonish you lest you should be among the ignorant.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Noah\", He answered, \"truly he is not of your family. He is surely the outcome of an unrighteous act. So ask Me not of what you do not know. I warn you not to be one of the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In response Noah was told: 'Most certainly he is not of your family; verily he is of unrighteous conduct. So do not ask of Me for that concerning which you have no knowledge. I admonish you never to act like the ignorant ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His Lord replied, \"He is not one of your family. He is a man of unrighteous deeds. Do not ask me about that which you have no knowledge. I advise you not to become an ignorant person.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O Nooh, he is not of your family; his deeds are most improper; therefore do not ask Me a thing of which you do not have knowledge; I advise you not to be unwise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O Nuh! Surely, he is not of your family; verily, his work is unrighteous, so ask not of Me that of which you have no knowledge! I admonish you, lest you should be one of the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O Nuh! surely he is not of your family; surely he is (the doer of) other than good deeds, therefore ask not of Me that of which you have no knowledge; surely I admonish you lest you may be of the ignorant\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'Noah, he is not of thy family; it is a deed not righteous. Do not ask of Me that whereof thou hast no knowledge. I admonish thee, lest thou shouldst be among the ignorant.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O Noah! Lo! he is not of thy household; lo! he is of evil conduct, so ask not of Me that whereof thou hast no knowledge. I admonish thee lest thou be among the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, \"Noah, he was not one of your family. For, indeed, he was unrighteous in his conduct. Do not question Me about something of which you have no knowledge; I admonish you lest you become like an ignorant man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O Nuh! verily he is not of thy household; verily he is of unrighteous Conduct; wherefore ask Me not that whereof thou hast no knowledge; verily I exhort thee not to be of the ignorants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, ‘O Noah! Indeed, He is not of your family. Indeed, he is [personification of] unrighteous conduct. So do not ask Me [something] of which you have no knowledge. I advise you lest you should be among the ignorant.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O Noah! He is not of thy family: For his conduct is unrighteous. So ask not of Me that of which thou hast no knowledge! I give thee counsel, lest thou act like the ignorant!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O Nuh (Noah)! Surely, he is not of your family; verily, his work is unrighteous, so ask not of Me that of which you have no knowledge! I admonish you, lest you be one of the ignorants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Noah, he is not of your family. It is not a good deed. Do not ask Me about things of which you have no knowledge. I reproach you lest you become among the ignorant'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O Noah, he is not of your family. It is an unrighteous deed. So do not ask Me about something you know nothing about. I admonish you, lest you be one of the ignorant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"O Noah, indeed he is not of your family; indeed, he is [one whose] work was other than righteous, so ask Me not for that about which you have no knowledge. Indeed, I advise you, lest you be among the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:46] He, [God] exalted be He, said: ‘O Noah, lo! he is not of your family, of those [who will be] saved, or of the followers of your religion; lo! it, that is, your asking me to save him, is not a righteous deed, for he is a disbeliever and there is no deliverance for disbelievers (‘āmalun ghayru sālihin, ‘it is not a righteous deed’: a variant reading has ‘āmila, the verb, with ghayra in the accusative, in which case the person governing [the verb ‘amila] is his son). So do not ask of Me (read either fa-lā tas’alanni, or fa-lā tas’alni) that whereof you have no knowledge, in respect to saving your son. I admonish you lest you be among the ignorant’, when you ask about what you do not know.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Allah said: (0 Noah! Lo! he is not of your household) whom I promised to save; (lo! he is of evil conduct) engaged in idolatry; and according to a different reading this means: your prayer to Me to save him is not acceptable, (so ask not of Me) to save (that whereof thou hast no knowledge) that he is deserving of being saved. (I admonish thee) I warn you (lest thou be among the ignorant) by asking Me that which you know not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قال يا نوح إنه ليس من أهلك } أي: إنّ أهلك في الحقيقة هو الذي بينك وبينه القرابة الدينية واللحمة المعنوية والاتصال الحقيقي لا الصوري كما قال أمير المؤمنين عليه السلام: \" ألا وإنّ وليّ محمد من أطاع الله وإن بَعُدَتْ لحمته، ألا وإن عدّو محمد من عصى الله وإن قَرُبَتْ لحمته \" ، { إنه عمل غير صالح } بين انتفاء كونه من أهله بأنه غير صالح تنبيهاً على أنّ أهله هم الصلحاء، أهل دينه وشريعته وأنه لتماديه في الفساد والغيّ كأن نفسه عمل غير صالح\n وأنّ سبب النجاة ليس إلا الصلاة لا قرابته منك بحسب السورة، فمن لا صلاح له لا نجاة له\n ولوّح إلى أنه صورة من صور الخطايا صدرت منك كما قيل: إنه سرّ من أسرار أبيه على ما قال النبي عليه الصلاة والسلام:\n\n \" الولد سرّ أبيه \" \n\nوذلك أنه لما بالغ في الدعوة وبلغ الجهد في المدة المتطاولة وما أجابه قومه غضب ودعا عليهم بقوله:\n\n[نوح، الآيات: 26-27]، فذهل عن شهود قدرة الله وحكمته وأنه:\n\n[يونس، الآية: 31] فكانت دعوته تلك ذنب حاله في خطيئه مقامه ، فابتلاه الله بالفاجر الكَفّار الذي زعم حال غضبه أنهم لا يلدون إلا مثله وحكم على الله بظنه فزكّاه عن خطيئته بتلك العقوبة\n وفي الحديث:\n\n \" خلق الكافر من ذنب المؤمن \" \n\n{ فلا تسألني ما ليس لك به علم } من إنجاء من ليس بصالح ولا من أهلك، واعلم أن الصلاح هو سبب النجاة دون غيره، وأن أهلك هو ذو القرابة المعنوية لا الصورية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } سبحانه مجيباً له مزيلاً لشكواه: { يٰنُوحُ إِنَّهُ } بسبب اعتزاله عنك ون دينك { لَيْسَ مِنْ أَهْلِكَ } إذ لا قرابة ولا ألفة بين المؤمن والكافر، وكيف يكون من أهلك { إِنَّهُ } من غابة فسقه وفساده { عَمَلٌ غَيْرُ صَالِحٍ } كأنه مغمور فيه مجسم منه لا يرجى صلاحه أصلاً { فَلاَ تَسْئَلْنِ } متعرضاً معترضاً على { مَا لَيْسَ لَكَ بِهِ عِلْمٌ } لوروده علي { إِنِّيۤ أَعِظُكَ } وأذكر لك { أَن تَكُونَ مِنَ ٱلْجَاهِلِينَ } [هود: 46] أي: كونك بذهولك عما نبهت عليك بالاستثناء السابق؛ يعني\n\n[هود: 40]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:64",
      "similarity": 0.4404104784632897
    },
    {
      "verse": "16:119",
      "similarity": 0.4140859411699584
    },
    {
      "verse": "4:17",
      "similarity": 0.3913884385209561
    },
    {
      "verse": "6:54",
      "similarity": 0.3868104864182887
    },
    {
      "verse": "3:138",
      "similarity": 0.38268719271856366
    }
  ]
}