{
  "chapter": "هود",
  "text": "قال سـاوى الى جبل يعصمنى من الماء قال لا عاصم اليوم من امر الله الا من رحم وحال بينهما الموج فكان من المغرقين",
  "translations": [
    {
      "translation": "He said, 'I will take refuge on a mountain; It will protect me from the flood.' He said, 'There is no protection from Allah's command today except for those He has mercy on.' The waves surged in between them and he was among the drowned.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall go up a mountain,\" he said, \"which will keep me from the water.\" \"There is no getting away,\" said Noah, \"from the decree of God today, except for those on whom be His mercy.\" And a wave came between them, and he was among those who were drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The son replied: 'I will go to a mountain for refuge and it will save me from the water.' Noah said: 'None can save anyone today from the command of Allah except those on whom He may have mercy.' Thereupon a wave swept in between the two and he was drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His son replied, \"I shall climb up a mountain and this will save me from the flood.\" Noah said, \"No one can escape on this day from God's command except those on whom He has mercy.\" The waves separated Noah from his son who was then drowned with the rest (of the unbelievers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I shall take the refuge of a mountain – it will save me from the water”; said Nooh, “Today there is none who can rescue from the punishment of Allah, except upon whom He has mercy”; and the wave came in between them, so he remained amongst the drowning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The son replied: \"I will betake myself to some mountain, it will save me from the water.\" Nuh said: \"This day there is no savior from the decree of Allah except him on whom He has mercy.\" And waves came in between them, so he (the son) was among the drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I will betake myself for refuge to a mountain that shall protect me from the water. Nuh said: There is no protector today from Allah's punishment but He Who has mercy; and a wave intervened between them, so he was of the drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'I will take refuge in a mountain, that shall defend me from the water.' Said he, 'Today there is no defender from God's command but for him on whom He has mercy.' And the waves came between them, and he was among the drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I shall betake me to some mountain that will save me from the water. (Noah) said: This day there is none that saveth from the commandment of Allah save him on whom He hath had mercy. And the wave came in between them, so he was among the drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"I shall seek refuge on a mountain, which will save me from the water.\" Noah cried, \"Today there is no refuge for anyone from God's command except for those to whom He shows mercy!\" Thereupon, a wave swept in between them, and Noah's son was among those who were drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I shall betake me to a mountain which will defend me from the water. Nuh said: there is no defender to-day from the decree of Allah save for one on whom He hath mercy. And a wave intervened betwixt the twain; so he was of the drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘I shall take refuge on a mountain; it will protect me from the flood.’ He said, ‘There is none today who can protect from Allah’s edict, except someone upon whom He has mercy.’ Then the waves came between them, and he was among those who were drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The son replied: \"I will betake myself to some mountain: it will save me from the water.\" Noah said: \"This day nothing can save, from the command of Allah, any but those on whom He hath mercy! \"And the waves came between them, and the son was among those overwhelmed in the Flood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The son replied: \"I will betake myself to a mountain, it will save me from the water.\" Nuh (Noah) said: \"This day there is no saviourfrom the Decree of Allah except him on whom He has mercy.\" And a wave came in between them, so he (the son) was among the drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he replied: 'I shall seek refuge on a mountain, which will protect me from the water' He (Noah) said: 'Today, there is no defender from the command of Allah, except those to whom He has mercy' And the waves came between them, and he was drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I will take refuge on a mountain—it will protect me from the water.” He said, “There is no protection from God’s decree today, except for him on whom He has mercy.” And the waves surged between them, and he was among the drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[But] he said, \"I will take refuge on a mountain to protect me from the water.\" [Noah] said, \"There is no protector today from the decree of Allah, except for whom He gives mercy.\" And the waves came between them, and he was among the drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:43] He said, ‘I shall take refuge in a mountain that will protect me, preserve me, from the water’. Said he, ‘This day there is none that can protect from God’s command, [from] His chastisement, except — but — him on whom He, God, has mercy’, he will be protected. God, exalted be He, says: And the waves came between them, so he was among the drowned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: I shall betake me) I will go (to some mountain that will save me) prevent me (from the water) from drowning. (Said) Noah: (This day there is none that saveth) there is none that prevents (from the commandment of Allah) from Allah's chastisement: drowning (save him on whom He hath had mercy) except those upon whom Allah has mercy from among the believers. (And the wave came in between them) between Canaan and Noah; it is also said: between Canaan and the mountain, (so he was among the drowned) by the flood.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } ابنه مستنكراً عليه: { سَآوِيۤ } والتجئ { إِلَىٰ جَبَلٍ } عالٍ { يَعْصِمُنِي مِنَ } إغراق { ٱلْمَآءِ } بشموخه وعلوه { قَالَ }: يا بني { لاَ عَاصِمَ } ولا ينجي { ٱلْيَوْمَ مِنْ أَمْرِ ٱللَّهِ } المبرم وحكمه المحكم { إِلاَّ مَن رَّحِمَ } الله وأنجاه؛ إذ لا عاصم غيره { وَ } حينئذٍ { حَالَ بَيْنَهُمَا } أي: بين نوح وابنه { ٱلْمَوْجُ } العظيم { فَكَانَ مِنَ ٱلْمُغْرَقِينَ } [هود: 43] أي: صار ابنه من الغرقى الهالكين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال سآوي إلى جبل يعصمُني } يمنعني { من الماء } ، فلا أغرق، { قال لا عاصمَ اليوم من أمر الله إلا من رحم ربي } أي: إلا الراحم، وهو الله فلا عاصم إلا أرحم الراحمين\n أو: { لا عاصم } لا ذو عصمة إلا من رحم الله، فلا معصوم إلا من رحمه الله\n فالاستثناء حينئذٍ متصل\n أو: لا عاصم اليوم من أمر الله لكن من رحمه الله فهو المعصوم\n أو: لا ذو عصمة لكن الراحم يعصم من شاء، والاستثناء منقطع\n { وحال بينهما الموجُ } بين نوح وابنه، { فكان من المغرَقين } فصار من المهلكين بالماء\n رُوي أنه صنع بيتاً من زجاج، وحمل معه طعامه وشرابه، وصعد على وجه الماء فسلط الله عليه البول حتى غرق في بوله، والله تعالى أعلم بشأنه\n\n\nالإشارة: إذا دخل العارف في بحر الفناء، وغاب عن حسه ورسمه، واتصل معناه ببحر معاني الأسرار، جرت سفينة فكرته في بحر الذات وأنوار الصفات، فقال لأصحابه: اركبوا فيها، بسم الله مجريها ومرساها، إن ربي لغفور رحيم، حيث غطى وصفكم بوصفه، ونعتكم بنعته\n فوصلكم بما منه إليه، لا بما منكم إليه، فصارت سفن الأفكار تجري بهم في موج كالجبال، وهي تيار بحر الذات\n فالخمرة الأزلية الخفية الصافية بحر لا ساحل له، وما ظهر من أنوار الصفات أمواجه\n فأنوار الآثار هي أمواج البحار، وما عظم من أمواجه يسمى التيار، ولذلك قيل: العارفون يغرقون في بحر الذات، وتيار الصفات، فتراهم إذا غرقوا في بحر الأسرار وتيار الأنوار، وساروا فيها بمدد أسرارهم، تلاطمت عليهم أمواجه\n وهي تجري بهم في موج كالجبال، فلا عاصم اليوم من أمر الله إلا من رحم، فآواه إلى جبل السنة المحمدية فكان من الناجين\n وآخرون حال بيهم الموج، فكانوا من المغرقين، فالتبس الأمر عليهم، فقالوا بالحلول والاتحاد، أو نفي الحكمة والأحكام\n وهذا في حق من ركب بلا رئيس ماهر، وإلا رده إلى سفينة النجاة، وهي: التمسك بالشريعة المحمدية في الظاهر، والتحقق بالحقيقة الأصلية\n وبالله التوفيق\n ثم ذكر انتهاء الطوفان، فقال: { وَقِيلَ يٰأَرْضُ ٱبْلَعِي مَآءَكِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:42",
      "similarity": 0.4445775592519391
    },
    {
      "verse": "18:99",
      "similarity": 0.443098705828566
    },
    {
      "verse": "4:175",
      "similarity": 0.3273313212050308
    },
    {
      "verse": "40:33",
      "similarity": 0.3131485774365776
    },
    {
      "verse": "33:17",
      "similarity": 0.31116931787313634
    }
  ]
}