{
  "chapter": "هود",
  "text": "قيل ينوح اهبط بسلم منا وبركت عليك وعلى امم ممن معك وامم سنمتعهم ثم يمسهم منا عذاب اليم",
  "translations": [
    {
      "translation": "It was said, 'Nuh, descend with peace from Us and with blessings on you and on the nations which will issue from those who are with you. But there are nations to whom we will give enjoyment and then a painful punishment from Us will afflict them.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And the Lord) said: \"O Noah, disembark with peace and safety from Us and blessings on you and the people with you. As for some (of them), We shall bestow advantages for a time, then send a grievous punishment on them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: 'Noah! Disembark, with Our peace, and with blessings upon you and upon those who are with you. There are also people whom We shall allow to enjoy themselves for a while, and then a painful chastisement from Us shall afflict them.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah was told, \"Get down from the Ark. Your Lord's peace and blessings are upon you and your followers. Your Lord will grant favors to other nations and then afflict them with a painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, “O Nooh! Alight from the ship along with peace from Us and the blessings that are upon you and upon some groups that are with you; and some groups are those whom We shall let enjoy this world and then a painful punishment from Us will reach them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: \"O Nuh! Come down (from the ship) with peace from Us and blessings on you and on the people who are with you (and on some of their offspring), but (there will be other) people to whom We shall grant their pleasures (for a time), but in the end a painful torment will reach them from Us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: O Nuh! descend with peace from Us and blessings on you and on the people from among those who are with you, and there shall be nations whom We will afford provisions, then a painful punishment from Us shall afflict them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, 'Noah, get thee down in peace from Us, and blessings upon thee and on the nations of those with thee; and nations -- We shall give them enjoyment, then there shall visit them from Us a painful chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said (unto him): O Noah! Go thou down (from the mountain) with peace from Us and blessings upon thee and some nations (that will spring) from those with thee. (There will be other) nations unto whom We shall give enjoyment a long while and then a painful doom from Us will overtake them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, \"Noah, go ashore in peace; Our blessings upon you and upon the people who are with you and upon some of the descendants of those who are with you. [As for the unrighteous] We shall grant provision for a time, then a grievous punishment from Us shall afflict them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: Nuh! get thou down with peace from us and blessings upon thee and the communities with thee. And there shall be communities whom we shall let enjoy themselves, and thereafter there shall befall them from us a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, ‘O Noah! Disembark in peace from Us and with [Our] blessings upon you and upon nations [to descend] from those who are with you, and nations whom We shall provide for, then a painful punishment from Us shall befall them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word came: \"O Noah! Come down (from the Ark) with peace from Us, and blessing on thee and on some of the peoples (who will spring) from those with thee: but (there will be other) peoples to whom We shall grant their pleasures (for a time), but in the end will a grievous penalty reach them from Us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: \"O Nuh (Noah)! Come down (from the ship) with peace from Us and blessings on you and on the people who are with you (and on some of their off spring), but (there will be other) people to whom We shall grant their pleasures (for a time), but in the end a painful torment will reach them from Us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said: 'O Noah, descend with peace from Us and blessings on you and on the nations of those with you; and nations We shall give them enjoyment, and then from Us they shall be visited with a painful punishment'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, “O Noah, disembark with peace from Us; and with blessings upon you, and upon communities from those with you. And other communities We will grant prosperity, and then a painful torment from Us will befall them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was said, \"O Noah, disembark in security from Us and blessings upon you and upon nations [descending] from those with you. But other nations [of them] We will grant enjoyment; then there will touch them from Us a painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:48] It was said, ‘O Noah, go down, disembark from the ship, in peace, in safety, or with a greeting, from Us and blessings, good things, upon you and upon some communities [that will spring] from those with you, in the ship, that is, from their children and their seed, those who are [and those who will be] the believers. And [there will be other] communities (read umamun), [to spring] from those with you, to whom We shall give enjoyment, in this world, and then a painful chastisement will befall them’, in the Hereafter, and these will be the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It was said (unto him): Noah! Go thou down) get out of the ship (with peace from Us) with safety from Us (and blessings) good fortunes (upon you and some nations) some groups (from those with thee) in the ship among the felicitous. ((There will be other) nations) hosts of people from their offspring (unto whom We shall give enjoyment a long while) We will give them enjoyment after coming out of the loins of their parents (and then a painful doom from Us will overtake them) after they disbelieve, these are the damned among them. Ibn 'Abbas, may Allah be well pleased with him, said: \"Allah sent His revelation to Noah (pbuh) when the latter was 480 years old; he preached to his people for 120 years; he boarded the ship when he was 600 years old; he lived after the flood 350 years, and stayed on the ship for five months. The ship was 300 cubits (the measure of his arm) long, 50 cubits wide, and its height 30 cubits. It had three decks, some of which were lower than others. In the lower deck, he put beasts of prey and reptiles; in the intermediate deck wild animals and beasts; and in the higher deck people who were 80 in number: 40 men and 40 women. The men and the women were separated by the body of Adam (pbuh). Noah had three of his sons with him: Shem, Ham and Yapheth\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إني أعِظك أن تكون من الجاهلين } الواقفين مع ظواهر الأمور، المحجوبين عن حقائقها، فتنبّه عليه السلام عند ذلك التأديب الإلهي والعتاب الرباني وتعوّذ بقوله: { ربّ إني أعوذ بك أن أسالك ما ليس لي به علم وإلا تغفر لي } تلويناتي وظهور بقاياي { وترحمني } بالاستقامة والتمكين { أكن من الخاسرين } الذين خسروا أنفسهم بالاحتجاب عن علمك وحكمتك { قيل يا نوح اهبط } أي: اهبط من محل الجمع وذروة مقام الولاية والاستغراق في التوحيد إلى مقام التفصيل وتشريع النبوّة بالرجوع إلى الخلق ومشاهدة الكثرة في عين الوحدة لا مغضباً بالاحتجاب بهم عن الحق ولا راضياً بكفرهم بالاحتجاب بالحق عنهم { بسلام } أي: سلامة عن الاحتجاب بالكثرة وظهور النفس بالغضب ووجود التلوين وحصول التعلق بعد التجرد والضلال بعد الهدى { منّا } أي صادر منا وبنا { وبركات } بتقنين قوانين الشرع وتأسيس قواعد العدل الذي ينمو به كل شيء ويزيد { عليك وعلى أُمم } ناشئة { ممن معك } وعلى دينك وطريقتك إلى آخر الزمان\n\n\n{ وأمم } أي: وينشأ ممن معك أمم { سنُمَتعهم } في الحياة الدنيا لاحتجابهم بها ووقوفهم { ثم يمسّهم منا عذابٌ أليمٌ } بإهلاكهم بكفرهم وإحراقهم بنار الآثار، وتعذيبهم بالهيئات، وإن شئت التطبيق أوّلت نوحاً بروحك والفلك بكمالك العلمي والعملي الذي به نجاتك عند طوفان بحر الهيولى حتى إذا فار تنور البدن باستيلاء الرطوبة الغريبة والأخلاط الفاسدة وأذن بالخراب، ركب هو فيها وحمل معه من كل صنفين من وحوش القوى الحيوانية والطبيعية وطيور القوى الروحانية اثنين، أي: أصليهما وبنيه الثلاثة حام القلب، وسام العقل النظري، ويافث العقل العملي، وزوجه النفس المطمئنة وأجراها باسم الله الأعظم فنجا بالبقاء السرمدي من الهلاك الأبدي بالطوفان وغرقت زوجه الأخرى التي هي الطبيعة الجسمانية وابنه منها الذي هو الوهم { لآوي إلى جبل } الدماغ، وأوّلت استواءها على الجودي وهبوطه بمثل نزول عيسى عليه السلام في آخر الزمان\n\n",
      "translations": [
        {
          "translation": "\n\nI advise you to be among the ignorant {those who stand with the apparent things}.,\n\nThe hidden people {of the world} have their own facts and truths.,\n\n{The Prophet} (peace and blessings of Allaah be upon him) was mindful of this divine discipline and rebukes from Allaah, and he sought refuge in His saying: {O Lord, I seek refuge in You from asking You for that of which I have no knowledge. If You do not forgive me,} (Quran 7:198) my {coloring} and {remaining} (i.e. of those who have gone astray). {And have mercy on me} (Quran 7:199) by being steadfast and enabling me {to be among the losers} (Quran 7:200) who have lost themselves by turning away from Your knowledge and wisdom. {It was said, \"O Noah, disembark\"} (Quran 11:46), i.e. disembark from the place of gathering and the summit of authority and sinking into tawheed, to the station of detailing and legislating the Prophethood by returning to the creation and observing the multitude in the eye of unity, not {angry} at their turning away from the truth, nor {pleased} with their disbelief in it, {in peace} (Quran 11:48), i.e. safety from turning away from the multitude and the manifestation of the self with anger and the presence of coloring and attachment after divestment and error after guidance, {from us} (Quran 11:49), i.e. emanating from us and from us {and blessings} (Quran 11:50) by perfecting the laws of Sharee'ah and establishing the principles of justice by which everything grows and increases, {upon you and upon the nations} (Quran 11:51) that have arisen {from among those with you}, (Quran 11:52) and upon your religion and your way to the Last Day.\n\n{And nations} that is, and those who are with you {We will enjoy them} in this life, for their turning to it and their stopping {then a painful punishment will touch them from Us} by destroying them for their disbelief and burning them with the fire of Hell.,\nAnd their torment in the {formations}.,\n\nAnd if you wish to apply yourself, you should first emulate Noah in your spirit, and the perfection of your knowledge and practical ability by which you were saved from the flood of the Evil One. Thus, when your body is corrupted by the strange and foul moisture, and your ears are filled with the noise of destruction, you will be able to withstand it.,\n{He} rode on it and carried with him two of every kind of animal, both of the animals' power and of the birds' power.,\n\n{Their} origin and {the three of them} are the heart's guardian.,\nThe badge of the theoretical mind,\n\nAnd the active mind is the one that succeeds.,\n\nThe wife of the self-confident man and her husband live their lives in the name of God the Almighty, safe from the eternal destruction of the flood. The other wife, who is the physical nature, and her son from her, who is the {illusion of the mountain}, drowned.,\n\nAnd its stability {istawatiha} was on {al-} goodness {al-joodiyyah}, and its descent {hubootihi} was like {mathal} the descent {nuzool} of Jesus {Eesa}, peace be upon him, at the end of time.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قِيلَ } من بل الله بعدما غاض الماء واستوت السفينة وانكشفت الأرض ويبست: { يٰنُوحُ ٱهْبِطْ } انزل من السفينة أنت ومن معك وما معك مقروناً { بِسَلاَمٍ } أي: سلامة ونجاة وأمن ناشئ { مِّنَّا } عليك تفضلاً وامتناناً { وَبَركَاتٍ } أي: خيرات ومبرات كثيرة نازلةٍ منا { عَلَيْكَ } أصالة { وَعَلَىٰ أُمَمٍ مِّمَّن مَّعَكَ } تبعاً، سماهم أمماً باعتبار المآل { وَ } من ذرية من معك { أُمَمٌ سَنُمَتِّعُهُمْ } ونربيهم في النشأة الأولى بأنواع النعم { ثُمَّ يَمَسُّهُمْ مِّنَّا } في النشأة الأخرى بسبب كفرهم وفسقهم { عَذَابٌ أَلِيمٌ } [هود: 48] مؤلم بدل ما يتلذذون بنعم الدنيا، ويكفرون بها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:24",
      "similarity": 0.5696350200861379
    },
    {
      "verse": "7:13",
      "similarity": 0.5137874090638576
    },
    {
      "verse": "2:38",
      "similarity": 0.4899559747548278
    },
    {
      "verse": "20:123",
      "similarity": 0.4713340436727864
    },
    {
      "verse": "2:36",
      "similarity": 0.3680961116612137
    }
  ]
}