{
  "chapter": "هود",
  "text": "تلك من انۢباء الغيب نوحيها اليك ما كنت تعلمها انت ولا قومك من قبل هذا فاصبر ان العقبة للمتقين",
  "translations": [
    {
      "translation": "That is some of the news of the Unseen which We reveal to you. Neither you nor your people knew it before this time. So be steadfast. The best end result is for those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is news of the Unknown We reveal to you, which neither you nor your people knew before. So endure with patience. The future is for those who keep away from evil and follow the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We reveal to you these accounts of matters that are beyond the reach of human perception. Neither you nor your people knew about them before this. Be, then, patient. Surely, the good end is for the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which We have revealed to you (Muhammad) is news of the unseen. This was not known to you and to your people. Have patience. The pious will triumph in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the tidings of the hidden, which We reveal to you (O dear Prophet Mohammed – peace and blessings be upon him); you did not know them nor did your people, before this; therefore patiently endure; indeed the excellent fate is for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the news of the Unseen which We reveal unto you; neither you nor your people knew it before this. So be patient. Surely, the (good) end is for those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are announcements relating to the unseen which We reveal to you, you did not know them-- (neither) you nor your people-- before this; therefore be patient; surely the end is for those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(That is of the tiding's of the Unseen, that We reveal to thee; thou didst not know it, neither thy people, before this. So be patient; the issue ultimate is to the godfearing.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the tidings of the Unseen which We inspire in thee (Muhammad). Thou thyself knewest it not, nor did thy folk (know it) before this. Then have patience. Lo! the sequel is for those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are tidings of the unseen that We reveal to you, [O Prophet], which you did not know before, nor did your people, so be patient: the future belongs to the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is of the stories of the unseen: We Reveal it unto thee: thou knewest it not, nor thy nation knew it ere this. So be thou patient; verily the happy end is for the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are accounts of the Unseen, which We reveal to you. Neither you nor your people used to know them before this. So be patient. Indeed the outcome will be in favour of the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are some of the stories of the unseen, which We have revealed unto thee: before this, neither thou nor thy people knew them. So persevere patiently: for the End is for those who are righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the news of the unseen which We reveal unto you (O Muhammad SAW), neither you nor your people knew them before this. So be patient. Surely, the (good) end is for the Muttaqun (pious - see V. 2:2)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is from the news of the unseen which We reveal to you; neither you nor your nation knew this before now. Have patience; the outcome is for the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are some stories from the past that we reveal to you. Neither you, nor your people knew them before this. So be patient. The future belongs to the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is from the news of the unseen which We reveal to you, [O Muhammad]. You knew it not, neither you nor your people, before this. So be patient; indeed, the [best] outcome is for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:49] Those, that is, these verses, containing [stories such as] the story of Noah, are of the tidings of the Unseen, [of] the tales of that which was hidden from you, which We inspire in you, O Muhammad (s). You yourself did not know it, nor did your people [know it] before this, Qur’ān. So be patient, in conveying [the Message] and in [enduring] your people’s hurt, as Noah endured. Truly the, praiseworthy, sequel is for those who are God-fearing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This is of the tidings of the Unseen) this is of the news of what has been hidden from you (which We inspire in thee) with which We sent Gabriel to you, O Muhammad, about the news of past nations. (Thou thyself knewest it not) i.e. you knew not the news of these past nations, (nor did thy folk (know it) before this) before the revelation of the Qur'an. (Then have patience) O Muhammad in the face of their denial and harm. (Lo! the sequel) the end result: victory and Paradise (is for those who ward off (evil)) ward off disbelief, idolatry and indecencies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تِلْكَ } أي: قصة نوح عليه السلام { مِنْ أَنْبَآءِ ٱلْغَيْبِ } أي: بعض أخباره { نُوحِيهَآ إِلَيْكَ } يا أكمل الرسل؛ تعليماً لك وتذكيراً لأمتك { مَا كُنتَ تَعْلَمُهَآ أَنتَ وَلاَ قَوْمُكَ } بالدراسة والتعليم { مِن قَبْلِ هَـٰذَا } الوحي والإنزال، وإن طعن المشركون لك ونسبوك إلى الكذب والافتراء { فَٱصْبِرْ } على أذياتهم، وكن في تبليغك على عزيمة صحيحة { إِنَّ ٱلْعَاقِبَةَ } الحميدة والآخر الجزيل في النشأة الأخرى { لِلْمُتَّقِينَ } [هود: 49] الذين يحفظون نفوسهم عن الميل إلى البدع والأهواء، ويصبرون على المكاره والأذى، حتى يتحققوا بمقام الرضا ويفوزوا بشرف اللقاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:126",
      "similarity": 0.4377617005717043
    },
    {
      "verse": "10:109",
      "similarity": 0.40961265322779783
    },
    {
      "verse": "20:132",
      "similarity": 0.38808618740679246
    },
    {
      "verse": "21:25",
      "similarity": 0.3832452313427459
    },
    {
      "verse": "12:102",
      "similarity": 0.3706439143043684
    }
  ]
}