{
  "chapter": "هود",
  "text": "ونادى نوح ربه فقال رب ان ابنى من اهلى وان وعدك الحق وانت احكم الحكمين",
  "translations": [
    {
      "translation": "Nuh called out to his Lord and said, 'My Lord, my son is one of my family and Your promise is surely the truth and You are the Justest of Judges.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah called on his Lord and said: \"O Lord, my son is surely a member of my family, and verily Your promise is true, as You are the most just of all judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Noah called out to his Lord, saying: 'My Lord! My son is of my family. Surely Your promise is true, and You are the greatest of those who judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah prayed to his Lord saying, \"Lord, my son is a member of my family. Your promise is always true and you are the best Judge\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Nooh prayed to his Lord – submitted he, “My Lord! Indeed my son is also of my family, and surely Your promise is true and You are the Greatest Ruler of all.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Nuh called upon his Lord and said, \"O my Lord! Verily, my son is of my family! And certainly, Your promise is true, and You are the Most Just of the judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Nuh cried out to his Lord and said: My Lord! surely my son is of my family, and Thy promise is surely true, and Thou art the most just of the judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Noah called unto his Lord, and said, 'O my Lord, my son is of my family, and Thy promise is surely the truth. Thou art the justest of those that judge.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Noah cried unto his Lord and said: My Lord! Lo! my son is of my household! Surely Thy promise is the truth and Thou are the Most Just of Judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah called out to his Lord, saying, \"My Lord, my son was a part of my family. Your promise was surely true. You are the most just of all judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Nuh cried unto his Lord, and said: my Lord! verily my son is of my household, and verily Thine promise is the truth: and Thou art the Greatest of the rulers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah called out to his Lord, and said, ‘My Lord! My son is indeed from my family. Your promise is indeed true, and You are the fairest of all judges.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Noah called upon his Lord, and said: \"O my Lord! surely my son is of my family! and Thy promise is true, and Thou art the justest of Judges!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Nuh (Noah) called upon his Lord and said, \"O my Lord! Verily, my son is of my family! And certainly, Your Promise is true, and You are the Most Just of the judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah called out to his Lord, saying: 'O Lord, my son was of my family, and Your promise is surely the truth. You are the most Just of judges'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Noah called to his Lord. He said, “O My Lord, my son is of my family, and Your promise is true, and You are the Wisest of the wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Noah called to his Lord and said, \"My Lord, indeed my son is of my family; and indeed, Your promise is true; and You are the most just of judges!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:45] And Noah called out to his Lord and said, ‘My Lord, lo! my son, Canaan, is of my family, and You promised me that they would be saved, and truly Your promise is the Truth, which never fails, and You are the Most Just of Judges’, the most knowledgeable and the fairest of them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Noah cried unto) and Noah prayed to (his Lord and said: My Lord!) my Lord! (Lo! my son) Canaan (is of my household) whom you promised to save! (Surely Thy promise is the Truth) for certain (and Thou art the Most Just of Judges) you promised to save me and my family.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ونادى نوح ربّه فقال ربّ إن ابْني من أهلي } حمله شفقة الأبوة وتعطف الرحم والقرابة على طلب نجاته لشدّة تعلقه به واهتمامه بأمره\n وراعى مع ذلك أدب الحضرة وحسن السؤال فقال: { وإن وعْدَك الحقّ } ولم يقل لا تخلف وعدك بإنجاء أهلي\n وإنما قال ذلك لوجود تلوين وظهور بقية منه إذ فهم من الأهل ذوي القرابة الصورية والرحم الطبيعية وغفل لفرط التأسف على ابنه عن استثنائه تعالى بقوله:\n[هود\n الآية: 40] ولم يتحقق أنّ ابنه هو الذي سبق عليه القول ولا استعطف ربّه بالاسترحام وعرّض بقوله: { وأنت أحكم الحاكمين } إلى أن العالم العادل والحكيم لا يخلف وعده\n { قال يا نوح إنه ليس من أهلك } أي: إنّ أهلك في الحقيقة هو الذي بينك وبينه القرابة الدينية واللحمة المعنوية والاتصال الحقيقي لا الصوري كما قال أمير المؤمنين عليه السلام: \" ألا وإنّ وليّ محمد من أطاع الله وإن بَعُدَتْ لحمته\n ألا وإن عدّو محمد من عصى الله وإن قَرُبَتْ لحمته \" ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وإنَّ وعدك: عطف على إن ابني\n وأنت أحكم: حال من الكاف\n وإني أعظك: مفعول من أجله\n أي: كراهية أن تكون من الجاهلين\n يقول الحق جل جلاله: { ونادى نوحٌ ربَّه } بعد تعميم الغرق\n أي: أراد النداء بدليل عطف قوله: { فقال ربِّ إنَّ ابني من أهلي } \n فإنه هو النداء\n أو تكون فصيحة\n جواباً عن مقدر\n كأن قائلاً قال: ماذا في ندائه؟ فقال: إن ابني من أهلي وقد وعدتني أن تنجيني وأهلي\n { وإن وعَدَكَ الحقُّ } لا يتطرقه الخلف\n فما باله غرِق؟ { وأنت أحكمُ الحاكمين } لأنك أعلمهم وأعدلهم\n فلم أعرف وجه حكمك عليه بالغرق\n أو لأنك أكثر حكمة من ذوي الحكم\n فلم أفهم حكمة غرقه\n { قال } تعالى: { يا نوح إنه ليس من أهلك } لأنه خالفك في الدين\n ولا ولاية بين الكافر والمؤمن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:75",
      "similarity": 0.5598987096670415
    },
    {
      "verse": "26:105",
      "similarity": 0.4267117981013077
    },
    {
      "verse": "37:79",
      "similarity": 0.4156428582576366
    },
    {
      "verse": "11:25",
      "similarity": 0.3929758210786851
    },
    {
      "verse": "96:17",
      "similarity": 0.3895461277142172
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/11:45.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/11:45.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}