{
  "chapter": "هود",
  "text": "انى توكلت على الله ربى وربكم ما من دابة الا هو ءاخذۢ بناصيتها ان ربى على صرط مستقيم",
  "translations": [
    {
      "translation": "I have put my trust in Allah, my Lord and your Lord. There is no creature He does not hold by the forelock. My Lord is on a Straight Path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I place my trust in God who is my Lord and your Lord. There is no creature that moves on the earth who is not held by the forelock firmly by Him. Verily the way of my Lord is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have put my trust in Allah, Who is my Lord and your Lord. There is no moving creature which He does not hold by its forelock. Surely, My Lord is on the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I trust God who is my Lord as well as yours. It is God who controls the destiny of all living creatures. It is my Lord who knows the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I rely upon Allah, Who is my Lord and your Lord; there is not a creature that walks, whose forelock is not in His control; indeed my Lord can be found on the Straight Path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I put my trust in Allah, my Lord and your Lord! There is not a moving creature but He has the grasp of its forelock. Verily, my Lord is on the straight path (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely I rely on Allah, my Lord and your Lord; there is no living creature but He holds it by its forelock; surely my Lord is on the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, I have put my trust in God, my Lord and your Lord; there is no creature that crawls, but He takes it by the forelock. Surely my Lord is on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! I have put my trust in Allah, my Lord and your Lord. Not an animal but He doth grasp it by the forelock! Lo! my Lord is on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have put my trust in God, my Lord and your Lord. For there is no living creature which He does not hold by its forelock. My Lord is on the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily rely on Allah, my Lord and your Lord; no moving creature is there but he holdeth it by its forelock; verily my Lcrd is on the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed I have put my trust in Allah, my Lord and your Lord. There is no living being but He holds it by its forelock. Indeed my Lord is on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I put my trust in Allah, My Lord and your Lord! There is not a moving creature, but He hath grasp of its fore-lock. Verily, it is my Lord that is on a straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I put my trust in Allah, my Lord and your Lord! There is not a moving (living) creature but He has grasp of its forelock. Verily, my Lord is on the Straight Path (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In truth, I have put my trust in Allah, (who is) my Lord and your Lord. There is no crawling creature that He does not take by the forelock. Indeed, my Lord is on a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have placed my trust in God, my Lord and your Lord. There is not a creature but He holds it by the forelock. My Lord is on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, I have relied upon Allah, my Lord and your Lord. There is no creature but that He holds its forelock. Indeed, my Lord is on a path [that is] straight.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:56] Truly I have put my trust in God, my Lord and your Lord; there is no (mā min: min is extra) creature, no living thing that treads upon this earth, but He takes it by the forelock, that is, [but] He is its possessor and subjugator, so that no benefit or harm occurs except by His permission — the forelock is specifically used here because he who is taken by his forelock suffers the ultimate humiliation. Surely my Lord is on a straight path, that is, [on] the way of truth and justice.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! I have put my trust in Allah) I consign my matter to Allah, (my Lord) my Creator and Provider (and your Lord) your Creator and Provider. (Not an animal but He doth grasp it by the forelock!) He makes die and brings back to life; it is also said that this means: they are all in His grip, He does what He will (Lo! my Lord is on a straight path) upon which people must tread; it is also said that means: He calls on to a straight path: an established religion with which He is pleased, i.e. Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَّا مِن دَآبَّةٍ إِلاَّ هُوَ آخِذٌ بِنَاصِيَتِهَآ } معناهُ قادر عليها\n وقَابِضٌ عَلَيهَا\n\n",
      "translations": [
        {
          "translation": " And His saying, {There is not a creature but that it is [either] His grasp or His neck} [means that] He is capable over it.\n\n\nAnd {the} presser {upon} it",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { مَّا مِن دَآبَّةٍ } يتحرك على الأرض { إِلاَّ هُوَ } سبحانه بذاته { آخِذٌ بِنَاصِيَتِهَآ } أي: وجودها التي تلي الحق يقودها ويتصرف بها كيف يشاء حسب إرادته اختياراً { إِنَّ رَبِّي } في جميع شئونه وتطوراته { عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } [هود: 56] لا عوج له أصلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "96:16",
      "similarity": 0.7573140824649888
    },
    {
      "verse": "55:41",
      "similarity": 0.6975898267442877
    },
    {
      "verse": "96:15",
      "similarity": 0.30170382148932373
    },
    {
      "verse": "16:49",
      "similarity": 0.25731878854924795
    },
    {
      "verse": "8:55",
      "similarity": 0.2475089047617956
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/11:56.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/11:56.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/11:56.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}