{
  "chapter": "هود",
  "text": "الا انهم يثنون صدورهم ليستخفوا۟ منه الا حين يستغشون ثيابهم يعلم ما يسرون وما يعلنون انه عليمۢ بذات الصدور",
  "translations": [
    {
      "translation": "See how they wrap themselves round trying to conceal their feelings from Him! No, indeed! When they wrap their garments round themselves, He knows what they keep secret and what they make public. He knows what their hearts contain.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look, how they double up their breasts in order to hide from Him. But when they cover themselves up with their garments, He knows what they hide and what they expose. Indeed, He knows the secrets of the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! They fold up their breasts that they may conceal themselves from Him. Surely when they cover themselves up with their garments Allah knows well what they cover and what they reveal. Indeed He even knows the secrets hidden in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The unbelievers) cover their breasts to try to hide their disbelief from God. But He knows very well whatever they conceal or reveal even when they cover themselves with their garments. God certainly knows the inner-most (secrets) of the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pay heed! They fold up their breasts in order to conceal from Allah; pay heed! Even when they fully cover themselves up with their clothes, Allah knows all that what hide and all what they disclose; indeed He knows what is in the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No doubt! They did fold up their breasts, that they may hide from Him. Surely, even when they cover themselves with their garments, He knows what they conceal and what they reveal. Verily, He is the All-Knower of the (innermost secrets) of the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now surely they fold up their breasts that they may conceal (their enmity) from Him; now surely, when they use their garments as a covering, He knows what they conceal and what they make public; surely He knows what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, they fold their breasts, to hide them from Him; behold, when they wrap themselves in their garments He knows what they secrete and what they publish; surely He knows all the thoughts within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! now they fold up their breasts that they may hide (their thoughts) from Him. At the very moment when they cover themselves with their clothing, Allah knoweth that which they keep hidden and that which they proclaim. Lo! He is Aware of what is in the breasts (of men).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how they cover themselves up to hide [their thoughts] from Him. But when they cover themselves up with their garments, He knows what they hide and what they reveal. He knows their innermost thoughts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! they fold their breasts that they may hide from Him. Lo! when they cover themselves with their garments, He knoweth that which they conceal and that which they make known. Verily He is the Knower of the secrets of the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look! They fold up their breasts to hide [their secret feelings] from Him. Look! When they draw their cloaks over their heads, He knows whatever they keep secret and whatever they disclose. Indeed, He knows best whatever is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! they fold up their hearts, that they may lie hid from Him! Ah even when they cover themselves with their garments, He knoweth what they conceal, and what they reveal: for He knoweth well the (inmost secrets) of the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No doubt! They did fold up their breasts, that they may hide from Him. Surely, even when they cover themselves with their garments, He knows what they conceal and what they reveal. Verily, He is the All-Knower of the (innermost secrets) of the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See, they cover their chests to conceal from Him. But when they wrap themselves in their clothes He knows what they hide and what they reveal. Indeed, He knows every thought within the chest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wrap their chests to hide from Him. But even as they cover themselves with their clothes, He knows what they conceal and what they reveal. He knows what lies within the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unquestionably, they the disbelievers turn away their breasts to hide themselves from Him. Unquestionably, [even] when they cover themselves in their clothing, Allah knows what they conceal and what they declare. Indeed, He is Knowing of that within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:5]   As reported by al-Bukhārī [by way of an isnād] from Ibn ‘Abbās, the following was revealed regarding those who were embarrassed to withdraw [to relieve nature] or to have sexual intercourse [without their clothes] and become exposed to the heaven. It is also said: [that it was revealed] regarding the hypocrites: Lo!, they fold up their breasts that they may hide from Him, that is, [from] God; lo! the moment they cover themselves with their garments, wrapping themselves up therewith, He, God, exalted be He, knows what they keep hidden and what they proclaim, and so their hiding is to no avail. Truly He knows what is in the breasts [of men], that is, what is in the hearts.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! now they) i.e. Akhnas Ibn Shurayq and his followers (fold up their breasts) conceal in their hearts their hatred and enmity for Muhammad (pbuh) (that they may hide from him) that they may hide from Muhammad (pbuh) their hatred and enmity by keeping his company and pretending to him that they love him. (At the very moment when they cover themselves with their clothing) at the moment they cover their heads with their clothes, (Allah knoweth that which they keep hidden) among themselves as well as that which they conceal in their hearts (and that which they proclaim) of fighting and antipathy; it is also said that this refers to that which they proclaim of love and keeping company. (Lo! He is Aware of what is in the breasts (of men)) whether it is good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { { [يَثْنُونَ صُدُورَهُمْ لِيَسْتَخْفُواْ مِنْهُ أَلا حِينَ يَسْتَغْشُونَ ثِيَابَهُمْ } معناهُ يَحنونَ ظُهورَهُم\n ويَستَغشُونَ ثِيابَهُم: معناهُ يَتَغَطونَ بِهَا\n\n",
      "translations": [
        {
          "translation": " And His saying - the Most High - { { [They lower their chests to hide from Him. But when they cover themselves with their clothes } its meaning is that they are shy.\n They { } their clothes: meaning they cover themselves with them",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلا إِنَّهُمْ } أي: المحجوبون الغافلون من غاية جهلهم وغفلتهم عن الله { يَثْنُونَ } أي: يقطعون وينحرفون { صُدُورَهُمْ } عن الميل إلى الحق والتوجه نحوه طالبين { لِيَسْتَخْفُواْ مِنْهُ } أي: يستروا ويخفوا من الله ما تمكن صدورهم من الإعراض عن الحق بأوامره ورسله { أَلا } إنهم لم يعلموا ولم يتفطنوا أن الله المطلع بجميع ما جرى في ملكه يعلم منهم ما جرى عليهم وظهر منه { حِينَ يَسْتَغْشُونَ ثِيَابَهُمْ } أي: يطلبون التدثر والتغطي وقت رقودهم في مضاجعهم\n بل { يَعْلَمُ } منهم { مَا يُسِرُّونَ } في ضمائرهم { وَمَا يُعْلِنُونَ } بأفواههم ومشاعرهم\n وكيف لا يعلم سبحانه { إِنَّهُ } بذاته وأوصافه وأسمائه { عَلِيمٌ } بعلمه الحضوري { بِذَاتِ ٱلصُّدُورِ } [هود: 5] وبما هو مكنون فيها من السرائر والضمائر\n\n\n{ وَ } كيف يستبعد أمثال هذا من حيطة حضرة علمه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ألا أنهم يَثْنُونَ صدورَهم } يلوونها عن الحق وينحرفون عنه\n أو يعطفونها على الكفر وعداوة النبي صلى الله عليه وسلم\n أو يولون ظهورهم إلى النبي صلى الله عليه وسلم لئلا يروه من شدة البغض والعداوة\n { ليستخفوا منه } أي: من الرسول ـ عليه الصلاة والسلام ـ أو: من الله بسرهم\n فلا يطلع رسوله والمؤمنين عليه\n قيل: إنها نزلت في طائفة من المشركين\n قالوا: إن أرخينا ستورنا\n واستغشينا ثيابنا\n وطوينا صدورنا على عداوة محمد صلى الله عليه وسلم كيف يعلم ذلك؟ والحاصل: أن الإثناء إن كان عن الحق ـ فالضمير في: منه\n يعود على الله\n وإن كان عن النبي صلى الله عليه وسلم فالضمير يعود عليه وفي البخاري عن ابن عباس: أنها نزلت فيمن كان يستحي أن يتخَلّى أو يجامع فيفضي إلى السماء\n  وقوله: { ألا حين يستغشون ثيابهم }: يحتمل أن يكون عند النوم\n فيكون الإثناء عن الحق\n أو عن الله\n أو عند مواجهة الرسول\n فيكون الإثناء عن رؤيته ـ عليه الصلاة والسلام ـ\n أو عن سماع القرآن\n قال تعالى: { يعلم ما يسرون } في قلوبهم\n { وما يعلنون } بأفواههم ـ فقد استوى في علمه سرهم وعلانيتهم\n فكيف يخفى عليه أمرهم واستخفاؤهم منه؟ { إنه عليم بذات الصدور } أي: بالأسرار صاحبة الصدور\n أو بحقائق الصدور وما احتوت عليه\n  الإشارة: يقول الحق جل جلاله: هذا كتاب أحكمت آياته بالتعريف بالذات\n ثم فصلت ببيان الصفات\n أو: أحكمت بتبيين الحقائق\n ثم فصلت بتبيين الشرائع: أو أحكمت ببيان ما يتعلق بعالم الأرواح من التعريف\n ثم فصلت ببيان ما يتعلق بعالم الأشباح من التكليف\n أو: أحكمت ببيان أسرار الملكوت\n ثم فصلت ببيان أحكام الملك\n ثم بيَّن ما يتعلق بالذات فقال: { ألا تعبدون إلا الله } وبيَّن ما يتعلق بالصفات من التفصيل فقال: { وأن استغفروا ربكم ثم توبوا إليه } \n أو: بيَّن ما يتعلق بالحقائق\n ثم ما يتعلق بالشرائع\n وهكذا\n فإن جمعتم بين الحقائق والشرائع يمتعكم متاعاً حسناً بشهود ذاته\n والتنزه في أنوار صفاته\n إلى أجل مسمى\n وهو: النزول في مقعد صدق عند مليك مقتدر\n ويؤت كل ذي فضل من المعرفة جزاء فضله من الشهود\n فمن تولى عن هذا خاف من عذاب يوم كبير\n وهو: غم الحجاب\n والتخلف عن الأحباب\n ثم عاتب أهل الشهود حيث تركوا مقام المشاهدة وتنزلوا إلى مقام المراقبة\n بقوله: { ألا إنهم يثنون صدورهم\n\n\n } \n الآية\n ثم بيَّن كما لعلمه تكميلاً لقوله: { يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ } \n فقال: { وَمَا مِن دَآبَّةٍ فِي ٱلأَرْضِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:4",
      "similarity": 0.515442189646763
    },
    {
      "verse": "14:38",
      "similarity": 0.4406694308647931
    },
    {
      "verse": "16:19",
      "similarity": 0.41460251564555456
    },
    {
      "verse": "2:77",
      "similarity": 0.41064067809811433
    },
    {
      "verse": "71:9",
      "similarity": 0.408004257866422
    }
  ]
}