{
  "chapter": "هود",
  "text": "ولما جاء امرنا نجينا هودا والذين ءامنوا۟ معه برحمة منا ونجينهم من عذاب غليظ",
  "translations": [
    {
      "translation": "When Our command came, We rescued Hud and those who had iman along with him by a mercy from Us. We rescued them from a harsh punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when Our command was issued We rescued Hud by Our grace, and those who believed, with him, and saved them from a dreadful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our com-mand came to pass, We delivered Hud, together with those who shared his faith, out of special mercy from Us. We delivered them from a woeful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our decree (of destroying them) was fulfilled, We mercifully saved Hud and his believing followers. We saved them from the intense torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We rescued Hud and the Muslims who were with him, by Our mercy; and We saved them from a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our commandment came, We saved Hud and those who believed with him by a mercy from Us, and We saved them from a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our decree came to pass, We delivered Hud and those who believed with him with mercy from Us, and We delivered them from a hard chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We delivered Hood and those who believed with him by a mercy from Us, and delivered them from a harsh chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our commandment came to pass We saved Hud and those who believed with him by a mercy from Us; We saved them from a harsh doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our command came, We delivered Hud and those who believed with him by Our special mercy. We saved them from a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then when Our decree came to pass, We delivered Hud and these who believed with him by a mercy from us; and We delivered them: from a torment rough.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our edict came, We delivered Hud and the faithful who were with him, by a mercy from Us, and We delivered them from a harsh punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Our decree issued, We saved Hud and those who believed with him, by (special) Grace from Ourselves: We saved them from a severe penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Commandment came, We saved Hud and those who believed with him by a Mercy from Us, and We saved them from a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We saved Hood, together with those who believed with him through Our Mercy, and saved them from a harsh punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our decree came, We saved Hud and those who believed with him, by a mercy from Us, and We delivered them from a harsh punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We saved Hud and those who believed with him, by mercy from Us; and We saved them from a harsh punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:58] And when Our command, Our chastisement, came to pass We delivered Hūd and those who believed with him by a mercy, by guidance, from Us, and We delivered them from a harsh, a severe, chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Our commandment) Our chastisement (came to pass We saved Hud and those who believed with him by a mercy from Us) by a grace from Us; (We saved them from a harsh doom) a severe chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا } تمادوا في الغفلة والإعراض\n وبالغوا في الإصرار والاستكبار { جَآءَ أَمْرُنَا } بالريح\n فعصفت عليهم السموم\n وكانت تدخل من أنوفهم وأفواههم فقطعت أمعاءهم فهلكوا\n ولما أخذناهم بما أخذناهم { نَجَّيْنَا } من مقام جودنا { هُوداً } الداعي لهم إلى سبيل الحق { وَ } نجينا أيضاً { ٱلَّذِينَ آمَنُواْ } منهم { مَعَهُ بِرَحْمَةٍ مِّنَّا } تفضلاً عليهم وامتناناً { وَ } ما اقتصرنا على إنجائهم\n بل { نَجَّيْنَاهُمْ } كرامة منا إياهم { مِّنْ عَذَابٍ غَلِيظٍ } [هود: 58] معد لأولئك الكفرة في النشأة الأخرى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: إنما قال هنا وفي قصة شعيب: ولما\n بالواو\n وفي قصة صالح ولوط: فلما\n بالفاء لأن قصة صالح ولوط ذكرهما بعد الوعيد\n في الفاء التي تقتضي التسبب\n كما تقول: وعدته فما جاء الوعيد كان\n\n الخ\n بخلاف قصة هود وشعيب لم يتقدم ذلك فيهما\n فعطف بالواو\n قاله الزمخشري\n يقول الحق جل جلاله: { ولما جاء أمرُنا }: عذابنا\n أو أمرنا بالعذاب\n { نجينا هوداً والذين آمنوا معه برحمة منا } \n وكانوا أربعة آلاف\n { ونجيناكم من عذابٍ غليظ } \n وهو ريح السموم\n وكانت تدخل أنوف الكفرة وتخرج من أدبارهم فتقطع أمعاءهم\n والتكرير لبيان ما نجاهم منه\n وإعلاماً بأنه عذاب غليظ\n وتعديداً للنعمة في نجاتهم\n ويحتمل أن يريد النجاة الأولى: من عذاب الدنيا\n وهو الريح الذي نزل بقومهم\n وبالنجاة الثانية: عذاب الآخرة\n وهو العذاب الغليظ\n ولذلك عطفه على النجاة الأولى التي أراد بها النجاة من الريح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:123",
      "similarity": 0.6098883528067551
    },
    {
      "verse": "31:24",
      "similarity": 0.5640439097523883
    },
    {
      "verse": "41:50",
      "similarity": 0.4456201141098663
    },
    {
      "verse": "9:73",
      "similarity": 0.4080654368697314
    },
    {
      "verse": "66:9",
      "similarity": 0.4080654368697314
    }
  ]
}