{
  "chapter": "هود",
  "text": "ويقوم استغفروا۟ ربكم ثم توبوا۟ اليه يرسل السماء عليكم مدرارا ويزدكم قوة الى قوتكم ولا تتولوا۟ مجرمين",
  "translations": [
    {
      "translation": "My people! Ask forgiveness of your Lord and then make tawba to Him. He will send heaven down to you in abundant rain, and increase you with strength upon strength. Do not turn away as evildoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, beg your Lord to forgive you, and turn to Him in repentance. He will send down rain in torrents for you from the shies, and give you added strength. So do not turn away from Him as sinners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people! Ask your Lord for forgiveness and turn to Him in repentance. He will shower abundant rains upon you from the heaven, and will add strength to your strength. Do not turn away as those given to guilt.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, seek forgiveness from your Lord and turn to Him in repentance. He will send you abundant rain from the sky and will increase your power. Do not sinfully turn away from Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And O my people! Seek forgiveness from your Lord, then incline towards Him in repentance – He will send abundant rain from the sky upon you and will give you much more strength than you have – and do not turn away committing crimes!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Ask forgiveness of your Lord and then repent to Him, He will send you (from the sky) abundant rain, and add strength to your strength, so do not turn away as criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! ask forgiveness of your Lord, then turn to Him; He will send on you clouds pouring down abundance of rain and add strength to your strength, and do not turn back guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people, ask forgiveness of your Lord, then repent to Him, and He will loose heaven in torrents upon you, and He will increase you in strength unto your strength; and turn not your backs as sinners.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! Ask forgiveness of your Lord, then turn unto Him repentant; He will cause the sky to rain abundance on you and will add unto you strength to your strength. Turn not away, guilty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, seek forgiveness of your Lord and turn to Him in repentance. He will send from the sky abundant rain upon you; He will add strength to your strength. Do not turn away from Him as evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My people! ask forgiveness of your Lord, then repent tcward Him; He will send the heaven upon you pouring, land He will add ycu strength upon your strength, and turn not away as guilty ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O my people! Plead with your Lord for forgiveness, then turn to Him penitently: He will send copious rains for you from the sky, and add power to your [present] power. So do not turn your backs [on Him] as guilty ones.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Ask forgiveness of your Lord, and turn to Him (in repentance): He will send you the skies pouring abundant rain, and add strength to your strength: so turn ye not back in sin!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Ask forgiveness of your Lord and then repent to Him, He will send you (from the sky) abundant rain, and add strength to your strength, so do not turn away as Mujrimun (criminals, disbelievers in the Oneness of Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My nation, ask your Lord to forgive you and turn to Him in repentance. From the sky He will loose an abundance (of rain) upon you; He will add strength to your strength. Do not turn away as sinners'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people, ask forgiveness from your Lord, and repent to Him. He will release the sky pouring down upon you, and will add strength to your strength. And do not turn away and be wicked.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people, ask forgiveness of your Lord and then repent to Him. He will send [rain from] the sky upon you in showers and increase you in strength [added] to your strength. And do not turn away, [being] criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:52]   And, O my people, ask forgiveness of your Lord, for [your] idolatry, then turn, return, to Him repentant, through obedience; He will release the sky, [He will release] the rain — for they had been denied it — upon you in abundance, with abundant rainfall, and He will add to you strength to your strength, through wealth and children. Do not turn away as sinners’, idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And, my people! Ask forgiveness of your Lord) believe in Allah's divine Oneness, (then turn unto Him repentant) then betake yourself to Him through repentance and sincerity; (He will cause the sky to rain abundance on you) whenever you need it (and will add unto you strength to your strength) by giving you wealth and offspring. (Turn not away) from faith and repentance, (guilty!) associating others with Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويا قوم اسْتَغفروا ربّكم } من ذنوب حجب صفات النفس والوقوف مع الهوى بالشرك { ثم توبوا إليه } بالتوجه إلى التوحيد والسلوك في طريقه بالتجرّد والتنوّر\n يرسل سماء الروح { عليكم مِدْرَاراً } بماء العلوم الحقيقية والمعارف اليقينية { ويزدكم } قوّة الكمال { إلى } قوة الاستعداد ولا تعرضوا عنه { مجرمين } بظهور صفات نفوسكم وتوجهكم إلى الجهة السفلية بمحبة الدنيا ومتابعة الطبيعة\n { قالوا يا هود ما جئتنا ببيّنة } لقصور فهمهم وعمى بصيرتهم عن إدراك البرهان لمكان الغشاوات الطبيعية وإذا لم يدركوه أنكروه بالضرورة { إني توكلت على الله ربي وربكم ما من دابّة إلاّ هو آخذ بناصيتها } بين وجوب التوكل على الله وكونه حصناً حصيناً أولاً بأن ربوبيته شاملة لكل أحد، ومن يربّ يدبر أمر المربوب ويحفظه فلا حاجة له إلى كلاءة غيره وحفظه\n ثم بان كل ذي نفس تحت قهره وسلطانه أسير في يد تصرفه ومملكته وقدرته عاجز عن الفعل والقوة والتأثير في غيره لا حراك به بنفسه كالميت فلا حاجة إلى الاحتراز منه والتحفظ ثم بأنه { على صِرَاطٍ مُسْتَقيم } أي: على طريق العدل في عالم الكثرة الذي هو ظل وحدته فلا يسلط أحداً على أحد إلا عن استحقاق له لذلك بسبب ذنب وجرم ولا يعاقب أحداً من غير زلّة ولو صغيرة وقد يكون لتزكية ورفع درجة كالشهادة وفي ضمن ذلك كله نفي القدرة على النفع والضرّ عنهم وعن آلهتهم\n { ويا قوم هذه ناقة الله } قد مرّ تأويل الناقة، وأما إنجاء صالح ومن معه على التأويل المذكور فكإنجاء عيسى عليه السلام من الصَلْب كما جاء في قوله تعالى:\n\n[النساء: 157]، وفي قوله:\n\n[النساء، الآيات: 157-158]\n وكإنجاء مؤمن آل فرعون على ما أشار إليه بقوله تعالى:\n",
      "translations": [
        {
          "translation": "\n\n{O my people! Repent to your Lord} from the sins that cover the qualities of the soul and stand with the will in associating {then turn to Him} by turning to Tawhid and behaving in His way with sincerity and enlightenment.\n\n\nThe Spirit sends down {to you a guide} with the true knowledge and certain understanding {and makes you} strong and perfect {to} the strength of readiness, and do not expose yourselves {criminals} by showing your own qualities and turning to the lower side with love of the world and following nature.\n\n\n{They said, \"O Hud, you have not brought us any clear evidence.\"} They were too proud to understand, and too blind to see the evidence that was right in front of them. If they had not understood it, they would have denied it {I have entrusted myself to Allah, my Lord and your Lord. There is no creature but that He takes hold of its forelock. } This shows the importance of trusting in Allah and that He is a strong and powerful protector. First, because His Lordship includes everyone.,\n\nAnd whoever fears Allah, ponders the affairs of the one who is entrusted to him, and protects him, there is no need for him to take anyone else as a protector.\n\n\nThen every soul will be under the complete control of God, powerless to act or influence anything else. There will be no need to protect oneself from {on a straight path} i.e. following the path of justice in a world where everyone is equal. No one will have any power over anyone else except by merit. This is because of sins and crimes, and no one will be punished except for their own wrongdoing, even if it is small. This can be for purification and raising one's status, like getting a certificate. In addition to all this, it completely negates the ability of people and their gods to benefit or harm anyone.\n\n\n{And you, O people, this is the she-camel of God} The interpretation of the she-camel has passed,\n\nAnd as for the good news of Jesus, and those with him, on the interpretation mentioned, then the coming of Jesus is like the coming of the Messiah, as it is in the saying of Allah:\n\n\nThe women: 157,\nAnd in His saying:\n\n\"And if you should count the favors of Allah , you could not enumerate them. Indeed, Allah is Forgiving and Merciful.\" [An-Nahl: 18]\n\n{ وَلَو أَنَّ أَهْلَ الْكِتَابِ آمَنُوا وَاتَّقُوا }\n\nEnglish:\n{And if only the people of the Scripture had believed and feared Allah },\n\n\nThe women,\n\nThe verses read: { 157-158 }\n\n\nAnd as if the believing family of Pharaoh had not been warned of what was to come by Allah's statement:",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما ازدادوا الإصرار والاستكبار، أخذهم الله بعقم الأرحام والأمطار فاضطروا، قال هود عليه السلام: { يٰقَوْمِ ٱسْتَغْفِرُواْ رَبَّكُمْ } من فرطاتكم وهفواتكم، واطلبوا المغفرة والنجاة منه { ثُمَّ تُوبُوۤاْ } واسترجعوا { إِلَيْهِ } نادمين مخلصين { يُرْسِلِ ٱلسَّمَآءَ عَلَيْكُمْ } بأمر الله تفضلاً وامتناناً { مِّدْرَاراً } أمطاراً كثيرة على سبيل التتابع والإدرار { وَيَزِدْكُمْ قُوَّةً إِلَىٰ قُوَّتِكُمْ } أي: يضاعف أولادكم التي هو قوة ظهوركم { وَ } عليكم أن { لاَ تَتَوَلَّوْاْ } على الله حال كونكم { مُجْرِمِينَ } [هود: 52] معرضين وعن رسله مصرين على ما أنتم عليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:11",
      "similarity": 0.845261961907363
    },
    {
      "verse": "6:6",
      "similarity": 0.5676941571037714
    },
    {
      "verse": "24:35",
      "similarity": 0.17413572457754087
    },
    {
      "verse": "3:90",
      "similarity": 0.16968429269276608
    },
    {
      "verse": "28:78",
      "similarity": 0.1643617551935847
    }
  ]
}