{
  "chapter": "هود",
  "text": "ويقوم استغفروا۟ ربكم ثم توبوا۟ اليه يرسل السماء عليكم مدرارا ويزدكم قوة الى قوتكم ولا تتولوا۟ مجرمين",
  "translations": [
    {
      "translation": "My people! Ask forgiveness of your Lord and then make tawba to Him. He will send heaven down to you in abundant rain, and increase you with strength upon strength. Do not turn away as evildoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, beg your Lord to forgive you, and turn to Him in repentance. He will send down rain in torrents for you from the shies, and give you added strength. So do not turn away from Him as sinners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people! Ask your Lord for forgiveness and turn to Him in repentance. He will shower abundant rains upon you from the heaven, and will add strength to your strength. Do not turn away as those given to guilt.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, seek forgiveness from your Lord and turn to Him in repentance. He will send you abundant rain from the sky and will increase your power. Do not sinfully turn away from Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And O my people! Seek forgiveness from your Lord, then incline towards Him in repentance – He will send abundant rain from the sky upon you and will give you much more strength than you have – and do not turn away committing crimes!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Ask forgiveness of your Lord and then repent to Him, He will send you (from the sky) abundant rain, and add strength to your strength, so do not turn away as criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! ask forgiveness of your Lord, then turn to Him; He will send on you clouds pouring down abundance of rain and add strength to your strength, and do not turn back guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people, ask forgiveness of your Lord, then repent to Him, and He will loose heaven in torrents upon you, and He will increase you in strength unto your strength; and turn not your backs as sinners.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! Ask forgiveness of your Lord, then turn unto Him repentant; He will cause the sky to rain abundance on you and will add unto you strength to your strength. Turn not away, guilty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, seek forgiveness of your Lord and turn to Him in repentance. He will send from the sky abundant rain upon you; He will add strength to your strength. Do not turn away from Him as evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My people! ask forgiveness of your Lord, then repent tcward Him; He will send the heaven upon you pouring, land He will add ycu strength upon your strength, and turn not away as guilty ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O my people! Plead with your Lord for forgiveness, then turn to Him penitently: He will send copious rains for you from the sky, and add power to your [present] power. So do not turn your backs [on Him] as guilty ones.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Ask forgiveness of your Lord, and turn to Him (in repentance): He will send you the skies pouring abundant rain, and add strength to your strength: so turn ye not back in sin!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Ask forgiveness of your Lord and then repent to Him, He will send you (from the sky) abundant rain, and add strength to your strength, so do not turn away as Mujrimun (criminals, disbelievers in the Oneness of Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My nation, ask your Lord to forgive you and turn to Him in repentance. From the sky He will loose an abundance (of rain) upon you; He will add strength to your strength. Do not turn away as sinners'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people, ask forgiveness from your Lord, and repent to Him. He will release the sky pouring down upon you, and will add strength to your strength. And do not turn away and be wicked.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people, ask forgiveness of your Lord and then repent to Him. He will send [rain from] the sky upon you in showers and increase you in strength [added] to your strength. And do not turn away, [being] criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:52]   And, O my people, ask forgiveness of your Lord, for [your] idolatry, then turn, return, to Him repentant, through obedience; He will release the sky, [He will release] the rain — for they had been denied it — upon you in abundance, with abundant rainfall, and He will add to you strength to your strength, through wealth and children. Do not turn away as sinners’, idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And, my people! Ask forgiveness of your Lord) believe in Allah's divine Oneness, (then turn unto Him repentant) then betake yourself to Him through repentance and sincerity; (He will cause the sky to rain abundance on you) whenever you need it (and will add unto you strength to your strength) by giving you wealth and offspring. (Turn not away) from faith and repentance, (guilty!) associating others with Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n يرسل سماء الروح { عليكم مِدْرَاراً } بماء العلوم الحقيقية والمعارف اليقينية { ويزدكم } قوّة الكمال { إلى } قوة الاستعداد ولا تعرضوا عنه { مجرمين } بظهور صفات نفوسكم وتوجهكم إلى الجهة السفلية بمحبة الدنيا ومتابعة الطبيعة\n { قالوا يا هود ما جئتنا ببيّنة } لقصور فهمهم وعمى بصيرتهم عن إدراك البرهان لمكان الغشاوات الطبيعية وإذا لم يدركوه أنكروه بالضرورة { إني توكلت على الله ربي وربكم ما من دابّة إلاّ هو آخذ بناصيتها } بين وجوب التوكل على الله وكونه حصناً حصيناً أولاً بأن ربوبيته شاملة لكل أحد\n ومن يربّ يدبر أمر المربوب ويحفظه فلا حاجة له إلى كلاءة غيره وحفظه\n ثم بان كل ذي نفس تحت قهره وسلطانه أسير في يد تصرفه ومملكته وقدرته عاجز عن الفعل والقوة والتأثير في غيره لا حراك به بنفسه كالميت فلا حاجة إلى الاحتراز منه والتحفظ ثم بأنه { على صِرَاطٍ مُسْتَقيم } أي: على طريق العدل في عالم الكثرة الذي هو ظل وحدته فلا يسلط أحداً على أحد إلا عن استحقاق له لذلك بسبب ذنب وجرم ولا يعاقب أحداً من غير زلّة ولو صغيرة وقد يكون لتزكية ورفع درجة كالشهادة وفي ضمن ذلك كله نفي القدرة على النفع والضرّ عنهم وعن آلهتهم\n { ويا قوم هذه ناقة الله } قد مرّ تأويل الناقة\n وأما إنجاء صالح ومن معه على التأويل المذكور فكإنجاء عيسى عليه السلام من الصَلْب كما جاء في قوله تعالى:\n[النساء: 157]\n وفي قوله:\n[النساء\n الآيات: 157-158]\n وكإنجاء مؤمن آل فرعون على ما أشار إليه بقوله تعالى:\n[غافر\n الآية: 45]",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n قال هود عليه السلام: { يٰقَوْمِ ٱسْتَغْفِرُواْ رَبَّكُمْ } من فرطاتكم وهفواتكم\n واطلبوا المغفرة والنجاة منه { ثُمَّ تُوبُوۤاْ } واسترجعوا { إِلَيْهِ } نادمين مخلصين { يُرْسِلِ ٱلسَّمَآءَ عَلَيْكُمْ } بأمر الله تفضلاً وامتناناً { مِّدْرَاراً } أمطاراً كثيرة على سبيل التتابع والإدرار { وَيَزِدْكُمْ قُوَّةً إِلَىٰ قُوَّتِكُمْ } أي: يضاعف أولادكم التي هو قوة ظهوركم { وَ } عليكم أن { لاَ تَتَوَلَّوْاْ } على الله حال كونكم { مُجْرِمِينَ } [هود: 52] معرضين وعن رسله مصرين على ما أنتم عليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم توبوا إليه } \n ثم ارجعوا إليه بطاعته فيما أمر ونهى\n أو: ثم توبوا من المعاصي لأن التوبة من الذنوب لا تصح إلا بعد الإيمان\n والتطهير من الشرك\n { يُرسل السماء عليكم مدراراً } أي: كثير الدر\n أي النزول\n { ويَزدْكُم قوة إلى قوتكم }: يضاعف قوتكم\n ويزدكم فيها\n وإنما دعاهم إلى الله\n ووعدهم بكثرة المطر وزيادة القوة لأنهم كانوا أصحاب زروع وعمارات\n وقيل: حبس الله عنهم المطر\n وأعقم أرحام نسائهم ثلاثين سنة فوعدهم هود عليه السلام على الإيمان والتوبة بالأمطار وتضاعف القوة بالتناسل\n قاله البيضاوي\n وقال ابن جزي: وفي الآية دليل على أن التوبة والاستغفار سبب لنزول المطر\n رُوي: أن عاداً كان المطر قد حُبس عنهم ثلاث سنين\n فأمرهم بالتوبة والاستغفار\n ووعدهم على ذلك بالمطر\n هـ\n { ولا تتولَّوا }: ولا تُعرضوا عما أدعوكم إليه\n { مجرمين } مصرين على إجرامكم\n الإشارة: في تكرير القصص والأخبار وَعظ وتذكير لأهل الاعتبار\n وزيادة إيقان لأهل الاستبصار\n وتهديد وتخويف لأهل الإصرار\n وحث على المبادرة إلى التوبة والاستغفار\n وقوله تعالى: { ويا قوم استغفروا ربكم ثم توبوا إليه } \n أي: استغفروا ربكم من الشرك الخفي\n ثم توبوا إليه من النظر إلى وجودكم\n ورؤية أعمالكم\n يرسل سحاب الواردات الإلهية والعلوم الإلهامية على قلوبكم وأسراركم\n مدراراً\n ويزدكم قوة في شهود الذات إلى قوتكم في شهود الصفات\n ولا تتولوا عن شهوده بشهود أثره\n مجرمين معدودين في زمرة المجرمين المصرين على الكبائر\n وهم لا يشعرون\n وقال الورتجبي: استغفروا من النظر إلى غيري\n وتوبوا إليَّ من نفوسكم\n ورؤية طاعتكم وأعواضها\n يرسل سماء القدم على قلوبكم مدرار أنوار تجليها\n ويزدكم\n أي: يزد قوة أرواحكم في طيرانها\n انظر تمامه\n ثم ذكر ما أجابه به قومه\n فقال: { قَالُواْ يٰهُودُ مَا جِئْتَنَا بِبَيِّنَةٍ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:11",
      "similarity": 0.845261961907363
    },
    {
      "verse": "6:6",
      "similarity": 0.5676941571037714
    },
    {
      "verse": "24:35",
      "similarity": 0.17413572457754087
    },
    {
      "verse": "3:90",
      "similarity": 0.16968429269276608
    },
    {
      "verse": "28:78",
      "similarity": 0.1643617551935847
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/11:52.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/11:52.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}