{
  "chapter": "هود",
  "text": "يقوم لا اسـلكم عليه اجرا ان اجرى الا على الذى فطرنى افلا تعقلون",
  "translations": [
    {
      "translation": "My people! I do not ask you for any wage for it. My wage is the responsibility of Him who brought me into being. So will you not use your intellect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, I ask no recompense of you for it: My reward is with Him who created me. Will you not, therefore, understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people! I seek no reward from you for my work. My reward lies only with Him Who created me. Do you not understand anything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, I do not ask any reward for what I have preached to you. No one can give me my reward except my Creator. Will you then not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people! I do not ask any fee from you for it; my reward is only upon Him Who has created me; so do you not have sense?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people I ask of you no reward for it (the Message). My reward is only from Him Who created me. Will you not then understand\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! I do not ask of you any reward for it; my reward is only with Him Who created me; do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, I do not ask of you a wage for this; my wage falls only upon Him who did originate me; will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! I ask of you no reward for it. Lo! my reward is the concern only of Him Who made me. Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I ask of you nothing in return for this [Message]. My recompense is with Him who has created me. Why do you not use your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My people! I ask of you no hire therefor, my hire is cnly on Him who created me, will ye not then reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O my people! I do not ask you any reward for it. My reward lies only with Him who originated me. Do you not exercise your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! I ask of you no reward for this (Message). My reward is from none but Him who created me: Will ye not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people I ask of you no reward for it (the Message). My reward is only from Him, Who created me. Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My nation, for this I ask of you no wage. My wage is only with He who created me. Will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people, I ask you no wage for it; my wage lies with Him who originated me. Do you not understand?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, I do not ask you for it any reward. My reward is only from the one who created me. Then will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:51] O my people, I do not ask of you any wage for it, for the affirmation of His Oneness. Lo! my wage falls only upon Him Who originated me, created me. Will you not understand?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my people! I ask of you no reward) no price (for it) for believing in Allah's divine Oneness. (Lo! my reward is the concern only of Him who made me) Who created me. (Have ye then no sense?) do you not believe? Are you not possessed of the same mind that human beings possess?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰقَوْمِ } اسمعوا قولي واتعظوا به وامضوا بمقتضاه واقبلوا نصحي؛ إذ { لاۤ أَسْأَلُكُمْ عَلَيْهِ أَجْراً } ولا أطلب منكم عوضاً، بل أنا مأمور بالتبليغ والتذكير من عند العليم الخبير { إِنْ أَجْرِيَ إِلاَّ عَلَى ٱلَّذِي فَطَرَنِيۤ } أي: بعثني بالإرشاد والإهداء، أتشكون في أمري وتترددون في شأني وتذكيري ونصحي؟ { أَفَلاَ تَعْقِلُونَ } [هود: 51] وتستعملون عقولكم في أفعالكم القبيحة وأعمالكم الفاسدة الناكبة عن طريق الاعتدال الذي هو صراط الله الأقوم الأعدل؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:27",
      "similarity": 0.6532877857124453
    },
    {
      "verse": "82:1",
      "similarity": 0.6522134498974745
    },
    {
      "verse": "36:22",
      "similarity": 0.6238246041185991
    },
    {
      "verse": "21:56",
      "similarity": 0.5927394401729056
    },
    {
      "verse": "73:18",
      "similarity": 0.5918981657460296
    }
  ]
}