{
  "chapter": "هود",
  "text": "واتبعوا۟ فى هذه الدنيا لعنة ويوم القيمة الا ان عادا كفروا۟ ربهم الا بعدا لعاد قوم هود",
  "translations": [
    {
      "translation": "They were pursued by a curse in this world and on the Day of Rising. Yes indeed! 'Ad rejected their Lord, so away with 'Ad, the people of Hud!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they were accursed in the world, and they will be damned on the Day of Doom. Beware! The 'Ad turned away from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were pursued by a curse in this world, and so will they be on the Day of Judgement. Lo! 'Ad disbelieved in the Lord. Lo! ruined are 'Ad, the people of Hud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were condemned in this life and will be condemned in the life hereafter. The tribe of Ad had certainly rejected their Lord. God kept the tribe of Ad, the people of Hud, away from His mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a curse followed them in the world, and on the Day of Resurrection; pay heed! Indeed A’ad disbelieved in their Lord; away with A’ad, the people of Hud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were pursued by a curse in this world and (so they will be) on the Day of Resurrection. No doubt! Verily, `Ad disbelieved in their Lord. So away with `Ad, the people of Hud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were overtaken by curse in this world and on the resurrection day; now surely Ad disbelieved in their Lord; now surely, away with Ad, the people of Hud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there was sent following after them in this world a curse, and upon the Day of Resurrection: 'Surely Ad disbelieved in their Lord: so away with Ad, the people of Hood!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a curse was made to follow them in the world and on the Day of Resurrection. Lo! A'ad disbelieved in their Lord. A far removal for A'ad, the folk of Hud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were pursued by a curse in this world as they will be on the Day of Resurrection. Indeed, the 'Ad denied their Lord. So away with the 'Ad, the people of Hud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were followed in this world by a curse, and so will they be on the Judgment Day. Lo! verily 'Aad disbelieved in thy Lord. Lo! away with 'Aad, the people of Hud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they were pursued by a curse in this world and on the Day of Resurrection. Behold! ‘Ad indeed defied their Lord. Now, away with ‘Ad, the people of Hud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were pursued by a Curse in this life,- and on the Day of Judgment. Ah! Behold! for the 'Ad rejected their Lord and Cherisher! Ah! Behold! removed (from sight) were 'Ad the people of Hud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were pursued by a curse in this world and (so they will be) on the Day of Resurrection. No doubt! Verily, 'Ad disbelieved in their Lord. So away with 'Ad, the people of Hud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were overtaken by a curse in this world, and (they shall be cursed) on the Day of Resurrection. Indeed, Aad disbelieved in their Lord. Gone are Aad, the nation of Hood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were pursued by a curse in this world, and on the Day of Resurrection. Indeed, Aad blasphemed against their Lord—so away with Aad, the people of Hud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were [therefore] followed in this world with a curse and [as well] on the Day of Resurrection. Unquestionably, 'Aad denied their Lord; then away with 'Aad, the people of Hud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:60] And a curse was made to follow them in this world, from people, and on the Day of Resurrection, a curse [will follow them] for all creatures to see. ‘Lo! ‘Ād disbelieved in, they knowingly denied, their Lord. Lo! away, [far] from God’s mercy, with ‘Ād, the folk of Hūd!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And a curse was made to follow them in the world) they were destroyed in the life of this world by the wind (and on the Day of Resurrection) they will receive another curse, which is the Fire. (Lo! 'Aad disbelieved in their Lord) they denied their Lord. (A far removal for 'Aad, the folk of Hud) from Allah's mercy!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لذلك { أُتْبِعُواْ فِي هَـٰذِهِ ٱلدُّنْيَا لَعْنَةً وَيَوْمَ ٱلْقِيَامَةِ } أي: صاروا متبوعين للطرد والتخذيل في النشأة الأولى والأخرى { أَلاۤ } تنبهوا يا أولي الأبصار والاعتبار { إِنَّ عَاداً } المعاندين { كَفَرُواْ رَبَّهُمْ } نعمه وجحدوا توحيده { أَلاَ بُعْداً } طردً وتخذيلاً وتبعيداً عن ساحة عز احضور { لِّعَادٍ قَوْمِ هُودٍ } [هود: 60] أردفه بعطف البيان للتمييز عن عاد إرم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:18",
      "similarity": 0.4897870724562075
    },
    {
      "verse": "7:65",
      "similarity": 0.4663589856500944
    },
    {
      "verse": "11:50",
      "similarity": 0.4455160202006279
    },
    {
      "verse": "5:51",
      "similarity": 0.3521585903965101
    },
    {
      "verse": "26:124",
      "similarity": 0.3506379946940905
    }
  ]
}