{
  "chapter": "هود",
  "text": "ويقوم هذه ناقة الله لكم ءاية فذروها تاكل فى ارض الله ولا تمسوها بسوء فياخذكم عذاب قريب",
  "translations": [
    {
      "translation": "My people! Here is the she-camel of Allah as a Sign for you. So leave her alone to eat on Allah's earth and do not inflict any harm on her or you will be overcome by an imminent punishment.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, this she-camel of God is a token for you. So leave her alone to graze on God's earth, and do not molest her, otherwise the swiftest punishment would befall you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people! This she-camel of Allah is a sign for you. So let her pasture on Allah's earth, and do not hurt her or else some chastisement - which is near at hand -should overtake you.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, this is the she-camel of God, a miracle (to support the truth which has been brought) to you. Leave her to graze in the land of God. Do not harm her with your evil deeds lest torment will suddenly strike you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And O my people! This is the she-camel of Allah – a sign for you – so let her graze in Allah’s earth, and do not touch her with an evil intention for an imminent punishment will reach you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! This she-camel of Allah is a sign to you, so leave her to graze in Allah's land, and touch her not with evil, lest a near torment should seize you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! this will be (as) Allah's she-camel for you, a sign; therefore leave her to pasture on Allah's earth and do not touch her with evil, for then a near chastisement will overtake you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, this is the She-camel of God, to be a sign for you. Leave her that she may eat in God's earth, and touch her not with evil, lest you' be seized by a nigh chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! This is the camel of Allah, a token unto you, so suffer her to feed in Allah's earth, and touch her not with harm lest a near torment seize you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people! This she-camel of God is a sign for you. So leave her alone to graze on God's earth. And do her no harm, lest you should be instantly afflicted with a torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! yonder is the she-camel of Allah: a sign unto you; so let her alone, feeding in Allah's land, and touch her not with evil, lest there may overtake you a torment nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! This she-camel of Allah is a sign for you. Let her graze [freely] in Allah’s land, and do not cause her any harm, for then you shall be seized by a prompt punishment.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! This she-camel of Allah is a symbol to you: leave her to feed on Allah's (free) earth, and inflict no harm on her, or a swift penalty will seize you!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! This she-camel of Allah is a sign to you, leave her to feed on Allah's earth, and touch her not with evil, lest a near torment will seize you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My nation, this is the shecamel of Allah, a sign for you. Leave her to graze upon the earth of Allah and do not touch her with evil lest you be seized by a punishment that is near'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people, this is the she-camel of God, a sign for you. Let her graze on God’s land, and do not harm her, lest an imminent punishment overtakes you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people, this is the she-camel of Allah - [she is] to you a sign. So let her feed upon Allah 's earth and do not touch her with harm, or you will be taken by an impending punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:64] And, O my people, this is the she-camel of God, a sign for you (āyatan is a circumstantial qualifier operated by the demonstrative noun [hādhihi, ‘this’]). Leave her to eat in God’s earth and do not cause her any harm, [by] hamstringing [her], lest you be seized by a near chastisement’, if you do hamstring her.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my people! This is the camel of Allah, a token unto you) a sign unto you, (so suffer her) leave her (to feed in Allah's earth) in the wilderness: you do not have to feed her, (and touch her not with harm) do not kill her (lest a near torment seize you) after three days.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" آية \": نصبت على الحال، والعامل فيها: معنى الإشارة\n ولكم: حال منها، تقدمت عليها لتنكيرها\n ومن خزي يومئذٍ ـ حذف المعطوف، أي: ونجيناهم من خزي يومئذٍ، ومن قرأ بكسر الميم أعربه، ومن قرأ بالفتح بناه لاكتساب المضاف البناء من المضاف إليه\n قاله البيضاوي\n وقال في الألفية:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:73",
      "similarity": 0.806480045584162
    },
    {
      "verse": "26:155",
      "similarity": 0.7084128870301131
    },
    {
      "verse": "91:13",
      "similarity": 0.6832769024357397
    },
    {
      "verse": "54:27",
      "similarity": 0.6275667933559972
    },
    {
      "verse": "17:59",
      "similarity": 0.5628983307448511
    }
  ]
}