{
  "chapter": "هود",
  "text": "كان لم يغنوا۟ فيها الا ان ثمودا۟ كفروا۟ ربهم الا بعدا لثمود",
  "translations": [
    {
      "translation": "It was as if thev had never lived there at all. Yes indeed! Thamud rejected their Lord. So awav with Thamud!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As though they had never lived there at all. Beware! The people of Thamud turned away from their Lord. Beware! Accursed are the people of Thamud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as though they had never lived there before. Oh, verily the Thamud denied their Lord! Oh, the Thamud were destroyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as though they had never existed. The people of Thamud denied the existence of their Lord. How distant from the mercy of God had the people of Thamud gone!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As if they had never lived there; indeed the tribe of Thamud disbelieved in their Lord; away with the Thamud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As if they had never lived there. No doubt! Verily, Thamud disbelieved in their Lord. So away with Thamud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As though they had never dwelt in them; now surely did Samood disbelieve in their Lord; now surely, away with Samood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as if they never dwelt there: 'Surely Thamood disbelieved in their Lord, so away with Thamood!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As though they had not dwelt there. Lo! Thamud disbelieved in their Lord. A far removal for Thamud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as if they had never dwelt there. The Thamud denied their Lord; cursed are the tribe of Thamud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As though they had never lived at ease therein. Lo! verily Thamud disbelieved in their Lord. Lo! away with Thamud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as if they had never lived there. Behold! Thamud indeed defied their Lord. Now, away with Thamud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As if they had never dwelt and flourished there. Ah! Behold! for the Thamud rejected their Lord and Cherisher! Ah! Behold! removed (from sight) were the Thamud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As if they had never lived there. No doubt! Verily, Thamud disbelieved in their Lord. So away with Thamud!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as though they had never lived there. Indeed, Thamood disbelieved in their Lord. So, begone Thamood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As if they had never prospered therein. Indeed, Thamood rejected their Lord, so away with Thamood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As if they had never prospered therein. Unquestionably, Thamud denied their Lord; then, away with Thamud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:68] as if (ka-an had been softened and its subject omitted, in other words [understand it as] ka’annahum) they had not dwelt there, in their dwelling-place: ‘Lo! Thamūd disbelieved in their Lord, lo! away with Thamūd!’ (this may be read, declined, li-Thamūdan, or left, as indeclinable, li-Thamūda, referring to the district or the tribe).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As though they had not dwelt there) it was as if they never lived on this earth. (Lo! Thamud) the people of Salih (disbelieved in their Lord. A far removal for Thamud!) the people of Salih are far removed from Allah's mercy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَأَن لَّمْ يَغْنَوْاْ } ولم يسكنوا { فِيهَآ } أصلاً، ونادى عند وقوع الواقعة الهائلة أصحاب الاعتبار والاستبصار: { أَلاَ إِنَّ ثَمُودَ كَفرُواْ رَبَّهُمْ } بكفران نعمه وتكذيب رسله { أَلاَ بُعْداً لِّثَمُودَ } [هود: 68] ع سعة رحمة الحق في النشأة الأولى والأخرى\n\n\n\n\nوبعدما انقرض أولئك الهالكون حدث بعدهم قوة لوط المبالغون في الغفلة القبيحة غقلاً ونقلاً، المصرون عليها إلى أن أخذناهم بما أخذناهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:95",
      "similarity": 0.9001211859511823
    },
    {
      "verse": "7:92",
      "similarity": 0.562260658059104
    },
    {
      "verse": "10:45",
      "similarity": 0.48143651834546924
    },
    {
      "verse": "4:73",
      "similarity": 0.44038341086156446
    },
    {
      "verse": "31:7",
      "similarity": 0.4225504252524178
    }
  ]
}