{
  "chapter": "هود",
  "text": "قال يقوم ارءيتم ان كنت على بينة من ربى وءاتىنى منه رحمة فمن ينصرنى من الله ان عصيته فما تزيدوننى غير تخسير",
  "translations": [
    {
      "translation": "He said, 'My people! What do you think? If I were to possess a Clear Sign from my Lord and He had given me mercy from Him: who would help me against Allah if I disobeyed Him? You would not increase me in anything but loss.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people, have you considered that if my Lord has clearly shown me the way, and I have His blessings too, who will save me then from God if I disobey? You will only add to my ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Salih said: 'My people! What do you think? If I had a clear evidence from my Lord, and then He also bestowed His mercy upon me, who will rescue me from the punishment of Allah if I still disobey Him? You can only make me lose even more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My people, think. I have received authoritative evidence and mercy from my Lord, so who will protect me from God if I disobey Him? You certainly want to destroy me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O my people! What is your opinion – if I am on clear proof from my Lord and He has bestowed upon me mercy from Him, so who will rescue me from Allah if I disobey Him? So you will not increase anything for me, except loss!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people! Tell me, if I have a clear proof from my Lord, and there has come to me a mercy from Him, who then can help me against Allah, if I were to disobey Him Then you increase me not but in loss.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my people! tell me if I have clear proof from my Lord and He has granted to me mercy from Himself-- who will then help me against Allah if I disobey Him? Therefore you do not add to me other than loss:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'O my people, what think you? If I stand upon a clear sign from my Lord, and He has given me mercy from Him, who shall help me against God if I rebel against Him? You would do nothing for me, except increase my loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my people! Bethink you: if I am (acting) on clear proof from my Lord and there hath come unto me a mercy from Him, who will save me from Allah if I disobey Him? Ye would add to me naught save perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"O my people, tell me: if I have clear evidence from my Lord, and He has granted His mercy, who then will support me against God, if I disobey Him? You would only make my loss greater.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said; O my people! bethink if I rest on an evidence from my Lord, and there hath come to me from Him a mercy, then who will succour me against Allah, if I disobey Him? Ye then increase me not save in loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘O my people! Tell me, should I stand on a manifest proof from my Lord, and He has granted me His own mercy, who will protect me from Allah should I disobey Him? For then you will increase me in nothing but loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people! do ye see? if I have a Clear (Sign) from my Lord and He hath sent Mercy unto me from Himself,- who then can help me against Allah if I were to disobey Him? What then would ye add to my (portion) but perdition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people! Tell me, if I have a clear proof from my Lord, and there has come to me a Mercy (Prophethood, etc.) from Him, who then can help me against Allah, if I were to disobey Him? Then you increase me not but in loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'My nation, think! If I have a clear proof from my Lord and He has given me His Mercy, who would help me against Allah if I rebel against Him? Indeed, you would do nothing for me except increase my loss'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O my people, have you considered? If I stand upon clear evidence from my Lord, and He has given me mercy from Him, who would protect me from God, if I disobeyed Him? You add nothing for me except loss.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"O my people, have you considered: if I should be upon clear evidence from my Lord and He has given me mercy from Himself, who would protect me from Allah if I disobeyed Him? So you would not increase me except in loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:63] He said, ‘O my people, have you considered: if I am [acting] upon a clear proof, a [clear] statement, from my Lord, and He has given me from Him mercy, prophethood, who will help me, [who will] defend me, against God, [against] His chastisement, if I disobey Him? You would only be adding, by commanding me to do that, to my loss, [my] misguidance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: my people! Bethink you: if I am (acting) on clear proof from my Lord) a clear exposition that has come down from my Lord (and there hath come unto me a mercy from Him) and He has favoured me with prophethood and Islam, (who will save me) who will defend me (from Allah) from Allah's chastisement (if I disobey Him) and shun His command? (Ye would add to me naught save perdition) I only increase in insight about your loss.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ يٰقَوْمِ أَرَأَيْتُمْ } أي: أخبروني { إِن كُنتُ } جئت لكم ملتبساً { عَلَىٰ بَيِّنَةً } واضحةٍ دالة على صدق ما ادعيت نازلةٍ { مِّن } عند { رَّبِّي } لتصديقي وتأييدي { وَ } الحال أني قد { آتَانِي مِنْهُ رَحْمَةً } نبوة ورسالة تامة\n مؤيدة بأنواع المعجزات { فَمَن يَنصُرُنِي } ويمنعني { مِنَ } عذاب { ٱللَّهِ إِنْ عَصَيْتُهُ } في تبليغ رسالته وإظهار ما أمرني بظهوره وأوصاني بنشره { فَمَا تَزِيدُونَنِي } حين ابتلائي وأخذ الله إياي بعصياني { غَيْرَ تَخْسِيرٍ } [هود: 63] على تخسير وتخذيل على تخذيل\n\n\n{ وَ } بعدما آيس عن إيمانهم قال: { يٰقَوْمِ هَـٰذِهِ نَاقَةُ ٱللَّهِ لَكُمْ آيَةً } دالة على صدقي في دعواي وتأييد الله إياي { فَذَرُوهَا تَأْكُلْ فِيۤ أَرْضِ ٱللَّهِ } مسلمة بلا منع وإباء { وَلاَ تَمَسُّوهَا بِسُوۤءٍ } لأجل الماء والكلأ { فَيَأْخُذَكُمْ } ويلحقكم بعدما أصبتموها بسوء { عَذَابٌ قَرِيبٌ } [هود: 64] أجله وحلولهن",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:21",
      "similarity": 0.5906523602029203
    },
    {
      "verse": "79:21",
      "similarity": 0.46128350151257064
    },
    {
      "verse": "19:44",
      "similarity": 0.4567560628655549
    },
    {
      "verse": "20:93",
      "similarity": 0.45317643626478393
    },
    {
      "verse": "14:36",
      "similarity": 0.4465199370937072
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/11:63.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/11:63.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/11:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}