{
  "chapter": "هود",
  "text": "فلما جاء امرنا نجينا صلحا والذين ءامنوا۟ معه برحمة منا ومن خزى يومئذ ان ربك هو القوى العزيز",
  "translations": [
    {
      "translation": "Then when Our command came We rescued Salih and those who had iman along with him by a mercy from Us from the disgrace of that day. Your Lord is the All-Strong, the Almighty.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when Our command (of punishment) came We delivered Saleh by Our grace, and those who believed, with him, from the disgrace of that day. Verily your Lord is mighty and powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when Our command came to pass, We saved Salih and those who shared his faith through Our special mercy, from the disgrace of that day. Truly Your Lord is All-Strong, All-Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our decree came to pass. We mercifully saved Salih and his faithful followers from that day's ignominy. Your Lord is certainly Mighty and Majestic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore when Our command came, We rescued Saleh and the Muslims who were with him by Our mercy, and from the disgrace of that day; indeed your Lord is the Strong, the Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Our commandment came, We saved Salih and those who believed with him by a mercy from Us, and from the disgrace of that Day. Verily, your Lord -- He is the All-Strong, the All-Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Our decree came to pass, We delivered Salih and those who believed with him by mercy from Us, and (We saved them) from the disgrace of that day; surely your Lord is the Strong, the Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We delivered Salih and those who believed with him by a mercy from Us, and from the degradation of that day; thy Lord is the All-strong, the All-mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when Our commandment came to pass, We saved Salih, and those who believed with him, by a mercy from Us, from the ignominy of that day. Lo, thy Lord! He is the Strong, the Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when Our command came by Our grace, We saved Salih and those who believed along with him from the disgrace of that day. Surely, your Lord is powerful and mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when Our decree came to pass We delivered Saleh and those who believed with Him by a mercy from Us, and from the humiliation of that day. Verily thy Lord! He is the Strong, the Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Our edict came, We delivered Salih and the faithful who were with him by a mercy from Us and from the [punishment and] disgrace of that day. Your Lord is indeed the All-strong, the All-mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Decree issued, We saved Salih and those who believed with him, by (special) Grace from Ourselves - and from the Ignominy of that day. For thy Lord - He is the Strong One, and able to enforce His Will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Our Commandment came, We saved Salih (Saleh) and those who believed with him by a Mercy from Us, and from the disgrace of that Day. Verily, your Lord, He is the All-Strong, the All-Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We saved Salih together with those who believed with him through Our Mercy, and from the ignominy of that day. YourLord is Strong and Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when Our command came, We saved Saleh and those who believed with him, by a mercy from Us, from the disgrace of that day. Your Lord is the Strong, the Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Our command came, We saved Salih and those who believed with him, by mercy from Us, and [saved them] from the disgrace of that day. Indeed, it is your Lord who is the Powerful, the Exalted in Might.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:66] So, when Our command came, for their destruction, We delivered Sālih and those who believed with him, they numbered 4000, by a mercy from Us, and, We delivered them, from the ignominy of that day (read yawmi’idhin [if understood] as declinable, or read yawma’idhin on the basis of it [yawm, ‘day’] being annexed to an invariable [idhin, ‘that’], which is the majority view). Truly your Lord is the Strong, the Mighty, the Victor.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So, when Our commandment) Our chastisement (came to pass, We saved Salih, and those who believed 234 with him, by a mercy from Us) by Our grace, (from the ignominy of that day) from the chastisement of that day. (Lo, thy Lord! He is the Strong) He saves His allies, (the Mighty) in His retribution against His enemies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا جَآءَ أَمْرُنَا } بالعذاب المهلك بعد انقضاء الأيام الثلاثة التي ظهرت فيها علاماته من اصفرار في وجوههم في اليوم الأول\n واحمرارها في الثاني\n واسودادها في الثالث { نَجَّيْنَا } من فضلنا وجودنا { صَالِحاً } الذي صلح نفسه وأصلح نفوسهم\n فمل يقبلوا إصلاحه\n بل أفسدوها بأنفهسم { وَ } نجينا أيضاً منهم { ٱلَّذِينَ آمَنُواْ مَعَهُ } وصلحوا بإصلاحه { بِرَحْمَةٍ } نازلة { مِّنَّا } على قلوبهم\n ليوفقوا بها على قبول دعوته والإيمان به\n وبسبب إيمانهم نجوا من خزي النشاة الأخرى { وَمِنْ خِزْيِ يَوْمِئِذٍ } أيضاً { إِنَّ رَبَّكَ } يا أكمل الرسل الموفق لهم على الإيمان والإذعان { هُوَ ٱلْقَوِيُّ } المحصور على القوة والقدرة\n إذ لا حول ولا وقة إلا به { ٱلْعَزِيزُ } [هود: 66] الغالب على إمضائه وإنفاذه حيث أراد وشاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما جاء أمرْنا }: عذابنا\n أو أمرنا بهلاكهم\n { نجينا صالحاً والذين آمنوا معه } \n قيل: كانوا ألفين وثمانمائة رجل وامرأة\n وقيل أربعة آلاف\n وقال كعب: كان قوم صالح أربعة عشر ألفاً\n سوى النساء والذرية\n ولقد كان قوم عاد مثلهم ست مرات\n انظر القرطبي\n قلت: وقول كعب: كان قوم صالح\n\n\n الخ\n لعله يعني الجميع: من آمن ومن لم يؤمن\n فآمن ألفان وثمانمائة\n وهلك الباقي\n وكذا هود\n أسلم أربعة آلاف\n وهلك الباقي\n  قال تعالى: فنجينا { صالحاً } ومن معه { برحمة منا } ونجيناهم { من خِزْي يؤمئذٍ } وهو: هلاكهم بالصيحة\n أو من هوان يوم القيامة\n { إن ربك هو القوي العزيز } القادر على كل شيء\n الغالب عليه\n { وأخذ الذين ظلموا الصيحةُ فأصبحوا في ديارهم جاثمين } باركين على ركبهم ميتين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:69",
      "similarity": 0.4699256888423121
    },
    {
      "verse": "26:87",
      "similarity": 0.46152414766965555
    },
    {
      "verse": "3:194",
      "similarity": 0.45744285574257854
    },
    {
      "verse": "3:192",
      "similarity": 0.43670919675322195
    },
    {
      "verse": "39:40",
      "similarity": 0.414599208953816
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011066.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011066.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:66.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}