{
  "chapter": "هود",
  "text": "ولقد جاءت رسلنا ابرهيم بالبشرى قالوا۟ سلما قال سلم فما لبث ان جاء بعجل حنيذ",
  "translations": [
    {
      "translation": "Our messengers brought the good news to Ibrahim. They said, 'Peace!' and he too said, 'Peace!' and brought in a roasted calf without delay.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our angels came to Abraham with good news, and said: \"Peace on you. \"Peace on you too,\" said Abraham, and hastened to bring a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Our messengers came to Abraham, bearing glad tidings. They greeted him with 'peace', and Abraham answered back to them 'peace', and hurriedly brought to them a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Messengers came to Abraham with glad news. They said, \"Peace be with you.\" He replied similarly. After a short time he presented them with a roasted calf\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Our angels came to Ibrahim with glad tidings – they said, “Peace”; he answered, “Peace” and without delay brought a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, there came Our messengers to Ibrahim with the glad tidings. They said: \"Salaman (greetings or peace!)\" He answered, \"Salamun (greetings or peace!),\" and he hastened to entertain them with a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly Our apostles came to Ibrahim with good news. They said: Peace. Peace, said he, and he made no delay in bringing a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our messengers came to Abraham with the good tidings; they said, 'Peace!' 'Peace,' he said; and presently he brought a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Our messengers cam unto Abraham with good news. They said: Peace! He answered: Peace! and delayed not to bring a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our messengers came to Abraham with good news and greeted him with, \"Peace.\" He too said, \"Peace be on you,\" and hastened to bring a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly Our messengers came unto Ibrahim with the glad tidings. The said: peace! He said: peace! And he tarried not till he brougt a calf roasted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Our messengers came to Abraham with the good news, and said, ‘Peace!’ ‘Peace!’ He replied. Presently he brought [for them] a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There came Our messengers to Abraham with glad tidings. They said, \"Peace!\" He answered, \"Peace!\" and hastened to entertain them with a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, there came Our Messengers to Ibrahim (Abraham) with glad tidings. They said: Salam (greetings or peace!) He answered, Salam (greetings or peace!) and he hastened to entertain them with a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Messengers came to Abraham with glad tidings. They said: 'Peace' He replied 'Peace' and in a while brought them a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our messengers came to Abraham with good news. They said, “Peace.” He said, “Peace.” Soon after, he came with a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly did Our messengers come to Abraham with good tidings; they said, \"Peace.\" He said, \"Peace,\" and did not delay in bringing [them] a roasted calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:69] And verily Our messengers came to Abraham with good tidings, of [the birth of] Isaac and, after him, Jacob. They said, ‘Peace!’ (salāman is a verbal noun). He said, ‘Peace!’, be upon you, and did not delay to bring a roasted calf.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Our messengers) Gabriel and twelve angels (came unto Abraham with good news) that he will have a son. (They said: Peace!) they greeted Abraham when they entered in on him. (He answered: Peace!) He greeted them back (and delayed not) after a short while he went (to bring a roasted calf) a fat roasted calf which he placed in front of them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جَآءَ بِعِجْلٍ حَنِيذٍ } فالحَنيذُ: الشِّواءُ الذِي يَقْطُرُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولقد جاءت رسلنا إبراهيم بالبُشْرى } إلى آخره، إن للنفوس الشريفة الإنسانية اتصالات بالمبادئ المجرّدة العالية والأرواح المقدّسة الفلكية من الأنوار القاهرة العقلية والنفوس المدبرة السماوية واختلاطات بالملأ الأعلى من أهل الجبروت وانخراطات في سلك الملكوت\n ولكل نفس بحسب فطرتها مبدأ يناسبها من عالم الجبروت ومدبّر يربها من عالم الملكوت تستمد من الأول فيض العلم والنور، ومن الثاني مدد القوة والعمل كما أشار إليه قوله:\n\n[ق، الآية: 21] ومقرّ أصلي تأوي إليه من جناب اللاهوت إن تجرّدت، كما قال عليه الصلاة والسلام:\n\n \" أرواح الشهداء تأوي إلى قناديل من نور معلقة تحت العرش \" \n\n، وكلما انجذبت إلى الجهة السفلية بالميل إلى اللذات الطبيعية احتجبت بغشاوتها عن ذلك الجناب وانقطع مددها من تلك الجهة من الأنوار الجبروتية والقوى الملكوتية، فضعفت في الإدراكات لاحتجابها عن قبول تلك الإشراقات\n وفي المنّة والقوة لانقطاع مددها من تلك القوة\n وكلما توجهت إلى الجهة العلوية بالتنزّه عن الهيئات البدنية، والتجرّد عن الملابس المادية، والتقرّب إلى الله تعالى، مبدأ المبادئ، ونور الأنوار بالزهد والعبادة\n والتشبث في المبادئ بالنظافة والنزاهة مقروناً عمله بالصدق في النية وإخلاص الطويّة أمدّه الله تعالى لمناسبته سكان حضرته من عالمهم إمداد النور والقوة، فتعلم ما لا يعلمه غيرها من أبناء جنسها وتقدر على ما لا يقدر عليه مثلها من بني نوعها، ويكون لها أوقات تنخرط فيها في سلكها بالانخلاع عن بدنها وأوقات تبعد فيها عنها بما هي ممنوّة به من تدبير جسدها\n ففي أوقات اتصالها بها وانخراطها في سلكها قد تتلقى الغيب منها، إما كما هو على سبيل الوحي والإلهام والإلقاء في الروع والإعلام بمطالعة صورة الغيب المنتقشة هي بها منها، وإما على طريق الهتاف والإنهاء، وإما على صورة كتابة في صحيفة تطالعه منها وذلك بحسب جهة قبول لوح حسها المشترك واختصاصه بنوع بعض المحسوسات دون بعض للأحوال السابقة والاتفاقات العارضة\n وقد يتراءى لها صور منها تناسبها في الحسن واللطافة فيتجسد لها إما بقوة تخيلها وظهورها في حسها المشترك لاستحكام الاتصال واستقراره ريثما تحاكيها المتخيلة، وإما بتمثيلها في متخيلة الكل التي هي السماء الدنيا وانطباعها في متخيلتها بالانعكاس كما فيما بين المرايا المتقابلة فتخاطبها بصورة الغيب شفاهاً على ما يُرَى في المنامات الصادقة من غير فرق، فإن الرؤيا الصادقة والوحي كلاهما من واد واحد لا تباين بينهما إلا بالنوم واليقظة، فإن صاحب الوحي يقدر على الغيبة من الحواس وإدراكاتها وعزلها عن أفعالها وتعطيلها في استعمالها فيتصل بالمجرّدات العلوية لقوة نفسه وحصول ملكة الاتصال لها، وصاحب الرؤيا الصادقة يقع له ذلك بحكم الطبع وتلك الرؤيا هي التي لا تحتاج إلى تعبير كما أشار إليه من رؤيا رسول الله صلى الله عليه وسلم في القرآن بقوله:\n\n\n\n[الفتح، الآية: 27] ولهذا جعل الرؤيا الصادقة جزء من ستة وأربعين جزء من النبوة، وكانت مقدمة وحيه المنامات الصادقة ستة أشهر ثم استحكمت وصارت إلى اليقظة\n وقد تنتقل المتخيلة في الحالتين، أي: النوم واليقظة، إلى اللوازم، فيقع الاحتياج إلى التعبير والتأويل وقد يظهر على تلك النفس المتدربة بملكة الاتصال المتمرّنة فيها من خوارق العادات وأنواع الكرامات والمعجزات لوصول المدد من عالم القدرة ما ينكره من لا يعلمه من المحجوبين بالعادة وأصحاب قسوة القلوب والجفوة والمحجوبين بالعقول الناقصة المشوبة بالوهم القاصرة عن بلوغ الحد وإدراك الحق، ويقبله من تنوّر قلبه بنور الهداية وعصم عن الضلالة والغواية استبصاراً وإيقاناً أو سلمت فطرته عن الحجب المظلمة والغباوة وخلصت عن الجهالة والغشاوة تقليداً وإيماناً للين قلبه بالإرادة وقوة قبوله للصقالة، وذلك إما بتأييد نفسه من عالم الملكوت وتقويها بمبدأ الأيد والقوة كما قال علي عليه السلام عند قلعه باب خيبر: \" والله ما قلعت باب خيبر بقوة جسدانية، ولكن قلعته بقوة ملكوتية ونفس بنور ربها مضيّة \"\n وإما بصدور ذلك عن تلك النفوس الملكوتية والمبادئ الجبروتية التي اتصل هو بها لإجابة دعوته بإطاعة الملكوت له بإذن الله تعالى وأمره وتقديره وحكمه وتسخيره\n وقد دلت الآية على تمثل الملائكة لخليل الله عليه الصلاة والسلام وتجسدها على الحالات الثلاث: مخاطبتها إياه بالغيب الذي هو البشرى بوجود الولد، وإهلاك قوم لوط وإنجائه وتأييده بهم في خرق العادة من ولادة العجوز العقيم من الشيخ الفاني وتأثيرهم في إهلاك قوم لوط وتدميرهم بدعائه والله أعلم بحقائق الأمور\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } حين أردنا أخذهم { لَقَدْ جَآءَتْ رُسُلُنَآ } أي: الملائكة المأمورون لإهلاك قوم لوط { إِبْرَاهِيمَ بِٱلْبُـشْرَىٰ } والبشارة بالولد بعدما آيس هو وزوجته عن التوالد والتناسل { قَالُواْ } له حين لاقوه: { سَلاَماً } أي: نسلم سلاماً عليكم ترحيباً منا عليك { قَالَ سَلاَمٌ } عليكم دائماً مستمراً أيها المستحقون للتحية والترحيب { فَمَا لَبِثَ } وسكن بعد نزولهم إلى { أَن جَآءَ بِعِجْلٍ حَنِيذٍ } [هود: 69] مشوي؛ ضيافة لهم ونزلاً لقدومهم ووضع بين أيديهم، فانصرفوا عنه ولم يمدوا أيديهم نحوه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" سلاماً \": منصوب على المصدر، أي: سلمنا سلاماً\n ويجوز نصبه بقالوا لتضمنه معنى ذكروا\n قال سلام: إما خبر، أي: أمرنا سلام، أو جواب سلام، وإما مبتدأ، أي: عليكم سلام\n وكسر السين: لغة، وإنما رفع جوابه ليدل على ثبوت سلامة فيكون قد حياهم بأحسن مما حيوه به\n فما لبث أن جاء\n \" ما \": نافية و \" أن جاء \": فاعل \" لبث \"\n ونكر وأنكر بمعنى واحد\n والإيجاس: الإدراك أو الإضمار\n ومن وراء إسحاق يعقوب: من قرأ بالنصب فبفعل دل عليه الكلام، أي: ووهبنا لها يعقوب\n ومن رفعه فمبتدأ، أي: ويعقوب مولود من بعده\n وشيخاً: حال، والعامل فيه: الإشارة، أي: أشير إليه شيخاً\n وأهل البيت: نصب على المدح والاختصاص، أو على النداء\n يقول الحق جل جلاله: { ولقد جاءت رسُلنا إبراهيمَ } ، وهم الملائكة، وقيل: ثلاثة جبريل وميكائيل وإسرافيل\n وقيل: تسعة جاؤوه { بالبُشرى } بالولد\n فلما دخلوا عليه { قالوا سلاماً } أي: سلمنا عليك سلاماً، أو ذكروا سلاماً، { قال سلام } أي: عليكم سلام، { فما لبثَ } أي: أبطأ، { أن جاء بعجل حَنيذ } مشوي بالرضف، أي: بالحجر المحمي\n وقيل: حنيذ بمعنى يقطر ودكه\n كقوله:\n",
      "translations": []
    }
  ]
}