{
  "chapter": "هود",
  "text": "قالوا۟ يصلح قد كنت فينا مرجوا قبل هذا اتنهىنا ان نعبد ما يعبد ءاباؤنا واننا لفى شك مما تدعونا اليه مريب",
  "translations": [
    {
      "translation": "They said, 'Salih, we had great hopes in you before this happened. Do you forbid us to worship what our fathers worshipped? We have grave doubts about what you are calling us to.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Saleh, we had placed our hopes in you, but you forbid us from worshipping that which our fathers worshipped, and we are suspicious of what you are calling us to.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'O Salih! Until now you were one of those among us on whom we placed great hopes. Now, would you forbid us to worship what our forefathers were wont to worship? Indeed we are in disquieting doubt about what you are calling us to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Salih, we had great hope in you before this. Do you forbid us to worship that which our fathers had worshipped? We are doubtful and uncertain about what you have told us to worship.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Saleh! You seemed very promising among us, before this – What! You forbid us from worshipping the deities of our forefathers? And indeed we have fallen into a deeply intriguing doubt concerning what you call us to.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Salih! You have been among us as a figure of good hope until this! Do you (now) forbid us the worship of what our fathers have worshipped But we are really in grave doubt as to that to which you invite us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Salih! surely you were one amongst us in whom great expectations were placed before this; do you (now) forbid us from worshipping what our fathers worshipped? And as to that which you call us to, most surely we are in disquieting doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Salih, thou hast hitherto been a source of hope among us. What, dost thou forbid us to serve that our fathers served? Truly we are in doubt, concerning what thou callest us to, disquieting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Salih! Thou hast been among us hitherto as that wherein our hope was placed. Dost thou ask us not to worship what our fathers worshipped? Lo! we verily are in grave doubt concerning that to which thou callest us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O Salih! We had great hopes in you. Do you forbid us to worship what our fathers worshipped? We are in grave doubt, amounting to suspicion, concerning that to which you call us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Saleh! heretofore thou wast amongst us as one hoped for. Forbiddest us thou to worship that which our fathers have worshipped? And verily we are regarding that to which thou callest us in doubt disquieting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O Salih! You were a source of hope to us before this. Do you forbid us to worship what our fathers have been worshiping? Indeed we have grave doubts concerning that to which you invite us.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Salih! thou hast been of us! a centre of our hopes hitherto! dost thou (now) forbid us the worship of what our fathers worshipped? But we are really in suspicious (disquieting) doubt as to that to which thou invitest us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Salih (Saleh)! You have been among us as a figure of good hope (and we wished for you to be our chief), till this [new thing which you have brought; that we leave our gods and worship your God (Allah) Alone]! Do you (now) forbid us the worship of what our fathers have worshipped? But we are really in grave doubt as to that which you invite us to (monotheism).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'Salih, before this you were a source of hope to us. What, would you now forbid us to worship what our fathers worshipped? Indeed, we are disquieted, and doubt that to which you invite'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Saleh, we had hopes in you before this. Are you trying to prevent us from worshiping what our parents worship? We are in serious doubt regarding what you are calling us to.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O Salih, you were among us a man of promise before this. Do you forbid us to worship what our fathers worshipped? And indeed we are, about that to which you invite us, in disquieting doubt.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:62] They said, ‘O Sālih, you had been one of promise among us, that is to say, we had hoped that you would become [our] chief, before this, that has issued from you. Do you forbid us to worship what our fathers worshipped?, in the way of graven images? Truly we are in grave doubt, [doubt] creating [great] uncertainty, concerning that to which you are calling us’, in the way of [affirming] God’s Oneness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا جوابهم عن دعوته البليغة الوجيزة المَلأى إرشاداً وهدياً . وهو جواب مُلىء بالضلال والمكابرة وضعف الحجة .وافتتاح الكلام بالنّداء لقصد التوبيخ أو الملام والتّنبيه ، كما تقدّم في قوله : { قالوا يا هود ما جئتنا ببيّنة } \\[ هود : 53 \\]. وقرينة التّوبيخ هنا أظهر ، وهي قولهم : { قد كنت فينا مرجوا قبل هذا } فإنّه تعريض بخيبة رجائهم فيه فهو تعنيف .و { قد } لتأكيد الخبر .وحذف متعلّق { مرجواً } لدلالة فعل الرجاء على أنّه ترقب الخير ، أي مرجواً للخير ، أي والآن وقع اليأس من خيرك . وهذا يفهم منه أنّهم يَعدّون ما دعاهم إليه شرّاً ، وإنما خاطبوه بمثل هذا لأنّه بعث فيهم وهو شاب ( كذا قال البغوي في تفسير سورة الأعراف ) أي كنت مرجواً لخصال السيادة وحماية العشيرة ونصرة آلهتهم .والإشارة في { قبل هذا } إلى الكلام الذي خاطبهم به حين بعثه الله إليهم .وجملة { أتنهانا أن نعبد ما يعبد آباؤنا } بيان لجملة { قد كنت فينا مرجواً } باعتبار دلالتها على التعنيف ، واشتمالها على اسم الإشارة الذي تبيّنه أيضاً جملة { أتنهانا أن نعبد ما يعبد آباؤنا }.والاستفهام : إنكار وتوبيخ .وعبّروا عن أصنامهم بالموصول لِمَا في الصّلة من الدّلالة على استحقاق تلك الأصنام أن يعبدوها في زعمهم اقتداءً بآبائهم لأنّهم أسوة لهم ، وذلك ممّا يزيد الإنكار اتّجاهاً في اعتقادهم .وجملة { وإنّنا لفي شك } معطوفة على جملة { يا صالح قد كنت فينا مرجواً } ، فبعد أن ذكروا يأسهم من صلاح حاله ذكروا أنّهم يشكون في صدق أنه مرسل إليهم وزادوا ذلك تأكيداً بحرف التأكيد . ومن محاسن النّكت هنا إثبات نون ( إنّ ) مع نون ضمير الجمع لأنّ ذلك زيادة إظهار لحرف التوْكيد والإظهار ضرب من التحقيق بخلاف ما في سورة إبراهيم ( 9 ) من قول الأمم لرسلهم : { وإنّا لفي شكّ ممّا تدعوننا } لأنّ الحكاية فيها عن أمم مختلفة في درجات التّكذيب ، ولأنّ ما في هاته الآية خطاب لواحد ، فكان { تدعونا } بنون واحدة هي نون المتكلم ومَعهُ غيره فلم يقع في الجملة أكثر من ثلاث نونات بخلاف ما في سورة إبراهيم لأنّ الحكاية هنالك عن جمع من الرسل في ( تدعُوننا ) فلو جاء ( إنّنا ) لاجتمع أربع نونات .والمريب : اسم فاعل من أراب إذا أوقع في الريب ، يقال : رابه وأرابه بمعنى ، ووصف الشك بذلك تأكيد كقولهم : جدّ جدّه .\n\n",
      "translations": [
        {
          "translation": "(They said: Salih! Thou hast been among us hitherto) i.e. before you called us to follow other than the religion of our forefathers (as that wherein our hope was placed) we had hope in you. (Dost thou ask us not to worship what our fathers worshipped) of idols? (Lo! we verily are in grave doubt concerning that to which thou callest us) i.e. your religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } بعدما سمعوا دعوته وتذكيره: { يٰصَالِحُ قَدْ كُنتَ فِينَا مَرْجُوّاً } أي: مستشاراً ومؤتمناً\n واعتقدناك سيداً ذا رشد { قَبْلَ هَـٰذَا } الزمان فالآن صرت أخرق { أَتَنْهَانَآ أَن نَّعْبُدَ مَا يَعْبُدُ آبَاؤُنَا } أي: نهيتنا عن عبادة معبودات آبائنا { وَ } الحال أنه { إِنَّنَا لَفِي شَكٍّ } وترددٍ عظيم { مِّمَّا تَدْعُونَآ إِلَيْهِ } من توحيد الإله المعبود بالحق وإبطال آلهتنا التي وجدنا آباءنا لها عابدين\n { مُرِيبٍ } [هود: 62] ذي ريبة منتهية إلى كمال الارتياب\n مع أنك لم تأت ببينة معجزة تلجئنا إلى تصديقك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { مُريب }: موقع في الريبة مبالغة في الشك\n { قال يا قوم أرأيتُم إن كنتُ على بينة } طريقة واضحة { من ربي } وبصيرة نافذة منه\n { وآتاني منه رحمةٌ }: نبوة\n { فمن ينصرني من الله } من يمنعني من عذابه { إن عصيته } وأطعتكم في ترك التبليغ\n وموافقتكم في الدين الفاسد\n { فما تزيدونني } باستتباعكم { غير تَخسير } بترك ما منحني الله به\n والتعرض لغضبه\n أو فما تزيدونني بما تقولون لي غير تخسير لكم لأنه يجركم إلى الخسران\n والله تعالى أعلم\n الإشارة: كل من وجهه الحق تعالى يدعو إلى الله فإنما يدعو إلى خصلتين: إفراد الحق بنعوت الألوهية\n والقيام بوظائف العبودية شكراً لنعمة الإيجاد\n وتوالي الإمداد\n فقول صالح عليه السلام: { اعبدوا الله ما لكم من إله غيره } \n هذا إفراد الحق بالربوبية\n وقوله: { هو أنشأكم من الأرض } \n هذه نعمة الإيجاد\n وقوله: { واستعمركم فيها } هي: نعمة الإمداد\n وقوله: { فاستغفروه ثم توبوا إليه } \n وهو القيام بوظائف العبودية شكراً لتلك النعمتين\n وفي قوله: { إن ربي قريب مجيب }: ترهيب وترغيب\n وقوله تعالى: { قالوا يا صالح قد كنت فينا مرجواً قبل هذا }: يؤخذ من الآية: أن شُعاع الخصوصية\n وآثارها\n تظهر على العبد قبل شروق أنوارها\n وهو جار في خصوص النبوة والولاية\n فلا تظهر على العبد في الغالب حتى يتقدمها آثار وأنوار\n من مجاهدة أو أنس\n أو اضطرار أو انكسار\n أوعِرْق طيب\n والله تعالى أعلم\n وكل من واجهه منهم تكذيب أو إنكار يقول: { أرأيتم إن كنتُ على بينة من ربي\n\n\n } الآية\n وبالله التوفيق\n ثم ذكر معجزة الناقة\n فقال: { وَيٰقَوْمِ هَـٰذِهِ نَاقَةُ ٱللَّهِ لَكُمْ آيَةً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:110",
      "similarity": 0.5049576076810208
    },
    {
      "verse": "41:45",
      "similarity": 0.5049576076810208
    },
    {
      "verse": "10:104",
      "similarity": 0.4822580642218656
    },
    {
      "verse": "38:8",
      "similarity": 0.4477869693116057
    },
    {
      "verse": "42:14",
      "similarity": 0.42496510475059834
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}