{
  "chapter": "هود",
  "text": "فلما رءا ايديهم لا تصل اليه نكرهم واوجس منهم خيفة قالوا۟ لا تخف انا ارسلنا الى قوم لوط",
  "translations": [
    {
      "translation": "When he saw that their hands were not reaching for it, he suspected them and felt afraid of them. They said, 'Have no fear! We have been sent to the people of Lut.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they did not stretch their hands towards it he became suspicious and afraid of them. They said: \"Do not be afraid. We have been sent to the people of Lot.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he perceived that their hands could not reach it, he mistrusted them, and felt afraid of them. They said: 'Do not be afraid. We have been sent to the people of Lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but when he saw that their hands did not reach out for it, he could not know who they were and became afraid of them. They said, \"Do not be afraid; we are God's angelic Messengers sent to the people of Lot.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he saw their hands not reaching towards it, he thought they were pretending and inwardly started fearing them; they said, “Do not be afraid – we are sent to the people of Lut.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he saw their hands went not towards it (the meal), he mistrusted them, and conceived a fear of them. They said: \"Fear not, we have been sent against the people of Lut.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he saw that their hands were not extended towards it, he deemed them strange and conceived fear of them. They said: Fear not, surely we are sent to Lut's people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he saw their hands not reaching towards it, he was suspicious of them and conceived a fear of them. They said, 'Fear not; we have been sent to the people of Lot.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he saw their hands reached not to it, he mistrusted them and conceived a fear of them. They said: Fear not! Lo! we are sent unto the folk of Lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he saw that they made no move to eat, he found this strange and became afraid of them. They said, \"Do not be afraid, for we have been sent to the people of Lot.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he beheld that their hands reached it not he misliked them, and ccnceived a fear of them. They said fear not verily we are sent unto the people of Lut.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he saw their hands not reaching for it, he took them amiss and felt a fear of them. They said, ‘Do not be afraid. We have been sent to the people of Lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he saw their hands went not towards the (meal), he felt some mistrust of them, and conceived a fear of them. They said: \"Fear not: We have been sent against the people of Lut.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he saw their hands went not towards it (the meal), he felt some mistrust of them, and conceived a fear of them. They said: \"Fear not, we have been sent against the people of Lout (Lot).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he saw that their hands did not reach towards it, he was wary and became fearful of them, but they said: 'Do not be afraid. We are sent to thenation of Lot'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he saw their hands not reaching towards it, he became suspicious of them, and conceived a fear of them. They said, “Do not fear, we were sent to the people of Lot.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he saw their hands not reaching for it, he distrusted them and felt from them apprehension. They said, \"Fear not. We have been sent to the people of Lot.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:70] And when he saw their hands not reaching to it, he was suspicious of them and conceived, he kept secret in himself, a fear of them. They said, ‘Fear not. Lo! we have been sent to the people of Lot’, to destroy them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nو { لا تصل إليه } أشد في عدم الأخذ من ( لا تتناوله ).ويقال : نكر الشيء إذا أنكره أي كرهه .وإنّما نكرهم لأنّه حسب أنّ إمساكهم عن الأكل لأجل التبرّؤ من طعامه ، وإنّما يكون ذلك في عادة النّاس في ذلك الزّمان إذا كان النّازل بالبيت يضمر شرّاً لمضيّفه ، لأنّ أكل طعام القرى كالعهد على السّلامة من الأذى ، لأنّ الجزاء على الإحسان بالإحسان مركوز في الفطرة ، فإذا انكفّ أحد عن تناول الإحسان فذلك لأنّه لا يريد المسالمة ولا يرضى أن يكون كفوراً للإحسان .ولذلك عقب قوله { نكرهم } ب { أوجس منهم خيفة } ، أي أحسّ في نفسه خيفة منهم وأضمر ذلك . ومصدره الإيجاس . وذلك أنّه خشي أن يكونوا مضمرين شرّاً له ، أي حسبهم قطّاعاً ، وكانوا ثلاثة وكان إبراهيم عليه السّلام وحده .وجملة { قالوا لا تخف } مفصولة عمّا قبلها ، لأنّها أشبهت الجواب ، لأنّه لمّا أوجس منهم خيفة ظهر أثرها على ملامحه ، فكان ظهور أثرها بمنزلة قوله إنّي خفت منكم ، ولذلك أجابوا ما في نفسه بقولهم : { لا تَخف } ، فحكي ذلك عنهم بالطّريقة الّتي تحكى بها المحاورات ، أو هو جواب كلام مقدّر دلّ عليه قوله : { وأوجس منهم خيفة } ، أي وقال لهم : إنّي خفت منكم ، كما حكي في سورة \\[ الحجر : 52 \\] { قال إنّا منكم وَجِلون } ومن شأن النّاس إذا امتنع أحد من قبول طعامهم أن يقولوا له : لعلّك غادر أو عَدوّ ، وقد كانوا يقولون للوافد : أحَرْبٌ أم سِلْمٌ .وقولهم : { إنّا أرسلنا إلى قوم لوط } مكاشفة منهم إيّاه بأنّهم ملائكة . والجملة استئناف مبينة لسبب مجيئهم .والحكمةُ من ذلك كرامة إبراهيم عليه السّلام وصدورهم عن علم منه .وحذف متعلّق { أرسلنا } أي بأي شيء ، إيجازاً لظهوره من هذه القصّة وغيرها .وعبّر عن الأقوام المراد عذابهم بطريق الإضافة { قوم لوط } إذ لم يكن لأولئك الأقوام اسم يجمعهم ولا يرجعون إلى نسب بل كانوا خليطاً من فصائل عرفوا بأسماء قراهم ، وأشهرها سدوم كما تقدّم في الأعراف .\n\n",
      "translations": [
        {
          "translation": "(And when he saw their hands reached not to it) to his food, because they had no need for it, (he mistrusted them and conceived a fear of them) thinking they were thieves, since they did not touch his food. When the angels knew of his fear. (They said: Fear not!) Abraham. (Lo! we are sent unto the folk of Lot) to destroy them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { نَكِرَهُمْ } معناه أَنْكرَهُمْ\n\n\n\n\nوقوله تعالى: { وَأَوْجَسَ مِنْهُمْ خِيفَةً } معناهُ أضمرَ مِنهُم خَوفاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"I detest them,\" means that He rejects them.\n\n\nAnd He felt from them fear {}, meaning that He felt fear from them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا رَأَى } إبراهيم { أَيْدِيَهُمْ لاَ تَصِلُ إِلَيْهِ } ولا يتناولون منه كما هو عادة المسافرين { نَكِرَهُمْ } أي: أنكر منهم عدم أكلهم\n لأن الامتناع من الطعام دليل على قصد المكروه لصاحبه { وَأَوْجَسَ } أي: أضمر { مِنْهُمْ خِيفَةً } خوفاً ورعباً حتى أحسوا منه الخوف وعلامات الرعب { قَالُواْ } تسلية وتسكيناً: { لاَ تَخَفْ } منا { إِنَّا } وإن كنا من أهل الإنذار والإهلاك { أُرْسِلْنَا إِلَىٰ } إهلاك { قَوْمِ لُوطٍ } [هود: 70] ما لنا معك شغل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { نَكرهم } أي: أنكر ذلك منهم\n { وأوجس }: أدرك\n أو أضمر { منهم خفيةً } أي: خوفاً\n خاف أن يريدوا به مكروهاً لامتناعهم من طعامه\n وكان من عادتهم إذا مس من يطرقهم طعامهم أمنوه\n وإلا خافوه\n والظاهر أنه أحسَ بأنهم ملائكة ونكرهم لأنه تخوف أن يكون نزولهم لأمر أنكره الله عليه فأمنوه\n وقالوا: { لا تخفْ إنا } ملائكة { أرسلنا إلى قوم لوطٍ } لنعذبهم\n وإنما لم نأكل طعامك لأنا لا نأكل الطعام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:67",
      "similarity": 0.7712562754670375
    },
    {
      "verse": "51:28",
      "similarity": 0.7139400314487458
    },
    {
      "verse": "13:21",
      "similarity": 0.31456717421258035
    },
    {
      "verse": "28:51",
      "similarity": 0.3106961617036609
    },
    {
      "verse": "2:27",
      "similarity": 0.22597378909532742
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011070.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011070.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:70.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}