{
  "chapter": "هود",
  "text": "يابرهيم اعرض عن هذا انه قد جاء امر ربك وانهم ءاتيهم عذاب غير مردود",
  "translations": [
    {
      "translation": "'Ibrahim, turn away from this! Your Lord's command has come. A punishment is coming to them which cannot be repelled.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Desist from pleading, O Abraham,\" (they said). \"Your Lord's command has verily been issued, and a punishment that cannot be averted is bound to fall on them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon (Our angels) said to him: 'O Abraham! Desist from this, for indeed your Lord's command has come; and a chastisement which cannot be averted is about to befall them.' words literally suggest; the purpose is merely to express a sense of wonder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Abraham, avoid asking Us such questions. Your Lord's decree has already been issued and an inevitable torment will strike these people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O Ibrahim, turn away from this; indeed your Lord’s command has come; and indeed a punishment will come upon them, which will not be averted.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ibrahim! Forsake this. Indeed, the commandment of your Lord has gone forth. Verily, there will come a torment for them which cannot be turned back.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ibrahim! leave off this, surely the decree of your Lord has come to pass, and surely there must come to them a chastisement that cannot be averted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Abraham, turn away from this; thy Lord's command has surely come, and there is coming upon them a chastisement not to be turned back.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It was said) O Abraham! Forsake this! Lo! thy Lord's commandment hath gone forth, and lo! there cometh unto them a doom which cannot be repelled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Abraham, cease your pleading: the command of your Lord has gone forth. There shall fall upon them a punishment which none can avert!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ibrahim! leave off this; verily the decree from thy Lord hath already come, and verily they! upon them is coming a torment unavoidable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O Abraham, let this matter alone! Your Lord’s edict has certainly come, and an irrevocable punishment shall overtake them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Abraham! Seek not this. The decree of thy Lord hath gone forth: for them there cometh a penalty that cannot be turned back!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ibrahim (Abraham)! Forsake this. Indeed, the Commandment of your Lord has gone forth. Verily, there will come a torment for them which cannot be turned back.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It was said:) 'Abraham, turn away from this; your Lord's command has indeed come, and there is coming upon them a punishment that will not be turned back'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O Abraham, refrain from this. The command of your Lord has come; they have incurred an irreversible punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The angels said], \"O Abraham, give up this [plea]. Indeed, the command of your Lord has come, and indeed, there will reach them a punishment that cannot be repelled.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:76] When he had pleaded with them at length, they said: ‘O Abraham, desist from this, pleading. Truly your Lord’s command, for their destruction, has gone forth, and truly there will come upon them a chastisement which cannot be repelled’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((It was said) Abraham! Forsake this!) leave your argumentation. (Lo! your Lord's commandment hath gone forth) your Lord's chastisement of the people of Lot has come, (and lo! there cometh unto them a doom which cannot be repelled) it cannot be averted.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقال الرسل بوحي الله إياهم: { يَٰإِبْرَٰهِيمُ } المتحقق بمقام الخلة { أَعْرِضْ عَنْ هَـٰذَآ } الجدال\n وانصرف عن مدافعة كلام الله المبرم { إِنَّهُ قَدْ جَآءَ أَمْرُ رَبَّكَ } وثبت منه سبحانه الحكم بهلاكهم حتماً مبرماً\n ولا تنفعهم مجادلتك وممانعتك { وَإِنَّهُمْ آتِيهِمْ } عن قريب { عَذَابٌ } حتم { غَيْرُ مَرْدُودٍ } [هود: 76] بتقويتك وحمايتك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n الجدال { إنه قد جاء أمرُ ربك } بهلاكهم\n ونفذ قضاؤه الأزلي فيهم\n ولا مرد لما قضى\n { وإنهم آتيهم عذاب غير مردود } غير مصروف بجدال ولا دعاء\n ولا غير ذلك\n الإشارة: قال الورتجبي: قوله تعالى { إن أبراهيم لحليم أواه } حليم بأنه كان لا يدعو على قومه\n بل قال:\n[إبراهيم: 36] وتأوه زفرة قلبه من الشوق إلى جمال ربه\n هكذا وصْف العاشقين\n ثم قال: ومجادلته كمال الانبساط\n ولم يكن جهلاً\n ولكن كان مُشفقاً\n باراً كريماً\n رأى مكانة نفسه في محل الخلة والاصطفائية القديمة\n وهو تعالى يُحب غضب العارفين\n وتغير المحبين\n ومجادلة الصديقين\n وانبساط العاشقين حتى يحثهم على ذلك\n  وفي الحديث المروي عن النبي صلى الله عليه وسلم قال:\n \" لما أُسري بي رأيت رجلاً في الحضرة يتذمر\n فقلت لجبريل: من هذا؟ فقال: أخوك موسى يَتَذَمَّرُ عَلَى ربهِ ـ أي: يجترئ عليه انبساط ـ فقلت: وهل يليق له ذلك؟ فقال: يعرفه فيتحمل عنه \" \nثم قال: ولا يجوز الانبساط إلا لمن كان على وصفهم\n هـ\n قال في الصحاح: يَتَذَمَّرُ على فلان: إذا تَنَكَّرَ له وأَوعَدَهُ\n قاله المحشي\n والحاصل أن إبراهيم عليه السلام حملته الشفقة والرحمة\n حتى صدر\n منه ما صدر مع خلته واصطفائيته\n فالشفقة والرحمة من شأن الصالحين والعارفين المقربين\n غير أن العارفين بالله مع مراد مولاهم\n يشفقون على عباد الله\n ما لم يتعين مراد الله\n فالله أرحم بعباده من غيره\n ولذلك قال لخليله\n لما تعين قضاؤه: { يا أبراهيم أعرض عن هذا }\n فالشفقة التي تؤدي إلى معارضة القدر لا تليق بأهل الأقدار\n وفي الحكم \" ما ترك من الجهل شيئاً من أراد أن يحدث في الوقت غير ما أظهره الله \"\n ولهذا قالوا: الشفقة لا تليق بالأولياء\n  قال جعفر الصادق ـ رحمه الله ـ: ست خصال لا تحس بستة رجال: لا يحسن الطمع في العلماء\n ولا العجلة في الأمراء\n ولا الشح في الأغنياء\n ولا الكبر في الفقراء\n ولا الشفقة في المشايخ\n ولا اللؤم في ذوي الأحساب\n وقولنا: الشفقة لا تليق بالأولياء\n يعني إذا تعين مراد الله\n أو إذا ظهرت المصلحة في عدمها\n كأمر الشيخ المريد بما تموت به نفسه\n فإذا كان الشيخ يحن على الفقراء في هذا المعنى لا تكمل تربيته\n والله تعالى أعلم\n ثم ذكر قصة هلاك لوط\n\n فقال: { وَلَمَّا جَآءَتْ رُسُلُنَا لُوطاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:62",
      "similarity": 0.3779911326370213
    },
    {
      "verse": "6:4",
      "similarity": 0.37425090421949675
    },
    {
      "verse": "36:46",
      "similarity": 0.37425090421949675
    },
    {
      "verse": "15:81",
      "similarity": 0.36377539375399875
    },
    {
      "verse": "3:100",
      "similarity": 0.3490558804584857
    }
  ]
}