{
  "chapter": "هود",
  "text": "وجاءه قومه يهرعون اليه ومن قبل كانوا۟ يعملون السيـات قال يقوم هؤلاء بناتى هن اطهر لكم فاتقوا۟ الله ولا تخزون فى ضيفى اليس منكم رجل رشيد",
  "translations": [
    {
      "translation": "His people came running to him excitedly - they were long used to committing evil acts. He said, 'My people, here are my daughters. They are purer for you. So have taqwa of Allah and do not shame me with my guests. Is there not one rightly-guided man among you?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people came excited to him. They were addicted to sin already. Said (Lot): \"O my people, these daughters of mine are cleaner (and lawful) for you. Have fear of God, and do not shame me before my guests. Is there no man of discernment among you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came to him rushing. Before this they were wont to commit evil deeds. Lot said: 'My people! Here are my daughters; they are purer for you. Have fear of Allah and do not disgrace me concerning my guests. Is there not even one right-minded person in your midst?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people, who had constantly indulged in evil deeds, came running to him. He said, \"My people, here are my pure daughters. Have fear of God and do not humiliate me before my guests. Is there no person of understanding among you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came running towards him; and they were in the habit of committing evil deeds; he said, “O my people! These women of the tribe are my daughters* – they are purer for you – therefore fear Allah and do not disgrace me in the midst of my guests; is there not even a single righteous man among you?” (* The wives of those people.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came rushing towards him, and since aforetime they used to commit crimes, he said: \"O my people! Here are my daughters, they are purer for you. So have Taqwa of Allah and disgrace me not with regard to my guests! Is there not among you a single right-minded man\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came to him, (as if) rushed on towards him, and already they did evil deeds. He said: O my people! these are my daughters-- they are purer for you, so guard against (the punishment of) Allah and do not disgrace me with regard to my guests; is there not among you one right-minded man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came to him, running towards him; and erstwhile they had been doing evil deeds. He said, 'O my people, these are my daughters; they are cleaner for you. So fear God, and do not degrade me in my guests. What, is there not one man among you of a right mind?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came unto him, running towards him - and before then they used to commit abominations - He said: O my people! Here are my daughters! They are purer for you. Beware of Allah, and degrade me not in (the person of) my guests. Is there not among you any upright man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people, who were used to committing foul deeds, came running to him. He said, \"My people, here are my daughters. They are purer for you, [if you marry] so have some fear of God and do not disgrace me before my guests. Is there not a single right-minded man among you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came unto him rushing on toward him, and afore they were wont to work vices. He said. O my people! these are my daughters: purer are they for you; so fear Allah, and humiliate me not in the face of my guests; is there not among you any man right-minded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then his people came running toward him, and they had been committing vices aforetime. He said, ‘O my people, these are my daughters: they are purer for you. Be wary of Allah and do not humiliate me with regard to my guests. Is there not a right-minded man among you?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came rushing towards him, and they had been long in the habit of practising abominations. He said: \"O my people! Here are my daughters: they are purer for you (if ye marry)! Now fear Allah, and cover me not with shame about my guests! Is there not among you a single right-minded man?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came rushing towards him, and since aforetime they used to commit crimes (sodomy, etc.), he said: \"O my people! Here are my daughters (i.e. the daughters of my nation), they are purer for you (if you marry them lawfully). So fear Allah and degrade me not as regards my guests! Is there not among you a single right-minded man?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His nation came running towards him; whilst they were doing evil deeds. 'My nation' he said: 'here are my daughters (take them in marriage), they are cleaner for you. Fear Allah and do not humiliate me by my guests. Is there not one man amongst you of right mind'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came rushing towards him—they were in the habit of committing sins. He said, “O my people, these are my daughters; they are purer for you. So fear God, and do not embarrass me before my guests. Is there not one reasonable man among you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came hastening to him, and before [this] they had been doing evil deeds. He said, \"O my people, these are my daughters; they are purer for you. So fear Allah and do not disgrace me concerning my guests. Is there not among you a man of reason?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:78] And his people, when they became aware of them, came to him, running, hastening, towards him — and previously, before they came, they had been committing abominations, namely, penetrative sexual intercourse with men. He, Lot, said, ‘O my people! Here are my daughters, marry with them; they are purer for you. So fear God, and do not degrade me, [do not] disgrace me, before my guests. Is there not among you any upright man?’, to enjoin decency and forbid indecency?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And his people) the people of Lot (came unto him, running towards him) towards his house (and before then) before the coming of Gabriel (they used to commit abominations) their evil practice [sodomy]. (He said) Lot said to them: (0 my people! Here are my daughters!) it is also said that this means: here are the girls of my people! (They are purer for you) I will arrange your marriage. (Beware of Allah) fear Allah regarding the unlawful, (and degrade me not in (the person of) my guests) do not humiliate me in front of my guests. (Is there not among you any upright man) to guide you to what is right, enjoin good and forbid evil?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُهْرَعُونَ إِلَيْهِ } معناهُ يُسْتَحثُّونَ، ويُسرَعُ بِهم\n\n",
      "translations": [
        {
          "translation": " And his saying, {they hasten to him}, its meaning is that they seek him, and they hurry to him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أُخبر القوم بنزولهم { جَآءَهُ قَوْمُهُ } متجسسين { يُهْرَعُونَ إِلَيْهِ } أي: يطوفون حول بيته سريعاً، ويطلبون فرصة الدخول عليهم، ويحتالون لدفع لوط والمؤمنين وهم قوم خقبي { وَمِن قَبْلُ كَانُواْ } من نهاية خباثتهم { يَعْمَلُونَ ٱلسَّيِّئَاتِ } الخارجة عن مقتضى العقل والنقل والمروءة، وحين اضطر لوط من ترددهم وتبخترهم، ولم يرَ في نفسه مدافعتهم ومقاوتهم { قَالَ يٰقَوْمِ } لهم من غاية غيرته وحميته في حق أضيافه: { هَـٰؤُلاۤءِ } الإناث { بَنَاتِي هُنَّ أَطْهَرُ لَكُمْ } إن أردتم الوقاع { فَاتَّقُواْ اللًّهَ } المنتقم الغيور عن تفضيحي { وَلاَ تُخْزُونِ فِي ضَيْفِي } ولا تخجلوني في ضيفي { أَلَيْسَ مِنْكُمْ } أيها لمجبولون على فطرة الإدراك { رَجُلٌ رَّشِيدٌ } [هود: 78] ذو مروءة وعقل كامل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فدخلوا منزله، ولم يعلم بذلك أحد، فخرجت امرأته فأخبرتهم، { وجاءه قومُه يُهرَعُون } يُسرعون { إليه } كأنهم يُدفعون إليه دفعاً، لطلب الفاحشة من أضيافه\n { ومن قبل } ذلك الوقت { كانوا يعملون السيئات } الفواحش، كاللواطة، وغيرها، مستمرين عليها مجاهرين بها، حتى لم يستحيوا وجاؤوا يهرعون إليها\n { قال يا قوم هؤلاء بناتي } تزوجوهن، وكانوا يطلبونهن قبل، فلا يجيبهم لخبثهم، وعدم كفاءتهم، لا لحرمة المسلمات على الكفار، فإنه شرع طارئ قال ابن جزي: وإنما قال لهم ذلك ليقي أضيافه ببناته\n قيل: إن اسم بناته، الواحدة: ريثا، والأخرى: غوثاً\n هـ\n ولم يذكر الثالثة، فعرضهن عليهم، وقال: { هنَّ أطهرُ لكم } أحل لكم، أو أقل فحشاً، كقولك: الميتة أطيب من المغضوب، { فاتقوا الله } بترك الفواحش، { ولا تُحزون } لا تفضحوني { في ضيفي } في شأنهم، فإن افتضاح ضيف الرجل خزي له\n { أليس منكم رجلٌ رشيدٌ } عاقل يهتدي إلى الحق ويرعوي عن القبيح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:70",
      "similarity": 0.704899410290513
    },
    {
      "verse": "15:51",
      "similarity": 0.31406032550502283
    },
    {
      "verse": "51:24",
      "similarity": 0.29895817968966404
    },
    {
      "verse": "54:37",
      "similarity": 0.2588175091065909
    },
    {
      "verse": "15:68",
      "similarity": 0.16821168958259303
    }
  ]
}