{
  "chapter": "هود",
  "text": "وجاءه قومه يهرعون اليه ومن قبل كانوا۟ يعملون السيـات قال يقوم هؤلاء بناتى هن اطهر لكم فاتقوا۟ الله ولا تخزون فى ضيفى اليس منكم رجل رشيد",
  "translations": [
    {
      "translation": "His people came running to him excitedly - they were long used to committing evil acts. He said, 'My people, here are my daughters. They are purer for you. So have taqwa of Allah and do not shame me with my guests. Is there not one rightly-guided man among you?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people came excited to him. They were addicted to sin already. Said (Lot): \"O my people, these daughters of mine are cleaner (and lawful) for you. Have fear of God, and do not shame me before my guests. Is there no man of discernment among you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came to him rushing. Before this they were wont to commit evil deeds. Lot said: 'My people! Here are my daughters; they are purer for you. Have fear of Allah and do not disgrace me concerning my guests. Is there not even one right-minded person in your midst?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people, who had constantly indulged in evil deeds, came running to him. He said, \"My people, here are my pure daughters. Have fear of God and do not humiliate me before my guests. Is there no person of understanding among you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came running towards him; and they were in the habit of committing evil deeds; he said, “O my people! These women of the tribe are my daughters* – they are purer for you – therefore fear Allah and do not disgrace me in the midst of my guests; is there not even a single righteous man among you?” (* The wives of those people.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came rushing towards him, and since aforetime they used to commit crimes, he said: \"O my people! Here are my daughters, they are purer for you. So have Taqwa of Allah and disgrace me not with regard to my guests! Is there not among you a single right-minded man\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came to him, (as if) rushed on towards him, and already they did evil deeds. He said: O my people! these are my daughters-- they are purer for you, so guard against (the punishment of) Allah and do not disgrace me with regard to my guests; is there not among you one right-minded man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came to him, running towards him; and erstwhile they had been doing evil deeds. He said, 'O my people, these are my daughters; they are cleaner for you. So fear God, and do not degrade me in my guests. What, is there not one man among you of a right mind?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came unto him, running towards him - and before then they used to commit abominations - He said: O my people! Here are my daughters! They are purer for you. Beware of Allah, and degrade me not in (the person of) my guests. Is there not among you any upright man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people, who were used to committing foul deeds, came running to him. He said, \"My people, here are my daughters. They are purer for you, [if you marry] so have some fear of God and do not disgrace me before my guests. Is there not a single right-minded man among you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came unto him rushing on toward him, and afore they were wont to work vices. He said. O my people! these are my daughters: purer are they for you; so fear Allah, and humiliate me not in the face of my guests; is there not among you any man right-minded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then his people came running toward him, and they had been committing vices aforetime. He said, ‘O my people, these are my daughters: they are purer for you. Be wary of Allah and do not humiliate me with regard to my guests. Is there not a right-minded man among you?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came rushing towards him, and they had been long in the habit of practising abominations. He said: \"O my people! Here are my daughters: they are purer for you (if ye marry)! Now fear Allah, and cover me not with shame about my guests! Is there not among you a single right-minded man?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came rushing towards him, and since aforetime they used to commit crimes (sodomy, etc.), he said: \"O my people! Here are my daughters (i.e. the daughters of my nation), they are purer for you (if you marry them lawfully). So fear Allah and degrade me not as regards my guests! Is there not among you a single right-minded man?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His nation came running towards him; whilst they were doing evil deeds. 'My nation' he said: 'here are my daughters (take them in marriage), they are cleaner for you. Fear Allah and do not humiliate me by my guests. Is there not one man amongst you of right mind'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came rushing towards him—they were in the habit of committing sins. He said, “O my people, these are my daughters; they are purer for you. So fear God, and do not embarrass me before my guests. Is there not one reasonable man among you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people came hastening to him, and before [this] they had been doing evil deeds. He said, \"O my people, these are my daughters; they are purer for you. So fear Allah and do not disgrace me concerning my guests. Is there not among you a man of reason?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:78] And his people, when they became aware of them, came to him, running, hastening, towards him — and previously, before they came, they had been committing abominations, namely, penetrative sexual intercourse with men. He, Lot, said, ‘O my people! Here are my daughters, marry with them; they are purer for you. So fear God, and do not degrade me, [do not] disgrace me, before my guests. Is there not among you any upright man?’, to enjoin decency and forbid indecency?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأي جاءه بعضُ قومه . وإنما أسند المجيء إلى القوم لأن مثل ذلك المجيء دأبهم وقد تمالؤوا على مثله ، فإذا جاء بعضهم فسيعقبه مجيء بعض آخر في وقت آخر . وهذا من إسناد الفعل إلى القبيلة إذا فعله بعضها ، كقول الحارث بن وعلة الجرمي: ... قومي همُ قتلوا أمَيْمة أخيفإذا رميتُ يصيبني سهمي ... و { يُهرعون } بضم الياء وفتح الراء على صيغة المبني للمفعول فسّروه بالمشي الشبيه بمشي المدفوع ، وهو بين الخبب والجَمْز ، فهو لا يكون إلا مبنيّاً للمفعول لأن أصله مشي الأسير الذي يُسرَع به . وهذا البناء يقتضي أن الهَرْع هو دفع الماشي حين مشيه؛ إلاّ أن ذلك تنوسِيَ ، وبقي أهرع بمعنى سار سيراً كسير المدفوع ، ولذلك قال جمع من أهل اللغة : إنّه من الأفعال التي التزموا فيها صيغة المفعول لأنها في الأصل مسندة إلى فاعللٍ غير معلوم . وفسّره في «الصحاح» و«القاموس» بأنه الارتعاد من غضب أو خوف ، وعلى الوجهين فجملة { يهرعون } حال .وقد طوى القرآن ذكر الغرض الذي جاؤوا لأجله مع الإشارة إليه بقوله : { ومن قبل كانوا يعملون السيّئات } فقد صارت لهم دأباً لا يسعون إلاّ لأجله .وجملة { قال يا قوم } إلخ مستأنفة بيانياً ناشئاً عن جملة { وجاءه قومه } ، إذ قد علم السامع غرضهم من مجيئهم ، فهو بحيث يسأل عمّا تلقّاهم به .وبادرهم لوط عليه السّلام بقوله : { يا قوم هؤلاء بناتي هن أطهر لكم }. وافتتاح الكلام بالنّداء وبأنّهم قومه ترقيق لنفوسهم عليه ، لأنّه يعلم تصلبهم في عادتهم الفظيعة كما دلّ عليه قولهم : { لقد علمتَ ما لنا في بناتك من حق } \\[ هود : 79 \\] ، كما سيأتي .والإشارة ب { هؤلاء } إلى { بناتي }. و { بناتي } بدل من اسم الإشارة ، والإشارة مستعملة في العَرض ، والتقديرُ : فخذوهن .وجملة { هنّ أطهر لكم } تعليل للعرض . ومعنى { هنّ أطهر } أنهنّ حلال لكم يَحُلْنَ بينكم وبين الفاحشة ، فاسم التفضيل مسلوب المفاضلة قصد به قوّة الطهارة .و { هؤلاء } إشارة إلى جمع ، إذ بُيّنَ بقوله : { بناتي }.وقد رُويَ أنه لم يكن له إلاّ ابنتان ، فالظّاهر أن إطلاق البنات هنا من قبيل التشبيه البليغ ، أي هؤلاء نساؤهن كبناتي . وأراد نساءً من قومه بعدد القوم الذين جاءوا يُهرعون إليه . وهذا معنى ما فسر به مجاهد ، وابن جبير ، وقتادة ، وهو المناسب لجعلهنّ لقومه إذ قال : { هنّ أطهر لكم } ، فإن قومه الذين حضروا عنده كثيرون ، فيكون المعنى : هؤلاء النساء فتَزَوّجوهنّ . وهذا أحسن المحامل .وقيل : أراد بنات صلبه ، وهو رواية عن قتادة . وإذ كان المشهور أنّ لوطاً عليه السّلام له ابنتان صار الجمع مستعملاً في الاثنين بناء على أن الاثنين تعامل معاملة الجمع في الكلام كقوله تعالى : { فقد صَغَت قلوبكما } \\[ التحريم : 4 \\].وقيل : كان له ثلاث بنات .وتعترض هذا المَحمل عقبتان :الأولى : أنّ القوم كانوا عدداً كثيراً فكيف تكفيهم بنتان أو ثلاث؟ .الثانية : أن قوله : { هؤلاء بناتي } عرض عليهم كما علمت آنفاً ، فكيف كانت صفة هذه التخلية بين القوم وبين البنات وهم عدد كثير ، فإن كان تزويجاً لم يكفين القوم وإن كان غير تزويج فما هو؟ .والجواب عن الأول : أنه يجوز أن يكون عدد القوم الذين جاؤوه بقدر عدد بناته أو أن يكون مع بناته حتى من قومه . وعن الثاني : أنه يجوز أن يكون تصرف لوط عليه السّلام في بناته بوصف الأبوة ، ويجوز أن يكون تصرفاً بوصف النبوءة بالوحي للمصلحة أن يكون من شرع لوط عليه السّلام إباحة تمليك الأب بناته إذا شاء ، فإن كان أولئك الرهط شركاء في ملك بناته كان استمتاع كل واحد بكل واحدة منهنّ حلالاً في شريعته على نحو ما كان البغاء من بقايا الجاهلية في صدر الإسلام قبل أن ينسخ .وأما لحاق النسب في أولاد من تحمل منهنّ فيجوز أن يكون الولد لاحقاً بالذي تُليطه أمه به من الرجال الذين دخلوا عليها ، كما كان الأمر في البغايا في صدر الإسلام ، ويجوز أن لا يلحق الأولاد بآباء فيكونوا لاحقين بأمّهاتهم مثل ابن الزنى وولد اللّعان ، ويكون هذا التحليل مباحاً ارتكاباً لأخف الضررين ، وهو ممّا يشرع شرعاً مؤقتاً مثل ما شرع نكاح المتعة في أوّل الإسلام على القول بأنه محرّماً وهو قول الجمهور .وقد اشتغل المفسرون عن تحرير هذا بمسألة تزويج المؤمنات بالكفّار وهو فضول .وفرع على قوله : { هنّ أطهر لكم } أن أمرهم بتقوى الله لأنّهم إذا امتثلوا ما عرض لهم من النساء فاتّقوا الله .وقرأ الجمهور { ولا تخزون } بحذف ياء المتكلم تخفيفاً . وأثبتها أبو عمرو .والخزي : الإهانة والمذلة . وتقدم آنفاً . وأراد مذلته .و { في } للظرفية المجازيّة . جعل الضيف كالظرف ، أي لا تجعلوني مخزياً عند ضيفي إذ يلحقهم أذى في ضيافتي ، لأنّ الضيافة جوار عند ربّ المنزل ، فإذا لحقت الضيف إهانة كانت عاراً على ربّ المنزل .والضيف : الضائف ، أي النازل في منزل أحد نزولاً غير دائم ، لأجل مرور في سفر أو إجابة دعوة .وأصل ضيف مصدر فعل ضاف يضيف ، ولذلك يطلق على الواحد وأكثر ، وعلى المذكر والمؤنث بلفظ واحد ، وقد يعامل معاملة غير المصدر فيجمع كما قال عمرو بن كلثوم :نزلتم منزل الأضياف منّاوقد ظن لوط عليه السّلام الملائكة رجالاً مارّين ببيته فنزلوا عنده للاستراحة والطعام والمبيت .والاستفهام في { أليس منكم رجل رشيد } إنكار وتوبيخ لأنّ إهانة الضيف مسبّة لا يفعلها إلاّ أهل السفاهة .وقوله : { منكم } بمعنى بعضكم أنكر عليهم تمالؤهم على الباطل وانعدام رجل رشيد من بينهم ، وهذا إغراء لهم على التعقل ليظهر فيهم من يتفطّن إلى فساد ما هم فيه فينهاهم ، فإنّ ظهور الرشيد في الفئة الضالة يفتح باب الرشاد لهم . وبالعكس تمالؤُهم على الباطل يزيدهم ضراوة به .\n\n",
      "translations": [
        {
          "translation": "(And his people) the people of Lot (came unto him, running towards him) towards his house (and before then) before the coming of Gabriel (they used to commit abominations) their evil practice [sodomy]. (He said) Lot said to them: (0 my people! Here are my daughters!) it is also said that this means: here are the girls of my people! (They are purer for you) I will arrange your marriage. (Beware of Allah) fear Allah regarding the unlawful, (and degrade me not in (the person of) my guests) do not humiliate me in front of my guests. (Is there not among you any upright man) to guide you to what is right, enjoin good and forbid evil?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُهْرَعُونَ إِلَيْهِ } معناهُ يُسْتَحثُّونَ، ويُسرَعُ بِهم\n\n",
      "translations": [
        {
          "translation": " And his saying, {they hasten to him}, its meaning is that they seek him, and they hurry to him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أُخبر القوم بنزولهم { جَآءَهُ قَوْمُهُ } متجسسين { يُهْرَعُونَ إِلَيْهِ } أي: يطوفون حول بيته سريعاً\n ويطلبون فرصة الدخول عليهم\n ويحتالون لدفع لوط والمؤمنين وهم قوم خقبي { وَمِن قَبْلُ كَانُواْ } من نهاية خباثتهم { يَعْمَلُونَ ٱلسَّيِّئَاتِ } الخارجة عن مقتضى العقل والنقل والمروءة\n وحين اضطر لوط من ترددهم وتبخترهم\n ولم يرَ في نفسه مدافعتهم ومقاوتهم { قَالَ يٰقَوْمِ } لهم من غاية غيرته وحميته في حق أضيافه: { هَـٰؤُلاۤءِ } الإناث { بَنَاتِي هُنَّ أَطْهَرُ لَكُمْ } إن أردتم الوقاع { فَاتَّقُواْ اللًّهَ } المنتقم الغيور عن تفضيحي { وَلاَ تُخْزُونِ فِي ضَيْفِي } ولا تخجلوني في ضيفي { أَلَيْسَ مِنْكُمْ } أيها لمجبولون على فطرة الإدراك { رَجُلٌ رَّشِيدٌ } [هود: 78] ذو مروءة وعقل كامل\n\n\n{ قَالُواْ } في جوابه مبالغين مقسمين: والله { لَقَدْ عَلِمْتَ } يقيناً { مَا لَنَا فِي بَنَاتِكَ مِنْ حَقٍّ } أي: ميلٍ وحظٍ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وجاءه قومُه يُهرَعُون } يُسرعون { إليه } كأنهم يُدفعون إليه دفعاً\n لطلب الفاحشة من أضيافه\n { ومن قبل } ذلك الوقت { كانوا يعملون السيئات } الفواحش\n كاللواطة\n وغيرها\n مستمرين عليها مجاهرين بها\n حتى لم يستحيوا وجاؤوا يهرعون إليها\n { قال يا قوم هؤلاء بناتي } تزوجوهن\n وكانوا يطلبونهن قبل\n فلا يجيبهم لخبثهم\n وعدم كفاءتهم\n لا لحرمة المسلمات على الكفار\n فإنه شرع طارئ قال ابن جزي: وإنما قال لهم ذلك ليقي أضيافه ببناته\n قيل: إن اسم بناته\n الواحدة: ريثا\n والأخرى: غوثاً\n هـ\n ولم يذكر الثالثة\n فعرضهن عليهم\n وقال: { هنَّ أطهرُ لكم } أحل لكم\n أو أقل فحشاً\n كقولك: الميتة أطيب من المغضوب\n { فاتقوا الله } بترك الفواحش\n { ولا تُحزون } لا تفضحوني { في ضيفي } في شأنهم\n فإن افتضاح ضيف الرجل خزي له\n { أليس منكم رجلٌ رشيدٌ } عاقل يهتدي إلى الحق ويرعوي عن القبيح\n { قالوا لقدْ علمتَ ما لنا من بناتك من حقٍّ } من حاجة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:70",
      "similarity": 0.704899410290513
    },
    {
      "verse": "15:51",
      "similarity": 0.31406032550502283
    },
    {
      "verse": "51:24",
      "similarity": 0.29895817968966404
    },
    {
      "verse": "54:37",
      "similarity": 0.2588175091065909
    },
    {
      "verse": "15:68",
      "similarity": 0.16821168958259303
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011078.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011078.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:78.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}