{
  "chapter": "هود",
  "text": "وهو الذى خلق السموت والارض فى ستة ايام وكان عرشه على الماء ليبلوكم ايكم احسن عملا ولئن قلت انكم مبعوثون منۢ بعد الموت ليقولن الذين كفروا۟ ان هذا الا سحر مبين",
  "translations": [
    {
      "translation": "It is He who created the heavens and the earth in six days when His Throne was on the water, in order to test which of you has the best actions. If you say, 'You will be raised up after death,' those who are kafir will say, 'This is nothing but downright magic'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth In six spans, and has control over the waters (of life) so that he may bring out the best that everyone of you could do. Yet if you said to them: \"You shall certainly be raised from the dead,\" the unbelievers will say: \"This will be nothing but sorcery.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who created the heavens and the earth in six days - and [before that] His Throne was upon the water that He may test you, who of you is better in conduct If you were to say (O Muhammad): 'All of you will surely be raised after death', then those who disbelieve will certainly say: 'This is nothing but plain sorcery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God created the heavens and the earth in six days. His Throne existed on water so that He could test you and find out those among you who do good deeds. (Muhammad), if you were to tell them that after death they would be brought back to life again, the unbelievers would say, \"This is nothing but obvious magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who created the heavens and the earth in six days – and His Throne was upon the water – so that He might test you, as to who among you have the best deeds*; and if you (O dear Prophet Mohammed – peace and blessings be upon him) say, “Indeed you will be raised again after death”, the disbelievers will surely say, “This is nothing but clear magic.” (* The creation of all things is in order to test mankind.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has created the heavens and the earth in six Days and His Throne was over the water, that He might try you, which of you is the best in deeds. But if you were to say to them: \"You shall indeed be raised up after death,\" those who disbelieve would be sure to say, \"This is nothing but obvious magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who created the heavens and the earth in six periods-- and His dominion (extends) on the water-- that He might manifest to you, which of you is best in action, and if you say, surely you shall be raised up after death, those who disbelieve would certainly say: This is nothing but clear magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who created the heavens and the earth in six days, and His Throne was upon the waters -- that He might try you, which one of you is fairer in works. And if thou sayest, 'you shall surely be raised up after death,' the unbelievers will say, 'This is naught but a manifest sorcery.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who created the heavens and the earth in six Days - and His Throne was upon the water - that He might try you, which of you is best in conduct. Yet if thou (O Muhammad) sayest: Lo! ye will be raised again after death! those who disbelieve will surely say: This is naught but mere magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enthroned above the waters, it was He who created the heavens and the earth in six Days [periods], in order to test which of you is best in conduct. If you say, \"You will [all] be raised up after death,\" those who deny the truth will say, \"This is just sheer sorcery!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is who hath created the heavens and the earth in six days -and His throne was upon the water--that he might prove you, as to which of you is excellent in work. And if thou sayest: ye shall verily be raised after death, surely those who disbelieve will say: naught is this but sorcery manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in six days—and His Throne was [then] upon the waters—that He may test you [to see] which of you is best in conduct. Yet if you say, ‘You will indeed be raised up after death,’ the faithless will surely say, ‘This is nothing but plain magic.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created the heavens and the earth in six Days - and His Throne was over the waters - that He might try you, which of you is best in conduct. But if thou wert to say to them, \"Ye shall indeed be raised up after death\", the Unbelievers would be sure to say, \"This is nothing but obvious sorcery!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has created the heavens and the earth in six Days and His Throne was on the water, that He might try you, which of you is the best in deeds. But if you were to say to them: \"You shall indeed be raised up after death,\" those who disbelieve would be sure to say, \"This is nothing but obvious magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in six days and His Throne was upon the waters that He might try you, (and see) which of you excel in works. If you say: 'After death you shall be raised up' the unbelievers will say: 'This is nothing but clear sorcery'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in six days—and His Throne was upon the waters—in order to test you—which of you is best in conduct. And if you were to say, “You will be resurrected after death,” those who disbelieve would say, “This is nothing but plain witchcraft.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who created the heavens and the earth in six days - and His Throne had been upon water - that He might test you as to which of you is best in deed. But if you say, \"Indeed, you are resurrected after death,\" those who disbelieve will surely say, \"This is not but obvious magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:7] And He it is Who created the heavens and the earth in six days, the first of which was Sunday and the last, Friday — and His Throne, before creating them, was upon the water, borne by the winds — that He might try you (li-yabluwakum is semantically connected to khalaqa, ‘He [Who] created’), in other words, He created them and all that is beneficial and good for you in them, in order to test you: which of you is best in conduct, that is, [which of you] is most obedient to God. And if you were to say, O Muhammad (s), to them: ‘Truly you shall be raised again after death’, those who disbelieve will say, ‘This, Qur’ān that speaks of resurrection — or, [this] that you are saying — is nothing but manifest, clear, sorcery’ (sihrun: a variant reading has sāhirun, ‘sorcerer’, in which case the reference is to the Prophet (s).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He it is Who created the heavens and the earth in six Days) six days of the beginning of this world: each day the equivalent of one thousand years, the first day being Sunday and the last Friday (and His Throne) before the creation of the heavens and earth (was upon the water) and Allah was before the Throne and before water (that He might try you) that He may test you in the interval between life and death, (which of you is best in conduct) which of you is more sincere in his works. (Yet if thou (0 Muhammad) sayst) to the people of Mecca: (Lo! ye will be raised again) you will be brought back to life again (after death! those who disbelieve) the disbelievers of Mecca (will surely say: This) which Muhammad (pbuh) is saying (is naught but mere magic) manifest lies which will never happen.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَانَ عَرْشُهُ عَلَى ٱلْمَآءِ } معناهُ العزُّ والسُّلطانُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His throne was on the water { } meaning His power and sovereignty.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وهو الذي خلقَ السموات والأرض في ستة أيام } أي: خلق العالم الجسماني في ست جهات { وكان عرشه على الماء } أي: عرشه الذي هو العقل الأول مبتنياً على العلم الأول مستنداً إليه مقدماً بالوجود على عالم الأجسام، وإن أوّلنا الأيام الستة بمدة الخفاء كما مر وخلق السموات والأرض باختفائه تعالى بتفاصيل الموجودات فمعنى كون عرشه على الماء كونه قبل بداية الاختفاء ظاهراً معلوماً للناس كقولك: فعلته على علم، أي: في حال كونه معلوماً لي، أو كوني عالماً به، أي: على المعلومية كما قال حارثة حين سأله رسول الله صلى الله عليه وسلم:\n\n \" كيف أصبحت يا حارثة؟ \" قال: أصبحت مؤمناً حقاً\n قال صلى الله عليه وسلم: \" لكل حق حقيقة، فما حقيقة إيمانك؟ \" قال: رأيت أهل الجنة يتزاورون ورأيت أهل النار يتعاوون ورأيت عرش ربي بارزاً\n قال صلى الله عليه وسلم: \" أصبت، فالزم \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أنى يعزب ويغيب عن عمله شيء؟! { هُوَ ٱلَّذِي خَلَق } أي: أظهر وأبدع { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: العلويات والسفليات اللتين هما بمثابتة الآباء والأمهات والفواعل والقوابل لنشأتكم وظهوركم { فِي سِتَّةِ أَيَّامٍ } ليحيط بالجهات كلها { وَكَانَ عَرْشُهُ } أي: مجلاه ومحل بروزه على الماء\n وتشعشع تجلياته قبل ظهور هذه المظاهر والمكونات { عَلَى ٱلْمَآءِ } أي: على الحياة الحقيقية الخالية من التغرات والانقالابات المتوهمة من التعينات العدمية والتشخيصات الهيولانية\n وإنما أظهرها على هذا التمثال وأوجدهها على هذا المنوال { لِيَبْلُوَكُمْ } ويختبركم أيها الأظلال والعكوس { أَيُّكُمْ أَحْسَنُ عَمَلاً } وقبولاً\n وأتم توجهاً ورجوعاً\n وأكمل تحققاً ووصولاً في يوم الجزاء\n\n\n{ وَ } بعدما نبههم الحق على ما هو الحق\n وأوجدهم على فطرة الفطنة و الذكاء بمبدئهم ونشأتهم الأصلية { لَئِن قُلْتَ } يا أكمل الرسل تذكيراً له وإصلاحاً لحالهم: { إِنَّكُمْ مَّبْعُوثُونَ مِن بَعْدِ ٱلْمَوْتِ } للحساب والجزاء وتنفيذ الأعمال\n فعليكم أن تتهيأوا لها وتدخروا لأجلها حتى لا تؤاخذوا و لاتعاقبوا { لَيَقُولَنَّ ٱلَّذِينَ كَفَرُوۤاْ } منهم من كمال غفلتهم وقسوتهم بعدما سمعوا منك قولك هذا: { إِنْ هَـٰذَآ } أي: ما الذي تقول به هذا الرجل إن وقع وتحقق { إِلاَّ سِحْرٌ مُّبِينٌ } [هود: 7] عظيم\n إذ إحياء الموتى من العظام الرفات لا يُتصور إلا بالسحر الخارق للعادات\n فإن وقع فهو في غاية العظمة ونهاية الغرابة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وهو الذي خلق السماوات والأرض } وما بينهما وما فيهما { في } مقدار { ستة أيام } من أيام الدنيا، أو خلق العالم العلوي والسفلي في مقدار ذلك\n وجمع السماوات دون الأرض لاختلاف العلويات بالأصل والذات دون السفليات\n { وكان عرشه على الماء } قيل: لم يكن بينهما حائل، وكان موضوعاً على متن الماء\n واستدل به على إمكان الخلاء، وعلى أن الماء أول حادث بعد العرش من أجرام هذا العالم\n وقيل: كان الماء على متن الريح\n والله أعلم بذلك\n قاله البيضاوي\n  قلت: الخلاء هو الفضاء الخارج عن دائرة الأكوان\n وهو عند المتكلمين من جملة الممكنات، ووجه الاستدلال من الآية على إمكانه: أن العرش والماء لما كانا محصورين لزم أن يكون ما خرج عنهما خلاء، وكل ما سوى الله فهو ممكن\n وعند الصوفية: هو أسرارالذات الأزلية الجبروتية، كما أن الأكوان هي أنوار الصفات الملكوتية، ولا شيء معه، { سبحانه وتعالى عما يشركون }\n ونقل بعض أهل التاريخ: أن الله تعالى خلق بعد العرش ياقوته صفراء، ذكروا من عظمتها وسعتها، ثم نظر إليها، فذابت من هيبته، فصارت ماء، فكان العرش مرتفعاً فوقها، ثم اضطرب ذلك الماء، فعلته زبدة، خلق منها الأرض، ثم ارتفع من الماء دخان خلق منه السماوات\n هـ\n  خلق ذلك { لِيبلُوكم أيُّكم أحسن عملاً } أي: ليختبركمْ اختباراً تقوم به الحجة عليكم، { أيكم احسن عملاً } بالزهد في هذا العالم الفاني، وتعلق الهمه بالعالم الباقي قال البيضاوي: أي: يعاملكم معاملة المبتلى لأحوالكم، كيف تعملون؟ فإن جملة ذلك أسباب ومواد لوجودكم ومعاشكم، وما تحتاج إليه أعمالكم، ودلائل وأمارات تستدلون بها وتستنبطون منها\n ثم قال: فالمراد بالعمل ما يعم عمل القلب والجوارح\n ولذلك قال صلى الله عليه وسلم:\n\n \" أيكم أحسن عقلاً وأورع عن محارم الله وأسرع في طاعة الله \"\n \n\nوالمعنى: أكمل علماً وعملاً\n هـ\n  قال المحشي: ويتجه كون المعنى: أيكم أكثر شكراً لله على تمهيد تلك المنافع والمصالح\n والشكر يشمل الطاعات القلبية والبدنية\n ويحتمل أنه كآية:\n\n[الذاريات: 56]\n وأن بقاء الدنيا وخلقها إنما هو للتكليف، فإذا لم يبق في الأرض من يعبد الله انقضت الدنيا، وجاءت الساعة، كما تقتضيه الأحاديث الصحاح والمتبادر ما قدمناه، وحاصله: أنه خلق الأشياء من أجل ابن آدم، ولتدله على خالقه فيجني بها ثمار معرفته تعالى، ويعترف بشكره، وإفراد عبادته\n وقد جاء: \" خلقت الأشياء من أجلك وخلقتك من أجلي \"\n قلت: فيكون المعنى: هو الذي أظهر الوجود من عرشه إلى فرشه، ليختبركم أيكم أحسن عملاً بالاشتغال بالله، والعكوف في حضرته دون الوقوف مع ظاهر الكون، والاشتغال بحسه، مع كونه خُلق من أجله\n\n\nثم قال: وقوله تعالى: { لئن قلت إنكم مبعوثون من بعد الموت\n\n\n } الآية، هو: تنبيه على أن الإنكار الكفار للبعث بعد إقرارهم بأن الله تعالى خالق العالم، الذي هو أعظم من البعث، تناقض منهم لأن إقرارهم بقدرته على الأكبر، ثم إنكارهم لما هو أيسر تناقض\n هـ\n أي: ولئن ذكرت لهم البعث بعد الموت لقالوا ما هذا إلا سحر ظاهر\n أي: ما البعث أو القول به، أو القرآن المتضمن لذكره إلا كالسحر في الخديعة أو البطلان\n وقرأ حمزة ساحر أي: القائل بهذا\n والله تعالى أعلم\n  الإشارة: في صحيح البخاري قال صلى الله عليه وسلم:\n\n \" كَانَ اللَّهُ ولا شَيء مَعه، وكَانَ عَرْشُهُ عَلَى المَاءِ \" \n\nالحديث\n فأخبر صلى الله عليه وسلم أن الحق جل جلاله كان في أزله لا شيء معه، ثم أظهر الأشياء من نوره بنوره لنوره، فهو الآن على ما كان عليه\n وعن أبي رَزِينٍ: قلنا: يا رَسُولَ الله! أَيْنَ كَانَ ربُّنَا قَبْل أنْ يَخْلُقَ خَلقَهُ؟ قال:\n\n \" كَان في عَمَاءٍ ما فَوْقَه هَوَاءٌ، ومَا تَحْتَهُ هَوَاءٌ، وخَلَق عَرشَه عَلَى المَاءِ \"\n \n\nوالعماء هو: الخفاء، قال تعالى:\n\n[القصص: 66]،أي: خفيت\n ويقال للسحاب عماء لأنه يخفى ما فيه\n وقال الششتري: في المقاليد: كان في عمّى، ما فوقه هَوَاء، وما تحته هواء\n هي الوحدة المُصْمتة الصّمدية، البحر الطامس الذي هو الأزل والأبد، فلم يكن موجود غير الوجود هو هو\nهـ\n  والحاصل: أن الحق جل جلاله كا في سابق أزله ذاتاً مقدسة، لطيفة خفيفة عن العقول، نورانية متصفة بصفات الكمال، ليس معها رسوم ولا أشكال، ثم أظهر الحق تعالى قبضة من نوره حسية معنوية إذ لا ظهور للمعنى إلا بالحس، فقال لها: كوني محمداً، فمن جهة حسها محصورة، ومن جهة معناها لا نهاية لها، متصلة ببحر المعاني الأزلي، الذي برزت منه، وما نسبتها من ذلك البحر من جهة حسها إلا كخردلة في الهواء\n وقد أشار ابن الفارض إلى وصف هذه الخمرة الأزلية ـ وهو تفسير للعماء المذكور قبلُ ـ فقال:\n\nفالأشكال والرسوم متفرعة من تلك القبضة المحمدية، والقبضة متدفقة من بحر الجبروت الذي لا نهاية له، فهي حقيقة، وما ظهر تحديدها إلا من جهة حسها\n فهي كثلجة في بحرٍ، ماؤها الباطن متصل في البحر، وظاهرها محدود محصور\n فالأشكال كلها غريقة في بحر الجبروت\n ولذلك قال صاحب العينية:\n\nوقال أيضاً:\n\nفالأكوان ثابتة بإثباته، ممحوة بأحدية ذاته، فالحق تعالى كما كان لا شيء معه، فهو الآن كما كان\n إذ التغير في حقه تعالى مُحال، ولا يعلم هذه الأسرار إلا من صحب أهل الأسرار، وحسب من لم يصحبهم التسليم\n كما رمزوا وأشاروا إليه:\n\nوقوله تعالى: { ليبلُوكم أيكم أحسنُ عملاُ } أي: ليظهر منكم من يقف مع الأكون، ومن ينفذ إلى شهود المكون\n وهو الذي حسن عمله، وارتفعت همته\n ولئن قلت أيها العامي: إنكم تحيون بالمعرفة من بعد موت قلوبكم بالجهل والغفلة إن صحبتمُوني، ليقولن أهلُ الإنكار: إن هذا إلا سحر مبين\n ثم خوفهم بالعذاب الذي استعجلوه، فقال: { وَلَئِنْ أَخَّرْنَا عَنْهُمُ ٱلْعَذَابَ إِلَىٰ أُمَّةٍ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:59",
      "similarity": 0.6798018895106508
    },
    {
      "verse": "32:4",
      "similarity": 0.648437241189302
    },
    {
      "verse": "10:3",
      "similarity": 0.6259010988659408
    },
    {
      "verse": "57:4",
      "similarity": 0.44932712688393345
    },
    {
      "verse": "58:4",
      "similarity": 0.35493897359807747
    }
  ]
}