{
  "chapter": "هود",
  "text": "قالت يويلتى ءالد وانا۠ عجوز وهذا بعلى شيخا ان هذا لشىء عجيب",
  "translations": [
    {
      "translation": "She said, 'Woe is me! How can I give birth when I am an old woman and my husband here is an aged",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"Woe betide me! Will I give birth when I am old and this my husband be aged? This is indeed surprising!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: 'Woe is me! Shall I bear a child now that I am an old woman and my husband is well advanced in years. This is indeed strange!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"Woe is me! How can I have a baby when I am barren and my husband is very old? This is certainly strange\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “Oh woe to me – will I bear a child whereas I am an old woman, and this my husband, is an old man? This is something really extraordinary.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said (in astonishment): \"Woe unto me! Shall I bear a child while I am an old woman, and here is my husband an old man Verily, this is a strange thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: O wonder! shall I bear a son when I am an extremely old woman and this my husband an extremely old man? Most surely this is a wonderful thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, 'Woe is me! Shall I bear, being an old woman, and this my husband is an old man? This assuredly is a strange thing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: Oh woe is me! Shall I bear a child when I am an old woman, and this my husband is an old man? Lo! this is a strange thing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"Alas! Shall I bear a child in this old age, while my husband here is also old? This is indeed a strange thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: Oh for me shall bring forth when I am old, and this my husband is advanced in years! Verily a marvellous thing is this!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, ‘Oh, my! Shall I, an old woman, bear [children], and [while] this husband of mine is an old man?! That is indeed an odd thing!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"Alas for me! shall I bear a child, seeing I am an old woman, and my husband here is an old man? That would indeed be a wonderful thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said (in astonishment): \"Woe unto me! Shall I bear a child while I am an old woman, and here is my husband, an old man? Verily! This is a strange thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She replied: 'Alas for me! Shall I bear (a child) when I am old woman and my husband is advanced in years? This is indeed a strange thing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “Alas for me. Shall I give birth, when I am an old woman, and this, my husband, is an old man? This is truly a strange thing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"Woe to me! Shall I give birth while I am an old woman and this, my husband, is an old man? Indeed, this is an amazing thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:72] She said, ‘Woe to me! (yā waylatā is an expression used in [reaction to] a serious matter; the alif [suffixed in waylatā] substitutes for the yā’ of the genitive annexation [waylatī, ‘my woe’]). Shall I bear a child when I am an old woman, 99 years old, and this my husband is an old man?, 100 or 120 years old (shaykhan is in the accusative because it is a circumstantial qualifier, operated by the demonstrative import of dhā, ‘this’). Truly this is a strange thing’, that a child should be born to such an aged couple.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nولما بشّروها بذلك صرحت بتعجبها الذي كتمته بالضحك ، فقالت : { يا ويلتا أألد وأنا عجوز وهذا بعلي شيخاً إنّ هذا لشيءٌ عجيب } ، فجملة { قالت } جواب للبشارة .و ( يعقوب ) مبتدأ { ومن وراء إسحاق } خبر ، والجملة على هذا في محلّ الحال . وهذه قراءة الجمهور . وقرأ ابن عامر ، وحمزة ، وحفص { يعقوبَ } بفتحة وهو حينئذٍ عطف على { إسحاق }. وفصل بين حرف العطف والمعطوف بالظرف وخطبه سهل وإن استعظمه ظاهرية النحاة كأبي حيان بقياس حرف العطف النائب هنا مناب الجار على الجار نفسه ، وهو قياس ضعيف إذ كون لفظ بمعنى لفظ لا يقتضي إعطاءه جميع أحكامه كما في «مغني اللبيب» .والنداء في { يا ويلتا } استعارة تبعية بتنزيل الويلة منزلة من يعقل حتّى تنادى ، كأنها تقول : يا ويلتي احضر هنا فهذا موضعك .والويلة : الحادثة الفظيعة والفضيحة . ولعلّها المرة من الويل . وتستعمل في مقام التعجب ، يقال : يا ويلتي .واتّفق القرّاء على قراءة { يا ويلتا } بفتحة مشبعة في آخره بألف . والألف التي في آخر { يا ويلتا } هنا يجوز كونها عوضاً عن ياء المتكلم في النداء . والأظهر أنها ألف الاستغاثة الواقعة خلَفاً عن لام الاستغاثة . وأصله : يا لَويلة . وأكثر ما تجيء هذه الألف في التعجّب بلفظ عجب ، نحو : يا عجباً ، وباسم شيء متعجب منه ، نحو : يا عشبا .وكتب في المصحف بإمالة ولم يقرأ بالإمالة ، قال الزجاج : كتب بصورة الياء على أصل ياء المتكلم .والاستفهام في { أألد وأنا عجوز } مستعمل في التعجب . وجملة { أنا عجوز } في موضع الحال ، وهي مناط التعجب .والبعل : الزوج . وسيأتي بيانه عند تفسير قوله تعالى : { ولا يبدين زينتهن إلاّ لبعولتهن } في سورة \\[ النّور : 31 \\] ، فانظره .وزادت تقرير التعجب بجملة { إنّ هذا لشيء عجيب } وهي جملة مؤكدة لصيغة التعجب فلذلك فصلت عن التي قبلها لكمال الاتّصال ، وكأنّها كانت متردّدة في أنهم ملائكة فلم تطمئنّ لتحقيق بشراهم .وجملة { هذا بعلي } مركبة من مبتدأ وخبر لأنّ المعنى هذا المشار إليه هو بعلي ، أي كيف يكون له ولد وهو كما ترى . وانتصب { شيخاً } على الحال من اسم الإشارة مبينة للمقصود من الإشارة .وقرأ ابن مسعود { وهذا بعلي شيخ } برفع شيخ على أن ( بعلي ) بيان من ( هذا ) و ( شيخ ) خبر المبتدأ . ومعنى القراءتين واحد .وقد جرت على هذه القراءة النادرة لطيفة وهي : ما أخبرنا شيخنا الأستاذ الجليل سالم بوحاجب أنّ أبا العبّاس المبرّد دُعي عند بعض الأعيان في بغداد إلى مأدبة ، فلمّا فرغوا من الطّعام غنّت من وراء الستار جارية لرب المنزل ببيتينوقالوا لها هذا حبيبك معرضٌ: ...فقالت : ألاَ إعراضه أهون الخطب ... فما هي إلاّ نظرة وابتسامةفتصطكّ رجلاه ويسقط للجنب ... فطرب كل من بالمجلس إلاّ أبا العبّاس المبرد فلم يتحرك ، فقال له رب المنزل : ما لك لم يطربك هذا؟ .فقالت الجارية : مَعذُور يحسبني لحنت في أن قلت : معرضٌ بالرفع ولم يعلم أنّ عبد الله بن مسعود قرأ «وهذا بعلي شيخٌ» فطرب المبرد لهذا الجواب .\n\n",
      "translations": [
        {
          "translation": "(She said: Oh, woe is me! Shall I bear a child when I am an old woman) a 98 year old woman, how can this be? (and this my husband) Abraham (is an old man) 99 years of age? (Lo! This is a strange thing!) this is astonishing!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أي: يا ويلتي { أألدُ وأنا عجوزٌ } ابنة تسعين\n أو تسع وتسعين { وهذا بَعْلِي }: زوجي\n وأصله: القائم بالأمر\n { شيخاً } ابن مائة أو مائة وعشرين سنة\n { إنَّ هذا لشيء عجيب } يتعجب منه لكونه نشأ الولد من هرمين\n\nوهو استغرب من حيث العادة\n لا من حيث القدرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:78",
      "similarity": 0.5746747613430702
    },
    {
      "verse": "37:125",
      "similarity": 0.49094036941358465
    },
    {
      "verse": "2:228",
      "similarity": 0.33663164455057665
    },
    {
      "verse": "40:67",
      "similarity": 0.33635068423461045
    },
    {
      "verse": "4:128",
      "similarity": 0.27399381221137276
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011072.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011072.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:72.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}