{
  "chapter": "هود",
  "text": "مسومة عند ربك وما هى من الظلمين ببعيد",
  "translations": [
    {
      "translation": "piled on top of one another in layers, each one earmarked by your Lord. And they are never far from the wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Impressed with (the signs) of your Lord. And such (punishment) is not far for the (other) transgressers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "marked from your Lord. Nor is the punishment far off from the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "marked by your Lord. Such a punishment is not far away from the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That are marked, in the custody your Lord; and those stones are not at all far from the unjust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marked from your Lord; and they are not ever far from the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marked (for punishment) with your Lord and it is not far off from the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "marked with thy Lord, and never far from the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marked with fire in the providence of thy Lord (for the destruction of the wicked). And they are never far from the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "marked for them by the decree of your Lord. The punishment of the unjust was not far off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marked from before thy Lord. Nor are they from the wrong- doers far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "sent in from your Lord [for the profligate], never far from the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marked as from thy Lord: Nor are they ever far from those who do wrong!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marked from your Lord, and they are not ever far from the Zalimun (polytheists, evil-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "marked with your Lord, and never far from the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marked from your Lord, and never far from the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marked from your Lord. And Allah 's punishment is not from the wrongdoers [very] far.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:83] marked, [each one of them] with the name of the person it would strike, with your Lord (‘inda rabbik is an adverbial qualifier for these [stones]), and they, the stones — or their lands — are not far from the evildoers, that is, [from] the people of Mecca.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Marked with fire) lined with black, red and white; it is also said that they had inscribed on them the names of persons they were destined to kill (in the providence of your Lord) those stones of clay were from your Lord, Muhammad. (And they) i.e. the stones (are never far from the wrong-doers) they did not miss them but rather hit them; it is also said that this means: these stones are never far from the wrong-doers, who 236 emulate their practice, from among your nation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا هِيَ } أي: أمثال هذه البليات والمعيبات { مِنَ ٱلظَّالِمِينَ } الخارجين عن مقتضى حدود الله وأوامره ونواهيه { بِبَعِيدٍ } [هود: 83] غريب حتى يستغرب في حقهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { مُسَوّمةً } أي: معلمة للعذاب، وقيل: معلمة ببياض وحمرة، أو بسيما تتميز به عن حجارة الأرض، أو باسم من يرمي به فكل حجارة كان فيها اسم من ترمى به، وقوله: { عند ربك } ، أي: في خزائن علمه وقدرته، { وما هي من الظالمين ببعيد } بل هي قريبة من كل ظالم\n قال ابن جزي: الضمير للحجارة، والمراد بالظالمين: كفار قريش، فهذا تهديد لهم، أي: ليس الرمي بالحجارة ببعيد منهم لأجل كفرهم، وقيل: الضمير للمدائن، أي: ليس مدائنهم ببعيد منهم أفلا يعتبرون بها\n كقوله:\n\n[الفرقان: 40]\n وقيل: الظالمين على العموم\n هـ\n وقال البيضاوي: وعنه ـ عليه الصلاة والسلام ـ: \" أَنَّهُ سَأَلَ جِبريل، فَقَال:\n\n\n\n \" يَعني: ظَالِمي أُمتِكَ، مَا مِنْ ظَالمٍ منهم إِلاَّ هوَ معرض لحَجَرٍ يَسقُط عليه مَنْ سَاعَةٍ إلى ساعة \" \n\nهـ\n الإشارة: الاعتناء بشأن الأضياف، وحفظ حرمتهم: من شأن الكرام، والاستخفاف بحقهم، والتجاسر عليهم، من فعل اللئام\n وفي الحديث:\n\n \" مَن كَانَ يُؤمِنُ باللَّهِ واليَومِ الآخر فَليُكرمْ ضَيفَهُ \" \n\nوالإسراع إلى الفواحش من علامة الهلاك، لا سيما اللواطَ والسفاح\n والإيواء إلى الله والاعتصام به من علامة الفلاح، والبعد عن ساحة أهل الفساد من شيم أهل الصلاح، وكل من اشتغل بالظلم والفساد فالرمي بالحجارة إليه بالمرصاد\n ثم ذكر قصة شعيب، فقالِ: { وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْباً }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:34",
      "similarity": 0.7180981280977238
    },
    {
      "verse": "7:48",
      "similarity": 0.5546600155886123
    },
    {
      "verse": "16:10",
      "similarity": 0.5542611517604953
    },
    {
      "verse": "7:167",
      "similarity": 0.5105829954273255
    },
    {
      "verse": "7:141",
      "similarity": 0.49106325837446313
    }
  ]
}