{
  "chapter": "هود",
  "text": "قالوا۟ يلوط انا رسل ربك لن يصلوا۟ اليك فاسر باهلك بقطع من اليل ولا يلتفت منكم احد الا امراتك انه مصيبها ما اصابهم ان موعدهم الصبح اليس الصبح بقريب",
  "translations": [
    {
      "translation": "They said, 'Lut, we are messengers from your Lord. They will not be able to get at you. Set out with your family - except for your wife - in the middle of the night and none of you should look back . What strikes them will strike her as well. Their promised appointment is the morning. Is the morning not close at hand?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The angels) said: \"O Lot, we have verily been sent by your Lord. They will never be able to harm you. So, leave late at night with your family, and none of you should turn back to look; but your wife will suffer (the fate) they are going to suffer. Their hour of doom is in the morning: Is not the morning nigh?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon the angels said: 'O Lot! We indeed are messengers of your Lord. And your people will in no way be able to hurt you. So depart with your family in a part of the night and let no one of you turn around excepting your wife (who shall not go); for what will befall them shall also befall her. In the morning their promised hour will come. Is not the morning near?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Messengers said, \"Lot, we are the Messengers of your Lord. They will never harm you. Leave the town with your family in the darkness of night and do not let any of you turn back. As for your wife, she will suffer what they (unbelievers) will suffer. Their appointed time will come at dawn. Surely dawn is not far away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels said, “O Lut! We are the sent ones of your Lord – they cannot get to you, therefore during the night take your entire household with you – and not one of you may turn around and see – except your wife*; she too will be afflicted with the same as they will be; indeed their promise is at morn; is not the morning imminent?” (* She was a disbeliever and sided with the culprits.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (messengers) said: \"O Lut! Verily, we are the messengers from your Lord! They shall not reach you! So travel with your family in a part of the night, and let not any of you look back; but your wife (will remain behind), verily, the punishment which will afflict them, will afflict her. Indeed, morning is their appointed time. Is not the morning near\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Lut! we are the apostles of your Lord; they shall by no means reach you; so remove your followers in a part of the night-- and let none of you turn back-- except your wife, for surely whatsoever befalls them shall befall her; surely their appointed time is the morning; is not the morning nigh?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Lot, we are messengers of thy Lord. They shall not reach thee; so set forth, thou with thy family, in a watch of the night, and let not any one of you turn round, excepting thy wife; surely she shall be smitten by that which smites them. Their promised time is the morning; is the morning not nigh?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The messengers) said: O Lot! Lo! we are messengers of thy Lord; they shall not reach thee. So travel with thy people in a part of the night, and let not one of you turn round - (all) save thy wife. Lo! that which smiteth them will smite her (also). Lo! their tryst is (for) the morning. Is not the morning nigh?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Lot, we are your Lord's messengers. By no means shall they reach you! So depart with your family while it is yet night and let none of you look back. But your wife will suffer the fate that befalls the others. Their appointed time is the morning: is the morning not near?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Lut! verily we are messengers of thy Lord; they shall by no means reach thee: go forth thou With thy household in a part of the night, and let none of you look back, save thy wife; verily that which befalleth them shall befall her; verily their appointment is for the morning; is not morning nigh?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O Lot, we are messengers of your Lord. They will never get at you. Set out with your family in a watch of the night; and none of you shall turn round, except your wife; indeed she will be struck by what strikes them. Indeed their tryst is the dawn. Is not the dawn [already] near?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The Messengers) said: \"O Lut! We are Messengers from thy Lord! By no means shall they reach thee! now travel with thy family while yet a part of the night remains, and let not any of you look back: but thy wife (will remain behind): To her will happen what happens to the people. Morning is their time appointed: Is not the morning nigh?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (Messengers) said: \"O Lout (Lot)! Verily, we are the Messengers from your Lord! They shall not reach you! So travel with your family in a part of the night, and let not any of you look back, but your wife (will remain behind), verily, the punishment which will afflict them, will afflict her. Indeed, morning is their appointed time. Is not the morning near?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the angels) said: 'Lot, we are the Messengers of your Lord, they shall not touch you. Depart with your family in the watch of the night and let none of you turn round, except your wife. She shall be struck by that which strikes them. Their appointed time is the morning. Is it not that the morning is near'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Lot, we are the envoys of your Lord; they will not reach you. So set out with your family during the cover of the night, and let none of you look back, except for your wife. She will be struck by what will strike them. Their appointed time is the morning. Is not the morning near?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels said, \"O Lot, indeed we are messengers of your Lord; [therefore], they will never reach you. So set out with your family during a portion of the night and let not any among you look back - except your wife; indeed, she will be struck by that which strikes them. Indeed, their appointment is [for] the morning. Is not the morning near?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:81] they said, ‘O Lot, truly we are messengers of your Lord. They shall not reach you, with any harm, so travel with your family during a part of the night, and let not one of you turn round, lest they see the terrible predicament that will befall them, except for your wife: (read illā imra’atuka, in the nominative, as a substitute for ahadun; a variant reading has illā imra’ataka, in the accusative, as [her being] an exception among [his] ‘family’, in other words, do no take her along when you travel) lo! she shall be smitten by that which smites them: it is said that he did not take her along with him; it is also said that she did set out [with them] and turned round, and so exclaimed, ‘Woe is my people!’, at which point a stone struck her and killed her. When he [Lot] asked them about the time of their destruction, they replied: Truly their tryst is [for] the morning, and when he said, ‘I want it to be sooner’, they said: is the morning not nigh [enough]?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا كلام الملائكة للوط عليه السّلام كاشفوه بأنّهم ملائكة مرسلون من الله تعالى . وإذ قد كانوا في صورة البشر وكانوا حاضري المجادلة حكى كلامهم بمثل ما تحكى به المحاورات فجاء قولهم بدون حرف العطف على نحو ما حكي قول : لوط عليه السّلام وقول قومه . وهذا الكلام الذي كلّموا به لوطاً عليه السّلام وحي أوحاه الله إلى لوط عليه السّلام بواسطة الملائكة ، فإنه لمّا بلغ بِلُوط توقعُ أذى ضيفه مبلغَ الجزع ونفاد الحيلة جاءه نصر الله على سنّة الله تعالى مع رسله { حتى إذا استيأس الرسل وظنوا أنهم قد كذبوا جاءهم نصرنا } \\[ يوسف : 110 \\].وابتدأ الملائكة خطابهم لوطاً عليه السّلام بالتعريف بأنفسهم لتعجيل الطمأنينة إلى نفسه لأنّه إذا علم أنهم ملائكة علم أنهم ما نزلوا إلاّ لإظهار الحق . قال تعالى : { ما تنزّل الملائكةُ إلاّ بالحق وما كانوا إذاً منْظرين } \\[ الحجر : 8 \\]. ثم ألحقوا هذا التعريف بالبشارة بقولهم : { لن يصلوا إليك }. وجيء بحرف تأكيد النفي للدّلالة على أنهم خاطبوه بما يزيل الشك من نفسه . وقد صرف الله الكفّار عن لوط عليه السّلام فرجعوا من حيث أتوا ، ولو أزال عن الملائكة التشكّل بالأجساد البشرية فأخفاهم عن عيون الكفّار لحسبوا أنّ لوطاً عليه السّلام أخفاهم فكانوا يؤذون لوطاً عليه السّلام . ولذلك قال له الملائكة { لن يصلوا إليك } ولم يقولوا لن ينالوا ، لأنّ ذلك معلوم فإنهم لمّا أعلموا لوطاً عليه السّلام بأنهم ملائكة ما كان يشك في أن الكفّار لا ينالونهم ، ولكنّه يخشى سورتهم أن يتّهموه بأنه أخفاهم .ووقع في التوراة أن الله أعمى أبصار المراودين لوطاً عليه السّلام عن ضيفه حتى قالوا : إنّ ضيف لوط سَحرة فانصرفوا . وذلك ظاهر قوله تعالى : في سورة \\[ القمر : 37 \\] { ولقد رَاودوه عن ضيفه فطمسْنا أعينهم . } وجملة لن يصلوا إليك } مبيّنة لإجمال جملة { إنّا رسُل ربّك } ، فلذلك فصلت فلم تعطف لأنها بمنزلة عطف البيان .وتفريع الأمر بالسُرى على جملة { لن يصلوا إليك } لما في حرف { لَن } من ضمان سلامته في المستقبل كلّه . فلمّا رأى ابتداء سلامته منهم بانصرافهم حسن أن يبين له وجه سلامته في المستقبل منهم باستئصالهم وبنجاته ، فذلك موقع فاء التفريع .و ( أسْر ) أمر بالسُرى بضم السين والقصر . وهو اسم مصدر للسير في الليل إلى الصباح . وفعله : سَرى يقال بدون همزة في أوّله ويقال : أسرى بالهمزة .قرأه نافع ، وابن كثير ، وأبو جعفر بهمزة وصل على أنه أمر من سَرى . وقرأه الباقون بهمزة قطع على أنه من أسرى .وقد جمعوه في الأمر مع أهله لأنه إذا سرى بهم فقد سرى بنفسه إذ لو بعث أهله وبقي هو لَمَا صحّ أن يقال : أسْر بهم للفرق بين أذهبت زيداً وبين ذهبت به .والقِطْع بكسر القاف : الجزء من الليل .وجملة { ولا يلتفت منكم أحد } معترضة بين المستثنى والمستثنى منه . والالتفات المنهي عنه هو الالتفات إلى المكان المأمور بمغادرته كَمَا دَلّت عليه القرينة .وسبب النهي عن الالتفات التقصي في تحقيق معنى الهجرة غضباً لحرمات الله بحيث يقطع التعلق بالوطن ولو تعلّق الرؤية . وكان تعيين الليل للخروج كَيْلاَ يُلاَقِي ممانعة من قومه أو من زوجه فيشقُّ عليه دفاعهم .و { إلاّ امرأتَك } استثناء من { أهلك } ، وهو منصوب في قراءة الجمهور اعتباراً بأنه مستثنى من { أهلك } وذلك كلام موجب ، والمعنى : لا تسْر بها ، أريد أن لا يعلمها بخروجه لأنها كانت مخلصة لقومها فتخبرهم عن زوجها . وقرأه ابن كثير ، وأبو عمرو برفع { امرأتك } على أنه استثناء من { أحد } الواقع في سياق النهي ، وهو في معنى النفي . قيل : إنّ امرأته خرجت معهم ثم التفتت إلى المدينة فحنّت إلى قومها فرجعت إليهم . والمعنى أنه نهاهم عن الالتفات فامتثلوا ولم تمتثل امرأتُه للنهي فالتفتت ، وعلى هذا الوجه فالاستثناء من كلام مقدّر دلّ عليه النهي . والتقدير : فلا يلتفتون إلاّ امرأتك تلتفتُ .وجملة { إنّه مصيبها ما أصابهم } استئناف بياني ناشىء عن الاستثناء من الكلام المقدّر .وفي قوله : { ما أصابهم } استعمال فعل المضي في معنى الحال ، ومقتضى الظاهر أن يقال : ما يصيبهم ، فاستعمال فعل المضي لتقريب زمن الماضي من الحال نحو قوله تعالى : { إذا قمتم إلى الصلاة فاغسلوا وجوهكم } \\[ المائدة : 6 \\] الآية ، أو في معنى الاستقبال تنبيهاً على تحقق وقوعه نحو قوله تعالى : { أتى أمر الله } \\[ النحل : 1 \\].وجملة { إنّ موعدهم الصبح } مستأنفة ابتدائية قُطعت عن التي قبلها اهتماماً وتهويلاً .والموعد : وقت الوعد . والوعد أعمّ من الوعيد فيطلق على تعيين الشرّ في المستقبل . والمراد بالموعد هنا موعد العذاب الذي علمه لوط عليه السّلام إما بوحي سابق ، وإما بقرينة الحال ، وإما بإخبار من الملائكة في ذلك المقام طَوته الآية هنا إيجازاً ، وبهذه الاعتبارات صحّ تعريف الوعد بالإضافة إلى ضميرهم .وجملة { أليس الصبح بقريب } استئناف بيانيّ صدر من الملائكة جواباً عن سؤال بجيش في نفسه من استبطاء نزول العذاب .والاستفهام تقريريّ ، ولذلك يقع في مثله التقرير على النفي إرخاء للعنان مع المخاطب المقرّر ليعرف خطأه . وإنّما قالوا ذلك في أوّل الليل .\n\n",
      "translations": [
        {
          "translation": "When Gabriel and the angels knew the fear of Lot from the threat of his people, ((The messengers) said: Lot! Lo! we are messengers of thy Lord; they shall not reach thee) to destroy you but rather we will destroy them. (So travel with thy people) go with your family (in a part of the night) at dawn, in the last part of the night, (and let not one of you turn round) let none of you stay behind ((all) save thy wife) Wa'ilah, the hypocrite. (Lo! that which smites them) of chastisement (will smiteth her (also). Lo! their tryst) to be destroyed (is (for) the morning) Lot said: \"make that happen now,\" and Gabriel said: \"0 Lot!\" (Is not the morning nigh?) because he already saw it while Lot did not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَسْرِ بِأَهْلِكَ } معناهُ سِرْ\n يقالُ: للسَّيرِ بالليلِ السُّرى\n يقالُ: سَريتُ وأسْريتُ\n وبالنَّهارِ سِرتُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Then travel with your family.\" Its meaning is to travel in secret.\n It is said: \"To travel at night is {surreptitious}\"\n I traveled and traveled\n\n\nI travel by day.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n قصدوا أن يثقبوا الجدار فاشتغلوا بالثقب والنقب { قَالُواْ } أي: الرسل بعدما بلغ ألم لوط غايته: { يٰلُوطُ } لا تغتم ولا تضطرب في أمرنا ولا تهلك نفسك غيرة وغيضاً { إِنَّا رُسُلُ رَبِّكَ لَن يَصِلُوۤاْ إِلَيْكَ } أبداً\n أي: لن ينالوا بإضرارنا حتى اضطررت من أجلنا\n ذرنا معهم\n واخرج من بيننا وبينهم\n وخرج لوط مفتحاً باب بيته\n فدخلوا على الرسل بالفور\n فضرب جبرائيل عليه السلام بجناحه فأعماهم\n فانقبلوا صائحين صارخيه: النجاء النجاء فإن في بيت لوط سحرة\n\n\nوبعدما خرجوا فاقدين أبصارهم\n قال الرسل أمراً للوط: { فَأَسْرِ } أي: سر ليلاً { بِأَهْلِكَ } أي: بمن آمن معك { بِقِطْعٍ }  أي: بعد مضي طائفة { مِّنَ ٱلْلَّيْلِ وَ } بعدما خرجتم { لاَ يَلْتَفِتْ } ولا ينظر { مِنكُمْ } أيها الخارجون { أَحَدٌ } خلفه حين سمع حنينهم وأنينهم وتشدد العذاب عليهم { إِلاَّ ٱمْرَأَتَكَ } فإنها تلتفت حين سمعت الصيحة\n فخرجوا على الوجه المأمور\n فنزل عليهم العذاب بعد خروجهم بالفور\n فصاحوا صيحةً عظيمةً\n ولم يلتفت أحد من الخارجين إلا امرأته\n فلما سمعت التفتت\n وصاحت: واقوماه! فأصيبت بلا تراخٍ ومهلةٍ { إِنَّهُ } أي: الشأن والأمر في علمنا أنها { مُصِيبُهَا مَآ أَصَابَهُمْ } فلما سمع لوط ما سمع\n استسرع إلى مقتهم من كمال ضجرته منهم\n قالوا له: { إِنَّ مَوْعِدَهُمُ ٱلصُّبْحُ } أي: موعد هلاكهم صبح هذا الليلة { أَلَيْسَ ٱلصُّبْحُ } أيها المستعجل { بِقَرِيبٍ } [هود: 81]\n\n{ فَلَمَّا جَآءَ أَمْرُنَا } على رسلنا بأهلاكهم { جَعَلْنَا } أي: جعل الرسل بإقدارنا وتمكيننا إياهم قريتهم { عَالِيَهَا سَافِلَهَا } أي: يقلبون عليهم بيوتهم { وَ } مع ذلك { أَمْطَرْنَا } من جانب السماء { عَلَيْهَا } أي: على أماكنهم وقراهم { حِجَارَةً } تنحجر { مِّن سِجِّيلٍ } وهو معرب من سنك كل { مَّنْضُودٍ } [هود: 82] ممتزج منضد بعضها على بعض { مُّسَوَّمَةً } معلمة مقدرة { عِندَ رَبِّكَ } وفي حضرة علمه ولوح قضائه لأمثال هذه البغاة الغواة الهالكين في تيه الغفلة والغرور\n\n\n{ وَمَا هِيَ } أي: أمثال هذه البليات والمعيبات { مِنَ ٱلظَّالِمِينَ } الخارجين عن مقتضى حدود الله وأوامره ونواهيه { بِبَعِيدٍ } [هود: 83] غريب حتى يستغرب في حقهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا يلتفت منكم أحدٌ }: لا يتخلف\n أو لا ينظر إلى ورائة لئلا يرى ما يهوله\n والنهي في المعنى يتوجه إلى لوط\n وإن كان في اللفظ مسنداً إلى أحد\n { إلا امرأتك } \n اسمها: واهلة\n أي: فلا تسر بها\n أو: ولا ينظر أحد منكم إلى ورائه إلا امرأتك فإنها تنظر\n رُوي أنها خرجت معه\n فلما سمعت صوات العذاب التفتت وقالت: يا قوماه فأدركها حجر فقتلها\n ولذلك قال: { أنه مُصيبُها ما أصابهم } من العذاب\n { إن موعدَهُم } وقت { الصُّبحُ } في نزول العذاب بهم\n فاستبطأ لوط وقتَ الصبح\n وقال: هلا عُذبوا الأن؟ فقالوا: { أليس الصبح بقريب }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:65",
      "similarity": 0.6644084052664635
    },
    {
      "verse": "10:78",
      "similarity": 0.5836522608559759
    },
    {
      "verse": "89:4",
      "similarity": 0.29932609352521294
    },
    {
      "verse": "44:23",
      "similarity": 0.29868969611425544
    },
    {
      "verse": "26:52",
      "similarity": 0.2713792826918296
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/011081.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/011081.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:81.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}