{
  "chapter": "هود",
  "text": "قالوا۟ يلوط انا رسل ربك لن يصلوا۟ اليك فاسر باهلك بقطع من اليل ولا يلتفت منكم احد الا امراتك انه مصيبها ما اصابهم ان موعدهم الصبح اليس الصبح بقريب",
  "translations": [
    {
      "translation": "(The angels) said: \"O Lot, we have verily been sent by your Lord. They will never be able to harm you. So, leave late at night with your family, and none of you should turn back to look; but your wife will suffer (the fate) they are going to suffer. Their hour of doom is in the morning: Is not the morning nigh?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon the angels said: 'O Lot! We indeed are messengers of your Lord. And your people will in no way be able to hurt you. So depart with your family in a part of the night and let no one of you turn around excepting your wife (who shall not go); for what will befall them shall also befall her. In the morning their promised hour will come. Is not the morning near?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Messengers said, \"Lot, we are the Messengers of your Lord. They will never harm you. Leave the town with your family in the darkness of night and do not let any of you turn back. As for your wife, she will suffer what they (unbelievers) will suffer. Their appointed time will come at dawn. Surely dawn is not far away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels said, “O Lut! We are the sent ones of your Lord – they cannot get to you, therefore during the night take your entire household with you – and not one of you may turn around and see – except your wife*; she too will be afflicted with the same as they will be; indeed their promise is at morn; is not the morning imminent?” (* She was a disbeliever and sided with the culprits.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (messengers) said: \"O Lut! Verily, we are the messengers from your Lord! They shall not reach you! So travel with your family in a part of the night, and let not any of you look back; but your wife (will remain behind), verily, the punishment which will afflict them, will afflict her. Indeed, morning is their appointed time. Is not the morning near\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Lut! we are the apostles of your Lord; they shall by no means reach you; so remove your followers in a part of the night-- and let none of you turn back-- except your wife, for surely whatsoever befalls them shall befall her; surely their appointed time is the morning; is not the morning nigh?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Lot, we are messengers of thy Lord. They shall not reach thee; so set forth, thou with thy family, in a watch of the night, and let not any one of you turn round, excepting thy wife; surely she shall be smitten by that which smites them. Their promised time is the morning; is the morning not nigh?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The messengers) said: O Lot! Lo! we are messengers of thy Lord; they shall not reach thee. So travel with thy people in a part of the night, and let not one of you turn round - (all) save thy wife. Lo! that which smiteth them will smite her (also). Lo! their tryst is (for) the morning. Is not the morning nigh?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Lot, we are your Lord's messengers. By no means shall they reach you! So depart with your family while it is yet night and let none of you look back. But your wife will suffer the fate that befalls the others. Their appointed time is the morning: is the morning not near?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Lut! verily we are messengers of thy Lord; they shall by no means reach thee: go forth thou With thy household in a part of the night, and let none of you look back, save thy wife; verily that which befalleth them shall befall her; verily their appointment is for the morning; is not morning nigh?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O Lot, we are messengers of your Lord. They will never get at you. Set out with your family in a watch of the night; and none of you shall turn round, except your wife; indeed she will be struck by what strikes them. Indeed their tryst is the dawn. Is not the dawn [already] near?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The Messengers) said: \"O Lut! We are Messengers from thy Lord! By no means shall they reach thee! now travel with thy family while yet a part of the night remains, and let not any of you look back: but thy wife (will remain behind): To her will happen what happens to the people. Morning is their time appointed: Is not the morning nigh?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (Messengers) said: \"O Lout (Lot)! Verily, we are the Messengers from your Lord! They shall not reach you! So travel with your family in a part of the night, and let not any of you look back, but your wife (will remain behind), verily, the punishment which will afflict them, will afflict her. Indeed, morning is their appointed time. Is not the morning near?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the angels) said: 'Lot, we are the Messengers of your Lord, they shall not touch you. Depart with your family in the watch of the night and let none of you turn round, except your wife. She shall be struck by that which strikes them. Their appointed time is the morning. Is it not that the morning is near'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Lot, we are the envoys of your Lord; they will not reach you. So set out with your family during the cover of the night, and let none of you look back, except for your wife. She will be struck by what will strike them. Their appointed time is the morning. Is not the morning near?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels said, \"O Lot, indeed we are messengers of your Lord; [therefore], they will never reach you. So set out with your family during a portion of the night and let not any among you look back - except your wife; indeed, she will be struck by that which strikes them. Indeed, their appointment is [for] the morning. Is not the morning near?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:81] they said, ‘O Lot, truly we are messengers of your Lord. They shall not reach you, with any harm, so travel with your family during a part of the night, and let not one of you turn round, lest they see the terrible predicament that will befall them, except for your wife: (read illā imra’atuka, in the nominative, as a substitute for ahadun; a variant reading has illā imra’ataka, in the accusative, as [her being] an exception among [his] ‘family’, in other words, do no take her along when you travel) lo! she shall be smitten by that which smites them: it is said that he did not take her along with him; it is also said that she did set out [with them] and turned round, and so exclaimed, ‘Woe is my people!’, at which point a stone struck her and killed her. When he [Lot] asked them about the time of their destruction, they replied: Truly their tryst is [for] the morning, and when he said, ‘I want it to be sooner’, they said: is the morning not nigh [enough]?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When Gabriel and the angels knew the fear of Lot from the threat of his people, ((The messengers) said: Lot! Lo! we are messengers of thy Lord; they shall not reach thee) to destroy you but rather we will destroy them. (So travel with thy people) go with your family (in a part of the night) at dawn, in the last part of the night, (and let not one of you turn round) let none of you stay behind ((all) save thy wife) Wa'ilah, the hypocrite. (Lo! that which smites them) of chastisement (will smiteth her (also). Lo! their tryst) to be destroyed (is (for) the morning) Lot said: \"make that happen now,\" and Gabriel said: \"0 Lot!\" (Is not the morning nigh?) because he already saw it while Lot did not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَسْرِ بِأَهْلِكَ } معناهُ سِرْ\n يقالُ: للسَّيرِ بالليلِ السُّرى\n يقالُ: سَريتُ وأسْريتُ\n وبالنَّهارِ سِرتُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما رأى الرسل اضطرار لوط واضطرابه؛ إذ هو يغل على أضيافه باب بيته فيجاجل مع قومه، يتكلم معهم، وبعدما امتدت مجادلته معهم، قصدوا أن يثقبوا الجدار فاشتغلوا بالثقب والنقب { قَالُواْ } أي: الرسل بعدما بلغ ألم لوط غايته: { يٰلُوطُ } لا تغتم ولا تضطرب في أمرنا ولا تهلك نفسك غيرة وغيضاً { إِنَّا رُسُلُ رَبِّكَ لَن يَصِلُوۤاْ إِلَيْكَ } أبداً؛ أي: لن ينالوا بإضرارنا حتى اضطررت من أجلنا، ذرنا معهم، واخرج من بيننا وبينهم، وخرج لوط مفتحاً باب بيته، فدخلوا على الرسل بالفور، فضرب جبرائيل عليه السلام بجناحه فأعماهم، فانقبلوا صائحين صارخيه: النجاء النجاء فإن في بيت لوط سحرة\n\n\n\n\nوبعدما خرجوا فاقدين أبصارهم، قال الرسل أمراً للوط: { فَأَسْرِ } أي: سر ليلاً { بِأَهْلِكَ } أي: بمن آمن معك { بِقِطْعٍ }  أي: بعد مضي طائفة { مِّنَ ٱلْلَّيْلِ وَ } بعدما خرجتم { لاَ يَلْتَفِتْ } ولا ينظر { مِنكُمْ } أيها الخارجون { أَحَدٌ } خلفه حين سمع حنينهم وأنينهم وتشدد العذاب عليهم { إِلاَّ ٱمْرَأَتَكَ } فإنها تلتفت حين سمعت الصيحة، فخرجوا على الوجه المأمور، فنزل عليهم العذاب بعد خروجهم بالفور، فصاحوا صيحةً عظيمةً، ولم يلتفت أحد من الخارجين إلا امرأته، فلما سمعت التفتت، وصاحت: واقوماه! فأصيبت بلا تراخٍ ومهلةٍ { إِنَّهُ } أي: الشأن والأمر في علمنا أنها { مُصِيبُهَا مَآ أَصَابَهُمْ } فلما سمع لوط ما سمع، استسرع إلى مقتهم من كمال ضجرته منهم، قالوا له: { إِنَّ مَوْعِدَهُمُ ٱلصُّبْحُ } أي: موعد هلاكهم صبح هذا الليلة { أَلَيْسَ ٱلصُّبْحُ } أيها المستعجل { بِقَرِيبٍ } [هود: 81]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n جبريل عليه السلام بجناحيه وجوههم، فطمس أعينهم، وأعمالهم، فخرجوا يقولون: النجاء النجاء في بيت لوط سحرة، فقالت الملائكة للوط عليه السلام: { فأسرٍ بأهلك } سِر بهم { بقطع من الليل }: بطائفة منه، { ولا يلتفت منكم أحدٌ }: لا يتخلف، أو لا ينظر إلى ورائة لئلا يرى ما يهوله\n والنهي في المعنى يتوجه إلى لوط، وإن كان في اللفظ مسنداً إلى أحد\n { إلا امرأتك } ، اسمها: واهلة، أي: فلا تسر بها، أو: ولا ينظر أحد منكم إلى ورائه إلا امرأتك فإنها تنظر\n رُوي أنها خرجت معه، فلما سمعت صوات العذاب التفتت وقالت: يا قوماه فأدركها حجر فقتلها، ولذلك قال: { أنه مُصيبُها ما أصابهم } من العذاب، { إن موعدَهُم } وقت { الصُّبحُ } في نزول العذاب بهم، فاستبطأ لوط وقتَ الصبح، وقال: هلا عُذبوا الأن؟ فقالوا: { أليس الصبح بقريب }",
      "translations": []
    }
  ]
}