{
  "chapter": "هود",
  "text": "ويقوم لا يجرمنكم شقاقى ان يصيبكم مثل ما اصاب قوم نوح او قوم هود او قوم صلح وما قوم لوط منكم ببعيد",
  "translations": [
    {
      "translation": "My people! Do not let your breach with me provoke you into doing wrong so that the same thing happens to you as happened to the people of Nuh and the people of Hud and the people of Salih; and the people of Lut are not far distant from you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people (I fear) lest your opposition to me should bring you the like of what befell the people of Noah or Hud or Saleh; and the people of Lot are not distant from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people! Let not your opposition to me lead you to guilt that would bring upon you the chastisement that struck earlier the people of Noah, and the people of Hud, and the people of Salih. And the land of the people of Lot is not far from you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, do not let your opposition to me lead you to commit sins or make you suffer what the people of Noah, Hud, and Salih suffered. Remember that the people of Lot were destroyed not very long ago.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And O my people! May not your opposition to me occasion the coming upon you of the thing similar to what befell the people of Nooh or the people of Hud or the people of Saleh; and the people of Lut are not at all far from you!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Let not my Shiqaq cause you to suffer the fate similar to that of the people of Nuh or of Hud or of Salih, and the people of Lut are not far off from you!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! let not opposition to me make you guilty so that there may befall you the like of what befell the people of Nuh, or the people of Hud, or the people of Salih, nor are the people of Lut far off from you;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, let not the breach with me move you, so that there smite you the like of what smote the people of Noah, or the people of Hood, or the people of Salih; and the people of Lot are not far away from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! Let not the schism with me cause you to sin so that there befall you that which befell the folk of Noah and the folk of Hud, and the folk of Salih; and the folk of Lot are not far off from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, do not let your opposition to me bring upon you a fate similar to the peoples of Noah or Hud or Salih; nor is it long since the people of Lot were punished!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! let not the cleavage with me incite you so that there befall you the like of that which befell the people of Nuh and the people of Hud and the people of Saleh; and the people of Lut are not from you far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, do not let your defiance toward me lead you to be visited by the like of what was visited on the people of Noah, or the people of Hud, or the people of Salih, and the people of Lot are not distant from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! let not my dissent (from you) cause you to sin, lest ye suffer a fate similar to that of the people of Noah or of Hud or of Salih, nor are the people of Lut far off from you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Let not my Shiqaqcause you to suffer the fate similar to that of the people of Nuh (Noah) or of Hud or of Salih (Saleh), and the people of Lout (Lot) are not far off from you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my nation, do not let your breaking with me bring upon you something similar to that which struck the nation of Noah, Hood, and Salih and it is not long since the people of Lot (were punished).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people, let not your hostility towards me cause you to suffer what was suffered by the people of Noah, or the people of Hud, or the people of Saleh. The people of Lot are not far away from you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people, let not [your] dissension from me cause you to be struck by that similar to what struck the people of Noah or the people of Hud or the people of Salih. And the people of Lot are not from you far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:89] And, O my people, let not the breach with me, the dispute [you have] with me (shiqāqī, ‘the breach with me’, is the subject of the verb yajrimannakum, ‘make you deserve’, in which the [suffixed] pronoun [-kum, ‘you’] constitutes the first direct object, the second being [what follows]) make you deserve, earn you [as punishment], that there befall you the like of what befell the people of Noah, or the people of Hūd, or the people of Sālih, in the way of chastisement; and the people of Lot, that is, their dwelling-places or the era in which they were destroyed, are not far away from you, so take heed [of this].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And, my people! Let not the schism with me cause you to sin) let not your hatred and enmity of me cause you not to believe or do justice in measure and weighing (so that there befall you that which befell the folk of Noah) i.e. the chastisement of the people of Noah: drowning and the flood (and the folk of Hud) their destruction by the wind, (and the folk of Salih) their destruction by the Cry; (and the folk of Lot) the news of the folk of Lot (are not far off from you) you heard what happened to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يَجْرِمَنَّكُمْ شِقَاقِيۤ } معناه لا يَحمِلَنكُمْ\n وشِقَاقِي معناهُ ضِراري\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما تفرس منهم المصيبة والمراء المفرط، قال على مقتضى الحبة والشفقة وإرخاء العنان: { يٰقَوْمِ لاَ يَجْرِمَنَّكُمْ شِقَاقِيۤ } أي: لا يحملنكم بغضي وعداوتي على الجرائم المستجلبة لأنواع العذاب والنكال، إني أخاف عليكم { أَن يُصِيبَكُم } بسبب جرائمكم وعصيانكم { مِّثْلُ مَآ أَصَابَ قَوْمَ نُوحٍ أَوْ } مثل ما أصاب { قَوْمَ هُودٍ أَوْ } مثل ما أصاب { قَوْمَ صَالِحٍ } وباجملة: { وَمَا قَوْمُ لُوطٍ } وقصة استئصالهم وإهلاكهم وتقليب أماكنهم عليهم { مِّنكُم بِبَعِيدٍ } [هود: 89] متمادٍ في البعد إلى حيث يحصل لكم الذهول عنه لقرب عهدهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويا قوم لا يجرمنكم }: لا يُكسبنكم { شقاقي }: معاداتي، { أن يُصيبكم مثل ما أصاب قومَ نوح } من الغرق، { أو قومَ هودٍ } من الريح، { أو قومَ صالحٍ } من الصيحة، والمعنى: لا تخالفوني فيجركمْ ذلك إلى الهلاك كما هلك الأمم قبلكم، { وما قومُ لوطٍ منكم ببعيدٍ } زماناً ولا مكاناً، فإن لم تعتبروا بمن قبلكم، فاعتبروا بهم إذ هم ليسوا ببعيد منكم في الكفر والمساوئ، فلا يبْعد عنكم ما أصابهم\n وإنما أفرد \" بعيد \" لأن المراد: وما إهلاكهم، أو وما هم بشيء بعيد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:176",
      "similarity": 0.3393648835021251
    },
    {
      "verse": "41:52",
      "similarity": 0.33134840243225416
    },
    {
      "verse": "26:167",
      "similarity": 0.32536916831050294
    },
    {
      "verse": "84:1",
      "similarity": 0.3216647132352314
    },
    {
      "verse": "80:26",
      "similarity": 0.3212566718537703
    }
  ]
}