{
  "chapter": "هود",
  "text": "والى مدين اخاهم شعيبا قال يقوم اعبدوا۟ الله ما لكم من اله غيره ولا تنقصوا۟ المكيال والميزان انى ارىكم بخير وانى اخاف عليكم عذاب يوم محيط",
  "translations": [
    {
      "translation": "And to Madyan their brother Shu'ayb. He said, 'My people, worship Allah! You have no god apart from Him. Do not give short measure and short weight. I see you prospering and I fear for you the punishment of an all-encompassing Day.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent to Midian their brother Shu'aib. He said: \"O my people, worship God; you have no other god but He. So do not give in short measure nor underweigh. I see you are prosperous, but I fear the doom of an overwhelming Day for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to (the people of) Midian We sent their brother Shu'ayb. He said: 'My people! Serve Allah; you have no god other than Him. And do not diminish the measure and weight. Indeed I see that you are prospering now, but I fear for you the chastisement of an encompassing day in the future.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the people of Midian We sent their brother Shu'ayb who told them, \"My people, worship God; He is your only Lord. Do not be dishonest in your weighing and measuring. I can see you are safe and prosperous, but I am afraid for you of the overwhelming torment of the (appointed) day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Madyan their fellow man Shuaib; he said, “O my people! Worship Allah – there is no other True God except Him; and do not make reductions in measure and weight – indeed I see you prosperous, and I fear the punishment of the Besieging Day (of Resurrection) upon you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the Madyan people (We sent) their brother Shu`ayb. He said: \"O my people! Worship Allah, you have no other god but Him, and give not short measure or weight. I see you in prosperity and verily, I fear for you the torment of a Day encompassing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Madyan (We sent) their brother Shu'aib. He said: O my people! serve Allah, you have no god other than He, and do not give short measure and weight: surely I see you in prosperity and surely I fear for you the punishment of an all-encompassing day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Midian their brother Shuaib; he said, 'O my people, serve God! You have no god other than He. And diminish not the measure and the balance. I see you are prospering; and I fear for you the chastisement of an encompassing day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Midian (We sent) their brother Shu'eyb. He said: O my people! Serve Allah. Ye have no other Allah save Him! And give not short measure and short weight. Lo! I see you well-to-do, and lo! I fear for you the doom of a besetting Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the people of Midian, We sent their brother Shu'ayb. He said, \"My people, worship God. You have no deity other than Him. Do not give short measure and short weight. I see you are prospering. I fear for you the punishment of a fateful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Madyan We sent their brother Shu'aib. He said: O my people! worship Allah; there is no god for you but he. And give not short measure and weight. Verily I see you in prosperity, and verily I fear for you the torment of a Day encompassing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Midian [We sent] Shu‘ayb, their brother. He said, ‘O my people! Worship Allah. You have no other god besides Him. Do not diminish the measure or the balance. Indeed I see that you are faring well, but I fear for you the punishment of an all-embracing day.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the Madyan People (We sent) Shu'aib, one of their own brethren: he said: \"O my people! worship Allah: Ye have no other god but Him. And give not short measure or weight: I see you in prosperity, but I fear for you the penalty of a day that will compass (you) all round.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the Madyan (Midian) people (We sent) their brother Shu'aib. He said: \"O my people! Worship Allah, you have no other Ilah (God) but Him, and give not short measure or weight, I see you in prosperity; and verily I fear for you the torment of a Day encompassing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Midian, (We sent) their brother Shu'aib. He said: 'My nation, worship Allah; you have no god except He. Do not reduce the measure nor the scale. I see you are prosperous, and fear the punishment of an encompassing day for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Median, their brother Shuaib. He said, “O my people, worship God; you have no god other than Him. And do not short measure or short weight. I see you in good circumstances, but I fear for you the agony of an encompassing Day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Madyan [We sent] their brother Shu'ayb. He said, \"O my people, worship Allah; you have no deity other than Him. And do not decrease from the measure and the scale. Indeed, I see you in prosperity, but indeed, I fear for you the punishment of an all-encompassing Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:84] And, We sent, to Midian their brother Shu‘ayb. He said, ‘O my people, worship God!, affirm His Oneness. You have no god other than He. And diminish not the measure or the weight. I see you in prosperity, [enjoying] a grace which precludes any need for stinting [people]; and I fear for you, should you not believe, the chastisement of a besetting day, [besetting] you, destroying you (the attribution of this term [‘besetting’] to ‘a day’ [as opposed to ‘the chastisement’] is figurative, for it [the chastisement] will take place thereupon).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And unto Midian) and We sent to Midian (their brother Shu'ayb) their Prophet Jethro. (He said: my people! Serve Allah) declare Allah's divine Oneness. (Ye have no other God save Him!) you have no other god except the One I command you to believe in (And give not short measure and short weight) do not take people's right in measure and weight. (Lo! I see you well to do) I see that you are at ease, possess wealth and the prices are quite low, (and lo! I fear for you) if you do not believe in Him and do not give the right measure and weight (the doom of a besetting Day) a doom that will encompass all of you such that none will escape from drought, lack of foodstuffs and other bad things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إني أرَاكُم بِخَير } لما رأى شعيب عليه السلام ضلالتهم بالشرك واحتجابهم عن الحق بالجبت\n وتهالكهم على كسب الحطام بأنواع الرذائل وتماديهم في الحرص على جمع المال بأسوأ الخصال منعهم عن ذلك وقال: إني أراكم بخير في استعدادكم من إمكان حصول كمال وقبول هداية فإني أخاف عليكم إحاطة خطيئاتكم بكم لاحتجابكم عن الحق ووقوفكم مع الغير وصرف أفكاركم بالكلية إلى طلب المعاش وإعراضكم عن المعاد\n وقصور هممكم على إحراز الفاسدات الفانيات عن تحصيل الباقيات الصالحات\n وانجذابكم إلى الجهة السفلية عن الجهة العلوية\n واشتغالكم بالخواص البهيمية عن الكمالات الأنسية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل للمؤمنين المعتبرين من ذوي الاستبصار والاعتبار وقت\n إذ أرسلنا { إِلَىٰ مَدْيَنَ } حين بالغوا التطفيف والتخسير في المكيلات والموزونات { أَخَاهُمْ } ومن شعيتهم { شُعَيْباً } المتشغب منهم\n ليكون أدخل في نصحهم وأجهد في إهدائهم وإرشادهم { قَالَ يٰقَوْمِ } موصياً له\n متحنناً على وجه الشفقة والنصيحة { ٱعْبُدُواْ ٱللَّهَ } الواحد الأحد الصمد الذي ليس له شريك في الوجود والألوهية والربوبية وتيقنوا أنه { مَا لَكُمْ مِّنْ إِلَـٰهٍ } مظهر لكم ولجميع ما ظهر وبطن غيباً وشهادة { غَيْرُهُ } بل الألوهية محصورة إليه\n مقصورة له\n إذ لا شيء سواه\n ولا يستحق للعبادة إلا هو { وَ } عليكم أيها المأمورون من عنده بالاعتدال والاقتصاد في جميع الأخلاق والأفعال والأحوال أن { لاَ تَنقُصُواْ ٱلْمِكْيَالَ وَٱلْمِيزَانَ } لبني نوعكم { إِنِّيۤ أَرَاكُمْ بِخَيْرٍ } أي: سعة ورفاهية غاية لكم وتفضلاً عليكم\n فعليكم أن تزويدها وتديموها بالشكر والإنصاف والانتصاف على مقتضى ما أُمرتم به من عند ربكم\n وإن لم تعلموا مني ونصحي ولم تقبلوا قولي { وَإِنِّيۤ أَخَافُ عَلَيْكُمْ } من غيرة الله وكمنال قهره وسطوته { عَذَابَ يَوْمٍ مُّحِيطٍ } [هود: 84] فيه عذابه على جميع أهل الزيغ والضلال\n المنحرفين عن جادة الاعتدال\n\n\n{ وَ } بعدما قدم عليهم المنهي للعناية والاهتمام بشأنه\n أردفه بالمأمور\n للتأكيد والمبالغة وزيادة التقرير والإحكام\n كأنه استدل عليه لمزيد إشفاقه وكمال مرحمته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" مفسدين \": حال مؤكده لمعنى عاملها\n وهو: \" لا تعثوا \"\n وفائدة ذكره: إخراج ما يُقصد به الإصلاح\n كما فعله الخضر عليه السلام\n يقول الحق جل جلاله: { و } أرسلنا { إلى مَدْيَنَ أخاهم شعيباً } \n أراد أولاد مدين بن إبراهيم عليه السلام أو أهل مدين\n وهي بلدهُ\n فسميت باسمه\n { قال يا قوم اعبدوا الله } وحده { ما لكم من إله غيره ولا تَنقُصوا المكيالَ والميزان } \n وكانوا مطففين\n أمرهم أولاً بالتوحيد فإنه رأس الأمر\n ثم نهاهم عما اعتادوا من: البخس المنافي للعدل\n المخل بحكمة المعاوضة\n ثم قال لهم: { إني اراكم بخيرٍ } بسعة كرخص الأسعار\n وكثرة الأرزاق\n فينبغي أن تشكروا عليها\n وتتعففوا بها عن البخس\n لا أن تنقضوا الناس حقوقهم\n أو بسعة ونعمة\n فلا تزيلوها بما أنتم عليه فإن من لم يشكر النعم فقد تعرض لزوالها\n { وإني أخاف عليكم عذابَ يوم محيط } يوم القيامة\n فإنه محيط بكل ظالم\n أو عذاب الاستئصال في الدنيا\n ووصف اليوم بالإحاطة\n وهي صفة العذاب لاشتماله عليه\n  { ويا قوم أوفوا الميكالَ والميزان بالقسط } بالعدل من غير زيادة ولا نقصان\n صرح بالأمر بالاستيفاء بعد النهي عن ضده مبالغةً\n وتنبيهاً على أنهم لا يكفيهم الكف عن تعمد التطفيف\n بل يلزمهم السعي في الإيفاء ولو بالزيادة\n حيث لا يتأتى دونها\n وقد تكون الزيادة محظورة\n ولذلك أمرهم بالعدل في قوله: بالقسط\n بلا زيادة ولا نقصان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:85",
      "similarity": 0.6205108456949129
    },
    {
      "verse": "83:3",
      "similarity": 0.41219592331419574
    },
    {
      "verse": "29:36",
      "similarity": 0.37046736556813303
    },
    {
      "verse": "26:177",
      "similarity": 0.35837370970890725
    },
    {
      "verse": "50:4",
      "similarity": 0.3396326764931178
    }
  ]
}