{
  "chapter": "هود",
  "text": "ولئن اخرنا عنهم العذاب الى امة معدودة ليقولن ما يحبسه الا يوم ياتيهم ليس مصروفا عنهم وحاق بهم ما كانوا۟ به يستهزءون",
  "translations": [
    {
      "translation": "If We postpone the punishment for them for a limited time, they will say, 'What is holding it back?' No, indeed! The day it reaches them it will not be averted from them and the things they mocked at will encompass them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We defer their punishment for a certain time, they will say: \"What is keeping it back?\" And yet, the day it comes, they will not be able to avert it; and what they used to laugh at will encompass them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were We to put off the chastisement from them for a determined period, they will cry out: 'What withholds Him from chastising?' Surely when the day of the chastisement will come, nothing will avert it and the chastisement which they had ridiculed shall encompass them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We delay in afflicting them with Our punishment for an appointed time, they ask, \"What is preventing it (the punishment) from taking place?\" On the day when it (punishment) befalls them, no one will be able to escape from it and that which they have mocked will surround them from all sides.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We postpone the punishment upon them for a specified time, they will surely say, “What holds it back?” Pay heed! On the day when it comes upon them, it will not be averted from them, and the very punishment they mocked at will encompass them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We delay the torment for them till a determined Ummah (term), they are sure to say, \"What keeps it back\" Verily, on the day it reaches them, nothing will turn it away from them, and they will be surrounded by (or fall in) that at which they used to mock!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We hold back from them the punishment until a stated period of time, they will certainly say: What prevents it? Now surely on the day when it will come to them, it shall not be averted from them and that which they scoffed at shall beset them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We postpone the chastisement from them till a reckoned moment they will say 'What is detaining it?' Surely, the day it shall come to them, it shall not be turned aside from them, and they shall be encompassed by that they mocked at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We delay for them the doom until a reckoned time, they will surely say: What withholdeth it? Verily on the day when it cometh unto them, it cannot be averted from them, and that which they derided will surround them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We defer their punishment till an appointed time, they ask, \"What is holding it back?\" On the Day when it overtakes them, there will be nothing to avert it from them; and what they used to mock at shall encompass them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We defer from them the torment until a period determined, they say: What withholdeth it! Lo! the day it betideth them it shall not be averted from them, and shall beset them that whereat they have been mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We defer their punishment until a certain time, they will surely say, ‘What holds it back?’ Look! On the day it overtakes them it shall not be turned away from them, and they will be besieged by what they used to deride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We delay the penalty for them for a definite term, they are sure to say, \"What keeps it back?\" Ah! On the day it (actually) reaches them, nothing will turn it away from them, and they will be completely encircled by that which they used to mock at!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We delay the torment for them till a determined term, they are sure to say, \"What keeps it back?\" Verily, on the day it reaches them, nothing will turn it away from them, and they will be surrounded by (fall in) that at which they used to mock!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We delay the punishment till an appointed time, they will ask: 'What has detained it' Indeed, the Day will come to them, it will not be turned awayfrom them, and that they mocked at will encompass them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We postponed their punishment until a stated time, they would say, “What holds it back?” On the Day when it reaches them, it will not be averted from them, and what they used to ridicule will besiege them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We hold back from them the punishment for a limited time, they will surely say, \"What detains it?\" Unquestionably, on the Day it comes to them, it will not be averted from them, and they will be enveloped by what they used to ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:8] And if we postpone the chastisement for them until, the arrival of, a reckoned time, [reckoned] moments, they will surely say, in mockery: ‘What is detaining it?’, what is preventing it from being sent down? God, exalted be He, says: Verily on the day when it comes to them, it cannot be averted, warded off, from them, and that, chastisement, which they derided shall surround them, [it] shall come down upon them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if We delay for them the doom until a reckoned time) until an appointed time: the Day of Badr, (they will surely say) i.e. the people of Mecca: (What withholdeth it) from us tomorrow, out of mockery? (Verily on the day when it) the chastisement (cometh unto them, it cannot be averted from them) the chastisement will not be averted from them, (and that which they derided) the chastisement for their derision of Muhammad (pbuh) and the Qur'an (will surround them) it will descend upon them and it is enjoined on them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلَىٰ أُمَّةٍ مَّعْدُودَةٍ } معناهُ أجلٌ مَعْدودٌ\n\n\n\n\nوقوله تعالى: { وَحَاقَ بِهِم } معناهُ أَحَاطَ بِهِمْ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, \"To a people limited [in number],\" its meaning is an appointed time.\n\n\nAnd His saying, \"And it will encompass them,\" means that it will encompass them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما استوجبوا لأسوأ العذاب واستحقوا الأليم العقاب بكفرهم وإنكارهم { لَئِنْ أَخَّرْنَا عَنْهُمُ ٱلْعَذَابَ } المعد لهم\n أي: إتيانه { إِلَىٰ أُمَّةٍ } أي: جماعة من الأيام والأوقات { مَّعْدُودَةٍ } قلائل { لَّيَقُولُنَّ } مستهزئين مستسخرين من غاية جهلهم وإنكارهم: { مَا يَحْبِسُهُ } أي: يمنعه عن إتيان ما يدعيه من العذاب ووقوع ما يعد به من الأخذ والبطش { أَلاَ } تنبهوا أيها المؤمنون وتذكروا { يَوْمَ يَأْتِيهِمْ } العذاب\n واعلموا يقيناً أن العذاب { لَيْسَ مَصْرُوفاً عَنْهُمْ } حينئذ\n ساقطاً عن ذمتهم\n بل نزل عليهم { وَحَاقَ } وأحاط { بِهِم } حتماً { مَّا كَانُواْ بِهِ يَسْتَهْزِءُونَ } [هود: 8] من العذاب الموعود وقت إنذار الرسول\n\n\n{ وَ } من غاية لطفنا وجودنا إلى الإنسان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: يوم: معمول لخبر ليس، وهو دليل جواز تقديمة إن كان ظرفاً. { يقول الحق جل جلاله: }  { ولئن أخَّرنا عنهم العذابَ } الموعود في الدنيا، أو في الآخرة، { إلى أمة } أي: أوقات معدودة قلائل، { ليقولن } استهزاء: { ما يحْسبُه }؟ أي: ما يمنعه من الوقوع الآن؟ { ألا يوم يأتيهم } وينزل بهم كيوم بدر، أو يوم القيامة { ليس مصروفاً عنهم } ليس مدفوعاً عنهم حين ينزل بهم، { وحاقَ } نزل وأحاط { بهم ما كانوا به يستهزئون } ، وضع الماضي الاستقبال تحقيقاً للوقوع، ومبالغة في التهديد. الإشارة: إمهال العاصي بإهمال له فإن الله تعالى يمهل ولا يهمل. فإمهاله إما استدراج، أو انتظار لتوبته، فليبادر بالتوبة قبل الفوات، وبالعمل الصالح قبل الممات. فما أبعد ما فات، وما أقرب ما هو آت، وبالله التوفيق. ومما وقع به الاختبار: الوقوف مع النعم دون شهود المنعم، كما أبان ذلك بقوله: { وَلَئِنْ أَذَقْنَا ٱلإِنْسَانَ مِنَّا رَحْمَةً }.\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:106",
      "similarity": 0.5532731208945477
    },
    {
      "verse": "16:34",
      "similarity": 0.28927710814812
    },
    {
      "verse": "6:10",
      "similarity": 0.28666017830273544
    },
    {
      "verse": "21:41",
      "similarity": 0.28666017830273544
    },
    {
      "verse": "45:33",
      "similarity": 0.28494503914799785
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/11:8.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/11:8.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}