{
  "chapter": "هود",
  "text": "قالوا۟ يشعيب اصلوتك تامرك ان نترك ما يعبد ءاباؤنا او ان نفعل فى امولنا ما نشؤا۟ انك لانت الحليم الرشيد",
  "translations": [
    {
      "translation": "They said, 'Shu'ayb, do your prayers instruct you that we should abandon what our fathers worshipped or stop doing whatever we want to with our wealth? You are clearly the forbearing, the rightly-guided!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Shu'aib, does your piety teach that we should abandon what our fathers worshipped, or desist from doing what we like with our goods? How gracious a man of discernment you are indeed!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied: 'O Shu'ayb! Does your Prayer enjoin upon you that we should forsake the deities whom our forefathers worshipped, or that we should give up using our wealth as we please? Do you fancy that you, and only you, are forbearing and right-directed?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They asked him, \"Shu'ayb, do your prayers tell you that we must give up the worship of what our fathers had worshipped and that we must not deal with our properties as we like? We still believe that you are a person of forbearance and understanding.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Shuaib! Does your prayer command you that we forsake the deities of our forefathers or that we may not do as we wish with our own property? Yes indeed – only you are very intelligent, most righteous*.” (* They mocked at him with sarcasm.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Shu`ayb! Does your Salah command you that we give up what our fathers used to worship, or that we give up doing what we like with our property Verily, you are the forbearer, right-minded!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Shu'aib! does your prayer enjoin you that we should forsake what our fathers worshipped or that we should not do what we please with regard to our property? Forsooth you are the forbearing, the right-directing one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Shuaib, does thy prayer command thee that we should leave that our fathers served, or to do as we will with our goods? Thou art the clement one, the right-minded.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Shu'eyb! Doth thy way of prayer command thee that we should forsake that which our fathers (used to) worship, or that we (should leave off) doing what we will with our own property. Lo! thou art the mild, the guide to right behaviour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Shu'ayb, does your prayer tell you that we should abandon what our forefathers worshipped and that we should stop disposing of our belongings as we please? You are indeed the only wise and rightly-guided man!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Shu'aib, commandeth thee thy prayer that we should abandon that which our fathers have worshipped, or that we should not do with our riches whatsoever we will! thou, indeed! thou forsooth art forbearing, right-minded!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O Shu‘ayb, does your worship require that we abandon what our fathers have been worshiping, or that we should not do with our wealth whatever we wish? You are indeed [a] gentle and sensible [person].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Shu'aib! Does thy (religion of) prayer command thee that we leave off the worship which our fathers practised, or that we leave off doing what we like with our property? truly, thou art the one that forbeareth with faults and is right-minded!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Shu'aib! Does your Salat (prayer) (i.e. the prayers which you offer has spoiled your mind, so you) command that we leave off what our fathers used to worship, or that we leave off doing what we like with our property? Verily, you are the forbearer, right-minded!\" (They said this sarcastically).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shu'aib' they replied, 'does your prayer command you that we should abandon that which our fathers worshipped or do as we please with our goods? You are clement and rightminded'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Shuaib, does your prayer command you that we abandon what our ancestors worshiped, or doing with our wealth what we want? You are the one who is intelligent and wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O Shu'ayb, does your prayer command you that we should leave what our fathers worship or not do with our wealth what we please? Indeed, you are the forbearing, the discerning!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:87] They said, to him mockingly: ‘O Shu‘ayb, does your [way of] prayer command you, with the obligation [to make sure], that we should leave what our fathers [used to] worship, of idols, or, that we should cease, to do as we will with our goods?, meaning that such a command is an absurdity which no person calling to good would commend. You are indeed the forbearing, the right-guided’: they said this in mockery.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Shu'ayb! Doth thy way of prayer) do your abundant prayers (command thee that we should forsake that which our fathers (used to) worship) of idols, (or that we (should leave off) doing what we will with our own property) such as cheating in measure and weighing. (Lo! thou art the mild, the guide to right behaviour) they said this in derision, meaning to say: it is you who is the impudent and misguided.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وزهده وتوحيده وتنزّهه بقولهم: { أصلاتك } إلى آخره\n  { قال يا قوم أَرَأَيتم } أي: أخبروني { إن كنت على } برهان يقيني على التوحيد { من ربي ورزقني منه رزقاً حسناً } من الحكمة العلمية والعملية والكمال والتكميل بالاستقامة في التوحيد\n هل يصح لي أن أترك النهي عن الشرك والظلم والإصلاح بالتزكية والتحلية؟\n وحذف جواب: أرأيتم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سمعوا منه ما سمعوا { قَالُواْ } مستهزئين متهكيمن { يٰشُعَيْبُ } المدعي دعوة الخلق إلى الحق { أَصَلَٰوتُكَ } الكثيرة التي تصليها في خلواتك { تَأْمُرُكَ أَن نَّتْرُكَ مَا يَعْبُدُ ءابَاؤُنَآ } من الأصنام والأوثان { أَوْ أَن نَّفْعَلَ فِيۤ أَمْوَالِنَا مَا نَشَاءُ } أي: تأمرك صلواتك أن نترك أفعالنا الت كنا كعلمنا بها في ازدياد أموالنا حسب إراداتنا واختيارنا { إِنَّكَ } أيها الداعي للخلق إلى الحق { لأَنتَ ٱلْحَلِيمُ } ذو الحلم والكرم\n ولا تعجل في الانتقام { ٱلرَّشِيدُ } [هود: 87] العاقل\n لا تتكدر بمثل هذه الأوهام\n قالوا له هذا استهزاء وسخرية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: \" تأمرك أن نترك \": على حذف مضاف، أي: تأمرك بتكليف أن نترك لأن الرجل لا يُؤمر بفعل غيره. وأن نفعل: عطف على ما أي: أو نترك فعلنا في أموالنا ما نشاء. يقول الحق جل جلاله: { قالوا يا شعيب أصلواتك } التي تُكثر منها هي التي { تأمرك } أن تأمرنا { أن نترك ما يعبد آباؤنا } من الأصنام، وندخل معك في دينك المحدث، أجابوا به ما أمرهم به من التوحيد بقوله: { ما لكم من إله غيره } ، على وجه التهكم والاستهزاء بصلواته. وكان كثير الصلاة، ولذلك جمعوها وخصوها بالذكر. وقرأ الأخوان وحفص بالإفراد المراد به الجنس.  ثم أجابوه عن نهيهم عن التطفيف وأمرهم بالإيفاء، فقالوا: { أو } نترك { أن نفعل في أموالنا ما نشاء } من البخس وغيره؟ وقيل: كانوا يقطعون الدراهم والدنانير، فناهم عن ذلك.. { إنك لأنت الحليم الرشيد } ، تهكموا به وقصدوا وصفه بضده، من خفة العقل والسفه لأن العاقل عندهم هو الحريص على جمع الدنيا وتوفيرها، وهو الحمق عند العقلاء، أو إنك موسوم بالحلم والرشد فلا ينبغي لك أن تنهانا عن تنمية أموالنا والتصرف فيها. والله تعالى أعلم. الإشارة: الإنكار على من أمر بالخروج عن العوائد والتقلل من الدنيا من طبع أهل الكفر والجهل، وكذلك رميه بالحمق والسفه. فلا تجد الناس اليوم يعظمون إلا من أقرهم على توفير دنياهم ورئاستهم. والتكاثر منها، وأما من زهدهم فيها وأمرهم بالقناعة، فإنهم يرفضونه، ويحمقونه. وهذا طبع من طبع الأمم الخالية، الجاهلة بالله، وبما أمر به، وفي الحديث:\n \" لَتَتبعُنَّ سَننَ مَن قَبلِكُم شِبراً بِشبر، وذرَاعاً بِذرَاعٍ، حَتَّى لَوْ دَخَلْوا جُحْرَ ضَبٍّ لدخَلتُمُوه \" \nوبالله التوفيق. ثم ذكر موعظة شعيب لقومه، فقال: { قَالَ يٰقَوْمِ أَرَأَيْتُمْ إِن كُنتُ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّي }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:177",
      "similarity": 0.5046633341200216
    },
    {
      "verse": "7:90",
      "similarity": 0.4478961928216988
    },
    {
      "verse": "7:88",
      "similarity": 0.37477527428202895
    },
    {
      "verse": "7:92",
      "similarity": 0.36820958976280904
    },
    {
      "verse": "40:38",
      "similarity": 0.30166490291291176
    }
  ]
}