{
  "chapter": "هود",
  "text": "ويقوم اوفوا۟ المكيال والميزان بالقسط ولا تبخسوا۟ الناس اشياءهم ولا تعثوا۟ فى الارض مفسدين",
  "translations": [
    {
      "translation": "My people! Give full measure and full weight with justice; do not diminish people's goods; and do not go about the earth, corrupting it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, O my people, weigh and measure with justness, and do not withhold things due to men, and do not spread corruption in the land, despoiling it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people! Give full measure and weight with justice, do not diminish the goods of others, and do not go about creating corruption in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My people, be just in your weighing and measuring. Do not defraud people or spread evil in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people! Measure and weigh in full with justice, and do not give the people their goods diminished, and do not roam about in the earth causing turmoil.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Give full measure and weight in justice and reduce not the things that are due to the people, and do not commit mischief in the land, causing corruption.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! give full measure and weight fairly, and defraud not men their things, and do not act corruptly in the land, making mischief:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, fill up the measure and the balance justly, and do not diminish the goods of the people, and do not mischief in the land, working corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people! Give full measure and full weight in justice, and wrong not people in respect of their goods. And do not evil in the earth, causing corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my people, [always] give full measure and weight, in all fairness and do not defraud people by making short delivery, and do not spread corruption in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, O my people! give full measure and weight with equity, and defraud not the people of their things, and commit not mischief on the earth as corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O my people! Observe fully the measure and the balance, with justice, and do not cheat the people of their goods, and do not act wickedly on the earth, causing corruption.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! give just measure and weight, nor withhold from the people the things that are their due: commit not evil in the land with intent to do mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people! Give full measure and weight in justice and reduce not the things that are due to the people, and do not commit mischief in the land, causing corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My nation, be just in filling the measure and the scale. Do not reduce people's goods and do not corrupt the land with mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my people! Give full measure and full weight, in all fairness, and do not cheat the people out of their rights, and do not spread corruption in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O my people, give full measure and weight in justice and do not deprive the people of their due and do not commit abuse on the earth, spreading corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:85] O my people, give full measure and weight, fulfil [the due of] both of these, in justice, and do not defraud people in respect of their goods, do not diminish anything of their due, and do not be degenerate in the land, working corruption, by killing or otherwise ([lā ta‘thaū] derives from ‘athiya, meaning afsada, ‘he   corrupted’; mufsidīn, ‘working corruption’, is a circumstantial qualifier reiterating the import of the term operating it, ta‘thaū, ‘[do not] be degenerate’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my people! Give full measure and full weight in justice, and wrong not people about their goods. And do not evil in the earth, causing corruption) do not spread corruption in the earth nor worship idols nor invite people to it; and give people their due of right measure and weight.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فلازموا التوحيد والعدالة واعتزلوا عن الشرك والظلم الذي هو جماع الرذائل وأمّ الغوائل { ولا تعثوا } في إفسادكم أي: ولا تبالغوا ولا تمادوا في غاية الإفساد فإنّ الظلم هو الغاية في ذلك كما أن العدل هو الغاية في الصلاح وجماع الفضائل\n { بقية الله خيرٌ لكم إن كنتم مؤمنين } أي: إن كنتم مصدّقين ببقاء شيء فما يبقى لكم عند الله من الكمالات والسعادات الأخروية والمقتنيات العقلية والمكاسب العلمية والعملية خير لكم من تلك المكاسب الفانية التي تشقون بها وتشقون على أنفسكم في كسبها وتحصيلها ثم تتركونها بالموت ولا يبقى منها معكم شيء إلا وبال التبعات والعذاب اللازم لما في نفوسكم من رواسخ الهيئات\n ولما شاهد إنكارهم وعتوّهم في العصيان\n واستهزاءهم بطاعته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { يٰقَوْمِ } إن أردتم خير الدارين ونفع النشأتين { أَوْفُواْ ٱلْمِكْيَالَ وَٱلْمِيزَانَ } على عباد الله\n أي: لا تزيدا عليها ولا تنقصوا منها\n إذ الطرفان كلاهما مذمومان\n بل أوفوهما { بِٱلْقِسْطِ } والعدل { وَ } عليكم أن { لاَ تَبْخَسُواْ } ولا تنقضوا { ٱلنَّاسَ أَشْيَآءَهُمْ } في حال من الأحوال { وَ } بالجملة: { لاَ تَعْثَوْاْ فِي ٱلأَرْضِ مُفْسِدِينَ } [هود: 85] أي: لا تظهروا عليها بالخداع والحيف والبخس والتطفيف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تبخسوا الناسَ أشياءهم } لا تنقصوهم حقهم\n وهو تعميم بعد تخصيص\n فإنه أعم من أن يكون في الميزان والمكيال وفي غيره\n وكذا قوله: { ولا تَعْثَوا في الأرض مفسدين } فإن العثو ـ وهو الفساد ـ يعم تنقيص الحقوق وغيره من أنواع الفساد\n وقيل: المراد بالبخس: المكس\n كأخذ العشور في المعاملات\n والعثو: السرقة وقطع الطريق والغارة\n وأكد بقوله: { مفسدين } وفائدته: إخراج ما يقصد به الإصلاح\n كما فعل الخضر عليه السلام\n وقيل: معناه: مفسدين أمر دينكم ومصالح آخرتكم\n قاله البيضاوي\n { بقيةُ اللَّهِ } أي: ما أبقاه لكم من الحلال بعد التنزه عن الحرام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:183",
      "similarity": 0.796815594822378
    },
    {
      "verse": "7:85",
      "similarity": 0.5911577356347804
    },
    {
      "verse": "29:36",
      "similarity": 0.4624841321448196
    },
    {
      "verse": "11:15",
      "similarity": 0.41342945635432665
    },
    {
      "verse": "2:60",
      "similarity": 0.38264482263424526
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/11:85.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/11:85.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/11:85.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}