{
  "chapter": "هود",
  "text": "واستغفروا۟ ربكم ثم توبوا۟ اليه ان ربى رحيم ودود",
  "translations": [
    {
      "translation": "Ask your Lord for forgiveness and then make tawba to Him. My Lord is Most Merciful, Most Loving.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beg your Lord to forgive you, and turn to Him. Indeed my Lord is compassionate and loving.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek the forgiveness of your Lord and turn to Him in repentance. Surely my Lord is Ever Merciful, Most Loving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek forgiveness from your Lord and turn to Him in repentance. My Lord is certainly All-merciful and Loving.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Ask forgiveness from your Lord and then incline towards Him in repentance; indeed my Lord is Most Merciful, Most Affectionate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask forgiveness of your Lord and turn unto Him in repentance. Verily, my Lord is Most Merciful, Most Loving.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask forgiveness of your Lord, then turn to Him; surely my Lord is Merciful, Loving-kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask forgiveness of your Lord, then repent to Him; surely my Lord is All-compassionate, All-loving.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask pardon of your Lord and then turn unto Him (repentant). Lo! my Lord is Merciful, Loving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek forgiveness of your Lord and turn to Him in repentance. For my Lord is indeed merciful and loving.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask forgiveness of your Lord, and then repent unto him; verily my Lord is Merciful, Loving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Plead with your Lord for forgiveness, then turn to Him penitently. My Lord is indeed all-merciful, all-affectionate.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But ask forgiveness of your Lord, and turn unto Him (in repentance): For my Lord is indeed full of mercy and loving-kindness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask forgiveness of your Lord and turn unto Him in repentance. Verily, my Lord is Most Merciful, Most Loving.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the forgiveness of your Lord and turn to Him in repentance. Indeed, my Lord is the Most Merciful, Loving'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And ask your Lord for forgiveness, and repent to Him. My Lord is Merciful and Loving.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask forgiveness of your Lord and then repent to Him. Indeed, my Lord is Merciful and Affectionate.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:90] And ask forgiveness of your Lord, then repent to Him. Truly my Lord is Merciful, to believers, Affectionate’, loving towards them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ask pardon of your Lord) declare your Lord's divine Oneness (and then turn unto Him (repellent)) turn to Him repentant and with sincerity. (Lo! my Lord is, Merciful) towards His believing servants, (Loving) He forgives and rewards them; it is also said that this means: He loves them and makes His obedience beloved 237 to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } يا قوم { ٱسْتَغْفِرُواْ رَبَّكُمْ } الذي أظهركم من العدم من جميع فرطاتكم { ثُمَّ تُوبُوۤاْ إِلَيْهِ } أي: اخلصوا في إنابتكم ورجوعكم، ولا تغتموا بعد إخلاص التوبة بما جرى عليكم من الجرائم { إِنَّ رَبِّي رَحِيمٌ } يقبل توبتكم ويعفو عن زلاتكم { وَدُودٌ } [هود: 90] يحبكم ويرحمكم ويتفضل عليكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واستغفروا ربَّكم ثم تُوبوا إليه } عما أنتم عليه { إن ربي رحيم } عظيم الرحمة للتائبين { ودود } متودد إليهم، فاعل بهم من اللطف والإحسان ما يفعل البليغ بمن يوده، وهو وعد على التوبة بعد الوعيد على الإصرار\n\n\nقاله البيضاوي\n الإشارة: قد تضمنت خطبة شعيب عليه السلام ست خصال، من اجتمعت فيه فاز بسعادة الدارين: الأولى: فتح البصيرة، ونفوذ العزيمة، وتنوير القلب بمعرفة الله، حتى يكون على بينة من ربه\n الثانية: تيسير الرزق الحلال، من غير تعب ولا مشقة، يستعين به على طاعة ربه، ويقوم به بمؤنة أمره\n  الثالثة: السعي في إصلاح عباد الله وإرشادهم، ودعاؤهم إلى الله من غير طمع ولا حرف، ويكون حاله يصحح مقاله، فلا يترك ما أمر به، ولا يفعل ما نهى عنه\n الرابعة: الاعتماد على الله والرجوع إليه في توفيقه وتسديده، وفي أمر دنياه ودينه، بحيث لا يرجو إلا الله، ولا يخاف إلا منه\n  الخامسة: الحذر والتحذير من مخالفة ما جاءت به الرسل من عند الله، والتمسك بما أمروا به من طاعة الله، والاعتذار بمن هلك قبله ممن خالف أمر الله\n السادسة: تحقيق التوبة والانكسار، والإكثار من الذكر والاستغفار\n فذلك سبب المودة من الكريم الغفار\n ولأجل هذه الخطبة سُمي شعيب خطيب الأنبياء\n والله تعالى أعلم\n ثم ذكر جواب قومه، فقال: { قَالُواْ يٰشُعَيْبُ مَا نَفْقَهُ كَثِيراً مِّمَّا تَقُولُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:14",
      "similarity": 0.7699028966910162
    },
    {
      "verse": "19:96",
      "similarity": 0.6174180460190264
    },
    {
      "verse": "5:74",
      "similarity": 0.5226455162883782
    },
    {
      "verse": "9:27",
      "similarity": 0.5175703545848195
    },
    {
      "verse": "60:7",
      "similarity": 0.5114553869113015
    }
  ]
}