{
  "chapter": "هود",
  "text": "واتبعوا۟ فى هذه لعنة ويوم القيمة بئس الرفد المرفود",
  "translations": [
    {
      "translation": "Damned will they be in this world, and on the Day of Doom how evil the gift that they will receive!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were pursued by a curse in this world and so will they be on the Day of Resurrection. What an evil reward will they receive!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are condemned in this world and in the life to come. Evil is the gift and the recipient!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a curse followed them in the world, and on the Day of Resurrection; what a wretched gift is what they received.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were pursued by a curse in this (deceiving life of this world) and (so they will be pursued by a curse) on the Day of Resurrection, evil indeed is the gift granted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they are overtaken by curse in this (world), and on the resurrection day, evil the gift which shall be given.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there was sent following after them in this world a curse, and upon the Day of Resurrection -- evil the offering to be offered!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A curse is made to follow them in the world and on the Day of Resurrection. Hapless is the gift (that will be) given (them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A curse followed them in this world, and shall follow them on the Day of Resurrection. What a foul gift to be given!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were followed in this world by a curse and so they will be on the Day of Resurrection, ill is the present presented!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are pursued by a curse in this [world], as well as on the Day of Resurrection; evil is the award conferred [upon them]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they are followed by a curse in this (life) and on the Day of Judgment: and woeful is the gift which shall be given (unto them)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were pursued by a curse in this (deceiving life of this world) and (so they will be pursued by a curse) on the Day of Resurrection. How bad is the curse (in this world) pursued by another curse (in the Hereafter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A curse was sent to follow them in this world and then upon them on the Day of Resurrection. Evil is the offering to be offered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were followed by a curse in this, and on the Day of Resurrection. Miserable is the path they followed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were followed in this [world] with a curse and on the Day of Resurrection. And wretched is the gift which is given.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:99] And a curse was made to follow them in this [world], as well as, a curse, on the Day of Resurrection — evil is the assistance offered!, in their case.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A curse is made to follow them in the world) they were destroyed in the life of this world through drowning (and on the Day of Resurrection) they will receive another curse, i.e. the Fire. (Hapless is the gift (that will be) given (them)) evil is the punishment through drowning and evil is the punishment of hell; it is also said that this means: evil is the helper and evil is the helped.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلرِّفْدُ ٱلْمَرْفُودُ } معناه المُعَانُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم من غاية خبثهم وفسادهم { أُتْبِعُواْ فِي هَـٰذِهِ } النشاة { لَعْنَةً } دائمة مستمرة { وَ } يلعنون أيضاً { يَوْمَ ٱلْقِيَامَةِ } بأضعاف هذه اللعنة، وبالجملة: { بِئْسَ ٱلرِّفْدُ } أي: العون والعطاء { ٱلْمَرْفُودُ } [هود: 99] أي: المعان والمعطى رفدهم التي هي طردهم في الدارين ولعنهم في النشأتين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأتبعوا في هذه لعنةً ويومَ القيامة } أي: تتبعهم اللعنة في الدارين { بئس الرفدُ المرفود }: بئس العون المعان، أو العطاء المعطى\n فالرفد: العطاء، والإرفاد: المعونة، ومنه: رفادة قريش، أي: معونتهم للفقراء في الحج بالطعام\n والمخصوص بالذم محذوف، أي: رفدهم، وهو اللعنة في الدارين\n الإشارة: إذا أردتَ أن تعرف قدر الرجل في مرتبة الخصوصية فاسأل عن إمامه الذي يقتدى به، فإن كان من أهل الخصوصية فصاحبه من الخصوص، إن دامت صحبته معه، وإن كان من العموم فصاحبه من العموم\n والمراد بالخصوصية: تحقيق مقام الفناء، ودخول بلاد المعاني\n فكل من لم يحصل مقام الفناء، ولم يشهد إلا المحسوسات فهو من العوام، ولو بلغ من العلم والعمل ما بلغ، ولو رأى من الكرامات أمثال الجبال\n فمن صحب مثل هذا الذي لم يفن عن نفسه، ولم يخرج عن دائرة حسه، لم يخرج من العمومية لأن نفسه فرعونية\n قال تعالى: { وما أمر فرعون برشيد } ، وفي الخبر: \" المَرْءُ على دين خليله \" وقال الشاعر:\n",
      "translations": []
    }
  ]
}