{
  "chapter": "هود",
  "text": "قالوا۟ يشعيب ما نفقه كثيرا مما تقول وانا لنرىك فينا ضعيفا ولولا رهطك لرجمنك وما انت علينا بعزيز",
  "translations": [
    {
      "translation": "They said, 'Shu'ayb, We do not understand much of what you say and we see you are weak among us. Were it not for your clan, we would have stoned you. We do not hold you in high esteem!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Shu'aib, much of what you say is meaningless to us, and then (for sure) you are powerless among us. But for your clan we would have stoned you to death. You have no power over us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'O Shu'ayb! We do not understand much of what you say. Indeed we see you weak in our midst. Were it not for your kinsmen, we would surely have stoned you for you have no strength to overpower us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Shu'ayb, we do not understand much of what you say, but we know that you are weak among us. Had it not been for our respect of your tribe, we would have stoned you to death; you are not very dear to us\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Shuaib! We do not understand most of what you say, and indeed we perceive you weak among us; were it not for your relatives, we would have stoned you; and in our sight, you have no respect at all.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Shu`ayb! We do not understand much of what you say, and we see you weak among us. Were it not for your family, you would have been stoned, and you are not powerful against us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Shu'aib! we do not understand much of what you say and most surely we see you to be weak among us, and were it not for your family we would surely stone you, and you are not mighty against us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Shuaib, we do not understand much of what thou sayest. Truly we see thee weak among us; but for thy tribe we would have stoned thee; for thou art not strong against us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Shu'eyb! We understand not much of that thou tellest, and lo! we do behold thee weak among us. But for thy family, we should have stoned thee, for thou art not strong against us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"Shu'ayb, we do not understand much of what you say. In fact, we see that you are powerless among us.Were it not for your clan, we would have stoned you, for you are not strong against us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Shu'aib! we understanand not much of that which thou sayest, and verily we see thee weak among us, and were it not for thy company we had surely stoned thee, and thou art not among us mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O Shu‘ayb, we do not understand much of what you say. Indeed we see that you are weak amongst us, and were it not for your tribe, we would have stoned you, and you are not a formidable [challenge] for us.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Shu'aib! much of what thou sayest we do not understand! In fact among us we see that thou hast no strength! Were it not for thy family, we should certainly have stoned thee! for thou hast among us no great position!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Shu'aib! We do not understand much of what you say, and we see you a weak (man, it is said that he was a blind man) among us. Were it not for your family, we should certainly have stoned you and you are not powerful against us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said 'Shu'aib, we do not understand much of what you say to us. Indeed, we see you weak among us. If it was not for your tribe we would have stoned you because you are not strong against us'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Shuaib, we do not understand much of what you say, and we see that you are weak among us. Were it not for your tribe, we would have stoned you. You are of no value to us.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O Shu'ayb, we do not understand much of what you say, and indeed, we consider you among us as weak. And if not for your family, we would have stoned you [to death]; and you are not to us one respected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:91] They said, in proclamation of their lack of concern: ‘O Shu‘ayb, we do not understand much of what you say. Truly we see you are weak, abject, among us, and were it not for your clan, we would have stoned you; for you are not, too, powerful, [too] venerable, for us’, to stone, but it is your clan that is powerful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Shu'ayb! We understand not much of that thou tellest) of that you command us, (and lo! we do behold you weak) blind (among us. But for your family) your clan, (we should have stoned thee) killed you, (for thou art not strong against us) for you are not favoured at all among us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما بالغ في نصحهم وإرشادهم { قَالُواْ } تسفيهاً عليه وتخويفاً: { يٰشُعَيْبُ } نادوه على سبيل الاستهزاء والاستحقار { مَا نَفْقَهُ } ونفهم ونعقل { كَثِيراً مِّمَّا تَقُولُ } أي: بعض هذياناتك التي تكلمت بها { وَإِنَّا } أي: وإن لم نفهم بعض كلماتك لابتنائها على الخبل والخرق { لَنَرَاكَ } في بادي الرأي { فِينَا ضَعِيفاً } في غاية الضعف والحقارة { وَ } بالجملة: { لَوْلاَ رَهْطُكَ } أي: عشائرك وأقوامك { لَرَجَمْنَاكَ } بالحجارة ألبتة بسبب هذاياناتك وذكرك آلهتنا بالسوء\n ودخلك على أفعالنا مع أموالنا { وَ } أعلم يقيناً إنك بنفسك { مَآ أَنتَ عَلَيْنَا بِعَزِيزٍ } [هود: 91] بل عزتك عندنا بسبب رهطك لكونهم إخواننا في الدين\n فلا نريد أذاهم بقتلك\n وإلا فلا نبالِ بك وبرحمتك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:92",
      "similarity": 0.6548100947553477
    },
    {
      "verse": "27:48",
      "similarity": 0.563945155235506
    },
    {
      "verse": "26:177",
      "similarity": 0.2777401641039494
    },
    {
      "verse": "7:90",
      "similarity": 0.26418979649597396
    },
    {
      "verse": "7:92",
      "similarity": 0.23224428100079342
    }
  ]
}