{
  "chapter": "هود",
  "text": "ولما جاء امرنا نجينا شعيبا والذين ءامنوا۟ معه برحمة منا واخذت الذين ظلموا۟ الصيحة فاصبحوا۟ فى ديرهم جثمين",
  "translations": [
    {
      "translation": "When Our command came, We rescued Shu'ayb and those who had iman along with him by a mercy from Us. The Great Blast seized hold of those who did wrong and morning found them lying flattened in their homes",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our word came to pass, We rescued Shu'aib and those who believed, with him, by Our grace, but those who were wicked were seized by a punishment from heaven, and lay overturned in their homes in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came to pass, We delivered Shu'ayb and those who shared his faith, through Our mercy, and the Blast seized those who were engaged in wrong-doing, so they lay lifeless in their homes\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our decree came to pass, We mercifully saved Shu'ayb and his faithful followers. A blast struck the unjust and left them in their homes, lying motionless on their faces,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We rescued Shuaib and the Muslims who were with him by Our mercy; and the terrible scream seized the unjust – so at morning they remained lying flattened in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our commandment came, We saved Shu`ayb and those who believed with him by a mercy from Us. And As-Sayhah (awful cry) seized the wrongdoers, and they lay (Jathimin) in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our decree came to pass We delivered Shu'aib, and those who believed with him by mercy from Us, and the rumbling overtook those who were unjust so they became motionless bodies in their abodes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We delivered Shuaib and those who believed with him by a mercy from Us, and the evildoers were seized by the Cry, and morning found them in their habitations fallen prostrate\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our commandment came to pass We saved Shu'eyb and those who believed with him by a mercy from Us; and the (Awful) Cry seized those who did injustice, and morning found them prostrate in their dwellings,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our command came, We saved Shu'ayb and those who believed with him as a mercy from Ourself, while the blast overtook the wrongdoers, so that they lay dead in their homes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when our decree came to pass, We delivered Shu'aib and those who believed with him by a mercy from Us, and the shout overtook those who did wrong, so they lay in their dwellings crouching.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our edict came, We delivered Shu‘ayb and the faithful who were with him by a mercy from Us. And the Cry seized those who were wrongdoers, whereat they lay lifeless prostrate in their homes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our decree issued, We saved Shu'aib and those who believed with him, by (special) mercy from Ourselves: But the (mighty) blast did seize the wrong-doers, and they lay prostrate in their homes by the morning,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Commandment came, We saved Shu'aib and those who believed with him by a Mercy from Us. And As-Saihah (torment - awful cry, etc.) seized the wrong-doers, and they lay (dead) prostrate in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came We saved Shu'aib through Our Mercy, together with those who believed. (Then) the evildoers were seized by a Shout, and when morning came they were crouched in their dwellings, dead,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We saved Shuaib and those who believed with him, by mercy from Us, and the Blast struck the wrongdoers, and they became motionless bodies in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our command came, We saved Shu'ayb and those who believed with him, by mercy from Us. And the shriek seized those who had wronged, and they became within their homes [corpses] fallen prone\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:94] And when Our command came, for their destruction, We delivered Shu‘ayb and those who believed with him by a mercy from Us; and the Cry seized those who were evildoers — Gabriel cried at them — and they ended up lying lifeless prostrate in their habitations, keeled over on their knees, dead,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Our commandment) Our chastisement (came to pass we saved Shu'ayb and those who believed with Him by a mercy from Us) by a grace from Us; (and the (Awful) Cry) announcing chastisement (seized those who did injustice) the idolaters, i.e. the people of Shu'ayb, (and morning found them prostrate) dead, turned into dust (in their dwellings) in their houses.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا جَآءَ } ونفذ { أَمْرُنَا } بأهلاكهم { نَجَّيْنَا } وأخرجنا أولاً من بينهم { شُعَيْباً } الناجي { وَٱلَّذِينَ آمَنُواْ مَعَهُ } وامتثلوا بما أُمروا به من عندنا { بِرَحْمَةٍ } نازلة { مِّنَّا } إياهم تفضلاً { وَأَخَذَتِ ٱلَّذِينَ ظَلَمُواْ } أنفسهم حين صاروا في فراشهم بائتين { الصَّيْحَةُ } الهائلة { فَأَصْبَحُواْ فِي دِيَارِهِمْ } التي كانوا مترفهين فيها { جَاثِمِينَ } [هود: 94] جامدين وأجسادهم بلا روح\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:67",
      "similarity": 0.8246122136181673
    },
    {
      "verse": "7:78",
      "similarity": 0.576258630673898
    },
    {
      "verse": "7:91",
      "similarity": 0.576258630673898
    },
    {
      "verse": "29:37",
      "similarity": 0.5736617698825164
    },
    {
      "verse": "15:83",
      "similarity": 0.36578908174204483
    }
  ]
}