{
  "chapter": "هود",
  "text": "ولئن اذقنا الانسن منا رحمة ثم نزعنها منه انه ليـوس كفور",
  "translations": [
    {
      "translation": "If We allow man to enjoy Our favours, and then take them away from him, he becomes despondent and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We ever favour man with Our Mercy, and then take it away from him, he becomes utterly desperate, totally ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We grant a favor to the human being and then take it away from him. He becomes despairing and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We bestow man the enjoyment of some mercy from Us and later withdraw it from him; surely he is most despairing, ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We give man a taste of mercy from Us, and then withdraw it from him, verily, he is despairing, ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We make man taste mercy from Us, then take it off from him, most surely he is despairing, ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We let a man taste mercy from Us, and then We wrest it from him, he is desperate, ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if we cause man to taste some mercy from Us and afterward withdraw it from him, lo! he is despairing, thankless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We bestow upon man a measure of Our grace and then take it away from him, he yields to despair and becomes ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We let man taste mercy from us, and thereafter withdraw it from him, verily he is despairing, blaspheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We let man taste a mercy from Us, and then withdraw it from him, he becomes despondent, ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We give man a taste of Mercy from Ourselves, and then withdraw it from him, behold! he is in despair and (falls into) blasphemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We give man a taste of Mercy from Us, and then withdraw it from him, verily! He is despairing, ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We let a human taste Our Mercy and then withhold it from him, he becomes desperate and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We give the human being a taste of mercy from Us, and then withdraw it from him, he becomes despairing and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We give man a taste of mercy from Us and then We withdraw it from him, indeed, he is despairing and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:9] And if We cause, the disbelieving, man to taste some mercy from Us, [such as] wealth and [good] health, and then wrest it from him, lo! he is despairing, having lost hope of God’s mercy, ungrateful, intensely ungrateful to Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if We cause man) the disbeliever (to taste some mercy) a blessing (from Us and afterward withdraw it from him, lo! he is despairing) he becomes the most despairing and despondent thing from Allah's mercy, (thankless) he denies Allah's blessing and is not grateful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّهُ لَيَئُوسٌ } معناهُ يائِسٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولئن أذقنا الإنسان منا رحمة } إلى آخره، ينبغي للإنسان أن يكون في الفقر والغنى والشدّة والرخاء والمرض والصحة واثقاً بالله متوكلاً عليه لا يحتجب عنه بوجود نعمة ولا بسعيه وتصرّفه في الكسب ولا بقوّته وقدرته في الطلب ولا بسائر الأسباب والوسائط لئلا يحصل اليأس عند فقدان تلك الأسباب والكفران والبطر والأشر عند وجودها فيبعد بها عن الله تعالى وينساه فينساه الله بل يرى الإعطاء والمنع منه دون غيره، فإن أتاه رحمة من صحة أو نعمة شكره أولاً برؤية ذلك منه وشهود المنعم في صورة النعمة، وذلك بالقلب ثم بالجوارح باستعمالها في مراضيه وطاعته والقيام بحقوقه تعالى فيها ثم باللسان بالحمد والثناء متيقناً بأنه القادر على سلبها، محافظاً عليها بشكرها مستزيداً إياها اعتماداً على قوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية لطفنا وجودنا إلى الإنسان، ونهاية إحساننا معه وتفقدنا لحاله { لَئِنْ أَذَقْنَا ٱلإِنْسَانَ } المجبول على النسيان والكفران وأعطيناه { مِنَّا رَحْمَةً } ونعمة تسره وتفرج همه { ثُمَّ نَزَعْنَاهَا مِنْهُ } ومنعناها عنه؛ إظهاراً لقدرتنا وكمال بسطتنا { إِنَّهُ } من قلة تصبره وغاية ضعفه وتكسره { لَيَئُوسٌ } قنوط من فضلنا ورحمتنا { كَفُورٌ } [هود: 9] لما وصل إلي من نعمتنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}