{
  "chapter": "هود",
  "text": "ولقد ارسلنا موسى بـايتنا وسلطن مبين",
  "translations": [
    {
      "translation": "We sent Musa with Our Signs and clear authority",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our signs and full authority\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Moses with Our signs and with a clear authority\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses to the Pharaoh and his nobles with Our miracles and a clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Moosa with Our revelations and a clear domination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Musa with Our Ayat and a manifest authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent Musa with Our communications and a clear authority,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Moses with Our signs, and a manifest authority,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We sent Moses with Our revelations and a clear warrant\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent forth Moses with Our signs and with manifest authority,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We sent Musa with Our signs and a manifest warranty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Moses with Our signs and a manifest authority\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we sent Moses, with Our Clear (Signs) and an authority manifest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Musa (Moses) with Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and a manifest authority;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our signs and with clear authority\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Moses with Our signs and a clear mandate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did certainly send Moses with Our signs and a clear authority\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:96] And verily We sent Moses with Our signs and a clear warrant, a manifest and evident proof,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We sent Moses with Our revelations) with nine signs (and a clear warrant) and a clear proof, the signs being themselves clear proof.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فمنهم شقي وسعيدٌ } لما أطلق الشقي والسعيد منكرين للتعظيم دل على الشقي والسعيد الأزليين الأبديين\n ولما وصفهم في التقسيم التفصيلي استثنى عن خلود الشقي في النار وخلود السعيد في الجنة بقوله: { إلا ما شَاءَ ربك } لأن المراد بالنار والجنة عذاب النفس بنار الحرمان عن المراد وآلام الهيئات والآثار وثواب النفس بجنة حصول المرادات واللذات وبالاستثناء عن الخلود فيهما خروج الشقيّ منها إلى ما هو أشدّ منه من نيران القلب في حجب الصفات والأفعال بالسخط والطرد والإذلال والإهانة\n ونيران الروح بالحجب واللعن والقهر وخروج السعيد منها إلى ما هو ألذّ وأطيب من جنان القلب في مقام تجليات الصفات بالرضوان واللطف والإكرام والإعزاز وجنان الروح في مقام الشهود باللقاء وظهور سبحات الجلال\n وما لا عين رأت\n ولا أُذن سَمِعت\n ولا خطر على قلب بشر\n لكون الشقيّ في مقابلة السعيد وخروج السعيد من الجنة إلى النار محال\n وقد دلّ عليه بقوله: { عَطَاء غير مَجْذُوذ } أي: غير مقطوع\n فكذا ما يقابله على أن قوله تعالى: { فعال لما يريد } يشعر بذلك لكونه وعيداً شديداً\n هذا لسان الأدب ومراعاة الظواهر في تحقيق البواطن\n وأما الحقيقة فتحكم بأن الشقي لما كان في المراتب المذكورة في النار لم يخرج منها بل انتقل من طبقة منها إلى طبقة أخرى ومن دركة إلى دركة فكان في حكم الخلود فالمراد بالاستثناء غيره وهو أنه من حيث الأحدية مع ربّه والربّ آخذ بناصيته على صراط مستقيم يقوده ريح الدبور - التي هي هوى نفسه - يسوقه إلى جهنم\n فهو هنالك في عين القرب مع هوى نفسه فيتلذذ بما يوافقه فتصير عين النعيم\n فزال مسمى النار في حقه وصار جنة لتلذذه به وإن كان بعيداً عن نعيم السعيد كما جاء في الحديث:\n \" سينبت في قعر جهنم الجرجير \" \nوفيه:\n \" يأتي على جهنم زمان يصفق أبوابها ليس فيها أحد \" \nوكذا السعيد\n فإن انتقاله في الجنان ودرجاتها والخروج بحكم الاستثناء غير ذلك فهو بفنائه في أحدية الذات واحتراقه بلوعة العشق في سبحات الجمال حيث كان الحق شاهداً ومشهوداً لا في مقام المشاهدة بوجود الروح بل بالشهود الذاتي الأحدي الذي لم يبق فيه لغيره عين ولا أثر ولا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n وإن جعل التنكير في قوله: { شقي وسعيد } للنوعية لا للتعظيم\n جاز تأويل خروج الشقي من الناء بالترقي إلى الجنة من مقامه بزكاء نفسه عن الهيئات المظلمة وتبعات المعاصي وحينئذ لا يكون شقيّ الأبد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما انقرض أولئك الطغاة الغواة المنهمكين في الغي والضلال\n المفسدين في الأرض بأنواع الإفساد والإضلال { وَلَقَدْ أَرْسَلْنَا } حين حدث على الأرض أمثال أولئك الهالكين بل أسوأهم حالاً وأقبحهم شيمة وخصالاً وأشدهم بغضاً وشيكمة على الحق وأهله\n عبدنا { مُوسَىٰ } المخصص من عندنا بتكليمنا { بِآيَاتِنَا } الدالة على توحيدنا واستقلالنا في ملكنا وملكوتنا { وَسُلْطَانٍ } أي: أبدناه من عندنا بحجة واضحة وبرهان { مُّبِينٍ } [هود: 96] ظاهر الدلالة على صدقه في دعواه عند من له أدنى مسكة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ولقد أرسلنا موسى بآياتنا } بمعجزاتنا الدالة على صدقه\n { وسلطان مبين } وتسلط ظاهر على فرعون\n أو برهان بيِّن على نبوته\n قال البيضاوي: والفرق بينهما: أن الآية تعم الأمارة والدليل القاطع\n والسلطان يخص بالقاطع\n والمبين يخص بما فيه جلاء\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:23",
      "similarity": 1.0
    },
    {
      "verse": "51:38",
      "similarity": 0.7525025710691561
    },
    {
      "verse": "37:156",
      "similarity": 0.7085401771902461
    },
    {
      "verse": "16:100",
      "similarity": 0.6259800008865437
    },
    {
      "verse": "44:19",
      "similarity": 0.6180665726193639
    }
  ]
}