{
  "chapter": "هود",
  "text": "الى فرعون وملاي۟ه فاتبعوا۟ امر فرعون وما امر فرعون برشيد",
  "translations": [
    {
      "translation": "to Pharaoh and his ruling circle. They followed Pharaoh's command but Pharaoh's command was not rightly guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the Pharaoh and his nobles, but they followed the bidding of Pharaoh, though the bidding of Pharaoh was unrightful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to Pharaoh and his nobles. But they obeyed the command of Pharaoh even though Pharaoh's command was not rightly-directed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They followed the order of the Pharaoh but Pharaoh's orders were evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Towards Firaun and his court members, thereupon they followed the commands of Firaun; and the work of Firaun was not proper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Fir`awn and his chiefs, but they followed the command of Fir`awn, and the command of Fir`awn was no right guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Firon and his chiefs, but they followed the bidding of Firon, and Firon's bidding was not right-directing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to Pharaoh and his Council; but they followed Pharaoh's command, and Pharaoh's command was not right-minded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Pharaoh and his chiefs, but they did follow the command of Pharaoh, and the command of Pharaoh was no right guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to Pharaoh and his nobles. But they followed the command of Pharaoh and the command of Pharaoh was not rightly directed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Firawn and his chiefs. But they followed the commandment of Fir'awn, and the commandment of Fir'awn was not right- minded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to Pharaoh and his elite, but they followed Pharaoh’s dictates, and Pharaoh’s dictates were not right-minded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Pharaoh and his chiefs: but they followed the command of Pharaoh and the command of Pharaoh was no right (guide).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Fir'aun (Pharaoh) and his chiefs, but they followed the command of Fir'aun (Pharaoh), and the command of Fir'aun (Pharaoh) was no right guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to Pharaoh and his Council. But they followed the command of Pharaoh, and Pharaoh's command was not rightminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Pharaoh and his nobles, but they followed the command of Pharaoh, and the command of Pharaoh was not wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Pharaoh and his establishment, but they followed the command of Pharaoh, and the command of Pharaoh was not [at all] discerning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[11:97] to Pharaoh and his council; but they followed Pharaoh’s command, and Pharaoh’s command was not rightguided, appropriate.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Pharaoh and his chiefs, but they did follow the command of Pharaoh) and shunned the words of Moses, (and the command of Pharaoh) the word of Pharaoh (was no right guide) was not right.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلَىٰ فِرْعَوْنَ } الذي هو رأس أهل الضلال ورئيسهم إلى حيث تبعوه بالألوهية من غاية عتوه واستكباره { وَمَلَئِهِ } المعاونين له في أمره وشأنه، ثم لما أملهنا زماناً على غروره ورفعنا قدره في هذه الدنيا مسروراً؛ تغريراً عليه { فَٱتَّبَعُوۤاْ } من على الأرض { أَمْرَ فِرْعَوْنَ } وامتثلوا بمقتضاه { وَ } الحال أنه { مَآ أَمْرُ فِرْعَوْنَ بِرَشِيدٍ } [هود: 97] هادٍ إلى الحق، موصل إلى مقصد التوحيد، بل هو غار موصل إلى نار الخذلان وسعير الحرمان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أرسلناه { إلى فرعون وملئه } جماعته، { فاتبعوا أمرَ فرعون } أي: اتبعوا أمره بالكفر بموسى، أو: فما اتبعوا موسى الهادي إلى الحق، المؤيد بالمعجزات القاهرة الباهرة، واتبعوا طريقة فرعون المنهمك في الضلالة والطغيان، الداعي إلى ما لا يخفى فساده على من له أدنى مسكة من العقل لفرط جهالتهم، وعدم استبصارهم، { وما أمرُ فرعون برشيد } أي: ليس أمره برشد وصواب، وإنما هو غي وضلال",
      "translations": []
    }
  ]
}