{
  "chapter": "يوسف",
  "text": "قالوا۟ لئن اكله الذئب ونحن عصبة انا اذا لخسرون",
  "translations": [
    {
      "translation": "They said, 'If a wolf does come and eat him up when together we make up a powerful group in that case we would truly be in loss!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied: \"If a wolf should devour him when we are there, a well-knit band, we shall certainly be treacherous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Should a wolf eat him, despite the presence of our strong group, we would indeed be a worthless lot!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"If some wild-beast would be able to harm him, despite the presence of our strong group, it would certainly be a great loss to us!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “If the wolf devours him, whereas we are a group, then surely we are useless!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"If a wolf devours him, while we are `Usbah (a group), then surely, we are the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Surely if the wolf should devour him notwithstanding that we are a (strong) company, we should then certainly be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'If the wolf eats him, and we a band, then are we losers!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: If the wolf should devour him when we are (so strong) a band, then surely we should have already perished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Surely, if the wolf devoured him while we were a strong party, we should indeed be great losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: if the wolf devoured him while we were a company, we must indeed then be the losers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Should the wolf eat him while we are a hardy band, then we will indeed be losers!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"If the wolf were to devour him while we are (so large) a party, then should we indeed (first) have perished ourselves!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"If a wolf devours him, while we are 'Usbah (a strong group) (to guard him), then surely, we are the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'We are many, if a wolf devours him, then we are losers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “If the wolf ate him, and we are many, we would be good for nothing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"If a wolf should eat him while we are a [strong] clan, indeed, we would then be losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:14] They said, ‘Truly if (la-in: the lām here is for oaths) the wolf were to devour him, when we are [so hardy] a band, a group, then we indeed are losers!’, incapable [of anything]. Thus, he sent him off with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said) to their father: (If the wolf should devour him when we are (so strong) a band) ten of us, (then surely we should have already perished) we should be very weak; it is also said that this means: we should be really losers by neglecting the inviolability of our father and brother.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } على سبيل الاستبعاد والاستنكار مقسمين؛ تعزيراً عليه وتأكيداً لمكرهم وخداعهم: والله { لَئِنْ أَكَلَهُ ٱلذِّئْبُ وَنَحْنُ عُصْبَةٌ } أي: جماعة أقوياء ذوو عة وعُدة وقدرة وقوة { إِنَّآ إِذَاً لَّخَاسِرُونَ } [يوسف: 14] ضعفاء ذليلون مغبونون، قالوا ذلك على سبيل التشدد وإظهار الجرأة والشجاعة، كأهم يستدلون على عدم وقوع المحذر به\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا لئن أكله الذئب ونحن عصبة }: جماعة، { إنا إذا لخاسرون }: مغبونون من القوة والحزم، أو مستحقون بأن يدعى عليهم بالخسارة\n الإشارة: لم يسمح يعقوب عليه السلام بفراق حبيبه ساعة، وكذلك العبد لا ينبغي أن يغفل عن سيده لحظة لأن الغفلة فراق، والذكر انجماع، والعبد لا صبر له عن سيده\n وأنشدوا:\n\nوأنشدوا أيضاً في ذم الغفلة:\n\nقيل: إن بعض الصالحين رأى أستاذه في المنام، فقال له: يا أستاذ، أي الحسرات عندكم أعظم؟ قال: حسرة الغافلين، وأنشدوا:\n\nورأى ذو النون المصري بعض الصالحين في المنام، فقال له: ما فعل الله بك؟ قال: أوقفني بين يديه، وقال: يا مدعي، ادعيت محبتي ثم غفلت عني\n وأنشدوا:\n\nورأى عبد الله بن مسلمة والده في النوم، فقال له: يا أبت، كيف ترى حالك؟ فقال له: يا ولدي عشنا غافلين\n وأنشدوا:\n\nوقيل: ما أصاب يعقوب ما أصابه في ولده إلا من أجل خوفه عليه، وغفلته عن استيداعه ربه، ولو استودعه ربه لحفظه\n لكن لا ينفع حذر من قدر\n وكان أمر الله قدراً مقدوراً\n ثم ذكر انصرافهم بيوسف، وما كان من شأنه، فقال: { فَلَمَّا ذَهَبُواْ بِهِ وَأَجْمَعُوۤاْ أَن يَجْعَلُوهُ فِي غَيَٰبَتِ ٱلْجُبِّ }\n\n",
      "translations": []
    }
  ]
}