{
  "chapter": "يوسف",
  "text": "لقد كان فى قصصهم عبرة لاو۟لى الالبب ما كان حديثا يفترى ولكن تصديق الذى بين يديه وتفصيل كل شىء وهدى ورحمة لقوم يؤمنون",
  "translations": [
    {
      "translation": "There is instruction in their stories for people of intelligence. This is not a narration which has been invented but confirmation of all that came before, a clarification of everything, and a guidance and a mercy for people who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in their accounts is a lesson for men of wisdom. This is not a fictitious tale, but a verification of earlier Books, and a clear exposition of everything, and a guidance and grace for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly in the stories of the bygone people there is a lesson for people of understanding. What is being narrated in the Qur'an is no fabrication; it is rather confirmation of the Books that preceded it, and a detailed exposition of everything, and a guidance and mercy for people of faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their story, there is a lesson for the people of understanding. It is not a legend but a confirmation of what exists (in the Torah). It (the Quran) has details about everything. It is a guide and mercy for those who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in their tidings is enlightenment for the men of understanding; this (the Qur’an) is not some made up story but a confirmation of the Books before it, and a detailed explanation of all things, and a guidance and a mercy for the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in their stories, there is a lesson for men of understanding. It (the Qur'an) is not a forged statement but a confirmation of that which was before it and a detailed explanation of everything and a guide and a mercy for the people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their histories there is certainly a lesson for men of understanding. It is not a narrative which could be forged, but a verification of what is before it and a distinct explanation of all things and a guide and a mercy to a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their stories is surely a lesson to men possessed of minds; it is not a tale forged, but a confirmation of what is before it, and a distinguishing of every thing, and a guidance, and a mercy to a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their history verily there is a lesson for men of understanding. It is no invented story but a confirmation of the existing (Scripture) and a detailed explanation of everything, and a guidance and a mercy for folk who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their stories there is a lesson for men of understanding. This [Quran] is no invented tale, but a confirmation of the previous [scripture] and a detailed explanation of all things as well as guidance and mercy to true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly in their stories is a lesson for men of understanding. It is not a discourse fabricated, but a confirmation of that which went before it, and a detailing of everything, and a guidance and a mercy unto a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is certainly a moral in their accounts for those who possess intellect. This [Quran] is not a fabricated discourse; rather, it is a confirmation of what was [revealed] before it, and an elaboration of all things, and a guidance and mercy for a people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is, in their stories, instruction for men endued with understanding. It is not a tale invented, but a confirmation of what went before it,- a detailed exposition of all things, and a guide and a mercy to any such as believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in their stories, there is a lesson for men of understanding. It (the Quran) is not a forged statement but a confirmation of the Allah's existing Books [the Taurat (Torah), the Injeel (Gospel) and other Scriptures of Allah] and a detailed explanation of everything and a guide and a Mercy for the people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, in their stories is a lesson for those of understanding. This is no forged tale, rather, it is a confirmation of the previous, a distinguishing of all things, a guidance and a mercy to a nation who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their stories is a lesson for those who possess intelligence. This is not a fabricated tale, but a confirmation of what came before it, and a detailed explanation of all things, and guidance, and mercy for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was certainly in their stories a lesson for those of understanding. Never was the Qur'an a narration invented, but a confirmation of what was before it and a detailed explanation of all things and guidance and mercy for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:111] Verily there is in their stories, that is, the messengers’ [stories], a lesson for people of pith, possessors of intellect. It, this Qur’ān, is not a fabricated, an invented, discourse but, it is, a confirmation of what was [revealed] before it, of scriptures, and a detailing, an elucidation, of everything, that one needs for [the proper observance of] religion, and a guidance, from error, and a mercy for a folk who believe: such [folk] are singled out for mention because they are the ones to benefit from it, to the exclusion of others. Meccan, except for the verse [beginning with] ‘Those who disbelieve will continue to …’ [second half of 31], and the verse ‘And those who disbelieve will say, ‘You are not sent [by God]’. Alternatively, it is Medinese, except for the two verses [sc. verse 31], ‘If only it were a Qur’ān …’; it consists of 43, 44, 45 or 46 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(In their history) in their events, the event of Joseph and his brothers (verily there is a lesson) a sign (for men of understanding) for people endowed with intelligence. (It is no invented story) the Qur'an is not an invented story (but a confirmation of the existing (Scripture)) a confirmation of the Torah, the Gospel and all the others scriptures; it confirms the profession of monotheism and other legal rulings as well as the story of Joseph (and a detailed explanation of everything) a detailed explanation of the lawful and the unlawful, (and a guidance) from error (and a mercy) preventing from chastisement (for folk who believe) in Muhammad (pbuh) and in the Qur'an which was revealed to you from your Lord, and Allah knows the secrets of His Book'. And of the surah in which the thunder is mentioned, which is all Meccan-save two verses (As for those who disbelieve, disaster ceases not to strike them because of what they do, or it dwells near their home until the threat of Allah come to pass. Lo! Allah faileth not to keep the appointed time) and (they who disbelieve say: Thou art no messenger (of Allah). Say: Allah, and whoever has true knowledge of the Scripture, is sufficient witness between me and you) which are Medinan-and it consists of 45 verses, 855 words and 3,506 letters: Surah 13: The Thunder (al-Ra'd) And of the surah in which the thunder is mentioned, which is all Meccan— save two verses (As for those who disbelieve, disaster ceases not to strike them because of what they do, or it dwells near their home until the threat of Allah come to pass. Lo! Allah faileth not to keep the appointed time) and (they who disbelieve say: Thou art no messenger (of Allah). Say: Allah, and whoever has true knowledge of the Scripture, is sufficient witness between me and you) which are Medinan— and it consists of 45 verses, 855 words and 3,506 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { مَا كَانَ } القرآن ما ذكر فيه من القصص والأحكام { حَدِيثاً } مختلفاً { يُفْتَرَىٰ } به إلى الله افتراءً ومراءً { وَلَـٰكِن } وحي نزل من عند الله ليكون { تَصْدِيقَ ٱلَّذِي بَيْنَ يَدَيْهِ } من الكتب الإلهية\n أي: مصدقاً أحكامها وآثارها { وَتَفْصِيلَ كُلِّ شَيْءٍ } احتيج إليه في الدين من الأمور المتعلقة\n لتهذيب الظاهر والباطن { وَهُدًى } من تمسك به وعمل بما فيه أمن من اضلال { وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ } [يوسف: 111] أي: يعلمونه ويصدقون بمقتضاه\n\n\nخاتمة السورة\n\nعليك أيها المستبصر\n الخبير المسترشد\n البصير - بصَّرك الله بعيوب نفسك\n وجنبك عن غوائلها - أن تعتبر من القصة التي ذكرت في هذه السورة\n وتحترز عن المكائد المذكورة فيها والمخادعات المصرحة بها والمرموزة إليها\n وتصفي أمارة نفسك عن مبادئها وتبرئها حسب طاقتك وقدر وسعد وطاقتك وقوتك عما يؤول إليها ويؤدي نحوها\n وتشمر ذيل همتك لتهذيب ظاهرك وباطنك عما يعوقك عن سلوك طريق التوحيد المفضي إلى اضمحلال الرسوم وانقهار التعينات العدمية الأظلال الهالكة\n المؤدية إلى الكثرة والتنويه\n الحاجبة عن صرافة الوحدة الذاتية بالنسبة إلى ذوي الحجب الكثيفة والغشاوة الغليظة\n\nوعليك أن تتوجه بوجه قلبك إلى إفناء لوازم تعيناتك الباطلة\n وهوياتك العاطلة التي هي شياطين طريقك نحو الحق المنزه عن التغيير والتبديل\n المقدس عن الانقلاب والتحويل\n إذ لا يشغله شأن عن شأن\n ولا يفتره كر الدهور ومر الزمان\n بل\n[الرحمن: 29]\n و\n[الرحمن: 26]\n\n\nوبالجملة: بعدما فنيت عن وجوه تعيناتك رأساً \n يبقى وجه ربك الذي لا انقلاب له أصلاً ذو الجلال الذاتي والأزلي\n والإكرامم الأبدي السرمدي\n\n\nجعلنا الله ممن أيده الحق لسلوك طريق الفناء\n ووفقهم لإفناء ما يعقوهم عن شرف اللقاء\n إنه سميع مجيب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { لقد كان في قصصهم } أي: في قصص الأنبياء وأممهم، أو في قصة يوسف وإخوته، { عبرةٌ لأولي الألباب }: لذوي العقول الصافية الخالصة من شوائب الإلف والعادة، ومن الركون إلى الحس لأن الإخبار بهم على يد نبي أمي آية واضحة لمن تفكر بقلب خالص. { ما كان حديثاً يُفترى } أي: ما كان القرآن حديثاً مُفترىً، { ولكن } كان { تصديقَ الذي بين يديه } من الكتب الإلهية، { وتفصيلَ كل شيء } يحتاج إليه في الدارين إذ ما من أمر ديني إلا وله مستند من القرآن بوسط، أو بغير وسط. { وهُدى } من الضلال، { ورحمةً } ينال بها خير الدارين، { لقوم يؤمنون }: يصدقون به، ويتدبرون في معانيه. الإشارة: تفكر الاعتبار يشد عُروة الإيمان، وفكرة الاستبصار تشد عُروة الإحسان. قال في الحِكَم: \" الفكرة فكرتان: فكرة تصديق وإيمان، وفكرة شهود وعيان. فالأولى: لأهل التفكر والاعتبار، والثانية: لأهل الشهود والاستبصار \". ومرجع الاعتبار إلى خمسة أمور: الأول: التفكر في سرعة انصرام الدنيا وانقراضها، وذهاب أهلها. قرناً فقرنا، وجيلاً فجيلاً. فيوجب ذلك الزهد في الدنيا، والإعْراض عن زخرفها الغرارة، والتأهب للدار الباقية. الثاني: التفكر في الدار الباقية، ودوام نعيمها، أو عذابها. وذلك مرتب على السَّعْي في هذه الدار، فيوجب ذلك انتهاز الفرصة في الأعمال، واغتنام الأوقات والساعات قبل الفوات. الثالث: التفكر في النعم التي أنعم الحق ـ تعالى بها على الإنسان إما ظاهرة كالعافية في البدن، والزرق الحلال، وما يتبع ذلك مما لا يحصى قال تعالى:\n[إبراهيم: 34]. وإما باطنة: كنعمة الإسلام والإيمان، وصحيح العرفان، والاستقامة في الدين، ولا سيما إن رزقه الله من يأخذ بيده من شيخ عارف. فهذه نعمة عظمى قَلَّ من يسقط عليها. فيوجب له ذلك الشكر الذي هو أعلى المقامات، ومتكفِّل بالزيادات، قال تعالى\n[إبراهيم: 7].. ولا يعرف العبد ما عليه من النعم إلا بالتفكر في أضدادها، والنظر إلى أهل البلاء.  الرابع: التفكر في عيوبه ومساوئه، لعله يسعى في تطهيرها، أو يشتغل بها عن عيوب غيره. الخامس: التفكر فيما أظهر الله تعالى من أنواع المكونات، وضروب المصنوعات فيعرف بذلك جلالة الصانع، وعظيم قدرته، وإحاطة علمه، وحكمته. فإن اتصل بشيخ عارف غيَّبه عنها بشهود مكونها. وبالله التوفيق. وهو الهادي إلى سواء الطريق\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:44",
      "similarity": 0.4823711058503082
    },
    {
      "verse": "2:179",
      "similarity": 0.4719156807160108
    },
    {
      "verse": "79:26",
      "similarity": 0.47030749790355225
    },
    {
      "verse": "23:21",
      "similarity": 0.3918432006171318
    },
    {
      "verse": "40:54",
      "similarity": 0.355390360358762
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/12:111.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/12:111.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:111.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}