{
  "chapter": "يوسف",
  "text": "حتى اذا استيـس الرسل وظنوا۟ انهم قد كذبوا۟ جاءهم نصرنا فنجى من نشاء ولا يرد باسنا عن القوم المجرمين",
  "translations": [
    {
      "translation": "Then when the Messengers despaired and thought themselves denied, Our help came to them, and those We willed were saved. Our violent force cannot be averted from people who are evildoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the apostles despaired and thought they were made false promises, Our help arrived, and We delivered whom We pleased; but never will Our punishment be averted from the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It also happened with the earlier Messengers that for long they preached and people paid no heed) until the Messengers despaired of their people, and the people also fancied that they had been told lies (by the Messengers), then suddenly Our help came to the Messengers. And when such an occasion comes We rescue whom We will; as for the guilty, Our chastisement cannot be averted from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When at last the Messengers lost all hope of achieving success in their task and thought that everyone had called them liars, We gave them victory and saved whomever We chose to save. The guilty ones can not escape Our wrath.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the extent that when the Noble Messengers lost hope from the visible means, and the people thought that they had spoken wrongly, Our help came to them – therefore whoever We willed was saved; and Our punishment is never averted from the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They were reprieved) until, when the Messengers gave up hope and thought that they were denied, then came to them Our help, and whomsoever We willed were rescued. And Our punishment cannot be warded off from the people who are criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when the apostles despaired and the people became sure that they were indeed told a lie, Our help came to them and whom We pleased was delivered; and Our punishment is not averted from the guilty people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when the Messengers despaired, deeming they were counted liars, Our help came to them and whosoever We willed was delivered. Our might will never be turned back from the people of the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when the messengers despaired and thought that they were denied, then came unto them Our help, and whom We would was saved. And Our wrath cannot be warded from the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the messengers lost all hopes and thought that they had been told lies, Our help came to them: We saved whoever We pleased, but Our punishment will not be averted from the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Respited were they until when the apostles had despaired and imagined that they were deluded, there came unto them Our succour; then whomsoever We willed was delivered. las And Our wrath is not warded off from a people sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the apostles lost hope and they thought that they had been told lies, Our help came to them, and We delivered whomever We wished, and Our punishment will not be averted from the guilty lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Respite will be granted) until, when the messengers give up hope (of their people) and (come to) think that they were treated as liars, there reaches them Our help, and those whom We will are delivered into safety. But never will be warded off our punishment from those who are in sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They were reprieved) until, when the Messengers gave up hope and thought that they were denied (by their people), then came to them Our Help, and whomsoever We willed were delivered. And Our Punishment cannot be warded off from the people who are Mujrimun (criminals, disobedients to Allah, sinners, disbelievers, polytheists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when at length Our Messengers despaired and reckoned that they would be belied, Our help came down to them, saving whom We pleased. OurMight cannot be withheld from the guilty nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when the messengers have despaired, and thought that they were rejected, Our help came to them. We save whomever We will, and Our severity is not averted from the guilty people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They continued] until, when the messengers despaired and were certain that they had been denied, there came to them Our victory, and whoever We willed was saved. And Our punishment cannot be repelled from the people who are criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:110]   Until (hattā indicates the end [result] indicated by [the previous statement] wa-mā arsalnā min qablika illā rijālan, And We did not send before you [any messengers] save men [above, Q. 12:109]), that is, [to whom] Our support waned until, when the messengers despaired and thought, [when] the messengers were certain, that they were denied (read kudhdhibū, to mean [that they were denied] to such an extent that [they believed that] there would not be any [possible acceptance of] faith thereafter; or read kudhibū, to mean that the communities thought that their messengers had been lied to concerning the victory which they had been promised), Our help came to them and whomever We willed We delivered (read fa-nunajjī or fa-nunjī; or fa-nujjiya, as past tense, ‘[whomever We wished] was delivered’). And Our wrath, Our chastisement, cannot be averted from the sinning, the idolatrous, folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Till, when the messengers despaired) they despaired in the belief of their people (and thought) and knew and were certain, i.e. the messengers (that they) their people (were denied) the promise of the messengers; it is also said that this means: the people denied that which the messengers brought to them from Allah, 256 (then came unto them Our help) i.e. Our chastisement, destroying their people, (and whom We would was saved) i.e. the messengers and those who believed in them. (And our wrath) chastisement (cannot be warded from the guilty) from the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَتَّىٰ إِذَا ٱسْتَيْأَسَ ٱلرُّسُلُ وَظَنُّوۤاْ أَنَّهُمْ قَدْ كُذِبُواْ جَآءَهُمْ نَصْرُنَا } قال: هم أَتباعُ الرُّسلِ، الذِينَ آمنوا بِربّهم، وصَدّقُوهُ، وطَالَ عليهم البَلاءُ، واستأخرَ عنهم النَّصرُ\n حتَّى إِذا استيئس ممن كَذَّبَهم مِن قَومِهِمْ، وظَنَّتْ الرُّسلُ أَنَّ أَتباعَهُم قَد كَذَّبُوهم، جَاءَهُم نَصرُ الله عِندَ ذَلِكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن تمادوا في الغفلة والإصرار على التكذيب مدة مديدة { حَتَّىٰ إِذَا ٱسْتَيْأَسَ } وقنط { ٱلرُّسُلُ } المبعوثون إليهم بل { وَظَنُّوۤاْ } من طول الإمهال وعدم الأخذ والبطش { أَنَّهُمْ قَدْ كُذِبُواْ جَآءَهُمْ نَصْرُنَا } يقيناً، وصاروا كأنهم قد أخلف عنهم الوعد الذي وُعدوا به من جانب الحق، وبعدما أزداد بأسهم وقنوطهم، وقد جاءهم نصرنا الذي وعدناهم وعذابنا الذي قد أوعدنا به أممهم، وبعدما جاء أخذنا إياهم { فَنُجِّيَ } ونخلص { مَن نَّشَآءُ } إيمانه بنا وبرسلنا وانقياده إياهم { وَ } بالجملة: { لاَ يُرَدُّ بَأْسُنَا } الذي قد وعدنا به { عَنِ ٱلْقَوْمِ ٱلْمُجْرِمِينَ } [يوسف: 110] الذين أجرموا علينا بتكذيب رسلنا وكتبنا، وإن طالت مدة الإمهال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فإن أبيتم وكذبتم نبيكم فقد كذب من قبلكم رسلهم، وآذوهم، وتأخر نصرهم، { حتى إذا استيأس الرسل } من النصر، أو من إيمان قومهم لانهماكهم في الكفر، وتماديهم من غير وازع، { وظنوا } أي: تيقنوا { أنهم قد كذبوا } أي: أن قومهم كذبوهم فيئسوا من إيمانهم\n أو: ظنوا أن من آمن بهم قد كذبوهم لطول البلاء وتأخر النصر\n وأما قراءة كُذِبُوا بالتخفيف فمعناه: وظنوا أنهم قد كذب عليهم في وعد النصر\n\n وأنكرت عائشة ـ رضي الله عنها ـ هذه الرواية، وقالت: معاذ الله لم تكن الرسل تظن بربها ذلك\n كما في البخاري\n وقد يجاب بأن ذلك كانت خواطر وهواجس من وسواس النفس، يمر ولا يثبت، وهو من طبع البشر، لا يدخل تحت التكليف\n وسماه ظناً مبالغة في طلب المراقبة، كما تقدم في قوله: { ولقد همت به وهم بها }\n وقال ابن جزي، على هذه القراءة: الضميران يعودان على المرسل إليهم، أي: ظن الأتباع أن الرسل قد كذبوا عليهم في دعوى الرسالة، أو في مجيء النصر لما اشتد عليهم البلاء، وتأخر عنهم النصر\n فلما يئسوا { جاءهم نصرنا فنُجَّي من نشاء } نجاته: وهو: النبي والمؤمنون\n وإنما لم يعينهم للدلالة على أنهم الذين يستأهلون نجاتهم بالمشيئة القديمة، لا يشاركهم فيها غيرهم، { ولا يُردُّ بأسُنا عن القوم المجرمين } إذا نزل بهم\n وفيه بيان المستثنين بالمشيئة، كأنه قال: ولا نشاء نجاة المجرمين\n الإشارة: قد وجد كثير من الأولياء بالمدن والحواضر، وكثير منهم في القرى والمداشر\n وفضل الله يؤتيه من يشاء، لا يختص بمكان ولا زمان، غير أن جلهم جمعوا بين علم المدن وتفرغ البوادي، يعني: جمعوا بين شريعة المدن وحقيقة البوادي لأن أهل المدن شريعتهم قوية، وحقيقتهم ضعيفة\n والبوادي بالعكس لكثرة العلائق في المدن وخفتها في البوادي، والحقيقة تحتاج إلى تفرغ كبير وتفكر كثير، والله تعالى أعلم\n  وقوله تعالى: { وظنوا أنهم قد كذبوا } بالتخفيف، معناه: أنهم لم يقفوا مع ظاهر الوعد لسعة علمهم لأن ذلك الوعد قد يكون في علم الغيب متوقفاً على شروط خفية لا يعلمها ذلك النبي أو الولي، ليتحقق انفراده تعالى بالعلم الحقيقي، والقهرية الغالبة\n فلذلك كان العارفون لا يزول اضطرارهم، ولا يكون مع غير الله قرارهم\n  وقال الورتجبي: إنهم استغرقوا في قلْزُوم الأزلية، وغابوا تحت بحار الديمومية، ولم يروا الحق من كمال استغراقهم في الحق\n فلما لم يروه ناداهم لسان غيْره قهر القدم: أين أنتم؟ غبتم عنه وعن الحقيقة، فتطُلع أنوار الحقيقة عليهم، ويأخذ لطفها عن شبكات امتحان القهر\n\n\nوهذا دأب الحق مع الأنبياء والأولياء حتى لا يسكنوا إلى ما وجدوا منه، بل يفنوا به عن كل ماله إليهم\n هـ\n  قال المحشي الفاسي: وحاصل ما أشار إليه: أن قراءة التخفيف تشير إلى أخذهم عن الوقوف مع الوعد، والسكون إليه، غيبةً في الحق عن مقتضى وعده، لا تكذيباً لوعده، بل ذلك احوالٌ غالبة آخذة عن الصفة، غيبةً في الموصوف\n وهذا حال الصوفي كما يعرف ذلك أهله\n وهو صحيح في نفسه ولكنه بعيد عن مرمى الآية فإن صاحب الغيبة لا يوصف بظن خلاف الوعد، وإن كان غائباً عنه\n وأقرب منه ما ذكره الترمذي الحكيم: من أن ذلك كان لظن فقد شرط في الموعود أوجب عدَم القطع لوقوع الوعد\n والله أعلم\n وقد قال في الحِكم: \" لا يشككنك في الوعد عدم وقوع الموعود، وإن تعين زمنه \"\n يعني أنه قد يتخلف لفقد شرط كما في قضية الجرْو الذي تخلف جبريل من أجله\n أو لعدم تحقيق الوقت لأن تعيينه كان من قبل أنفسهم من غير وحي، فلما تأخر ظنوا ذلك بأنفسهم\n والله تعالى أعلم\n هـ\n  والحاصل: أن الرسل ـ عليهم الصلاة والسلام ـ لما تأخر عنهم النصر هجس في أنفسهم تخلف الوعد خوفاً أن يكون متوقفاً على شرط لم يعلموه، أو جعلوا له وقتاً فهموه من أمارات، فلما تأخر عنه ظنوا أنه قد تخلف\n وأما قضية الجرو الذي أشار إليهم: فكان جبريل عليه السلام وعد نبينا صلى الله عليه وسلم أن يأتيه في وقت مخصوص، فدخل جرو البيت، فلم ينزل في ذلك الوقت، فلما نزل بعد ذلك، قال:\n\n \" إنما تَخلَّفْنَا عن الوقت لأَنَّ الملائكة لا تَدخلُ بَيْتاً فيه كَلْبٌ \" \n\nكما في الصحيح\n ثم قال تعالى: { لَقَدْ كَانَ فِي قَصَصِهِمْ عِبْرَةٌ لأُوْلِي ٱلأَلْبَابِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:23",
      "similarity": 0.5477620561425037
    },
    {
      "verse": "11:9",
      "similarity": 0.4842248970721614
    },
    {
      "verse": "60:13",
      "similarity": 0.3754966377591558
    },
    {
      "verse": "6:147",
      "similarity": 0.36457971210826046
    },
    {
      "verse": "12:87",
      "similarity": 0.33111390479199804
    }
  ]
}