{
  "chapter": "يوسف",
  "text": "وما يؤمن اكثرهم بالله الا وهم مشركون",
  "translations": [
    {
      "translation": "Not only do they not believe in God, but also associate others with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them believe in Allah only when they associate others with Him in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of them do not believe in God; they are but pagans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them are such that they do not believe in Allah except while ascribing partners (to Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them believe not in Allah except that they attribute partners unto Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them do not believe in Allah without associating others (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the most part of them believe not in God, but they associate other gods with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them believe not in Allah except that they attribute partners (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and most of them, even when they profess belief in God, attribute partners to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them believe not in Allah except as they are associators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them do not believe in Allah without ascribing partners to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them believe not in Allah without associating (other as partners) with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them believe not in Allah except that they attribute partners unto Him [i.e. they are Mushrikun -polytheists - see Verse 6:121].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them do not believe in Allah, but they associate others with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them do not believe in God unless they associate others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most of them believe not in Allah except while they associate others with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:106] And most of them do not believe in God, such that they might affirm that He is the Creator and the Sustainer, without ascribing partners, to Him, by worshipping idols; which is why, when crying their [ritual] response to God, they used to say: ‘At Your service, no partner have You, save a partner that belongs to You; You possess him and all that he possesses’, meaning it [when they said it].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And most of them) the people of Mecca (believe not in Allah) deep in their hearts; it is also said that this means: they do not believe in the worship of Allah (except that they attribute partners (unto Him)) openly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِٱللَّهِ إِلاَّ وَهُمْ مُّشْرِكُونَ } قال زيدُ بن علي عليهما السَّلامُ: هم قَومٌ شَبَّهوا الله بِخَلقِهِ، فأَشْرَكُوا مِنْ حَيثُ لاَ يَعلمُونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لذلك { مَا يُؤْمِنُ } ويوقن { أَكْثَرُهُمْ بِٱللَّهِ } المستغني في ذته عن جميع المظاهر، المستقل بوجوده بحيث لا وجود لغيره أصلاً { إِلاَّ وَهُمْ مُّشْرِكُونَ } [يوسف: 106] مشتركون من مصنوعاته في استحقاق العبادة ما لا وجود له في نفسه أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما يؤمن أكثرُهُم بالله } أي: وما يصدق أكثرهم بوجود الله في إقرارهم، بوجوده، وخالقيته للأشياء، وأنه الرزّاق المميت\n { إلا وهم مشركون } بعبادة الأصنام، أو باتخاذ الأحبار والرهبان أرباباً، أو بنسبة التبني إليه، أو الوقوف مع الأسباب، أو غير ذلك من أنواع الشرك الجلي والرهبان أرباباً، أو بنسبة التبني إليه، أو بالوقوف مع الأسباب، أو غير ذلك من أنواع الشرك والجلي والخفي\n قيل: نزلت في مشركي مكة، وكانوا يقولون في تلبيتهم: لبيك لا شريك لك إلا شريكاً تملكه وما ملك: وقيل: في أهل الكتاب",
      "translations": []
    }
  ]
}