{
  "chapter": "يوسف",
  "text": "قال انى ليحزننى ان تذهبوا۟ به واخاف ان ياكله الذئب وانتم عنه غفلون",
  "translations": [
    {
      "translation": "He said, 'It grieves me to let him go with you I fear a wolf might come and eat him up while you are heedless, not attending him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I am afraid of sending him with you lest a wolf should devour him when you are unmindful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their father answered: \"It grieves me indeed that you should take him with you for I fear that some wolf might eat him up while you are negligent of him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jacob replied, \"I shall be grieved if you take him with you; I fear that some wild-beast will harm him in your absence.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I will indeed be saddened by your taking him away, and I fear that the wolf may devour him, whilst you are unaware of him.” (* Prophet Yaqub knew of what was about to happen.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Ya`qub) said: \"Truly, it saddens me that you should take him away. I fear lest a wolf should devour him, while you are careless of him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Surely it grieves me that you should take him off, and I fear lest the wolf devour him while you are heedless of him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'It grieves me that you should go with him, and I fear the wolf may eat him, while you are heedless of him.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Lo! in truth it saddens me that ye should take him with you, and I fear less the wolf devour him while ye are heedless of him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Jacob] said, \"It would indeed grieve me if you took him away with you, and I fear lest the wolf should devour him while you are off your guard.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: verily it grieveth me that ye should take him away, and I fear lest a wolf may devour him, While ye are negligent of him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘It really upsets me that you should take him away, and I fear the wolf may eat him while you are oblivious of him.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Jacob) said: \"Really it saddens me that ye should take him away: I fear lest the wolf should devour him while ye attend not to him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Ya'qub (Jacob)] said: \"Truly, it saddens me that you should take him away. I fear lest a wolf should devour him, while you are careless of him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'It grieves me to let him go with you, for I fear lest the wolf should devour him when you are not paying attention to him'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “It worries me that you would take him away. And I fear the wolf may eat him while you are careless of him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Jacob] said, \"Indeed, it saddens me that you should take him, and I fear that a wolf would eat him while you are of him unaware.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:13]   He said, ‘Lo! It grieves me that you should go with him, that is, your departure [with him grieves me], because I would be separated from him, and I fear lest the wolf devour him (al-dhi’b here represents the genus, for their land had many wolves in it), while you are heedless of him’, distracted [by something else].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) their father said: (Lo! in truth it saddens me that ye should take him with you) such that I do not see him, (and I fear lest the wolf devour him) because he saw in his dream a wolf attacking Joseph (while ye are heedless of him) while you are busy with playing; it is also said that this means: while you are busy with your chores. 243\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما بغالوا وألحوا { قَالَ } أبوهم: { إِنِّي } من شدة محبتي وشوقي إليه، وتحنني وعطفي نحوه { لَيَحْزُنُنِيۤ } مفارقته { أَن تَذْهَبُواْ بِهِ } مع ذلك { وَأَخَافُ أَن يَأْكُلَهُ ٱلذِّئْبُ } لأن ارضنا مذئبة { وَأَنْتُمْ } لشدة شغلكم على الرتع واللعب { عَنْهُ غَافِلُونَ } [يوسف: 13] حينئذٍ، ذاهلون من حضانته وحفظه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}