{
  "chapter": "يوسف",
  "text": "فلما ذهبوا۟ به واجمعوا۟ ان يجعلوه فى غيبت الجب واوحينا اليه لتنبئنهم بامرهم هذا وهم لا يشعرون",
  "translations": [
    {
      "translation": "But when, in fact, they did go out with him and gathered all together and agreed to put him at the bottom of the well, We then revealed to him that: 'You will inform them of this deed they perpetrate at a time when they are totally unaware.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they took him out they planned to throw him into an unused well. We revealed to Joseph: \"You will tell them (one day) of this deed when they will not apprehend it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they went away with Joseph and decided to cast him in the bottom of the dark pit, We revealed to Joseph: \"Surely a time will come when you will remind them of their deed. They know nothing about the consequence of what they are doing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they took Joseph with them, they agreed to throw him into the well. We revealed to Joseph that (sometime) in the future at a time when they would not recognize him, he would remind them of all this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they took him away – and all of them agreed that they should drop him in the dark well; and We sent the divine revelation to him, “You will surely tell them of their deed at a time when they will not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they took him away, they all agreed to throw him down to the bottom of the well, and We revealed to him: \"Indeed, you shall (one day) inform them of this their affair, when they know (you) not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they had gone off with him and agreed that they should put him down at the bottom of the pit, and We revealed to him: You will most certainly inform them of this their affair while they do not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they went with him, and agreed to put him in the bottom of the well, and We revealed to him, 'Thou shalt tell them of this their doing when they are unaware.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they led him off, and were of one mind that they should place him in the depth of the pit, We inspired in him: Thou wilt tell them of this deed of theirs when they know (thee) not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so, when they went away with him, they decided to cast him into the dark depths of a well. Then We revealed to him Our will, \"You shall [one day] tell them of this deed of theirs, when they do not realize who you are.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they took him away, and resolved to place him in the bottom of the well, We Revealed unto him: surely thou wilt declare unto them this their affair, while they shall perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they took him away and conspired to put him into the recess of a well, We revealed to him, ‘[A day will come when] you will surely inform them about this affair of theirs while they are not aware [of your identity].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they did take him away, and they all agreed to throw him down to the bottom of the well: and We put into his heart (this Message): 'Of a surety thou shalt (one day) tell them the truth of this their affair while they know (thee) not'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they took him away, they all agreed to throw him down to the bottom of the well, and We inspired in him:\"Indeed, you shall (one day) inform them of this their affair, when they know (you) not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they went with him, they agreed to put him in the bottom of a well. We revealed to him: 'You shall tell them of what they did when they are not aware (it is you)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they went away with him, and agreed to put him at the bottom of the well. And We inspired him, “You will inform them of this deed of theirs when they are unaware.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they took him [out] and agreed to put him into the bottom of the well... But We inspired to him, \"You will surely inform them [someday] about this affair of theirs while they do not perceive [your identity].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:15] So when they went off with him, and agreed, resolved, to put him into the bottom of the well (the response of lammā, ‘when’, has been omitted, in other words [understand it as being] fa‘alū dhālika, ‘they did [just] that’) by taking off his shirt — after having beaten him, humiliated him and desiring to kill him — and lowering him in a bucket [into the well]. When he reached half-way down the well, they flung him [from the bucket] so that he would [fall and] die, but he fell into the water and took refuge near a rock. They then called to him and he responded, thinking that they had [decided to have] mercy on him. They then wanted to smash his head with a rock, but Judah prevented them. And We revealed to him, in the well, through true revelation (wahy haqīqa) — he was 17 years of age or just under — in order to reassure his heart: ‘Truly you shall inform them, after this day, of this affair, [this] deed, of theirs when they are unaware’, of [who] you [are] (wa-hum lā yash‘urūna is a circumstantial qualifier referring to the action of ‘informing’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, when they led him off) after Jacob gave them permission to take him, (and were of one mind that they should place him in the depth of the pit) and they were unanimous about throwing him into the depth of the pit, (We inspired in him) We sent to him Gabriel to inform him; it is also said this means: We directly inspired him: (Thou wilt tell them) you will inform them, Joseph, (of this deed of theirs) of this act of theirs (when they know (thee) not) when they do not realise that it is you, Joseph, until you inform them of your identity; it is also said that this means: they know not our inspiration to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا } احتالوا وبالغوا في الحيلة والمكر إلى أن { ذَهَبُواْ بِهِ } أي: بيوسف إلى الصحراء\n فاشتغلوا بضربه وشتمه والقهر عليه وأنواع العذاب والعقاب\n وكادوا أن يقتلوه ظلماً وزوراً\n قال لهم يهوذا: أنتم عهدتم ألا تقتلوه\n فما هذه المبالغة ةالاشتداد\n أمَا تستحيون من الله؟ { وَ } بعدما قال لهم يهوذا هذا { أَجْمَعُوۤاْ } واتفقوا { أَن يَجْعَلُوهُ } ويطرحوه { فِي غَيَٰبَتِ ٱلْجُبِّ } وهو جب معروف مشهور بجب يوسف\n على ثلاثة أميال من صفد يعقوب\n قريب من جسر يقال له: جسر يعقوب بفرسخ تقريباً\n فقربوه على الجب وعزموا إلقاءه فيها\n فتعلق وسف بشفير البئر\n فربطوا يديه ونزعوا عنه قميصه\n ليطلخوه بالدم لكذب\n فألقوه مربوطة يديه على الماء وكان فيها صخرة عظيمة جلس عليها عرياناً قلقاً\n حائراً\n حزناً\n مصطرباً\n مستوحشاً { وَ } بعدما ألقوه وقضوا الطر أزلنا عنه وحشته وكربه بأن { أَوْحَيْنَآ } من مقام لطفنا وجودنا { إِلَيْهِ }: لا تغتم أيها الصديق من صنيع هؤلاء الغواة الهالكين في تيه الحسد والعناد\n إنَّا بمقتضى كرمنا وأحساننا لنفضلك عليه ونمكنك على انتقامهم إلى حيث { لَتُنَبِّئَنَّهُمْ } وتحدثنهم معاتباً عليه\n منتقماً منهم { بِأَمْرِهِمْ هَـٰذَا } معك وحيلتهم ومكرهم مع أبيك { وَهُمْ } في تلك الحالة { لاَ يَشْعُرُونَ } [يوسف: 15] أنك يوسف\n لعلو شأنك وارتفاع قدرك وسلطانك\n اصبر أيها الصديق على أذاهم في الحال\n فإن لك السلطنة والسطوة عليهم في المآل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: لمّا حرف وجود لوجود\n يطلب الشرط والجواب\n وجوابها هنا محذوف\n أي: فعلوا به ما فعلوا\n وقيل: جوابها: أجمعوا\n وقيل: أوحينا على زيادة الواو فيهما\n وجملة: وهم لا يشعرون: حال من تنبئنهم\n فيكون خطاباً ليوسف عليه السلام\n أو من أوحينا أي: وهم لا يشعرون حين أوحينا إليه\n فيكون حينئذٍ الخطاب لسيدنا محمد صلى الله عليه وسلم\n وصبر جميل: مبتدأ\n والخبر محذوف\n أي: مثل\n أو: خبر عن مبتدأ\n أي: أمري صبر جميل\n وعلى قميصه: في موضع نصب على الظرف\n أي: فوق قيمصه\n أو: حال من الدم إن جوز تقديمها على المجرور\n يقول الحق جل جلاله: فلما ذهبوا بيوسف معهم { وأجْمَعُوا } أي: عزموا { أن يجعلوه في غيابات الجُبِّ } وهو بئر بأرض الأردن\n أو بين مصر ومدين\n أو على ثلاثة فراسخ من مقام يعقوب\n  قال الفراء: كان حفره شداد بن عاد\n فانظره\n قال السدي: ذهبوا بيوسف وبه عليهم كرامة\n فلما برزوا في البرية أظهروا له العداوة\n وجعل أخوه يضربه فيستغيث بالآخر فيضربه\n فجعل لا يرى منهم رحيماً\n فضربوه حتى كادوا يقتلونه\n فجعل يصيح: يا أبتاه\n يا يعقوب\n لو تعلم ما صنع بابنك بنو الإماء\n هـ\n وكان إخوته سبعة من خالته الحرة\n والباقون من سريتين له\n كما تقدم\n  وقال ابن عباس رضي الله عنه: كان يعقوب عليه السلام ينظر إلى يوسف عليه السلام حتى غاب عنه\n وعن نظره\n فلما علموا أنهم غيبوه عنه\n وضعوه في الأرض وجروه عليها\n ولطموا خده\n فجرد شمعون سكينه وأراد ذبحه\n فتعلق بذيل روبيل وضربه\n وكذلك جيمع إخواته إذا لجأ لواحد منهم طرده\n فضحك عند ذلك يوسف عليه السلام فقال له يهوذا: ليس هذا موضع الضحك يا يوسف\n فقال: من تعزز بغير الله ذل\n ظننت أنه لا يصيبني وأنا بينكم مكروه لما رأيت من قوتكم وشدتكم\n فسلطكم الله علي بشؤم تلك الفكرة حتى لا يكون التوكل إلا عليه والتعزز إلا به\n هـ\n بالمعنى\n  وقال الفراء: كانت زينب بنت يعقوب عليه السلام ـ أخت يوسف ـ وكانت رأت في منامها كان يوسف وضع بين الذئاب وهم ينهشون\n فانتبهت فازعة\n ومضت إلى أبيها باكية\n فقالت: يا أبت\n أين أخي يوسف؟ قال: أسلمته إلى إخواته\n فمضت خلفه حتى لحقت به\n فأمسكته\n وتعلقت بذيله\n وقالت: لا أفارقك اليوم يا أخي أبداً\n فقال لها إخوتها: يا زينب\n أرسليه من يدك\n فقالت: لا أفعل ذلك أبداً لأني لا أطيق فراق أخي\n فقالوا: بالعشي نرده إليك ويأتيك\n ثم أقبل يوسف عليه السلام يقبل رأسها ويديها\n ويقول لها: يا أختاه دعيني أسير مع إخوتي أرتع وألعب\n فذهب\n وجلست تشيعه بعينها\n ودموعها تتناثر مما رأت خوفاً عليه\n\nهـ\n  فلما غابوا به عنها فعلوا به ما تقدم\n وهموا بقتله\n فقال لهم يهوذا: أما عاهدتمُوني ألا تقتلوه فأتوا به إلى البئر فدلوه فيها فتعلق بشفيرها\n فربطوا يده\n ونزعوا قميصه ليلطخوه بالدم\n ويحتالوا به على أبيهم\n فقال: يا إخوتاه رُدّوا عليّ قميصي أتوارى به\n فقالوا: ادعُ الأحد عشر كوكباً والشمس والقمرَ يلبسوك ويؤنسوك\n فلما بلغ نصفها ألقوه\n وكان فيها ماء\n فسقط\n ثم آوى إلى الصخرة كانت فيها فقام عليها يبكي\n فجاءه جبريل بالوحي\n كما قال: { وأوحينا إليه\n\n\n } الخ\n وكان ابن سبع عشرة سنة\n وقيل: كان مراهقاً\n وقال ابن عطية: كان ابن سبع سنين\n وأوحي إليه في صغره كما أوحي إلى يحيى وعيسى ـ عليهما السلام ـ\n وفي القَصَص: أن إبراهيم عليه السلام\n حين ألقي في النار\n جُرد من ثيابه\n فأتاه جبريل بقميص من حرير الجنة فألبسه إياه\n فدفعه إبراهيم إلى إسحاق\n وإسحاق إلى يعقوب\n فجعله في تميمة علقها على يوسف\n فأخرجه جبريل وألبسه يوسف\n  ثم قال له فيما أوحي إليه: { لتنبئنهم } أي: لتحدثنهم { بأمرهم هذا } بما فعلوا بك\n { وهم لا يشعرون } أنك يوسف\n لعلو شأنك وبعده عن أوهامهم\n وطول العهد المغير للحال والهيئات\n وذلك إشارة إلى ما قال لهم بمصر\n حين دخلوا عليه ممتارين\n فعرفهم وهم له منكرون\n إلى أن قال لهم:\n[يوسف: 89]\n وفي رواية: أوحى إليه: يا يوسف لا تحزن على ما أصابك\n فإنك تصل إلى ملك كبير\n ويقف إخوتك بين يديك\n بشره بما يؤول إليه أمره\n أيناساً وتطبيباً لقلبه\n وقيل: { وهم لا يشعرون } متصل بقوله: { وأوحينا } أي: آنسناه بالوحي وهم لا يشعرون ذلك\n  { وجاؤوا أباهم عِشَاءَ } آخر النهار\n وقرئ { عُشي } بضم العين والقصر\n جمع أعشى\n أي: عُشي من البكاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:10",
      "similarity": 0.5916026737166923
    },
    {
      "verse": "12:102",
      "similarity": 0.14017266688580735
    },
    {
      "verse": "11:49",
      "similarity": 0.1277390976862946
    },
    {
      "verse": "17:86",
      "similarity": 0.1177307499917543
    },
    {
      "verse": "27:65",
      "similarity": 0.1028600792554624
    }
  ]
}