{
  "chapter": "يوسف",
  "text": "ذلك من انۢباء الغيب نوحيه اليك وما كنت لديهم اذ اجمعوا۟ امرهم وهم يمكرون",
  "translations": [
    {
      "translation": "This is news of the Unseen which We reveal to you. You were not with them when they decided what to do and devised their scheme.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is news of the unknown We reveal to you, for you were not present when Joseph's brothers agreed on their course of action, and devised their plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), this is part of news from the Unseen that We reveal to you for you were not present with them when Joseph's brothers jointly resolved on a plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is some of the news of the unseen which We reveal to you, (Muhammad). You were not with them when Joseph's brothers agreed on devising their evil plans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are some tidings of the Hidden which We divinely reveal to you (O dear Prophet Mohammed – peace and blessings be upon him); and you were not with them when they set their task and when they were scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is of the news of the Ghayb (Unseen) which We reveal to you. You were not (present) with them when they arranged their plan together, and (while) they were plotting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the announcements relating to the unseen (which) We reveal to you, and you were not with them when they resolved upon their affair, and they were devising plans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is of the tidings of the Unseen that We reveal to thee; thou wast not with them when they agreed upon their plan, devising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the tidings of the Unseen which We inspire in thee (Muhammad). Thou wast not present with them when they fixed their plan and they were scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are tidings of the unseen that We reveal to you, [O Prophet], though you were not present with them when they plotted and agreed upon a plan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the tidings of the unseen, which We reveal unto thee; nor wast thou with them when they resolved on their affair while they were plotting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are accounts from the Unseen, which We reveal to you, and you were not with them when they conspired together and schemed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is one of the stories of what happened unseen, which We reveal by inspiration unto thee; nor wast thou (present) with them then when they concerted their plans together in the process of weaving their plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of the news of the Ghaib (unseen) which We reveal by Inspiration to you (O Muhammad SAW). You were not (present) with them when they arranged their plan together, and (also, while) they were plotting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is of the news We reveal to you of the unseen. You were not present when they agreed upon their plan, scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is news from the past that We reveal to you. You were not present with them when they plotted and agreed on a plan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is from the news of the unseen which We reveal, [O Muhammad], to you. And you were not with them when they put together their plan while they conspired.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:102]   That, which is mentioned of the matter of Joseph, is of the tidings, the tales, of the Unseen, what has been hidden from you O Muhammad (s), which We reveal to you; for you were not with them, with Joseph’s brothers, when they agreed upon their plan, to plot against him, that is, [when] they resolved upon it, and schemed, against him; in other words, you were not present among them to know their story and so tell it to others: knowledge of it has come to you through revelation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This) that which I mentioned to you, Muhammad, of the story of Joseph and his brothers (is of the tidings of the Unseen) of the events which were hidden from you (which We inspire in thee (Muhammad)) with which We send Gabriel to you. (Thou wast not present with them when they bed their plan) when they agreed to throw Joseph in the well (and they were scheming) they were intending by this the peril of 255 Joseph.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } المذكور من قصة يوسف وما جرى بينه وبين إخوته وبين امرأة العزيز وغير ذلك من الوقائع الهائلة\n الواقعة على يوسف وعلى أبيه وأخيه من حسد إخوتهما { مِنْ أَنْبَآءِ ٱلْغَيْبِ } أي: من الإخبارات التي سترت عنك يا أكمل الرسل { نُوحِيهِ إِلَيْكَ } إي: نعلمك بالوحي والإلهام\n ومحقق مسلَّم عند ذوي العقول { وَمَا كُنتَ لَدَيْهِمْ } وعندهم وفي جمعهم وقت { إِذْ أَجْمَعُوۤاْ أَمْرَهُمْ وَهُمْ يَمْكُرُونَ } [يوسف: 102] أي: يقصدون المكر والخداع مع يوسف وأبيه\n بعدما شاوروا كثيراً من إهلاك يوسف وإبعاده من عند أبيه واستقرار رأيهم بد تكرر المشاورة على ما فعلوا به واتفقوا عليه\n وما أنت أيضاً من أهل الإملاء والنسخ أن تضبط قصصهم من التواريخ\n ولا من أهل التعلم المستفيد من الغير\n بل ما هو إلا وحي يوحى إليك من عندنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ذلك: مبتدأ\n ومن أنباء الغيب: خبر\n ونوحيه: حال\n يقول الحق جل جلاله: ذلك أي: خبر يوسف وقصته\n هو { من أنباء } أخبار { الغيب } التي لم يكن لك بها علم\n وإنما عَلِمْتَه بالوحي الذي { نُوحيه إليك } فأخبرتهم به\n { وما كنت لديهم } أي: وما حضرت عندهم\n { إذ أجمعوا أمرَهم }: حين عزموا أمرهم على أن يجعلوه في غَيَِابَةِ الجب\n { وهم يمكرون } به\n وبأبيه ليرسله معهم\n ومن المعلوم الذي لا يخفى على مكذبيك أنك ما لقيت أحداً من الأحبار فتعلمت ذلك منه\n فتحققوا أنه وحي من عند الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:35",
      "similarity": 0.44552717738207753
    },
    {
      "verse": "3:54",
      "similarity": 0.43891657291526914
    },
    {
      "verse": "36:32",
      "similarity": 0.43729589710144273
    },
    {
      "verse": "71:22",
      "similarity": 0.43616586584183525
    },
    {
      "verse": "50:29",
      "similarity": 0.42080379659633366
    }
  ]
}