{
  "chapter": "يوسف",
  "text": "قل هذه سبيلى ادعوا۟ الى الله على بصيرة انا۠ ومن اتبعنى وسبحن الله وما انا۠ من المشركين",
  "translations": [
    {
      "translation": "Say: This is my way. I call to Allah with inner sight, I and all who follow me. Glory be to Allah! I am not one of the idolaters!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"My way, and that of my followers, is to call you to God with full perception. All glory to God, I am not an idolater.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them plainly: \"This is my way: I call you to Allah, on the basis of clear perception - both I and those who follow me. Allah - Glory be to Him - is free of every imperfection. I have nothing to do with those who associate others with Allah in His Divinity.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"This is my way. I and all my followers invite you to God with proper understanding. God is most Glorious. I am not a pagan.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “This is my path – I call towards Allah; I, and whoever follows me, are upon perception; and Purity is to Allah – and I am not of the polytheists.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say \"This is my way; I invite unto Allah with sure knowledge, I and whosoever follows me. And Glorified and Exalted be Allah. And I am not of the idolators.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: This is my way: I call to Allah, I and those who follow me being certain, and glory be to Allah, and I am not one of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'This is my way. I call to God with sure knowledge, I and whoever follows after me. To God be glory! And I am not among the idolaters.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: This is my Way: I call on Allah with sure knowledge. I and whosoever followeth me - Glory be to Allah! - and I am not of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"This is my way; on the basis of sure knowledge, I call on you to have faith in God, I and those who follow me. God is Holy; I am not one of those who associate partners with God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: this is my way: I call unto Allah resting upon an insight---I, and whosoever followeth me. Hallowed be Allah: and I am not of the associators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘This is my way. I summon to Allah with insight—I and he who follows me. Immaculate is Allah, and I am not one of the polytheists.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: \"This is my way: I do invite unto Allah,- on evidence clear as the seeing with one's eyes,- I and whoever follows me. Glory to Allah! and never will I join gods with Allah!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"This is my way; I invite unto Allah (i.e. to the Oneness of Allah - Islamic Monotheism) with sure knowledge, I and whosoever follows me (also must invite others to Allah i.e. to the Oneness of Allah - Islamic Monotheism) with sure knowledge. And Glorified and Exalted be Allah (above all that they associate as partners with Him). And I am not of the Mushrikun (polytheists, pagans, idolaters and disbelievers in the Oneness of Allah; those who worship others along with Allah or set up rivals or partners to Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'This is my Path. I call to Allah with sure knowledge, I and my followers. Exaltations be to Allah! I am not among the idolaters'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “This is my way; I invite to God, based on clear knowledge—I and whoever follows me. Glory be to God; and I am not of the polytheists.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"This is my way; I invite to Allah with insight, I and those who follow me. And exalted is Allah; and I am not of those who associate others with Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:108] Say, to them: ‘This is my way — which He explains by saying: I call to, the religion of, God, being upon sure knowledge, plain proof, I and whoever follows me, [whoever] believes in me (man ittaba‘anī is a supplement to anā, ‘I’, the subject, predicated by what preceded [sc. ‘being upon sure knowledge’]). So Glory be to God!, [in affirmation] of His being exalted high above having partners, and I am not of the idolaters’ — this [sentence] is also subsumed by the [explanation of] his statement about ‘his way’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) O Muhammad to the people of Mecca: (This) the religion of Abraham (is my Way) my religion: (I call on Allah with sure knowledge) with a firm religion and exposition, (I) call on Allah (and whosoever followeth me) they believe in me and also call on Allah with sure knowledge. (Glory be to Allah!) he exonerates Allah from having a son or partner (And am not of the idolaters) I am not with the idolaters in following their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُلْ هَـٰذِهِ سَبِيلِيۤ } معناه دَعْوَتِي\n\n\n\n\nوقوله تعالى: { عَلَىٰ بَصِيرَةٍ } معناه عَلَى يَقينٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Say, 'This is my way,'\" means my invitation.\n\n\nAnd His saying, \"Upon a clear vision.\" Its meaning is \"upon certainty.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قُلْ هذه } السبيل التي أسلكها\n وهي سبيل توحيد الذات { سبيلي } المخصوص بي\n ليس عليه إلا أنا وحدي { أدعو إلى } الذات الأحدية الموصوفة بكل الصفات في عين الجمع { أنا ومن اتّبعني } في هذه السبيل وكل من يدعو إلى هذه السبيل فهو من أتباعي\n إذ الأنبياء قبلي كلهم كانوا داعين إلى المبدأ والمعاد وإلى الذات الواحدية الموصوفة ببعض الصفات إلا إبراهيم عليه السلام فإنه قطب التوحيد\n ولهذا كان صلى الله عليه وسلم من أتباعه باعتبار الجمع دون التفصيل\n إذ لا متمم لتفاصيل الصفات إلا هو عليه الصلاة والسلام وإلا لكان غيره خاتماً السبيل الحق كما ختم لأن كل أحد لا يمكنه الدعوة إلا إلى المقام الذي بلغ إليه من الكمال { وسبحان الله } أنزهه من أن يكون غيره على سبيله\n بل هو السالك سبيله والداعي إلى ذاته { وما أنا من المشركين } المثبتين للغير في مقام التوحيد الذاتي\n المحتجبين عنه بالأنائية\n بل أنا به\n فإن عنى فهو الداعي إلى سبيله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأنا بُعثت لأجلها { أَدْعُو إِلَىٰ ٱللَّهِ } أي: إلى توحيد كافة عباده { عَلَىٰ بَصِيرَةٍ } تامة فائضة عليَّ من عنده سبحانه { أَنَاْ } أي: أدعو أنا لمقتضى الوحي والإلهام { وَمَنِ ٱتَّبَعَنِي } من خيار أمني بوسيلة إرشادي وإهدائي إليهم { وَسُبْحَانَ ٱللَّهِ } أي: أنزهه تنزيهاً تاماً عن معتقدات أهل الزيغ والضلال في حقه سبحانه { وَمَآ أَنَاْ مِنَ ٱلْمُشْرِكِينَ } [يوسف: 108] أي: أبرئ نفسي عما هم عليه من الشرك المنافي للتوحيد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: أدعوا: حال من الياء. وعلى بصيرة: حال ثان، وأنا ومن اتبعني: الضمير ـ تأكيد للمستكن في أدعو، أو في على بصيرة، أو مبتدأ خبره: على بصيرة، مقدم. يقول الحق جل جلاله: { قل } يا محمد: { هذه سبيلي }: طريقي الذي جئتُ به من عند ربي وهي الدعوة إلى التوحيد، والتاهب ليوم المعاد. ثم فسرها بقوله: { أدعو إلى الله } ، أول حال كوني داعياً إلى الله، أي: إلى توحيده ومعرفته والأدب معه، { على بصيرة }: حجة واضحة، وبينة من ربي، لا عن تقليد أو عمى. أدعو إلى الله { أنا ومن اتبعني } فمن كان على قدمي فهو يدعو أيضاً إلى الله علي بصيرة وبينة من ربه، { وسبحان الله }: وأنزهه عن الشركاء والأنداد، { وما أنا من المشركين } به شركاً جلياً ولا خفياً، بل مخلصاً موحداً. الإشارة: لا يصلح العبد أن يكون داعياً إلى الله حتى يكون على بصيرة من ربه، بحيث لا يبقى فيه تقليد بحت، ولا يختلجه شك ولا هم. والدعاة إلى الله على ثلاث مراتب: فمنهم من يدعو على بصيرة الإسلام وهم الدعاة إلى معرفة أحكام الله وشرائعه، ومنهم من يدعو على بصيرة الإيمان، وهم الدعاة إلى معرفة صفات الله تعالى وكمالاته، ومعرفة ما يجب له تعالى وما يستحيل وما يجوز على طريق البرهان الواضح. ومنهم من يدعو إلى الله على بصيرة الإحسان، وهم الدعاة إلى معرفة الذات العلية على نعت الشهود والعيان، من طريق الذوق والوجدان وهم العارفون بالله، أهل النور المخرق، بحيث كل من واجههم خرق النور إلى باطنه. وهذه الدعوة الحقيقية والبصيرة النافذة، وأهل هذا المقام هم اهل التربية النبوية، فدعوة هؤلاء أكثر نفعاً، وأنجح تأثيراً في زمن يسير يهدي الله على أيديهم الجم الغفير. قال في نوادر الأصول: الداعي إلى الله على بصيرة ـ أي معاينة ـ هو الذي قلبه عند الله، وعلى بصيرة في الطريق، ومحل القلوب في تلك المراتب ناطقاً بالله، عن الله، فلذلك يلج آذان المستمعين، مع الكسوة التي تخرق كل حجاب، وهو نورالله، لأنه خرج من قلب مشحون بالنور، فخرق كل حجاب قد تراكم على قلوب المخلطين، فخلصها إلى نور التوحيد فأنارها بمنزلة جمرة وصلت النفخة إليها، فالتهبت ناراً، فاضاءت البيت. وهذا سبيل الناطق عن الله. ثم قال: وكيف يجوز الدعاء إلى الله لمن ليس عند الله، وهو لله، وإنما قلبه عند نفسه ولنفسه، مشغول بنهمته وشهواته وأحواله، وإنما هذا لمن تفرغ من نفسه، واشتغل بالله. هـ. ثم رد على من زعم من الكفار أن الرسول من البشر، فقال: { وَمَآ أَرْسَلْنَا مِن قَبْلِكَ إِلاَّ رِجَالاً نُّوحِيۤ إِلَيْهِمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:43",
      "similarity": 0.4389286870469011
    },
    {
      "verse": "28:68",
      "similarity": 0.38605511032354045
    },
    {
      "verse": "16:86",
      "similarity": 0.38051853404418434
    },
    {
      "verse": "79:3",
      "similarity": 0.3747529811486793
    },
    {
      "verse": "37:166",
      "similarity": 0.369703937950304
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:108.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:108.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:108.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}