{
  "chapter": "يوسف",
  "text": "قال قائل منهم لا تقتلوا۟ يوسف والقوه فى غيبت الجب يلتقطه بعض السيارة ان كنتم فعلين",
  "translations": [
    {
      "translation": "One of them said: \"If you must do so, then do not kill Joseph, but throw him into an unused well. Some passing caravan may rescue him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon one of them said: \"Do not kill Joseph, but if you are bent upon doing something, cast him down to the bottom of some dark pit, perhaps some caravan passing by will take him out of it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of them said, \"Do not kill Joseph, but if you must, throw him into a dark well so that perhaps some caravan will take him away.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A speaker among them said, “Do not kill Yusuf – and drop him into a dark well so that some traveller may come and take him away, if you have to.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One from among them said: \"Kill not Yusuf, but if you must do something, throw him down to the bottom of a well; he will be picked up by some caravan of travelers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A speaker from among them said: Do not slay Yusuf, and cast him down into the bottom of the pit if you must do (it), (so that) some of the travellers may pick him up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of them said, 'No, kill not Joseph, but cast him into the bottom of the pit and some traveller will pick him out, if you do aught.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One among them said: Kill not Joseph but, if ye must be doing, fling him into the depth of the pit; some caravan will find him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of them said, \"Do not kill Joseph, but if you must do something, cast him into the bottom of a well; some of the travellers will pick him up.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said a speaker from among them; slay not Yusuf, but cast him into the bottom of a well, some of the caravan will take him up--if ye must be doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of them said, ‘Do not kill Joseph, but cast him into the recess of a well so that some caravan may pick him up, if you are to do [anything].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said one of them: \"Slay not Joseph, but if ye must do something, throw him down to the bottom of the well: he will be picked up by some caravan of travellers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One from among them said: \"Kill not Yusuf (Joseph), but if you must do something, throw him down to the bottom of a well, he will be picked up by some caravan of travellers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of them said: 'No, do not kill Joseph, if you do anything, cast him into a dark pit, a traveler will pick him up'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of them said, “Do not kill Joseph, but throw him into the bottom of the well; some caravan may pick him up—if you must do something.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said a speaker among them, \"Do not kill Joseph but throw him into the bottom of the well; some travelers will pick him up - if you would do [something].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:10] One of them, namely, Judah, said, ‘Do not kill Joseph, but cast him, throw him, into the bottom of a well (ghayābat al-jubb is the darkest recess of a well; a variant reading has the plural [ghayābāt]), so that some caravan might pick him up, if you are to do anything’, of what you desire, in the way of separating [Joseph from us]: so content yourselves with this [solution].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(One among them) one of the brothers who is Yehuda (said: Kill not Joseph but, if ye must be doing) something to him, (fling him into the depth of the pit) in the bottom of the pit or in the darkness of the pit; (some caravan) travellers passing by (will find him) will get him out.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي غَيَٰبَتِ ٱلْجُبِّ } والغَيَابةُ: مَا غَاب عَنكَ والجُبُّ: البِئرُ الذِي لم يُطَمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تشاوروا في مقت يوسف وطرحه وطرده { قَالَ قَآئِلٌ مِّنْهُمْ } وهو يهوذا وكان أ؛سنهم رأياً \" { لاَ تَقْتُلُواْ يُوسُفَ } إذ نحن من عترة الأنبياء، لا يليق بنا قتله بلا رخصة شرعية { وَ } إن أردتم أن تدفعوه من عند أبيكم { أَلْقُوهُ فِي غَيَٰبَتِ ٱلْجُبِّ } الذي على متن الطريق { يَلْتَقِطْهُ } أي: يأخذه ويذهب { بَعْضُ ٱلسَّيَّارَةِ } أي: بعض السائرين في أقطر الأرض، الواردين على الماء، فلا طريق لكم لطرده وطرحه سوى هذا { إِن كُنتُمْ فَاعِلِينَ } [يوسف: 10] قاصدين جازمين أن تفعلوا معه ما يبعده عن وجه أبيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو صالحين في أمور دنياكم، فإنها تنتظم لكم بخلو وجه أبيكم لكم، { قال قائل منهم } هو يهوذا، وكان أحسنهم فيه رأياً، وقيل: روبيل: { لا تقتلوا يوسف } فإن القتل عظيم، { وألقُوه في غيابه الجُبِّ }: في قعره، سمي به لغيبته عن أعين الناظرين\n ومن قرأ بالجمع، فكان بتلك الجب غيابات، { يلتقطْه }: يأخذه { بعضُ السيارة } أي: الذين يسيرون في الأرض، { إن كنتم فاعلين } ما يفرق بينه وبين أبيه ولا بد، أو كنتم فاعلين بمشورتي\n الإشارة: إن أردت أن يخلو لك وجه قلبك فيخلو لك وجه حبيبك، حتى تشاهده عياناً وتعرفه إيقاناً، فاقتل كل ما يميل إليه قلبك ويعشقه من الهوى، واطرح عن عين بصيرتك رؤية السِّوى، ترى من أنوار وجهه، وأسرار محاسنه، ما تبتهج به القلوب والأسرار، وتتنزه في رياض محاسنه البصائر والأبصار، وأنشدوا:\n",
      "translations": []
    }
  ]
}