{
  "chapter": "يوسف",
  "text": "قالوا۟ يابانا انا ذهبنا نستبق وتركنا يوسف عند متعنا فاكله الذئب وما انت بمؤمن لنا ولو كنا صدقين",
  "translations": [
    {
      "translation": "saying, 'Father, we went out to run a race and left Yusuf together with our things and then a wolf appeared and ate him up but you are never going to believe us now, not even though we really tell the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said: \"We went racing with one another and left Joseph to guard our things when a wolf devoured him. But you will not believe us even though we tell the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and said: \"Father! We went racing with one another and left Joseph behind with our things, and then a wolf came and ate him up. We know that you will not believe us howsoever truthful we might be.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and saying, \"Father, we went playing and left Joseph with our belongings. A wild-beast came and devoured him. We realize that you will not believe us even though we are telling the truth\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying, “O our father! We went far ahead while racing, and left Yusuf near our resources – therefore the wolf devoured him; and you will not believe us although we may be truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O our father! We went racing with one another, and left Yusuf by our belongings and a wolf devoured him; but you will never believe us even when we speak the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O our father! surely we went off racing and left Yusuf by our goods, so the wolf devoured him, and you will not believe us though we are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Father, we went running races, and left Joseph behind with our things; so the wolf ate him. But thou wouldst never believe us, though we spoke truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: O our father! We went racing one with another, and left Joseph by our things, and the wolf devoured him, and thou believest not our saying even when we speak the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Father, we went off racing and left Joseph with our belongings, and the wolf devoured him. But you will not believe us, even though we are telling the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: our father! we went off competing, and left Yusuf by our stuff, so a wolf devoured him; and thou wilt put no credence in us, even though we are the truth-tellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Father! We had gone racing and left Joseph with our things, whereat the wolf ate him. But you will not believe us even if we spoke truly.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O our father! We went racing with one another, and left Joseph with our things; and the wolf devoured him.... But thou wilt never believe us even though we tell the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said:\"O our father! We went racing with one another, and left Yusuf (Joseph) by our belongings and a wolf devoured him; but you will never believe us even when we speak the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'We went racing and left Joseph with our things. The wolf devoured him, but you will not believe us, though we speak the truth'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O father, we went off racing one another, and left Joseph by our belongings; and the wolf ate him. But you will not believe us, even though we are being truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O our father, indeed we went racing each other and left Joseph with our possessions, and a wolf ate him. But you would not believe us, even if we were truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:17] They said, ‘O father, we went competing, shooting, and left Joseph by our things, our clothes, and the wolf ate him. But you would never believe us, even though we speak the truth’, before you, you would still have accused us [of lying] in this story, because of your adoration of Joseph, so how much more so when you think ill of us?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Saying: our father! We went racing one with another) and hunting, (and left Joseph by our things) to guard them, (and the wolf devoured him) as you said, (and thou believest not our sayings even when we speak the Truth).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَآ أَنتَ بِمُؤْمِنٍ لَّنَا } معناهُ بِمُصدقٍ\n والإِيمانُ التَّصديقُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And you are not a believer in us}, means you are not sincere.\n\n\nAnd the belief in the truthfulness of what is believed.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفلما سمع يعقوب صياحهم اضطرب فقال: ما لكم؟ وأين يوسف؟ { قَالُواْ يَٰأَبَانَآ إِنَّا ذَهَبْنَا نَسْتَبِقُ } أي: نتسابق بالعدو والرمي واستمر تسابقنا ومالنا { وَ } قد { تَرَكْنَا يُوسُفَ عِندَ مَتَاعِنَا } لحفظها\n فغفلنا عنه بغرور السباق { فَأَكَلَهُ ٱلذِّئْبُ } وكنت نظرت من أول الأمر فوقع { وَ } نحن نعلم { مَآ أَنتَ } يا أبانا { بِمُؤْمِنٍ } أي: مصدق { لَّنَا وَلَوْ كُنَّا صَادِقِينَ } [يوسف: 17] فيما أخبرنا لك\n لسوء ظنك بنا وفرط محبتك بيوسف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو الرمي { وتركنا يوسفَ عند متاعنا فأكله الذئبُ وما أنت بمؤمنٍ لنا }: بمصدق لنا\n { ولو كنا صادقين } لسوء ظنك\n وفرط محبتك ليوسف\n  { وجاؤوا على قميصه }: فوق قميصه { بدم كذبٍ } \n أي: ذي كذب بمعنى مكذوب فيه لأنهم ذبحوا جدياً ولطخوا قميصه بدمه\n رُوي أنه لما سمع بخبر يوسف صاح ودعا بقميصه فأخذه\n وألقاه على وجهه\n وبكى حتى خضب وجهه بدم القميص\n وقال: ما رأيت كاليوم ذئباً أحلم من هذا! أكل ابني ولم يمزق عليه قميصه\n  وفي رواية أخرى: أنه لما رأى صحة القميص ضحك\n فقالوا له: الضحك والبكاء من فعل المجانين! فقال: أما بكائي فعلى يوسف لما رأيت الدم\n وأما ضحكي\n فإني لما رأيت صحة القميص رجوت أن الحديث غير صحيح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:13",
      "similarity": 0.7780708031173201
    },
    {
      "verse": "12:14",
      "similarity": 0.6450302954687117
    },
    {
      "verse": "12:11",
      "similarity": 0.1671671433796713
    },
    {
      "verse": "12:7",
      "similarity": 0.14021971921546494
    },
    {
      "verse": "12:87",
      "similarity": 0.13921844483716544
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/12:17.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/12:17.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}