{
  "chapter": "يوسف",
  "text": "وجاءو على قميصه بدم كذب قال بل سولت لكم انفسكم امرا فصبر جميل والله المستعان على ما تصفون",
  "translations": [
    {
      "translation": "They then produced his shirt with false blood on it. He said, 'It is merely that your lower selves have suggested something to you which you did; but beauty lies in showing steadfastness. It is Allah alone who is",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They showed him the shirt with false blood on it. (Their father) said: \"It is not so; you have made up the story. Yet endurance is best. I seek the help of God alone for what you impute.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought Joseph's shirt, stained with false blood. Seeing this their father exclaimed: \"Nay (this is not true); rather your evil souls have made it easy for you to commit a heinous act. So I will bear this patiently, and in good grace. It is Allah's help alone that I seek against your fabrication.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They presented him with a shirt stained with false blood. Jacob said, \"Your souls have tempted you in this matter. Let us be patient and beg assistance from God if what you say is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought his shirt stained with faked blood; he said, “On the contrary – your hearts have fabricated an excuse for you; therefore patience is better; and from Allah only I seek help against the matters that you relate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought his shirt stained with false blood. He said: \"Nay, but your own selves have made up a tale. So (for me) patience is most fitting. And it is Allah (Alone) Whose help can be sought against that (lie) which you describe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought his shirt with false blood upon it. He said: Nay, your souls have made the matter light for you, but patience is good and Allah is He Whose help is sought for against what you describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought his shirt with false blood on it. He said, 'No; but your spirits tempted you to do somewhat. But come, sweet patience! And God's succour is ever there to seek against that you describe.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they came with false blood on his shirt. He said: Nay, but your minds have beguiled you into something. (My course is) comely patience. And Allah it is Whose help is to be sought in that (predicament) which ye describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they showed him their brother's shirt, stained with false blood. \"No!\" he cried. \"Your souls have tempted you to do something evil! But it is best to be patient: God alone can help me bear the loss you speak of.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought his shirt with false blood. He said: nay! your selves have embellished for you an affair; so seemly patience! and Allah is to be implored for help in that which ye ascribe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they produced sham blood on his shirt. He said, ‘No, your souls have made a matter seem decorous to you. Yet patience is graceful, and Allah is my resort against what you allege.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They stained his shirt with false blood. He said: \"Nay, but your minds have made up a tale (that may pass) with you, (for me) patience is most fitting: Against that which ye assert, it is Allah (alone) Whose help can be sought\"..\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought his shirt stained with false blood. He said: \"Nay, but your ownselves have made up a tale. So (for me) patience is most fitting. And it is Allah (Alone) Whose help can be sought against that which you assert.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought his shirt (stained) with blood, a lie. He said: 'No, your souls have tempted you to do something. But come sweet patience! The help ofAllah is always there to seek against that which you describe'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought his shirt, with fake blood on it. He said, “Your souls enticed you to do something. But patience is beautiful, and God is my Help against what you describe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they brought upon his shirt false blood. [Jacob] said, \"Rather, your souls have enticed you to something, so patience is most fitting. And Allah is the one sought for help against that which you describe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:18] And they came with false blood on his shirt (‘alā qamīsihi has the status of an accusative [of the verb], because it is an adverbial qualifier, meaning fawqa [qamīsihi]): they slaughtered a lamb and dabbed it [his shirt] with its blood — but they forgot to tear it [the shirt] — and they said that it was his blood. He, Jacob, said, when he saw that it [the shirt] was undamaged and realised that they were lying: ‘Nay, but your souls have beguiled you into something, and so you did it to him. Yet comely patience!, without any anxiety! (fasabrun jamīlun is the predicate of a missing subject such as amrī, ‘my course]’). And God is the One Whose succour is sought in that [predicament] which you describe’, that which you mention of Joseph’s affair.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they came with false blood on his shirt) they stained his shirt with the blood of a goat. (He said: Nay, but your minds have beguiled you into) they embellished to you to do (something) regarding the peril of Joseph and you did it. ((My course is) comely patience) I have only to be patient without showing any alarm. (And Allah it is whose help is to be sought) I seek the help of Allah (in that (predicament) which ye describe) to be patient for his death, as you say. But he did not believe them because in another occasion they said that Joseph was killed by thieves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ } معناه زَيَّنتْ لَكم أَنفُسُكُم ويقالُ: بل أمَرتكُم أنفسُكُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Indeed, your own selves have made things seem alluring to you\" - this means that your own selves have made things seem attractive to you, and it is said, \"Indeed, your own selves have ordered you to do so.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما تفرسوا منه الإنكار والاستبعاد { جَآءُوا عَلَىٰ قَمِيصِهِ } معه { بِدَمٍ كَذِبٍ } يعني: جاءوا مثبتين لدعواهم بدم كذب ملطخ على قميصه\n مفترين على الذئب بأنه أكله\n وبعدما جاءوا بالقميص الملطخ\n طلب منهم ابوهم\n فألقاه على وجهه فبكى بكاء فظيعاً فجيعاً\n وتمادى في البكاء زماناً طويلاً حتى احمر وجهه من الدم الملطوخ به\n ثم كشف القميص فرآه لم يمزق\n فقال: ما رأيت ذئباً أحلم من هذا الذئب\n أكل ابني ولم يمزق قيمصه! ثم { قَالَ } متوجهاً إليهم: ما جئتم به معتذرين عليَّ ليس بمطابق للواقع { بَلْ سَوَّلَتْ } سهلت ويسرت { لَكُمْ أَنفُسُكُمْ أَمْراً } بإلقاء الشيطان وتعيلمه إياكم لتعتذروا به عليَّ { فَصَبْرٌ جَمِيلٌ } أجمل علي فيما ابتليت { وَٱللَّهُ ٱلْمُسْتَعَانُ عَلَىٰ } احتال { مَا تَصِفُونَ } [يوسف: 18] بألسنتكم أيها المسرفون\n إذ لا طاقة في تحمله إلا بعون الله وإقداره",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولذلك { قال بل سولتْ لكم أنفسكم أمراً } أي: سهلت لكم\n وهونت في أعينكم أمراً عظيماً حتى أقدمتم عليه\n\nوقيل: لما سمع مقالهم غشي عليه إلى الصباح\n وهم يبكون بأجمعهم\n ويقولون بينهم: بئس ما فعلناه بيوسف ووالده\n وأي عذر لنا عند الله\n فلما أفاق نظر إلى أولاده\n وقال: هكذا يا أولادي كان ظني فيكم\n بئس ما فعلتم\n وبئس ما سولت لكم أنفسكم { فصبر جميل } أي: فأمري صبري جميل\n وفي الحديث:\n \" الصبرُ الجميل الذي لا شكوى فيه إلى الخلق \" \n{ واللَّهُ المستعانُ على ما تصفون } أي: على احتمال ما تصفونه من هلاك ابني يوسف\n وهذه الجريمة كانت قبل استنبائهم\n إن صح أنهم تنبأوا\n وقد تقدم في سورة البقرة الخلاف في نبوة الأسباط فراجعه\n الإشارة: في هذه الآية رجاء كبير لأهل العصيان\n وبشارة وتأنيس لمن أراد مقام الإحسان بعد الإساءة والغفلة والنسيان\n وذلك أن هؤلاء السادات فعلوا بيوسف عليه السلام ما فعلوا\n فلما تابوا بعد هذا الفعل العظيم اجتباهم الحق تعالى\n وتاب عليهم\n وقربهم حتى صاروا أنبياء\n على حد قول بعض العلماء\n ولذلك قيل: [كم من خصوص خرجوا من اللصوص\n وكم من عابد ناسك خرج من ظالم فاتك]\n وفي الحكم: \" من استغرب أن ينقذه الله من شهوته\n وأن يخرجه من وجود غفلته\n فقد استعجز القدرة الإلهية\n وكان الله على كل شيء مقتدراً \"\n وللشافعي رضي الله عنه:\nوهذا إنما يكون بالتوبة النصوح\n والنهوض التام\n والمجاهدة الكبيرة\n كما فعل إبراهيم بن أدهم\n والفضل بن عياض\n والشيخ أبو يعزى\n وغيرهم ممن كانوا لصوصاً فصاروا خصوصاً\n قال النبي صلى الله عليه وسلم:\n \" مَن لَم يَغلِب نَفسَه وَهَواه فَليس لَهُ حَظٌ في عُقبَاه \" \nوأنشدوا:\nوفيها أيضاً: تنويه بمقام الصابرين وعاقبة المتقين\n فإن يعقوب عليه السلام\n لما استعمل الصبر الجميل\n جمع الله شمله بولده مع ما أعد له من الثواب الجزيل\n ويوسف عليه السلام\n لما صبر على ما أصابه من المحن عوضه العز الدائم بترادف المنن\n وفي الخبر: \" أعلى الدرجات درجات الصابرين \"\n لكل عمل ثواب محدود\n وثواب الصابرين غير محدود ولا معدود\n قيل: إن الله تعالى أعطى لكل صابر قصراً في الجنة مسيرة الشمس أربعين يوماً\n من درة بيضاء معلقة في الهواء\n ليس تحته دعامة\n ولا فوقه علاقة\n وله أربعة آلاف باب\n يدخل من كل باب سبعون ألف ملك\n يسلمون على صاحبه ولا ترجع النوبة إليهم أبداً\n هـ\n ثم ذكر خروج يوسف من البئر\n وبيعه\n ودخوله مصر\n فقال: { وَجَاءَتْ سَيَّارَةٌ فَأَرْسَلُواْ وَارِدَهُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:83",
      "similarity": 0.6009254400419924
    },
    {
      "verse": "47:25",
      "similarity": 0.407529854564709
    },
    {
      "verse": "20:96",
      "similarity": 0.3783203728884692
    },
    {
      "verse": "21:112",
      "similarity": 0.3348748443927939
    },
    {
      "verse": "12:93",
      "similarity": 0.31960127912773423
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:18.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:18.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}