{
  "chapter": "يوسف",
  "text": "وما ارسلنا من قبلك الا رجالا نوحى اليهم من اهل القرى افلم يسيروا۟ فى الارض فينظروا۟ كيف كان عقبة الذين من قبلهم ولدار الءاخرة خير للذين اتقوا۟ افلا تعقلون",
  "translations": [
    {
      "translation": "We sent none before you but men inspired with revelation from among the people of the cities. Have they not travelled in the land and seen the final fate of those before them? The abode of the Next World is better for those who have taqwa. So will you not use your intellect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the apostles We had sent before you were men of those regions, to whom We sent Our revelations. Have they not travelled on the earth and seen what befell the people before them? Surely the abode of the Hereafter is better for those who fear straying from the right path. Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messengers whom We raised before you, (O Muhammad), and to whom We sent down revelations, were only human beings, and were from among those living in earthly habitations. Have these people not travelled in the earth that they may observe the end of their predecessors? Certainly the abode of the Hereafter is much better for those (who accepted the call of the Messengers and) acted in a God-fearing manner. Will you still not act with good sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messengers whom We sent before you were mere men of the people of the towns. We gave them revelations. Have they (the unbelievers) not travelled sufficiently through the land to see how terrible the end was of those who lived before. The next life is, certainly, better for the pious ones. Will you not then take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all the Noble Messengers We sent before you, were exclusively men – towards whom We sent the divine revelations, and were dwellers of townships; so have not these people travelled in the land and seen what sort of fate befell those before them? And undoubtedly the abode of the Hereafter is better for the pious; so do you not have sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not before you (as Messengers) any but men unto whom We revealed, from among the people of townships. Have they not traveled in the land and seen what was the end of those who were before them And verily, the home of the Hereafter is the best for those who have Taqwa. Do you not then understand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not sent before you but men from (among) the people of the towns, to whom We sent revelations. Have they not then travelled in the land and seen what was the end of those before them? And certainly the abode of the hereafter is best for those who guard (against evil); do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent not forth any before thee, but men We revealed to of the people living in the cities. Have they not journeyed in the land? Have they not beheld how was the end of those before them?. Surely the abode of the world to come is better for those that are godfearing. What, do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent not before thee (any messengers) save men whom We inspired from among the folk of the townships - Have they not travelled in the land and seen the nature of the consequence for those who were before them? And verily the abode of the Hereafter, for those who ward off (evil), is best. Have ye then no sense? -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the messengers We sent before you [Muhammad] were human beings to whom We made revelations; they were men chosen from the people of their towns. Did they not travel across the earth and see the end of those before them? Those who are mindful of God prefer the life to come. Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not before thee any save men unto whom We revealed from among the people of the towns. Have then they not travelled about in the land that they might observe of what wise hath been the end of those before them! And surely the abode of the, Hereafter is best for those who fear! Reflect then ye not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send [any apostles] before you except as men from among the people of the towns, to whom We revealed. Have they not travelled over the land so that they may observe how was the fate of those who were before them? And the abode of the Hereafter is surely better for those who are Godwary. Do you not exercise your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did We send before thee (as messengers) any but men, whom we did inspire,- (men) living in human habitations. Do they not travel through the earth, and see what was the end of those before them? But the home of the hereafter is best, for those who do right. Will ye not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not before you (as Messengers) any but men, whom We inspired from among the people of townships. Have they not travelled through the earth and seen what was the end of those who were before them? And verily, the home of the Hereafter is the best for those who fear Allah and obey Him (by abstaining from sins and evil deeds, and by performing righteous good deeds). Do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send any before you from the inhabitants of the village, but men to whom a revelation was sent. Have they not traveled in the land and seen what was the end of those before them? Better is the dwelling in the Everlasting Life for those who keep from evil. Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send before you except men, whom We inspired, from the people of the towns. Have they not roamed the earth and seen the consequences for those before them? The Home of the Hereafter is better for those who are righteous. Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not before you [as messengers] except men to whom We revealed from among the people of cities. So have they not traveled through the earth and observed how was the end of those before them? And the home of the Hereafter is best for those who fear Allah; then will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:109] And We did not send before you [any messengers] save men inspired by revelation (yūhā ilayhim: a variant reading has nūhī ilayhim, ‘to whom We revealed’) — and not angels — from among the people of the towns, the principal towns, since they are more knowledgeable and wiser than the people of the desert, who are crude and ignorant. Have they, the people of Mecca, not travelled in the land and seen the nature of the consequence for those who were before them?, that is, how they ended up, when they were destroyed for denying their messengers? And verily the abode of the Hereafter, that is, Paradise, is better for those who are wary, of God. Will they not understand? (read a-fa-lā ya‘qilūn, or a-fa-lā ta‘qilūn. ‘Will you not understand?’), this, O people of Mecca, and so have faith?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We sent not before thee) O Muhammad, any messengers (save men whom We inspired) We send Gabriel to them as We sent him to you (from among the folk of the townships) they were related to townships like you. (Have they) the people of Mecca (not travelled in the land and seen) and reflect on (the nature of the consequence for) how was the end result of (those who were before them) among the disbelievers? (And verily the abode of the Hereafter) Paradise, (for those who ward off (evil)) ward off disbelief, idolatry and indecencies and instead believe in Allah, Muhammad (pbuh) and the Qur'an, (is best. Have ye then no sense?) do you not have the common sense to realise that the Hereafter is better than the life of this world; it is also said that this means: have you then no sense to realise that the life of this world is evanescent while the Hereafter is everlasting; it is also said that this means: do you not believe in that which befell the people of old as a result of their disbelief in the messengers?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما أرسلنا من قبلك إلا رجالاً نُوْحي إليهم } أي: من كان فيه بقيّة من الرجولية من أهل قرى الصفات والمقامات لا من مصر الذات\n فإن البقاء الحاصل لأهل التمكين لا يكون إلا بقدر الفناء\n والرجوع إلى الخلق لا يكون إلا على حسب العروج\n فالفناء التام والعروج الكامل لا يكون إلا للقطب الذي هو صاحب الاستعداد الكامل الذي لا رتبة إلا قد يبلغها ويلزم أن يكون الرجوع التامّ الشامل لجميع تفاصيل الصفات عند البقاء له وهو الخاتم ولهذا قال عليه الصلاة والسلام:\n \" كان بنيان النبوّة تم ورصف وبقي منه موضع لبنة واحدة\n فكنت أنا تلك اللبنة \" \nوإلى هذا المعنى أشار بقوله صلى الله عليه وسلم:\n \" بُعِثْتُ لأتمم مكارم الأخلاق \"\n \n{ أفلم يسيروا في الأرض } أرض استعدادهم { فينظروا كيف كان } نهاية أمر { الذين من قبلهم } وغاية كمالهم\n فيبلغوا منتهى إقدامهم ويُحَصلوا كمالاتهم بحسب استعداداتهم\n فإنّ لكل أحد خاصية واستعداده الخاص يقتضي سعادة خاصة هي عاقبته\n ومن الاطلاع على خواص النفوس وغايات إقدامهم في السير يحصل للنفس هيئة اجتماعية من تلك الكمالات هي كمال الأمّة المحمدية على حسب اختلاف استعداداتهم وهي الدار الآخرة التي هي خير للذين اتّقوا صفات نفوسهم التي هي حجب الاستعدادات { أفلا تَعْقِلون } أن هذا المقام خير مما أنتم عليه من الدار الفانية وتمتعاتها\n فإنها\n[العنكبوت\n الآية: 64]",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَمَآ أَرْسَلْنَا مِن قَبْلِكَ } أيها المبعوث للكل { إِلاَّ رِجَالاً } مثلك من جنس البشر { نُّوحِيۤ إِلَيْهِمْ } أي: نخصهم بالوحي والإلهام\n لنجابة طينتهم في أصل خلقتهم مع أنهم { مِّنْ أَهْلِ ٱلْقُرَىٰ } أي: من جملة ما يسكنون فيها { أَ } يصرون هؤلاء المعاندون على تكذيبك\n معللين بقولهم الباطل: ولو شاء ربنا لأنزل ملائكة { فَلَمْ يَسِيرُواْ فِي ٱلأَرْضِ فَيَنظُرُواْ كَيْفَ كَانَ عَاقِبَةُ ٱلَّذِينَ } كذبوا الرسل المبعوثين لهم مضوا { مِن قَبْلِهِمْ } مثل تكذيبهم إياك حتى يعتبروا منها { وَ } الله { لَدَارُ ٱلآخِرَةِ } المعدة للفوز والفلاح { خَيْرٌ لِّلَّذِينَ ٱتَّقَواْ } أي: للمؤمنين الذين يحفظون نفوسهم عما حذرهم الله منها { أَفَلاَ تَعْقِلُونَ } [يوسف: 109] أيها المسرفون المكابرون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: نوحى: نعت لرجال\n وكذا من أهل القرى: نعت ثان\n وحتى: غاية لمحذوف\n أي: وما أرسلنا إلا رجلاً يوحى إليهم فأوذوا مثلك\n ودام عليهم\n حتى إذا استيأسوا جاءهم نصرنا\n يقول الحق جل جلاله: { وما أرسلنا من قبلك } يا محمد { إلا رجالاً } بشراً لا ملائكة\n وهو رد لقولهم:\n[فصلت: 14]\n وقيل: معناه: نفي استنباء النساء\n وصفة أولئك الرجال: { يوحَى إليهم } كما أوحي إليك\n فتميزوا بالوحي عن غيرهم\n وهم { من أهل القُرى }\n وهم المدن والأمصار\n والمداشر الكبار لأنهم أحلم وأعلم\n بخلاف أهل العمود فإنهم أهل جفاء وجهالة\n قال الحسن: لم يبعث الله نبياً من أهل البادية\n ولا من النساء ولا من الجن\n قال ابن عطية: والتَّبَدِّي مكروه إلا في الفتن\n وحين يُفَرُّ بالدين\n لحديث:\n \" يُوشِكُ أن يَكونَ خَيْرُ مَالِ المُسْلِم غَنما يَتْبَعُ بها سَعَفَ الجِبَالِ\n\n\n \" \nالحديث\n وفي ذلك أذن رسول الله صلى الله عليه وسلم لسلمة بن الأكوع\n هـ\n  قلت: والفتنة تتنوع بتنوع المقامات ففتنة أهل الظاهر: تعذر إقامة الشريعة لكثرة الهرج والفتن\n وفتنة أهل الباطن: تعذر جمع القلب بالله لكثرة الحس\n وتعرض الشواغل والعلائق\n فمن وجد ذلك في الحواضر فلينتقل إلى البوادي\n إن وجد من يعينه على الدين\n والغالب أن الحواضر في هذا الزمان يغلب فيها العوائد والشهوات\n وتعتري فيها الشواغل والشواغب\n بخلاف البادية\n فإذا كان عليه الصلاة والسلام أذن لسَلَمة: خوف فتنة الظاهر\n فأولى خوف فتنة الباطن لأنه إذا فسد القلب فسد الجسد كله\n  ثم قال ابن عطية: وقال صلى الله عليه وسلم:\n \" لا تعرب في الإسلام \" \nوقال:\n \" مَن بَدَا جَفَا \" \nوعن معاذ بن جبل أنه قال: الشَّيْطَانُ ذِئْبُ الإِنْسَانِ\n كذِئبِ الغَنَمِ يَأخُذُ الشَّاةَ القَاصية فإِيَّاكُمْ والشِّعاب\n وَعَليكم بالمَسَاجِدِ\n والجَمَاعَاتِ\n والعَامةَ\n  ثم قال: ويعترض هذا ببدو يعقوب\n وينفصل عن ذلك بوجهين: أحدهما: أن ذلك البدو لم يكن في أهل العمود\n بل بَتَقَرِّ في منازل وربوع\n والثاني: إنما جعله بدواً بالإضافة إلى مصر\n كما هي بنات الحواضر الصغار بَدْوٌ بالإضافة إلى الحواضر الكبار\nهـ\n  قلت: فالتعرب المنهي عنه هو اعتزال الرجل وحده في جبل أو شِعْبٍ\n وإما إن تقرر في جماعة يقيمون الدين\n ويجتمعون عليه\n فليس بتعرب ولا بدو\n ويدل عليه جواب ابن عطية الأول عن يعقوب عليه السلام\n والحاصل: أن أهل القلوب بفتشون على مصالح قلوبهم\n فأينما وجدوها فهي حاضرتهم\n وقد ظهر في البوادي أكابر من الأولياء\n ربما لم يظهروا في الحواضر\n والله تعالى أعلم\n ثم قال تعالى: { أفلم يسيروا } أي: كفار مكة\n { في الأرض فينظروا كيف كان عاقبةُ الذين من قبلهم } من المكذبين لرسلهم: كيف هلكوا وتركوا آثارهم يشاهدونها خراباً دارسة\n فيحذروا تكذيبك\n ليؤمنوا ويتأهبوا للدار الآخرة { ولَدَار الآخِرَةِ } أي: ولدار الحياة الآخرة { خير للذين اتقوا } الشرك والمعاصي\n { أفلا تعقلون } \n وتستعملون عقولكم لتعلموا أنها خير\n\nأو: أفلا يعقلون الذين يسيرون في الأرض ليعلموا أن الدنيا فانية\n والدار الآخرة خير لأنها باقية\n فإن أبيتم وكذبتم نبيكم فقد كذب من قبلكم رسلهم\n وآذوهم\n وتأخر نصرهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:42",
      "similarity": 0.5513583095528573
    },
    {
      "verse": "6:11",
      "similarity": 0.536800258535895
    },
    {
      "verse": "27:69",
      "similarity": 0.524443840720778
    },
    {
      "verse": "35:44",
      "similarity": 0.46730449791738965
    },
    {
      "verse": "40:21",
      "similarity": 0.4529443916817578
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:109.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:109.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:109.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}