{
  "chapter": "يوسف",
  "text": "رب قد ءاتيتنى من الملك وعلمتنى من تاويل الاحاديث فاطر السموت والارض انت ولى فى الدنيا والءاخرة توفنى مسلما والحقنى بالصلحين",
  "translations": [
    {
      "translation": "My Lord, You have granted power to me on earth and taught me the true meaning of events. Originator of the heavens and earth, You are my Friend in this world and the Next. So take me as a Muslim at my death and join me to the people who are righteous.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord, you have given me dominion and taught me the interpretation of dreams; O Creator of the heavens and the earth, You alone are my saviour in this world and the world to come; let me die submitting to You, and place me among the upright.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! You have bestowed dominion upon me and have taught me to comprehend the depths of things. O Creator of heavens and earth! You are my Guardian in this world and in the Hereafter. Cause me to die in submission to You, and join me, in the end, with the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, You have given me the kingdom and taught me the meaning of dreams. You are the Creator of the heavens and the earth. You are my Guardian in this world and in the life to come. Make me die as one who has submitted to the Will of God and unite me with the righteous ones.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my Lord! you have given me a kingdom* and have taught me how to interpret some events; O Creator of the heavens and the earth – you are my Supporter in the world and in the Hereafter; cause me to die as a Muslim, and unite me with those who deserve Your proximity.” (* Prophethood and the rule over Egypt. Prophet Yusuf said this prayer while his death approached him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! You have indeed bestowed on me of the sovereignty, and taught me something of the interpretation of dreams - the (Only) Creator of the heavens and the earth! You are my Wali in this world and in the Hereafter. Cause me to die as a Muslim, and join me with the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Thou hast given me of the kingdom and taught me of the interpretation of sayings: Originator of the heavens and the earth! Thou art my guardian in this world and the hereafter; make me die a muslim and join me with the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord, Thou hast given me to rule, and Thou hast taught me the interpretation of tales. O Thou, the Originator of the heavens and earth, Thou art my Protector in this world and the next. O receive me to Thee in true submission, and join me with the righteous.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord! Thou hast given me (something) of sovereignty and hast taught me (something) of the interpretation of events - Creator of the heavens and the earth! Thou art my Protecting Guardian in the world and the Hereafter. Make me to die muslim (unto Thee), and join me to the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Joseph prayed, \"My Lord, You have given me power and taught me the interpretation of dreams. Creator of the heavens and the earth, You are my patron in this world and the Hereafter! Make me die in submission to You and admit me among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My Lord! Thou hast given me of the dominion, and hast taught me of the interpretation of discourses, Creator of the heavens and the earth! Thou art my Patron in the world and the Hereafter. Make me to die a Muslim, and join me with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘My Lord! You have granted me a share in the kingdom, and taught me the interpretation of dreams. Originator of the heavens and earth! You are my guardian in this world and the Hereafter! Let my death be in submission [to You], and unite me with the Righteous.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord! Thou hast indeed bestowed on me some power, and taught me something of the interpretation of dreams and events,- O Thou Creator of the heavens and the earth! Thou art my Protector in this world and in the Hereafter. Take Thou my soul (at death) as one submitting to Thy will (as a Muslim), and unite me with the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! You have indeed bestowed on me of the sovereignty, and taught me the interpretation of dreams; The (only) Creator of the heavens and the earth! You are my Wali (Protector, Helper, Supporter, Guardian, etc.) in this world and in the Hereafter, cause me to die as a Muslim (the one submitting to Your Will), and join me with the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, You have given me the kingdom and taught me to interpret visions. Originator of the heavens and the earth, my Guardian in this world and in the Everlasting Life. Let me die in submission (as a Muslim) and let me join the righteous'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“My Lord, You have given me some authority, and taught me some interpretation of events. Initiator of the heavens and the earth; You are my Protector in this life and in the Hereafter. Receive my soul in submission, and unite me with the righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, You have given me [something] of sovereignty and taught me of the interpretation of dreams. Creator of the heavens and earth, You are my protector in this world and in the Hereafter. Cause me to die a Muslim and join me with the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:101] When he was nearing his end, realising that he would not remain [alive] forever, he longed for the everlasting kingdom and said: My Lord, indeed You have given me [something] of sovereignty and You have taught me the interpretation of events, the ability to explain dreams. Originator, Creator, of the heavens and the earth! You are my Protector, Guardian of my best interests, in this world and the Hereafter. Take me [in death] to You in submission [to You] and join me to the righteous’, from among my fathers. He lived after that for another week or more. He died at the age of 120 years. The Egyptians were very covetous with regard to his grave; [eventually] they placed him in a marble coffin and buried him at the top of the Nile so that both banks would be blessed [by his body] — Glory be to the One Whose Kingdom never ends.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my Lord! Thou hast given me (something) of sovereignty) you gave me the sovereignty of Egypt which spreads over an area of forty parasangs by forty parasangs (and hast taught me (something) of the interpretation of events) the interpretation of dreams, (Creator of the heavens and the earth! Thou art my Protecting Friend) You are Lord, Creator, Provider, Protector and Helper (in the world and the Hereafter. Make me to die submissive (unto Thee)) in my worship and confession of monotheism, (and join me to the righteous) join me in Paradise with the messengers among my forefathers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم دعا يوسف عليه السلام لنفسه وناجى مع ربه مناجاة صاردة عن محض الحكمة والذكاء والفطنة بقوله: { رَبِّ } يا من رباني بلطفك وفضلك بأنواع التربية والنعم إلى حيث { قَدْ آتَيْتَنِي } وأعطيتني { مِنَ ٱلْمُلْكِ } الظاهر أي: الحكومة المتعلقة بعالم الشهادة { وَعَلَّمْتَنِي مِن تَأْوِيلِ ٱلأَحَادِيثِ } أي: العبور من الحوادث الكائنة في عالم الشهادة إلى ما في عالم الغيب من الصور المقتضية إياها { فَاطِرَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: عالم الأسماء التي انعكست منها هذه الأظلال الهالكة الشهادية { أَنتَ } بذاتك بعدما تحققت بتوحيدك وانكشفت به\n ورفعت الحجب بيني وبينه { وَلِيِّي } ومولى أمورري وحامل أسراري { فِي ٱلدُّنُيَا وَٱلآخِرَةِ } أي: في النشأة الأولى والأخرى { تَوَفَّنِى } اقبضني { مُسْلِماً } مسلماً مفوضاً جميع أموري إليك { وَأَلْحِقْنِي } بلطفك { بِٱلصَّالِحِينَ } [يوسف: 101] الذين أصلحوا نفوسهم في النشأة الأولى والأخرى حتى يفوزوا من عندك بشرف اللقيا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: فاطر: نعت المنادي، أو منادى بنفسه\n  يقول الحق جل جلاله: حاكياً عن يوسف عليه السلام: { ربِّ قد آتيتني من المُلكِ } أي: من بعض الملك، وهو ملك مصر، { وعلمتني من تأويل الأحاديث } الكتب المتقدمة، أو تأويل الرؤيا\n و \" من \": للتبعيض فيهما إذ لم يعط ملك الدنيا كلها، ولا أحاط بالعلم كله\n { فاطِرَ السَّماواتِ والأرض }: مبدعهما ومنشئهما، { أنت وليي في الدنيا والآخرة }: أنت ناصري ومتولي أمري في الدارين، { توفني مسلماً }: اقبضني ملسماً { وألحقني بالصالحين } من آبائي، أو جماعة الصالحين في الرتبة والكرامة، أو بالصالحين لحضرة قدسك\n  رُوي أن يعقوب عليه السلام أقام معه أربعاً وعشرين سنة، ثم توفي، فنقله يوسف عليه السلام إلى الشام ليُدفن مع أبويه\n هكذا ذكر بعض المفسرين\n وقال في الزهر الأنيق: بقي يعقوب عليه السلام بمصر أربعين سنة في أطيب وقت، وأكمل عافية، ثم أوحى الله إلى جبريل: أن انزل إلى يعقوب، وقال له: يرحل إلى الأرض المقدسة، عند قبور آبائه، يجاورهم حتى أُلحِقَه بهم\n فنادى يعقوب عليه السلام يوسفَ وأولاده، وقال لهم: قد أمرني ربي بمجاورة أبي ليقبض روحي هناك، ثم ودَّعهم وخرج إلى الأرض المقدسة فزار قبور آبائه فبكى، فرأى في المنام إبراهيم على كرسي، وإسماعيل عن يمينه، وإسحاق عن يساره، وهم يقولون: ألْحق بنا يا يعقوب، فانتبه، ثم قالم فوجد قبراً محفوراً تخرج منه رائحة المسك، فقال: لمن هذا؟ قال له مَلَكٌ عنده: هو لمن يتمنى سكناه، فقال: أنا، فقبض روحه ملكُ الموت، ثم نزل جبريلُ وميكائيلُ ـ عليهما السلام ـ وكفناه وصليا عليه، ودفناه\n  قال كعب الأحبار: توفي يعقوب وهو ابن مائتي سنة، ولما وصل نعيُه يوسفَ بكى، وبكى معه إخوته\n هـ\n قلت: ظاهره أنهم لم يحضروا موته\n وهو خلاف قوله تعالى:\n\n[البقرة: 133]، إلا أن يؤول بمعنى: قرب، فتكون وصيته وقعت حين أراد الرجوع إلى الشام، وهو خلاف الظاهر\n ثم أن يوسف تاقت نفسه إلى الملك المخلد، فتمنى الموت، فقال: { رب قد آتيتني من الملك\n\n\n\n } الخ\n رُوي أنه عاش بعد قوله هذا مدة، ثم ماتت زليخا، ولم يتزوج بعدها، وعاش بعدها أربعين يوماً، ثم اشتاق إلى اللقاء واللحوق بآبائه، فتوفاه الله طيَّباً طاهراً، فتخاصم أهل مصر في مدفنه، حتى هموا بالقتال، فرأوا أن يجعلوه في صندوق من مَرمَرـ أي: رُخام ـ فيدفعوه في النيل بحيث يمر عليه الماء، ثم يصل إلى مصر ليكونوا شرْعاً فيه\n وفي رواية: أنهم دفنوه في ضفة النيل فخصبت وجدبت الأولى، فجعلوه في صندوق، ودفنوه في النيل فاخضرت الجهتان، ثم نقله موسى عليه السلام إلى مدفن آبائه\n\n\nوكان عمره: مائة وعشرين سنة، وقد تقدم ذكر أولاده الثلاثة: إفراثيم، وميشا، ورحمة امرأة أيوب، وتقدم البحث فيها، وذكر في الزهر الأنيق أنه ولد له من زليخا عشرة أولاد، فانظره\n والله تعالى أعلم\n الإشارة: إذا كان العبد في زيادة من الأعمال، وفي الترقي إلى مقامات الكمال، فلا بأس أن يتمنى البقاء في هذه الدار لزيادة الزاد إلى دار القرار، وإذا كان في نقصان من الأعمال، أو خاف النقصان بعد الكمال، فلا بأس بطلب الرحيل والانتقال كما طلبه الصَّديق عليه السلام بعد الملك التام\n وكما فعل عمر رضي الله عنه حين انتشرت رعيته، وخاف التقصير في سيرته\n وقد تقدم في سورة البقرة تفصيل ذلك، ولقد أحسن الشاعر في التحذير، من الاغترار بزخرف هذه الدار، فقال:\n\nثم نبه الحق تعالى أن الإخبار بقصة يوسف عليه السلام من أعلام النبوة لنبينا صلى الله عليه وسلم، فقال: { ذَلِكَ مِنْ أَنْبَآءِ ٱلْغَيْبِ نُوحِيهِ إِلَيْكَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "62:3",
      "similarity": 0.6700559545146653
    },
    {
      "verse": "26:83",
      "similarity": 0.6385219653778227
    },
    {
      "verse": "34:27",
      "similarity": 0.605836938660378
    },
    {
      "verse": "3:170",
      "similarity": 0.5594346192958045
    },
    {
      "verse": "6:14",
      "similarity": 0.34717429533826866
    }
  ]
}