{
  "chapter": "يوسف",
  "text": "يوسف اعرض عن هذا واستغفرى لذنۢبك انك كنت من الخاطـين",
  "translations": [
    {
      "translation": "Ignore this affair, O Joseph; and you, O woman, ask forgiveness for your sin, for you were surely errant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph, disregard this. And you - woman - ask forgiveness for your sin, for indeed it is you who has been at fault.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph, stay away from such affairs and you, woman, ask forgiveness for your sin; the guilt is yours.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O Yusuf! Disregard this – and O woman! Seek forgiveness for your sin; indeed you are of the mistaken.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Yusuf! Turn away from this! (O woman!) Ask forgiveness for your sin, verily, you were of the sinful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Yusuf! turn aside from this; and (O my wife)! ask forgiveness for your fault, surely you are one of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph, turn away from this; and thou, woman, ask forgiveness of thy crime; surely thou art one of the sinners.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Joseph! Turn away from this, and thou, (O woman), ask forgiveness for thy sin. Lo! thou art of the faulty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph, overlook this: but you [wife], ask forgiveness for your sin, for you have done wrong.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yusuf! turn away therefrom; and, thou woman! ask forgiveness for thy sin; verily thou hast been of the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph, let this matter alone, and you, woman, plead for forgiveness for your sin, for you have indeed been erring.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Joseph, pass this over! (O wife), ask forgiveness for thy sin, for truly thou hast been at fault!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Yusuf (Joseph)! Turn away from this! (O woman!) Ask forgiveness for your sin. Verily, you were of the sinful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph, turn away from this. And you, ask forgiveness for your sin. You are indeed one of the sinners'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Joseph, turn away from this. And you, woman, ask forgiveness for your sin; you are indeed in the wrong.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph, ignore this. And, [my wife], ask forgiveness for your sin. Indeed, you were of the sinful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:29] Then he said: O, Joseph, ignore this, matter and do not mention it [to anyone], lest it be broadcast; and you, O Zulaykhā, ask forgiveness for your sin: surely you have been of the erring’, the sinful; but the tale was reported and became public.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Her brother then said to Joseph: (0 Joseph! Turn away from this) and do not inform anyone. And then he turned to the woman and said: (and thou, (0 woman), ask forgiveness for thy sin) seek your husband's forgiveness for your act. (Lo! thou art of the sinful) you cheated your husband.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما انكشف الامر من عند العزيز، وجزم ذيل يوسف ونجابة طينته، بادر إلى ستره وإخفائه؛ خوفاً من الفضيحة، فقال منادياً ليوسف أولاً لصدقه وطهارته: { يُوسُفُ } أي: يوسف { أَعْرِضْ عَنْ هَـٰذَا } التكلم واكتمه في سرك، فقد ظهر عندي صدقك وبراءتك { وَٱسْتَغْفِرِي } يا راعيل أو زليخا { لِذَنبِكِ } في هذا الأمر { إِنَّكِ كُنتِ مِنَ ٱلْخَاطِئِينَ } [يوسف: 29] المتعمدين القاصدين على الجريمة القبيحة الدنيئة الشنيعة: جمعه جمع الذكور للتعذيب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم التفت العزيزُ إلى يوسف وقال: { يوسفُ } اي: يا يوسف\n وحذف النداء إشارة إلى تقريبه وملاطفته، { أعرضْ عن هذا } الأمر واكتمه، ولا تذكره، { واستغفري } يا زليخا { لذنبك إنك كنت من الخاطئين } من القوم المذنبين من خطأ إذا أذنب متعمداً\n والتذكير للتغليب\n قاله البيضاوي\n  الإشارة: إذا أراد الله أن يصافي عبده بخصوصية النبوة، أو الولاية، كلأه بعين الرعاية، وجذبه إليه بسابق العناية فإذا امتحنه أيَّده بعصمته، وسابق حفظه ورعايته، ولا يلزم من ثبوت الخصوصية عدم وصف البشرية فالشهوة في البشر أمر طبيعي وبمجاهدتها ظهر شرفه\n لكن النفس المطمئنة لا تحتاج في دفعها إلى كبير مجاهدة\n والنفس اللوامة لا بد في دفعها من المكابدة والمجاهدة فالهواجم والخواطر ترد على القلوب كلها، لكن النفس المطمئنة لها قوة على دفعها، وقد تتصرف فيها بإمضاء ما قدره الله الواحد القهار عليها\n { وكان أمرالله قدراً مقدوراُ }\n وذلك كمال في حقهم لا نقصان إذ بذلك تتميز قهرية الربوبية من ضعف العبودية، فما ظهرت كمالات الربوبية إلا بظهور نقائص العبودية\n أما الإصرار على العيوب فلا يوجد مع الخصوصية مطلقاً، وأما هجومها على العبد من غير إصرار فيكون مع وجود خصوصية النبوة والولاية، وقد تقع بها الزيادة إن صحبها الانكسار والإنابة\n وفي الحكم: \" ربما قضى عليك بالذنب فكان سبب الوصول \"\n والله تعالى أعلم\n واعلمْ أن ما امتحن به الصديق عليه السلام مع العصمة، قد وقع مثله كثيراً في هذه الأمة المحمدية مع الحفظ والامتناع ذكر الرصاع في كتاب التحفة: أن بعض الطلبة كان ساكناً في مدرسة فاس، فخرجت امرأة ذات يوم إلى الحمام بابنتها، فَتَلَفتْ البنت وبقيت كذلك إلى الليل، فرأت باباً خلفه ضوء، فأتت إليه، فوجدت فيه رجلاً ينظر في كتاب، فقالت: إن لم يكن الخير عند هذا فلا يكون عند أحد\n فقرعت الباب، فخرج الرجل فذكرت له قصتها، وأنها خافت على نفسها، فرأى أنه تَعَيَّنَ عليه حفظها، فأدخلها وجعل حصيراً بينه وبينها، وبقي كذلك ينظر في كتابه، فإذا بالشيطان زين له عمله، فحفظه الله ببركة العلم، فأخذ المصباح، وجعل يحرك أصابعه واحداً بعد واحد حتى أحرقها، والبنت تنظر إليه وتتعجب\n ثم خرج ينظر إلى الليل فوجده ما زال، فأحرق أصابع اليد الأخرى، ثم لاح الضوء، فقال: اخرجي، فخرجت إلى دارها سالمة، فذكرت القضية لوالديها، فأتى أبوها إلى مجلس العلم، وذكر القصة للشيخ، فقال للحاضرين: أخرجوا أيديكم وأمنوا على دعائي لهذا الرجل، فأخرجوا أيديهم، وبقي رجل، فعلم الشيخ أنه صاحب القضية، فناداه، فأخبره، فذكر أنه زوجه الأب منها\n\n\nهـ\n مختضراً\n فمن ترك شيئاً لله عوضه الله مثله، أو أحسن منه\n وكذلك فعل الحق تعالى بيوسف عليه السلام قد زوجه زليخاً على ما يأتي إن شاء الله\n  وحدثني شيخي مولاي العربي رضي الله عنه، أنه وقف على حكايات تناسب هذا وهو أن رجلاً صالحاً تعلق قلبه بابنة الملك، فلما رأى نفسه أنه لا يقدر على تزوجها تطلف حتى دخل عليها في قبتها ليلاً، فوجدها نائمة على فراشها ملقى على وجهها رداؤها، وشمعة تشعل عند رأسها، وأخرى عند رجلها، وطعام موضوع عندها\n فكشف عن وجهها فرأى من الجمال ما أبهر عقله فجعل يتردد في نفسه، ويخاصمها على فعل الفاحشة، فبينما هو كذلك إذ أبصر لوحاً فوق رأسها مكتوباً فيه:\n\n[الطلاق: 2]، فتاب الله تعالى عليه، وزجر نفسه عن هواها، فوضع يده في ذلك الطعام ليأكل منه، وترك فيه؟ أثراً، فلما أفاقت البنت رأت أثر اليد في الطعام، فسألت أهل الدار، فكلهم قالوا: ما دخل عليك أحد منا، فتيقنت أن رجلاً دخل عليها، وكان يخطبها كثيرٌ ممن له الرئاسة والجاه، فخافت على نفسها من أن يطرقها أحد منهم فيغضبها، فقالت لأبيها: لا بد أن تروجني، فقال في نفسه: والله لا أزوجها إلا لرجل صالح، فخرج مختفياً إلى المدرسة، فأتى بعض الناس، فقال: سمعت هنا برجل صالح، فأردت أن أزوره، فأشار إلى ذلك الرجل الذي دخل على بنته، ثم سأل ثانياً، وثالثاً، فكلهم أشار إليه، فأتى إليه فقال له: إن لي بنتاً جميلة خطبها مني كثير من الناس، فأردت أن أزوجكها، فجهزها بما يليق بها، وزوجها إياه\n هـ\n  وذكر ابن عرضون: إن رجلاً كان بالقيروان من العلماء الأتقياء، يقال له شقران، وكان جميل الصورة فهوته امرأة، فأرسلت إلى عجوز، وأسرت إليها أمره على أن توصله إليها، فأتت إليه العجوز، وقالت: عندي ابنة مريضة، وأرادت أن توصي، وعسى أن تصل إليها، وتدعو لها، فلبس ثيابه، ومشى معها إلى أن وصلت إلى الدار فأدخلته، فوجد صبية جميلة، فقالت له: هلمّ، فقال: إني أخاف الله رب العالمين\n فقالت له العجوز: هيهات شقران، والله لئن لم تفعل لأصيحنَّ، وأقول: إنك دخلت علينا عارضتنا، فقال لها: إن كان ولا بد فدعيني حتى أدخل الحجرة، فقالت له: افعل ما بدا لك، فدخل الحجرة، فقال: اللهم إنها ما هوت مني إلا صورتي فَغَيَّرها، فخرج من الحجرة وقد ظهر عليه الجذام\n فلما رأته، قالت: اخرج فحرج سالماً\n وهذه الحكاية مشهورة ببلاد القيروان\n هـ\n  قلت: وقد نزل بنا في حال شبابنا كثير مما يشبه هذا، فحفظنا الله بمنّه وكرمه وحسن رعايته\n فللَّهِ المنة والحمد، لا أحصي ثناء عليه\n ولما شاع خبر زليخا مع يوسف عليه السلام عاب عليها بعض النسوة، كما قال تعالى: { وَقَالَ نِسْوَةٌ فِي ٱلْمَدِينَةِ }\n\n",
      "translations": []
    }
  ]
}