{
  "chapter": "يوسف",
  "text": "وشروه بثمنۭ بخس درهم معدودة وكانوا۟ فيه من الزهدين",
  "translations": [
    {
      "translation": "They sold him for a pittance, a few small coins, considering him to be of little worth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sold him as worthless for a few paltry dirham.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Later they sold him for a paltry sum - just a few dirhams; they did not care to obtain a higher price.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In selling him they asked for a very small price and even then no one wanted to buy him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the brothers sold him for an improper price, a limited number of coins; and they had no interest in him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sold him for a Bakhs price, - for a few Dirhams. And they were of those who regarded him insignificant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sold him for a small price, a few pieces of silver, and they showed no desire for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they sold him for a paltry price, a handful of counted dirhams; for they set small store by him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sold him for a low price, a number of silver coins; and they attached no value to him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Later they sold him for a paltry sum, a few pieces of silver [dirhams]: So little did they value him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sold him for a mean price: a few dirhams numbered and they were in regard to him of the indifferent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sold him for a cheap price, a few dirhams, for they set small store by him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (Brethren) sold him for a miserable price, for a few dirhams counted out: in such low estimation did they hold him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sold him for a low price, - for a few Dirhams (i.e. for a few silver coins). And they were of those who regarded him insignificant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, they sold him for a trifling price, a number of dirhams, because they considered him to be of little value.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sold him for a cheap price—a few coins—they considered him to be of little value.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sold him for a reduced price - a few dirhams - and they were, concerning him, of those content with little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:20]   Then they sold him — they [the caravan] purchased him from them — for a very low, a diminished, price, a handful of dirhams, 20 or 22; for they, that is, his brothers, set small store by him. So the caravan brought him to Egypt, where the one who had bought him sold him for 20 dinars, two pairs of sandals and two robes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they sold him) the brothers of Malik Ibn Du'ar bought him (for a low price) by cheating in weight; it is also said that he was bought with false money; and it was also said that he was bought with unlawful money, (a number of silver coins) 20 silver coins; it is also said: 32 silver coins; (and they attached no value to him) they were reluctant to buy him because they did not need him; it is also said that the brothers of 244 Joseph attached no importance to Joseph because they did not know his standing and stature with Allah, Exalted is He. It is also said that the people of the caravan attached no value to Joseph.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَشَرَوْهُ } معناه بَاعُوهُ { بِثَمَنٍ بَخْسٍ } معناهُ نَاقصٌ قَليلٌ\n ويقالُ ثَمنٌ حَرامٌ\n وقالوا كَانتْ عشرين درهماً ويقال: أَربَعونُ درهماً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And sell them [in exchange] for a small price\" - this means that they should be sold for a price that is less than their worth.\n\n\nThe price of something is said to be haram if it is unfair or excessively high.\n They said it was twenty dirhams, and it is said: forty dirhams.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما اطلع أخوة وسف على قدوم السيارة ونزولهم على الجب تسارعوا نحوهم ليبيعوه لهم حتى يخلصوا منه بالكلية، فوصلوا الجب ولم يجدوه وبادروا إلى القفل فتجسسوه، فوجدوه عندهم، فقالوا لهم: هذا عبدنا قد أبق منا، إن اشتريتم نشرته على ما رضيتم، وأقر يوسف على الرقية ولم ينكر عليهم؛ خوفاً من القتل { وَشَرَوْهُ } بعدما اعترف بالرقية وباعوه { بِثَمَنٍ بَخْسٍ } بمخوس منقوص { دَرَاهِمَ } لا دنانير { مَعْدُودَةٍ } أي: قليلة { وَ } إنما شروه بها؛ لأنهم { كَانُواْ فِيهِ مِنَ ٱلزَّاهِدِينَ } [يوسف: 20] الراغبين المعرضين عنه، لذلئك باعوه بها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وشَرَوه } أي: باعه السيارة من الرفقة، أو إخوته، فيكون الضمير راجع لهم\n رُوي أن يهوذا كان يأتيه كل يوم بالطعام، فأتاه يومئذٍ فلم يجده فيها، وأخبر إخوته فأتوا الرفقة، وقالوا: هذا غلامنا فاشتروه، وسكت يوسف خوفاً من أن يقتلوه\n أو اشتروه من إخوته لأن شرى قد يستعمل بمعنى اشترى\n فاشتراه الرفقة منهم { بثمن بَخْسٍ } أي: مبخوس، لزيفه أو نقصانه، { دراهم مَعدودةٍ } قليلة، فإنهم يَزنُون ما بلغ الأوقية، ويعدُّون ما دونها\n قيل: كان عشرين درهماً\n وقيل: اثنين وعشرين\n رُوي أن الذي اشتراه منهم مالك بن ذعر المتقدم، وكان صعلوكاً، فسأل يوسف أن يدعو له فدعا له فصار غنياً\n رُوي أنه قال لهم: بكم تبيعونه؟ فقالوا له: إن اشتريته بعيوبه بعناه لك\n فقال: وما عيوبه؟ فقالوا: سارق كذاب، يرى الرؤيا الكاذبة\n فقال لهم: بكم تبيعونه لي مع عيوبه؟ ويوسف عليه السلام ينظر إليهم ولا يتكلم، وهو يقول في نفسه: ما أظنه يقوم بثمني لأنهم يطلبون أموالاً كثيرة\n قال لهم مالك: معي دراهم قليلة تعد ولا توزن، فقالوا له: هاتها\n فاشتراه منهم بتلك الدراهم المعدودة\n قال ابن عباس: كانت سبعة عشر درهماً، جعل له ذلك جزاء لما قوم نفسه، وظن أنهم يطلبون في الأموال\n هـ\n { وكانوا فيه من الزاهدين }: الراغبين عنه\n يحتمل أن يكون الضمير لإخوته، وزهدهم فيه ظاهر\n أو يكون للرفقة فإن بائعين كانوا بائعين فزهدهم فيه لأنهم التقطوه والملتقط للشيء متهاون به خائف من انتزاعه، وإن كانوا مبتاعين فلأنهم اعتقدوا أنه آبق\n قال الفراء: لما اشتراه منهم مالك، قال لهم: اكتبوا لي كتاباً بخطكم بأنكم بعتم مني هذا الغلام بكذا وكذا، فكتبوا له ذلك، فلما أراد الرحيل قالوا له: اربطه لئلا يهرب، فلما همَّ بربطه قال له يوسف: خلني أودِّع ساداتي فَلَعَلَّي لا ألقاهم بعد هذا اليوم\n\n\nفقال له مالك: ما أكرمك من مملوك، حيث يفعل بك هذا وأنت تتقرب منهم\n فقال له يوسف: كل أحد يفعل ما يليق به، فقال له: دونك، فقصدهم وهُم قيام صفاً واحداً، فلما دنا منهم بكوا وبكى يوسف عليه السلام، ثم قالوا: والله لقد ندمنا يا يوسف على ما فعلنا، ولولا الخشية من والدنا لرددناك\n هـ\n ثم ذهبوا به إلى مصر فباعوه، فاشتراه العزيز الذي كان خزائن مصر\n واسمه: \" قطفير \" ، وكان المَلِك يومئذٍ \" ريان بن الوليد العلقمي \" ، وقد آمن بيوسف، ومات في حياته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:15",
      "similarity": 0.11746990414942296
    },
    {
      "verse": "72:13",
      "similarity": 0.11373243686790645
    },
    {
      "verse": "26:183",
      "similarity": 0.10931175940077793
    },
    {
      "verse": "7:85",
      "similarity": 0.10472805282480999
    },
    {
      "verse": "11:85",
      "similarity": 0.10231221579029633
    }
  ]
}