{
  "chapter": "يوسف",
  "text": "ولما بلغ اشده ءاتينه حكما وعلما وكذلك نجزى المحسنين",
  "translations": [
    {
      "translation": "And then when he became a full-grown man. We gave him knowledge and right judgement too. That is how We reward all doers of good.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he reached the prime of life We gave him wisdom and knowledge. Thus We reward those who are good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Joseph reached the age of maturity, We granted him judgement and knowledge. Thus do We reward those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he attained maturity, God gave him strength, wisdom and knowledge. Thus, do We reward those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he matured to his full strength, We bestowed him wisdom and knowledge; and this is how We reward the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he [Yusuf] attained his full manhood, We gave him wisdom and knowledge (the prophethood), thus We reward the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had attained his maturity, We gave him wisdom and knowledge: and thus do We reward those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he was fully grown, We gave him judgment and knowledge. Even so We recompense the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And And when he reached his prime We gave him wisdom and knowledge. Thus We reward the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached maturity, We bestowed on him right judgement and knowledge. Thus We reward those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached his maturity We vouchsafed unto him judgement and knowledge; and Thus We recompense the well-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he came of age, We gave him judgement and [sacred] knowledge, and thus do We reward the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph attained His full manhood, We gave him power and knowledge: thus do We reward those who do right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he [Yusuf (Joseph)] attained his full manhood, We gave him wisdom and knowledge (the Prophethood), thus We reward the Muhsinun (doers of good - see V. 2:112).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he reached maturity, We bestowed on him judgment and knowledge. As such We recompense those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he reached his maturity, We gave him wisdom and knowledge. We thus reward the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Joseph reached maturity, We gave him judgment and knowledge. And thus We reward the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:22] And when he reached his prime — which was at 30 or 33 years of age — We gave him [power of] judgement, wisdom, and knowledge, understanding in [matters of] religion, before his call to prophethood. Thus, just as We rewarded him, We reward those who are virtuous, to [the good] of their souls.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا إخبار عن اصطفاء يوسف عليه السّلام للنبوءة . ذكر هنا في ذكر مبدأ حلوله بمصر لمناسبة ذكر منّة الله عليه بتمكينه في الأرض وتعليمه تأويل الأحاديث .والأشدُّ : القوة . وفسر ببلوغه ما بين خمس وثلاثين سنة إلى أربعين .والحكم والحكمة مترادفان ، وهو : علم حقائق الأشياء والعمل بالصالح واجتناب ضده . وأريد به هنا النبوءة كما في قوله تعالى في ذكر داود وسليمان عليهما السّلام { وكلاً آتينا حكماً وعلماً } \\[ سورة الأنبياء : 79 \\]. والمراد بالعلم علم زائد على النبوءة .وتنكير علماً } للنوعية ، أو للتعظيم . والمراد : علم تعبير الرؤيا ، كما سيأتي في قوله تعالى عنه : { ذلكما ممّا علّمني ربي } \\[ سورة يوسف : 37 \\].وقال فخر الدين : الحكم : الحكمةُ العملية لأنها حكمٌ على هدى النفس . والعلمُ : الحكمةُ النظرية .والقول في وكذلك نجزي المحسنين } كالقول في نظيره ، وتقدم عند قوله تعالى : { وكذلك جعلناكم أمةً وسطاً } في سورة البقرة ( 143 ).وفي ذكر المحسنين } إيماء إلى أنّ إحسانه هو سبب جزائه بتلك النعمة .وفي هذا الذي دبّره الله تعالى تصريح بآية من الآيات التي كانت في يوسف عليه السّلام وإخوته .\n\n",
      "translations": [
        {
          "translation": "(And when he reached his prime) between 18 and 30 years old (We gave him wisdom and knowledge) understanding and prophethood. (Thus We reward the good) in speech and works, in knowledge and wisdom.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَلَغَ أَشُدَّهُ } معناه انتِهاءُ سِنّهِ وشَبابِهِ وَقُوتِهِ من قَبلُ أَن يَأَخُذَ فِي النُّقصَانِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {He has reached the most intense of ages} means the end of his youth and his strength before he begins to decline.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوقال بعد قوله: { آتيناه حكماً وعلماً }\n { وكذلك نجزي المُحْسنين } في الطلب والإرادة والاجتهاد والرياضة\n ومراودة زليخاء إياه عن نفسه وتغليقها الأبواب عليه إشارة إلى ظهور النفس اللوّامة بصفتها\n فإنّ التلوين في مقام القلب يكون بظهور النفس كما أن التلوين في مقام الروح يكون بوجود القلب وجذبها للقلب إلى نفسها بالتسويل والاستيلاء عليه وتزيين صفاتها ولذاتها\n وسدّها طرق مخرجه إلى الروح بحجبها مسالك الفكر ومنافذ النور بصفاتها الحاجبة وهمه بها ميل القلب إليها لعدم التمكين والاستقامة ورؤيته لبرهان ربه إدراك ذلك التلوين بنور البصيرة ونظر العقل كما قيل في القصة: تراءى له أبوه\n فمنعه أو صوّت به\n وقيل: ضرب بكفه في نحره فخرجت شهوته من أنامله وذهبت\n كل ذلك إشارة إلى منع العقل إياه عن مخالطة النفس بالبرهان ونور البصيرة والهداية وتأثيره فيه بالقدرة والأيد النوريّ الموجب لذهاب شهوتها وظلمتها النافذ فيها إلى أطرافها المزيل عنها بالهيئة النورية الهيئة الظلمانية\n وقدّ قميصه من دبر إشارة إلى خرقها لباس الصفة النورية التي له من قبل الأخلاق الحسنة والأعمال الصالحة بتأثيرها في القلب بصفتها\n فإنها صفة يكسبها القلب بالجهة التي تلي النفس المسماة بالصدر وهو الدبر لا محالة\n وقوله: { ألفيا سيدها لدى الباب } إشارة إلى ظهور نور الروح عند إقبال القلب إليه بواسطة تذكر البرهان العقلي وورود الوارد القدسي عليه\n واستتباعه للنفس وهي تنازعه بالجذب إلى جهتها واستيلائه على القلب ثم على النفس بواسطته\n وقولها: { ما جزاء من أراد بأهلك سوءً } تلويح إلى أن النفس تسوّل أغراضها في صور المصالح العقلية وتزينها بحيث تشتبه مفاسدها بالمصالح العقلية التي يجب على العقل مراعاتها والقيام بها وموافقتها فيها ومخالفته إياها فيها إرادة السوء بها ومقابحها بالمحاسن التي تتعلق بالمعاش كمماكرة النساء بالرجال وميل القلب إلى الجهة العلوية يكذب قولها ودعواها\n والشاهد الذي شهد من أهلها قيل كان ابن عمّ لها\n أي: الفكر الذي يعلم أنّ الفساد الواقع من جهة الأخلاق والأعمال لا يكون غلا من قبل النفس واستيلائها\n إذ لو كان من جهة القلب وميله إلى النفس لوقع في الاعتقاد والعزيمة لا في مجرّد العمل\n وقيل كان ابن خالتها\n أي: الطبيعة الجسمانية التي تدل على الميل السفلي في النفس الجاذب للقلب من جهة الصدر المباشر للعمليات إلى أرض البدن وموافقاته واطلاع الروح بنور الهداية\n على أن الخلل وقع في العمل لا في العقد والعزيمة وذلك لا يكون إلا من قبل الداعية النفسانية\n وهو معنى قوله:  { فلما رأى قَمِيصه قُد من دُبُر قال إنه من كيدكنّ إنّ كيدكنّ عظيم }\n وقوله: { يوسف أعْرِضْ عن هذا واسْتغفري لِذَنبك } إشارة إلى إشراق نور الروح على القلب وانجذابه إلى جانبه للنازل النوريّ والخاطر الروحي الذي يصرفه عن جهة النفس ويأمره بالإعراض عن عملها ويذكره لئلا يحدث الميل مرة أخرى\n وتأثير ذلك الوارد والخاطر في النفس بالتنوير والتصفية فإن تنوّرها بنور الروح المنعكس إليها من القلب استغفارها عن الهيئة المظلمة التي غلبت بها على القلب",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا بَلَغَ } يوسف { أَشُدَّهُ } أي: كما عقله وقوته وأوانه ما بين الثلاثين والأربعين { آتَيْنَاهُ } إنجازاً لما وعدنا عليه في سابق علمنا وقضائنا { حُكْماً } أي: حكومة بين الناس مقارنة بين العدل والقسط { وَعِلْماً } بسرائر الأمور ورقائق المناسبات ومن جملتها تعبير الرؤيا { وَكَذٰلِكَ } أي: مثل إيتائنا إياه من الفضائل والفواضل المقدرة له في لوح القضاء { نَجْزِي ٱلْمُحْسِنِينَ } [يوسف: 22] الذين يحسنون الأدب معنا في جميع حالاتهم اتقاء منا وتوجيهاً إلينا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ولما بلغ أشده } منتهى اشتداد جسمه\n وكمال عقله\n وتقدم تفسير الهروي له\n وحده\n وقيل: ما بين الثلاثين والأربعين\n { آتيناه حكماً }: حكمة\n وهي النبوة\n أو العلم المؤيد بالعمل\n أو حُكماً بين الناس بالعدل\n\n{ وعلماً } يعني: علم تأويل الأحاديث\n أو علماً بأسرار الربوبية\n وكيفية آداب العبودية\n { وكذلك نجزي المحسنين } إذا كمل عقلهم\n وتوفر آدابهم\n وكمل تهذيبهم\n آتيناهم الحكمة وكمال المعرفة\n وفيه تنبيه على أنه تعالى إنما آتاه ذلك جزاء على إحسانه وإتقانه عمله في عنفوان شبابه\n  اَلإشارة: من ظن انفكاك لطف الله عن قدره فذلك لقصور نظره\n لا سيما لطفه بالمتوجهين إليه\n أو العارفين به الواصلين لحضرته\n فكل ما ينزل بهم فإنما هو أقدار جارية\n وأمداد سارية\n وأنوار بهية\n وألطاف خفية\n تسبق لهم الأنوار قبل نزول الأقدار\n فلا تحول حول قلوبهم الأكدار\n ولا تغير قلوبَهم رؤية الأغيار\n عند نزول شدائد الأقدار\n يحفظ عليهم أسرار التوحيد\n وينزل عليهم أنوار التأييد\n عند نزول القضاء الشديد\n والبلاء العتيد\n ولابن الفارض رضي الله عنه:\nوقال صاحبه العينية:\nوقد جرت عادة الله تعالى أن يعقب الجلال بالجمال\n والمحن بالمنن\n والذل بالعز\n والفقر بالغنى\n فبقدر ما تشتد المحن تأتي بعدها مواهب المنن\n ما ينزل من الجلال يأتي بعده الجمال\n سُنة الله في خلقه\n ولن تجد لسنة الله تبديلاً\n لا راد لما قضى\n ولا معقب لما به حكم وأمضى\n  قال تعالى: { والله غالبٌ على أمره }: قال بعض المفسرين: هذه الآية هي قطب هذه السورة\n ثم قال: أراد آدم البقاء في الجنة\n وما أراد الله ذلك\n فكان الأمْر مُراد الله\n وأراد إبليس أن يكون رأس البررة الكرام\n وأراد الله أن يكون إمام الكفرة اللئام\n فكان الأمر كما أراد الله\n وأراد النمرود هلاك إبراهيم عليه السلام\n ولم يرده الله\n فكان الأمر كما أراد الله\n وأراد فرعون هلاك موسى عليه السلام\n فأهلكه الله\n ونجى موسى\n وأراد داود أن يكون الملك لولده ميشا\n وأراد الله أن يكون لسليمان عليه السلام\n فكان كما أراد الله\n وأرد أبو جهل هلاك سيدنا محمدٍ صلى الله عليه وسلم ونبوة الوليد بن المغيرة\n فأهلك الله أبا جهل ونبأ محمداً صلى الله عليه وسلم\n وأراد المنذر بن عاد البقاء في الدنيا\n فأهلكه الله وخرب ملكه\n وأراد إرم العاتي\n الذي بنى ذات العماد\n يحاكي بها الجنة\n أن يسكنها خالداً فيها\n فكذبه الله\n وحال بينه وبينها\n وغيبها عنه حتى مات بحسرتها\n هـ\n ثم ذكر مراودة زليخا ليوسف\n وما كان من شأنهما\n فقال: { وَرَاوَدَتْهُ ٱلَّتِي هُوَ فِي بَيْتِهَا عَن نَّفْسِهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:14",
      "similarity": 0.9048057604971201
    },
    {
      "verse": "37:110",
      "similarity": 0.5061122157262191
    },
    {
      "verse": "37:80",
      "similarity": 0.5028497366943563
    },
    {
      "verse": "37:121",
      "similarity": 0.5028497366943563
    },
    {
      "verse": "37:131",
      "similarity": 0.5028497366943563
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}