{
  "chapter": "يوسف",
  "text": "ورودته التى هو فى بيتها عن نفسه وغلقت الابوب وقالت هيت لك قال معاذ الله انه ربى احسن مثواى انه لا يفلح الظلمون",
  "translations": [
    {
      "translation": "The woman whose house it was solicited him. She barred the doors and said, 'Come over here!' He said, 'Allah is my refuge! He is my lord and has been good to me with where I live. Those who do wrong will surely not succeed.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But she in whose house he resided wished to seduce him and, closing the doors, said: \"Come into me. \"God forbid!\" he said; \"he is my master who has approved my stay. Surely those who act wrongly do not prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it so happened that the lady in whose house Joseph was living, sought to tempt him to herself, and one day bolting the doors she said: \"Come on now!\" Joseph answered: \"May Allah grant me refuge! My Lord has provided an honourable abode for me (so how can I do something so evil)? Such wrong-doers never prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His master's wife then tried to seduce him. She locked the doors and said to him, \"Come on.\" He said, \"I seek refuge in God who has given me a good place of shelter. The unjust will certainly have no happiness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the woman in whose house he was, allured him not to restrain himself and she closed all the doors – and said, “Come! It is you I address!”; he said, “(I seek) The refuge of Allah – indeed the governor is my master – he treats me well; undoubtedly the unjust never prosper.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she, in whose house he was, sought to seduce him (to do an evil act), and she closed the doors and said: \"Come on, O you.\" He said: \"I seek refuge in Allah! Truly, he is my Rabb! He made my living in a great comfort! Verily, the wrongdoers will never be successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she in whose house he was sought to make himself yield (to her), and she made fast the doors and said: Come forward. He said: I seek Allah's refuge, surely my Lord made good my abode: Surely the unjust do not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now the woman in whose house he was solicited him, and closed the doors on them. 'Come,' she said, 'take me!' 'God be my refuge,' he said. 'Surely my lord has given me a goodly lodging. Surely the evildoers do not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she, in whose house he was, asked of him an evil act. She bolted the doors and said: Come! He said: I seek refuge in Allah! Lo! he is my lord, who hath treated me honourably. Lo! wrong-doers never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, the woman in whose house he lived, wanted to seduce him. One day she bolted the doors and said, \"Come!\" He replied, \"God forbid! Truly [your husband] is my master and has treated me honourably. Wrongdoers certainly never prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she in whose house he was, solicited him against himself; and she fastened the doors, and said: come on, O thou! He said: Allah be my refuge: verily he is my lord; he hath made me a goodly dwelling; verily the wrong-doers fare not well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The woman in whose house he was, solicited him. She closed the doors and said, ‘Come!!’ He said, ‘God forbid! Indeed He is my Lord; He has given me a good abode. Indeed the wrongdoers are not felicitous.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But she in whose house he was, sought to seduce him from his (true) self: she fastened the doors, and said: \"Now come, thou (dear one)!\" He said: \"Allah forbid! truly (thy husband) is my lord! he made my sojourn agreeable! truly to no good come those who do wrong!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she, in whose house he was, sought to seduce him (to do an evil act), she closed the doors and said: \"Come on, O you.\" He said: \"I seek refuge in Allah (or Allah forbid)! Truly, he (your husband) is my master! He made my stay agreeable! (So I will never betray him). Verily, the Zalimun (wrong and evil-doers) will never be successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she, in whose house he was, sought to seduce him and closed the doors saying: 'Come' 'In Allah is my refuge' he replied. 'My Lord has made my dwelling a good one. Harmdoers never prosper'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She in whose house he was living tried to seduce him. She shut the doors, and said, “I am yours.” He said, “God forbid! He is my Lord. He has given me a good home. Sinners never succeed.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she, in whose house he was, sought to seduce him. She closed the doors and said, \"Come, you.\" He said, \"[I seek] the refuge of Allah. Indeed, he is my master, who has made good my residence. Indeed, wrongdoers will not succeed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:23] And she, in whose house he was — namely Zulaykhā — attempted to seduce him, that is, she asked him to lie with her, and she closed the doors, of the house. And she said, to him: ‘Come!’ (hayta laka: the lām [of laka] is for clarification; a variant reading has hīta laka or haytu laka). ‘God forbid!’, I seek refuge with God from this, he said. ‘Truly he, who bought me, is my lord, my master, who has given me an honourable place, [an honourable] residence, and so I cannot betray him with regard to his family. Truly, evildoers, fornicators, never prosper’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And she, in whose house he was, asked of him an evil act. She bolted the doors) on her and Joseph (and said) to Joseph: (Come!) I am yours. (He said) Joseph said: (I seek refuge in Allah!) from such a thing. (Lo! he is my lord) The Chief Official, (who hath treated me honourably) in contrast to his own brothers. (Wrong- doers never prosper) adulterers will never be safe from or escape Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَيْتَ لَكَ } معناه هَلَّم إِلى فِعَالِهِ وهي بالحُورانيةِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Be to you,\" means go to His effect and it is in the [language of] the Houraniyyah.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل اتقاء يوسف الصديق من الله وقت اشتعال نار الشهوة في عنفوان الشباب\n حين { رَاوَدَتْهُ } أي: خادعته وألحت عليه بالوقاع { ٱلَّتِي } أي: الأمرأة التي { هُوَ } اي: يوسف { فِي بَيْتِهَا } وهي سيدته له حاكمة عليه\n وهي زليخا امرأة العزيز واحتالت عليه أن يخرجه { عَن } نزاهة { نَّفْسِهِ } ونجابة فطرته\n وهي العصمة والعفاف إلى ما تهوى نفسها وهو الوقاع والسفاح { وَ } بالغتت في ذلك المكر والاحتيال إلى أن { غَلَّقَتِ ٱلأَبْوَابَ } السبعة يوماً عليه وخلت معه في بيته { وَقَالَتْ } متحننة عليه معرضة نفسها إليه: { هَيْتَ لَكَ } أي: بادر يا يوسف إلى التعانق والجمع معي { قَالَ } يوسف على مقتضى نجابة النبوة وطهارة الفطرة بإلهام الله إياه مع سورة شهوته ووفور أمن ميله\n اتقاءً من محارم الله ورعاية لحق من أحسن إليه: { مَعَاذَ ٱللَّهِ } أي: أعوذ بالله معاذاً وألوذ نحوه أن يعصمني عن أمثال هذه الغفلة الذميمة والديدنة القبيحة سيما مع من يربيني { إِنَّهُ } أي: زوجك سيدي { رَبِّيۤ } يربيني بأنواع اللطف والكرم\n سيما { أَحْسَنَ مَثْوَايَ } وأوصى لك بإحساني\n فكيف أسيء في مقابلة إحسان محسني\n ومولي أمري ومولي نعمي { إِنَّهُ لاَ يُفْلِحُ } ويفوز { ٱلظَّالِمُونَ } [يوسف: 23] بالخير والحسنى\n لو خرجوا من مقتضى الأمر الإلهي\n سيما بالإساءة في معاملة الإحسان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: المراودة: المطالبة\n من راد يرود: إذا جاء وذهب لطلب الشيء\n ومنه الرائد\n وهيت: اسم فعل معناه: تعال\n أو أقبل\n مبني على الفتح كأين\n واللام للتبيين\n كالتي في سقيا لك\n وقرأ ابن كثير: بالضم\n تشبيهاً بحيث\n ونافع وابن عامر بالفتح\n وهي لغة فيه\n وقرئ: \" هئْت \" بالهمز كجئت\n من هَاءَ يهيء: إذا تهيأ\n ومعاذ الله: مصدر لمحذوف\n أي: أعوذ بالله معاذاً\n وإنه: ضمير الشأن\n ولولا: حرف امتناع\n وجوابها محذوف\n أي: لخالطها\n ولا يجوز أن يكون وهمَّ بها: جوابها لأن حكمها حكم الشرط\n فلا يتقدم عليها جوابها\n قاله البيضاوي\n  قلت: وبهذا يُرد على من وقف على همت به\n كالهبطى\n ومن تبعه\n إلا أن يُحمل على أنه ابتداء كلام مع حذف الجواب\n واستحسنه البعض ليكون همُّ يوسف خارجاً عن القسم\n وكذلك: في موضع المصدر\n أي: ثبتناه مثل ذلك التثبيت لنصرف\n\n الخ\n والمخلصين بالفتح: اسم مفعول من: أخلصه الله\n وبالكسر: اسم فاعل بمعنى أخلص دينه لله\n يقول الحق جل جلاله: { وراودتْه } للفاحشة\n أي: تمحلت وطلبت منه أن يوافقها { التي هو في بيتها } وهي زليخا\n وترك التصريح بها استهجاناً\n فراودته عن نفسه\n { وغلقتِ الأبوابَ } \n قيل: كانوا سبعة\n والتشديد للتكثير\n أو للمبالغة في الإيثاق\n { وقالت هَيت لك } أي: أقبل وبادر\n أو تهيأتُ لك\n رُوي أنها تزينت بأحسن ما عندها\n وقالت: تعالى يا يوسف\n { قال مَعَاذَ الله } أي: أعوذ بالله معاذاً\n { إنه } أي: الشأن\n { ربي أحسن مثواي } سيدي أحسن إقامتي وتربيتي\n إذ قال لك أكرمي مثواي\n فما جزاؤه أن أخونه في أهله\n أو أنه تعالى ربي أحسن مَنزلي بأن عطف عَلَيَّ قلبَ سيدي\n ولطف بي في أموري\n فلا أعصيه\n { إنه لا يُفلح الظالمون } المجاوزون الإحسان إلى الإساءة\n أو الزناة فإن الزنى ظلم على الزاني والمزنيّ بأهله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:72",
      "similarity": 0.09508092188439199
    },
    {
      "verse": "16:29",
      "similarity": 0.09479110466358641
    },
    {
      "verse": "40:76",
      "similarity": 0.09451033626425102
    },
    {
      "verse": "2:189",
      "similarity": 0.06522226202906495
    },
    {
      "verse": "39:32",
      "similarity": 0.06491305319995645
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:23.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:23.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}