{
  "chapter": "يوسف",
  "text": "واستبقا الباب وقدت قميصه من دبر والفيا سيدها لدا الباب قالت ما جزاء من اراد باهلك سوءا الا ان يسجن او عذاب اليم",
  "translations": [
    {
      "translation": "They raced to the door. She tore his shirt at the back. They met her husband by the door. She said, 'How should a man whose intention was to harm your family be punished for what he did except with prison or painful punishment?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both of them raced to the door, and she (grabbed and) rent his shirt from behind. They met her lord outside the door. \"There is no other penalty for a man,\" said she, \"who wanted to outrage your wife but imprisonment or grievous punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then both of them rushed to the door, each seeking to get ahead of the other, and she tore Joseph's shirt from behind. Then both of them found the husband of the lady at the door. Seeing him she said: \"What should be the punishment of him who has foul designs on your wife except that he should be imprisoned or subjected to painful chastisement?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She chased him to the door, grabbed him from behind, and tore off his shirt. Suddenly, they were face to face with her husband. (Looking accusingly at Joseph) she asked her husband, \"What punishment is more fitting for those who have evil desires towards your household other than imprisonment and painful torment?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they both raced towards the door, and the woman tore his shirt from behind, and they both found her husband at the door; she said, “What is the punishment of the one who sought evil with your wife, other than prison or a painful torture?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they raced with one another to the door, and she tore his shirt from the back. They both found her master (i.e. her husband) at the door. She said: \"What is the recompense (punishment) for him who intended an evil design against your wife, except that he be put in prison or a painful torment\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they both hastened to the door, and she rent his shirt from behind and they met her husband at the door. She said: What is the punishment of him who intends evil to your wife except imprisonment or a painful chastisement?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They raced to the door; and she tore his shirt from behind. They encountered her master by the door. She said, 'What is the recompense of him who purposes evil against thy folk, but that he should be imprisoned, or a painful chastisement?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they raced with one another to the door, and she tore his shirt from behind, and they met her lord and master at the door. She said: What shall be his reward, who wisheth evil to thy folk, save prison or a painful doom?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They both ran to the door and, in the struggle, she tore his shirt at the back. They found her husband at the door. She cried, \"Shall not the man who wished to violate your wife be thrown into prison or sternly punished?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the twain raced to the door, and she rent his shirt from behind, And the twain met her master at the door. She said: What is the meed of him who intended evil toward thy house hold except that he be imprisoned, or a torment afflictive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They raced to the door, and she tore his shirt from behind, and they ran into her husband at the door. She said, ‘What is to be the requital of him who has evil intentions for your wife except imprisonment or a painful punishment?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they both raced each other to the door, and she tore his shirt from the back: they both found her lord near the door. She said: \"What is the (fitting) punishment for one who formed an evil design against thy wife, but prison or a grievous chastisement?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they raced with one another to the door, and she tore his shirt from the back. They both found her lord (i.e. her husband) at the door. She said: \"What is the recompense (punishment) for him who intended an evil design against your wife, except that he be put in prison or a painful torment?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They raced to the door and she tore his shirt from behind. And by the door, they met her husband whereupon she said: 'What is the recompense of one whose intent is evil against your people other than being imprisoned, or sternly punished'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As they raced towards the door, she tore his shirt from behind. At the door, they ran into her husband. She said, “What is the penalty for him who desired to dishonor your wife, except imprisonment or a painful punishment?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they both raced to the door, and she tore his shirt from the back, and they found her husband at the door. She said, \"What is the recompense of one who intended evil for your wife but that he be imprisoned or a painful punishment?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:25] And they raced to the door: Joseph making for it in order to escape, while she, in order to grab hold of him, caught hold of his garment and pulled him towards her, and she tore his shirt from behind, whereupon they encountered her master, her husband, at the door. She, composed herself and then, said, ‘What is to be the requital of him who intends evil, [who intends] fornication, against your folk, but that he should be imprisoned, locked up in a jail, or [suffer] a painful chastisement?’, by having him beaten.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they raced with one another to the door) Joseph wanting to leave and her wanting to lock the door. The woman got there first (and she tore his shirt) in two (from behind) from the waist to his feet, (and they met her lord and master) the husband of the woman; and it is said: her cousin (at the door. She said) the woman said to her husband: (What shall be his reward, who wisheth evil) adultery (to your folk, save prison or a painful doom) be severely beaten?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وقصد أن يخرج وقصدت أيضاً أن تمنعه عن الخروج { وَٱسْتَبَقَا ٱلْبَابَ } أي: تسابقاً نحوه يسبقها يوسف فأخذت ذيل قيمصه { وَقَدَّتْ قَمِيصَهُ } أي: شقت ذيله { مِن دُبُرٍ } لأنها في عقبه\n ففتح يوسف الباب\n فخرجا متعاقبين مضطرين { وَأَلْفَيَا سَيِّدَهَا } أي: صادفا زوجها { لَدَى ٱلْبَابِ } وعنده { قَالَتْ } مسرعة باكية على سبيل الشكاية: { مَا جَزَآءُ } أي: أي شيء مكافأة { مَنْ أَرَادَ بِأَهْلِكَ سُوۤءًا } أي: قصد الزنا معها مكرهاً { إِلاَّ أَن يُسْجَنَ } أي: غير أن يقيد ويدخل في السجن { أَوْ عَذَابٌ أَلِيمٌ } [يوسف: 25] مؤلم أشد من السجن\n\n\nوإنما فعلتها وبادرت إلى الشكوى متباكية\n لتظهر براءتها وعصمتها عند زوجها وتحمل الخطأ على يوسف\n لتنتقم عنه أو تلينه وتضطره على نجاح مرادها\n مع أنها قد شغفها حباً ولم تصبر عنه لحظة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واسْتَبَقَا البَابَ } أي: تسابقا إلى الباب\n وابتدرا إليه\n وذلك أن يوسف عليه السلام فرَّ منها ليخرج حيث رأى البرهان\n وأسرعت وراءه لتمنعه الخروج\n { وقَدّت قميصَه من دُبُرٍ } أي: شقت قميصه من خلف لما اجتذبته لترده\n والقدُّ الشق طولاً\n والقَطُّ: الشق عرضاً\n { وألفيا سيدها }: وصادفاً زوجها { لدى الباب } وفيه إطلاق السيد على الزوج\n وإنما أفرد الباب هنا\n وجمعه في قوله: { وغلقت الأبواب } لأن المراد هنا الباب البراني الذي هو المخرج من الدار\n\n{ قالتْ } لزوجها: { ما جزاء من أراد بأهلك سوءاً إلا أن يَسجن أو عذابٌ أليم }؟ قالته إيهاماً أنها فرت منه تبرئة لساحتها عند زوجها\n وإغراء له عليه انتقاماً لنفسها لما امتنع منها\n { قال هي راودتني عن نفسي }: طالبتني بالمواقعة بها\n قال ذلك تبرئة لساحته\n ولو لم تكذب عليه ما قاله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:27",
      "similarity": 0.5212683695234233
    },
    {
      "verse": "12:26",
      "similarity": 0.5099119538315802
    },
    {
      "verse": "12:28",
      "similarity": 0.5077650512344931
    },
    {
      "verse": "37:69",
      "similarity": 0.4617623094130649
    },
    {
      "verse": "2:170",
      "similarity": 0.4473810352361557
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:25.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:25.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}