{
  "chapter": "يوسف",
  "text": "قال هى رودتنى عن نفسى وشهد شاهد من اهلها ان كان قميصه قد من قبل فصدقت وهو من الكذبين",
  "translations": [
    {
      "translation": "He said, 'It was she who tried to seduce me.' A witness from her people then declared, 'If his shirt is torn in front, she speaks the truth and he has clearly told a shameless lie.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Joseph) said: \"It was she who wanted to seduce me.\" And a witness from her family testified: \"If the shirt is torn from the front then the woman is speaking the truth, and he is a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said: \"It is she who was trying to tempt me to herself.\" And a witness belonging to her own household testified (on grounds of circumstantial evidence): \"If his shirt is torn from the front, then she is telling the truth and he is a liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said, \"It was she who tried to seduce me.\" Someone from the household in confirmation of Joseph's statement said, \"If his shirt it torn from the front, she has spoken the truth and he is lying,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Yusuf, “It was she who lured me, that I may not guard myself” – and a witness from her own household testified; “If his shirt is torn from the front, then the woman is truthful and he has spoken incorrectly.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Yusuf] said: \"It was she that sought to seduce me;\" and a witness of her household bore witness (saying): \"If it be that his shirt is torn from the front, then her tale is true and he is a liar!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: She sought to make me yield (to her); and a witness of her own family bore witness: If his shirt is rent from front, she speaks the truth and he is one of the liars:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'It was she that solicited me'; and a witness of her folk bore witness, 'If his shirt has been torn from before then she has spoken truly, and he is one of the liars;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Joseph) said: She it was who asked of me an evil act. And a witness of her own folk testified: If his shirt is torn from before, then she speaketh truth and he is of the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said, \"It was she who sought to seduce me.\" One of her household testified, \"If his shirt is torn at the front then she is speaking the truth, and he is lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: it is she who solicited me against myself And a witness from her own household bare witness: if his shirt be rent in front, then she speaketh the truth and he is of the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘It was she who solicited me.’ A witness of her own household testified [thus]: ‘If his shirt is torn from the front, she tells the truth and he lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"It was she that sought to seduce me - from my (true) self.\" And one of her household saw (this) and bore witness, (thus):- \"If it be that his shirt is rent from the front, then is her tale true, and he is a liar!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Yusuf (Joseph)] said: \"It was she that sought to seduce me,\" - and a witness of her household bore witness (saying): \"If it be that his shirt is torn from the front, then her tale is true and he is a liar!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Joseph) said: 'It was she who sought to seduce me' and a witness (an infant) of her people bore witness, saying: 'If his shirt is torn from the front, she is speaking the truth and he is one of the liars,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “It was she who tried to seduce me.” A witness from her household suggested: “If his shirt is torn from the front: then she has told the truth, and he is the liar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Joseph] said, \"It was she who sought to seduce me.\" And a witness from her family testified. \"If his shirt is torn from the front, then she has told the truth, and he is of the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:26] He, Joseph, said, declaring himself innocent [of the charge]: ‘It was she who attempted to seduce me’. And   a witness of her own folk testified, her paternal cousin — it is reported that he was still [a child] in the cradle — and he said: ‘If his shirt has been torn from the front, then she speaks the truth, and he is of the liars;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Joseph) said: She it was who asked of me an evil act) it is her who called me and offered herself to me. (And in witness of her own folk testified) a man taken as judge from her own people, her brother and it is said her cousin, pronounced: (If his shirt) the shirt of Joseph (is torn from before) from the front, (then she speaketh truth) then the woman has spoken the Truth (and he is of the liars).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } يوسف مستحيياً من ربه: يا سيدي ما لي في ذلك خطأ { هِيَ } بنفسها { رَاوَدَتْنِي } أي: خادعتني { عَن نَّفْسِي } وبعما تعارضا عند السيد { وَشَهِدَ شَاهِدٌ } هو صبي في المهد أبهم في الشهادة وأجمل؛ لأنه كان { مِّنْ أَهْلِهَآ } وابن عمها أو ابن خالها فقال الشاهد: { إِن كَانَ قَمِيصُهُ } أي: قميص يوسف { قُدَّ مِن قُبُلٍ } أي: شق من قدامه { فَصَدَقَتْ } زليخا { وَهُوَ } أي: يوسف { مِنَ الكَاذِبِينَ } [يوسف: 26] في دعوى البراءة والتنزيه { وَإِنْ كَانَ قَمِيصُهُ قُدَّ مِن دُبُرٍ } أي: خلف { فَكَذَبَتْ } هي في دعوى العصمة والعفة { وَهُوَ مِن الصَّادِقِينَ } [يوسف: 27] فما ادعى من العفة والبراءة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { وَشَهِدَ شاهدٌ من أهلها } ، قيل: ابن عمها\n وقيل: ابن خالها صبياً في المهد\n وكونه من أهلها أوجب للحجة عليها، وأوثق لبراءة يوسف\n وكونه لم يتكلم قط، ثم تكلم كرامة ليوسف عليه السلام، وعن النبي صلى الله عليه وسلم:\n\n \" تكلم في المهد أربعةٌ: ابنُ ماشِطة ابنة فرعَون، وشَاهِدُ يُوسفَ، وَصَاحِبُ جُرَيْج، وعيسَى \" \n\nوذكر مسلم في صحيحه ـ في قصة الأخدود ـ: \" أن امرأة أتِي بها لتُطْرَح في النار، ومعها صبي يرضع، فقال لها: يا أمه اصبري، لا تجزعي\n فأنك على الحق \"\n وعَدَّ بعضهم عشرة تكلموا في المهد، فذكر إبراهيم عليه السلام، ويحيى بن زكريا، ومريم، ونبينا محمد صلى الله عليه وسلم، وطفلاً في زمنه عليه السلام، وهو: مبارك اليمامة، وقد نظمهم السيوطي، وزاد واحداً، فقال:\n\nوذكر ابن وهب عن أبي لهيعة قال: بلغني أن المولود فيما تقدم كان يولد في الليل، فيصبح يمشي مع أمه\n هـ\n وضعف ابن عطية كون شاهد يوسف صبياً بالحديث \" لم يتكلم في المهد إلا ثلاثة \" ، وبأنه لو كان الشاهد صبياً لكان الدليل نفس كلامه، دون أن يحتاج إلى الاستدلال بالقميص\n هـ\n وقد يجاب بأن الحصر باعتبار بني إسرائيل، مع أن الوحي يتزايد شيئاً فشيئاً، فأخبر بثلاثة، ثم أخبر بآخرين، وبأن الاستدلال وقع بهما تحقيقاً للقضية\n  ثم ذكر الحق تعالى ما قاله الشاهد، فقال: { إن كان قميصُه قُدَّ من قُبلٍ فصدقت وهو من الكاذبين } لأنه يدل على أنها قدت قميصه من قُدامه بالدفع عن نفسها\n أو لأنه أسرع خلفها فعثر بذيله فانقدَّ جَيبُه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:27",
      "similarity": 0.9292796337371698
    },
    {
      "verse": "12:28",
      "similarity": 0.8585045509824489
    },
    {
      "verse": "72:11",
      "similarity": 0.5575998695373462
    },
    {
      "verse": "12:93",
      "similarity": 0.5307963309083159
    },
    {
      "verse": "12:25",
      "similarity": 0.5099119538315803
    }
  ]
}