{
  "chapter": "يوسف",
  "text": "وقال الذى اشترىه من مصر لامراته اكرمى مثوىه عسى ان ينفعنا او نتخذه ولدا وكذلك مكنا ليوسف فى الارض ولنعلمه من تاويل الاحاديث والله غالب على امره ولكن اكثر الناس لا يعلمون",
  "translations": [
    {
      "translation": "The Egyptian who had bought him told his wife, 'Look after him with honour and respect. It's possible he will be of use to us or perhaps we might adopt him as a son.' And thus We established Yusuf in the land to teach him the true meaning of events. Allah is in control of His affair. However, most of mankind do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Egyptian who bought him instructed his wife: \"House him honourably. He may be of use to us. We may even adopt him as a son.\" So, We firmly established Joseph in the land, and taught him the interpretation of dreams. God dominated in his affairs, though most men do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The man from Egypt who bought him said to his wife: \"Take good care of him, possibly he might be of benefit to us or we might adopt him as a son.\" Thus We found a way for Joseph to become established in that land and in order that We might teach him to comprehend the deeper meaning of things. Allah has full power to implement His design although most people do not know that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Egyptian who bought him said to his wife, \"Be kind to him, perhaps he will be of some benefit to us or we may adopt him.\" Thus, We settled Joseph in the land so that We could teach him the interpretation of dreams. God has full control over His affairs but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Egyptian who purchased him said to his wife, “Keep him honourably – we may derive some benefit due to him or we may adopt him as our son”; and this is how we established Yusuf in the land, and that We might teach him how to interpret events; and Allah is Dominant upon His works, but most men do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he (the man) from Egypt who bought him, said to his wife: \"Make his stay comfortable, maybe he will profit us or we shall adopt him as a son.\" Thus did We establish Yusuf in the land, that We might teach him the interpretation of events. And Allah has full power and control over His affairs, but most of men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Egyptian who bought him said to his wife: Give him an honorable abode, maybe he will be useful to us, or we may adopt him as a son. And thus did We establish Yusuf in the land and that We might teach him the interpretation of sayings; and Allah is the master of His affair, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He that bought him, being of Egypt, said to his wife, 'Give him goodly lodging, and it may be that he will profit us, or we may take him for our own son.' So We established Joseph in the land, and that We might teach him the interpretation of tales. God prevails in His purpose, but most men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he of Egypt who purchased him said unto his wife: Receive him honourably. Perchance he may prove useful to us or we may adopt him as a son. Thus we established Joseph in the land that We might teach him the interpretation of events. And Allah was predominant in His career, but most of mankind know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Egyptian who bought him said to his wife, \"Lodge him honourably, he may prove of benefit to us, or we may even adopt him as our son.\" Thus We established Joseph in the land, so that We might teach him the true meaning of events. God has power over all things. However, most people do not know this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who bought him in Misr said unto his wife: make his dwelling honourable: belike he may profit us or we may take him as a son. And Thus We made a place for Yusuf in the land, and it was in order that We may teach him the interpretation of discourses. And Allah is Dominant in His purpose, but most of men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The man from Egypt who had bought him said to his wife, ‘Give him an honourable place [in the household]. Maybe he will be useful to us, or we may adopt him as a son.’ Thus We established Joseph in the land and that We might teach him the interpretation of dreams. Allah has [full] command of His affairs, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The man in Egypt who bought him, said to his wife: \"Make his stay (among us) honourable: may be he will bring us much good, or we shall adopt him as a son.\" Thus did We establish Joseph in the land, that We might teach him the interpretation of stories (and events). And Allah hath full power and control over His affairs; but most among mankind know it not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he (the man) from Egypt who bought him, said to his wife: \"Make his stay comfortable, may be he will profit us or we shall adopt him as a son.\" Thus did We establish Yusuf (Joseph) in the land, that We might teach him the interpretation of events. And Allah has full power and control over His Affairs, but most of men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Egyptian that bought him said to his wife: 'Make his stay honorable. He may benefit us, or take him for our son' As such We established Joseph in the land, so that We might teach him the interpretation of visions. Allah prevails in His affairs, though most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Egyptian who bought him said to his wife, “Take good care of him; he may be useful to us, or we may adopt him as a son.” We thus established Joseph in the land, to teach him the interpretation of events. God has control over His affairs, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the one from Egypt who bought him said to his wife, \"Make his residence comfortable. Perhaps he will benefit us, or we will adopt him as a son.\" And thus, We established Joseph in the land that We might teach him the interpretation of events. And Allah is predominant over His affair, but most of the people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:21] And he of Egypt who purchased him, Potifar, the Court Officer (Qitfīr al-‘azīz), said to his wife, Zulaikha (Zulaykhā), ‘Give him an honourable place, [an honourable] residence with us. Maybe he will be useful to us, or we may adopt him as a son’ — for he was chaste. Thus, just as We delivered him from being killed and from the well, and softened the Court Officer’s heart for him, We established Joseph in the land, the land of Egypt, until he attained what [status] he attained, that We might teach him the interpretation of events, the interpretation of visions (wa-li-nu‘allimahu min ta’wīli’l-ahādīth is a supplement to an implied [missing part] connected to makkannā, ‘We established’, in other words, [an implied] li-numallikahu, ‘so that We might give him kingship’; or else the wāw [of wa-li-nu‘allimahu, ‘that We might teach him’] is [to be understood as being] extra). God’s way [always] prevails, exalted be He, nothing being beyond Him, but most people — and they are the disbelievers — do not know, this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he of Egypt) the Chief Official, who was the treasurer of the king and the chief of his soldiers. His name was Potiphar (Qitfir) (who purchased him said unto his wife) Zelicha (Zulaykha): Receive him honourably. Perchance he may prove useful to us) in our farm (or we may adopt him as a son). This man bought Joseph for the price of 20 silver coins, a garment and a pair of sandals. (Thus We established Joseph) We gave him authority (in the land) of Egypt (that We might teach him the interpretation of events) the interpretation of dreams. (And Allah was predominant in his career) Allah is dominant in things destined; no one can repel His destined things, (but most of mankind) the people of Egypt (know not) nor believe; it is also said that this means: most do not know that Allah is dominant in the things that He destined.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَكْرِمِي مَثْوَاهُ } معناه مَنزِلَهُ ومَقامَهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Exalted is His abode,\" means His status and position.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولما اشتراه مالك بن ذعر من إخوته بما اشتراه، ذهب به إلى مصر بضاعة، فلما وصلوا إلى مصر وأراد أن يبيعه، فسلمه إلى النخاص فباعه { وَقَالَ ٱلَّذِي ٱشْتَرَاهُ مِن مِّصْرَ } وهو العزيز الذي كان على خزائن ملك مصر، واسمه: قطفير أو أطفير، حين ذهب به إلى بيته { لاِمْرَأَتِهِ } زليخا أو راعيل: { أَكْرِمِي مَثْوَاهُ } وأحسني حاله ومعاشه، وتلطفي معه بانواع اللطف، والشفقة، إني أتفرص منه الرشد والنجابة { عَسَىٰ أَن يَنفَعَنَآ } بعقله ورشده وكفايته وتدبيره { أَوْ نَتَّخِذَهُ وَلَداً } يستخلف منا؛ لأنه كان عقيماً فأراد أن يتبناه { وَكَذٰلِكَ } أي: مثل ما عطفنا عليه العزيز بعد قهر إخوته وفرقة أبيه وأخيه وغربته من وطنه، ووحشته في غيابة الجب وذل رقبته { مَكَّنَّا لِيُوسُفَ فِي ٱلأَرْضِ } أي: جعلناه متصرفاً ذا قدرة واختيار في ارض مصر، ليتصرف فيها بالرشد التام والقدر الكاملة { وَلِنُعَلِّمَهُ } وننبه عليه { مِن تَأْوِيلِ ٱلأَحَادِيثِ } الواقعة في عالم الكون والفساد طريق الرشد والعدالة؛ ليصل بها إلى الاعتدال الحقيقي { وَٱللَّهُ } المدبر لأمور عباده { غَالِبٌ عَلَىٰ أَمْرِهِ } المراد له، المتعلق بمصالح بعض عباده { وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لاَ يَعْلَمُونَ } [يوسف: 21] غلبته واستقلاله في أمره وتصرفه في ملكه، لذلك اشتغلوا بخلاف مراده والسعي في إبطاله كإخوة يوسف، فلم صلوا إلى ما قصدوا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { وقال الذي اشتراه من مصر لامرأته } راعيل، أو زليخا، { أكرمي مثواه } اجعلي مقامه عندنا كريماً، والمعنى: أحسني تعهده، { عسى أن ينفعنا } في ضِياعنا وأموالنا، نستظهر به في مصالحنا، { أو نتخذه ولداً } أي: نتبنَّاه، وكان عقيماً، لما تفرس فيه من الرشد\n ولذلك قيل: أفرس الناس عزيز مصر، وابنة شعيب التي قالت:\n\n[القصص: 26]، وأبو بكر حين استخلف عمر\n قال البيضاوي: رُوي أنه اشتراه العزيز وهو ابن تسع عشرة سنة، ولبث في منزله ثلاث عشرة سنة، واستوزره الريان وهو ابن ثلاث وثلاثين سنة، وتوفي وهو ابن مائة وعشرين سنة\n واختلف فيما اشتراه به مَنْ جعل شراءً غير الأول، فقيل: عشرون ديناراً، وزوجاً نعل، وثوبان أبيضان\n وقيل: ملؤه ـ أي وزنه ـ فضة، وقيل: ذهباً\n هـ\n وقيل: مسكاً وحريراً\n  { وكذلك مكَّنَّا ليوسف في الأرض } أي: وكما مكنا محبته في قلب العزيز، أو كما مكناه في منزله، أو كما أنجيته، وعطفنا عليه العزيز مكناه في الأرض، ليتصرف فيها بالعدل، { ولنُعلِمَهُ من تأويل الأحاديث } أي: من تأويل كتب الله المتقدمة، أو من تأويل الأحكام الحادثة بين الناس ليحكم فيها بالعدل، أو من تعبير المنامات، ليستعد لها قبل حلولها\n أي: كان القصد في إنجائه وتمكينه: إقامته العدل، وتْيسير أمور الناس، وليعلَمَ معاني كُتب الله وأحكامه فينفذها، { والله غالبٌ على أمره }: لا يرده شيء، ولا ينازعه فيما يريد جبار، ولا عنيد، أو غالب على أمر يوسف، فيدبر أمره بالحفظ والرعاية، والنصر والعز في عاقبة أمره، خلاف ما أراد به إخوته، { ولكن أكثر الناس لا يعلمون } أن الأمر كله بيده، أو لا يفهمون لطائف صنعه، وخفايا لطفه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:99",
      "similarity": 0.5065917583896973
    },
    {
      "verse": "43:51",
      "similarity": 0.42204385852364895
    },
    {
      "verse": "10:87",
      "similarity": 0.40422919119723444
    },
    {
      "verse": "28:9",
      "similarity": 0.25364824538602915
    },
    {
      "verse": "12:56",
      "similarity": 0.22176855087927275
    }
  ]
}