{
  "chapter": "يوسف",
  "text": "ولقد همت به وهم بها لولا ان رءا برهن ربه كذلك لنصرف عنه السوء والفحشاء انه من عبادنا المخلصين",
  "translations": [
    {
      "translation": "She wanted him and he would have wanted her, had he not seen the Clear Proof of his Lord. That happened so We might avert from him all evil and lust. He was Our chosen slave.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the woman desired him, and he would have desired her but for the indication he received from his Lord. This was so that We may avert both evil and lechery from him, for he was one of Our chosen devotees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she advanced towards him, and had Joseph not perceived a sign from his Lord he too would have advanced towards her. Thus was Joseph shown a sign from his Lord that We might avert from him all evil and indecency, for indeed he was one of Our chosen servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She was determined to have him and were it not for his faith in God, he would certainly have yielded to her. Thus did We protect him from evil and indecency. He was certainly one of Our sincere servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed the woman desired him; and he too would have desired her were he not to witness the sign of his Lord*; this is what We did, to turn away evil and lewdness from him; indeed He is one of Our chosen bondmen. (* Allah saved him and he never desired this immorality.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed she did desire him, and he would have inclined to her desire, had he not seen the evidence of his Lord. Thus it was, that We might turn away from him evil and immoval sins. Surely, he was one of Our Mukhlasin servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly she made for him, and he would have made for her, were it not that he had seen the manifest evidence of his Lord; thus (it was) that We might turn away from him evil and indecency, surely he was one of Our sincere servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For she desired him; and he would have taken her, but that he saw the proof of his Lord. So was it, that We might turn away from him evil and abomination; he was one of Our devoted servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She verily desired him, and he would have desired her if it had not been that he saw the argument of his Lord. Thus it was, that We might ward off from him evil and lewdness. Lo! he was of Our chosen slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She started towards him, and he would have succumbed to her, if he had not seen a sign from his Lord -- We did this in order to keep evil and indecency away from him, for he was truly one of Our chosen servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly she besought him, and he would have besoughther were it not that he had seen the argument of his Lord. Thus We did, in order that We might avert from him all evil and indecency; verily he was of our bondmen single-hearted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She certainly made for him; and he would have made for her [too] had he not beheld the proof of his Lord. So it was, that We might turn away from him all evil and indecency. He was indeed one of Our dedicated servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (with passion) did she desire him, and he would have desired her, but that he saw the evidence of his Lord: thus (did We order) that We might turn away from him (all) evil and shameful deeds: for he was one of Our servants, sincere and purified.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed she did desire him and he would have inclined to her desire, had he not seen the evidence of his Lord. Thus it was, that We might turn away from him evil and illegal sexual intercourse. Surely, he was one of Our chosen, guided slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She desired him, had he not been shown the proof of his Lord he would have taken her. But We turned him away from evil and abomination, for he was one of Our sincere worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She desired him, and he desired her, had he not seen the proof of his Lord. It was thus that We diverted evil and indecency away from him. He was one of Our loyal servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she certainly determined [to seduce] him, and he would have inclined to her had he not seen the proof of his Lord. And thus [it was] that We should avert from him evil and immorality. Indeed, he was of Our chosen servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:24] And she certainly desired him, she sought sexual intercourse with him, and he would have desired her [too], he would have sought the same, had it not been that he saw the proof of his Lord: Ibn ‘Abbās said, ‘Jacob was made to appear before him, and he struck his [Joseph’s] breast, whereupon his [sexual] desire withdrew [from his body] through his fingernails (the response to lawlā, ‘had it not been’, has been omitted: [understood to be] la-jāma‘ahā, ‘he would have lain with her’). So it was, that We made him see the proof, that We might ward off from him evil, betrayal, and lewdness, [the act of] fornication. Truly he was of Our devoted servants, in terms of obedience (mukhlisīn: a variant reading has mukhlasīn, in other words, ‘chosen/purified [servants]’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(She) the woman (verily desired him, and he) Joseph (would have desired her if it had not been that he saw the argument of his Lord) if he had not seen that the chastisement of his Lord would befall him; it is also said that this means: if he had not seen the figure of his father; and it is also said that this means: if he had not seen the proof of his Lord. (Thus it was, that We might ward off from him evil and lewdness) adultery. (Lo! he was of Our chosen slaves) who are protected from adultery.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما رد يوسف عليها أمرها { لَقَدْ هَمَّتْ بِهِ } أي: قصدت زليخا وتعلقت به إرادة واختياراً لتصل إلى مرادها منه { وَهَمَّ } يوسف أيضاً { بِهَا } على مقتضى بشريته مع أنه لا إرادة له لمرادها ولا اختيار\n إذا الكف عن المنهي لا بدَّ وأن يكون عند القدرة عليه وإلا لم يكن ممدوحاً ولا مستوجباً للمثوبة والقربة { لَوْلاۤ أَن } أي: أنه { رَّأَى بُرْهَانَ رَبِّهِ } أي: دليله الواضح الدال على قبح الزنا وإساءة المسحن بإقاء الله إياه وإلهامه في قلبه\n لهلك بنيران طغيان القوة الشهوية\n لكن رآه بإراءة الله إياه\n فأبى وامتنع { كَذَلِكَ } فعلنا معه وألهمنا إليه { لِنَصْرِفَ عَنْهُ ٱلسُّوۤءَ وَٱلْفَحْشَآءَ } في مقابلة الإحسان والفحشاء بدل العصمة والعفاف { إِنَّهُ } إي: يوسف الصديق { مِنْ عِبَادِنَا ٱلْمُخْلَصِينَ } [يوسف: 24] الخالصين عن رين البشرية وشين شهوتها وغضبيتها\n المنزهين عن مقتضيات القوى مطلقاً\n\n\nوبعدما غلب على يوسف الاتقاء عن محارم الله على مقتضى البرهان الذي رأه بإراءة الله إياه\n بادر إلى الفرار منها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ولقد هَمَّتْ به وهمَّ بها } \n قال ابن جزي: أكْثََرَ الناسُ الكلامَ في هذه الآية\n حتى ألفوا فيها التآليف\n فمنهم مفرط ومُفرّط وذلك أن منهم من جعل هَمَّ المرأة وهَمَّ يوسف من حيث الفعل الذي أرادته\n وذكروا من ذلك روايات من جلوسه بين رجليها\n وحله للتكَّة\n وغير ذلك مما لا ينبغي أن يقال به لضعف نقله ولنزاهة الأنبياء عن مثله\n ومنهم من قال: همت به لتضربه على امتناعه\n وهَمَّ بها ليقتلها أو يضربها ليدفعها\n وهذا بعيد يرده قوله: { لولا أن رأى برهان رَبِّهِ }\n ثم قال: والصواب ـ إن شاء الله ـ: أنها همت به من حيث مرادُها\n وهَمَّ بها كذلك\n لكنه لم يعزم على ذلك\n ولم يبلغ إلى حد ما ذكر من حل التكَّة\n بل كان همه خطرة خطرت على قلبه\n ولم يتابِعها\n ولكنه بادر إلىالتوبة والإقلاع عن تلك الخطرة\n حتى محاها من قلبه\n لمَّا رأى برهان ربه\n\nولا يقدح هذا في عصمة الأنبياء لأن الهم بالذنب لبس بذنب\n ولا نقص في ذلك لأنَّ من هَمَّ بذنب ثم تركه كتب له حسنة\n هـ\n  قلت: وكلامه حسن لأن الخطرات لا طاقة للبشر على تركها\n وبمجاهدة مخالفتها فُضِّل البشر على جنس الملائكة\n وقال البيضاوي: والمراد بهمه: ميل الطبع\n ومنازعة الشهوة\n لا القصد الاختياري\n وذلك مما لا يدخل تحت التكليف\n بل الحقيق بالمدح والأجر الجزيل\n لمن يكف نفسه عن الفعل عند قيام هذا الهم أو مشارفته\n كقوله: قتلته لو لم أخف الله\n هـ\n ومثله في تفسير الفخر\n وأنه مال إليها بمقتضى الطبع\n ومُنع منه بصارف العصمة\n كالصائم يشتاق الماء البارد ويمنعه منه صومه\n ومثله أيضاً في لطائف المنن: همت به هَمَّ إرادة\n وهَمَّ بها هَمَّ ميل لا هَمَّ إرادة\n قال المحشي الفاسي: وفيه نظر لأن ذلك لا يتصور في النفوس المطمئنة\n وإنما ذلك شأن أرباب التلوين والمجاهدة\n دون أهل التمكين والمشاهدة\n وخصوصاً الأنبياء إذ صارت نفوسهم مشاكلة للروح\n مندرجة فيها\n ولذلك صارت مطمئنة\n وميلها حينئذ إنما يكون للطاعة\n وأما غير الطاعة\n فهي بمنزلة القذر والنتن تشمئز منه\n ولا يتصور بحال ميلها إليه\n ثم أطال الكلام في ذلك\n  قلت: أما تفسير الهم بالميل فلا يليق بالنفس المطمئنة\n وأما تفسيره بالخاطر فيتصور في المطمئنة وغيرها\n وإنما سماه الله تعالى هماً في حق يوسف عليه السلام لأن الأنبياء ـ عليهم السلام ـ لعلو منصبهم\n وشدّة قربهم من الحضرة\n يشدد عليهم في مطالبة الأدب\n فيجعل الخاطر في حقهم هَمّاً وظناً\n كما قال تعالى:\n[يوسف: 110] فيمن خفف الذال\n أو كما قال تعالى في حق يونس عليه السلام:\n[الأنبياء: 87] على أحد التفاسير\n والله تعالى أعلم\n  ثم قال تعالى: { لولا أن رأى برهانَ ربه } لخالطها\n والبرهان الذي رأى: قيل: ناداه جبريل: يا يوسف تكون في ديوان الأنبياء\n وتفعل فعل السفهاء\n وقيل: رأى يعقوب عاضاً على أنامله\n يقول: إياك يا يوسف والفاحشة\n وقيل: تفكر في قبح الزنى فاسبتصر\n وقيل: رأى زليخا غطت وجه صنمها حياءً منه\n فقال: أنا أولى أن أستحي من ربي\n { كذلك } أي: مثل ذلك التثبيت ثبتناه { لِنَصْرِِفَ عنه السّوءَ } خيانة السيد\n { والفحشاءَ } \n الزنى { إنه من عبادنا المخلَصين } الذين أخلصناهم لحضرتنا\n أو من الذين أخلصوا وجهتهم إلينا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:174",
      "similarity": 0.46300444516048184
    },
    {
      "verse": "4:113",
      "similarity": 0.4389251350606963
    },
    {
      "verse": "23:117",
      "similarity": 0.43378464492432695
    },
    {
      "verse": "5:11",
      "similarity": 0.3666571131031385
    },
    {
      "verse": "3:122",
      "similarity": 0.30446785232710905
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}