{
  "chapter": "يوسف",
  "text": "فلما سمعت بمكرهن ارسلت اليهن واعتدت لهن متكـا وءاتت كل وحدة منهن سكينا وقالت اخرج عليهن فلما راينه اكبرنه وقطعن ايديهن وقلن حش لله ما هذا بشرا ان هذا الا ملك كريم",
  "translations": [
    {
      "translation": "But when she heard of their malicious talk, she sent for them and made a sumptuous meal and then she gave a knife to each of them. She said, 'Go out to them.' When they saw him, they were amazed by him and cut their hands. They said, 'Allah preserve us! This is no man. What can this be but a noble angel here!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she heard their slanderings, she sent for them and prepared a banquet, and gave each of them a knife (for paring fruit), and called (to Joseph): \"Come out before them.\" When they saw him, the women were so wonderstruck they cut their hands, and exclaimed: \"O Lord preserve us! He is no mortal but an honourable angel.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearing of their sly talk the chief's wife sent for those ladies, and arranged for them a banquet, and got ready couches, and gave each guest a knife. Then, while they were cutting and eating the fruit, she signalled Joseph: \"Come out to them.\" When the ladies saw him they were so struck with admiration that they cut their hands, exclaiming: \"Allah preserve us. This is no mortal human. This is nothing but a noble angel!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she heard their gossiping, she invited them to her house for a banquet and gave a knife to each of them. Then she told Joseph to appear before them. When they saw Joseph, they were so amazed that they cut their hands and said, \"Goodness gracious! He is not a mortal but is a charming angel!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she heard of their secret talk, she sent for them and prepared cushioned mattresses for them and gave a knife to each one of them and said to Yusuf, “Come out before them!” When the women saw him they praised him and cut their hands, and said, “Purity is to Allah – this is no human being; this is not but an honourable angel!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she heard of their accusation, she sent for them and prepared a banquet for them; she gave each one of them a knife, and she said [to Yusuf]: \"Come out before them.\" Then, when they saw him, they exalted him (at his beauty) and (in their astonishment) cut their hands. They said: \"How perfect is Allah! No man is this! This is none other than a noble angel!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she heard of their sly talk she sent for them and prepared for them a repast, and gave each of them a knife, and said (to Yusuf): Come forth to them. So when they saw him, they deemed him great, and cut their hands (in amazement), and said: Remote is Allah (from imperfection); this is not a mortal; this is but a noble angel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she heard their sly whispers, she sent to them, and made ready for them a repast, then she gave to each one of them a knife. 'Come forth, attend to them,' she said. And when they saw him, they so admired him that they cut their hands, saying, 'God save us! This is no mortal; he is no other but a noble angel.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she heard of their sly talk, she sent to them and prepared for them a cushioned couch (to lie on at the feast) and gave to every one of them a knife and said (to Joseph): Come out unto them! And when they saw him they exalted him and cut their hands, exclaiming: Allah Blameless! This is no a human being. This is not other than some gracious angel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she heard of their intrigues, she sent for them and prepared a party for them. She gave a knife to each of them [to cut fruits, etc.] and then asked Joseph to appear before them. When the women saw him, they were greatly amazed [at his beauty], and they cut their hands, exclaiming, \"God preserve us! This is no human being but a noble angel!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when she heard of their cunning talk, she sent unto them a messenger, and got ready for them a cushioned Couch, and gave a knife to each of them. And she said: come forth to them. Then when they saw him, they were astonished at him, and they made a cut in their hands, and said: how perfect is God! no man is he: he is naught but an angel noble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she heard of their machinations, she sent for them and arranged a repast, and gave each of them a knife, and said [to Joseph], ‘Come out before them.’ So when they saw him, they marvelled at him and cut their hands [absent-mindedly], and they said, ‘Good heavens! This is not a human being! This is but a noble angel!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she heard of their malicious talk, she sent for them and prepared a banquet for them: she gave each of them a knife: and she said (to Joseph), \"Come out before them.\" When they saw him, they did extol him, and (in their amazement) cut their hands: they said, \"Allah preserve us! no mortal is this! this is none other than a noble angel!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she heard of their accusation, she sent for them and prepared a banquet for them; she gave each one of them a knife (to cut the foodstuff with), and she said [(to Yusuf (Joseph)]: \"Come out before them.\" Then, when they saw him, they exalted him (at his beauty) and (in their astonishment) cut their hands. They said: \"How perfect is Allah (or Allah forbid)! No man is this! This is none other than a noble angel!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she heard of their sly whispers, she sent for them and prepared a banquet. To each she gave a knife, (then called Joseph saying:) 'Come and attend to them' When they saw him, they were so taken with him that they cut their hands, and said: 'Allah save us! This is no mortal, he is no other but a noble angel'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she heard of their gossip, she invited them, and prepared for them a banquet, and she gave each one of them a knife. She said, “Come out before them.” And when they saw him, they marveled at him, and cut their hands. They said, “Good God, this is not a human, this must be a precious angel.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she heard of their scheming, she sent for them and prepared for them a banquet and gave each one of them a knife and said [to Joseph], \"Come out before them.\" And when they saw him, they greatly admired him and cut their hands and said, \"Perfect is Allah! This is not a man; this is none but a noble angel.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:31] And when she heard of their machinations, their backbiting of her, she sent for them and prepared for them a repast (muttaka’ is food that requires cutting with a knife, since one leans upon it (ittikā’): this [repast] was utruj, ‘citron’). She then gave each one of them a knife and said, to Joseph: ‘Come out before them!’ And when they saw him, they were in awe of, they exalted, him and cut their hands, with the knives, without feeling any pain, because their hearts were so engrossed by Joseph, and they exclaimed: ‘God preserve us! — in exaltation of him — This, namely, Joseph, is no human being: this is but a noble angel!’, on account of his all-encompassing beauty, which is [a characteristic] not usually found among humankind. In the Sahīh [of al-Bukhārī], it is [reported] that one half of all beauty was given to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when she heard of their sly talk, she sent to them) an invitation (and prepared for them a cushioned couch) to lie on and then she had meat and bread brought to them (and gave to every one of them a knife) for they did not eat of meat except that which they could cut with their knives (and said) Zelicha said to Joseph: (Come out unto them!) Joseph! (And when they saw him they exalted him and cut their hands, exclaiming: Allah Blameless!) Allah forbid! (This is not a human being. This is no other than some gracious angel) gracious in the sight of his Lord.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَعْتَدَتْ لَهُنَّ مُتَّكَئاً } معناهُ مَجلسٌ وطَعامٌ وشَرابٌ\n والمُتَكأُ: مَا يُتكأُ عَليهِ مَن النَّمارِقِ\n\n\n\n\nوقوله تعالى: { فَلَمَّا رَأَيْنَهُ أَكْبَرْنَهُ } معناهُ أَجْلَلنهُ وأَعظَمنَهُ\n\n\n\n\nوقوله تعالى: { وَقُلْنَ حَاشَ للَّهِ } معناهُ التَنزيهُ لله والارْتِفَاعُ عَن ذَلِكَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of the Most High: {And they have prepared for them a couch} means a gathering and food and drink.\n\n\nAnd those who are firmly established in their faith {mutakallimun}: they are not shaken by {any of} the {false} things {that} those who {engage in} falsehood {try to} create.\n\n\nAnd when they saw him, they exalted him and made him great.\n And {We say: Glorified be Allah} means exalting Allah and rising above that.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nولما بلغ القلب هذا المنزل من الاتصال بالروح والاستشراق من نوره وتنوّرت النفس بشعاع نور القلب وتصفت عن كدوراتها عشقته للاستنارة بنوره، والتشكّل بهيئته، والتقرّب إليه، وإرادة الوصول إلى مقامه لا لجذبه إلى نفسه وقضاء وطرها منه باستخدامها إياه في تحصيل اللذات الطبيعية واستنزالها إياه عن مقامه ومرتبته إلى مرتبتها ليتشكل بهيئتها ويشاركها في أفعالها ولذاتها، كما كانت عند كونها أمّارة فتتأثر قواها حينئذ حتى القوى الطبيعية بتأثرها، وذلك معنى قول نسوة المدينة: { امْرَأةُ العَزِيز تُرَاوِد فَتاها عن نَفسه قد شَغَفَها حبّاً } وكلما استولى القلب عليها بهيئته النورية وحسنه الذاتي الفطري والصفاتي الكسبيّ من الترقي إلى مجاورة الروح إياه، فشغلت عن أفعالها وتحيرت ووقفت عن تصرفاتها في الغذاء وذهلت عن سكاكين آلاتها التي كانت تدبر بها أمر التلذذ والتغذي والتفكه، وجرحت قدرتها التي تستعمل بها الآلات في تصرفاتها وبقيت مبهوتة في متكآتها التي هي محالها في أعضاء البدن التي هيأتها لها النفس في قراها وهو معنى قوله: { فلما رأيْنه أكْبَرنه وقطعن أيديهنّ وقلن حاشا لله ما هذا بشراً إن هذا إلا ملك كريم } وقولها: { أخرج عليهن } استجلاؤها لنوره بالإرادة واقتضاؤها طلوعه عليها بحصول استعداد التنوّر لها",
      "translations": [
        {
          "translation": "\n\nAnd when the heart reaches this station of connection with the soul and of immersion in its light, the soul becomes illuminated by the light of the heart and becomes free of its own circuits of love for the light., And it takes its shape., And draw near to Him\n \n,\n\nThe desire to reach one's position is not for the purpose of drawing him to oneself, but rather to fulfill one's duty by using him to achieve natural pleasures and remove them from him so that he can return to his rightful place and share in his actions and enjoyments.,\n\nAs it was an emirate, its forces were affected by this even to the point of natural forces being affected by it.,\n\nThis is the meaning of the women of the city saying: {The mighty woman entices her maidservant, who has fallen in love with her, to betray her} . Every time the heart takes her in her spiritual form and her good self and her virtues from the ascetic to the proximity of the soul, it does so.,\n\n{She} became occupied with her own actions, and {she} became confused and stopped her usual activities relating to food, and {she} became forgetful of the utensils {she} was using to prepare the food.,\n\nHer power was wounded by the instruments she used in her actions, and she remained beautiful in her { } which is her domain in the body parts that the self prepared for her in her reading, and this is the meaning of his saying: { When we saw him, we made him bigger and cut off his hands and feet and said, \"God forbid! This is a human being! This is nothing but a noble angel. } And her saying: { He appeared to them } is her declaration of his light by her will, and her need for his rise to her in order to prepare for her enlightenment.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا سَمِعَتْ } راعيل { بِمَكْرِهِنَّ } وغيبتهن وتخطئتهن خفية { أَرْسَلَتْ إِلَيْهِنَّ } قواصد؛ ليدعوهن على سبيل الضيافة { وَأَعْتَدَتْ لَهُنَّ } اي: هيأت لكل واحدة منهم في بيتها { مُتَّكَئاً } على حدة ليتكئن عليها على ما هو عادة بلدتهم، ووضعت عند كل متكأ طبقاً من الفواكة مثل الكمثرى والتفاح وغيرهما { وَآتَتْ كُلَّ وَاحِدَةٍ مِّنْهُنَّ } أي: على عدد رءوسهن { سِكِّيناً } في غاية الحدة والمضاء، وبعد تهيئة أماكنهن على الوجه المذكور جئن وجلسن عليها واشتغلن بأكل الفواكه وتنقية قشورها بالسكين { وَ } بعد ذلك { قَالَتِ } راعيل ليوسف: { ٱخْرُجْ عَلَيْهِنَّ } فخرج { فَلَمَّا رَأَيْنَهُ أَكْبَرْنَهُ } أي: كبرن الله برؤية جماله وحسنه البديع وبهائه؛ إذ يتشعشع ويلمع ضوء وجهه على الجدار مثل الشمس والقمر\n\n\n\n\nوعن النبي صلى الله عليه وسلم أنه قال:\n\n \" رأيت يوسف الصديق عليه السلام للة المعراج كالقمر ليلة البدر \"\n \n\n \n\nومن كمال حيرتهن على حسنه وجماله بهتن بأجمعهن { وَقَطَّعْنَ أَيْدِيَهُنَّ } بالسكاكين أي: كل بسكينها { وَ } بعدما أفقن { قُلْنَ } مستبعدات مستغربات { حَاشَ لِلَّهِ } أي: تنزه ذاته أن يعجز عن خلق مثله، غير أنه { مَا هَـٰذَا } الهيكل المرأي { بَشَراً } إذ لا نرى بشراً على هذه الصورة { إِنْ هَـٰذَآ } أي: بل ما هذا المشاهد المحسوس { إِلاَّ مَلَكٌ كَرِيمٌ } [يوسف: 31] نجيب مجسم من الروح لا من الطين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما سمعتْ بمكرهنّ } باغتيابهن\n وسماه مكراً لأنهن أخفينَه كما يخفي الماكر مكره\n وقيل: كانت اسْتَكتَمَتهن سرها فأفشينه\n فلما بلغها إفشاؤه { أرسلتْ إليهن } تدعوهن\n قيل: دعت أربعين امرأة فيهن الخمس\n { وأعتدتْ }: أعدت { لهن مُتكأ } ما يتكئن عليه من الوسائد ونحوها\n وقيل: المتكأ: طعام، فإنهم كانوا يتكئون للطعام عند أكله، وقرئ في الشاذ: \" مَتْكاً \" ، بسكون التاء وتنوين الكاف، وهو الأترج\n { وآتتْ كل واحدةٍ منهن سكّيناً } ليقطعن به\n وهذا يدل على أن الطعام كان مما يقطع بالسكاكين كالأترج\n وقيل: كان لحماً\n { قالت اخْرُجْ عليهن } ، فأسعفها لأنه كان مملوك زوجها، فخرج عليهن، { فلما رأينه أكْبَرْنَهُ }: عظمن شأنه وجماله الباهر، وعن النبي صلى الله عليه وسلم أنه قال:\n\n \" رأيتُ يُوسفَ لَيلَةَ المعراج كالقَمَر لَيلَةَ البَدْرِ \" \n\nوقيل: كان يُرى تلألؤ وجهه على الجدران\n { وقطّعن أيديَهُنَّ } ، جرحنها بالسكين لفرط الدهشة، اشتغلن بالنظر إليه، وبُهتْن من جماله حتى قطعن أيديهن، وهُنَّ لا يشعرن، كما يقطع الطعام\n { وقُلْنَ حاشَ لله } تنزيهاً له عن صفات العجز عن أن يخلق مثله\n أو تنزيهاً له أن يجعل هذا بشراً\n اعتقدوا أن الكمال خصاص بالملائكة، وكونه في البشر في حيز المحال، أو تعجباً من قدرته على خلق مثله\n { ما هذا بشراً } لأن هذا الجمال غير معهود للبشر\n { إن هذا إلا مَلَكٌ كَريمُ } على الله لأن الجمع بين الجمال الرائق، والكمال الفائق، والعصمة البالغة، من خواص الملائكة\n\n\n{ قالت } لهن: { فذلِكُنَّ الذي لُمتنَّني فيه } توبيخاً لهن على اللوم، أي: فهو ذلك الغلام الكنعاني، الذي لمتنني في الافتتان به قبل أن ترونه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:51",
      "similarity": 0.3775897666840982
    },
    {
      "verse": "56:16",
      "similarity": 0.19477256150650077
    },
    {
      "verse": "43:34",
      "similarity": 0.1805755107171961
    },
    {
      "verse": "38:51",
      "similarity": 0.17745714237275276
    },
    {
      "verse": "33:31",
      "similarity": 0.1669082186495641
    }
  ]
}