{
  "chapter": "يوسف",
  "text": "يصىحبى السجن ءارباب متفرقون خير ام الله الوحد القهار",
  "translations": [
    {
      "translation": "(Tell me) O fellow-prisoners, are a number of gods better, or one God omnipotent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fellow-prisoners! Is it better that there be diverse lords, or just Allah, the One, the Irresistible?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My fellow-prisoners can many different masters be considered better than One All-dominant God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O both my fellow-prisoners! Are various lords better, or One Allah, the Dominant above all?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O two companions of the prison! Are many different lords (gods) better or Allah, the One, the Irresistible\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my two mates of the prison! are sundry lords better or Allah the One, the Supreme?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, which is better, my fellow-prisoners -- many gods at variance, or God the One, the Omnipotent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my fellow-prisoners! Are divers lords better, or Allah the One, Almighty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my two fellow-prisoners! Are many diverse lords better, or God, the One, the Almighty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My two fellow-prisoners! are sundry lords better of Allah, the One, the Subduer\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my prison mates! Are different masters better, or Allah, the One, the All-paramount?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my two companions of the prison! (I ask you): are many lords differing among themselves better, or the One Allah, Supreme and Irresistible?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O two companions of the prison! Are many different lords (gods) better or Allah, the One, the Irresistible?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My fellowprisoners, say which is better, many gods at variance, or Allah the One, the Conqueror?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O My fellow inmates, are diverse lords better, or God, the One, the Supreme?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O [my] two companions of prison, are separate lords better or Allah, the One, the Prevailing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:39] He [Joseph] then explicitly calls them to faith, saying: O my two fellow-prisoners!, inmates [of the prison]: Are several lords better, or, is, God, the One, the Almighty, better? (an interrogative meant as an affirmative).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my two fellow prisoners!) He said this to the prison master as well as to the prisoners (Are diverse lords better) is the worship of numerous gods better, (or Allah the One, the Almighty?) or the worship of Allah, the One Who has no son or partner, the All-Conquering over His created beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وبقوله: { أأرباب متفرقون خيرٌ أم الله الواحدِ القهار } أي: إذا كان لكل منكما أرباب كثيرة كما قال تعالى:\n\n[الزمر، الآية: 29] يأمره هذا بأمر وهذا بأمر متمانعون في ذلك، عاجزون إمّا للمحبة فكالصفات والأسماء، وإما للهوى فكالقوى النفسانية كان خيراً له أم ربّ واحد لا يأمره إلا بأمر واحد، كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما مهد يوسف لصاحبه طريق التوحيد ونبه عليهما السلوك عليه، أشار إلى دعوتهما إليه على سبيل التدريج كما هو دأب الأنبياء، فقال منادياً لهما ليقبلا على بول قوله: { يٰصَاحِبَيِ ٱلسِّجْنِ } الساكنين فيه، المصاحبين معي { ءَأَرْبَابٌ مُّتَّفَرِّقُونَ } متكثرون في العدد متماثلون في عدم القدرة والاختيار { خَيْرٌ } عندكم وأحق لعبادتكم وانقيادكم { أَمِ ٱللَّهُ ٱلْوَاحِدُ } المتوحد في ذاته، المستقل في ألوهيته وربوبيته، المستغني في ذاته عن المظاهر مطلقاً { ٱلْقَهَّارُ } [يوسف: 39] الغالب على جميع السوى والأغيار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الإضافة في صاحبي السجن: على معنى في كقولك:\n\nيقول الحق جل جلاله: { يا صاحبَي السجن } أي: ساكنيه، أو يا صاحبي فيه { أأرباب متفرقون }: متعددون، { خيرٌ أم اللهُ الواحدُ } المتوحّد في الألوهية، { القهّار }: الغالب على أمره، لا يقاومه غيره، { ما تعبدون } أنتم ومن على دينكم من أهل مصر، { من دونه إلا أسماء سميتموها أنتم وآباؤكم } أي: ما تعبدون إلا مسميات أسماء من الحجارة، والخشب، سميتموها آلهة من غير حجة تدل على استحقاقها للعبادة\n والمعنى: سميتم آلهة ما لا يستحق الألوهية، ثم عبدتموها",
      "translations": []
    }
  ]
}