{
  "chapter": "يوسف",
  "text": "قالت فذلكن الذى لمتننى فيه ولقد رودته عن نفسه فاستعصم ولئن لم يفعل ما ءامره ليسجنن وليكونا من الصغرين",
  "translations": [
    {
      "translation": "She said, 'You see! It's him you blamed me for. I tried seducing him but he refused. If he does not do what I order him, he will be put in prison and brought low.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"This is the one you blamed me for. I did desire his person, but he preserved himself from sin. Yet in case he does not do my bidding he will be put into prison and disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"So now you see! This is the one regarding whom you reproached me. Indeed I tried to tempt him to myself but he held back, although if he were not to follow my order, he would certainly be imprisoned and humiliated.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"This is the one on whose account you subjected me to all this blame. I tried to seduce him but he abstained. If he does not yield to me, I shall order him to be locked up in prison to make him humble.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “This is he on whose account you used to insult me; and indeed I tried to entice him, so he safeguarded himself; and indeed if he does not do what I tell him to, he will surely be imprisoned, and will surely be humiliated.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"This is he (the young man) about whom you did blame me, and I did seek to seduce him, but he refused. And now if he refuses to obey my order, he shall certainly be cast into prison, and will be one of those who are disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: This is he with respect to whom you blamed me, and certainly I sought his yielding himself (to me), but he abstained, and if he does not do what I bid him, he shall certainly be imprisoned, and he shall certainly be of those who are in a state of ignominy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So now you see, she said. 'This is he you blamed me for. Yes, I solicited him, but he abstained. Yet if he will not do what I command him, he shall be imprisoned, and be one of the humbled.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: This is he on whose account ye blamed me. I asked of him an evil act, but he proved continent, but if he do not my behest he verily shall be imprisoned, and verily shall be of those brought low.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"This is he about whom you have been blaming me! And, indeed, I did try to make him yield to me, but he was unyielding. Now, however, if he does not do as I bid him, he shall certainly be put in prison and be humiliated.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: that then is he in regard to whom ye reproached me. Assuredly solicited him against himself but he abstained; and if he doth not that which I command him, he shall surely be imprisoned and he shall surely be of the degraded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, ‘He is the one on whose account you blamed me. Certainly, I did solicit him, but he was continent, and if he does not do what I bid him, surely he shall be imprisoned and humbled.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"There before you is the man about whom ye did blame me! I did seek to seduce him from his (true) self but he did firmly save himself guiltless!.... and now, if he doth not my bidding, he shall certainly be cast into prison, and (what is more) be of the company of the vilest!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"This is he (the young man) about whom you did blame me (for his love), and I did seek to seduce him, but he refused. And now if he refuses to obey my order, he shall certainly be cast into prison, and will be one of those who are disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereupon she said: 'Now you see, this is he on whose account you blamed me. Yes, I sought to seduce him, but he was unyielding. If he declines to do what I command, he shall be imprisoned and be one of the humiliated'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “Here he is, the one you blamed me for. I did try to seduce him, but he resisted. But if he does not do what I tell him to do, he will be imprisoned, and will be one of the despised.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"That is the one about whom you blamed me. And I certainly sought to seduce him, but he firmly refused; and if he will not do what I order him, he will surely be imprisoned and will be of those debased.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:32] She, the wife of the Court Officer, said, when she saw what happened to them, ‘This is he on whose account, for the love of whom, you blamed me (alladhī lumtunnanī fīhi is an explication of her excuse). Indeed I did attempt to seduce him, but he withheld himself, he refused. Yet if he does not do what I bid him, he verily shall be imprisoned, and verily shall be of those brought low’, those abased. The women said to him: ‘Obey your mistress!’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(She said) Zelicha said to them: (This is he on whose account you blamed me) and vilified me. (I asked of him an evil act) I wanted him to sleep with me, (but he proved continent) but he refused out of continence, (but if he do not my behest he verily shall be imprisoned, and verily shall him of those brought low) he will be humiliated in prison.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقالت منحسرة: { لَقَدْ رَاوَدتُّهُ عَن نَّفْسِهِ } مراراً كثيرة { فَٱسَتَعْصَمَ } وأبى عن القبول من كمال عفته وعصمته { وَ } الله { لَئِن لَّمْ يَفْعَلْ مَآ آمُرُهُ } أي: ما أنا آمر به من المواقعة والمجامعة\n ولمي يقبل قولي ولم يقضي حاجتي { لَيُسْجَنَنَّ } أيك ليسجننه { وَلَيَكُوناً مِّن ٱلصَّاغِرِينَ } [يوسف: 32] الذليلين المهانين\n الباقين ي السجن مدة مديدة\n\n\nفلما قالت راعيل ما قالت وأقسمت\n التفتن بأجمعهن على إعانتها وإنجاح مرادها منه وألحن\n واقترحن على يوسف بقبول قولها والإتيان بمطلوبها إلحاحاً بليغاً\n بل أضمرن في أنفسهن كل منهن إتيانه عليهن بمقتضى النساء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولقد راودتُه عن نفسه فاستعصم }: فامتنع طلباً للعصمة\n أقرت لهن حين عرفت أنهن يعذرنها كي يعاونها على إلانة عريكته\n { ولئن لم يفعلْ ما آمُرُهُ } به { ليُسَبِّحنَ وليكونا من الصاغرين } الأذلاء\n وهو من صِغَر\n بالكسر يَصغَر صغاراً\n فقلن له: أطع مولاتك\n  { قال ربّ السجنُ أحبُّ إليَّ مما يدعونني إليه } من فعل الفاحشة بالنظر إلى العاقبة\n وإن كان مما تشتهيه النفس\n لكن رُبَّ شَهوةَ ساعة أورَثَتْ حُزْناً طويلاً\n قيل: إنما ابتلي بالسجن لقوله هذا\n وإنما كان اللائق به أن يسأل الله العافية\n فالاختيار لنفسه أوقعه في السجن\n ولو ترك الاختيار لكان معصوماً من غير امتحان بالسجن\n كما كان معصوماً وقت المراودة\n { وإلا تَصْرِف عني }: وإن لم تصرف عني { كيدَهُنَّ } من تحبيب ذلك إليَّ\n وتحسينه عندي بالتثبيت على العصمة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:67",
      "similarity": 0.3841001217288632
    },
    {
      "verse": "26:29",
      "similarity": 0.3792091255156626
    },
    {
      "verse": "51:54",
      "similarity": 0.3725730578353241
    },
    {
      "verse": "33:17",
      "similarity": 0.37190316230276976
    },
    {
      "verse": "68:30",
      "similarity": 0.35434773316395957
    }
  ]
}