{
  "chapter": "يوسف",
  "text": "قال رب السجن احب الى مما يدعوننى اليه والا تصرف عنى كيدهن اصب اليهن واكن من الجهلين",
  "translations": [
    {
      "translation": "(Joseph) prayed: \"O Lord, dearer is prison than what they invite me to. Unless You turn their guiles away from me I shall succumb to their charms and thus become a pagan.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said: \"My Lord! I prefer imprisonment to what they ask me to do. And if You do not avert from me the guile of these women, I will succumb to their attraction and lapse into ignorance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said, \"Lord, prison is dearer to me than that which women want me to do. Unless You protect me from their guile, I shall be attracted to them in my ignorance\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O my Lord! Prison is dearer to me than the deed they invite me to; and if You do not repel their deceit away from me, I may incline towards them and be unwise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! Prison is dearer to me than that to which they invite me. Unless You turn away their plot from me, I will feel inclined towards them and be one of the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! the prison house is dearer to me than that to which they invite me; and if Thou turn not away their device from me, I will yearn towards them and become (one) of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'My Lord, prison is dearer to me than that they call me to; yet if Thou turnest not from me their guile, then I shall yearn towards them, and so become one of the ignorant.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my Lord! Prison is more dear than that unto which they urge me, and if Thou fend not off their wiles from me I shall incline unto them and become of the foolish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said, \"O my Lord! I would prefer prison to what these women are inviting me to do. And if You do not avert their guile from me, I may yield to them and so become one of the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: my Lord: prison is dearer to me than that to which these women call me; and if Thou avertest not their guile from me should incline toward them and become of the Ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! The prison is dearer to me than to what they invite me. If You do not turn away their schemes from me, I will incline towards them and become one of the senseless.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! the prison is more to my liking than that to which they invite me: Unless Thou turn away their snare from me, I should (in my youthful folly) feel inclined towards them and join the ranks of the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said:\"O my Lord! Prison is more to my liking than that to which they invite me. Unless You turn away their plot from me, I will feel inclined towards them and be one (of those who commit sin and deserve blame or those who do deeds) of the ignorants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He supplicated: 'Lord, prison is dearer to me than that to which they invite me. Yet if You do not shield me from their guile I shall yield to them and be one of the ignorant'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, prison is more desirable to me than what they call me to. Unless You turn their scheming away from me, I may yield to them, and become one of the ignorant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, prison is more to my liking than that to which they invite me. And if You do not avert from me their plan, I might incline toward them and [thus] be of the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:33] He said, ‘My Lord, prison is dearer to me than that to which they are urging me. And if You do not fend off their wiles from me, then I shall tend, I shall incline, towards them and become of the ignorant, the sinful: this is intended as a supplication, which is why God, exalted be He, then says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "These women said to Joseph. \"Obey your mistress!\" (He said) Joseph said: (0 my Lord! Prison is more dear than that unto which they urge me) of adultery, (and if Thou fend not off their wiles) their scheming (from me I shall incline unto them and become of the foolish) who ignore Your blessing; it is also said that the foolish here refer to adulterers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَصْبُ إِلَيْهِنَّ } معناهُ أَملْ إِليهِنَّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوحين رأى يوسف اتفاقهن واجتماعهن على منكر، ناجى ربه من شرهن وتعوذ نحوه من فتنتهن حيث: { قَالَ رَبِّ } يا من رباني بأنواع اللطف و الكرم والعصمة والعفاف { ٱلسِّجْنُ } الذي أوعدتني به هذه المرأة { أَحَبُّ إِلَيَّ } وآثر عندي { مِمَّا يَدْعُونَنِيۤ إِلَيْهِ } هؤلاء البغيات { وَإِلاَّ تَصْرِفْ } أي: وإن لم تصرف بفضلك وعصمتك { عَنِّي كَيْدَهُنَّ } ولم تحفظني من مكرهن، بإلقاء البرهان الفعلي والكشفي في سري { أَصْبُ } أي: أمِل وأتحنن نحوهن على مقتضى الوقى البهيمية { إِلَيْهِنَّ وَأَكُن } حينئذ { مِّنَ ٱلْجَاهِلِينَ } [يوسف: 33] المتابعين لشيطان الشهوة، الخارجين عن مقتضى العقل المفاض من المبدأ الفياض\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قيل: إنما ابتلي بالسجن لقوله هذا، وإنما كان اللائق به أن يسأل الله العافية، فالاختيار لنفسه أوقعه في السجن، ولو ترك الاختيار لكان معصوماً من غير امتحان بالسجن، كما كان معصوماً وقت المراودة، { وإلا تَصْرِف عني }: وإن لم تصرف عني { كيدَهُنَّ } من تحبيب ذلك إليَّ، وتحسينه عندي بالتثبيت على العصمة، { أَصْبُ إليهن } أًمِلْ إلى جانبهن بطبعي ومقتضى شهوتي، { وأكن من الجاهلين } من السفهاء بارتكاب ما يدعونني إليه، فإن الحكيم لا يفعل ما هو قبيح\n أو من الذين لا يعملون بما يعلمون، فإنهم جهال، وكلامه هذا: تضرع إلى الله تعالى، واستغاثة به",
      "translations": []
    }
  ]
}