{
  "chapter": "يوسف",
  "text": "وقال نسوة فى المدينة امرات العزيز ترود فتىها عن نفسه قد شغفها حبا انا لنرىها فى ضلل مبين",
  "translations": [
    {
      "translation": "Some city women said, 'The governor's wife solicited her slave. He's fired her heart with love. We see that she's the one to blame.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the city the women gossiped: \"The minister's wife longs after her page. He has captured her heart. We think she is in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some ladies in the city began to say: \"The chief's wife, violently in love with her houseboy, is out to tempt him. We think she is clearly mistaken.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the women in the town started to gossip saying, \"The King's wife has tried to seduce her servant and has fallen madly in love with him. We think that she is in manifest error\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some women of the city said, “The governor’s wife is seducing her young slave; indeed his love has taken root in her heart; and we find her clearly lost.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And women in the city said: \"The wife of the `Aziz is seeking to seduce her (slave) young man, indeed she loves him violently; verily, we see her in plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And women in the city said: The chiefs wife seeks her slave to yield himself (to her), surely he has affected her deeply with (his) love; most surely we see her in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certain women that were in the city said, 'The Governor's wife has been soliciting her page; he smote her heart with love; we see her in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And women in the city said: The ruler's wife is asking of her slave-boy an ill-deed. Indeed he has smitten her to the heart with love. We behold her in plain aberration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Women in the town began to gossip, \"The nobleman's wife is trying to seduce her slave! Love for him consumes her heart! Indeed! We see her in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And women in the city said; the wife of the AZiZ hath solicited her page against himself; he hath inflamed her with love; verily we behold her in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the townswomen said, ‘The chieftain’s wife has solicited her slave boy! He has captivated her love. Indeed we see her to be in manifest error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ladies said in the City: \"The wife of the (great) 'Aziz is seeking to seduce her slave from his (true) self: Truly hath he inspired her with violent love: we see she is evidently going astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And women in the city said: \"The wife of Al-'Aziz is seeking to seduce her (slave) young man, indeed she loves him violently; verily we see her in plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certain women in the city said: 'The Governor's wife has sought to seduce her servant. He has made her heart stricken with love for him. Clearly, we perceive her to be in error'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some ladies in the city said, “The governor's wife is trying to seduce her servant. She is deeply in love with him. We see she has gone astray.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And women in the city said, \"The wife of al-'Azeez is seeking to seduce her slave boy; he has impassioned her with love. Indeed, we see her [to be] in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:30] And some of the women in the city, the city of Egypt, said, ‘The Court Officer’s wife has been seducing her boy, her servant. Indeed he has smitten her heart with love, (hubban is for specification, in other words, ‘[her] love of him has entered her heart’s pericardium (shaghāfa qalbihā), that is, its inner casing). Lo! we see her to be in plain aberration’, that is, in error evident, in her love of him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "However, the news of this incident spread in the city, (And women in the city) they were four women: the wife of the king's cupbearer, the wife of the king's head of prisons, the wife of the king's cook and the wife of the man in charge of the king's stable (said: The ruler's wife) Zelicha (is asking of her slave boy an ill deed) wants her slave boy to sleep with her. (Indeed he has smitten her to the heart with love. We behold her in plain aberration) she is plainly wrong in her love of her slave boy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { شَغَفَهَا حُبّاً } معناه لَزِقَ الحُبُّ بالقَلبِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He loved her with a love,\" means that He longed for her with His heart.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nولما بلغ القلب هذا المنزل من الاتصال بالروح والاستشراق من نوره وتنوّرت النفس بشعاع نور القلب وتصفت عن كدوراتها عشقته للاستنارة بنوره\n والتشكّل بهيئته\n والتقرّب إليه\n وإرادة الوصول إلى مقامه لا لجذبه إلى نفسه وقضاء وطرها منه باستخدامها إياه في تحصيل اللذات الطبيعية واستنزالها إياه عن مقامه ومرتبته إلى مرتبتها ليتشكل بهيئتها ويشاركها في أفعالها ولذاتها\n كما كانت عند كونها أمّارة فتتأثر قواها حينئذ حتى القوى الطبيعية بتأثرها\n وذلك معنى قول نسوة المدينة: { امْرَأةُ العَزِيز تُرَاوِد فَتاها عن نَفسه قد شَغَفَها حبّاً } وكلما استولى القلب عليها بهيئته النورية وحسنه الذاتي الفطري والصفاتي الكسبيّ من الترقي إلى مجاورة الروح إياه\n فشغلت عن أفعالها وتحيرت ووقفت عن تصرفاتها في الغذاء وذهلت عن سكاكين آلاتها التي كانت تدبر بها أمر التلذذ والتغذي والتفكه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما شاع أمرهما وانتشر قصتهما بين الأنام { قَالَ نِسْوَةٌ } جماعة من النساء من صناديدهن { فِي ٱلْمَدِينَةِ } على جه التشنيع والتقريع: { ٱمْرَأَةُ ٱلْعَزِيزِ تُرَاوِدُ } تخادع وتحتال { فَتَاهَا عَن نَّفْسِهِ } طلباً لمواقعته إياها ومجامعته معها\n لأنها { قَدْ شَغَفَهَا حُبّاً } أي: دخل عن جميع شغاف قلبها وشقوقه\n فصار قلبها ممتلئاً بمحبته وعشقه\n لذلك راودته فامتنع عنها وافضحها { إِنَّا لَنَرَاهَا } بقبح فعلها وسوء صنيعها { فِي ضَلاَلٍ مُّبِينٍ } [يوسف: 30] من لحوق العار وفشو الفضيحة\n سيما مع الرقيق وكسر عرض العزيز بن الأنام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: نسوة: اسم جمع لامرأة\n وتأنيثه غير حقيقي\n ولذلك جرد فعله من التاء\n وفي المدينة متعلق بقال\n أي: أشعن الخبر في المدينة\n أو: صفة لنسوة\n فيتعلق بالاستقرار\n وحباً: تمييز\n وحاشَ لله: قال أبو علي الفارسي: هي هنا فعل\n والدليل على ذلك من وجهين\n أحدهما: أنها دخلت على لام الجر\n ولا يدخل حرف على حرف\n والآخر: أنها حذف منها الألف\n على قراءة الجماعة\n والحروف لا يحذف منها شيء\n وقرأها أبو عمرو بالألف على الأصل\n والفاعل بحاش ضميرُ يوسف\n أي: بعد يوسف عن الفاحشة لخوف الله\n وقال الزمخشري: حاش\n وضع موضع المصدر\n كأنه قال: تنزيهاً لله\n وحذف منه التنوين مراعاة لأصله من الحرفية\n وقال البيضاوي: هو حرف يفيد معنى التنزيه في باب الاستثناء\n فوضع موضع التنزيه\n واللام للبيان\n كما في قولك: سقيا لك\n هـ\n وليكونن: نون التوكيد الخفيفة كتبت بالألف لشبهها بالتنوين\n يقول الحق جل جلاله: { وقال نسوة في المدينة }: مصر\n وكانوا خمساً: زوجة الحاجب\n والساقي\n والخباز\n والسجان\n وصاحب الدواب\n قلن: { امرأةُ العزيزُ تُراودُ فتاها }: خادمها { عن نفسه } أي: تطلب مواقعه غلامهِا إياها\n { قد شَغَفَها حُبَّاً } قد دخل شغاف قلبها حُبُّه\n وهو غلافه\n { إنا لنراها في ضلالٍ مبين } في خطأ عن الرشد بيِّن ظاهر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:176",
      "similarity": 0.11847909998496085
    },
    {
      "verse": "4:127",
      "similarity": 0.09216852744335573
    },
    {
      "verse": "37:149",
      "similarity": 0.0854621110706672
    },
    {
      "verse": "21:60",
      "similarity": 0.08480955891140377
    },
    {
      "verse": "27:32",
      "similarity": 0.08218633495854347
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:30.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:30.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}