{
  "chapter": "يوسف",
  "text": "فاستجاب له ربه فصرف عنه كيدهن انه هو السميع العليم",
  "translations": [
    {
      "translation": "His Lord replied to him and turned away from him their female guile and deviousness. He is the One Who Hears, the One Who Knows.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His Lord heard his prayer, and averted the women's wiles from him. He verily hears and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon his Lord granted his prayer, and averted their guile from him. Surely He alone is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His Lord heard his prayers and protected him from their guile; He is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his Lord heard his prayer and repelled the women’s deceit away from him; indeed He only is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his Lord answered his invocation and turned away from him their plot. Verily, He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon his Lord accepted his prayer and turned away their guile from him; surely He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his Lord answered him, and He turned away from him their guile; surely He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his Lord heard his prayer and fended off their wiles from him. Lo! He is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his Lord answered him and warded off their guile. He is All Hearing and All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then his Lord answered to him, and averted their guile from him; verily He! He is the Hearer, the Knower!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his Lord answered him and turned away their stratagems from him. Indeed, He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his Lord hearkened to him (in his prayer), and turned away from him their snare: Verily He heareth and knoweth (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his Lord answered his invocation and turned away from him their plot. Verily, He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His Lord answered him and He turned their guile away from him. Indeed, He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon his Lord answered him, and diverted their scheming away from him. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his Lord responded to him and averted from him their plan. Indeed, He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:34] So his Lord answered him, his supplication, and He fended off their wiles from him. Truly He is the Hearer, of words, the Knower, of deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So his Lord heard his prayer and fended off their wiles from him. Lo! He is Hearer) of prayers, (Knower) of His answer; it is also said Hearer of the ladies' talk and Knower of their scheming.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أخلص في مناجاته وأبر في رجوعه وعرض حاجاته { فَٱسْتَجَابَ لَهُ رَبُّهُ } ما ناجاه { فَصَرَفَ عَنْهُ كَيْدَهُنَّ } وحُفظ عن مكرهن { إِنَّهُ } بذاته وأوصافه وأسمائه { هُوَ ٱلسَّمِيعُ } لمناجاة عباده { ٱلْعَلِيمُ } [يوسف: 34] بحاجاتهم منها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { فاستجاب له ربه }: أجاب دعاءه الذي تضمنه كلامه، { فصرفَ عنه كيدهنَّ } حيث ثبته على العصمة حتى وطن نفسه على مشقة السجن، وآثرها على اللذة الفانية { إنه هو السميعُ } لدعاء الملتجئين إليه، { العليم } بإخلاصهم أو بما يصلح بهم\n  الإشارة: الحب إذا كان على ظاهر القلب، ولم يخرق شغافه، كان العبد مع دنياه، وآخرته، بين ذكر، وغفلة\n فإذا دخل سويداء القلب، وخرق شغافه نسي العبد دنياه وأخراه، وغاب عن نفسه وهواه، وضل في محبة مولاه\n ولذلك قيل لعاشقة يوسف: { إنا لنراها في ضلال مبين } أي: في استغراق في المحبة حتى ضل عنها ما دون محبوبها\n ومنه قوله تعالى:\n\n[الضحى: 7] أي: وجدك ضالاً في محبته، فهداك إلى حضرى مشاهدته ومقام قربه، فكان قاب قوسين أو أدنى\n وعلامة ودخول المحبة شغاف القلب أربعة أشياء: الاستيحاش، والإيناس، وذكر الحبيب مع الأنفاس، وحضوره مع الحواضر والوسواس\n وأنشدوا:\n\nوقال آخر:\n\nقوله تعالى: { فلما رأينه أكبرنه وقطعن أيديهن\n\n\n\n\n } الآية: أدهشتهم طلعة يوسف، وجماله الباهر، وزليخا لما استمرت معه لم تفعل شيئاً من ذلك\n كذلك المريد إذا استشرف على أنوارالحضرة وجمالها، أدهشته وحيرته، فلولا التأييد الإلهي ما أطاقها، فإذا صبر على صدماتها، واستمر مع تجليات أنوارها ذهب دهشه\n واطمأن قلبه بشهود محبوبه من وراء أردية العز والكبرياء، وهذه هي الطمأنينة الكبرى والسعادة العظمى\n وقوله تعالى: { قال رب السجن أحب إليَّ } ، هكذا ينبغي للعبد أن يكون يختار ما يبقى على ما يفنى فرب شهوة ساعة أورثت حزناً، ورب صبر ساعة أورثت نعيماً جزيلاً\n وبالله التوفيق\n ثم ذكر سجن يوسف، وما يتبعه من إخراجه، وتمليكه، وتمكينه، فقال: { ثُمَّ بَدَا لَهُمْ مِّن بَعْدِ مَا رَأَوُاْ ٱلآيَاتِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:39",
      "similarity": 0.5022486590419033
    },
    {
      "verse": "86:15",
      "similarity": 0.4965748635862285
    },
    {
      "verse": "86:16",
      "similarity": 0.49027773521744517
    },
    {
      "verse": "105:2",
      "similarity": 0.4437467269063947
    },
    {
      "verse": "52:42",
      "similarity": 0.4383235880897559
    }
  ]
}