{
  "chapter": "يوسف",
  "text": "نحن نقص عليك احسن القصص بما اوحينا اليك هذا القرءان وان كنت من قبله لمن الغفلين",
  "translations": [
    {
      "translation": "Through the revelation of this Qur'an We narrate the best of histories of which you were unaware before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), by revealing the Qur'an to you We narrate to you in the best manner the stories of the past although before this narration you were utterly unaware of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In revealing this Quran to you, We tell you the best of the stories of which you were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We relate to you the best narrative because We have sent the divine revelation of this Qur’an, to you; although surely you were unaware before this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We relate unto you the best of stories through Our revelations unto you, of this Qur'an. And before this, you were among those who knew nothing about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We narrate to you the best of narratives, by Our revealing to you this Quran, though before this you were certainly one of those who did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will relate to thee the fairest of stories in that We have revealed to thee this Koran, though before it thou wast one of the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We narrate unto thee (Muhammad) the best of narratives in that We have inspired in thee this Qur'an, though aforetime thou wast of the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We recount to you the best of narratives in revealing this Quran to you, even though you were unaware of it before it came.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We! We recount unto thee the best of stories, by Revealing unto thee this Our'an, although thou wast before that of the unaware ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will recount to you the best of narratives in what We have revealed to you of this Quran, and indeed prior to it you were among those who are unaware [of it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do relate unto thee the most beautiful of stories, in that We reveal to thee this (portion of the) Qur'an: before this, thou too was among those who knew it not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We relate unto you (Muhammad SAW) the best of stories through Our Revelations unto you, of this Quran. And before this (i.e. before the coming of Divine Inspiration to you), you were among those who knew nothing about it (the Quran).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the sending down of this Koran, We will narrate to you (Prophet Muhammad) the best of narratives, of which you were previously unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We narrate to you the most accurate history, by revealing to you this Quran. Although, prior to it, you were of the unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We relate to you, [O Muhammad], the best of stories in what We have revealed to you of this Qur'an although you were, before it, among the unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:3] We will relate to you the best of narratives in what We have revealed, in Our revealing, to you this Qur’ān, though (wa-in: in is softened, in other words [understand it as] wa-innahu) prior to it you were of the heedless.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We narrate unto thee (Muhammad)) We clarify to you (the best of narratives) the best story of the news of Joseph and his brothers (in that We have inspired in you) with which We inspired through Gabriel (this Qur'an) in this Qur'an, (though aforetime) before Gabriel brought down the Qur'an to you (thou wast of the heedless) in relation to the event of Joseph and his brothers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ نَحْنُ } من كمال لطفنا معك { نَقُصُّ عَلَيْكَ } يا أكمل الرسل، تأييداً لأمرك وتعظيماً لشأنك { أَحْسَنَ ٱلْقَصَصِ } استماعاً وأكملها انتفاعاً وأشملها عبرة وأتمها فائدة وأعمها عائدة؛ إذ الفطن اللبيب استفاد منها من العبر والتذكيرات والرموز والإشارات ما يكفي مؤونة سلوكه في أمر دينه لو كا من ذوي الرشد وأهل الخبرة والبصيرة، وإنما علمناه لك ونبهناه عليك ملتبساً { بِمَآ أَوْحَيْنَآ } أي: بأيحائنا وإنزالنا { إِلَيْكَ هَـٰذَا ٱلْقُرْآنَ } المخبر عن المغيبات المكنونة في حضرة علمنا { وَإِن كُنتَ } في نفسك { مِن قَبْلِهِ } أي: قبل وحينا وألهامنا إياك { لَمِنَ ٱلْغَافِلِينَ } [يوسف: 3]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { نحن نقصُّ عليك أحسن القَصَص } أحسن الاقتصاص لأنه اقتص على أبدع الأساليب، أو أحسن ما يُقص لاشتماله على العجائب والحِكَمٍ والآيات والعِبَر، { بما أوحينا إليك هذا القرآن } مشتملاً على هذه السورة التي فيها قصة يوسف، التي هي من أبدع القصص، { وإن كنتَ من قبله لَمِنَ الغافلين } عن هذه القصة، لم تخطر ببالك، ولم تقرع سمعك\n قال البيضاوي: وهو تعليل لكونه موحى، و \" إنْ \" هذه: مخففة واللام هي الفارقة\n هـ\n  الإشارة: ما نزل القرآن بلسان عربي مبين إلا لنعقل عظمة ربنا ونعرفه، وذلك لا يكون إلا بعد استعمال العقول الصافية، والأفكار المنورة، في الغوص على درر معانيه\n فحينئذٍ تطلع على أنوار التوحيد وأسرار التفريد، وعلى أنوار الصفات، وأسرار الذات، وعلى توحيد الأفعال وتوحيد الصفات، وتوحيد الذات\n وقال تعالى:\n\n[الأنعام: 38]، لكن لا يحيط بهذا إلا أهل التجريد، الذين صفت عقولهم من الأكدار، وتطهرت من الأغيار، وملئت بالمعارف والأسرار\n قال تعالى:\n",
      "translations": []
    }
  ]
}