{
  "chapter": "يوسف",
  "text": "ثم ياتى منۢ بعد ذلك سبع شداد ياكلن ما قدمتم لهن الا قليلا مما تحصنون",
  "translations": [
    {
      "translation": "Then there will come seven years of hardship which will consume the grain you had laid up against them, except a little you may have stored away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there will follow seven years of great hardship in which you will eat up all you have stored earlier, except the little that you may set aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After this will ensue seven years of famine in which all the grain that you have stored will be consumed except a small quantity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Then after that will come seven hard years which will devour all that you had stored for them, except a little which you may save.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will come after that, seven hard (years), which will devour what you have laid by in advance for them, (all) except a little of that which you have guarded (stored).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there shall come after that seven years of hardship which shall eat away all that you have beforehand laid up in store for them, except a little of what you shall have preserved:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then thereafter there shall come upon you seven hard years, that shall devour what you have laid up for them, all but a little you keep in store.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after that will come seven hard years which will devour all that ye have prepared for them, save a little of that which ye have stored.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there will follow seven years of great hardship which will consume all but a little of what you stored.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then thereafter will come seven hard years which will devour that which ye have laid up beforehand for them except a little which ye shall preserve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after that there will come seven hard years which will eat up whatever you have set aside for them—all except a little which you preserve [for seed].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will come after that (period) seven dreadful (years), which will devour what ye shall have laid by in advance for them,- (all) except a little which ye shall have (specially) guarded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will come after that, seven hard (years), which will devour what you have laid by in advance for them, (all) except a little of that which you have guarded (stored).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter, seven hard years will come upon you, which will consume all but little of that which you have stored.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after that will come seven difficult ones, which will consume what you have stored for them, except for the little that you have preserved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will come after that seven difficult [years] which will consume what you saved for them, except a little from which you will store.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:48] Then after that, in other words, after the seven fertile [years], there shall come seven hard, barren and unyielding, years — the interpretation of the seven lean ones — which shall devour what you set aside for them, of grain sown during the fertile years, in other words, you shall eat [all] this during these [seven hard years], all except a little which you have preserved, stored.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then after that) after the seven years of soil fertility (will come seven hard years) seven years of drought (which will devour all that ye have prepared for them) all that you have saved during the seven years of soil fertility, (save a little of that which ye have stored) kept aside.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ قَلِيلاً مِّمَّا تُحْصِنُونَ } معناه تُحْرِزُونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ يَأْتِي مِن بَعْدِ ذٰلِكَ } أي: بعد انقضاء سني الخصب والرخاء { سَبْعٌ شِدَادٌ } ذوي جدب وعناء، لا ينبت فيها الزرع وفي تلك المدة { يَأْكُلْنَ } أي: أهلها جميع { مَا قَدَّمْتُمْ لَهُنَّ } وادخرتم لهن في سني الخصب { إِلاَّ قَلِيلاً مِّمَّا تُحْصِنُونَ } [يوسف: 48] أي: تحرزونه وتحفظونه للبذر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم يأتي من بعد ذلك سبع شِدَادٌ } أي: ذات شدة وجوع { يأكُلْنَ ما قدمتم لهن } أي: يأكل أهلهن ما ادخرتم لأجلهن\n أسند الأكل إلى السنين مجازاً تَطْبِيقاً بين المعبر والمعبر به، { إلا قليلاً مما تحصنون } أي: مما تخزنون وتخبئُون للزراعة والبذر\n { ثم يأتي من بعد ذلك عام يُغاث الناس } أي: يغيثهم الله بالفرج من القحط، أو يغاث بالمطر، لكن مصر إنما تسقى من النيل",
      "translations": []
    }
  ]
}