{
  "chapter": "يوسف",
  "text": "يصىحبى السجن اما احدكما فيسقى ربه خمرا واما الءاخر فيصلب فتاكل الطير من راسه قضى الامر الذى فيه تستفتيان",
  "translations": [
    {
      "translation": "My fellow-captives, one of you will serve his lord with wine, the other of you will be crucified and birds will eat his head. The thing you asked about is foreordained.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O fellow-prisoners, one of you will serve wine to your master, the other will be crucified and the birds will peck at his brain. Determined is the matter of your inquiry.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fellow-prisoners! (This is the interpretation of your dreams): one of you will serve wine to his lord (the king of Egypt). As for the other, he will be crucified and birds will eat of his head. The question concerning what you asked has thus been decided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fellow-prisoners, your dreams tell that one of you will serve wine to his master and the other will be crucified and his head consumed by the birds. Judgment has already been passed about the meaning of the dreams that you asked about.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my two fellow-prisoners! One of you will give his lord (the king) wine to drink; regarding the other, he will be crucified, therefore birds will eat from his head; the command has been given concerning the matter you had enquired about.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O two companions of the prison! As for one of you, he will pour out wine for his master to drink; and as for the other, he will be crucified and birds will eat from his head. Thus is the case judged concerning which you both did inquire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my two mates of the prison! as for one of you, he shall give his lord to drink wine; and as for the other, he shall be crucified, so that the birds shall eat from his head, the matter is decreed concerning which you inquired.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fellow-prisoners, as for one of you, he shall pour wine for his lord; as for the other, he shall be crucified, and birds will eat of his head. The matter is decided whereon you enquire.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my two fellow-prisoners! As for one of you, he will pour out wine for his lord to drink; and as for the other, he will be crucified so that the birds will eat from his head. Thus is the case judged concerning which ye did inquire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my two fellow-prisoners, one of you will serve wine to his lord, the other of you will be crucified and birds will feed off his head. The matter about which you have been seeking my opinion has been so decreed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My two fellow-prisoners; as for one of you twain he will pour out wine for his lord; and as for the other, he will be crucified, and the birds will eat from off his head; O Thus is decreed the affair whereof ye twain enquired.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my prison mates! As for one of you, he will serve wine to his master, and as for the other, he will be crucified and vultures will eat from his head. The matter about which you inquire has been decided.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my two companions of the prison! As to one of you, he will pour out the wine for his lord to drink: as for the other, he will hang from the cross, and the birds will eat from off his head. (so) hath been decreed that matter whereof ye twain do enquire\"...\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O two companions of the prison! As for one of you, he (as a servant) will pour out wine for his lord (king or master) to drink; and as for the other, he will be crucified and birds will eat from his head. Thus is the case judged concerning which you both did inquire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My fellowprisoners, one of you will pour wine for his lord whereas the other will be crucified, and birds will peck at his head. The matter you inquired about has been decided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my fellow inmates! One of you will serve his master wine; while the other will be crucified, and the birds will eat from his head. Thus the matter you are inquiring about is settled.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O two companions of prison, as for one of you, he will give drink to his master of wine; but as for the other, he will be crucified, and the birds will eat from his head. The matter has been decreed about which you both inquire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:41] O fellow-prisoners! As for one of you, that is, the cup-bearer, he will depart after three [days] and, he shall serve his lord, his master, wine to drink, as usual; and as for the other, he will depart after three [days] and, he will be crucified so that the birds will eat from his head: this is the interpretation of both your dreams. They said, ‘We never dreamed a thing!’; he said, decided, concluded, is the matter regarding which you sought opinion’, about which you enquired, whether you spoke truthfully or were lying.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Joseph them proceeded to interpret the dreams of the two prisoners, saying: (0 my two fellow prisoners! As for one of you) the cupbearer, he will return to his former position and glory, (he will pour out wine for his 247 lord) his master the king (to drink; and as for the other) the baker, he will leave prison, and (he will be crucified so that the birds will eat from his head) the two prisoner were alarmed upon hearing the interpretation of the baker's dream. Both of them hastened to say: \"We have not seen any dreams!\" But Joseph said to them: (Thus is the case judged concerning which ye did inquire) it will be just as I have informed you, whether you saw those dreams or not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوقوله: { أمّا أحدكما فيسقي ربّه خَمْراً } تعيين لشأن الأول بعد السياسة بالمنع عن الشرك وهو تسليط حب اللذات على الروح { وأما الآخَر فيُصْلب فتَأكُل الطير من رأسه } بيان لما يؤول إليه أمر الثاني\n وصلبه: منعه عن أفعاله بنفسه وقمعه عن مقتضاه وتثبيته وتقريره على جذع القوة الطبيعية النباتية بحيث لا تصرّف للمتخيلة فيه ولا له فيها ولا في سائر القوى الحيوانية وذلك هو إماتة الهوى\n فتأكل بعد الإماتة والصلب طير قوى النفس من رأسه بأمر الحق وهو الوقوف مع الحقوق { قُضِي الأمرُ الذي فيه تَسْتَفْتِيان } أي: ثبت واستقرّ أمركما على هذا وذلك وقت وصوله وتقرّبه من الله وأوان ظهور مقام الولاية بالفناء في الله\n وإذا تمكنت القوّتان فيما عينه لهما من الأمر ثم تم أمره بالوصول إلى مقام الشهود الذاتي وانقضت خلوته\n فإنّ طول مدة السجن هو امتداد سلوكه في الله\n فإذا تمّ له الفناء استوى أمر القوتين لكونهما بالله حينئذ لا بنفسهما وانتهى زمان الخلوة بابتداء زمان البقاء بالوجود الحقانيّ\n ولكن لم يتم بعد لوجود البقية المشار إليها بقوله: { اذْكُرني عِند ربّك } أي: اطلب الوجود في مقام الروح بالمحبة والاستقرار فيه\n فإنّ المحبة إذا أسكرت الروح بخمر العشق ارتقى الروح إلى مقام الوحدة والقلب إلى مقام الروح\n ويسمى الروح في ذلك المقام خفياً والقلب سراً\n وهو ليس بالفناء لكونهما موجودين حينئذ مغمورين بنور الحق\n ومن الوقوف في هذا المقام ينشأ الطغيان والأنائية فلهذا قال: { فأنساه الشيطان ذِكْر ربّه } أي: أنسى شيطان الوهم يوسف القلب ذكر الله تعالى بالفناء فيه لوجود البقية وطلبه مقام الروح وإلا ذهل عن ذكر نفسه ووجوده وللاحتجاب بهذا المقام وهذه البقية لبث { في السجن بضع سِنين } وإليه اشار النبي صلى الله عليه وسلم بقوله:\n \" رحم الله أخي يوسف\n لو لم يقل اذكرني عند ربّك لما بقي في السجن بضع سنين \" \n\n أو أنسى شيطان الوهم المقهور الممنوع المحجوب عن جناب الحق رسول المحبة المقرب عند ارتفاع درجته واستيلائه واستعلاء سلطانه\n والتحيّر في الجمال الإلهي\n والسِكْر الغالب ذكر يوسف القلب في حضرة الشهود لأن المحب المشاهد للجمال حيران ذاهل عن الخلق كله وتفاصيل وجوده بل نفسه مستغرق في عين الجمع حتى يتم فناؤه وينقضي سكره ثم يرجع إلى الصحو فيذكر التفصيل ثم لما انتهى فناؤه بالانغماس في بحر الهوية والانطماس في الذات الأحدية وانقضى زمان السجن أحياه الله تعالى بحياته ووهب له وجوداً من ذاته وصفاته فأراه صورة التبديل في صفات النفس مدّة اعتزاله عنها بالخلوة والسلوك في الله بصورة أكل البقرات العجاف السمان\n وفي صفات الطبيعة البدنية بصورة استيلاء السنبلات اليابسة على الخضر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: منهما: يتعلق بظن\n والظن يحتمل أن يكون بمعنى اليقين لأن قوله: قضي الأمر يقتضي ذلك\n أو يبقى على بابه\n يقول الحق جل جلاله: قال يوسف: { يا صاحِبَي السجن } المستفتيان عن الرؤيا\n { أما أحدُكُما } وهو الساقي\n { فيسْقي ربه خمراً } كما كان يسقيه قبلُ\n ويعود إلى ما كان عليه\n { وأما الآخرُ فيُصلبُ فتأكلُ الطيرمن رأسه } \n فقالا: كَذَبْنا ما رأينا شيئاً\n فقال: { قُضِيَ الأمرُ الذي فيه تستفتيان } \n سبق به القضاءُ في الأزل\n وهو ما يؤول إليه أمركما\n ولذلك وحده ولم يقل: قضي أمراكما\n رُوي أنه لما دعاهما إلى التوحيد أسلم الساقي وأبى الخباز\n فأخرج بعد ثلاث وصُلب\n { وقال للذي ظنَّ أنه ناج منهما } يوسف\n أي: تيقن\n أو غلب على ظنه أنه ناجٍ منهما\n إما عن وحي\n على الأول\n أو باجتهاد بسبب الرؤيا: { اذكُرني عند ربك } عند سيدك\n وهو المَلِك\n وقل له: غلامٌ سُجنَ ظُلماً\n لعله يُخلصني\n قال ابن عطية: يحتمل أن يذكره بعلمه ومكانته\n ويحتمل أن يذكره بمظلمته\n وما امتحن به بغير حق\n أو يذكره بهما\n هـ\n وقال الورتجبي: يحتمل أن قوله: { اذكرني عند ربك }: عَرَّف له طريقتي مع الله حتى يعرفني أني رسول الله\n ويطيعني في طاعة الله\n وينجو بذلك من عذابه\n ويصل إلى ثوابه\n ويأمر بالمعروف وينهى عن المنكر\n وليوحد الله تعالى\n ويتخلص من كيد الشيطان\n وما معه من الإنسان\n هـ\n { فأنسَاهُ الشيطانُ ذكرَ ربه } أي: فأنسى الساقي أن يذكر يوسف لربه\n أو أنسي يوسفَ ذكرَ الله حتى استغاث بغير\n فأدبه\n { فلبثَ في السجن } \n وفي الحديث عنه صلى الله عليه وسلم:\n \" رَحِمَ الله أخِي يُوسُف\n لَوْ لَمْ يَقُل: اذْكرْنِي عند رَبِّك\n لَمَا لَبِثَ في السِّجنِ سَبْعاً بَعدَ الخَمسِ \"\n \nروي أن جبريل عليه السلام أتاه بعد المقالة\n فقال له: مَن أخرجك من الجُبِّ\n وخلِّصك من القتل\n وعَصَمَكَ من الفاحشة؟ فقال: الله\n فقال: كيف تعتصم بغيره\n وتثق بالمخلوق\n وترفع قصتك إليه\n وتترك ربك؟! قال: يا جبريل كلمات جرت على لساني\n وأنا تائب لا أعود لمثلها\n هـ\n والاستعانة بالمخلوق\n وإن كانت جائزة شرعاً\n لكنها لا تليق بمقام الأقوياء\n { فلبث في السجن بضْعَ سنين } البضع: من الثلاث إلى التسع\n؟ رُوي أن يوسف عليه السلام سجن خمس سنين أولاً\n ثم سجن بعد المقالة سبع سنين\n  الإشارة: النسيان والغفلة التي لا تثبت في القلب\n والخواطر التي ترد وتذهب من أوصف البشرية التي لا تنافي الخصوصية\n إذ لا انفكاك للعبد عنها\n قال تعالى:\n[الأعراف: 201] فالطيف لا ينجو منه أحد لأنه من جملة أوصاف العبودية التي بها تعرف كمالات الربوبية\n\nوقد قال تعالى في حق سيد العارفين:\n[الأعراف: 200] فالعصمة التي تجب للأنبياء إنما هي مما يوجب نقصاً أو غضاً من مرتبتهم\n وهذه الأمور إنما توجب كمالاً لأنها بها يتحقق كمال العبودية التي هي شرف العبد\n فافهم وسلم\n ولا تنتقد\n فإن هذه الأمور لا يفهمها إلا العارفون بالله\n دون غيرهم من أهل العلم الظاهر\n  وقال الورتجبي: إن يوسف عليه السلام لم يعلم وقت إيمان الملك\n ولم يأت وقت دخوله في الإسلام\n فأنساه الشيطان ذكر ربه\n في سابق حكمه\n على تقدير وقت إيمان الملك\n فلبث في السجن إلى وقت إيمان الملك\n فنسيان يوسف: احتجابه عن النظر إلى قدره السابق\n هـ\n ثم ذكر سبب خورجه من السجن\n فقال: { وَقَالَ ٱلْمَلِكُ إِنِّيۤ أَرَىٰ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:36",
      "similarity": 0.34986057167545975
    },
    {
      "verse": "86:7",
      "similarity": 0.3103342197118548
    },
    {
      "verse": "7:124",
      "similarity": 0.30105502378987586
    },
    {
      "verse": "2:219",
      "similarity": 0.2827984959720065
    },
    {
      "verse": "26:49",
      "similarity": 0.2825440605702014
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012041.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012041.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:41.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}