{
  "chapter": "يوسف",
  "text": "وقال للذى ظن انه ناج منهما اذكرنى عند ربك فانسىه الشيطن ذكر ربه فلبث فى السجن بضع سنين",
  "translations": [
    {
      "translation": "He said to the one of them he knew was saved, 'Please mention me when you are with your lord,' but Shaytan made him forget to remind his lord, and so he stayed in prison for several years.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (Joseph) asked the man he knew would be released: \"Remember me to your lord;\" but Satan made him forget to mention this to his lord, and Joseph remained in prison for a number of years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Joseph said to the one of the two prisoners who he knew would be set free: \"Mention me in your lord's presence.\" But Satan caused him to forget mentioning this to his lord (the ruler of Egypt) and so Joseph languished in prison for several years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph asked the one, whom he knew would not be executed, to mention his case to his Lord. Satan caused that man to forget all about Joseph and his case. Thus, Joseph remained in prison for some years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the two, Yusuf said to the one whom he sensed would be released, “Remember me, in the company of your lord”; so Satan caused him to forget to mention Yusuf to his lord, he therefore stayed in prison for several years more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said to the one whom he knew to be saved: \"Mention me to your king.\" But Shaytan made him forget to mention it to his master. So [Yusuf] stayed in prison a few (more) years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said to him whom he knew would be delivered of the two: Remember me with your lord; but the Shaitan caused him to forget mentioning (it) to his lord, so he remained in the prison a few years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he said to the one he deemed should be saved of the two, 'Mention me in thy lord's presence.' But Satan caused him to forget to mention him to his master, so that he continued in the prison for certain years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said unto him of the twain who he knew would be released: Mention me in the presence of thy lord. But Satan caused him to forget to mention it to his lord, so he (Joseph) stayed in prison for some years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said to the one he thought would be saved, \"Mention me to your master.\" However Satan made him forget to mention him to his master, and so Joseph remained in prison for a number of years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said to one of them who he imagined would be saved: mention me in the presence of thy lord. Then the Satan caused him to forget to mention him to his lord, so that he tarried in the prison several years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he said to the one whom he knew would be delivered from among the two: ‘Mention me to your master.’ But Satan caused him to forget mentioning [it] to his master. So he remained in the prison for several years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the two, to that one whom he consider about to be saved, he said: \"Mention me to thy lord.\" But Satan made him forget to mention him to his lord: and (Joseph) lingered in prison a few (more) years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said to the one whom he knew to be saved: \"Mention me to your lord (i.e. your king, so as to get me out of the prison).\" But Shaitan (Satan) made him forget to mention it to his Lord [or Satan made [(Yusuf (Joseph)] to forget the remembrance of his Lord (Allah) as to ask for His Help, instead of others]. So [Yusuf (Joseph)] stayed in prison a few (more) years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said to the one of the two who he knew would be saved: 'Mention me in the presence of your lord' But satan made him forget to mention him to his master, so that he remained in prison for a certain number years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said to the one he thought would be released, “Mention me to your master.” But Satan caused him to forget mentioning him to his master, so he remained in prison for several years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said to the one whom he knew would go free, \"Mention me before your master.\" But Satan made him forget the mention [to] his master, and Joseph remained in prison several years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:42] Then he said to the one whom he deemed, [whom] he was certain, would be saved of the two — and this   was the cup-bearer: ‘Mention me to your lord’, your master, and say to him, ‘There is a young man in jail who has been wrongly imprisoned’. So he [the cup-bearer] departed, but Satan caused him, that is, the cupbearer, to forget the mention, of Joseph, before his master, so that he, Joseph, stayed, he remained, in prison for some years: it is said [that he remained] for seven years, or for twelve.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he said unto him of the twain who he knew would be released) from prison, i.e. the cupbearer: (Mention me in the presence of thy lord) your master the king; tell him that I have been wronged: my brothers sold me when I being a free man and I was put into prison while being innocent. (But Satan caused him to forget to mention it to his lord) Satan made him so preoccupied that he forgot to mention Joseph to his master, the king. It is also said that this means: Satan whispered to him: if you mention prison to the king, he will put you back in it. This is why he did not mention Joseph to the king; it is also said that the meaning of this is: Satan made Joseph forget the remembrance of his Lord and instead remembered a created being like him, (so he (Joseph) stayed in prison for some years) seven years, as a punishment for not mentioning Allah, when he had already spent five years in jail.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَبِثَ فِي ٱلسِّجْنِ بِضْعَ سِنِينَ } يُقالُ اثنتي عَشرة سنةً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"So he remained in prison for a number of years,\" is said to be twelve years.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَ } يوسف { لِلَّذِي ظَنَّ أَنَّهُ نَاجٍ مِّنْهُمَا } وهو الشرابي: { ٱذْكُرْنِي عِندَ رَبِّكَ } أي: اذكر حالي لملك عند ملاقاتك\n وقل له أن رجلاً سُجن بلا جرم صدر عنه\n وأوصاه به على طمع أن يستخلصه ويستكشف عن أمره\n ولم يستثن مع أن المناسب بحاله ورتبته العلية الاتكال على الله\n والتبتل نحوه بلا التفات إلى الغير أصلاً\n والرضا بما جرى عليه من القضاء\n والتصبر على هجوم البلاء وتزاحم المكروهات\n فضلاً عن أن يستعد بلا استثناء\n وذلك قبل الوحي { فَأَنْسَاهُ ٱلشَّيْطَانُ } للناجي { ذِكْرَ رَبِّهِ } أي: ذكر حال يوسف عند الملك حين جلس في مجلسه وسقى له خمراً { فَلَبِثَ } وبقيى يوسف بسبب ترك الاستثناء والاستخلاص من المصنوع الأرذل الأنزل والاستعانة منه { فِي ٱلسِّجْنِ } بعد لبثه خمساً { بِضْعَ سِنِينَ } [يوسف: 42] أي: سبعً بعد الخمس\n مجاراة عله وانتقاماً عنه\n كما قال صلى الله عليه وسلم:\n \" رحم الله أخي يوسف لو لم يقل: اذكرني عند ربك لما لبث في السجن سبعاً بعد الخمس \"\n \n ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:4",
      "similarity": 0.6162476281511826
    },
    {
      "verse": "12:62",
      "similarity": 0.3551753435598618
    },
    {
      "verse": "26:29",
      "similarity": 0.3217769117044187
    },
    {
      "verse": "83:8",
      "similarity": 0.3077768138162948
    },
    {
      "verse": "23:112",
      "similarity": 0.3050589899638194
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}