{
  "chapter": "يوسف",
  "text": "اذ قال يوسف لابيه يابت انى رايت احد عشر كوكبا والشمس والقمر رايتهم لى سجدين",
  "translations": [
    {
      "translation": "When Yusuf told his father, 'Father! I saw eleven bright stars, and the sun and moon as well. I saw them all prostrate in front of me.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph told his father: \"O my father, I saw eleven stars and the sun and the moon bowing before me in homage,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call to mind when Joseph said to his father: \"My father! I saw (in a dream) eleven stars and the sun and the moon: I saw them prostrating themselves before me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said, \"Father, in my dream I saw eleven stars, the sun and the moon prostrating before me,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Yusuf (Joseph) said to his father, “O my father! I saw eleven stars and the sun and the moon – I saw them prostrating to me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Yusuf said to his father: \"O my father! Verily, I saw (in a dream) eleven stars and the sun and the moon - I saw them prostrating themselves to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Yusuf said to his father: O my father! surely I saw eleven stars and the sun and the moon-- I saw them making obeisance to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said to his father, 'Father, I saw eleven stars, and the sun and the moon; I saw them bowing down before me.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said unto his father: O my father! Lo! I saw in a dream eleven planets and the sun and the moon, I saw them prostrating themselves unto me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph told his father, \"My father, I saw eleven stars, and the sun and moon: I saw them prostrate themselves before me,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time Yusufj said unto his father:, y father! verily have seen eleven stars and the sun and the moon; I have seen them prostrating themselves unto me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said to his father, ‘Father! I saw eleven planets, and the sun and the moon: I saw them prostrating themselves before me,’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! Joseph said to his father: \"O my father! I did see eleven stars and the sun and the moon: I saw them prostrate themselves to me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Yusuf (Joseph) said to his father: \"O my father! Verily, I saw (in a dream) eleven stars and the sun and the moon, I saw them prostrating themselves to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said to his father: 'Father, I saw eleven planets, and the sun and the moon; I saw them prostrating themselves before me'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said to his father, “O my father, I saw eleven planets, and the sun, and the moon; I saw them bowing down to me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Of these stories mention] when Joseph said to his father, \"O my father, indeed I have seen [in a dream] eleven stars and the sun and the moon; I saw them prostrating to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:4] Mention, when Joseph said to his father, Jacob: ‘O my father (read yā abati to indicate the omitted yā’ of genitive annexation [sc. of yā abī]; or read yā abata to indicate that an alif, originally a yā’, has been   omitted) I saw, in my sleep, eleven planets and the sun and the moon, I saw them ([repeated] for emphasis) prostrating themselves before me’ (sājidīn: this plural form is used to describe [the act of] ‘prostration’, which is an attribute associated with rational beings).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ إذ قال } بدل اشتمال أو بَعْض من { أحْسَن القصص } \\[ سورة يوسف : 3 \\] على أن يكون أحسن القصص بمعنى المفعول ، فإنّ أحسن القصص يشتمل على قصَص كثير ، منه قَصص زمان قول يوسفَ عليه السّلام لأبيه إني رأيت أحَدَ عَشَرَ كوكباً } وما عقب قوله ذلك من الحوادث . فإذا حمل { أحسن القصص } \\[ سورة يوسف : 3 \\] على المصدر فالأحسن أن يكون إذْ } منصوباً بفعل محذوف يدلّ عليه المقام ، والتّقدير : اذْكر .ويُوسف اسم عبراني تقدم ذكر اسمه عند قوله تعالى : { وتلك حجتنا آتيناها إبراهيم على قومه } الخ في سورة الأنعام ( 83 ). وهو يوسف بن يعقوب بن إسحاق من زوجه ( راحِيل ). وهو أحد الأسباط الذين تقدم ذكرهم في سورة البقرة . وكان يوسف أحب أبناء يعقوب عليهما السّلام إليه وكان فَرْط محبة أبيه إياه سَببَ غيرة إخوته منه فكادُوا له مكيدة فسألوا أباهم أن يتركه يخرج معهم . فأخرجوه معهم بعلّة اللعب والتفسح ، وألقَوْهُ في جبّ ، وأخبروا أباهم أنّهم فقدوه ، وأنهم وجدوا قميصه ملوّثاً بالدّم ، وأروه قميصه بعد أن لطّخوه بدم ، والتقطه من البئر سيارة من العرب الإسماعيليين كانوا سائرين في طريقهم إلى مصر ، وباعوه كرقيق في سوق عاصمة مصر السفلى التي كانت يومئذٍ في حكم أمّة من الكنعانيين يعرفون بالعمالقة أو ( الهكْصوص ). وذلك في زمن الملك ( أبو فيس ) أو ( ابيبي ). ويقرب أن يكون ذلك في حدود سنة تسع وعشرين وسبعمائة وألف قبل المسيح عليه السّلام ، فاشتراه ( فوطيفار ) رئيس شرطة فرعون الملقّبُ في القرآن بالعزيز ، أي رئيس المدينة . وحدثت مكيدة له من زوج سيّده ألقي بسببها في السجن . وبسبب رؤيا رآها الملِكُ وعَبّرها يوسف عليه السّلام وهو في السِجن ، قَرّبه الملك إليه زُلفى ، وأولاه على جميع أرض مصر ، وهو لقب العزيز وسَمّاه ( صفنات فعنيج ) ، وزوّجه ( أسنات ) بنت أحد الكهنة وعمره يومئذٍ ثلاثون سنة . وفي مدة حكمه جَلَب أباه وأقاربه من البريّة إلى أرض مصر ، فذلك سبب استيطان بني إسرائيل أرض مصر . وتوفي بمصر في حدود سنة خمس وثلاثين وستمائة وألف قبل ميلاد عيسى عليه السّلام . وحنّط على الطريقة المصرية . ووُضع في تابوت ، وأوصى قبل موته قومه بأنهم إذا خرجوا من مصر يرفعون جسده معهم . ولمّا خرج بنو إسرائيل من مصر رفعوا تابوت يوسف عليه السّلام معهم وانتقلوه معهم في رحلتهم إلى أن دفنوه في ( شكِيم ) في مدة يوشع بن نون .والتاء في ( أبَت ) تاء خاصّة بكلمة الأب وكلمة الأم في النداء خاصة على نية الإضافة إلى المتكلم ، فمفادها مفاد : يا أبي ، ولا يكاد العرب يقولون : يا أبي . وورد في سَلام ابن عمر على النبي صلى الله عليه وسلم وصاحبه حين وقف على قبورهم المنوّرة .وقد تحيّر أيمّة اللغة في تعليل وصلها بآخر الكلمة في النداء واختاروا أن أصلها تاء تأنيث بقرينة أنهم قد يجعلونها هاء في الوقف ، وأنها جعلت عوضاً عن ياء المتكلم لِعلة غير وجيهة . والذي يظهر لي أنّ أصلها هاء السكت جلبوها للوقف على آخر الأب لأنّه نقص من لام الكلمة ، ثم لما شابهت هاء التأنيث بكثرة الاستعمال عوملت معاملة آخر الكلمة إذا أضافوا المنادى فقالوا : يا أبتي ، ثم استغنوا عن ياء الإضافة بالكسرة لكثرة الاستعمال . ويدل لذلك بقاء الياء في بعض الكلام كقول الشاعر الذي لا نعرفه: ... أيَا أبتي لا زلتَ فينا فإنّمَالنا أملٌ في العيْش ما دمت عائشاً ... ويجوز كسر هذه التّاء وفتحها ، وبالكسر قرأها الجمهور ، وبفتح التّاء قرأ ابن عامر وأبو جعفر .والنداء في الآية مع كون المنادى حاضراً مقصود به الاهتمام بالخبر الذي سيلقى إلى المخاطب فينزل المخاطب منزلة الغائب المطلوب حضوره ، وهو كناية عن الاهتمام أو استعارة له .والكوكب : النجم ، تقدّم عند قوله تعالى : { فلمّا جن عليه الليل رأى كوكباً } في سورة الأنعام ( 76 ).وجملة { رأيتهم } مؤكدة لجملة { رأيتُ أحدَ عَشَرَ كوكباً } ، جيء بها على الاستعمال في حكاية المرائي الحلمية أن يعاد فعل الرؤية تأكيداً لفظياً أو استئنافاً بيانياً ، كأن سامع الرؤيا يستزيد الرائي أخباراً عمّا رأى .ومثال ذلك ما وقع في «الموطّأ» أنّ رسول الله صلى الله عليه وسلم قال : \" أراني الليلة عند الكعبة فرأيت رجلاً آدم \" الحديث .وفي البخاري أنّ النبي صلى الله عليه وسلم قال : \" رأيت في المنام أني أهاجر من مكّة إلى أرض بها نخل ، ورأيت فيها بقرا تذبح ، ورأيت . . واللّهُ خير \" . وقد يكون لفظ آخر في الرؤيا غير فعلها كما في الحديث الطّويل \" إنّه أتاني الليلة آتيان ، وإنهما ابتعثاني ، وإنّهما قالا لي : انطلق ، وإنّي انطلقت معهما ، وإنّا أتينا على رجل مضطجع \" الحديث بتكرار كلمة ( إنّ ) وكلمة ( إنّا ) مراراً في هذا الحديث .وقرأ الجمهور { أحَدَ عَشَرَ } بفتح العين من { عَشَرَ }. وقرأه أبو جعفر بسكون العين .واستعمل ضمير جمع المذكر للكواكب والشمس والقمر في قوله : { رأيتهم لي ساجدين } ، لأن كون ذلك للعقلاء غالب لا مطرد ، كما قال تعالى في الأصنام { وتراهم ينظرون إليك وهم لا يبصرون } \\[ سورة الأعراف : 198 \\] ، وقال : { يا أيها النمل ادخلوا } \\[ سورة النمل : 18 \\].وقال جماعة من المفسّرين : إنه لمّا كانت الحالة المرئية من الكواكب والشمس والقمر حالة العقلاء ، وهي حالة السجود نزّلها منزلة العقلاء ، فأطلق عليها ضمير ( هم ) وصيغة جمعهم .وتقديم المجرور على عامله في قوله : لي ساجدين } للاهتمام ، عبّر به عن معنى تضمّنه كلام يوسف عليه السّلام بلغته يدل على حالة في الكواكب من التعظيم له تقتضي الاهتمام بذكره فأفاده تقديم المجرور في اللغة العربيّة .وابتداء قصة يوسف عليه السّلام بذكر رؤياه إشارة إلى أنّ الله هيّأ نفسه للنبوءة فابتدأه بالرؤيا الصّادقة كما جاء في حديث عائشة « أنّ أوّلَ ما ابتدىء رسول الله صلى الله عليه وسلم من الوحي الرؤيا الصادقة فكان لا يرى رؤيا إلاّ جاءت مثل فَلق الصبح » . وفي ذلك تمهيد للمقصود من القصة وهو تقرير فضل يوسف عليه السّلام من طهارة وزكاء نفس وصبر . فذكر هذه الرؤيا في صدر القصّة كالمقدّمة والتّمهيد للقصّة المقصودة .وجعل الله تلك الرؤيا تنبيهاً ليوسف عليه السّلام بعلو شأنه ليتذكرها كلما حلت به ضائقة فتطمئن بها نفسه أن عاقبتهُ طيبة .وإنما أخبر يوسف عليه السّلام أباه بهاته الرؤيا لأنّه علم بإلهام أو بتعليم سابق من أبيه أن للرؤيا تعبيراً ، وعلم أنّ الكواكب والشّمس والقمر كناية عن موجودات شريفة ، وأنّ سجود المخلوقات الشّريفة له كناية عن عظمة شأنه . ولعلّهُ علم أنّ الكواكب كناية عن موجودات متماثلة ، وأنّ الشمس والقمر كناية عن أصلين لتلك الموجودات فاستشعر على الإجمال دلالة رؤياه على رفعة شأنه فأخبر بها أباه .وكانوا يعدّون الرؤيا من طرق الإنباء بالغيب ، إذا سلمت من الاختلاط وكان مزاج الزائي غير منحرف ولا مضطرب ، وكان الرائي قد اعتاد وقوع تأويل رؤياه ، وهو شيء ورثوه من صفاء نفوس أسلافهم إبراهيم وإسحاق عليهم السّلام . فقد كانوا آل بيت نبوءة وصفاء سريرة .ولمّا كانت رؤيا الأنبياء وَحْياً ، وقد رأى إبراهيم عليه السّلام في المنام أنّه يذبح وَلَد فلمّا أخبره { قال يا أبت افْعل ما تؤمَر } \\[ سورة الصافات : 102 \\]. وإلَى ذلك يشير قول أبي يوسف عليه السّلام : { ويتم نعمته عليك وعلى آل يعقوب كما أتمها على أبويك من قبل إبراهيم وإسحاق } \\[ سورة يوسف : 6 \\]. فلا جرم أن تكون مرائي أبنائهم مكاشفة وحديثاً ملكياً .وفي الحديث : « لم يَبق من المبشرات إلاّ الرؤيا الصّالحة يراها المسلم أو ترى له » والاعتداد بالرؤيا من قديم أمور النبوءة . وقد جاء في التّوراة أن الله خاطب إبراهيم عليه السّلام في رؤيا رآها وهو في طريقه ببلاد شاليم بلد ملْكي صَادق وبشّره بأنه يهبه نسلاً كثيراً ، ويعطيه الأرض التي هو سائر فيها ( في الإصحاح 15 من سفر التكوين ).أما العرب فإنهم وإن لم يرد في كلامهم شيء يفيد اعتدادهم بالأحلام ، ولعل قول كعب بن زهير: ... إن الأماني والأحلام تضليليفيد عدم اعتدادهم بالأحلام ، فإن الأحلام في البيت هي مرائي النوم .ولكن ذكر ابن إسحاق رؤيا عبد المطلب وهو قائم في الحِجْر أنه أتاه آت فأمره بحفر بئر زمزم فوصَف له مكانها ، وكانت جرهم سَدَموها عند خروجهم من مكة .وذكر ابن إسحاق رؤيا عاتكة بنت عبد المطلب أن : راكباً أقبل على بعير فوقف بالأبطح ثم صرخ : يا آل غُدَر أُخرُجوا إلى مصارعكم في ثلاث فكانت وقعة بدر عقبها بثلاث ليال .وقد عدت المرائي النوميّة في أصول الحكمة الإشراقية وهي من تراثها عن حكمة الأديان السّالفة مثل الحنيفية . وبالغ في تقريبها بالأصول النفسية شهاب الدّين الحكيم السهروردي في هياكل النور وحكمة الإشراق ، وأبو علي بن سينا في الإشارات بما حاصله : وأصله : أنّ النفس الناطقة ( وهي المعبّر عنها بالروح ) هي من الجواهر المجرّدة التي مَقرها العالم العلوي ، فهي قابلة لاكتشاف الكائنات على تفاوت في هذا القبول ، وأنّها تودع في جسم الجنين عند اكتمال طور المضغة ، وأنّ للنفس الناطقة آثاراً من الانكشافات إذا ظهرت فقد ينتقش بعضها بمدارك صاحب النفس في لوح حسّه المشترك ، وقد يصرفه عن الانتقاش شاغلان : أحدهما } حِسّيّ خارجيّ ، والآخر باطنيّ عقليّ أو وهميّ ، وقوَى النفس متجاذبة متنازعة فإذا اشتدّ بعضُها ضعف البعضُ الآخر كما إذا هاج الغضب ضعفت الشهوة ، فكذلك إنْ تَجَرّدَ الحس الباطن للعمل شغل عن الحسّ الظاهر ، والنوم شاغل للحسّ ، فإذا قلّت شواغل الحواس الظاهرة فقد تتخلّص النفس عن شغل مخيلاتها ، فتطلّع على أمور مغيبة ، فتكونُ المنامات الصادقة .والرؤيا الصادقةُ حالةٌ يكرم الله بها بعض أصْفيائه الذين زكت نفوسهم فتتّصل نفوسهم بتعلّقات من علم الله وتعلّقات من إرادته وقدرته وأمره التكوينيّ فتنكشف بها الأشياء المغيبة بالزّمان قبل وقوعها ، أو المغيبة بالمكان قبل اطلاع الناس عليها اطلاعاً عاديّاً ، ولذلك قال النبي صلى الله عليه وسلم «الرؤيا الصالحة من الرّجل الصالح جزء من ستّة وأربعين جزءاً من النبوءة» . وقد بُيّن تحديد هذه النسبة الواقعة في الحديث في شروح الحديث . وقال : «لم يبق من النبوءة إلاّ المبشّرات وهي الرؤيا الصّالحة للرجل الصالح يراها أو ترى له» .وإنّما شرطت المرائي الصادقة بالنّاس الصّالحين لأنّ الارتياض على الأعمال الصّالحة شاغل للنفس عن السيّئات ، ولأنّ الأعمال الصّالحات ارتقاءات وكمالات فهي معينة لجوهر النفس على الاتّصال بعالَمها الذي خلقت فيه وأنزلت منه ، وبعكس ذلك الأعمال السيّئة تبعدها عن مألوفاتها وتبلدها وتذبذبها .والرؤيا مراتب :منها أن : ترى صور أفعال تتحقّق أمثالها في الوجود مثل رؤيا النبي صلى الله عليه وسلم أنه يهاجر من مكّة إلى أرض ذات نخل ، وظنّه أنّ تلك الأرض اليمامة فظهر أنّها المدينة ، ولا شك أنّه لمّا رأى المدينة وجَدَها مطابقة للصّورة التي رآها ، ومثل رؤياه امرأة في سَرَقَة من حرير فقيل له اكشِفْها فهي زوجك فكشف فإذا هي عائشة ، فعلم أن سيتزوجها . وهذا النوع نادر وحالة الكشف فيه قوية .ومنها أن ترى صُورٌ تكون رموزاً للحقائق التي ستحصل أو التي حصلت في الواقع ، وتلك من قبيل مكاشفة النفس للمعاني والمواهي وتشكيل المخيّلة تلك الحقائق في أشكال محسوسة هي من مظاهر تلك المعاني ، وهو ضرب من ضروب التشبيه والتمثيل الذي تخترعه ألباب الخطباء والشعراء ، إلاّ أنّ هذا تخترعه الألباب في حالة هدوّ الدمَاغ من الشواغل الشاغلة ، فيكون أتقن وأصدق .وهذا أكثر أنواع المرائي . ومنه رؤيا النبي صلى الله عليه وسلم أنّه يشرب من قدح لَبن حتى رأى الريّ في أظفاره ثم أعطَى فضلَه عمرَ بن الخطّاب رضي الله عنه . وتعبيره ذلك بأنّه العلم .وكذلك رؤياه امرأة سوداء ناشرة شَعَرَهَا خارجة من المدينة إلى الجحفة ، فعبّرها بالحمى تنتقل من المدينة إلى الجحفة ، ورئِيَ عبد الله بن سلام أنه في روضة ، وأنّ فيها عموداً ، وأنّ فيه عروة ، وأنّه أخذ بتلك العروة فارتقى إلى أعلى العمود ، فعبّره النبي صلى الله عليه وسلم بأنّه لا يزال آخذاً بالإيمان الذي هو العروة الوثقى ، وأنّ الروضة هي الجنّة ، فقد تَطابَق التمثيل النوميّ مع التمثيل المتعارف في قوله تعالى : { فمن يكفر بالطاغوت ويؤمن بالله فقد استمسك بالعروة الوثقى } \\[ سورة البقرة : 256 \\] ، وفي قول النبي : « ما بين بيتي ومنبري روضة من رياض الجنة » وسيأتي تأويل هذه الرؤيا عند قوله تعالى : { وقال يا أبت هذا تأويل رؤياي من قبل } \\[ سورة يوسف : 100 \\].\n\n",
      "translations": [
        {
          "translation": "(When Joseph said unto his father: my father! Lo! I saw in a dream) that I dreamt during the day (eleven planets) they came down from their orbits and prostrated themselves before me, a prostration of greeting- these are his brothers who were eleven in number-(and the sun and the moon, I saw them prostrating themselves unto me) he says: and I saw the sun and the moon coming down from their orbits and prostrated themselves before me, a prostration of greeting-these are his parents: Rachel and Jacob.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أبت إني رأيتُ أحدَ عشرَ كوكباً } إلى آخره\n هذه من المنامات التي ذكرنا في سورة هود أنها تحتاج إلى تعبير لانتقال المتخيلة من النفوس الشريفة التي عرض على النفس من الغيب سجودها له إلى الكواكب والشمس والقمر وما كانت في نفس الأمر إلا أبويه وإخوته { لا تقصص رؤياك على إخوتك فيكيدوا لك كَيْداً } هذا من الإلهامات المجملة\n فإنه قد يلوح صورة الغيب من المجردات الروحانية على الوجه الكلي العالي عن الزمان في الروح ويصل أثره إلى القلب ولا يتشخص في النفس مفصلاً حتى يقع العلم به كما هو فيقع في النفس منه خوف واحتراز\n إن كان مكروهاً\n وفرح وسرور إن كان مرغوباً\n ويسمى هذا النوع من الإلهام: إنذارات وبشارات\n فخاف عليه السلام من وقوع ما وقع قبل وقوعه\n فنهاه عن إخبارهم برؤياه احترازاً\n ويجوز أن يكون احترازه كان من جهة دلالة الرؤيا على شرفه وكرامته وزيادة قدره على إخوته\n فخاف من حسدهم عليه عند شعورهم بذلك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: إذ قال: معمول لاذكر\n أو بدل من أحسن القصص إن جعل مفعولاً\n بدل اشتمال\n ويا أبت: أصله: يا أبي\n عوض من الياء تاء التأنيث لتناسبهما في الزيادة\n ولذلك قلبت في الوقف هاء\n في قراءة ابن كثير وأبي عمر ويعقوب\n وإنما أعاد العامل في \" رأيتهم \" لطول الكلام\n وجمع الشمس والقمر والكواكب جمع العقلاء لوصفهم بصفاتهم\n يقول الحق جل جلاله: { إذ قال يوسفُ لأَبيهِ } يعقوب بن إسحاق بن إبراهيم: { يا أبتِ إني رأيتُ } في النوم { أحداً عَشَر كوكباً والشمسَ والقَمَرَ رأيتُهم لي ساجدين }\n وقد ذكر البيضاوي حديثاً في تفسير هذه الكواكب فانظره\n قيل: إن يوسف عليه السلام كان نائماً في حجر أبيه\n فنظر فيه\n وقال في نفسه: أترى هذا الوجه أحسن ام الشمس أم القمر؟ فإذا بيوسف قد انتبه من نومه\n وقال: { يا أبتِ إني رأيت أحد عشر كوكباً\n\n\n } الخ\n فلما قص الرؤيا على أبيه بكى\n فقال يوسف: لم تبكي يا أبتي؟ قال: يا بني لم يسجد مخلوق لمخلوق إلا عند المحنة\n والبلاء\n ألا ترى الملائكة لما أسجدهم الله لآدم\n كيف ابتلي بالخروج من الجنة؟ ثم قال له: يا بني\n الشمس والقمر أنا وخالتك ـ وكانت أمه قد ماتت ـ والإحدى عشر كوكباً إخوتك\n هـ\n  { قال يا بنيَّ } \n وهو تصغير ابن صغر للشفقة أو لصغر السن\n وكان ابن ثنتي عشرة سنة\n { لا تقصص رؤياك على إخوتك فيكيدوا لك كيداً } فيحتالوا لإهلاكك حيلة\n فَهِمَ يعقوبُ عليه السلام من رؤياه أن الله يصطفيه لرسالته\n ويفوقه على إخوته\n فخاف عليه حسدهم\n ومن خاف من شيء سلط عليه\n  والرؤيا تختص بالنوم\n والرؤية\n بالتاء بالبصر\n قال البيضاوي: وهي انطباع الصورة المنحدرة من أفق المتخيلة إلى الحس المشترك\n المصادفة منها إنما يكون باتصال النفس بالملكوت لما بينهما من التناسب عند فراغها من تدبير البدن أدنى فراغ\n انظر تمامه فيه\n وأخرج الحاكم في المستدرك\n والطبراني في الأوسط\n عن ابن عمر قال: لقي عمر عليَّاً ـ رضي الله عنهما ـ فقال: يا أبا الحسن\n الرجل يرى الرؤيا فمنها ما يصدق\n ومنها ما يكذب\n قال: نعم\n سمعت رسول الله صلى الله عليه وسلم يقول:\n \" ما من عبد ولا أمة ينام فيمتلي نوماً إلا عرج بروحه إلى السماء\n فالتي لا تستيقظ إلا عند العرش فتلك الرؤيا التي تصدقُ\n والتي تستيقظ دون العرش فتلك الرؤيا التي تكذبُ \" \nهـ\n فمنها ما تكون واضحة المعنى لا تحتاج إلى تعبير\n ومنها ما تكون خفية تحتاج إلى تعبير\n والمعبر يحتاج إلى علم وفراسة وزيادة إلهام\n فعلم التعبير علم مستقل\n وقد أعطى الله منه ليوسف عليه السلام حظاً وافراً\n\nولما قال يعقوب لابنه: { لا تقصص رؤياك على إخوتك فيكيدوا لك كيداً } قال: يا أبت\n الأنبياء لا يكيدون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:6",
      "similarity": 0.6397021578324326
    },
    {
      "verse": "82:2",
      "similarity": 0.4317140283375464
    },
    {
      "verse": "6:76",
      "similarity": 0.4202865863569331
    },
    {
      "verse": "41:37",
      "similarity": 0.3004147292844634
    },
    {
      "verse": "75:9",
      "similarity": 0.29813381502781394
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}