{
  "chapter": "يوسف",
  "text": "اذ قال يوسف لابيه يابت انى رايت احد عشر كوكبا والشمس والقمر رايتهم لى سجدين",
  "translations": [
    {
      "translation": "When Yusuf told his father, 'Father! I saw eleven bright stars, and the sun and moon as well. I saw them all prostrate in front of me.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph told his father: \"O my father, I saw eleven stars and the sun and the moon bowing before me in homage,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call to mind when Joseph said to his father: \"My father! I saw (in a dream) eleven stars and the sun and the moon: I saw them prostrating themselves before me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said, \"Father, in my dream I saw eleven stars, the sun and the moon prostrating before me,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Yusuf (Joseph) said to his father, “O my father! I saw eleven stars and the sun and the moon – I saw them prostrating to me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Yusuf said to his father: \"O my father! Verily, I saw (in a dream) eleven stars and the sun and the moon - I saw them prostrating themselves to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Yusuf said to his father: O my father! surely I saw eleven stars and the sun and the moon-- I saw them making obeisance to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said to his father, 'Father, I saw eleven stars, and the sun and the moon; I saw them bowing down before me.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said unto his father: O my father! Lo! I saw in a dream eleven planets and the sun and the moon, I saw them prostrating themselves unto me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph told his father, \"My father, I saw eleven stars, and the sun and moon: I saw them prostrate themselves before me,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time Yusufj said unto his father:, y father! verily have seen eleven stars and the sun and the moon; I have seen them prostrating themselves unto me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said to his father, ‘Father! I saw eleven planets, and the sun and the moon: I saw them prostrating themselves before me,’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! Joseph said to his father: \"O my father! I did see eleven stars and the sun and the moon: I saw them prostrate themselves to me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Yusuf (Joseph) said to his father: \"O my father! Verily, I saw (in a dream) eleven stars and the sun and the moon, I saw them prostrating themselves to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said to his father: 'Father, I saw eleven planets, and the sun and the moon; I saw them prostrating themselves before me'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Joseph said to his father, “O my father, I saw eleven planets, and the sun, and the moon; I saw them bowing down to me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Of these stories mention] when Joseph said to his father, \"O my father, indeed I have seen [in a dream] eleven stars and the sun and the moon; I saw them prostrating to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:4] Mention, when Joseph said to his father, Jacob: ‘O my father (read yā abati to indicate the omitted yā’ of genitive annexation [sc. of yā abī]; or read yā abata to indicate that an alif, originally a yā’, has been   omitted) I saw, in my sleep, eleven planets and the sun and the moon, I saw them ([repeated] for emphasis) prostrating themselves before me’ (sājidīn: this plural form is used to describe [the act of] ‘prostration’, which is an attribute associated with rational beings).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When Joseph said unto his father: my father! Lo! I saw in a dream) that I dreamt during the day (eleven planets) they came down from their orbits and prostrated themselves before me, a prostration of greeting- these are his brothers who were eleven in number-(and the sun and the moon, I saw them prostrating themselves unto me) he says: and I saw the sun and the moon coming down from their orbits and prostrated themselves before me, a prostration of greeting-these are his parents: Rachel and Jacob.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أبت إني رأيتُ أحدَ عشرَ كوكباً } إلى آخره\n هذه من المنامات التي ذكرنا في سورة هود أنها تحتاج إلى تعبير لانتقال المتخيلة من النفوس الشريفة التي عرض على النفس من الغيب سجودها له إلى الكواكب والشمس والقمر وما كانت في نفس الأمر إلا أبويه وإخوته { لا تقصص رؤياك على إخوتك فيكيدوا لك كَيْداً } هذا من الإلهامات المجملة\n فإنه قد يلوح صورة الغيب من المجردات الروحانية على الوجه الكلي العالي عن الزمان في الروح ويصل أثره إلى القلب ولا يتشخص في النفس مفصلاً حتى يقع العلم به كما هو فيقع في النفس منه خوف واحتراز\n إن كان مكروهاً\n وفرح وسرور إن كان مرغوباً\n ويسمى هذا النوع من الإلهام: إنذارات وبشارات\n فخاف عليه السلام من وقوع ما وقع قبل وقوعه\n فنهاه عن إخبارهم برؤياه احترازاً\n ويجوز أن يكون احترازه كان من جهة دلالة الرؤيا على شرفه وكرامته وزيادة قدره على إخوته\n فخاف من حسدهم عليه عند شعورهم بذلك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: إذ قال: معمول لاذكر\n أو بدل من أحسن القصص إن جعل مفعولاً\n بدل اشتمال\n ويا أبت: أصله: يا أبي\n عوض من الياء تاء التأنيث لتناسبهما في الزيادة\n ولذلك قلبت في الوقف هاء\n في قراءة ابن كثير وأبي عمر ويعقوب\n وإنما أعاد العامل في \" رأيتهم \" لطول الكلام\n وجمع الشمس والقمر والكواكب جمع العقلاء لوصفهم بصفاتهم\n يقول الحق جل جلاله: { إذ قال يوسفُ لأَبيهِ } يعقوب بن إسحاق بن إبراهيم: { يا أبتِ إني رأيتُ } في النوم { أحداً عَشَر كوكباً والشمسَ والقَمَرَ رأيتُهم لي ساجدين }\n وقد ذكر البيضاوي حديثاً في تفسير هذه الكواكب فانظره\n قيل: إن يوسف عليه السلام كان نائماً في حجر أبيه\n فنظر فيه\n وقال في نفسه: أترى هذا الوجه أحسن ام الشمس أم القمر؟ فإذا بيوسف قد انتبه من نومه\n وقال: { يا أبتِ إني رأيت أحد عشر كوكباً\n\n\n } الخ\n فلما قص الرؤيا على أبيه بكى\n فقال يوسف: لم تبكي يا أبتي؟ قال: يا بني لم يسجد مخلوق لمخلوق إلا عند المحنة\n والبلاء\n ألا ترى الملائكة لما أسجدهم الله لآدم\n كيف ابتلي بالخروج من الجنة؟ ثم قال له: يا بني\n الشمس والقمر أنا وخالتك ـ وكانت أمه قد ماتت ـ والإحدى عشر كوكباً إخوتك\n هـ\n  { قال يا بنيَّ } \n وهو تصغير ابن صغر للشفقة أو لصغر السن\n وكان ابن ثنتي عشرة سنة\n { لا تقصص رؤياك على إخوتك فيكيدوا لك كيداً } فيحتالوا لإهلاكك حيلة\n فَهِمَ يعقوبُ عليه السلام من رؤياه أن الله يصطفيه لرسالته\n ويفوقه على إخوته\n فخاف عليه حسدهم\n ومن خاف من شيء سلط عليه\n  والرؤيا تختص بالنوم\n والرؤية\n بالتاء بالبصر\n قال البيضاوي: وهي انطباع الصورة المنحدرة من أفق المتخيلة إلى الحس المشترك\n المصادفة منها إنما يكون باتصال النفس بالملكوت لما بينهما من التناسب عند فراغها من تدبير البدن أدنى فراغ\n انظر تمامه فيه\n وأخرج الحاكم في المستدرك\n والطبراني في الأوسط\n عن ابن عمر قال: لقي عمر عليَّاً ـ رضي الله عنهما ـ فقال: يا أبا الحسن\n الرجل يرى الرؤيا فمنها ما يصدق\n ومنها ما يكذب\n قال: نعم\n سمعت رسول الله صلى الله عليه وسلم يقول:\n \" ما من عبد ولا أمة ينام فيمتلي نوماً إلا عرج بروحه إلى السماء\n فالتي لا تستيقظ إلا عند العرش فتلك الرؤيا التي تصدقُ\n والتي تستيقظ دون العرش فتلك الرؤيا التي تكذبُ \" \nهـ\n فمنها ما تكون واضحة المعنى لا تحتاج إلى تعبير\n ومنها ما تكون خفية تحتاج إلى تعبير\n والمعبر يحتاج إلى علم وفراسة وزيادة إلهام\n فعلم التعبير علم مستقل\n وقد أعطى الله منه ليوسف عليه السلام حظاً وافراً\n\nولما قال يعقوب لابنه: { لا تقصص رؤياك على إخوتك فيكيدوا لك كيداً } قال: يا أبت\n الأنبياء لا يكيدون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:6",
      "similarity": 0.6397021578324326
    },
    {
      "verse": "82:2",
      "similarity": 0.4317140283375464
    },
    {
      "verse": "6:76",
      "similarity": 0.4202865863569331
    },
    {
      "verse": "41:37",
      "similarity": 0.3004147292844634
    },
    {
      "verse": "75:9",
      "similarity": 0.29813381502781394
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}