{
  "chapter": "يوسف",
  "text": "ما تعبدون من دونه الا اسماء سميتموها انتم وءاباؤكم ما انزل الله بها من سلطن ان الحكم الا لله امر الا تعبدوا۟ الا اياه ذلك الدين القيم ولكن اكثر الناس لا يعلمون",
  "translations": [
    {
      "translation": "What you serve apart from Him are only names which you and your forefathers have made up There is no mandate for them from Allah. Allah alone is qualified to judge. His order is to worship none but Him. That is in truth the straight and upright deen, but most of mankind simply do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(What) you worship besides Him are nothing but names that you and your fathers have assigned, for which no sanction has been sent down by God. Authority belongs to God alone. He commands that you worship none but Him. This is the right way; but most men are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom you serve beside Him are merely idle names that you and your fathers have fabricated, without Allah sending down any sanction for them. All authority to govern rests only with Allah. He has commanded that you serve none but Him. This is the Right Way of life, though most people are altogether unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What you worship instead of God are no more than empty names that you and your fathers have given to certain things. God has not given any authority to such names. Judgment belongs to no one but God. He has commanded you to worship nothing but Him. This is the only true religion, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You do not worship anything besides Him, but which are merely names coined by you and your forefathers – Allah has not sent down any proof regarding them; there is no command but that of Allah; He has commanded that you do not worship anyone except Him; this is the proper religion, but most people do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You do not worship besides Him but only names which you have named (forged) - you and your fathers - for which Allah has sent down no authority. The command is for none but Allah. He has commanded that you worship none but Him; that is the straight religion, but most men know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You do not serve besides Him but names which you have named, you and your fathers; Allah has not sent down any authority for them; judgment is only Allah's; He has commanded that you shall not serve aught but Him; this is the right religion but most people do not know:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which you serve, apart from Him, is nothing but names yourselves have named, you and your fathers; God has sent down no authority touching them. Judgment belongs only to God; He has commanded that you shall not serve any but Him. That is the right religion; but most men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom ye worship beside Him are but names which ye have named, ye and your fathers. Allah hath revealed no sanction for them. The decision rests with Allah only, Who hath commanded you that ye worship none save Him. This is the right religion, but most men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All those you worship instead of Him are mere names you and your forefathers have invented, names for which God has sent down no authority: all power belongs to God alone, and He orders you to worship none but Him: this is the true faith, though most people do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye worship not, beside Him, but names ye have named, ye and your fathers: Allah hath not sent down for them any warranty. Judgment is but Allah's; He hath commanded that ye worship not except Him. That is the right religion, but most of the mankind know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You do not worship besides Him but [mere] names that you and your fathers have coined, for which Allah has not sent down any authority. Sovereignty belongs only to Allah. He has commanded you to worship none except Him. That is the upright religion, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If not Him, ye worship nothing but names which ye have named,- ye and your fathers,- for which Allah hath sent down no authority: the command is for none but Allah: He hath commanded that ye worship none but Him: that is the right religion, but most men understand not...\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You do not worship besides Him but only names which you have named (forged), you and your fathers, for which Allah has sent down no authority. The command (or the judgement) is for none but Allah. He has commanded that you worship none but Him (i.e. His Monotheism), that is the (true) straight religion, but most men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which you worship, other than Him, are nothing but names which you and your fathers have named and for which Allah has sent down no authority. Judgement rests with Allah alone. He has commanded you to worship none except Him. That is the right religion, yet most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You do not worship, besides Him, except names you have named, you and your ancestors, for which God has sent down no authority. Judgment belongs to none but God. He has commanded that you worship none but Him. This is the right religion, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You worship not besides Him except [mere] names you have named them, you and your fathers, for which Allah has sent down no authority. Legislation is not but for Allah. He has commanded that you worship not except Him. That is the correct religion, but most of the people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:40] You do not worship, apart from Him, that is, other than Him, anything but [mere] names that you have named, that you have named for idols, you and your fathers. God has not revealed any warrant, any definitive argument or proof, regarding them, regarding worship of them. Judgement, decree, belongs only to God, alone. He has commanded that you worship none but Him. That, affirmation of [God’s] Oneness, is the upright, the straight, religion, but most people — and these are the disbelievers — do not know, the punishment in which they shall end up, and so they ascribe partners [to God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those whom ye worship beside Him) besides Allah (are but names) lifeless idols (which ye have named, ye and your fathers) you and your fathers called them gods. (Allah hath revealed no sanction) no Scripture or proof (for them) for your worship of them. (The decision) the judgement of commands and prohibitions; it is also said that this means: judgement in the life of this world and in the Hereafter (rests with Allah only, Who hath commanded you) in all revealed Scriptures (that ye worship) that you profess the divine Oneness of (none save Him) save Allah. (This) profession of divine Oneness (is the right religion) the established Religion that He is pleased with: i.e. Islam, (but most men) the people of Egypt (know not) this nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوأعلما أيها الأخوان { مَا تَعْبُدُونَ } أنتما ومن على دينكما في مصر من عبدة الآلهة الباطلة { مِن دُونِهِ } أي: من دون الله الواحد الأحد الصمد\n الذي لا شريك له في الوجود أصلاً { إِلاَّ أَسْمَآءً } مطلقة على الأظلال معدومة\n وعكوساً موهومة { سَمَّيْتُمُوهَآ أَنتُمْ وَآبَآؤُكُمْ } من تلقاء نفوسكم آلهة ومعبودات\n مع أنه { مَّآ أَنزَلَ ٱللَّهُ } المنزل للكتب والمرسل للرسل { بِهَا مِن سُلْطَانٍ } أي: بشأن آلهتكم من حجة وبرهان عقلي ونقلي تى تكون تمسكاً لكم في اتخاذكم هؤلاء التماثيل آلهة مستحقة للعبادة والإطاعة { إِنِ ٱلْحُكْمُ } أي: ما الحكم المطلق والاستحقاق التام للإطاعة والانقياد وعبادة العباد { إِلاَّ للَّهِ } المتردي برداء العظمة والكبرياء\n المتفرد باجللال والبقاء\n المتوحد في البسطة والاستيلاء\n إذ هو المستحق بالعبادة\n المستقبل بالربوبية\n لأنه في ذاته هو ولا شيء ساه\n ولا إله إلا هو مع { أَمَرَ } فيما أنزل من الكتب على أنبيائه ورسله { أَلاَّ تَعْبُدُوۤاْ } ولا ترجعوا أيها الأظلال الهالكة والعكوس الباطلة { إِلاَّ إِيَّاهُ } إذ به وبامتداد أظلال أوصافه وأسمائه ظهرت أشباحكم\n ولاحت تماثيلكم وأرواحكم\n فلا رجوع لكم إلاَّ { ذٰلِكَ } أي: طريق التوحيد\n هو { ٱلدِّينُ ٱلْقَيِّمُ } أي: الأقوم والأعدل\n الذي لا عوج فيه أصلاً { وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ } لكثافة حجتهم وغلظ غيظتهم وأغشيتهم { لاَ يَعْلَمُونَ } [يوسف: 40] ولا يفهمون سر سريان الوحدة في الكثرة\n فحُجبوا بالمظاهر المتكثرة عن الوحدة الظاهرة فانصرفوا عن طريق الحق إلى الباطل\n[النور: 40]\n\n\nثم لما دعاهما إلى الإيمان والتوحيد\n ونبه عليهما طريقه\n اشتغل بتعبير رؤياهما\n فقال منادياً لهما أيضاً: { يٰصَاحِبَيِ ٱلسِّجْنِ أَمَّآ أَحَدُكُمَا } وهو الشرابي { فَيَسْقِي رَبَّهُ } أي: سيده وملكه { خَمْراً } على ما كان عليه بلا احتياج إلى تأويل { وَأَمَّا ٱلآخَرُ } وهو الخبار { فَيُصْلَبُ فَتَأْكُلُ ٱلطَّيْرُ مِن رَّأْسِهِ } هذا ما ظهر لي في تأويل رؤياه بتوفيق الله إياي: وبعدما سمعا منه التأويل قالا: كذبنا فيما قلنا لك واستعبرنا منك\n قال يوسف عليه السلام: { قُضِيَ ٱلأَمْرُ ٱلَّذِي فِيهِ تَسْتَفْتِيَانِ } [يوسف: 41] أي: حكم حكماً مبرماً على الوجه الذي ذكر في حضرة علم الله ولوح قضائه\n لأن الأمر الذي جرى على لسان الأنبياء لا بدَّ أن يقع\n إذ لا جريان للكذب وعدم المطابقة في ألسنة الأنبياء والرسل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما تعبدون } أنتم ومن على دينكم من أهل مصر\n { من دونه إلا أسماء سميتموها أنتم وآباؤكم } أي: ما تعبدون إلا مسميات أسماء من الحجارة\n والخشب\n سميتموها آلهة من غير حجة تدل على استحقاقها للعبادة\n والمعنى: سميتم آلهة ما لا يستحق الألوهية\n ثم عبدتموها\n { ما أنزل اللهُ بها } أي: بعبادتها { من سلطانٍ }: من حجة ولا برهان\n { إن الحُكمُ } في أمر العبادة { إلا لله } لأنه المستحق لها دون غيره\n من حيث أنه الواجب لذاته\n الموجد للكل\n هو المالك لأمره\n { أمَر } على لسان أنبيائه { ألا تعبدوا إلا إياه } ولا تعبدوا معه سواه { ذلك الدين القيم } القويم الذي لا عوج فيه\n { ولكن أكثر الناس لا يعلمون } دلائل توحيده\n فيتخبطون في جهالتهم\n قال البيضاوي: وهذا من التدرج في الدعوة وإلزام الحجة\n بَيّن لهم أولاً: رجحان التوحيد على اتخاذ الآلهة على طريق الخطابة\n ثم برهن على أن ما يُسمونها آلهة\n ويعبدونها لا تستحق الألوهية\n ثم دل على ما هو الحق القويم\n والدين المستقيم\n الذي لا يقتضي العقل غيره\n ولا يرتضي العلم دونه\n هـ\n  الإشارة: كل من لم يجمع قلبه على مولاه\n واتبع حظوظه وهواه\n فله أرباب متفرقون بقدر ما يميل إليه قلبُه من هذا العرض الفاني\n قال ابن عطية: وقد ابتلي بأرباب متفرقين من يخدم أبناء الدنيا\n ويؤملهم\n هـ\n وفي الحديث:\n \" خَابَ مَن رَجَى غير الله وضَلَّ سَعيُه\n وطَابَ وقَتُ مَن وَثَقَ بِاللِّهِ \" \nولله در القائل:\nثم فسر لهما الرؤيا\n فقال: { يٰصَاحِبَيِ ٱلسِّجْنِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:24",
      "similarity": 0.4321520170759017
    },
    {
      "verse": "22:71",
      "similarity": 0.41376358848606903
    },
    {
      "verse": "29:56",
      "similarity": 0.40631709152021267
    },
    {
      "verse": "34:40",
      "similarity": 0.4053020288683339
    },
    {
      "verse": "2:172",
      "similarity": 0.38313888352809733
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:40.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:40.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}