{
  "chapter": "يوسف",
  "text": "قال تزرعون سبع سنين دابا فما حصدتم فذروه فى سنۢبله الا قليلا مما تاكلون",
  "translations": [
    {
      "translation": "He said, 'Sow for seven years in the normal way and leave that which you harvest in the ear except for a small amount from which you eat.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Sow as usual for seven years, and after reaping leave the corn in the ears, except the little you need for food.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said: \"You will cultivate consecutively for seven years. Leave in the ears all that you have harvested except the little out of which you may eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Joseph) said, \"Cultivate your lands for seven years as usual and preserve the produce with its ears each year except the little amount that you will consume.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “You will cultivate for seven years continuously; so leave all that you harvest in the ear, except a little which you eat.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Yusuf] said: \"For seven consecutive years, you shall sow as usual and that which you reap you shall leave it in the ears, (all) except a little of it which you may eat.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: You shall sow for seven years continuously, then what you reap leave it in its ear except a little of which you eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'You shall sow seven years after your wont; what you have harvested leave in the ear, excepting a little whereof you eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Ye shall sow seven years as usual, but that which ye reap, leave it in the ear, all save a little which ye eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said, \"You shall sow for seven consecutive years as usual, but leave in the ear the harvest that you reap, except for a little which you may eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: ye shall sow seven years as is your went; and that which ye reap leave in its ears, except a little whereof ye may eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘You will sow for seven consecutive years. Then leave in the ear whatever [grain] you harvest, except a little that you eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Joseph) said: \"For seven years shall ye diligently sow as is your wont: and the harvests that ye reap, ye shall leave them in the ear,- except a little, of which ye shall eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[(Yusuf (Joseph)] said: \"For seven consecutive years, you shall sow as usual and that (the harvest) which you reap you shall leave in ears, (all) - except a little of it which you may eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'You shall sow for seven years as is your way. Leave in the ear (of corn) you reap, except a little which you eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “You will farm for seven consecutive years. But whatever you harvest, leave it in its spikes, except for the little that you eat.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Joseph] said, \"You will plant for seven years consecutively; and what you harvest leave in its spikes, except a little from which you will eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:47] He said, ‘You shall sow — that is, [go ahead and] sow — seven years consecutively — and this was the interpretation of the seven fat ones — but that which you reap, leave it in the ear, lest it spoil, except for a little which you eat: thresh it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Joseph then instructed them what to do. (He said: Ye shall sow seven years as usual) each year continuously, (but that which ye reap) of crops, (leave it in the ear) and do not thresh it, this is better for its 248 preservation, (all save a little which ye eat) all save the quantity which you need for your sustenance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لئلا يقع فيه السوس { إِلاَّ قَلِيلاً مِّمَّا تَأْكُلُونَ } [يوسف: 47] في تلك المدة\n\n\n{ ثُمَّ يَأْتِي مِن بَعْدِ ذٰلِكَ } أي: بعد انقضاء سني الخصب والرخاء { سَبْعٌ شِدَادٌ } ذوي جدب وعناء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } في تعبيرها: { تزرعون سبعَ سنينَ دأباً } أي: على عادتكم المستمرة من الخصب والرخاء\n { فما حصدتُّم فَذَرُوهُ }: اتركوه { في سُنْبُله } لئلا تأكله السوس، وهي نصيحة خارجة عن عبارة الرؤيا، { إلا قليلاً مما تأكلون } في تلك السنين، أي: لا تدرسوا منه إلا ما تحتاجون إلى أكله خاصة، وذلك أن أرض مصر لا يبقى فيها الطعام عامين\n فعلمهم حيلة يبقى بها السنين المخصبة إلى السنين المجدبة، وهو أن يتركوه في سنبله غير مُدرَس فإن الحبة إذا بقيت في غشائها حُفظت بإذن الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:261",
      "similarity": 0.4164600606933974
    },
    {
      "verse": "11:100",
      "similarity": 0.31938975731061064
    },
    {
      "verse": "3:11",
      "similarity": 0.31303005441768833
    },
    {
      "verse": "40:31",
      "similarity": 0.30795992990788124
    },
    {
      "verse": "50:9",
      "similarity": 0.30652617115671466
    }
  ]
}