{
  "chapter": "يوسف",
  "text": "يوسف ايها الصديق افتنا فى سبع بقرت سمان ياكلهن سبع عجاف وسبع سنۢبلت خضر واخر يابست لعلى ارجع الى الناس لعلهم يعلمون",
  "translations": [
    {
      "translation": "'O truthful Yusuf, tell us of seven fat cows which seven thin ones ate and seven green ears of wheat and seven others which were dry so that I can return to them and let them know.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And coming to the prison) he said: \"O Joseph the truthful, tell us (the meaning of) seven fat cows being devoured by seven lean ones, and seven green ears of corn and seven seared, that I may go back to the people and tell them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he went to Joseph and said to him: \"Joseph, O truthfulness incarnate, tell the true meaning of the dream in which seven fat cows are devoured by seven lean ones; and there are seven green ears of corn and seven others dry and withered so that I may return to the people and they may learn.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He went to the prison) and said to Joseph, \"You are a man of truth. Would you tell me the meaning of a dream in which seven fat cows eat up seven lean ones and the meaning of seven green ears of corn and seven dry ones? I hope you can tell me the right meaning and save people from confusion.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O Yusuf! O truthful one! Explain for us the seven healthy cows which seven lean cows were eating and the seven green ears of corn and seven others dry, so I may return to the people, possibly they may come to know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He said): \"O Yusuf, the man of truth! Explain to us seven fat cows whom seven lean ones were devouring, and seven green ears of corn, and (seven) others dry, that I may return to the people, and that they may know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yusuf! O truthful one! explain to us seven fat kine which seven lean ones devoured, and seven green ears and (seven) others dry, that I may go back to the people so that they may know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph, thou true man, pronounce to us regarding seven fat kine, that seven lean ones were devouring, seven green ears of corn, and seven withered; haply I shall return to the men, haply they will know.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And when he came to Joseph in the prison, he exclaimed): Joseph! O thou truthful one! Expound for us the seven fat kine which seven lean were eating and the seven green ears of corn and other (seven) dry, that I may return unto the people, so that they may know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O truthful Joseph!\" he said, \"Tell us the meaning of a dream in which seven fat cows are being eaten by seven lean ones, and there are seven green ears of corn and seven others which are dry, so that I may return to my people and inform them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yusuf, O saint! give an answer unto us in regard to seven fat kine which seven lean ones are devouring and seven green corn-ears and seven others dry; haply may return unto the people; haply they may learn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Joseph,’ [he said], ‘O truthful one, give us your opinion concerning seven fat cows who are eaten by seven lean ones, and seven green ears and [seven] others dry, that I may return to the people so that they may know [the truth of the matter].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Joseph!\" (he said) \"O man of truth! Expound to us (the dream) of seven fat kine whom seven lean ones devour, and of seven green ears of corn and (seven) others withered: that I may return to the people, and that they may understand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He said): \"O Yusuf (Joseph), the man of truth! Explain to us (the dream) of seven fat cows whom seven lean ones were devouring, and of seven green ears of corn, and (seven) others dry, that I may return to the people, and that they may know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He said:) 'Joseph, the truthful, tell us of the seven fatted cows that were devoured by seven lean ones also of the seven green ears of corn and the other seven which were withered, so that I can go back to the people and then they will then know'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Joseph, O man of truth, inform us concerning seven fat cows being eaten by seven lean ones, and seven green spikes, and others dried up, so that I may return to the people, so that they may know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He said], \"Joseph, O man of truth, explain to us about seven fat cows eaten by seven [that were] lean, and seven green spikes [of grain] and others [that were] dry - that I may return to the people; perhaps they will know [about you].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:46] ‘O, Joseph, O truthful one, one given to truth, give us your opinion concerning seven fat kine that are devoured by seven lean ones, and [concerning] seven green ears of corn and [seven] others dry, that I may return to the people, that is, to the king and his courtiers, so that they might know’, its interpretation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When he went to him, he said: (Joseph! thou truthful one!) you who were truthful in interpreting the first dream, (Expound for us the seven fat kine) that came out of the river and (which seven lean) that were dying of lack of nourishment (were eating and the seven green ears of corn and other (seven) dry) coiling around the seven green ears, overshadowing their greenery, (that I may return unto the people) to the king, (so that they may know) the interpretation of the king's dream. Joseph said: \"Yes! I will interpret his dream. The seven fat kine are seven years of soil fertility, and the seven green ears represent abundance and low prices during these seven years. The seven dying, lean kine represent years of drought while the seven dry ears represent lack of foodstuff and high prices during these years\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  فقال: { يوسفُ } أي: يا يوسف، { أيها الصّدّيق }: المبالغ في الصدق\n وإنما وصفه بالصِّدِّيقية لما جرب من أحواله، وما رأى من مناقبه، مع ما سمع من تعبير رؤياه ورؤيا صاحبه، { افْتِنَا في سبع بقرات سمان يأكلهن سبع عجاف وسبع سنبلات خضر وأخر يابسات } أي: أفتني في رؤيا ذلك واعبرها لي، { لعلي أرجعُ إلى الناس } أي: أعودُ إلى الملك ومن عنده، أو إلى أهل البلد إذ قيل: إن السجن كان خارجاً البلد\n\n\n{ لعلهم يعلمون } تأويلها\n أو يعلمون فضلك ومكانتك\n وإنما لم يجزم بعلمهم لأنه ربما اختُرِم دونه، أو لعلهم لا يفهمون ما يقول لهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:43",
      "similarity": 0.935914481671969
    },
    {
      "verse": "2:261",
      "similarity": 0.25956425886420015
    },
    {
      "verse": "12:47",
      "similarity": 0.24396347558856532
    },
    {
      "verse": "88:7",
      "similarity": 0.23450899981945086
    },
    {
      "verse": "51:26",
      "similarity": 0.21973012978834836
    }
  ]
}