{
  "chapter": "يوسف",
  "text": "وقال الذى نجا منهما وادكر بعد امة انا۠ انبئكم بتاويله فارسلون",
  "translations": [
    {
      "translation": "The one of them who had been saved then said, remembering after a period, 'I will tell you what it signifies, so send me out.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the servant, who of the two had been released, remembering (Joseph), said: \"I will give you its interpretation; let me go for it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then of the two prisoners, the one who had been set free, now remembered, after the lapse of a long period, what Joseph had said. He said: \"I will tell you the interpretation of this dream; just send me (to Joseph in prison).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The man who was in prison with Joseph and who was released, recalled after so many years Joseph's (ability to interpret dreams) and said, \"I can tell you the meaning of this dream if you allow me to go (to the prison and ask the man who knows the meanings of dreams).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the two the one who was released said – and after a long time he had remembered – “I will tell you its interpretation, therefore send me forth.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the man who was released, now at length remembered and said: \"I will tell you its interpretation, so send me forth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the two (prisoners) he who had found deliverance and remembered after a long time said: I will inform you of its interpretation, so let me go:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then said the one who had been delivered, remembering after a time, 'I will myself tell you its interpretation; so send me forth.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he of the two who was released, and (now) at length remembered, said: I am going to announce unto you the interpretation, therefore send me forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then one of the two men who had been released and who, after a long time, remembered, said, \"I shall tell you its interpretation; therefore, give me leave to go [to Joseph in prison].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the one of the twain, who was saved, and now recollected himself after a period, said: I, even I, shall declare unto you the interpretation thereof; so send me forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the one of the two who had been delivered, remembering [Joseph] after a long time: ‘I will inform you of its interpretation; so let me go [to meet Joseph in the prison].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the man who had been released, one of the two (who had been in prison) and who now bethought him after (so long) a space of time, said: \"I will tell you the truth of its interpretation: send ye me (therefore).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the man who was released (one of the two who were in prison), now at length remembered and said: \"I will tell you its interpretation, so send me forth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After all that time, the one of the two who had been saved remembered, he said: 'I will interpret it for you, so let me go'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The one who was released said, having remembered after a time, “I will inform you of its interpretation, so send me out.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the one who was freed and remembered after a time said, \"I will inform you of its interpretation, so send me forth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:45] And he of the two who was released, that is, of the two young men, namely, the cup-bearer, remembering (iddakara: the original tā’ [of tadhakkara] has been changed to a dāl and assimilated with the dhāl), after a time, [after] a period of time, the predicament of Joseph, said, ‘I will inform you of its interpretation; so send me forth’, so they sent him forth and he came to Joseph, and said:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he of the two who was released) from prison, i.e. the cupbearer, (and (now) at length) after seven years (remembered) remembered Joseph, (said: I am going to announce unto you the interpretation) he said to the king: I will inform you of the interpretation of your dream, (therefore send me forth) to prison for there is a man there who knows the interpretation of dreams. And he described Joseph's knowledge, clemency and goodness towards the prisoners and his expertise in interpreting dreams. And so he was sent.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَعْدَ أُمَّةٍ } معناه بَعدَ نِسيانٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"After a nation [has passed]\": its meaning is after oblivion.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما عجز الملأ عن تعبير رؤيا الملك\n واجتمعوا على أنها أضغاث أحلام { قَالَ ٱلَّذِي نَجَا مِنْهُمَا } أي: من صاحبي السجن\n وهو الشرابي الموصى له بالذكر فنسي { وَٱدَّكَرَ } بهذا التقريب ما أوصى أنه يوسف { بَعْدَ أُمَّةٍ } أي: بعد مديدة { أَنَاْ أُنَبِّئُكُمْ بِتَأْوِيلِهِ فَأَرْسِلُونِ } [يوسف: 45] فأرسله الملك ودخل عليه\n فقال: يا { يُوسُفُ أَيُّهَا ٱلصِّدِّيقُ } الصدوق في تأويل الرؤيا { أَفْتِنَا } وعبر لنا { فِي سَبْعِ بَقَرَاتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَسَبْعِ سُنبُلاَتٍ خُضْرٍ } ملتفتةً إلى سبعٍ أخر { وَأُخَرَ يَابِسَاتٍ } عبر لي هذه الرؤيا { لَّعَلِّيۤ أَرْجِعُ } بتأويلها { إِلَى ٱلنَّاسِ } الذين عجزوا عن تعبيره وصيروه من الأباطيل والتخليطات الساقطة عن درجة التغيير والتأويل { لَعَلَّهُمْ يَعْلَمُونَ } [يوسف: 46] تأويله ويفحمون عما يقولون\n إذ الرؤيا للملك\n وهم جعلوها من قبيل الأضغاث\n وأنت إذا عيرتها أرجو أن تتخلص من هذا السجن\n\n\n{ قَالَ } يوسف مؤولاً للرؤيا مدبراً فيه طريق المعاش\n لئلا يضطروا في تدبيره: { تَزْرَعُونَ سَبْعُ سِنِينَ دَأَباً } على ما هو دأبكم وعادتككم { فَمَا حَصَدتُّمْ فَذَرُوهُ } واتركوه { فِي سُنبُلِهِ } أي: فعليكم أن تدخروا ما حصدتم في سني الخصب بأن تتركوه في سنبله ولا تفرقوه منه ولا يدوسوه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وادَّكرَ بعد أُمة } أي: وتذكر بعد جماعة من السنين\n وهي سبع سنين\n { أنا أُنبئكم بتأويله فأرسلون } إلى من عنده علمها\n أو إلى السجن\n رُوي أنه لما سمع مقالة الملك بكى\n فقال الملك: ما لك تبكي؟ قال: أيها الملك إن رؤياك هذه لا يعبرها إلا الغلام العبراني الذي في السجن\n فتغير وجه الملك\n وقال: إني نسيته\n وما ذكرته منذ سبع سنين\n ما خطر لي ببال\n فقال الساقي: وأنا مثلك\n فقال لهم الملك: وما يدريك أنه يعبر الرؤيا؟ فحدثه بأمره\n وأمر الساقي فقال له: امض إليه وسله\n فقال: إني والله أستحي منه لأنه أوصاني ونسيت\n فقال له: لا تستح منه لأنه يرى الخير والشر من مولاه فلا يلومك\n فأتاه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:103",
      "similarity": 0.403665542730657
    },
    {
      "verse": "27:53",
      "similarity": 0.3979431071345793
    },
    {
      "verse": "41:18",
      "similarity": 0.3979431071345793
    },
    {
      "verse": "10:86",
      "similarity": 0.39603258432343735
    },
    {
      "verse": "15:59",
      "similarity": 0.3599083745213386
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/12:45.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/12:45.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}