{
  "chapter": "يوسف",
  "text": "قال ما خطبكن اذ رودتن يوسف عن نفسه قلن حش لله ما علمنا عليه من سوء قالت امرات العزيز الـن حصحص الحق انا۠ رودته عن نفسه وانه لمن الصدقين",
  "translations": [
    {
      "translation": "He said, 'What was this past affair of yours when you solicited Yusuf?' Then they said 'Allah forbid! We know no bad of him.' The governor's wife then said, 'The truth has now emerged. Indeed I tried to seduce him then and he has simply told the honest truth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king asked the women: \"What was the affair of seducing Joseph?\" \"God preserve us,\" they said; \"we know no evil against him.\" The wife of the minister said: \"The truth has now come out. It was I who desired to seduce him, but he is indeed a man of virtue.\" --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon the king asked the women: \"What happened when you sought to tempt Joseph?\" They said: \"Allah forbid! We found no evil in him.\" The chief's wife said: \"Now the truth has come to light. It was I who sought to tempt him. He is indeed truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The King asked the women about their attempt to seduce Joseph. They replied, \"God forbid! We do not know of any bad in Joseph.\" The wife of the King said, \"Now the truth has come to light. It was I who tried to seduce Joseph. He is, certainly, a truthful man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, “O women! What was your role when you tried to entice Yusuf?” They answered, “Purity is to Allah – we did not find any immorality in him”; said the wife of the governor, “Now the truth is out; it was I who tried to entice him, and indeed he is truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The king) said (to the women): \"What was your affair when you did seek to seduce Yusuf\" The women said: \"Allah forbid! No evil know we against him!\" The wife of the `Aziz said: \"Now the truth is manifest (to all); it was I who sought to seduce him, and he is surely of the truthful. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: How was your affair when you sought Yusuf to yield himself (to you)? They said: Remote is Allah (from imperfection), we knew of no evil on his part. The chief's wife said: Now has the truth become established: I sought him to yield himself (to me), and he is most surely of the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What was your business, women,' he said, 'when you solicited Joseph?' 'God save us!' they said. 'We know no evil against him.' The Governor's wife said, 'Now the truth is at last discovered; I solicited him; he is a truthful man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (the king) (then sent for those women and) said: What happened when ye asked an evil act of Joseph? They answered: Allah Blameless! We know no evil of him. Said the wife of the ruler: Now the truth is out. I asked of him an evil act, and he is surely of the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king asked the women, \"What was the truth of the affair in which you tried to seduce Joseph?\" The women said, \"God forbid! We know no evil of him.\" The wife of the nobleman said, \"The truth has now come to light. It was I who tried to seduce him; he is surely an honest man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: What was the matter with you when ye solicited Yusuf against himself! They said: how perfect is God! we knew not of any evil against him. The wife of the Aziz said: how hath the truth come to light, even I, solicited him against himself, and verily he is of the truth-tellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, ‘What was your business, women, when you solicited Joseph?’ They said, ‘Heaven be praised! We know of no evil in him.’ The prince’s wife said, ‘Now the truth has come to light! It was I who solicited him, and he is indeed telling the truth.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The king) said (to the ladies): \"What was your affair when ye did seek to seduce Joseph from his (true) self?\" The ladies said: \"Allah preserve us! no evil know we against him!\" Said the 'Aziz's wife: \"Now is the truth manifest (to all): it was I who sought to seduce him from his (true) self: He is indeed of those who are (ever) true (and virtuous).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The King) said (to the women): \"What was your affair when you did seek to seduce Yusuf (Joseph)?\" The women said: \"Allah forbid! No evil know we against him!\" The wife of Al-'Aziz said: \"Now the truth is manifest (to all), it was I who sought to seduce him, and he is surely of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What was your business, women' he asked, 'when you solicited Joseph' 'Allah save us' they replied. 'We know no evil against him' The Governor's wife said: 'The truth has been discovered at last; I solicited him; he is among the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “What was the matter with you, women, when you tried to seduce Joseph?” They said, “God forbid! We knew of no evil committed by him.” The governor’s wife then said, “Now the truth is out. It was I who tried to seduce him, and he is telling the truth.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said [the king to the women], \"What was your condition when you sought to seduce Joseph?\" They said, \"Perfect is Allah! We know about him no evil.\" The wife of al-'Azeez said, \"Now the truth has become evident. It was I who sought to seduce him, and indeed, he is of the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:51] He said, ‘What was your business, women, when you solicited Joseph?’, did you find on his part any inclination towards you?: ‘God preserve us!’ they said. ‘We know of no evil in him.’ The Court Officer’s wife said, ‘Now the truth is out, [now] it has become clear; it was I who attempted to seduce him and he is indeed of the truthful’, in his saying, It was she who attempted to seduce me [Q. 12:26]. Joseph was then informed of this and he said:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة { قال ما خطبكن } مستأنفة استئنافاً بيانياً لأن الجمل التي سبقتها تثير سؤالاً في نفس السامع عما حصل من المَلِك لَمّا أُبلغ إليه اقتراح يوسف عليه السّلام مع شدة تشوقه إلى حضوره بين يديه ، أي قال الملك للنسوة .ووقوع هذا بعد جملة { ارجع إلى ربك } \\[ سورة يوسف : 50 \\] إلى آخرها مؤذن بكلام محذوف ، تقديره : فرجع فأخبر الملك فأحضر الملكُ النسوة اللائي كانت جمعتْهن امرأةُ العزيز لمّا أعتدت لهنّ مُتّكَأ فقال لهن : ما خطبكن } إلى آخره .واسندت المراودة إلى ضمير النسوة لوقوعها من بعضهن غير معين ، أو لأن القالة التي شاعت في المدينة كانت مخلوطة ظَنا أن المراودة وقعت في مجلس المتّكأ .والخطب : الشأن المهم من حالة أو حادثة . قيل : سمي خطباً لأنه يقتضي أن يخاطِب المرء صاحبه بالتساؤل عنه . وقيل : هو مأخوذ من الخُطبة ، أي يُخطب فيه ، وإنما تكون الخطبة في أمر عظيم ، فأصله مصدر بمعنى المفعول ، أي مخطوب فيه .وجملة { قلن } مفصولة لأجل كونها حكاية جواب عن كلام الملك أي قالت النسوة عدا امرأة العزيز ، بقرينة قوله بعد : { قالت امرأة العزيز }.و { حاش لله } مبالغة في النفي والتنزيه . والمقصود : التبرؤ مما نسب إليهن من المراودة . وقد تقدم تفسيرها آنفاً واختلاف القراء فيها .وجملة { ما علمنا عليه من سوء } مبينة لإجمال النفي الذي في { حاش لله }. وهي جامعة لنفي مراودتهن إياه ومراودته إياهن لأن الحالتين من أحوال السوء .ونفي علمهن ذلك كناية عن نفي دعوتهن إياه إلى السوء ونفي دعوته إياهن إليه لأن ذلك لو وقع لكان معلوماً عندهن ، ثم إنهن لم يزدن في الشهادة على ما يتعلق بسؤال الملك فلم يتعرضن لإقرار امرأة العزيز في مجلسهن بأنها راودته عن نفسه فاستعصم ، خشيةً منها ، أو مودّةً لها ، فاقتصرن على جواب ما سُئلن عنه .وهذا يدل على كلام محذوف وهو أن امرأة العزيز كانت من جملة النسوة اللاتي أحضرهن الملك . ولم يشملها قول يوسف عليه السّلام : { ما بال النسوة اللاتي قطعن أيديهن } \\[ سورة يوسف : 5 \\] لأنها لم تقطّعْ يدها معهن ، ولكن شملها كلام الملك إذ قال : إذ راودتن يوسف عن نفسه } فإن المراودة إنما وقعت من امرأة العزيز دون النسوة اللاتي أعدّت لهن متكئاً ، ففي الكلام إيجاز حذف .وجملة { قالت امرأة العزيز } مفصولة لأنها حكاية جواب عن سؤال الملك .والآن : ظرف للزمان الحاضر ، وقد تقدم عند قوله تعالى : { الآن خفف الله عنكم } في سورة الأنفال ( 66 ).و { حصحص } : ثبت واستقر .و { الحق } : هو براءة يوسف عليه السّلام مما رمته به امرأة العزيز ، وإنما ثبت حينئذٍ لأنه كان محل قيل وقال وشك ، فزال ذلك باعترافها بما وقع .والتعبير بالماضي مع أنه لم يثبت إلا من إقرارها الذي لم يسبق لأنه قريب الوقوع فهو لتقريب زمن الحال من المضي .ويجوز أن يكون المراد ثبوت الحق بقول النسوة { ما علمنا عليه من سوء } فيكون الماضي على حقيقته . وتقديم اسم الزمان للدلالة على الاختصاص ، أي الآن لا قبله للدلالة على أن ما قبل ذلك الزمان كان زمنَ باطل وهو زمن تهمة يوسف عليه السّلام بالمراودة ، فالقصر قصر تعيين إذ كان الملك لا يدري أي الوقتين وقتُ الصدق أهو وقت اعتراف النسوة بنزاهة يوسف عليه السّلام أم هو وقت رمي امرأة العزيز إياه بالمراودة .وتقديم المسند إليه على المسند الفعلي في جملة { أنا راودته } للقصر ، لإبطال أن يكون النسوة راودنه . فهذا إقرار منها على نفسها ، وشهادة لغيرها بالبراءة ، وزادت فأكدت صدقه ب ( إن ) واللام .وصيغة { من الصادقين } كما تقدم في نظائرها ، منها قوله تعالى : { قل لا أتبع أهواءكم قد ضللت إذاً وما أنا من المهتدين } في سورة الأنعام ( 56 ).\n\n",
      "translations": [
        {
          "translation": "The messenger went back and informed the king who summoned the four women: the wife of his cupbearer, the wife of his chief cook, the wife of the master of his stable and the wife of the Chief Official. These four women were the most powerful personalities after the king. (He (the king) (then sent for those women and) said: What happened when ye asked an evil act of Joseph? They answered: Allah Blameless!) God forbid! (We know) we saw (no evil of him. Said the wife of the ruler: Now the Truth is out) in favour of Joseph; it is also said that this means: now is the time to tell the truth. (I asked of him an evil act) I offered myself to him, (and he is surely of the Truthful) that he did not ask an evil act of me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلآنَ حَصْحَصَ ٱلْحَقُّ } معناهُ السَّاعةُ وَضَحَ الحَقُّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Now has the truth been manifested,\" means that the Hour has come and the truth has become clear.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وقول نسوة القوى { حاش لله ما علمنا عليه من سوء }\n وقول امرأة العزيز: { الآن حصحص الحق } إشارة إلى تنوّر النفس والقوى بنور الحق واتصافها بصفة الإنصاف والصدق وحصول ملكة العدالة بنور الوحدة وظهور المحبة حال الفرق بعد الجمع وكمال طمأنينة النفس لإقرارها بفضيلة القلب وصدقه وذنبها وبراءته فإنّ من كمال اطمئنان النفس اعترافها بالذنب واستغفارها عما فرط منها حالة كونها أمارة وتمسكها بالرحمة الإلهية والعصمة الربانية واستخلاص الملك إياه لنفسه استخلافه للقلب على الملك بعد الكمال التامّ\n كما جاء في القصة: أجلسه على سريره وتوّجه بتاجه وختمه بخاتمه وقلّده بسيفه وعزل قطفير ثم توفى قطفير وزوّجه الملك امرأته زليخا واعتزل عن المُلْك وجعله في يده و تخلّى بعبادة ربه\n كل ذلك إشارة إلى مقام خلافة الحق كما قال لداود:\n[ص\n الآية: 26]\n وتوفي العزيز إشارة إلى وصول القلب إلى مقامه وذهاب الروح في شهوده للوحدة\n وتزوّجه بامرأة العزيز إشارة إلى تمتيع القلب النفس بعد الاطمئنان بالحظوظ فإن النفس الشريفة المتنوّرة تقوى بالحظوظ على محافظة شرائط الاستقامة وتقنين قوانين العدالة واستنباط أصول العلم والعمل وهما الولدان اللذان جاءا في القصة أنها ولدتهما منه افراثيم وميشا\n وروي أنه لما دخل عليها قال لها: أليس هذا خيراً مما طلبت؟ فوجدها عذراء وهو إشارة إلى حسن حالها في الاطمئنان مع التمتيع ومراعاة العدالة\n وكونها عذراء إشارة إلى أنّ الروح لا يخالط النفس لتقدّسه دائماً وامتناع مباشرته إياها\n فإن مطالبه كلية لا تدرك جزئياتها بخلاف القلب وإنما كانت امرأته لتسلطه عليها ووصول أثر أمره وسلطانه إليها بواسطة القلب ومحكوميتها له في الحقيقة وسؤال التولية على خزائن الأرض ووصف نفسه بالحفظ والعلم هو أن القلب يدرك الجزئيات المادية ويحفظها دون الروح فيقتضي باستعداده قبول ذلك المعنى من الواهب الذي هو ملك روح القدس وتمكينه في الأرض يتبوّأ منها حيث يشاء استخلافه بالبقاء بعد الفناء عند الوصول إلى مقام التمكين وهو أجر المحسن أي العابد لربّه في مقام الشهود لرجوعه إلى التفصيل من عين الجمع { ولأجر الآخرة } أي: الحظ المعنوي بلذّة شهود الجمال ومطالعة أنوار سبحات الوجه الباقي { خيرٌ للذين آمنُوا } الإيمان العيني { وكانوا يتقون } بقية الأنائية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مفتشاً عما جرى بينهن وبين يوسف: { مَا خَطْبُكُنَّ } وشأنكن أيتها الماكرات المحتالات { إِذْ رَاوَدتُّنَّ } وخادعتن بأنواع الحيلة والخداع { يُوسُفَ عَن نَّفْسِهِ } وأي شيء ظهر منه من أمارات الفساد وعلامات الفسوق حتى تجترئن بمراودته؟! { قُلْنَ } بأجمعهن بعدما سمعن كلام الملك واستفساره على وجه الانتقام: { حَاشَ لِلَّهِ مَا عَلِمْنَا عَلَيْهِ مِن سُوۤءٍ } أي: فعلة ذميمة وديدنة قبيحة باعثة لنا إلى مراودته\n سوى أنا رأيناه على صورة عجيبة وحسن بديع\n مِلْنا إلأيه وأردنا مخالطته فاستعصم من كمال عفته ونجابة طينته\n ثم { قَالَتِ ٱمْرَأَتُ ٱلْعَزِيزِ } عند الملك بعدما بدأ ما أخفت وفشا ما سترت\n مقرة مقررة لطهارة ذيله: { ٱلآنَ حَصْحَصَ } أي: لاح وظهر { ٱلْحَقُّ } وارتفع عنه الحجب انكشف الأستار { أَنَاْ رَاوَدْتُّهُ عَن نَّفْسِهِ } بعدما شغفني حبه وأزعجني ميله { وَإِنَّهُ } في ذاته وأقواله وأفعاله { لَمِنَ ٱلصَّادِقِينَ } [يوسف: 51] المبرين المنزهين عما افترينا عليه ورمينا به\n\n\nثم لما انشكف أمره عند الملك وثبت براءته\n أرسل الرسول إليه ثانياً ليخرجه من السجن\n قال يوسف على مقتضى الحكمة الصادرة من ألسنة الأنبياء\n توطيناً لنفس ال عزيز تسلية له\n ليجزم أنه ما أساء الأدب معه في السر والعلانية { ذٰلِكَ } الكشف والتفتيش إنما هو { لِيَعْلَمَ } العزيز يقيناً { أَنِّي لَمْ أَخُنْهُ بِٱلْغَيْبِ } حين انغلاق الأبواب السبعة\n وأنا مع زوجته فكيف في غيرها { وَ } ليعلم العزيز أيضاً { أَنَّ ٱللَّهَ } المطبع لجميع ما جرى على عباده { لاَ يَهْدِي كَيْدَ ٱلْخَائِنِينَ } [يوسف: 52] أي: لا يوصل أهل الخيانة إلى ما يقصدون إليه بكيدهم وحيلتهم\n بل يفضحونهم بها على رءوس الأشهاد في الأولى والأخرى\n\n\nثم قال: { وَمَآ أُبَرِّىءُ } وأنزه { نَفْسِيۤ } عن الفرطات والغفلات والخواطر القبيحة والديدنة الشنيعة على مقتضى القوى الشهوية واللذة البهيمية\n وكيف ابرئ وأنزه { إِنَّ ٱلنَّفْسَ } المركوزة في الجبلة الإنسانية { لأَمَّارَةٌ } مائلة بالطبع { بِٱلسُّوۤءِ } والفساد متوجهة نحوه إذا خلى وطبعها { إِلاَّ مَا رَحِمَ رَبِّيۤ } أي: حفظها الله من كمال رحمته وشفقته من طغيانها ووسوسة الشيطان إليها { إِنَّ رَبِّي } الذي رباني بالعصمة والعفاف { غَفُورٌ } لما صدر عني من الخواطر النفسانية { رَّحِيمٌ } [يوسف: 53] يرحمني بفضله ويعصمني بلطفه عما يبعدني من كنفه وجواره",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { قال } لهن: { ما خطبكُنَّ } ما شأنكن { إذ راودتُنَّ } أي: حين راودتن { يوسفَ عن نفسه } \n وأسند المراودة إلى جميعهن لأن المَلِك لم يتحقق أن امرأة العزيز هي التي راودته وحدها\n { قلنَ حاشَ لله } تنزيهاً لله أن يعجز عن خلق عفيف مثله\n أو تنزيهاً ليوسف أن يعصيه لأجل خوف الله\n وهذا تبرئة ليوسف ولهن\n أو لهن فقط\n وتكون تبرئة يوسف في قولهن: { ما علمنا عليه من سُوءٍ }: من ذنب\n { قالت امرأةُ العزيز الآن حَصْحَصَ الحق }: أي: تبين ووضح\n أو ثبت واستقر\n { أنا راودته عن نفسه وإنه لمن الصادقين } في قوله: { راودتني عن نفسي } فلما رجع إليه الرسول\n وذكر ما قالته النسوة\n وما أقرت به امرأة العزيز\n قال: { ذلك ليعلم أني لم أخُنْهُ بالغيب } أي: فعلت ذلك التثبت والتأني في الخروج ليعلم العزيز أني لم أخنه في زوجته { بالغيب } في حال غيبته\n أو بظهر الغيب وراء الأستار والأبواب المغلقة\n بل تعففت عنها\n { وأن الله لا يهدي كيدَ الخائنين } أي: لا ينفذه ولا يسدده\n أو لا يهدي الخائنين ليكدهم\n وأوقع الفعل على الكيد مبالغةً\n وفيه تعريض بامرأة العزيز في خيانتها زوجها\n وتوكيد لأمانته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:31",
      "similarity": 0.3775897666840982
    },
    {
      "verse": "10:91",
      "similarity": 0.1251808313593479
    },
    {
      "verse": "4:18",
      "similarity": 0.12497888319475992
    },
    {
      "verse": "10:51",
      "similarity": 0.12410346603936466
    },
    {
      "verse": "8:66",
      "similarity": 0.113692469268897
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}