{
  "chapter": "يوسف",
  "text": "ولما جهزهم بجهازهم قال ائتونى باخ لكم من ابيكم الا ترون انى اوفى الكيل وانا۠ خير المنزلين",
  "translations": [
    {
      "translation": "Then, having supplied their needs, he said to them, 'Bring me your brother, your father's youngest son. Do you not see that I dispense full measure and am the most hospitable of hosts?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had supplied their provisions, he said to them: \"Bring your (half) brother with you. Have you not seen that I have given full measure, and that I am the best of hosts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had prepared for them their provisions, Joseph said: \"Bring to me your other brother from your father. Do you not see that I give full measure and am most hospitable?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had furnished them with provisions, he said, \"Next time, bring me your other brother from your father. As you can see, I give each of you a certain amount of grain; I am a polite host.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he provided them with their provisions he said, “Bring your step-brother to me; do you not see that I measure in full and that I am the best host?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he furnished them with their provisions, he said: \"Bring me a brother of yours from your father. See you not that I give full measure, and that I am the best of the hosts\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he furnished them with their provision, he said: Bring to me a brother of yours from your father; do you not see that I give full measure and that I am the best of hosts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had equipped them with their equipment be said, 'Bring me a certain brother of yours from your father. Do you not see that I fill up the measure, and am the best of hosts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he provided them with their provision he said: Bring unto me a brother of yours from your father. See ye not that I fill up the measure and I am the best of hosts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had made provision for them, he told them, \"Bring me your brother on your father's side. Do you not see that I give you full measure and that I am the best of hosts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had furnished them with their furnishing, he said: bring unto me a brother of your from your father behold ye not that I give full measure and that am the best of entertainers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had furnished them with their provision, he said, ‘Bring me a brother that you have through your father. Do you not see that I give the full measure and that I am the best of hosts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had furnished them forth with provisions (suitable) for them, he said: \"Bring unto me a brother ye have, of the same father as yourselves, (but a different mother): see ye not that I pay out full measure, and that I do provide the best hospitality?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had furnished them forth with provisions (according to their need), he said: \"Bring me a brother of yours from your father; (he meant Benjamin). See you not that I give full measure, and that I am the best of the hosts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had given them their provisions, he said: 'Bring me a certain brother from your father. Do you not see that I give just measure and am the bestof hosts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he provided them with their provisions, he said, “Bring me a brother of yours from your father. Do you not see that I fill up the measure, and I am the best of hosts?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had furnished them with their supplies, he said, \"Bring me a brother of yours from your father. Do not you see that I give full measure and that I am the best of accommodators?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:59] And when he had equipped them with their provision, [when] he had given them the full measure [of food], he said, ‘Bring me a brother of yours from your father, namely, Benjamin, that I might know that you have been truthful in what you said. Do you not see that I give the full measure, that I complete it, without any fraud, and that I am the best of hosts?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he provided them with their provision) when he measured for them the measure they were entitled to have (he said: Bring unto me a brother of yours from your father) for you said that you had a half brother, from your father's side, who stayed behind with your father. (See you not that I fill up the measure) it is said that he means: I fill up the measure with my own hands (and I am the best of hosts?)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلاَ تَرَوْنَ أَنِّيۤ أُوفِي ٱلْكَيْلَ وَأَنَاْ خَيْرُ ٱلْمُنْزِلِينَ } معناه أَنا خَيرُ من أُضيّفُ بمصر\n\n",
      "translations": [
        {
          "translation": "\n\nDo you not see that I am the one who provides for Egypt and that I am the best of those who dwell there?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا جَهَّزَهُم } الخدام بإذن العزيز { بِجَهَازِهِمْ } وهيأوا أرحالهم فأرادوا أن يشدوا\n دخلوا على العزيز للتوديع { قَالَ } لهم العزيز: { ٱئْتُونِي بِأَخٍ لَّكُمْ مِّنْ أَبِيكُمْ } ليدل على صدقكم ونجابة أصلكم { أَلاَ تَرَوْنَ أَنِّيۤ أُوفِي ٱلْكَيْلَ } وأتمه لكم { وَأَنَاْ خَيْرُ ٱلْمُنْزِلِينَ } [يوسف: 59] أحسن ضيافتكم مثل ما أحسنت\n\n\n{ فَإِن لَّمْ تَأْتُونِي بِهِ } أي: بأخيكم بنيامين { فَلاَ كَيْلَ لَكُمْ عِندِي } أي: فاعلموا ألاَّ كيل لكم عندي بعد اليوم { وَلاَ تَقْرَبُونِ } [يوسف: 60] ولا تدخلوا داري\n إذ أنتم حنيئذٍ قوم كاذبون\n\n\nوبعدما سمعوا منه كلاماً موحشاً\n وتفرسوا أنهم لو لم يأتوا بأخيهم لما اكتال لهم العزيز ولم ينزلهم\n فكيف أن يحسن معهم ويضيفهم؟ { قَالُواْ } له معتذرين: إن له أباّ شيخاً كبيراً\n محزوناً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهذا معنى قوله: { ولما جَهَّزَهُم بجَهَازهم } أعطاهم ما اشتروا منه الطعام\n وأوقر ركابهم { قال ائتوني بأخ لكم من أبيكم } وهو: بنيامين ـ بكسر الباء ـ على وزن إسرائيل\n قاله في القاموس\n وقيل: كان يوسف عليه السلام يعطي لكل نفس حملاً\n ولا يزيد عليه\n فسألوه حِملاً زائداً لأخيهم من أبيهم فأعطاهم\n وشرط عليهم أن يأتوا به ليعلم صدقهم\n ثم قال لهم: { ألا ترَوْنَ أني أُوفي الكيلَ وأنا خيرُ المنزِلين } للأضيافِ\n قال لهم ذلك ترغيباً في رجوعهم\n وقد كان أحسن ضيافتهم غاية الإحسان\n  رُوي أنه عليه السلام نادى صاحب المائدة\n وقال له: لا تنزل هؤلاء بدار الغرباء\n ولا بدار الأضياف\n ولكن أدخلهم داري\n وانصب لهم مائدة كما تنصبها لي\n واحفظهم وأكرمهم\n فسأله عنهم\n فلم يجب\n فبسط لهم الفرش والوسائد\n فلما جن الليل أمر أن توضع بين أيديهم الموائد\n والشماع\n والمجامر\n وهم ينظرون من كوة إلى دار الأضياف\n وقد بلغ بهم الجهد\n فكانوا يعطونهم قرصة شعير لكل أحد من الغرباء\n وهم يرون ما بين أيديهم من الإكرام والطعام\n وقد بلغ الحمل من الطعام ألفاً ومائتي دينار\n فقال بعضهم لبعض: إن هذا المَلك أكرمنا بكرامة ما أكرم بها أحداً من الغرباء! فقال شمعون: لعل الملك سمع بذكر آبائنا فأكرمنا لأجلهم\n وقال آخر: لعله أكرم فقرنا وفاقتنا\n ويوسف عليه السلام ينظر إليهم من كوة ويسمع كلامهم\n ويبكي\n ثم قال لولده ميشا: اشدد وسطك بالمنطقة واخدم هؤلاء القوم\n فقال له: من هم يا أبت؟ فقال: هم أعمامك يا بني\n قال: يا أبت هؤلاء الذين باعوك؟ قال: نعم\n باعوني حتى صرت مَلك مصر\n ما تقول يا بني\n أحسَنُوا أو أساؤوا؟ قال: بل أحسَنوا فما أقول لهم؟ قال: لا تكلمهم\n ولا تُفش لهم سراً حتى يأذن الله بذلك\n فبقوا في الضيافة ثلاثاً أو أكثر\n ثم جهزهم\n وأرسلهم\n وشرط عليم أن يأتوا بأخيه بنيامين\n\nقال لهم: { فإن لم تأتوني به فلا كيلَ لكم عندي ولا تقربون }\n أي: لا تدخلوا دياري ولا تقربوا ساحتي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:70",
      "similarity": 0.5324005363081029
    },
    {
      "verse": "12:63",
      "similarity": 0.25103311730170286
    },
    {
      "verse": "83:2",
      "similarity": 0.2498747012052061
    },
    {
      "verse": "26:181",
      "similarity": 0.2496938439238533
    },
    {
      "verse": "12:60",
      "similarity": 0.21741402199107854
    }
  ]
}