{
  "chapter": "يوسف",
  "text": "قال يبنى لا تقصص رءياك على اخوتك فيكيدوا۟ لك كيدا ان الشيطن للانسن عدو مبين",
  "translations": [
    {
      "translation": "He said, 'My son, don't tell your brothers your dream lest they devise some scheme to injure you, Shaytan is a clear-cut enemy to man.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O son, do not narrate your dream to your brothers, or they will plot against you. Surely Satan is man's acknowledged foe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His father said: \"My son! Do not relate your dream to your brothers lest they hatch a plot to harm you. Indeed Satan is man's open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "his father said, \"My son, do not tell your dream to your brothers lest they plot against you; satan is the sworn enemy of man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O my child! Do not relate your dream to your brothers, for they will hatch a plot against you; indeed Satan is an open enemy towards mankind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (the father) said: \"O my son! Relate not your vision to your brothers, lest they should arrange a plot against you. Verily, Shaytan is to man an open enemy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my son! do not relate your vision to your brothers, lest they devise a plan against you; surely the Shaitan is an open enemy to man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'O my son, relate not thy vision to thy brothers, lest they devise against thee some guile. Surely Satan is to man a manifest enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my dear son! Tell not thy brethren of thy vision, lest they plot a plot against thee. Lo! Satan is for man an open foe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he replied, \"My son, do not relate your dream to your brothers, lest they plot evil against you -- Satan is the sworn enemy of man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my son! recount not thine vision unto thy brethren, lest they plot a plot against thee; verily the Satan is unto man an enemy manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he said, ‘My son, do not recount your dream to your brothers, lest they should devise schemes against you. Satan is indeed man’s manifest enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said (the father): \"My (dear) little son! relate not thy vision to thy brothers, lest they concoct a plot against thee: for Satan is to man an avowed enemy!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (the father) said: \"O my son! Relate not your vision to your brothers, lest they arrange a plot against you. Verily! Shaitan (Satan) is to man an open enemy!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'O my son, say nothing of this vision to your brothers lest they should cunningly plot against you indeed, satan is the clear enemy of the human,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O my son, do not relate your vision to your brothers, lest they plot and scheme against you. Satan is man's sworn enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"O my son, do not relate your vision to your brothers or they will contrive against you a plan. Indeed Satan, to man, is a manifest enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:5] He said, ‘O my son, do not relate your vision to your brothers, lest they plot against you some plot, [lest] they scheme to kill you, out of envy, knowing that the interpretation [of the dream] is that they represent the [eleven] planets, your mother, the sun and your father, the moon. Truly Satan is to man a manifest foe, [one] of evident enmity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Jacob confided to Joseph, saying: (0 my dear son!) if you see any other dream in the future (Tell 242 not) do not inform (thy brethren of your vision, lest they plot a plot against thee) that may lead to your peril. (Lo! Satan is for man) for the children of Adam (an open foe) with manifest enmity, and he drives them to resentful envy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n تلطفاً له وإشفاقاً عليه وتخوفاً من كبد إخوته { لاَ تَقْصُصْ } ولا تذكر { رُؤْيَاكَ } التي رأيتها { عَلَىٰ إِخْوَتِكَ } لئلا يحسجوا لك من ارتفاع شأنك { فَيَكِيدُواْ لَكَ كَيْداً } بإغواء الشيطان إياهم ويختالوا لمقتك وهلاكك\n حسداً لك ولعلو شأنك { إِنَّ ٱلشَّيْطَانَ } المغوي المضل { لِلإِنْسَانِ عَدُوٌّ مُّبِينٌ } [يوسف: 5] ظاهر العداوة\n محيل عظيم\n يعاديهم في لباب الصدقة ويفسدهم في سورة الإصلاح\n\n\nثم لما سارع يعقوب عليه السلام بالهي عن الانتشار والإفشاء تحذيراً وتخويفاً له من كيد إخوته\n اشتغل بتأويل رؤيته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال له: { إن الشيطان للإنسان عدو مبين } ظاهر العداوة لأجل ما فعل بـآدم وحواء\n فلا يألوا جهداً في تسويلهم وإثارة الحسد فيهم\n حتى يحملهم على الكيد\n قيل: لم يسمع كلام يوسف في رؤياه إلا خالته ـ أم شمعون ـ فقالت لإخوته: التعب عليكم\n والإقبال على يوسف\n فحركهم ذلك حتى فعلوا ما فعلوا\n وقيل: أخبرت بذلك ولدها شمعون\n فأخبر شمعون إخوته\n فخلوا به وقالوا له: إنك لم تكذب قط\n فأخبرنا بما رأيت في نومك\n فأبى\n فأقسموا عليه\n فأخبرهم\n فوقعوا فيما فعلوا به",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:11",
      "similarity": 0.42966054196910514
    },
    {
      "verse": "77:39",
      "similarity": 0.4227414956823561
    },
    {
      "verse": "86:15",
      "similarity": 0.4171837121526218
    },
    {
      "verse": "7:7",
      "similarity": 0.416419161424113
    },
    {
      "verse": "3:62",
      "similarity": 0.41505074083083465
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}