{
  "chapter": "يوسف",
  "text": "قال اجعلنى على خزائن الارض انى حفيظ عليم",
  "translations": [
    {
      "translation": "He said, 'Entrust the country's stores to me. In truth I am a knowing guardian.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Appoint me over the granaries of the land,\" (he said); \"I shall be a knowledgeable keeper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said: \"Place me in charge of the treasures of the land. I am a good keeper and know my task well.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said, \"Put me in charge of the treasuries of the land. I know how to manage them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Yusuf, “Appoint me over the treasures of the earth; indeed I am a protector, knowledgeable.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Yusuf] said: \"Set me over the storehouses of the land; I will indeed guard them with full knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Place me (in authority) over the treasures of the land, surely I am a good keeper, knowing well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Set me over the land's storehouses; I am a knowing guardian.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Set me over the storehouses of the land. Lo! I am a skilled custodian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said, \"Place in my charge the storehouses of the land; for I am a good and knowledgeable custodian.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: set me over the store houses of the land; verily I shall be a keeper knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Put me in charge of the country’s granaries. I am indeed fastidious [and]well-informed.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Joseph) said: \"Set me over the store-houses of the land: I will indeed guard them, as one that knows (their importance).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Yusuf (Joseph)] said: \"Set me over the storehouses of the land; I will indeed guard them with full knowledge\" (as a minister of finance in Egypt, in place of Al-'Aziz who was dead at that time).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Joseph) said: 'Give me charge of the storehouses of the land, I am a knowledgeable guardian'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Put me in charge of the storehouses of the land; I am honest and knowledgeable.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Joseph] said, \"Appoint me over the storehouses of the land. Indeed, I will be a knowing guardian.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:55] He, Joseph, said, ‘Place me in charge of the storehouses of the land, the land of Egypt. I am indeed a skilled custodian’, one worthy of custodianship thereof, and knowledgeable in such affairs — it is also said [that he meant]: [I am indeed] a [competent] scribe and accountant.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "249 (He said: Set me over the storehouses of the land) appoint me in charge of the treasury of Egypt (I am a skilled custodian) I am skilled in its estimation and know the time when people go hungry; it is also said that this means: I am trustworthy regarding that with which you have entrusted me, and also know the languages of the strangers who come to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما رأى يوسف عليه السلام ألاَّ محيص له عنه، ولا بدَّ له من ارتكاب أمر من أمور الملك { قَالَ ٱجْعَلْنِي عَلَىٰ خَزَآئِنِ ٱلأَرْضِ } أي: أرض مصر { إِنِّي } بإقامة هذا الأمر { حَفِيظٌ } بوجوه محافظة أي جنس من الأجناس { عَلِيمٌ } [يوسف: 55] بطرق تدابيرها والتصرف فيها\n\n\n\n\nقيلك اتفق وفات قطفير - هو سيد يوسف - في تلك الليالي، وكان هذا المنصب له لذلك طلبه، وتزوج زليخا زوجته التي قد شغفها حباً، فوجدها عذراء وولد يوسف منها أفرايم وميشا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إني حفيظٌ } لها ممن لا يستحقها، { عليم } بوجوه التصرف فيها\n قال البيضاوي: ولعله عليه السلام لما رأى أنه يستعمله في أمره لا محالة، آثر ما تعم فوائده وعوائده، وفيه دليل على جواز طلب التولية، وإظهار أنه مستعد لها، والتولي من يد الكافر، إذا علم أنه لا سبيل إلى إقامة الحق وسياسة الخلق إلا بالاستظهار به\n\n\nوعن مجاهد: ان الملك أسلم على يديه\n هـ\n قلت: وقد تقدم عن الورتجبي ما يدل عليه\n  وقال ابن عطية: وطلب يوسف للعمل إنما هو حسبة منه عليه السلام لرغبته أن يقع العدل، ونحو هذا هو دخول أبي بكر رضي الله عنه في الخلافة، مع نهيه المستشيرَ له من الأنصار عن أن يتأمَّر على اثنين\n فجائز للفاضل أن يعمل ويطلب العمل إذا رأى ألا عوض منه\nهـ\n وفي \" الاكتفاء في أخبار الخلفاء \": أن عمر أراد أبا هريرة على العمل، فامتنع، فقال له: أوليس يوسف خيراً منك، وقد طلب العمل؟ فقال: يوسف نبي ابن نبي، وأنا ابن أميمَةَ، فأنا أخاف ثلاثاً واثنين: أن أقول بغير علم، وأقضي بغير عدل، وأن يضرب ظهري، ويشتم عرضي، ويؤخذ مالي\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:21",
      "similarity": 0.7443568195071804
    },
    {
      "verse": "38:9",
      "similarity": 0.5962094759222469
    },
    {
      "verse": "52:37",
      "similarity": 0.5842395460282536
    },
    {
      "verse": "40:49",
      "similarity": 0.5521083401547792
    },
    {
      "verse": "6:50",
      "similarity": 0.4361981820129322
    }
  ]
}