{
  "chapter": "يوسف",
  "text": "وقال الملك ائتونى به فلما جاءه الرسول قال ارجع الى ربك فسـله ما بال النسوة التى قطعن ايديهن ان ربى بكيدهن عليم",
  "translations": [
    {
      "translation": "The king said: \"Bring him to me. So when the messenger came to Joseph, he said: \"Go back to your lord and ask him: 'How fare the women who had cut their hands?' My Lord is cognisant of their guile.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said: \"Bring this man to me.\" But when the royal messenger came to Joseph he said: \"Go back to your master and ask him about the case of the women who had cut their hands. Surely my Lord has full knowledge of their guile.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The King ordered his people to bring Joseph into his presence. When the messenger came to Joseph, he (Joseph) said, \"Ask your master about the women who cut their hands. My Lord knows all about their guile\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said, “Bring him to me”; so when the bearer came to him, Yusuf said, “Return to your lord and ask him what is the status of the women who had cut their hands; indeed my Lord knows their deception.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: \"Bring him to me.\" But when the messenger came to him, [Yusuf] said: \"Return to your king and ask him, `What happened to the women who cut their hands Surely, my Lord (Allah) is Well-Aware of their plot.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: Bring him to me. So when the messenger came to him, he said: Go back to your lord and ask him, what is the case of the women who cut their hands; surely my Lord knows their guile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, 'Bring him to me!' And when the messenger came to him, he said, 'Return unto thy lord, and ask of him, \"What of the women who cut their hands?\" Surely my Lord has knowledge of their guile.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: Bring him unto me. And when the messenger came unto him, he (Joseph) said: Return unto thy lord and ask him what was the case of the women who cut their hands. Lo! my Lord knoweth their guile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, \"Bring him to me.\" When the king's messenger came to Joseph, he said, \"Go back to your master and ask him about the women who cut their hands: my Lord knows well their guile.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: bring him Unto me. Then, when the messenger came to him, he said: return to thy lord, and ask him, what about the women who cut their hands! verily my Lord is the Knower of their guile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, ‘Bring him to me!’ When the messenger came to him, he said, ‘Go back to your master, and ask him about the affair of women who cut their hands. My Lord is indeed well aware of their stratagems.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the king said: \"Bring ye him unto me.\" But when the messenger came to him, (Joseph) said: \"Go thou back to thy lord, and ask him, 'What is the state of mind of the ladies who cut their hands'? For my Lord is certainly well aware of their snare.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: \"Bring him to me.\" But when the messenger came to him, [Yusuf (Joseph)] said: \"Return to your lord and ask him, 'What happened to the women who cut their hands? Surely, my Lord (Allah) is Well-Aware of their plot. \n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said: 'Bring him before me' But when the king's envoy came to him, he said: 'Go back to your lord and ask him: \"What about the women who cut their hands. Indeed, my Lord knows their guile'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, “Bring him to me.” And when the envoy came to him, he said, “Go back to your master, and ask him about the intentions of the women who cut their hands; my Lord is well aware of their schemes.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said, \"Bring him to me.\" But when the messenger came to him, [Joseph] said, \"Return to your master and ask him what is the case of the women who cut their hands. Indeed, my Lord is Knowing of their plan.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:50] And the king, after the messenger had come to him and informed him of its [the dream’s] interpretation, said: ‘Bring him to me!’, that is, the one who interpreted it. And when the messenger came to him, that is, [to] Joseph, and summoned him in order to depart [from the prison], he said — with the intention of manifesting his innocence — ‘Return to your lord and ask him, to inquire: “What of, [what was] the case   with, the women who cut their hands?” Surely my lord, my master, has knowledge of their guile’; he [the messenger] thus returned and informed the king, who then summoned them [the women].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The Messenger went back and informed the king of it. (And the King said: Bring him unto me) bring Joseph to me. (And when the messenger) the cupbearer (came unto him) to Joseph and informed him that the king wanted to see him, (he said) Joseph said to him: (Return unto thy lord) your master, the king (and ask him what was the case of the women) he said: go and ask the king to enquire about what really happened with those women (who cut their hands) who slashed and grazed their hands. (Lo! my lord) my master (knoweth their guile) their scheming and doing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لما سمع الشرابي من يوسف ما سمع، تسارع إلى الملك وأخبره ما سمع من التعبير { قَالَ ٱلْمَلِكُ ٱئْتُونِي بِهِ } فأرسل من يحضره { فَلَمَّا جَآءَهُ ٱلرَّسُولُ } ليخرجه من السجن { قَالَ } يوسف: لا أخرج من السجن ما لم يظهر براءتي وعصمتي وطهار ذيلي وكمال عفتي مما يرمونني ويسجنونني بسببه { ٱرْجِعْ } أيها الرسول { إِلَىٰ رَبِّكَ } وسيدك { فَاسْأَلْهُ } أن يكشف عن أمره وما جرى عليَّ من ظلم أولئك المفترين، سيما ليسأل: { مَا بَالُ ٱلنِّسْوَةِ ٱللاَّتِي قَطَّعْنَ أَيْدِيَهُنَّ } وما شأنهن معي { إِنَّ رَبِّي } الذي رباني بكمال العصمة والعفة { بِكَيْدِهِنَّ } ومكرهن الذي قصدن معي { عَلِيمٌ } [يوسف: 50] على التفصيل الذي يخفون في نفوسهن، يجازيهن في يوم الجزاء على مقتضى علمه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: ولما جاء الرسول من عند يوسف بالتعبير، وسمعه الملك، تعجب منه، واستعظم علمه وعقله، وقال: لا ينبغي لمثل هذا أن يُسجن، { ائتوني به فلما جاءه الرسولُ } ليُخرجه، { قال ارجع إلى ربك فاسأله ما بالُ النسوة اللاتي قَطَّعْنَ أيديهن }: ما شأنهن حتى قطعن أيديهن، وهل رأين مني ميلاُ إليهن\n وإنما تأنى في الخروج، وقدَّم سؤال النسوة، والفحص عن حاله ليظهر براءة ساحته، وليعلم الملك أنه سُجن ظلماً، فلا يقدر الحاسد أن يتوسل به إلى تقبيح أمره\n وفيه دليل على أنه ينبغي أن يتقي مواضع التهم، ويجتهد، في نفيها، وفي الحديث:\n\n \" مَنْ كََان يُؤمِنُ بِالله ِواليومِ االآخِرِفلا يَقِفَنَّ مَواقِفَ التُّهَم \"\n \n\nوفيه دليل على حلمه وصبره، وعدم اهتباله بضيق السجن إذ لم يُجب الداعي ساعة دُعي بعد طول سجنه\n ومن هذا المعنى تواضع معه نبينا صلى الله عليه وسلم حيث قال\n\n \" لَو لَبِثت في السِّجْنِ مَا لَبِثَ يُوسفُ لأَجَبْتُ الدَّاعِي \" \n\nولم يذكر امرأة العزيز كرماً، ومراعاةً للأدب، ورعياً لذمام زوجها، وستراً لها\n بل ذكر النسوة اللاتي قطعن أيديهن\n ثم قال: { إن ربي بكيدهن عليم } حين قلن لِي: أطع مولاتك\n وفي عبارته تعظيم لكيدهن، والاسشهاد عليه بعلم الله، وبراءته مما قذف به، والوعيد لهن على كيدهن",
      "translations": []
    }
  ]
}