{
  "chapter": "يوسف",
  "text": "وقال الملك ائتونى به استخلصه لنفسى فلما كلمه قال انك اليوم لدينا مكين امين",
  "translations": [
    {
      "translation": "The King said, 'Bring him to me straight away! so I may draw him very close to me.' When he had spoken with him, he declared, 'Today you are trusted, established in our sight.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the king heard this he said: \"Bring him to me. I shall take him in my special service.\" When he had talked to him, he said: \"Today you are established in a rank of trust with us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said: \"Bring him to me. I will select him exclusively for my own service.\" So when Joseph spoke to him the king said: \"You are now one of established position, fully-trusted by us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The King ordered his men to bring Joseph before him. He wanted to grant him a high office. The King said to Joseph, \"From now on you will be an honored and trusted person among us\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said, “Bring him to me so that I may choose him especially for myself”; and when he had talked to him he said, “Indeed you are today, before us, the honourable, the trusted.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: \"Bring him to me that I may attach him to my person.\" Then, when he spoke to him, he said: \"Verily, this day, you are with us high in rank and fully trusted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: Bring him to me, I will choose him for myself. So when he had spoken with him, he said: Surely you are in our presence today an honorable, a faithful one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, 'Bring him to me! I would attach him to my person.' Then, when he had spoken with him, he said, 'Today thou art established firmly in our favour and in our trust.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: Bring him unto me that I may attach him to my person. And when he had talked with him he said: Lo! thou art to-day in our presence established and trusted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, \"Bring him to me. I will take him for my special service.\" And when he had spoken to him, he said, \"From now on you will dwell with us, honoured and trusted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: bring him unto me I will single him out for myself Then when he spake unto him, he said: verily thou art to-day with us placed high, intrusted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, ‘Bring him to me, I will make him my favourite.’ Then, when he had spoken with him, he said, ‘Indeed today [onwards] you will be honoured and trustworthy with us.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the king said: \"Bring him unto me; I will take him specially to serve about my own person.\" Therefore when he had spoken to him, he said: \"Be assured this day, thou art, before our own presence, with rank firmly established, and fidelity fully proved!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said: \"Bring him to me that I may attach him to my person.\" Then, when he spoke to him, he said: \"Verily, this day, you are with us high in rank and fully trusted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said: 'Bring him before me. I will assign him to myself' And when he had spoken with him he said: 'Today, you are firmly established in both our favor and trust'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, “Bring him to me, and I will reserve him for myself.” And when he spoke to him, he said, “This day you are with us established and secure.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the king said, \"Bring him to me; I will appoint him exclusively for myself.\" And when he spoke to him, he said, \"Indeed, you are today established [in position] and trusted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:54] And the king said, ‘Bring him to me, that I may use him for myself’, that I may make him mine exclusively, with none to share [him with me]. The messenger came to him [to Joseph] and said, ‘Respond to the king!’, and so he got up and bid farewell to [his] fellow-prisoners and prayed for them. He then washed himself, put on some good clothes and entered upon him. And when he had spoken with him, he said, to him: ‘Indeed you are on this day in our presence established and trustworthy’, a person of status, entrusted over our affair, so what do you think we should do? He said, ‘Gather food [stocks] and sow abundantly in these fertile years, then store the corn in its ears. People [from far and wide] will come to you and ask you to supply them [with provisions]’. He [the king] said, ‘Whom can I delegate this [task] to?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the king said: Bring him unto me that I may attach him to my person) bring him so that I give him a privileged position instead of the Chief Official. (And when he had talked with him) and interpreted his dreams (he said) the king said to him: (Lo! thou art today in our presence) with us (established) you have prestige and position (and trusted) with what is entrusted to you; it is also said: you are trusted with the position that we give you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما فتش الملك عن أحواله وما جرى عليه\n ثبت عنده أمانته وديانته ورعاية حقوق سيده ورشده في الأمور\n سيما في التعبيرات والتأويلات\n وصدقه في جيمع الأقوال الصادرة عنه { قَالَ ٱلْمَلِكُ } متحنناً عليه متشوقاً للقياه: { ٱئْتُونِي بِهِ } سريعاً { أَسْتَخْلِصْهُ } أي: أجعله خالصاً { لِنَفْسِي } ليكون أنيسي وجليسي ومولي أمري وظهيري في تدابير الأمور\n فحضوره عنده وسلم على الملك ترحيباً وتعظيماً { فَلَمَّا كَلَّمَهُ } وأخذه بحمد الملك وثنائه ودعائه على اللغة العبرية\n قال الملك: ما هذا اللسان؟\n\nقال: هذا لسان آبائي وأجدادي وكان الملك يتكلم على سبعين لغة\n فكلم معه بجميعها\n فأجاب جميعها وأحسن فيها\n فتعجب الملك منه وقال: أريد أن أسمع تأويل رؤياي منك مشافهة\n فحكاه وبين وجوه المناسبات بين التعبيرات والسنوات المجدبة والمخصبة وكيفية الانتقالات والتعبيرات على مقدار فهم الملك وتأويلات السنابل الخضر واليابس على الوجه الذي أُلهم وأوحي\n فازداد الملك محبة ومودة لذلك { قَالَ إِنَّكَ ٱلْيَوْمَ لَدَيْنَا مَكِينٌ } ذو مكانة ومرتبة علية ومنزلة رفيعة { أَمِينٌ } [يوسف: 54] مؤتمن على جميع أمورنا\n فلك التصريف في ملكنا كيف تشاء\n\n\nوبعدما رأى يوسف عليه السلام ألاَّ محيص له عنه\n ولا بدَّ له من ارتكاب أمر من أمور الملك { قَالَ ٱجْعَلْنِي عَلَىٰ خَزَآئِنِ ٱلأَرْضِ } أي: أرض مصر { إِنِّي } بإقامة هذا الأمر { حَفِيظٌ } بوجوه محافظة أي جنس من الأجناس { عَلِيمٌ } [يوسف: 55] بطرق تدابيرها والتصرف فيها\n\n\nقيلك اتفق وفات قطفير - هو سيد يوسف - في تلك الليالي\n وكان هذا المنصب له لذلك طلبه\n وتزوج زليخا زوجته التي قد شغفها حباً\n فوجدها عذراء وولد يوسف منها أفرايم وميشا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهذا معنى قوله تعالى: { فلما كلمه قال إنك اليوم لدينا مكين أمين } أي: فلما أتوا به وكلمه وشاهد منه الرشد والدعاء\n { قال إنك اليوم } عندنا { مكينٌ } أي: في مكانه ومنزلة\n { أمين }: مؤتمن على كل شيء\n ثم فوض إليه أمر المملكة\n وقيل: توفي قطفير ـ أي: العزيز ـ فنَصَّبه منصبه\n وزوجه من زليخا بعد أن شاخت\n وافتقرت\n فدعا الله تعالى فرد عليها جمالها وشبابها\n فوجدها عذراء وولد منها إفراثيم وميشا\n ثم قال له الملك: ما ترى نصنع في هذه السنين المخصبة؟\n { قال اجعلني على خزائنِ الأرض } أي: أرض مصر ألى أمرها\n والخزائن: كل ما يخزن فيه طعام ومال وغيرهما\n { إني حفيظٌ } لها ممن لا يستحقها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:21",
      "similarity": 0.4567008025961094
    },
    {
      "verse": "81:20",
      "similarity": 0.40025674974104
    },
    {
      "verse": "50:35",
      "similarity": 0.38489128224720465
    },
    {
      "verse": "36:32",
      "similarity": 0.3816860880689771
    },
    {
      "verse": "50:29",
      "similarity": 0.37579316514464334
    }
  ]
}