{
  "chapter": "يوسف",
  "text": "ذلك ليعلم انى لم اخنه بالغيب وان الله لا يهدى كيد الخائنين",
  "translations": [
    {
      "translation": "In this way he may know at last that I did not dishonour him behind his back and that Allah most surely does not guide the deviousness of the dishonourable.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(At this Joseph remarked:) \"From this (the Minister) should know that I did not betray him in his absence, and that God does not surely let the wiles of those who betray ever succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph said: \"I did this so that he [i.e. the chief) may know that I did not betray him in his absence, and that Allah does not allow the design of the treacherous to succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Joseph said), \"This proves that I was not disloyal to the King in his absence. God does not grant success to the efforts of disloyal people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Yusuf, “I did this so that the governor may realise that I did not betray him behind his back, and Allah does not let the deceit of betrayers be successful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Then Yusuf said: \"I asked for this inquiry] in order that he may know that I betrayed him not in (his) absence.\" And, verily, Allah guides not the plot of the betrayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is that he might know that I have not been unfaithful to him in secret and that Allah does not guide the device of the unfaithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, so that he may know I betrayed him not secretly, and that God guides not the guile of the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then Joseph said: I asked for) this, that he (my lord) may know that I betrayed him not in secret, and that surely Allah guideth not the snare of the betrayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From this,\" said Joseph, \"[The nobleman] should know that I did not betray him in his absence, and that God does not guide the plotting of the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: that did in order that he may know that I betrayed him not in secret, and that Allah guideth not the guile of betrayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Joseph said], [‘I initiated] this [inquiry], that he may know that I did not betray him in his absence, and that Allah does not further the schemes of the treacherous.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (say I), in order that He may know that I have never been false to him in his absence, and that Allah will never guide the snare of the false ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Then Yusuf (Joseph) said: \"I asked for this enquiry] in order that he (Al-'Aziz) may know that I betrayed him not in secret. And, verily! Allah guides not the plot of the betrayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (I have done) so that he will know I did not secretly betray him, and that Allah does not guide the guile of the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This is that he may know that I did not betray him in secret, and that God does not guide the scheming of the betrayers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so al-'Azeez will know that I did not betray him in [his] absence and that Allah does not guide the plan of betrayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:52] ‘That, plea of innocence, is so that he, the Court officer, may know I did not betray him, with regard to his family, in his absence (bi’l-ghayb is a circumstantial qualifier), and that truly God does not guide [to success] the guile of the treacherous; he [Joseph] then humbled himself before God and said:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Joseph said: (This, that he) the Chief Official (may know that I betrayed him not) regarding his wife (in secret) when he was away, (and that surely Allah guideth not) neither is He pleased with nor make right (the snare of the betrayers) the work of adulterers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n رُوي عن ابن عباس أنه لما قال: { لم أخُنْهُ بالغيب } قال جبريل عليه السلام: ولا حين هممت\n\nفقال: { وما أُبرئُ نفسي } لا أنزهها في عموم الأحوال\n أو لا أزكيها على الدوام\n قاله تواضعاً وإظهاراً للعبودية وتنبيهاً على أنه لم يرد بذلك تزكية نفسه\n ولا العجب بحاله\n بل إظهاراً لنعمة العصمة والتوفيق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:27",
      "similarity": 0.7214350887517368
    },
    {
      "verse": "40:19",
      "similarity": 0.5795145071896081
    },
    {
      "verse": "4:107",
      "similarity": 0.5617801807001233
    },
    {
      "verse": "8:71",
      "similarity": 0.5603471253635465
    },
    {
      "verse": "4:105",
      "similarity": 0.5560607367728724
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012052.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012052.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}