{
  "chapter": "يوسف",
  "text": "قال ما خطبكن اذ رودتن يوسف عن نفسه قلن حش لله ما علمنا عليه من سوء قالت امرات العزيز الـن حصحص الحق انا۠ رودته عن نفسه وانه لمن الصدقين",
  "translations": [
    {
      "translation": "He said, 'What was this past affair of yours when you solicited Yusuf?' Then they said 'Allah forbid! We know no bad of him.' The governor's wife then said, 'The truth has now emerged. Indeed I tried to seduce him then and he has simply told the honest truth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king asked the women: \"What was the affair of seducing Joseph?\" \"God preserve us,\" they said; \"we know no evil against him.\" The wife of the minister said: \"The truth has now come out. It was I who desired to seduce him, but he is indeed a man of virtue.\" --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon the king asked the women: \"What happened when you sought to tempt Joseph?\" They said: \"Allah forbid! We found no evil in him.\" The chief's wife said: \"Now the truth has come to light. It was I who sought to tempt him. He is indeed truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The King asked the women about their attempt to seduce Joseph. They replied, \"God forbid! We do not know of any bad in Joseph.\" The wife of the King said, \"Now the truth has come to light. It was I who tried to seduce Joseph. He is, certainly, a truthful man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, “O women! What was your role when you tried to entice Yusuf?” They answered, “Purity is to Allah – we did not find any immorality in him”; said the wife of the governor, “Now the truth is out; it was I who tried to entice him, and indeed he is truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The king) said (to the women): \"What was your affair when you did seek to seduce Yusuf\" The women said: \"Allah forbid! No evil know we against him!\" The wife of the `Aziz said: \"Now the truth is manifest (to all); it was I who sought to seduce him, and he is surely of the truthful. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: How was your affair when you sought Yusuf to yield himself (to you)? They said: Remote is Allah (from imperfection), we knew of no evil on his part. The chief's wife said: Now has the truth become established: I sought him to yield himself (to me), and he is most surely of the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What was your business, women,' he said, 'when you solicited Joseph?' 'God save us!' they said. 'We know no evil against him.' The Governor's wife said, 'Now the truth is at last discovered; I solicited him; he is a truthful man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (the king) (then sent for those women and) said: What happened when ye asked an evil act of Joseph? They answered: Allah Blameless! We know no evil of him. Said the wife of the ruler: Now the truth is out. I asked of him an evil act, and he is surely of the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king asked the women, \"What was the truth of the affair in which you tried to seduce Joseph?\" The women said, \"God forbid! We know no evil of him.\" The wife of the nobleman said, \"The truth has now come to light. It was I who tried to seduce him; he is surely an honest man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: What was the matter with you when ye solicited Yusuf against himself! They said: how perfect is God! we knew not of any evil against him. The wife of the Aziz said: how hath the truth come to light, even I, solicited him against himself, and verily he is of the truth-tellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The king said, ‘What was your business, women, when you solicited Joseph?’ They said, ‘Heaven be praised! We know of no evil in him.’ The prince’s wife said, ‘Now the truth has come to light! It was I who solicited him, and he is indeed telling the truth.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The king) said (to the ladies): \"What was your affair when ye did seek to seduce Joseph from his (true) self?\" The ladies said: \"Allah preserve us! no evil know we against him!\" Said the 'Aziz's wife: \"Now is the truth manifest (to all): it was I who sought to seduce him from his (true) self: He is indeed of those who are (ever) true (and virtuous).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The King) said (to the women): \"What was your affair when you did seek to seduce Yusuf (Joseph)?\" The women said: \"Allah forbid! No evil know we against him!\" The wife of Al-'Aziz said: \"Now the truth is manifest (to all), it was I who sought to seduce him, and he is surely of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What was your business, women' he asked, 'when you solicited Joseph' 'Allah save us' they replied. 'We know no evil against him' The Governor's wife said: 'The truth has been discovered at last; I solicited him; he is among the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “What was the matter with you, women, when you tried to seduce Joseph?” They said, “God forbid! We knew of no evil committed by him.” The governor’s wife then said, “Now the truth is out. It was I who tried to seduce him, and he is telling the truth.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said [the king to the women], \"What was your condition when you sought to seduce Joseph?\" They said, \"Perfect is Allah! We know about him no evil.\" The wife of al-'Azeez said, \"Now the truth has become evident. It was I who sought to seduce him, and indeed, he is of the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:51] He said, ‘What was your business, women, when you solicited Joseph?’, did you find on his part any inclination towards you?: ‘God preserve us!’ they said. ‘We know of no evil in him.’ The Court Officer’s wife said, ‘Now the truth is out, [now] it has become clear; it was I who attempted to seduce him and he is indeed of the truthful’, in his saying, It was she who attempted to seduce me [Q. 12:26]. Joseph was then informed of this and he said:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The messenger went back and informed the king who summoned the four women: the wife of his cupbearer, the wife of his chief cook, the wife of the master of his stable and the wife of the Chief Official. These four women were the most powerful personalities after the king. (He (the king) (then sent for those women and) said: What happened when ye asked an evil act of Joseph? They answered: Allah Blameless!) God forbid! (We know) we saw (no evil of him. Said the wife of the ruler: Now the Truth is out) in favour of Joseph; it is also said that this means: now is the time to tell the truth. (I asked of him an evil act) I offered myself to him, (and he is surely of the Truthful) that he did not ask an evil act of me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلآنَ حَصْحَصَ ٱلْحَقُّ } معناهُ السَّاعةُ وَضَحَ الحَقُّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Now has the truth been manifested,\" means that the Hour has come and the truth has become clear.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وقول نسوة القوى { حاش لله ما علمنا عليه من سوء }\n وقول امرأة العزيز: { الآن حصحص الحق } إشارة إلى تنوّر النفس والقوى بنور الحق واتصافها بصفة الإنصاف والصدق وحصول ملكة العدالة بنور الوحدة وظهور المحبة حال الفرق بعد الجمع وكمال طمأنينة النفس لإقرارها بفضيلة القلب وصدقه وذنبها وبراءته فإنّ من كمال اطمئنان النفس اعترافها بالذنب واستغفارها عما فرط منها حالة كونها أمارة وتمسكها بالرحمة الإلهية والعصمة الربانية واستخلاص الملك إياه لنفسه استخلافه للقلب على الملك بعد الكمال التامّ، كما جاء في القصة: أجلسه على سريره وتوّجه بتاجه وختمه بخاتمه وقلّده بسيفه وعزل قطفير ثم توفى قطفير وزوّجه الملك امرأته زليخا واعتزل عن المُلْك وجعله في يده و تخلّى بعبادة ربه\n كل ذلك إشارة إلى مقام خلافة الحق كما قال لداود:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما رجع الرسول إلى الملك وأخبر عن حاله ومقاله، بادر الملك إلى إحضار أولئك النسوان فحضرن { قَالَ } الملك منتقماً عنهن، مفتشاً عما جرى بينهن وبين يوسف: { مَا خَطْبُكُنَّ } وشأنكن أيتها الماكرات المحتالات { إِذْ رَاوَدتُّنَّ } وخادعتن بأنواع الحيلة والخداع { يُوسُفَ عَن نَّفْسِهِ } وأي شيء ظهر منه من أمارات الفساد وعلامات الفسوق حتى تجترئن بمراودته؟! { قُلْنَ } بأجمعهن بعدما سمعن كلام الملك واستفساره على وجه الانتقام: { حَاشَ لِلَّهِ مَا عَلِمْنَا عَلَيْهِ مِن سُوۤءٍ } أي: فعلة ذميمة وديدنة قبيحة باعثة لنا إلى مراودته، سوى أنا رأيناه على صورة عجيبة وحسن بديع، مِلْنا إلأيه وأردنا مخالطته فاستعصم من كمال عفته ونجابة طينته، ثم { قَالَتِ ٱمْرَأَتُ ٱلْعَزِيزِ } عند الملك بعدما بدأ ما أخفت وفشا ما سترت، مقرة مقررة لطهارة ذيله: { ٱلآنَ حَصْحَصَ } أي: لاح وظهر { ٱلْحَقُّ } وارتفع عنه الحجب انكشف الأستار { أَنَاْ رَاوَدْتُّهُ عَن نَّفْسِهِ } بعدما شغفني حبه وأزعجني ميله { وَإِنَّهُ } في ذاته وأقواله وأفعاله { لَمِنَ ٱلصَّادِقِينَ } [يوسف: 51] المبرين المنزهين عما افترينا عليه ورمينا به\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم جمع الملك النسوة، وكُن ستاً أو سبعاً، مات منهن ثلاث ويوسف في السجن، وبقي أربع ومعهن امرأة العزيز، و { قال } لهن: { ما خطبكُنَّ } ما شأنكن { إذ راودتُنَّ } أي: حين راودتن { يوسفَ عن نفسه } ، وأسند المراودة إلى جميعهن لأن المَلِك لم يتحقق أن امرأة العزيز هي التي راودته وحدها\n { قلنَ حاشَ لله } تنزيهاً لله أن يعجز عن خلق عفيف مثله، أو تنزيهاً ليوسف أن يعصيه لأجل خوف الله\n وهذا تبرئة ليوسف ولهن، أو لهن فقط\n وتكون تبرئة يوسف في قولهن: { ما علمنا عليه من سُوءٍ }: من ذنب\n { قالت امرأةُ العزيز الآن حَصْحَصَ الحق }: أي: تبين ووضح، أو ثبت واستقر، { أنا راودته عن نفسه وإنه لمن الصادقين } في قوله: { راودتني عن نفسي } فلما رجع إليه الرسول، وذكر ما قالته النسوة، وما أقرت به امرأة العزيز، قال: { ذلك ليعلم أني لم أخُنْهُ بالغيب } أي: فعلت ذلك التثبت والتأني في الخروج ليعلم العزيز أني لم أخنه في زوجته { بالغيب } في حال غيبته، أو بظهر الغيب وراء الأستار والأبواب المغلقة، بل تعففت عنها\n { وأن الله لا يهدي كيدَ الخائنين } أي: لا ينفذه ولا يسدده\n أو لا يهدي الخائنين ليكدهم\n وأوقع الفعل على الكيد مبالغةً\n وفيه تعريض بامرأة العزيز في خيانتها زوجها، وتوكيد لأمانته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:31",
      "similarity": 0.3775897666840982
    },
    {
      "verse": "10:91",
      "similarity": 0.1251808313593479
    },
    {
      "verse": "4:18",
      "similarity": 0.12497888319475992
    },
    {
      "verse": "10:51",
      "similarity": 0.12410346603936466
    },
    {
      "verse": "8:66",
      "similarity": 0.113692469268897
    }
  ]
}