{
  "chapter": "يوسف",
  "text": "وكذلك يجتبيك ربك ويعلمك من تاويل الاحاديث ويتم نعمته عليك وعلى ءال يعقوب كما اتمها على ابويك من قبل ابرهيم واسحق ان ربك عليم حكيم",
  "translations": [
    {
      "translation": "Accordingly your Lord will pick you out and teach you the true meaning of events and perfectly fulfil His blessing on you as well as on the family of Ya'qub as He fulfilled it perfectly before upon your forebears, Ibrahim and Ishaq. Most certainly your Lord is Knowing, Wise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord will choose you and teach you to interpret events, and confer His favours on you and the house of Jacob, as He had done in the case of two ancestors of yours, Abraham and Isaac, before you. Indeed your Lord is all-knowing and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As you have seen in the dream), so will your Lord choose you (for His task) and will impart to you the comprehension of the deeper meaning of things and will bestow the full measure of His favour upon you and upon the house of Jacob even as He earlier bestowed it in full measure upon your forefathers, Abraham and Isaac. Surely your Lord is All- Knowing, All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, your Lord will select you, teach you the interpretation of dreams, and grant His favors to you and the family of Jacob, just as He granted His favors to your fathers, Abraham and Isaac. Your Lord is certainly All-knowing and All-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And this is how your Lord will choose you and teach you how to interpret events, and will perfect His favours upon you and upon the family of Yaqub, the way He perfected it upon both your forefathers, Ibrahim and Ishaq; indeed your Lord is All Knowing, Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus will your Lord choose you and teach you the interpretation of dreams (and other things) and perfect His favor on you and on the offspring of Ya`qub, as He perfected it on your fathers, Ibrahim and Ishaq aforetime! Verily, your Lord is All-Knowing, All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus will your Lord choose you and teach you the interpretation of sayings and make His favor complete to you and to the children of Yaqoub, as He made it complete before to your fathers, Ibrahim and Ishaq; surely your Lord is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will thy Lord choose thee, and teach thee the interpretation of tales, and perfect His blessing upon thee and upon the House of Jacob, as He perfected it formerly on thy fathers Abraham and Isaac; surely thy Lord is All-knowing, All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus thy Lord will prefer thee and will teach thee the interpretation of events, and will perfect His grace upon thee and upon the family of Jacob as He perfected it upon thy forefathers, Abraham and Isaac. Lo! thy Lord is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall be chosen by your Lord and He will impart to you some understanding of the inner meaning of events. He will bestow the full measure of His blessings upon you and upon the House of Jacob -- even as He formerly bestowed it in full measure upon your forefathers, Abraham and Isaac. Truly, your Sustainer is all-knowing and wise!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Thus will thy Lord choose thee and teach thee of the interpretation of discourses, and will fulfil His favour upon thee and upon the house of Y'aqub even as He fulfilled it upon thy fathers, Ibrahim and Is-haq aforetime; verily thy Lord is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how your Lord will choose you, and teach you the interpretation of dreams, and complete His blessing upon you and upon the house of Jacob, just as He completed it earlier for your fathers, Abraham and Isaac. Your Lord is indeed all-knowing and all-wise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus will thy Lord choose thee and teach thee the interpretation of stories (and events) and perfect His favour to thee and to the posterity of Jacob - even as He perfected it to thy fathers Abraham and Isaac aforetime! for Allah is full of knowledge and wisdom.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus will your Lord choose you and teach you the interpretation of dreams (and other things) and perfect His Favour on you and on the offspring of Ya'qub (Jacob), as He perfected it on your fathers, Ibrahim (Abraham) and Ishaque (Isaac) aforetime! Verily, your Lord is All-Knowing, All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so your Lord will choose you and teach you the interpretation of visions, and perfect His Favor upon you and upon the House of Jacob, as He perfected it on your fathers Abraham and Isaac before you. Your Lord is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus your Lord will choose you, and will teach you the interpretation of events, and will complete His blessing upon you and upon the family of Jacob, as He has completed it before upon your forefathers Abraham and Isaac. Your Lord is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus will your Lord choose you and teach you the interpretation of narratives and complete His favor upon you and upon the family of Jacob, as He completed it upon your fathers before, Abraham and Isaac. Indeed, your Lord is Knowing and Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:6] Thus, in the way that you have seen, will your Lord prefer you, choose you, and teach you the interpretation of events, the interpretation of visions, and perfect His grace upon you, with prophethood, and upon the House of Jacob — [upon] his sons — as He perfected it, with prophethood, formerly on your fathers Abraham and Isaac. Truly your Lord is Knower, of His creatures, Wise’, in what He does with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus thy Lord will prefer thee) select you to be a prophet (and will teach thee the interpretation of events) the interpretation of dreams, (and will perfect his grace upon thee) by means of prophethood and Islam and will make you die as a prophet and one completely surrendered to Allah (and upon the family of Jacob) through you, i.e. He will perfect His grace on the children of Jacob through you (as he perfected it) as He perfected His grace by means of prophethood and Islam (upon thy forefathers) before you, (Abraham and Isaac. Lo! thy Lord is Knower) of His grace, (Wise) in that He perfects it; it is also said that this means: your Lord is Knower of your dream vision, Wise regarding that which will befall you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر، قال: حدَّثنا عليُّ بن أحمد، قال حدَّثنا عطاءُ بن السائب عن أبي خالد عن زبد بن علي عليهما السَّلامُ في قولهِ تعالى: { وَكَذٰلِكَ يَجْتَبِيكَ رَبُّكَ } معناه يَخْتارُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سارع يعقوب عليه السلام بالهي عن الانتشار والإفشاء تحذيراً وتخويفاً له من كيد إخوته، اشتغل بتأويل رؤيته، فقال: { وَكَذٰلِكَ } أي: مثل إراءتك هذه الرؤيا وتخصيصك بها { يَجْتَبِيكَ رَبُّكَ } أي: ينتخبك من بين الناس ويخصك بالرئاسة العظمى والمرتبة العليا، وهي النبوة والنيابة الإلهية { وَ } بعدما يجتبيك ويصطفيك { يُعَلِّمُكَ مِن تَأْوِيلِ ٱلأَحَادِيثِ } أي: يخصصك بعلم الرؤيا وتعبيرها إلى حيث انكشف لك حضرة الخيال انكشافاً تاماً { وَ } بالجملة: { يُتِمُّ نِعْمَتَهُ عَلَيْكَ وَ } بواسطتك { عَلَىٰ ءَالِ يَعْقُوبَ } أي: بنيه وأحفاده ومن ينتمي إليه وإن سفل { كَمَآ أَتَمَّهَآ عَلَىٰ أَبَوَيْكَ } أي: جديك { مِن قَبْلُ } في سالف الزمان؛ يعني { إِبْرَاهِيمَ وَإِسْحَاقَ } أعطاهما من الإنعام والأفضال ما لم يعط أحداً من الخلة والإنجاء والإنقاذ والفدية والخلاص، وغير ذلك من النعم الجسام { إِنَّ رَبَّكَ } الذي رباك بأنواع اللطف والكرم { عَلِيمٌ } بعلمه الحضوري لاستعدادات عباده على مقتضى ما ثبت في لوح قضائه إجمالاً { حَكِيمٌ } [يوسف: 6] في صورة تفضيه على وفق إجماله، لا يشذ عن حيطة علمه شيء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال له: { وكذلك } أي: وكما اجتَباك لهذه الرؤية الدالة على شرف وعز وكمال نفس، { يجتبيك ربُّك } للنبوة والملك، أو لأمور عظام، { ويُعلِّمك } أي: هو يعلمك { من تأويل الأحاديث } من تعبير الرؤيا لأنها أحاديث المَلك إن كانت صادقة، وأحاديث الشيطان إن كانت كاذبة\n أو يعلمك من تأويل غوامض علوم كتب الله، وسنن الأنبياء وحكم الحكماء\n { ويُتمُّ نعمتَه عليك } بالنبوة، أو بأن يجمع لك بين نعمة الدنيا، ونعمة الآخرة، { وعلى آل يعقوب } يريد: سائر بنيه\n ولعله استدل على نبوتهم بضوء الكواكب، { كما أتمها على أبويك من قبلُ } من قبلك، أو من قبل هذا الوقت\n فأتمها على إبراهيم بالرسالة والخلة والإنجاء من النار، وإسحاق بالرسالة والإنقاذ من الذبح، وهم: { إبراهيمَ وإسحاقَ } ، فهما عطف بيان لأبويك { إن ربك عليمٌ } بمن يستحق الاجتباء، { حكيم } لا يخلو فعله من حكمة، نعمة كانت أو نقمة\n الإشارة: البداية مجلاة النهاية، يوسف عليه السلام نزلت له أعلام النهاية في أول البداية\n وكذلك كل من سبق له شيء من العناية، لا بد تظهر أعلامه في أول البداية \" من أشرقت بدايته أشرقت نهايته \"\n من كانت بالله بدايته كانت إليه نهايته\n  وأوصاف النهاية تأتي على ضد أوصاف البداية فكمال العز في النهاية لا يأتي إلا بعد كمال الذل في البداية\n وتأمل قول الشاعر:\n\nوتأمل قضية سيدنا يوسف عليه السلام ما نال العز والملك حتى تحقق بالذل، والملك وكمال الغنى في النهاية لا يأتي إلا بعد كمال الفقر في البداية، وكمال العلم لا يأتي إلا بعد إظهار كمال الجهل، وكمال القوة لا يأتي إلا بعد كمال الضعف\n\n وهكذا جعل الله تعالى بحكمته الأشياء كامنة في أضدادها \" تحقق بأوصافك يمدك بأوصافه \"\n فالاجتباء يكون بعد الابتلاء، وإتمام النعم يكون بعد تقديم النقم، وذلك لتكون أحلى وأشهى، فيعرف قدرها ويتحقق منه شكرها، وهذا السر في تقديم أهوال يوم القيامة على دخول الجنة ليقع نعيمها في النفس كل موقع\n ولا فرق بين جنة الزخارف، وجنة المعارف\n حُفت الجنة بالمكاره، وحُفت النار بالشهوات\n والله تعالى أعلم\n ثم قال تعالى: { لَّقَدْ كَانَ فِي يُوسُفَ وَإِخْوَتِهِ }\n\n",
      "translations": []
    }
  ]
}