{
  "chapter": "يوسف",
  "text": "ولما فتحوا۟ متعهم وجدوا۟ بضعتهم ردت اليهم قالوا۟ يابانا ما نبغى هذه بضعتنا ردت الينا ونمير اهلنا ونحفظ اخانا ونزداد كيل بعير ذلك كيل يسير",
  "translations": [
    {
      "translation": "Then when they opened up their saddlebags and found their merchandise returned to them, they said, 'Our father! What more could we ask! Here is our merchandise returned to us. We can provide our families with food, and guard our brother and get an extra load. That is an easy measure to obtain.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they unpacked their goods they said: \"O father, what more can we ask? Look, even our money has been returned. We shall go and bring a camel-load more of grain for our family, and take good care of our brother. That will be an easy measure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their things they found that their goods had been given back to them. Thereupon they cried: \"Father! What else would we desire? Look, even our goods have been given back to us, so we shall go now and bring supplies for our family, we shall protect our brother, and bring another camel-load of corn. That additional supply will be easily secured.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they opened their baggage, they found that their money had been returned to them. They said, \"Father, what more do we want? Our money has been given back to us. We can buy more provisions with this for our family. We shall protect our brother and have one more camel load of grain which is easy to get\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their belongings they found that their means had been returned to them; they said, “O our father! What more can we ask for? Here are our means returned to us; we may get the provision for our homes and guard our brother, and get a camel-load extra; giving all these is insignificant for the king.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their bags, they found their money had been returned to them. They said: \"O our father! What (more) can we desire This, our money has been returned to us; so we shall get (more) food for our family, and we shall guard our brother and add one more measure of a camel's load. This quantity is easy (for the king to give).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their goods, they found their money returned to them. They said: O our father! what (more) can we desire? This is our property returned to us, and we will bring corn for our family and guard our brother, and will have in addition the measure of a camel (load); this is an easy measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their things, they found their merchandise, restored to them. 'Father,' they said, 'what more should we desire? See, our merchandise here is restored to us. We shall get provision for our family, and we shall be watching over our brother; we shall obtain an extra camel's load -- that is an easy measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their belongings they discovered that their merchandise had been returned to them. They said: O our father! What (more) can we ask? Here is our merchandise returned to us. We shall get provision for our folk and guard our brother, and we shall have the extra measure of a camel (load). This (that we bring now) is a light measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they opened their packs, they discovered that their money had been returned to them. They said, \"Our father, what more do we desire than this? This money of ours has been returned to us, so we shall [again] buy food for our family and we shall guard our brother, and we shall obtain an additional camel-load of grain. This [that we bring now] is a small quantity.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their stuff, they found their goods returned unto them. They said: our father! what more can we desire! here are our goods returned to us; We Shall supply our household and shall guard our brother and shall add anot her measure of a camel load: this is only a small measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their baggage, they found their money restored to them. They said, ‘Father, what [more] do we want?! This is our money, restored to us! We will get provisions for our family and take care of our brother, and add another camel-load of rations. These are meagre rations.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they opened their baggage, they found their stock-in-trade had been returned to them. They said: \"O our father! What (more) can we desire? this our stock-in-trade has been returned to us: so we shall get (more) food for our family; We shall take care of our brother; and add (at the same time) a full camel's load (of grain to our provisions). This is but a small quantity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their bags, they found their money had been returned to them. They said: \"O our father! What (more) can we desire? This, our money has been returned to us, so we shall get (more) food for our family, and we shall guard our brother and add one more measure of a camel's load. This quantity is easy (for the king to give).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they opened their saddlebags, they found that their merchandise had been given back to them. 'Father' they said 'what more do we desire? Look, our merchandise has been returned to us. We will receive provisions for our family and we will look after our brother. We shall receive an extra camelload, that is an easy measure'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their baggage, they found that their goods were returned to them. They said, “Father, what more do we want? Here are our goods, returned to us. We will provide for our family, and protect our brother, and have an additional camel-load. This is easy commerce.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they opened their baggage, they found their merchandise returned to them. They said, \"O our father, what [more] could we desire? This is our merchandise returned to us. And we will obtain supplies for our family and protect our brother and obtain an increase of a camel's load; that is an easy measurement.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:65]   And when they opened their belongings, they found that their merchandise had been restored to them. They said, ‘O father, what [more] should we desire? (mā nabghī: mā is interrogative, that is to say: what greater thing than this can we ask for from the king’s generosity?’; a variant reading has mā tabghī, ‘what [more] do you desire?’, as an address to Jacob — for they had mentioned to him his [the king’s] generosity towards them). Here is our merchandise restored to us. And we shall get provisions for our family, we shall obtain supplies for them, namely, food, and guard our brother, and we shall receive an extra camel’s load, because of our brother; that will be an easy measure’, for the king [to grant us], given his munificence.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they opened their belongings) their saddlebags (they discovered that their merchandise) the money which was to pay for the merchandise they bought (had been returned to them) along with the foodstuffs. (They said: our father!) We are not lying about the kindness and generosity of the man towards us; it is also said that this means: we have not requested this from him (What (more) can we ask? Here is our merchandise) the money we gave for the price of the merchandise (returned to us) with the merchandise. This only shows his kindness towards us. Their father said to them: the man is only testing you, you must return the money to him. (We shall get provision for our folk and guard our brother) Benjamin when we go and return, (and we shall have the extra measure of a camel (load)) if he comes with us. (This is a light measure) because of which we shall be given more; it is also said that this means: this is a small thing that we are requesting from you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَنَمِيرُ أَهْلَنَا } معناهُ نَأتِيهُم بِالطَّعامِ\n\n\n\n\nوقوله تعالى: { كَيْلَ بَعِيرٍ } معناهُ حِمْلُ بَعيرٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {We will come to our people with food}, means that We will bring them food.\n\n\nAnd the saying of Allah, {Kail Ba'ir} means the load of an camel.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n خرجوا من عنده محزونين { وَلَمَّا فَتَحُواْ مَتَاعَهُمْ } التي جاءوا بها { وَجَدُواْ بِضَاعَتَهُمْ } التي اشتروا بها الكيل { رُدَّتْ إِلَيْهِمْ } ندموا وتحزنوا\n ثم رجعوا إلى أبيهم شاكين مشتكين { قَالُواْ يٰأَبَانَا } إنا نجزم بمنع الكيل لو نكرر { مَا نَبْغِي } أي: شيء نفعل وندبر { هَـٰذِهِ بِضَاعَتُنَا رُدَّتْ إِلَيْنَا } على وجه لا نطلع عليها إلا الآن\n فجزمنا ألاَّ كيل لنا إن عدنا إليه مرة أخرى بلا إتيان أخينا\n ونكون عند العزيز من الكاذبين الصاغرين ونسأل منك يا أبانا من كمال كرمك وجاهك أن ترسل معنا أخانا\n ليصدقنا عند العزيز { وَ } بعد تصديقه أبانا { نَمِيرُ } ونحمل العطايا من عنده { أَهْلَنَا } أي: لأجلهم { وَنَحْفَظُ } في الذهاب والإياب { أَخَانَا وَنَزْدَادُ } بسببه { كَيْلَ بَعِيرٍ } أي: حمله\n إذ من سنة العزيز أن يحمل لكل منا بعيراً! { ذٰلِكَ } الكيل الذي جئنا به { كَيْلٌ يَسِيرٌ } [يوسف: 65] قليل لا يفي لمعاشنا إلى قت الخصب ما لم نزد\n؟\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولما فَتحوا متاعَهُم }: أوعيتهم\n { وجدوا بضاعَتَهم رُدت إليهم قالوا يا أبانا ما نبغي } أي: ما نطلب\n فهل من مزيد على هذه الكرامة\n أكرمنا وأحسن مثوانا\n وباع منا\n ورد علينا متاعنا\n ولا نطلب وراء ذلك إحساناً\n أو: ما نتعدى في القول\n ولا نزيد على ما حكينا لك من إحسانه\n أو: ما نبغي على أخينا\n ولا نكذب على الملك\n { هذه بضاعتنا رُدَّتْ إلينا } \n وهو توضيح وبيان لقولهم: { ما نبغي } \n أي: ردت إلينا فنتقوى بها\n { ونمير أهلَنا }: نسوق لهم الميرة ـ وهو: الطعام حين نرجع إلى الملك\n { ونحفظُ أخانا } من المكاره في ذهابنا وإيابنا\n\n { ونزدادُ كيلَ بعيرٍ } بزيادة حِمل بعير أخينا\n إذ كان يوسف عليه السلام لا يعطي إلا كيل بعير لكل واحد\n  { ذلك كيلٌ يسير } أي: ذلك الطعام الذي أتيناه به شيء قليل لا يكفينا حتى نرجع ويزيدنا كيل أخينا\n أوْ ذلك الحِمل الذي يزيدنا لبعير أخينا ـ كيل قليل عنده\n يسهل عليه لا يتعاظمه\n فلا يمنعنا منه\n كأنهم اسْتَقَلَّوا ما كيل لهم فأرادوا أن يضاعفوه بالرجوع إلى الملك ويزدادوا إليه ما يكال لأخيهم\n وقيل: إنه من كلام يعقوب عليه السلام\n والمعنى: أن حمل بعير شيء قليل لا يخاطرَ لمثله بالولد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:72",
      "similarity": 0.2592357660562467
    },
    {
      "verse": "12:88",
      "similarity": 0.20147203364950042
    },
    {
      "verse": "30:4",
      "similarity": 0.15022856893644582
    },
    {
      "verse": "12:62",
      "similarity": 0.14416930743191392
    },
    {
      "verse": "12:42",
      "similarity": 0.14214488935620567
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:65.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:65.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}