{
  "chapter": "يوسف",
  "text": "قال لن ارسله معكم حتى تؤتون موثقا من الله لتاتننى به الا ان يحاط بكم فلما ءاتوه موثقهم قال الله على ما نقول وكيل",
  "translations": [
    {
      "translation": "He said, 'I will not send him out with you until you make a covenant with Allah to bring him home unless you are overwhelmed.' When they had made their covenant, he said, 'Allah is Guardian over what we say.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I will never send him with you until you swear by God that you will bring him back to me, unless all of you are overtaken (by misfortune).\" When they had given their promise, he said: \"God is witness to our conversation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their father said: \"I shall never send him with you until you give me a solemn promise in the name of Allah that you will bring him back to me, unless you yourselves are surrounded.\" Then after they had given him their solemn promise, he said. \"Allah watches over what we have said.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Jacob) said, \"I shall not send him with you until you solemnly promise me before God to return him to me unless you are prevented from doing so.\" When they gave their promise, he said, \"God is the Witness of what we have said\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I shall never send him with you until you give me an oath upon Allah that you will bring him back to me, unless you are surrounded”; and (recall) when they gave him their oath that “Allah’s guarantee is upon what we say.” (* He knew that Bin Yamin would be restrained.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Ya`qub] said: \"I will not send him with you until you swear a solemn oath to me in Allah's Name, that you will bring him back to me unless you are yourselves surrounded (by enemies),\" And when they had sworn their solemn oath, he said: \"Allah is the Witness to what we have said.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I will by no means send him with you until you give me a firm covenant in Allah's name that you will most certainly bring him back to me, unless you are completely surrounded. And when they gave him their covenant, he said: Allah is the One in Whom trust is placed as regards what we say.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Never will I send him with you until you bring me a solemn pledge by God that you will surely bring him back to me unless it be that you are encompassed.' When they had brought him their solemn pledge he said, 'God shall be Guardian over what we say.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I will not send him with you till ye give me an undertaking in the name of Allah that ye will bring him back to me, unless ye are surrounded. And when they gave him their undertaking he said: Allah is the Warden over what we say.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Jacob] said, \"I will never send him with you until you give me a solemn pledge, before God, that you will indeed bring him back to me, unless you yourselves are trapped [in a compulsive situation].\" And when they had given him their solemn pledge, [Jacob] said, \"God shall be witness to all that we say.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I will by no means send him with you until ye give me an assurance by Allah that ye will bring him back to me, unless it be that ye are encompassed. Then when they gave him their assurance, he said: Allah is over that which we have said Warden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘I will not let him go with you until you give me a [solemn] pledge by Allah that you will surely bring him back to me, unless you are made to perish.’ When they had given him their [solemn] pledge, he said, ‘Allah is witness over what we say.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Jacob) said: \"Never will I send him with you until ye swear a solemn oath to me, in Allah's name, that ye will be sure to bring him back to me unless ye are yourselves hemmed in (and made powerless). And when they had sworn their solemn oath, he said: \"Over all that we say, be Allah the witness and guardian!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Ya'qub (Jacob)] said: \"I will not send him with you until you swear a solemn oath to me in Allah's Name, that you will bring him back to me unless you are yourselves surrounded (by enemies, etc.),\" And when they had sworn their solemn oath, he said: \"Allah is the Witness over what we have said.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'I will never send him with you until you swear by Allah that you will bring him back to me, unless you are prevented' And when they had given him their oath, he said: 'Allah is the Guardian of what we say'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I will not send him with you, unless you give me a pledge before God that you will bring him back to me, unless you get trapped.” And when they gave him their pledge, he said, “God is witness to what we say.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Jacob] said, \"Never will I send him with you until you give me a promise by Allah that you will bring him [back] to me, unless you should be surrounded by enemies.\" And when they had given their promise, he said, \"Allah, over what we say, is Witness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:66] He said, ‘I will not send him with you until you give me a [solemn] pledge, a covenant, in the name of God, by your swearing an oath, that assuredly you will bring him back to me, unless you are besieged’, such that you die, or are overwhelmed and thus unable to bring him back. They agreed to this. And when they gave him their [solemn] pledge, to this effect, he said, ‘God shall be Guardian, Witness, over what we say’, we and you. Thus he sent him with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) their father said to them: (I will not send him with you) simply because of your mere talk (till ye give me an undertaking) a pledge (in the name of Allah that you will bring him back to me, unless you are surrounded) unless an accident from heaven befalls you; it is also said that this means: unless an accident from heaven or from the earth descends upon you. (And when they gave him their undertaking) when they gave him their pledge in the name of Allah that they will bring him back (he said) Jacob said: (Allah is the Warden over what we say) Allah is a Witness over what we say; it is also said that this means: Allah is Custodian over what we say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما بالغوا في سؤالهم واقترحوا الإسعاف ماطلبوا { قَالَ } لهم أبوهم معاتباً عليهم: { لَنْ أُرْسِلَهُ } أي: بنيامين { مَعَكُمْ حَتَّىٰ تُؤْتُونِ مَوْثِقاً مِّنَ ٱللَّهِ } أي: يميناً وسماً أثق به وأعتمد عليه { لَتَأْتُنَّنِي بِهِ } ألبتة لا خلف { إِلاَّ أَن يُحَاطَ بِكُمْ } نوع من البلاؤ من إلمام العدو وغيره { فَلَمَّآ } اضطروا إلى ما طلبه أبوهم منهم { آتَوْهُ مَوْثِقَهُمْ } فرضي بإرسال بنيامين معهم ضرورة ثم { قَالَ } أبوهم تأكيداً وتغليظاً وتفويضاً لأمره إلى ربه: { ٱللَّهُ } المطلع لجميع حالات عباده { عَلَىٰ مَا نَقُولُ } ويجري بيننا { وَكِيلٌ } [يوسف: 66] أي: رقيب حفيظ، بفعل بنا على مقتضى علمه وخبرته\n\n\n\n\nثم لما رضي يعقوب عليه السلام بإرسال ابنه بنيامين، فشدوا وخرجوا من عنده، وصى لبنيه أن يتفرقوا عند الدخول إلى مصر، ولا تدخلوا كوكبة واحدة؛ خوفاً منهم أن يعانوا؛ إذ هم ذوو جمال وبهاء، كان الناس يتعجبون منهم حين انصرفوا مجتمعين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { قال لن أرْسِلهُ معكم } لأني رأيت منكم ما رأيت، { حتى تُؤتون موثقاً من الله } حتى تعطوني ما أثق به من عهد الله، وتحلفوا ليَ الأيمان الموثقة { لتأتنني به } في كل حال، { إلا أن يُحاطَ بكم } إلا أن تغلبوا، ولا تطيقوا الإتيان به\n\n\nأو: إلا أن تهلكوا جميعاً ويحيط الموت بكم { فلما آتَوْهُ موثقَهم } عهدهم وحلفوا له، { قال } أبوهم: { الله على ما نقولُ } من طلب الموثق وإتيان الولد { وكيل } أي: مطلع رقيب، لا يغيب عنه شيء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:84",
      "similarity": 0.4310014780069239
    },
    {
      "verse": "4:126",
      "similarity": 0.4189989992010555
    },
    {
      "verse": "57:8",
      "similarity": 0.4059547866327911
    },
    {
      "verse": "48:21",
      "similarity": 0.39335866378966794
    },
    {
      "verse": "20:110",
      "similarity": 0.3901896733863494
    }
  ]
}