{
  "chapter": "يوسف",
  "text": "ولما دخلوا۟ من حيث امرهم ابوهم ما كان يغنى عنهم من الله من شىء الا حاجة فى نفس يعقوب قضىها وانه لذو علم لما علمنه ولكن اكثر الناس لا يعلمون",
  "translations": [
    {
      "translation": "But when they entered as their father said, it did not save them from Allah at all. yet a need in Ya'qub's soul was satisfied. He had knowledge which We had taught him, but most of mankind simply do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered as their father had advised them, nothing could avail them against (the will of) God, yet it confirmed a premonition Jacob had, for verily he had knowledge as We had taught him, though most men do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it so happened that when they entered the city (by many gates) as their father had directed them, this precautionary measure proved ineffective against Allah's will. There was an uneasiness in Jacob's soul which he so tried to remove. Surely he was possessed of knowledge owing to the knowledge that We bestowed upon him. But most people do not know the truth of the matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even though they entered the town as their father had told them, it would not have been of any avail to them against the decree of God. It only served to satisfy Jacob's desire and judgment. He was certainly well versed by Our instruction, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered from the place where their father had commanded them to; that would not at all have saved them against Allah – except that it was Yaqub’s secret wish, which he fulfilled; and indeed he is a possessor of knowledge, due to Our teaching, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered according to their father's advice, it did not avail them in the least against (the will of) Allah; it was but a need of Ya`qub's inner self which he discharged. And verily, he was endowed with knowledge because We had taught him, but most men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had entered as their father had bidden them, it did not avail them aught against Allah, but (it was only) a desire in the soul of Yaqoub which he satisfied; and surely he was possessed of knowledge because We had given him knowledge, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered after the manner their father commanded them, it availed them nothing against God; but it was a need in Jacob's soul that he so satisfied. Verily he was possessed of a knowledge for that We had taught him; but most men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered in the manner which their father had enjoined, it would have naught availed them as against Allah; it was but a need of Jacob's soul which he thus satisfied; and lo! he was a lord of knowledge because We had taught him; but most of mankind know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They entered [safely] as their father had told them. However, he had no power to guard them against God's decree. It was only a wish in Jacob's soul which he had thus fulfilled. He was possessed of knowledge which We had given him. But most people have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered as their father had enjoined them, it availed them not against Allah at all; it was only a craving in the soul of Ya qub that he satisfied; verily he was endued with knowledge, for We had taught him; but most of the people know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered whence their father had bidden them, it did not avail them anything against Allah, but only fulfilled a wish in Jacob’s heart. Indeed, he had the knowledge of what We had taught him, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered in the manner their father had enjoined, it did not profit them in the least against (the plan of) Allah: It was but a necessity of Jacob's soul, which he discharged. For he was, by our instruction, full of knowledge (and experience): but most men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered according to their father's advice, it did not avail them in the least against (the Will of) Allah, it was but a need of Ya'qub's (Jacob) inner-self which he discharged. And verily, he was endowed with knowledge because We had taught him, but most men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered from where their father had instructed them, nothing helped them against (the decree of) Allah. It was but a need in Jacob's soul which he had fulfilled. He possessed knowledge because of what We had taught him, though most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered as their father had instructed them, it did not avail them anything against God; it was just a need in the soul of Jacob, which he carried out. He was a person of knowledge inasmuch as We had taught him, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered from where their father had ordered them, it did not avail them against Allah at all except [it was] a need within the soul of Jacob, which he satisfied. And indeed, he was a possessor of knowledge because of what We had taught him, but most of the people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:68] God, exalted be He, says: And when they entered in the manner which their father had bidden them, that is, separately, it did not avail them anything (min shay’in: min is extra) against God, that is, [against] His decree; it was but a need in Jacob’s soul which he [thus] satisfied, and this [need] was his desire to fend off the evil eye [from them], out of affection [for them]. And verily he was possessed of knowledge, because We had taught him; but most of mankind — and they are the disbelievers — do not know, [about] God’s inspiring His elect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they entered) Egypt (in the manner which their father had enjoined) as their father commanded them, (it would have naught availed them as against Allah) against what Allah had decreed for them; (it was but a need of Jacob's soul) in Jacob's heart (which he thus satisfied) which he expressed; (and lo! He) i.e. Jacob (was a lord of knowledge) of remembrance (because We had taught him) of that which We taught him of legal rulings, punishments, decree and destiny; he knew that nothing happens except what Allah decrees; (but most of mankind) the people of Egypt (know not) this nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا دَخَلُواْ } مصر { مِنْ حَيْثُ أَمَرَهُمْ أَبُوهُم } متفرقين من أبواب متعدد { مَّا كَانَ يُغْنِي عَنْهُمْ } ويدفع تدبير أبيهم { مِّنَ } قضاء { ٱللَّهِ } الذي قدر لهم { مِن شَيْءٍ } إذ الأمر والقضاء لله ولا معقب لحكمه { إِلاَّ } يعني: سوى ما كان { حَاجَةً } تختلج { فِي نَفْسِ يَعْقُوبَ قَضَاهَا } بالوصية لأبنائه تفاؤلاً وتفريجاً { وَإِنَّهُ } أي: يعقوب عليه السلام { لَذُو عِلْمٍ } كامل مفاض له من لدنا، متعلق بما لا مرد لقضائنا، لذلك قال: وما أغني عنكم من الله من شيء، { لِّمَا عَلَّمْنَاهُ } بطريق الوحي والإلهام إياه { وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ } المجبولين على الجهل والنسيان { لاَ يَعْلَمُونَ } [يوسف: 68] أن قضاءنا لا يرد، وأن الحذر لا يغني عن القدر؛ لذلك أصاب بهم ما خفوا عنه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ما كان: جواب \" لما \" ، وإلا حاجة: استثناء منقطع\n وجزاؤه: مبتدأ، ومن: شرطية أو موصولة، وخبرها: فهو جزاؤه، والجملة: خبر جزاء الأول\n أو جزاؤه: مبتدأ ومن خبر، على حذف مضاف، أي: جزاؤه أخذ من وُجد في رحله، وتم الكلام، وفهو جزاؤه: جملة مستقلة تقريرية لما قبلها\n يقول الحق جل جلاله: { ولمّا دخلوا من حيثُ أمرهم ابُوهم } أي: من أبواب متفرقة في البلد، { ما كان يُغني عنهم } أي: ما أغنى عنهم رأي يعقوب واتَّبَاعهم له { من الله من شيء } مما قضى عليهم، فاتُّهموا بالسرقة وظهرت عليهم، فأخذ بنيامين الذي كان الخوف عليه، وتضاعفت المصيبة على يعقوب، { إلا حاجةً }: لكن حاجة { في نفس يعقوب } يعني: شفقته عليهم، وتحرزه من أن يعانوا، { قضاها } أظهرها ووصى بها\n { وإنه لَذُو علم لمَا علمناه } بالوحي ونصب الدليل\n ولذلك قال: { وما أغنى عنكم من الله من شيء } فلم يغتر بتدبيره، ففيه تنزيه ليعقوب عن الوقوف مع الأسباب والعوائد، ورفع إيهام وقوفه مع عالم الحكمة\n { ولكن أكثر الناس لا يعلمون } سر القدر وأنه لا ينفع منه الحذر\n قال ابن عطية: قوله: { ما كان يغني عنهم من الله من شيء } ، معناه: ما درأ عنهم قدراً لأنه لو قَُضِي أن تصيبهم عين لأصابتهم، مفترقين أو مجتمعين\n وإنما طمع يعقوب عليه السلام أن تصادف وصيته القدر في سلامتهم\n ثم أثنى الله ـ عز وجل ـ على يعقوب بأنه لقن مما علمه الله من هذا المعنى، واندرج غيره في ذلك العموم، وقال: إن أكثر الناس ليس كذلك\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:80",
      "similarity": 0.6804272587754929
    },
    {
      "verse": "59:9",
      "similarity": 0.41819721782035524
    },
    {
      "verse": "12:38",
      "similarity": 0.23573316624982943
    },
    {
      "verse": "38:45",
      "similarity": 0.198363307904745
    },
    {
      "verse": "19:6",
      "similarity": 0.1935482825364566
    }
  ]
}