{
  "chapter": "يوسف",
  "text": "ولما دخلوا۟ على يوسف ءاوى اليه اخاه قال انى انا۠ اخوك فلا تبتئس بما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "Then when they entered into Yusuf's presence, he drew his brother close to him and said, 'I am your brother. Do not be distressed concerning all the things they used to do.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they came to Joseph he made his brother his guest, and said: \"I am your brother. So do not grieve for what they had done.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they presented themselves before Joseph, he took his brother aside to himself and said: \"Verily I am your own brother Joseph; so do not grieve over the manner they have treated you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered Joseph's court, he gave lodging to his own brother (Benjamin) and said, \"I am your brother. Do not feel sad about whatever they had done\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered in the company Yusuf, he seated his brother close to him and said, “Be assured, I really am your brother – therefore do not grieve for what they do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they went in before Yusuf, he took his brother (Binyamin) to himself and said: \"Verily, I am your brother, so grieve not for what they used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they went in to Yusuf. he lodged his brother with himself, saying: I am your brother, therefore grieve not at what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered unto Joseph, he said, taking his brother into his arms, 'I am thy brother; so do not despair of that they have done.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they went in before Joseph, he took his brother unto him, saying: Lo! I, even I, am thy brother, therefore sorrow not for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they presented themselves before Joseph, he took his brother [Benjamin] aside. He said, \"I am your brother, so do not feel distressed about whatever they have been doing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered unto Yusuf, he betook his full brother unto himself, and said: verily I am thine own brother Yusuf, so sorrow not over that which they have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered into the presence of Joseph, he set his brother close to himself, and said, ‘Indeed I am your brother, so do not sorrow for what they used to do.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when they came into Joseph's presence, he received his (full) brother to stay with him. He said (to him): \"Behold! I am thy (own) brother; so grieve not at aught of their doings.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they went in before Yusuf (Joseph), he betook his brother (Benjamin) to himself and said: \"Verily! I am your brother, so grieve not for what they used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they presented themselves before Joseph, he took his brother in his arms, and said: 'I am your brother. Do not grieve at what they did'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered into the presence of Joseph, he embraced his brother, and said, “I am your brother; do not be saddened by what they used to do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered upon Joseph, he took his brother to himself; he said, \"Indeed, I am your brother, so do not despair over what they used to do [to me].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:69] And when they entered to Joseph, he took his brother into his arms, saying [to him]: ‘Truly it is me, your brother, therefore do not despair, do not be grieved, at what they did’, in the way of envying us. He commanded him not to tell them anything, and he [Joseph] agreed with him that he would devise a trick to keep him [Benjamin] with him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they went in before Joseph, he took his brother) from both his father and mother (unto himself) he gave audience to his brother Benjamin and made his other brothers wait, (saying: Lo! I, even I, am your brother) in the position of your deceased brother, (therefore sorrow not) do not be saddened (for what they did) for the alienation, insults and vilification you face from your brothers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { آوَىۤ إِلَيْهِ أَخَاهُ } معناه ضَمَّهُ إِليهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {He will come to them from before them} [means that] He will come to them from before them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا دَخَلُواْ عَلَىٰ يُوسُفَ } مع بنيامين، أضافهم وأجلس كل اثنين منهم على سماطٍ، فبقي بنيامين وحيداً، فبكى وتأوى متحسراً، وقال: ألو كان أخي يوسف حياً لما بقيت وحيداً، ولما رأى يوسف حنينه وبكاءه { آوَىۤ إِلَيْهِ أَخَاهُ } ورجع نحوه وضم نفسه إلى نفسه، وأجسله على سماطه، ثم أمر يوسف أن ينزولهم كل أثنين بمنزل احد، فبقي بنيامين لا ثاني له، فاغتم حينئذٍ أشد اغتمام، فذهب به يوسف إلى منزله، فقال له: أتحب أن أكون أخاك بدل أخيك الهالك؟ قال: فمن يجد مثلك أخاً، غير أنك لم يلدك يعقوب ولا راحيل\n\n\n\n\nثم لما رأى يوسف زيادة همه وحزنه وكثرة تأسفه وغمه { قَالَ } لا تحزن ولا تغتم { إِنِّيۤ } بشخصي { أَنَاْ أَخُوكَ } يوسف بن يعقوب وراحيل، قد احتال عليَّ اخوتك وخادعوني بأنواع الحيل والخداع إلى أن فرقوا بيني وبينك وبين أبي مدة مديدة حسداً، فأنقذني الله عن مكرهم وكيدهم، وخلصني عن قيد الرقية والسجن وأنواع المحن ورفع قدري ومكانتي وشرفني برؤيتك، وأعطاني من المكرمات ما لا يحصى { فَلاَ تَبْتَئِسْ } ولا تحزن يا أخي { بِمَا كَانُواْ يَعْمَلُونَ } [يوسف: 59] معي ومعك من أنواع الصغار والهوان وأصناف الأذيات\n\n\n\n\nثم لما قرت عينا بنيامين بوجه يوسف وسر قلبه لقياه بعدما آيس وقنط، قال: يا أخي لا أفارقك أبداً، قال يوسف؛ لا يتيسر هذا إلا بعد أن أتهمك بتهمة، فأخذك لأجلها إن رضيت، قال: رضيت بأي تهمة اتهمتني بها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ولما دخلوا على يوسفَ آوى إليه أخاه } أي: ضم إليه بنيامين على الطعام، أو في المنزل\n رُوي أنه أضافهم، فأجلسهم اثنين اثنين، فبقي بنيامين وحيداً فبكى، وقال: لو كان يوسف حياً لجلس معي، فأجلسه معه على مائدته، ثم قال: لينزل كل اثنين بيتاً، وهذا لا ثاني له فيكون معي، فبات عنده، وقال له: أتحب أن أكون أخاك بدل أخيك الهالك؟ قال: من يجد إذاً مثلك، ولكن لم يلدك يعقوب ولا راحيل، { قال إني أنا أخوك } وعرفه بنفسه، { فلا تبتئس } ولا تحزن { بما كانوا يعملون } في حقنا من الأذى، أو: لا تحزن بما يعمله فتياني، ولا تبالي بما تراه في تحيُّلي في أخذك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:7",
      "similarity": 0.5626268798410231
    },
    {
      "verse": "12:58",
      "similarity": 0.541071635492272
    },
    {
      "verse": "12:89",
      "similarity": 0.4427886583991208
    },
    {
      "verse": "12:99",
      "similarity": 0.4113053527511861
    },
    {
      "verse": "79:41",
      "similarity": 0.37622603848094194
    }
  ]
}