{
  "chapter": "يوسف",
  "text": "وقال يبنى لا تدخلوا۟ منۢ باب وحد وادخلوا۟ من ابوب متفرقة وما اغنى عنكم من الله من شىء ان الحكم الا لله عليه توكلت وعليه فليتوكل المتوكلون",
  "translations": [
    {
      "translation": "He said, 'My sons! You must not enter through a single gate. Go in through different gates. But I cannot save you from Allah at all, for judgement comes from no one but Allah. In Him I put my trust, and let all those who put their trust, put it in Him alone.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As they were leaving) their father said to them: \"O my sons, do not seek one approach but employ different ways (of attaining your object). If anything should befall you from God I shall not be able to avert it, for all authority belongs to God. I have placed my trust in Him, and the trusting should rely on Him alone.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he enjoined them: \"My sons! Do not enter the city by one gate; rather enter it by different gates. I can be of no help to you against Allah. Allah's command alone prevails. In Him have I put my trust and in Him should all those who have faith put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jacob then told his sons, \"Do not enter the town all together by a single gate, but each of you enter separately. I cannot help you against (the decree of) God. Everyone's destiny is in His hands. I put my trust in Him. Whoever needs a trustee must put his trust in God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, “O my sons! Do not enter all by one gate – and enter by different gates; I cannot save you against Allah; there is no command but that of Allah; upon Him do I rely; and all those who trust, must rely only upon Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: \"O my sons! Do not enter by one gate, but enter by different gates, and I cannot avail you against Allah at all. Verily, the decision rests only with Allah. In Him, I put my trust and let all those that trust, put their trust in Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: O my sons! do not (all) enter by one gate and enter by different gates and I cannot avail you aught against Allah; judgment is only Allah's; on Him do I rely, and on Him let those who are reliant rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He also said, 'O my sons, enter not by one door; enter by separate doors. Yet I cannot avail you anything against God; judgment belongs not to any but God. In Him I have put my trust; and in Him let all put their trust who put their trust.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: O my sons! Go not in by one gate; go in by different gates. I can naught avail you as against Allah. Lo! the decision rests with Allah only. In Him do I put my trust, and in Him let all the trusting put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my sons! Do not all of you enter [the city] by one gate; enter by separate gates. I cannot help you in any way against God; judgement is His alone. In Him I have put my trust. In Him let the faithful put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: my sons! enter not by one gate but enter by different gates; and I cannot avail you against Allah at all: judgment is but Allah's; on Him I rely, and on Him let the relying rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, ‘My sons, do not enter by one gate, but enter by separate gates, though I cannot avail you anything against Allah. Sovereignty belongs only to Allah. In Him I have put my trust; and in Him let all the trusting put their trust.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Further he said: \"O my sons! enter not all by one gate: enter ye by different gates. Not that I can profit you aught against Allah (with my advice): None can command except Allah: On Him do I put my trust: and let all that trust put their trust on Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: \"O my sons! Do not enter by one gate, but enter by different gates, and I cannot avail you against Allah at all. Verily! The decision rests only with Allah. In him, I put my trust and let all those that trust, put their trust in Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he said: 'My sons, do not enter from one gate. Enter through different gates. I cannot be of any help to you against Allah; judgement belongs to Allah alone. In Him I have put my trust. In Him let all put their trust'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, “O my sons, do not enter by one gate, but enter by different gates. I cannot avail you anything against God. The decision rests only with God. On Him I rely, and on Him let the reliant rely.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, \"O my sons, do not enter from one gate but enter from different gates; and I cannot avail you against [the decree of] Allah at all. The decision is only for Allah; upon Him I have relied, and upon Him let those who would rely [indeed] rely.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:67] And he said, ‘O my sons, do not enter, Egypt, by one gate, but enter by separate gates, lest the evil eye smite you. Yet I cannot avail, protect, you, by this that I have said, against God (min Allāhi: min is extra) anything, which He might have decreed against you; this [that I have said] is only out of affection [for you]. Judgement belongs to God, alone. On Him I rely, in Him I trust, and on Him let all the trusting rely’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ وقال يا بني } عطف على جملة { قال الله على ما نقول وكيل } \\[ يوسف : 66 \\].وإعادة فعل { قال } للإشارة إلى اختلاف زمن القولين وإن كانا معاً مسبّبَيْن على إيتاء موثقهم ، لأنه اطمأن لرعايتهم ابنَه وظهرت له المصلحة في سفرهم للإمتار ، فقوله : { يا بني لا تدخلوا من باب واحد } صادر في وقت إزمَاعهم الرحيل . والمقصود من حكاية قوله هذا العبرة بقوله : { وما أغني عنكم من الله من شيء } الخ .والأبواب : أبواب المدينة . وتقدم ذكر الباب آنفاً . وكانت مدينة ( منفيس ) من أعظم مدن العالم فهي ذات أبواب . وإنما نهاهم أن يدخلوها من باب واحد خشية أن يسترعي عددهم أبصارَ أهل المدينة وحُراسها وأزياؤهم أزياء الغرباء عن أهل المدينة أن يُوجسوا منهم خيفة من تجسس أو سرقة فربما سجنوهم أو رصدوا الأعين إليهم ، فيكون ذلك ضرّاً لهم وحائلاً دون سرعة وصولهم إلى يوسف عليه السلام ودون قضاء حاجتهم . وقد قيل في الحكمة : «استعينوا على قضاء حوائجكم بالكتمان» .ولما كان شأن إقامة الحراس والأرصاد أن تكون على أبواب المدينة اقتصر على تحذيرهم من الدخول من باب واحد دون أن يحذرهم من المشي في سكة واحدة من سكك المدينة ، ووثق بأنهم عارفون بسكك المدينة فلم يخش ضلالهم فيها ، وعلم أن ( بنيامِين ) يكون في صحبة أحد إخوته لئلا يضل في المدينة .والمتفرقة أراد بها المتعددة لأنه جعلها في مقابلة الواحد . ووجه العدول عن المتعددة إلى المتفرقة الإيماء إلى علة الأمر وهي إخفاء كونهم جماعة واحدة .وجملة { وما أغني عنكم من الله من شيء } معترضة في آخر الكلام ، أي وما أغني عنكم بوصيتي هذه شيئاً . و { من الله } متعلق ب { أغني } ، أي لا يكون ما أمرتكم به مُغنياً غَنَاء مبتدِئاً من عند الله بل هو الأدب والوقوف عندما أمر الله ، فإنْ صادف ما قدره فقد حصل فائدتان ، وإن خالف ما قَدّره حصلت فائدة امتثال أوامره واقتناع النفس بعدم التفريط .وتقدم وجه تركيب { وما أغني عنكم من الله من شيء } عند قوله تعالى : { ومن يرد الله فتنته فلن تملك له من الله شيئاً } في سورة العقود ( 41 ).وأراد بهذا تعليمهم الاعتماد على توفيق الله ولطفه مع الأخذ بالأسباب المعتادة الظاهرة تأدباً مع واضع الأسباب ومقدّر الألطاف في رعاية الحالين ، لأنا لا نستطيع أن نطلع على مراد الله في الأعمال فعلينا أن نتعرفها بعلاماتها ولا يكون ذلك إلا بالسعي لها .وهذا سرّ مسألة القدر كما أشار إليه قول النبي اعمَلوا فكلٌ ميسّر لما خلق له ، وفي الأثر إذا أراد الله أمراً يَسّر أسبابه قال الله تعالى : { ومن أراد الآخرة وسعى لها سعيها وهو مؤمن فأولئك كان سعيهم مشكوراً } \\[ سورة الإسراء : 19 \\]. ذلك أن شأن الأسباب أن تحصُل عندها مسبباتها . وقد يتخلف ذلك بمعارضة أسباب أخرى مضادة لتلك الأسباب حاصلة في وقت واحد ، أو لكون السبب الواحد قد يكون سبباً لأشياء متضادة باعتبارات فيخطىء تعَاطي السبب في مصادفة المسبّب المقصود ، ولولا نظام الأسباب ومراعاتها لصار المجتمع البشري هملاً وهمجاً .والإغناء : هنا مشتق من الغَناء بفتح الغين وبالمدّ ، وهو الإجزاء والاضطلاع وكفاية المهم ، وأصله مرادف الغِنى بكسر الغين والقصر وهما معاً ضد الفقر ، وكثر استعمال الغناء المفتوح الممدود في الإجزاء والكفاية على سبيل المجاز المرسل لأن من أجزأ وكفى فقد أذهب عن نفسه الحَاجة إلى المغنين وأذهب عمن أجزأ عنه الاحتياج أيضاً ، وشاع هذا الاستعمال المجازي حتى غلب على هذا الفعل ، فلذلك كثر في الكلام تخصيص الغَناء بالفتح والمد بهذا المعنى ، وتخصيص الغِنى بالكسر والقصر في معنى ضد الفقر ونحوه حتى صار الغَناء الممدود لا يكاد يسمع في معنى ضد الفقر . وهي تفرقة حسنة من دقائق استعمالهم في تصاريف المترادفات . فما يوجد في كلام ابن بري من قوله : إن الغناء مصدر ناشىء عن فعل أغنى المهموز بحذف الزائد الموهم أنه لا فِعل له مجرّد فإنما عَنى به أن استعمال فِعل غَنِيَ في هذا المعنى المجازي متروك مُمات لا أنه ليس له فعل مجرد .ولذلك فمعنى فعل ( أغنى ) بهذا الاستعمال معنى الأفعال القاصرة ، ولم يفده الهمز تعديةً ، فلعل همزته دالة على الصيرورة ذا غنى ، فلذلك كان حقه أن لا ينصب المفعول به بل يكون في الغالب مرادفاً لِمفعول مطلق كقول عمرو بن معديكرب:أُغْني غَناء الذاهب ...ين أُعَدُّ للحدثان عَدّا ... ويقولون : أغنى فلان عن فلان ، أي في أجزاه عوضه وقام مقامه ، ويأتون بمنصوب فهو تركيب غريب ، فإن حرف ( عن ) فيه للبدلية وهي المجاوزة المجازية . جعل الشيء البدل عن الشيء مجاوزاً له لأنه حلّ محلّه في حال غيبته فكأنه جاوزه فسموا هذه المجاوزة بدلية وقالوا : إنّ ( عن ) تجيء للبدلية كما تجيء لها الباء . فمعنى ما أغني عنكم } لا أجزي عنكم ، أي لا أكفي بدلاً عن إجزائكم لأنفسكم .و { من شيء } نائب مناب شيئاً ، وزيدت { من } لتوكيد عموم شيء في سياق النفي ، فهو كقوله تعالى : { لا تغني عني شفاعتهم شيئاً } \\[ سورة يس : 23 \\] أي من الضرّ . وجوز صاحب الكشاف في مثله أن يكون شيئاً } مفعولاً مطلقاً ، أي شيئاً من الغناء وهو الظاهر ، فقال في قوله تعالى : { واتقوا يوماً لا تجزي نفس عن نفس شيئاً } \\[ سورة البقرة : 48 \\] ، قال : أي قليلاً من الجزاء ، كقوله تعالى : { ولا يظلمون شيئاً } لكنه جوز أن يكون { شيئاً } مفعولاً به وهو لا يستقيم إلا على معنى التوسع بالحذف والإيصال ، أي بنزع الخافض .وجملة { إن الحكم إلا لله } في موضع التعليل لمضمون { وما أغني عنكم من الله من شيء }.والحكم : هنا بمعنى التصرف والتقدير ، ومعنى الحصر أنه لا يتم إلا ما أراده الله ، كما قال تعالى : { إن الله بالغٌ أمره } \\[ سورة الطلاق : 3 \\]. وليس للعبد أن ينازع مراد الله في نفس الأمر ولكن واجبه أن يتطلب الأمور من أسبابها لأن الله أمر بذلك ، وقد جمع هذين المعنيين قوله : وادخلوا من أبواب متفرقة وما أغني عنكم من الله من شيء }.وجملة { عليه توكلت وعليه فليتوكل المتوكلون } في موضع البيان لِجملة { وما أغني عنكم من الله من شيء } ليبين لهم أن وصيته بأخذ الأسباب مع التنبيه على الاعتماد على الله هو معنى التوكّل الذي يَضل في فهمه كثير من الناس اقتصاراً وإنكاراً ، ولذلك أتى بجملة { وعليه فليتوكل المتوكلون } أمراً لهم ولغيرهم على معنى أنه واجب الحاضرين والغائبين ، وأن مقامه لا يختص بالصدّيقين بل هو واجب كل مؤمن كامل الإيمان لا يخلط إيمانه بأخطاء الجاهليات .\n\n",
      "translations": [
        {
          "translation": "(And he said) to them: (0 my sons! Go not in by one gate) do not go in through the same road; (go in by different gates) go in by different roads. (I can naught avail you as against Allah) against Allah's decree concerning you. (Lo! the decision) the judgement regarding what is decreed for you (rests with Allah only. In Him do I put my trust) I delegate my matter and yours to Him, (and in Him let all the trusting put their trust) those who rely should rely on Him; it is also said that this means: the believers should put their trust in Allah. Here, Jacob feared the evil eye against his sons, because they were all seemly and handsome.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ لا تدخلوا من باب واحد } أي: لا تسلكوا طريق فضيلة واحدة كالسخاوة مثلاً دون الشجاعة أو لا تسيروا على وصف واحد من أوصاف الله تعالى فإن حضرة الوحدة هي منشأ جميع الفضائل والذات الأحدية مبدأ جميع الصفات، فاسلكوا طرق جميع الفضائل المتفرّقة حتى تتصفوا بالعدالة فتتطرّقوا إلى الحضرة الواحدية، وسيروا على جميع الصفات حتى يكشف لكم عن الذات. وقد ورد في الحديث: إن الله تعالى يتجلى على أهل المذاهب يوم القيامة في صورة معتقدهم فيعرفونه ثم يتحوّل إلى صورة أخرى فينكرونه { وما أُغني عنكم من الله من شيء } أي: لا أدفع عنكم شيئاً إن منعكم توفيقه وحجبكم ببعض الحجب عن كمالاتكم فإن العقل ليس إليه إلا إفاضة العلم لا إجادة الاستعداد ورفع الحجاب.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَ يٰبَنِيَّ لاَ تَدْخُلُواْ } على البلدة { مِن بَابٍ وَاحِدٍ } مجتمعين { وَٱدْخُلُواْ مِنْ أَبْوَابٍ مُّتَفَرِّقَةٍ } فرادى\n حتى لا تتضرروا من العيون اللامة { وَ } اعلموا أني { مَآ أُغْنِي } وأدفع بقولي لكم هذا { عَنكُمْ مِّنَ } قضاء { ٱللَّهِ مِن شَيْءٍ إِنِ ٱلْحُكْمُ } أي: ما الحكم والأمر { إِلاَّ للَّهِ عَلَيْهِ } لا على غيره من الأظلال { تَوَكَّلْتُ وَعَلَيْهِ } في كل الامور { فَلْيَتَوَكَّلِ ٱلْمُتَوَكِّلُونَ } [يوسف: 67] إذ لا رجوع للكل إلا إليه\n\n\n{ وَلَمَّا دَخَلُواْ } مصر { مِنْ حَيْثُ أَمَرَهُمْ أَبُوهُم } متفرقين من أبواب متعدد { مَّا كَانَ يُغْنِي عَنْهُمْ } ويدفع تدبير أبيهم { مِّنَ } قضاء { ٱللَّهِ } الذي قدر لهم { مِن شَيْءٍ } إذ الأمر والقضاء لله ولا معقب لحكمه { إِلاَّ } يعني: سوى ما كان { حَاجَةً } تختلج { فِي نَفْسِ يَعْقُوبَ قَضَاهَا } بالوصية لأبنائه تفاؤلاً وتفريجاً { وَإِنَّهُ } أي: يعقوب عليه السلام { لَذُو عِلْمٍ } كامل مفاض له من لدنا\n متعلق بما لا مرد لقضائنا\n لذلك قال: وما أغني عنكم من الله من شيء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إن الحُكم إلا لله } فما حكم به عليكم لا ترده حيلة\n { عليه توكلتُ وعليه فليتوكل المتوكلون } أي: ما وثقت إلا به\n ولا ينبغي أن يثق أحد إلا به\n وإنما كرر حذف الجر زيادة في الاختصاص ترغيباً في التوكل على الله والتوثق به\n  الإشارة: رُوي أن إخوة يوسف لما رجعوا عنه صاروا لا ينزلون منزلاً إلا أقبل عليهم أهل ذلك المنزل بالكرامات والضيافات\n فقال شمعون: لما قدمنا إلى مصر ما التفت إلينا أحد\n فلما رجعنا صار الناس كلهم يكرموننا؟ فقال يهوذا: الآن أثر الملك عليكم\n ونور حضرته قد لاح عليكم\n هـ\n قلت: وكذلك من قصد حضرة العارفين لا يرجع إلا محفوفاً بالأنوار\n معموراً بالأسرار\n مقصوداً بالكرامة والإبرار\n قوله تعالى: { فأرسل معنا أخانا\n\n\n } إلخ قال الأستاذ القشيري: المحبة غيورٌ لما كان ليعقوب تَسَلٍّ عن يوسف برؤية بنيامين\n أبت المحبة إلا أن تظهر سُلطانها بالكمال فغارت على بنيامين أن ينظر إليه يعقوب بعين يوسف\n هـ\n قلت: وكذلك الحق تعالى غيور أن يرى في قلب حبيبه شيئاً غيره\n فإذا رأى أزاله عنه\n وفرق بينه وبين ذلك الشيء\n حتى لا يُحب شيئاً سوى محبوبه\n هذا مما يجده أهل الأذواق في قلوبهم\n  وقوله تعالى في وصية يعقوب: { لا تدخلوا من باب واحد } \n فيه إشارة إلى أن الدخول على الله لا يكون من باب واحد بحيث يلتزم المريد حالة واحدة وطريقة واحدة كالعزلة فقط\n أو الخلطة فقط\n أو الصمت على الدوام\n أو ذكر الاسم على الدوام\n\nبل لا بد من التلوين قبل التمكين وبعده فالعزلة على الدوام: مقام الضعف\n والخلطة من غير عزلة بطالة\n بل لا يكون عارفاً حتى يعرف الله\n ويكون قلبُه معه في العزلة والخلطة\n والصمت والكلام\n والقبض والبسط\n والفقد والوجد\n ويترقى من ذكر الاسم إلى الفكرة والنظرة\n كما هو عند أهل الفن\n  وقوله تعالى: { عليه توكلت وعليه فليتوكل المتوكلون } \n فيه تهييج على مقام التوكل\n وحث على الثقة بالله في جميع الأمور\n وفي ذلك يقول الشاعر:\nقوله: \" والخلق أربع \" أراد العالم العلوي والسفلي\n والدنيا والآخرة\n وكلها أكوان مخلوقة يجب كف البصر والبصيرة عن الميل إليها\n والوقوف معها\n والله تعالى أعلم\n ثم ذكر رجوعهم إلى مصر\n واتصال يوسف بأخيه\n وإمساكه عنده إلى أن اتصل بأبيه\n فقال: { وَلَمَّا دَخَلُواْ مِنْ حَيْثُ أَمَرَهُمْ أَبُوهُم }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:23",
      "similarity": 0.5044990244645404
    },
    {
      "verse": "78:19",
      "similarity": 0.39762195008733014
    },
    {
      "verse": "4:130",
      "similarity": 0.3398582276580746
    },
    {
      "verse": "39:72",
      "similarity": 0.3390495117181285
    },
    {
      "verse": "16:29",
      "similarity": 0.33706222602586033
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012067.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012067.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:67.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}