{
  "chapter": "يوسف",
  "text": "وقال يبنى لا تدخلوا۟ منۢ باب وحد وادخلوا۟ من ابوب متفرقة وما اغنى عنكم من الله من شىء ان الحكم الا لله عليه توكلت وعليه فليتوكل المتوكلون",
  "translations": [
    {
      "translation": "He said, 'My sons! You must not enter through a single gate. Go in through different gates. But I cannot save you from Allah at all, for judgement comes from no one but Allah. In Him I put my trust, and let all those who put their trust, put it in Him alone.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As they were leaving) their father said to them: \"O my sons, do not seek one approach but employ different ways (of attaining your object). If anything should befall you from God I shall not be able to avert it, for all authority belongs to God. I have placed my trust in Him, and the trusting should rely on Him alone.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he enjoined them: \"My sons! Do not enter the city by one gate; rather enter it by different gates. I can be of no help to you against Allah. Allah's command alone prevails. In Him have I put my trust and in Him should all those who have faith put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jacob then told his sons, \"Do not enter the town all together by a single gate, but each of you enter separately. I cannot help you against (the decree of) God. Everyone's destiny is in His hands. I put my trust in Him. Whoever needs a trustee must put his trust in God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, “O my sons! Do not enter all by one gate – and enter by different gates; I cannot save you against Allah; there is no command but that of Allah; upon Him do I rely; and all those who trust, must rely only upon Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: \"O my sons! Do not enter by one gate, but enter by different gates, and I cannot avail you against Allah at all. Verily, the decision rests only with Allah. In Him, I put my trust and let all those that trust, put their trust in Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: O my sons! do not (all) enter by one gate and enter by different gates and I cannot avail you aught against Allah; judgment is only Allah's; on Him do I rely, and on Him let those who are reliant rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He also said, 'O my sons, enter not by one door; enter by separate doors. Yet I cannot avail you anything against God; judgment belongs not to any but God. In Him I have put my trust; and in Him let all put their trust who put their trust.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: O my sons! Go not in by one gate; go in by different gates. I can naught avail you as against Allah. Lo! the decision rests with Allah only. In Him do I put my trust, and in Him let all the trusting put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my sons! Do not all of you enter [the city] by one gate; enter by separate gates. I cannot help you in any way against God; judgement is His alone. In Him I have put my trust. In Him let the faithful put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: my sons! enter not by one gate but enter by different gates; and I cannot avail you against Allah at all: judgment is but Allah's; on Him I rely, and on Him let the relying rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, ‘My sons, do not enter by one gate, but enter by separate gates, though I cannot avail you anything against Allah. Sovereignty belongs only to Allah. In Him I have put my trust; and in Him let all the trusting put their trust.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Further he said: \"O my sons! enter not all by one gate: enter ye by different gates. Not that I can profit you aught against Allah (with my advice): None can command except Allah: On Him do I put my trust: and let all that trust put their trust on Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said: \"O my sons! Do not enter by one gate, but enter by different gates, and I cannot avail you against Allah at all. Verily! The decision rests only with Allah. In him, I put my trust and let all those that trust, put their trust in Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he said: 'My sons, do not enter from one gate. Enter through different gates. I cannot be of any help to you against Allah; judgement belongs to Allah alone. In Him I have put my trust. In Him let all put their trust'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, “O my sons, do not enter by one gate, but enter by different gates. I cannot avail you anything against God. The decision rests only with God. On Him I rely, and on Him let the reliant rely.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he said, \"O my sons, do not enter from one gate but enter from different gates; and I cannot avail you against [the decree of] Allah at all. The decision is only for Allah; upon Him I have relied, and upon Him let those who would rely [indeed] rely.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:67] And he said, ‘O my sons, do not enter, Egypt, by one gate, but enter by separate gates, lest the evil eye smite you. Yet I cannot avail, protect, you, by this that I have said, against God (min Allāhi: min is extra) anything, which He might have decreed against you; this [that I have said] is only out of affection [for you]. Judgement belongs to God, alone. On Him I rely, in Him I trust, and on Him let all the trusting rely’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he said) to them: (0 my sons! Go not in by one gate) do not go in through the same road; (go in by different gates) go in by different roads. (I can naught avail you as against Allah) against Allah's decree concerning you. (Lo! the decision) the judgement regarding what is decreed for you (rests with Allah only. In Him do I put my trust) I delegate my matter and yours to Him, (and in Him let all the trusting put their trust) those who rely should rely on Him; it is also said that this means: the believers should put their trust in Allah. Here, Jacob feared the evil eye against his sons, because they were all seemly and handsome.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَ يٰبَنِيَّ لاَ تَدْخُلُواْ } على البلدة { مِن بَابٍ وَاحِدٍ } مجتمعين { وَٱدْخُلُواْ مِنْ أَبْوَابٍ مُّتَفَرِّقَةٍ } فرادى\n حتى لا تتضرروا من العيون اللامة { وَ } اعلموا أني { مَآ أُغْنِي } وأدفع بقولي لكم هذا { عَنكُمْ مِّنَ } قضاء { ٱللَّهِ مِن شَيْءٍ إِنِ ٱلْحُكْمُ } أي: ما الحكم والأمر { إِلاَّ للَّهِ عَلَيْهِ } لا على غيره من الأظلال { تَوَكَّلْتُ وَعَلَيْهِ } في كل الامور { فَلْيَتَوَكَّلِ ٱلْمُتَوَكِّلُونَ } [يوسف: 67] إذ لا رجوع للكل إلا إليه\n\n\n{ وَلَمَّا دَخَلُواْ } مصر { مِنْ حَيْثُ أَمَرَهُمْ أَبُوهُم } متفرقين من أبواب متعدد { مَّا كَانَ يُغْنِي عَنْهُمْ } ويدفع تدبير أبيهم { مِّنَ } قضاء { ٱللَّهِ } الذي قدر لهم { مِن شَيْءٍ } إذ الأمر والقضاء لله ولا معقب لحكمه { إِلاَّ } يعني: سوى ما كان { حَاجَةً } تختلج { فِي نَفْسِ يَعْقُوبَ قَضَاهَا } بالوصية لأبنائه تفاؤلاً وتفريجاً { وَإِنَّهُ } أي: يعقوب عليه السلام { لَذُو عِلْمٍ } كامل مفاض له من لدنا\n متعلق بما لا مرد لقضائنا\n لذلك قال: وما أغني عنكم من الله من شيء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم وصاهم { وقال } لهم: { يا بَنيّ لا تدخلوا من بابٍ واحدٍ وادخلوا من أبواب متفرقةٍ }\n وكانت في ذلك العهد خمساً: باب الشام، وباب المغرب، وباب اليمن، وباب الروم، وباب طَيْلون\n فقال لهم: ليدخل كل أخوين من باب، خاف عليهم العين لأنهم أهل جمال وأُبَّهة، مشتهرين في مصر بالقربة والكرامة فإذا دخلوا كبكبة واحدة أصابتهم العين\n ولعل لم يوصهم بذلك في المرة الأولى لأنهم كانوا مجهولين حينئذٍ، وللنفس آثار من العين، وقد قال عليه الصلاة والسلام:\n\n \" العَينُ حَقٌّ تُدخِل الرَّجُلَ القَبرَ والجَمَلَ القِدرَ \"\n \n\nوكان عليه الصلاة والسلام يتعوذ منها، بقوله:\n\n \" اللهم إنِّي أَعُوذ بك مِن كَلِّ نَفسٍ هَامَّةٍ، وعَينٍ لامَّةٍ \" \n\nيؤخذ من الآية والحديث: التحصن منها قياماً برسم الحكمة\n والأمر كله بيد الله\n ولذلك قال يعقوب عليه السلام: { وما أغني عنكم من الله من شيء } مما قُضي عليكم بما أشرت به عليكم، والمعنى: أن ذلك لا يدفع من قدر الله شيئاً، فإن الحذر لا يمنع القدر، { إن الحُكم إلا لله } فما حكم به عليكم لا ترده حيلة، { عليه توكلتُ وعليه فليتوكل المتوكلون } أي: ما وثقت إلا به، ولا ينبغي أن يثق أحد إلا به\n وإنما كرر حذف الجر زيادة في الاختصاص ترغيباً في التوكل على الله والتوثق به\n  الإشارة: رُوي أن إخوة يوسف لما رجعوا عنه صاروا لا ينزلون منزلاً إلا أقبل عليهم أهل ذلك المنزل بالكرامات والضيافات، فقال شمعون: لما قدمنا إلى مصر ما التفت إلينا أحد، فلما رجعنا صار الناس كلهم يكرموننا؟ فقال يهوذا: الآن أثر الملك عليكم، ونور حضرته قد لاح عليكم\n هـ\n قلت: وكذلك من قصد حضرة العارفين لا يرجع إلا محفوفاً بالأنوار، معموراً بالأسرار، مقصوداً بالكرامة والإبرار\n قوله تعالى: { فأرسل معنا أخانا\n\n\n } إلخ قال الأستاذ القشيري: المحبة غيورٌ لما كان ليعقوب تَسَلٍّ عن يوسف برؤية بنيامين، أبت المحبة إلا أن تظهر سُلطانها بالكمال فغارت على بنيامين أن ينظر إليه يعقوب بعين يوسف\n هـ\n قلت: وكذلك الحق تعالى غيور أن يرى في قلب حبيبه شيئاً غيره، فإذا رأى أزاله عنه، وفرق بينه وبين ذلك الشيء، حتى لا يُحب شيئاً سوى محبوبه\n هذا مما يجده أهل الأذواق في قلوبهم\n  وقوله تعالى في وصية يعقوب: { لا تدخلوا من باب واحد } ، فيه إشارة إلى أن الدخول على الله لا يكون من باب واحد بحيث يلتزم المريد حالة واحدة وطريقة واحدة كالعزلة فقط، أو الخلطة فقط، أو الصمت على الدوام، أو ذكر الاسم على الدوام\n\n\nبل لا بد من التلوين قبل التمكين وبعده فالعزلة على الدوام: مقام الضعف، والخلطة من غير عزلة بطالة\n بل لا يكون عارفاً حتى يعرف الله، ويكون قلبُه معه في العزلة والخلطة، والصمت والكلام، والقبض والبسط، والفقد والوجد، ويترقى من ذكر الاسم إلى الفكرة والنظرة، كما هو عند أهل الفن\n  وقوله تعالى: { عليه توكلت وعليه فليتوكل المتوكلون } ، فيه تهييج على مقام التوكل، وحث على الثقة بالله في جميع الأمور\n وفي ذلك يقول الشاعر:\n\nقوله: \" والخلق أربع \" أراد العالم العلوي والسفلي، والدنيا والآخرة\n وكلها أكوان مخلوقة يجب كف البصر والبصيرة عن الميل إليها، والوقوف معها\n والله تعالى أعلم\n ثم ذكر رجوعهم إلى مصر، واتصال يوسف بأخيه، وإمساكه عنده إلى أن اتصل بأبيه، فقال: { وَلَمَّا دَخَلُواْ مِنْ حَيْثُ أَمَرَهُمْ أَبُوهُم }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:23",
      "similarity": 0.5044990244645404
    },
    {
      "verse": "78:19",
      "similarity": 0.39762195008733014
    },
    {
      "verse": "4:130",
      "similarity": 0.3398582276580746
    },
    {
      "verse": "39:72",
      "similarity": 0.3390495117181285
    },
    {
      "verse": "16:29",
      "similarity": 0.33706222602586033
    }
  ]
}