{
  "chapter": "يوسف",
  "text": "فلما رجعوا۟ الى ابيهم قالوا۟ يابانا منع منا الكيل فارسل معنا اخانا نكتل وانا له لحفظون",
  "translations": [
    {
      "translation": "Then when they got back to their father's house, they said, 'Father! Our measure will be denied. Please send our brother with us so we may obtain our measure. We will take care of him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they returned to their father, they said: \"O father, a further measure has been denied us. So send our brother with us that he may bring more grain. We shall take care of him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they returned to their father they said: \"Father! We have been denied further supply of corn. So send with us our brother that we may bring the supplies. We shall be responsible for his protection.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they returned to their father, they told him, \"Father, (unless we take our brother) they will refuse us one further measure of grain. Send our brother with us so that we can obtain that measure. We shall watch over him carefully\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they returned to their father, they said, “O our father! The provisions have been denied to us, therefore send our brother with us so that we may bring the provisions, and we will surely protect him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they returned to their father, they said: \"O our father! No more measure of grain shall we get (unless we take our brother). So send our brother with us, and we shall get our measure and truly, we will guard him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they returned to their father, they said: O our father, the measure is withheld from us, therefore send with us our brother, (so that) we may get the measure, and we will most surely guard him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they had returned to their father, they said, 'Father, the measure was denied to us; so send with us our brother, that we may obtain the measure; surely we shall be watching over him.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they went back to their father they said: O our father! The measure is denied us, so send with us our brother that we may obtain the measure, surely we will guard him well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they returned to their father, they said, \"Our father, any [further] measure of grain has been denied us, so send our brother [Benjamin] along with us, so that we may obtain our measure [of grain]; and, we shall guard him well.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they returned to their father, they said: our father! the measuring hath been denied us, wherefore send thou with us our brother, and we shall get our measure; and verily we shall be his guards.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they returned to their father, they said, ‘Father, the measure has been withheld from us, so let our brother go with us so that we may obtain the measure, and we will indeed take [good] care of him.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when they returned to their father, they said: \"O our father! No more measure of grain shall we get (unless we take our brother): So send our brother with us, that we may get our measure; and we will indeed take every care of him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they returned to their father, they said: \"O our father! No more measure of grain shall we get (unless we take our brother). So send our brother with us, and we shall get our measure and truly we will guard him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they returned to their father, they said: 'Father, we have been denied the measure. Send our brother with us and we shall receive our measure. We will indeed look after him'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they returned to their father, they said, “O father, we were denied measure, but send our brother with us, and we will obtain measure. We will take care of him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they returned to their father, they said, \"O our father, [further] measure has been denied to us, so send with us our brother [that] we will be given measure. And indeed, we will be his guardians.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:63] So when they went back to their father, they said, ‘O father, the measure will be denied us, unless you send forth our brother to him [to the Court officer]; so send forth our brother with us, that we may obtain the measure (read naktal or yaktal, ‘that he may obtain the measure [for us’]). Surely we will guard him well’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So when they went back to their father) in the land of Canaan (they said: our father! The measure is denied us) in the future if you do not send Benjamin with us, (so send with us our brother) Benjamin (that we may obtain the measure) so that he can buy a measure for himself; or: that we may buy a measure for him, according to a different reading, (surely we will guard him well) we guarantee to bring him back to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا رَجَعُوا } من مصر { إِلَىٰ أَبِيهِمْ } حكوا ما جرى بينهم وبين العزيز من الحكايات التي مضت\n ثم طلبه منهم ما يصدقهم ويشهد لهم واضطرارهم من الشاهد وأمرهم العزيز بإحضار أخيهم بنيامين\n ليكون مصدقاً لهم\n ثم بعدما بسطوا الكلام عند أبيهم { قَالُواْ يٰأَبَانَا مُنِعَ مِنَّا ٱلْكَيْلُ } بعد اليوم لو لم ترسل معنا بنيامين { فَأَرْسِلْ مَعَنَآ أَخَانَا } ليكون مصدقاٌ لنا عند العزيز وبعد تصديقه إيانا { نَكْتَلْ } لجميعنا { وَ } لمَ لمْ ترسله معنا { إِنَّا لَهُ لَحَافِظُونَ } [يوسف: 63] من طريق المكروه عليه\n إذ نحن عصبة ذوو قدرة وقوة؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: نكتل: أصله: نَكْتَيِِل\n بوزن نفتعل\n من الكيل\n قلبت الياء ألفاً لتحرك ما قبلها\n ثم حذفت للساكنين\n و حفظاً: تمييز\n ومن قرأ بالألف فحال\n كقوله: لله دره فارساً\n أو تمييز\n وهو أرجح\n وما نبغي: استفهامية\n أو نافية\n ونمير أهلنا: عطف على محذوف\n أي: ردت فنستظهر بها ونمير\n\n\n الخ\n قال في القاموس: مار يَمير بالكسر: جَلَب الطعام\n هـ\n وإلا أن يحاط: استثناء مفرغ من أعم الأحوال\n أي: لتأتنني به على كل حال إلا حال الإحاطة بكم\n يقول الحق جل جلاله: { فلما رجعوا إلى أبيهم قالوا يا أبانا مُنع منا الكيلُ } أي: حكم بمنعه بعد هذا\n إن لم نذهب بأخينا بنيامين\n { فأرْسِل معنا أخانا نكتلْ } أي: نرفع المانع من الكيل\n ونكتل ما نحتاج إليه\n وقرأ الأخوان بالياء: { يكتل } لنفسه\n فنضم اكتياله إلى اكتيالنا\n { وإنا له لحافضون } من أن يناله مكروه\n { قال هل آمنكم عليه } أي: ما آمَنكم عليه { إلا كما أمنْتُكُم على أخيه من قبلُ } \n وقد قلتم في يوسف: { وإنا له لحافظون } ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:60",
      "similarity": 0.49824117218204383
    },
    {
      "verse": "83:2",
      "similarity": 0.49169573275147094
    },
    {
      "verse": "26:181",
      "similarity": 0.47782928822617693
    },
    {
      "verse": "83:3",
      "similarity": 0.4257325286581818
    },
    {
      "verse": "70:21",
      "similarity": 0.39693809170841127
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/12:63.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/12:63.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}