{
  "chapter": "يوسف",
  "text": "قال هل ءامنكم عليه الا كما امنتكم على اخيه من قبل فالله خير حفظا وهو ارحم الرحمين",
  "translations": [
    {
      "translation": "He said, 'How will my trusting him to your care be different from entrusting his brother before? The Best of Guardians, however, is Allah. He is the Most Merciful of the merciful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: \"Should I trust you with him as I did his brother? But God is the best of guardians, and most merciful of all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The father said: \"Shall I trust you with regard to him as I had trusted you earlier with regard to his brother? Allah is the Best Protector and is the Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jacob replied, \"How can I trust you after what happened to his brother before? Only God is the best Protector. His mercy is far greater than that of others.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Shall I trust you regarding him the same way I had trusted you earlier regarding his brother? Therefore Allah is the Best Protector; and He is More Merciful than all those who show mercy.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Can I entrust him to you except as I entrusted his brother [Yusuf] to you aforetime But Allah is the Best to guard, and He is the Most Merciful of those who show mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I cannot trust in you with respect to him, except as I trusted in you with respect to his brother before; but Allah is the best Keeper, and He is the most Merciful of the merciful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'And shall I entrust him to you otherwise than as I entrusted before his brother to you? Why, God is the best guardian, and He is the most merciful of the merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Can I entrust him to you save as I entrusted his brother to you aforetime? Allah is better at guarding, and He is the Most Merciful of those who show mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"Am I to trust you with him as I once trusted you with his brother? But God is the best of guardians, the Most Merciful of all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I intrust you with him only as I intrusted you with his brother aforetime; Allah is the best Guard, and He is the Most Merciful of the merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Should I not trust you with him just as I trusted you with his brother before? Yet Allah is the best of protectors, and He is the most merciful of merciful ones.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Shall I trust you with him with any result other than when I trusted you with his brother aforetime? But Allah is the best to take care (of him), and He is the Most Merciful of those who show mercy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Can I entrust him to you except as I entrusted his brother [Yusuf (Joseph)] to you aforetime? But Allah is the Best to guard, and He is the Most Merciful of those who show mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'Am I to trust you with him as I once trusted you with his brother? Why, Allah is the Best of guardians, and He is the Most Merciful of theMerciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Shall I trust you with him, as I trusted you with his brother before? God is the Best Guardian, and He is the Most Merciful of the merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Should I entrust you with him except [under coercion] as I entrusted you with his brother before? But Allah is the best guardian, and He is the most merciful of the merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:64] He said, ‘Should I — [I will] only — trust you with him like I trusted you with his brother, Joseph, before? despite [the fact] that you have done to him what you have done? Yet God is best at guarding (hifzan: a variant reading has hāfizan, ‘a guardian’, as a specification, similar to when they say li’Llāhi darruhu fārisan, ‘By God, how excellent a horseman he is!’); and He is the Most Merciful of merciful ones’, and so I hope that He will show favour [to me] by guarding him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "250 (He said) Jacob said to them: (Can I entrust him) Benjamin (to you save as I entrusted his brother) Joseph (to you aforetime?) He said: can I really make you pledge and promise more than I did in the case of his brother Joseph (Allah is better at guarding) than you are, (and He is the Most Merciful of those who show mercy) and He is more Merciful towards him than his parents or brothers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } لهم أبوهم متأسفاً متحزناً: { هَلْ آمَنُكُمْ عَلَيْهِ } وأجعلكم وقاية له { إِلاَّ كَمَآ أَمِنتُكُمْ عَلَىٰ أَخِيهِ } يوسف { مِن قَبْلُ فَٱللَّهُ } الرقيب على عباده في جميع حالاتهم { خَيْرٌ } لهم { حَافِظاً } أي: من جهة الحضانة والحفظ { وَهُوَ } في ذته { أَرْحَمُ ٱلرَّاحِمِينَ } [يوسف: 64] إذ رحمْ الكل يرجع إليه؛ لأن الرحيم بالذات، ورحمُ غيره إنما يتشعب من رحمه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال هل آمنكم عليه } أي: ما آمَنكم عليه { إلا كما أمنْتُكُم على أخيه من قبلُ } ، وقد قلتم في يوسف: { وإنا له لحافظون } ، { فاللَّهُ خيرٌ حافظاً } فأثق به، وأفوض أمري أليه، { وهو أرحمُ الراحمين } ، فأرجو أن يرحمني بحفظه، ولا يجمع عليّ مصيبتين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "83:33",
      "similarity": 0.5170720600109807
    },
    {
      "verse": "82:10",
      "similarity": 0.5165430947316872
    },
    {
      "verse": "15:9",
      "similarity": 0.4695068873480516
    },
    {
      "verse": "4:80",
      "similarity": 0.46658096298713975
    },
    {
      "verse": "23:9",
      "similarity": 0.46342267450021263
    }
  ]
}