{
  "chapter": "يوسف",
  "text": "لقد كان فى يوسف واخوته ءايت للسائلين",
  "translations": [
    {
      "translation": "In the story of Joseph and his brothers are lessons for those who inquire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in the story of Joseph and his brothers there are many signs for those who inquire (about the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the story of Joseph and his brothers, there is evidence (of the truth) for those who seek to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in Yusuf and his brothers are signs* for those who enquire**. (* Of the truthfulness of Prophet Mohammed – peace and blessings be upon him. ** The Jews who enquired about their story.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in Yusuf and his brethren there were Ayat for those who ask.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly in Yusuf and his brothers there are signs for the inquirers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(In Joseph and his brethren were signs for those who ask questions.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in Joseph and his brethren are signs (of Allah's Sovereignty) for the inquiring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, in Joseph and his brothers there are signs for the inquirers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly in Yusuf and his brethren there have been signs for the inquirers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In Joseph and his brothers there are certainly signs for the seekers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in Joseph and his brethren are signs (or symbols) for seekers (after Truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in Yusuf (Joseph) and his brethren, there were Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) for those who ask.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, in Joseph and his brothers there were signs for those who inquire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In Joseph and his brothers are lessons for the seekers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly were there in Joseph and his brothers signs for those who ask,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:7] Verily in, the tale of, Joseph and his brethren — who were eleven — are signs, lessons, for those who inquire, about their tale.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily in Joseph) in the narrative of Joseph (and his brethren are signs (of Allah's Sovereignty)) lessons (for the inquiring) about his story. This verse was revealed about a Jewish rabbi.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لقد كان في يوسف وإخوته آيات للسائلين } أي: آيات معظمات لمن يسأل عن قصتهم ويعرفها تدلهم أولاً على أن الاصطفاء المحض أمر مخصوص بمشيئة الله تعالى لا يتعلق بسعي ساع ولا إرادة مريد، فيعلمون مراتب الاستعدادات في الأزل\n وثانياً: على أنّ من أراد الله به خيراً لم يكن لأحد دفعه ومن عصمه الله لم يكن لأحد رميه بسوء ولا قصده بشرّ، فيقوى يقينهم وتوكلهم ويشهدون تجليات أفعاله وصفاته\n وثالثاً: على أنّ كيد الشيطان وإغواءه أمر لا يأمن منه أحد حتى الأنبياء، فيكونون منه على حذر، وأقوى من ذلك كله أنها تطلعهم من طريق الفهم الذي هو الانتقال الذهني على أحوالهم في البداية والنهاية وما بينهما وكيفية سلوكهم إلى الله فتثير شوقهم وإرادتهم وتشحذ بصيرتهم وتقوّي عزيمتهم وذلك أن مثل يوسف مثل القلب المستعدّ الذي هو في غاية الحسن، المحبوب، المرموق إلى أبيه يعقوب العقل، المحسود من إخوته من العلات، أي: الحواس الخمس الظاهرة والخمس الباطنة والغضب والشهوة بنى النفس إلا الذاكرة، فإنها لا تحسده ولا تقصده بسوء، فبقيت إحدى عشرة على عددهم\n وأما حسدهم عليه وقصدهم بالسوء فهو أنها تنجذب بطبائعها إلى لذاتها ومشتهياتها وتمنع استعمال العقل القوة الفكرية في تحصيل كمالات القلب من العلوم والأخلاق وتكره ذلك ولا تريد إلا استعماله إياها في تحصيل اللذات البدنية ومشتهيات تلك القوى الحيوانية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواعلم يا أكمل الرسل أنه { لَّقَدْ كَانَ فِي } قصة { يُوسُفَ وَإِخْوَتِهِ } وما جرى بينهم من الحيل والمخادعات وإسقاط المروءة والخيانات، والإنابة والرجوع منها إلى الله في الخلويات، وإظهار العدم والاستحياء من الله، ومنه يوسف وأبيه { آيَاتٌ } دلائل واضحات، وشواهد مفصحات عن أسرار التوحيد { لِّلسَّائِلِينَ } [يوسف: 7] لو تأملوا في رموزها وإشاراتها واعتبروا منها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يوسف: عجمي، وفي سينه ثلاث لغات: الضم ـ وهو الأشهر ـ والفتح، والكسر\n  يقول الحق جل جلاله: { لقد كان في يوسف وإخوته } أي: في قصصهم { آيات } دلائل قدرة الله وحكمته، وعلامة نبوتك حيث أخبرتَ بها من غير تعلم\n ففي ذلك آيات { للسائلين } أي: لمن سأل عن قصتهم\n والمراد بإخوته: علاته العشرة، والعلات: أبناء أمهات لأب واحد، فكانوا إخوته لأبيه، وهم: يهوذا، ورَوْبيل، وشمعون، ولاوي، وريالون، ويشجر، ودينة من بنت خالته ليّا، تزوجها يعقوب أولاً، فلما توفيت تزوج راحيل، فولدت له بنيامين، ويوسف\n وقيل: جمع بينهما، ولم يكن الجمع حينئذٍ محرماً\n وأربعة آخرون من سُريتَيْن، وهم: دان، وتفثالى، وجاد، وآشر",
      "translations": []
    }
  ]
}