{
  "chapter": "يوسف",
  "text": "فلما جهزهم بجهازهم جعل السقاية فى رحل اخيه ثم اذن مؤذن ايتها العير انكم لسرقون",
  "translations": [
    {
      "translation": "Then when he had supplied them with their needs, he put the goblet in his brother's bag. A herald called out, 'Caravan! You are thieves!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had given them their provisions he put his goblet in his brother's saddle-bag. Then a crier announced: \"O men of the caravan, you are thieves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, while Joseph was having their provisions loaded, he put his drinking-cup in his brother's saddlebag. And then a herald cried: \"Travellers, you are thieves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had furnished them with provisions, he placed the King's drinking cup in his own brother's baggage. Then someone shouted, \"People of the caravan, you are thieves!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had provided them their provision, he put the drinking-cup in his brother’s bag, and then an announcer cried, “O people of the caravan! You are indeed thieves!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he furnished them forth with their provisions, he put the bowl in his brother's bag. Then a crier cried: \"O you (in) the caravan! Surely, you are thieves!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he furnished them with their provisions, (someone) placed the drinking cup in his brother's bag. Then a crier cried out: O caravan! you are most surely thieves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he had equipped them with their equipment, he put his drinking-cup into the saddlebag of his brother. Then a herald proclaimed, 'Ho, cameleers, you are robbers!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he provided them with their provision, he put the drinking-cup in his brother's saddlebag, and then a crier cried: O camel-riders! Lo! ye are surely thieves!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had given them their provisions, he placed a drinking-cup in his brother's pack. Then a crier called out after them, \"Men of the caravan! You have committed theft!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had furnished them with their furnishing; he placed the drinking-cup in his brother's pack. - Thereafter a crier cried: O caravan! verily ye are thieves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had furnished them with their provision, he put the drinking-cup into his brother’s saddlebag. Then a herald shouted: ‘O [men of the] caravan! You are indeed thieves!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At length when he had furnished them forth with provisions (suitable) for them, he put the drinking cup into his brother's saddle-bag. Then shouted out a crier: \"O ye (in) the caravan! behold! ye are thieves, without doubt!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he had furnished them forth with their provisions, he put the (golden) bowl into his brother's bag, then a crier cried: \"O you (in) the caravan! Surely, you are thieves!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he had given them their provisions, he hid a drinkingcup in his brother's saddlebag. Then a herald called out after them: 'Cameleers, you are thieves!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he provided them with their provisions, he placed the drinking-cup in his brother’s saddlebag. Then an announcer called out, “O people of the caravan, you are thieves.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he had furnished them with their supplies, he put the [gold measuring] bowl into the bag of his brother. Then an announcer called out, \"O caravan, indeed you are thieves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:70] And when he had equipped them with their provision, he put the drinking-cup, a golden cup studded with jewels, into the saddlebag of his brother, Benjamin. Then a crier shouted, a herald cried, after they were dismissed from Joseph’s court: ‘O cameleers, caravan, you are surely thieves!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "251 (And when he provided them with their provision) when he measured for them their provision, (he put the drinking cup in his brother's saddlebag) he hid his drinking cup which he also used for measurement in the saddlebag of his brother Benjamin. He then ordered them to leave and when they left he sent a youth after them, (and then a crier cried) the youth that Joseph sent cried: (0 camel riders!) people of the caravan (You are surely thieves!)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جَعَلَ ٱلسِّقَايَةَ فِي رَحْلِ أَخِيهِ } وهي مِكيالٌ يُكالُ بِهِ، ويُشربُ فِيهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا جَهَّزَهُمْ بِجَهَازِهِمْ } على الوجه المعهود وشدوا رحالهم { جَعَلَ ٱلسِّقَايَةَ } أي: أمر يوسف للخدمة أن يجعلوا السقاية التي بها يكال، وهي من الفضة، وقيل: من الذهب { فِي رَحْلِ أَخِيهِ } بنيامين، وبعدما شدوا الرحال ودعوا مع العزيز جميعاً، فخرجوا عقبها { ثُمَّ } بعدما خرجوا من البلدة { أَذَّنَ مُؤَذِّنٌ } أي: صاح عليهم صائح من قبل العزيز: { أَيَّتُهَا ٱلْعِيرُ } أي: القفل إلى أين تمشون؟ { إِنَّكُمْ لَسَارِقُونَ } [يوسف: 70] مدبرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما جَهَّزهُم بجَهَازِهمْ جعل السِّقايةَ } ، التي هي الصواع، { في رَحْلِ أَخيه } ، وهي إناء يشرب بها الملك، ويأكل فيها، وكان من فضة، وقيل: من ذهب\n وقيل: كان صاعاً يُكال به\n وقصد بجعله في رحل أخيه أن يحتال على إمساكه معه إذ كان شَرْعُ يعقوب أن من سرق استعبده المسروق منه\n { ثم أذَّن مؤَذِّنٌ } بعد أن انصرفوا: { أيتها العير إنكُم لسارقون } ، والخطاب لإخوة يوسف، وإنما استحل رميهم بالسرقة مع علمه بانهم أبرياء لما في ذلك من المصلحة في المآل، وبوحي لا محالة، وإرادة من الله تعالى عَنَتُهم بذلك، يقويه قوله تعالى: { كذلك كدنا ليوسف } ، ويمكن من أن يكون فيه تورية، وفيها مندوحة عن الكذب، أي: إنكم لسارقون يوسف من أبيه، حين باعوه\n\n",
      "translations": []
    }
  ]
}