{
  "chapter": "يوسف",
  "text": "قالوا۟ يايها العزيز ان له ابا شيخا كبيرا فخذ احدنا مكانه انا نرىك من المحسنين",
  "translations": [
    {
      "translation": "They said, 'Your Eminence! He has an old and venerable father, so take one of us instead of him. We see without a doubt that you are of the people who do good.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Minister, he has an aged father, so keep one of us in his place. We see you are a virtuous man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O powerful chief (al-aziz)! His father is an age-stricken man, (and in order that he may not suffer) seize one of us in his stead. We indeed consider you an excellent person.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Noble Prince, his father is very old so please take one of us in his place. We believe that you are a righteous person\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O governor! He has a very aged father, so take one of us in his stead; indeed we witness your favours.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O `Aziz! Verily, he has an old father (who will grieve for him); so take one of us in his place. Indeed we think that you are one of the doers of good.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O chief! he has a father, a very old man, therefore retain one of us in his stead; surely we see you to be of the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Mighty prince, he has a father, aged and great with years; so take one of us in his place; we see that thou art one of the good-doers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O ruler of the land! Lo! he hath a very aged father, so take one of us instead of him. Lo! we behold thee of those who do kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O exalted one, he has a very aged father, take one of us in his place. We can see that you are a very good man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Aziz! verily he hath a father, an old man very aged; So take one of us in his stead; verily we behold thee to be of the well-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O emir! Indeed, he has a father, a very old man; so take one of us in his place. Indeed we see that you are a virtuous man.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O exalted one! Behold! he has a father, aged and venerable, (who will grieve for him); so take one of us in his place; for we see that thou art (gracious) in doing good.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O ruler of the land! Verily, he has an old father (who will grieve for him); so take one of us in his place. Indeed we think that you are one of the Muhsinun (good-doers - see V. 2:112).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'Mighty prince, his father is old, advanced in years, take one of us instead of him. We can see you are amongst the gooddoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O noble prince, he has a father, a very old man, so take one of us in his place. We see that you are a good person.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O 'Azeez, indeed he has a father [who is] an old man, so take one of us in place of him. Indeed, we see you as a doer of good.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:78] They said, ‘O Court officer, lo! he has a father, an aged man, who loves him more than we do, and who finds solace in him from [the anguish he feels for] his dead son; and it will grieve him to part with him, so take one of us, enslave him, in his place, instead of him: indeed we see that you are among the virtuous’, in [terms of] your actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nنَادَوْا بوصف العزيز إمّا لأنّ كلّ رئيس ولاية مهمة يدعى بما يرادف العزيز فيكون يوسف عليه السلام عزيزاً ، كما أن رئيس الشرطة يدعى العزيز كما تقدم في قوله تعالى : { امرأة العزيز } \\[ سورة يوسف : 30 \\] ؛ وإما لأن يوسف ضمت إليه ولاية العزيز الذي اشتراه فجمع التصرفات وراجعوه في أخذ أخيهم .ووصفوا أباهم بثلاث صفات تقتضي الترقيق عليه ، وهي : حنان الأبوة ، وصفة الشيخوخة ، واستحقاقه جبر خاطره لأنه كبير قومه أو لأنه انتهى في الكِبر إلى أقصاه؛ فالأوصاف مسوقة للحث على سراح الابن لا لأصل الفائدة لأنهم قد كانوا أخبروا يوسف عليه السلام بخبر أبيهم .والمراد بالكبير : إما كبير عشيرته فإساءته تسوءهم جميعاً ومن عادة الولاة استجلاب القبائل ، وإما أن يكون كبيراً } تأكيداً ل { شيخا } أي بلغ الغاية في الكبر من السن ، ولذلك فرّعوا على ذلك { فخذ أحدنا مكانه } ، إذ كان هو أصغر الإخوة ، والأصغر أقرب إلى رقة الأب عليه .وجملة { إنا نراك من المحسنين } تعليل لإجابة المطلوب لا للطلب . والتقدير : فلا تردّ سوءالنا لأنّا نراك من المحسنين فمثلك لا يصدر منه ما يسوء أباً شيخاً كبيراً .والمكان : أصله محل الكون أي ما يستقر فيه الجسم ، وهو هنا مجاز في العوض لأن العوض يضعه آخذه في مكان الشيء المعوّض عنه كما في الحديث « هذه مَكانُ حجتك » .\n\n",
      "translations": [
        {
          "translation": "(They said: ruler of the land! Lo! he hath an aged father) who will be very happy to have him back, (so take one of us instead of him. Lo! we behold thee) if you do so (of those who do kindness) for us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما جزم العزيم بأخذ أخيه على جريمة السرقة واسترقاقه إلى سنة { قَالُواْ } متضرعين متذللين منادين له على وجه الخضوع راجين من قبوله: { يٰأَيُّهَا ٱلْعَزِيزُ } أدام الله عزك { إِنَّ لَهُ } أي: لهذا المفسد السارق { أَباً شَيْخاً كَبِيراً } في السن والمرتبة\n إذ هو نبي من الأنبياء\n ضرير من فراق ابنه الهالك\n يتسلى قلبه ويزول وحشته لمؤانسته هذا المسرف مع أنا حلفنا معه وآتيناه موثقاً عظيماً أن نرجع فيه { فَخُذْ } من جاهك وإحسانك { أَحَدَنَا مَكَانَهُ } أي: بدله بواحد منا لنخدم في بابك\n وأطلقه لنذهب به غلى أبيه الضرير الضعيف\n لئلا يستوجش ولا نحنث في حلفنا { إِنَّا نَرَاكَ مِنَ ٱلْمُحْسِنِينَ } [يوسف: 78] المتعودين للإحسان\n المتمرنين فيه\n فتعم علينا وعلى الشيخ الضعيف إحسانك وامتنانك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فخُذ أحدَنا مكانه } فإن أباه ثكلان\n أي: حزين على أخيه الهالك\n يستأنس به\n { إنا نراك من المحسنين } إلينا\n فأتمم إحسانك\n أو من المتعودين الإحسان فلا تغير إحسانك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:72",
      "similarity": 0.57467476134307
    },
    {
      "verse": "40:67",
      "similarity": 0.41324941921954866
    },
    {
      "verse": "28:23",
      "similarity": 0.2578696955100867
    },
    {
      "verse": "28:26",
      "similarity": 0.13952903787160734
    },
    {
      "verse": "74:35",
      "similarity": 0.12022708142037003
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012078.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012078.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:78.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}