{
  "chapter": "يوسف",
  "text": "فبدا باوعيتهم قبل وعاء اخيه ثم استخرجها من وعاء اخيه كذلك كدنا ليوسف ما كان لياخذ اخاه فى دين الملك الا ان يشاء الله نرفع درجت من نشاء وفوق كل ذى علم عليم",
  "translations": [
    {
      "translation": "He started with their bags before his brother's, and then produced it from his brother's bag. In that way We devised a cunning scheme for Yusuf. He could not have held his brother according to the statutes of the King - only because Allah had willed it so. We raise the rank of anyone We will. Over everyone with knowledge is a Knower.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he searched their saddle-bags before his brother's, then produced the cup from his brother's bag. That is how We planned an excuse for Joseph, for under the law of the king he could not detain his brother unless God so willed. We raise the status of whom We please. Over every man of knowledge there is one more knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Joseph began searching their bags before searching his own brother's bag. Then he brought forth the drinking-cup from his brother's bag. Thus did We contrive to support Joseph. He had no right, according to the religion of the king (i.e. the law of Egypt), to take his brother, unless Allah so willed. We exalt whomsoever We will over others by several degrees. And above all those who know is the One Who truly knows.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They searched their baggage before that of Joseph's real brother where at last they found it. Thus, We showed Joseph how to plan this; he would not have been able to take his brother under the King's law unless God had wanted it to be so. We give a high rank to whomever We want. Over every knowledgeable person is one more knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he first searched their bags before his brother’s bag, then removed it from his brother’s bag; this was the plan We had taught Yusuf; he had no right to take his brother by the king’s law, except if Allah wills; We may raise in ranks whomever We will; and above every possessor of knowledge is another scholar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he [Yusuf] began (the search) in their bags before the bag of his brother. Then he brought it out of his brother's bag. Thus did We plan for Yusuf. He could not take his brother by the law of the king (as a slave), except that Allah willed it. We raise to degrees whom We will, but over all those endowed with knowledge is the All-Knowing (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he began with their sacks before the sack of his brother, then he brought it out from his brother's sack. Thus did We plan for the sake of Yusuf; it was not (lawful) that he should take his brother under the king's law unless Allah pleased; We raise the degrees of whomsoever We please, and above every one possessed of knowledge is the All-knowing one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he made beginning with their sacks, before his brother's sack, then he pulled it out of his brother's sack. So We contrived for Joseph's sake; he could not have taken his brother, according to the king's doom, except that God willed. Whomsoever We will, We raise in rank; over every man of knowledge is One who knows.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he (Joseph) began the search with their bags before his brother's bag, then he produced it from his brother's bag. Thus did We contrive for Joseph. He could not have taken his brother according to the king's law unless Allah willed. We raise by grades (of mercy) whom We will, and over every lord of knowledge there is one more knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [the herald] searched their bags before his brother's and then took out the cup from his brother's bag. In this way, We devised a plan on behalf of Joseph. He could not have detained his brother under the King's law, unless God so willed. We exalt whoever We please: but above those who have knowledge there is One all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he began with their sacks before the sack of his brother; then he brought it forth from his brothers sack. In this wise We contrived for Yusuf. He was not one to take his brother by the law of the king, except that Allah willed. We exalt in degrees whomsoever We will, and above every knowing one is a Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he began with their sacks, before [opening] his brother’s sack. Then he took it out from his brother’s sack. Thus did We devise for Joseph’s sake. He could not have held his brother under the king’s law unless Allah willed [otherwise]. We raise in rank whomever We please, and above every man of knowledge is One who knows best.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he began (the search) with their baggage, before (he came to) the baggage of his brother: at length he brought it out of his brother's baggage. Thus did We plan for Joseph. He could not take his brother by the law of the king except that Allah willed it (so). We raise to degrees (of wisdom) whom We please: but over all endued with knowledge is one, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he [Yusuf (Joseph)] began (the search) in their bags before the bag of his brother. Then he brought it out of his brother's bag. Thus did We plan for Yusuf (Joseph). He could not take his brother by the law of the king (as a slave), except that Allah willed it. (So Allah made the brothers to bind themselves with their way of \"punishment, i.e. enslaving of a thief.\") We raise to degrees whom We please, but over all those endowed with knowledge is the All-Knowing (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He searched their bags before his brother's and then took out the goblet from his brother's bag. As such We directed Joseph. By the king's law he had no right to seize his brother unless Allah willed otherwise. We raise whom We will in rank; over every knowledgeable person is One who knows.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he began with their bags, before his brother's bag. Then he pulled it out of his brother’s bag. Thus We devised a plan for Joseph; he could not have detained his brother under the king’s law, unless God so willed. We elevate by degrees whomever We will; and above every person of knowledge, there is one more learned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he began [the search] with their bags before the bag of his brother; then he extracted it from the bag of his brother. Thus did We plan for Joseph. He could not have taken his brother within the religion of the king except that Allah willed. We raise in degrees whom We will, but over every possessor of knowledge is one [more] knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:76] And so he began with their sacks, and searched them, before his brother’s sack, lest he be accused [of the theft]; then he pulled it, the drinking-cup, out of his brother’s sack. God, exalted be He, says: Thus, [through such] contrivance, did We contrive for Joseph, [thus] We taught him how to devise a plot to take his brother; he, Joseph, could not have taken his brother, as a slave, on account of theft, according to the king’s law, [according] to the laws of the king of Egypt — since his [a thief’s] requital according to his law would have been a beating and a penalty of twice [the value of] the stolen item, but not enslavement — unless God willed, for him to be taken according to the law of his father [Jacob]; in other words, he was only able to take him with God’s will, by God’s inspiring him to ask his brothers [about the nature of requital] and their responding according to [what is decreed by] their customary practice. We raise by degrees whom We will (read with a genitive annexation, darajāti man nashā’, or [simply] with nunation, darajātin man nashā’), in terms of knowledge, as [We did] with Joseph; and above every man of knowledge, from among creatures, is one who knows better, better than him [and so on] until it ends with God, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then he) Joseph's servant (began the search with their bags before) searching (his brother's bag) where he obviously did not find it, (then he produced it from his brother's bag) from his brother Benjamin's bag. The servant said to him: \"May Allah lift your trouble as you have lifted mine\". (Thus did We contrive) We did (for Joseph) We honoured him with knowledge, wisdom, prophethood and sovereignty. (He could not have taken his brother according to the king's law unless Allah willed) and Allah willed that he does take his brother according to the king's law because, according to the latter, the penalty for theft was beating and payment of a fine; it was also said that according to the king's law, the penalty for theft was the amputation of limbs and payment of a fine; it is also said that (unless Allah willed) means: except those laws of the king which Joseph knew to be pleasing to Allah, for he applied those. (We raise by grades (of mercy)) We raise the virtues of (whom We will) as We do in the life of this world, (and over every lord of knowledge there is one more knowing) above every one who knows there someone who knows more, and so on and so forth until one stops at Allah, for there is no one who has more knowledge than Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما أفتوا بما أفتوا أخذوا بالتفيش والكشف { فَبَدَأَ } الزاعم { بِأَوْعِيَتِهِمْ } أي: بتفتيشها وتفحصها { قَبْلَ وِعَآءِ أَخِيهِ } بنيامين { ثُمَّ } بعدما استقصى الكل واستقرأها تفشياً { ٱسْتَخْرَجَهَا } أي: السقاية { مِن وِعَآءِ أَخِيهِ } لئلا يظن أنهم يدسونها في رحله { كَذٰلِكَ } أي: مثل كيد يوسف لأخذ أخيه بنيامين { كِدْنَا لِيُوسُفَ } في أخذه من يد إخوته وخلاصه من الرق والسجن، وكدنا له أيضاً في أخذ أخيه من إخوته بفتواهم أيضاً؛ إذ { مَا كَانَ } أي: ما صح وجاز له { لِيَأْخُذَ أَخَاهُ } بجرم السرقة { فِي دِينِ ٱلْمَلِكِ } أي: ملك مصر؛ إذ في دينه اضرب وأخذ ضعف ما سرق { إِلاَّ أَن يَشَآءَ ٱللَّهُ } هذا الحكم المخصوص في دين الملك، وألهمه ليوسف بنفاذه أو بحكم في هذه المسألة على دين آبائه، أو كان الملك أسلم بيده، ودخل بيدن آبائه على ما نُقل { نَرْفَعُ } ونعلو { دَرَجَاتٍ } أي: مراتب ومنازل { مَّن نَّشَآءُ } من عبادنا، بزيادة الفضائل والكمالات والحقائق والمعارف { وَ } لا يبعد منا أمثال هذا؛ إذ { فَوْقَ كُلِّ ذِي عِلْمٍ عَلِيمٌ } [يوسف: 76] أعلى منه لا إلى نهاية؛ إذ لا انقطاع لتجددات التجليات أصلآً، لذلك قال سبحانه:\n\n \" ألا طال شوق الأبرار إلى لقائي \" \n\nأي: شوقي وتجلياتي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَبَدأَ } المؤذن أو يوسف لأنهم رُدُّوا إلى مصر، أي: بدأ في التفتيش، { بأوعيتِهم قبلَ وعَاءِ أخيه } بنيامين، تقية للتهمة، { ثم استخرجها } أي: السقاية، أو الصواع لأنه يُذكر ويُؤنث، { من وعاءِ أخيه }  { كذلك } ، أي: مثل ذلك الكيد { كِدْنَا ليوسفَ } أي: علمناه الحيلة بالوحي في أخذ أخيه، { ما كان ليَأخُذَ اخاه في دين الملك } ملك مصر لأن دينه كان الضرب وتغريم ضعف ما أخذ دون الاسترقاق\n { إلا أن يشاءَ اللهُ } أن يجعل ذلك الحكم حكم الملك\n أو: لكن أخذه بمشيئة الله وإرادته\n { نرفعُ درجات من نشاء } بالعلم والعمل، كما رفعنا درجته، { وفوق كلّ ذي علم عليم } أرفع درجة منه\n  قال البيضاوي: واحتج به من زعم أنه تعالى عالم بذاته إذ لو كان ذا علم لكان فوقه من هو أعلم منه ـ أي: لدخوله تعالى في عموم الآية ـ والجواب: أن المراد كل ذي علم من الخلق لأن الكلام فيهم، ولأن العليم هو الله تعالى\n ومعناه: الذي له العلم البالغ، ولأنه لا فرق بينه وبين قولنا: فوق كل العلماء عليم، وهو مخصوص\n هـ\n  قلت: وقد ورد ثبوت العلم له تعالى في آيات وأحاديث\n كقوله تعالى:\n\n[النساء: 166]\n\n[هود:14]، \" وإني على عِلمٍ من عِلمِ اللهِ علَّمَنيهِ \" إلى غير ذلك مما هو صريح في الرد عليهم\n\n\nالإشارة: يؤخذ من قوله تعالى: { ولما دخلوا من حيث أمرهم أبوهم }: امتثال أمر الأب فيما يأمر وينهى\n ولا فرق بين أب البشرية وأب الروحانية ـ وهو الشيخ ـ، فامتثال أمره واجب على المريد، ولو كان فيه حتف أنفه، وأمره مقدم على أمر الأب كما تقدم في سورة النساء\n وقد قالوا: أركان التصوف ثلاث: الاجتماع، والاستماع، والاتباع\n وقوله تعالى: { ما كان يُغني عنهم من الله شيء إلا حاجة\n\n\n } الخ: فيه الجمع بين مراعاة القدرة والحكمة، فالقدرة تقتضي التفويض إذ لا فعل لغير الله، والحكمة تقتضي الحذر، واستعمال الأسباب لأن الحكمة رداء للقدرة\n فالكمال هو الجمع بينهما ستراً لأسرار الربوبية، فالباطن ينظر لتصريف القدرة، والظاهر يستعمل أستار الحكمة\n وقوله تعالى: { فلما جهزهم بجهازهم جعل السقاية في رَحْل أخيه\n\n\n } الآية\n هذا من فعل أهل التصريف بالله، المأخوذين عنهم، لا يدخل تحت قواعد الشرع لأن فاعله مفعول به، أو ناظر بنور الله إلى غيب مشيئة الله، كأفعال الخضر عليه السلام\n قال الورتجبي: إن الله سبحانه إذا خصَّ نبياً، أو ولياً أإلبسه صفاته بتدريج الحال ففي كل حالة له يكسوه نوراً من صفته، فمن جملة صفاته: كيد الأزل ومكر الأبد، فكسى علم كيده قلب يوسُفَ، حتى كاد برؤية كيد الله الأزلي، فعرفه فيه اسرار لطف صنائعه، وعلم حقائق أفعاله وقدرته\n هـ\n وقوله: { نرفع درجات من نشاء }: أي بالعلم بالله كالكشف عن أسرار ذاته وأنوار صفاته، والتخلق بمعاني أسمائه، والتحقق بمقامات اليقين، ومنازل السائرين\n وهذه درجات المقربين، وليس فوقها إلا درجة الأنبياء والمرسلين\n أو بالعلم بأحكام الله وشرائعه كالعلم بأحكام العبادات والعادات، وسائر المعاملات\n وهذه درجات عامة أهل اليمين من العلماء الأتقياء والصالحين، ومنتهى درجاتهم هي ابتداء درجات العارفين المقربين، ثم الأنبياء والمرسلين\n { وفوق كل ذي علم عليم } ، ومنتهى العلم إلى الله العظيم\n ثم ذكر جوابهم، فقال: { قَالُوۤاْ إِن يَسْرِقْ فَقَدْ سَرَقَ أَخٌ لَّهُ مِن قَبْلُ }\n\n",
      "translations": []
    }
  ]
}