{
  "chapter": "يوسف",
  "text": "قالوا۟ ان يسرق فقد سرق اخ له من قبل فاسرها يوسف فى نفسه ولم يبدها لهم قال انتم شر مكانا والله اعلم بما تصفون",
  "translations": [
    {
      "translation": "They said, 'If he steals now, his brother stole before.' But Yusuf kept it to himself and still did not disclose it to them, saying, 'The plight that you are in is worse than that. Allah knows best the matter you describe.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the brothers: \"If he has stolen (no wonder), his brother had stolen before.\" But Joseph kept this secret and did not disclose it to them, and said (to himself): \"You are worse in the degree of evil, for God knows better of what you allege.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"No wonder that he steals for a brother of his stole before.\" But Joseph kept his reaction to himself without disclosing the truth to them. He merely said to himself: \"You are an evil lot. Allah knows well the truth of the accusation that you are making against me (to my face).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Joseph's) brothers said, \"It's no wonder that he steals; a brother of his had stolen before him.\" Joseph noted their remarks, but did not utter a word. He said (to himself), \"You are in a worse position. God knows best what you allege.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “If he steals, then indeed his brother has stolen before”; so Yusuf kept this in his heart and did not reveal it to them; he replied within himself, “In fact, you are in a worse position; and Allah well knows the matters you fabricate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They [Yusuf's brothers] said: \"If he steals, there was a brother of his [Yusuf] who did steal before (him). \" But these things did Yusuf keep in himself, revealing not the secrets to them. He said (within himself): \"You are in an evil situation, and Allah is the Best Knower of that which you describe!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: If he steal, a brother of his did indeed steal before; but Yusuf kept it secret in his heart and did not disclose it to them. He said: You are in an evil condition and Allah knows best what you state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'If he is a thief, a brother of his was a thief before.' But Joseph secreted it in his soul and disclosed it not to them, saying, 'You are in a worse case; God knows very well what you are describing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: If he stealeth, a brother of his stole before. But Joseph kept it secret in his soul and revealed it not unto them. He said (within himself): Ye are in worse case, and Allah knoweth best (the truth of) that which ye allege.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"If he is a thief, a brother of his had [also] committed theft before him.\" But Joseph kept his secret and revealed nothing to them. He said [to himself], \"Your deed was worse. God best knows the things you speak of.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: if he stealeth, then surely a brother of him hath stolen afore. But Yusuf concealed it in himself, and discovered it not unto them. He said: ye are in evil plight, and Allah is the Best Knower of that which ye ascribe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘If he has stolen [there is no wonder]; a brother of his had stolen before.’ Thereupon Joseph kept the matter to himself and he did not disclose it to them. He said, ‘You are in a worse state! And Allah knows best what you allege.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"If he steals, there was a brother of his who did steal before (him).\" But these things did Joseph keep locked in his heart, revealing not the secrets to them. He (simply) said (to himself): \"Ye are the worse situated; and Allah knoweth best the truth of what ye assert!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They [(Yusuf's (Joseph) brothers] said: \"If he steals, there was a brother of his [Yusuf (Joseph)] who did steal before (him).\" But these things did Yusuf (Joseph) keep in himself, revealing not the secrets to them. He said (within himself): \"You are in worst case, and Allah knows best the truth of what you assert!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'If he is a thief know then that a brother of his has committed theft before him' But Joseph kept it secret and did not reveal it to them. He said:'You are in a worse position. And Allah knows well what you describe'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “If he has stolen, a brother of his has stolen before.” But Joseph kept it to himself, and did not reveal it to them. He said, “You are in a worse situation, and God is Aware of what you allege.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"If he steals - a brother of his has stolen before.\" But Joseph kept it within himself and did not reveal it to them. He said, \"You are worse in position, and Allah is most knowing of what you describe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:77] They said, ‘If he is stealing, a brother of his stole before’, that is, Joseph — he had stolen a golden idol from his maternal grandfather and smashed it, lest he worship it. But Joseph kept it secret in his soul and did not disclose it, manifest it, to them (the [suffixed] pronoun [in yubdi-hā, ‘disclose it’] refers to the word[s] in his [following] saying); he said, within himself: ‘You are a worse case, than Joseph and his brother, because of your stealing a brother of yours from your father, and your wronging him. And God knows very well what you are describing’, [what] you are mentioning with regard to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said) the brothers of Joseph said: (If he stealeth) if Benjamin has stolen the king's cup, (a brother of his stole before) his full brother (Joseph) has stolen an idol before. (But Joseph kept it secret in his soul) he did not answer this (and revealed it not unto them) his response. (He said) within himself: (Ye are in worse case) your action is worse than that of Joseph (and Allah knoweth best (the Truth of) that which you allege) in relation to the matter of Joseph. 252\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nومعنى: { قالوا إن يسرق فقد سرق أخٌ له من قبل } أن القلب استعدّ لهذا المعنى من قبل دون القوى\n فبقوا منكرين لهما\n متهمين إياهما عند أبيهما لتحصيل مطالبهما وطلب لذة وراء ما يطلبونها\n وقيل: كان لإبراهيم صلوات الله عليه وسلامه منطقة يتوارثها أكابر أولاده\n فورثها من إسحق عمة يوسف لكونها كبرى من أولاده\n وقد حضنته بعد وفاة أمّه راحيل\n فلما شبّ أراد يعقوب انتزاعه منها\n فلم تصبر عنه\n فحزمت المنطقة تحت ثيابه عليه السلام ثم قالت: إني فقدت المنطقة\n فلما وجدت عليه سلّم لها وتركه يعقوب عندها حتى ماتت\n وهي إشارة إلى مقام الفتوّة التي ورثها من إبراهيم الروح قبل مقام الولاية وقت شبابه\n وقد حزمتها عليه النفس المطمئنة التي حضنتها وقت وفاة راحيل اللوّامة\n وإرادة انتزاع يعقوب إياه منها إشارة إلى أن العقل يريد الترقي إلى كسب المعارف والحقائق\n وإذا وجده موصوفاً بالفضائل في مقام الفتوّة رضي به\n وتركه عند النفس المطمئنة سالكاً في طريق الفضائل حتى توفيت بالفناء في الله في مقام الولاية والله أعلم\n وإسرار يوسف في نفسه كلمته علمه بقصورهم عن إدراك مقامه ونقصانهم عن كماله\n وهي قوله: { أنتُم شر مكاناً } والذي اقترح أن يأخذه يوسف القلب مكان أخيه العقل العملي هو الوهم لمداخلته في المعقولات\n وشوقه إلى الترقي إلى أفق العقل\n وحكمه فيها لا على ما ينبغي وميلهم إلى سياسته إياهم دون العقل العملي للتناسب الذي بينهم في التعلق بالمادة ونزوعه إلى تحصيل مآربهم من اللذات البدنية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما شاهدوا استخراج الوعاء من رجل بنيامين اضطبروا اضطراباً شديداً وتحزنوا حزناً غيظاً { قَالُوۤاْ } مغاضبين عليه مريدين مقته: { إِن يَسْرِقْ } هذا اللئيم\n فلا تعجبوا منه\n إذ هي من ديدنة أخيه سربت عليه { فَقَدْ سَرَقَ } مثله { أَخٌ لَّهُ } أكبر منه { مِن قَبْلُ } من أوان طفوليته يريدون يوسف\n\n\nقيل: ورثت عمة يوسف من أبيها منطقة إبرايهم\n وكانت تحضن يوسف وتحبه\n فلما شب أراد يعقوب انتزاعه منها\n فلم ترض العمة\n فشدت المنطقة على وسطه ثم أظهرت ضياعها\n فتفحص عنها فوجدتها مشدودة في وسطه\n فتحاكموا فصارت أحق به في دينهم\n\n\nفلما سمع يوسف منهم ما سمع { فَأَسَرَّهَا } وكتمها { يُوسُفُ فِي نَفْسِهِ وَلَمْ يُبْدِهَا لَهُمْ } ولم يظهر الإنكار عليهم بل أضمر حيث { قَالَ } في نفسه وسره: { أَنْتُمْ } أيها المسرفون { شَرٌّ مَّكَاناً } أي: خصلة ومنزلة وشأناً { وَٱللَّهُ } المطلع لأحوال عباده { أَعْلَمُ } منكم { بِمَا تَصِفُونَ } [يوسف: 77] وتشرحون بألسنتكم افتراء ومراء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: معنى الشرط والجواب: إن ثبت أن بنيامين يسرق فقد سرق أخ له\n أي: سرقته كسرقة اخيه\n ومكاناً: تمييز\n يقول الحق جل جلاله: قال إخوة يوسف\n لما ظهرت السرقة عليهم: { إن يسرقْ } بنيامين { فقد سرق أخٌ له } أخوه يوسف { من قبل } \n فهذا الأمر إنما صدر من ابْنَي راحيل\n لا منا\n قصدوا بذلك رفع المضرة عن أنفسهم\n ورموا بها يوسف وشقيقه\n وهذه السرقة التي رموه بها قيل: كانت ورثت عمته من أبيها منطقة\n وكانت تخصُّ يوسف وتحبه\n فلما شب\n أراد يعقوب انتزاعه منها\n فشدت المنطقة على وسطه\n ثم اظهرت ضياعَها\n ففتَّش عليها\n فوجدت مشدودة على وسطه\n فصارت أحق به في حكمهم وقيل: كان لجده من أمه صنم من ذهب\n فسرقه وكسره\n وألقاه في الجيف\n وقيل: كان في البيت عناق أو دجاجة فأعطاها السائل\n  { فأسرَّها يوسفُ في نفسه ولم يُبدها لهم } أي: أخفى هذه الإجابة\n ولم يكذبهم فيها\n أو: الحزازة التي وجد في نفسه من قولهم: { فقد سرق أخ له من قبل } أي: أسر كراهية مقالتهم\n أو: المقالة التي يفسرها قوله: { قال أنتم شرُّ مكاناً } أي: قال في نفسه خفية: أنتم شر مكاناً\n أي: انتم أقبح منزلة في السرقة بسرقتكم أخاكم\n أو بسوء صنيعكم بما فعلتم معي\n { والله أعلم بما تَصِفُون } \n وقد علم سبحاته أن الأمر ليس كما تصفون\n فهو إشارة إلى كذبهم فيما نسبوا إليه من السرقة\n { قالوا يا أيها العزيزُ إن له أباً شيخاً كبيراً } في السن\n أو القدر\n ذكروا حاله استعطافاً له\n وكانوا أعلموه بشدة محبة أبيه فيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:81",
      "similarity": 0.489896307171595
    },
    {
      "verse": "12:73",
      "similarity": 0.452813034002217
    },
    {
      "verse": "15:18",
      "similarity": 0.39014295397419774
    },
    {
      "verse": "5:38",
      "similarity": 0.3644063905444375
    },
    {
      "verse": "37:159",
      "similarity": 0.31333210337098183
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:77.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:77.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:77.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}