{
  "chapter": "يوسف",
  "text": "فلما دخلوا۟ عليه قالوا۟ يايها العزيز مسنا واهلنا الضر وجئنا ببضعة مزجىة فاوف لنا الكيل وتصدق علينا ان الله يجزى المتصدقين",
  "translations": [
    {
      "translation": "So when they came into his presence, they said, 'Your Eminence! Hardship has hit us and our families. We bring scant merchandise, but fill the measure for us generously. Allah always rewards a generous giver.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they returned to him, they said (to Joseph): \"O Minister, calamity has befallen us and our people. We have brought but a meagre sum, but give us full measure as alms bestowed. God surely rewards those who give alms.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On going to Egypt they presented themselves to Joseph and said to him: \"O chief! We and our family are struck with distress and have brought only a paltry sum. So give us corn in full measure, and give it to us in charity. Allah rewards those who are charitable.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered Joseph's court, they said, \"Noble Prince, hardship has struck us and our people. We have come with a little money, so give us a measure of grain and be charitable to us. God will give the reward to those who give charity\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they reached in the company of Yusuf they said, “O governor! Calamity has struck us and our household, and we have brought goods of little value, so give us the full measure and be generous to us; undoubtedly Allah rewards the generous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they entered unto him, they said: \"O `Aziz! A hard time has hit us and our family, and we have brought but poor capital, so pay us full measure and be charitable to us. Truly, Allah does reward the charitable.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they came in to him, they said: O chief! distress has afflicted us and our family and we have brought scanty money, so give us full measure and be charitable to us; surely Allah rewards the charitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they entered unto him, they said, 'O mighty prince, affliction has visited us and our people. We come with merchandise of scant worth. Fill up to us the measure, and be charitable to us; surely God recompenses the charitable.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they came (again) before him (Joseph) they said: O ruler! Misfortune hath touched us and our folk, and we bring but poor merchandise, so fill for us the measure and be charitable unto us. Lo! Allah will requite the charitable,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his brothers presented themselves before Joseph, they pleaded, \"Exalted one, distress has afflicted us and our family and we have brought only a paltry sum; but give us full measure. Be charitable to us. Truly, God rewards the charitable.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered unto him, they said: O Aziz! distress hath touched us and our household, and we have brought poor goods, wherefore give us full measure, and be charitable unto us; verily Allah recompenseth the charitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they entered into his presence, they said, ‘O emir! Distress has befallen us and our family, and we have brought [just] a meagre sum. Yet grant us the full measure, and be charitable to us! Indeed Allah rewards the charitable.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they came (back) into (Joseph's) presence they said: \"O exalted one! distress has seized us and our family: we have (now) brought but scanty capital: so pay us full measure, (we pray thee), and treat it as charity to us: for Allah doth reward the charitable.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they entered unto him [Yusuf (Joseph)], they said: \"O ruler of the land! A hard time has hit us and our family, and we have brought but poor capital, so pay us full measure and be charitable to us. Truly, Allah does reward the charitable.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they presented themselves before him they said: 'O mighty prince, we and our people are afflicted with distress. We have brought but little merchandise. Fill up the measure, and be charitable to us; Allah rewards the charitable'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they entered into his presence, they said, “Mighty governor, adversity has befallen us, and our family. We have brought scant merchandise. But give us full measure, and be charitable towards us—God rewards the charitable.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they entered upon Joseph, they said, \"O 'Azeez, adversity has touched us and our family, and we have come with goods poor in quality, but give us full measure and be charitable to us. Indeed, Allah rewards the charitable.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:88] And so when they entered to him, they said, ‘O Court officer, misfortune, hunger, has befallen us and our family; and we have come with reject merchandise, refused by any person who sees it, because of its worthlessness — it consisted of counterfeit dirhams or something else — so fill up, complete, for us the measure and be charitable to us, by overlooking the worthlessness of our merchandise; truly God requites the charitable’, He rewards them: he [Joseph] thus took pity on them and he was overtaken by compassion [for them] and removed the partition between them and himself.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they came (again) before him (Joseph)) a third time (they said: ruler! Misfortune) hunger (hath touched us and our folk, and we bring but poor merchandise) merchandise which is not suitable for buying food, but are suitable for spending on people; it is also said that this means: merchandise that one can get in the mountains such as pine nuts and the fruit of the terebinth-tree; it is also said that this means: Arab merchandise such as dried lumps of cheese, wool, cheese and ghee, (so fill for us the measure) give us our measure as you would give if we had good money (and be charitable unto us) in regards to difference in the two prices; it is also said that this means: in regards to difference in the two measures. (Lo! Allah will requite the charitable) in the life of this world and in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجِئْنَا بِبِضَاعَةٍ مُّزْجَاةٍ } [معناه] قَلِيلةٌ يَسيرةٌ ويقالُ: زُيُوفٌ رَديّةٌ\n ويقالُ كَاسِدةٌ\n ويُقالُ: نَاقِصةٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {And We have brought forth for you a diversified provision} [meaning] a little [amount] that is easy [to obtain] and it is said: [it is] few and scattered.\n\n\nIt is said that \"kasidah\" is a type of Arabic poetry.\n It is said: A defect.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وقولهم: { مسّنا وأهلنا الضرّ } إشارة إلى عسرهم وسوء حالهم\n وضيقهم في الوقوف مع الحقوق { وجئنا ببضاعة مزجاة } إلى ضعفهم لقلّة مواد قواهم وقصور غذائهم عن بلوغ مرادهم\n وقولهم: { فأوْفِ لنا الكيل } استعطافهم إياه بطلب الحظوظ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما صمموا العم بالخروج إلى مصر كرة أخرى بإذن أبيهم وخرجوا من عنده وساروا إلى أن وصلوا مصر { فَلَمَّا دَخَلُواْ عَلَيْهِ } أي: على يوسف { قَالُواْ } أولاً: { يٰأَيُّهَا ٱلْعَزِيزُ مَسَّنَا وَأَهْلَنَا ٱلضُّرُّ } أي: الجدب وشدة الجوع { وَجِئْنَا بِبِضَاعَةٍ مُّزْجَاةٍ } قليلة رديئة { فَأَوْفِ لَنَا ٱلْكَيْلَ } وتممه لنا من جاهك وإحسانك { وَ } قالوا ثانياً: { تَصَدَّقْ عَلَيْنَآ } برد أخينا لنرده إلى أبيه المحزون\n فإنه قد أشرف على الهلاك من شدة الحزن والأسف { إِنَّ ٱللَّهَ } المجازي عن أعمال عباده { يَجْزِي ٱلْمُتَصَدِّقِينَ } [يوسف: 88] المؤمنين منهم جزاءً حسناً\n لا جزاء أحسن منه\n\n\nثم لما سمع يوسف من أسف أبيه وشدة كربه وكآبته وأبيضاض في عينيه وهزال جمسه وإشرافه على الانهدام والانخرام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من يتق ويصبر: من قرأ بالياء: أجرى الموصول مجرى الشرط لعمومه وإبهامه\n فعطف على صلته بالجزم\n ومنه قول الشاعر:\nيقول الحق جل جلاله: { فلما دخلوا عليه } على يوسف حين رجعوا إليه مرة ثالثة\n { قالوا يا أيها العزيز مسنا وأهلنا الضُّرُّ } شدة الجوع { وجئنا } إليك { ببضاعةٍ مُّزجَاةٍ }: رديئة\n أو قليلة\n أو ناقصة\n تدفع وترد من أزجيته\n دفعته\n ومنه:\n[النور: 43] قيل: كانت دراهم زيوفاً وقيل: الصنوبر وحبة الخضراء\n وقيل: سَويق المُقْل أي: الدوم\n وقيل: عروضاً\n { فأوْف لنا الكَيْلَ }: أتممه لنا\n { وتصدَّقْ علينا } بالمسامحة\n وقبول المزجاة\n أو بالزيادة على ثمننا\n وهذا يقتضي أن الصدقة كانت حلالاً على الأنبياء قبل نبينا صلى الله عليه وسلم\n وهو خلاف المشهور\n أو برد أخينا\n { إن الله يجزي المتصدّقين } أحسن الجزاء\n والتصدق: التفضل مطلقاً\n ومنه قوله صلى الله عليه وسلم في القصر:\n \" هذهِ صَدَقةٌ تَصَدَّقَ اللَّهُ عَلَيكُمْ بها\n فاقبلوا صدقته \"\n \nرُوي أن يعقوب عليه السلام لما أرسلهم أرسلهم المرة الثالثة ليتحسسوا أخبار يوسف وأخيه\n أرسل معهم كتاباً ونصه: بسم الله الرَّحمن الرحيم\n من يعقوب الحزين إلى عزيز مصر\n ولو عرفت اسمك لذكرتك في كتابي هذا\n يا من أعتز بعز الله\n فالله يُعِزُ من يشاء\n ويُذل من يشاء\n وإني أيها العزيز قد اشمأز قلبي\n وقطع الحزن أوصالي\n وإني ناهٍ إلى الإقراح\n دائم البكاء والصياح\n وإني من نطفة آباء كرام\n فكيف يتولد اللصوص مني وأنا من الخصوص! وقد أخبرت أنك وضعت الصَّاع بالليل في رحل ولدي الأصغر\n وإني حزين عليه كما كنتُ حزيناً على أخيه الفقيد\n حزناً دائماً سرمداً شديداً\n وإن كنت أفجعتني في الآخرة فإن قلبي لا محالة طائر\n ثم ختمه بالسلام\n فلما دفعوه ليوسف قرأه\n وبكى بكاء شديداً\n ثم دفعه لأخيه بنيامين فقرأه وبكى أيضاً\n ثم نزل عن سريره\n ثم دفع لهم الكتاب الذي كانوا يكتبوه لمالك بن ذعْر لما باعوه بخطوط شهادتهم\n كان أخذه من مالك حين باعه\n فلما قرأوه تغيرت ألوانهم وتضعضعت أركانهم\n وبُهتوا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:66",
      "similarity": 0.5997708892501409
    },
    {
      "verse": "30:4",
      "similarity": 0.344909946957928
    },
    {
      "verse": "12:42",
      "similarity": 0.30362289867872577
    },
    {
      "verse": "12:62",
      "similarity": 0.29026703734081827
    },
    {
      "verse": "24:43",
      "similarity": 0.25289256280324557
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/12:88.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/12:88.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:88.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}