{
  "chapter": "يوسف",
  "text": "وسـل القرية التى كنا فيها والعير التى اقبلنا فيها وانا لصدقون",
  "translations": [
    {
      "translation": "Ask questions of the town in which we were and of the caravan in which we came for we are surely telling you the truth.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enquire from the people of that city, or ask the men of the caravan with whom we have come. We are verily speaking the truth.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may inquire of the dwellers of the city where we were, and of the people of the caravan with whom we travelled. We are altogether truthful in what we say.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can ask the people of the town where we were and the caravan we met there. We are certainly telling the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And ask the township in which we were, and the caravan in which we came; and indeed we are truthful.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask (the people of) the town where we have been, and the caravan in which we returned; and indeed we are telling the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And inquire in the town in which we were and the caravan with which we proceeded, and most surely we are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enquire of the city wherein we were, and the caravan in which we approached; surely we are truthful men\".'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the township where we were, and the caravan with which we travelled hither. Lo! we speak the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Inquire of [the people of] the city where we lodged, and of the caravan with which we travelled. We are telling you the truth.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And inquire those of the city where we have been and of the caravan with whom we have travelled hither; and verily we are truth- tellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask [the people of] the town we were in, and the caravan with which we came. We indeed speak the truth.’’ ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask at the town where we have been and the caravan in which we returned, and (you will find) we are indeed telling the truth.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask (the people of) the town where we have been, and the caravan in which we returned, and indeed we are telling the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the village where we were and the caravan in which we traveled, we speak the truth'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Ask the town where we were, and the caravan in which we came. We are being truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask the city in which we were and the caravan in which we came - and indeed, we are truthful,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:82] And ask the city in which we were — namely Egypt — in other words, send forth [someone] to ask its people, and the caravan, the men of the caravan, with which we approached — and these were a group of Canaanites. Surely we speak the truth” ’, in what we say. So they went back to him and told him as much.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ask the township) the people of the township (where we were) it was one of the villages of Egypt, (and the caravan) and the people of the caravan (with which we travelled hither) they had travelled with a group of people from Canaan. (Lo! we speak the Truth) in that which we are saying to you. And so they told Jacob these words.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن لم تقبل يا أبانا قولنا { سْئَلِ ٱلْقَرْيَةَ } أي: أهلها { ٱلَّتِي كُنَّا فِيهَا } لدى الحوامل وتهيئة الأسباب { وَ } أسهل من ذلك اسأل { ٱلْعِيْرَ } أي: القفل { ٱلَّتِيۤ أَقْبَلْنَا فِيهَا } إذ هم رفقاؤنا معنا حين سرق ابنك وأخذوه، مع أنا اجتهدنا كثيراً أن يؤخذ منا واحد بدله لم يقبلوا منا، وقالوا: ما نأخذ إلا من وجدنا متاعنا عنده، وإن مضينا على مقتضى مقترحكم نكون من الظالمين بأخذ البريء بدل الجاني، مع أن يهودذا أو روبيل قد تخلف عنا خوفاً من الحدث واستحياء منك { وَ } الله يا أبانا { إِنَّا لَصَادِقُونَ } [يوسف: 82] فيما حينا لك عما جرى علينا مما تم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n\" { و } سل أيضاً { العيرَ }: أهل العير، { التي أقبلنا فيها } ، والعير: جماعة الإبل\n { وإنا لصادقون } فيما أخبرناك به\n هذا تمام وصية كبيرهم\n فلما رجعوا إلى أبيهم، وقالوا له ما قال لهم كبيرهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:70",
      "similarity": 0.39763437035424215
    },
    {
      "verse": "12:94",
      "similarity": 0.36527698745692994
    },
    {
      "verse": "21:6",
      "similarity": 0.1057362708746972
    },
    {
      "verse": "17:58",
      "similarity": 0.0986978835907075
    },
    {
      "verse": "6:92",
      "similarity": 0.0976081195044284
    }
  ]
}