{
  "chapter": "يوسف",
  "text": "اذ قالوا۟ ليوسف واخوه احب الى ابينا منا ونحن عصبة ان ابانا لفى ضلل مبين",
  "translations": [
    {
      "translation": "When they declared, 'Why! Yusuf and his brother are dearer to our father than we are although we constitute a powerful group. Our father is clearly making a mistake.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Joseph and his brother are dearer to our father than we,\" (said his half brothers) \"even though we are a well-knit band. Our father is surely in the wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind when the brothers of Joseph conferred together and said: \"Surely Joseph and his brother are dearer to our father than we are, although we are a group of so many. Our father is clearly mistaken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Joseph's brothers said to one another, \"There is no doubt that Joseph and his brother are more loved by our father, even though we are all his offspring. He (our father) is certainly in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they said, “Indeed Yusuf and his brother* are dearer to our father than we are, and we are one group; undoubtedly our father is, clearly, deeply engrossed in love.” (* Of the same mother.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they said: \"Truly, Yusuf and his brother are dearer to our father than we, while we are `Usbah (a group). Really, our father is in a plain error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they said: Certainly Yusuf and his brother are dearer to our father than we, though we are a (stronger) company; most surely our father is in manifest error:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they said, 'Surely Joseph and his brother are dearer to our father than we, though we are a band. Surely our father is in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they said: Verily Joseph and his brother are dearer to our father than we are, many though we be. Lo! our father is in plain aberration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said [to each other], \"Surely Joseph and his brother [Benjamin] are dearer to our father than ourselves, although we are a band. Truly, our father is clearly mistaken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time they said: surely Yusuf and his brother are dearer to our father than we, whereas we are company; verily our father is in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they said, ‘Surely Joseph and his brother are dearer to our father than [the rest of] us, though we are a hardy band. Our father is indeed in manifest error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Truly Joseph and his brother are loved more by our father than we: But we are a goodly body! really our father is obviously wandering (in his mind)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they said: \"Truly, Yusuf (Joseph) and his brother (Benjamin) are loved more by our father than we, but we are 'Usbah (a strong group). Really, our father is in a plain error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'Joseph and his brother are dearer to our father than ourselves, even though we are many. Truly, our father is obviously wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they said, “Joseph and his brother are dearer to our father than we are, although we are a whole group. Our father is obviously in the wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they said, \"Joseph and his brother are more beloved to our father than we, while we are a clan. Indeed, our father is in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:8] Mention, when they, that is, [when] some of Joseph’s brothers, said, to some of the others: ‘Surely Joseph (la-Yūsufu is the subject) and his brother, his full brother Benjamin, are dearer (ahabbu is the predicate) to our father than we are, though we be a [hardy] band, a group. Lo! our father is in plain aberration, in manifest error, for preferring those two to us.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When they said) i.e. when the brothers of Joseph said to one another: (Verily Joseph and his brother) Benjamin (are dearer to our father) are more preferred by our father (than we are, many though we be) though we are ten in number. (Lo! our father is in plain aberration) our father is in manifest error regarding the love of Joseph and his preference over us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَنَحْنُ عُصْبَةٌ } معناهُ جَماعةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We are a group,\" means a community.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وذلك معنى قولهم: { ليوسف وأخوه أحبّ إلى أبينا منّا } وأخوه هو: القوّة العاقلة العملية من أمّ يوسف القلب التي هي راحيل النفس اللوامة التي تزوّجها يعقوب القلب بعد وفاة ليا النفس الأمّارة\n وإنما قالوا { ليوسف وأخوه } لأن العقل كما يقتضي تكميل القلب بالعلوم والمعارف يقتضي تكميل هذه القوة باستنباط أنواع الفضائل من الأخلاق الجميلة والأعمال الشريفة ونسبتهم إياه إلى الضلال الذي هو البعد عن الصواب بقولهم: { إن أبانا لفي ضلال مبين } قصورها عن النظر العقلي وبعد طريقه عن طريقتها في تحصيل الملاذ البدنية وإلقاؤهم إياه في غيابة الجبّ استيلاؤها على القلب وجذبها إياه إلى الجهة السفلية بحدوث محبّة البدن وموافقاته له حتى ألقي في قعر جبّ الطبيعة البدنية\n إلا أنه أُلْبِسَ قميصاً من الجنة أتى به جبريل إبراهيم عليهما السلام يوم جرّد وأُلقِيَ في النار\n فألبسه إياه وورثه إسحاق وورثه منه يعقوب فعلقه في تميمة على عنقه\n فأتاه جبريل عليه السلام في البئر فأخرجه وألبسه إياه\n وإلا لغمره الماء وظهرت عورته\n كما قيل\n وهو إشارة إلى صفة الاستعداد الأصلي والنور الفطريّ وذلك هو الذي منع إبراهيم عن النار وحماه بإذن الله حتى صارت عليه برداً وسلاماً\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر لهم يا أكمل الرسل: { إِذْ قَالُواْ } أي: إخوة يوسف حين بثوا الشكوى من أبيهم في خلواتهم\n حاسدين على يوسف أخيهم: { لَيُوسُفُ وَأَخُوهُ } بنيامين\n أضافره لكونه من أمه { أَحَبُّ إِلَىٰ أَبِينَا مِنَّا } يؤانس معهما ويتحنن إليهما { وَنَحْنُ عُصْبَةٌ } فرقة ذوو قوة وكفاية تستحق وتليق أن يحبنا ويلتفت إليها\n وبالجملة: { إِنَّ أَبَانَا } في تفضيل المفضول وترجيح المرجوح { لَفِي ضَلاَلٍ مُّبِينٍ } [يوسف: 8] ظاهر المخالفة للعقل والعرف\n\n\nفعليكم أيها الإخوان أن تتأملوا في أمر أبيكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إذ قالوا ليُوسفُ وأخوه } بنيامين\n وخُص بالإضافة لأنه شقيقه\n { أحبُّ إلى أبينا منا ونحنُ عصبةٌ } أي: والحال أنا جماعة أقوياء\n فنحن أحق بالمحبة لأنهما لا كفاءة فيهما\n والعصبة: العشرة ففوق: { إن أبانا لفي ضلالٍ } خطأ { مبين } ظاهر لتفضيل المفضول\n رُوي أنه كان أحب إليه لما كان يرى فيه من مخايل الخير\n وكان إخوته يحسدونه\n فلما رأى الرؤيا ضاعف له المحبة\n بحيث لم يصبر عنه\n فتناهى حسدهم حتى حملهم على التعرض لقتله\n وهكذا شأن الحسد يبلغ بصاحبه امراً عظيماً\n الإشارة: كان يعقوب عليه السلام لا يفارق يوسف ليلاً ولا نهاراً\n وهكذا شأن المحبين\n وأنشدوا:\nقال الجنيد رضي الله عنه: رأيت غلاماً حسن الوجه يعنف كهلاً حسناً\n فقلت: يا غلام\n لِمَ تفعل هذا؟ قال: لأنه يدعي أنه يهواني\n ومنذ ثلاث ما رآني\n قال: فوقعت مغشياً علي\n فلما أفقتُ ما قدرت على النهوض\n فقيل لي في ذلك\n فقلت: ينبغي للمحب ألا يفارق باب محبوبه على أي حال\n وأنشدوا:\nقلت: فالحبيب غيور لا يحب أن يرى في قلب حبيبه غيره\n فإذا رأى فيه شيئاً أخرجه منه\n وفرق بينه وبينه غيرةً منه واعتناء به\n وهو السر في افتراق يوسف من أبيه\n والله تعالى أعلم\n ثم تعرضوا ليوسف\n فقالوا: { ٱقْتُلُواْ يُوسُفَ أَوِ ٱطْرَحُوهُ أَرْضاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:11",
      "similarity": 0.5919787831090089
    },
    {
      "verse": "12:14",
      "similarity": 0.47333191252243473
    },
    {
      "verse": "11:77",
      "similarity": 0.4540985673259514
    },
    {
      "verse": "12:7",
      "similarity": 0.29485819353596543
    },
    {
      "verse": "12:89",
      "similarity": 0.2708228835743939
    }
  ]
}