{
  "chapter": "يوسف",
  "text": "يبنى اذهبوا۟ فتحسسوا۟ من يوسف واخيه ولا تا۟يـسوا۟ من روح الله انه لا يا۟يـس من روح الله الا القوم الكفرون",
  "translations": [
    {
      "translation": "O sons, go in search of Joseph and his brother, and do not despair of the mercy of God. Only they despair of God's mercy who do not believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My sons! Go and try to find out about Joseph and his brother and do not despair of Allah's mercy. Verily only the unbelievers despair of Allah's mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My sons, go and search for Joseph and his brother and do not despair of receiving comfort from God; only the unbelievers despair of receiving comfort from Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my sons, go and search for Yusuf and his brother, and do not lose hope in the mercy of Allah; indeed none lose hope in the mercy of Allah except the disbelieving people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my sons! Go you and inquire about Yusuf and his brother, and never give up hope of Allah's mercy. Certainly no one despairs of Allah's mercy, except the people who disbelieve.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my sons! Go and inquire respecting Yusuf and his brother, and despair not of Allah's mercy; surely none despairs of Allah's mercy except the unbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Depart, my sons, and search out tidings of Joseph and his brother. Do not despair of God's comfort; of God's comfort no man despairs, excepting the people of the unbelievers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go, O my sons, and ascertain concerning Joseph and his brother, and despair not of the Spirit of Allah. Lo! none despaireth of the Spirit of Allah save disbelieving folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go, my sons, and seek news of Joseph and his brother. Do not despair of God's mercy; none but those who deny the truth despair of God's mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My sons! go and ascertain about Yusuf and his brother, and despair not of the comfort of Allah; verily none despair of the comfort of Allah except a people disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Go, my sons, and look for Joseph and his brother, and do not despair of Allah’s mercy. Indeed no one despairs of Allah’s mercy except the faithless lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my sons! go ye and enquire about Joseph and his brother, and never give up hope of Allah's Soothing Mercy: truly no one despairs of Allah's Soothing Mercy, except those who have no faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my sons! Go you and enquire about Yusuf (Joseph) and his brother, and never give up hope of Allah's Mercy. Certainly no one despairs of Allah's Mercy, except the people who disbelieve.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go and seek news of Joseph and his brother. Do not despair of the Comfort of Allah, none but unbelievers despair of the Comfort of Allah'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my sons, go and inquire about Joseph and his brother, and do not despair of God's comfort. None despairs of God's comfort except the disbelieving people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my sons, go and find out about Joseph and his brother and despair not of relief from Allah. Indeed, no one despairs of relief from Allah except the disbelieving people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:87] O my sons, go and enquire about Joseph and his brother, seek news of them, and do not despair of God’s [gracious] Spirit, His mercy. Indeed none despairs of the [gracious] Spirit of God save the disbelieving folk’:   and so they departed to Egypt [to look] for Joseph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "For this reason, he said: (Go, my sons, and ascertain concerning Joseph and his brother) go and enquire about Joseph and his brother Benjamin, (and despair not of the Spirit of Allah) despair not of the mercy of Allah. (Lo! None despaireth of the Spirit of Allah) of the mercy of Allah (save disbelieving folk) save the people who disbelieve in Allah and His mercy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يٰبَنِيَّ ٱذْهَبُواْ فَتَحَسَّسُواْ } معناه تَخَبَّروا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما استروح يعقوب من روح الله واستنشق من نسمات رحمته، نادى بنيه نداء مرحمة وإشفا؛ ليقبلو إليه بعدما آيسوا عنه وعن عطفه؛ إذ بالغوا في سوء الأدب معه وإيقاعه بانواع المحن والشدائد، فقال: { يٰبَنِيَّ ٱذْهَبُواْ } إلى مصر مرة أخرى { فَتَحَسَّسُواْ } أي: تفحصوا وتطلبوا أصالة { مِن يُوسُفَ وَأَخِيهِ } بنيامين تبعاً { وَلاَ تَيْأَسُواْ } أي: لا تقنطوا يا بني { مِن رَّوْحِ ٱللَّهِ } وتنفيسه تفريجاً لهم؛ إذ نحن معاشر الأنبياء لا يليق بنا اليأس والقنوط عن كرم الله وجوده في حال من الأحوال { إِنَّهُ لاَ يَيْأَسُ } أي: لا يقنط { مِن رَّوْحِ ٱللَّهِ } وكمال قدرته وسعة جوده { إِلاَّ ٱلْقَوْمُ ٱلْكَافِرُونَ } [يوسف: 87] الساترون بغيوم هوياتهم الباطلة شمس الحق السارية المتجلية في الآفاق الفائضة عليهم سجال الفضل والكرم على مقدار قابلياتهم واستعدادتهم\n\n\n\n\nفعليكم ألا تقنطوا من الله في حال من الأحوال، بل اعتقدوا أن له التصرف والقدرة التامة والإرادة الكاملة على ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يا بَني اذهبوا } إلى الأرض التي تركتم بها أخويكم، { فتحسسُوا من يوسفَ وأخيهِ } أي: تعرفوا من خبرهما، وتفحَّصوا عن حالهما\n\n\nوالتحسس: طلب الشيء بالحواس\n وإنما لم يذكر الولد الثالث لأنه بقي هناك اختياراً\n وفي ذكر يوسف دليل على أنه كان عالماً بحياته\n { ولا تيأسوا من رَّوْح الله }: لا تقنطوا من فرجه وتنفيسه، أو من رحمته، وقرئ بضم الراء، أي: من رحمته التي يحيي بها العباد، أي: ولا تيأسوا من حي معه روح الله فكل من بقي روحه يرْجى، أي: ويوسف عندي، فمن معه روح الله فلا تيأسوا من رجوعه\n { إنه } أي: الشأن { لا ييأسُ من رَّوْح الله إلا القومُ الكافرون } بالله وصفاته لأن العارف لا يقنط من رحمته في شيء من الأحوال\n وإنما جعل اليأس من صفة الكافر لأن سببه تكذيبٌ بالربوبية، أو جهل بصفة الله وقدرته، والجهل بالصفة جهل بالموصوف، فالإياس من رحمة الله كفر\n وأما حديث الرجل الذي قال: إذا متُّ فاحرقوني، ثم اذْروني في البحر والبر في يوم رائح، فلئِنِ قدر الله عليَّ ليعذبني عذاباً ما عذبه أحد من الناس، حسبما في الصحيح، فليس فيه اليأس ولا تعجيز القدرة، لكن لما غلبه الخوف المفرط لم يتأمل ولم بضبط حاله إما لحقه من الخوف وغمره من الدهش، دون عقد ولا إصرار على نفي الرحمة واليأس منها\n ويدل على ذلك قوله: لما قال له الرب ـ تعالى ـ: ما حملك على هذا؟ قال: مخافتك، فغفر له\n ولم يقل اليأس من رحمتك\n انظر المحشي الفاسي\n  الإشارة: لم يتأسف يعقوب عليه السلام على فقد صورة يوسف الحسية، إنما تأسف على فقد ما كان يشاهد فيه من جمال الحق وبهائه، في تجلي يوسف وحسن طلعته البهية، وفي ذلك يقول ابن الفارض:\n\nفلما فقد ذلك التجلي الجمالي حزن عليه، وإلا فالأنبياء ـ عليهم الصلاة والسلام ـ أولى بالغنى بالله عما سواه\n فإذا حصل للقلب الغنى بالله لم يتأسف على شيء، ولم يحزن على شيء لأنه حاز كل شيء، ولم يفته شيء\n \" ماذا فقد من وجده، وما الذي وجد من فقده \"\n ولله در القائل:\n\nوهذا أمر محقق، مذوق عند العارفين أهل الغنى بالله\n وقوله: { إنما أشكو بثي وحزني إلى الله }: فيه رفع الهمة عن الخلق، والاكتفاء بالملك الحق، وعدم الشكوى فيما ينزل إلى الخلق\n\n\n وهو ركن من أركان طريق التصوف، بل هو عين التصوف\n وبالله التوفيق\n ثم ذهبوا إلى مصر كما أمرهم أبوهم، قال تعالى: { فَلَمَّا دَخَلُواْ عَلَيْهِ قَالُواْ يٰأَيُّهَا ٱلْعَزِيزُ }\n\n",
      "translations": []
    }
  ]
}