{
  "chapter": "يوسف",
  "text": "قال بل سولت لكم انفسكم امرا فصبر جميل عسى الله ان ياتينى بهم جميعا انه هو العليم الحكيم",
  "translations": [
    {
      "translation": "He said, 'It's merely that your lower selves suggested something to you which you did. But beauty lies in having steadfastness. Perhaps Allah will bring them all together. He is indeed All-Knowing and All-Wise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No,\" said (the father). \"You have made up the story; but patience is best; God may bring them back to me. He is all-knowing and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The father heard the narration and said: \"(All that is untrue). But your souls have made it easy for you to engage in a heinous act. So, I will be graciously patient even at this. Allah may well bring them all back to me. He is All-Knowing, All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(When he heard this), Jacob said, \"Your souls have tempted you to make up the whole story. Let us be patient for perhaps God will bring them all back to me. God is certainly All-knowing and All-wise\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Yaqub, “Your souls have fabricated an excuse for you; therefore patience is excellent; it is likely that Allah will bring all* of them to me; undoubtedly only He is the All Knowing, the Wise.” (* All three including Yusuf.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Ya`qub] said: \"Nay, but your own selves have beguiled you into something. So patience is most fitting (for me). May be Allah will bring them (back) all to me. Truly, He! Only He is All-Knowing, All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Yaqoub) said: Nay, your souls have made a matter light for you, so patience is good; maybe Allah will bring them all together to me; surely He is the Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No!' he said 'But your spirits tempted you to do somewhat. But come, sweet patience! Haply God will bring them all to me; He is the All-knowing, the All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And when they came unto their father and had spoken thus to him) he said: Nay, but your minds have beguiled you into something. (My course is) comely patience! It may be that Allah will bring them all unto me. Lo! He, only He, is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jacob said, \"No, but you have yourselves contrived a story. But it is best to be patient. God may well bring them all back to me [in the end]. For He is indeed full of knowledge and wisdom.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: nay! your selves have embellished for you an affair; so seemly patience! Belike Allah may bring them all unto me; verily He! only He Is the Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘No, your souls have made a matter seem decorous to you. Yet patience is graceful. Maybe Allah will bring them all [back] to me. Indeed He is the All-knowing, the All-wise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jacob said: \"Nay, but ye have yourselves contrived a story (good enough) for you. So patience is most fitting (for me). Maybe Allah will bring them (back) all to me (in the end). For He is indeed full of knowledge and wisdom.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Ya'qub (Jacob)] said: \"Nay, but your ownselves have beguiled you into something. So patience is most fitting (for me). May be Allah will bring them (back) all to me. Truly He! only He is All-Knowing, All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No' he (Jacob) said, 'your souls have tempted you to do something. But come sweet patience. Allah may bring them all to me. He alone is the Knowing, the Wise'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Rather, your souls have contrived something for you. Patience is a virtue. Perhaps God will bring them all back to me. He is the Knowing, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Jacob] said, \"Rather, your souls have enticed you to something, so patience is most fitting. Perhaps Allah will bring them to me all together. Indeed it is He who is the Knowing, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:83] ‘Nay,’ he said, ‘but your souls have beguiled you into, have adorned [for you], something, and you did it: he accused them because of what had happened with them before concerning Joseph. Yet comely patience, will be my [course of] patience! It may be that God will bring them, Joseph and his two brothers, all [back] to me. Indeed He is the Knower, of my predicament, the Wise’, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((And when they came unto their father and had spoken thus to him) he said) Jacob said to them: (Nay, but your minds have beguiled you into something) your minds have enticed you to do something, and so you did it. ((My course is) comely patience!) what I have to do is to be patient and show no anxiety. (It may be that Allah will bring them all) Joseph and his full brother as well as Judah (unto me. Lo! He, only He, is the Knower) of their whereabouts, (the Wise) in relation to returning them to me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قال بل سولت لكم أنفسكم أمراً } أي: زيّنت طبائعكم الجسمانية لكم أمر التلذذ باللذات البدنية والشهوات الحسيّة فحسبتموها كمالاً، وتتبع المعقولات والتزام الشرائع والتآمر بالفضائل نقصاً { فصَبْرٌ جميلٌ } أي: فأمركم صبر جميل في العمل بالشرائع والفضائل دائماً والوقوف مع حكم الشرع والعقل، أو صبر جميل على الاستمتاع على وجه الشرع أجمل بكم من الإباحة والاسترسال بحكم الطبيعة، أو فأمري صبر جميل في بقاء يوسف القلب وإخوته على استشراق الأنوار القدسية واستنزال الأحكام الشرعية واستخراج قواعدها التي لا مدخل لي فيها، فلا بدّ لي من فراقهم إلى أوان فراغهم إلى رعاية مصالح الجانبين والوفاء بكلا الأمرين، أي: المعاش والمعاد، فإنّ العقل كما يقتضي طلب الكمال وإصلاح المعاد، يقتضي صلاح البدن وترتيب المعاش وتعديل المزاج بالغذاء وتربية القوى باللذات، أو فأمري صبر جميل على ذلك { عسى الله أن يأتيني بهم جميعاً } من جهة الأفق الأعلى والترقي عن طوري إلى ما يقتضيه نظري ورأيي من مراعاة الطرفين ومقامي ومرتبتي من اختيار التوسط بين المنزلتين { إنه هو العليم } بالحقائق { الحكيم } بتدبير العوالم، فلا يتركهم مراعين للجهة العلوية، ذاهلين عن الجهة السفلية، فيخرّب مدينة البدن ويهلك أهلها، وذلك قبل التمتيع التام الذي أشرنا إليه إذ هو مقام الاجتهاد بعد الكشف والسلوك في طريق الاستقامة بعد التوحيد\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سمع تعقوب ما سمع تأسف وتأوه وبكى كثيراً { قَالَ } من أين يعرف العزيز أن السارق يؤخذ لسرقته { بَلْ سَوَّلَتْ } أي: زينت حسنت { لَكُمْ أَنفُسُكُمْ أَمْراً } أن تفرقوا أبني عني ظلماً وزوراً كما فرقتم أخاه فيما مضى { فَصَبْرٌ جَمِيلٌ } أي: أمري صبر جميل؛ إذ الصبر أجمل مني فيما فرطتم في ابنيَّ أيها المسرفون المفسدون { عَسَى ٱللَّهُ } المطالع بحالي وحزني بمقتضى لطفه وسعة جوده ورحمته { أَن يَأْتِيَنِي بِهِمْ } أي: يوسف وأخيه وكبيركم المتخلف عنكم { جَمِيعاً } مجتمعين { إِنَّهُ } سبحانه ذاته { هُوَ ٱلْعَلِيمُ } بمناجاة عباده ونيلهم إلى حاجاتم { ٱلْحَكِيمُ } [يوسف: 83] في أفعاله على مقتضى مصالح عباده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } لهم أبوهم: { بل سَوَّلت لكم أنفسُكم أمراً } أي: زينت لكم أمراً فصنعتموه، وإلا فمن أين يدري الملك أن السارق يُؤخذ في السرقة، إذ ليست بشريعته، { فصبر جميلٌ } أي: فأمري صبر جميل، { عسى اللهُ أن يأتيني بهم جميعاً } بيوسف وبنيامين، وأخيهما الذي بقي بمصر { إنه هو العليمُ } بحالي وحالهم، { الحكيم } في تدبيره\n رُوي أن عزرائيل دخل ذات يوم على يعقوب ـ عليهما السلام ـ فقال له يعقوب: جئت لقبض روحي، أو لقبض روح أحد من أولادي وأهلي؟ قال: إنما جئت زائراً، فقال له: أقسمت عليك بالله إلا ما أخبرتني، هل قبضت روح يوسف؟ فقال: لا، بل هو حي سَوِيّ، وهو ملك وله خزائن، وجنود وعبيد، وعن قريب يجمع الله شملك به\n هـ\n  الإشارة: فلما استيأس القلب من الدنيا، والرجوع إليها، وقطع يأسه من حظوظها وهواها، خلصت له المناجاة وصفت له أنوار المشاهدات، وأنواع المكالمات، والقلب هو كبير الأعضاء وملكها، فيقول لها: ألم تعلموا أن الله قد أخذ عليكم موثقاً ألا تعصوه ولا تُخالفوه، ومن قبل هذا وهو زمان البطالة، قد فرطتم في عبادته، فلن أبرح أرض العبودية حتى يأذن لي في العروج إلى سماء شهود عظمة الربوبية، أو يحكم لي بالوصال، وهو خير الحاكمين\n فإن وقعت من الجوارح هفوة فيقال لها: ارجعوا إلى أبيكم ـ وهو القلب ـ فقولوا: إن ابنك سرق، أي: تعدى وأخذ ما ليس له من الهوى فيما ظهر لنا، وما شهدنا إلا بما علمنا، فرب معصية في الظاهر طاعة في الباطن، واسأل البشرية التي كنا فيها والخواطر التي أقبلنا على المعصية فيها، فيقول القلب: بل زينت لكم أنفسكم أمر الهوى، فدواؤكم الصبر الجميل، والتوبة للعظيم الجليل، عسى الله أن يأتيني بهم جميعاً، فنصرفهم في طاعة الله ومرضاته\n والله تعالى أعلم بأسرار حِكَم كتابه، فعلم الإشارة يقبل مثل هذا وأكثر\n وإياك والانتقاد فقد قالوا في باب الإشارة أرق من هذا وأغرب\n وبالله التوفيق\n ثم قال تعالى: { وَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَٰأَسَفَىٰ عَلَى يُوسُفَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:18",
      "similarity": 0.6009254400419926
    },
    {
      "verse": "47:25",
      "similarity": 0.5882666202480914
    },
    {
      "verse": "20:96",
      "similarity": 0.525993452471071
    },
    {
      "verse": "70:5",
      "similarity": 0.38732971162768987
    },
    {
      "verse": "73:10",
      "similarity": 0.36163025098202567
    }
  ]
}