{
  "chapter": "يوسف",
  "text": "فلما استيـسوا۟ منه خلصوا۟ نجيا قال كبيرهم الم تعلموا۟ ان اباكم قد اخذ عليكم موثقا من الله ومن قبل ما فرطتم فى يوسف فلن ابرح الارض حتى ياذن لى ابى او يحكم الله لى وهو خير الحكمين",
  "translations": [
    {
      "translation": "When they despaired of him, they went apart to talk alone. The eldest of them said, 'You know full well vour father had vou make a covenant with Allah concernina this, and how before vou failed him with Yusuf. I will not leave this land until I have permission from my father, or Allah decides about the case on my behalf. Truly He is the justest Judge of all.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they despaired of (persuading) him, they went aside to confer. The oldest of them said: \"You know that your father has pledged you in the name of God, and you have been guilty of iniquity in the case of Joseph before. I will not leave this place unless my father permits or God decides for me, for He is the best of all judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they had despaired of Joseph they went to a corner and counselled together. The eldest of them said: \"Do you not know that your father has taken a solemn promise from you in the name of Allah, and you failed in your duty towards Joseph? So I will not depart from this land until my father permits me, or Allah pronounces His judgement in my favour. He is the best of those who judge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they lost all hope (of convincing the Prince), they moved into a corner whispering to each other. The eldest among them said, \"Do you not remember that you had solemnly promised our father to return Benjamin to him and that before this you had broken your promise concerning Joseph? I shall never leave this land until my father gives me permission or God decides for me; He is the best Judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they did not anticipate anything from him, they went away and started consulting each other; their eldest brother said, “Do you not know that your father has taken from you an oath upon Allah, and before this, how you had failed in respect of Yusuf? Therefore I will not move from here until my father permits or Allah commands me; and His is the best command.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they despaired of him, they consulted in private. The eldest among them said: \"Know you not that your father did take an oath from you in Allah's Name, and before this you did fail in your duty with Yusuf Therefore I will not leave this land until my father permits me, or Allah decides my case and He is the Best of the judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they despaired of him, they retired, conferring privately together. The eldest of them said: Do you not know that your father took from you a covenant in Allah's name, and how you fell short of your duty with respect to Yusuf before? Therefore I will by no means depart from this land until my father permits me or Allah decides for me, and He is the best of the judges:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they despaired of moving him, they conferred privily apart. Said the eldest of them, 'Do you not know how your father has taken a solemn pledge from you by God, and aforetime you failed regarding Joseph? Never will I quit this land, until my father gives me leave, or God judges in my favour; He is the best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, When they despaired of (moving) him, they conferred together apart. The eldest of them said: Know ye not how your father took an undertaking from you in Allah's name and how ye failed in the case of Joseph aforetime? Therefore I shall not go forth from the land until my father giveth leave or Allah judgeth for me. He is the Best of Judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they had lost all hope of [persuading] him, they withdrew, conferring among themselves. The eldest said, \"Do you not know that your father took from you a pledge in God's name. You have already failed with regard to Joseph, so I shall never leave the land until my father permits me to, or God decides [things] for me. He is the best judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they despaired of him they counselled together privately. The eldest of them said: know ye not that your father hath taken an assurance from you before Allah? and aforetime ye have been remiss in your duty in respect of Yusuf; I so will by no means go forth from the land until my father giveth me leave or Allah judgeth for me, and He is the Best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they had despaired of [moving] him, they withdrew to confer privately. The eldest of them said, ‘Don’t you know that your father has taken a [solemn] pledge from you by Allah, and earlier you have neglected your duty in regard to Joseph? So I will never leave this land until my father permits me, or Allah passes a judgement for me, and He is the best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when they saw no hope of his (yielding), they held a conference in private. The leader among them said: \"Know ye not that your father did take an oath from you in Allah's name, and how, before this, ye did fail in your duty with Joseph? Therefore will I not leave this land until my father permits me, or Allah commands me; and He is the best to command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they despaired of him, they held a conference in private. The eldest among them said: \"Know you not that your father did take an oath from you in Allah's Name, and before this you did fail in your duty with Yusuf (Joseph)? Therefore I will not leave this land until my father permits me, or Allah decides my case (by releasing Benjamin) and He is the Best of the judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they despaired of him, they went in private to confer together. The eldest said: 'Do you not know that your father took a pledge from you in the Name of Allah, and that you failed before regarding Joseph? I shall never stir from this land until my father gives me leave or Allah makes known to me His judgement: He is the Best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they despaired of him, they conferred privately. Their eldest said, “Don’t you know that your father received a pledge from you before God, and in the past you failed with regard to Joseph? I will not leave this land until my father permits me, or God decides for me; for He is the Best of Deciders.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they had despaired of him, they secluded themselves in private consultation. The eldest of them said, \"Do you not know that your father has taken upon you an oath by Allah and [that] before you failed in [your duty to] Joseph? So I will never leave [this] land until my father permits me or Allah decides for me, and He is the best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:80]   So when they despaired of [moving] him, they withdrew to confer privately [together] (najiyyan is a verbal noun that can be used to refer to one person or more, in other words [understand it as meaning] yunājī ba‘duhum ba‘dan, ‘one conferring with the other’). The most senior of them, in years — Reuben — or, [the most senior of them] in opinion — Judah, said: ‘Are you not aware that your father has taken a solemn pledge, a covenant, from you by God, concerning your brother, and formerly (wa-min qablu mā: the mā is extra) you failed regarding Joseph? (but it [the mā] is also said to be relating to the verbal action, [in other words it is] a subject, the predicate of which is min qabl, ‘formerly’). So I will never leave, part with, this land, the land of Egypt, until my father permits me, to return to him, or God judges for me, through the deliverance of my brother; and He is the best, the fairest, of judges.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So, when they despaired of (moving) him, they conferred together apart. The eldest of them) the best among them in reasoning: Judah (said: Know ye not) my brothers (how your father took an undertaking from you in Allah's name) that you will bring him back (and how you failed) in your pledge and covenant (in the case of Joseph aforetime) before this boy? (Therefore I shall not go forth from the land) of Egypt (until my father giveth leave) gives me leave to return; it is also said that this means: until my father gives me permission to fight them (or Allah judgeth for me) the return of my brother. (He is the Best of Judges) in relation to returning him to me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱسْتَيْأَسُواْ مِنْهُ } معناهُ يَئِسوا مِنهُ\n\n\n\n\nوقوله تعالى: { خَلَصُواْ نَجِيّاً } معناه اعتَزلُوا يَتشاورُونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Despair not of Allah's mercy,\" its meaning is, \"Do not despair of Allah's mercy.\"\n And His saying, {They will be purified}, its meaning is that they will be divorced.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا ٱسْتَيْأَسُواْ مِنْهُ } ومن تبديدله { خَلَصُواْ } وخرجوا من عنده { نَجِيّاً } متناجين في نفوسهم بأن ما عليه العزيم هو الحق\n لأ أخذ البريء بدل المجرم ظلم صريح\n ثم لما صمموا العزم إلى الرجوع وآيسوا من بنيامين { قَالَ كَبِيرُهُمْ } رأياً وسناً\n وهو روبيل أو شمعون: { أَلَمْ تَعْلَمُوۤاْ } أيها المسرفون { أَنَّ أَبَاكُمْ قَدْ أَخَذَ عَلَيْكُمْ مَّوْثِقاً } عظيماً وعهداً وثيقاً { مِّنَ ٱللَّهِ } القادر المقتدر على أنواع الغضب والانتقام أن ترجعوا به { وَ } أيضاً لم تستحيوا من الله ولم تتذكروا { مِن قَبْلُ } في سالف الزمان { مَا فَرَّطتُمْ فِي } حق { يُوسُفَ } من الإذلال والزجر التام والألم المفرط والإلقاء في الجب وبيعه رقيقاً\n وغير ذلك من أنوا الأذبات معه\n وأنتم ما استحييتم من الله\n تدعون وراثة الأنبياء وتنسبون أنفسكم إليهم وبعد اللتيا والتي فعلتم بأخيه أيضاً هذا { فَلَنْ أَبْرَحَ ٱلأَرْضَ } أي: لا أزول عن أرض مصر { حَتَّىٰ يَأْذَنَ لِيۤ أَبِيۤ أَوْ يَحْكُمَ ٱللَّهُ لِي } بالخروج منها { وَهُوَ خَيْرُ ٱلْحَاكِمِينَ } [يوسف: 80]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: نجياً: حال\n أي: انفردوا عن الناس مناجين\n وإنما أفرده لأنه مصدر\n أو بزنته\n ومن قبل ما: يحتمل أن تكون مزيدة ومصدرية مرفوعة بالابتداء\n أي: تفريطكم في يوسف واقع من قبل هذا\n قاله ابن جزي\n وفيه نظر فإن الظرف المقطوع لا يقع خبراً\n أوْ منصوبة بالعطف على مفعول تعلموا\n أي: لم تعلموا أخذ ميثاق أبيكم\n وتفريطكم في يوسف قبل هذا\n يقول الحق جل جلاله: { فلما استيأسوا } أي يئسوا { منه } من يوسف أن يجيبهم إلى ما دعوه إليه من أخذ أحدهم مكان أخيهم\n { خَلَصُوا } أي: تخلصوا من الناس\n وانفردوا عنهم { نجيّاً } متناجين\n يناجي بعضهم بعضاً: كيف وقع للصاع؟ وكيف يتخلصون من عهد أبيهم؟ ثم فسر تلك المناجاة: { قال كبيرُهمْ } في السن\n وهو رُوَيْبيل\n أو في الرأي\n وهو شمعون\n وقيل يهوذا: { ألم تعلموا أن أباكم قد أخذ عليكم موثقاً من الله } عهداً وثيقاً\n وحلفتم له لتأتن بابنه إلا أن يُحاط بكم؟ فكيف تصنعون معه\n { ومن قبلُ } هذا { فرطتم في يوسف } واعتذرتم بالأعذار الكاذبة؟ { فلن أبرح الأرض } فلن أفارق أرض مصر { حتى يأذن لي أبي } في الرجوع\n { أو يحكم الله لي }: أو يقضي لي بالخروج منها\n أو بتخليص أخي منهم قهراً\n { وهو خيرُ الحاكمين } لأن حكمه لا يكون إلا بالحق\n رُوي أنهم كلموا العزيز في إطلاقه\n فقال رويبيل\n وقيل: يهوذا: أيها الملك\n لتتركن أخانا أو لأصيحن صيحة تضع منها الحوامل\n ووقف شعر جسده\n فخرجت من ثيابه\n فقال يوسف لابنه الصغير\n واسمه نائل: قم إلى جنبه ومُسَّه\n فمسه\n وكان بنو يعقوب إذا غضب أحدهم لا يسكن غضبه إلا إذا مسه أحد من آل يعقوب\n فلما مسه ولد يوسف عليه السلام سكن غضبه\n فقال: من هذا؟ إن في هذا البلد لبذراً من بذر يعقوب\n  وقيل: إنهم هموا بالقتال\n وقال يهوذا لإخواته: تفرقوا في أسواق مصر\n وأنا أصيح صيحة تشق مراريهم\n فإذا سمعتم صوتي\n فاخربوا يميناً وشمالاً\n فلما غضب\n وأراد أن يصيح مسه ولد يوسف فسكن\n فلما لم يسمعوا صوته أتوا إليه فوجدوا قد سكن غضبه\n فقال: إن هنا بذراً من آل يعقوب\n ثم قال لهم: { ارجعوا إلى أبيكم فقولوا يا أبانا أنّ ابنك سرق } على ما شهدنا من ظاهر الأمر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:91",
      "similarity": 0.5666503299042166
    },
    {
      "verse": "18:60",
      "similarity": 0.361469809822459
    },
    {
      "verse": "20:45",
      "similarity": 0.28507124867018485
    },
    {
      "verse": "39:56",
      "similarity": 0.25069229134800497
    },
    {
      "verse": "6:61",
      "similarity": 0.24491070690522396
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/12:80.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/12:80.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/12:80.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}