{
  "chapter": "يوسف",
  "text": "ولما فصلت العير قال ابوهم انى لاجد ريح يوسف لولا ان تفندون",
  "translations": [
    {
      "translation": "And when the caravan went on its way, their father said, 'I can smell Yusuf's scent! You probably think I have become senile.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The caravan departed (from Egypt) and Jacob said (at home): \"Say not that I am in my dotage, but I get the smell of Joseph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as the caravan set out (from Egypt), their father said (in Canaan): \"Indeed I smell the fragrance of Joseph. I say so although you may think that I am doting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the caravan left the town, their father said, \"I smell Joseph's scent. I hope that you will not accuse me of senility\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the caravan left Egypt, their father said*, “Indeed I sense the fragrance of Yusuf, if you do not call me senile.” (* Prophet Yaqub said this in Palestine, to other members of his family. He could discern the fragrance of Prophet Yusuf’s shirt from far away.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the caravan departed, their father said: \"I do indeed sense the smell of Yusuf, if only you think me not senile.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the caravan had departed, their father said: Most surely I perceive the greatness of Yusuf, unless you pronounce me to be weak in judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when the caravan set forth, their father said, 'Surely I perceive Joseph's scent, unless you think me doting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the caravan departed their father had said: Truly I am conscious of the breath of Joseph, though ye call me dotard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the caravan set out from Egypt, their father [in Canaan] said, \"You may think I am senile, but I certainly perceive the breath of Joseph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the caravan had departed, their father said: surely feel the smell of Yusuf, if ye think not that I am doting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As the caravan set off, their father said, ‘I sense the scent of Joseph, if you will not consider me a dotard.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the caravan left (Egypt), their father said: \"I do indeed scent the presence of Joseph: Nay, think me not a dotard.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the caravan departed, their father said: \"I do indeed feel the smell of Yusuf (Joseph), if only you think me not a dotard (a person who has weakness of mind because of old age).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As the caravan departed, their father said: 'I smell the scent of Joseph, unless you think I am foolish'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As the caravan set out, their father said, “I sense the presence of Joseph, though you may think I am senile.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the caravan departed [from Egypt], their father said, \"Indeed, I find the smell of Joseph [and would say that he was alive] if you did not think me weakened in mind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:94] And as the caravan set forth, leaving behind the palm fields of Egypt, their father said, to those of his sons and their children present, ‘Truly I sense the scent of Joseph — which the east wind had brought to him, with God’s permission, across a distance of three or eight or more days’ journey; if only you did not think me doting’, [if only] you [did not] regard me as foolish, you would believe me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When the caravan departed) when the caravan left al-'Arish, a township between Egypt and Canaan, (their father) Jacob (had said: Truly I am conscious of the breath of Joseph, though ye call me dotard) unless you 254 say I am foolish, discredit me or disbelieve in what I say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنِّي لأَجِدُ رِيحَ يُوسُفَ } قالَ زيدُ بن علي عليهما السَّلامُ: وَجَدَها مِن مَسِيرةِ عَشرةِ أَيامٍ\n\n\n\n\nوقوله تعالى: { لَوْلاَ أَن تُفَنِّدُونِ } معناهُ تُكَذِّبون\n ويقالُ تُسَفِّهون\n\n",
      "translations": [
        {
          "translation": "\nAnd [in] the saying of the Most High, {Indeed, I smell the fragrance of Joseph} - Zayd ibn `Ali, peace be upon them both, said: \"He found it [to be] from the scent of a ten-day journey.\"\n\nAnd His saying, {Had it not been for you, [O Muhammad], they would have almost certainly disbelieved} [means that] you deny them.\n\n\nYou are said to be foolish.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولما فَصَلَتِ العيرُ } من مصر، وخرجت من عمارتها، { قال أبوهم } لمن حضره: { إني لأجِدُ ريحَ يوسف } أوجده الله، ريح ما عَبَق من قميصه حين أقبل إليه به يهوذا من ثمانين فرسخاً لأن يعقوب كان إذ ذاك ببيت المقدس، ويوسف بمصر، { لولا أن تُفَنِّدون } تنسبوني إلى الفِند، وهو: نُقصان عَقْلِ يحدث من هِرَم\n ولذلك لا يقال عجوز مفندة لأن نقصان عقلها ذاتي\n أي: لولا أن تحمِّقوني لقلت إنه قريب، أو لصدقتموني في ذلك، أو لولا أن تلوموني، وتردوا عليّ قولي لقلت إنه ريح يوسف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:82",
      "similarity": 0.3652769874569299
    },
    {
      "verse": "12:70",
      "similarity": 0.2462678289883089
    },
    {
      "verse": "12:87",
      "similarity": 0.06442070198930476
    },
    {
      "verse": "12:99",
      "similarity": 0.06380218490733276
    },
    {
      "verse": "12:11",
      "similarity": 0.0621711019391792
    }
  ]
}