{
  "chapter": "يوسف",
  "text": "قالوا۟ تالله لقد ءاثرك الله علينا وان كنا لخطـين",
  "translations": [
    {
      "translation": "They said: \"By God, God has favoured you above us, for we have indeed been sinners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We swear by Allah! Indeed Allah has chosen you in preference to us and we were truly guilty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We swear by God that He has given preference to you over us and we have sinned\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “By Allah, undoubtedly Allah has given you superiority over us, and we were indeed guilty.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"By Allah! Indeed Allah has preferred you above us, and we certainly have been sinners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: By Allah! now has Allah certainly chosen you over us, and we were certainly sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By God,' they said, 'God has indeed preferred thee above us, and certainly we have been sinful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: By Allah, verily Allah hath preferred thee above us, and we were indeed sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The brothers] said, \"By God! Most certainly God has raised you high above us, and we have indeed been guilty!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: by Allah! assuredly Allah hath chosen thee above us, and we have been sinners indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘By Allah, Allah has certainly preferred you over us, and we have indeed been erring.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"By Allah! indeed has Allah preferred thee above us, and we certainly have been guilty of sin!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"By Allah! Indeed Allah has preferred you above us, and we certainly have been sinners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah' they said, 'Allah has preferred you above us all. We have indeed been sinful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “By God, God has preferred you over us. We were definitely in the wrong.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"By Allah, certainly has Allah preferred you over us, and indeed, we have been sinners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:91] They said, ‘By God, truly God has preferred you over us, with kingship and in other ways, and indeed we (wa-in: in is softened, in other words [it is understood as] innā, ‘indeed we’) have been erring’, sinful towards you and treated you disgracefully.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said) Joseph's brothers said to Joseph: (By Allah, verily Allah hath preferred you above us, and we were indeed sinful) towards you, and disobedient of Allah..\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما ظهر عليهم ما ظهر من الفضيحة والشناعة وأنواع الندامة والكآبة { قَالُواْ } متضرعين، مستحيين، متذللين، مقسمين على سبيل التثبيت والتقرير { تَٱللَّهِ } يا أخانا { لَقَدْ آثَرَكَ ٱللَّهُ } واصطفاك { عَلَيْنَا } وأراك في المنام ما أراك من سجود الشمس والقمر والكواكب المعتبرة، وكفاك هذا دليلاً على نجابتك واختيارك علينا، مع أن أبانا قد علم منك ما علم من الرشد وكمال العلم والفضل؛ لذلك آثرك علينا محبة وعطفاً { وَ } بالجملة: { إِن كُنَّا } أي: إنَّ كنا { لَخَاطِئِينَ } [يوسف: 91] إذلالك وإرادة إهلاكك وضربك وإيذائك، وفي إبطال إرادة الله ومشيئته وكما حكمته وقدرته، وفي إيذاء أبينا بمفارقتك عنه وإيقاعه بأنواع البليات والنكبات إلى حيث ابيضت كريمتاه من فراقك، فالآن ألأمر بيدك وإنَّا مجرمون، معترفون بأنواع الجرائم، فلك الاختيار، وعلينا الحسرة والندامة وأنواع الكآبة والسآمة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا تالله لقد آثَرَكَ اللهُ علينا } بحسن الصورة وكمال السيرة، أو فضلك علينا رغماً على أنفنا، { وإن كنا لخاطئين } أي: والحال أن شأننا أنَّا كنا مذنبين فيما فعلنا معك",
      "translations": []
    }
  ]
}