{
  "chapter": "يوسف",
  "text": "اذهبوا۟ بقميصى هذا فالقوه على وجه ابى يات بصيرا واتونى باهلكم اجمعين",
  "translations": [
    {
      "translation": "Go with this shirt of mine and cast it on my father's face and he will see again. Then come to me with all your families.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take my shirt and put it on my father's face; his eyesight will be restored; and bring your entire family to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this shirt of mine and throw it over my father's face. He will regain his sight. And bring to me all your family.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take my shirt and place it unto my father's face. This will restore his eye-sight. Then bring the whole family to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Take along this shirt of mine and lay it on my father’s face, his vision will be restored; and bring your entire household to me.” (Prophet Yusuf knew that this miracle would occur.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go with this shirt of mine, and cast it over the face of my father, his vision will return, and bring to me all your family.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this my shirt and cast it on my father's face, he will (again) be able to see, and come to me with all your families.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go, take this shirt, and do you cast it on my father's face, and he shall recover his sight; then bring me your family all together.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go with this shirt of mine and lay it on my father's face, he will become (again) a seer; and come to me with all your folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go with this shirt of mine and cast it upon my father's face. He will recover his sight; thereupon come [back] to me with all your family.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go with this shirt of mine and cast it upon my father's face; he shall become clear-sighted; and bring unto me all your household.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this shirt of mine, and cast it upon my father’s face; he will regain his sight, and bring me all your folks.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go with this my shirt, and cast it over the face of my father: he will come to see (clearly). Then come ye (here) to me together with all your family.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go with this shirt of mine, and cast it over the face of my father, he will become clear-sighted, and bring to me all your family.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go, take this shirt of mine and cast it over my father's face, he will recover his sight. Then return to me with all your family'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Take this shirt of mine, and lay it over my father’s face, and he will recover his sight. And bring your whole family to me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this, my shirt, and cast it over the face of my father; he will become seeing. And bring me your family, all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:93] He [Joseph] asked them about his father; and they told him that his eyesight had gone. And so he said: Go with this shirt of mine — and this was the shirt of Abraham, the one he wore when he was thrown into the fire; he [Joseph] had it around his neck when he was at the bottom of the well. It [the shirt] had come from Paradise: Gabriel commanded him [Joseph] to send it off [to Jacob] saying that the scent of Paradise lingers in it, and whenever it is cast upon a sufferer, it heals him — and lay it on my father’s face, and he will recover his sight; and bring me all your folk’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Go with this shirt of mine) and his shirt was from Paradise (and lay it on my father's face, he will become (again) a seer) he will regain his sight; (and come to me with all your folk) they were about seventy people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعد تسليمهم وعفوهم وإخزاء الرعب عن خواطرهم، أمرهم بالذهاب إلى أبيهم المحزون؛ ليخلص عما عليه من الحزن المفرط، فقال: { ٱذْهَبُواْ } يا إخوتي { بِقَمِيصِي هَـٰذَا } - وهو عليه - فأخرجه ولفه بلا تنقية وغسل { فَأَلْقُوهُ عَلَىٰ وَجْهِ أَبِي يَأْتِ } أي: يرجع ويصير { بَصِيراً } بعدما كان فاقد العينين { وَ } بعد أن يصير بصيراً صحيحاً سوياً { أْتُونِي بِأَهْلِكُمْ } أي: جميع ما يسنب إليكم من النسوان والذراري والخدم والحشم { أَجْمَعِينَ } [يوسف: 93]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جواب لولا: محذوف، أي: لولا أن تفندون لقلت إنه قريب، أو لصدقتموني\n  يقول الحق جل جلاله: قال يوسف لإخوته لما عرفوه، وأزال ما بينه وبينهم من الوحشة، وقد أخذ قميصه: { اذهبوا بقميصي هذا } ، رُوي أن هذا القميص كان لإبراهيم الذي لبسه حين كان في النار، وقيل: ألبسه له جبريل حين خرج من النار، وكان من ثياب الجنة، ثم كان لإسحاق ثم ليعقوب، ثم كان دفعه ليوسف، فكان عنده في حِفَاظ من قصب، وكان في عنقه في الجب، وأمره جبريل بإرساله، وقال: إنه قميص يوسف الذي هو منه بمنزلة قميص كل واحد\n وبهذا تتبين الغرابة في أن وجد يعقوبُ ريحة من بُعدٍ ولو كان من قميص الجنة لما كان في ذلك غرابة، ويجده كل أحد\n هـ\n قلت: وما قاله لا ينهض لأن ما ظهر من الجنة إلى دار الدنيا لا يبقى على حاله دائماً لأنه من أسرار الغيب، بل لا يجده إلا أهل الذوق من أهل القرب، كنور الحجر الأسود، وغيره مما نزل من الجنة\n والله تعالى أعلم\n ثم قال لهم اذهبوا به: { فألقوه على وجهِ أبي يأتِ بصيراً } أي: يرجع بصيراً، علم ذلك بوحي، أو تجربة من القميص، { وأتوني بأهلكم أجمعين } نسائكم وذراريكم وأموالكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:26",
      "similarity": 0.530796330908316
    },
    {
      "verse": "12:27",
      "similarity": 0.5152804658911311
    },
    {
      "verse": "12:28",
      "similarity": 0.48416389380015823
    },
    {
      "verse": "12:18",
      "similarity": 0.3196012791277342
    },
    {
      "verse": "12:25",
      "similarity": 0.2621083991686958
    }
  ]
}