{
  "chapter": "يوسف",
  "text": "فلما دخلوا۟ على يوسف ءاوى اليه ابويه وقال ادخلوا۟ مصر ان شاء الله ءامنين",
  "translations": [
    {
      "translation": "Then when they entered into Yusuf's presence, he drew his parents close to him and said, 'Enter Egypt safe and sound, if Allah wills.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they went back to Joseph he gave his father and mother a place of honour, and said: \"Enter Egypt in peace by the will of God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they went to Joseph, he took his parents aside and said (to the members of his family): \"Enter the city now, and if Allah wills, you shall be secure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they all came to Joseph, he welcomed his parents and said, \"Enter the town in peace, if God wants it to be so.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they all reached in Yusuf’s company, he kept his parents close to him, and said, “Enter Egypt, if Allah wills, in safety.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they came in before Yusuf, he took his parents to himself and said: \"Enter Egypt, if Allah wills, in security.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they came in to Yusuf, he took his parents to lodge with him and said: Enter safe into Egypt, if Allah please.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they entered unto Joseph, he took his father and mother into his arms saying, 'Enter you into Egypt, if God will, in security.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they came in before Joseph, he took his parents unto him, and said: Come into Egypt safe, if Allah will!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they presented themselves before Joseph, he drew his parents to him and said, \"Welcome to Egypt, in safety, if God wills!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they entered unto Yusuf, he betook his parents unto himself. and said: enter Misr, if Allah will, in security.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they entered into the presence of Joseph, he set his parents close to himself, and said, ‘Welcome to Egypt, in safety, God willing!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they entered the presence of Joseph, he provided a home for his parents with himself, and said: \"Enter ye Egypt (all) in safety if it please Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they entered unto Yusuf (Joseph), he betook his parents to himself and said: \"Enter Egypt, if Allah wills, in security.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered before Joseph, he took his father and mother into his arms and said: 'Welcome to Egypt, safe, if Allah wills'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they entered into the presence of Joseph, he embraced his parents, and said, “Enter Egypt, God willing, safe and secure.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they entered upon Joseph, he took his parents to himself and said, \"Enter Egypt, Allah willing, safe [and secure].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:99] And when they entered to Joseph, in his tent, he took his parents, his father and his mother — or [and] his maternal aunt — into his arms, and said, to them: ‘Enter into Egypt, if God will, in safety’, and they entered, and Joseph sat down on his throne.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they came in before Joseph, he took his parents unto him) he joined to him his father and stepmother, for his own mother was dead by then, (and said: Come into) dwell in (Egypt safe) from the enemies and from hunger, (if Allah will!) if Allah wills, you stay in Egypt safe from your enemies and hunger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وخرج إلى استقبالهم مع الملك وجنوده وجميع أهل مصر { فَلَمَّا دَخَلُواْ عَلَىٰ يُوسُفَ } ووصلوا إليه { آوَىٰ إِلَيْهِ } أي: اعتنق وضم يوسف { أَبَوَيْهِ } إلى نفسه وواسا معهما { وَقَالَ ٱدْخُلُواْ مِصْرَ إِن شَآءَ ٱللَّهُ آمِنِينَ } [يوسف: 99] عن نكبات الجدب والقحط وآذيات الرحيل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { فلما دخلوا على يوسف آوى إليه أبويه }\n قبل هذا الكلام محذوفات، وهي: فرحل يعقوب بأهله حتى بلغوا إليه، ولما دخلوا على يوسف\n\n\n الخ\n رُوي أن يوسف عليه السلام وجه إليه رواحل وأموالاً ليتجهز إليه بمن معه، وأرسل إليه مائة وثمانين كسوة من رفيع الثياب والعمائم لإخواته، وقميصان مُذَهبان للإناث، فلما وصلت إلى يعقوب لبس، وألبس أولاده\n وركبوا المراكب، وخرجوا من أرض كنعان يريدون مصر، فلما قربوا، أًمَرَ يوسف عليه السلام العساكر أن تخرج معه للقائهم، فأول من لقيهم ثلاثون ألف فارس، كلهم يسجدون بين يدي يعقوب، وهو يتعجب من عظم تلك الأجناد، ويضحك من نصر الله تعالى، وعزه لا بنه\n ثم لقيهم البغال، والجواري لنساء إخوته وأولادهم\n ثم لقيهم أربعون ألف شيخ من الوزراء والكبراء\n ثم استقبلهم يوسف عليه السلام مترجلاً ماشياً على قدميه، متواضعاً لأبيه، في مائة ألف، كلهم على أرجلهم، معهم الملك \" ريَّان \" ثم سلم يوسف عليه السلام والملك على أبيه، ثم اقبلا يبكيان، وبكى إخوته وضج الناس بالبكاء، ثم ضم إليه أبويه، وقيل: أباه وخالته، { وقال ادخلوا ان شاء الله آمنين } ، ثم حُمل يعقوب عليه السلام في هودج من الذهب، ويوسف عليه السلام، وإخوته يمشون بين يديه مترجلين حتى دخلوا مصر، ثم أتوا إلى قصر مملكته\n قال ابن عباس: فجلس يوسف عليه السلام على سريره، وأبوه عن يمينه، وخالته عن شماله، وإخوته بين يديه، فخروا له سجداً لأنها كانت في ذلك الزمان ـ يعني تحيتهم على الملوك ـ رُوي أنهم قالوا في سجودهم: سبحان مولف الشتات بعد الإياس، سبحان كاشف الضر بعد البأس\n فقال يوسف لأبيه: { يا أبت هذا تأويل رؤياي من قبل\n\n\n } الخ ـ هكذا ذكر القصة صاحب الزهرالأنيق في قصة يوسف الصديق\n وهذا معنى قوله: { فلما دخلوا على يوسف } بلده ومملكته { آوى إليه أبويه } أي: اعتقهما، وسلم عليهما، وضمهما إليه\n قيل: الأبوين حقيقة\n وقيل: أباه وخالته، ونزَّل الخالة منزلة الأم تنزيلَ العم منزلة الأب في قوله:\n\n[البقرة: 133]\n { وقال ادخلوا مصر إن شاء الله آمنين } من القحط وأصناف المكاره\n والمشيئة متعلقة بالدخول المكيَّف بتلك الهيئة لا بالأمن\n وقال ابن جزي: راجعة إلى الأمن\n قال البيضاوي: وكان أولاد يعقوب الذين دخلوا مصر اثنين وسبعين رجلاً، وامرأة، وكانوا حين خرجوا مع موسى ستمائة ألف وخمسمائة وبضعة وتسعين رجلاً سوى الذرية والهرمى\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:51",
      "similarity": 0.6517026982848557
    },
    {
      "verse": "10:87",
      "similarity": 0.6262670325848517
    },
    {
      "verse": "12:21",
      "similarity": 0.5065917583896972
    },
    {
      "verse": "12:69",
      "similarity": 0.41130535275118624
    },
    {
      "verse": "12:58",
      "similarity": 0.23997134706170492
    }
  ]
}