{
  "chapter": "يوسف",
  "text": "اقتلوا۟ يوسف او اطرحوه ارضا يخل لكم وجه ابيكم وتكونوا۟ منۢ بعده قوما صلحين",
  "translations": [
    {
      "translation": "Kill Yusuf or expel him to some land so that your father will look to you alone and then you can be people who do right.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let us kill Joseph or cast him in some distant land so that we may get our father's exclusive affection; then play innocent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So either kill Joseph or cast him into some distant land so that your father's attention may become exclusively yours. And after so doing become righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them suggested, \"Let us kill Joseph or leave him somewhere far away from the presence of our father. Only then shall we receive equal treatment and thereafter can become righteous people\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Kill Yusuf or throw him somewhere in the land, so that your father’s attention may be directed only towards you, and then after it you may again become righteous!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kill Yusuf or cast him out to some (other) land, so that the favor of your father may be given to you alone, and after that you will be righteous folk.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Slay Yusuf or cast him (forth) into some land, so that your father's regard may be exclusively for you, and after that you may be a righteous people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kill you Joseph, or cast him forth into some land, that your father's face may be free for you, and thereafter you may be a righteous people.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(One said): Kill Joseph or cast him to some (other) land, so that your father's favour may be all for you, and (that) ye may afterward be righteous folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, let us put Joseph to death or cast him away to some [far-off] land, so that our father's attention should turn only to us, and you can thereafter become a righteous people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Slay Yusuf or cast him forth to some land; your father's countenance will be free for you, and ye shall be thereafter a people favoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Kill Joseph or cast him away into some [distant] land, so that your father’s attention may be exclusively towards you, and thereafter you may become a righteous lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Slay ye Joseph or cast him out to some (unknown) land, that so the favour of your father may be given to you alone: (there will be time enough) for you to be righteous after that!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kill Yusuf (Joseph) or cast him out to some (other) land, so that the favour of your father may be given to you alone, and after that you will be righteous folk (by intending repentance before committing the sin).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Let us) kill Joseph, or cast him away in some (far off) land, so that your father's face will be left for you, and afterwards you will be a righteous nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Kill Joseph, or throw him somewhere in the land, and your father‘s attention will be yours. Afterwards, you will be decent people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kill Joseph or cast him out to [another] land; the countenance of your father will [then] be only for you, and you will be after that a righteous people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:9] Kill Joseph or cast him away into some land, that is, into some distant land, so that your father might be solely concerned with you, so that he might turn [his attention] to you and not be distracted by anyone else, and that thereafter, that is, after killing Joseph or casting him away, you might be a righteous folk’, by repenting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then they said to one another: (Kill Joseph or cast him to some (other) land) in a pit, (so that your father's favour may be all for you) so that your father may turn entirely to you, (and (that) ye may afterward) after killing him (be righteous folk) repentant for killing him; it is also said that this means: your relationship with your father will improve.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nواستنزالها العقل إلى الفكر في باب المعاش وتحصيل أسبابه والتوجه نحوه هو معنى قولهم: { يخل لكم وجه أبِيكم وتكونوا من بعده قوماً صالحين } أي: في ترتيب المعاش وتهيئة أسبابه على حسب المراد\n ومراودتها للعقل عن القلب بالتسويلات الشيطانية والتعزيرات النفسانية مع كراهية العقل لذلك هو معنى قولهم عند مراودة يعقوب عنه: { أرسله معنا غداً يَرْتعُ ويَلعبُ } وافتراؤهم على الذئب هو أنّ القوة الغضبية إذا ظهرت واستشاطت حجبت القلب بالكلية عن أفعاله الخاصة به\n والظاهر من حالها أنها أقوى إضراراً به وإبطالاً لفعله وحجباً له الذي هو معنى الأكل مع أن القوة الشهوانية والحواس وسائر القوى أشدّ نكاية في القلب وأضرّ به في نفس الأمر وأجذب له إلى الجهة السفلية وأشدّ إباء وامتناعاً من قبول السياسات العقلية وطاعة الأوامر والنواهي الشرعية وإذعان القلب بالموافقة في طلب الكمالات الروحية منها\n وظهور ذلك الأثر من القوة الغضبية مع كونه بخلاف ذلك في الحقيقة هو الدم الكاذب على قميصه وابيضاض عين يعقوب في فراقه عبارة عن كلال البصيرة وفقدان نور العقل عند كون يوسف القلب في غيابة جبّ الطبيعة\n وبعض السيّارة الذي أخرجه من البئر هو القوّة الفكرية وشراؤه من عزيز مصر\n  { بثمن بخسٍ دراهم معدودة } تسليمهم له إلى عزيز الروح الذي هو من مصر مدينة القدس بما يحصل للقوة الفكرية من المعاني والمعارف الفائضة عليها من الروح عند استنارتها بنوره وقربها منه\n فإن القوة الفكرية لما كانت قوة جسمانية\n والقلب ليس بجسماني\n لم تصل إلى مقامه إلا عند كونه مغشى بغشاوات النفس في مقام الصدر أي: الوجه الذي يلي النفس منه\n وأما إذا تجرّد في مقام الفؤاد أو وصل إلى مقام الروح الذي سموه السرّ فتتركه عند عزيز الروح وتسلمه إليه وتفارقه على الدريهمات التي تحصل لها بقربه من المعاني المذكورة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتتشاوروا لمقت يوسف وهلاكه حتى لا يحلق العار عليكم { ٱقْتُلُواْ يُوسُفَ } حتى ييأتس أبوكم منه ويقبل إليكم بالكلية { أَوِ ٱطْرَحُوهُ أَرْضاً } بعيدة عن العمران غاية البعد حتى ينساه أبوه\n وحينئذ { يَخْلُ لَكُمْ وَجْهُ أَبِيكُمْ } أي: يخص ويخلص لكم مواجهة أبيكم خالياً عن أغياركم\n ويقتصر حينئذ التفاته وتحننه نحوكم { وَتَكُونُواْ مِن بَعْدِهِ } أي: بعد فقد يوسف عن نظر أبيكم وغيبته من عنه { قَوْماً صَالِحِينَ } [يوسف: 9] لخدمته وصحبته ومؤانسته\n أو المعنى بأن تتوبوا بعدما صدر عنكم هذه الجريمة\n ولتكونوا من بعده قوماً صالحين تائبين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: قال إخوة يوسف لما حركهم الحسد { اقتلوا يوسف } قيل: إنما قاله شمعون ودان\n ورضي به الآخرون\n { أو اطرَحُوهُ أرضاً } أي: في أرض بعيدة يأكله السباع\n أو يلتقطه أحد\n فإن فعلتم { يَخلُ لكم وجهُ أبيكم } أي: يصفْ إليكم وجه أبيكم فليقبل بكليته عليكم\n ولا يلتفت عنكم إلى غيركم\n ولا ينازعكم في محبته أحد\n { ولا تكونوا من بعده } من بعد يوسف\n أو الفراغ من أمره\n أو قتله\n أو طرحه\n { قوماً صالحين } تائبين إلى الله عما جنيتم\n مع محبة أبيكم\n أو صالحين في أمور دنياكم\n فإنها تنتظم لكم بخلو وجه أبيكم لكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:11",
      "similarity": 0.07637732972227114
    },
    {
      "verse": "3:144",
      "similarity": 0.07616651240515634
    },
    {
      "verse": "12:8",
      "similarity": 0.06930912507290822
    },
    {
      "verse": "12:99",
      "similarity": 0.06770434887739246
    },
    {
      "verse": "12:7",
      "similarity": 0.06686657550806294
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/012009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/012009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}