{
  "chapter": "يوسف",
  "text": "قال سوف استغفر لكم ربى انه هو الغفور الرحيم",
  "translations": [
    {
      "translation": "He said, 'I will ask my Lord to pardon you. He is Ever-Forgiving, Most Merciful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will ask my Lord to forgive you,\" he replied, \"for He is forgiving and kind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I shall pray to my Lord for your forgiveness, for He, and indeed He alone, is Ever Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"I shall ask my Lord to forgive you; He is All-forgiving and All-merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I shall soon seek forgiveness for you from my Lord; indeed He only is the Oft Forgiving, the Most Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I will ask my Lord for forgiveness for you, verily, He! Only He is the Oft-Forgiving, the Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I will ask for you forgiveness from my Lord; surely He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Assuredly I will ask my Lord to forgive you; He is the All-forgiving, the All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I shall ask forgiveness for you of my Lord. Lo! He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"I shall certainly ask my Lord to forgive you. Surely, He is the Most Forgiving and Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: presently I shall pray for forgiveness for you of my Lord; verily He! only He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘I shall plead with my Lord to forgive you; indeed He is the All-forgiving, the All-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Soon will I ask my Lord for forgiveness for you: for he is indeed Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I will ask my Lord for forgiveness for you, verily He! Only He is the Oft-Forgiving, the Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'I shall ask my Lord to forgive you. He is Forgiving, the Most Merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I will ask my Lord to forgive you. He is the Forgiver, the Most Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"I will ask forgiveness for you from my Lord. Indeed, it is He who is the Forgiving, the Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:98] He said, ‘Assuredly I shall ask forgiveness for you of my Lord. Lo! He is the Forgiving, the Merciful’: he [Jacob] put off this [plea of forgiveness] until [the last hour] before dawn, in order to be closer to [the likelihood of] it being accepted, or [he put it off] until the eve of Friday. They then departed for Egypt, where Joseph and the senior courtiers came out to meet them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) to them: (I shall ask forgiveness for you of my Lord) I will pray to Allah for you on the night of Friday, at the end of dawn. (He is the Forgiving, the Merciful) towards those who repent.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما تفرس يعقوب عليه السلام منهم الإخلاص والإنابة التامة والرجوع عن ظهر القلب { قَالَ سَوْفَ أَسْتَغْفِرُ لَكُمْ رَبِّيۤ } في ذاته { إِنَّهُ هُوَ ٱلْغَفُورُ } لذنوب عباده بعدما أخلصوا { ٱلرَّحِيمُ } [يوسف: 98] لهم يقبل توبتهم\n\n\n\n\nسوَّف أمر استغفارهم إلى ملاقاة يوسف والمشورة معه، يدل عليه ما رُوي أن يعقوب استقبل القبلة قائماً يدعو، وقام يوسف خلفه يؤمن، وقاموا خلفهما أذلة خاشعين حتى نزل جبري عليه السلام، فقال: إن الله قد أجاب دعوتك في حق أبنائك وعقد مواثيقهم بعدك على النبوة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:170",
      "similarity": 0.7526752977943875
    },
    {
      "verse": "37:175",
      "similarity": 0.7146661251035431
    },
    {
      "verse": "37:179",
      "similarity": 0.7146661251035431
    },
    {
      "verse": "39:39",
      "similarity": 0.7036986701814841
    },
    {
      "verse": "43:44",
      "similarity": 0.6690250568953487
    }
  ]
}