{
  "chapter": "يوسف",
  "text": "قال لا تثريب عليكم اليوم يغفر الله لكم وهو ارحم الرحمين",
  "translations": [
    {
      "translation": "He said. 'No blame at all will fall on vou. Todav vou have foraiveness from Allah. He is the Most Merciful of the merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on you today,\" he said, \"May God forgive you. He is the most merciful of all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: \"No blame lies with you today. May Allah forgive you. He is the Most Merciful of all those that are merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Joseph) said, \"No one will blame you on this day. God will forgive you; He is more Merciful than others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “There is no reproach on you, this day! May Allah forgive you – and He is the Utmost Merciful, of all those who show mercy.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"No reproach on you this day; may Allah forgive you, and He is the Most Merciful of those who show mercy!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: (There shall be) no reproof against you this day; Allah may forgive you, and He is the most Merciful of the merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'No reproach this day shall be on you; God will forgive you; He is the most merciful of the merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Have no fear this day! May Allah forgive you, and He is the Most Merciful of those who show mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"No blame [shall fall] on you this day; may God forgive you! And He is the Most Merciful of those who show mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said; no reproach upon you today. May Allah forgive you; and He is the Most Merciful of the merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘There shall be no reproach on you today. Allah will forgive you, and He is the most merciful of the merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"This day let no reproach be (cast) on you: Allah will forgive you, and He is the Most Merciful of those who show mercy!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"No reproach on you this day, may Allah forgive you, and He is the Most Merciful of those who show mercy!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'Let no reproach be on you this day. Allah will forgive you He is the Most Merciful of the merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “There is no blame upon you today. God will forgive you. He is the Most Merciful of the merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"No blame will there be upon you today. Allah will forgive you; and He is the most merciful of the merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:92] He said, ‘There shall be no reproach, [no] blame, on you this day — he specifically mentions this [day] because it was [the day] when they expected to be reproached, although any other day would have been more appropriate [for them to be reproached on]. God will forgive you, and He is the Most Merciful of the merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Joseph said to them: (Have no fear this day!) he says: I will not reproach you today. (May Allah forgive you) for what you did, (and He is the Most Merciful of those who show mercy) He is more Merciful than one's own parents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ تَثْرِيبَ عَلَيْكُمُ ٱلْيَوْمَ } معناه لاَ لَومَ عَلَيكُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Do not grieve today\" means do not blame yourselves.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما رأى يوسف منهم ما رأى من الندامة المفرطة والخجل والخذلان وأنواع الخيبة والخسران { قَالَ } لهم؛ تسلية عليهم وتزكية لنفسه بمقتضى نجابة طينته: { لاَ تَثْرِيبَ } أي: لا تقريع ولا توبيخ { عَلَيْكُمُ } مني في حال من الأحوال سيما { ٱلْيَوْمَ } الذي أنتم تعتذرون فيه وتستغفرون عني، فاعلموا أني عفوت لكم ما لي من الحقوق عليكم، وأبرأت ذمتكم عنها، بل { يَغْفِرُ ٱللَّهُ لَكُمْ } بعدما استغفرتم إليه مخصلين { وَهُوَ } سبحانه في ذاته { أَرْحَمُ ٱلرَّاحِمِينَ } [يوسف: 92] لأن رحم جميع الرحماء من ظل رحمته التي وسعت كل شيء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال لا تثريبَ }: لا عتاب { عليكم اليوم } أي: لا عقوبة عليكم في هذا اليوم\n ثم دعا لهم فقال: { يغفرُ الله لكم } ، فيوقف على اليوم\n وقيل: يتعلق بيغفر، فيوقف على ما قبله، وهو بعيد لأنه تحكم على الله، وإنما يصلح أن يكون دعاء، إذ هو الذي يليق بآداب الأنبياء، فكأنه أسقط حق نفسه بقوله: { لا تثريب عليكم اليوم } ، ثم دعا الله أن يغفر لهم الله حقه\n قاله ابن جزي، وصدر به البيضاوي\n وبه تعلم ضعف وقف الهبطي\n ثم قال في تمام دعائه: { وهو أرحمُ الراحمين } فإنه يغفر الصغائر والكبائر، ويتفضل على التائب\n قال البيضاوي: ومن كرم يوسف عليه السلام أنهم لما عرفوه أرسلوا له، وقالوا: إنك تدعوننا بالبكرة والعشي إلى الطعام، ونحن نستحي منك لما فرط منا فيك، فقال لهم: إن أهل مصر كانوا ينظرون إليَّ بالعين الأولى، ويقولون: سبحان من بلغ عبداً بيع بعشرين درهماً ما بلغ، ولقد شَرُفْت بكم، وعظمت في أعينهم حيث إنكم إخوتي، وإني من حفدة إبراهيم عليه السلام\n هـ\n الإشارة: من رام الدخول إلى حضرة الكريم الغفار، فليدخل من باب الذل والانكسار\n وفي الحِكَم: \" ما طلب لك شيء مثل الاضطرار، ولا أسرع بالمواهب مثل الذلة والافتقار \"\n فإذا قرعت الباب، ورمت الدخول مع الأحباب، فقل بلسان التضرع والانكسار: يا أيها العزيز الغفار مسنا الضر، وهو البعد والغفلة، وجئنا ببضاعة مزجاة عمل مدخول، وقلب معلول، فأوْفِ لنا ما أملناه من الجزاء المأمول، وتفضل علينا بالقبول والوصول، وقل: اليوم نغفر لكم ونغطي مساوءكم، ونوصلكم بما مني إليكم من الإحسان، لا بما منكم إلينا الطاعة والإذعان\n هؤلاء إخوة يوسف لما أظهروا فاقتهم، واستقلوا بضاعتهم، وأحضروا شكايتهم، سمح لهم وقربهم، وكشف لهم عن وجهه الجميل، ومنحهم العطاء الجزيل، فما ظنك بالرب العظيم الجليل، الذي هو أرحم الراحمين، ومحل أمل القاصدين\n ثم أمرهم بالرجوع إلى أبيهم والإتيان به وبمن معه من أولادهمِ، فقال: { ٱذْهَبُواْ بِقَمِيصِي هَـٰذَا }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:167",
      "similarity": 0.020172658202063765
    },
    {
      "verse": "9:99",
      "similarity": 0.020114150522569676
    },
    {
      "verse": "33:73",
      "similarity": 0.019475049501354216
    },
    {
      "verse": "9:27",
      "similarity": 0.019243280175227064
    },
    {
      "verse": "33:24",
      "similarity": 0.019191415617416586
    }
  ]
}