{
  "chapter": "يوسف",
  "text": "فلما ان جاء البشير القىه على وجهه فارتد بصيرا قال الم اقل لكم انى اعلم من الله ما لا تعلمون",
  "translations": [
    {
      "translation": "But when the bringer of the good news came, he cast it on his face and sight returned. He said, 'Did I not say to you before, I know things from Allah you do not know?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, as the harbinger of happy news arrived and put the garment over his face his eyesight was restored. He said: \"Did I not tell you? I know from God what you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the bearer of good news came he threw Joseph's shirt over Jacob's face, whereupon he regained his sight, and said: \"Did I not tell you that I know from Allah what you do not know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When someone brought him the glad news, Joseph's shirt was placed on his face and his eye-sight was restored, he said, \"Did I not tell you that I know about God that which you do not know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when the bearer of glad tidings came, he laid the shirt on his face, he therefore immediately regained his eyesight*; he said, “Was I not telling you? I know the great traits of Allah which you do not know!” (This was a miracle that took place by applying Prophet Yusuf’s shirt.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the bearer of the good news arrived, he cast it (the shirt) over his face, and his vision returned. He said: \"Did I not say to you, `I know from Allah that which you know not\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the bearer of good news came he cast it on his face, so forthwith he regained his sight. He said: Did I not say to you that I know from Allah what you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the bearer of good tidings came to him, and laid it on his face, forthwith he saw once again. He said, 'Did I not tell you I know from God that you know not?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the bearer of glad tidings came, he laid it on his face and he became a seer once more. He said: Said I not unto you that I know from Allah that which ye know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the bearer of the good news arrived and cast the shirt on Jacob's face, his eyesight returned and he said, \"Did I not tell you that I know from God what you do not know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the bringer of the glad tidings came, he cast it upon his face and he became clear-sighted. He said: said I not unto you, verily I know from Allah that which ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the bearer of good news arrived, he cast it on his face, and he regained his sight. He said, ‘Did I not tell you, ‘‘I know from Allah what you do not know?’’ ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when the bearer of the good news came, He cast (the shirt) over his face, and he forthwith regained clear sight. He said: \"Did I not say to you, 'I know from Allah that which ye know not?'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the bearer of the glad tidings arrived, he cast it (the shirt) over his face, and he became clear-sighted. He said: \"Did I not say to you, 'I know from Allah that which you know not. \n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the bearer of glad tidings arrived, he laid Joseph's shirt over him, and he saw once again. He said: 'Did I not tell you that I know from Allah what you do not know'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the bearer of good news arrived, he laid it over his face, and he regained his sight. He said, “Did I not say to you that I know from God what you do not know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the bearer of good tidings arrived, he cast it over his face, and he returned [once again] seeing. He said, \"Did I not tell you that I know from Allah that which you do not know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[12:96] Then, when (fa-lammā an: an is extra) the bearer of good tidings, Judah, came, with the shirt — he had [been the one who] brought the blood-stained shirt, and so now he wished to bring him joy, after he had [previously] brought him grief — he laid it, he cast the shirt, on his face and he regained his sight. He said, ‘Did I not say to you, “Indeed I know from God what you do not know?” ’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, when the bearer of glad tidings came) i.e. Judah carrying the shirt, (he laid it on his face and he became a seer once more) he regained his sight. (He said) to his children and grandchildren: (Said I not unto you that I know from Allah that which ye know not?) did I not tell you that Joseph is still alive?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّآ أَن جَآءَ ٱلْبَشِيرُ } وهو يهوذا مع القميص { أَلْقَاهُ عَلَىٰ وَجْهِهِ } على الوجه المأمور { فَٱرْتَدَّ } أي: عاد ورد فجأة { بَصِيراً } كما كان في سالف الزمان\n فشكر الله وحمده\n وسجد له سجدة خضوع وخشوع وتذلل تام\n ثم رفع رأسه من سجوده { قَالَ } لبنيه ولحضار مجلسه: { أَلَمْ أَقُلْ لَّكُمْ } حين لمتوني بالأسف والحزن وكثرة المناجاة مع الله لملاقاة يوسف { إِنِّيۤ أَعْلَمُ مِنَ } كرم { ٱللَّهِ } وسعة جوده ورحمته { مَا لاَ تَعْلَمُونَ } [يوسف: 96] أنتم أيها اللائمون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { فلما أن جاءَ البشير } أي: المبشر\n وهو يهوذا\n رُوي أنه قال: كنتُ أحزنْتُه بِحَمل قميصه المُلَطَّخ بالدم إليه\n اليوم أفرحُه بحمل هذا إليه\n وفي رواية عنه قال: إني ذهبت إليه بقميص التَّرْحَة\n فدعوني أذهب إليه بقميص الفرحة\n فلما وصل إليه { ألقاه على وجهه } طرح البشيرُ القميصَ على وجه يعقوب\n أو: القاه يعقوبُ بنفسه على وجهه\n { فارتدَّ بصيراً } بقدرة الله وبركة القميص\n { قال ألم أقلْ لكم إني أعلمُ من الله ما لا تعملون } من حياة يوسف\n وإنزال الفرج\n  { قالوا يا أبانا استغفرْ لنا ذنوبنا إنا كنا خاطئين } \n وقد اعترفنا بذنوبنا\n وسألنا المغفرة\n\n{ قال سوف أستغفر لكم ربي إنه هو الغفور الرحيم } \n أخره إلى السَّحَر\n أو إلى صلاة الليل\n أو إلى ليلة الجمعة\n تحرياً لوقت الإجابة\n أو إلى أن يتحلّل لهم من يوسف\n فإن عفو المظلوم شرط في المغفرة\n ويؤيده ما رُوي أنه لما اجتمع به\n وتحلل منه\n استقبل يعقوبُ القبلة قائماً يدعو\n ويوسفُ خلفه يؤمن\n وقاموا خلفهما أذلةً خاشعين\n حتى نزل جبريل وقال: إن الله قد أجاب دعوتك في أولادك\n وعقد مواثيقهم بعدك على النبوة\n وهو إن صح\n دليل نبوتهم\n وأن ما صدر منهم كان قبل نبوتهم\n قاله البيضاوي\n الإشارة: اعلم أن الحق ـ جل جلاله ـ جعل للبشرية عَيْنَين حسيين: تبصر بهما الحسيات\n وجعل للقلب عينين معنويين يرى بهما المعاني\n فالأول: يسمى البصر\n والثاني: البصيرة: فأحد عيني القلب تبصر أنوار الشريعة\n والأخرى تبصر أسرار الحقيقة\n وقد يغشى القلب ظلمةُ الكفر\n فتغطيهما معاً\n وهو: عمى البصيرة\n وقد يغشاه ظلمة المعاصي\n واتباع الحظوظ والهوى\n فتعمى عين الحقيقة\n وجلباب العصمة على عين الشريعة\n فيرجع القلب بصيراً\n ولا بد من صحبة شيخ عارف يعطيه هذا القميص\n ويقول: اذهبوا بقميصي هذا فألقوه على وجه بصيرتكم\n تأتي بصيرة عارفة\n فإذا قرب منها هذا القميص هبَّ عليها نسيم الوصال\n وهاج عليها الوجدُ والحالُ\n وأنشدت بلسان المقال:\nثم ذكر دخول يعقوب مصر\n وجمع شمله بيوسف ـ عليهما السلام ـ\n فقال: { فَلَمَّا دَخَلُواْ عَلَىٰ يُوسُفَ آوَىٰ إِلَيْهِ أَبَوَيْهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:44",
      "similarity": 0.3653013493494448
    },
    {
      "verse": "5:108",
      "similarity": 0.3529604761820985
    },
    {
      "verse": "10:80",
      "similarity": 0.32722564609785604
    },
    {
      "verse": "27:13",
      "similarity": 0.3096080478874233
    },
    {
      "verse": "4:86",
      "similarity": 0.30370369721468315
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/12:96.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/12:96.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/12:96.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}