{
  "chapter": "الرعد",
  "text": "للذين استجابوا۟ لربهم الحسنى والذين لم يستجيبوا۟ له لو ان لهم ما فى الارض جميعا ومثله معه لافتدوا۟ به او۟لئك لهم سوء الحساب وماوىهم جهنم وبئس المهاد",
  "translations": [
    {
      "translation": "Those who respond to their Lord will receive the best. But as for those who do not respond to Him, even if they owned everything on the earth and the same again with it, they would offer it as a ransom. They will receive an evil Reckoning. Their shelter will be Hell. What an evil resting-place!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who obey their Lord is excellence. For those who fail to obey, the reckoning will be hard, even if they possess and give as ransom all that there is on the earth, and as much more; and Hell will be their abode: How wretched is its wide expanse!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is good reward for those who respond to the call of their Lord. And those who do not respond to their Lord, (a time will come when) they shall offer all they have - even if they have all the riches of the world and the like of it besides to redeem themselves (from the chastisement of Allah). They will be subjected to a severe reckoning and Hell shall be their refuge. What a wretched resting place it is!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who answer the call of their Lord will receive good rewards. Whatever those who have not answered the call of their Lord offer to redeem themselves, even if they offer double the wealth of the whole earth, will not be accepted. They will face a terrible reckoning and their dwelling will be hell, a terrible place to rest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who obeyed the command of Allah is goodness and if those who did not obey Him owned all that is in the earth and in addition a similar one like it, they would give it to redeem their souls; it is they who will have a wretched account, and their destination is hell; and what a wretched resting place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who answered their Lord's call is Al-Husna. But those who answered not His call, if they had all that is in the earth together with its like, they would offer it in order to save themselves. For them there will be the terrible reckoning. Their dwelling place will be Hell; and worst indeed is that place for rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who respond to their Lord is good; and (as for) those who do not respond to Him, had they all that is in the earth and the like thereof with it they would certainly offer it for a ransom. (As for) those, an evil reckoning shall be theirs and their abode is hell, and evil is the resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who answer their Lord, the reward most fair; and those who answer Him not -- if they possessed all that is in the earth and the like of it with it, they would offer it for their ransom. Those theirs shall be the evil reckoning, and their refuge shall be Gehenna -- an evil cradling!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who answered Allah's call is bliss; and for those who answered not His call, if they had all that is in the earth, and therewith the like thereof, they would proffer it as ransom. Such will have a woeful reckoning, and their habitation will be hell, a dire abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be the best of rewards for those who respond to their Lord: while those who do not respond to Him -- if they possessed all that is on earth and twice as much, they would surely offer it as ransom [on the Day of Judgement]; -- will have the worst reckoning and their goal is Hell: and how evil a resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For these who answer their Lord is ordained good. And those who answer not their Lord--if they had all that is in the earth, and therewith the like thereof, they would ransom themselves therewith. These! for them shall be an evil reckoning; and their resort is Hell, a hapless bed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who answer [the summons of] their Lord there shall be the best [of rewards]. But those who do not answer Him, even if they possessed all that is on the earth and as much of it besides, they would surely offer it to redeem themselves with it. For such there shall be an adverse reckoning, and their refuge shall be hell, and it is an evil resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who respond to their Lord, are (all) good things. But those who respond not to Him,- Even if they had all that is in the heavens and on earth, and as much more, (in vain) would they offer it for ransom. For them will the reckoning be terrible: their abode will be Hell,- what a bed of misery!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who answered their Lord's Call [believed in the Oneness of Allah and followed His Messenger Muhammad SAW i.e. Islamic Monotheism] is Al-Husna (i.e. Paradise). But those who answered not His Call (disbelieved in the Oneness of Allah and followed not His Messenger Muhammad SAW), if they had all that is in the earth together with its like, they would offer it in order to save themselves (from the torment, it will be in vain). For them there will be the terrible reckoning. Their dwelling place will be Hell; - and worst indeed is that place for rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who answer their Lord is a most fine reward. But for those who do not answer Him if they possessed all that the earth contains, and as much besides, they would offer it for their ransom. Theirs shall be an evil reckoning. Gehenna (Hell) shall be their refuge, an evil cradling!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who respond to their Lord is the best. But as for those who do not respond to Him, even if they possessed everything on earth, and twice as much, they could not redeem themselves with it. Those will have the worst reckoning; and their home is Hell—a miserable destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who have responded to their Lord is the best [reward], but those who did not respond to Him - if they had all that is in the earth entirely and the like of it with it, they would [attempt to] ransom themselves thereby. Those will have the worst account, and their refuge is Hell, and wretched is the resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:18] For those who respond to their Lord, [those who] answer Him, by way of obedience, there shall be the goodly reward, Paradise, and those who do not respond to Him, namely the disbelievers — if they possessed all that is in the earth, and therewith the like of it, they would offer it to redeem themselves therewith, against the chastisement. For such there shall be an awful reckoning, and that is that they will be requited for every single thing they did, none of which will be forgiven, and their abode shall be Hell, an evil resting place, it is!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For those who answered Allah's call) in the life of this world by accepting monotheism (is bliss) theirs is Paradise in the Hereafter; (and for those who answered not His call) the call of their Lord, thus rejecting monotheism, (if they had all that is in the earth) of gold and silver, (and therewith the like thereof) and its double with it, (they would proffer it as ransom) they would offer to ransom themselves. (Such will have a woeful reckoning) a severe chastisement, (and their habitation) their destination (will be hell, a dire abode) an evil resting place and destination.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِلَّذِينَ ٱسْتَجَابُواْ لِرَبِّهِمُ ٱلْحُسْنَىٰ } معناه الجَنةُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {for those who respond to their Lord with the best [of deeds]} - this means Paradise.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ للذين اسْتَجَابوا لربّهم } بتصفية الاستعداد عن كدورات صفات النفس { الحُسْنى } أي: المثوبة الحسنى وهو الكمال الفائض عليهم عند الصفاء المعبر عنه بقوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لِلَّذِينَ ٱسْتَجَابُواْ لِرَبِّهِمُ } فطلبوا منه { ٱلْحُسْنَىٰ } أي: المثوبة العظمى والمرتبة العليا معتقدين إفاضتها وإعطاءها إياهم { وَٱلَّذِينَ لَمْ يَسْتَجِيبُواْ لَهُ } مثل ماس استجاب أهل الحق ولم يعتقدوا مثل ما اعتقد أولئك المحقون لم ينالوا نصيبهم وحظهم { لَوْ أَنَّ لَهُمْ } ملك { مَّا فِي ٱلأَرْضِ } من الزخارف والأموال { جَمِيعاً وَمِثْلَهُ مَعَهُ } بل أضعافه وأمثاله { لاَفْتَدَوْاْ بِهِ } لنيبل ما نالوا لكن لم ينالوا\n بل { أُوْلَـٰئِكَ } الأشقياء المردودون عن عز القبول { لَهُمْ سُوۤءُ ٱلْحِسَابِ } يحاسبون على جميع ما صدر عنهم من النقير والقمطرير ويؤاخذون عليها { وَ } بالجملة: { مَأْوَاهُمْ جَهَنَّمُ } الخذلان والطرد والحرمان { وَبِئْسَ ٱلْمِهَادُ } [الرعد: 18] مهد أولئك الضالين عن منهج الرشاد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { للذين استجابوا لربهم } بالإيمان والطاعة، { الحسنى } أي: المثوبة الحسنى، أو الجنة\n { والذين لم يستجيبوا له } من الكفرة { لو أنَّ لهم ما في الأرض جميعاً ومثله معه لافتدوا به } من هول ذلك المطلع\n أو: يضرب الأمثال للذين استجابوا الاستجابة الحسنى، والذين لم يستجيبوا له\n ثم بيَّن مثال غير المستجيبين بقوله: { لو أن لهم\n\n\n } إلخ\n { أولئك لهم سُوءُ الحساب } أقبحه وأشده، وهو أن يناقش فيه، بأن يحاسبَ العبد على كل ذنب، ولا يغفر منه شيء، { ومأواهم }: مرجعهم { جهنمُ وبئس المهادُ } الفراش والمستقر، والمخصوص محذوف، أي: هذا\n الإشارة: قد اشتملت الآية على ثلاثة أمثلة: مثال للعلم النافع، ومثال للعمل الخالص، وللحال الصافي\n فمثَّل الحقُّ تعالى العلم النافع بالمطر النازل من السماء، فإنه تحيا به الأرض، وتجري به الأودية والعيون والآبار، ويحبس في الخلجان والقدور لنفع الناس، وتتطهر به الأرض من الخبث لأنه ترمى به السيول، فيذهب جفاء، كذلك العلم النافع تحيا به النفوس بعد الموت بالجهل والشك، وتحيا به الأرواح بعد موتها بالغفلة والحجاب، وتمتلئ به القلوب على قدر وسعها وسعتها، وعلى قدر ما قُسم لهم من علم اليقين، أو عين اليقين، أو حق اليقين، وتتطهر به النفوس من البدع وسائر المعاصي\n ومثَّل العمل الخالص الذي تَصَفَّى من الرياء والعجب وسائر العلل، بالحديد المصفى من خبثه لتصنع منه السيوف والآلات، أو النحاس المصفى لتصنع منه الأواني، وغيرها مما ينفع به الناس\n ومثَّل الحال الصافي من العلل بالذهب المصفى أو الفضة، إذا صفيت وذهب خبثها ليصنع بهما الحلي والحلل ليتزين بها أهلها، فأشار إلى المثال الأول ـ وهو ا لعلم ـ بقوله: { أنزل من السماء ماء } إلخ\n وأشار إلى الحال بقوله: { ومما يوقدون عليه في النار ابتغاء حلية } ، وأشار إلى العمل بقوله: { أو متاع زبد مثله }\n وقدَّم الحال لشرفه، ومثَّله بالذهب والفضة لزيادة الرغبة فيه لأنه ثمرة العمل، ومرجعه إلى الوجدان والأذواق، وهو عزيز لا يجده إلا المقربون\n والحاصل: أن المراتب أربعة: العلم، والعمل، والحال، والمقام\n وإنما لم يضرب الحق تعالى مثلاً للمقام لأن النزول فيه لا يكون إلا بعد التصفية، فليس فيه علة، يحتاج إلى التصفية منها\n فمقامات اليقين كلها يجري فيها العلم، والعمل، والحال، والمقام\n فالتوبة مثلاً: يتعلق العلم بمعرفة حقيقتها وفضليتها، ثم يسعى في العمل بالمجاهدة والرياضة حتى يذهب زبده وخبثه، حتى يذوق حلاوة الاستقامة مع بقية الخوف من السقوط، وهذا هو الحال، ثم تطمئن النفس، وترسخ التوبة النصوح، وهذا هو المقام\n وكذلك الصبر، يتعلق به العلم أولاً ثم يسعى في مرارة استعماله حتى يذوق حلاوة الشدة والفاقة ثم يرسخ فيه، وهكذا يجري في المقامات كلها\n\n\n وهي اثنا عشر مقاماً: التوبة، والخوف، والرجاء، والورع، والزهد، والصبر، والشكر، والرضى، والتسليم، والمحبة، والمراقبة، والمشاهدة، وهي: بروج شمس المعرفة، وقمر التوحيد\n\n\nوكذلك معرفة الشهود والعيان: يتعلق العلم أولاً بأسرار التوحيد، ثم يعمل في خرق عوائد نفسه حتى تموت، فيشرق عليها أنوار التوحيد، غير أنها تظهر وتخفى، ثم يصير الشهود مقاماً، رسوخاً وتمكيناً\n وقد أشار الحكم إلى بعض هذا فقال: \" حسن الأعمال نتائج حسن الأحوال، وحسن الأحوال من التحقق بمقامات الإنزال \"\n وكل واحد من الثلاثة يحتاج إلى تصفية حتى يذهب زبده وخبثه فتصفية العلم بالإخلاص والتحقيق، فيذهب عنه قصد الرئاسة والجاه، أو التوصل إلى الدنيا، ويذهب به الشكوك والأوهام فهذا زبده\n وتصفية العمل بالإخلاص في أوله، والإتقان والحضور في وسطه، والكتمان في آخره، فيذهب عنه الرياء والعجب به، والتوصل به إلى حفظ نفساني\n وتصفية الحال بصحة القصد وإفراد الوجهة، وإذا هاج عليه الوارد ملك نفسه وأمسكها، فيذهب به قصد الظهور، وطلب المراتب الدنيوية والكرامات الحسية، التي هي من حظ النفس وتشتيت القلب، إن لم يفرد وجهته لله، وانحلال عزمه وخمود نوره، إن لم يمسك نفسه عند هواجم الحال\n فهذا زبد الحال الذي يذهب عنه بمجاهدة النفس، ويمكث في أرض القلوب صفاء اليقين والمعرفة وخالص العمل في مقام العبودية\n وبالله التوفيق\n ثم ذكر حال من عرف هذا العلم النازل وحال من أنكره فقال: { وَٱلَّذِينَ يَنقُضُونَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:47",
      "similarity": 0.5641407980293539
    },
    {
      "verse": "3:197",
      "similarity": 0.5577256452063627
    },
    {
      "verse": "5:36",
      "similarity": 0.523750015447426
    },
    {
      "verse": "57:15",
      "similarity": 0.5235789397719934
    },
    {
      "verse": "2:206",
      "similarity": 0.48466610015833
    }
  ]
}