{
  "chapter": "الرعد",
  "text": "المر تلك ءايت الكتب والذى انزل اليك من ربك الحق ولكن اكثر الناس لا يؤمنون",
  "translations": [
    {
      "translation": "Alif Lam Mim Ra. Those are the Signs of the Book. And what has been sent down to you from your Lord is the Truth. But most people have no iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALIF LAM MIM RA. These are the verses of the Scripture. Whatsoever is sent down to you from your Lord is the truth; but most men do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Mim. Ra'. These are the verses of the Divine Book. Whatever has been revealed to you from your Lord is the truth, and yet most (of your) people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Mim. Ra. These are the verses of the Book. Whatever is revealed to you from your Lord is the Truth, but most people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Meem-Ra*; these are verses of the Book; and that which has been sent down upon you from your Lord is true, but most men do not believe. (* Alphabets of the Arabic language – Allah and to whomever He reveals, know their precise meanings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam-Mim Ra. These are the verses of the Book (the Qur'an), and that which has been revealed unto you from your Lord is the truth, but most men believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Mim Ra. These are the verses of the Book; and that which is revealed to you from your Lord is the truth, but most people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Mim Ra. Those are the signs of the Book; and that which has been sent down to thee from thy Lord is the truth, but most men do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Mim. Ra. These are verses of the Scripture. That which is revealed unto thee from thy Lord is the Truth, but most of mankind believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Mim Ra. These are the verses of the Book. What is sent down to you from your Lord is the truth, yet most men do not believe in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Mim. Ra. These are the verses of the Book. And that which is sent down unto thee from thy Lord is the truth, but most of the people believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Mim, Ra. These are the signs of the Book. That which has been sent down to you from your Lord is the truth, but most people do not believe [in it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A. L. M. R. These are the signs (or verses) of the Book: that which hath been revealed unto thee from thy Lord is the Truth; but most men believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Mim-Ra [These letters are one of the miracles of the Quran and none but Allah (Alone) knows their meanings]. These are the Verses of the Book (the Quran), and that which has been revealed unto you (Muhammad SAW) from your Lord is the truth, but most men believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "AlifLaamMeemRa. Those are the verses of the Book. That which is sent down to you (Prophet Muhammad) from your Lord is the truth, yet most people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Meem, Ra. These are the signs of the Scripture. What is revealed to you from your Lord is the truth, but most people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Meem, Ra. These are the verses of the Book; and what has been revealed to you from your Lord is the truth, but most of the people do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:1] Alif lām mīm rā’: God knows best what He means by these [letters]. Those, these verses, are the verses of the Book, the Qur’ān (the genitive annexation carries the meaning of [partitive] min, ‘from’), and that which has been revealed to you from your Lord, namely, the Qur’ān (this [preceding sentence] constitutes the subject, the predicate of which is [the following]), is the Truth, wherein is no doubt, but most people, that is, the people of Mecca, do not believe, that it is from God, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his chain of transmitters on the authority of Ibn 'Abbas that he said in explanation of Allah's words (Alif. Lam. Mim. Ra.): '(Alif. Lam. Mim. Ra.) this means: I am Allah; I know what you do and say; it is also said that this is an oath by which Allah swore. (These are verses of the Scripture) this surah consists of verses of the Scripture. (That which is revealed unto thee from thy Lord is the Truth) He says: The Qur'an is the Truth from your Lord, (but most of mankind) the people of Mecca (believe not) in Muhammad (pbuh) or in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ المر } أي: الذات الأحدية\n واسمه العليم\n واسمه الأعظم\n ومظهره الذي هو الرحمة التامّة على ما أُشير إليه { تِلْكَ } معظمات علامات كتاب الكل الذي هو الوجود المطلق وآياته الكبرى { و } المعنى { الذي أُنْزِل إليك من ربّك } من العقل الفرقاني\n وهذا الذي ذُكِر من درج المعاني في الحروف هو الحق { ولكنّ أكثر الناس لا يؤمنون }\n { الله الذي رفع السموات بغير عمد ترونها } أي: بعمد غير مرئية هي ملكوتها التي تقوّمها وتحرّكها من النفوس السماوية أو سموات الأرواح بلا مادة تعمدها فتقوم هي بها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ الۤمۤر } أيها الإنسان الكامل اللبيب اللائق لملا حظه رموز آثار التوحيد اللائح عن غرته الغراء مقتضيات لوامع الرشد والرضا عما جرى عليه القضاء { تِلْكَ } السورة المنزلة إليك { آيَاتُ ٱلْكِتَابِ } الجامع للكتب المنزلة أي: من جملة آياته { وَ } أيضاً { ٱلَّذِيۤ أُنزِلَ إِلَيْكَ } قبل نزولها { مِن رَّبِّكَ } من الآيات النازلة كلها { ٱلْحَقُّ } المطابق للواقع\n النازل من عند الحكيم العليم { وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ } لانهماكهم في الغفلة والنسيان { لاَ يُؤْمِنُونَ } [الرعد: 1] أي: لا يصدقون ولا يعتقدون بحقيته وحقية منزله\n\n\nوكيف لا يعتقدون حقيته أولئك الحمقى المعاندون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "{ بسم الله الرحمن الرحيم * الۤمۤر... }  قيل: معناه: أنا أعلم، الله أعلم وأرى. وقيل: مختصرة من لفظ المرسل، على عادة رمز المحبين. أو إشارة إلى العوالم الأربعة: فالألف لوحدة الجبروت، واللام لتدفق أنوار المكوت، والميم لحس عالم الملك والراء لسريان أمداد الرحموت. قال تعالى: {... تِلْكَ آيَاتُ ٱلْكِتَابِ وَٱلَّذِيۤ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ ٱلْحَقُّ وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لاَ يُؤْمِنُونَ }. قلت: تلك مبتدأ. وآيات: خبر، والذي أُنزل: مبتدأ، والحق: خبر، والجملة الثانية كالحجة على الجملة الأولى.  يقول الحق جل جلاله: أيها المرسل المعظم، والحبيب المفخم، { تلكَ } الآيات التي تتلوها على الناس هي { آياتُ الكتاب } المنزل من حضرة قدسنا. { و } الكتاب أي: القرآن { الذي أُنزل إليك من ربك } هو { الحق } الذي لا ريب فيه، { ولكنَّ أكثرَ الناسِ لا يؤمنون } لإخلالهم بالنظر والتأمل فيه. الإشارة: لَوْ صَفَت القلوب من الأكدار، ومُلئت بالمعارف والأنوار لفهمتْ أسرار الكتاب، وجواهر معانيه، ولأدركت معرفة الحق من كلامه لأن الكلام صفة المتكلم، ولكن أكثر الناس اشتغلوا بمتابعة الهوى، فصُرفوا عن فهم الكلام، وفاتهم معرفة المتكلم.  ولذلك لم يكتف الحق تعالى بآيات الكتاب حتى ذكر دلائل توحيده وكمال قدرته، فقال: { ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَاوَاتِ بِغَيْرِ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:39",
      "similarity": 0.5790937638100626
    },
    {
      "verse": "40:57",
      "similarity": 0.5120890235655124
    },
    {
      "verse": "6:37",
      "similarity": 0.5092669043424091
    },
    {
      "verse": "30:6",
      "similarity": 0.4930750636142956
    },
    {
      "verse": "52:47",
      "similarity": 0.48742689075132284
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}