{
  "chapter": "الرعد",
  "text": "قل من رب السموت والارض قل الله قل افاتخذتم من دونه اولياء لا يملكون لانفسهم نفعا ولا ضرا قل هل يستوى الاعمى والبصير ام هل تستوى الظلمت والنور ام جعلوا۟ لله شركاء خلقوا۟ كخلقه فتشبه الخلق عليهم قل الله خلق كل شىء وهو الوحد القهر",
  "translations": [
    {
      "translation": "Say: 'Who is the Lord of the heavens and the earth?' Say: 'Allah.' Say: 'So why have you taken protectors apart from Him who possess no power to help or harm themselves?' Say: 'Are the blind and seeing equal? Or are darkness and light the same? Or have they assigned partners to Allah who create as He creates, so that all creating seems the same to them?' Say: 'Allah is the Creator of everything. He is the One, the All- Conquering.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: \"Who is the Lord of the heavens and the earth?\" (They will) say: \"God.\" Say: \"Then why do you take protectors besides Him who have no power over their own gain or loss?\" Say: \"Can a blind man and one who can see be equal? Or, darkness and light be the same? Or, have those they have appointed equal of God created, as He has created, so that the (two) creations look alike to them?\" Say: \"God is the creator of everything. He is One, the omnipotent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: \"Who is the Lord of the heavens and the earth?\" Say: \"Allah.\" Tell them: \"Have you taken beside Him as your patrons those who do not have the power to benefit or to hurt even themselves?\" Say: \"Can the blind and the seeing be deemed equals? Or can light and darkness be deemed equals?\" If that is not so, then have those whom they associate with Allah in His Divinity ever created anything like what Allah did so that the question of creation has become dubious to them? Say: \"Allah is the creator of everything. He is the One, the Irresistible.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Who is the Lord of the heavens and the earth?\" Say, \"It is God.\" Ask them, \"Why then have you taken guardians other than God when such guardians can neither benefit nor harm themselves?\" Ask them, \"Are the seeing and the blind equal? Is light equal to darkness?\" Do they consider that their idols have created anything like that of God, thus, both creations appear to them to be alike?\" Say, \"God alone is the Creator of all things and He is the One, the All-Dominant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “Who is the Lord of the heavens and the earth?” Proclaim, “Allah”; Say, “So have you appointed such as supporters besides Him, who can neither benefit nor harm themselves?”; say, “Will the blind and the sighted ever be equal? Or will the realms of darkness and the light ever be equal?” Have they appointed such as partners to Allah who created something like Allah did? Therefore their creation and His creation seemed alike to them? Proclaim, “Allah is the Creator of all things, and He Alone is the Dominant over all.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is the Lord of the heavens and the earth\" Say: \"(It is) Allah.\" Say: \"Have you then taken (for worship) Awliya' (protectors) other than Him, such as have no power either for benefit or for harm to themselves\" Say: \"Is the blind equal to the one who sees Or darkness equal to light Or do they assign to Allah partners who created the like of His creation, so that the creation seemed alike to them\" Say: \"Allah is the Creator of all things; and He is the One, the Irresistible.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who is the Lord of the heavens and the earth?-- Say: Allah. Say: Do you take then besides Him guardians who do not control any profit or harm for themselves? Say: Are the blind and the seeing alike? Or can the darkness and the light be equal? Or have they set up with Allah associates who have created creation like His, so that what is created became confused to them? Say: Allah is the Creator of all things, and He is the One, the Supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who is the Lord of the heavens and of the earth?' Say: 'God.' Say: 'Then have you taken unto you others beside Him to be your protectors, even such as have no power to profit or hurt themselves?' Say: 'Are the blind and the seeing man equal, or are the shadows and the light equal? Or have they ascribed to God associates who created as He created, so that creation is all alike to them?' Say: 'God is the Creator of everything, and He is the One, the Omnipotent.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): Who is Lord of the heavens and the earth? Say: Allah. Say: Take ye then (others) beside Him for protectors, which, even for themselves, have neither benefit nor hurt? Say: Is the blind man equal to the seer, or is darkness equal to light? Or assign they unto Allah partners who created the like of His creation so that the creation (which they made and His creation) seemed alike to them? Say: Allah is the Creator of all things, and He is the One, the Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who is Lord of the heavens and the earth?\" Say, \"God.\" Say, \"Why do you take protectors other than Him, who can neither benefit nor harm even themselves?\" Say, \"Are the blind and the seeing equal? Is darkness equal to the light? Or have they assigned partners to God who create as He creates, so that both creations appear to them alike?\"  Say, \"God is the Creator of all things. He is the One, the Almighty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: who in the Lord of the heavens and the earth Say thou: Allah. Say thou: have ye then taken beside Him patrons who own not to themselves benefit nor hurt! Say thou: are the blind and the seer equal? Or, the darknesses and light equal? Or have they set up associates unto Allah, who have created even as He hath created, so that the Creation hath become dubious unto them! Say thou: Allah is the Creator of everything; and He is the One, the Subduer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Who is the Lord of the heavens and the earth?’ Say, ‘Allah!’ Say, ‘Have you then taken others besides Him for guardians, who have no control over their own benefit or harm?’ Say, ‘Are the blind one and the seer equal? Are darkness and light equal?’ Have they set up for Allah partners who have created like His creation, so that the creations seemed confusable to them? Say, ‘Allah is the creator of all things, and He is the One and the All-paramount.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is the Lord and Sustainer of the heavens and the earth?\" Say: \"(It is) Allah.\" Say: \"Do ye then take (for worship) protectors other than Him, such as have no power either for good or for harm to themselves?\" Say: \"Are the blind equal with those who see? Or the depths of darkness equal with light?\" Or do they assign to Allah partners who have created (anything) as He has created, so that the creation seemed to them similar? Say: \"Allah is the Creator of all things: He is the One, the Supreme and Irresistible.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Who is the Lord of the heavens and the earth?\" Say: \"(It is) Allah.\" Say: \"Have you then taken (for worship) Auliya' (protectors, etc.) other than Him, such as have no power either for benefit or for harm to themselves?\" Say: \"Is the blind equal to the one who sees? Or darkness equal to light? Or do they assign to Allah partners who created the like of His creation, so that the creation (which they made and His creation) seemed alike to them.\" Say: \"Allah is the Creator of all things, He is the One, the Irresistible.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who is the Lord of the heavens and the earth' Say: 'Allah' Say: 'Why then have you chosen guardians other than Him, even though they have neither the power to benefit nor harm themselves' Say: 'Are the blind and the seeing equal? Are darkness and light equal? Or, have they ascribed to Allah associates who create as He creates so that all creation is alike to them?\" Say: 'Allah is the Creator of everything. He is the One, the Conqueror'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who is the Lord of the heavens and the earth?” Say, “God.” Say, “Have you taken besides Him protectors, who have no power to profit or harm even themselves?” Say, “Are the blind and the seeing equal? Or are darkness and light equal? Or have they assigned to God associates, who created the likes of His creation, so that the creations seemed to them alike? Say, “God is the Creator of all things, and He is The One, the Irresistible.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who is Lord of the heavens and earth?\" Say, \"Allah.\" Say, \"Have you then taken besides Him allies not possessing [even] for themselves any benefit or any harm?\" Say, \"Is the blind equivalent to the seeing? Or is darkness equivalent to light? Or have they attributed to Allah partners who created like His creation so that the creation [of each] seemed similar to them?\" Say, \"Allah is the Creator of all things, and He is the One, the Prevailing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:16] Say, O Muhammad (s), to your people: ‘Who is the Lord of the heavens and the earth?’ Say: ‘God’ — and even if they do not say it, there can be no other response. Say, to them: ‘Then have you taken beside Him, other than Him, protectors, idols, to worship, who have no power to benefit or harm themselves?’, and you abandon the One Who is their Possessor? (an interrogative meant as a rebuke). Say: ‘Are the blind one and the seer, [respectively], the disbeliever and the believer, equal? Or are darkness, disbelief, and the light, faith, equal? No! Or have they set up for God associates who have created the like of His creation, so that creation seems alike, that is, [is] what the associates create and the creation of God [alike], to them?’, so that they believe them worthy of being worshipped on account of what these [associates] have created? (an interrogative of disavowal); in other words, not so! None save the Creator is worthy of being worshipped. Say: ‘God is the Creator of all things, having no associate therein, and so He cannot have an associate in terms of worship; and He is the One, the Subjugator’, of His servants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "259 (Say) Muhammad, to the people of Mecca: (Who is Lord) who is the Creator (of the heaven and the earth?) if they answer and say Allah, then fine; if not, (Say: Allah) is their Creator! (Say) Muhammad: (Take ye) worship you (then (others) beside Him) beside Allah (for protectors) lords from among idols, (which, even for themselves, have neither benefit) neither procuring benefit (nor hurt) nor driving away harm? (Say) to them, Muhammad: (Is the blind man equal to the seer) is the unbeliever equal to the believer, (or is darkness equal to light) i.e. disbelief and faith? (Or assign they) describe (unto Allah partners) from among idols (who created) creation (the like of His creation so that the creation (which they made and His creation) seemed alike to them) such that they do not distinguish Allah's creation from the creation of their idols? (Say) Muhammad: (Allah is the Creator of all things) while their idols have created nothing, (and He is the One, the Almighty) He is All-Conquering above His created beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمن عند الحق وجادل مع أهله مكابرة، مستفماً على سبيل التبكيت والإسكات: { مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: موجدهما ومظهرهما من كتم العدم ومربيهما بأنواع التربية والكرم؟ { قُلِ } أيضاً أ،ت في جواب سؤالك؛ إذ هم معزولون عن التنطق بكلمة الحق؛ إذ ختم الله على قلوبهم وأفواههم: { ٱللَّهُ } أي: الموجد والمربي، هوالله المستقل بالألوهية والربوبية، ثم بعدما ظهر الحق { قُلْ } لهم على سبيل التوبيخ والتقريع: { أَفَٱتَّخَذْتُمْ } أيها الجاهلون بالله وحق قدره { مِّن دُونِهِ أَوْلِيَآءَ } معبودات من جنس مصنوعاته، سيما أدونها وهي الجمادات التي { لاَ يَمْلِكُونَ لأَنْفُسِهِمْ نَفْعاً وَلاَ ضَرّاً } فضلاً لغيرهم\n\n\n\n\n{ قُلْ } لهم يا أكمل الرسل توبيخاً وتقريعاً: أيها الجاهلون المعزولون عن مقتضى العقل الفطري { هَلْ يَسْتَوِي ٱلأَعْمَىٰ } الفاقد للبصر { وَٱلْبَصِيرُ } الواجد لها؟ { أَمْ هَلْ تَسْتَوِي ٱلظُّلُمَاتُ } أي: الأعدام الهالكة في نفسها { وَٱلنُّورُ } الوجود المتشعشع في ذاته؟ { أَمْ جَعَلُواْ } أولئك الحمقى العمي الهالكون في تيه الغفلة والضلال { للَّهِ } المنزه عن المثل والمثال { شُرَكَآءَ } مثله { خَلَقُواْ كَخَلْقِهِ } وأوجدوا لخقه وإيجاده { فَتَشَابَهَ ٱلْخَلْقُ عَلَيْهِمْ } أي: حتى اشتبه عليه وتشابه خلقهم لخلقه، سبحاه عما يقول الظالمون علواً كبيراً { قُلِ } يا أكمل الرسل إرشاد وتكميلاً: { ٱللَّهُ } المستجمع لصفات الكمال بأسرها والمربي لجميع الكائنات برمتها { خَالِقُ كُلِّ شَيْءٍ } أي: مظهرها وموجدها بالاستقلال بلا مظاهرة ومشاركة { وَهُوَ } بذاته { ٱلْوَاحِدُ } المستقل في الوجود { ٱلْقَهَّارُ } [الرعد: 16] للأإيار الهالكة في أنفسها، المنعكسة من أظلال أسمائه وأوصافه، الباقية في صرافة عدميتها الأصيلة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { قل } يا محمد للمشركين: { من ربُّ السماوات والأرض } أي: خالقهما، ومدبر أمرهما، { قل } لهم: هو { الله } لا خالق سواه، ولا مدبر غيره، أجاب عنهم بذلك، إذ لا جواب لهم سواه لأنهم يقرون به، ولكنهم يشركون به، فأبطل ذلك بقوله: { قل أفاتخذتم من دونه أولياءَ } أصناماً جامدة تتولونها بالمحبة والنصرة والدفع، وهم جوامد { لا يملكون لأنفسهم نفعاً ولا ضراً } أي: لا يقدرون أن يجلبوا لأنفسهم نفعاً، ولا يدفعون عنهم ضراً، فكيف يقدرون أن ينفعوا غيرهم ممن عبدهم، أو يدفعون عنه ضراً؟!\n وهو دليل على ضلالهم وفساد رأيهم، في اتخاذهم الأصنامَ أولياء، وجاء أن يشفعوا لهم\n { قل هل يستوي الأعمى والبصيرُ } أي: الكافر الجاهل، الذي عميت بصيرته بالجهل والشرك، والمؤمن الموحد الذي انفتحت بصيرته بالإيمان والعلم\n أو المعبود الغافل عن عبادة من عبده، والعالم بأسرار عباده\n { أم هل تستوي الظلماتُ والنور } الكفر والإيمان، أو الجهل والعلم\n { أم }: بل { جعلوا لله شركاءَ } من صفتهم، { خَلقوا كخلقه فتشابه } التبس { الخلقُ عليهم } فلم يدروا ما خلق الله مما خلق أصنامُهم، وهذا كله داخل الإنكار\n والمعنى: هل خلق شركاؤهم خلقاً كخلق الله، فالتبس الخلق عليهم، فلم يُميزوا خلق الله من خلق أصنامهم، حتى ظنوا أنها تستحق أن تُعبد مع الله، أو يُطلب منها حوائج دون الله؟!\n ثم أبطل ذلك بقوله: { قل اللَّهُ خالقُ كل شيء } ، قال البيضاوي: والمعنى أنهم ما اتخذوا له شركاء خالقين مثله حتى يتشابه الخلق عليهم، فيقولوا: هؤلاء خلقوا كما خلق الله، واستحقوا العبادة كما استحقها، ولكنهم اتخذوا شركاء عاجزين لا يقدرون على ما يقدر عليه الخلق، فضلاً عما يقدر عليه الخالق\nهـ\n { قل اللهُ خالق كل شيء } لا خالق غيره فيشاركه في العبادة\n جعل الخلق موجب الخلق مُوجَب العبادة، ولازم استحقاقها، ثم نفاه عما سواه ليتحقق انفراده بالربوبية والقهرية كما أفاد قوله: { وهو الواحدُ } في الألوهية، { القهار } بتصريف أحكام الربوبية\n هـ\n  الإشارة: إذا علِم العبدُ أن ربه قائم بأمر خلقه، مدبر لشأن ملكه، من عرشه إلى فرشه، جعل حوائجه كلها وقْفاً عليه، وانحاش بكليته إليه، ورفع همته عن خلقه، إذ ليس بيدهم ضر ولا نفع، ولا جلب ولا دفع، بل هم عاجزون عن إصلاح أنفسهم، فكيف يقدرون أن ينفعوا غيرهم؟! وفي الحكم العطائية: \" لا ترفعن إلى غيره حاجة هو موردها عليك فيكف يرفع إلى غيره ما كان هو له واضعاً، من لا يستطيع أن يرفع حاجة عن نفسه: فكيف يستطيع أن يكون لها من غيره رافعاً \"\n وقال بعض العارفين من المُكَاشَفين ـ رضي الله عنهم ـ: قيل لي في نوم كاليقظة، أو يقظة كالنوم: لا تُبْديَنّ فاقة فأضَاعفها عليك، مكافأة لسوء أدبك، وخروجك عن حد عبوديتك\n\n\nإنما ابتليتك بالفاقة لتفزع بها إليَّ، وتتضرع بها لَديَّ، وتتوكل فيها عليَّ\n سبكتك بالفاقة لتصير ذهباً خالصاً، فلا تزيفن بعد السبك، وَسَمْتُكَ بالفاقة وحكمت لنفسي بالغنى، فإن وصلتها بي وصلتك بالغنى، وإن وصلتها بغيري قطعت عنك مواد معونتي، وحسمت أسبابك من أسبابي، طرداً لك عن بابي\n فمن وكلتُه إليَّ ملك، ومن وكلته إليه هلك\n هـ\n وقال الشيخ أبو الحسن الشاذلي رضي الله عنه: آيست من نفع نفسي لنفسي، فكيف لا آيس من نفع غيري لها، ورجوت الله لغيري فكيف لا أرجو لنفسي؟\n هـ\n فالبصير من اعتمد في أموره على مولاه\n والأعمى من ركن في حوائجه إلى سواه\n فأنوار التفويض والتسليم لا تستوي مع ظلمات الشرك والتدبير\n { قل هل يستوي الأعمى والبصير أم هل تستوي الظلمات والنور }\n بالله التوفيق\n ثم ضرب لنور العلم مع ظلمات الجهل، فقال: { أَنَزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَسَالَتْ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:65",
      "similarity": 0.4398084873821977
    },
    {
      "verse": "39:4",
      "similarity": 0.40243545483903737
    },
    {
      "verse": "12:39",
      "similarity": 0.39161292844752443
    },
    {
      "verse": "2:118",
      "similarity": 0.380676239586007
    },
    {
      "verse": "40:16",
      "similarity": 0.3719882798593624
    }
  ]
}