{
  "chapter": "الرعد",
  "text": "انزل من السماء ماء فسالت اوديةۢ بقدرها فاحتمل السيل زبدا رابيا ومما يوقدون عليه فى النار ابتغاء حلية او متع زبد مثله كذلك يضرب الله الحق والبطل فاما الزبد فيذهب جفاء واما ما ينفع الناس فيمكث فى الارض كذلك يضرب الله الامثال",
  "translations": [
    {
      "translation": "He sends down water from the sky and river-beds fill up and flow according to their size, and the floodwater carries with it an increasing layer of scum; a similar kind of scum comes from what you heat up in the fire, when you desire to make jewellery or other things. That is how Allah depicts the true and the false. As for the scum, it is quickly swept away. But as for that which is of use to people, it remains behind in the ground. That is a metaphor which Allah has made",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water from the skies, which flows in channels according to their capacity, with the scum borne on the surface of the torrent, as rises the scum when metals are heated on the fire for making ornaments and household utensils. This is how God determines truth and falsehood. The scum disappears like the foam on the bank, and that which is useful to man remains on the earth. That is how God sets forth precepts of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sends down water from the heavens and the river-beds flow, each according to its measure, and the torrent carries along a swelling scum. In like manner, from that metal which they smelt in the fire to make ornaments and utensils, there arises scum like it. Thus does Allah depict truth and falsehood. As for the scum, it passes away as dross; but that which benefits mankind abides on the earth. Thus does Allah explain (the truth) through examples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God sends down water from the sky and floods run through the valleys, certain quantities of foam rise on the surface of the flood water. This is similar to that foam which rises when you expose something to the heat of a fire to manufacture ornaments or for other reasons. To God Truth and falsehood are like these examples. The foam disappears but what is profitable to the human being stays in the land. Thus, does God coin His parables.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sent down water from the sky, so valleys flowed according to their measure, therefore the water flow brought forth the froth swollen upon it; and upon which they ignite the fire, to make ornaments and tools, from that too rises a similar froth; Allah illustrates that this is the example of the truth and the falsehood; the froth then bursts and disappears; and that which is of use to people, remains in the earth; this is how Allah illustrates the examples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water from the sky, and the valleys flow according to their measure, but the flood bears away the foam that mounts up to the surface - and (also) from that (ore) which they heat in the fire in order to make ornaments or utensils, rises a foam like unto it, thus does Allah (by parables) show forth truth and falsehood. Then, as for the foam it passes away as scum upon the banks, while that which is for the good of mankind remains in the earth. Thus Allah sets forth parables.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water from the cloud, then watercourses flow (with water) according to their measure, and the torrent bears along the swelling foam, and from what they melt in the fire for the sake of making ornaments or apparatus arises a scum like it; thus does Allah compare truth and falsehood; then as for the scum, it passes away as a worthless thing; and as for that which profits the people, it tarries in the earth; thus does Allah set forth parables.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down out of heaven water, and the wadis flow each in its measure, and the torrent carries a swelling scum; and out of that over which they kindle fire, being desirous of ornament or ware, out of that rises a scum the like of it. So God strikes both the true and the false. As for the scum, it vanishes as jetsam, and what profits men abides in the earth. Even so God strikes His similitudes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sendeth down water from the sky, so that valleys flow according to their measure, and the flood beareth (on its surface) swelling foam - from that which they smelt in the fire in order to make ornaments and tools riseth a foam like unto it - thus Allah coineth (the similitude of) the true and the false. Then, as for the foam, it passeth away as scum upon the banks, while, as for that which is of use to mankind, it remaineth in the earth. Thus Allah coineth the similitudes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water from the sky that fills riverbeds to overflowing, each according to its measure. The torrent carries along swelling foam, akin to what rises from smelted ore from which man makes ornaments and tools. God thus depicts truth and falsehood. The scum is cast away, but whatever is of use to man remains behind. God thus speaks in parables.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sendeth down water from the heaven, so that the valleys flow according to their measure; then the torrent beareth the scum on top, and from that over which they kindle a fire seeking ornament or goods- ariseth a scum like thereto: Thus doth Allah propound the truth and falsity. Then as for the scum, it departeth as rubbish, and as for that which benefiteth the mankind, it lasteth on the earth: Thus doth Allah propound the similitudes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water from the sky whereat the valleys are flooded to [the extent of] their capacity, and the flood carries along a swelling scum. And from what they smelt in the fire for the purpose of [making] ornaments or wares, [there arises] a similar scum. That is how Allah compares truth and falsehood. As for the scum, it leaves as dross, and that which profits the people stays in the earth. That is how Allah draws comparisons.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water from the skies, and the channels flow, each according to its measure: But the torrent bears away to foam that mounts up to the surface. Even so, from that (ore) which they heat in the fire, to make ornaments or utensils therewith, there is a scum likewise. Thus doth Allah (by parables) show forth Truth and Vanity. For the scum disappears like forth cast out; while that which is for the good of mankind remains on the earth. Thus doth Allah set forth parables.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water (rain) from the sky, and the valleys flow according to their measure, but the flood bears away the foam that mounts up to the surface, and (also) from that (ore) which they heat in the fire in order to make ornaments or utensils, rises a foam like unto it, thus does Allah (by parables) show forth truth and falsehood. Then, as for the foam it passes away as scum upon the banks, while that which is for the good of mankind remains in the earth. Thus Allah sets forth parables (for the truth and falsehood, i.e. Belief and disbelief).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water from the sky and the valleys (wadis) flow each in their measure, and the torrent carries a swelling scum; and fire from that which they kindle; desiring ornament or ware, from that rises a scum like it. As such, Allah strikes both the truth and the false. As for the scum it is cast away as jetsam, but, that which profits people remains on the earth. As such Allah strikes the parables.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water from the sky, and riverbeds flow according to their capacity. The current carries swelling froth. And from what they heat in fire of ornaments or utensils comes a similar froth. Thus God exemplifies truth and falsehood. As for the froth, it is swept away, but what benefits the people remains in the ground. Thus God presents the analogies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down from the sky, rain, and valleys flow according to their capacity, and the torrent carries a rising foam. And from that [ore] which they heat in the fire, desiring adornments and utensils, is a foam like it. Thus Allah presents [the example of] truth and falsehood. As for the foam, it vanishes, [being] cast off; but as for that which benefits the people, it remains on the earth. Thus does Allah present examples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:17] He then strikes a similitude of truth and falsehood, saying: He, exalted be He, sends down water, rain, from the sky, whereat the valleys flow according to their measure, according to their full capacity, and the flood carries a scum that swells, rising above it, and this [scum] is the filth and the like that lies on the surface of the earth, and from that which they smelt (read tūqidūn, ‘you smelt’, or yūqidūn, ‘they smelt’) in the fire, of the earth’s minerals, such as gold, silver or copper, desiring, seeking [to make], ornaments, adornment, or ware, which is useful, such as utensils, when they [the minerals] are melted; [there rises] a scum the like of it, that is, the like of the scum of the flood, and this [latter scum] consists of the impurities expelled by the bellows. Thus, in the way mentioned, God points out truth and falsehood, that is, [He points out] the similitude thereof. As for the scum, of the flood and of the minerals smelted, it passes away as dross, useless refuse, while that which is of use to mankind, in the way of water and minerals, lingers, remains, in the earth, for a time: likewise, falsehood wanes and is [eventually] effaced, even if it should prevail over the truth at certain times. Truth, on the other hand, is established and enduring. Thus, in the way mentioned, God strikes, He makes clear, similitudes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة { أنزل من السماء ماء } استئناف ابتدائي أفاد تسجيل حرمان المشركين من الانتفاع بدلائل الاهتداء التي من شأنها أن تهدي من لم يطبع الله على قلبه فاهتدى بها المؤمنون .وجيء في هذا التسجيل بطريقة ضرب المثل بحالي فريقين في تلقي شيء واحد انتفع فريق بما فيه من منافع وتعلق فريق بما فيه من مضار . وجيء في ذلك التمثيل بحالة فيها دلالة على بديع تصرف الله تعالى ليحصل التخلص من ذكر دلائل القدرة إلى ذكر عبَر الموعظة ، فالمركب مستعمل في التشبيه التمثيلي بقرينة قوله : { كذلك يضرب الله الحق } الخ .شبه إنزال القرآن الذي به الهدى من السماء بإنزال الماء الذي به النفع والحياة من السماء . وشبه ورود القرآن على أسماع الناس بالسيل يمر على مختلف الجهات فهو يَمرّ على التّلال والجبال فلا يستقر فيها ولكنه يمضي إلى الأودية والوهاد فيأخذ منه كُلّ بقدر سعته . وتلك السيول في حال نزولها تحمل في أعاليها زَبَداً ، وهو رغوة الماء التي تربو وتطفو على سطح الماء ، فيذهب الزبد غير منتفع به ويبقى الماء الخالص الصافي ينتفع به الناس للشراب والسقي .ثم شُبهت هيئة نزول الآيات وما تحتوي عليه من إيقاظ النظر فيها فينتفع به من دخل الإيمان قلوبهم على مقادير قوة إيمانهم وعملهم ، ويمر على قلوب قوم لا يشعرون به وهم المنكرون المعرضون ، ويخالط قلوبَ قوم فيتأملونه فيأخذون منه ما يثير لهم شبهات وإلحاداً . كقولهم : { هل ندلّكم على رجل ينبئكم إذا مُزّقتم كلّ ممزّق إنكم لفي خلق جديد }. ومنه الأخذ بالمتشابه قال تعالى : { فأما الذين في قلوبهم زيغ فيتبعون ما تشابه منه ابتغاء الفتنة وابتغاء تأويله } \\[ سورة آل عمران : 7 \\].شبه ذلك كله بهيئة نزول الماء فانحدَارِه على الجبال والتلال وسيلانه في الأودية على اختلاف مقاديرها ، ثم ما يدفع من نفسه زبداً لا ينتفع به ثم لم يلبث الزبد أن ذهب وفني والماء بقي في الأرض للنفع .ولما كان المقصود التشبيه بالهيئة كلها جيء في حكاية ما ترتب على إنزال الماء بالعطف بفاء التفريع في قوله : فسالت } وقوله : { فاحتمل } فهذا تمثيل صالح لتجزئة التشبيهات التي تركب منها وهو أبلغ التمثيل .وعلى نحو هذا التمثيل وتفسيره جاء ما يبينه من التمثيل الذي في قول النبي صلى الله عليه وسلم « مثَل ما بعثني الله به من الهُدى والعلم كمثل الغيث الكثير أصاب أرضاً فكان منها نقيّة قبلتْ الماء فأنبتت الكلأ والعُشْبَ الكثير ، وكانت منها أجادب أمسكت الماء فنفع الله بها الناسَ فشربوا وسقَوا وزرعوا ، وأصاب منها طائفةً أخرى إنما هي قيعَان لا تمسك ماء ولا نتنبت كلأ ، مثلَ منْ فقه في دين الله ونفعه ما بعثني الله به فعَلِم وعلّم ، ومثل من لم يرفع بذلك رأساً ولم يقبل هُدى الله الذي أرسلتُ به » .والأودية : جمع الوادي ، وهو الحفير المتسع الممتد من الأرض الذي يجري فيه السيل . وتقدم في سورة براءة عند قوله تعالى : { ولا يقطعون وادياً إلا كتب لهم } \\[ سورة التوبة : 121 \\].والقَدَر بفتحتين : التقدير ، فقوله : بقدرها } في موضع الحال من { أودية } ، وذكره لأنه من مواضع العبرة ، وهو أن كانت أخاديد الأودية على قَدْر ما تحتمله من السيول بحيث لا تفيض عليها وهو غالب أحوال الأودية . وهذا الحال مقصود في التمثيل لأنه حال انصراف الماء لنفععٍ لا ضرّ معه ، لأنّ من السيول جواحف تجرف الزرع والبيوت والأنعام .وأيضاً هو دال على تفاوت الأودية في مقادير المياه . ولذلك حظ من التشبيه وهو اختلاف الناس في قابلية الانتفاع بما نزل من عند الله كاختلاف الأودية في قبول الماء على حسب ما يسيل إليها من مصاب السيول ، وقد تم التمثيل هنا .وجملة { ومما توقدون عليه في النار ابتغاء حلية أو متاع زيد مثله } معترضة بين جملة { فاحتمل } الخ وجملة { فأما الزبد } الخ .وهذا تمثيل آخر ورد استطراداً عقب ذكر نظيره يفيد تقريب التمثيل لقوم لم يشاهدوا سيول الأودية من سكان القرى مثل أهل مكّة وهم المقصود ، فقد كان لهم في مكة صواغون كما دل عليه حديث الإذخر ، فقرب إليهم تمثيل عدم انتفاعهم بما انتفع به غيرهم بمَثَل ما يصهْر من الذهب والفضة في البواتق فإنه يقذف زبداً ينتفي عنه وهو الخَبث وهو غير صالح لشيء في حين صلاح معدنه لاتخاذه حلية أو متاعاً . وفي الحديث « كما ينفي الكير خبث الحديد » . فالكلام من قبيل تعدّد التشبيه القريب ، كقوله تعالى : { مثلهم كمثل الذي استوقد ناراً } ثم قوله : { أو كصيب من السماء } \\[ سورة البقرة : 19 \\].وأقرب إلى ما هنا قولُ لبيد: ... فتنازعَا سَبطا يَطير ظِلالُهكدُخان مُشْعَلَة يَشِبّ ضرامها ... مشمُولَةٍ غُلثت بنابتتِ عَرفَجكدُخان نار سَاطع إسنامها ... وأفاد ذلك في هذه الآية قوله : زبد مثله }.وتقديم المسند على المسند إليه في هذه الجملة للاهتمام بالمسند لأنّه موضع اعتبار أيضاً ببديع صنع الله تعالى إذ جعل الزبد يطفو على أرقّ الأجسام وهو الماء وعلى أغلظها وهو المعدن فهو ناموس من نواميس الخلقة ، فبالتقديم يقع تشويق السامع إلى ترقب المسند إليه .وهذا الاهتمام بالتشبيه يشبه الاهتمام بالاستفهام في قول النبي صلى الله عليه وسلم في وصف جهنم « فإذا فيها كلاليبُ مثل حَسك السعدان هل رأيتم حسك السعدان » .وعدل عن تسمية الذهب والفضة إلى الموصولية بقوله تعالى : { ومما توقدون عليه في النار } لأنها أخصر وأجمع ، ولأن الغرض في ذكر الجملة المجعولة صلة ، فلو ذكرت بكيفية غير صلة كالوصفية مثلاً لكانت بمنزلة الفضلة في الكلام ولطال الكلام بذكر اسم المَعْدنين مع ذكر الصلة إذ لا مَحيد عن ذكر الوقود لأنه سبب الزبد ، فكان الإتيان بالموصول قضاءً لحق ذكر الجملة مع الاختصار البديع .ولأنّ في العدول عن ذكر اسم الذهب والفضة إعراضاً يؤذن بقلة الاكتراث بهما ترفعاً عن وَلع النّاس بهما فإن اسميهما قد اقترنا بالتعظيم في عرف النّاس .و { من } في قوله : { ومما توقدون } ابتدائية .و { ابتغاء حلية أو متاع } مفعول لأجله متعلق ب { توقدون }. ذكر لإيضاح المراد من الصلة ولإدماج ما فيه من منة تسخير ذلك للناس . لشدة رغبتهم فيهما .والحلية : ما يتحلى به ، أي يتزين وهو المصوغ .والمتاع : ما يتمتع به وينتفع ، وذلك المسكوك الذي يَتعامل به الناس من الذهب والفضة .وقرأ الجمهور { توقدون } بفوقية في أوله على الخطاب ، وقرأه حمزة ، والكسائي ، وحفص عن عاصم ، وخلف بتحتية على الغيبة .وجملة { كذلك يضرب الله الحق والباطل } معترضة ، هي فذلكة التمثيل ببيان الغرض منه ، أي مثل هذه الحالة يكون ضَرْب مثل للحق والباطل . فمعنى { يضرب } يبيّن ويُمثل . وقد تقدم معنى يضرب عند قوله تعالى : { إن الله لا يستحي أن يضرب مثلاً } في سورة البقرة ( 26 ).فحُذف مضاف في قوله : يضرب الله الحق } ، والتقدير : يضرب الله مَثَلَ الحق والباطل ، دلالة فعل { يضرب } على تقدير هذا المضاف .وحذف الجار من { الحق } لتنزيل المضاف إليه منزلة المضاف المحذوف .وقد علم أن الزبد مثَل للباطل وأن الماء مثَل للحق ، فارتقى عند ذلك إلى ما في المثلين من صفتي البقاء والزوال ليتوصل بذلك إلى البشارة والنذارة لأهل الحق وأهل الباطل بأن الفريق الأول هو الباقي الدائم ، وأن الفريق الثاني زائل بائد ، كقوله : { ولقد كتبنا في الزبور من بعد الذكر أنّ الأرض يرثها عباديَ الصالحون إن في هذا لبلاغاً لقوم عابدين } \\[ الأنبياء : 105 ، 106 \\] ، فصار التشبيه تعريضاً وكناية عن البشارة والنذارة ، كما دل عليه قوله عقب ذلك { للذين استجابوا لربهم الحسنى والذين لم يستجيبوا له } \\[ الرعد : 18 \\] الخ كما سيأتي قريباً .فجملة فأما الزبد } معطوفة على جملة { فاحتمل السيل زبداً رابيا } مفرّعةٌ على التمثيل . وافتتحت ب { أما } للتوكيد وصَرْف ذهن السامع إلى الكلام لما فيه من خفي البشارة والنذارة ، ولأنه تمام التمثيل . والتقدير : فذهب الزبد جُفاء ومكُث ما ينفع الناس في الأرض .والجُفاء : الطريح المرميُّ ، وهذا وعيد للمشركين بأنهم سيبيدون بالقتل ويبقى المؤمنون .وعبر عن الماء بما ينفع الناس للإيماء إلى وجه بناء الخبر وهو البقاء في الأرض تعريضاً للمشركين بأن يعرضوا أحوالهم على مضمون هذه الصلة ليعلموا أنهم ليسوا ما ينفع الناس ، وهذه الصلة موازنة للوصف في قوله تعالى : { إن الأرض يرثها عبادي الصالحون } \\[ سورة الأنبياء : 105 \\].واكتفي بذكر وجه شبه النافع بالماء وغير النافع بالزبد عن ذكر وجه شَبَه النافع بالذهب أو الفضة وغير النافع بزبدهما استغناء عنه .وجملة كذلك يضرب الله الأمثال } مستأنفة تذييلية لما في لفظ { الأمثال } من العموم . فهو أعم من جملة { كذلك يضرب الله الحق والباطل } لدلالتها على صنف من المثل دون جميع أصنافه فلما أعقب بمثل آخر وهو { فأما الزبد فيذهب جفاء } جيء بالتنبيه إلى الفائدة العامة من ضرب الأمثال . وحصل أيضاً توكيد جملة { كذلك يضرب الله الحق والباطل } لأن العام يندرج فيه الخاص .فإشارة { كذلك } إلى التمثيل السابق في جملة { أنزل من السماء ماء } أي مثل ذلك الضَرْب البديع يضرب الله الأمثال ، وهو المقصود بهذا التذييل .والإشارة للتنويه بذلك المثل وتنبيه الأفهام إلى حكمته وحكمة التمْثيل ، وما فيه من المواعظ والعبر ، وما جمعه من التمثيل والكناية التعريضية ، وإلى بلاغة القرآن وإعجازه ، وذلك تبهيج للمؤمنين وتحدّ للمشركين ، وليعلم أن جملة { فأما الزبد فيذهب جفاء } لم يؤت بها لمجرد تشخيص دقائق القدرة الإلهية والصنع البديع بل ولضرب المثَل ، فيعلمَ لممثّل له بطريق التعريض بالمشركين والمؤمنين ، فيكون الكلام قد تم عند قوله : { كذلك يضرب الله الأمثال } كما في شأن التذييل .\n\n",
      "translations": [
        {
          "translation": "Allah then gave a simile of the Truth and falsehood, saying: (He sendeth down water from the sky) He says: He sent Gabriel with the Qur'an and explained therein the Truth and falsehood, (so that valleys flow according to their measure) so the illumined hearts bore the Truth in proportion of their size and light, (and the flood beareth) the darkened hearts bore ((on its surface) swelling foam) much falsehood due to their whims (from that which they felt in the Fire) this is another simile. He says: and of that which you cast in the fire of gold and silver contains adulteration just as the foam of the sea does have salt (in order to make ornaments) which you were. Allah says here: the Truth is like gold and silver which benefit people, and falsehood is like the impurities which are derived from the casting of gold and silver, which are of no benefit. Likewise falsehood benefits no one (and tools) ore and copper (riseth a foam like unto it) He says: these also have impurities, i.e. just as the foam of the sea. This is another simile. He says: the Truth is like ore and copper from which people benefit, just as people benefit from the Truth. And falsehood is like the impurities resulting from the casting of ore and copper, which are of no benefit, just as falsehood is of no benefit to anyone, (thus Allah coineth (the similitude of)) thus Allah explains (the true and the false. Then, as for the foam, it passeth away as scum upon the banks) it goes just as it comes: it is of no benefit to its owner, (while, as for that which is of use to mankind) pure water, gold, silver, ore and copper, (it remaineth in the earth) it is useful just as the Truth is. (Thus Allah coineth the similitudes) Allah explains the similes of the Truth and falsehood.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱحْتَمَلَ ٱلسَّيْلُ زَبَداً رَّابِياً } معناهُ عالٍ\n\n\n\n\nوقوله تعالى: { يَضْرِبُ ٱللَّهُ ٱلْحَقَّ وَٱلْبَاطِلَ } معناهُ بِمثلِهِما\n\n\n\n\nوقوله تعالى: { فَأَمَّا ٱلزَّبَدُ فَيَذْهَبُ جُفَآءً } إِمَّا أَنْ يَنْصَبَ وإِما أَنْ يَسْكُنَ فيكُونُ ذِهاباً مِنهُ فِي الوَجهين جَميعاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the verse: {Then the torrent carried away a great amount of foam} means it is very high.\n\n\nAnd the saying of Allah, \"He strikes with the truth and with the false,\" means that He strikes with them both equally.\n\n\nAnd as for the {dross}, it will go away {completely} - either by being removed or by settling down. In either case, it will be gone from sight.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { أنزل } من سماء روح القدس ماء العلم { فسالت أودية } القلوب بقدر استعداداتها { فاحْتَمل } سيل العلم { زبداً } من خبث صفات أرض النفس ورذائلها ودناياها { ومما يوقدون عليه } في نار العشق من المعارف والكشوف والحقائق والمعاني التي تهيج العشق { ابْتِغَاء } زينة النفس وبهجتها بها لكونها كمالات لها { أو متاعٌ } من الفضائل الخلقية التي يحصل بسببها\n فإنها مما يتمتع به النفس { زبد مثله } خبث كالنظر إليها ورؤيتها وتصور النفس كونها كاملة أو فاضلة متزينة بزينة تلك الأوصاف وإعجابها واحتجابها وسائر ما يعدّ من آفات النفس وذنوب الأحوال { فأما الزبد فيذهب جفاء } مرمياً به منفياً بالعلم كما قال تعالى:\n[الأنفال\n الآية: 11]\n { وأما ما يَنْفع الناس } من المعاني الحقيّة والفضائل الخالصة { فيمكث } في أرض النفس",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن إشفاقه ومرحمته على عباده أن { أَنَزَلَ مِنَ ٱلسَّمَآءِ } أي: من العالم الروحاني { مَآءً } أي: ماء الإيمان والعرفان { فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا } أي: امتلئت النفوس القابلة بقدر ما يسع في استعداداتها منها\n فسالت بعدما امتلئت { فَٱحْتَمَلَ ٱلسَّيْلُ زَبَداً رَّابِياً } أي: ارتفع على مياه المعارف والحقائق زيد التقليدات الحاصلة من رسوب القوى البشرية\n وغش الطبيعة تسقطها على الأطراف وتصفيها عن الكدورة مطلقاً { وَ } مثل ذلك الزبد الباطل يحصل { مِمَّا يُوقِدُونَ عَلَيْهِ فِي ٱلنَّارِ } من الذهب والفضة والنحاس والحديد وغيرها حين أرادوا ذوبانها { ٱبْتِغَآءَ حِلْيَةٍ } أي: طلب اتخاذها منها { أَوْ مَتَاعٍ } آخر من الأواني وآلات الحرب { زَبَدٌ } فساد باطل في نفسه { مِّثْلُهُ } الزبد الأول\n\n\n{ كَذٰلِكَ يَضْرِبُ ٱللَّهُ } المصلح لأحوال عباده { ٱلْحَقَّ وَٱلْبَاطِلَ } لهم\n لكي يتنبهوا ويتفطنوا فيتبعوا الحق ويجتنبوا عن الباطل\n ثم بيَّن لهم سبحانه مآلهم توضيحاً وتقريراً بقوله: { فَأَمَّا ٱلزَّبَدُ } المرتفع على الماء { فَيَذْهَبُ جُفَآءً } أي: يضمحل ويتلاشى بالجفاف كما أن زبد التقليدات يسقط ويضمحل بإشراق نور اليقين { وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ } من مياه المعارف والحقائق { فَيَمْكُثُ } ويستقر { فِي ٱلأَرْضِ } أي: الطبيعة القابلة لانعكاس أشعة الأسماء والصفات الإلهية لينبت فيها شجرة طيبة أصلها ثابت وفرعها في السماء { كَذٰلِكَ يَضْرِبُ ٱللَّهُ ٱلأَمْثَالَ } [الرعد: 17]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جُفاء: حال\n والحسنى: مبتدأ\n وللذين: خبر مقدم\n والذين لم يستجيبوا: مبتدأ ولو أن: خبر\n أو للذين: متعلق بيضرب\n والحسنى: نعت لمصدر محذوف\n والذين: معطوف على الذين الأولى\n أي: يضرب الأمثال للذين استجابوا الاستجابة الحسنى وللذين لم يستجيبوا\n ثم استانف قوله: لو أن\n\n\n إلخ\n يقول الحق جل جلاله: { أنزل من السماء } أي: السحاب\n أو ناحية السماء\n { ماءً } مطراً { فسالتْ } به { أودية }: أنهار\n جمع وادٍ\n وهو الموضع الذي يسيل الماء فيه بكثرة\n فاتسع واستعمل للماء الجاري فيه\n { بقَدَرها } أي: بقَدَر صغرها وكبرها\n كل يسيل على قدره\n أو بقدر ما قسم في قسمة الله تعالى\n وعلم أنه نافع غير ضار\n { فاحتمل السيلُ زَبَداً } أي: رفعه على وجه الماء\n وهو ما يحمله السيْل من غذاء ونحوه\n أو ما يطفو على الماء من غليانه\n { رابياً }: عالياً على وجه الماء\n { ومما تُوقدون عليه في النار } من الذهب وفضة\n وحديد ورصاص ونحاس وغيره\n { ابتغاءً } أي: لطلب { حليةٍ } كالذهب والفضة\n { أو متاع } كالحديد والنحاس يصنع منه ما يتمتع به من الأواني وآلات الحرب والحرث\n والمقصود بذلك: بيان منافعها\n فكل واحد منهما له { زَبَدٌ مثله } أي: مثل زبد الماء\n وهو خبثه الذي تخرجه النار عند سبكه\n { كذلك يَضْرِِبُ اللَّهُ الحقَّ والباطل } فمثل الحق ـ وهو العلم بالله وبأحكامه ـ كمثل الأمطار الغزيرة\n ومثل القلوب التي سكن فيها\n وجرت حِكَمُه على ألسنة أهلها كالأودية والأنهار والخلجان\n كلٌّ يحمل منه على قدره\n وسعة صدره\n ومثل الباطل الذي دمغه وذهب به كالزبد وخبث الحديد والنحاس\n أو الذهب والفضة\n وسيأتي في الإشارة تكميله إن شاء الله\n ورُوِي مثل هذا عن ابن عباس\n وإنكار ابن عطية له جمود\n وتَذَكرْ حديث البخاري: \" مثل ما بعثني الله به من الهدى\n\n\n \" الحديث\n فإنه يشهد لذلك التأويل\n وتقدم له بنفسه في قوله:\n[يوسف:39] ما يشير إلى تفسير أهل الإشارة والرموز\n وراجع ما تقدم لنا في خطبة الكتاب يظهر لك الحق والصواب\n قال البيضاوي: مُثِّلَ الحقُّ في إفادته وثباته بالماء الذي ينزل من السماء\n فتسيل به الأودية على قدر الحاجة والمصلحة\n فتنفع به أنواع المنافع\n ويمكن في الأرض\n فيثبت بعضه في منابعه\n ويسلك بعضه في عروق الأرض إلى العيون والآبار\n وبالفِلِزِّ الذي ينتفع به في صَوْغ الحلي\n واتخاذ الأمتعة المختلفة\n ويدوم ذلك مدة متطاولة\n والباطلُ\n في قلة نفعه وسرعة ذهابه\n بزبدهما\n وبيَّن ذلك بقوله: { فأما الزَّبدُ فيذهب جُفَاءً } \n أي: مَرْمياً به\n من جفاه: رمى به وأبعده\n أي: يرمى به السيل والفلز المذاب\n هـ\n { وأما ما ينفع الناس } كالماء\n وخالص الذهب أو الحديد\n { فيمكثُ في الأرض } لينتفع به أهلها\n\n{ كذلك يضرب اللهُ الأمثالَ } لإيضاح المشكلات المعنوية\n بالمحسوسات المرئية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:12",
      "similarity": 0.16565693682158159
    },
    {
      "verse": "34:16",
      "similarity": 0.10000104944128942
    },
    {
      "verse": "17:106",
      "similarity": 0.09370542969486223
    },
    {
      "verse": "43:77",
      "similarity": 0.08886159820787379
    },
    {
      "verse": "20:10",
      "similarity": 0.08877309567100221
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}