{
  "chapter": "الرعد",
  "text": "افمن يعلم انما انزل اليك من ربك الحق كمن هو اعمى انما يتذكر او۟لوا۟ الالبب",
  "translations": [
    {
      "translation": "Can a man who knows what has been revealed to you from your Lord is the truth, and one who cannot see, be the same? They alone take warning who are wise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who knows that the Book which has been sent to you from your Lord is the Truth, is he like him who is blind to that truth? It is only people of understanding who take heed:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can a person, who knows that what is revealed to you from your Lord is the truth, be considered equal to a blind person? Only those who have understanding take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will he, who knows that what is sent down upon you from your Lord is the truth, ever be equal to him who is blind? Only the men of understanding heed advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall he then who knows that what has been revealed unto you from your Lord is the truth, be like him who is blind But it is only the men of understanding that pay heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he then who knows that what has been revealed to you from your Lord is the truth like him who is blind? Only those possessed of understanding will mind,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, is he who knows what is sent down to thee from thy Lord is the truth, like him who is blind? Only men possessed of minds remember;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who knoweth that what is revealed unto thee from thy Lord is the truth like him who is blind? But only men of understanding heed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can one who knows that whatever has been sent down to you from your Lord is the Truth, be equal to one who is blind? It is only those who are endowed with insight who pay heed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall he then who knoweth that which is sent down unto thee is the truth be like unto him who is blind! Only the men of understanding are admonished\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is someone who knows that what has been sent down to you from your Lord is the truth, like someone who is blind? Only those who possess intellect take admonition\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then one who doth know that that which hath been revealed unto thee from thy Lord is the Truth, like one who is blind? It is those who are endued with understanding that receive admonition;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall he then who knows that what has been revealed unto you (O Muhammad SAW) from your Lord is the truth be like him who is blind? But it is only the men of understanding that pay heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then is he who knows what is sent down to you from your Lord is the truth like he who is blind? Indeed, only those possessed with minds remember\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who knows that what was revealed to your from your Lord is the truth, like him who is blind? Only those who reason will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then is he who knows that what has been revealed to you from your Lord is the truth like one who is blind? They will only be reminded who are people of understanding -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:19] The following was revealed regarding Hamza and Abū Jahl: Is he who knows that what is revealed to you from your Lord is the truth, and so believes in it, like him who is blind?, and does not know it, nor believes in it? No! But only people of pith, possessors of intellect, remember, heed [such admonitions];\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is he who knoweth) who believes (that what is revealed unto thee from thy Lord) i.e. the Qur'an (is the Truth like him who is blind) disbeliever? (But only men of understanding) intelligent people (heed) take admonition from what is revealed to them in the Qur'an;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أُوْلُواْ ٱلأَلْبَابِ } معناهُ العُقولُ، واحدُها لُبٌّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأينكر المشرك المتمرد عن متابعتك وقبول دينك؟ { أَفَمَن يَعْلَمُ } ويصدق { أَنَّمَآ أُنزِلَ إِلَيْكَ مِن رَبِّكَ } لتأييدك من الكتاب الجامع لما في الكتب السالفة من الأوامر والنواهي و الأمثال والرموز والإشارات هو { ٱلْحَقُّ } المطابق للواقع بلا شك وارتياب فيه { كَمَنْ هُوَ أَعْمَىٰ } عن إبصار ما يرى في الآفاق من المبصرات، بل أشد عمى منه؛ لأنه فاقد البصيرة؛ إذ لا يمكن إدراك الأمور الدينية والمعارف اليقينية إلا بها { إِنَّمَا يَتَذَكَّرُ } ويتفطن بسرائر كتاب الله { أُوْلُواْ ٱلأَلْبَابِ } [الرعد: 19] المستكشفون عن لب الأمور، المعرضون عن قشوره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أولئك\n\n الخ: جملة خبر الموصولات، إن رفعت بالابتداء، وإن جُعلت صفاتٍ لأُولي الألباب: فاستئناف بذكر ما استوجبوا بتلك الصفات\n وجنات: بدل من عُقبى الدار\n ومن صلُح: عطف على الواو بفصل المفعول، وسلام عليكم: محكي بحال محذوفة، أي: قائلين سلام عليكم، وحذْفُ الحال ـ إذا كان قولاً ـ كثيرٌ مطرد\n يقول الحق جل جلاله: { أفمن يعلم انما أنزِلَ إليك من ربك } هو { الحقُّ } فيستجيب له، وينقاد له { كَمَنْ هو أعمى } عمى القلب، لا يستجيب ولا يستبصر؟ أنكر الحق ـ جل جلاله ـ على من اشتبه عليه الحق من الباطل، بعدما ضرب المثل، فإن الأمور المعنوية، إذا ضرب لها الأمثال المحسوسة، صارت في غاية الوضوح لا تخفى إلاَّ على الخفاشة، الذين انطمس نور قلوبهم بالكفر أو المعاصي\n ولذلك قال: { إنما يتذكر أولو الألباب } ذوو العقول الصافية والقلوب المنورة، التي تطهرت من كدر العوائد والشهوات، ولم تركن إلى المألوفات والمحسوسات",
      "translations": []
    }
  ]
}