{
  "chapter": "الرعد",
  "text": "ويسبح الرعد بحمده والملئكة من خيفته ويرسل الصوعق فيصيب بها من يشاء وهم يجدلون فى الله وهو شديد المحال",
  "translations": [
    {
      "translation": "The thunder glorifies His praise, as do the angels, out of fear of Him. He discharges the thunderbolts, striking with them anyone He wills. Yet still they argue about Allah when He is inexorable in His power!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The thunder sings His praises, and the angels too, for awe of Him. He sends thunder-bolts and strikes whosoever He will with them: Even then it is God they contend about! But mighty is He in (His) power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The thunder celebrates His praise and holiness, and the angels, too, celebrate His praise for awe of Him. He hurls thunderbolts, striking with them whom He wills while they are engaged in disputation concerning Allah. He is Mighty in His contriving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both the thunder and the angels glorify Him and out of His fear always praise Him. He sends down thunder-bolts to strike whomever He wants, while they are busy arguing about the existence of God. His punishment is stern.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the thunder proclaims His purity with praise, and the angels out of fear of Him; and He sends the bolt of lightning – it therefore strikes upon whom He wills, whilst they are disputing concerning Allah; and severe is His seizure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ar-Ra'd (thunder) glorifies and praises Him, and so do the angels because of His awe. He sends the thunderbolts, and therewith He strikes whom He wills, yet they (disbelievers) dispute about Allah. And He is Mighty in strength and Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the thunder declares His glory with His praise, and the angels too for awe of Him; and He sends the thunderbolts and smites with them whom He pleases, yet they dispute concerning Allah, and He is mighty in prowess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the thunder proclaims. His praise, and the angels, in awe of Him. He looses the thunderbolts, and smites with them whomsoever He will; yet they dispute about God, who is mighty in power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The thunder hymneth His praise and (so do) the angels for awe of Him. He launcheth the thunderbolts and smiteth with them whom He will while they dispute (in doubt) concerning Allah, and He is mighty in wrath.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the thunder glorifies Him with His praise and the angels do so too in awe of Him, and He sends His thunderbolts to strike anyone He pleases, yet they dispute about God, who is inexorable in His power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the thunder halloweth His praise, and so do the angels in awe of Him; and He sendeth the thunderbolts and smiteth therewith whomsoever He will. And they dispute concerning Allah, and He is strong in prowess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Thunder celebrates His praise, and the angels [too], in awe of Him, and He releases the thunderbolts and strikes with them whomever He wishes. Yet they dispute concerning Allah, though He is great in might.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, thunder repeateth His praises, and so do the angels, with awe: He flingeth the loud-voiced thunder-bolts, and therewith He striketh whomsoever He will.. yet these (are the men) who (dare to) dispute about Allah, with the strength of His power (supreme)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ar-Ra'd (thunder) glorifies and praises Him, and so do the angels because of His Awe, He sends the thunderbolts, and therewith He strikes whom He wills, yet they (disbelievers) dispute about Allah. And He is Mighty in strength and Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The thunder exalts His praise, and so are the angels are in awe of Him. He looses the thunderbolts and smites whosoever He will. Yet they dispute aboutAllah who is Mighty in power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The thunder praises His glory, and so do the angels, in awe of Him. And He sends the thunderbolts, striking with them whomever He wills. Yet they argue about God, while He is Tremendous in might.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the thunder exalts [Allah] with praise of Him - and the angels [as well] from fear of Him - and He sends thunderbolts and strikes therewith whom He wills while they dispute about Allah; and He is severe in assault.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:13] And the thunder — this is an angel, who is in charge of the clouds, driving them, [while he] constantly, proclaims His praise, that is, he says, ‘Glory be to God through His praise’ (subhāna’Llāh wa-bi-hamdihi), and so too the angels, proclaim His praise, in awe of Him, that is, of God. He unleashes the thunderbolts — these are a fire which issues forth from the clouds — and smites with them whom He will, such that it burns [that person]: this was revealed regarding a man to whom the Prophet (s) had sent someone to invite [to Islam] and who said, ‘Who is the Messenger of God? And what is God? Is He [made] of gold, or of silver, or of copper?’, whereupon a thunderbolt came down on him and blew off the top of his head; yet they, that is, the disbelievers, dispute, argue with the Prophet (s), about God, though He is great in might, in power, or in [the severity of His] retribution.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The thunder hymneth His praise) by His command; it is an angel; it is also said: it is the voice of the sky (and (so do) the angels) and also the angels hymn His praise (for awe of Him) the angels have awe towards Allah. (He launcheth the thunder bolts) i.e. fire (and smiteth with them whom He will) He destroys by means of fire whoever He will, referring here to Zayd Ibn Qays whom Allah destroyed by fire, along with his friend 'Amir Ibn al-Tufayl who was killed as a result of being stabbed in his waist (while they dispute (in doubt) concerning Allah) while they dispute with Muhammad (pbuh) concerning the Religion of Allah, (and He is mighty in wrath) His chastisement is severe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيُسَبِّحُ ٱلرَّعْدُ بِحَمْدِهِ } قالَ: فالرَّعدُ مَلكٌ يَزْجُرُ السَّحابُ بِصَوتِه\n والرَّعْدُ: الرِّيحُ\n والرَّعدُ: الصّوتُ\n\n\n\n\nوقوله تعالى: { وَهُوَ شَدِيدُ ٱلْمِحَالِ } معناه العقُوبةُ والمَكرُّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the thunder proclaims His glory with praise. Said: So the thunder is a king who drives away the clouds with his voice.\n\n\nAnd the thunder: the wind.\n\n\nAnd the thunder: the sound.\n\n\nAnd His saying, {And he is severe in punishment} means the punishment and the plot.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ويسبح } رعد سطوة التجليات الجلالية أي يسبّح الله ويمجده عما يتصوّر في العقل ممن ترد عليه تلك التجليات لوجدانه ما لا يدركه العقل ويحمده حق حمده بالكمال المستفاد من ذلك التجلي حمداً فعلياً فيكون التسبيح للرعد الموجب لذلك أو السطوة تسبح بنفس التجلي المنزّه عن أن يدرك بالإدراك العقلي { والملائكة } أي: ملكوت القوى الروحانية من هيبته وجلاله { ويرسل } صواعق السبحات الإلهية بتجلي القهر الحقيقي المتضمن للطف الكلي فيسلب الوجود عن المتجلى عليه ويفنيه عن بقية نفسه\n كما ورد في الحديث:\n \" إنّ لله سبعين ألف حجاب من نور وظلمة لو كشفها لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه \" \n{ فيُصِيبُ بها من يشاء } من عباده المحبوبين والمحبين العشاق المشتاقين { وهم يُجَادِلون في الله } بالتفكر في صفاته والنظر العقلي في إثباته وما يجب له ويمتنع عليه من الصفات { وهو شديدُ المحالُ } القوي في رفع الحيل العقلية في الإدراك وطمس نور بصيرته بالتجلي وإحراقه بنور العشق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } حين إراءة البروق وإنشاء السحب { يُسَبِّحُ ٱلرَّعْدُ } المتكون من اصطكاك الأبخرة والأدخنة المحتبسة بين السحب المتراكمة { بِحَمْدِهِ } أي: بحمد الله\n بإلقاء الملائكة الموكلين عليه\n المعاقبين الممدين له { وَٱلْمَلاَئِكَةُ } أيضاً يسبحون بحمده { مِنْ خِيفَتِهِ } أي: من خوف الله وسطوة جلاله وقهره { وَ } أيضاً { يُرْسِلُ ٱلصَّوَاعِقَ } الكائنة من الأبخرة والأدخنة المحترقة بالأجزاء النارية { فَيُصِيبُ بِهَا مَن يَشَآءُ } إهلاكه وقتله زجراً له وانتقاماً عليه { وَهُمْ } من غاية ضعفهم وعدم قدرتهم وقوتهم { يُجَٰدِلُونَ } ويكابرون { فِي } توحيد { ٱللَّهِ } وفيما جاءت به رسله من عنده من الأوامر والنواهي المتعلقة بالنشأة الأولى والأخرى { وَ } الحال أن لكمال قدرته وبسطته وسلطنته القاهرة وجلاله { هُوَ شَدِيدُ ٱلْمِحَالِ } [الرعد: 13] صعب المكابدة والانتقام لن جادل معه وكذب رسله بالباطل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وجملة: { وهم يجادلون }: إما استئنافية\n أو حال من الموصول\n والمِحال: المكر والخديعة\n من مَحَل بفلان إذا كاده وعرَّضه للهلاك\n ومنه تَحَمَّلَ: إذا تكلَّف استعمال الحيلة\n فالميم أصلية\n ووزنه: فِعَال\n وقيل: مشتق من الحيلة\n فالميم زائدة\n ووزنه: مِفْعَل\n وأصله: مِحْيَل\n يقول الحق جل جلاله: { إن الله لا يُغَيّر ما بِقومٍ } من النعم والعافية إلى النقمة والبلية { حتى يُغَيِّروا } هم { ما بأنفسهم } من الطاعة وترك المعصية\n إلى ارتكاب الذنوب\n فلا يسلب النعم عن قوم إلا بارتكاب ذنب\n ولو من البعض إذا سكت الكل\n { وإذا أراد الله بقوم سوءاً فلا مردّ له } أي فلا رادّ له ولا معقب لحكمه\n { وما لهم من دونه من وَالٍ } أي: ليس لهم من يلي أمرهم\n ويدفع عنهم السوء الذي قضاه الله عليهم\n وأراد نزوله بهم لأن وقوع خلاف مراد الله تعالى محال\n { هو الذي يُريكم البَرق خوفاً وطمعاً } أي: خوفاً مما ينشأ عن البرق من الصواعق والأمور الهائلة\n وطمعاً في نزول الغيث الذي يكون معه غالباً\n { ويُنشئ } أي: يخلق { السحاب } الغيم المسْحب\n { الثِّقال }: المثقل بالمطر الحاملة له\n { ويُسبحُ الرعدُ بحمده } أي: متلبساً بحمده\n أو: يدل الرعد بنفسه على وحدانيته تعالى وكمال قدرته ملتبساً بالدلالة على كمال فضله\n ونزول رحمته\n وعن ابن عباس رضي الله عنه: سُئل النبي صلى الله عليه وسلم عن الرعد فقال:\n \" مَلَكٌ مَوَكَّلُ بالسَّحابِ\n له مَخَارِيقُ مِنْ نَارٍ يَسُوقُ السَّحَاب \"\n \n{ و } تسبح أيضاً { الملائكة من خِيفَته } أي: من خوفه وإجلاله\n { ويُرسل الصواعقَ } نار تنزل من السماء وقت ضرب الرعد\n { فيصيب بها ما يشاء } فيهلكه { وهم يجادلون في الله } أي: الكفار\n حيث يكذبون رسوله فيما يصفه به من كمال العلم والقدرة\n والتفرد بالألوهية\n وبعث الناس وحشرهم للمجازاة\n { وهو شديد المِحَال } أي: شديد المكر بأعدائه\n الذين أرادوا أن يمكروا بنبيه ـ عليه الصلاة والسلام ـ\n رُوي أن عامر بن الطُفَيل وأرْبَدَ بن ربيعة وفدا على رسول الله صلى الله عليه وسلم قاصدين لقتله\n فأخذ عامر بالمجادلة مع سيدنا رسول الله صلى الله عليه وسلم ليشغله\n ودار أرْبَدُ من خلفه ليضربه بالسيف\n فتنبه له الرسول ـ عليه الصلاة والسلام ـ وقال:\n \" اللَّهُمَّ اكفنيهما بِمَا شِئتَ \" \n\n فأرسل الله على أرْبد صاعقة فقتلته\n ورُمي عامرٌ بغدة\n فمات في بيت امرأة سلُوليَّة\n فكان يقول: غُدة كغُدَّة البعير\n وموت في بيت امرأة سلُولِيَّة! فنزلت الآية من أولها\n وهو قوله: { له معقبات\n\n\n\n } إلخ\n على قول\n الإشارة: من جريان حكمته تعالى في خلقه أنه لا يسلب النعم عنهم إلا بسوء أدبٍ منهم\n كلٌّ على قدر مقامه\n فالنعم الظاهرة يسلبها بترك الطاعة الظاهرة\n أو بالمخالفة الظاهرة\n والنعم الباطنة يسلبها بترك المراقبة الباطنة أو المشاهدة الباطنة\n فلكل مقام حقوق آداب فمن أَخَلَّ بحقوق مقام نقص له منه\n إلا أن يتوب\n وقد يسيء الأدب فتؤخر العقوبة عنه\n فيظن أنه لم يُسْلب\n ولو لم يكن إلا ترك المزيد\n وقد يبعد\n وهو لا يشعر\n ولو لم يكن إلا وتركه وما يريد\n كما في الحِكَم: \" إن الله لا يغير ما في القلوب من أنوار الشهود والعيان\n حتى يغيروا ما بأنفسهم من حسن الأدب بسوء الأدب \"\n وهذا ما لم يتحقق له مقام المحبوبية والتمكن مع الله في المعرفة\n وإلا فالرعاية والعناية محفوفة بقلبه\n فقد يبلغ الولي إلى مقام يقال له: افعل ما شئت فقد غفرتُ لك\n كما وقع لأهل بدر\n وراجعٌ ما تقدم عند قوله:\n[الأنعام: 82] وقد يُغير الله قلب عبده اختباراً له\n فيسلبه حلاوة المعاملة أو المعرفة\n فإن هو اضطرب وتضرع ردَّ له حاله\n وإن لم يضطرب ولم يفزع إلى الله لم يرد له شيئاً\n وإليه الإشارة بقوله: { وإذا اراد الله بقوم سوءاً فلا مَردَّ له\n\n\n } الآية\n هو الذي يُريكم بَرْقَ لمعان أنوار المشاهدة\n عند الاستشراف على الحضرة القدسية\n خوفاً من الرجوع لعدم إطاقة ذلك النور\n وطمعاً في الوصول إلى التمكين\n فلا يزال تترادف عليه البروق حتى يستمر ذلك كبرق متصل\n وهي أنوار المواجهة\n وينشئ سحاب الواردات ثقالاً بالعلوم والأسرار\n ويرسل الصواعق تصعق وجود الحس عن أسرار المعاني\n فيصيب بها من يشاء ممن سبقتَ له العناية\n وأهل الإنكار والتكذيب بطريق الخصوص يجادلون في الله بتكذيب أوليائه وإنكار هذه الأنوار\n وهو شديد المحال\n فيمكر بهم ويتركهم في مقام البُعد\n وهم لا يشعرون\n ومن جملة التغيير الذي يسلب النعم ويوجب العظم الركون إلى غير الله بالدعاء وغيره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:19",
      "similarity": 0.399730339431435
    },
    {
      "verse": "52:45",
      "similarity": 0.10906715937423349
    },
    {
      "verse": "39:68",
      "similarity": 0.10696915137981941
    },
    {
      "verse": "41:13",
      "similarity": 0.10587369865692375
    },
    {
      "verse": "2:55",
      "similarity": 0.10506766478498289
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013013.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013013.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}