{
  "chapter": "الرعد",
  "text": "الله يبسط الرزق لمن يشاء ويقدر وفرحوا۟ بالحيوة الدنيا وما الحيوة الدنيا فى الءاخرة الا متع",
  "translations": [
    {
      "translation": "Allah expands provision to anyone He wills and restricts it. They rejoice in the life of this world. Yet the life of this world, compared to the Next World, is only fleeting enjoyment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God increases or decreases the fortunes of whosoever He will, and they rejoice in the life of this world. Yet the life of this world is nothing but a merchandise as compared to the life of the next.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah grants the provision to whomsoever He wills abundantly and grants others in strict measure. They exult in the life of the world, although compared with the Hereafter, the life of the world is no more than temporary enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gives abundant sustenance to whomever He wants and determines everyone's destiny. Some people are very happy with the worldly life. Compared to the life to come it is only a temporary means.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah eases and restricts the sustenance for whomever He wills; and the disbelievers rejoiced upon the life of this world; and the life of this world, as compared with the Hereafter, is just a brief utilisation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah increases the provision for whom He wills, and straitens (it for whom He wills), and they rejoice in the life of the world, whereas the life of this world compared to the Hereafter is but a brief passing enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah amplifies and straitens the means of subsistence for whom He pleases; and they rejoice in this world's life, and this world's life is nothing compared with the hereafter but a temporary enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God outspreads and straitens His provision unto whomsoever He will. They rejoice in this present life; and this present life, beside the world to come, is naught but passing enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah enlargeth livelihood for whom He will, and straiteneth (it for whom He will); and they rejoice in the life of the world, whereas the life of the world is but brief comfort as compared with the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gives abundantly to whom He will and sparingly to whom He pleases -- [those who deny the truth] rejoice in the life of this world; yet the life of this world is but a fleeting pleasure compared with the life to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah enlargeth the provision for whomsoever He Willeth and, stinteth. And they exult in the life of the world, whereas the life of the world, by the side of the Hereafter, is only a Passing enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah expands the provision for whomever He wishes, and tightens it. They boast of the life of this world, but compared with the Hereafter the life of this world is but a [trifling] enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah doth enlarge, or grant by (strict) measure, the sustenance (which He giveth) to whomso He pleaseth. (The wordly) rejoice in the life of this world: But the life of this world is but little comfort in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah increases the provision for whom He wills, and straitens (it for whom He wills), and they rejoice in the life of the world, whereas the life of this world as compared with the Hereafter is but a brief passing enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah gives abundantly and sparingly to whom He will. They rejoice in this present life; but this present life, beside the Everlasting Life, is nothing but a passing enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God dispenses the provisions to whomever He wills, and restricts. And they delight in the worldly life; yet the worldly life, compared to the Hereafter, is only enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah extends provision for whom He wills and restricts [it]. And they rejoice in the worldly life, while the worldly life is not, compared to the Hereafter, except [brief] enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:26] God expands provision, He makes it abundant, for whom He will, and straitens, restricts it, for whomever He will; and they, the people of Mecca, rejoice, a wanton rejoicing, in the life of this world, that is, in what they acquire therein, yet the life of this world, in, comparison with the life of, the Hereafter, is but [a brief] enjoyment, a trifling thing, enjoyed and then lost.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah enlargeth livelihood for whom He will) Ibn 'Abbas said: \"there are among His servants people who are only suited for an enlarged livelihood, such that a straitened livelihood would harm them; and there are among His servants people who are only suited for a straitened livelihood, such as an enlarged livelihood would harm them\", i.e. Allah gives abundant wealth in the life of this world to whomever He wills as a devise from Him, (and straiteneth (it for whom He will)) He withholds abundant wealth from whomever He wills out of care from Him; (and they rejoice in the life of the world) they are pleased with that which is in the life of this world of comfort and merriment, (whereas the life of the world) what is in the life of this world of comfort and merriment (is but brief comfort) very little; it is compared to the worth of household stuffs such as a platter, bowl, saucepan, and similar things (as compared with the Hereafter) as compared with the lasting bliss of the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما افتخر أهل مكة بما عندهم من الأمتعة والزخارف وبأهوائها، واستحقوا فقراء المؤمنين وشنعوا عليهم، ردَّ عليهم بكلام ناشئ عن محض الحكمة فقال: { ٱللَّهُ } المطلع لاستعدادات عباده { يَبْسُطُ } أي: يكثر ويوسع { ٱلرِّزْقَ لِمَنْ يَشَآءُ } من عباده في النشأة الأولى { وَيَقَدِرُ } أي: يقبض وينقص على من يشاء إرادة واختبار؛ حمكة منه وتدبيراً { وَ } هم بمفاخرهم ومباهاتهم بحطام الدنيا قد { فَرِحُواْ بِٱلْحَيَاةِ ٱلدُّنْيَا } المستعارة التي لا قرار لها ولا ثبات بل { وَمَا ٱلْحَيَاةُ ٱلدُّنْيَا } وما يترتر عليها من اللذات الفانية والمشتهيات الغير الباقية { فِي } جانب حياة { ٱلآخِرَةِ } وما يترتب عليها من اللذات الدائمة والمئويات الباقية { إِلاَّ مَتَاعٌ } [الرعد: 26] قليل حقير، لائق به ولا يلتفت إليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولم يدروا أن الله { يبسُطُ الرزقَ لمن يشاءُ } ، ولو كان من أهل الشقاء، { ويَقْدِرُ } يُضيقه على من يشاء، ولو كان من أهل السعادة والعناية، { وفرحُوا بالحياة الدنيا } واطمأنوا بها، وقنعوا بنعيمها الفاني، { وما الحياةُ الدنيا } في جنب الآخرة { إلا متاعٌ } إلا متعة لا تدوم، كعُجَالة الراكب وزاد الراعي\n وفي الحديث عنه صلى الله عليه وسلم:\n\n \" مَا لي وللدُّنْيَا إِنَّما مثلي ومَثَلُ الدُّنيا كَرَاكبٍ سَافَرَ في يَوْمٍ صائِفٍ، فَاسْتَظَلَّ تَحْتَ شَجَرةٍ، ثم رَاحَ عَنْها وَتَركَهَا \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:62",
      "similarity": 0.5855481656244887
    },
    {
      "verse": "39:52",
      "similarity": 0.5729247210573292
    },
    {
      "verse": "30:37",
      "similarity": 0.56798230189034
    },
    {
      "verse": "34:36",
      "similarity": 0.5467293048744045
    },
    {
      "verse": "34:39",
      "similarity": 0.5256565190759396
    }
  ]
}