{
  "chapter": "الرعد",
  "text": "ويقول الذين كفروا۟ لولا انزل عليه ءاية من ربه قل ان الله يضل من يشاء ويهدى اليه من اناب",
  "translations": [
    {
      "translation": "Those who are kafir say, 'Why has a Sign not been sent down to him from his Lord?' Say: 'Allah",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: \"How is it that no miracle was sent down to him by his Lord?\" Say: \"God leads whosoever He wills astray, and guides whoever turns to Him in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have rejected (the message of Muhammad) say: \"Why has no sign been sent down upon him from his Lord?\" Tell them: \"Allah lets go astray those whom He wills, and guides to Himself those who turn to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, \"Why have not some miracles been sent to him, (Muhammad), from his Lord.\" Say, \"God causes whomever He wants to go astray and He guides those who turn to Him in repentance\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said, “Why was not a sign sent down upon him from his Lord?” Proclaim, “Indeed Allah sends astray whomever He wills, and guides towards Himself the one who comes towards Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved say: \"Why is not a sign sent down to him from his Lord\" Say: \"Verily, Allah sends astray whom He wills and guides unto Himself those who turn to Him in repentance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: Why is not a sign sent down upon him by his Lord? Say: Surely Allah makes him who will go astray, and guides to Himself those who turn (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, 'Why has a sign not been sent down upon him from his Lord?' Say: 'God leads astray whomsoever He will, and He guides to Him all who are penitent.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: If only a portent were sent down upon him from his Lord! Say: Lo! Allah sendeth whom He will astray, and guideth unto Himself all who turn (unto Him),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth ask, \"Why has no Sign been sent down to him by his Lord?\" Say, \"God lets go astray those whom He wills and guides to Himself those who turn to Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: wherefore is not a sign sent down unto him from his Lord! Say thou: verily Allah sendeth astray whomsoever He will and guideth unto Himself whosoever turnoth in penitence--\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say, ‘Why has not some sign been sent down to him from his Lord?’ Say, ‘Indeed Allah leads astray whomever He wishes, and guides to Himself those who turn penitently [to Him]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Unbelievers say: \"Why is not a sign sent down to him from his Lord?\" Say: \"Truly Allah leaveth, to stray, whom He will; But He guideth to Himself those who turn to Him in penitence,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: \"Why is not a sign sent down to him (Muhammad SAW) from his Lord?\" Say: \"Verily, Allah sends astray whom He wills and guides unto Himself those who turn to Him in repentance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: 'Why has no sign been sent down to him by his Lord' Say: 'Allah leads astray whom He will, and guides those who repent,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say, “If only a miracle was sent down to him from his Lord.” Say, “God leads astray whomever He wills, and He guides to Himself whoever repents.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved say, \"Why has a sign not been sent down to him from his Lord?\" Say, [O Muhammad], \"Indeed, Allah leaves astray whom He wills and guides to Himself whoever turns back [to Him] -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:27] And those who disbelieve, from among the people of Mecca, say, ‘Why has not some sign, like the staff and the [glowing] hand or the she-camel, been sent down upon him, upon Muhammad (s), from his Lord?’ Say, to them: ‘Indeed God sends astray whomever He will, to send astray — such that signs cannot avail him in any way — and He guides, He directs, to Him, to His religion, those who turn in repentance’, [those who] return to Him (man, ‘those who’, is substituted by [the following, alladhīna, ‘those who …’]);\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who disbelieve) in Muhammad (pbuh) and in the Qur'an (say: If only a portent were sent down upon him) why is Muhammad (pbuh) not given a sign (from his Lord!) to prove his prophethood, as was given to earlier messengers, as he claims. (Say) Muhammad: (Lo! Allah sendeth whom He will) whoever deserves it (astray) from His religion, (and guideth unto Himself) to His religion (all who turn (unto Him)) all those who betake themselves to Him, 261\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من خبث طينتهم ورداءة فطرتهم { يَقُولُ ٱلَّذِينَ كَفَرُواْ } بك وبكتابك وبدينك: { لَوْلاَ } أي: هلا { أُنزِلَ عَلَيْهِ آيَةٌ } ملجئة لإيماننا { مِّن رَّبِّهِ } مع أنه يدعي التأييد منه\n ومع شغفه لإيماننا { قُلْ } لهم: ما عليَّ إلا البلاغ { إِنَّ ٱللَّهَ } المطلع لضمائر عباده { يُضِلُّ مَن يَشَآءُ } على مقتضى علمه وعدله لمن اراد إضلاله وانتقامه { وَيَهْدِيۤ إِلَيْهِ } على مقتضى جوده { مَنْ أَنَابَ } [الرعد: 27] إليه من ظهر القلب\n إذ كلي ميسر لما خلق له\n\n\n{ ٱلَّذِينَ آمَنُواْ } بتوحيد { وَتَطْمَئِنُّ قُلُوبُهُمْ } أي: تسكن وتستقر من دغدغة التقليد الباطل والتلوين المضمحل الزائل { بِذِكْرِ ٱللَّهِ } الواحد الأحد\n المستقل في الوجود بلا اضطراب وتعدد وتردد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { ويقولُ الذين كفروا } من أهل مكة: { لولا أنزل عليه آيةٌ } ظاهرة { من ربه } كما أنزلتْ على مَنْ قبله فنؤمن حينئذٍ؟ { قل } لهم: { إنَّ اللَّهَ يُضلُّ مَن يشاء } بعد ظهور الآيات والمعجزات. وليس الإيمان والهداية بيد العبد في الحقيقة. { ويهدي إليه من أناب } أي: من أقْبل ورجع عن عناده من غير احتياج إلى معجزة. قال البيضاوي: وهو جواب، يجري التعجب من قولهم، كأنه قال: قل لهم ما أعظم عنادكم! { إن الله يُضِلُّ من يشاء } ممن كان على صفتكم، فلا سبيل إلى اهتدائه، وإن نزلت كل آية، ويهدي إليه من أناب لما جئت به، بل بأدنى منه من الآيات. هـ. الإشارة: تقدم مراراً أن من سبقت له من عند الله عناية الخصوصية، لم يتوقف على ظهور آية. ومن لم يسبق له شيء في الخصوصية لا ينفع فيه ألف آية. فالله يضل من يشاء عن دخول حضرته، ولو رأى من أولياء زمانه ما رأى، ويهدي إلى حضرته من أناب، ورجع بلا سبب. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:13",
      "similarity": 0.6957628221658307
    },
    {
      "verse": "50:8",
      "similarity": 0.6586698576584135
    },
    {
      "verse": "42:10",
      "similarity": 0.652824494755056
    },
    {
      "verse": "30:31",
      "similarity": 0.6446234096489687
    },
    {
      "verse": "39:54",
      "similarity": 0.6397936126897342
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/13:27.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/13:27.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}