{
  "chapter": "الرعد",
  "text": "والذين صبروا۟ ابتغاء وجه ربهم واقاموا۟ الصلوة وانفقوا۟ مما رزقنهم سرا وعلانية ويدرءون بالحسنة السيئة او۟لئك لهم عقبى الدار",
  "translations": [
    {
      "translation": "those who are steadfast in seeking the face of their Lord, and establish salat and give from the provision We have given them, secretly and openly, and stave off evil with good, it is they who will have the Ultimate Abode -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who persevere in seeking the way of their Lord, who fulfil their devotional obligations, and spend of what We have given them, secretly or openly, who repel evil with good: For them is the recompense of Paradise:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who are steadfast in seeking the good pleasure of their Lord; who establish Prayer and spend both secretly and openly out of the wealth We have provided them, and who ward off evil with good. Theirs shall be the ultimate abode\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who exercise patience to gain God's pleasure, who are steadfast in prayer, who spend for the cause of God privately and in public, and who keep away evil with good will have a blissful end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were patient in order to gain their Lord’s pleasure and kept the prayer established and spent in Our cause part of what We bestowed upon them, secretly and openly, and repel evil by responding with goodness – for them is the gain of the final abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who remain patient, seeking their Lord's Face, perform the Salah, and spend out of that which We have bestowed on them, secretly and openly, and repel evil with good, for such there is a good end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are constant, seeking the pleasure of their Lord, and keep up prayer and spend (benevolently) out of what We have given them secretly and openly and repel evil with good; as for those, they shall have the (happy) issue of the abode\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "patient men, desirous of the Face of their Lord, who perform the prayer, and expend of that We have provided them, secretly and in public, and who avert evil with good -- theirs shall be the Ultimate Abode,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such as persevere in seeking their Lord's Countenance and are regular in prayer and spend of that which We bestow upon them secretly and openly, and overcome evil with good. Theirs will be the sequel of the (heavenly) Home,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who are steadfast in seeking the favour of their Lord, and pray regularly and spend secretly and openly out of what We have provided them with, and ward off evil with good. Theirs shall be the final abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who persevere seeking the countenance of their Lord and establish prayer, and expend out of that wherewith We have provided them, secretly and openly, and combat evil with good. These! for them is the happy end in the Abode:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who are patient for the sake of their Lord’s pleasure, maintain the prayer, and spend secretly and openly out of what We have provided them, and repel evil [conduct] with good. For such will be the reward of the [ultimate] abode:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who patiently persevere, seeking the countenance of their Lord; Establish regular prayers; spend, out of (the gifts) We have bestowed for their sustenance, secretly and openly; and turn off Evil with good: for such there is the final attainment of the (eternal) home,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who remain patient, seeking their Lord's Countenance, perform As-Salat (Iqamat-as-Salat), and spend out of that which We have bestowed on them, secretly and openly, and defend evil with good, for such there is a good end;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Patient men, desiring the Face of their Lord, establish their prayers, and spend of what We have given them in private and in public; and who wardoff evil with good. Theirs shall be the Ultimate Abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who patiently seek the presence of their Lord, and pray regularly, and spend from Our provisions to them, secretly and openly, and repel evil with good. These will have the Ultimate Home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are patient, seeking the countenance of their Lord, and establish prayer and spend from what We have provided for them secretly and publicly and prevent evil with good - those will have the good consequence of [this] home -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:22] such as are patient, through obedience and [during] hardship, and [staying] away from disobedience, desiring, seeking, their Lord’s countenance, and nothing else, from among the transient things of this world; and maintain the prayer and expend, in obedience, of that which We have provided them, secretly and openly, and repel evil with good, such as [repelling] ignorance through forbearance, and harm through patience; those, theirs shall be the sequel of the [heavenly] Abode: that is, the praiseworthy sequel in the Hereafter, namely:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such as persevere) in fulfilling the commands of Allah and in bearing misfortune (in seeking their Lord's Countenance) in pursuit of their Lord's good pleasure (and are regular in prayer) and perform the five daily prayers (and spend of that which We bestow upon them) and give alms from that which We have given them (secretly) such that none knows of it except Allah (and openly) in front of people, (and overcome evil with good) they face evil speech with good speech. (Theirs) the reward of those who fit the description above in His saying: (But only men of understanding... and overcome evil with good) to these people (will be the sequel of the (heavenly) Home) i.e. Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَدْرَءُونَ بِٱلْحَسَنَةِ ٱلسَّيِّئَةَ } معناهُ يَدفعُونَ بِهَا\n\n\n\n\nوقوله تعالى: { عُقْبَىٰ ٱلدَّارِ } معناهُ عَاقِبَتُهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"They repel evil with good\" [Qur'an 13:22], means that they repel it with something better.\n\n\nAnd His saying, {the final abode}, means their consequence.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَالَّذِينَ صَبَرُواْ } إذا أصابتهم مصيبة وأحاطتهم بلية { ٱبْتِغَاءَ وَجْهِ رَبِّهِمْ } وطلب مرضاته\n مسترجعين إليه سبحانه\n متضرعين نحوه { وَأَقَامُواْ ٱلصَّلاَةَ } أي: أداموا الميل والتوجه إليه في جميع الأحوال والأزمان { وَأَنْفَقُواْ } للفقراء المستحقين { مِمَّا رَزَقْنَاهُمْ } ووفقناهم وأقدرناهم لكسبها وجمعها { سِرّاً } أي: على وجه لا يشعر الفقير منفعة\n لئلا يتأذى بالمن والأذى { وَعَلاَنِيَةً } على وجه يعشر به\n لكي يبالغ المنفق في التذلل والانكسار بحيث لا يتوهم المنة أصلاً { وَ } أيضاً الذين { يَدْرَءُونَ } أي: يدفعون ويسقطون { بِٱلْحَسَنَةِ } أي: بالخصلة الحميدة والخلق المرضي { ٱلسَّيِّئَةَ } أي: الذميمة من الخصائل والأخلاق { أُوْلَـٰئِكَ } السعداء الأولياء\n ذوو العهد والوفاء والخوف والرجاء\n الصابرون على البلاء\n الراضون بما جرى عليهم من سوء القضاء\n المتوجهون إلى المولى في السراء والضراء\n المنفقون لرضاه من عندهم للفقراء\n حصل { لَهُمْ } حين كانوا في النشأة الأولى { عُقْبَىٰ ٱلدَّارِ } [الرعد: 22] الأخرى\n أي: ما يحصل فيها من اللذات والمثوبات ورفع الدرجات ونيل المرادات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والذين صَبرُوا } على مشاق الطاعة وترك المخالفة، أو على ما تكرهه النفوس، ويخالفه الهوى\n فعلوا ذلك { ابتِغَاءَ وَجهِ ربهم } طلباً لرضاه، أو لرؤية وجهه وشهود ذاته، لا فخراً ورياء، وطلباً لحظ نفساني\n { وأقاموا الصلاة } المفروضة، بحيث حافظوا على شروطها وأركانها، وحضور السر فيها، { وأنفقوا مما رزقناهم } من الأموال فرضاً ونفلاً، { سِراً وعلانيةً } إن تحقق الإخلاص، وإلا تعيَّن الإسرار\n أو سراً لمن لا يعرف بالمال، وجهراً لمن يعرف به لئلا يُتهم، أو ليُقتدى به\n { ويدرءُونَ بالحسنةِ السيئَةِ } أي: يدفعون الخصلةَ السيئة بالخصلة الحسنة، فيجازون الإساءة بالإحسان امتثالاً لقوله تعالى:\n\n[المؤمنون \" 96]، أو: يدفعون الشرك بقول: \" لا إله إلا الله \" ، أو يفعلون الحسنات فيدرؤون بها السيئات، كقوله\n\n[هود: 114]\n قيل: نزلت في الأنصار\n وهي عامة\n ثم ذكر جزاءهم، فقال: { أولئك لهم عُقْبَى الدَّارِ } أي: عاقبة دار الدنيا وما يؤول إليه أهلُها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:54",
      "similarity": 0.709765823735296
    },
    {
      "verse": "24:8",
      "similarity": 0.5984444175761451
    },
    {
      "verse": "2:72",
      "similarity": 0.5902305208627001
    },
    {
      "verse": "3:168",
      "similarity": 0.5753068008213577
    },
    {
      "verse": "16:19",
      "similarity": 0.35053748132938123
    }
  ]
}