{
  "chapter": "الرعد",
  "text": "الذين ءامنوا۟ وتطمئن قلوبهم بذكر الله الا بذكر الله تطمئن القلوب",
  "translations": [
    {
      "translation": "those who have iman and whose hearts find peace in the remembrance of Allah. Only in the remembrance of Allah can the heart find peace.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and find peace in their hearts from the contemplation of God: Surely there is peace of heart in the contemplation of God!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the ones who believe (in the message of the Prophet) and whose hearts find rest in the remembrance of Allah. Surely in Allah's remembrance do hearts find rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the faithful ones whose hearts are comforted by the remembrance of God. Remembrance of God certainly brings comfort to all hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Those who accepted faith and whose hearts gain solace from the remembrance of Allah; pay heed! Only in the remembrance of Allah is the solace of hearts!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed and whose hearts find rest in the remembrance of Allah. Verily, in the remembrance of Allah do hearts find rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and whose hearts are set at rest by the remembrance of Allah; now surely by Allah's remembrance are the hearts set at rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, their hearts being at rest in God's remembrance -- in God's remembrance are at rest the hearts\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who have believed and whose hearts have rest in the remembrance of Allah. Verily in the remembrance of Allah do hearts find rest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who believe and whose hearts find comfort in the remembrance of God -- surely in the remembrance of God hearts can find comfort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who believe and whose hearts find rest in the remembrance of Allah. Lo! in the remembrance of Allah hearts do find rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who have faith and whose hearts find rest in the remembrance of Allah.’ Behold! The hearts find rest in Allah’s remembrance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and whose hearts find satisfaction in the remembrance of Allah: for without doubt in the remembrance of Allah do hearts find satisfaction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe (in the Oneness of Allah - Islamic Monotheism), and whose hearts find rest in the remembrance of Allah, Verily, in the remembrance of Allah do hearts find rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who believe, and whose hearts find comfort in the remembrance of Allah. Is it not with the remembrance of Allah that hearts are satisfied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and whose hearts find comfort in the remembrance of God. Surely, it is in the remembrance of God that hearts find comfort.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:28] those who believe and whose hearts are reassured, find rest, by God’s remembrance, that is, by His promise [of reward]. Verily by God’s remembrance are hearts reassured, that is, the hearts of the believers;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who have believed) in Muhammad (pbuh) and in the Qur'an, (and whose hearts have rest) their hearts are content and quiescent (in the remembrance of Allah) in the Qur'an; it is also said that this means: in swearing by Allah. (Verily in the remembrance of Allah) the Qur'an and swearing by Allah (do hearts find rest!) i.e. they are content and quiescent.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ آمَنُواْ } بتوحيد { وَتَطْمَئِنُّ قُلُوبُهُمْ } أي: تسكن وتستقر من دغدغة التقليد الباطل والتلوين المضمحل الزائل { بِذِكْرِ ٱللَّهِ } الواحد الأحد، المستقل في الوجود بلا اضطراب وتعدد وتردد، فقد اضمحلت وتلاشت عن صحائف خواطرهم نقوش الاعتبار والسوى مطلقاً { أَلاَ } أيها الطالبون إلى مرتبة الكشف و الشهود { بِذِكْرِ ٱللَّهِ } المسقط للإضافات { تَطْمَئِنُّ ٱلْقُلُوبُ } [الرعد: 28] وتتمكن في مقام الحضور وتستريح عن تشاويش الأوهام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الموصول: بدل ممن أناب، أو خبر عن مضمر، أي: هم\n والموصول الثاني بدل ثانٍ، أو مبتدأ، وجملة طوبى: خبر، وهي فُعْلى، من الطيب، كبشرى من البشارة، قلبت ياؤها واواً لضم ما قبلها، ومعناها: أصبت خيراً وطيباً\n وقيل: شجرة في الجنة\n وسوغ الابتداء بها: ما فيها من معنى الدعاء\n يقول الحق جل جلاله: في وصف من سبقت له الهداية واتصفت بالإنابة: هم { الذين آمنوا } بالله وبرسوله إيماناً تمكَّن من قلوبهم، واطمأنت إليه نفوسُهم فإذا حركتهم الخواطر والهواجم، أو فتن الزمان وأهواله { تطمئن قلوبُهم بذِكرِ اللهِ } ، وترتاح بذكر الله أُنساً به، واعتماداً عليه ورجاء منه، أو بذكر رحمته بعد القلق من خشيته، أو بذكر آلائه، ودلائله الدالة على وجوده ووحدانيته، أو بكلامه القرآن، الذي هو أقوى المعجزات\n قاله البيضاوي\n وقال في القوت: معنى تطمئن بذكر الله: تهش وتستأنس به\n قال شيخ شيوخنا سيدي عبد الرَّحمن الفاسي بعد كلام: والحاصل أن المراد من الطمأنينة: السكون إلى المذكور، والأنس به\n ووجود الرَّوْحِ والفرح والانشراح، والغنى به\n هـ\n  قال تعالى: { ألا بذِكْرِ الله تطمئن القلوبُ } لا بغيره، فلا تسكن إلا إليه، ولا تعتمد إلا عليه فإن سكنت إلى غيره ذهب نورها، وعظم قلقها",
      "translations": []
    }
  ]
}