{
  "chapter": "الرعد",
  "text": "لهم عذاب فى الحيوة الدنيا ولعذاب الءاخرة اشق وما لهم من الله من واق",
  "translations": [
    {
      "translation": "For them is punishment in this world; and the punishment of the world to come is far more severe. They will have no one to save them from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall suffer chastisement in the life of the world, and surely the chastisement of the Hereafter is even more grievous. None has the power to shield them from (the chastisement of) Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers will face torment in this world and their punishment in the life hereafter will be even greater. No one can save them from the wrath of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be punished in the life of this world, and indeed the punishment of the Hereafter is the most severe; and there is none to save them from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is a torment in the life of this world, and certainly, harder is the torment of the Hereafter. And they have no defender (or protector) against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have chastisement in this world's life, and the chastisement of the hereafter is certainly more grievous, and they shall have no protector against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is chastisement in the present life; and the chastisement of the world to come is yet more grievous; they have none to defend them from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is torment in the life of the world, and verily the doom of the Hereafter is more painful, and they have no defender from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Punishment awaits them in the present life: but harsher is the punishment of the Hereafter -- no one will defend them against God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is torment in the life of the Word, and surely the torment of the Hereafter is harder; and from Allah there is for them no protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a punishment for them in the life of this world, and the punishment of the Hereafter will surely be harder, and they have no defender against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is a penalty in the life of this world, but harder, truly, is the penalty of the Hereafter: and defender have they none against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is a torment in the life of this world, and certainly, harder is the torment of the Hereafter. And they have no protector against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall be punished in this life but the punishment of the Everlasting Life is more grievous. None shall defend them from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is for them torment in the worldly life, but the torment of the Hereafter is harsher. And they have no defender against God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them will be punishment in the life of [this] world, and the punishment of the Hereafter is more severe. And they will not have from Allah any protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:34] For them there is chastisement in the life of this world, through being killed or taken captive; and verily the chastisement of the Hereafter is more grievous, is more severe; and they have no defender, protector, from God, that is, from His chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For them is torment in the life of the world) by being killed in Badr, (and verily the doom of the Hereafter is more painful) than the torment of the life of this world, (and they have no defender) no one to save them from this torment nor any refuge (from Allah) from Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَعَذَابُ ٱلآخِرَةِ أَشَقُّ } معناهُ أَشدُّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { لَّهُمْ عَذَابٌ فِي ٱلْحَيَاةِ ٱلدُّنْيَا } بغفلتهم عن معرفة الله واللذات الروحانية مع عدم شعورهم بها { وَ } الله { لَعَذَابُ ٱلآخِرَةِ } حين انكشف الحال وارتفع الحجب { أَشَقُّ } وأصعب { وَ } كيف لا يكون عذاب الآخرة أشق؛ إذ { مَا لَهُم } فيها { مِّنَ ٱللَّهِ } أي: عذابه وانتقامه { مِن وَاقٍ } [الرعد: 34] أي: حافظ شفيع يشفعهم ليخفف عنهم ويحفظهم من عذابه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لهم عذابٌ في الحياة الدنيا } بالقتل والأسر، وسائر ما يصيبهم من المصائب، { ولعذابُ الآخرة أشقُ } لشدته ودوامه، { وما لهم من الله } اي: من عذابه { من واقٍ } يقيهم ويعصمهم منه\n الإشارة: كل من تحقق أن الله قائم عليه استحيا منه أن يُسيء الأدب بين يديه، يقول الله تعالى في بعض الأخبار:\n\n \" إن كنتم تعتقدون أني لا أراكم، فالخلل في إيمانكم، وإن كنتم تعتقدون أني أراكم فَلِمَ جعلتموني أهون الناظرين إليكم؟ \" \n\nوكل من وقف مع الأسباب واعتمد عليها، أو طمع في الخلق وركن إليهم، فقد جعل لله شركاء، فيقال له: سَمِّ هؤلاء تجدهم حقاً عاجزين، لا قدرة لهم على شيء، ولا ينفعوك بشيء إلا ما قَسَم الله لك في الأزل\n بل زين لضعفاء اليقين مكرهم، حتى انخدعوا وافتتنوا برؤية الأسباب، أي: كفروا كفراً دون كفر بأن شكّوا في الرزق والشكُّ في الرزق شكٌ في الرزَّاق، وصدوا عن طريق اليقين، الغنى برب العالمين، لهم عذاب في الحياة الدنيا بالذل والحرص والحرمان\n  قال بعض العارفين: لو قيل للطمع: من أبوك؟ لقال: الشك في المقدور، ولو قيل له: ما حرفتك؟ لقال: الذل والهوان، ولو قيل له: ما غايتك؟ لقال: الحرمان\n وفي الحِكَم: \" ما بَسَقَتْ أغصانُ ذُلٍّ إلا عَلَى بَذْرِ طَمعٍ \"\n وقال الشاعر:\n",
      "translations": []
    }
  ]
}