{
  "chapter": "الرعد",
  "text": "افمن هو قائم على كل نفسۭ بما كسبت وجعلوا۟ لله شركاء قل سموهم ام تنبـونه بما لا يعلم فى الارض ام بظهر من القول بل زين للذين كفروا۟ مكرهم وصدوا۟ عن السبيل ومن يضلل الله فما له من هاد",
  "translations": [
    {
      "translation": "What then of Him who is standing over every self seeing everything it does? Yet still they associate others with Allah! Say: 'Name them! Or would you inform Him of something in the earth He does not know, or are they words which are simply guesswork on your part?' However, the plotting of those who are kafir seems good to them and they bar the way. Anyone misguided by Allah has no guide.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it who stands (watch) over every soul for what it does? Yet they ascribe compeers to God. Say: \"Then name them. Or are you announcing to God what He does not know on the earth? Or is it only empty talk? In fact, the unbelievers' plots are made to look attractive to them, so that they are held back from the right path. Whosoever God allows to go astray has none to show him the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it, then, in regard to Him Who watches over the deeds of every person that they are acting blasphemously by setting up His associates? Tell them: \"Name those associates (if Allah Himself has made them His associates)! Or are you informing Allah of something the existence of which He does not even know?\" Or do people arbitrarily utter empty words? Indeed, their foul contriving has been made to seem fair to the unbelievers and they have been barred from finding the Right Way. Whomsoever Allah lets go astray will have none to guide him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Can anyone be considered equal to) the One who is the Guardian of every soul and the Watcher of what it has gained? Yet, the unbelievers have considered their idols equal to God. Say, \"Name the attributes of your idols. Are you trying to tell God about something that does not exist on the earth? Do you only mention empty names? Evil plans have attracted the unbelievers and have misled them from the right path. No one can guide those whom God has caused to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So is He who keeps a watch over the deeds of every soul (equal to their appointed partners)? And (yet) they ascribe partners to Allah! Proclaim, “Just name them – or is it that you inform Him of something which in His knowledge does not exist in the earth – or is it just superficial talk?” In fact, their deceit seems good to the disbelievers and are prevented from the path; and whomever Allah sends astray, so there is none to guide him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then He (Allah) Who takes charge of every person and knows all that he has earned (like any other deity who knows nothing) Yet, they ascribe partners to Allah. Say: \"Name them! Is it that you will inform Him of something He knows not in the earth or is it (just) a show of false words.\" Nay! To those who disbelieved, their plotting is made fair-seeming, and they have been hindered from the right path; and whom Allah sends astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He then Who watches every soul as to what it earns? And yet they give associates to Allah! Say: Give them a name; nay, do you mean to inform Him of what He does not know in the earth, or (do you affirm this) by an outward saying? Rather, their plans are made to appear fair-seeming to those who disbelieve, and they are kept back from the path; and whom Allah makes err, he shall have no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, He who stands over every soul for what it has earned? -- And yet they ascribe to God associates. Say: 'Name them! Or will you tell Him what He knows not in the earth? Or in apparent words?' Nay; but decked out fair to the unbelievers is their devising, and they are barred from the way; and whomsoever God leads astray, no guide has he.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He Who is aware of the deserts of every soul (as he who is aware of nothing)? Yet they ascribe unto Allah partners. Say: Name them. Is it that ye would inform Him of something which He knoweth not in the earth? Or is it but a way of speaking? Nay but their contrivance is made seeming fair for those who disbelieve and they are kept from the right road. He whom Allah sendeth astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then He who watches over every soul and its actions [like any other]? Yet they ascribe partners to God. Say, \"Name them! Or do you presume to inform Him of something on the earth of which He does not know? Or, is all this only your verbal assertion?\" Indeed, their devices seem fair to those who deny the truth, and they are kept back from the right path. There can be no guide for those whom God lets go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He, then, who is ever standing over every soul with that which he earneth, like unto other! And yet they have set up associates unto Allah. Say thou: name them; would ye inform Him of that which He knoweth not on the earth? or is it by way of outward saying? Aye! fair-seeming unto those who disbelieve is made their plotting, and they have been hindered from the way. And whomsoever sendeth astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who sustains every soul in spite of what it earns [comparable to the idols]? Yet they ascribe partners to Allah! Say, ‘Name them!’ Will you inform Him concerning something He does not know about on the earth, or concerning [what are] mere words? Indeed, to the faithless, their scheming is presented as decorous, and they have been barred from the [right] way; and whomever Allah leads astray, has no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then He who standeth over every soul (and knoweth) all that it doth, (like any others)? And yet they ascribe partners to Allah. Say: \"But name them! is it that ye will inform Him of something he knoweth not on earth, or is it (just) a show of words?\" Nay! to those who believe not, their pretence seems pleasing, but they are kept back (thereby) from the path. And those whom Allah leaves to stray, no one can guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then He (Allah) Who takes charge (guards, maintains, provides, etc.) of every person and knows all that he has earned (like any other deities who know nothing)? Yet they ascribe partners to Allah. Say: \"Name them! Is it that you will inform Him of something He knows not in the earth or is it (just) a show of false words.\" Nay! To those who disbelieve, their plotting is made fairseeming, and they have been hindered from the Right Path, and whom Allah sends astray, for him, there is no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, He who stands over every soul for what it has earned, yet they made partners for Allah. Say: 'Name them. Or would you tell Him of that which is unknown in the earth to Him? Or in outward speech only' Indeed, their devising seems fair to the unbelievers, for they are barred from the Right Way. None can guide those whom Allah leads astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who is watchful over the deeds of every soul? Yet they ascribe associates to God. Say, “Name them! Or are you informing Him of something on earth He does not know, or is it a show of words?” In fact, the scheming of those who disbelieve is made to appear good to them, and they are averted from the path. Whomever God misguides has no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then is He who is a maintainer of every soul, [knowing] what it has earned, [like any other]? But to Allah they have attributed partners. Say, \"Name them. Or do you inform Him of that which He knows not upon the earth or of what is apparent of speech?\" Rather, their [own] plan has been made attractive to those who disbelieve, and they have been averted from the way. And whomever Allah leaves astray - there will be for him no guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:33] Is He Who stands, watches, over every soul what it has earned?, what it has done of good or evil — and this is God — like the idols who are not so? No! This [response] is suggested by [the following words]: Yet they ascribe to God associates. Say: ‘Name them!, for Him: who are they? Or will you inform Him, will you inform God, of something, that is, of an associate, which He does not know in the earth? (an interrogative of disavowal); in other words, He has no associate, for if He did, He would know him — exalted be He above such a thing. Or is it — nay — you call them associates, merely [a manner of] speaking?’, that is, [it is merely] on the basis of false conjecture, without any truth in it. Nay, but their scheming, their unbelief, has been adorned for those who disbelieve and they have been barred from the way, [from] the path of guidance; and whomever God sends astray, for him there is no guide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالفاء الواقعة بعد همزة الاستفهام مؤخرة من تقديم لأن همزة الاستفهام لها الصدارة . فتقدير أصل النظم : فأمن هو قائم . فالفاء لتفريع الاستفهام وليس الاستفهام استفهاماً على التفريع ، وذلك هو الوجه في وقوع حروف العطف الثلاثة الواو والفاء وثم بعد الاستفهام وهو رأي المحقيقين ، خلافاً لمن يجعلون الاستفهام وارداً على حرف العطف وما عَطفه .فالفاء تفريع على جملة { قل هو ربي لا إله إلا هو عليه توكلت } \\[ الرعد : 30 \\] المجاببِ به حكاية كفرهم المضمن في جملة { وهم يكفرون بالرحمن } \\[ الرعد : 30 \\] ، فالتفريع في المعنى على مجموع الأمرين : كفرهم بالله ، وإيمان النبي بالله .ويجوز أن تكون تفريعاً على جملة { ولو أن قرآناً سيرت به الجبال } \\[ الرعد : 31 \\] ، فيكون ترقياً في إنكار سؤالهم إتيان معجزة غير القرآن ، أي إن تعجب من إنكارهم آيات القرآن فإن أعجب منه جعلهم القائم على كل نفس بما كسبت مماثلاً لمن جعلوهم لله شركاء .واعتُرض أثرَ ذلك بردّ سُؤالهم أن تُسيّر الجبال أو تُقَطّع الأرض أو تُكلّم الموتى ، وتذكيرهم بما حل بالمكذبين من قبلهم مع إدماج تسلية الرسول عليه الصلاة والسلام ، ثم فرع على ذلك الاستفهام الإنكاري .وللمفسرين في تصوير نظم الآية محامل مختلفة وكثير منها متقاربة ، ومرجع المتجه منها إلى أن في النظم حذفاً يدل عليه ما هو مذكور فيه ، أو يدل عليه السياق . والوجه في بيان النظم أن التفريع على مجموع قوله : وهم يكفرون بالرحمن قل هو ربي لا إله إلا هو } أي أن كفرهم بالرحمان وإيمانك بأنه ربّك المقصورة عليه الربوبية يُتفرع على مجموع ذلك استفهامُهم استفهامَ إنكار عليهم تسويتهم من هو قائم على كلّ نفس بمن ليس مثله من جعلوهم له شركاء ، أي كيف يشركونهم وهم ليسوا سواء مع الله .وما صدق { من هو قائم على كلّ نفس } هو الله الإله الحق الخالق المدبّر .وخبر { من هو قائم } محذوف دلت عليه جملة { وجعلوا لله شركاء }. والتقدير : أمن هو قائم على كل نفس ومن جعلوهم به شركاء سواء في استحقاق العبادة . دل على تقديره ما تقتضيه الشركة في العبادة من التسوية في الإلهية واستحقاق العبادة . والاستفهام إنكار لتلك التسوية المفاد من لفظ { شركاء }. وبهذا المحذوف استغني عن تقدير معادل للهمزة كما نبّه عليه صاحب «مغني اللّبيب» ، لأن هذا المقدّر المدلول عليه بدليل خاص أقوى فائدة من تقدير المعادل الّذي حاصله أن يقدر : أم من ليس كذلك . وسيأتي قريباً بيان موقع { وجعلوا لله شركاء }.والعدول عن اسم الجلالة إلى الموصول في قوله : { أفمن هو قائم } لأن في الصلة دليلاً على انتفاء المساواة ، وتخطئة لأهل الشرك في تشريك آلهتهم لله تعالى في الإلهية ، ونداء على غباوتهم إذ هم معترفون بأن الله هو الخالق .والمقدر باعتقادهم ذلك هو أصل إقامة الدليل عليهم بإقرارهم ولما في هذه الصلة من التعريض لما سيأتي قريباً .والقائم على الشيء : الرقيب ، فيشمل الحفظ والإبقاء والإمداد ، ولتضمنه معنى الرقيب عدي بحرف { على } المفيد للاستعلاء المجازي . وأصله من القيام وهو الملازمة كقوله : { إلا ما دمت عليه قائماً } \\[ سورة آل عمران : 75 \\]. ويجيء من معنى القائم أنه العليم بحال كل شيء لأن تمام القيومية يتوقف على إحاطة العلم .فمعنى قائم على كل نفس } مُتولّيها ومدبّرها في جميع شؤونها في الخلق والأجل والرزق ، والعالم بأحوالها وأعمالها ، فكان إطلاق وصف { قائم } هنا من إطلاق المشترك على معنييه . والمشكرون لا ينازعون في انفراد الله بهذا القيام ولكنهم لا يراعون ذلك في عبادتهم غيره ، فمن أجل ذلك لزمتهم الحجة ولمراعاة هذا المعنى تعلق قائم بقوله : { على كل نفس } ليعم القيام سائر شؤونها .والباء في قوله : { بما كسبت } للملابسة . وهي في موقع الحال من { نفس } أو من { قائم } باعتبار ما يقتضيه القيام من العلم ، أي قياماً ملابساً لما عملته كل نفس ، أي قياماً وفاقاً لأعمالها من عمل خير يقتضي القيامَ عليها باللطف والرضى فتظهر آثار ذلك في الدنيا والآخرة لقوله : { من عمل صالحاً من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيّبة ولنجزينهم أجرهم بأحسن ما كانوا يعملون } \\[ سورة النحل : 97 \\] ، وقال : { وعد الله الذين آمنوا منكم وعملوا الصالحات ليستخلفنهم في الأرض كما استخلف الذين من قبلهم وليمكنن لهم دينهم الذي ارتضى لهم وليبدلنهم من بعد خوفهم أمنا } \\[ سورة النور : 55 \\] ؛ أو من عَمَل شر يقتضي قيامَه على النفس بالغضب والبلايا . ففي هذه الصلة بعمومها تبشير وتهديد لمن تأمل من الفريقين . فهذا تعريض بالأمرين للفريقين أفادته صلة الموصول .وجملة وجعلوا لله شركاء } في موضع الحال ، والواو للحال ، أي والحال جعلوا له شركاء .وإظهار اسم الجلالة إظهار في مقام الإتيان بضمير { من هو قائم }. وفائدة هذا الإظهار التعبير عن المسمى باسمه العَلَم الذي هو الأصل إذ كان قد وقع الإيفاء بحق العدول عنه إلى الموصول في الجملة السابقة فتهيأ المقام للاسم العَلَم ، وليكون تصريحاً بأنه المراد من الموصول السابق زيادة في التصريح بالحجة .وجملة { قل سموهم } استئناف أعيد معها الأمر بالقول لاسترعاء الأفهام لوَعي ما سيذكر . وهذه كلمة جامعة ، أعني جملة { سموهم } ، وقد تضمنت رداً عليهم . فالمعنى : سموهم شركاء فليس لهم حظ إلا التسمية ، أي دون مسمى الشريك ، فالأمر مستعمل في معنى الإباحة كناية عن قلة المبالاة بادعائهم أنهم شركاء مثل { قل كونوا حجارة } \\[ سورة الإسراء : 50 \\] ، وكما تقول للذي يخطىء في كلامه : قُل ما شئتَ . والمعنى : إن هي إلا أسماء سميتموها لا مسمياتتٍ لها بوصف الإلهيّة لأنها حجارة لا صفات لها من صفات التصرف . وهذا كقوله تعالى :{ ما تعبدون من دونه إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان } \\[ سورة يوسف : 40 \\] وقوله : { إن هي إلا أسماء سميتموها } \\[ سورة النجم : 23 \\]. وهذا إفحام لهم وتسفيه لأحلامهم بأنهم ألّهوا ما لا حقائق لها فلا شبهة لهم في ذلك ، كقوله تعالى : { أم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم } \\[ سورة الرعد : 16 \\]. وقد تمحل المفسرون في تأويل قل سموهم } بما لا مُحَصّل له من المعنى .ثم أضرب عن ذلك بجملة { أم تنبئونه بما لا يعلم في الأرض } وهي { أم } المنقطعة . ودَلت { أم } على أن ما بعدها في معنى الاستفهام ، وهو إنكاري توبيخي ، أي ما كان لكم أن تفتروا على الله فتضعوا له شركاء لم ينبئكم لوجودهم ، فقوله : { بما لا يعلم في الأرض } كناية عن غير الموجود لأن ما لا يعلمه الله لا وجود له إذ لو كان موجوداً لم يَخْفَ على علم العلام بكل شيء . وتقييد ذلك ب { الأرض } لزيادة تجهيلهم لأنه لو كان يخفى عن علمه شيء لخفي عنه ما لا يرى ولما خفيت عنه موجودات عظيمة بزعمكم .وفي سورة يونس ( 18 ) { قل أتنبئون الله بما لا يعلم في السماوات ولا في الأرض } زيادة في التعميم .وأم } الثانية متصلة هي معادلة همزة الاستفهام المقدرة في { أم تنبئونه }. وإعادة الباء للتأكيد بعد { أم } العاطفة . والتقدير : بل أتنبئونه بما لا يعلم في الأرض بل أتنبئونه بظاهر من القول .وليس الظاهر هنا مشتقاً من الظهور بمعنى الوضوح بل هو مشتق من الظُور بمعنى الزوال كناية عن البطلان ، أي بمجرد قبول لا ثبات له وليس بحق ، كقول أبي ذؤيب: ... وتلككِ شكاة ظاهر عنككِ عارُهاوقول سبرة بن عمرو الفقعسي: ... أعيّرْتَنا ألبانها ولحومهاوذلك عارياً يا ابنَ رَيْطة ظاهر ... وقوله : { بل زين للذين كفروا مكرهم } إضراب عن الاحتجاج عليهم بإبطال إلهية أصنامهم إلى كشف السبب ، وهو أن أيمة المشركين زيّنوا للذين كفروا مكرهم بهم إذ وضعوا لهم عبادتَها .والمكر : إخفاء وسائل الضر . وتقدم عند قوله تعالى : { ومكروا ومكر الله والله خير الماكرين } في أوائل سورة آل عمران ( 54 ) ، وعند قوله : { أفأمنوا مكر الله } في سورة الأعراف ( 99 ) ، وعند قوله : { وإذ يمكر بك الذين كفروا } في سورة الأنفال ( 30 ). والمراد هنا أن أيمة الكفر مثل عَمْرو بن لُحَيّ وضعوا للعرب عبادة الأصنام وحسّنوها إليهم مظهرين لهم أنها حق ونفع وما أرادوا بذلك إلا أن يكونوا قادة لهم ليسودُوهم ويُعبّدوهم .فلما كان الفعل المبني للمجهول يقتضي فاعلاً منويّاً كان قوله : زين للذين كفروا } في قوة قولك : زيّن لهم مزين . والشيء المزيّن ( بالفتح ) هو الذي الكلام فيه وهو عبادة الأصنام فهي المفعول في المعنى لفعل التزيين المبني للمجهول ، فتعين أن المرفوع بعد ذلك الفعل هو المفعول في المعنى ، فلا جرم أن مكرهم هو المفعول في المعنى ، فتعيّن أن المكر مراد به عبادة الأصنام .وبهذا يتجه أن يكون إضافة ( مكر ) إلى ضمير الكفار من إضافة المصدر إلى ما هو في قوة المفعول وهو المجرور بباء التعدية ، أي المكر بهم ممن زينوا لهم .وقد تضمن هذا الاحتجاح أساليب وخصوصيات :أحدها : توبيخهم على قياسهم أصنامهم على الله في إثبات الإلهية لها قياساً فاسداً لانتفاء الجهة الجامعة فكيف يسوي من هو قائم على كل نفس بمن ليسوا في شيء من ذلك .ثانيها : تبهيلهم في جعلهم أسماءَ لا مسمياتتٍ لها آلهةً .ثالثها : إبطال كون أصنامهم آلهة بأن الله لا يعلمها آلهة ، وهو كناية عن انتفاء إلهيتها .رابعها : أن ادعاءهم آلِهة مجرد كلام لا انطباق له مع الواقع ، وهو قوله : { أم بظاهر من القول }.خامسها : أن ذلك تمويه باطل روجه فيهم دعاة الكفر ، وهو معنى تسميته مكراً في قوله : { بل زين للذين كفروا مكرهم }.سادسها : أنهم يصدون الناس عن سبيل الهدى .وعُطف { وصدوا عن السبيل } على جملة { زين للذين كفروا مكرهم }. وقرأه الجمهور بفتح الصاد فهو باعتبار كون مضمون كلتا الجملتين من أحوال المشركين : فالأولى باعتبار كونهم مفعولين ، والثانية باعتبار كونهم فاعلين للصدّ بعد أن انفعلوا بالكفر . وقرأه عاصم ، وحمزة ، والكسائيّ ، وخلف { وصدوا } بضم الصاد فهو كجملة { زين للذين كفروا } في كون مضمون كلتيهما جعْل الذين كفروا مفعولاً للتزيين والصدّ .وجملة { ومن يضلل الله فما له من هاد } تذييل لما فيه من العموم .وتقدم الخلاف بين الجمهور وابن كثير في إثبات ياء { هاد } في حالة الوصل عند قوله تعالى : { ولكل قوم هاد } في هذه السورة ( 7 ).\n\n",
      "translations": [
        {
          "translation": "(Is He Who is aware of the deserts of every soul) He says: Allah oversees every soul and that which it earns of good and evil, provision and warding off; is He therefore ((as he who is aware of nothing)? Yet they ascribe unto Allah partners) idols which they worship. (Say) to them, Muhammad: (Name them) 262 enumerate their benefit and governance if they are Allah's partners. (Is it that ye would inform Him) are you going to inform Him (of something which He knoweth not) to exist (in the earth) which benefits or harms beside Allah? (Or is it but a way of speaking) or is it just out of false talk, false testimony and lying that they do worship them? (Nay, but their contrivance) their speech and deeds (is made seeming fair for those who disbelieve) in Muhammad (pbuh) and in the Qur'an (and they are kept from the right road) they were sent astray from Religion. (He whom Allah sendeth astray) from His religion, (for him there is no guide) no one to give him success.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَفَمَنْ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفْسٍ بِمَا كَسَبَتْ } معناهُ دائِمٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Who is he who will have power over every soul for what it has earned?} [Qur'an 4:85] Its meaning is always.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أفمن هو قائمٌ على كل نفس بما كَسبت } أي: يقوم عليها بإيجاد كل ما ينسب إليها من مكاسبها\n قيوم لها وبمكسوباتها\n وإنما سمي مكسوبها وإن كان بخلق الله تعالى لأنه إنما أظهره عليها لاستعداد فيها يناسبه به قبلته من الله تعالى\n فمن جهة قبول المحل وصلاحيته لمظهريته ومحليته ينسب إلى كسبها مع قيام الحق تعالى: بإيجاده لأنها اقتضته\n أو قائم عليها بحسب كسبها وبمقتضاه أي كما يقتضي مكسوباتها من الصفات والأحوال التي تعرض لاستعدادها يفيض عليها من الجزاء الذي هو الهيئات الكمالية النورانية المثيبة إياها\n أو الهيئات الكدرة الظلمانية المعذّبة إياها\n { لكل أجلٍ كتاب } لكل وقت أمر مكتوب مقدّر أو مفروض في ذلك الوقت على الخلق\n فالشرائع معينة عند الله بحسب الأوقات في كل وقت يأتي بما هو صلاح ذلك الوقت رسول من عنده وكذا جميع الحوادث من الآيات وغيرها\n { وما كان لرسول أن يأتي } بشيء منها إلا بإذنه في وقته لأنها معينة بإزاء الأوقات التي تحدث فيها من غير تغير وتبدّل وتقدّم وتأخر { يمحو الله ما يشاء } عن الألواح الجزئية التي هي النفوس السماوية من النقوش الثابتة فيها فيعدم عن المواد ويفنى { ويُثبت } ما يشاء فيها فيوجد\n { وعنده أمّ الكتاب } أي: لوح القضاء السابق الذي هو عقل الكل المنتقش بكل ما كان ويكون أزلاً وأبداً على الوجه الكليّ المنزّه عن المحو والإثبات\n فإن الألواح أربعة: لوح القضاء السابق العالي عن المحو والإثبات وهو لوح العقل الأول\n ولوح القدر أي: لوح النفس الناطقة الكلية التي يفصل فيها كليات اللوح الأول ويتعلق بأسبابها وهو المسمى بـ: اللوح المحفوظ\n ولوح النفوس الجزئية السماوية التي ينتقش فيها كل ما في هذا العالم بشكله وهيأته ومقداره وهو المسمى بالسماء الدنيا وهو بمثابة خيال العالم كما أن الأول بمثابة روحه والثاني بمثابة قلبه\n ثم لوح الهيولى القابل للصور في عالم الشهادة والله أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { أَ } ينسى الحساب وتيرك العقاب { فَمَنْ هُوَ قَآئِمٌ } أي: مطلع محاسب ورقيب حافظ { عَلَىٰ كُلِّ نَفْسٍ } من النفوس الخيرة والشريرة ليحيط { بِمَا كَسَبَتْ } إن خيراً فخير وإن شراً فشر { وَ } لا سيما الشر الذب { جَعَلُواْ لِلَّهِ } الأحد المنزه عن الشريك والولد { شُرَكَآءَ } فوق واحدة من أظلاله ومصنوعاته\n مع أنه سبحانه تعالى عن ذلك علواً كبيراً { قُلْ } لهم تبكيتاً عليهم وإلزاماً لهم: { سَمُّوهُمْ } أي: تلك الشركاء باسماء\n وصفوهم بصفات يستحقون بها الألوهية والربوبية { أَمْ تُنَبِّئُونَهُ } وتخبرونه { بِمَا لاَ يَعْلَمُ فِي ٱلأَرْضِ } أي: بأسماء وصفات لا يعلمها في الأرض\n بل لا يعلمها في السماء { أَم } سموهم { بِظَاهِرٍ مِّنَ ٱلْقَوْلِ } مجازاً بلا اعتبار المعنى الحقيقي فيهم\n وبالجملة: هم عاجزون عن الكل ساكتون عنها { بَلْ } إنما { زُيِّنَ } وحسن { لِلَّذِينَ كَفَرُواْ } وأشركوا { مَكْرُهُمْ } أي: تمويههم وتلبيسهم مع علمهم ببطلانها { وَ } مع ذلك { صُدُّواْ عَنِ ٱلسَّبِيلِ } أي: قصدوا إعراض ضعفاء المؤمنين عن طريق الحق\n ما هو إلا من غيهم وضلالهم في أصل فطرتهم { وَمَن يُضْلِلِ ٱللَّهُ } وأراد إضلاله { فَمَا لَهُ مِنْ هَادٍ } [الرعد: 33] يهديهم ويوفقهم إلى سبيل الرشاد\n\n\nبل { لَّهُمْ عَذَابٌ فِي ٱلْحَيَاةِ ٱلدُّنْيَا } بغفلتهم عن معرفة الله واللذات الروحانية مع عدم شعورهم بها { وَ } الله { لَعَذَابُ ٱلآخِرَةِ } حين انكشف الحال وارتفع الحجب { أَشَقُّ } وأصعب { وَ } كيف لا يكون عذاب الآخرة أشق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أفمن مع صلته: مبتدأ\n والخبر محذوف\n أي: أفمن هو رقيب على كل شيء أحق أن يعبد أم غيره\n أو كمن ليس كذلك؟!\n يقول الحق جل جلاله: { أفَمَنْ هو قائمٌ على كل نَفْس } أي: حفيظ رقيب على عمل كل نفس { بما كسبتْ } من خير أو شر\n لا يخفى عليه شيء من أعمالهم\n ولا يفوت عنده شيء من جزائهم أحق أن يُعبد أم غيره؟ أو كمن ليس كذلك ممن هو جماد لا يسمع\n ولا يعقل!!\n { وجعلوا لله شركاءَ } بعد هذا البيان التام\n { قل } لهم: { سَمُّوهُم } أي: اذكروا أسماءهم\n فلا تجدون إلا أسماء إناث كاللات والعزى ومناة\n أو أسماء أحجار وخشب فبأي وجه تستحق أن تعبد\n وتشرك مع الله في ألوهيته؟\n { أم تُنبِئُونه بما لا يعلمُ في الأرضِ } بل أتخبرونه بما لا يعلم وجوده في الأرض\n وهذا تهكم بهم\n كأنهم علموا استحقاق الأصنام العبادة\n ولم يعلمها الحق تعالى\n وهو محال\n والمعنى: أن الله لا يعلم لنفسه شركاء وإذا لم يعلمهم فليسوا بشيء\n فكيف تفترون الكذب في عبادتهم؟ { أم } تسمونهم شركاء\n { بظاهرٍ من القولِ } \n من غير حقيقة واعتبار معنى\n كتسمية الخبث مسكاً\n والبول عطراً\n { بل زُيِّن للذين كفروا مكرُهُم } أي: انخداعهم وغرورهم حتى توهموا الباطل حقاً\n أو مكرهم بالإسلام وكيدهم لأهله\n { وصدُّوا عن السبيل } أي: وصدوا الناس عن طريق الحق\n حيث منعوهم من الإسلام\n ومن قرأ بضم الصاد مبنياً للمفعول فمعناه: صدَّهُم الشيطانُ عن طريق الحق وضلوا عنه\n { ومن يُضلل اللَّهُ فما له من هَادٍ } أي: من يخذله الله فليس له من يوقفه غيره\n { لهم عذابٌ في الحياة الدنيا } بالقتل والأسر\n وسائر ما يصيبهم من المصائب\n { ولعذابُ الآخرة أشقُ } لشدته ودوامه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:42",
      "similarity": 0.4446030720526937
    },
    {
      "verse": "27:24",
      "similarity": 0.3750420968208758
    },
    {
      "verse": "7:99",
      "similarity": 0.3626174035467084
    },
    {
      "verse": "3:54",
      "similarity": 0.3518353323473429
    },
    {
      "verse": "71:22",
      "similarity": 0.34549738674387614
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}