{
  "chapter": "الرعد",
  "text": "مثل الجنة التى وعد المتقون تجرى من تحتها الانهر اكلها دائم وظلها تلك عقبى الذين اتقوا۟ وعقبى الكفرين النار",
  "translations": [
    {
      "translation": "What is the Garden promised to those who have taqwa like? It has rivers flowing under it and its foodstuffs and cool shade never fail. That is the final fate of those who have taqwa. But the final fate of the kuffar is the Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of Paradise promised the pious and devout is (of a garden) with streams of rippling water, everlasting fruits and shade. This is the recompense of those who keep away from evil; but the recompense of those who deny the truth is Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And such will be the Paradise promised to the God-fearing: rivers will flow beneath it, its fruits will be eternal, and so will be its blissful shade. That is the ultimate destiny of the God-fearing while Fire is the destiny of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The gardens which have been promised to the pious have flowing streams, everlasting fruits, and perpetual shade. Such is the blissful end of the pious, but hell fire is the terrible end for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A description of the Paradise which is promised to the pious; rivers flow beneath it; its fruits are unending, and its shade; this is the reward of those who fear; and the fate of the disbelievers is fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The description of the Paradise which those who have Taqwa have been promised: Underneath it rivers flow, its provision is eternal and so is its shade; this is the end (final destination) of those who have Taqwa, and the end (final destination) of the disbelievers is Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A likeness of the garden which the righteous are promised; there now beneath it rivers, its food and shades are perpetual; this is the requital of those who guarded (against evil), and the requital of the unbelievers is the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of Paradise, that is promised to the godfearing: beneath it rivers flow, its produce is eternal, and its shade. That is the requital of the god-fearing; and the requital of the unbelievers is -- the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A similitude of the Garden which is promised unto those who keep their duty (to Allah): Underneath it rivers flow; its food is everlasting, and its shade; this is the reward of those who keep their duty, while the reward of disbelievers is the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Paradise which the righteous have been promised: it is watered by running streams: eternal is its fruit, and eternal is its shade. That is the recompense of those who are righteous, but the recompense of those who deny the truth is the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The case of the Garden which hath been promised unto the God-fearing: rivers flow thereunder; fruit thereof is perpetual, and so is thes hade thereof. This is the ending of those who fear; and the ending of the infidels is the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A description of the paradise promised to the Godwary: streams run in it, its fruits and shade are everlasting. Such is the requital of those who are Godwary; and the requital of the faithless is the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of the Garden which the righteous are promised!- beneath it flow rivers: perpetual is the enjoyment thereof and the shade therein: such is the end of the Righteous; and the end of Unbelievers in the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The description of the Paradise which the Muttaqun (pious - see V. 2:2): have been promised! -Underneath it rivers flow, its provision is eternal and so is its shade, this is the end (final destination) of the Muttaqun (pious - see V. 2:2), and the end (final destination) of the disbelievers is Fire. (See Verse 47:15)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of Paradise which the righteous have been promised beneath it rivers flow, its produce and shade are eternal. Such is the payment of the righteous. But the payment of the unbelievers is the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of the Garden promised to the righteous: rivers flowing beneath it; its food is perpetual, and so is its shade. Such is the sequel for those who guard against evil, but the sequel of the disbelievers is the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of Paradise, which the righteous have been promised, is [that] beneath it rivers flow. Its fruit is lasting, and its shade. That is the consequence for the righteous, and the consequence for the disbelievers is the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:35] The likeness, the description, of Paradise, which has been promised to the God-fearing (this is a subject, the predicate of which has been omitted), in other words, according to what We recount to you [is as follows]: beneath it rivers flow, its food, what is consumed in it, is everlasting, never perishing, and its shade, is everlasting, never replaced by any sun, because it does not exist therein. That, namely, Paradise, is the reward, the sequel, of those who were wary, of idolatry, and the requital of the disbelievers is the Fire!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A similitude of the Garden) the likeness of the description of Paradise (which is promised unto those who keep their duty (to Allah)) those who ward off disbelief, idolatry and indecencies: (Underneath it) beneath its trees and habitations (rivers) rivers of wine, water, honey and milk (flow; its food is everlasting) its fruits are everlasting and never ending, (and its shade) is also everlasting and without any flaws; (this) Paradise (is the reward) the destination (of those who keep their duty) of those who ward off disbelief, idolatry and indecencies, (while the reward) the destination (of disbelievers is the Fire).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لإنبات ثمرات الكشوف والشهود { أُكُلُهَا } من الرزق المعنوي والأغذية الروحانية { دَآئِمٌ } غير منقطع { وِ } كذا { ظِلُّهَا } الذي تستريحون فيه دائم غير زائل\n لا انقطاع لها أصلاً كأظلال الدنيا { تِلْكَ } الجنة التي وصفت بما وصفت { عُقْبَىٰ ٱلَّذِينَ ٱتَّقَواْ } أي: عاقبة أمر المؤمنين الذين اتقوا عن محارم الله { وَّعُقْبَى ٱلْكَافِرِينَ } المصرين على ارتكاب الم عاصي والشهوات البهيمية { ٱلنَّارُ } [الرعد: 35] المعدة لهم بدل لذاتهم وشهواتهم السيئة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: مثل الجنة: مبتدأ\n قال سيبويه: الخبر محذوف، أي فيما يتلى عليكم صفة الجنة\n وقال الفراء: الخبر هو: تجري\n\n\n إلخ، وعلى قول سيبويه يكون تجري: حالاً من العائد المحذوف، أي: التي وُعدها المتقون حَالَ كَوْنِها تجري\n\n\n إلخ\n والمراد بالمثل هنا: الصفة، لا ضرب المثل\n وظِلُّها: مبتدأ حُذِف خبره، وظلها كذلك، والأكُل بضم الهمزة، ويجوز فيه ضم الكاف وإسكانها، وأما الأكل بالفتح فمصدر\n يقول الحق جل جلاله: صفة الجنة التي وُعِدَها المتقون هي غرف وقصور { تجري من تحتها الأنهارُ } من ماء وخمر وعسل ولبن، { أُكُلُها دائمٌ } ما يؤكل من ثمارها وأنواع أطعمتها لا ينقطع، { وظِلُّها } دائم، لا يُنسخ بالشمس كظلال الدنيا، { تلك } الجنة الموصوفة بهذه الأوصاف هي { عُقْبَى الذين اتقوا } الشرك والمعاصي، وهي مآلهم وعاقبة استقرارهم، { وعُقْبَى الكافرين النار } لا محيد عنها، وهي مآلهم وإليها رجوعهم\n وفي ترتيب العقبيين إطماع للمتقين، وإقناط للكافرين\n الإشارة: مثل جنة المعارف التي وعدها المتقون لكل ما يشغل عن الله هي حضرة مقدسة، يتنعم فيها أسرار العارفين، تجري من تحت قلوبهم أنهار العلوم والحكم، لذتها وقُوت الأرواح فيها دائم، وهي الفكرة في ميادين أنوار التوحيد، وجولان الروح في فضاء أسرار التفريد، وظل روحها وريحانها دائم، وهو: سكون القلب إلى الله، وفرح الروح بشهود الله\n وإليه أشار ابن الفارض بقوله، رحمه الله، في صف خمرتها:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:23",
      "similarity": 0.6036202933962029
    },
    {
      "verse": "11:107",
      "similarity": 0.5588568524815829
    },
    {
      "verse": "5:117",
      "similarity": 0.4846981207675145
    },
    {
      "verse": "19:31",
      "similarity": 0.4209341518545965
    },
    {
      "verse": "4:57",
      "similarity": 0.3685126262401488
    }
  ]
}