{
  "chapter": "الرعد",
  "text": "ولقد ارسلنا رسلا من قبلك وجعلنا لهم ازوجا وذرية وما كان لرسول ان ياتى بـاية الا باذن الله لكل اجل كتاب",
  "translations": [
    {
      "translation": "We sent Messengers before you and gave them wives and children. Nor was any Messenger able to bring a Sign except by Allah's permission. There is a prescribed limit to every term.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent many apostles before you, and bestowed on them wives and children, but it was not for any apostle to come up with a miracle unless by the leave of God. For every age there is a law.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We indeed sent many Messengers before you and We gave them wives and children; and no Messenger had the power to produce a miraculous sign except by the command of Allah. Every age has its own (revealed) Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Messengers before you (Muhammad) and gave them wives and offspring. No Messenger was to show miracles without the permission of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Noble Messengers before you, and made wives and children for them; and it is not the task of any Noble Messenger to bring a sign except by Allah’s command; and all promises have a time prescribed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Messengers before you, and made for them wives and offspring. And it was not for a Messenger to bring a sign except by Allah's leave. (For) every matter there is a decree (from Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent apostles before you and gave them wives and children, and it is not in (the power of) an apostle to bring a sign except by Allah's permission; for every term there is an appointment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Messengers before thee, and We assigned to them wives, and seed; and it was not for any Messengers to bring a sign, but by God's leave. Every term has a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We sent messengers (to mankind) before thee, and We appointed for them wives and offspring, and it was not (given) to any messenger that he should bring a portent save by Allah's leave. For everything there is a time prescribed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent down messengers before you and gave them wives and children. Yet it was not possible for a messenger to bring a sign, save by the command of God. Every age has had its revelation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We sent apostles before thee and We made for them wives and progeny and it is not for an apostle to Produce a verse except by the command of Allah; for everv time there is a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have sent apostles before you, and We appointed for them wives and descendants; and an apostle may not bring a sign except by Allah’s leave. There is a written [ordinance] for every term:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did send messengers before thee, and appointed for them wives and children: and it was never the part of a messenger to bring a sign except as Allah permitted (or commanded). For each period is a Book (revealed).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Messengers before you (O Muhammad SAW), and made for them wives and offspring. And it was not for a Messenger to bring a sign except by Allah's Leave. (For) each and every matter there is a Decree (from Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent forth other Messengers before you and given them wives and descendants. Yet none of them could bring a sign except by the permission of Allah. Every term has its Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent messengers before you, and We assigned for them wives and offspring. No messenger could bring a sign except with the permission of God. For every era is a scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have already sent messengers before you and assigned to them wives and descendants. And it was not for a messenger to come with a sign except by permission of Allah. For every term is a decree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:38] And when they derided him for having many wives, the following was revealed: And indeed We sent messengers before you, and We assigned to them wives and seed, children — and you are like them; and it was not for any Messenger, from among them, that he should bring a sign, save by God’s leave, because they are servants enthralled [by Him]. For every term, period, there is a Book, wherein is inscribed its delimitation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا عود إلى الردّ على المشركين في إنكارهم آية القرآن وتصميمهم على المطالبة بآية من مقترحاتهم تُماثل ما يؤثر من آيات موسى وآيات عيسى عليهما السلام ببيان أن الرسول لا يأتي بآيات إلاّ بإذن الله ، وأن ذلك لا يكون عى مقترحات الأقوام ، وذلك قوله : { وما كان لرسول أن يأتي بآية إلا بإذن الله } ، فالجملة عطف على جملة { وكذلك أنزلناه حكماً عربياً } \\[ الرعد : 37 \\].وأدمج في هذا الرد إزالة شبهة قد تعرض أو قد عرضت لبعض المشركين فيطعنون أو طعنوا في نبوءة محمد بأنه يتزوج النساء وأن شأن النبي أن لا يهتم بالنساء . قال البغوي : روي أن اليهود وقيل إن المشركين قالوا : إن هذا الرجل ليست له همة إلا في النساء اه . فتعين إن صحت الرواية في سبب النزول أن القائلين هم المشركون إذ هذه السورة مكية ولم يكن لليهود حديث مع أهل مكة ولا كان منهم في مكة أحد . وليس يلزم أن يكون هذا نازلاً على سبب . وقد تزوج رسول الله خديجة ثم سودة رضي الله عنهما في مكة فاحتمل أن المشركين قالوا قالةَ إنكار تعلقاً بأوهن أسباب الطعن في النبوءة . وهذه شبهة تعرض للسذج أو لأصحاب التمويه ، وقد يموّه بها المبشرون من النصارى على ضعفاء الإيمان فيفضلون عيسى عليه السلام على محمد بأن عيسى لم يتزوج النساء . وهذا لا يروج على العقلاء لأن تلك بعض الحظوظ المباحة لا تقتضي تفضيلاً . وإنما التفاضل في كل عمل بمقادير الكمالات الداخلة في ذلك العمل . ولا يدري أحد الحكمة التي لأجلها لم يتزوج عيسى عليه السلام امرأةً . وقد كان يحيى عليه السلام حَصوراً فلعل عيسى عليه السلام قد كان مثله لأن الله لا يكلفه بما يشق عليه وبما لم يكلف به غيره من الأنبياء والرسل . وأما وصف الله يحيى عليه السلام بقوله : وحصوراً } فليس مقصوداً منه أنه فضيلة ولكنه أعلم أباه زكرياء عليه السلام بأنه لا يكون له نسل ليعلم أن الله أجاب دعوته فوهب له يحيى عليه السلام كرامة له ، ثم قدّر أنه لا يكون له نسل إنفاذاً لتقديره فجعل امرأته عاقراً . وقد تقدم بيان ذلك في تفسير سورة آل عمران . وقد كان لأكثر الرسل أزواج ولأكثرهم ذرية مثل نوح وإبراهيم ولوط وموسى وداود وسليمان وغير هؤلاء عليهم السلام .والأزواج : جمع زوج ، وهو من مقابلة الجمع بالجمع ، فقد يكون لبعض الرسل زوجة واحدة مثل : نوح ولوط عليهما السلام ، وقد يكون للبعض عدة زوجات مثل : إبراهيم وموسى وداود وسليمان عليهم السلام .ولما كان المقصود من الردّ هو عدم منافاة اتخاذ الزوجة لصفة الرسالة لم يكن داع إلى تعداد بعضهم زوجات كثيرة .وتقدم الكلام على الزوج عند قوله تعالى : { وقلنا يآدم اسكن أنت وزوجك الجنة } في سورة البقرة ( 35 ).والذرية : النسل . وتقدم عند قوله تعالى : { قال ومن ذريتي } في سورة البقرة ( 124 ).وجملة وما كان لرسول أن يأتي بآية إلا بإذن الله } هي المقصود وهي معطوفة على جملة { ولقد أرسلنا رسلاً من قبلك }. وتركيب { ما كان } يدل على المبالغة في النفي ، كما تقدم عند قوله : { قال سبحانك ما يكون لي أن أقول ما ليس لي بحق } في سورة العقود ( 116 ). والمعنى : أن شأنك شأن من سبق من الرسل لا يأتون من الآيات إلاّ بما آتاهم الله .وإذن الله : هو إذن التكوين للآيات وإعلام الرسول بأن ستكون آية ، فاستعير الإتيان للإظهار ، واستعير الإذن للخلق والتكوين .تذييل لأنه أفاد عموم الآجال فشمل أجل الإتيان بآية من قوله : { وما كان لرسول أن يأتي بآية إلا بإذن الله }. وذلك إبطال لتوهم المشركين أن تأخر الوعيد يدل على عدم صدقه . وهذا ينظر إلى قوله تعالى : { ويستعجلونك بالعذاب ولولا أجل مسمى لجاءهم العذاب } \\[ سورة العنكبوت : 53 \\] فقد قالوا : { اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء } الآية \\[ سورة الأنفال : 32 \\].وإذ قد كان ما سألوه من جملة الآيات وكان ما وعدوه آية على صدق الرسالة ناسب أن يذكر هنا أن تأخير ذلك لا يدل على عدم حصوله ، فإن لذلك آجالاً أرادها الله واقتضتها حكمته وهو أعلم بخلقه وشؤونهم ولكن الجهلة يقيسون تصرفات الله بمثل ما تجري به تصرفات الخلائق .والأجل : الوقت الموقت به عمل معزوم أو موعود .والكتاب : المكتوب ، وهو كناية عن التحديد والضبط ، لأن شأن الأشياء التي يراد تحققها أن تكتب لئلا يخالف عليها . وفي هذا الرد تعريض بالوعيد . والمعنى : لكل واقع أجلٌ يقع عنده ، ولكل أجل كتاب ، أي تعيين وتحديد لا يتقدمه ولا يتأخر عنه .\n\n",
      "translations": [
        {
          "translation": "(And verily We sent messengers (to mankind) before thee) just as We have sent you, (and We appointed for them wives) more than you have of wives, such as David and Solomon (and offspring) more than your offspring, such was the case with Abraham, Isaac and Jacob. This verse was revealed about the Jews because they said: Had Muhammad been a prophet, he would have been too preoccupied to get married, (and it was not (given) to any messenger that he should bring a portent) a sign (save by Allah's leave) save by Allah's command. (For everything there is a time prescribed) an appointed time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَلَقَدْ أَرْسَلْنَا رُسُلاً مِّن قَبْلِكَ } مثلك { وَجَعَلْنَا لَهُمْ أَزْوَاجاً وَذُرِّيَّةً } مثل أزواجك وأولادك\n فلا يقدح في نبوتهم أزواجهم وأولادهم\n فكيف يقدح في نبوتك مع أنك أفضل منهم { وَ } أيضاً أرسلنا رسلاً من قبلك { مَا كَانَ } أي: ما صح وجاز { لِرَسُولٍ } منهم { أَن يَأْتِيَ بِآيَةٍ } مقترحة { إِلاَّ بِإِذْنِ ٱللَّهِ } ووحيه { لِكُلِّ أَجَلٍ } ووقت يسع فيه أمر من الأمور الكائنة والفسادة { كِتَابٌ } [الرعد: 38] نازل من عنده ناطق بوقوع ما كان ويكون فيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ولقد ارسلنا رُسُلاً من قَبلكَ } يا محمد\n { وجعلنا لهم أزواجاً } كثيرة: كداود عليه السلام كان له مائة امرأة\n وابنه كان له ألف\n على ما قيل\n وغيرهما من الأنبياء والرسل\n { و } جعلنا لهم منهن { ذُريةً } \n وأنت يا محمد منهم فليس ببدع أن يكون الرسول بشراً\n يتزوج النساء\n ويحتاج إلى ما يحتاج إليه البشر\n إلا أنه لا يشغله ذلك عن أداء الرسالة\n ونصيحة الأمة\n وإظهار شريعة الدين\n والقيام بحقوق رب العالمين\n ولما أجابهم بشبهتهم قالوا: أظهر لنا معجزة كما كانت لهم\n كالعصا وفلق البحر\n وإحياء الموتى؟ فإنزل الله { وما كان لرسول } ما صح له ولم يكن في وسعه { أن يأتي بآيةٍ } تُقترح عليه\n ويظهرها { إلا بإذن الله } وإرادته فإنه القادر على ذلك\n { لكل أجلٍ } من آجال بني آدم وغيرهم\n { كتابٌ } يُكتب فيه وقت موته\n وانتقاله من الدنيا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:40",
      "similarity": 0.44879437169326786
    },
    {
      "verse": "3:34",
      "similarity": 0.3862765830388063
    },
    {
      "verse": "57:26",
      "similarity": 0.3713183038459158
    },
    {
      "verse": "25:74",
      "similarity": 0.36327556148251017
    },
    {
      "verse": "77:12",
      "similarity": 0.36147548349511943
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}