{
  "chapter": "الرعد",
  "text": "كذلك ارسلنك فى امة قد خلت من قبلها امم لتتلوا۟ عليهم الذى اوحينا اليك وهم يكفرون بالرحمن قل هو ربى لا اله الا هو عليه توكلت واليه متاب",
  "translations": [
    {
      "translation": "In the same way We have sent you among a nation before which other nations passed away, to recite to them what We have revealed to you. Yet they still reject the All-Merciful. Say: 'He is my Lord; there is no god but Him. I put my trust in Him and I turn to Him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how We have sent you to a people before whom many a people have come and gone, so that you may announce to them whatever We have revealed to you. But they do not believe in Ar-Rahman. Tell them: \"He is my Lord. There is no other god but He. In Him have I placed my trust, and to Him is my reversion.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We sent you as a Messenger to a community before which many other communities have passed away that you may recite to them whatever We have revealed to you. And yet they deny the Lord of Mercy. Say to them: \"He is my Lord, there is no god but Him. In Him I have placed all my trust and to Him I shall return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent you to a nation before whom there lived many nations so that you would read to them what We have revealed to you. They still deny the existence of the Beneficent God. Say, \"He is my Lord besides whom there is no other God. I trust Him and turn to Him in repentance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Similarly We sent you (O dear Prophet Mohammed – peace and blessings be upon him) towards the nation, before whom other nations have passed away, for you to recite to them the divine revelations We sent down to you, whereas they are denying the Most Gracious; proclaim, “He is my Lord – there is no worship except for Him; I rely only upon Him and only towards Him is my return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We sent you to a community before whom other communities have passed away, in order that you might recite unto them what We have revealed to you, while they disbelieve in the Most Gracious (Allah). Say: \"He is my Lord! None has the right to be worshipped but He! In Him is my trust, and to Him I turn.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have sent you among a nation before which other nations have passed away, that you might recite to them what We have revealed to you and (still) they deny the Beneficent Allah. Say: He is my Lord, there is no god but He; on Him do I rely and to Him is my return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have sent thee among a nation before which other nations have passed away, to recite to them that We have revealed to thee; and yet they disbelieve in the All-merciful. Say: 'He is my Lord -- there is no god but He. In Him I have put my trust, and to Him I turn.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We send thee (O Muhammad) unto a nation, before whom other nations have passed away, that thou mayst recite unto them that which We have inspired in thee, while they are disbelievers in the Beneficent. Say: He is my Lord; there is no Allah save Him. In Him do I put my trust and unto Him is my recourse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have sent you to a people, before whom other peoples have passed away, so that you may recite to them what We have revealed to you. Yet they deny the Gracious God. Say, \"He is my Lord; there is no god but He. In Him I put my trust and to Him I shall return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have sent thee unto a community before whom other communities have passed away, in order that thou mayest recite unto them that which We have Revealed unto thee; yet they disbelieve in the Compassionate. Say thou: He is my Lord, there is no god but he; on Him I rely, and unto Him is my return in penitence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We sent you to a nation before which many nations have passed away, that you may recite to them what We have revealed to you. Yet they defy the All-beneficent. Say, ‘He is my Lord; there is no god except Him; in Him I have put my trust, and to Him will be my return.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have we sent thee amongst a People before whom (long since) have (other) Peoples (gone and) passed away; in order that thou mightest rehearse unto them what We send down unto thee by inspiration; yet do they reject (Him), the Most Gracious! Say: \"He is my Lord! There is no god but He! On Him is my trust, and to Him do I turn!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We sent you (O Muhammad SAW) to a community before whom other communities have passed away, in order that you might recite unto them what We have inspired to you, while they disbelieve in the Most Beneficient (Allah) Say: \"He is my Lord! La ilaha illa Huwa (none has the right to be worshipped but He)! In Him is my trust, and to Him will be my return with repentance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such, We have sent you forth to a nation before whom others have passed away in order that you recite to them what We have revealed to you. Yet they disbelieve the Merciful. Say: 'He is my Lord. There is no god except He. In Him I have put my trust, and to Him I turn'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We sent you among a community before which other communities have passed away, that you may recite to them what We revealed to you. Yet they deny the Benevolent One. Say, “He is my Lord; there is no god but He; in Him I trust, and to Him is my repentance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We sent you to a community before which [other] communities have passed on so you might recite to them that which We revealed to you, while they disbelieve in the Most Merciful. Say, \"He is my Lord; there is no deity except Him. Upon Him I rely, and to Him is my return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:30] Thus, just as We sent prophets before you, We have sent you to a community before whom other communities have passed away, that you may recite to them that which We have revealed to you, that is, the Qur’ān; yet they disbelieve in the Compassionate One, for, when they were commanded to prostrate themselves to Him, they said, ‘And what is the Compassionate One?’ Say, to them, O Muhammad (s): ‘He is my Lord; there is no god save Him. In Him I trust and to Him is my recourse’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus We send thee (0 Muhammad) unto a nation, before whom other nations have passed away, that thou mayst recite unto them that which We have inspired in you) that with which We sent Gabriel to you, i.e. the Qur'an (while they are disbelievers in the Beneficent) they say: we do not know the Beneficent, except Musaylimah, the liar. (Say) the Beneficent: (He is my Lord; there is no God save Him. In Him do I put my trust) I trust in and rely on Him (and unto Him is my recourse) to Him is the return in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { خَلَتْ مِن قَبْلِهَآ أُمَمٌ } معناهُ قُرونٌ\n\n",
      "translations": [
        {
          "translation": "\n\nThe saying of the Almighty \"Nations have passed away before it\" means centuries.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَذَلِكَ } أي: مثل إرسالنا الرسل على الأمم الماضية على مقتضى سنتنا القديمة { أَرْسَلْنَاكَ } يا أكمل الرسل { فِيۤ أُمَّةٍ } منحرفة عن طريق الحق، وليس إرسالك عليهم ببدع { قَدْ خَلَتْ } ومضت { مِن قَبْلِهَآ أُمَمٌ } أمثالهم مائلون عن طريق الحق وسواء السبيل، وإنما أرسلناك { لِّتَتْلُوَاْ عَلَيْهِمُ } وتبلغهم { ٱلَّذِيۤ أَوْحَيْنَآ إِلَيْكَ } من المعارف والحقائق والآداب والأخلاق المرضية المقبولة في جنابنا، المودعة في استعدادات عبادنا؛ ليفوزوا بها سعة رحمتنا وجودنا { وَهُمْ } لانهماكهم في الغفلات والشهوات { يَكْفُرُونَ } وينكرون { بِٱلرَّحْمَـٰنِ } الذي وسع كل شيء رحمة وعلماً { قُلْ } يا أكمل الرسل للمنكرين الغافلين تنبيهاً عليهم وتبليغاً، وإن كانوا من الحمقى الهالكين في تيه الغفلة والنسيان { هُوَ رَبِّي } وربكم ومولى أمري وأموركم { لاۤ إِلَـٰهَ } في الوجود يعبد له ويرجع إليه في الوقائع { إِلاَّ هُوَ } الواحد الأحد، الصمد الفرد، الذي لا شريك له { عَلَيْهِ } لا على غيره من الأظلال { تَوَكَّلْتُ } في جميع أموري { وَإِلَيْهِ } لا إلى غيره من الأسباب والوسائق { مَتَابِ } [الرعد: 30] أي: مرجعي ومعادي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:18",
      "similarity": 0.506022050075272
    },
    {
      "verse": "35:24",
      "similarity": 0.49110121023960923
    },
    {
      "verse": "2:134",
      "similarity": 0.4590763207505277
    },
    {
      "verse": "2:141",
      "similarity": 0.4590763207505277
    },
    {
      "verse": "84:4",
      "similarity": 0.40706761656114243
    }
  ]
}