{
  "chapter": "الرعد",
  "text": "وكذلك انزلنه حكما عربيا ولئن اتبعت اهواءهم بعدما جاءك من العلم ما لك من الله من ولى ولا واق",
  "translations": [
    {
      "translation": "Accordingly We have sent it down as a judgement in Arabic. If you followed their whims and desires after the knowledge that has come to you, you would have no protector or defender against Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how We have sent down this (Qur'an) as a code of clear judgement. But if you follow their caprices, now that you have been given knowledge, you will have no friend or protector against God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is with the same directive that We revealed to you this Arabic Writ. Were you indeed to follow the vain desires of people after the true knowledge has come to you, none will be your supporter against Allah, and none will have the power to shield you from His punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We revealed it (the Quran) as a code of conduct in the Arabic language. (Muhammad), if you follow their desires after the knowledge has been revealed to you, know that no one will be able to guard or protect you from the wrath of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly We have revealed this as a command in Arabic; and O listener (follower of this Prophet), if you follow their desires after the knowledge having come to you, then you will have neither a supporter nor any saviour against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We sent it (the Qur'an) down to be a judgement of authority in Arabic. Were you to follow their (vain) desires after the knowledge which has come to you, then you will not have any Wali (protector) or defender against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We revealed it, a true judgment in Arabic, and if you follow their low desires after what has come to you of knowledge, you shall not have against Allah any guardian or a protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so We have sent it down as an Arabic judgment. And if thou dost follow their caprices, after the knowledge that has come to thee, thou shalt have no protector against God, and no defender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We revealed it, a decisive utterance in Arabic; and if thou shouldst follow their desires after that which hath come unto thee of knowledge, then truly wouldst thou have from Allah no protecting friend nor defender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have revealed it as a [clear] commandment in Arabic. If you followed their desires after all the knowledge which has come to you, you would have no protector or shield against God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Thus We have sent it down as a judgment in Arabic, And surely wert thou to follow their vain desires, after that which hath come to thee of knowledge, thou wilt not have against Allah any patron or protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have sent it down as a dispensation in Arabic; and should you follow their desires after the knowledge that has come to you, you shall have against Allah neither any guardian nor defender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We revealed it to be a judgment of authority in Arabic. Wert thou to follow their (vain) desires after the knowledge which hath reached thee, then wouldst thou find neither protector nor defender against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We sent it (the Quran) down to be a judgement of authority in Arabic. Were you (O Muhammad SAW) to follow their (vain) desires after the knowledge which has come to you, then you will not have any Wali (protector) or defender against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as such We have sent it down an Arabic judgment. And if you follow their desires, after the knowledge that has come to you, you shall have no guardian other than Allah, nor yet a defender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We revealed it an Arabic code of law. Were you to follow their desires, after the knowledge that has come to you, you would have neither ally nor defender against God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have revealed it as an Arabic legislation. And if you should follow their inclinations after what has come to you of knowledge, you would not have against Allah any ally or any protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:37] And so, just like that [manner of] revelation, We have revealed it, that is, the Qur’ān, as a [decisive] judgement in Arabic, in the language of the Arabs, for you to judge thereby between people. And if you should follow their whims, that is, [those of] the disbelievers, in that to which they summon you of their creed, hypothetically [speaking], after what has come to you of knowledge, of God’s Oneness, you shall have no protector, to assist you, against God (mina’Llāhi min: the [second] min is extra) and no defender, to ward off His chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاعتراض وعطف على جملة { والذين آتيناهم الكتاب يفرحون بما أنزل إليك } \\[ الرعد : 36 \\] لما ذكر حال تلقي أهل الكتابين للقرآن عند نزوله عُرج على حال العرب في ذلك بطريقة التعريض بسوء تلقي مشركيه له مع أنهم أولَى الناس بحسن تلقيه إذ نزل بلسانهم مشتملاً على ما فيه صلاحهم وتنوير عقولهم . وقد جُعل أهم هذا الغرض التنويهَ بعلوّ شأن القرآن لفظاً معنى . وأدمج في ذلك تعريض بالمشركين من العرب .والقول في اسم الإشارة في قوله : وكذلك } مثل ما تقدم في قوله : { كذلك أرسلناك في أمة } \\[ سورة الرعد : 30 \\].وضمير الغائب في أنزلناه } عائد إلى { ما أنزل إليك } في قوله : { يفرحون بما أنزل إليك }.والجار والمجرور من اسم الإشارة نائب عن المفعول المطلق . والتقدير؛ أنزلناه إنزالاً كذلك الإنزال .و { حكماً عربياً } حالان من ضمير { أنزلناه }. والحكم : هنا بمعنى الحكمة كما في قوله : { وآتيناه الحكم صبيا } \\[ سورة مريم : 12 \\]. وجُعل نفس الحكم حالاً منه مبالغة . والمراد أنه ذو حكم ، أي حكمة . والحكمة تقدمت .وعربياً } حال ثانية وليس صفة ل { حكماً } إذ الحكمة لا توصف بالنسبة إلى الأمم وإنما المعنى أنه حكمة معبر عنها بالعربية . والمقصود أنه بلغة العرب التي هي أفصح اللغات وأجملها وأسهلها ، وفي ذلك إعجازه . فحصل لهذا الكتاب كمالان : كمال من جهة معانيه ومقاصده وهو كونه حكماً ، وكمال من جهة ألفاظه وهو المكنى عنه بكونه عربياً ، وذلك ما لم يبلغ إليه كتاب قبله لأن الحكمة أشرف المعقولات فيناسب شرفها أن يكون إبلاغها بأشرف لغة وأصلحها للتعبير عن الحكمة ، قال تعالى : { وإنه لتنزيل رب العالمين نزل به الروح الأمين على قلبك لتكون من المنذرين بلسان عربي مبين } \\[ سورة الشعراء : 192 195 \\]. %ثم في كونه عربياً امتنان على العرب المخاطبين به ابتداء بأنه بلغتهم وبأن في ذلك حسن سمعتهم ، ففيه تعريض بأفن رأي الكافرين منهم إذ لم يشكروا هذه النعمة كما قال تعالى : { لقد أنزلنا إليكم كتاباً فيه ذكركم أفلا تعقلون } \\[ سورة الأنبياء : 10 \\]. قال مالك : فيه بقاء ذكركم .وجملة ولئن اتبعت أهواءهم بعد ما جاءك من العلم } معترضة ، واللام موطئة للقسم وضمير الجمع في قوله : { أهواءهم } عائد إلى معلوم من السياق وهم المشركون الذين وجه إليهم الكلام .واتباع أهوائهم يحتمل السعي لإجابة طلبتهم إنزال آية غير القرآن تحذيراً من أن يسأل الله إجابتهم لما طلبوه كما قال لنوح عليه السلام { فلا تسألني ما ليس لك به علم إنّي أعظك أن تكون من الجاهلين }.ومعنى { ما جاءك من العلم } ما بلغك وعُلّمته ، فيحتمل أن يراد بالموصول القرآن تنويهاً به ، أي لئن شايعَتهم فسألَتنا آية ير القرآن بعد أن نزل عليك القرآن ، أو بعد أن أعلمناك أنا غير متنازلين لإجابة مقترحاتهم .ويحتمل اتباع دينهم فإن دينهم أهواء ويكون ما صدق { ما جاءك من العلم } هو دين الإسلام .والوليّ : النصير . والواقي : المدافع .وجعل نفي الولي والنصير جواباً للشرط كناية عن الجواب ، وهو المؤاخذة والعقوبة .والمقصود من هذا تحذير المسلمين من أن يركنوا إلى تمويهات المشركين ، والتحذير من الرجوع إلى دينهم تهييجاً لتصلبهم في دينهم على طريقة قوله تعالى : { ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك } \\[ سورة الزمر : 65 \\] ، وتأييس المشركين من الطمع في مجيء آية توافق مقترحاتهم .ومن } الداخلة على اسم الجلالة تتعلق ب { ولي } و { واق }. و { من } الداخلة على { ولي } لتأكيد النفي تنصيصاً على العموم . وتقدم الخلاف بين الجمهور وابن كثير في حذفهم ياء { واق } في حالتي الوصل والوقف وإثبات ابن كثير الياء في حالة الوقف دون الوصل عند قوله تعالى : { ولكل قوم هاد } في هذه السورة \\[ الرعد : 7 \\].\n\n",
      "translations": [
        {
          "translation": "(Thus have We revealed it) thus have We sent Gabriel with the Qur'an, (a decisive utterance) the whole Qur'an is Allah's judgement (in Arabic) in the Arabic usage (and if thou shouldst follow their desires) their religion and Qiblah (after that which hath come unto thee of knowledge) after Abraham's Religion and Qiblah were made clear to you, (then truly wouldst thou have from Allah) from Allah's torment (no protecting friend) nearby to benefit you (nor defender) to save you from the torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ } أي: مثل إنزالنا للأمم الماضية كتاباً بعد كتاب ناسخاً لبعض ما فيها على مقتضى الأزمان والأقوام كذلك { أَنزَلْنَاهُ } أي: القرآن\n إليك يا أكمل الرسل { حُكْماً } مبيناً للقضايا على مقتضى الحكمة المتقنة { عَرَبِيّاً } مناسباً بلسانك ولسان قومك يسهل لهم الاسترشاد والاستهداء به\n ناسخاً لبعض ما في الكتب السالفة { وَ } الله { لَئِنِ ٱتَّبَعْتَ } انت بنفسك { أَهْوَاءَهُم } أي: أهواء أهل الكتاب وإن كانت قبيل النسخ هدى سيما { بَعْدَ مَا جَآءَكَ } في كتابك { مِنَ ٱلْعِلْمِ } بنسخها وبصيرورتها هوى { مَا لَكَ مِنَ ٱللَّهِ } من غضبه وانتقامه { مِن وَلِيٍّ } يولي أمرك بالاستخلاص والاستشفاع { وَلاَ وَاقٍ } [الرعد: 37] يحفظك ويمنعك من مقته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكذلك أنزلناه } أي: ومثل هذا الإنزال المشتمل على أصول الدين المجمع عليها\n { أنزلناه حُكْماً عربياً } أي: يحكم في القضايا والوقائع\n بما تقتضيه الحكمة\n مترجماً بلسان العرب ليسهل عليهم فهمه وحفظه\n { ولئن اتبعتَ أهواءَهُم } التي يدعونك إليها كتقرير دينهم\n والصلاة إلى قبلتهم بعدما حُوِّلْتَ عنها\n { بعد ما جاءَك من العِلم } بنسخ ذلك\n { ما لك من اللهِ من ولِيٍّ } ينصرك\n { ولا واقٍ } يقيك عتابه\n وهو حسم لأطماعهم\n وتهييج للمؤمنين على الثبات في دينهم\n وبالله التوفيق\n الإشارة: الفرح بما أُنزل من عند الله هو مقدمات الفرح بالله\n فإذا رفعت أكنة الغفلة عن القلب تلذذ بسماع الخطاب من وراء الباب\n وذلك أمارة القرب\n وهذا مقام أهل المراقبة من المحبين\n فإذا جدَّ في السير رُفعت عنه الحجب والأستار\n وواجهته الأنوار والأسرار\n فيكاشف بأسرار الذات وأنوار الصفات\n فيتلذذ بشهود المتكلم\n فيسمع حينئذٍ الكلام من المتكلّم به بلا واسطة\n وهذا مقام أهل الشهود من المحبين المقربين\n ومن الأحزاب\n وهم أهل الرئاسة والجاه\n من ينكر وجود بعض هذه المقامات تعصباً وحمية\n أو ينسبها لنفسه غلطاً وجهلاً\n فيقول له من تحقق بهذا المقام: إنما أمرتُ أن أعبد الله ولا أشرك به\n إليه أدعو وإليه مآب\n ويغيب عنه بالاشتغال بالله\n وبالدعاء إليه\n فإن غفل واشتغل به\n أو ركن إلى قوله\n قيل له: ولئن اتبعت أهواءهم بعد ما جاءك من العلم ما لك من الله من وليِّ ولا واق\n ولما قالت اليهود لعنهم الله لو كان محمداً رسولاً لما أولع بالنساء فرد الله عليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:2",
      "similarity": 0.48412803401541404
    },
    {
      "verse": "2:145",
      "similarity": 0.4696852483838617
    },
    {
      "verse": "41:3",
      "similarity": 0.4585170619593759
    },
    {
      "verse": "43:3",
      "similarity": 0.44781692710421306
    },
    {
      "verse": "26:195",
      "similarity": 0.4435208980966462
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013037.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013037.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}