{
  "chapter": "الرعد",
  "text": "ولقد استهزئ برسل من قبلك فامليت للذين كفروا۟ ثم اخذتهم فكيف كان عقاب",
  "translations": [
    {
      "translation": "Messengers before you were mocked. I gave those who were kafir a little more time and then I seized them. How terrible was My retribution!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many an apostle have they mocked before you; but I allowed the unbelievers respite, then I seized them. How severe was My punishment then!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the Messengers before you were ridiculed, but I always initially granted respite to those who disbelieved, and then I seized them (with chastisement). Then, how awesome was My chastisement!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), people have mocked the Messengers who lived before you. I gave a respite to the unbelievers (so that they would repent, but they did not). Then I struck them with a terrible retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed the Noble Messengers before you were also mocked – I therefore gave the mockers respite for some days and then seized them; so how (dreadful) was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed (many) Messengers were mocked at before you but I granted respite to those who disbelieved, and finally I punished them. Then how (terrible) was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And apostles before you were certainly mocked at, but I gave respite to those who disbelieved, then I destroyed them; how then was My requital (of evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers indeed were scoffed at before thee, and I respited the unbelievers; then I seized them -- and how was my retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily messengers (of Allah) were mocked before thee, but long I bore with those who disbelieved. At length I seized them, and how (awful) was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other messengers were also mocked before you; but though I granted respite to those who denied the truth, at last I seized them, and how awful was My punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly mocked were apostles before thee; then I respited those who disbelieved; thereafter took hold of them; so of what wise hath been My requital.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Apostles were certainly derided before you. But then I gave respite to those who were faithless, then I seized them; so how was My retribution?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mocked were (many) messengers before thee: but I granted respite to the unbelievers, and finally I punished them: Then how (terrible) was my requital!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed (many) Messengers were mocked at before you (O Muhammad SAW), but I granted respite to those who disbelieved, and finally I punished them. Then how (terrible) was My Punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other Messengers were mocked before you but I respited the unbelievers, then I seized them. And how was My retribution!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers before you were ridiculed, but I granted the disbelievers respite, and then I seized them. What a punishment it was!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And already were [other] messengers ridiculed before you, and I extended the time of those who disbelieved; then I seized them, and how [terrible] was My penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:32] messengers were certainly mocked before you, in the same way that you have been mocked — this is meant as solace for the Prophet (s) — but I gave respite to those who disbelieved; then I seized them, with retribution, and how was My retribution?, that is to say, it [My retribution] will come to pass; and I shall deal with those who have mocked you in the same way.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جملة { ولو أن قرآناً سيرت به الجبال } \\[ سورة الرعد : 31 \\] الخ ، لأن تلك المُثُل الثلاثة التي فرضت أريد بها أمور سألها المشركون النبي استهزاءً وتعجيزاً لا لترقب حصولها .وجاءت عقب الجملتين لما فيها من المناسبة لهما من جهة المُثل التي في الأولى ومن جهة الغاية التي في الثانية .وقد استهزأ قوم نوح به عليه السلام { وكُلّما مَرّ عليه ملأ من قومه سخروا منه } \\[ سورة هود : 38 \\] ، واستهزأت عاد بهود عليه السلام { فأسقِط علينا كِسْفاً من السماء إن كنتَ من الصادقِين } \\[ سورة الشعراء : 187 \\] ، واستهزأت ثمود بصالح عليه السلام { قال الملأ الّذين كفروا من قومه إنا لنراك في سفاهة } \\[ سورة الأعراف : 66 \\] ، واستهزأوا بِشُعيْب عليه السلام { قالوا يا شُعيب أصلواتك تأمُرك أن نتْرك ما يَعبد آبَاؤنَا أو أن نفعل في أموالنا ما نشاء إنّك لأنت الحليم الرشيد } \\[ سورة هود : 87 \\] ، واستهزأ فرعون بموسى عليه السلام { أم أنا خير من هذا الّذي هو مَهين ولا يكاد يبين } \\[ سورة الزخرف : 43 \\].والاستهزاء : مبالغة في الهَزْء مثل الاسْتسْخار في السخرية .والإملاء : الإمهال والتركُ مدة . ومنه واهجرني ملياً . وتقدم في قوله تعالى : { والذين كذبوا بآياتنا سنستدرجهم من حيث لا يعلمون وأملي لهم } في \\[ سورة الأعراف : 182 \\].والاستفهام في فكيف كان عقاب للتعجيب .و عقاب أصله عقابي مثل ما تقدم آنفاً في قوله : وإليه متاب }.والكلام تسلية للنبيء صلى الله عليه وسلم والمؤمنين ، ووعيد للمشركين .\n\n",
      "translations": [
        {
          "translation": "(And verily messengers (of Allah) were mocked before thee) their people mocked them just as your people are mocking you, (but long I bore with those who disbelieved) but I gave respite to those who disbelieved. (At length I seized them) with chastisement, (and how (awful) was My punishment!) see how I upbraid them with chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لا تحزن يا أكمل الرسل من استهزائهم وسخريتهم معك\n ولا تبال بعمههم وسكرتهم وبطرهم واستهتارهم بمالهم وجاههم { وَ } الله { لَقَدِ ٱسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ } أشد من اسهتزاء هؤلاء معك { فَأَمْلَيْتُ } وأملهت { لِلَّذِينَ كَفَرُواْ } أي: المستهزئين الذين كفروا حتى انهمكوا في الغفلة وتوغلوا فيها بطرين فرحين { ثُمَّ أَخَذْتُهُمْ } فجأة واستأصلتهم بغتة { فَكَيْفَ كَانَ عِقَابِ } [الرعد: 32] مع أولئك؟ ومع هؤلاء أشد من ذلك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: في تسلية رسوله صلى الله عليه وسلم: { لقد استُهزئ برسلٍ من قبلك } فأوذوا وأهِينُوا، { فأمْلَيتُ للذين كفروا }: أمهلتهم في دعة ورغد عيش، مدة من الزمان، { ثم أخذتهم } بالهلاك والاستئصال، { فكيف كان عقاب }؟ أي: عقابي إياهم، وهو تهويل لما نزل بهم، وتخويف لغيرهم من المستهزئين بالرسول صلى الله عليه وسلم والمقترحين عليه الآيات. الإشارة: الاستهزاء بأهل الخصوصية في بدايتهم سنة ماضية، ويتسلون بمن سلف من خصوص الأنبياء والأولياء. وما هدد به الكفار يهدد به أهل الإنكار. بالله التوفيق. ثم وينجهم على الشرك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:44",
      "similarity": 0.6546738362137906
    },
    {
      "verse": "3:178",
      "similarity": 0.554121749971513
    },
    {
      "verse": "22:48",
      "similarity": 0.46847296785470066
    },
    {
      "verse": "25:5",
      "similarity": 0.39857154275219675
    },
    {
      "verse": "30:10",
      "similarity": 0.39695953702088965
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}