{
  "chapter": "الرعد",
  "text": "يمحوا۟ الله ما يشاء ويثبت وعنده ام الكتب",
  "translations": [
    {
      "translation": "Allah erases whatever He wills or endorses it. The Master Copy of the Book is in His Hands.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God abrogates or confirms whatsoever He will, for He has with Him the Book of Books.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah effaces whatever He wills and retains whatever He wills. With Him is the Mother of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every event God has ordained His decree. God establishes or effaces whatever He wants and with Him is the original of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah erases and confirms whatever He wills; and only with Him is the real script.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah blots out what He wills and confirms (what He wills). And with Him is the Mother of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah makes to pass away and establishes what He pleases, and with Him is the basis of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God blots out, and He establishes whatsoever He will; and with Him is the Essence of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah effaceth what He will, and establisheth (what He will), and with Him is the source of ordinance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God abrogates or confirms what He pleases; with Him is the source of all commandments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah abolisheth whatsoever He Will and keepeth; and with Him is the mother of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah effaces and confirms whatever He wishes and with Him is the Mother Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah doth blot out or confirm what He pleaseth: with Him is the Mother of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah blots out what He wills and confirms (what He wills). And with Him is the Mother of the Book (Al-Lauh Al-Mahfuz)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah blots out, and He establishes what He will. With Him is the Essence of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God abolishes whatever He wills, and He affirms. With Him is the source of the Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah eliminates what He wills or confirms, and with Him is the Mother of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:39] God effaces, of it [the Book], whatever He will and He fixes (read yuthbit or yuthabbit), therein whatever He will of rulings or other matters, and with Him is the Mother of the Book, its [source of] origin, of which nothing is ever changed, and which consists of what He inscribed in pre-eternity (azal).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah effaceth what He will) from the scroll of the guardian angels which does not entail a reward or punishment, (and establisheth (what He will)) and leaves that which entails a reward or punishment, (and with Him is the source of ordinance) the source of the Book, i.e. the Preserved or Guarded Tablet, in which 263 nothing is added or taken away.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَمْحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثْبِتُ } فيقالُ: إِنْ أَعمالُ العِبادِ تُرفَعُ إِلى الله صَغِيرُها وكَبِيرُها فَيُثْبِتُ مَا كَانَ مِنهَا ثَوابٌ وعِقَابٌ، ويَمْحُو مَا سِوى ذَلِكَ\n ويقالُ يَمحُو مَا يَشاءُ مِن المَنْسوخِ ويُثْبِتُ النَاسِخَ { وَعِندَهُ أُمُّ ٱلْكِتَابِ } [أي] كِتابه الذِي لا يُتَبدَّلُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - Exalted be He - {And Allah wipes out what He wills and establishes [what He wills]} So it is said: Indeed, the deeds of the servants are raised to Allah, small and great, so He establishes the reward and punishment for what is of them, and wipes out what is other than that.\n\nHe is said to erase whatever he wills of the abrogated and to establish the abrogating { and with him is the Mother of the Book } [i.e.] his book which does not change.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَمْحُواْ ٱللَّهُ مَا يَشَآءُ } وبنسخه على مقتضى حكمته وإرادته { وَيُثْبِتُ } ما أراد إثباته { وَعِندَهُ أُمُّ ٱلْكِتَابِ } [الرعد: 39] أي: لوح القضاء والقدر المتوالية\n المتتالية على مقتضى الأوصاف الذاتية الإلهية والتجليات اللطيفة والقهرية والجلالية والجمالية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يمحو الله ما يشاء } من ديوان الأحياء\n فيكتب في الأموات\n { ويُثبتُ } من لا يموت\n قيل: إن هذا الكتاب يُكتب ليلة القدر\n أو ليلة النصف من شعبان\n ويجمع بينهما بأن الكتابة تقع ليلة النصف\n وإبرازه للملائكة ليلة القدر\n { وعنده أُمُّ الكتاب } أي: الأصل المنسوخ منه كتب الآجال\n وهو اللوح المحفوظ\n أو العلم القديم\n وهذا التفسير يناسب اقتراح الآيات لأنهم إذا أجيبوا بظهور الآية ولم يؤمنوا\n عوجلوا بالهلاك\n وذلك له كتاب محدود\n قال الورتجبي: بيَّن الحق ـ سبحانه ـ أن أوان إتيان الآية بأجل معلوم في وقت معروف\n بقوله: { لكل أجل كتاب } أي: لكل مقدور في الأزل في قضية مرادة وقت معلوم في علم الله\n لا يأتي إلا في وقته\n هـ\n  أو: { لكل أجل } أي: عصر وزمان\n { كتاب } فيه شريعة مخصوصة على ما يقتضيه استصلاحهم\n { يمحو الله ما يشاء }: ينسخ ما يستصوب نسخه من الشرائع\n { ويُثبتُ } ما تقتضي الحكمة عدم نسخه\n { وعنده أم الكتاب } وهو: اللوح المحفوظ فإنه جامع للكائنات\n وهذا يترتب على قوله: { ومن الأحزاب من ينكر بعضه } \n وهو ما لا يوافق شريعتهم\n قال سيدي عبد الرحمن الفاسي: { يمحو الله ما يشاء } ما يستصوب نسخه\n { ويُثبت } ما تقتضيه حكمته\n فلا ينكر مخالفته للشرائع في بعض الأحكام مع موافقته للحكم\n وهو الأصول الثابتة في أصول الشرائع\n ولذا قال: { وعنده أمُّ الكتاب } أي: لا يبدل\n هـ\n وقريب منه للبيضاوي\n وقيل: إن المحو والإثبات عام في جميع الأشياء\n قال ابن جزي: وهذا ترده القاعدة المتقررة بأن القضاء والقدرلا يتبدل\n وعلم الله لا يتغير\n هـ\n قلت: أما القضاء المبرم\n وهو: علم الله القديم الذي استأثر الله به\n فلا شك أنه لا يتبدل ولا يغير\n وأما القضاء الذي يبرز إلى علم الخلائق من الملائكة وغيرهم\n فيقع فيه المحو والإثبات\n وذلك أن الحق تعالى قد يُطلعهم على بعض الأقضية\n وهي عنده متوقفة على أسباب وشروط يخفيها عنهم بقهريته\n ليظهر اختصاصه بالعلم الحقيقي\n فإذا أراد الملائكة أن ينفذوا ذلك الأمر محاه الله تعالى\n وأثبت ما عنده في علم غيبه\n وهو أُمُّ الكتاب\n حتى قال بعضهم: إن اللوح الحفوظ له جهتان: جهة تلي عالَم الغيب\n وفيه القضاء المبرم\n وجهة تلي عالَم الشهادة\n وفيه القضاء الذي يُرد ويُمْحى لأنه قد تكتب فيه أمور\n وهي متوقفة على شروط وأسباب في علم الغيب\n لم تظهر في هذه الجهة التي تلي عَالَم الشهادة\n فيقع فيها المحو والإثبات\n وبهذا يندفع إشكالات كقوله في الحديث:\n\n \" لا يَرُدُ القَضَاءَ إلا الدُّعَاءُ\n وصلة الرحم تزيد في العُمُر \"\n \nوقول ابن مسعود\n وعمر ـ رضي الله عنهما ـ: اللهم إن كنت كتبتنا في ديوان الشقاء فامحنا\n واكتبنا في ديوان السعادة\n فإنك تمحو ما تشاء وتثبت\n هـ\n أي: إن كنت أظهرت شقاوتنا فامحها\n وأظهر سعادتنا فإنك تمحو ما تشاء\n\n\nإلخ\n وفي ابن عطية ما يشير إلى هذا\n قال: وأصوب ما يفسر به أم الكتاب\n أنه كتاب الأمور المجزومة التي سبق القضاء فيها بما هو كائن\n وسبق ألا تبدل\n ويبقى المحو والتثبيت في الأمور التي سبق في القضاء أن تبدل وتُمحى وتثبت\n قال نحوه قتادة\n هـ\n  الإشارة: قوله تعالى: { ولقد أرسلنا رسلاً من قبلك\n\n\n } الآية\n قد أثبت تعالى لأهل خصوصية النبوة والرسالة الأزواج والذرية\n وكان ذلك كمالاً في حقهم\n وكذلك أهل خصوصية الولاية\n تكون لهم أزواج وذرية\n ولا يقدح في مرتبتهم\n بل يزيد فيها\n وذلك بشرط أن يقع ذلك بعد التمكين\n أو يكون في صحبة شيخ عارف كامل عند أمره ونهيه\n يكون فعل ذلك بإذنه\n فإذا كان هذا الشرط فإن التزوج يزيد صاحبه تمكيناً من اليقين\n  قال الورتجبي في هذه الآية: أعْلَمَ تَعالى\n بهذه الآية\n الجُهَّال أنه إذا شَرَّف وليّاً أو صدِّيقاً بولايته ومعرفته لم يَضُرّ بِه مباشرة أحكام البشرية من الأهل والولد\n ولم يكن بسْط الدنيا له قدحاً في ولايته\n هـ\n وقال الغزالي في الإحياء\n في الترغيب في النكاح: قال تعالى في وصف الرسل ومَدْحِهِم: { ولقد أرسلنا رسلاً من قبلك وجعلنا لهم أزواجاً وذُرية } \n فذكر ذلك في معرض الامتنان وإظهار الفضل\n ومَدَح أولياءه بسؤال ذلك في الدعاء\n فقال تعالى:\n[الفرقان: 74] الآية\n ويقال: إن الله تعالى لم يذكر في كتابه من الأنبياء إلا المتأهلين\n وقالوا: إن يحيىعليه السلام قد تزوج فلم يجامع\n قيل: إنما فعل ذلك لنيل الفضل وإقامة السُّنة\n وقيل: لغض البصر\n وأما عيسى عليه السلام فإنه سينكح إذا نزل الأرض\n ويولدُ له\n\nوأما الأخبار فقوله صلى الله عليه وسلم:\n \" النَّكَاحُ سُنَّتي\n فَمَنْ أَحَبَّ فِطْرَتي فَليسْتَنَّ بِسُنَّتِي \" \nوقال أيضاً صلى الله عليه وسلم:\n \" تَنَاكَحُوا تَكَاثَروا فإنِّي أُبَاهِي بِكُم الأُممَ يَوْمَ القِيَامة\n حَتَّى السَّقْط \" \nوقال أيضاً:\n \" مَنْ رَغِبَ عَن سُنَّتي فَلَيْسَ مِنِّي\n وإِنَّ مِنْ سُنَّتي النِّكاحَ\n فَمَنْ أحَبَّنِي فَليَسْتَنَّ بِسُنَّتِي \" \nوقال صلى الله عليه وسلم:\n \" مَنْ تَرَكَ التَّزَوُّج مَخَافَةَ العَيْلة فَلَيس مِنَّا \" \nوقال صلى الله عليه وسل:م\n \" مَنْ نَكَحَ لله وأَنكَحَ لله استَحَقَّ ولايَة الله \"\n \nثم قال: وقال ابن عباس لابنه: لا يتم نسك الناسك حتى يتزوج\n وكان ابن مسعود يقول: لو لم يبق من عمري إلا عشرة أيام لأحببت أن أتزوج\n لا ألقى الله عَزَبَاً\n وكان معاذ رضي الله عنه مطعوناً وهو يقول: زوجوني\n لا ألقي الله عزباً\n وكان ماتت له زوجتان بالطاعون\n وكان عُمَرُ يكثر النكاح\n ويقول: لا أتزوج إلا للولد\n وكان لعليّ رضي الله عنه أربع نسوة\n وسبع عشرة سرية\n وهو أزهد الصحابة\n فدل أن تزوج النساء لا يدل على الرغبة في الدنيا\n قال سفيان: كثرة النساء ليس من الدنيا\n واستدل بقضية عليّ رضي الله عنه قال: وكان أزهد الصحابة\n ورُوي أن بشر الحافي رُئيَ في المنام\n فقيل له: ما فعل الله بك؟ فقال: رفعت إلى منازلي في الجنة فأشرفت على مقامات الأنبياء\n ولم أبلغ منازل المتأهلين\n وفي رواية: قال لي: ما كنت أحب أن تَلقاني عَزَباً\n قال الرائي: فقلت له: ما فعل أبو نصر التمار؟ قال: رُفع فوقي بسبعين درجة بصبره على بُنياته وعياله\n وقد قيل: فضل المتأهل على العزب كفضل المجاهد على القاعد\n وركعةٌ مِنْ متأهل أفضل من سبعين ركعة من عزب\n هـ\n كلام الغزالي باختصار\n وقوله تعالى: { يمحو الله ما يشاء ويُثبت } \n من جملة ما يقع فيه المحو والإثبات الواردات الإلهية التي ترد على القلوب من تجليات الغيوب فإن القلب إذا تطهر من الأكدار\n وصفا من الأغيار\n كان كل ما يتجلى فيه من الغيوب فهو حق\n إلا أنه ينسخ بعضها بعضاً فقد يخبر الولي بأمر\n يكون أوْ لا يكون على حساب ما تجلى في قلبه\n ثم يمحو الله ذلك\n ويثبت في قلبه خلافه\n أو يظهر في الوجود خلاف ما أخبر\n وليس بكذب في حقه\n ولكن الحق تعالى يُظهر لخلقه أموراً من مقدوراته\n متوقفاً وجودُها على أسبابٍ وشروطٍ أخفاها الحق تعالى عن خلقه\n ليظهر عجزهم عن إحاطة علمه\n فالنسخ إنما يقع في فعله لا في أصل علمه\n قال الأستاذ القشيري: المشيئة لا تتعلق إلا بالحدوث\n والمحو والإثبات لا يكون إلا من أوصاف الحدوث\n فصفات ذات الحق ـ سبحانه ـ من كلامه وعلمه\n لا يدخل تحت المحو والإثبات\n إنما يكون المحو والإثبات من صفات فعله\n\nهـ\n وقال سهل رضي الله عنه: { يمحو الله ما يشاء ويثبت } الأسباب\n { وعنده أمُّ الكتاب } القضاء المبرم\n هـ\n  وقال شيخ شيوخنا\n سيدي عبد الرحمن الفاسي: { وعنده أم الكتاب }: العلم الأول الثابت الذي لا يطرأ عليه تغيير ولا تبديل\n ولا يقبل النسخ والتحريف\n ومطالعته: بالفناء عن الحقيقة الخَلْقِية\n والبقاء بالأنوار الصمدانية\n والأنفاس الرحمانية\n قال في القوت: والمحبة من أشرف المقامات\n ليس فوقها إلا مقام الخُلَّة\n وهو مقام في المعرفة الخاصة\n وهي: تخلّل أسرار الغيب\n فيطلع على مشاهدة المحبوب\n بان يعطى إحاطة بشيء من علمه بمشيئته\n على مشيئته التي لا تتقلب\n وعلمه القديم الذي لا يتغير\n وفي هذا المقام: الإشراف على بحار الغيوب\n وسرائر ما كان في القديم وعواقب ما يدب\n ومنه: مكاشفة العبد بحاله\n وإشهاده من المحبة مقامه\n والإشراف على مقامات العباد في المآل\n والاطلاع عليهم في تقلبهم في الأبد حالاً ومآلاً\n هـ\n  قلت: هذا الاطلاع إنما هو إجمالي لا تفصيلي\n وقد يقع فيه المحو والإثبات لأنه من جملة المعلومات التي دخلت عالم التكوين\n التي يقع فيها التبديل والتغيير\n ثم قال صاحب القوت: وقد قال أحسن القائلين:\n[البقرة: 255]\n والاستثناء واقع على إعطاء الإحاطة بشيء من شهادة علمه\n بنورٍ ثاقبٍ من وصفه\n وشعاع لائحٍ من سبحاته\n إذا شاء\n وذلك إذا أخرجت النفس من الروح\n فكان روحانياً\n خُروجَ الليلِ من النهار\n هـ\n ثمَّ تمَّم الجواب عن اقتراحهم الآيات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:12",
      "similarity": 0.7332278760020748
    },
    {
      "verse": "42:24",
      "similarity": 0.6768949259012376
    },
    {
      "verse": "14:27",
      "similarity": 0.2417039544609856
    },
    {
      "verse": "47:7",
      "similarity": 0.23307074219865628
    },
    {
      "verse": "8:30",
      "similarity": 0.21771802395563097
    }
  ]
}