{
  "chapter": "الرعد",
  "text": "ولو ان قرءانا سيرت به الجبال او قطعت به الارض او كلم به الموتى بل لله الامر جميعا افلم يا۟يـس الذين ءامنوا۟ ان لو يشاء الله لهدى الناس جميعا ولا يزال الذين كفروا۟ تصيبهم بما صنعوا۟ قارعة او تحل قريبا من دارهم حتى ياتى وعد الله ان الله لا يخلف الميعاد",
  "translations": [
    {
      "translation": "Even if there was a Qur'an which moved mountains, or split the earth open or spoke to the dead . . .! On the contrary! The affair is Allah's altogether. Do those who have iman not know that if Allah had wanted to He could have guided all mankind? Those who are kafir will not cease to be struck by disaster for what they have done - or a disaster will happen close to their homes - until Allah's promise is fulfilled. Allah will not fail to keep His promise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been a Qur'an which could have made the mountains move, or the earth to cleave asunder, or the dead to speak, yet all authority belongs to God. Have the believers not learnt that if God had so willed He could have guided all mankind? As for unbelievers, they will be visited by misfortune endlessly for what they have done; or it would sit in their homes till the promised threat of God comes to pass. Surely God does not go back on His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what would have happened were a Qur'an to be revealed wherewith mountains could be set in motion, or the earth cleft, or the dead made to speak? (To show such signs is not at all difficult for) everything rests entirely with Allah. So, do not the people of faith (still look forward to such a sign in response to the demand of the unbelievers and) despair as a result of knowing that had Allah so willed, He could have guided all to the Truth. Misfortune continues to afflict the unbelievers on account of their misdeeds, or to befall on locations close to their habitation. This will continue until Allah's promise (of chastisement) is fulfilled. Indeed Allah does not go back upon His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if the Quran would make mountains move, cut the earth into pieces and make the dead able to speak, (the unbelievers still would not believe). All affairs are in the hands of God. Do the believers still hope that they will believe? Had God wanted he could have guided the whole of mankind to the right path. The unbelievers will always suffer afflictions that result from their deeds or the affliction which occur near their homes, until God's promise of punishing them will be fulfilled. God does not disregard His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were such a Qur’an to come that would cause the mountains to move, or the earth to split asunder, or the dead to speak, even then these disbelievers would not believe; in fact, all matters are only at Allah’s discretion; so have not the Muslims despaired in that, had Allah willed, He would have guided all mankind? Disasters shall continue to strike the disbelievers on account of their deeds, or descend near their homes until Allah’s promise comes; indeed Allah does not break the promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there had been a Qur'an with which mountains could be moved (from their places), or the earth could be cloven asunder, or the dead could be made to speak (it would not have been other than this Qur'an). But the decision of all things is certainly with Allah. Have not then those who believed yet known that had Allah willed, He could have guided all mankind And a disaster will not cease to strike those who disbelieved because of their (evil) deeds or it (i.e. the disaster) settles close to their homes, until the promise of Allah comes to pass. Certainly, Allah breaks not His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if there were a Quran with which the mountains were made to pass away, or the earth were travelled over with it, or the dead were made to speak thereby; nay! the commandment is wholly Allah's, Have not yet those who believe known that if Allah please He would certainly guide all the people? And (as for) those who disbelieve, there will not cease to afflict them because of what they do a repelling calamity, or it will alight close by their abodes, until the promise of Allah comes about; surely Allah will not fail in (His) promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only a Koran whereby the mountains were set in motion, or the earth were cleft, or the dead were spoken to -- nay, but God's is the affair altogether. Did not the believers know that, if God had willed, He would have guided men all together? And still the unbelievers are smitten by a shattering for what they wrought, or it alights nigh their habitation, until God's promise comes; and God will not fail the tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it been possible for a Lecture to cause the mountains to move, or the earth to be torn asunder, or the dead to speak, (this Qur'an would have done so). Nay, but Allah's is the whole command. Do not those who believe know that, had Allah willed, He could have guided all mankind? As for those who disbelieve, disaster ceaseth not to strike them because of what they do, or it dwelleth near their home until the threat of Allah come to pass. Lo! Allah faileth not to keep the tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if there were a Quran by which mountains could be set in motion, by which the earth could be rent asunder, or by which the dead could be made to speak [they would not believe in it]. Surely all things are subject to God's will. Are the faithful unaware that, had He pleased, God could have guided all mankind? Calamity shall not cease to strike those who deny the truth because of their misdeeds or to strike near their homes, until God's promise be fulfilled. God will not fail to keep His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there were a Qur'an whereby the mountains could be moved or Whereby the earth could be traversed or whereby the dead could be spoken to, it would be in vain. Aye! the affair belongeth to Allah entirely. Have not then those who believe yet known that had Allah willed, He would have guided all mankind! And a rattling adversity ceaseth not to befall those who disbelieve for that which they have wrought or to alight nigh unto their habitation. until Allah's promise cometh; verily Allah faileth not the tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only it were a Quran whereby the mountains could be moved, or the earth could be toured, or the dead could be spoken to.... Indeed, all dispensation belongs to Allah. Have not the faithful yet realised that had Allah wished He would have guided mankind all together? The faithless will continue to be visited by catastrophes because of their doings—or they will land near their habitations—until Allah’s promise comes to pass. Indeed Allah does not break His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there were a Qur'an with which mountains were moved, or the earth were cloven asunder, or the dead were made to speak, (this would be the one!) But, truly, the command is with Allah in all things! Do not the Believers know, that, had Allah (so) willed, He could have guided all mankind (to the right)? But the Unbelievers,- never will disaster cease to seize them for their (ill) deeds, or to settle close to their homes, until the promise of Allah come to pass, for, verily, Allah will not fail in His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there had been a Quran with which mountains could be moved (from their places), or the earth could be cloven asunder, or the dead could be made to speak (it would not have been other than this Quran). But the decision of all things is certainly with Allah. Have not then those who believe yet known that had Allah willed, He could have guided all mankind? And a disaster will not cease to strike those who disbelieve because of their (evil) deeds or it (i.e. the disaster) settle close to their homes, until the Promise of Allah comes to pass. Certainly, Allah does not fail in His Promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only a Koran whereby the mountains were set in motion, or the earth cleaved asunder, or the dead spoken to. No, but to Allah is the affair altogether. Do those who believe know that had Allah willed He could have guided all people? As for those who disbelieve, because of what they do, disaster will not cease to afflict them, or it alights near their home until the promise of Allah comes. Allah will not break His promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if there were a Quran, by which mountains could be set in motion, or by which the earth could be shattered, or by which the dead could be made to speak. In fact, every decision rests with God. Did the believers not give up and realize that had God willed, He would have guided all humanity? Disasters will continue to strike those who disbelieve, because of their deeds, or they fall near their homes, until God’s promise comes true. God never breaks a promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there was any qur'an by which the mountains would be removed or the earth would be broken apart or the dead would be made to speak, [it would be this Qur'an], but to Allah belongs the affair entirely. Then have those who believed not accepted that had Allah willed, He would have guided the people, all of them? And those who disbelieve do not cease to be struck, for what they have done, by calamity - or it will descend near their home - until there comes the promise of Allah. Indeed, Allah does not fail in [His] promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:31] The following was revealed when they said to him, ‘If you are [truly] a prophet, then make these mountains of Mecca drift away before us, and make for us rivers and springs in it, that we may plant and sow seeds, and resurrect for us our dead fathers to speak to us and tell us that you are a prophet’: Even if it were a   Qur’ān whereby the mountains were set in motion, moved from their places, or the earth were cleft, torn, or the dead were spoken to, such that they would respond, they still would not believe. Nay, but the affair belongs entirely to God, and none other, so that none believes except he whom He wills that he believes, and no other; even if they were given what they request [of signs]. The following was revealed when the Companions were keen that what was requested [of signs] should be manifested, hoping that they [the ones requesting them] might believe: Have they not realised, those who believe, that (an is softened, in other words [understand it as] annahu) had God willed, He could have guided all mankind?, to faith, without [the need for] any sign? And the disbelievers, from among the people of Mecca, continue to be struck by devastation, a catastrophe that devastates them through all manner of hardship, such as being killed, taken captive, and [suffering] war or drought, because of what they wrought, because of their actions, that is, their disbelief; or you alight, O Muhammad (s), together with your army, near their home — Mecca — until God’s promise, of victory against them, comes to pass; truly God does not break His promise: and indeed, he alighted at Hudaybiyya until the conquest of Mecca took place;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then the following was revealed about 'Abdullah Ibn Umayyah al-Makhzumi and his companions who said to the Prophet: make the mountains disappear by means of your Qur'an; or make springs gush out of them, just as David did with the fount of copper, as you claim; or bring for us a wind by means of which we travel to Historic Syria and return, just as it was done by Solomon, according to you; or bring our dead to life as did Jesus, as you claim. So Allah said: (Had it been possible for a Lecture) other than the Qur'an which has been revealed to Muhammad (pbuh) (to cause the mountains to move) by means of which mountains are made to disappear from the face of the earth, (or the earth to be torn asunder) by means of which to travel long distances, (or the dead to speak) or by means of which the dead are brought back to life, the Qur'an which was revealed to Muhammad (pbuh) would have done so. (Nay, but Allah's is the whole command) rather, Allah can do all these things, if He wills. (Do not those who believe) in Muhammad (pbuh) and in the Qur'an (know that had Allah willed, He could have guided all mankind)?) if he willed, He would have honoured all mankind with His religion (As for those who disbelieve) in the Scriptures and messengers, i.e. the disbelievers of Mecca, (disaster) a military detachment; and it is said this means: a thunderbolt (ceaseth not to strike them because of what they do) in their state of disbelief, (or it dwelleth near) or make camp with your Companions near (their home) near their city Mecca, in 'Usfan (until the threat of Allah) the Conquest of Mecca (come to pass. Lo! Allah faileth not to keep the tryst) i.e. the Conquest of Mecca; as it is said this means: resurrection after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَفَلَمْ يَيْأَسِ ٱلَّذِينَ آمَنُوۤاْ } أَفلَم يَعلمْ وَيَتبينْ\n وهي لغةُ النَخَعِ\n\n\n\n\nوقوله تعالى: { وَلاَ يَزَالُ ٱلَّذِينَ كَفَرُواْ تُصِيبُهُم بِمَا صَنَعُواْ قَارِعَةٌ } معناهُ دَاهِيةٌ مُهْلكةٌ\n ويقالُ سَرِيَّةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Will those who believe not despair?\" Does He not know and is it not clear to Him?\n\n\nThis is the language of the scorpion.\n\n\nAnd the verse: {And those who disbelieve will continue to be afflicted by what they have done, a rolling [disaster]} means that they are doomed to destruction.\n\n\nThis is called a \"secret.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { لَوْ أَنَّ قُرْآناً } بمثابة لو قرأت { سُيِّرَتْ } وتحركت { بِهِ ٱلْجِبَالُ } عن مكانها الأصلي وأندكت { أَوْ قُطِّعَتْ } أي: انصدعت وانشقت { بِهِ ٱلأَرْضُ أَوْ كُلِّمَ بِهِ ٱلْمَوْتَىٰ } عند قراءته عليهم واستماعهم له { بَل للَّهِ ٱلأَمْرُ } أي: القدرة الكاملة والحول التام والقوة الغالبة في الأمور المذكورة { جَمِيعاً } له سبحانه، إن تعلق إرادته ومشيئته لكان ألبتة مع ذكر ما ذكر من الأمور، لم يؤمنوا به ولم يقلبوه منك؛ لشدة شكيمتهم وكمال قسوتههم { أَفَلَمْ يَيْأَسِ } ولم يقنط { ٱلَّذِينَ آمَنُوۤاْ } عن إيمان أولئك المدبرين المعاندين، مع ظهور أمارات الكفر عليهم وعلامات الإكار عنهم، سيما بعدما سمعوا في حقهم من الله ما سمعوا، ولم يعلم هؤلاء المؤمنون { أَن لَّوْ يَشَآءُ ٱللَّهُ } وتعلق إرادته بهداية الكل { لَهَدَى ٱلنَّاسَ جَمِيعاً } فلم يهدهم لعدم تعلق إرادته بهدايته البعض { وَ } لا تقنطوا أيها المؤمنون عن نصر الله إياكم على أعدائكم ولا تيأسوا عن روحه؛ إذ { لاَ يَزَالُ ٱلَّذِينَ كَفَرُواْ } وأصروا على الكفر عناداً واستكباراً { تُصِيبُهُم } وتدور عليهم { بِمَا صَنَعُواْ } أي: بصنيهم هذا وإصرارهم عليه { قَارِعَةٌ } داهية هائلة تقرع أسماعهم، وتضطربهم اضطراباً شديداً { أَوْ تَحُلُّ } وتنزل الداهية العظيمة في أحوالهم { قَرِيباً مِّن دَارِهِمْ } ومساكنهم لتدور عليهم { حَتَّىٰ يَأْتِيَ وَعْدُ ٱللَّهِ } الذي وعده لنبيه بأن ينتقم عنهم ويعذبهم عذاباً شديداً في الدنيا والآخرة، في الدنيا بالفتح والظفر عليهم، وفي الآخرة بأنواع العقاب والنكال { إِنَّ ٱللَّهَ } المؤيد لأنبيائه، المنجز لما وعدهم من إهلاك أعدائهم { لاَ يُخْلِفُ ٱلْمِيعَادَ } [الرعد: 31]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nجواب لو: محذوف، أي: لم يؤمنوا لسابق الشقاء، أو: لكان هذا القرآن، وسيأتي بيانه\n يقول الحق جل جلاله: { ولو أن قرآناً } أنزل عليك، من صفته: { سُيِّرت به الجبالُ } أي: زعزعت عن مقارها، { أو قُطعَت به الأرضُ }: تصدعت وتشققت من خشية الله عند قراءته، أو: تشققت فجعلت أنهاراً وعيوناً، { أو كُلِّمَ به الموتى } فتجيب من قبورها جهراً، كما آمنوا لعنادهم وغلبة الحسد عليهم\n فهذا كقوله تعالى\n\n[الأنعام: 111]، أو: ولو أن قرآناً بهذه الصفة: من تسيير الجبال، وتقطيع الأرض، وتكليم الموتى، لكان هذا القرآن لأنه الغاية في الإعجاز، والنهاية في التذكير والإنذار، والأرل أرجح لمناسبة ما قبله وما بعده\n رُوي أن قريشاً قالوا: يا محمد، إنْ سَرَّك أن نتبعك فَسَيِّرْ بقرآنك الجبالَ عن مكة، حتى تتسع لنا فنتخذها بساتين وقطائع\n أو سخر لنا به الريح لنركبها، فَنَتَّجِرَ بها إلى الشام\n أو ابعث لنا قُصَيَّ بن كلاب فإنه شيخَ صِدْقٍ، أو غيره من آبائنا، فيكلمونا فيك، ويشهدوا لك بما تقول\n فنزلت الآية\n { بل لله الأمرُ جميعاً } ليس لي منه شيء، فهو القادر على الإتيان بما اقترحتموه من الآيات، إلا أن الإرادة لم تتعلق بذلك لأنه علم أنه لا ينجع فيكم شيء من ذلك لفرط عنادكم، فإذا رأيتموها قلتم:\n\n[الحجر: 15]، وبيَّن ذلك قوله: { أفلم ييأس الذين آمنوا } من إيمانهم مع رأوا من أحوالهم، وفرط عنادهم، علماً منهم { أن لو يشاء الله لهدى الناس جميعاً } ، أو: { أفلم ييأس } أي: يعلم { الذين آمنوا } أن الهداية بيد الله، ومشيئته، فلو شاء لهدى الناس جميعاً، وكون \" ييأس \" بمعنى \" علم \": لغة هوازن فقد علموا بما أعلمهم أن الله لا يهدي من يضل\n وقد قرأ علي وابن عباس وجماعة: \" أفلم يتبين الذين آمنوا \" ، وهو يقوي تفسير ييأس بيعلم\n قال البيضاوي: وإنما استعمل اليأس بمعنى العلم، لأنه مُسَبِّبٌ عن العلم، فإن الميئوس منه لا يكون إلا معلوماً\n ولذلك علّقه بقوله: { أن لو يشاء اللهُ لهدى الناس جميعاً } فإن معناه نفي هدى بعض الناس لعدم تعلق المشيئة باهتدائهم، وهو ـ على الأول ـ يتعلق بمحذوف تقديره: أفلم ييأس الذين آمنوا من إيمانهم علماً منهم أن لو يشاء الله لهدى الناس جميعاً\n أو: بآمنوا، على حذف الجار، أي: بأن الله\n\n\n الخ\n هـ\n  { ولا يزال الذين كفروا } من قريش والعرب، { تُصيبُهم بما صنعوا } من الكفر والمعاصي، { قارِعةٌ } داهية تقرعهم تقلقهم، وتصيبهم في أنفسهم وأولادهم وأموالهم\n أو غزوات المسلمين إليهم، إمَّا أن تنزل بهم { أو تَحُلُّ قريباً من دارهم } فيفزعون منها وتتطاير إليهم شررها\n\n\nوقيل: نزلت في كفار مكة، فإنهم لا يزالون مصابين بما صنعوا برسول الله صلى الله عليه وسلم، وكان لا يزال يبعث السرايا، فتُغير حواليهم وتختطف أموالهم\n وعلى هذا يجوز أن يكون ضمير { تَحُل } خطاباً للرسول صلى الله عليه وسلم أي: تحل بجيشك قريباً من دراهم، { حتى يأتي وعد الله } بالموت أو بالبعث أو فتح مكة\n { إنَّ الله لا يُخلف الميعاد } لامتناع الخلف في وعده تعالى\n الإشارة: لو أن عارفاً بالله سيَّر الجبال عن أماكنها وفجر الأرض عيوناً، وكلمه الموتى لما آمن بخصوصيته إلا من سبقت له عناية الخصوصية\n فلو شاء الله لهدى الناس إلى معرفته جميعاً\n لكن الحكمة اقتضت وجود الخلاف، قال تعالى:\n\n[هود: 118]، فمن لم يهتد إلى معرفتهم لا يزال تطرقه قوارع الشكوك والأوهام، وخواطر السوء، أو تحل قريباً من قلبه، إن لم تتمكن فيه، حتى يأتي وعد الله بحضور موته، فقد يتداركه اللطف والرعاية، وقد يتسع الخرق عليه فيموت على الشك، والعياذ بالله\n بخلاف من صَحِبَ أهل الطمأنينة واليقين، ولا يموت إلا على اليقين لأن همة الشيوخ قد حَلَّقَتْ عليه، والعناية قد حفت به\n والله ولي المتقين\n قال الشيخ أبو الحسن رضي الله عنه: والله لا يكون الشيخ شيخاً حتى تكون يده مع الفقير أينما ذهب، والمراد باليد: الهمة والحفظ\n ووقت الموت أولى بالحضور، وقد شاهدنا ذلك من إخواننا ممن حضره الموت منهم، أخبر أنه يرى شيخه حاضراً معه\n فللَّهِ الحمد والمنة\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "101:2",
      "similarity": 0.4339123563656628
    },
    {
      "verse": "101:1",
      "similarity": 0.43299264417268357
    },
    {
      "verse": "101:3",
      "similarity": 0.4181544396620417
    },
    {
      "verse": "69:4",
      "similarity": 0.4073575580437736
    },
    {
      "verse": "9:110",
      "similarity": 0.2896719265270984
    }
  ]
}