{
  "chapter": "الرعد",
  "text": "وقد مكر الذين من قبلهم فلله المكر جميعا يعلم ما تكسب كل نفس وسيعلم الكفر لمن عقبى الدار",
  "translations": [
    {
      "translation": "Those before them plotted but all plotting belongs to Allah. He knows what each self earns, and the kafir will soon know who has the Ultimate Abode.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who had gone before them had also plotted; but God's is all the planning, for He has knowledge of what each does. The unbelievers will soon learn for whom is the guerdon of Paradise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lived before them also devised many a plot, but the master plot rests with Allah. He knows what everyone does. The deniers of the truth will soon come to know whose end is good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certain people who lived before plotted evil plans but God is the Master of all plans. He knows what every soul does. The unbelievers will soon learn who will achieve the blissful end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed those before them had plotted; therefore Allah Himself is the Master of all strategies; He knows all what every soul earns; and soon will the disbelievers realise for whom is the final abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, those before them did devise plots, but all planning is Allah's. He knows what every person earns, and the disbelievers will know who gets the good end (final destination).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those before them did indeed make plans, but all planning is Allah's; He knows what every soul earns, and the unbelievers shall come to know for whom is the (better) issue of the abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that were before them devised; but God's is the devising altogether. He knows what every soul earns. The unbelievers shall assuredly know whose will be the Ultimate Abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were before them plotted; but all plotting is Allah's. He knoweth that which each soul earneth. The disbelievers will come to know for whom will be the sequel of the (heavenly) Home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them did also devise plots; but in all things the master planning is God's. He knows what each soul does. Those who deny the truth shall soon know for whom is the final abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of a surety there plotted those before them; but unto Allah belongeth the plotting entirely. He knoweth that which each soul earneth. And anon will the infidels know for whom is the happy ending of the Abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were before them [also] schemed; yet all devising belongs to Allah. He knows what every soul earns. Soon the faithless will know in whose favour the outcome of that abode will be.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them did (also) devise plots; but in all things the master-planning is Allah's He knoweth the doings of every soul: and soon will the Unbelievers know who gets home in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, those before them did devise plots, but all planning is Allah's. He knows what every person earns, and the disbelievers will know who gets the good end (final destination).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have gone before them devised, but to Allah is the devising altogether. He knows what every soul earns. The unbelievers shall know without doubt for whom is the Ultimate Abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them planned, but the entire plan is up to God. He knows what every soul earns. Those who disbelieve will know to whom the Ultimate Home is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those before them had plotted, but to Allah belongs the plan entirely. He knows what every soul earns, and the disbelievers will know for whom is the final home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:42] And indeed those that were before them, of communities, plotted, against their prophets just as they plot against you; but to God belongs all plotting. And nor is their plotting like the plotting of God, for, exalted be He, He knows what every soul earns, and so its requital is prepared for it, and this is the ultimate plotting, since He brings it to them whence they are not aware. The disbeliever (the genus is meant here; a variant reading has kuffār [‘the disbelievers’]) shall assuredly know for whom shall be the sequel of the [heavenly] Abode, that is, the praiseworthy sequel in the abode of the Hereafter: will it be theirs or that of the Prophet (s) and his Companions?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who were before them) before the people of Mecca, such as Nimrod the son of Canaan the son of Sanjarib the son of Cush and his host (plotted) devised; (but all plotting is Allah's) the punishment for their plotting is with Allah. (He) Allah (knows that which each soul) whether believing or unbelieving (earneth) of good or evil. (The disbelievers) the Jews and all the disbelievers (will come to know for whom will be the sequel of the (heavenly) Home) i.e. Paradise; it is also said that this means: the disbelievers will come to know for whom is the upper hand on the Day of Badr and to whom Mecca will belong.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَدْ مَكَرَ ٱلَّذِينَ مِن قَبْلِهِمْ } مع أنبيائهم المبعوثين إليهم مثل مكر هؤلاء المكارين معك يا أكمل الرسل\n فلحقهم ما لحقهم وهم غافلون عن مكر الله { فَلِلَّهِ } المطلع لعواقب الأمور { ٱلْمَكْرُ } المعتد به { جَمِيعاً } إذ { يَعْلَمُ } بعلمه الحضوري { مَا تَكْسِبُ كُلُّ نَفْسٍ } من خير وشر ونفع وضر\n فينتقم هو عنها على مقتضى علمه { وَ } هم وإن غفلوا من مكر الله وما يترتب عليه من الوبال { سَيَعْلَمُ ٱلْكُفَّارُ } المصرون على الكفر والضلال { لِمَنْ } من الفريقين { عُقْبَى ٱلدَّارِ } [الرعد: 42] أي: العاقبة الحميدة في النشأة الأخرى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقد مَكَرَ الذين من قَبلهم } بأنبيائهم\n وبمن تبعهم\n { فللَّهِ المكر جميعاً } \n إذ لا يُؤبه بمكرٍ دون مكره\n فإنه القادر على ما هو المقصود منه ودون غيره\n سَمَّى العقوبة باسم الذنب للمشاكلة\n { يعلم ما تكسب كل نفس } فينفذ جزاؤها\n { وسيعلم الكافر } أي: جنس الكافر\n بدليل قراءة: \" الكفار \" \n { لِمَنْ } هي { عُقْبَى الدار } أي: لمن تكون العاقبة في الدارين\n دار الفناء\n ودار البقاء\n هل لأهل الإسلام المعد لهم دار السلام؟ أو للكفار المعد لهم دار البوار؟\n قال البيضاوي: وهذا كالتفسير لمكر الله بهم\n واللام تدل على أن المراد بالعُقبى العاقبة المحمودة\n مع ما في الإضافة إلى الدار كما عرفت\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:54",
      "similarity": 0.4966828015319979
    },
    {
      "verse": "71:22",
      "similarity": 0.48762356331033474
    },
    {
      "verse": "7:99",
      "similarity": 0.45175409729606425
    },
    {
      "verse": "13:33",
      "similarity": 0.44460307205269356
    },
    {
      "verse": "27:50",
      "similarity": 0.4403503000073466
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}