{
  "chapter": "الرعد",
  "text": "وان ما نرينك بعض الذى نعدهم او نتوفينك فانما عليك البلغ وعلينا الحساب",
  "translations": [
    {
      "translation": "Whether We show you something of what We have promised them or We take you back to Us, your responsibility is transmission and the Reckoning is Ours.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We allow you to see (the punishment) We have promised them, or end your life before (its execution), it is certainly for you to convey the message; the reckoning is for Us to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), whether We make you see a part of the punishment that We have threatened them with come to pass during your life-time, or We take you away before that happens, your duty is no more than to convey the Message, and it is for Us to make a reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show them (the unbelievers) to you facing the punishment with which We had threatened them, or make you die first (before its fulfillment), your duty is only to preach. It is up to Us to call them to account (for their deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whether We show you a promise that is given to them, or call you to Us before it – so in any case, upon you is just the conveyance*, and for Us is the taking of the account. (* Of the message.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you part of what We have promised them or cause you to die, your duty is only to convey (the Message) and on Us is the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will either let you see part of what We threaten them with or cause you to die, for only the delivery of the message is (incumbent) on you, while calling (them) to account is Our (business).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show thee a part of that We promise them, or We call thee to Us, it is thine only to deliver the Message, and Ours the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We let thee see something of that which We have promised them, or make thee die (before its happening), thine is but conveyance (of the message). Ours the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you part of what We have promised them or cause you to pass away [before that], your mission is only to give warning; it is for Us to do the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whether We shew thee part of that which We have promised them, or We take thee away, on thee is only the preaching, and on Us is the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you a part of what We promise them, or take you away [before that], your duty is only to communicate, and it is for Us to do the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We shall show thee (within thy life-time) part of what we promised them or take to ourselves thy soul (before it is all accomplished),- thy duty is to make (the Message) reach them: it is our part to call them to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you (O Muhammad SAW) part of what We have promised them or cause you to die, your duty is only to convey (the Message) and on Us is the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you part of that We promise them, or We call you to Us, it is only for you to deliver the Message, and Ours is the accounting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether We show you some of what We have promised them, or We cause you to die—your duty is to inform, and Ours is the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whether We show you part of what We promise them or take you in death, upon you is only the [duty of] notification, and upon Us is the account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:40] And whether ([read as] immā: the nūn of the conditional particle in, ‘whether’, has been assimiliated with the extra mā) We show you a part of that which We promise them, of chastisement, during your lifetime (the response of the conditional statement has been omitted, in other words [understand it as being], fadhāk [‘then so shall it be’]); or We take you [to Us], before chastising them; it is for you only to convey [the Message], your duty is only to deliver [the Message], and it is for Us to do the reckoning, when they finally come to Us, whereupon We shall requite them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whether We let thee see something of that which We have promised them) of torment during your lifetime, (or make thee die (before its happening), thine is but conveyance (of the message)) on behalf of Allah, (Ours the reckoning) reward and punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: لا تفرح يا أكمل الرسل { إِن مَّا نُرِيَنَّكَ } أي: إن تحقق إراءتنا لك { بَعْضَ ٱلَّذِي نَعِدُهُمْ } من الإهلاك والإجلاء والقهر والغلبة { أَوْ نَتَوَفَّيَنَّكَ } أي: لا تغتم أيضاً أن تحقق توفينا لك قبل رؤيتك بما نعدهم من العذاب والنكال بل { فَإِنَّمَا عَلَيْكَ } أي: ليس في وسعك وطاقتك { ٱلْبَلاَغُ } بما أُمرت بتبليغه { وَعَلَيْنَا ٱلْحِسَابُ } [الرعد: 40] والجزاء بمقتضاه عاجلاً وآجلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: إما: شرطية\n اتصلت ما الزائدة بأن الشرطية للتأكيد\n والجواب: فإنما\n\n\n إلخ\n أو: فلا تحتفل فإنما\n\n\n إلخ\n ولا معقب: في موضع الحال\n أي: يحكم نافذاً حكمه\n كقوله: جاء زيد لا سلاح معه\n أي: خاسراً\n ومن عنده: عطف على بالله\n يقول الحق جل جلاله: لنبيه صلى الله عليه وسلم تسكيناً له: { وإما نُرِيَنَّكَ بعضَ الذي نَعدهُم } من العذاب الذي استعجلوه\n { أو نَتوفَّينك } قبل أن ترى ذلك\n فلا تحتفل بشأنهم\n { فإنما عليك البلاغُ } للرسالة لا غير\n { وعلينا الحسابُ }: المجازاة\n والمعنى: كيفما دار الحال دُرْ معه\n أريناك بعض ما أوعدناهم في حياتك\n أو توفيناك قبله\n فلا تهتم بإعراضهم\n ولا تستعجل بعذابهم فإنا فاعلون ذلك لا محالة\n وهذا طلائعه\n فقد فتحنا عليك كثيراً من بلادهم ونقصناها عليهم\n { أوَ لَم يروا أنا نأتي الأرضَ } أي: أرض الكفرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:77",
      "similarity": 0.4662014955072093
    },
    {
      "verse": "10:46",
      "similarity": 0.45973203408956764
    },
    {
      "verse": "43:42",
      "similarity": 0.4406721377925613
    },
    {
      "verse": "38:53",
      "similarity": 0.36794199972028796
    },
    {
      "verse": "11:111",
      "similarity": 0.337235650220216
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/13:40.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/13:40.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/13:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}