{
  "chapter": "الرعد",
  "text": "ويقول الذين كفروا۟ لست مرسلا قل كفى بالله شهيدۢا بينى وبينكم ومن عنده علم الكتب",
  "translations": [
    {
      "translation": "Those who are kafir say, 'You are not a Messenger.' Say: 'Allah is a sufficient witness between you and",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet those who are disbelievers say: \"You are not the apostle sent (by God).\" Tell them: \"God is sufficient as witness between me and you, and he who has knowledge of the Book.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers claim that you have not been sent by Allah. Tell them: \"Allah is sufficient as a witness between me and you; and so also do those who know the Scriptures.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), the unbelievers say, \"You are not a Messenger.\" Say, \"God and those who have the knowledge of the Book are sufficient witness (to my prophethood).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers say, “You are not a (Noble) Messenger (of Allah)”; proclaim, “Allah is a Sufficient Witness between me and you, and (so is) he who has knowledge of the Book.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved, say: \"You are not a Messenger.\" Say: \"Sufficient as a witness between me and you is Allah and those too who have knowledge of the Scripture.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: You are not a messenger. Say: Allah is sufficient as a witness between me and you and whoever has knowledge of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, 'Thou art not an Envoy.' Say: 'God suffices as a witness between me and you, and whosoever possesses knowledge of the Book.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who disbelieve say: Thou art no messenger (of Allah). Say: Allah, and whosoever hath knowledge of the Scripture, is sufficient witness between me and you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth say, \"You are not God's messenger.\" Say, \"Sufficient is God as my witness between me and you, and those who have knowledge of the Book.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: thou art not a sent one. Say thou: Allah is a sufficient witness between me and you, and also he with whom is knowledge of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say, ‘You have not been sent [by Allah].’ Say, ‘Allah suffices as a witness between me and you, and he who possesses the knowledge of the Book.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Unbelievers say: \"No messenger art thou.\" Say: \"Enough for a witness between me and you is Allah, and such as have knowledge of the Book.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve, say: \"You (O Muhammad SAW) are not a Messenger.\" Say: \"Sufficient for a witness between me and you is Allah and those too who have knowledge of the Scripture (such as 'Abdullah bin Salam and other Jews and Christians who embraced Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: 'You are not a Messenger' Say: 'Allah is a Sufficient witness between me and you, and whosoever possess knowledge of the Book'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say, “You are not a messenger.” Say, “God is a sufficient witness between me and you, and whoever has knowledge of the Scripture.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have disbelieved say, \"You are not a messenger.\" Say, [O Muhammad], \"Sufficient is Allah as Witness between me and you, and [the witness of] whoever has knowledge of the Scripture.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:43] And those who disbelieve say, to you: ‘You have not been sent [by God]!’ Say, to them: ‘God suffices as a witness between me and you, to my truthfulness [as a messenger], and he who possesses knowledge of the Book’, from among the Christian and Jewish believers. Meccan, except for the two verses 28 and 29, which are Medinese; it consists of 52, 54 or 55 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على ما تضمنته جملة { وقد مكر الذين من قبلهم } \\[ الرعد : 42 \\] من التعريض بأن قولهم : لولا أنزل عليه آية من ربه \\[ سورة الأنعام : 37 \\] ضَرْب من المكر بإظهارهم أنهم يتطلبون الآيات الدالة على صدق الرسول ، مظهرين أنهم في شك من صدقه وهم يبطنون التصميم على التكذيب . فذكرت هذه الآيةُ أنهم قد أفصحوا تارات بما أبطنوه فنطقوا بصريح التكذيب وخرجوا من طور المكر إلى طور المجاهرة بالكفر فقالوا : لست مرسلاً }.وقد حكي قولهم بصيغة المضارع للدلالة على تكرر ذلك منهم ولاستحضار حالهم العجيبة من الاستمرار على التكذيب بعد أن رأوا دلائل الصدق ، كما عبر بالمضارع في قوله تعالى : { ويصنع الفلك } \\[ سورة هود : 38 \\] وقوله : { يجادلنا في قوم لوط } \\[ سورة هود : 11 \\].ولما كانت مقالتهم المحكية هنا صريحة لا مواربة فيها أمر الرسول بجواب لا جدال فيه وهو تحكيم الله بينه وبينهم .وقد أمر الرسول عليه الصلاة والسلام بأن يجيبهم جواب الواثق بصدقه المستشهد على ذلك بشهادة الصدق من إشهاد الله تعالى وإشهاد العالمين بالكتب والشرائع .ولما كانت الشهادة للرسول عليه الصلاة والسلام بالصدق شهادة على الذين كفروا بأنهم كاذبون جعلت الشهادة بينه وبينهم .وإشهاد الله في معنى الحلف على الصدق كقول هود عليه السلام { إنّي أشهد الله } \\[ هود : 54 \\].والباء الداخلة على اسم الجلالة الذي هو فاعل كفى } في المعنى للتأكيد وأصل التركيب : كفى اللّهُ . و { شهيداً } حال لازمة أو تمييز ، أي كفى الله من جهة الشاهد .{ ومن عنده علم الكتاب } معطوف على اسم الجلالة .والموصول في { ومن عنده علم الكتاب } يجوز أن يراد به جنس من يتصف بالصلة . والمعنى : وكل من عندهم علم الكتاب . وإفراد الضمير المضاف إليه { عِنْدَ } لمراعاة لفظ { من }. وتعريف { الكتاب } تعريف للعهد ، وهو التوراة ، أي وشهادة علماء الكتاب . وذلك أن اليهود كانوا قبل هجرة النبي صلى الله عليه وسلم إلى المدينة يستظهرون على المشركين بمجيء النبي المصدق للتوراة .ويحتمل أن يكون المراد بمن عنده علم الكتاب معيّناً ، فهو ورقة بن نوفل إذ علم أهل مكة أنه شهد بأن ما أوحي به إلى رسول الله صلى الله عليه وسلم هو الناموس الذي أنزل على موسى عليه السلام كما في حديث بدء الوحي في الصحيح . وكان ورقة منفرداً بمعرفة التوراة والإنجيل . وقد كان خبر قوله للنبيء صلى الله عليه وسلم ما قاله معروفاً عند قريش ..فالتعريف في { الكتاب } تعريف الجنس المنحصر في التوراة والإنجيل .وقيل : أريد به عبد الله بن سلام الذي آمن بالنبي صلى الله عليه وسلم في أول مقدمهِ المدينة . ويبعده أن السورة مكية كما تقدم .ووجه شهادة علماء الكتاب برسالة محمد صلى الله عليه وسلم وجدانهم البشارة بنبيء خاتم للرسل صلى الله عليه وسلم ووجدانهم ما جاء في القرآن موافقاً لسنن الشرائع الإلهية ومفسراً للرموز الواردة في التوراة والإنجيل في صفة النبي صلى الله عليه وسلم المصدق الموعود به . ولهذا المعنى كان التعبير في هذه الآية ب { من عنده علم الكتاب } دون أهل الكتاب لأن تطبيق ذلك لا يدركه إلا علماؤهم . قال تعالى : { أو لم يكن لهم آية أن يعلمه علماء بني إسرائيل } \\[ سورة الشعراء : 97 \\].\n\n",
      "translations": [
        {
          "translation": "(They who disbelieve) in Muhammad (pbuh) and in the Qur'an (say: Thou art no messenger (of Allah)) Muhammad, unless you bring us a witness who will testify that you are a messenger. Allah therefore said: (Say: Allah, and whosoever hath true knowledge of the Scripture) i.e. 'Abdullah Ibn Salam and his companions; it is also said that the reference here is to Asaf Ibn Barkhiyya, due to Allah's saying: (One with whom was knowledge of the Scripture) [27: 40]-and it is also said that this means: the one who has knowledge of the Scripture can explain the Qur'an-(is sufficient witness between me and you) that I am His Messenger and this Qur'an is His speech'. And of the surah in which Abraham is mentioned, which is all Meccan and consists of 50 verses, 831 words and 3,434 letters: Surah 14: Abraham [Ibrahim) And of the surah in which Abraham is mentioned, which is all Meccan and consists of 50 verses, 831 words and 3,434 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة شكيمتهم وغيظهم معك يا أكمل الرسل { يَقُولُ ٱلَّذِينَ كَفَرُواْ } بدينك وكتابك\n أي: رؤساؤهم وصناديدهم: { لَسْتَ مُرْسَلاً } من عند الله مثل سائر الرسل\n لذلك ما نتبعك ونؤمن بك وبكتابك { قُلْ كَفَىٰ بِٱللَّهِ شَهِيداً بَيْنِي وَبَيْنَكُمْ } أي: كفى الله بى شاهد لإثبات رسالتي وادعائي النبوة\n إذ أيدني بالمعجزات القاطعة والبراهين الساطعة { وَمَنْ عِندَهُ عِلْمُ ٱلْكِتَابِ } [الرعد: 43] من أصحاب اللسن والفصاحة وأرباب الفطنة والذكاء\n المتأملين في مرموزات الكتاب\n المتنعمين في استكشاف سرائره\n لو تأملوا فيه حق تأمل وتدبر\n لم يبق لهم شائبة شك وتردد في أنه ما هو من جنس كلام البشر\n بل ما هو إ لا وحي يوحى\n[النور: 40]\n\n\nخاتمة السورة\n\nعليك أيها الطالب القاصد لاستكشاف سرائر المرتبة الجامعة المحمدية التي اتحد عندها قوسا الوجوب والإمكان\n واتصل دوننها الغيب والشهادة أن تتأمل في القرآن المنزل عليه من عند ربه على مقتضى نشأته وكمال استعداده وعزة شأنه\n وتتدبر حق التدبر في مرموزاته بقدر وسعك وطاقتك\n وإن كان الاطلاع على غوره من المستحيلات سيما بالنسبة إلى ذوي الاستعدادات الضعيفة حتى يشهد لك ذوقك ووجدانك برسالته وبنوبته وهدايته إلى توحيد ربه وإرشاده إلى سبيل الحق\n ولا يتيسر لك هذا إلا بعد تصفية ظاهرك عن الشواغل الحسية والعلائق الدنياوية مطلقاً\n وباطنك عن التقليدات والتخمينات الموروثة لدرن الجهالات ورين الخيالات الموقعة لأنواع الشبهات والترردات\n\n\nوبالجملة: لا يحصل لك هذا إلا بعد تحققك في مرتبة الموت الأرادي وخروجك عن مقتضى هويتك مطلقاً\n\n\nجعلنا الله ممن أيده الحق لسلوك طريق توحيده\n ووفقه إلى سواء سبيله بمنِّه وجوده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ويقول الذين كفروا } من رؤساء اليهود: { لستَ مرسلاً } \n ولم نجد لك ذكراً في كتابنا\n ولا ما يشهد لك عندنا\n قال تعالى: { قل } لهم: { كفى بالله شهيداً بيني وبينكم } فإنه أظهر من الأدلة على رسالتي ما يغني عن شاهد يشهد عليها منكم\n ولا من غيركم\n { و } يشهد لي أيضاً: { مَنْ عنده عِلمُ الكتاب } الأول العلم الحقيقي\n كعبد الله بن سلام\n ومن أسلم من اليهود والنصارى الذين علموا صفته صلى الله عليه وسلم من التوراة والإنجيل\n وعلماء المؤمنين الذين عندهم علم القرآن\n وما احتوى عليه من النظم المعجز\n والعلوم الغيبية الدالة على نبوته صلى الله عليه وسلم\n\nأو علم اللوح المحفوظ إلا هو\n شهيداً بيننا\n ويؤيده قراءة من قرأ: \" ومَنْ عِنْدِهِ \" بكسر الميم\n وعلم الكتاب\n على الأول: مرفوع بالظرف فإنه معتمد على الموصول\n ويجوز أن يكون مبتدأ\n والظرف خبره\n وهو متعين على الثاني\n قاله البيضاوي\n الإشارة: قد قال تعالى في الحديث القدسي:\n \" مَنْ آذَى لي وَلِيّاً فَقَد آذَنَ بالحَرْب \" \nوجرت عادة الله تعالى أن ينتقم لأوليائه\n ويغار عليهم\n ولو بعد حين\n فإذا أُوذي أحدُهم\n واستعجل ذلك يقول له الحق تعالى ما قال لنبيه صلى الله عليه وسلم: { فإما نرينك بعض الذي نعدهم أو نتوفينك } قبل ذلك\n فليس الأمر بيدك\n فإنما عليك بلاغ ما جاء به نبيك من نصح العباد\n وإرشادهم إلى معالم دينهم\n وتصفية بواطنهم\n وعلينا الحساب فنُجازي مَنْ أقَْبَلَ ومَنْ أدْبَرَ\n ومن جملة الانتقام: حَبسُ الأمطار\n ونقص الثمار\n وتخريب البلاد\n وكثرة موت العباد\n فتنقص الأرض من أطرافها\n أفلم يعتبروا بذلك\n ويقصروا عن مكرهم بأولياء الله؟\n وقد مكر الذين من قبلهم بأولياء زمانهم\n فلم يغنوا شيئاً\n فَمَكَرَ الله بهم\n وخذلهم عن طاعته\n وسيعلم أهل الإنكار لِمن تكون عاقبة الدار\n ويقول الذين كفروا بخصوصية وليّ من أولياء الله: لست وليّاً\n فيقول لهم: كفى بالله شهيداً بيني وبينكم\n ومن عنده علم الخصوصية\n وهم: السادات الصوفية\n فلا يعرف الوليَّ إلا وليُّ مثله\n ولا يعرف أهلَ الخصوصية إلا مَنْ له الخصوصية\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:166",
      "similarity": 0.6363744241057632
    },
    {
      "verse": "39:36",
      "similarity": 0.60639420717357
    },
    {
      "verse": "17:96",
      "similarity": 0.5934885442889468
    },
    {
      "verse": "4:70",
      "similarity": 0.5838184046602565
    },
    {
      "verse": "4:79",
      "similarity": 0.5684426621482087
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}