{
  "chapter": "الرعد",
  "text": "ويقول الذين كفروا۟ لست مرسلا قل كفى بالله شهيدۢا بينى وبينكم ومن عنده علم الكتب",
  "translations": [
    {
      "translation": "Yet those who are disbelievers say: \"You are not the apostle sent (by God).\" Tell them: \"God is sufficient as witness between me and you, and he who has knowledge of the Book.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers claim that you have not been sent by Allah. Tell them: \"Allah is sufficient as a witness between me and you; and so also do those who know the Scriptures.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), the unbelievers say, \"You are not a Messenger.\" Say, \"God and those who have the knowledge of the Book are sufficient witness (to my prophethood).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers say, “You are not a (Noble) Messenger (of Allah)”; proclaim, “Allah is a Sufficient Witness between me and you, and (so is) he who has knowledge of the Book.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved, say: \"You are not a Messenger.\" Say: \"Sufficient as a witness between me and you is Allah and those too who have knowledge of the Scripture.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: You are not a messenger. Say: Allah is sufficient as a witness between me and you and whoever has knowledge of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, 'Thou art not an Envoy.' Say: 'God suffices as a witness between me and you, and whosoever possesses knowledge of the Book.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who disbelieve say: Thou art no messenger (of Allah). Say: Allah, and whosoever hath knowledge of the Scripture, is sufficient witness between me and you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth say, \"You are not God's messenger.\" Say, \"Sufficient is God as my witness between me and you, and those who have knowledge of the Book.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: thou art not a sent one. Say thou: Allah is a sufficient witness between me and you, and also he with whom is knowledge of the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say, ‘You have not been sent [by Allah].’ Say, ‘Allah suffices as a witness between me and you, and he who possesses the knowledge of the Book.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Unbelievers say: \"No messenger art thou.\" Say: \"Enough for a witness between me and you is Allah, and such as have knowledge of the Book.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve, say: \"You (O Muhammad SAW) are not a Messenger.\" Say: \"Sufficient for a witness between me and you is Allah and those too who have knowledge of the Scripture (such as 'Abdullah bin Salam and other Jews and Christians who embraced Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: 'You are not a Messenger' Say: 'Allah is a Sufficient witness between me and you, and whosoever possess knowledge of the Book'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say, “You are not a messenger.” Say, “God is a sufficient witness between me and you, and whoever has knowledge of the Scripture.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have disbelieved say, \"You are not a messenger.\" Say, [O Muhammad], \"Sufficient is Allah as Witness between me and you, and [the witness of] whoever has knowledge of the Scripture.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:43] And those who disbelieve say, to you: ‘You have not been sent [by God]!’ Say, to them: ‘God suffices as a witness between me and you, to my truthfulness [as a messenger], and he who possesses knowledge of the Book’, from among the Christian and Jewish believers. Meccan, except for the two verses 28 and 29, which are Medinese; it consists of 52, 54 or 55 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They who disbelieve) in Muhammad (pbuh) and in the Qur'an (say: Thou art no messenger (of Allah)) Muhammad, unless you bring us a witness who will testify that you are a messenger. Allah therefore said: (Say: Allah, and whosoever hath true knowledge of the Scripture) i.e. 'Abdullah Ibn Salam and his companions; it is also said that the reference here is to Asaf Ibn Barkhiyya, due to Allah's saying: (One with whom was knowledge of the Scripture) [27: 40]-and it is also said that this means: the one who has knowledge of the Scripture can explain the Qur'an-(is sufficient witness between me and you) that I am His Messenger and this Qur'an is His speech'. And of the surah in which Abraham is mentioned, which is all Meccan and consists of 50 verses, 831 words and 3,434 letters: Surah 14: Abraham [Ibrahim) And of the surah in which Abraham is mentioned, which is all Meccan and consists of 50 verses, 831 words and 3,434 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة شكيمتهم وغيظهم معك يا أكمل الرسل { يَقُولُ ٱلَّذِينَ كَفَرُواْ } بدينك وكتابك؛ أي: رؤساؤهم وصناديدهم: { لَسْتَ مُرْسَلاً } من عند الله مثل سائر الرسل؛ لذلك ما نتبعك ونؤمن بك وبكتابك { قُلْ كَفَىٰ بِٱللَّهِ شَهِيداً بَيْنِي وَبَيْنَكُمْ } أي: كفى الله بى شاهد لإثبات رسالتي وادعائي النبوة؛ إذ أيدني بالمعجزات القاطعة والبراهين الساطعة { وَمَنْ عِندَهُ عِلْمُ ٱلْكِتَابِ } [الرعد: 43] من أصحاب اللسن والفصاحة وأرباب الفطنة والذكاء، المتأملين في مرموزات الكتاب، المتنعمين في استكشاف سرائره، لو تأملوا فيه حق تأمل وتدبر، لم يبق لهم شائبة شك وتردد في أنه ما هو من جنس كلام البشر، بل ما هو إ لا وحي يوحى\n\n[النور: 40]\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الطالب القاصد لاستكشاف سرائر المرتبة الجامعة المحمدية التي اتحد عندها قوسا الوجوب والإمكان، واتصل دوننها الغيب والشهادة أن تتأمل في القرآن المنزل عليه من عند ربه على مقتضى نشأته وكمال استعداده وعزة شأنه، وتتدبر حق التدبر في مرموزاته بقدر وسعك وطاقتك، وإن كان الاطلاع على غوره من المستحيلات سيما بالنسبة إلى ذوي الاستعدادات الضعيفة حتى يشهد لك ذوقك ووجدانك برسالته وبنوبته وهدايته إلى توحيد ربه وإرشاده إلى سبيل الحق، ولا يتيسر لك هذا إلا بعد تصفية ظاهرك عن الشواغل الحسية والعلائق الدنياوية مطلقاً، وباطنك عن التقليدات والتخمينات الموروثة لدرن الجهالات ورين الخيالات الموقعة لأنواع الشبهات والترردات\n\n\n\n\nوبالجملة: لا يحصل لك هذا إلا بعد تحققك في مرتبة الموت الأرادي وخروجك عن مقتضى هويتك مطلقاً\n\n\n\n\nجعلنا الله ممن أيده الحق لسلوك طريق توحيده، ووفقه إلى سواء سبيله بمنِّه وجوده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ويقول الذين كفروا } من رؤساء اليهود: { لستَ مرسلاً } ، ولم نجد لك ذكراً في كتابنا، ولا ما يشهد لك عندنا\n قال تعالى: { قل } لهم: { كفى بالله شهيداً بيني وبينكم } فإنه أظهر من الأدلة على رسالتي ما يغني عن شاهد يشهد عليها منكم، ولا من غيركم\n { و } يشهد لي أيضاً: { مَنْ عنده عِلمُ الكتاب } الأول العلم الحقيقي، كعبد الله بن سلام، ومن أسلم من اليهود والنصارى الذين علموا صفته صلى الله عليه وسلم من التوراة والإنجيل، وعلماء المؤمنين الذين عندهم علم القرآن، وما احتوى عليه من النظم المعجز، والعلوم الغيبية الدالة على نبوته صلى الله عليه وسلم\n\n\nأو علم اللوح المحفوظ إلا هو، شهيداً بيننا\n ويؤيده قراءة من قرأ: \" ومَنْ عِنْدِهِ \" بكسر الميم\n وعلم الكتاب، على الأول: مرفوع بالظرف فإنه معتمد على الموصول\n ويجوز أن يكون مبتدأ، والظرف خبره\n وهو متعين على الثاني\n قاله البيضاوي\n الإشارة: قد قال تعالى في الحديث القدسي:\n\n \" مَنْ آذَى لي وَلِيّاً فَقَد آذَنَ بالحَرْب \" \n\nوجرت عادة الله تعالى أن ينتقم لأوليائه، ويغار عليهم، ولو بعد حين، فإذا أُوذي أحدُهم، واستعجل ذلك يقول له الحق تعالى ما قال لنبيه صلى الله عليه وسلم: { فإما نرينك بعض الذي نعدهم أو نتوفينك } قبل ذلك، فليس الأمر بيدك، فإنما عليك بلاغ ما جاء به نبيك من نصح العباد، وإرشادهم إلى معالم دينهم، وتصفية بواطنهم، وعلينا الحساب فنُجازي مَنْ أقَْبَلَ ومَنْ أدْبَرَ\n ومن جملة الانتقام: حَبسُ الأمطار، ونقص الثمار، وتخريب البلاد، وكثرة موت العباد، فتنقص الأرض من أطرافها\n أفلم يعتبروا بذلك، ويقصروا عن مكرهم بأولياء الله؟\n وقد مكر الذين من قبلهم بأولياء زمانهم، فلم يغنوا شيئاً، فَمَكَرَ الله بهم، وخذلهم عن طاعته، وسيعلم أهل الإنكار لِمن تكون عاقبة الدار\n ويقول الذين كفروا بخصوصية وليّ من أولياء الله: لست وليّاً\n فيقول لهم: كفى بالله شهيداً بيني وبينكم، ومن عنده علم الخصوصية، وهم: السادات الصوفية، فلا يعرف الوليَّ إلا وليُّ مثله، ولا يعرف أهلَ الخصوصية إلا مَنْ له الخصوصية\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق\n\n",
      "translations": []
    }
  ]
}