{
  "chapter": "الرعد",
  "text": "اولم يروا۟ انا ناتى الارض ننقصها من اطرافها والله يحكم لا معقب لحكمه وهو سريع الحساب",
  "translations": [
    {
      "translation": "Do they not see how We come to the land eroding it at its extremities. Allah judges and there is no reversing His judgement. He is swift at reckoning.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see Us advancing from all sides into their land and reducing its frontiers? It is for God to judge; and there is none to reverse His judgement. He is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We are advancing in the land, diminishing it by its borders on all sides? Allah judges, and no one has the power to reverse His judgement. He is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered that We have taken over the land and reduced its borders? It is God who issues the irreversible decree and His reckoning is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not perceive that We are reducing their dwellings from all directions? And Allah gives the command – there is none that can postpone His command; and He spends no time in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that We gradually reduce the land from its outlying borders. And Allah judges, there is none to put back His judgement, and He is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see that We are bringing destruction upon the land by curtailing it of its sides? And Allah pronounces a doom-- there is no repeller of His decree, and He is swift to take account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We come to the land diminishing it in its extremities? God judges; none repels His judgment; He is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not how we aim to the land, reducing it of its outlying parts? (When) Allah doometh there is none that can postpone His doom, and He is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how We come to [their] land and shrink its borders? God decides, no one can reverse His decision, and He is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold they not that We visit the landj diminishing it by the borders thereof Allah judgeth, and there is no reviser of His judgment; and He is swift in reckoning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how We visit the land diminishing it at its edges? Allah judges, and there is none who may repeal His judgement, and He is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that We gradually reduce the land (in their control) from its outlying borders? (Where) Allah commands, there is none to put back His Command: and He is swift in calling to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not that We gradually reduce the land (of disbelievers, by giving it to the believers, in war victories) from its outlying borders. And Allah judges, there is none to put back His Judgement and He is Swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how We come to the land and reduce its extremities? Allah judges; none repel His judgement. Swift is His reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how We deal with the earth, diminishing it at its edges? God judges; and nothing can hold back His judgment. And He is quick to settle accounts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen that We set upon the land, reducing it from its borders? And Allah decides; there is no adjuster of His decision. And He is swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:41] Or is it that they, the people of Mecca, have not seen how We visit the land, [how] We target their land, diminishing it at its outlying regions?, by giving victory to the Prophet (s). And God judges, among His creatures as He will; there is none that can repel His judgement and He is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(See they not) i.e. the people of Mecca (how We visit the land) how We seize the land, (reducing it of) opening it up to Muhammad (pbuh) from (its outlying parts?) from its surrounding sides; it is also said that this refers to the death of the men of knowledge. ((When) Allah doometh) when He decrees the conquest of cities or the death of scholars (there is none that can postpone) there is nothing that can change this. (His doom, and He is swift at reckoning) His torment is severe; it is also said that this means: when He takes people to task, His reckoning is severe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { نَنقُصُهَا مِنْ أَطْرَافِهَا } معناهُ نُذهبُ بِعلمائِها وعُبادِها\n\n\n\n\nوقوله تعالى: { لاَ مُعَقِّبَ لِحُكْمِهِ } معناهُ لاَ رادَّ ولاَ تَغيُّرَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أو لم يَروا أنا نأتي الأرض } نقصد أرض الجسد وقت الشيخوخة { ننقصها من أطْرَافها } بتواكل الأعضاء وتخاذل القوى وكلالة الحواس شيئاً فشيئاً حتى يموت { والله يحكم } على هذا الوجه { لا معقب لحكمه } لا رادّ ولا مبدّل لحكمه، أو نأتي أرض النفس وقت السلوك ننقصها من أطرافها بإفناء أفعالها بأفعالنا أولاً كما قال تعالى:\n\n \" بي يسمع وبي يبصر \" \n\n، ثم بإفناء صفاتها بصفاتنا ثانياً، كما قال تعالى:\n\n \" كنت سمعه الذي يسمع به وبصره الذي يُبْصر \" \n\nثم بإفناء ذاتها بذاتنا كما قال تعالى:\n\n[غافر، الآية: 16] وأجاب نفسه بقوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } ينكرون حسابنا إياهم وانتقامنا عنهم { وَلَمْ يَرَوْاْ أَنَّا نَأْتِي ٱلأَرْضَ } التي شاعتب فيها كفرهم { نَنقُصُهَا مِنْ أَطْرَافِهَا } وأرجائها حتى ضاقت عليهم بإظهار دين الإسلام وإكثار أهله { وَٱللَّهُ } المدبر على مقتضى الحكمة { يَحْكُمُ } بحكم مبرم { لاَ مُعَقِّبَ لِحُكْمِهِ } أصلاً ليبدله ويغيره { وَهُوَ سَرِيعُ ٱلْحِسَابِ } [الرعد: 41] صعب الانتقام على من أراد تغيير حكمه وتبديله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أوَ لَم يروا أنا نأتي الأرضَ } أي: أرض الكفرة، { ننقُصُها من أطرافِها } بما نفتحه على المسلمين منها، فيخافون أن نُمَكّنك من أرضهم، وتنزل بساحتهم، منصوراً عليهم، فإذا نزلتَ بساحتهم، ولم يخضعوا لك، فساء صباح المنذرين\n وقيل: الأرض جنس، ونقصها بموت الناس، وهلاك الثمرات، وخراب البلاد، وشبه ذلك\n وذلك مقدمات العذاب الذي حَكَمَ به عليهم، { واللهُ يحكُمُ لا مُعقبَ لحُكْمِهِ }: لا راد له\n والمعقب: الذي يعقب الشيء بالأبطال، ومنه قيل لصاحب الدَيْن: معقب لأنه يعقب غريمه للاقتضاء، والمعنى: أنه حكم للأسلام بالإقبال، وعلى الكفرة بالإدبار، وذلك كائن لا يمكن تغييره\n { وهو سريعُ الحساب } فيحاسبهم عما قليل في الآخرة، وبعدما عذَّبهم بالقتل والإجلاء في الدنيا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:44",
      "similarity": 0.568164273512262
    },
    {
      "verse": "50:4",
      "similarity": 0.4912274366088637
    },
    {
      "verse": "11:109",
      "similarity": 0.39153951913247914
    },
    {
      "verse": "7:130",
      "similarity": 0.3904059079763269
    },
    {
      "verse": "37:48",
      "similarity": 0.3783451898971488
    }
  ]
}