{
  "chapter": "الرعد",
  "text": "وفى الارض قطع متجورت وجنت من اعنب وزرع ونخيل صنوان وغير صنوان يسقى بماء وحد ونفضل بعضها على بعض فى الاكل ان فى ذلك لءايت لقوم يعقلون",
  "translations": [
    {
      "translation": "In the earth there are diverse regions side by side and gardens of grapes and cultivated fields, and palm- trees sharing one root and others with individual roots, all watered with the same water. And We make some things better to eat than others. There are Signs in that for people who use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the earth are tracts adjoining one another, and vineyards, fields of corn and date-palm trees, some forked, some with single trunks, yet all irrigated by the self-same water, though We make some more excellent than the others in fruit. There are surely signs in them for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the earth there are many tracts of land neighbouring each other. There are on it vineyards, and sown fields, and date palms: some growing in clusters from one root, some standing alone. They are irrigated by the same water, and yet We make some excel others in taste. Surely there are signs in these for a people who use their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the earth there are adjacent pieces of land, vineyards, farms, date-palms of single and many roots which are all watered by the same water. We have made some yield a better food than others. All this is evidence (of the existence of God) for the people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the earth are various regions, and are close to each other – and gardens of grapes and fields, and date-palms, growing from a single branch and separately, all being given one water; and in fruits, We make some better than others in eating; indeed in this are signs for people of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the earth are neighboring tracts, and gardens of vines, and green crops (fields), and date palms, growing into two or three from a single stem root, or otherwise, watered with the same water; yet some of them We make more excellent than others to eat. Verily, in these things there are Ayat (signs) for the people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the earth there are tracts side by side and gardens of grapes and corn and palm trees having one root and (others) having distinct roots-- they are watered with one water, and We make some of them excel others in fruit; most surely there are signs in this for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the earth are tracts neighbouring each to each, and gardens of vines, and fields sown, and palms in pairs, and palms single, watered with one water; and some of them We prefer in produce above others. Surely in that are signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the Earth are neighbouring tracts, vineyards and ploughed lands, and date-palms, like and unlike, which are watered with one water. And we have made some of them to excel others in fruit. Lo! herein verily are portents for people who have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the earth are diverse tracts, adjoining one another: vineyards and cornfields and groves of palm, the single and the clustered. Their fruits are nourished by the same water; yet We make the taste of some excel that of others. In this also are signs for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the earth are regions neighbouring and gardens of vines and cornfields, and palm-trees clustered and single, watered by the same water; yet some We make to excel others in food. Verily therein are signs for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the earth are neighbouring terrains [of diverse kinds] and vineyards, farms, and date palms growing from the same root and from diverse roots, [all] irrigated by the same water, and We give some of them an advantage over others in flavour. There are indeed signs in that for people who exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the earth are tracts (diverse though) neighbouring, and gardens of vines and fields sown with corn, and palm trees - growing out of single roots or otherwise: watered with the same water, yet some of them We make more excellent than others to eat. Behold, verily in these things there are signs for those who understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the earth are neighbouring tracts, and gardens of vines, and green crops (fields etc.), and date-palms, growing out two or three from a single stem root, or otherwise (one stem root for every palm), watered with the same water, yet some of them We make more excellent than others to eat. Verily, in these things, there are Ayat (proofs, evidences, lessons, signs) for the people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the land, there are adjoining plots, gardens of vines, sown fields and palmtrees in pairs and single that are watered with one water, yet We make some excel others in produce. Surely, in that are signs for a nation who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On earth are adjacent terrains, and gardens of vines, and crops, and date-palms, from the same root or from distinct roots, irrigated with the same water. We make some taste better than others. In that are proofs for people who reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And within the land are neighboring plots and gardens of grapevines and crops and palm trees, [growing] several from a root or otherwise, watered with one water; but We make some of them exceed others in [quality of] fruit. Indeed in that are signs for a people who reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:4] And on the earth are tracts, diverse terrains, neighbouring each other, joined side by side, some good, some briny, some of little yield and some fruitful — and these constitute proofs of His power, exalted be He — and gardens, orchards, of vines and sown fields (read zar‘un, in the nominative, as a supplement to jannātun, ‘gardens’, or read zar‘in, in the genitive, [as a supplement] to a‘nābin, ‘of vines’); similarly [constituting proofs of His power are] His words: and date-palms sharing one root (sinwān is the plural of sinw, which are date-palms belonging to the same root, but with many offshoots) and date-palms otherwise, [each] of   individual root, watered (read tusqā as [referring to] jannāt, ‘gardens’, and what is in them, or read yusqā as [referring to] the mentioned [date-palms]) by the same [source of] water; and We make some of them to excel (wa-nufaddil, or read wa-yufaddil, ‘and He [God] makes [some of them] to excel’) others in flavour (read fī’l-ukul or fī’l-ukl): and so some are sweet, others, bitter — and these are [also] proofs of His power, exalted be He. Surely in that, which is mentioned, are signs for a people who understand, [who] reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And in the Earth are neighbouring) adjacent (tracts) places: a bad, swampy land close to a good, fertile land, (vineyards and ploughed lands, and date-palms, like) which have the same roots, whether they are ten or less (and unlike) have different roots, (which are watered with one water) they are watered with the rain or water from rivers. (And We have made some of them to excel others in fruit) in bearing and taste. (Lo! Herein) in their difference and different colours (verily are portents) signs (for people who have sense) for people who believe that they are from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَفِي ٱلأَرْضِ قِطَعٌ مُّتَجَاوِرَاتٌ } معناهُ مُتَدَانياتٌ مُتَقارباتٌ\n\n\n\n\nوقوله تعالى: { صِنْوَانٌ وَغَيْرُ صِنْوَانٍ } فالصُّنوانُ: ما اجِتَمَعَ ثَلاَثَةُ فِي أَصلٍ واحدٍ\n وغَيرُ صُنوانٍ: يَعني مُتَفرقاً\n\n\n\n\nوقوله تعالى: { وَنُفَضِّلُ بَعْضَهَا عَلَىٰ بَعْضٍ فِي ٱلأُكُلِ } قالَ: هذَا حُلوٌ وهَذا حَامِضٌ\n\n\n\n\nوقوله تعالى: { يُسْقَىٰ بِمَآءٍ وَاحِدٍ } معناه بماء السماء غير الأَنهار\n\n\n\n\nوقوله تعالى:\n\n[الأنعام: 36] فالذِينَ يَسمَعُونَ: هُم المُؤمِنونَ\n والمَوتى: هُم الكُفّارُ\n يَبعَثُهم الله: معناهُ يُحييهِمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً من بدائع قدرته وغرائب حكمته أنه حصل { فِي ٱلأَرْضِ قِطَعٌ مُّتَجَاوِرَاتٌ } متماثلة في الطبيعة والمزاج { وَ } حصلت في بعضها { جَنَّاتٌ } وبساتين { مِّنْ أَعْنَابٍ وَ } في بعضها { زَرْعٌ وَ } في البعض { نَخِيلٌ } مختلفة أنواعها بعضها { صِنْوَانٌ } أي: نخلات متكثرة، أصلها واحد { وَغَيْرُ صِنْوَانٍ } أي: مترفقات الأصولا مع أنها كلها { يُسْقَىٰ بِمَآءٍ وَاحِدٍ وَ } مع وحدة طبيعة الأرض والماء { نُفَضِّلُ بَعْضَهَا } أي: بعض الثمرات { عَلَىٰ بَعْضٍ فِي ٱلأُكُلِ } لأن بعضها ضار وبعضها نافع، وبعضها حلو وبعضها حامض، إلى غير ذلك من التفاوت والاختلافات { إِنَّ فِي ذٰلِكَ } الاختلاف مع وحدة طبيعة القابل { لآيَاتٍ } عظام ودلائل جسام على حكمة الصانع الحكيم ومتانة فعله { لِّقَوْمٍ يَعْقِلُونَ } [ارعد: 4] ويستعملون عقولهم في التفكير يمصنوعات الحق والتدبير بمبدعاته ومخترعاته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قاله البيضاوي: { وجناتٌ من أعناب وزرعٌ ونخيلٌ } أي: وفي الأرض أيضاً بساتين فيها أنواع من الأعناب والزروع والنخيل، من صفة تلك النخيل: { صِنْوَانٌ } أي: نخلات كثيرة متفرعة من أصل واحد، { وغير صِنْوَانٌ } أي: غير متفرعة بل كلنخله منفردة باصل واحد { يُسقى بماءٍ واحد ونُفَضِّلُ بعضها على بعضٍ في الأُكُل } أي: في الثمر المأكول قدراً وشكلاً، وطعماً، ورائحةً ولوناً، مع اتفاق الماء الذي تُسقى به\n وذلك مما يدل أيضاً على الصانع القادر الحكيم فإن إيجادها، مع اختلاف الأصول والأسباب، لا يكون إلا بتخصيص قادر مختار\n وفيه رد على الطبائعيين\n { إن في ذلك لآياتٍ لقوم يعقلون }: يستعملون عقولهم بالتفكر والاعتبار، فيُدركون عظمة الواحد القهار\n الإشارة: ذَكَرَ أولاً سماء الأرواح، وما يُناسبها من أنوار التوحيد وأسرار التفريد، وذكر هنا أرض النفوس، وما يلائمها من جبال العقول وأنهار العلوم، فقال: وهو الذي مد أرض النفوس، وجعل فيها جبالاً من العقول الشامخة، حتى أدركت الصانع، وتحققت بوجوده ووحدانيته، بالدلائل الواضحة، والبراهين القطعية، وأنبع منها أنهاراً من العلوم الرسمية والرقائق الوعظية\n\n\nوجعل فيها من كل صنف من ثمار ما جنت بمجاهدتها صنفين اثنين: قبضاً وبسطاً منعاً ووجداً، ذلاً وعزاً، فقراً وغنىً\n يغْشيانها غشاءَ الليل للنهار فإذا كان ليل القبض غشيه نهار البسط، فيزيله، وإذا كان المنع، غشية الوجد، وإذا كان الذل غشيه العز، وإذا كان الفقر غشيه الغنى، وهكذا\n ودوام حال من قضايا المحال\n وفي أرض النفوس أيضاً قطع متجاورة، مع اختلاف ألوانها وطبائعها، وعلومها ومعارفها، ومواجدها وألسنتها\n وفيها أيضاً جنات المعارف ـ إن اتصلت بطبيب عارفٍ ـ من أعناب الحقائق الناشئة عن خمرة الأزل، وزرع الشرائع الناشئة عن الكسب والتحصيل، ونخيل الأذواق والوجدان، صنوان وغير صنوان ـ يعني من تعتريه الأحوال، ومن لا تعتريه لكمال رسوخه، تُسقى بخمره واحدة، وهي الخمرة الأزلية، على أيدي الوسائط، أو بلا وسائط، وهو نادر\n ونُفضل بعضها على بعض في الأذواق والوجدان فترى العارفين بعضهم قطب في الأحوال، وبعضهم قطب في المقامات كان الجنيد رضي الله عنه قطباً في العلوم، وكذا الشاذلي والجيلاني والغزالي، وأمثالهم\n وكان الشيخ أبو زيد قطباً في الأحوال، وكان سهلُ التسْتُري قطباً في المقامات\n والأولياء كلهم لا يخرجون عن هذا التقسيم، كل واحد وما يغلب عليه، مع مشاركته لغيره في الثلاث\n والله تعالى أعلم\n ولما ذكر دلائل قدرته ذكر وعيد من أعرض عنها حتى أنكر البعث فقال: { وَإِن تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ أَإِذَا كُنَّا\n\n\n }\n",
      "translations": []
    }
  ]
}