{
  "chapter": "الرعد",
  "text": "وان تعجب فعجب قولهم اءذا كنا تربا اءنا لفى خلق جديد او۟لئك الذين كفروا۟ بربهم واو۟لئك الاغلل فى اعناقهم واو۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "If you are surprised at their blindness, what could be more surprising than their words: 'What, when we are turned to dust, shall we then be created all anew?' These are the people who reject their Lord. Such people have iron collars round their necks. Such people are the Companions of the Fire, remaining in it timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are surprised, then astonishing is the speech (of those who say:) \"Having turned to dust shall we be raised as a new creation?\" They are the ones who deny their Lord, and they will have collars around their necks. They are the inmates of Hell, where they will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were you to wonder, then wondrous indeed is the saying of those who say: \"What! After we have been reduced to dust, shall we be created afresh?\" They are the ones who disbelieved in their Lord; they are the ones who shall have shackles around their necks. They shall be the inmates of the Fire, wherein they will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there is anything to make you wonder, it would be the words of those who say, \"When we become dust, shall we be brought back to life again?\" They are disbelievers in their Lord and will wear heavy fetters around their necks. They are the dwellers of the hell fire wherein they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are amazed, then indeed the amazement is at their saying that, “Will we, after having turned to dust, be created anew?” They are those who have disbelieved in their Lord; and they are those who will have shackles around their necks; and they are the people of hell; remaining in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you wonder, then wondrous is their saying: \"When we are dust, shall we indeed then be (raised) in a new creation\" They are those who disbelieved in their Lord! They are those who will have iron chains linking their hands to their necks. They will be dwellers of the Fire to abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you would wonder, then wondrous is their saying: What! when we are dust, shall we then certainly be in a new creation? These are they who disbelieve in their Lord, and these have chains on their necks, and they are the inmates of the fire; in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou wouldst wonder, surely wonderful is their saying, 'What, when we are dust shall we indeed then be raised up again in new creation?' Those are they that disbelieve in their Lord; those -- on their necks are fetters; those shall be the inhabitants of the Fire, therein dwelling forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thou wonderest, then wondrous is their saying: When we are dust, are we then forsooth (to be raised) in a new creation? Such are they who disbelieve in their Lord; such have carcans on their necks; such are rightful owners of the Fire, they will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anything can astonish you, you should surely be astonished at their asking, \"What? When we become dust, shall we be created anew?\" These are the ones who deny their Lord: around their necks there shall be fetters. They are the inheritors of the Fire, and shall abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And shouldst thou marvel, then marvellous is their saying: when we have become dust, shall we be in a new creation! ' These are they who disbelieved in their Lord; and these! -- the shackles round their necks; and these shall be the fellows of the Fire as abiders therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are to wonder [at anything], then wonderful is their remark, ‘When we have become dust, shall we be [ushered] into a new creation?’ They are the ones who defy their Lord; they shall have iron collars around their necks, they shall be the inhabitants of the Fire, and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou dost marvel (at their want of faith), strange is their saying: \"When we are (actually) dust, shall we indeed then be in a creation renewed?\" They are those who deny their Lord! They are those round whose necks will be yokes (of servitude): they will be Companions of the Fire, to dwell therein (for aye)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you (O Muhammad SAW) wonder (at these polytheists who deny your message of Islamic Monotheism and have taken besides Allah others for worship who can neither harm nor benefit), then wondrous is their saying: \"When we are dust, shall we indeed then be (raised) in a new creation?\" They are those who disbelieve in their Lord! They are those who will have iron chains tying their hands to their necks. They will be dwellers of the Fire to abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you would wonder, then wondrous is their saying: 'When we are dust, shall we be raised to life again, a new creation' Such are those who disbelieve in their Lord. Their necks shall be fettered. They shall be the inhabitants of the Fire, in it they shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should you wonder—the real wonder is their saying: “When we have become dust, will we be in a new creation?” Those are they who defied their Lord. Those are they who will have yokes around their necks. Those are the inhabitants of the Fire, where they will remain forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are astonished, [O Muhammad] - then astonishing is their saying, \"When we are dust, will we indeed be [brought] into a new creation?\" Those are the ones who have disbelieved in their Lord, and those will have shackles upon their necks, and those are the companions of the Fire; they will abide therein eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:5] And if you wonder, O Muhammad (s), at the disbelievers denying you, then surely wondrous, [surely] deserving wonder, is their saying, in denial of resurrection: ‘When we have become dust, shall we indeed then be [raised] in a new creation?’, [it is wondrous] because the One Who has the power to originate creation and [to originate] what has been mentioned [above], without any precedent, has [also] the power to restore them [to life] (both hamzas, in both instances [a-idhā and a-innā], are pronounced; or [one may] pronounce the first and not pronounce the second, but in both cases inserting an alif or not [inserting it]; one variant reading has the first [a-idhā] as the interrogative, and the second one [a-innā] as the predicate, while another variant reading has the [exact] opposite). Those are the ones who disbelieve in their Lord; those — fetters shall be around their necks; and those, they shall be the inhabitants of the Fire, abiding therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if thou wonderest) at their disbelief in you, (then wondrous is their saying) then their saying is more amazing, since they have said: (When we are dust, are we then forsooth (to be raised) in a new creation) are we going to be revived after we die and be raised with souls? (Such) those who deny the Resurrection (are they who disbelieve in their Lord; such) the disbelieving folk (have carcans on their necks) they have chains on their hands tied up to their necks; (such) those who are chained (are rightful owners of the Fire) the dwellers of hell, (they will abide therein) they will dwell therein, never to die or come out of it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإن تعجب } عن قولهم فهو مكان التعجب لأن الإنسان في كل ساعة خلق آخر جديد\n بل العالم لحظة فلحظة خلق جديد بتبدّل الهيئات والأحوال والأوضاع والصور\n فكيف ينكر الخلق الجديد من نظر في عالم الكون والفساد بعين الاعتبار؟ { أولئك الذين } حجبوا عن شهود أفعال الربوبية وتجلياتها\n فكيف عن تجليات الصفات الإلهية؟ { وأولئك الأغلال في أعْنَاقهم } فلا يقدرون أن يرفعوا رؤوسهم المنتكسة إلى الأرض القاصر نظرها إلى ما يدانيها من الحسّ فيروا ملكوت الأرواح ويشاهدوا عالم القدرة وما يبعد عن منازل الحسّ من المعقولات { وأولئكَ أصْحَابُ } نيران جهنم الأفعال في قعر هاوية الطبيعة { هم فيها خالدون }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن تَعْجَبْ } يا أكمل الرسل إنكار الكفار حشر الأجساد مع وضوح دلائله وسطوع براهنيه { فَعَجَبٌ قَوْلُهُمْ } أي: فعليك أن تتعجب من قولهم - هذا حال كونهم مستفهمين مستبعدين على سبيل التعجب - أننا { أَإِذَا كُنَّا تُرَاباً } وعظاماً رفاتاً { أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ } كلا وحاشا أن نعود أجساما إنساناً بعدما صرنا كذلك { أُوْلَـٰئِكَ } البعداء المعزولون عن منهج الرشاد هم { الَّذِينَ كَفَرُواْ بِرَبِّهِمْ } الذين أوجدهم وأظهرهم من كتم العدم بلا سبق مادة ومدة\n ورباهم بأنواع التربية مع أن إعادتهم أيسر من إبدائهم وإبداعهم { وَأُوْلَئِكَ } الضالون المقيدون بسلاسل الطبيعة في النشأة الأولى صار { ٱلأَغْلاَلُ فِيۤ أَعْنَاقِهِمْ } في النشأة الأخرى\n دائماً مستمراً { وَ } بالجملة: { أُوْلَـٰئِكَ } الأشقياء المردودون { أَصْحَابُ ٱلنَّارِ هُمْ فِيهَا خَالِدونَ } [الرعد: 5] أبد الآباد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: فعجب: خبر، وقولهم: مبتدأ، وأئذا كنا... الخ ـ محكي به. واختلف القراء هنا، وفي مواضع من القرآن، فمنهم من قرأ بالاستفهام في الأول دون الثاني، ومنهم بالعكس، ومنهم من قرأ بالاستفهام فيهما. فمن قرأ بالاستفهام في الأول دون الثاني فإنما القصد هو الثاني لأنهم إنما أنكروا كون الإنسان يصير تراباً ثم يُبعث، وأما كونهم يصيرون تراباً فلا إنكار عندهم فيه. ومن قرأ بالاستفهام في الثاني فعلى الأصل، ومن قرأ بالاستفهام فيهما فزيادة تأكيد. والعامل في إذا محذوف دل عليه: { لفي خلق جديد } أي: أُنجَدد إذا... الخ. يقول الحق جل جلاله: { وإن تعجب } يا محمد من إنكارهم البعث { فعجبٌ قولُهم } أي: فقولهم حقيق بأن يتعجب منه، فإنَّ من قدر على إنشاء ما قصَّ عليك من عجائب السماوات والأرض، وأنواع الثمار على اختلاف أصنافها وألوانها، كانت الإعادة أيسر شيء عليه، فالآيات المعدودة، كما هي دالة على وجود المبدأ، فهي دالة على إمكان الإعادة، لأنها دالة على كمال قدرته تعالى. ثم فسر قولهم في الإنكار قالوا: { أَئذا كنا تراباً أئنا لفي خَلْقٍ جديد } أي: أَنُجَدِّدُ إذا متنا، وكنا تراباً، { أولئك } القائلون ذلك، أو المنكرون البعث، { الذين كفروا بربهم } لأنهم كفروا صفة القدرة، { وأولئك الأغلالُ في أعناقهم } أي: مقيدون بالضلال، قد أحاط بهم الشقاء، ولا يُرجى خلاصهم. أو: يُغلّون يوم القيامة. { وأولئك أصحابُ النار هم فيها خالدون } لا ينفكون عنها. وتوسط ضمير الفصل لتخصيص الخلود بالكفار، ففيه رد على المعتزلة. والله تعالى أعلم. الإشارة: إنكار بعث الأرواح من غفلاتها وجهلها، كإنكار بعث الأشباح بعد موتها، يُتعجب من الأول كما يتعجب من الثاني فالقدرة صالحة، فمن قدر على بعث الأشباح بعد موتها الحسي قدر على بعث الأرواح بعد موتها المعنوي: \" من استغرب أن ينقذه الله من شهوته، وأن يخرجه من وجود غفلته، فقد استعجز القدرة الإلهية { وكان الله على كل شيء مقتدراً } \" ، وقد أحيا الله أرواحاً كثيرة كانت ميتة بالجهل والمعاصي، فصارت عارفة بالله، من خواص أولياء الله مَنْ كانوا لصوصاً فصاروا خُصوصاً، ومنهم من كانوا كفاراً فصاروا أبراراً. وبالله التوفيق. ثم استمد بهم الإنكار حتى أستعجلوا ممن أوعدهم بذلك العذاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:29",
      "similarity": 0.43061292576723487
    },
    {
      "verse": "32:10",
      "similarity": 0.41168937709717984
    },
    {
      "verse": "72:3",
      "similarity": 0.39573272078397487
    },
    {
      "verse": "35:16",
      "similarity": 0.38446661111830327
    },
    {
      "verse": "14:19",
      "similarity": 0.37956608570693906
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/13:5.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/13:5.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/13:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}