{
  "chapter": "الرعد",
  "text": "ويستعجلونك بالسيئة قبل الحسنة وقد خلت من قبلهم المثلت وان ربك لذو مغفرة للناس على ظلمهم وان ربك لشديد العقاب",
  "translations": [
    {
      "translation": "They want you to hasten the bad rather than the good when examples of punishment are there before them in the past. Your Lord has forgiveness for people for their wrongdoing; but your Lord is also severe in retribution.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They want you to hasten the evil before the good, even when there have been examples of retribution before them. Though certainly your Lord forgives human beings for their iniquities, your Lord is severe of retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They challenge you to hasten the coming of evil upon them before the coming of any good, although people who followed a like course before had met with exemplary punishment (from Allah). Verily your Lord is forgiving to mankind despite all their wrong-doing. Verily your Lord is also severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you to bring upon them punishment before they ask you for mercy. Such punishments were already brought upon the people who lived before them. Your Lord, certainly, has forgiveness for the injustice of the people. He is also stern in His retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they urge you to hasten the punishment before the mercy, whereas the punishments of those before them have concluded; and indeed your Lord gives the people a sort of pardon* despite their injustice; and indeed the punishment of your Lord is severe. (* By delaying their punishment despite their disbelief.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you to hasten the evil before the good, while exemplary punishments have indeed occurred before them. But verily, your Lord is full of forgiveness for mankind, in spite of their wrongdoing. And verily, your Lord is (also) severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you to hasten on the evil before the good, and indeed there have been exemplary punishments before them; and most surely your Lord is the Lord of forgiveness to people, notwithstanding their injustice; and most surely your Lord is severe in requiting (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would have thee hasten the evil ere the good; yet there have passed away before them examples. Thy Lord is forgiving to men, for all their evil-doing, and thy Lord is terrible in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they bid thee hasten on the evil rather than the good, when exemplary punishments have indeed occurred before them. But lo! thy Lord is rich in pardon for mankind despite their wrong, and lo! thy Lord is strong in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They demand that you hasten on the evil rather than the good, although there have been many examples of punishment before them -- your Lord is full of forgiveness for mankind, despite their wrongdoings, but He is truly severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask thee to hasten the evil before the good, while examples have already gone forth afore them. And thy Lord is Owner of forgiveness unto mankind despite their wrong-doing; and verily thy Lord is severe in requital\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would press you for evil sooner than for good, though there have already gone by before them exemplary punishments. Indeed your Lord is forgiving to mankind despite their wrongdoing, and indeed your Lord is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee to hasten on the evil in preference to the good: Yet have come to pass, before them, (many) exemplary punishments! But verily thy Lord is full of forgiveness for mankind for their wrong-doing, and verily thy Lord is (also) strict in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you to hasten the evil before the good, yet (many) exemplary punishments have indeed occurred before them. But verily, your Lord is full of Forgiveness for mankind inspite of their wrong-doing. And verily, your Lord is (also) Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They bid you to hasten the evil before the good, yet examples have passed away before them. Your Lord is Forgiving to people despite their evildoing; yet your Lord is Stern in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they urge you to hasten evil before good, though examples have passed away before them. Your Lord is full of forgiveness towards the people for their wrongdoings, yet your Lord is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They impatiently urge you to bring about evil before good, while there has already occurred before them similar punishments [to what they demand]. And indeed, your Lord is full of forgiveness for the people despite their wrongdoing, and indeed, your Lord is severe in penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:6] The following was revealed regarding their hastening on, out of mockery, of the chastisement: And they would have you hasten on the evil, the chastisement, rather than the good, [rather than] mercy, when there have indeed occurred before them exemplary punishments (mathulāt is the plural of mathula, similar [in pattern] to samura [pl. samurāt], ‘acacia’), that is to say, the punishments of disbelievers like them: will they not take warning from these? Truly your Lord is forgiving to mankind despite their evil-doing, for otherwise He would not have left a single creature on the face of it [the earth]; and truly your Lord is severe in retribution, against those who disobey Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة { ويستعجلونك } عطفٌ على جملة { وإن تعجب } \\[ الرعد : 5 \\] ، لأن كلتا الجملتين حكاية لغريب أحوالهم في المكابرة والعناد والاستخفاف بالوعيد . فابتدأ بذكر تكذيبهم بوعيد الآخرة لإنكارهم البعث ، ثم عطف عليه تكذيبهم بوعيد الدنيا لتكذيبهم الرسول صلى الله عليه وسلم وفي الاستخفاف بوعيد نزول العذاب وعَدّهم إياه مستحيلاً في حال أنهم شاهدوا آثار العذاب النازل بالأمم قبلهم ، وما ذلك إلا لذهولهم عن قدرة الله تعالى التي سيق الكلام للاستدلال عليها والتفريع عنها ، فهم يستعجلون بنزوله بهم استخفافاً واستهزاء كقولهم : { فأمطر علينا حجارةً من السماء أو ائتنا بعذاب أليم } \\[ الأنفال : 32 \\] ، وقولهم : { أو تُسقِطَ السماءَ كما زعمتَ علينا كِسَفا } \\[ الإسراء : 93 \\].والباء في بالسيئة } لتعدية الفعل إلى ما لم يكن يتعدى إليه . وتقدم عند قوله تعالى : { ما عندي ما تستعجلون به } في سورة الأنعام ( 57 ).والسيئة : الحالة السيئة . وهي هنا المصيبة التي تسوء من تحل به . والحسنة ضدها ، أي أنهم سألوا من الآيات ما فيه عذاب بسوء ، كقولهم : { إن كان هذا هو الحقّ من عندك فأمطِر علينا حجارةً من السماء } \\[ الأنفال : 32 \\] دون أن يسألوا آية من الحسنات .فهذه الآية نزلت حكاية لبعض أحوال سؤالهم الظّانين أنه تعجيز ، والدالين به على التهكم بالعذاب .وقبْليّة السيئة قبلية اعتبارية ، أي مختارين السيئة دون الحسنة . وسيأتي تحقيقه عند قوله تعالى : { قال يا قوم لم تستعجلون بالسيئة قبل الحسنة } في سورة النمل ( 46 ) فانظره .وجملة وقد خلت من قبلهم المثلات } في موضع الحال . وهو محل زيادة التعجيب لأن ذلك قد يعذرون فيه لو كانوا لم يروا آثار الأمم المعذبة مثل عاد وثمود .والمَثُلات بفتح الميم وضم المثلثة : جمع مَثُلة بفتح الميم وضم الثاء كسَمُرة ، وبضم الميم وسكون الثاء كعُرْفة : وهي العقوبة الشديدة التي تكون مثالاً تُمثل به العقوبات .وجملة { وإن ربك لذو مغفرة للناس على ظلمهم } عطف على جملة { وقد خلت من قبلهم المثلات }. وهذا كشف لغرورهم بتأخير العذاب عنهم لأنهم لمّا استهزأوا بالنبي صلى الله عليه وسلم وتعرضوا لسؤال حلول العذاب بهم ورأوا أنه لم يعجل لهم حلوله اعترتهم ضراوة بالتكذيب وحسبوا تأخير العذاب عَجْزاً من المتوعد وكذبوا النبي صلى الله عليه وسلم وهم يجهلون أن الله حليم يُمهل عباده لعلهم يرجعون ، فالمغفرة هنا مستعملة في المغفرة الموقتة ، وهي التجاوز عن ضراوة تكذيبهم وتأخير العذاب إلى أجل ، كما قال تعالى : { ولئن أخرنا عنهم العذاب إلى أمة معدودة ليقولن ما يحسبه ألا يوم يأتيهم ليس مصروفاً عنهم وحاق بهم ما كانوا به يستهزئون } \\[ سورة النحل : 34 \\].وقرينة ذلك أن الكلام جار على عذاب الدنيا وهو الذي يقبل التأخير كما قال تعالى : { إنا كاشفوا العذاب قليلاً إنكم عائدون }\\[ الدخان : 15 \\] ، أي عذاب الدنيا ، وهو الجوع الذي أصيب به قريش بعد أن كان يطعمهم من جوع .وعلى } في قوله : { على ظلمهم } بمعنى { مع }.وسياق الآية يدل على أن المراد بالمغفرة هنا التجاوز عن المشركين في الدنيا بتأخير العقاب لهم إلى أجل أراده الله أو إلى يوم الحساب ، وأن المراد بالعقاب في قوله : { وإن ربك لشديد العقاب } ضد تلك المغفرة وهو العقاب المؤجل في الدنيا أو عقاب يوم الحساب ، فمحمل الظلم على ما هو المشهور في اصطلاح القرآن من إطلاقه على الشرك .ويجوز أن يحمل الظلم على ارتكاب الذنوب بقرينة السياق كإطلاقه في قوله تعالى : { فبظلم من الذين هادوا حرمنا عليهم طيبات أحلت لهم } \\[ سورة النساء : 160 \\] فلا تعارض أصلاً بين هذا المحمل وبين قوله : { إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء } \\[ النساء : 48 \\] كما هو ظاهر .وفائدة هذه العلاوة إظهار شدة رحمة الله بعباده في الدنيا كما قال : { ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة ولكن يؤخرهم إلى أجل مسمى } \\[ فاطر : 45 \\].وجملة وإن ربك لشديد العقاب } احتراس لئلا يحسبوا أن المغفرة المذكورة مغفرة دائمة تعريضاً بأن العقاب حال بهم من بعد .\n\n",
      "translations": [
        {
          "translation": "(And they bid thee) Muhammad (hasten on the evil) to bring chastisement on them, out of derision (rather than the good) rather than ask you for their welfare, i.e. they do not ask you for your welfare, (when exemplary punishments) of those who have perished (have indeed occurred before them. But lo! thy Lord is rich in pardon for mankind) the people of Mecca (despite their wrong) despite their idolatry, that is if they repent and believe, (and lo! thy Lord is strong in punishment!) for those who do not repent of idolatry.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَدْ خَلَتْ مِن قَبْلِهِمُ ٱلْمَثُلاَتُ } معناه مَضَتْ مِن قَبْلِهِمْ الأَمْثَالُ\n ويقالُ الأَنباءُ: الأَمثَالُ\n ويقالُ المَثُلاتُ: النَّقَماتُ فِي الأَمَمِ التي عَصَتْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And the examples of those who have passed away before them have already passed away,\" means that the examples of those who have passed away before them have already passed away.\n The similes are said to be the news.\n The similes are said: The punishments in the nations that disobeyed.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ويستعجلونك بالسيئة قبل الحسنة } بمناسبة استعدادهم للشرّ لاستيلاء الهيئات المظلمة والرذائل عليها فينزعون إلى الشرّ لغلبة الشرّ عليهم\n { وقد خَلَتْ من قَبْلهم } عقوبات أمثالهم { وإنّ ربّك لذو مغفرة للناس } مع ظلمهم على أنفسهم باكتساب تلك الهيئات الغاسقة الحاجبة عن النور لمن لم ترسخ فيه ولم تبطل استعداده فيزيلها بنور رحمته { وإنّ ربّك لشديد العقاب } لمن ترسخت فيه وصارت ريناً وأبطلت الاستعداد\n  { ويقول الذينَ كَفَروا لولا أنزل عليه آية من ربّه } حجبوا\n فلم يروا الآيات الشاهدة على النبوّة من اتصافه بصفات الله لعدم إدراكهم وعمى بصائرهم\n فلذلك لم يعدوها آيات واقترحوها على حسب هواهم ما عليك إلا إنذارهم لا هدايتهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من قبح صنيعهمه ونهاية غفلتهم عن الله انتقامه وغيرته { يَسْتَعْجِلُونَكَ بِٱلسَّيِّئَةِ } المهددة بها والموعودة عليها\n أي: يطلبون منك يا أكمل الرسل استعجال إتيانها استهزاءً واستنكاراً { قَبْلَ ٱلْحَسَنَةِ } الموعودة لهم على تقدير إيمانهم { وَ } الحال أنه { قَدْ خَلَتْ } ومضت { مِن قَبْلِهِمُ } على أمثالهم من الأمم الهالكة { ٱلْمَثُلاَتُ } أي: القصاصات والعقوبات التي صاتر أمثالاً يضرب بها\n وحالهم يحفي مؤنة استعجالهم واستهزائهم لو تأملوا { وَ } هم من غاية إصرارهم وكفرهم وإن استحقوا ما يستعجلونه على أقبح الوجوه\n لكن أمهلهم الله الحكيم العليم زماناً بمقتضى جوده { إِنَّ رَبَّكَ } الحليم الرحيم { لَذُو مَغْفِرَةٍ } سترٍ وعفو { لِّلنَّاسِ } المنهمكين في الغفلة والنسيان { عَلَىٰ ظُلْمِهِمْ } أي: مع ظمهم على أنفسهم باستجلاب عذاب الله إياها { وَإِنَّ رَبَّكَ } أيضاً على مقتضى عدله وقهره { لَشَدِيدُ ٱلْعِقَابِ } [الرعد: 6] وسريع الحساب على من خرج من ربقة إطاعته استكباراً واستنكافاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: \" المَثُلات \": جمع مَثُلَة، كَسَمُرة، وهي العقوبة العظيمة، التي تجعل الإنسان مثلاً لمن بعده. وفيها لغات وقراءات شاذة. وعلى ظلمهم: حال، والعامل فيه: المغفرة. يقول الحق جل جلاله: { ويستعجلونك بالسيئة قبل الحسنة } أي: بالنقمة قبل العافية، طلبوا نزول العذاب الذي أوعدهم به استهزاء، { وقد خَلَتْ }: مَضَتْ { من قََبلِهم المَثُلات }: عقوبات أمثالهم من المكذبين، أو المصيبات الدواهي، حتى صاروا مثلاً لمن بعدهم. فما لهم لم يعتبروا، ولم يخافوا حلول مثلها عليهم؟ { وإنَّ ربك لذو مغفرة للناس على ظلمهم } أي: مع ظلمهم أَنْفُسَهم بالكفر والمعاصي، فسترهم وأمهلهم في الدنيا. فالمغفرة هنا لغوية، وقيل: يغفر لهم بالتوبة. وقيل: بلا قيد التوبة، بل بمجرد الحلم. قال البيضاوي: وفيه جواز العفو قبل التوبة، فإن التائب ليس على ظلمه، ومن منع ذلك خص الظلم بالصغائر المكفرة باجتناب الكبائر. هـ. { وإنَّ ربك لشديدُ العقاب } لمن يريد تعذيبه، أو للكفار. وعن النبي صلى الله عليه وسلم أنه قال:\n \" لَوْلاَ عَفْوُ اللَّهِ وَتَجَاوُزُه مَا هنَأ أَحَد العَيْش، وَلَوْلاَ وَعِيدُهُ وعِقَابُه لاتَّكَلَ كُلُّ أحَد \" \nقاله البيضاوي. الإشارة: ترى بعض المستهزئين بالأولياء يؤذيهم بلسانه، أو بغيره، ويقول: إن كان بيده ما يفعل يفعله بي، والله تعالى يقول:\n \" مَنْ آذَى لِي ولياً فقد آذَنْتُهُ بالحَرْب \" \nولكن الحق تعالى يُمهل ولا يُهمل { وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب }. ثم طلبوا المعجزة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:102",
      "similarity": 0.4508795880321274
    },
    {
      "verse": "46:18",
      "similarity": 0.4371529205100787
    },
    {
      "verse": "27:46",
      "similarity": 0.4346011368902565
    },
    {
      "verse": "24:34",
      "similarity": 0.422599087048425
    },
    {
      "verse": "84:4",
      "similarity": 0.4120196992216225
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/013006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/013006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/13:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}