{
  "chapter": "الرعد",
  "text": "ويقول الذين كفروا۟ لولا انزل عليه ءاية من ربه انما انت منذر ولكل قوم هاد",
  "translations": [
    {
      "translation": "Those who are kafir say, 'If only a Sign could be sent down to him from his Lord!' You are only a warner. Every people has a guide.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: \"Why no miracle was sent down to him by his Lord?\" But you are only a bearer of warnings, and a guide for every nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who refused to believe in you say: \"Why has no (miraculous) sign been sent down upon him from his Lord?\" You are only a warner, and every people has its guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, \"Why has God not sent him, (Muhammad), some miracles.\" (Muhammad), you are only a warner. For every nation there is a guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers say, “Why is not a sign sent down upon him from his Lord?” You are purely a Herald of Warning, and a guide for all nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers say: \"Why is not a sign sent down to him from his Lord\" You are only a warner, and to every people there is a guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: Why has not a sign been sent down upon him from his Lord? You are only a warner and (there is) a guide for every people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, 'Why has a sign not been sent down upon him from his Lord?' Thou art only a warner, and a guide to every people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: If only some portent were sent down upon him from his Lord! Thou art a warner only, and for every folk a guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth ask, \"Why has no sign been sent down to him by His Lord?\" But you are only a warner; every people has its guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: wherefore is not a sign sent down unto him from his Lord! Thou art but a warner; and unto every people there is a guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say, ‘Why has not some sign been sent down to him from his Lord?’ You are only a warner, and there is a guide for every people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Unbelievers say: \"Why is not a sign sent down to him from his Lord?\" But thou art truly a warner, and to every people a guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers say: \"Why is not a sign sent down to him from his Lord?\" You are only a warner, and to every people there is a guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: 'Why has no sign been sent down to him from his Lord' You are only a warner, and there is a guide for every nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say, “Why was a miracle not sent down to him from his Lord?” You are only a warner, and to every community is a guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved say, \"Why has a sign not been sent down to him from his Lord?\" You are only a warner, and for every people is a guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:7] And those who disbelieve say, ‘Why has not some sign been sent down upon him, upon Muhammad (s), from his Lord!’, the like of the staff and the [glowing] hand, or the she-camel. God, exalted be He, says: You are only a warner, one to threaten the disbelievers, for it is not your duty to bring forth signs; and for every folk there is a guide, a prophet, to guide them to their Lord with the signs that He gives him, and not what with they request.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who disbelieve) in Muhammad (pbuh) and in the Qur'an (say: If only some portent sign were sent down upon him) why is not some sign sent to him (from his Lord!) to prove his prophethood as it was sent to earlier messengers (Thou art) Muhammad (a warner only) a warning messenger, (and for every folk a guide) a prophet; it is also said that this means: a caller who calls them to leave error and follow guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة شيكمتهم وغيظهم معك يا أكمل الرسل { يَقُولُ ٱلَّذِينَ كَفَرُواْ } بك وبدينك وبكتابك { لَوْلاۤ } أي: هلا { أُنزِلَ عَلَيْهِ آيَةٌ } اقترحناه بها { مِّن رَّبِّهِ } إن كان نبياً مثل الأنبياء الماضين، لا تبال يا أكمل الرسل بهم وبكفرهم وقولهم هذا { إِنَّمَآ أَنتَ مُنذِرٌ } مخبر بما جئت به من عند ربك، لا مهد مصلح، وإنما عليك البلاغ { وَلِكُلِّ قَوْمٍ هَادٍ } [الرعد: 7] وهو الله سبحانه، وإن تعلق إرادته بهدايتهم يهديهم؛ إذ هو عالم بسرائرهم وضمائرهم، وما جرى عليهم وما يؤول أمرهم إليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nوقلت وسارب: عطف على جملة من هو أي: ومن هو سارب، ليكمل التقسيم أربعة: من أسر، ومن جهر به، ومن استخفى، ومن سرب أي: برز\n انظر ابن جزي\n والمتعال: منقوص، يجوز في الوقف عليه حذف الياء وإثباتها، وكذلك: هادٍ، وواقٍ، وشبهه، غير أن الراجح في المعرّف بأل الإثبات، وفي المُنَوّنِ: الحذف\n قال ابن مالك:\n\nوأثبتها ابن كثير في الجميع، ووافقه يعقوبُ في المُعرّف بأل، وَحَذَفَها غيرهُ مطلقاً\n يقول الحق جل جلاله: { ويقول الذين كفروا } من أهل مكة: { لولا }: هلا { أنزل عليه آيةٌ } أي: معجزة واضحة { من ربه } كما أوتي موسى وعيسى\n ولم يعتدوا بالآيات المنزلة عليه كانشقاق القمر وانقياد الشجر، وتسليم الحجر، وأعظمها: القرآن العظيم\n وذلك عناد منهم\n قال تعالى: { إنما أنت مُنِذرٌ } مُرْسَل إليهم لتنذرهم كغيرك من الرسل وما عليك إلا الإتيان بما تصح به نبوتك من جنس المعجزات، لا مما يُقترح عليك\n { ولكل قوم هادٍ } رسول يهديهم إلى الحق والصواب، مخصوص بمعجزات من جنس ما هو الغالب عليهم ففي زمن موسى عليه السلام كان الغالب عليهم السحر، فأوتي بالعصا تنقلب حية ليبطل سحرهم، وفي زمن عيسى عليه السلام كان الغالب عليهم الطب، فأوتي إبراء الأكمه والأبرص، وإحياء الموتى الذي يعجزون عن مثله، وفي زمن نبينا محمد صلى الله عليه وسلم كان الغالب عليهم البلاغة والفصاحة، بما كانوا يتباهون ويتناضلون، فأوتي القرآنَ العظيم، أعجز ببلاغته البلغاء والفصحاء\n أو: لكل قوم هاد، يقدر على هدايتهم، وهو الله تعالى، أي: إنما عليك الإنذار، والله هو الهادي لمن يشاء، أو: ولكل قوم واعظ ومذكر من نَبِيِّ أو وَليّ\n رُوي أنها لما نزلت قال رسول الله صلى الله عليه وسلم\n\n \" أنا المُنْذِرُ وَأنْتَ يا عَلِيُّ الهَادي \"\n \n\nثم أردف ذلك ما يدل على كمال علمه وقدرته، وشمول قضائه وقدره تنبيهاً على أنه تعالى قادر على إنزال ما اقترحوه، وإنما لم يُنزله لعلمه بأن اقتراحهم كان عناداً لا استرشاداً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:50",
      "similarity": 0.7652179361661174
    },
    {
      "verse": "6:37",
      "similarity": 0.4950516578333463
    },
    {
      "verse": "10:20",
      "similarity": 0.47394417268341915
    },
    {
      "verse": "13:27",
      "similarity": 0.42682837084548153
    },
    {
      "verse": "71:2",
      "similarity": 0.39382042920095656
    }
  ]
}