{
  "chapter": "الرعد",
  "text": "الله يعلم ما تحمل كل انثى وما تغيض الارحام وما تزداد وكل شىء عنده بمقدار",
  "translations": [
    {
      "translation": "God is cognisant of what every female carries in her womb, or what the wombs want or exceed (of their disburdening time). With Him all things are in determined measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows what every female bears; and what the wombs fall short of (in gestation), and what they may add. With Him everything is in a fixed measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows well what every female conceives. He knows what the wombs spoil and dispose of. In His plans everything has been designed proportionately.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows all what is inside the womb of every female, and every increase and decrease of the wombs; and all things are with Him by a set measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows what every female bears, and by how much the wombs fall short (of their time or number) or exceed. Everything with Him is in (due) proportion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows what every female bears, and that of which the wombs fall short of completion and that in which they increase; and there is a measure with Him of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows what every female bears, and the wombs' shrinking and swelling; everything with Him has its measure --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knoweth that which every female beareth and that which the wombs absorb and that which they grow. And everything with Him is measured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows what every female bears. He knows of every change within the womb. For everything He has a proper measure;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knoweth that which each female beareth and that which the wombs want and that which they exceed, and with Him everything is in due measure:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows what every female carries [in her womb], and what the wombs reduce and what they increase, and everything is by [precise] measure with Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah doth know what every female (womb) doth bear, by how much the wombs fall short (of their time or number) or do exceed. Every single thing is before His sight, in (due) proportion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows what every female bears, and by how much the wombs fall short (of their time or number) or exceed. Everything with Him is in (due) proportion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows what every female bears, and what shrinks and swells the womb. And everything with Him has its measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows what every female bears, and every increase and decrease of the wombs. With Him, everything is by measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows what every female carries and what the wombs lose [prematurely] or exceed. And everything with Him is by due measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[13:8] God knows what every female bears, of male or female, one or more, and otherwise, and what the wombs reduce, of the time of gestation, and what they increase, of it. And everything with Him is according to a [precise] measure, a [precise] amount and limit which it does not exceed;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah knoweth that which every female beareth) whether it is a male or a female (and that which the wombs absorb) and the female whose pregnancy is less than nine months (and that which they grow) and the female whose pregnancy is more than nine months. (And everything) the increase, decrease, the delivery of the child and its stay in its mother's womb (with Him is measured).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا تَغِيضُ ٱلأَرْحَامُ وَمَا تَزْدَادُ } فالغَيضُ: نُقصانُ الوَلدِ، ما زَادتْ عَلَى تِسعَةِ أَشهرٍ؛ فَهو تَامٌ لِذَلِكَ النُّقْصَانُ، وهي الزِّيادَةُ! ويقالُ: ما تَغِيضُ الأَرْحامُ معناهُ مَا تُخرِجُ مِن الأَولادِ\n وَما كَانَ فِيها وَمَا تَزدَادُ معناهُ مَا يَحدُثُ فِيها\n\n\n\n\nوقوله تعالى: { وَكُلُّ شَيْءٍ عِندَهُ بِمِقْدَارٍ } معناهُ بِقَدرٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nتلك أسرار خفية لا يعلمها إلا { الله } الذي { يعلم ما تَحْمل كل أُنْثى } فيعلم ما تحمل أنثى النفس من ولد الكمال، أي ما في قوة كل استعداد وما تزيد أرحام الاستعداد بالتزكية والتصفية وبركة الصحبة من الكمالات وما تنقص منها بالانهماك في الشهوات { وكل شيء } من الكمالات { عنده بِمِقدار } معين على حسب القابلية أو كل شيء من قوة قبول في استعداد مقدّر عنده بمقدار في الأزل من فيضه الأقدس لا يزيد ولا ينقص، أو لكل قوم هاد هو الله تعالى كما قال:\n\n[القصص، الآية: 56] لعلمه بما في الاستعدادات من قوة القبول وزيادتها ونقصانها فيقدّر بحسبها كمالاتهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱللَّهُ يَعْلَمُ } بعلمه الحضوري { مَا تَحْمِلُ كُلُّ أُنثَىٰ } من النطفة المصبوبة { وَمَا تَغِيضُ ٱلأَرْحَامُ } أي: تنقصها منها وفقاً لفضلائها { وَمَا تَزْدَادُ } عليها لتنميتها وتصويرها { وَكُلُّ شَيْءٍ عِندَهُ بِمِقْدَارٍ } [الرعد: 8] أي: حصول كل كائن عنده إنما هو بمقدار مخصوص من مادة معينة ومدة مقررة، لا ينقص منها ولا يزيد عليها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو ان وقت الإنزال لم يحضر، فقال: { الله يعلمُ ما تحملُ كلُّ أنثى } هل هو ذكر أو أنثى، أو تام أو ناقص، أو حسن أو قبيح\n وهو من الخمس التي اختص بها\n { وما تَغِيضُ الأرحامُ وما تزداد } أي: ما تنقص في الجثة بمرض الجنين او إسقاطه، وما تزداد بنمو الجنين إلى أمده أو أكثر\n قال البيضاوي: مدة الحمل عندنا اربع سنين، وخمس عند مالك، وسنتان عند أبي حنيفة\n رُوي أن الضحاك وُلد لسنتين، وهرم بن حيان لأربع سنين\n\n\nوأعلى عدده لا حد له\n ـ قلت: يعني مع تحققه ـ وقيل: المراد نقصان دم الحيض وزيادته\n هـ\n { وكل شيء عنده بمقدار }: بقدر محدود، ووقت مخصوص، لا يجاوزه، ولا ينقص عنه، فالحق ـ تعالى ـ خص كل حادث بوقت مخصوص معين، وهيأ له أسباباً تسوقه إليه على ما تقتضيه حكمته",
      "translations": []
    }
  ]
}