{
  "chapter": "ابراهيم",
  "text": "وما لنا الا نتوكل على الله وقد هدىنا سبلنا ولنصبرن على ما ءاذيتمونا وعلى الله فليتوكل المتوكلون",
  "translations": [
    {
      "translation": "And why indeed should we not put our trust in Allah when He has guided us to our ways? We will be steadfast however much you harm us. Those who trust put their trust in Allah.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not repose our trust in God when He has shown us our paths of duty to Him? We shall bear with fortitude the hardships you inflict upon us. The trusting place their trust in God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not put our trust in Allah when it is indeed He Who has guided us to the ways of our life? We shall surely continue to remain steadfast in face of your persecution. All those who have to put trust, should put their trust only in Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should we not trust in God when He has shown us the right way? We shall exercise patience against the troubles with which you afflict us. Whoever needs a trustee should trust in God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And what is the matter with us that we should not rely on Allah? He has in fact shown us our ways; and we will surely be patient upon the troubles you cause us; and those who trust must rely only upon Allah.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not put our trust in Allah while He indeed has guided us in our ways And we shall certainly bear with patience all the hurt you may cause us, and in Allah (alone) let those who trust, put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what reason have we that we should not rely on Allah? And He has indeed guided us in our ways; and certainly we would bear with patience your persecution of us; and on Allah should the reliant rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not put our trust in God, seeing that He has guided us in our ways? We will surely endure patiently, whatever you hurt us; and in God let all put their trust who put their trust.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How should we not put our trust in Allah when He hath shown us our ways? We surely will endure the hurt ye do us. In Allah let the trusting put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and why should we not put our trust in God when He has already guided us to our paths? We will, surely, bear with patience all the harm you do us. So in God let those who trust put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wherefore should we not rely on Allah when He hath surely guided us our ways! And surely we shall bear patiently that with which ye afflict us and in Allah then let the trustful put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not put our trust in Allah, seeing that He has guided us in our ways? Surely, we will put up patiently with whatever torment you may inflict upon us, and in Allah let all the trusting put their trust.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No reason have we why we should not put our trust on Allah. Indeed He Has guided us to the Ways we (follow). We shall certainly bear with patience all the hurt you may cause us. For those who put their trust should put their trust on Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not put our trust in Allah while He indeed has guided us our ways. And we shall certainly bear with patience all the hurt you may cause us, and in Allah (Alone) let those who trust, put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not put our trust in Allah, when He has already guided us to our Paths? We will endure your hurt patiently. In Allah, let all who trust place their trust'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And why should we not trust in God, when He has guided us in our ways? We will persevere in the face of your persecution. And upon God the reliant should rely.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not rely upon Allah while He has guided us to our [good] ways. And we will surely be patient against whatever harm you should cause us. And upon Allah let those who would rely [indeed] rely.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:12] And why, indeed, should we not put our trust in God, in other words, there is nothing to prevent us from [doing] this, when He has guided us our ways? And we shall surely endure the hurt you do us. And in God let the trusting put their trust’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة { وما لنا ألا نتوكل على الله } استدلال على صدق رأيهم في تفويض أمرهم إلى الله ، لأنهم رأوا بوارق عنايته بهم إذ هداهم إلى طرائق النجاة والخير ، ومبادىء الأمور تدل على غاياتها .وأضافوا السبل إلى ضميرهم للاختصار لأن أمور دينهم صارت معروفة لدى الجميع فجمعها قولهم : { سبلنا }.{ وما لنا ألا نتوكل } استفهام إنكاري لانتفاء توكلهم على الله ، أتوا به في صورة الإنكار بناءً على ما هو معروف من استحماق الكفار إيّاهم في توكلهم على الله ، فجاءوا بإنكار نفي التوكل على الله ، ومعنى { وما لنا ألا نتوكل } ما ثبت لنا من عدم التوكل ، فاللام للاستحقاق .وزادوا قومهم تأييساً من التأثر بالأذى فأقسموا على أن صبرهم على أذى قومهم سيستمر ، فصيغة الاستقبال المستفادة من المضارع المؤكد بنون التوكيد في { ولنصبرن } دلت على أذى مستقبل .ودلّت صيغة المضي المنتزع منها المصدر في قوله : { ما آذيتمونا } على أذى مضى . فحصل من ذلك معنى نصبر على أذى متوقع كما صبرنا على أذى مضى . وهذا إيجاز بديع .وجملة { وعلى الله فليتوكل المتوكلون } يحتمل أن تكون من بقية كلام الرسل فتكون تذييلاً وتأكيداً لجملة { وعلى الله فليتوكل المؤمنون } فكانت تذييلاً لما فيها من العموم الزائد في قوله : { المتوكلون } على عموم { فليتوكل المؤمنون }. وكانت تأكيداً لأن المؤمنين من جملة المتوكلين . والمعنى : من كان متوكلاً في أمره على غيره فليتوكل على الله .ويحتمل أن تكون من كلام الله تعالى ، فهي تذييل للقصة وتنويه بشأن المتوكلين على الله ، أي لا ينبني التوكل إلا عليه .\n\n",
      "translations": [
        {
          "translation": "They said to the messengers: \"do yourselves put your trust in Allah so that you can see what He will do with you\". The messengers said: (How should we not put our trust in Allah when He hath shown us our ways) when He favoured us with prophethood and complete surrender to Him? (We surely will endure that hurt ye do us) we will endure your physical harm through obedience of Allah. (In Allah let the trusting put their trust!) let them rely on Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما آيسوا عنهم وعن صلاحهم اشتغلوا إلى تزكية نفوسهم { مَا لَنَآ } أي: أي عذر عرض لنا { أَلاَّ نَتَوَكَّلَ عَلَى ٱللَّهِ } المصلح لأحوالنا\n فلِمَ لَمْ نتخذه وكيلنا وكفيلنا؟ { وَ } الحال أنه سبحانه بمقتضى لطفه وجماله { قَدْ هَدَانَا } وأوضح لنا { سُبُلَنَا } التي نسلك بها نحو توحيده وعرفانه\n وإن ما جرى علينا من المنافع والمضار إنما هو من عنده وبمقتضى مشيئته وإرادته { وَ } الله بعدما تحققنا بمقام التوحيد\n وتمكنا في مقر التجريد والتفريد { لَنَصْبِرَنَّ } على جميع { عَلَىٰ مَآ آذَيْتُمُونَا } بالرد والإنكار وغير ذلك من الاستهزاء وسوء الأدب\n وكيف لا نصبر\n إذ الكل بيده سبحانه وبحيطة حضرة قدرته وإرادته\n إنما وصل إلينا ابتلاء منه سبحاه إيانا واختباراً { وَ } بعدما تحقق وبيَّن أن الكل من عنده { عَلَى ٱللَّهِ } المستقل في جميع التصرفات والأفعال في كل الأمور والأحوال { فَلْيَتَوَكَّلِ ٱلْمُتَوَكِّلُونَ } [إبراهيم: 12] الموحدون\n المفوضون أمورهم كلها إليه\n لذلك بذلوا مهجهم في طريق التوحيد وإعلاء كلمته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ألا ترى قولهم: { وما لنا ألا نتوكل على الله } أي: أيُّ عذر لنا في ترك التوكل على الله؟ { وقد هَدَانَا سُبُلنا } أي: طرقنا التي نعرفه بها\n فنوحده\n ونعلم أن الأمور كلها بيده\n { ولَنصْبِرَنَّ على ما آذيتمونا }: على أذاكم حتى يحكم الله بيننا\n وهو جواب عن قسم محذوف\n أكدوا به توكلهم\n وعدم مبالاتهم بما يجري من الكفار عليهم\n { وعلى الله فليتوكل المتوكلون } أي: فليثبت المتوكلون على ما استحدثوه من توكلهم\n المسبب عن إيمانهم\n قاله البيضاوي تبعاً للزمخشري\n قال ابن جزي: إن قيل: لِمَ كرر الأمر بالتوكل؟ فالجواب عندي: أن قوله: { وعلى الله فليتوكل المتوكلون } راجع إلى ما تقدم من طلب الكفار: { فأتونا بسلطان مبين } أي: حجة ظاهرة\n فتوكل الرسل في ورود ذلك إلى الله\n وأما قوله: { فليتوكل المتوكلون } فهو راجع إلى قولهم: ولنصْبرنَّ على ما آذيتمونا أي: نتوكل على الله في دفع أذاكم\n هـ\n وهو حسن\n لكن التعبير بالمتوكلين يقتضي أن التوكل حاصل\n والمطلوب الدوام عليه\n وقد يقال: إنما عبَّر ثانياً بلفظ المتوكلين كراهية إعادة اللفظ بعينه\n أي: من كان متوكلاً على الله فإنه الحقيق بذلك\n\nوقال في القوت: أي: ليتوكل عليه في كل شيء مَنْ توكل عليه في شيء\n وهذا أحسن وجوهه\n قال في الحاشية: والوجه الآخر: وعليه فليتوكّل\n في توكله مَنْ تَوكَّل عليه من الأشياء لأن الوكيل في كل شيء واحد\n فينبغي أن يكون التوكل في كل شيء واحد\n هـ\n  الإشارة: سر الخصوصية مستور بأوصاف البشرية\n ولا فرق بين خصوصية النبوة\n والولاية\n سترها الحق تعالى غيرةً عليها أن يعرفها من لا يعرف قدرها فلا يطلع عليها إلا من سبقت له من الله العناية\n وهبت عليه ريح الهداية\n وفي الحِكَم: \" سبحان من ستر سر الخصوصية بظهور وصف البشرية\n وظهر بعظمة الربوبية في إظهار العبودية\n وقال أيضاً: \" سبحان من لم يجعل الدليل على أوليائه إلا من حيث الدليل عليه\n ولم يوصل إليهم إلا من أراد أن يوصله إليه \"\n قال في لطائف المنن: فأولياء الله أهل كهف الإيواء\n فقليل من يعرفهم\n ولقد سمعت شيخنا أبا العباس المرسي رضي الله عنه يقول: معرفة الولي أصعب من معرفة الله فإن الله معروف بكماله وجماله\n وحتى متى تعرف مخلوقاً مثلك\n يأكل كما تأكل\n ويشرب كما تشرب؟ قال فيه: وإذا أراد الله أن يعرفك بولي من أوليائه طوى عنك وجود بشريته\n وأشهدك وجود خصوصيته\n هـ\n  قلت: ومعنى \" طوى عنك وجود بشريته \" هو: عدم الوقوف مع أوصافها اللازمة للنقائص\n بل تنفذ منها إلى شهود خصوصيته\n التي هي محل الكمالات\n فأوصاف البشرية الذاتية للبشر لا تزول عن الولي\n ولا عن النبي كالأكل والشرب\n والنوم والنكاح\n والضعف والفقر\n وغير ذلك من نعوت البشر لأنها في حقهم رداء وصون لستر خصوصيتهم صيانةً لها أن تتبدل بالإظهار\n وينادى عليها بلسان الاشتهار\n ولذلك اختفوا عن كثير من الخلق\n وإلى هذا أشار في الحِكَم بقوله: لا يلزم من ثبوت الخصوصية عدم البشرية \"\n  وقال صاحب كتاب أنوار القلوب: لله سبحانه عباد ضنَّ بهم عن العامة\n وأظهرهم الخاصة\n فلا يعرفهم إلا شكل\n أو محب لهم\n ولله عباد ضنَّ بهم عن الخاصة والعامة\n ولله عباد يُظهرهم في البداية ويسترهم في النهاية\n ولله عباد يسترهم في البداية ويُظهرهم في النهاية\n ولله عباد لا يظهر حقيقة ما بينه وبينهم إلى الحفظة فمن سواهم\n حتى يلقوه بما أودعهم منه في قلوبهم\n وهم شهداء المكلوت الأعلى\n والصفْح الأيمنِ مِنَ العرش الذين يتولى الله قبض أرواحهم بيده\n فتطيب اجسادهم به\n فلا يعدوا عليها الثرى\n حتى يُبعثوا بها مشرقةً بنور البقاء الأبد مع الباقي الأحد عز وجل\n هـ\n وقال أبو يزيد رضي الله عنه: أولياء الله تعالى عرائس\n ولا يرى العرائس إلا من كان مَحرماً لهم\n وأما غيرهم فلا\n وهم مخبأون عنده في حجاب الأنس\n لا يراهم أحد في الدنيا ولا في الآخرة\n هـ\n وجميع ما أجاب به الأنبياءُ قومَهم يجيب به الأولياءُ من أنكر عليهم\n من قوله: { إِنْ أَنتُمْ إِلاَّ بَشَرٌ مِّثْلُنَا تُرِيدُونَ أَن تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ آبَآؤُنَا } \n من التعلق بالأسباب والانهماك في الحظوظ\n ومتابعة الهوى\n وحب الدنيا\n ومن قولهم: { فَأْتُونَا بِسُلْطَانٍ مُّبِينٍ } إلى تمام ما أجابوا به\n والله تعالى أعلم\n ثمَّ ذكر تخويف الكفار للرسل باخراجهم من الديار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:34",
      "similarity": 0.5354122895250695
    },
    {
      "verse": "4:16",
      "similarity": 0.5003868614020058
    },
    {
      "verse": "9:61",
      "similarity": 0.4885768602601259
    },
    {
      "verse": "16:42",
      "similarity": 0.44934621899475163
    },
    {
      "verse": "29:59",
      "similarity": 0.44934621899475163
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/014012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/014012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/14:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}