{
  "chapter": "ابراهيم",
  "text": "قالت رسلهم افى الله شك فاطر السموت والارض يدعوكم ليغفر لكم من ذنوبكم ويؤخركم الى اجل مسمى قالوا۟ ان انتم الا بشر مثلنا تريدون ان تصدونا عما كان يعبد ءاباؤنا فاتونا بسلطن مبين",
  "translations": [
    {
      "translation": "Their Messengers said, 'Is there any doubt about Allah, the Bringer into Being of the heavens and the earth? He summons you to forgive you for your wrong actions and to defer you until a specified time.' They said, 'You are nothing but human beings like ourselves who want to debar us from what our fathers worshipped; so bring us a clear authority.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said their apostles: \"Can there be doubt about God, the originator of the heavens and the earth? He calls you to forgive some of your sins, and give you respite for a time ordained.\" They said: \"You are only men like us, and yet you wish to turn us away from what our fathers worshipped. Bring to us then a clear proof.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers said: \"Can there be any doubt about Allah, the Creator of the heavens and the earth? He invites you that He may forgive you your sins and grant you respite till an appointed term.\" They replied: \"You are only a human being like ourselves. You seek to prevent us from serving those whom our forefathers have been serving all along. If that is so, produce a clear authority for it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messengers asked them, \"Could there be any doubt about the existence of God who has created the heavens and the earth? He calls you to Himself to forgive your sins. He gives you respite only until the appointed time.\" They said, \"You are mere mortals like us. What you want is to prevent us from worshipping that which our fathers worshipped. Show us clear proof (if what you say is true).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Noble Messengers said, “What! You doubt concerning Allah, the Creator of the heavens and the earth? He calls you that He may forgive some of your sins and until the time of death give you a life free from punishment”; they said, “You are just human beings like us; you wish to prevent us from what our forefathers used to worship – therefore now bring some clear proof to us.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers said: \"(What!) Can there be a doubt about Allah, the Creator of the heavens and the earth He calls you that He may forgive you of your sins and give you respite for a term appointed.\" They said: \"You are no more than human beings like us! You wish to turn us away from what our fathers used to worship. Then bring us a clear authority.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their apostles said: Is there doubt about Allah, the Maker of the heavens and the earth? He invites you to forgive you your faults and to respite you till an appointed term. They said: You are nothing but mortals like us; you wish to turn us away from what our fathers used to worship; bring us therefore some clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers said, 'Is there any doubt regarding God, the Originator of the heavens and the earth, who calls you so that He may forgive you your sins, and defer you to a term stated?' They said, 'You are nothing but mortals, like us; you desire to bar us from that our fathers served; then bring us a manifest authority.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers said: Can there be doubt concerning Allah, the Creator of the heavens and the earth? He calleth you that He may forgive you your sins and reprieve you unto an appointed term. They said: Ye are but mortals like us, who would fain turn us away from what our fathers used to worship. Then bring some clear warrant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers said, \"Is there any doubt about God, the Originator of the heavens and earth? He calls you to Him in order to forgive you some of your offences and to reprieve you for a specific period.\" They said, \"You are only human beings like ourselves! You want to divert us from what our forefathers have been worshipping, so bring us some clear authority.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their apostles said: is there doubt about Allah, the Maker of the heavens and the earth? He calleth you that he may forgive you of your sins and retain you till a term fixed. They said: ye are but like us; ye mean to turn us aside from that which our fathers have been worshipping; so bring us a warranty manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their apostles said, ‘Is there any doubt about Allah, the originator of the heavens and the earth?! He calls you to forgive you a part of your sins, and grants you respite until a specified time.’ They said, ‘You are nothing but humans like us who desire to bar us from what our fathers used to worship. So bring us a manifest authority.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers said: \"Is there a doubt about Allah, The Creator of the heavens and the earth? It is He Who invites you, in order that He may forgive you your sins and give you respite for a term appointed!\" They said: \"Ah! ye are no more than human, like ourselves! Ye wish to turn us away from the (gods) our fathers used to worship: then bring us some clear authority.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers said: \"What! Can there be a doubt about Allah, the Creator of the heavens and the earth? He calls you (to Monotheism and to be obedient to Allah) that He may forgive you of your sins and give you respite for a term appointed.\" They said: \"You are no more than human beings like us! You wish to turn us away from what our fathers used to worship. Then bring us a clear authority i.e. a clear proof of what you say).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers said: 'Is there any doubt about Allah, the Originator of the heavens and the earth? He calls you to Him in order that He forgives you your sins and defers you till a stated term' They said: 'You are only mortals like us. You wish to bar us from that which our fathers worshipped. Give us some clear proof.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers said, “Is there any doubt about God, Maker of the heavens and the earth? He calls you to forgive you your sins, and to defer you until a stated term.” They said, “You are only humans like us; you want to turn us away from what our ancestors worshiped; so bring us a clear proof.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers said, \"Can there be doubt about Allah, Creator of the heavens and earth? He invites you that He may forgive you of your sins, and He delays your death for a specified term.\" They said, \"You are not but men like us who wish to avert us from what our fathers were worshipping. So bring us a clear authority.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:10] Their messengers said, ‘Can there be doubt concerning God (an interrogative meant as a denial), in other words, there can be no doubt concerning His Oneness, given the manifest proofs of it, the Originator, the Creator, of the heavens and the earth? He calls you, to obedience of Him, so that He might forgive you your sins (min dhunūbikum: min is extra, since through submission [to the One God] all that may have been committed previously is forgiven (or else it [min, ‘some of’] is partitive, intended to state that [forgiveness] which is due to [God’s] servants) and defer you, without chastisement, to an appointed term’, the term of death. They said, ‘You are but mortals like us, desiring to bar us from that which our fathers used to worship, in the way of idols. So bring us a clear warrant’, a manifest argument demonstrating your truthfulness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Their messengers said: Can there be doubt concerning Allah) can there be any doubt regarding the divine Oneness of Allah, (the Creator of the heavens and the earth? He calleth you) to repent and profess monotheism (that He may forgive you your sins) which you committed in the time of ignorance (and reprieve you) without any punishment (unto an appointed term) to an ordained time, i.e. to the time of death. (They said) to the messengers: (Ye are but mortals) human beings (like us, who would fain turn us away from what our fathers used to worship) of idols. (Then bring some clear warrant) an edict or proof.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أفي الله شكّ } مع وضوحه، أي: كيف تشكون فميا ندعوكم إليه وهو الذي لا مجال للشك فيه لغاية ظهوره وإنما يوضح ما يوضح به\n { يدْعُوكم ليغفر لكم من ذنوبكم } ليستر بنوره ظلمات حجب صفاتكم فلا تشكّون فيه عند جلية اليقين { ويؤخركم إلى } غاية يقتضيها استعدادكم من السعادة إذ كل شخص عين له بحسب استعداده الأول كمال هو أجله المعنوي كما أن لكل أحد بحسب مزاجه الأول غاية من العمر هي أجله الطبيعي، وكما أن الآجال الاخترامية تقطع العمر دون الوصول إلى الغاية المسمّاة بسبب من الأسباب فكذلك الآفات والموانع التي هي حجب الاستعداد تحول دون الوصول إلى الكمال المعين\n { وبرَزوا لله جميعاً } للخلائق ثلاث برزات، برزة عند القيامة الصغرى بموت الجسد وبروز كل أحد من حجاب جسده إلى عرصة الحساب والجزاء، وبرزة عند القيامة الوسطى بالموت الإرادي عن حجاب صفات النفس والبروز إلى عرصة القلب بالرجوع إلى الفطرة، وبرز عند القيامة الكبرى بالفناء المحض عن حجاب الأنية إلى فضاء الوحدة الحقيقية وهذا هو البروز المشار إليه بقوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَتْ } لهم { رُسُلُهُمْ } على سبيل التوبيخ والتقريع: { أَفِي ٱللَّهِ } الظاهر المتجلي في الآفاق بالاستقلال والاستحقاق { شَكٌّ } وتردد مع كونه { فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: موجدهما ومظهرهما من كتم العدم بلا سبق مادة ومدة، إنما { يَدْعُوكُمْ } إلى توحيده بإرسال الرسل وإنزال الكتب { لِيَغْفِرَ لَكُمْ } بعضاً { مِّن ذُنُوبِكُمْ } وهو ما بينكم وبينه سبحانه؛ إذ حق الغير لم يسقط ما لم يعف صاحب الحق عنه { وَ } بعد دعوتكم { يُؤَخِّرَكُمْ إِلَىۤ أَجَلٍ مُّسَـمًّـى } هو يوم الجزاء؛ ليهيئ كل منكم زاد يومه هذا على الوجه المأمور المبين في الكتب المنزلة على الرسل، وبعدما سمعوا من الرسل ما سمعوا { قَالُوۤاْ } مستنكرين عليه، مستهزئين لهم: { إِنْ أَنتُمْ } أي: ما أنتم { إِلاَّ بَشَرٌ مِّثْلُنَا } تأكلون وتشربون وتفعلون جميع ما نفعل { تُرِيدُونَ } بأمثال هذه الحيل والتزويرات الباطلة { أَن تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ آبَآؤُنَا } وأسلافنا من الآلهة والأصنام، وإن صدقتم في دعواكم { فَأْتُونَا بِسُلْطَانٍ مُّبِينٍ } [إبراهيم: 10] أي: بحجة واضحة لائحة نقترحها منكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: وقال الذين كفروا لرسلهم: { إنْ أنتم إلا بشرٌ مثلُنا } لا فضل لكم علينا، فَلِمَ تختصون بالنبوة دوننا، ولو شاء الله أن يبعث رسلاً إلى البشر لأرسلهم من جنس أفضل، كالملائكة، أو: ما أنتم إلا بشر، والبشر لا يكون رسولاً\n قال ابن جزي: يحتمل أن يكون استبعاداً لتفضيل بعض البشر على بعض بالنبوة، أو يكون إحالة لنبوة البشر، والأول أظهر لطلبهم البرهان بقولهم: { فأتونا بسلطان مبينٍ } ، ولقول الرسل: { ولكن الله يَمُنُّ على من يشاءُ من عباده }\n هـ\n ثم قالوا للرسل: { تُريدون أن تَصدُّونَا عما كان يعبدُ آباؤُنا } من الأصنام بهذه الدعوى، { فأتونا بسلطانٍ مبين }: ببرهان بيِّن يدل على فضلكم، واستحقاقكم لهذه المرتبة التي هي مرتبة النبوة، كأنهم لم يعتبروا ما جاؤوا به من البينات والحجج، فاقترحوا عليهم آية أخرى، تعنتاً ولجاجاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:21",
      "similarity": 0.47304550475561313
    },
    {
      "verse": "11:62",
      "similarity": 0.385429341295307
    },
    {
      "verse": "10:104",
      "similarity": 0.3548479755146706
    },
    {
      "verse": "38:8",
      "similarity": 0.35233742186362277
    },
    {
      "verse": "42:14",
      "similarity": 0.3483878306949437
    }
  ]
}