{
  "chapter": "ابراهيم",
  "text": "وقال الذين كفروا۟ لرسلهم لنخرجنكم من ارضنا او لتعودن فى ملتنا فاوحى اليهم ربهم لنهلكن الظلمين",
  "translations": [
    {
      "translation": "Those who were kafir said to their Messengers, 'We will drive you from our land unless you return to our religion.' Their Lord revealed to them, 'We will destroy those who do wrong.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers said to their apostles: \"We shall drive you out of our land, or else you come back to our fold.\" Their Lord then communicated to them: \"We shall annihilate these wicked people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the unbelievers told their Messengers: \"You will have to return to the fold of our faith or else we shall banish you from our land.\" Thereupon their Lord revealed to them: \"We will most certainly destroy these wrong-doers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers told the Messengers, \"We shall expel you from our land unless you revert to our religion.\" Their Lord then sent them (the messengers) a revelation, \"We have decided to destroy the unjust\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said to their Noble Messengers, “We will surely expel you from our land, unless you accept our religion”; so their Lord sent them the divine revelation that, “Indeed We will destroy these unjust people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved, said to their Messengers: \"Surely, we shall drive you out of our land, or you shall return to our religion.\" So their Lord revealed to them: \"Truly, We shall destroy the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved said to their apostles: We will most certainly drive you forth from our land, or else you shall come back into our religion. So their Lord revealed to them: Most certainly We will destroy the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers said to their Messengers, 'We will assuredly expel you from our land, or you will surely return into our creed.' Then did their Lord reveal unto them: 'We will surely destroy the evildoers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved said unto their messengers: Verily we will drive you out from our land, unless ye return to our religion. Then their Lord inspired them, (saying): Verily we shall destroy the wrong-doers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth said to their messengers, \"We shall banish you from our land unless you return to our ways.\" But their Lord inspired the messengers, saying, \"We shall destroy the evil-doers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved said to their apostles: we will surely drive you forth from our land, or else ye will have to return to our faith. Then their Lord Revealed unto them: We will surely destroy the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the faithless said to their apostles, ‘Surely we will expel you from our land, or you shall revert to our creed.’ Thereat their Lord revealed to them: ‘We will surely destroy the wrongdoers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Unbelievers said to their messengers: \"Be sure we shall drive you out of our land, or ye shall return to our religion.\" But their Lord inspired (this Message) to them: \"Verily We shall cause the wrong-doers to perish!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved, said to their Messengers: \"Surely, we shall drive you out of our land, or you shall return to our religion.\" So their Lord inspired them: \"Truly, We shall destroy the Zalimun (polytheists, disbelievers and wrong-doers.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved said to their Messengers: 'Return to our faith or we will banish you from our land' But Allah revealed to them: 'We shall destroy the harmdoers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved said to their messengers, “We will expel you from our land, unless you return to our religion.” And their Lord inspired them: “We will destroy the wrongdoers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved said to their messengers, \"We will surely drive you out of our land, or you must return to our religion.\" So their Lord inspired to them, \"We will surely destroy the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:13] And those who disbelieved said to their messengers, ‘We will assuredly expel you from our land, or you will surely return, you will [surely] end up [returning], to our creed’, our religion. Then their Lord inspired them [saying]: ‘We shall surely destroy the evildoers, the disbelievers,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who disbelieved said unto their messengers: Verily we will drive you out from our land) from our township, (unless ye return to our religion. Then their Lord inspired them) i.e. the messengers, ((saying):) be steadfast! (Verily We shall destroy the wrong-doers) the disbelievers,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: أدى أمر استكبارهم واستنكارهم وتكذيبهم إلى أن { قَالَ ٱلَّذِينَ كَفَرُواْ لِرُسُلِهِمْ } حين بالغوا في دعوتهم وإهدائهم { لَنُخْرِجَنَّـكُمْ } أيها المزورون الملبسون { مِّنْ أَرْضِنَآ } إجلاء وإخراجاً على وجه الإهانة والإذلال { أَوْ لَتَعُودُنَّ } منصفين ملجئين { فِي مِلَّتِنَا } التي هي ملة آبائكم وأسلافكم { فَأَوْحَىٰ إِلَيْهِمْ رَبُّهُمْ } حين اشتد الأمر إليهم واضطروا من ظلمهم وطغيانهم، قائلاً لهم على سبيل الوعد والتبشير: لا تبالوا أيها الرسل المبلغون كلمة الحق إليهم من تهديداتهم وتشنيعاتهم، ولا تخافوا من شوكتهم وصولتهم نحن أقوى منهم { لَنُهْلِكَنَّ } بمقتضى قهرنا وجلالنا ونستأصلن { ٱلظَّالِمِينَ } [إبراهيم: 13] الخارجين عن ربقة إطاعتكم وانقيادكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: واستفتحوا: معطوف على أوحى إن كان الضمير للرسل، واستئناف إن كان للكفار\n ويسْقى: معطوف على محذوف، أي: يلقى فيها ويسْقى، وصديد: عطف بيان لماء، ويتجرعه: صفة لماء، أو حال من ضمير يسقى\n يقول الحق جل جلاله: { وقال الذين كفروا لِرُسُلهم } تخويفاً لهم: والله { لنُخرجنَّكم من أرضنا أو لتعودُنَّ في ملَّتنا } ، حلفوا ليكونن أحد الأمرين إما إخراج الرسل من ديارهم، أو عودهم إلى ملتهم، والعود هنا بمعنى الصيرورة لأنهم لم يكونوا على ملتهم، كما تقدم في قصة شعيب عليه السلام\n ويجوز أن يكون الخطاب لكل رسول، ولمن آمن معه، فغلّب الجماعة على الواحد، وقال الذين كفروا في كل عصر لكل رسول أتاهم: لنخرجنك، أو لتعودَن في ملتنا\n { فأوحى إليهم ربُّهم } أي: إلى رسلهم، مجتمعين أو متفرقين ـ على القولين ـ وقال في إيحائه: والله { لَنُهلكنَّ الظالمين } فتخلى بلادهم، { ولَنُسْكِنَنكُم الأرضَ من بَعدهم } أي: أرضهم وديارهم، لقوله:\n\n[الأعراف: 137]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:7",
      "similarity": 0.5573017709175088
    },
    {
      "verse": "16:123",
      "similarity": 0.4648845570643263
    },
    {
      "verse": "7:88",
      "similarity": 0.4506724110806603
    },
    {
      "verse": "12:37",
      "similarity": 0.44079472121749325
    },
    {
      "verse": "7:89",
      "similarity": 0.4363338280579573
    }
  ]
}