{
  "chapter": "ابراهيم",
  "text": "واستفتحوا۟ وخاب كل جبار عنيد",
  "translations": [
    {
      "translation": "Then (the apostles) asked of God's assistance, and every arrogant tyrant was frustrated:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They sought Our judgement. And (thanks to that judgement) every obstinate tyrant opposed to the Truth was brought to naught.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They prayed for victory and the haughty transgressors were defeated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sought a decision, and every stubborn rebel was destroyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sought victory and help; and every obstinate, arrogant dictator (who refuses to believe in the Oneness of Allah) was brought to a complete loss and destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they asked for judgment and every insolent opposer was disappointed:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They sought a judgment; then was disappointed every froward tyrant --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they sought help (from their Lord) and every froward potentate was bought to naught;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they sought Our Judgement, every stubborn oppressor was frustrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they besought judgment, and disappointed was every tyrant obstinate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They prayed for victory [against the infidels], and every obstinate tyrant was defeated,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they sought victory and decision (there and then), and frustration was the lot of every powerful obstinate transgressor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they (the Messengers) sought victory and help [from their Lord (Allah)], and every obstinate, arrogant dictator (who refuses to believe in the Oneness of Allah) was brought to a complete loss and destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They sought a judgment, then every tyrant was disappointed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they prayed for victory, and every stubborn tyrant came to disappointment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they requested victory from Allah, and disappointed, [therefore], was every obstinate tyrant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:15] And they sought victory, the messengers sought assistance from God against their people; and every tyrant, disdaining obedience to God, rebellious, obstinate to the truth, was brought to nothing;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they sought help) each people sought help against their prophet (and every froward) who turns away from the Truth and guidance (potentate) deceitful, arrogant person (was brought to naught) they got no help when they requested it; 266\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱسْتَفْتَحُواْ وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ } معناهُ اسْتَنْصَروا\n والعَنيدُ: الناكبُ عِن الحَقِّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن غاية خوفهم ورعبهم عن الوعيدات الأخروية استعدوا لها، وهيأوا أسباب النجاة منها، جعلنا الله ممن هيأ أسباب أخراه في أولاه { وَ } كيف لا ينصرهم الحق ولا يهلك عدوهم؛ إذ هم { ٱسْتَفْتَحُواْ } واستنصروا من الله، وطلبوا الفتح والنصرة على أعدائهم، مفوضين أمورهم كلها، مسلمين نفوسهم وأرواجهم على قضائه؛ لذلك فتح سبحاه عليهم ونصرهم على عدوهم { وَخَابَ } خيبة أبدية وخسر خسراناً سرمدياً { كُلُّ جَبَّارٍ } متكبر متجبر عكلى ا لله وعلى عباده { عَنِيدٍ } [إبراهيم: 15] مبالغ في العتو والعناد مع أنبيائه ورسله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واستفتحوا } أي: استفتح الرسل: طلبوا من الله الفتح على أعدائهم، أو القضاء بينهم وبين أعاديهم، كقوله:\n\n[الأعراف: 89] واستفتح الكفرة واستنصروا على غلبة الرسل، على نحو قول أبي جهل في غزوة بدر: اللهم، أقطعنا للرحم، وآتانا بما لا يعرف، فأحنه الغداة، أي: أهلكه\n أو: استفتح الفريقان معاً، فكل واحد منهما سأل الله أن يُهلك المبطل وينصر المحق\n وقرأ ابن عباس ومجاهد وابن محيصن: بكسر التاء على الأمر للرسل بطلب الفتح\n { وخاب }: خسر { كلُّ جبارٍ }: متكبر على الله، { عنيدٍ }: معاند للحق ولمن جاء به\n وهذا هو الفتح الذي فتح لهم، وهو: خيبة المتكبرين وفلاح المؤمنين",
      "translations": []
    }
  ]
}