{
  "chapter": "ابراهيم",
  "text": "الم تر ان الله خلق السموت والارض بالحق ان يشا يذهبكم ويات بخلق جديد",
  "translations": [
    {
      "translation": "Do you not see that Allah has created the heavens and the earth with truth? If He wished He could eliminate you and bring about a new creation.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that God has created the heavens and the earth with ultimate reason? If He so wills He could take you away from the earth and raise a new creation (in your place).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah created the heavens and the earth in Truth? Were He to will, He could take you away and bring a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not realize that God has created the heavens and the earth for a genuine purpose\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that Allah has created the heavens and the earth with true purpose? If He wills, He can remove you all and bring a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has created the heavens and the earth with truth If He wills, He can remove you and bring (in your place) a new creation!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah created the heavens and the earth with truth? If He please He will take you off and bring a new creation,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen that God created the heavens and the earth in truth? If He will, He can put you away and bring a new creation;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen that Allah hath created the heavens and the earth with truth? If He will, He can remove you and bring (in) some new creation;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that God has created the heavens and the earth for a purpose? He can eliminate you if He wills and bring into being a new creation:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not that Allah hath created the heavens and the earth with a purpose? If He willed He would make you pass away and bring a creation new.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded that Allah created the heavens and the earth with justice? If He wishes, He will take you away, and bring about a new creation,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not that Allah created the heavens and the earth in Truth? If He so will, He can remove you and put (in your place) a new creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has created the heavens and the earth with truth? If He will, He can remove you and bring (in your place) a new creation!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has created the heavens and the earth with truth? He can put you away if He will and bring into being a new creation;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that God created the heavens and the earth with truth? If He wills, He can do away with you, and bring a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that Allah created the heavens and the earth in truth? If He wills, He can do away with you and produce a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:19] Have you not seen, have you not observed, O you being addressed (this is an interrogative meant as an affirmative) that God created the heavens and the earth in truth? (bi’l-haqq is semantically connected to [the action of the verb] khalaqa, ‘created’). If He will, He can take you away, O mankind, and bring [about] a new creation, in your place.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف بياني ناشىء عن جملة { فأوحى إليهم ربهم لنهلكن الظالمين } فإن هلاك فئة كاملة شديدة القوة والمرة أمر عجيب يثير في النفوس السؤال : كيف تهلك فئة مثل هؤلاء ؟؟ فيجاب بأن الله الذي قدر على خلق السماوات والأرض في عظمتها قادر على إهلاك ما هو دونها ، فمبدأ الاستئناف هو قوله : { إن يشأ يذهبكم ويأت بخلق جديد }.وموقع جملة { ألم تر أن الله خلق السموات والأرض بالحق } موقع التعليل لجملة الاستئناف ، قدم عليها كما تجعل النتيجة مقدمة في الخطابة والجِدال على دليلها . وقد بيناه في كتاب «أصول الخطابة» .ومناسبة موقع هذا الاستئناف ما سبقه من تفرق الرماد في يوم عاصف .والخطاب في { ألم تر } لكل من يصلح للخطاب غير معيّن ، وكل مَن يظن به التساؤل عن إمكان إهلاك المشركين .والرؤية : مستعملة في العلم الناشىء عن النظر والتأمل ، لأن السماوات والأرض مشاهدة لكل ناظر ، وأما كونها مخلوقة لله فمحتاج إلى أقل تأمل لسهولة الانتقال من المشاهدة إلى العلم ، وأما كون ذلك ملتبساً بالحق فمحتاج إلى تأمل عميق . فلمّا كان أصل ذلك كله رؤية المخلوقات المذكورة علق الاستدلال على الرؤية ، كقوله تعالى : { قل انظروا ماذا في السماوات والأرض } \\[ سورة إبراهيم : 101 \\].والحق هنا : الحكمة ، أي ضد العبث ، بدليل مقابلته به في قوله تعالى : { وما خلقنا السماوات والأرض وما بينهما لاعبين ما خلقناهما إلا بالحق ولكن أكثرهم لا يعلمون } \\[ سورة الدخان : 38 ، 39 \\].وقرأه حمزة ، والكسائي ، وخلَف خلق السموات والأرض } بصيغة اسم الفاعل مضاف إلى { السموات } وبخفض { والأرض }.والخطاب في { يذهبكم } لجماعة من جملتهم المخاطب ب { ألم تر }. والمقصود : التعريض بالمشركين خاصة ، تأكيداً لوعيدهم الذي اقتضاه قوله : { لنهلكن الظالمين ولنسكننكم الأرض من بعدهم } ، أي إن شاء أعدم الناس كلهم وخلق ناساً آخرين .وقد جيء في الاستدلال على عظيم القدرة بالحكم الأعم إدماجاً للتعليم بالوعيد وإظهاراً لعظيم القدرة . وفيه إيماء إلى أنه يذهب الجبابرة المعاندين ويأتي في مكانهم في سيادة الأرض بالمؤمنين ليمكنهم من الأرض .\n\n",
      "translations": [
        {
          "translation": "(Hast thou not seen) have you not been informed, Muhammad; Allah addressed His Prophet, but it is his people who are meant by this address: (that Allah hath created the heavens and the earth with truth) to explain the Truth and falsehood; it is also said that this means: He created them for evanescence and extinction? (If He will, He can remove you) He can destroy you, or make you die, people of Mecca, (and bring (in) some new creation) and will create other beings who are better than you and more obedient to Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلَمْ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } معناه أَلَمْ تَعلمْ، وَلَيسَ بِرؤيةِ عَينِ\n\n",
      "translations": [
        {
          "translation": "\n\nDo you not see that Allah has created the heavens and the earth? This means: do you not know, and is not by sight of the eye.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي المستبعد لإحباط أعمال أولئك الكفرة المعاندين مع الله ورسله { أَنَّ ٱللَّهَ } القادر\n المقتدر بالقدرة التامة الكاملة بحيث لا ينتهي قدرته أصلآً { خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: أظهرهما وأوجدهما من كتم العدم على وجه الإبداع والاختراع { بِٱلْحقِّ } الثابت المطابق للحكمة البالغة الكاملة بحيث ما ترى فيها من فطور وفتور\n يشاهد أهل البصائر والاعتبار هذا النمط البديع والنظام العجيب فينكشفوا منها إلى مُبدئها ومُنشئها\n ومع ذلك { إِن يَشَأْ } سبحانه { يُذْهِبْكُمْ } أيها المائلون عن طريق لاحق الناكبون عن مقتضى حكمته بمتابعة أهوية نفوسكم ومقتيضات هوياتكم الباطلة { وَيَأْتِ } بدلكم { بِخَلْقٍ } آخر { جَدِيدٍ } [إبراهيم: 19] مستبدع مستحدث\n ليواظبوا على طاعته ويداوموا على مقتضيات حكمته\n\n\n{ وَ } لا تستبعدوا من الله أمثال ذلك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ألم تَرَ } يا محمد\n أو أيها السامع { أن الله خلق السماوات والأرض بالحق } لتدل على الحق\n أو بالوجه الذي يحقَّ ان تُخلق لأجله\n وهو التعريف بخالقها\n وبقدرته الباهرة التي تقدر على الإيجاد والإعدام\n ولذلك قال: { إن يشأ يُذهبكم ويأت بخَلْقٍ جديدٍ } \n أي: إن يشأ يعدمكم ويستبدل مكانكم خلقاً آخر\n فإنَّ من قدر على إيجاد صورهم\n وما تتوقف عليه مادتهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:16",
      "similarity": 0.9294808983510212
    },
    {
      "verse": "32:10",
      "similarity": 0.7698486328325089
    },
    {
      "verse": "72:3",
      "similarity": 0.6903984492959787
    },
    {
      "verse": "13:5",
      "similarity": 0.37956608570693895
    },
    {
      "verse": "17:49",
      "similarity": 0.2744820129661175
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/014019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/014019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/14:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}