{
  "chapter": "ابراهيم",
  "text": "مثل الذين كفروا۟ بربهم اعملهم كرماد اشتدت به الريح فى يوم عاصف لا يقدرون مما كسبوا۟ على شىء ذلك هو الضلل البعيد",
  "translations": [
    {
      "translation": "The metaphor of those who reject their Lord is that their actions are like ashes scattered by strong winds on a stormy day. They have no power at all over anything they have earned. That is extreme misguidance.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like ashes are the deeds of those who deny their Lord, which the wind blows away on a windy day. They shall have no power over what they earned. This is the farthest limit of going astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the example of those who disbelieve in their Lord: their works are like ashes upon which the wind blows fiercely on a tempestuous day. They shall find no reward for their deeds. That indeed is the farthest point in straying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The deeds of those who deny the existence of their Lord are like ashes blown about by a strong wind on a stormy day. They will achieve nothing from their deeds. (What they have done) is a manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The state of those who disbelieve in their Lord is that their deeds are like ashes which the strong wind blew away on a stormy day; they got nothing from all that they earned; this is the extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who disbelieved in their Lord is that their works are as ashes, on which the wind blows furiously on a stormy day; they shall not be able to get aught of what they have earned. That is the straying, far away (from the right path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who disbelieve in their Lord: their actions are like ashes on which the wind blows hard on a stormy day; they shall not have power over any thing out of what they have earned; this is the great error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who disbelieve in their Lord: their works are as ashes, whereon the wind blows strong upon a tempestuous day; they have no power over that they have earned - that is the far error!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A similitude of those who disbelieve in their Lord: Their works are as ashes which the wind bloweth hard upon a stormy day. They have no control of aught that they have earned. That is the extreme failure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The works of those who deny their Lord are like ashes which the wind scatters on a stormy day: they shall gain nothing from what they do. To act thus is to stray far into error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who disbelieve in their Lord: their works are like ashes upon which the wind bloweth hard on a stormy day: they shall not be able to get aught of that which they have earned. That! that is the straying far-off\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A parable of those who defy their Lord: their deeds are like ashes over which the wind blows hard on a tempestuous day: they have no power over anything they have earned. That is extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who reject their Lord is that their works are as ashes, on which the wind blows furiously on a tempestuous day: No power have they over aught that they have earned: that is the straying far, far (from the goal).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who disbelieve in their Lord is that their works are as ashes, on which the wind blows furiously on a stormy day, they shall not be able to get aught of what they have earned. That is the straying, far away (from the Right Path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the likeness of those who disbelieve in their Lord, their works are like ashes which a strong wind scatters on a stormy day; they are powerless over that they have earned; that is the far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who disbelieve in their Lord: their works are like ashes, in a fierce wind, on a stormy day. They have no control over anything they have earned. That is the utmost misguidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of those who disbelieve in their Lord is [that] their deeds are like ashes which the wind blows forcefully on a stormy day; they are unable [to keep] from what they earned a [single] thing. That is what is extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:18] The likeness, the description, of those who disbelieve in their Lord (alladhīna kafarū bi-rabbihim: the subject, substituted by [the following, a‘māluhum,]): their works, the righteous ones, such as kindness [to kin] or an act of charity — in the way that no benefit can be derived from them [it is because these works] — are as ashes over which the wind blows hard on a tempestuous day, one in which the winds blow violently, making them as scattered dust, over which none can have power (the genitive [clause beginning with ka-ramādin, ‘as ashes’] constitutes the predicate of the [above-mentioned] subject); they, that is, the disbelievers, have no power over anything that they have earned, [anything] that they had done in [their] life on earth, in other words, they shall find no reward for it, since this was never a precondition. That is extreme error, [extreme] perdition!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A similitude of those who disbelieve in their Lord: Their works) He says: the works of those who disbelieve in their Lord (are as ashes which the wind bloweth hard upon a stormy day. They have no control of aught that they have earned) He says: they will not find the reward of their good works which were performed in their state of disbelief, just as one will not find ashes when the wind blows hard on it. (That is the extreme failure) the error which is far remote from the Truth or guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي يَوْمٍ عَاصِفٍ } يعني شَديدَ الرِّيحِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"On a day of violent wind,\" refers to a day of strong wind.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه كلاماً جملياً شاملاً لجميع أصحاب الضلال: { مَّثَلُ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمْ } الذي رباهم بأنواع النعم\n فيكفرون النعم والمنعم جميعاً متى لم يصلوا إلى مرتبة توحيده وعرفانه\n ولم يؤمنوا به حتى يصلوا بالسلوك والمجاهدة إليه\n شأنهم العجيب وحالهم الغريبة فيما يتلى عليكم أنه { أَعْمَالُهُمْ } الحسنة من الصدقة والعتق والصلة وغير ذلك من الأعمال المقربة إلى الحق إن كانت غير مقروننة بالإيمان والمعرفة { كَرَمَادٍ ٱشْتَدَّتْ بِهِ ٱلرِّيحُ فِي يَوْمٍ عَاصِفٍ } ذو رياح شديدة عاصفة فطار بها الرماد إلى حيثن لم يبق في مكانه أثر منه\n أي: مثلهم وشأنهم في كون أعمالهم محبطة يوم القيامة كمثل ذلك الرماد بحيث { لاَّ يَقْدِرُونَ } لدى الحاجة { مِمَّا كَسَبُواْ } من الأعمال المنجية المخلصة { عَلَىٰ شَيْءٍ } قليل حقير\n فكيف بالكثير العظيم منها؟! { ذٰلِكَ } الإحباط والهباء وعدم النفع { هُوَ ٱلضَّلاَلُ ٱلْبَعِيدُ } [إبراهيم: 18] بمراحل عن الهداية والفوز بالفلاح\n وما ذلك إلا لعدم مقارنتها بالإيمان والعرفان\n ولتكذيب الرسل المبينين لهم طريق التوحيد والإيقان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: مثل: مبتدأ، والخبر محذوف عند سيبويه، أي: فيما يتلى عليكم مثلهم\n وقال الفراء: الخبر ما بعده، وهو جملة: أعمالهم كرمادٍ، أو أعمالهم: بدل، والخبر: كرماد، وعلى قول سيبويه تكون جملة: أعمالهم: مستأنفة لبيان مثلهم\n  يقول الحق جل جلاله: { مَّثلُ } أعمال { الذين كفروا بربهم } في عدم الانتفاع بها وذهابها: { كرمادٍ اشتدت به الريحُ } في الهوى بسرعة { في يومٍ عاصفٍ }: شديد ريحه\n والعصْف: اشتداد الريح\n وصف به زمانه للمبالغة، كقولهم: نهاره صائم، وليله قائم\n شبه صنائعهم من الصدقة، وصلة الرحم، وإغاثة الملهوف، وعتق الرقاب، ونحو ذلك من مكارمهم في حبوطها ـ لبنائها على غير أساس من الإيمان بالله، والتوجه بها إليه ـ بغبار طارت به الريح العاصفة { في يوم عاصفٍ، لا يقْدرونَ } يوم القيامة { مما كسبوا } من أعمالهم { على شيءٍ } من الانتفاع بها لحبوطها، وتلاشيها، فلا يقدرون منها على شيء، ولا يجدون ثوابها، وحيل بينهم وبين النفع، كما حالت الرياح بينك وبين ما تنسفه، فهو كما قيل: فذلكة التمثيل\n { ذلك } إشارة إلى ضلالهم مع حسبانهم أنهم محسنون، { هو الضلال البعيد } أي: هو الغاية في البُعد عن طريق الحق\n الإشارة: العمل الذي يثبت لصاحبه هو الذي يصحبه الإخلاص في أوله، والإسرار في آخرِه، والتبري فيه من الحول والقوة، وفي الحديث عنه صلى الله عليه وسلم أنه قال:\n\n \" إنَّ الإبقَاءَ عَلَى العمل أشَدُّ مِنَ العمل، وإنَّ الرجلَ لَيَعْمَلُ العمل فيُكتب له عَمَلٌ صالحٌ، معمول به في السر، يضعِّف أجره بسبعين ضِعفاً، فلا يزال به الشيطان حتى يذكره للناس ويُعْلنه، فيكتب علانيته، ويمحى تضعيف أجره كله، ثم لا يزال به الشيطان حتى يذكره للناس ويُحب أن يُحمد عليه، فيُمحى من العلانية، ويكتب رياء، فاتقى الله امرؤ صان دينه، وإن الرياء شرك \" \n\nرواه البيهقي\n وبهذا تظهر فضيلة عمل القلوب، كعبادة التفكر والاعتبار، أو الشهود والاستبصار، أو نية صالحة وهدى صالح، أو زهد في القلب، وورع وصبر، وشكر وحلم، وغير ذلك من أعمال القلوب، التي لا يطلع عليها ملك فيكتبه، ولا شيطان فيُفسده، بل يتولى جزاءه أكرمُ الأكرمين\n ولذلك قيل: ذرة من أعمال القلوب أفضل من أمثال الجبال من أعمال الجوارح\n وقال عليه الصلاة والسلام:\n\n \" تفكر ساعة أفضل من عبادة سبعين سنة \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:12",
      "similarity": 0.25430641907999646
    },
    {
      "verse": "21:81",
      "similarity": 0.24263383744045725
    },
    {
      "verse": "105:5",
      "similarity": 0.2360938713885832
    },
    {
      "verse": "77:2",
      "similarity": 0.23403759029781607
    },
    {
      "verse": "10:22",
      "similarity": 0.1901100769547265
    }
  ]
}