{
  "chapter": "ابراهيم",
  "text": "قالت لهم رسلهم ان نحن الا بشر مثلكم ولكن الله يمن على من يشاء من عباده وما كان لنا ان ناتيكم بسلطن الا باذن الله وعلى الله فليتوكل المؤمنون",
  "translations": [
    {
      "translation": "Their Messengers said to them, 'We are nothing but human beings like yourselves. But Allah shows favour to any of His slaves He wills. It is not for us to bring you an authority except by Allah's permission. So let the muminun put their trust in Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their apostles said to them: \"Indeed we are men like you, but God bestows His favours on whomsoever He wills among His creatures. It is not in our power to bring a miracle for you without the leave of God. The believers should only place their trust in God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers told them: \"Indeed we are only human beings like yourselves, but Allah bestows His favour on those of His servants whom He wills. It does not lie in our power to produce any authority except by the leave of Allah. It is in Allah that the believers should put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messengers replied, \"We are certainly mere mortals like you, but God bestows His favors on whichever of His servants He wants. We can not bring you authority without the permission of God. The faithful should trust in God alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Noble Messengers said to them, “We are indeed human beings like you, but Allah bestows favour upon whomever He wills, among His bondmen*; it is not our task to bring any proof to you except by the command of Allah; and only upon Allah must the Muslims rely.” (* Therefore Prophets and other men are not equal in status.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers said to them: \"We are no more than human beings like you, but Allah bestows His grace to whom He wills of His servants. It is not ours to bring you an authority (proof) except by the permission of Allah. And in Allah (alone) let the believers put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their apostles said to them: We are nothing but mortals like yourselves, but Allah bestows (His) favors on whom He pleases of His servants, and it is not for us that we should bring you an authority except by Allah's permission; and on Allah should the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers said to them, 'We are nothing but mortals, like you; but God is gracious unto whomsoever He will of His servants. It is not for us to bring you an authority save by the leave of God; and in God let the believers put all their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers said unto them: We are but mortals like you, but Allah giveth grace unto whom He will of His slaves. It is not ours to bring you a warrant unless by the permission of Allah. In Allah let believers put their trust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers replied, \"We are indeed mortals like yourselves. But God bestows His grace on such of His servants as He chooses. We cannot give you miracles, except by God's leave. In God let true believers put their trust --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their apostles said unto them: we are naught but human beings like but Allah bestoweth favour on you, of His bond whomsoever He willeth and it is not for us to bring you a men command of warrantv except by the Allah. On Allah then let the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their apostles said to them, ‘Indeed we are just human beings like yourselves; but Allah favours whomever of His servants that He wishes. We may not bring you an authority except by Allah’s leave, and in Allah let all the faithful put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers said to them: \"True, we are human like yourselves, but Allah doth grant His grace to such of his servants as He pleases. It is not for us to bring you an authority except as Allah permits. And on Allah let all men of faith put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers said to them: \"We are no more than human beings like you, but Allah bestows His Grace to whom He wills of His slaves. It is not ours to bring you an authority (proof) except by the Permission of Allah. And in Allah (Alone) let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Messengers said to them: 'We are nothing except humans like you. But Allah bestows His Mercy on those of His worshipers whom He chooses. We cannot give you proof, except with the permission of Allah. In Allah, let believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers said to them, “We are only humans like you, but God favors whomever He wills from among His servants. We cannot possibly show you any proof, except by leave of God. In God let the faithful put their trust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their messengers said to them, \"We are only men like you, but Allah confers favor upon whom He wills of His servants. It has never been for us to bring you evidence except by permission of Allah. And upon Allah let the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:11] Their messengers said to them, ‘We are but mortals like you, as you have said; but God is gracious to whomever He will of His servants, by way of [assigning] prophethood. And it is not ours to bring you any warrant save by the leave of God, by His command, for we are servants, enthralled; and in God let believers put their trust, [let them] have confidence in Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Their messengers said unto them: We are but mortals) human beings (like you) we are but created beings like you, (but Allah giveth grace unto whom He will of His slaves) by bestowing upon them prophethood and total surrender to Him. (It is not ours) it behoves us not (to bring you a warrant) a decree or proof (unless by the permission of Allah) by the command of Allah. (In Allah let believers put their trust!) He says: the believers should rely on Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَتْ لَهُمْ رُسُلُهُمْ } مسلمين منهم المشاركة في الجنس: { إِن نَّحْنُ إِلاَّ بَشَرٌ مِّثْلُكُمْ } نشارك لكم في جميع أحوال البشر وأوصافه { وَلَـٰكِنَّ ٱللَّهَ } المنعم المفضل { يَمُنُّ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِ } بمقتضى جوده وأحسانه بفضائل مخصوصة وكرائم غير شاملة على تفاوت مراتبهم واستعدادتهم المثبتة في علم الله { وَ } أما أمر مقترحاتكم فإنه { مَا كَانَ } أي: صح وجاز { لَنَآ أَن نَّأْتِيَكُمْ بِسُلْطَانٍ } تقترحون { إِلاَّ بِإِذْنِ ٱللَّهِ } أي: بتوفيقه ووحيه وإقداره إن تعلق إرادته بصدورها منا { وَعلَى ٱللَّهِ } لا على غيره من الأسباب والوسائل العداية { فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ } [إبراهيم: 11] الموحدون المفوضون أمورهم كلها إلى الله أولاً وبالذات\n ولا يعتقدون الحول والقوة إلا بالله المستقل في ذاته وأوصافه وأفعاله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولقول الرسل: { ولكن الله يَمُنُّ على من يشاءُ من عباده }\n هـ\n ثم قالوا للرسل: { تُريدون أن تَصدُّونَا عما كان يعبدُ آباؤُنا } من الأصنام بهذه الدعوى\n { فأتونا بسلطانٍ مبين }: ببرهان بيِّن يدل على فضلكم\n واستحقاقكم لهذه المرتبة التي هي مرتبة النبوة\n كأنهم لم يعتبروا ما جاؤوا به من البينات والحجج\n فاقترحوا عليهم آية أخرى\n تعنتاً ولجاجاً\n  { قالت لهم رُسُلهم إن نحن }: ما نحن { إلا بشر مثلُكم ولكن الله يَمُنُّ على من يشاءُ من عباده } بالنبوة والرسالة\n فمَنَّ علينا بذلك\n وإن كنا بشراً مثلكم\n سلّموا لهم مشاركتهم في الجنس\n وجعلوا الموجب لاختصاصهم بالنبوة فضل الله ومَنَّهُ عليهم\n وفيه دليل على ان النبوة مواهب عطائية لا كسبية\n ثم أجابوا عما اقترحوا بقولهم: { وما كان لنا أن نأتيَكم بسلطانٍ إلا بإذنِ الله } \n فليس لنا الإتيان بآيات\n ولا في قدرتنا أن نأتيكم بما اقترحتموه\n وإنما هو أمر متعلق بمشيئة الله\n يخص من يشاء بها\n على ما تقتضيه حكمته وسابق إرادته\n  { وعلى الله فليتوكَّل المؤمنون } \n فلنتوكل نحن عليه\n في الصبر على معاناتكم ومعاداتكم\n عمموا الأمر بذكر المؤمنين للإشعار بأن الإيمان موجب للتوكل\n وقصدوا به أنفسهم قصداً أولياً\n ألا ترى قولهم: { وما لنا ألا نتوكل على الله } أي: أيُّ عذر لنا في ترك التوكل على الله؟ { وقد هَدَانَا سُبُلنا } أي: طرقنا التي نعرفه بها\n فنوحده\n ونعلم أن الأمور كلها بيده\n { ولَنصْبِرَنَّ على ما آذيتمونا }: على أذاكم حتى يحكم الله بيننا\n وهو جواب عن قسم محذوف\n أكدوا به توكلهم\n وعدم مبالاتهم بما يجري من الكفار عليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:99",
      "similarity": 0.462057107185695
    },
    {
      "verse": "49:17",
      "similarity": 0.4413096180915669
    },
    {
      "verse": "74:6",
      "similarity": 0.43615488571504435
    },
    {
      "verse": "95:6",
      "similarity": 0.42539679774911654
    },
    {
      "verse": "84:25",
      "similarity": 0.42188823122580166
    }
  ]
}