{
  "chapter": "ابراهيم",
  "text": "الم تر كيف ضرب الله مثلا كلمة طيبة كشجرة طيبة اصلها ثابت وفرعها فى السماء",
  "translations": [
    {
      "translation": "Do you do not see how Allah makes a metaphor of a good word: a good tree whose roots are firm and whose branches are in heaven? It bears fruit regularly by its Lord's permission. Allah makes metaphors for people so that hopefully they will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how God compares a noble act to a healthy tree whose roots are firm and branches in the sky, which yields\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how Allah has given the example of a good word? It is like a good tree, whose root is firmly fixed, and whose branches reach the sky,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consider (Muhammad) how God (in a parable) compares the blessed Word to that of a blessed tree which has firm roots and branches rising up into the sky\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see how Allah illustrated the example of a sacred saying? Like a sacred tree, which has firm roots and branches reaching into heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not how Allah sets forth a parable A goodly word as a goodly tree, whose root is firmly fixed, and its branches (reach) to the sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered how Allah sets forth a parable of a good word (being) like a good tree, whose root is firm and whose branches are in heaven,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how God has struck a similitude? A good word is as a good tree -- its roots are firm, and its branches are in heaven;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not how Allah coineth a similitude: A goodly saying, as a goodly tree, its root set firm, its branches reaching into heaven,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how God compares a good word to a good tree? Its root is firm and its branches are in the sky,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not how Allah hath propounded the similitude of the clean word? It is like a clean tree, its root firmly fixed, and its branches reaching unto heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded how Allah has drawn a parable? A good word is like a good tree: its roots are steady and its branches are in the sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not how Allah sets forth a parable? - A goodly word like a goodly tree, whose root is firmly fixed, and its branches (reach) to the heavens,- of its Lord. So Allah sets forth parables for men, in order that they may receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not how Allah sets forth a parable? - A goodly word as a goodly tree, whose root is firmly fixed, and its branches (reach) to the sky (i.e. very high).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how Allah sets forth a parable that a good deed is like a good tree, its roots are firm and its branches are in the heaven,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how God presents a parable? A good word is like a good tree—its root is firm, and its branches are in the sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered how Allah presents an example, [making] a good word like a good tree, whose root is firmly fixed and its branches [high] in the sky?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:24] Have you not seen, observed, how God has struck a similitude? (mathalan is substituted by [the following words, kalimatan tayyibatan]): a goodly saying, which is, ‘there is no god but God’, is as a goodly tree, a palm tree, its root set firm, in the ground, and its shoots, its branches, are in heaven;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي اقتضته مناسبة ما حكي عن أحوال أهل الضلالة وأحوال أهل الهداية ابتداء من قوله تعالى : { وبرزوا لله جميعاً إلى قوله تحيتهم فيها سلام } ، فضرب الله مثلاً لكلمة الإيمان وكلمة الشرك . فقوله : { ألم تر كيف ضرب الله مثلاً } إيقاظ للذهن ليترقب ما يرد بعد هذا الكلام ، وذلك مثل قولهم : { ألم تعلم } . ولم يكن هذا المثَل مما سبق ضربه قبل نزول الآية بل الآية هي التي جاءت به ، فالكلام تشويق إلى علم هذا المثل . وصوغ التشويق إليه في صيغة الزمن الماضي الدال عليها حرف لَمْ } التي هي لنفي الفعل في الزمن الماضي والدالّ عليها فعل { ضرب } بصيغة الماضي لقصد الزيادة في التشويق لمعرفة هذا المثل وما مثل به .والاستفهام في { ألم تر } إنكاري ، نُزل المخاطب منزلة من لم يعلم فأنكر عليه عدم العلم ، أو هو مستعمل في التعجيب من عدم العلم بذلك مع أنه مما تتوفر الدواعي على علمه ، أو هو للتقرير ، ومثله في التقرير كثير ، وهو كناية عن التحريض على العلم بذلك .والخطاب لكل من يصلح للخطاب . والرؤية علمية معلّق فعلها عن العمل بما وليها من الاستفهام ب { كيف }. وإيثار { كيف } هنا للدلالة على أن حالة ضرب هذا المثل ذات كيفية عجيبة من بلاغته وانطباقه .وتقدم المثَل في قوله : { مثلهم كمثل الذي استوقد ناراً } في سورة البقرة ( 17 ).وضَرْب المثل : نَظْم تركيبه الدال على تشبيه الحالة . وتقدم عند قوله : { أن يضرب مثلاً ما } في سورة البقرة ( 26 ).وإسناد { ضرب } إلى اسم الجلالة لأن الله أوحى به إلى رسوله عليه الصلاة والسلام .والمثَل لما كان معنى متضمناً عدة أشياء صح الاقتصار في تعليق فعل { ضرب } به على وجه إجمال يفسره قوله : { كلمة طيبة كشجرة } إلى آخره ، فانتصب { كلمة } على البدلية من { مثلاً } بدلَ مفصّل من مجمل ، لأن المثل يتعلق بها لما تدل عليه الإضافة في نظيره في قوله : { ومثل كلمة خبيثة }.والكلمة الطيبة قيل : هي كلمة الإسلام ، وهي : شهادة أن لا إله إلا الله وأن محمداً رسول الله والكلمة الخبيثة : كلمة الشرك .والطيبة : النافعة . استعير الطيب للنفع لحُسن وقعه في النفوس كوقع الروائح الذكية . وتقدم عند قوله تعالى : { وجرين بهم بريح طيبة } في سورة يونس ( 22 ).والفَرع : ما امتد من الشيء وعَلا ، مشتق من الافتراع وهو الاعتلاء . وفرع الشجرة غصنها ، وأصل الشجرة : جذرها .والسماء مستعمل في الارتفاع ، وذلك مما يزيد الشجرة بهجة وحسن منظر .\n\n",
      "translations": [
        {
          "translation": "(Seest thou you not) have you not been informed, Muhammad, (how Allah coineth a similitude: A goodly saying) He says: how Allah has exposited the description of a goodly saying which is \"there is no god save Allah\", (as a goodly tree) which is the believer, (its root set firm) He says: the heart of the sincere believer is firm by means of \"there is no god save Allah\", (its branches reaching into heaven) He says: due to it the works of a sincere believer are accepted,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ضَرَبَ ٱللَّهُ مَثَلاً كَلِمَةً طَيِّبَةً } قالَ زيد بن علي عليهما السّلامُ: هِي لاَ إله إِلاَّ الله أَصْلُهَا ثَابِتٌ فِي قَلبِ المُؤمِن\n ويقالُ: النَّخلَةُ\n وشَجَرةٌ خَبِيثَةٌ: هِيَ الحَنظَلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {He has set forth for you an example in the word that is good} - Zayd ibn Ali said, \"It is the affirmation that there is no god but Allah, its roots are firm in the believer's heart.\"\n The date palm is said to be\n\nThe date palm is said to be the tree of life. It is a symbol of fertility, growth, and abundance.\n\n\nA bad tree: it is the date palm.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ كلمة طيبة } أي: نفساً طيبة\n كما مرّ في تسمية عيسى عليه السلام كَلِمَةً\n { كشجرة طيبة } كما شبهها بالزيتونة في القرآن وبالنخلة في الحديث { أصلها ثابت } بالاطمئنان وثبات الاعتقاد بالبرهان { وفرعها في } سماء الروح { تؤتي أُكلها } من ثمرات المعارف والحِكَم والحقائق { كل } وقت { بإذن ربّها } بتسهيله وتيسيره بتوفيق الأسباب وتهيئتها { ومثل } نفس { خبيثة كشجرة خبيثة } مثل الحنظلة أو الشرجط { اجتثت من فوق الأرض } استؤصلت للطيش الذي فيها وتشوش الاعتقاد وعدم القرار على شيء\n { يثبت الله الذين آمنوا } الإيمان اليقيني بالبرهان الحقيقي { في الحياة } الحسيّة لاستقامتهم في الشريعة وسلوكهم في تحصيل المعاش طريق الفضيلة والعدالة { وفي الآخرة } أي: الحياة الروحانية لاهتدائهم بنور الحق في الطريقة وكونهم في تحصيل المعارف على بصيرة من الله وبيّنة من ربّهم { ويضلّ الله الظالمينَ } في الحياتين لنقص استعداداتهم بحظوظ صفات النفس وبقائهم في الحيرة للاحتجاب عن نور الحق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي المعتبر الخبير البصير { كَيْفَ ضَرَبَ ٱللَّهُ } الهادي لعباده إلى توحيده { مَثَلاً } لينتبهوا منه بأن شبه { كَلِمَةً طَيِّبَةً } هي كلمة التوحيد القائلة المفصحة بألا وجود لسوى الحق { كَشَجَرةٍ طَيِّبَةٍ } هي النخلة التي { أَصْلُهَا } وعروقها { ثَابِتٌ } في الأرض بحيث لا يقلعها ولا يشوشها الرياح أصلاً { وَفَرْعُهَا } أي: أفنانها وأغصانها مرتفعة { فِي } جانب { ٱلسَّمَآءِ } [إبراهيم: 24]\n\n\n{ تُؤْتِيۤ أُكُلَهَا } أي: ثمارها { كُلَّ حِينٍ } من الأحيان المعينة للإثمار { بِإِذْنِ رَبِّهَا } أي: بإرادته ومشيئته\n يعني: كما أن النخلة تنمو وتثمر بسبب أصلها الثابت في الأرض وفرعها المرتفع نحو السمااء\n ويحصل منها الثمر وقت حصولها\n كذلك الكلمة الطيبة التوحيدية المستقرة\n أصلها في أراضي الاستعدادات الطفرية المرتفعة أغصانها وأفنانها نحو سماء العالم الروحاني\n المثمرة لثمرات المكاشفات والمشاهدات\n القالعة القامعة لأشواك الكثرات\n الناشئة من الإضافات العدمية { وَ } لا حاجة لأولي البصائر والألباب\n المنكشفين بصرافة الوحدة الذاتية إلى أمثال هذه التنبيهات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: كلمة طيبة: يجوز أن يكون مفعولاً بمحذوف\n أي: جعل كلمة\n وتكون الجملة تفسيرية لضرب المثل\n وأن تكون كلمة: بدلاً من مَثَلاً\n وشجرة: صفة لها\n أو خبر عن مضمر\n أي: هي شجرة\n يقول الحق جل جلاله: { ألم تَرَ } يا محمد\n أو أيها السامع\n { كيف ضَرَبَ اللهُ مَثَلاً } لأهل \" لا إله إلا الله \" \n وهم: أهل التوحيد\n الذين رسخ التوحيد في قلوبهم\n وعبّروا عنه بألسنتهم\n فمثال الكلمة الطيبة التي نطقوا بها\n ورسخ معناها في قلوبهم { كشجرةٍ طيبةٍ }: كالنخلة مثلاً\n { أصلُها ثابت } في الأرض\n غائص بعروقه فيها\n { وفروعها في السماء } أي: أعلاها\n أي: يريد الجنس\n أي: فروعها وأفنانها في السماء\n { تُؤتي أًكُلُها }: تُعطى ما يؤكل من ثمرها { كل حين } وقَّته الله لإثمارها\n فقيل: سنة\n وبه قال ابن عباس وجماعة من المفسرين والفقهاء\n واستدلوا بها على من حلف لا يُكلم أخاه حيناً لزمه سنة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:64",
      "similarity": 0.18946049142846375
    },
    {
      "verse": "76:25",
      "similarity": 0.13941425056963866
    },
    {
      "verse": "24:36",
      "similarity": 0.13618455493800222
    },
    {
      "verse": "13:15",
      "similarity": 0.13585742719723143
    },
    {
      "verse": "33:42",
      "similarity": 0.1352313008678551
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/014024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/014024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/14:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}