{
  "chapter": "ابراهيم",
  "text": "الم تر الى الذين بدلوا۟ نعمت الله كفرا واحلوا۟ قومهم دار البوار",
  "translations": [
    {
      "translation": "Do you not see those who have exchanged Allah's blessing for kufr, and moved their people to the abode of ruin:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not looked at those who repaid God's favours with ingratitude; who pulled their people down to ruin,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see those who have exchanged Allah's favour with ingratitude to Him, causing their people to be cast in the abode of utter perdition\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who changed the Word of God through disbelief and led their people to destruction?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see those who exchanged the grace of Allah for ungratefulness and led their people down to the home of destruction?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who have changed the blessings of Allah into disbelief (by denying Prophet Muhammad and his Message of Islam), and caused their people to dwell in the house of destruction\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who have changed Allah's favor for ungratefulness and made their people to alight into the abode of perdition\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen those who exchanged the bounty of God with unthankfulness, and caused their people to dwell in the abode of ruin? --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen those who gave the grace of Allah in exchange for thanklessness and led their people down to the Abode of Loss,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see those who, in exchange for God's favour, offer only ingratitude and cause their people to descend into the Abode of Ruin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not those who returned the favour of Allah with infidelity and caused their people to alight in the dwelling of perdition:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded those who have changed Allah’s blessing with ingratitude, and landed their people in the house of ruin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not turned thy vision to those who have changed the favour of Allah. Into blasphemy and caused their people to descend to the House of Perdition?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who have changed the Blessings of Allah into disbelief (by denying Prophet Muhammad SAW and his Message of Islam), and caused their people to dwell in the house of destruction?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who exchanged the favor of Allah with disbelief and landed their nation in a house of ruin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who exchanged the blessing of God with blasphemy, and landed their people into the house of perdition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who exchanged the favor of Allah for disbelief and settled their people [in] the home of ruin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:28] Have you not seen, observed, those who exchanged God’s grace, that is, the thanks [due] for it, for unthankfulness — these were the disbelievers of Quraysh — and who, by leading them astray, caused their people to take up residence in the Abode of Ruin?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "268 (Hast thou not seen) have you not been informed, Muhammad, about (those who gave the grace of Allah in exchange) they changed the gift of Allah who bestowed upon them the Scripture and the messengers and instead opted (for thanklessness) disbelief in Muhammad (pbuh) and in the Qur'an. These are the Banu Umayyah and the Banu'l-Mughirah who fed the army of the unbelievers on the Day of Badr, (and led their people down to) they let the people of Mecca camp at (the Abode of Loss) the abode of destruction, i.e. the place of Badr; it is also said that the Abode of Loss refers to Gehenna,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَدَّلُواْ نِعْمَةَ ٱللَّهِ كُفْراً } معناه محمدٌ صلَّى الله عَليهِ وآلهِ وسلَّم نِعمةٌ مِن الله\n\n\n\n\nوقوله تعالى: { دَارَ ٱلْبَوَارِ } معناهُ دَارَ الهَلاَكِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ بدّلوا نِعْمَة الله } التي أنعم بها عليهم في الأزل من الهداية الأصلية والنور الاستعدادي الذي هو بضاعة النجاة { كُفْراً } أي: احتجاباً وضلالة، كما قال تعالى:\n\n[البقرة، الآية: 16] أضاعوا النور الباقي واستبدلوا به اللذة الحسية الفانية، فبقوا في الظلمة الدائمة { وأحلوا قومهم } من في قوى نفوسهم أو من اقتدى بطريقتهم وتأسى بهم وتابعهم في ذلك { دار البوار }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي إلى الظالمين المسرفين { إِلَى ٱلَّذِينَ بَدَّلُواْ نِعْمَتَ ٱللَّهِ } الفائضة عليهم من محض فعله و عطائه؛ ليشكروا له ويواظبوا على أداء حقه { كُفْراً } أي: يصرفونها كفراناً لها إلى البغي والطغيان على الله وعلى خلَّص عباده، مع أن المناسب صرفها إلى إعلاء كلمة الله ونصر دينه ونبيه { وَ } لذلك { أَحَلُّواْ } وأدخلوا نفوسهم { قَوْمَهُمْ } التابعين لهم المعاندين لكفرهم { دَارَ ٱلْبَوَارِ } [إبراهيم: 28] أي: الهلاك والخسار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ألم تَرَ } يا محمد { إلى الذين بدَّلوا } شكر { نعمةَ الله كفراً } بأن وضعوا الكفر مكان الشكر، أو: بدلوا نفس النعمة كفراً فإنهم لما كفروها سُلبت منهم، فصاروا تاركين لها مُحصلين للكفر مكانها كأهل مكة، خلقهم الله من نسل إسماعيل عليه السلام، وأسكنهم حَرَمه، وجعلهم خُدَّام بيته، وَوَسَّع عليهم أبواب رزقه، وعطف عليهم قلوب خلقه، وتمم شرفهم ببعْثة نبيه محمد صلى الله عليه وسلم، فكفروا ذلك، فقحطوا، وجاعوا حتى أكلوا الميتة، وأُسروا وقُتلوا يوم بدر، وصاروا كذلك مسلوبي النعمة، موصوفين بالكفر وعن عمر بن الخطاب وعليّ بن أبي طالب ـ رضي الله عنهما ـ: أنها نزلت في الأفجريْن من قريش: بني المغيرة، وبني أمية فأما بنو المغيرة فكفيتموهم يوم بدر، وأما بنو أمية فمُتِّعُوا إلى حين\n { وأحَلَّوا قومَهم }: من أطاعهم في الكفر والتبديل، أي: أنزلوهم { دارَ البوار }: دار الهلاك، بحملهم على الكفر معهم، ثم فسرهم بقوله: { جهنم يصلونها }: يحترقون فيها، و { بئس القرارُ } وبئس المستقر جهنم",
      "translations": []
    }
  ]
}