{
  "chapter": "ابراهيم",
  "text": "وبرزوا۟ لله جميعا فقال الضعفؤا۟ للذين استكبروا۟ انا كنا لكم تبعا فهل انتم مغنون عنا من عذاب الله من شىء قالوا۟ لو هدىنا الله لهدينكم سواء علينا اجزعنا ام صبرنا ما لنا من محيص",
  "translations": [
    {
      "translation": "They will all parade before Allah and the weak will say to those who were arrogant, 'We followed you, so can you help us at all against the punishment of Allah?' They will say, 'If Allah had guided us, we would have guided you. It makes no difference whether we cannot stand it or bear it patiently. We have no way of escape.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they will all appear before God together, the weak will say to those who were arrogant: \"We were your followers, so can you now save us a little from God's punishment?\" They will say: \"If we had been guided by God we would surely have shown you the way. To lament or endure is all the same to us now. No getting away is there for us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then all of them will appear exposed before Allah, and the weak ones will say to the haughty ones: \"We merely followed you. Will you, then, protect us from Allah's chastisement?\" They will say: \"Had Allah shown us the Way to our salvation, we would surely have also guided you. Now it is all the same whether we cry or suffer patiently, we have no escape.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the Day of Judgment) everyone will appear before God and those who have been suppressed will say to their oppressors, \"We were your followers, can you do anything to rescue us from the torment of God?\" They will reply, \"Had God guided us, we would also have guided you. It makes no difference whether we cry for help or exercise patience; there is no escape for us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will all publicly come in the presence of Allah – then those who were weak will say to those who were the leaders, “We were your followers – is it possible for you to avert some of Allah’s punishment from us?” They will answer, “If Allah had guided us, we would have guided you; it is the same for us, whether we panic or patiently endure – we have no place of refuge.” (* This conversation will take place between the disbelievers and their leaders.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they all shall appear before Allah; then the weak will say to those who were arrogant: \"Verily, we were following you; can you avail us anything against Allah's torment\" They will say: \"Had Allah guided us, we would have guided you. It makes no difference to us (now) whether we rage, or bear (these torments) with patience; there is no place of refuge for us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall all come forth before Allah, then the weak shall say to those who were proud: Surely we were your followers, can you therefore avert from us any part of the chastisement of Allah? They would say: If Allah had guided us, we too would have guided you; it is the same to us whether we are impatient (now) or patient, there is no place for us to fly to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They sally forth unto God, all together; then say the weak to those who waxed proud, 'We were your followers; will you avail us against the chastisement of God anything?' They say, 'If God had guided us, we would have guided you. Alike it is for us whether we cannot endure, or whether we are patient; we have no asylum.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They all come forth unto their Lord. Then those who were despised say unto those who were scornful: We were unto you a following, can ye then avert from us aught of Allah's doom? They say: Had Allah guided us, we should have guided you. Whether we rage or patiently endure is (now) all one for us; we have no place of refuge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall all appear before God and the weak will say to those who behaved proudly, \"We were your followers. Can you protect us from God's punishment?\" They will reply, \"Had God given us guidance, we would have guided you. It is all the same whether we are patient or impatient; there is no escape for us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they all shall appear before Allah, then those who were counted weak shall say to those who were stiff-necked: verily we were unto you a following, are ye going to avail us at all against the torment of AllAh? They Will say: had Allah guided, We would have guided you also; it is equal unto us whether we become impatient or bear patiently; for us there is no place of escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Together they will be presented before Allah. Then those who were weak will say to the arrogant [leaders], ‘Indeed we were your followers. So will you avail us against Allah’s punishment in any wise?’ They will say, ‘Had Allah guided us, surely we would have guided you. It is the same to us whether we are restless or patient: there is no escape for us.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will all be marshalled before Allah together: then will the weak say to those who were arrogant, \"For us, we but followed you; can ye then avail us to all against the wrath of Allah?\" They will reply, \"If we had received the Guidance of Allah, we should have given it to you: to us it makes no difference (now) whether we rage, or bear (these torments) with patience: for ourselves there is no way of escape.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they all shall appear before Allah (on the Day of Resurrection) then the weak will say to those who were arrogant (chiefs): \"Verily, we were following you; can you avail us anything from Allah's Torment?\" They will say: \"Had Allah guided us, we would have guided you. It makes no difference to us (now) whether we rage, or bear (these torments) with patience, there is no place of refuge for us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Together they shall all come before Allah. Then the weak will say to those who were proud: 'We were your followers. Can you help us in anything against the punishment of Allah' They will say: 'Had Allah guided us we would have guided you. It is now the same for us whether we cannot endure or bear patiently, we have no place of refuge'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will emerge before God, altogether. The weak will say to those who were proud, “We were your followers, can you protect us at all against God’s punishment?” They will say, “Had God guided us, we would have guided you. It is the same for us; whether we mourn, or are patient; there is no asylum for us.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will come out [for judgement] before Allah all together, and the weak will say to those who were arrogant, \"Indeed, we were your followers, so can you avail us anything against the punishment of Allah?\" They will say, \"If Allah had guided us, we would have guided you. It is all the same for us whether we show intolerance or are patient: there is for us no place of escape.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:21] And they, that is, [all] creatures, sally forth to God (wa-barazū: this, and what follows, is expressed in the past tense because it will come to pass) all together; then the weak, the followers, say to those who were arrogant, those who were followed: ‘Indeed we were your followers (taba‘an is the plural of tābi‘). Will you then avail, defend, us against the chastisement of God in any way?’ (min ‘adhābi’Llāhi min shay’in: the first min is explicative, while the second one is partitive). They, the ones followed, say, ‘If God had guided us, we would have guided you, we would have called you to [right] guidance. It is the same for us whether we rage [impatiently] or patiently endure; we do not have any asylum’, [any] refuge (min mahīs, ‘any asylum’, min is extra).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جملة { إن يشأ يذهبكم } \\[ إبراهيم : 20 \\] باعتبار جواب الشرط وهو الإذهاب ، وفي الكلام محذوف ، إذ التقدير : فأذْهَبهم وبرزوا لله جميعاً ، أي يوم القيامة .وكان مقتضى الظاهر أن يقول : ويبرزون لله ، فعدل عن المضارع إلى الماضي للتنبيه على تحقيق وقوعه حتى كأنه قد وقع ، مثل قوله تعالى : { أتى أمر الله } \\[ سورة النحل : 1 \\].والبروز : الخروج من مكان حاجب من بيت أو قرية . والمعنى : حشروا من القبور .وجميعاً } تأكيد ليشمل جميعهم من سادة ولفيففٍ .وقد جيء في هذه الآية بوصف حَال الفرق يوم القيامة ، ومجادلة أهل الضلالة مع قادتهم ، ومجادلة الجميع للشيطان ، وكون المؤمنين في شغل عن ذلك بنُزل الكرامة . والغرض من ذلك تنبيه الناس إلى تدارك شأنهم قبل الفوات . فالمقصود : التحذير مما يفضي إلى سوء المصير .واللام الجارة لاسم الجلالة معدية فعل { برزوا } إلى المجرور . يقال : برز لفلان ، إذا ظهر له ، أي حضر بين يديه ، كما يقال : ظهر له .والضعفاء : عوامّ الناس والأتباع . والذين استكبروا : السادة ، لأنهم يتكبرون على العموم وكان التكبر شعار السادة . والسين والتاء للمبالغة في الكبر . والتَبع : اسم جمع التابع مثل الخَدَم والخَوَل ، والفاء لتفريع الاستكبار على التبعية لأنها سبب يقتضي الشفاعة لهم .وموجب تقديم المسند إليه على المسند في { فهل أنتم مغنون عنا } أن المستفهم عنه كون المستكبرين يغنون عنهم لا أصل الغَناء عنهم ، لأنهم آيسون منه لما رأوا آثار الغضب الإلهي عليهم وعلى سادتهم . كما تدلّ عليه حكاية قول المستكبرين { سواء علينا أجزعنا أم صبرنا ما لنا من محيص } ، فعلموا أنهم قد غروهم في الدنيا ، فتعيّن أن الاستفهام مستعمل في التورّك والتوبيخ والتبكيت ، أي فأظهروا مكانتكم عند الله التي كنتم تدعونها وتغروننا بها في الدنيا . فإيلاء المسند إليه حرف الاستفهام قرينة على أنه استفهام غير حقيقي ، وبينه ما في نظيره من سورة غافر ( 47 ، 48 ) { وإذ يتحاجون في النار فيقول الضعفاء للذين استكبروا إنا كنا لكم تبعاً فهل أنتم مغنون عنا نصيباً من النار قال الذين استكبروا إنا كل فيها إن الله قد حكم بين العباد . } ومِنْ } في قوله : { من عذاب الله } بدلية ، أي غناء بدلاً عن عذاب الله . .و { مِنْ } في قوله : { من شيء } مزيدة لوقوع مدخولها في سياق الاستفهام بحرف هل . و { شيء } في معنى المصدر ، وحقه النصب على أنه مفعول مطلق فوقع جرّه بحرف الجر الزائد . والمعنى : هل تغنون عنا شيئاً .وجواب المستكبرين اعتذار عن تغريرهم بأنهم ما قصدوا به توريط أتباعهم كيف وقد ورّطوا أنفسهم أيضاً ، أي لو كنا نافعين لنفعنا أنفسنا . وهذا الجواب جار على معنى الاستفهام التوبيخي العتابي إذ لم يجيبوهم بأنا لا نملك لكم غناء ولكن ابتدأوا بالاعتذار عما صدر منهم نحوهم في الدنيا علماً بأن الضعفاء عالمون بأنهم لا يملكون لهم غناء من العذاب .وجملة { سواء علينا أجزعنا أم صبرنا } من كلام الذين استكبروا . وهي مستأنفة تبيين عن سؤال من الضعفاء يستفتون المستكبرين أيصبرون أم يجزعون تطلباً للخلاص من العذاب ، فأرادوا تأييسهم من ذلك يقولون : لا يفيدنا جزع ولا صبر ، فلا نجاة من العذاب . فضمير المتكلم المشارك شامل للمتكلمين والمجابين ، جمعوا أنفسهم إتماماً للاعتذار عن توريطهم .والجزع : حزن مشوب باضطراب ، والصبر تقدم .وجملة { ما لنا من محيص } واقعة موقع التعليل لمعنى الاستواء ، أي حيث لا محيص ولا نجاة فسواء الجَزع والصبر .والمحيص : مصدر ميمي كالمغيب والمشيب وهو النجاة . يقال : حاص عنه ، أي نجا منه . ويجوز أن يكون اسمَ مكان من حاص أيضاً ، أي ما لنا ملجأ ومكان نَنْجو فيه .\n\n",
      "translations": [
        {
          "translation": "(They all) the leaders and the lowly among people (come forth unto their Lord) they emerge from the graves by Allah's command. (Then those who were despised) the lowly among people (say unto those who were scornful) towards faith, i.e. the leaders: (We were unto you a following) we obeyed your commands, (can ye then avert from us) bear on behalf of us (aught of Allah's doom? They say) i.e. the leaders: (Had Allah guided us) to His religion, (we should have guided you) we would have invited you to His religion. (Whether we rage) for being tormented (or patiently endure) or keep silent (is (now) all one for us: we have no place of refuge) or helper.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ الكل { بَرَزُواْ } أي: ظهروا ورجعوا في النشأة الآخرة { لِلَّهِ } المظهر المبرز لهم من كتم العدم { جَمِيعاً } مجتمعين\n إذ لا يخرج عن حيطته شيء { فَقَالَ ٱلضُّعَفَاءُ } من ذوي الاستعدادات الضعيفة حين أُخذوا بجرائمهم { لِلَّذِينَ ٱسْتَكْبَرُوۤاْ } عليهم في النشأة الأولى بالرئاسة والعقل والتام\n وإدعاء الفضل والكمال إلى حيث جعلوا نوفسهم مبتدعين لهم حيث قالوا: { إِنَّا كُنَّا لَكُمْ تَبَعًا } في دار الدنيا\n وأنتم ناصحون لنا\n آمرون بتكذيب الرسل وأنواع الفواحش والقبائح الممنوعة بألسنة الرسل { فَهَلْ أَنتُمْ } اليوم حي أُخذنا على ما أمرتمونا { مُّغْنُونَ عَنَّا } أي: دافعون مانعون { مِنْ عَذَابِ ٱللَّهِ } المنتقم منا { مِن شَيْءٍ } أي: بعض من عذابنا ونكالنا؟! { قَالُواْ } أي: المستكبرون بعدما عاتبهم الضعفاء: { لَوْ هَدَانَا ٱللَّهُ } الهادي لعباده { لَهَدَيْنَاكُمْ } ولكن أضلنا باسمه المضل\n فأضللناهم\n فالآن نحن وأنتم ضالون ضالمون مؤاخذون { سَوَآءٌ عَلَيْنَآ } وعليكم { أَجَزِعْنَآ } عن شدة العذاب والنكال { أَمْ صَبَرْنَا } على مُقاساته وأحزانه { مَا لَنَا مِن مَّحِيصٍ } [إبراهيم: 21] أي: مخلص ومناص",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: تَبعاً: جمع تابع، أو مصدر نُعت به للمبالغة على حذف مضاف، أي: كنا لكم ذا تبع، ومن عذاب الله من شيء: من، الأولى لبيان، والثانية: زائدة، هذا المختار. وـ عليه الصلاة والسلام ـ ومحيص: إما مصدر، أو اسم مكان. يقول الحق جل جلاله: { وبرزوا لله } أي: لأمر الله { جميعاً } ، فيبرزون من قبورهم يوم القيامة حفاةً عراةً، لفصل القضاء، أو: برزوا لله على ظنهم فإنهم كانوا يرتكبون الفواحش خفية، ويظنون أنها تخفى على الله، فإذا كان يوم القيامة انكشفوا لله عند أنفسهم. وإنما عبَّر بالماضي لتحقق وقوعه. فيقول حينئذٍ { الضعفاءُ } وهم: الأتباع، لضعف رأيهم عندهم، { للذين استكبروا } وهم الرؤساء الذين استتبعوهم وغووهم: { إنا كنا لكم تَبَعاً } في الكفر، وتكذيب الرسل، والإعراض عن نصحهم، { فهل أنتم مُغْنون عنا من عذابِ الله من شيء } أي: فهل أنتم دافعون عنا شيئاً من عذاب الله؟. { قالوا } ، أي: رؤساؤهم، في جوابهم واعتذارهم: { لو هدانا الله لهديناكم } أي: لو هدانا الله للإيمان، ووفقنا إليه لهديناكم ولكن ضللنا فأضللناكم، أي: اخترنا لكم ما اخترنا لأنفسنا، ولو هدانا الله لطريق النجاة من العذاب لهديناكم وأغنيناه عنكم، لكن سُدَّ دوننا طريق الخلاص، { سواءٌ علينا أجزِعْنَا أمْ صَبَرنا } ، أي: مستوٍ علينا الجزع والصبر، { ما لنا من محيص }: من مهرب ومنجى، ويحتمل أن يكون قوله: { سواءٌ علينا... } إلخ، من كلام الفريقين معاً، ويؤيده ما رُوي أنهم يقولون: تعالوا نجزع، فيجزعون خمسمائة عام، فلا ينفعهم، فيقولون: تعالوا نصبر، فيصبرون كذلك، ثم يقولون: { سواء علينا أجزعنا أم صبرنا ما لنا من محيص }. نسأل الله العصمة بمنَّه وكرمه. الإشارة: إذا ترقى العارفون، ومن تعلق بهم، عن عالم الأشباح إلى عالم الأرواح، وبرزوا لشهود الله في كل شيء، وقبل كل شيء، وبعد كل شيء، وعند كل شيء، وتنزهوا في حضرة الأسرار، ورُفعوا يوم القيامة مع المقربين الأبرار، بقي ضعفاء اليقين الذين تعوقوا عن صُحبتهم، في غم الحجاب، وتعب الحس والخواطر، مسجونين في سجن الأكوان، فيقولون لمن عَوَّقهم عن صحبة العارفين من أهل الرئاسة والجاه: إنا كنا لكم تبعاً، فهل تمنعون شيئاً مما نحن فيه من غم الحجاب، وسقوط الدرجة؟ فيقولون: لو هدانا الله لصحبتهم لهديناكم. فإذا نظروا يوم القيامة إلى ارتفاع درجاتهم ضجوا، وفزعوا على ما فاتهم، فلا ينفعهم ذلك فما لهم من محيص عن تخلفهم عن مقام المقربين. رُوي أن أهل عليين إذا أشرفوا على الأسفلين تشرق منازلهم من أنوار وجوههم. وسيأتي ـ إن شاء الله ـ الحديث عند قوله:\n[السجدة: 17]. ثم ذكر خطبة الشيطان على أهل النار فقال: { وَقَالَ ٱلشَّيْطَانُ لَمَّا قُضِيَ ٱلأَمْرُ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:20",
      "similarity": 0.6716897300847224
    },
    {
      "verse": "41:48",
      "similarity": 0.3490255433469233
    },
    {
      "verse": "42:35",
      "similarity": 0.3431388840760445
    },
    {
      "verse": "4:121",
      "similarity": 0.34013647619780035
    },
    {
      "verse": "50:36",
      "similarity": 0.24061624687044728
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/014021.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/014021.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/14:21.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}