{
  "chapter": "ابراهيم",
  "text": "الله الذى له ما فى السموت وما فى الارض وويل للكفرين من عذاب شديد",
  "translations": [
    {
      "translation": "Allah is He to Whom everything in the heavens and everything in the earth belongs. Woe to the kuffar because of a terrible punishment -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God, to whom belongs all there is in the heavens and the earth. Woe to the unbelievers for the terrible punishment (that awaits).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(to the Way of) Allah to Whom belongs all that is in the heavens and all that is in the earth. Woe be to those who reject the Truth for a severe chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs whatever is in the heavens and the earth. Woe to the disbelievers; they will face the most severe punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah – because all that is in the heavens and in the earth belongs only to Him; and woe is for the disbelievers through a severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah to Whom belongs all that is in the heavens and all that is in the earth! And woe unto the disbelievers from a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Of) Allah, Whose is whatever is in the heavens and whatever Is in the earth; and woe to the unbelievers on account of the severe chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God, to whom belongs all that is in the heavens and all that is in the earth. And woe to the unbelievers for a terrible chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth. and woe unto the disbelievers from an awful doom;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to God, who possesses whatever is in the heavens and whatever is on earth. Woe to those who deny the truth, for they shall be sternly punished!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, whose is that which is in the heavens and that which is in the earth; and woe be unto the infidels because of a torment severe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—Allah, to whom belongs whatever is in the heavens and whatever is on the earth. Woe to the faithless for a severe punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of Allah, to Whom do belong all things in the heavens and on earth! But alas for the Unbelievers for a terrible penalty (their Unfaith will bring them)!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah to Whom belongs all that is in the heavens and all that is in the earth! And woe unto the disbelievers from a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah to whom belongs all that is in the heavens and the earth. Woe to the unbelievers for a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God—to whom belongs what is in the heavens and the earth. And woe to the disbelievers from a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, to whom belongs whatever is in the heavens and whatever is on the earth. And woe to the disbelievers from a severe punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:2] God (Allāhi, read in the genitive as a substitution or an explicative supplement, with what follows being an adjectival qualification; or [read as] Allāhu in the nominative as a subject, the predicate of which is [what follows]) to Whom belongs all that is in the heavens and all that is in the earth, as possessions, creatures and servants. And woe to the disbelievers from a terrible chastisement,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah, unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth) of creation and wondrous things. (And woe) this refers to the hottest, narrowest and deepest valley in hell. This valley would cry: \"0 Lord! My heat is intense, my width is very narrow and my depth is so deep, so let me take revenge on those who disobeyed you and make that nothing takes revenge against me\", (unto the disbelievers from an awful doom) a severe torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وويلٌ للكافرينَ } المحجوبين عن الوحدة أو الفطرة أو تجلي الذات وكشفه\n ويترتب على الوجوه الثلاثة مراتب العذاب\n فهو إما عذاب محبّة الأنداد في جحيم التضادّ وإما عذاب هيئات الرذائل ونيران صفات النفس ومقتضيات الطبائع أو عذاب حجب الأفعال والصفات والحرمان عن نور الذات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { وويلٌ للكافرين } بكتابه\n ولم يخرجوا به من ظلمات كفرهم\n { من عذابٍ شديد } \n والويل: كلمة عذاب تقال لمن استحق الهلاك\n أي: هلاك لهم من أجل عذاب شديد يلحقهم\n وقيل: وادٍ في جهنم\n ثم ذكر وجه استحقاقهم العذاب بقوله: { الذين يستحبون الحياةَ الدنيا } يختارونها { على الآخرةِ } \n فإنَّ من أحب شيئاً اختاره وطلبه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:60",
      "similarity": 0.6601176595475426
    },
    {
      "verse": "77:15",
      "similarity": 0.6184954574671655
    },
    {
      "verse": "77:19",
      "similarity": 0.6184954574671655
    },
    {
      "verse": "77:24",
      "similarity": 0.6184954574671655
    },
    {
      "verse": "77:28",
      "similarity": 0.6184954574671655
    }
  ]
}