{
  "chapter": "ابراهيم",
  "text": "الم تر كيف ضرب الله مثلا كلمة طيبة كشجرة طيبة اصلها ثابت وفرعها فى السماء",
  "translations": [
    {
      "translation": "Do you do not see how Allah makes a metaphor of a good word: a good tree whose roots are firm and whose branches are in heaven? It bears fruit regularly by its Lord's permission. Allah makes metaphors for people so that hopefully they will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how God compares a noble act to a healthy tree whose roots are firm and branches in the sky, which yields\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how Allah has given the example of a good word? It is like a good tree, whose root is firmly fixed, and whose branches reach the sky,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consider (Muhammad) how God (in a parable) compares the blessed Word to that of a blessed tree which has firm roots and branches rising up into the sky\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see how Allah illustrated the example of a sacred saying? Like a sacred tree, which has firm roots and branches reaching into heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not how Allah sets forth a parable A goodly word as a goodly tree, whose root is firmly fixed, and its branches (reach) to the sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered how Allah sets forth a parable of a good word (being) like a good tree, whose root is firm and whose branches are in heaven,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how God has struck a similitude? A good word is as a good tree -- its roots are firm, and its branches are in heaven;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not how Allah coineth a similitude: A goodly saying, as a goodly tree, its root set firm, its branches reaching into heaven,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how God compares a good word to a good tree? Its root is firm and its branches are in the sky,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not how Allah hath propounded the similitude of the clean word? It is like a clean tree, its root firmly fixed, and its branches reaching unto heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded how Allah has drawn a parable? A good word is like a good tree: its roots are steady and its branches are in the sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not how Allah sets forth a parable? - A goodly word like a goodly tree, whose root is firmly fixed, and its branches (reach) to the heavens,- of its Lord. So Allah sets forth parables for men, in order that they may receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not how Allah sets forth a parable? - A goodly word as a goodly tree, whose root is firmly fixed, and its branches (reach) to the sky (i.e. very high).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how Allah sets forth a parable that a good deed is like a good tree, its roots are firm and its branches are in the heaven,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how God presents a parable? A good word is like a good tree—its root is firm, and its branches are in the sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered how Allah presents an example, [making] a good word like a good tree, whose root is firmly fixed and its branches [high] in the sky?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:24] Have you not seen, observed, how God has struck a similitude? (mathalan is substituted by [the following words, kalimatan tayyibatan]): a goodly saying, which is, ‘there is no god but God’, is as a goodly tree, a palm tree, its root set firm, in the ground, and its shoots, its branches, are in heaven;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Seest thou you not) have you not been informed, Muhammad, (how Allah coineth a similitude: A goodly saying) He says: how Allah has exposited the description of a goodly saying which is \"there is no god save Allah\", (as a goodly tree) which is the believer, (its root set firm) He says: the heart of the sincere believer is firm by means of \"there is no god save Allah\", (its branches reaching into heaven) He says: due to it the works of a sincere believer are accepted,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ضَرَبَ ٱللَّهُ مَثَلاً كَلِمَةً طَيِّبَةً } قالَ زيد بن علي عليهما السّلامُ: هِي لاَ إله إِلاَّ الله أَصْلُهَا ثَابِتٌ فِي قَلبِ المُؤمِن\n ويقالُ: النَّخلَةُ\n وشَجَرةٌ خَبِيثَةٌ: هِيَ الحَنظَلُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي المعتبر الخبير البصير { كَيْفَ ضَرَبَ ٱللَّهُ } الهادي لعباده إلى توحيده { مَثَلاً } لينتبهوا منه بأن شبه { كَلِمَةً طَيِّبَةً } هي كلمة التوحيد القائلة المفصحة بألا وجود لسوى الحق { كَشَجَرةٍ طَيِّبَةٍ } هي النخلة التي { أَصْلُهَا } وعروقها { ثَابِتٌ } في الأرض بحيث لا يقلعها ولا يشوشها الرياح أصلاً { وَفَرْعُهَا } أي: أفنانها وأغصانها مرتفعة { فِي } جانب { ٱلسَّمَآءِ } [إبراهيم: 24]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: كلمة طيبة: يجوز أن يكون مفعولاً بمحذوف، أي: جعل كلمة، وتكون الجملة تفسيرية لضرب المثل، وأن تكون كلمة: بدلاً من مَثَلاً، وشجرة: صفة لها، أو خبر عن مضمر، أي: هي شجرة\n يقول الحق جل جلاله: { ألم تَرَ } يا محمد، أو أيها السامع، { كيف ضَرَبَ اللهُ مَثَلاً } لأهل \" لا إله إلا الله \" ، وهم: أهل التوحيد، الذين رسخ التوحيد في قلوبهم، وعبّروا عنه بألسنتهم\n فمثال الكلمة الطيبة التي نطقوا بها، ورسخ معناها في قلوبهم { كشجرةٍ طيبةٍ }: كالنخلة مثلاً، { أصلُها ثابت } في الأرض، غائص بعروقه فيها، { وفروعها في السماء } أي: أعلاها",
      "translations": []
    }
  ]
}