{
  "chapter": "ابراهيم",
  "text": "تؤتى اكلها كل حينۭ باذن ربها ويضرب الله الامثال للناس لعلهم يتذكرون",
  "translations": [
    {
      "translation": "It bears fruit regularly by its Lord's permission. Allah makes metaphors for people so that hopefully they will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the leave of its Lord its fruit in all seasons, God presents words of wisdom to men that they might reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ever yielding its fruit in every season with the leave of its Lord. Allah gives examples for mankind that they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and yields fruits in every season, by the permission of its Lord? God sets forth parables for people so that they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bearing fruit at all times by the command of its Lord; and Allah illustrates examples for people so that they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Giving its fruit at all times, by the leave of its Lord, and Allah sets forth parables for mankind in order that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yielding its fruit in every season by the permission of its Lord? And Allah sets forth parables for men that they may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it gives its produce every season by the leave of its Lord. So God strikes similitudes for men; haply they will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Giving its fruit at every season by permission of its Lord? Allah coineth the similitudes for mankind in order that they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it yields its fruit each season with its Lord's permission, God makes such comparisons for people, in order that they may take heed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Giving its fruit at every season, by the command of the Lord. And Allah propoundeth similitudes for mankind that haply they may be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It gives its fruit every season by the leave of its Lord. Allah draws these parables for mankind so that they may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It brings forth its fruit at all times, by the leave of its Lord. So Allah sets forth parables for men, in order that they may receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Giving its fruit at all times, by the Leave of its Lord and Allah sets forth parables for mankind in order that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "yielding its fruit every season by the permission of Allah? Allah gives parables to mankind so that they might remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It yields its fruits every season by the will of its Lord. God presents the parables to the people, so that they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It produces its fruit all the time, by permission of its Lord. And Allah presents examples for the people that perhaps they will be reminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:25] it gives its produce, its fruit, every season by the leave of its Lord, by His will. Similarly, the words of faith are set firm in the heart of the believer; his works are raised up to heaven and he receives the blessings and reward therefrom all the time. And God strikes, He makes clear, similitudes for mankind, so that they might remember, be admonished, and therefore believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Giving its fruit at every season) He says: the sincere believer performs goodness and acts of obedience to Allah at all times (by permission of its Lord?) He says: by command of its Lord; it is also said: the trait of a goodly saying insofar as its benefit and praise are concerned is like a goodly tree-the palm-tree-whose fruits are goodly. And the same goes for the believer. He says: the origin of the tree is firmly grounded in the soil by means of its roots, and so is the believer: he is firm by means of proof and argument. (Its branches reaching into heaven) He says: the branches of the palm-trees are raised towards the sky, and so are the works of the believer raised to heaven. (Giving its fruit at every season) He says: it yields fruits every six months by the will of its Lord, and so is the believer, he performs acts of goodness or obedience at all times. (Allah coineth the similitudes) thus Allah explains His divine Oneness by coining similes (for mankind in order that they may reflect) so that people may take heed and desire to profess His divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تُؤْتِيۤ أُكُلَهَا كُلَّ حِينٍ } معناه كُلُّ سِتةِ أَشهرٍ يَخرُجُ ثَمَرُها\n ويقالُ الحِينُ: غُدوةٌ وعَشيةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تُؤْتِيۤ أُكُلَهَا } أي: ثمارها { كُلَّ حِينٍ } من الأحيان المعينة للإثمار { بِإِذْنِ رَبِّهَا } أي: بإرادته ومشيئته؛ يعني: كما أن النخلة تنمو وتثمر بسبب أصلها الثابت في الأرض وفرعها المرتفع نحو السمااء، ويحصل منها الثمر وقت حصولها، كذلك الكلمة الطيبة التوحيدية المستقرة، أصلها في أراضي الاستعدادات الطفرية المرتفعة أغصانها وأفنانها نحو سماء العالم الروحاني، المثمرة لثمرات المكاشفات والمشاهدات، القالعة القامعة لأشواك الكثرات، الناشئة من الإضافات العدمية { وَ } لا حاجة لأولي البصائر والألباب، المنكشفين بصرافة الوحدة الذاتية إلى أمثال هذه التنبيهات، بل { يَضْرِبُ ٱللَّهُ } المطلع لسرائر استعدادات عباده { ٱلأَمْثَالَ } المذكورة { لِلنَّاسِ } الناسين عهودهم ومواثيقم مع الله بُحجب تعيناتهم المستتبعة للإضافات والكثرات { لَعَلَّهُمْ يَتَذَكَّرُونَ } [إبراهيم: 25] رجاء أن يتذكروا ما نسوا من أمثال هذه الأمثال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أي: يريد الجنس، أي: فروعها وأفنانها في السماء، { تُؤتي أًكُلُها }: تُعطى ما يؤكل من ثمرها { كل حين } وقَّته الله لإثمارها، فقيل: سنة، وبه قال ابن عباس وجماعة من المفسرين والفقهاء، واستدلوا بها على من حلف لا يُكلم أخاه حيناً لزمه سنة، وعن ابن عباس أيضاً والضحاك وغيرهما: { كل حين } أي: غدوة وعشية، ومتى أريد جناها، قلت: وهذا هو الظاهر\n  واخْتُلف في هذه الشجرة الطيبة، التي ضرب الله بها المثل لكلمة الإخلاص، فقيل: غير معينة، وقيل: النخلة، وبه قال الجمهور\n قال الشطيبي: وقيل: جوزة الهند، فإنها ثابتة الأصل، متصلة النفع، يكون طعمها أولاً لبناً، ثم عسلاً، ثم تنعقد طعاماً، ويصنع بلبنها ما يصنع بلبن المواشي، ثم يكون كالخل، ثم كالخمر، ثم كالزيت، كل هذا قبل عقد الطعم، وأما النخلة فهي: ستة أشهر طلع رخص، وستة أشهر رطب طيب، فنفعه متصل\n وقال ابو حنيفة: إنه ببلاد اليمن نوعٌ من التمر، يقال له: الباهين، يطعم السنة كلها\n هـ\n قلت: وقد ذكر ابن مقشب جوزة الهند، ووصفها كما قال الشطيبي، وقوله: \" في النخلة ستة أشهر\n\n\n \" الخ، فيه نظر، وصوابه: ثلاثة، فإن المعاينة ترده\n والمشبه بهذه الشجرة: المؤمن الكامل الدائم نفعه، المتصل علمه، أوقاته معمورة بذكر الله، أو تذكير عباد الله، وحركاته وسكناته في طاعة الله، حيث أراد بها وجه الله، فكل حين وساعة يصعد منه عمل إلى الله\n ثم قال تعالى: { ويضربُ الله الأمثال للناس لَعلهم يتذكرون } لأن في ضربها زيادة إيضاح وإفهام وتذكير فإنه تصوير للمعاني وتقريبها من الحس، لتفهم سريعاً",
      "translations": []
    }
  ]
}