{
  "chapter": "ابراهيم",
  "text": "وادخل الذين ءامنوا۟ وعملوا۟ الصلحت جنت تجرى من تحتها الانهر خلدين فيها باذن ربهم تحيتهم فيها سلم",
  "translations": [
    {
      "translation": "Those who believed and did the right, will be admitted to gardens with rivers flowing by, where they will abide by the leave of their Lord, with 'Peace' as their salutation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who had believed and did good in the world, they shall be admitted to the Gardens beneath which rivers flow. There, with the leave of Allah, they shall abide forever, and will be greeted with: \"Peace\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteously striving believers will be admitted to the gardens wherein streams flow and they will live therein forever, by the permission of their Lord. Their greeting to each other will be, \"Peace be with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and did good deeds will be admitted into Gardens beneath which rivers flow, abiding in it forever, by the command of their Lord; their greeting in it is “Peace”.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and did righteous deeds, will be made to enter Gardens under which rivers flow, - to dwell therein for ever (i.e. in Paradise), with the permission of their Lord. Their greeting therein will be: \"Salam (peace!).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and do good are made to enter gardens, beneath which rivers flow, to abide in them by their Lord's permission; their greeting therein is, Peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but as for those who believe, and do deeds of righteousness, they shall be admitted to gardens underneath which rivers flow, therein dwelling forever, by the leave of their Lord, their greeting therein: 'Peace!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and did good works are made to enter Gardens underneath which rivers flow, therein abiding by permission of their Lord, their greeting therein: Peace!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believed and did good deeds will be brought into Gardens with rivers flowing through them. They shall abide there forever by their Lord's permission, and will be welcomed with the greeting, \"Peace\"!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and worked righteous works shall be made to enter Gardens whereunder rivers flow as abiders therein by the command of their Lord, their greeting therein will be: peace!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have faith and do righteous deeds will be admitted into gardens with streams running in them, to remain in them [forever], by the leave of their Lord. Their greeting therein will be ‘Peace!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and work righteousness will be admitted to gardens beneath which rivers flow,- to dwell therein for aye with the leave of their Lord. Their greeting therein will be: \"Peace!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed (in the Oneness of Allah and His Messengers and whatever they brought) and did righteous deeds, will be made to enter Gardens under which rivers flow, - to dwell therein forever (i.e. in Paradise), with the permission of their Lord. Their greeting therein will be: Salam (peace!).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good works, they shall be admitted to gardens underneath which rivers flow in which, by the permission of their Lord, they shall live for ever. Their greeting shall be: 'Peace'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believed and did good deeds will be admitted into gardens beneath which rivers flow, to remain therein forever, by leave of their Lord. Their greeting therein will be: “Peace.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and did righteous deeds will be admitted to gardens beneath which rivers flow, abiding eternally therein by permission of their Lord; and their greeting therein will be, \"Peace!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:23] And those who believed and performed righteous deeds, they are admitted to gardens underneath which rivers flow, abiding (khālidīna is a circumstantial qualifier of an implied situation) therein by the leave of their Lord, their greeting therein, from God and from the angels, and between themselves: ‘Peace!’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who believed) in Muhammad (pbuh) and in the Qur'an (and did good works) acts of obedience such none knows them except Allah (are made to enter Gardens beneath which) beneath its trees and habitations (rivers) of wine, water, honey and milk (flow, therein abiding by permission of their Lord) by the command of their Lord, (their greeting) their favour (therein) in Paradise: (Peace!) when they meet therein, they greet one another.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفقال: { وَأُدْخِلَ ٱلَّذِينَ آمَنُواْ } بتوحيد الله وتصديق كتبه ورسله { وَ } مع ذلك { عَمِلُواْ ٱلصَّالِحَاتِ } التي هي نتائج الإيمان { جَنَّاتٍ } متنزهات من العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } لتنبت في أراضي استعداداتهم وقابلياتهم ما لاعين رأت ولا أذن سمعت ولا خطر على قلب بشر من المكاشفات والمشاهدات الخارجة عن طريق البشر، ومع ذلك { خَالِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ } أي: برضاه وتوفيقه وتيسيره { تَحِيَّتُهُمْ } من قبل الحق بلسان الملائكة حتن ملاقاتهم { فِيهَا سَلاَمٌ } [إبراهيم: 23] لأنهم مسلمون منقادون مسلمون أمورهم كلها إلى الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وأدخل الذين آمنوا } ، أي: أدخلهم الله على أيدي الملائكة { جنات تجري من تحتها الأنهارُ خالدين فيها } ، فيدخلونها { بإذن ربهم } بأمره، فيأذن للملائكة أن تُدخلهم حين يقضي بينهم\n { تحيتُهم فيها سلامٌ } أي: تحييهم الملائكة، أو الخدام، حين يتلقونهم يسلمون عليهم، ويهنئونهم، على ما في الحديث\n الإشارة: في ذكر هذه الآية بعد خطبة الشيطان تنبيه على وجه الخلاص منه، حتى لا يكون من أهل خطبته، وهو تصحيح الإيمان وتقوية مواده، وهو ما ذكرنا قبل في مواد طمأنينة أهل الإيمان، وإن أسعده الله بصحبة عارف رقَّاه إلى شهود العيان، فلا يكون للشيطان ولا لغيره عليه سلطان، لتحقيق عبوديته، وارتقائه إلى شهود عظمة ربوبيته قال تعالى:\n",
      "translations": []
    }
  ]
}