{
  "chapter": "ابراهيم",
  "text": "وقال الشيطن لما قضى الامر ان الله وعدكم وعد الحق ووعدتكم فاخلفتكم وما كان لى عليكم من سلطن الا ان دعوتكم فاستجبتم لى فلا تلومونى ولوموا۟ انفسكم ما انا۠ بمصرخكم وما انتم بمصرخى انى كفرت بما اشركتمون من قبل ان الظلمين لهم عذاب اليم",
  "translations": [
    {
      "translation": "When the affair is decided Shaytan will say, 'Allah made you a promise, a promise of truth, and I made you a promise but broke my promise. I had no authority over you, except that I called you and you responded to me. Do not, therefore, blame me but blame yourselves. I cannot come to your aid nor you to mine. I reject the way you associated me with Allah before.' The wrongdoers will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the reckoning is over Satan will say: \"The promise that was made to you by God was indeed a true promise; but I went back on the promise I had made, for I had no power over you except to call you; and you responded to my call. So blame me not, but blame yourselves. Neither can I help you nor can you give me help. I disavow your having associated me earlier (with God). The punishment for those who are wicked is painful indeed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After the matter has been finally decided Satan will say: \"Surely whatever Allah promised you was true; as for me, I went back on the promise I made to you. I had no power over you except that I called you to my way and you responded to me. So, do not blame me but blame yourselves. Here, neither I can come to your rescue, nor can you come to mine. I disavow your former act of associating me in the past with Allah. A grievous chastisement inevitably lies ahead for such wrong-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the decree of God is issued, satan will say, \"God's promise to you was true, but I, too, made a promise to you and disregarded it. I had no authority over you. I just called you and you answered. Do not blame me but blame yourselves. I cannot help you and you cannot help me. I did not agree with your belief that I was equal to God.\" The unjust will face a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Satan will say when the matter has been decided, “Indeed Allah had given you a true promise – and the promise I gave you, I made it untrue to you; and I had no control over you except that I called you and you obeyed me; so do not accuse me, blame only yourselves; neither can I help you, nor can you help me; I have no concern with your ascribing me as a partner (to Allah); indeed for the unjust is a painful punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Shaytan will say when the matter has been decided: \"Verily, Allah promised you a promise of truth. And I too promised you, but I betrayed you. I had no authority over you except that I called you, and you responded to me. So blame me not, but blame yourselves. I cannot help you, nor can you help me. I deny your former act in associating me (Shaytan) as a partner with Allah (by obeying me in the life of the world). Verily, there is a painful torment for the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Shaitan shall say after the affair is decided: Surely Allah promised you the promise of truth, and I gave you promises, then failed to keep them to you, and I had no authority over you, except that I called you and you obeyed me, therefore do not blame me but blame yourselves: I cannot be your aider (now) nor can you be my aiders; surely I disbelieved in your associating me with Allah before; surely it is the unjust that shall have the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Satan says, when the issue is decided, 'God surely promised you a true promise; and I promised you, then I failed you, for I had no authority over you, but that I called you, and you answered me. So do not blame me, but blame yourselves; I cannot aid you, neither can you aid me. I disbelieved in your associating me with God aforetime.' As for the evildoers, for them awaits a painful chastisement;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Satan saith, when the matter hath been decided: Lo! Allah promised you a promise of truth; and I promised you, then failed you. And I had no power over you save that I called unto you and ye obeyed me. So blame not, but blame yourselves. I cannot help you, nor can ye help me, Lo! I disbelieved in that which ye before ascribed to me. Lo! for wrong-doers is a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Judgement has been passed, Satan will say to them, \"God made you a true promise; I too made you promises, but I failed you. I had no authority over you, except that I called you and you responded to me. Do not now blame me, but blame yourselves! I cannot help you, nor can you help me. I reject your former  act in associating me with God.\" The wrongdoers will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Satan will say, When the affair hath been decreed: verily Allah promised you a promise of truth; and I promised you, then I failed; and I had over you no authoyourity, save that I called you and ye answered me; wherefore reproach not but reproach yourself. I am not me going to succour you nor are ye going to succour me: verily I disbelieve in your having associated me afore. Verily the wrong-doers! for them is a torment zfflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the matter is all over, Satan will say, ‘Indeed Allah made you a promise that was true and I [too] made you a promise, but I failed you. I had no authority over you, except that I called you and you responded to me. So do not blame me, but blame yourselves. I cannot respond to your distress calls, neither can you respond to my distress calls. Indeed I disavow your taking me for [Allah’s] partner aforetime. There is indeed a painful punishment for the wrongdoers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Satan will say when the matter is decided: \"It was Allah Who gave you a promise of Truth: I too promised, but I failed in my promise to you. I had no authority over you except to call you but ye listened to me: then reproach not me, but reproach your own souls. I cannot listen to your cries, nor can ye listen to mine. I reject your former act in associating me with Allah. For wrong-doers there must be a grievous penalty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Shaitan (Satan) will say when the matter has been decided: \"Verily, Allah promised you a promise of truth. And I too promised you, but I betrayed you. I had no authority over you except that I called you, so you responded to me. So blame me not, but blame yourselves. I cannot help you, nor can you help me. I deny your former act in associating me (Satan) as a partner with Allah (by obeying me in the life of the world). Verily, there is a painful torment for the Zalimun (polytheists and wrong-doers, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the issue has been decided, satan will say (to them): 'The promise which Allah made you was true. I promised you, but failed to keep it. I had no authority over you except that I called you, and you answered me. Do not bame me, rather, blame yourselves. I cannot help you, nor can you help me. I disbelieved in your associating me (with Allah) before' Indeed, for the evildoers there is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Satan will say, when the issue is settled, “God has promised you the promise of truth, and I promised you, but I failed you. I had no authority over you, except that I called you, and you answered me. So do not blame me, but blame yourselves. I cannot come to your aid, nor can you come to my aid. I reject your associating with me in the past. The wrongdoers will have a torment most painful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Satan will say when the matter has been concluded, \"Indeed, Allah had promised you the promise of truth. And I promised you, but I betrayed you. But I had no authority over you except that I invited you, and you responded to me. So do not blame me; but blame yourselves. I cannot be called to your aid, nor can you be called to my aid. Indeed, I deny your association of me [with Allah] before. Indeed, for the wrongdoers is a painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:22] And Satan, Iblīs, says, when the issue has been decided, and the people of Paradise are in Paradise and those of the Fire are in the Fire, and they [the people of the Fire] have gathered round him: ‘Truly God promised you a promise of truth, regarding resurrection and requital, fulfilling [it] to you; whereas I promised you, that this would not be, then failed you, for over you I had no warrant (min sultān: min is extra), [no] power or capacity, to compel you to follow me, except that I called you and you responded to me. So do not blame me, but blame yourselves, for having responded to me. I cannot heed your [distress] call, [I cannot] bring aid to you, nor can you heed mine (read bi-musrikhiyya or bi-musrikhī). Lo! I disbelieved in your making me an associate of God formerly’, during life on earth. God, exalted be He, says: Truly for the evildoers, the disbelievers, there shall be a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Satan) Iblis (says, when the matter hath been decided) when the people of Paradise enter Paradise and the people of hell enter hell; he says to the people of hell when they are in hell: (Lo! Allah promised you a promise of truth) He promised you that Paradise, hell, the Resurrection, the Reckoning, the Scale and the Bridge over hell are all true; (and I promised you) that there is no Paradise, hell, the Resurrection, the Reckoning, the Scale or the Bridge over hell, (then failed you) I lied to you. (And I had no power) proof, reason or power (over you save that I called unto you) to obey me (and ye obeyed me. So blame me not) for calling you, (but blame yourselves) for answering me. (I cannot help you) save you from the chastisement of hell, (nor can ye help me) nor can you save me from entering hell. (Lo! I disbelieved in that which ye before) before you associated it with me; it is also said that this means: I disbelieve today in that which you associate with me; he says: I disassociate myself from you and from your religion and from your 267 response to me before this, i.e. in the worldly life (ascribed to me) you associated with me. (Lo! For wrong- doers) for the disbelievers (is a painful doom) a severe torment that will extend to their hearts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَّآ أَنَاْ بِمُصْرِخِكُمْ } معناه بِمُعينِكُم\n\n\n\n\nوقوله تعالى: { إِنِّي كَفَرْتُ بِمَآ أَشْرَكْتُمُونِ مِن قَبْلُ } يعني بَرئتُ مِنكُم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, \"I am not responsible for your destruction\" [Qur'an 6:149] means with your destruction.\n\n\nAnd His saying, {Indeed, I have disbelieved in what you have associated with Me before}, means that I have disowned you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَ ٱلشَّيْطَانُ } أي: الأهوية الفاسدة المفسدة لهم في شأنهم الأولى مصورة على صورة الشيطان المغوي { لَمَّا قُضِيَ ٱلأَمْرُ } أي: بعد استقرار أهل الجنة في الجنة وأهل النار في النار: { إِنَّ ٱللَّهَ } المصلح المدبر لأحوال عباده { وَعَدَكُمْ وَعْدَ ٱلْحَقِّ } هذا اليوم الذي به تؤاخذون فيه { وَوَعَدتُّكُمْ } ضلالاً وإغراء لكم بخلافه { فَأَخْلَفْتُكُمْ } ما وعد به ربكم مع أن إنجازه مقطوع به لا شك فيه أصلاً\n وابتعتم قولي مع أنه غرور وإضلال لا يرجى إنجازه مني أصلاً وأنتم جازمون به { وَ } الحال أنه { مَا كَانَ لِيَ عَلَيْكُمْ مِّن سُلْطَانٍ } حجة مرجحة وأدلة ملجئة { إِلاَّ أَن دَعَوْتُكُمْ } أي: سوى أن دعوتكم على مقتضى أهويتكم وأمنيتكم التي تقتضيها هويتكم وماهيتكم\n ومع ذلك { فَٱسْتَجَبْتُمْ لِي } وصدقتم قولي بلا تردد ومماطلة طوعاً ورغبة\n\n\n{ فَلاَ تَلُومُونِي } اليوم { وَلُومُوۤاْ أَنفُسَكُمْ } الباعثة الداعية على متابعتي مع جزمكم بمكري وعداوتي { مَّآ أَنَاْ } اليوم { بِمُصْرِخِكُمْ } أي: مغيثكم ومعينكم\n وإن ادعيت فيمامضى تغريراً وتلبيساً { وَمَآ أَنتُمْ } أيضاً { بِمُصْرِخِيَّ } إذا انكشف الحال وانقطعت علاقة المحبة بيننا\n وصارت كل نفس رهينة بما كسبت { إِنِّي } اليوم بعد انكشاف السرائر والضمائر { كَفَرْتُ } أي: تبرأت وأنكرت { بِمَآ أَشْرَكْتُمُونِ } أي: بإشراككم معي في إشراك الله الواحد الأحد الصمد\n الذي لا شريك له أصلاً { مِن قَبْلُ } في دار التلبيس والتزوير والإغواء والتغرير { إِنَّ ٱلظَّالِمِينَ } الخارجين عن مقتضيات أوامر الله ونواهيه عداوناً وزوراً { لَهُمْ } اليوم { عَذَابٌ أَلِيمٌ } [إبراهيم: 22] مؤلم أشد الإيلام\n\n\nثم بيَّن سبحانه على مقتضى سنته المستمرة بعدما بين أحوال الهالكين المنهمكين في تيه العتو والعناد\n وفظاعة أمرهم في يوم الجزاء مآل المؤمنين الناجين عن تغريرات الدنيا الدنية وتسويلات الشياطين الغوية فيها\n\n\nفقال: { وَأُدْخِلَ ٱلَّذِينَ آمَنُواْ } بتوحيد الله وتصديق كتبه ورسله { وَ } مع ذلك { عَمِلُواْ ٱلصَّالِحَاتِ } التي هي نتائج الإيمان { جَنَّاتٍ } متنزهات من العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } لتنبت في أراضي استعداداتهم وقابلياتهم ما لاعين رأت ولا أذن سمعت ولا خطر على قلب بشر من المكاشفات والمشاهدات الخارجة عن طريق البشر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: إلا أن دعوتُكم: الاستثناء منقطع، ويجوز الاتصال، وبما أشركتمون: مصدرية، أو موصولة اسمية، ومن قبل: يتعلق بأشركتمون، وعلى الثاني: بكفرت. يقول الحق جل جلاله: { وقال الشيطانُ } ، أي إبليس الأقدم { لمَّا قُضِي الأمرُ } أي: أمر الحساب، وفرغ منه، ودخل أهل الجنةِ الجنة، وأهلُ النارِ النارَ. رُوي أنه يُنصب له منبر من نار، فيقوم خطيباً في النار على أهل النار، يعني على الأشقياء من الثقَلين، فيقول في خطبته: { إن الله وعدكم وعدَ الحق } ، أي: وعداً حقاً أنجزه لكم، وهو وعد البعث والجزاء، { ووعدتكم } وعد الباطل، وهو: ألاَّ بعث ولا حساب، وإن كان واقعاً شيء من ذلك فالأصنام تشفع لكم، { فأخْلَفتكم } ، أي: فظهر خلاف ما وعدتكم، جعل تبين خلف وعده كالإخلاف منه، مجازاً. { وما كان لِيَ عليكم من سلطان } من تسلط، فألجئكم إلى الكفر والمعاصي، { إلا أن دعوتُكم } إلا دعائي إياكم بتسويل وتزيين، { فاستجبْتمْ لِي } ، وهو ليس من جنس التسلط، لكنه تهكم بهم، على طريقة قوله:\nويجوز أن يكون الاستثناء منقطعاً، أي: ما تسلطت عليكم بالقهر، لكن دعوتكم فأسرعتم إجابتي، { فلا تلوموني } فإنَّ من اشتهر بالعداوة لا يُلام على أمثال ذلك، { ولُوموا أنفسكم } حيث أطعتموني حين دعوتكم، ولم تطيعوا ربكم لما دعاكم. ولا حجة للمعتزلة في الآية على أن العبد يخلق أفعاله لأن كسب العبد مقدر في ظاهر الأمر، لقيام عالم الحكمة، وهو رداء لعالم القدرة، فالقدرة تبرز، والحكمة تستر، وهو ما يظهر من اختيار العبد، ولا اختيار له في الحقيقة قال تعالى\n[الأنعام: 112]\n[الإنسان: 30، التكوير: 29]. ثم قال لهم: { ما أنا بمُصْرخِكُم }: بمغيثكم من العذاب، { وما أنتم بمُصْرخِيَّ }: بمغيثي، { إني كفرت بما أشركتمونِ من قبلُ } ، أي: إني كفرت اليوم بإشراككم إياي من قبل هذا اليوم في دار الدنيا، بمعنى: تبرأت منه واستنكرته، كقوله تعالى\n[فاطر: 14]. أو: أني كفرت بالله الذي أشركتموني معه في طاعته من قبل، حين امتنعْت من السجود. والأول أظهر. قال تعالى: { إنَّ الظالمين لهم عذابٌ أليم }. ويحتمل أن يكون من تتمة خطبة الشيطان، قال البيضاوي: وفي حكاية أمثال ذلك لطف للسامعين، وإيقاظ لهم، حتى يُحاسبوا أنفسهم ويتدبروا عواقبهم. هـ.  الإشارة: ينبغي لك أيها العبد الصالح الناصح لنفسه ان تصغي بسمع قلبك إلى هذه المقالة، التي تصدر من الشيطان عند فوات الأوان، فتبادر إلى خلاص نفسك ما دمت في قيد حياتك، قبل حلول رمسك، قبل أن تزل بك القدم، حيث لا ينفعك الندم، فتحاسب نفسك، وتتدبر في عواقب أمرك، وتصحح عقائد توحيدك، وتعمل جهدك في طاعة ربك، وتجتنب مواقع غرور الشيطان، وتعتمد على فضل الكريم المنان، وتجعل الموت نصب عينيك، وما هو مستقبل تجعله حاصلاً، وما هو متوقع تجعله واقعاً فكل ما هو آت قريب، و\n[الأنعام: 134]. وفي الحِكَم: \" لو أشرق نور اليقين في قلبك لرأيت الآخرة أقرب من أن ترحل إليها، ولرأيت محاسن الدنيا وكسفة الفناء ظاهرة عليها \". وبالله التوفيق. ثمَّ تشفع بأضداد من غرهم الشيطان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:37",
      "similarity": 0.5860823864399087
    },
    {
      "verse": "36:43",
      "similarity": 0.5076429130017096
    },
    {
      "verse": "28:18",
      "similarity": 0.42321428554983537
    },
    {
      "verse": "68:30",
      "similarity": 0.29605312186055033
    },
    {
      "verse": "51:54",
      "similarity": 0.28852109641293217
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/14:22.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/14:22.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/14:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}