{
  "chapter": "ابراهيم",
  "text": "ربنا انى اسكنت من ذريتى بواد غير ذى زرع عند بيتك المحرم ربنا ليقيموا۟ الصلوة فاجعل افـدة من الناس تهوى اليهم وارزقهم من الثمرت لعلهم يشكرون",
  "translations": [
    {
      "translation": "Our Lord! I have settled some of my offspring by Your Sacred House in an uncultivated valley. Our Lord! Let them establish salat! Make the hearts of mankind incline towards them and provide them with fruits, so that hopefully they will be thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have settled some of my children, O Lord, in a barren valley near Your sacred House, so that, O our Lord, they may be constant in devotion. So put in the hearts of men some kindness for them, and provide fruits for them: They may haply be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! I have made some of my offspring settle in a barren valley near Your Sacred House! Our Lord! I did so that they may establish Prayer. So make the hearts of people affectionately inclined to them, and provide them with fruits for their sustenance that they may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, I have settled some of my offspring in a barren valley near your Sacred House so that they could be steadfast in prayer. Lord, fill the hearts of the people with love for them and produce fruits for their sustenance so that they may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O our Lord! I have settled some of my descendants in a valley having no cultivation, near Your Sacred House – O our Lord! So that they may keep the prayer established, therefore incline some hearts of men towards them, and provide them fruits to eat – perhaps they may be thankful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord! I have made some of my offspring dwell in an uncultivable valley by Your Sacred House in order, O our Lord, that they may perform Salah. So fill some hearts among men with love towards them, and (O Allah) provide them with fruits so that they may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord! surely I have settled a part of my offspring in a valley unproductive of fruit near Thy Sacred House, our Lord! that they may keep up prayer; therefore make the hearts of some people yearn towards them and provide them with fruits; haply they may be grateful:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, I have made some of my seed to dwell in a valley where is no sown land by Thy Holy House; Our Lord, let them perform the prayer, and make hearts of men yearn towards them, and provide them with fruits; haply they will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Lo! I have settled some of my posterity in an uncultivable valley near unto Thy holy House, our Lord! that they may establish proper worship; so incline some hearts of men that they may yearn toward them, and provide Thou them with fruits in order that they may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Lord! I have settled some of my offspring in an uncultivable valley near Your Sacred House, Lord, so that they might establish their prayers. So, make people's hearts incline towards them and provide them with fruits so that they may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! verily have caused some of my progeny to dwell in a valley uncultivable near Thy Sacred House, Our Lord! in order that they may establish prayer; make Thou therefore the hearts of some of mankind to Yearn toward them, and provide them Thou With fruits, haply they may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! I have settled part of my descendants in a barren valley, by Your sacred House, our Lord, that they may maintain the prayer. So make the hearts of a part of the people fond of them, and provide them with fruits, so that they may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord! I have made some of my offspring to dwell in a valley without cultivation, by Thy Sacred House; in order, O our Lord, that they may establish regular Prayer: so fill the hearts of some among men with love towards them, and feed them with fruits: so that they may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord! I have made some of my offspring to dwell in an uncultivable valley by Your Sacred House (the Ka'bah at Makkah); in order, O our Lord, that they may perform As-Salat (Iqamat-as-Salat), so fill some hearts among men with love towards them, and (O Allah) provide them with fruits so that they may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, I have settled some of my offspring in a barren valley near Your Holy House; our Lord, in order that they establish the prayer. Make the hearts of people yearn towards them, and provide them with fruits, in order that they are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord, I have settled some of my offspring in a valley of no vegetation, by Your Sacred House, our Lord, so that they may perform the prayers. So make the hearts of some people incline towards them, and provide them with fruits, that they may be thankful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, I have settled some of my descendants in an uncultivated valley near Your sacred House, our Lord, that they may establish prayer. So make hearts among the people incline toward them and provide for them from the fruits that they might be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:37] Our Lord, indeed I have made some of my seed, that is, Ishmael and his mother Hagar, to dwell in a valley where there is no sown land, namely, Mecca, by Your Sacred House, which had been there since before the Flood, our Lord, that they may establish prayer. So make some of the hearts of men yearn, incline and long, towards them — Ibn ‘Abbās said, ‘Had He said: “Make [all] the hearts of men …”, assuredly the Persians, the Byzantines and all of mankind would have yearned towards them’. And provide them with fruits, that they might be thankful: and this [petition] was granted, for [the town of] al-Tā’if was transferred to that [land].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord!) our Lord! (Lo! I have settled some of my posterity) Ishmael and his mother Hagar (in an uncultivable valley) in a valley with no vegetation or crops (near unto Thy holy House) i.e. Mecca, (our Lord!) our Lord! (that they may establish proper worship) so that they perform the prayer faced towards the Ka'bah; (so incline some hearts of men) the hearts of some men (that they may yearn towards them) long and head towards them every year, (and provide Thou them with fruits) with different kinds of fruit (in order that they may be thankful) so that they are grateful for your blessings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱجْعَلْ أَفْئِدَةً مِّنَ ٱلنَّاسِ } والأَفئِدةُ: الجَماعةُ! و: { تَهْوِىۤ إِلَيْهِمْ } معناهُ قُلوبُهم تَهوِي إِلى البَيتِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {So make the hearts of mankind} and the hearts: the people! And: {be inclined to them} its meaning is their hearts be inclined to the House",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ياـي بها الزوار والتجار { لَعَلَّهُمْ يَشْكُرُونَ } [إبراهيم: 37] نعمتك ويواظبون على طاعتك وخدمة بيتك عن فراغ القلب\n\n\n{ رَبَّنَآ } يا من ربانا بأنواع اللطف والكرم { إِنَّكَ تَعْلَمُ مَا نُخْفِي } من حوائجنا { وَمَا نُعْلِنُ } أي: ما لنا علم به\n إذ أنت أعلم بحوائجنا منا\n إذ علمك بنا وبجميع مظاهرك حضوري ذاتي\n ولا علم لنا بذاتنا كذلك\n بل نحن عاجزون عن إدراك أنفسنا كعجزنا عن إدراك ذاتك يا مولانا\n لذلك قال صلى الله عليه وسلم:\n \" من عرف نفسه فقد عرف به \" \n{ وَ } كيف يخفى عليك حوائجنا\n إذ { مَا يَخْفَىٰ } ويستر { عَلَى ٱللَّهِ } المحيط بكل الأشياء { مِن شَيْءٍ } لذلك ظاهر { فَي ٱلأَرْضِ وَلاَ فِي ٱلسَّمَآءِ } [إبراهيم: 38] وكيف خفي عليه شيء\n إذ هو عالم بها\n مظهر لها لا يعرزب عنه شيء منها\n\n\n{ ٱلْحَمْدُ } والمنة { لِلَّهِ ٱلَّذِي وَهَبَ لِي } من يخلفني ويحيي اسمي حين آيست",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { عند بيتك المحرَّم } الذي حَرَّمه على الجبابرة من التعرض له والتهاون به\n أو: لم يزل محترماً تهابُه الجبابرة\n أو مُنع منه الطوفان\n فلم يستأصله ويمح أثره\n وهذا الدعاء وقع منه أول ما قدم\n ولم يكن موجوداً\n فلعله قال ذلك باعتبار ما كان\n أي: عند أثر بيتك المحرم\n أو باعتبار ما يؤول إليه من بنائه وعمارته واحترامه\n وقصةُ إنزاله ولده بمكة: أن هاجر كانت مملوكة لسارة\n وهبها لها جبارٌ من الجبابرة وذلك أن إبراهيم عليه السلام دخل مدينة\n وكان فيها جبار يغصب النساء الجميلات\n فأخذها\n وأدخلها بيتاً\n فلما دخل عليها دعت عليه\n فسقط\n ثم قالت: يا رب إن مات قتلوني فيه\n فقام\n فلما دنا منها\n دعت عليه\n فسقط\n فقال في الثالثة: ما هذه إلا شيطانة\n أخرجوها عني\n وأعطوها هاجر\n فعصمها الله منه\n وأخدمها هاجر\n ثم وهبتها لإبراهيم\n فوطئها فحملت بإسماعيل\n فلما ولدته غارت منها فتعب إبراهيم معها\n ثم ناشدته\n سارةُ أن يخرجها من عندها\n فركب البراق\n وخرج بها تحمل ولدها حتى أنزلها مكة\n تحت دوحة\n قريباً من موضع زمزم\n فلما ولى تبعته\n وهي تقول: لِمنْ تتركنا في هذه البلاد\n وليس بها أنيس؟ ثم قالت: \" أألله أمرك بهذا؟ قال: نعم\n قالت: إذاً لا يُضيعنا\n\nفرجعت تأكل من مِزود\n تم تركها لها\n وتشرب من قربة ماء\n فما فرغ الماء نشف اللبن\n وجعل الولدُ يتخبط من العطش\n فجعلت تطوف من الصفا\n وكان جبلاً صغيراً قريباً منها\n وتذهب إلى المروة\n وتسعى بينهما\n لعلها ترى أحداً\n فلما بلغت سبعة أطواف وسمعت صوتاً في الهواء\n فقالت: أغِثْ إن كان معك غياث\n فتبدَّى جبريلُ بين يديها حتى وصل إلى موضع زمزم\n فهمز بعقبه ففار الماء\n فلما رأته دهشت\n وخافت عليه يذهب فجعلت تحوطه\n وتقول: زم زم\n فانحصر الماء\n قال صلى الله عليه وسلم:\n \" يَرْحمُ اللهُ أُمَّ إسمَاعِيل\n لَوْ تَركَتْهُ\n كَانَ عَيْناً مَعِيناً \" \nفشربت\n ودرَّ لبنُها\n ثم إن جرهم رأوا طيوراً تحوم\n فقالوا: لا طيور إلا على الماء\n فقصدوا الموضع\n فوجدوها مع ابنها\n وعندها عين\n فقالوا لها: أتشركيننا في مائك\n ونشركك في ألباننا؟ ففعلت\n وفي حديث البخاري:\n \" قالوا لها: أتحبين أن نسكن معك؟ قالت: نعم\n ولكن لا حق لكم في الماء \" \nفرحلوا إليها\n وسكنوا معها\n ثم زوجوا ولدها منهم\n وحديث إتيان إبراهيم يتعاهد ابنه\n وبنائهما الكعبة\n مذكور في البخاري والسَّيَر\n ثم قال: { ربنا ليُقيموا الصلاة } أي: ما أسكنتهم بهذا الوادي البلقع من كل مرتفق ومرتزق\n إلا لإقامة الصلاة عند بيتك المحرم\n وتكرير النداء وتوسيطه\n للإشعار بأنها المقصود بالذات من إسكانهم ثَمَّةَ\n والمقصود من الدعاء: توفيقهم لها\n وقيل: اللام للأمر\n وكأنه طلب منهم الإقامة\n وسأل من الله أن يوفقهم لها\n { فاجعل أفئدة من الناس } أي: اجعل أفئدة من بعض الناس\n { تهوي إليهم } أي: تسرع إليهم شوقاً ومحبة\n و \" من \": للتبعيض\n ولذلك قيل: لو قال: أفئدة الناس لازدحمت عليه فارس والروم\n ولحجت اليهودُ والنصارى\n وقيل: للبيان\n أي: أفئدة ناسٍ\n { وارزقهم من الثمرات } مع كونهم بوادٍ لا نبات فيه\n { لعلهم يشكرون } تلك النعمة\n فأجاب دعوته\n فجعله حرماً آمناً تُجبى إليه ثمرات كل شيء\n حتى أنه يوجد فيه الفواكه الربيعية والصيفية والخريفية\n في يوم واحد\n { ربنا إنك تعلم ما نُخفي وما نُعلن } أي: تعلم سرنا\n كما تعلم علانيتنا\n والمعنى: إنك أعلم بأحوالنا ومصالحنا\n وأرحم منا بأنفسنا\n فلا حاجة لنا إلى الطلب\n لكننا ندعوك إظهاراً لعبوديتك\n وافتقاراً إلى رحمتك\n واستجلاباً لنيل ما عندك\n قاله البيضاوي: أي: فيكون مناسباً لحاله في قوله: \" علمه بحالي يُغني عن سؤالي \"\n وقيل: ما نُخفي من وَجْدِ الفرقة\n وما نعلن من التضرع إليك والتوكل عليك\n وتكرير النداء للمبالغة في التضرع واللجوء إلى الله تعالى\n { وما يخفى على الله من شيء في الأرض ولا في السماء } لأن علمه أحاط بكل معلوم\n \" من \": للاستغراق\n الإشارة: ينبغي للعبد أن يكون إبراهيمياً\n فيدعو بهذا الدعاء على طريق الإشارة\n فيقول: رب اجعل هذا القلب آمناً من الخواطر والوساوس\n واجنبني وبَنِيَّ\n أي: بَعِّدْنِي ومن تعلق بي\n أن نعبد الأصنام\n التي هي الدنانير والدراهم\n وكل ما يُعشق من دون الله\n { رب إنهن أضللن كثيراً من الناس } فتلفوا في حبها والحرص عليها\n فلا فكرة لهم إلا فيهما\n ولا شغل لهم إلا جمعهما\n فمن تبعني في الزهد فيهما\n والغنى بك عنهما\n فإنه مني\n ومن عصاني\n واشتغل بمحبتهما وجمعهما\n { فإنك غفور رحيم }\n\nوقوله: { ربنا إني أسكنت من ذريتي بوادٍ غير ذي زرع } فيه: تعليم اليقين لمن طلب تربية اليقين\n قال الورتجبي: فيه إشارة إلى تربية أهله بحقائق التوكل والرضا والتسليم\n ونِعْم التربية ذلك فأعلمنا بسنته القائمة الحنيفية السمحة السهلة\n الخليلية الحبيبية\n الأحمدية المصطفوية ـ صلوات الله عليهما ـ أن العارف الصادق ينبغي له ألا يكون معوله على الأملاك والأسباب ـ في حياته وبعد وفاته ـ لتربية عياله\n فإنه تعالى حسبه\n وزاد في تربيتهم بأن يؤدبِّهم بإقامة الصلاة إظهاراً للعبودية\n وإخلاصاً في المعرفة\n وطلباً للمشاهدة\n ومناجاة في القربة بقوله: { ربنا ليقيموا الصلاة } الخ\n وقال القشيري: أخبر عن صدق توكله وتفويضه\n أي: أسكنت قوماً من ذريتي بوادٍ غير ذي زرع\n عند بيتك المحرّم\n وإنما رد الرِّفق لهم في الجِوارِ فقال: { عند بيتك المحرم } \n ثم قال: { ليقيموا الصلاة }\n أي: أسكنتُهم لإقامة حقَّكَ\n لا لِطَلَبِ حظوظهم\n ويقال: اكتفى بأن يكونوا في ظلال عنايته\n عن أن يكونوا في ظلال نعيمهم\n ثم قال: قوله: { بوادٍ غير ذي زرع } أي: أسكنتُهم هذا الوادي\n ولا متعلق من الأغيار لقلوبهم\n ولا متناول لأفكارهم وأسرارهم\n فهم مطروحون ببابِكَ مُقيمون بحضرتك\n جار فيهم حُكمك\n إن رَاعَيتَهُم كَفَيْتَهم\n وكانوا أعَزَّ خلقِ اللهِ\n وإن أقصيتهم وأوبقتهم كانوا أضعف وأذلَّ خَلْقِكَ\n هـ\n وقوله تعالى: { فاجعل أفئدة من الناس تهوي إليهم }: قال القشيري: ليشتغلوا بعبادتك\n فأفْرِّد قوماً يقومون لهم بكفايتهم\n وارزقهم من الثمرات\n فإنَّ من قام بحقِّ الله قام الله بحقِّه\n فاستجاب الله دعاءَه فيهم\n فصارت القلوبُ من أهل كل بَر وبحرٍ كالمجبولة على محبة ذلك البيت\n ومحبة أولئك المصلين من سُكانه\n وقال الورتجبي: سأل أن يجعلهم مرادي جلاله وجماله\n ويجعلهم آية الصادقين والعاشقين\n بقوله: { فاجعل أفئدة من الناس تهوي إليهم } \n تميل بوصف الإرادة والمحبة لك\n والاقتداء بهم في إقامة سُنتك\n وألبسهم لباس أنوارك\n وألق في قلوب خلقك محبتهم بمحبتك\n هـ\n ومعنى قوله: مرادي جلاله وجماله: أي: مظهراً لجلاله وجماله\n يعشقهم البَرُّ والفاجر\n والكامل والناقص\n فقد ظهر فيهم الجلال والجمال\n والله تعالى أعلم\n ثمَّ ذكر بقية كلام إبراهيم عليه السلام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:64",
      "similarity": 0.29965681135968236
    },
    {
      "verse": "44:26",
      "similarity": 0.2985321562330304
    },
    {
      "verse": "16:78",
      "similarity": 0.2962359870097806
    },
    {
      "verse": "67:23",
      "similarity": 0.2756583053786942
    },
    {
      "verse": "23:78",
      "similarity": 0.26695554974164276
    }
  ]
}