{
  "chapter": "ابراهيم",
  "text": "واذ قال ابرهيم رب اجعل هذا البلد ءامنا واجنبنى وبنى ان نعبد الاصنام",
  "translations": [
    {
      "translation": "When Ibrahim said, 'My Lord! Make this land a place of safety and keep me and my sons from worshipping idols.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Abraham prayed: \"O Lord, make this a city of peace, and preserve me and my progeny from worshipping idols:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind when Abraham prayed: \"My Lord! Make this city secure, and keep me and my sons away from worshipping the idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), consider when Abraham prayed, \"Lord, make this (Mecca) a peaceful territory and save me and my offspring from worshipping idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when Ibrahim prayed, “O my Lord! Make this town (Mecca) a safe one, and safeguard me and my sons from worshipping idols.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim said: \"O my Lord! Make this city (Makkah) one of peace and security, and keep me and my sons away from worshipping idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Ibrahim said: My Lord! make this city secure, and save me and my sons from worshipping idols:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham said, 'My Lord, make this land secure, and turn me and my sons away from serving idols;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham said: My Lord! Make safe this territory, and preserve me and my sons from serving idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember] when Abraham said, \"My Lord, make this a city of peace and help me and my children to keep away from worshipping idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Ibrahim said: my Lord! make this City secure and keep me and my sons away from worshipping the idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Abraham said, ‘My Lord! Make this city a sanctuary, and save me and my children from worshiping idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Abraham said: \"O my Lord! make this city one of peace and security: and preserve me and my sons from worshipping idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim (Abraham) said: \"O my Lord! Make this city (Makkah) one of peace and security, and keep me and my sons away from worshipping idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham said: 'My Lord, make this a land secure. Turn me and my children away from worshipping idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall that Abraham said, “O my Lord, make this land peaceful, and keep me and my sons from worshiping idols.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], when Abraham said, \"My Lord, make this city [Makkah] secure and keep me and my sons away from worshipping idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:35] And, mention, when Abraham said, ‘My Lord, make this land, Mecca, secure — God granted him this petition and thus made it [Mecca] a sanctuary in which no human blood is shed, no person is wronged, prey is not hunted and one which is never deserted in any of its parts — and turn me and my sons away from serving idols.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Abraham said) after the building of the House: (My Lord!) my Lord! (Make safe) such that no turmoil takes place and whoever is in fear finds safety in (this territory) Mecca, (and preserve me and my sons from serving idols) from worshipping idols or fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل وقت { إِذْ قَالَ } جدك { إِبْرَاهِيمُ } حين ناجى مع الله بعدما عمر مكة: { رَبِّ ٱجْعَلْ هَـٰذَا ٱلْبَلَدَ } التي تأمرني بتعميرها؛ يعني: مكة { ءَامِناً } ذا أمن وأمان من تخريب العدو وتغييرها { وَٱجْنُبْنِي } أي: بعدتي { وَبَنِيَّ أَن نَّعْبُدَ ٱلأَصْنَامَ } [إبراهيم: 35] بتسويلات الأهوية الفاسدة والشياطين المضلة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال هنا: { اجعل هذا البلد } بالتعريف، وقال في سورة البقرة\n\n[البقرة: 126] بالتنكير، قال البيضاوي: الفرق بينهما أن المسؤول في الأول ـ أي: في التعريف ـ إزالة الخوف وتصييره أمناً، وفي الثانية جعله من البلاد الآمنة\n هـ\n وفرَّق السهيلي: بأن النبي صلى الله عليه وسلم كان بمكة حين نزول آية إبراهيم، لأنها مكية فلذلك قال فيه: \" البلد \" بلام التعريف التي للحضور، بخلاف آية البقرة، فإنما هي مدينة، ولم تكن مكة حاضرة حين نزولها، فلم يُعرفها بلا تعريف الحضور\n هـ\n قال ابن جزي: وفيه نظر لأن ذلك كان حكاية عن إبراهيم عليه السلام، ولا فرق بين كونه بالمدينة أو بمكة\n هـ\n قلت: لا نظر فيه لأن الحق تعالى لم يحك لنا قصص الأنبياء بألفاظهم، وإنما ترجم عنها بلسان عربي، فينزل على رعاية مقتضى الحال\n ولذلك اختلفت الألفاظ في قصص الأنبياء، لأن كل قصة تنزل على ما يقتضيه المقام والحال، من تعريف وتنكير، واختصار وإطناب\n وقد ذكر أبو السعود في سورة الأعراف ما يؤيد هذا، فانظره\n والله تعالى أعلم\n يقول الحق جل جلاله: { و } اذكر { إذْ قال إبراهيم ربِّ اجعل هذا البلد } يعني: مكة، { آمناً } لمن فيها من أغدرة الناس عليها، أو من الخسف والعذاب، أو من الطاعون والوباء، { واجنُبني } أي: امنعني واعصمني، { وبَنيَّ } من بعدي، من { أن نعبد الأصنامَ } أي: اجعلنا منهم من جانب بعيد\n قال البيضاوي: وفيه دليل على أن العصمة للأنبياء بتوفيق الله وحفظه إياهم، وهو بظاهره لا يتناول أحفاده وجميع ذريته، ورغم ابن عيينة أن أولاد إسماعيل لم يعبدوا الصنم، محتجاً به، وإنما كانت لهم حجارة يدورون بها، وسمونها الدوار، ويقولون: البيت حجر، وحيثما نصبت حجراً فهو بمنزلته\n هـ\n قال ابن جزي: و { بَنِيَّ } يعني: من صُلبه، وفيهم أجيبت دعوته، وأما أعقاب بنيه فعبدوا الأصنام\n هـ\n وقد قال في الإحياء: عنى إبراهيمُ عليه السلام بالأصنام، الذهب والفضة، بمعنى: حبهما والأغترار بهما، والركون إليهما\n قال ـ عليه الصلاة والسلام ـ:\n\n \" تَعِسَ عبدُ الدِّينَارِ والدِّرْهَم\n\n\n \" \n\nالحديث لأن رتبة النبوة أجل من أن يُخْشى عليها أن تعتقد الألوهية في شيء من الحجارة\n هـ\n قلت: الظاهر أن يبقى اللفظ على ظاهره، في حقه وفي حق بنيه\n أما في حقه فلسعة علمه وعدم وقوفه مع ظاهر الوعد، كما هو شأن الأكابر، لا يزول اضطرارهم، ولا يكون مع غير الله قرارهم، وهذا كقوله:\n\n[الأنعام: 80]\n وتقدم هذا المعنى مراراً\n وأما في حق بنيه فإنما قصد العموم في نسله لكن لم يجب إلا فيما كان صلبه فإن دعاء الأنبياء ـ عليهم السلام ـ لا يجب أن يكون كله مجاباً، فقد يُجابون في أشياء، ويُمنعون من أشياء\n\n\nوقد سأل نبينا صلى الله عليه وسلم لأمته أشياء، فأجيب في البعض، ومُنع البعض، كما في الحديث",
      "translations": []
    }
  ]
}