{
  "chapter": "ابراهيم",
  "text": "وسخر لكم الشمس والقمر دائبين وسخر لكم اليل والنهار",
  "translations": [
    {
      "translation": "and He has made the sun and moon subservient to you holding steady to their courses, and He has",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And subjugated the sun and moon for you so that they perform their tasks diligently; and subdued the night and day for your service.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who subjected for you the sun and the moon and both of them are constant on their courses, Who subjected for you the night and the day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He made the sun and moon, each following its course, and the day and the night all subservient to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And subjected the sun and the moon for you, which are constantly moving; and has subjected the night and the day for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has made the sun and the moon, both constantly pursuing their courses, to be of service to you; and He has made the night and the day to be of service to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has made subservient to you the sun and the moon pursuing their courses, and He has made subservient to you the night and the day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He subjected to you the sun and moon constant upon their courses, and He subjected to you the night and day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And maketh the sun and the moon, constant in their courses, to be of service unto you, and hath made of service unto you the night and the day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has also subjected to you the sun and the moon, both steadfastly pursuing their courses. He has subjected to you the night as well as the day;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath subjected for you the sun and the moon, two constant toils; and He hath subjected for you the night and the day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He disposed the sun and the moon for you, constant [in their courses], and He disposed the night and the day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath made subject to you the sun and the moon, both diligently pursuing their courses; and the night and the day hath he (also) made subject to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has made the sun and the moon, both constantly pursuing their courses, to be of service to you; and He has made the night and the day, to be of service to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He subjected to you the sun and the moon, which are constant in their courses. And, He has subjected to you the night and the day, and gave you all that you asked of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He committed the sun and the moon to your service, both continuously pursuing their courses, and He committed the night and the day to your service.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He subjected for you the sun and the moon, continuous [in orbit], and subjected for you the night and the day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:33] And He has disposed for you the sun and the moon, constant, moving in their courses without pause; and He has disposed for you the night, that you may rest therein, and the day, that you may seek of His bounty therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And maketh the sun and the moon, constant in their courses) until the Day of Judgement, (to be of service unto you) subservient to you, (and hath made of service) and made subservient (unto you the night and the day) which come and go.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَسَخَّر لَكُمُ } أيضاً { ٱلشَّمْسَ وَٱلْقَمَرَ دَآئِبَينَ } مختلفين في سيرهما شتاء وصيفاً خريفاً وربيعاً؛ لإنضاج ما تحرثونه وتزرعونه { وَسَخَّرَ لَكُمُ ٱلَّيلَ وَٱلنَّهَارَ } [إبراهيم: 33] لسباتكم ومعاشكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وسخَّر لكم الشمسَ والقمرَ دائبين } متماديين في الطلوع والغروب، يدأبان في سيرهما وإنارتهما، وإصلاح ما يصلحانه من المكونات، بقدرة خالقهما، { وسخَّر لكم الليلَ والنهارَ } يتعاقبان لسكناتكم ومعايشكم\n { وآتاكم من كل ما سألتموه } أي: وآتاكم بعض جميع ما سألتموه، وهو ما يليق بكم، وما سبق لكم في مشيئته وعلمه\n قال البيضاوي: ولعل المراد بما سالتموه: ما كان حقيقياً بأن يسأل لاحتياج الناس إليه، سُئل أو لم يسأل\n هـ\n وقرأ الضحاك وابن عباس: \" من كُلِّ \" بالتنوين، أي: وآتاكم من كل شيء احتجتم إليه، وسألتموه بلسان الحال\n ويجوز على هذا أن تكون \" ما \" نافية، في موضع الحال، أي: وآتاكم من كل شيء غير سائليه\n { وإن تعدوا نعمةَ الله لا تُحصوها }: لا تحصوها، ولا تطيقوا عدَّ أنواعها، فضلاً عن أفرادها، فإنها غير متناهية فمنها ظاهرة، ومنها باطنة، كالهداية والمعرفة\n قال طلق بن حبيب: إن حق الله أثقل من أن يقوم به العباد، ونعمة أكثر من أن يحصيها العباد، ولكن أصبحوا توابين، وأمسوا توابين\n هـ\n وقال أبو الدرداء: من لم ير نعمة الله إلا في مطعمه ومشربه، فقد قلَّ علمه، وحضر عذابه\n هـ",
      "translations": []
    }
  ]
}