{
  "chapter": "ابراهيم",
  "text": "وءاتىكم من كل ما سالتموه وان تعدوا۟ نعمت الله لا تحصوها ان الانسن لظلوم كفار",
  "translations": [
    {
      "translation": "He has given you everything you have asked Him for. If you tried to number Allah's blessings, you could never count them. Man is indeed wrongdoing, ungrateful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gave you whatsoever you asked. If you try to count the favours of God you will not be able to calculate. Man is most unjust indeed, full of ingratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Who gave you all that you asked Him for. Were you to count the favours of Allah you shall never be able to encompass them. Verily man is highly unjust, exceedingly ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has given you everything that you asked Him for. Had you wanted to count the bounties of God, you would not have been able to do it. The human being is unjust and disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He gave you much of what you seek; and if you enumerate the favours of Allah, you will never be able to count them; indeed man is very unjust, most ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He gave you of all that you asked for, and if you [try to] count the blessings of Allah, never will you be able to count them. Verily, man is indeed an extreme wrongdoer, ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He gives you of all that you ask Him; and if you count Allah's favors, you will not be able to number them; most surely man is very unjust, very ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and gave you of all you asked Him. If you count God's blessing, you will never number it; surely man is sinful, unthankful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He giveth you of all ye ask of Him, and if ye would count the bounty of Allah ye cannot reckon it. Lo! man is verily a wrong-doer, an ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has given you all that you asked of Him; and if you try to reckon up God's favours, you will not be able to count them. Truly man is very unjust, very ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath vouchsafed unto you some of everything ye asked Him. And if ye would count Allah's favours, ye can not compute them; verily man is a great wrong-doer, highly ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He gave you all that you had asked Him. If you enumerate Allah’s blessings, you will not be able to count them. Indeed man is most unfair and ungrateful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He giveth you of all that ye ask for. But if ye count the favours of Allah, never will ye be able to number them. Verily, man is given up to injustice and ingratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He gave you of all that you asked for, and if you count the Blessings of Allah, never will you be able to count them. Verily! Man is indeed an extreme wrong-doer, - a disbeliever (an extreme ingrate, denies Allah's Blessings by disbelief, and by worshipping others besides Allah, and by disobeying Allah and His Prophet Muhammad SAW).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you count the blessings of Allah, you will never number them. Indeed, the human is wicked and thankless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has given you something of all what you asked. And if you were to count God’s blessings, you would not be able to enumerate them. The human being is unfair and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He gave you from all you asked of Him. And if you should count the favor of Allah, you could not enumerate them. Indeed, mankind is [generally] most unjust and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:34] And He gives you of all that you ask of Him, according to your [individual] best interests. And if you were to enumerate God’s graces, meaning His bestowal of graces, you could never number it, you would not be able to count it. Lo! man, the disbelieving [man], is verily a wrong-doer and unthankful!, ever wronging his own soul through [acts of] disobedience and ungratefulness towards God’s grace.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He giveth you of all ye ask of Him) as well as that which you do not know even how to ask for, (and if ye would count the bounty of Allah) the blessings of Allah (ye cannot reckon it) you would not be able to remember them or give thanks for them. (Lo! Man) i.e. the disbeliever (is verily a wrong-doer) he associates others with Allah, (an ingrate) He disbelieves in Allah and in His blessings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَآتَاكُم مِّن كُلِّ مَا سَأَلْتُمُوهُ } معناهُ مِنْ كُلِّ مَا لَمْ تَسأَلُوهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - the Most High - {And He has given you from all that you ask of Him} means from all that you do not ask of Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أو بنقص حقّ الله أو حق نفسه بإبطال الاستعداد { كفّار } بتلك النِعَم التي لا تحصى باستعمالها في غير ما ينبغي أن تستعمل وغفلته عن المنعم عليه بها واحتجابه بها عنه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { آتَاكُم مِّن كُلِّ مَا سَأَلْتُمُوهُ } بلسان استعداداتكم وقابلياتكم من متممات نفوسكم ومكملاات إدراككم { وَ } بلغ إنعامه سبحانه إياكم في الكثرة إلى حيث { إِن تَعُدُّواْ } وتحصوا { نِعْمَتَ ٱللَّهِ } الفائضة عليكم لتربيتكم { لاَ تُحْصُوهَا } أي: لا يسع لكم إحصاؤها من مال كثرتها ووفورها\n فلكم أن تواظبوا على شكرها وأداء حق شيء منها\n وإن كانت القوة لا تفي بأدائها\n لكن قليلاً منكم يشكرون نعمه { إِنَّ ٱلإنْسَانَ } المجبول على الغفلة والنسيان في أصل فطرته باعتبار قوى بشريته وبهيميته { لَظَلُومٌ } أي: مظلوم محزون عند الشدة وهجوم البلاء { كَفَّارٌ } [إبراهيم: 34] مبالغ في الكفران والنسيان وقت الفرح والسرور",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إنَّ الإنسانَ لظلوم } بظلم النعمة لمَّا غفل عن شكرها\n أو بظلم نفسه لمَّا عرضها للحرمان\n بارتكاب المعاصي\n { كفارٌ }: شديد الكفران\n وقيل: ظلوم في الشدة يشكو ويجزع كفّار في النعمة يجمع ويمنع\n قاله البيضاوي\n الإشارة: الله الذي أنزل من سماء الملكوت علوماً وأسراراً\n تحيا به القلوب والأرواح\n فأخرج به من أرض النفوس\n ثمرة اليقين والطمأنينة\n رزقاً لأرواحكم\n وسخر لكم فلك الفكرة تجري في بحر التوحيد\n وفضاء التفريد بأمره\n\nوسخر لكم أنهار العلوم\n منها ما هو علم الرسوم لأصلاح الظواهر\n ومنها ما هو علم الحقائق لإصلاح الضمائر\n وسخر لكم شمس العرفان وقمر الإيمان\n دائبين\n يستضيء بقمر التوحيد في السير إلى معرفة أنوار الصفات\n وبشمس العرفان إلى أسرار الذات\n وسخَّر لكم ليل القبض لتسكنوا فيه\n ونهار البسط\n لتنشروا في اقتباس العلوم وربما أفادك في ليل القبض ما لم تفسده في نهار البسط لا تدرون أيهم أقرب نفعاً\n وآتاكم من كل ما سألتموه حين كمل تهذيبكم\n وصح وصلكم\n فيكون أمركم بأمر الله\n وإن تعدوا نعمة الله لا تحصُوها إذ نعمة الإيجاد ونعمة الإمداد لا حدَّ لهما في هذه الدار وفي تلك الدار\n ففي كل نَفَس يمدهم بمَددٍ جديد\n ومع هذا كله يغفل العبد عن هذه النعم!! إن الإنسان لظلوم كفار\n وشكرها: نسبتها لمعطيها\n وحمد الله عليها\n وفي الحكم: \" لا تدهشك واردات النعم عن القيام بحقوق شكرك فإنَّ ذلك مما يحط من وجود قدرك \"\n قال سهل بن عبد رضي الله عنه: ما من نعمة إلا والحمد أفضل منها\n والنعمة التي ألهم بها الحمد أفضل من الأولى\n لأن الشكر يستوجب المزيد\n وفي أخبار داود عليه السلام أنه قال: إلهي\n ابنُ آدمَ ليس فيه شعرة إلا وتحتها نعمة\n وفوقها نعمة\n فمن أين يكافئها؟ فأوحى الله تعالى إليه: يا داود\n إني أُعْطِي الكثير وأرْضَى باليسير\n وإنَّ شكر ذلك أن تعلم أن ما بك من نعمة فمني\n هـ\n ومن جملة النعم التي يجب الشكر عليها وهي التي بدلها الكفار كفراً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:18",
      "similarity": 0.8849696154796265
    },
    {
      "verse": "19:94",
      "similarity": 0.8634562706732525
    },
    {
      "verse": "78:29",
      "similarity": 0.7702888775661884
    },
    {
      "verse": "72:28",
      "similarity": 0.6228532149084222
    },
    {
      "verse": "58:6",
      "similarity": 0.6047080784640732
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/014034.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/014034.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/14:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}