{
  "chapter": "ابراهيم",
  "text": "الذين يستحبون الحيوة الدنيا على الءاخرة ويصدون عن سبيل الله ويبغونها عوجا او۟لئك فى ضللۭ بعيد",
  "translations": [
    {
      "translation": "those who prefer the life of this world to the Next World, and bar access to the way of Allah, wanting to",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who hold the life of this world dearer than that of the next, who obstruct the path of God and seek obliquity in it, have wandered far into error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to those who have chosen the life of the world in preference to the Hereafter, who hinder people from the Way of Allah, and seek to make it crooked. They have gone far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who have given preference to the worldly life over the life to come. They create obstacles in the way that leads to God and try to make it seem crooked. They are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To whom the worldly life is dearer than the Hereafter, and who prevent from the way of Allah and wish deviations in it; they are in extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who prefer the life of this world to the Hereafter, and hinder (men) from the path of Allah and seek crookedness therein - they are far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(To) those who love this world's life more than the hereafter, and turn away from Allah's path and desire to make it crooked; these are in a great error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "such as prefer the present life over the world to come, and bar from God's way, desiring to make it crooked -- they are in far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who love the life of the world more than the Hereafter, and debar (men) from the way of Allah and would have it crooked: such are far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to those who love this life more than the Hereafter; who turn others away from the path of God and seek to make it crooked. They have gone far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who prefer the life of the world to the Hereafter, and hinder people from the way of Allah, and seek crookedness therein; these are in error far-off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who prefer the life of this world to the Hereafter, and bar [others] from the way of Allah, and seek to make it crooked. They are in extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who love the life of this world more than the Hereafter, who hinder (men) from the Path of Allah and seek therein something crooked: they are astray by a long distance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who prefer the life of this world instead of the Hereafter, and hinder (men) from the Path of Allah (i.e. Islam) and seek crookedness therein - They are far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who prefer this life more than the Everlasting Life, and bar others from the way of Allah and seek to make it crooked they are in far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who prefer the present life to the Hereafter, and repel from the path of God, and seek to make it crooked—these are far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ones who prefer the worldly life over the Hereafter and avert [people] from the way of Allah, seeking to make it (seem) deviant. Those are in extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:3] those who (alladhīna is a description) prefer, choose, the life of this world over the Hereafter, and bar, people, from God’s way, [from] the religion of Islam, and seek to make it, that is, the path, crooked — those, they are far astray, from the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who love the life of the world) those who prefer the life of this world (more than the Hereafter, and debar (men) from the way of Allah) and save people from Allah's religion and obedience (and would have it crooked) and would have it differently than it actually is: (such) the disbelievers (are far astray) from the Truth and guidance; it is also said that this means: they are in manifest error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { الذين } يؤثرون { الحياة الدنيا } الحسيّة على العقلية والصورية على المعنوية لوصفه الضلال بالبعد وكون عالم الحسّ في أبعد المراتب عن الله تعالى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم { ٱلَّذِينَ يَسْتَحِبُّونَ ٱلْحَيَاةَ ٱلدُّنْيَا } المستعارة التي لا مداد لها ولا قرار\n إذ هي أظلال في ظلمة عكوس عاطلة { عَلَى ٱلآخِرَةِ } أي: على الحياة الأخروية التي هي بقاء سرمدي وحياة أزلية لا انقضاء لها أصلاً { وَ } هم مع اختيارهم وترجيحهم الحياة الفانية على الباقية { يَصُدُّونَ } ويصرفون الناس { عَن سَبِيلِ ٱللَّهِ } الذي هو الإيمان بالله وبرسوله وكتابه { وَيَبْغُونَهَا عِوَجاً } أي: يطلبون أن يحدثوا فيها مع استقامتها انحرافاً { أُوْلَـٰئِكَ } الأشقياء المردودون عن طريق الحق\n الساعو في الباطل مكبارة وعناداً { فِي ضَلاَلٍ بَعِيدٍ } [إبراهيم: 3] عن الهداية بمراحل بحيث لا يرجى هدياتهم أصلاً\n لأنهم مجبولون على الضلالة الغواية في أصل فطرتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويصُدُّون } الناس { عن سبيل الله } بتعويقهم عن الإيمان\n { ويبغونها عوجاً } أي: ويبغون لها زيغاً\n ونُكُوباً عن الحق\n ليتوصلوا للقدح فيها\n فحذف الجار وأوصل الفعل إلى الضمير\n { أولئك في ضلال بعيد } أي: في تلف بعيد عن الحق بحيث ضلوا عن الحق\n وبعدوا عنه بمراحل\n والبُعد في الحقيقة: للضال\n ووُصف به فعله للمبالغة\n الإشارة: قد أخرج صلى الله عليه وسلم أمته من ظلمات عديدة إلى نوار متعددة أولها: ظلمة الكفر والشرك إلى نور الإيمان والإسلام\n ثم من ظلمة الجهل والتقليد إلى نور العلم والتحقيق\n ثم من ظلمة الذنوب والمعاصي إلى نور التوبة والاستقامة\n ثم من ظلمة الغفلة والبطالة إلى نور اليقظة والمجاهدة\n ثم من ظلمة الحظوظ والشهوات إلى نور الزهد والعفة\n ثم من ظلمة رؤية الأسباب\n والوقوف مع العوائد\n إلى نور شهود المسبب\n وخرق العوائد\n ثم من ظلمة الوقوف مع الكرامات وحلاوة الطاعات إلى نور شهود المعبود\n ثم من ظلمة الوقوف مع حس الأكوان الظاهرة إلى شهود أسرار المعاني الباطنة\n فيغيب عن الأكوان بشهود المكون\n وهذا آخر ظلمة تبقى في النفس\n فتصير حينئذٍ روحاً وسراً من أسرار الله\n ويصير صاحبها روحانياً ربانياً عارفاً بالله\n ولا يبقى حينئذٍ إلا التراقي في شهود الأسرار ابداً سرمداً\n\nوهذا محل القطبانية والتهيؤ للتربية النبوية\n ويصير ولياً محمدياً\n يُخرج الناس من هذه الظلمات إلى هذه الأنوار\n وأما من لم يبلغ هذا المقام\n فإنه له الإخراج من أحد هذه الأشياء فالغزاة والمجاهدون يُخرجون من ظلمة الكفر إلى نورِ الإيمان\n والعلماء يُخرجون من ظلمة الجهل إلى نور العلم\n والعُباد والزهاد يُخْرِجونَ من صَحِبَهم من الذنوب إلى التوبة والاستقامة\n وأما ما بقي من الظلمات فلا يُخْرج منها إلا الربانيون الروحانيون\n أهل التربية النبوية\n بإذن ربهم\n يدلهم على صراط العزيز الحميد\n الموصل إلى العز المديد\n وويل لمن أنكر هؤلاء\n واشتغل بمتابعة حظوظه وهواه\n واستحبَّ حياة دنياه على أخراه\n أولئك في ضلال عن حضرة الحق ببعيد\n وبالله التوفيق\n ولما كان الإخراج من هذه الظلمات لا يكون إلا بالمقال والحال",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:45",
      "similarity": 0.8864099372103424
    },
    {
      "verse": "11:19",
      "similarity": 0.8864099372103424
    },
    {
      "verse": "3:99",
      "similarity": 0.7536164605052291
    },
    {
      "verse": "18:1",
      "similarity": 0.6564553228604467
    },
    {
      "verse": "7:86",
      "similarity": 0.6076217396569199
    }
  ]
}