{
  "chapter": "ابراهيم",
  "text": "الله الذى خلق السموت والارض وانزل من السماء ماء فاخرج به من الثمرت رزقا لكم وسخر لكم الفلك لتجرى فى البحر بامره وسخر لكم الانهر",
  "translations": [
    {
      "translation": "Allah is He who created the heavens and the earth and sends down water from the sky and by it brings forth fruits as provision for you. He has made the ships subservient to you to run upon the sea by His command, and He has made the rivers subservient to you,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who created the heavens and the earth, and sent down rain from the sky producing fruits for your food thereby, and made you master of the ships that ply in the oceans by His command, subjected the rivers to your control,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who created the heavens and the earth, Who sent down water from the heaven and thereby brought forth a variety of fruits as your sustenance, Who subjected for you the ships that they may sail in the sea by His command, Who subjected for you the rivers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the One who created the heavens and the earth, sent down water from the sky by which He produced fruits for your sustenance, enabled you to use boats to sail on the sea, and placed the rivers at your disposal, all by His command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who created the heavens and the earth, and sent down water from the sky, therefore producing some fruits for you to eat; and subjected the ships for you, that they may sail upon the sea by His command; and subjected the rivers for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who has created the heavens and the earth and sends down water (rain) from the sky, and thereby brought forth fruits as provision for you; and He has made the ships to be of service to you, that they may sail through the sea by His command; and He has made rivers (also) to be of service to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created the heavens and the earth and sent down water from the clouds, then brought forth with it fruits as a sustenance for you, and He has made the ships subservient to you, that they might run their course in the sea by His command, and He has made the rivers subservient to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who created the heavens and the earth, and sent down out of heaven water wherewith He brought forth fruits to be your sustenance. And He subjected to you the ships to run upon the sea at His commandment; and He subjected to you the rivers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created the heavens and the earth, and causeth water to descend from the sky, thereby producing fruits as food for you, and maketh the ships to be of service unto you, that they may run upon the sea at His command, and hath made of service unto you the rivers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was God who created the heavens and the earth. He sends down water from the sky with which He brings forth fruits for your sustenance; He has made ships subservient to you, so that they may sail across the sea by His command; and has subjected the rivers to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is who hath created the heavens and the earth, and sent down from the heaven water, and hath there by brought forth fruits as a provision for you; and He hath subiected the ships for you that it may run in the sea by His command; and He hath subjected for you the rivers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who created the heavens and the earth, and He sends down water from the sky and with it He brings forth crops for your sustenance. And He disposed the ships for you[r benefit] so that they may sail at sea by His command, and He disposed the rivers for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who hath created the heavens and the earth and sendeth down rain from the skies, and with it bringeth out fruits wherewith to feed you; it is He Who hath made the ships subject to you, that they may sail through the sea by His command; and the rivers (also) hath He made subject to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who has created the heavens and the earth and sends down water (rain) from the sky, and thereby brought forth fruits as provision for you; and He has made the ships to be of service to you, that they may sail through the sea by His Command; and He has made rivers (also) to be of service to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is Allah who created the heavens and the earth, and sends down water from the heaven with which He brings forth fruits for your provision. He has subjected to you ships which, by His command, run upon the sea. He has subjected to you rivers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He Who created the heavens and the earth, and sends down water from the sky, and with it produces fruits for your sustenance. And He committed the ships to your service, sailing through the sea by His command, and He committed the rivers to your service.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who created the heavens and the earth and sent down rain from the sky and produced thereby some fruits as provision for you and subjected for you the ships to sail through the sea by His command and subjected for you the rivers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:32] God it is Who created the heavens and the earth, and He sends down water from the heaven and with it He brings forth fruits as sustenance for you. And He has disposed for you the ships, that they may run upon the sea, [laden] with passengers and cargo, at His commandment, by His leave, and He has disposed for you the rivers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then declared His divine Oneness, saying: (Allah is He Who created the heavens and the earth, and causeth water) rain (to descend from the sky, thereby producing) the rain brought forth (fruits) different kinds of fruit (as food for you) and for all other created beings, (and maketh the ships to be of service) subservient (unto you, that they) i.e. the ships (may run upon the sea at His command) by His permission and will, (and hath made of service) subservient (unto you the rivers) they flow wherever you want;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الله الذي خَلَقَ } سموات الأرواح وأرض الجسد { وأنْزَلَ من } سماء عالم القدس ماء العلم { فأخْرَج به } من أرض النفس ثمرات الحكم والفضائل { رِزْقاً لكم } وتقوى القلب بها { وسَخرَ لكم } أنهار العلم بالاستنتاج والاستنباط والتفريع والتفصيل { وسخر لكم } شمس الروح وقمر القلب { دَائِبِين } في السير بالمكاشفة والمشاهدة { وسخّر لكم } ليل ظلمة صفات النفس ونهار نور الروح لطلب المعاش والمعاد والراحة والاستنارة { وآتاكم من كل ما سألتموه } بألسنة استعداداتكم، فإنّ كل شيء يسأله بلسان استعداده كمالاً يفيض عليه مع السؤال بلا تخلف وتراخ كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { ٱللَّهُ } الموفق لعباده أسباب معادهم هو المدبر المصلح { ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ } أي: العلويات المعدة للإحاطة { وَٱلأَرْضَ } أي: السفليات القابلة للفيض { وَأَنزَلَ } أي: أفاض { مِنَ } جانب { ٱلسَّمَآءِ مَآءً فَأَخْرَجَ بِهِ مِنَ } أنواع { ٱلثَّمَرَاتِ } لتكون { رِزْقاً لَّكُمْ } مقوماً لمزاجكم\n مبقياً لحياتكم\n لتواظبوا على طاعة الله وإعداد زاد يوم المعاد { وَ } مع ذلك { سَخَّرَ لَكُمُ ٱلْفُلْكَ } أي: السفن الجارية { لِتَجْرِيَ فِي ٱلْبَحْرِ بِأَمْرِهِ } أي: بمشيئته وإرادته\n لتسيروا معها إلى حيث شئتم وتتجروا بها وتربحوا { وَسَخَّرَ لَكُمُ } أيضاً { ٱلأَنْهَارَ } [إبراهيم: 32] الجارية على بسيط الأرض\n ليسهل لكم إخراج الجداول منها للحراثة والزراعة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الله: مبتدأ، والذي، وما بعده: خبر، و رزقاً لكم: مفعول أخرج، و من الثمرات: بيان له، حال، ويجوز العكس، ويجوز أن يراد بالرزق: المصدر، فينصب على العلة أو المصدر لأن أخرج فيها معنى \" رَزَقَ \" ، و دائبينْ: حال، والدؤوب: الدوام على عمل واحد، و من كل ما سألتموه: يحتمل أن تكون \" ما \" مصدرية، أو موصولة، أو موصوفة\n يقول الحق جل جلاله: { اللهُ الذي خلق السماوات والأرض } من أجلكم، السماء تُظلكم، والأرض تُقلكم، { وأنزل من السماء ماء فأخرج به من الثمراتِ رزقاً لكم } ، تعيشون به وتتفكهون منه\n ويشمل الملبوس، كالقطن، والكتان، وشبه ذلك { سخر لكم الفلك لتجري في البحر بأمره }: بمشيئته وقدرته، إلى حيث توجههم مع أسباب حكمته، تغطية لقدرته، وهو ما يتوقف عليه جريها وإرساؤها، من الجبال والقلاع، { وسخّر لكم الأنهار } مطردة لانتفاعكم بالسفن والشرب، وسائر منافعها، فجعلها مُعدَّة لا نتفاعكم وتصرفكم\n وقيل: تسخير هذه الأشياء: تعليم كيفية اتخاذها والانتفاع بها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:12",
      "similarity": 0.6167628451601275
    },
    {
      "verse": "31:31",
      "similarity": 0.47517706117151676
    },
    {
      "verse": "22:65",
      "similarity": 0.45354870564782185
    },
    {
      "verse": "2:164",
      "similarity": 0.39582723330106184
    },
    {
      "verse": "11:38",
      "similarity": 0.3421765722408622
    }
  ]
}