{
  "chapter": "ابراهيم",
  "text": "قل لعبادى الذين ءامنوا۟ يقيموا۟ الصلوة وينفقوا۟ مما رزقنهم سرا وعلانية من قبل ان ياتى يوم لا بيع فيه ولا خلل",
  "translations": [
    {
      "translation": "Tell My slaves who have iman that they should establish salat and give from what We have provided for them, secretly and openly, before a Day arrives on which there will be no trading and no friendship.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell those of My creatures who believe: \"Observe your devotional obligations and give of what We have given you in charity, secretly or openly, before the Day arrives when there will be no buying or selling or befriending.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), tell those of My servants who believe that they should establish Prayer and spend out of what We have provided them with, both secretly and openly, before there arrives the Day when there will be no bargaining, nor any mutual befriending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell My believing servants to be steadfast in prayer and to spend for the cause of their Lord, both in private and in public, out of what We have given them. Let them do this before the coming of the day when there will be no merchandising or friendship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the bondmen of Mine who believe, that they must keep the prayer established and spend in Our way from what We have given them, secretly and publicly, before the advent of a day in which there will be no trade nor friendship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to My servants who have believed, that they should perform the Salah, and spend (in charity) out of the sustenance We have given them, secretly and openly, before the coming of a Day on which there will be neither mutual bargaining nor befriending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to My servants who believe that they should keep up prayer and spend out of what We have given them secretly and openly before the coming of the day in which there shall be no bartering nor mutual befriending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to My servants who believe, that they perform the prayer, and expend of that We have provided them, secretly and in public, before a day comes wherein shall be neither bargaining nor befriending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell My bondmen who believe to establish worship and spend of that which We have given them, secretly and publicly, before a day cometh wherein there will be neither traffick nor befriending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell My servants, those who are true believers, to keep up prayer and to give alms secretly and openly out of what We have given them, before the Day comes when there will be neither trading nor befriending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou unto those of My bond- men who have believed, let them establish prayer and expend of that wherewith We have provided them secretly and openly, ere the Day cometh wherein there will be no bargain nor friendliness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell My servants who have faith to maintain the prayer and to spend out of what We have provided them with, secretly and openly, before there comes a day on which there will be neither any bargaining nor friendship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Speak to my servants who have believed, that they may establish regular prayers, and spend (in charity) out of the sustenance we have given them, secretly and openly, before the coming of a Day in which there will be neither mutual bargaining nor befriending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW) to 'Ibadi (My slaves) who have believed, that they should perform As-Salat (Iqamat-as-Salat), and spend in charity out of the sustenance We have given them, secretly and openly, before the coming of a Day on which there will be neither mutual bargaining nor befriending.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell My worshippers, those who believe, who establish the prayer, and spend of what We have given them in private and in public, before the coming of that Day in which there is neither bargaining, nor the taking of friends,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell My servants who have believed to perform the prayers, and to give from what We have given them, secretly and publicly, before a Day comes in which there is neither trading nor friendship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[O Muhammad], tell My servants who have believed to establish prayer and spend from what We have provided them, secretly and publicly, before a Day comes in which there will be no exchange, nor any friendships.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:31] Tell My servants who believe that they establish prayers and expend of that which We have provided them, secretly and openly, before a day comes wherein there will be neither bargaining, ransoming, nor befriending, that is, [when there will not be] any friendship of any benefit: this is the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Tell) Muhammad (My bondmen who believe) in Me and in My Scripture and messengers (to establish worship) the five daily prayers, complete with their ritual ablution, bowings, prostrations and that which is obligated in them in their prescribed times (and spend of that which We have given them) and give alms, (secretly and publicly) these are the Companions of Muhammad (pbuh) (before a day comes) this is the Day of Judgement (wherein there will be neither traffic) ransom (nor befriending) for the disbeliever, while the believer will benefit from his friendships.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَّ بَيْعٌ فِيهِ وَلاَ خِلاَلٌ } معناهُ لاَ مُصادقةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {There is no sale in it, nor any alienation}, means that there is no truth in it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } يا أكمل الرسل { لِّعِبَادِيَ ٱلَّذِينَ آمَنُواْ } بجميع ما جئت به إليهم من أمور الدين سيما الصلاة المصفية لبواطنهم والزكاة المزكية لظواهرهم كذلك: { يُقِيمُواْ ٱلصَّلاَةَ } أي: يديموها في الأوقات المفروضة فيها { وَيُنْفِقُواْ مِمَّا رَزَقْنَاهُمْ } على المستحقين { سِرّاً } بلا سبق سؤال { وَعَلانِيَةً } بعد السؤال، استعدوا أيها الطالبون للنجاة لأخراكم في أولاكم، وأعدوا زاد عقباكم { مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ لاَّ بَيْعٌ فِيهِ } ليتدارك المقصر بالإنفاق والصدقة بعض تقصيراته { وَلاَ } يقبل فيه { خِلاَلٌ } [إبراهيم: 31] أي: شفاعة من خليل حميم يشفع للجرائم والتقصيرات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يُقيموا: جواب شرط مقدر، يتضمنه قوله: قل، تقديره: إن تقل لهم أقيموا يقيموا، ومعمول القول، على هذا، محذوف\n وفيه تنبيه على أنهم لفرط مطاوعتهم للرسول ـ عليه الصلاة والسلام ـ، بحيث لا ينفك فعلهم عن أمره، وأنه كالسبب الموجب له، أي: مهما قلت أقاموا وأنفقوا\n وقيل جزم بإضمار لام الأمر\n ولا يصح أن يكون جواب الأمر من غير حذف لأن أمر المواجهة لا يجاب بلفظ الغيبة\n انظر البيضاوي: وقال ابن عطية: إلا إن ضمّن قل معنى: بلّغ أو أدَّ، فيصح أن يكون يقيموا: جواب أمره\n وسراً وعلانية: حالان، أو ظرفان، ومن قرأ: \" لا بيع \" بالبناء فقد بنى \" لا \" مع اسمها بناء التركيب، ومن قرأ بالرفع فقد أهملها\n يقول الحق جل جلاله: { قل لعباديَ الذين آمنوا } ، خصهم بالإضافة إليه تشريفاً لم، وتنويهاً بقدرهم، وتنبيهاً على أنهم الذين قاموا بحقوق العبودية\n قل لهم يا محمد: { يُقيموا الصلاة } التي هي عنوان الإيمان، بإتقان شروطها وأركانها وآدابها، { ويُنفقوا مما رزقناهم } من الأموال، فرضاً ونفلاً، { سراً وعلانيةً } أي: مُسرين ومعلنين، أو في سر وعلانية، والأحب: إعلان الواجب، وإخفاء المُتَطَوَّع به، إلا في محل الاقتداء لأهل الإخلاص\n { من قبل أن يأتي يومٌ لا بيع فيه } فيبتاع المقصر ما يتدارك به تقصيره، أو ما يفدي به نفسه، { ولا خلالٌ }: ولا مخاللة ومودة تنفع في ذلك اليوم، حتى ينفع الخليلُ خليلَه، وإنما العملُ الصالح، كالإنفاق لوجه الله، وإقام الصلاة، وغير ذلك\n الإشارة: قد مدح الله هاتين الخصلتين: الصلاة والإنفاق، وأمر بهما في مواضع من القرآن لأنهما عنوان الصدق، أحدهما، عمل بدني، والآخر: عمل مالي\n أما الصلاة فإنها طهارة للقلوب، واستفتاح لباب الغيوب، وهي محل المناجاة ومعدن المصافاة، تتسع فيها ميادين الأسرار، وتُشرق فيها شوارق الأنوار، كما في الحِكَم\n وفي بعض الأخبار: إن العبد إذا قام إلى الصلاة رفع الله الحُجُبَ بينه وبينه، وواجهه بوجهه، وقامت الملائكة من لدن منكبيه إلى الهواء، يُصلون بصلاته، ويُؤَمَّنُونَ على دعائه، وإن المصلي لينثر عليه البر من عنان السماء إلى مفرق رأسه، ويناديه مناد: لو يعلم المناجي من يناجي ما انفتل\n وإن أبواب السماء لتفتح للمصلي\n وإن الله تعالى يباهي ملائكته بصفوف المصلين\n وفي التوراة: يا ابن آدم لا تعجز ان تقوم بين يَدَيَّ مصلياً باكياً، فأنا الذي اقتربتُ من قلبك، وبالغيب رأيتَ نوري\n هـ\n فكانوا يرون أن تلك المراقبة والبكاء، وتلك الفتوح التي يجدها المصلي في قلبه من دنو الرب من القلب\n وأما الصدقة فإنها برهان على إيمان صاحبها، وفي الحديث:\n\n \" الصَّدقةُ بُرْهانٌ \" \n\nفهي تدل على خروج حب الدنيا من القلب، وعلى اتصاف صاحبها بمنقبة السخاء، التي هي أفضل الخصال، وفي الحديث:\n\n \" السَّخِيُّ قَرِيبٌ مِنَ اللهِ، قَرِيبٌ من النَّاس قريبٌ من الجَنَّةِ، بَعِيدٌ من النارِ،والبَخِيلُ بَعيدٌ من اللهِ، بَعِيدٌ من النَّاسِ، بَعِيدٌ مِنَ الجَنَّةِ، قَرِيبٌ من النَّارِ، ولجَاهلٌ سَخِيٌ أَحَبُ إلى اللهِ من عَالمٍ بخيلٍ \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:254",
      "similarity": 0.7242899759612499
    },
    {
      "verse": "2:77",
      "similarity": 0.4437421935156509
    },
    {
      "verse": "16:19",
      "similarity": 0.4382163698188729
    },
    {
      "verse": "71:9",
      "similarity": 0.435355274417524
    },
    {
      "verse": "36:76",
      "similarity": 0.4185175896032543
    }
  ]
}