{
  "chapter": "ابراهيم",
  "text": "ربنا انك تعلم ما نخفى وما نعلن وما يخفى على الله من شىء فى الارض ولا فى السماء",
  "translations": [
    {
      "translation": "Our Lord! You know what we keep hidden and what we divulge. Nothing is hidden from Allah either on the earth or in heaven.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Lord, You have knowledge of what we hide and what we reveal, for nothing on the earth or in the skies is hidden from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Surely You know all that we conceal and all that we reveal, and nothing in the earth or in the heaven is hidden from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, You know all that we conceal or reveal. Nothing in the heavens or the earth is hidden from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O our Lord! You know what we hide and what we disclose; and nothing is hidden from Allah, neither in the earth nor in the heavens.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord! Certainly, You know what we conceal and what we reveal. Nothing on the earth or in the heaven is hidden from Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord! Surely Thou knowest what we hide and what we make public, and nothing in the earth nor any thing in heaven is hidden from Allah:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, Thou knowest what we keep secret and what we publish; from God nothing whatever is hidden in earth and heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Lo! Thou knowest that which we hide and that which we proclaim. Nothing in the earth or in the heaven is hidden from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, You have knowledge of all that we hide and all that we reveal: nothing in heaven or on earth is hidden from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! verily Thou knowest that which We conceal and that which We make known; and not of aught is concealed from Allah in the earth or in the heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Indeed You know whatever we hide and whatever we disclose, and nothing is hidden from Allah on the earth or in the sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord! truly Thou dost know what we conceal and what we reveal: for nothing whatever is hidden from Allah, whether on earth or in heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord! Certainly, You know what we conceal and what we reveal. Nothing on the earth or in the heaven is hidden from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, You have knowledge of all that we hide and all that we reveal; nothing in heaven or earth is hidden from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord, You know what we conceal and what we reveal. And nothing is hidden from God, on earth or in the heaven.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, indeed You know what we conceal and what we declare, and nothing is hidden from Allah on the earth or in the heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:38] Our Lord, You know what we hide, keep secret, and what we proclaim. And nothing (min shay’in: min is extra) is hidden from God in the earth or in the heaven: these may constitute God’s words or the words of Abraham.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord!) our Lord! (Lo! Thou knowest that which we hide) of the love of Ishmael (and that which we proclaim) of the love of Isaac; it is also said that this means: You know that which we hide of the love of Ishmael and what we proclaim of aloofness towards him. (Nothing in the earth or in the heaven is hidden from Allah) whether it is a good or evil work.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رَبَّنَآ } يا من ربانا بأنواع اللطف والكرم { إِنَّكَ تَعْلَمُ مَا نُخْفِي } من حوائجنا { وَمَا نُعْلِنُ } أي: ما لنا علم به؛ إذ أنت أعلم بحوائجنا منا؛ إذ علمك بنا وبجميع مظاهرك حضوري ذاتي، ولا علم لنا بذاتنا كذلك، بل نحن عاجزون عن إدراك أنفسنا كعجزنا عن إدراك ذاتك يا مولانا، لذلك قال صلى الله عليه وسلم:\n\n \" من عرف نفسه فقد عرف به \" \n\n{ وَ } كيف يخفى عليك حوائجنا؛ إذ { مَا يَخْفَىٰ } ويستر { عَلَى ٱللَّهِ } المحيط بكل الأشياء { مِن شَيْءٍ } لذلك ظاهر { فَي ٱلأَرْضِ وَلاَ فِي ٱلسَّمَآءِ } [إبراهيم: 38] وكيف خفي عليه شيء؛ إذ هو عالم بها، مظهر لها لا يعرزب عنه شيء منها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:19",
      "similarity": 0.6587682992372476
    },
    {
      "verse": "2:77",
      "similarity": 0.6531252966247912
    },
    {
      "verse": "71:9",
      "similarity": 0.6336752316751332
    },
    {
      "verse": "64:4",
      "similarity": 0.6076934256822318
    },
    {
      "verse": "36:76",
      "similarity": 0.5896966234299471
    }
  ]
}