{
  "chapter": "ابراهيم",
  "text": "وجعلوا۟ لله اندادا ليضلوا۟ عن سبيله قل تمتعوا۟ فان مصيركم الى النار",
  "translations": [
    {
      "translation": "They have made others equal to Allah to misguide people from His Way. Say: 'Enjoy yourselves! Your destination is the Fire!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have appointed equals of God to mislead people from His path. Tell them: \"Enjoy yourselves (so long as you may). In the end you have to go to Hell.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have set up rivals to Allah that they may lead people astray from His way. Tell them: \"Enjoy for a while. You are doomed to end up in the Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To lead people astray, they claimed their idols were equal to God. (Muhammad), tell them, \"Enjoy yourselves and know that the only place for you to go will be hell fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ascribed equals to Allah to mislead from His way; say, “Enjoy a while, for your end will be the fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set up rivals to Allah, to mislead (men) from His path! Say: \"Enjoy (your brief life)! But certainly, your destination is the (Hell) Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set up equals with Allah that they may lead (people) astray from His path. Say: Enjoy yourselves, for surely your return is to the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set up compeers to God, that they might lead astray from His way. Say: 'Take your joy! Your homecoming shall be -- the Fire!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set up rivals to Allah that they may mislead (men) from His way. Say: Enjoy life (while ye may) for lo! your journey's end will be the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have set up rivals to God to lead people away from His path. Say, \"Enjoy yourselves awhile: you will then proceed to the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have set up compeers unto Allah, that they may lead men astray from His way. Say thou: enjoy, then verily your vending is unto the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have set up equals to Allah, to lead [people] astray from His way. Say, ‘Enjoy [for a while], for indeed your destination is hellfire!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set up (idols) as equal to Allah, to mislead (men) from the Path! Say: \"Enjoy (your brief power)! But verily ye are making straightway for Hell!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set up rivals to Allah, to mislead (men) from His Path! Say: \"Enjoy (your brief life)! But certainly, your destination is the (Hell) Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They set up rivals with Allah to lead others astray. Say to them: 'Take your pleasure; your arrival shall be the Fire'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set up rivals to God, in order to lead away from His path. Say, “Enjoy yourselves; your destination is the Fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have attributed to Allah equals to mislead [people] from His way. Say, \"Enjoy yourselves, for indeed, your destination is the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:30] And they have set up rivals to, associates [with], God, that they might lead [others] astray (read li-yadillū or li-yudillū) from His way, the religion of Islam. Say, to them: ‘Enjoy!, this world of yours for a short time. For lo! your journey’s end, your return, shall be to the Fire!’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they set up rivals to Allah) they ascribed to Allah co-equals from among idols which they worshipped (that they may mislead (men) from His way) from His religion and obedience. (Say) Muhammad, to the people of Mecca: (Enjoy life (while ye may)) in your state of disbelief (for lo! your journey's end will be the Fire) on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلُواْ للَّهِ أَندَاداً } معناهُ أَضدادٌ واحِدُهُمْ نِدٌ وَنديدٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And they made for Allah a thing of equals} [means that] they made one of them an equal to Him - a partner.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وجعلوا لله أنداداً } من متاع الدنيا وطيباتها ومشتهياتها يحبونها كحبّ الله، إذ كل ما غلب حبه فهو معبود\n قال الله تعالى:\n",
      "translations": [
        {
          "translation": "\n\n{They made idols of Allah} from the worldly possessions and good things of this world, and they loved them as much as they loved Allah.,\n\nWhen everything that is loved is gone, it is still missed.\n\n\nGod says, \"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن خبث بواطنهم { وَ } شدة شكيمتهم { جَعَلُواْ لِلَّهِ } المتوحد في ذاته { أَندَاداً } شركاء من أضلاله ومصنوعاته { لِّيُضِلُّواْ } ضعفاء الأنام { عَن سَبِيلِهِ } الذي هو دين الإسلام الموصل إلى توحيد الله { قُلْ } لهم يا أكمل الرسل على سبيل التوبيخ والتقريع: { تَمَتَّعُواْ } أيها المسرفون بما أنتم عليه من الكفر والعناد { فَإِنَّ مَصِيرَكُمْ } ومآل أمركم { إِلَى ٱلنَّارِ } [إبراهيم: 30] المعدة لتخذيلكم وجزائكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بيَّن كفرهم، فقال: { وجعلوا لله أنداداً }: أشباهاً وأمثالاً، يعبدونها معه، { ليُضِلوا عن سبيله } عن طريق التوحيد، أي: لتكون عاقبتهم الضلال أو الإضلال، على القراءتين، أي: ليضلوا في أنفسهم، أو ليضلوا غيرهم\n وليس الضلال كان غرضهم في اتخاذ الأنداد، ولكن لمَّا كان نتيجته وعاقبته جُعل كالغرض\n { قل تمتعوا } بشهواتكم الدنيوية، فإنها فانية، أو بعبادتكم الأوثان، فإنها من قبيل الهوى والأمر للتهديد\n وفي التهديد بصيغة الأمر إيذان بأن المهدد عليه كالمطلوب لإفضائه إلى المهدد به، وان الأمرين كائنان لا محالة، فلا بد من وقوع تمتعهم، ولا بد من إفضائهم إلى النار\n ولذلك علقه بقوله: { فإنَّ مصيرَكم إلى النار } ، وأن المخاطب، لانهماكه فيه، كالمأمور به من آمر مطاع\n قاله البيضاوي\n الإشارة: ظهور أهل التربية في زمان الغفلة والجهل نعمة عظيمةُ، لكن لا يعرفها إلا من سقط عليها، ومن أنكرها، وسدَّ بابها، وعوَّق الناس عن الدخول في طريقها، فقد بدل نعمة الله كفراً، وأحلَّ الناس ـ من تبعه ـ دار البوار، وهي: الإقبال على الدنيا، والانهماك في الغفلة، وخراب الباطن من نور اليقين، وكثرة الخواطر والوساوس، والحرص والجزع والهلع، وغير ذلك من أمراض القلوب\n وأيُّ عذاب المؤمن أشد من هذا في الدنيا؟ ويسقط في الآخرة عن درجة المقربين، ومن لم يصحب أهل التوحيد الخالص لا يخلو من عبادة أنداد وأشباه بمحبته لهم والركون إليهم\n ومن أحب شيئاً فهو عبد له\n قال الشيخ أبو الحسن الشاذلي رضي الله عنه ذات يوم: إنا لا نحب إلا الله، ولا نحب معه شيئاً سواه\n فقال له بعض الحاضرين: قال جدك رسول الله صلى الله عليه وسلم:\n\n \" النفس مجبولة على حب من أحسن إليها \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:9",
      "similarity": 0.789832253710505
    },
    {
      "verse": "2:165",
      "similarity": 0.6610626016603012
    },
    {
      "verse": "39:8",
      "similarity": 0.5297661235767932
    },
    {
      "verse": "2:22",
      "similarity": 0.5049922272137164
    },
    {
      "verse": "34:33",
      "similarity": 0.37138130896559096
    }
  ]
}