{
  "chapter": "ابراهيم",
  "text": "مهطعين مقنعى رءوسهم لا يرتد اليهم طرفهم وافـدتهم هواء",
  "translations": [
    {
      "translation": "rushing headlong - heads back, eyes vacant, hearts hollow.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And) they would hasten forward, heads lifted upwards, gazes fixed, and emptied out their hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they shall keep pressing ahead in haste, their heads lifted up, their gaze directed forward, unable to look away from what they behold, their hearts utterly void.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when people will hurry in fright, their heads raised, their eyes unable to look around, and their hearts stunned due to the confusion (which will prevail on that Day).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall come out running in bewilderment, with their heads raised, their gaze not returning to them; and their hearts will not have any calm.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will be) hastening forward with necks outstretched, their heads raised up (towards the sky), their gaze returning not towards them and their hearts empty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hastening forward, their heads upraised, their eyes not reverting to them and their hearts vacant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they shall run with necks outstretched and heads erect, their glances never returned on themselves, their hearts void.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As they come hurrying on in fear, their heads upraised, their gaze returning not to them, and their hearts as air.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will hurry on in fright, their heads lifted up, their gaze directed forward, their minds utterly void.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hastening forward, their heads upraised, their look returning not unto them and their hearts void.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Scrambling with their heads upturned, there will be a fixed gaze in their eyes, and their hearts will be vacant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They running forward with necks outstretched, their heads uplifted, their gaze returning not towards them, and their hearts a (gaping) void!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will be) hastening forward with necks outstretched, their heads raised up (towards the sky), their gaze returning not towards them and their hearts empty (from thinking because of extreme fear).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they shall run with their necks outstretched and heads erect, their glances never return to themselves, their hearts are empty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their necks outstretched, their heads upraised, their gaze unblinking, their hearts void.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Racing ahead, their heads raised up, their glance does not come back to them, and their hearts are void.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:43] as they come hastening (muhti‘īna is a circumstantial qualifier) with their heads turned upwards, to the heaven, their gaze, their sight, returning not to them, and their hearts as air, devoid of any sense, because of their being terror-stricken.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As they come hurrying on in fear) looking to the caller, (their heads upraised) stretching their necks; it is also said that this means: lowering down their heads, (their gaze returning not to them) out of fear and terror, (and their hearts as air) empty from all goodness; it is also said: neither coming out nor going back in. 270\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مُهْطِعِينَ } معناهُ يُدِيمُونَ النَّظَرَ\n ويقالُ مُسرعونَ\n\n\n\n\nوقوله تعالى: { مُقْنِعِي رُءُوسِهِمْ } معناهُ رافعوا رُءُوسهم\n\n\n\n\nوقوله تعالى: { وَأَفْئِدَتُهُمْ هَوَآءٌ } معناهُ مَنْحَرِفةٌ لاَ تَعي شَيئاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم مع هذه الحيرة والدهشة { مُهْطِعِينَ } مسرعين نحو المحشر، حيارى سكارى { مُقْنِعِي رُءُوسِهِمْ } أي: رافعيها نحو السماء، مترقبين لنزول البلاء، مدهوشين هائمين بحيث { لاَ يَرْتَدُّ إِلَيْهِمْ طَرْفُهُمْ } شدة ولههم وهيمانهم { وَ } في تلك الحالة { أَفْئِدَتُهُمْ } وقلوبهم التي هي محل الأمان والخيالات { هَوَآءٌ } [إبراهيم: 43] أي: خالية، لا يخطر ببالهم شيء ملطقاً وإن كانت لا تخلو عن الأخطار أبداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { مُهطعين }: مسرعين إلى الداعي مذلة واستكانة، كإسراع الأسير والخائف ونحوه، أو مقبلين بأبصارهم، لا يطرفون هيبة وخوفاً، { مُقنعي رؤوسهم } رافعيها إلى السماء كرفع الإبل رأسها عند رعيها أعالي الشجر\n وذلك من شدة الهول، أو من أجل الغل الذي في عنقه، كقوله\n\n[يس: 8]\n وقال الحسن في هذه الآية: وجوه الناس يوم القيامة إلى السماء لا ينظر أحد إلى أحد\n هـ\n { لا يرتدُّ إليهم طرفهم } ، بل تقف أعينهم شاخصة لا تطرف، أو: لا يرجع إليهم نظرهم فينظروا إلى أنفسهم، { وأفئدتهم هواء }: خلاء، محترقة، فارغة من الفهم، لا تعي شيئاً لفرط الحيرة والدهشة\n ومنه يُقال للأحمق وللجبان: قلبه هواء، أي: لا رأي فيه ولا قوة\n وقيل: خالية من الخير، خاوية من الحق",
      "translations": []
    }
  ]
}