{
  "chapter": "ابراهيم",
  "text": "يوم تبدل الارض غير الارض والسموت وبرزوا۟ لله الوحد القهار",
  "translations": [
    {
      "translation": "On the Day the earth is changed to other than the earth, and the heavens likewise, and they parade before Allah, the One, the All-Conquering,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when the earth will he replaced by some other than the earth, as will be the skies, and every one will appear before God the one and omnipotent,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Do warn them of the) Day when the heavens and the earth shall be altogether changed; when all will appear fully exposed before Allah, the One, the Irresistible!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the earth and the heavens will be replaced by another earth and heavens and everyone will be brought before the One Almighty God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the earth will be changed to other than this earth, and the heavens – and they will all come forth standing before Allah, the One, the Dominant above all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth will be changed to another earth and so will be the heavens, and they (all creatures) will appear before Allah, the One, the Irresistible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the earth shall be changed into a different earth, and the heavens (as well), and they shall come forth before Allah, the One, the Supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day the earth shall be changed to other than the earth, and the heavens and they sally forth unto God, the One, the Omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the earth will be changed to other than the earth, and the heavens (also will be changed) and they will come forth unto Allah, the One, the Almighty,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth shall be changed into another earth, as shall be the heavens, they will all appear before God, the One, the Most Supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day whereon the earth will be changed into other than the earth, and the heavens also; and all creatures will appear unto Allah, the One, the Subduer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when the earth is turned into another earth and the heavens [as well], and they are presented before Allah, the One, the All-paramount\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day the earth will be changed to a different earth, and so will be the heavens, and (men) will be marshalled forth, before Allah, the One, the Irresistible;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth will be changed to another earth and so will be the heavens, and they (all creatures) will appear before Allah, the One, the Irresistible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth is changed into other than the earth and the heavens, all shall come before Allah, the One, the Conqueror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth is changed into another earth, and the heavens, and they will emerge before God, the One, the Irresistible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It will be] on the Day the earth will be replaced by another earth, and the heavens [as well], and all creatures will come out before Allah, the One, the Prevailing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:48] And mention, the day when the earth will be changed to other than the earth and the heavens, namely, the Day of Resurrection: mankind shall be gathered onto a white clear earth, as [reported] in the hadīth of the two Shaykhs [al-Bukhārī and Muslim]. Muslim relates the following hadīth: ‘The Prophet (s) was asked, “Where will people be on that day?” He said, “On the Bridge (sirāt)” ’; and they shall come forth, they shall exit from [their] graves, to God, the One, the Almighty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when the earth will be changed to other than the earth) it will be changed to a state other than the actual state. Its changing will take place by adding to and subtracting from it, and its valleys and mountains will be levelled down; and it is also said that this means: the earth will be changed to other than what it is now, (and the heavens (also will be changed)) they will be folded up in His right Hand (and they will come forth unto Allah) they emerge and become manifest to (the One, the Almighty) Who conquers His created being by means of death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقله لهم يا أكمل الرسل: لا تغتروا عن إمهال الله إياكم أيها المسرفون في دنياكم؛ إذ ينتقم عنكم { يَوْمَ تُبَدَّلُ ٱلأَرْضُ } وتغير تغييراً كلياً، بأن دكت الجبال دكاً وصارت مسوى لا عوج لها ولا أمتاً، وصارت { غَيْرَ ٱلأَرْضِ } التي كانت قبل هذا { وَ } طويت { ٱلسَّمَٰوَٰتُ } المحسوسة، وانتثرت الكواكب، وكورت الشمس، فصارت أيضاً غير تلك السماوات، وبالجملة: تضعفت أركان العالم وتغيرت أوضاعها وأشكالها واضمحلت آثارها وتلاشت أجزاؤها، وتداخلت أرجاؤها وأقطارها { وَبَرَزُواْ } أي: ظهروا وخرجوا أي: الأموات من أجداث أجسادهم بعد خلع تعيناتهم وجلباب هوياتهم { لِلَّهِ } المظهر لهم الظاهر فيهم { ٱلْوَاحِدِ } في ذاته وصفاته وأحواله وجميع شئونه وتجلياته، المستقل في وجوده { الْقَهَّارِ } [إبراهيم: 48] للأغيار والسوى مطلقاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يظهر ذلك { يوم تُبدَّل الأرضُ غيرَ الأرضِ } ، أ اذكر { يوم تبدل الأرض غير الأرض } ، فتبدل أرض الدنيا يوم القيامة بأرض بيضاء عفراء، كقُرْصَة النقِيّ، كما في الصحيح\n { و } تبدل { السماوات } بأن تنشق وتُطوى كطي السجل للكتب، ويبقى العرش بارزاً، وهو سماوات الجنة\n قال البيضاوي: والتبديل يكون في الذات، كقوله: بدلت الدراهم بالدنانير، وعليه قوله: { بَدَّلْنَاهُمْ جُلُوداً غَيْرَهَا } [النساء: 56]، وفي الصفة، كقولك: بدلت الحلقة خاتماً، إذا أذبتها وغيرت شكلها\n وعليه قوله\n\n[الفرقان: 70]\n والآية تحتملها، فعن علي رضي الله عنه: تبدل أرضاً من فضة وسماوات من ذهب، وعن ابن عباس ـ رضي الله عنهما ـ: هي تلك الأرض، وإنما تغير صفاتها، ويدل عليه ما روى أبو هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال:\n\n \" تُبَدَّلُ الأرْضُ غَيْرَ الأرْضِِ فَتبْسَط، وتُمَدّ مد الأديم العكَاظيّ، \" لا ترى فيها عِوجاً ولا أمتا  \"\n \n\nقال ابن عطية: وأكثر المفسرين على أن التبديل يكون بأرض بيضاء عَفراءَ لم يُعْصَ اللهُ فيها، ولا سُفِكَ فيها دم، وليس فيها مَعْلم لأحد\n\n\nورُوي ان النبي صلى الله عليه وسلم قال: \" المُؤْمِنُ في وَقْتِ التبديلِ في ظل العرْشِ \"\n ورُويَ عنه صلى الله عليه وسلم أنه قال:\n\n \" الناسُ، وقتَ التبديل، على الصِّرَاط \" \n\nورُوي أنه قال:\n\n \" الناس حينئذٍ أضْيَافُ الله فلا يُعجزهم ما \"\n \n\nوفي سراج المريدين لابن العربي: أن الله خلق الأرض مختلفة محدودبة ويخلقها يوم القيامة مستوية، لا ترى فيها عوجاً ولا أمتاً، متماثلة بيضاء كخبرة النقى، كما في الصحيح، وأما تبديل السماوات فليس في كيفيتها حديث، وإنما هو مجهول\n وفي حديث مسلم:\n\n \" أين يكون الناس يوم تبدل الأرض؟ قال: هم على الصراط \" \n\nقال: يحتمل أنه الصراط المعروف، ويحتمل أنه اسم لموضع غيره، تستقر الأقدام عليه، وكأنه الأظهر للحديث الآخر\n وقد سألته عائشة ـ وضي الله عنها ـ أين يكون الناس يوم تبدل الأرض؟ قال صلى الله عليه وسلم\n\n \" هُمْ في الظُّلْمَةِ دُونَ الجسْر \"\n \n\nوالجسر: الصراط\n هـ\n أما تبديل الأرض: فظاهر الآيات أنها قبل البعث والحشر، فلا يقع البعث والحشر، إلا على الأرض المبدلة كقوله\n\n[الكهف: 47]، وقوله\n\n[طه: 105 ـ 106]\n\n ثم قال\n\n[طه: 108]\n وقوله\n\n[الواقعة: 1]، ثم قال:\n\n[الواقعة: 4 ـ 5] إلى غير ذلك من الآيات\n والأرواح حينئذٍ أضياف الله، أو في ظل العرش، أو دون الجسر، حيث يعلم الله\n وأما تبديل السماوات فظاهر الأخبار أنه وقت وقوف الناس في المحشر، حيث تشقق السماء بالغمام وتنزل الملائكة تنزيلاً\n والله تعالى أعلم\n { وبرزوا للهِ الواحدِ القهار } ، أي: وبرزوا من أجداثهم لمحاسبة الواحد القهار، أو لمجازاته\n وتوصيفه بالوصفين للدلالة على أنه في غاية الصعوبة، كقوله\n",
      "translations": []
    }
  ]
}