{
  "chapter": "ابراهيم",
  "text": "رب اجعلنى مقيم الصلوة ومن ذريتى ربنا وتقبل دعاء",
  "translations": [
    {
      "translation": "My Lord! Make me and my descendants people who establish salat. My Lord! Accept my prayer.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Grant, O Lord, that I and my offspring may remain constant in devotion. Grant, O Lord, my supplication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Enable me and my offspring to establish Prayer, and do accept, our Lord, this prayer of mine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, make me and my offspring steadfast in prayer and accept our worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my Lord! Maintain me as one who establishes prayer, and some of my descendants; O our Lord! and accept my prayer.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord! Make me one who performs Salah, and (also) from my offspring, our Lord! And accept my invocation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! make me keep up prayer and from my offspring (too), O our Lord, and accept my prayer:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, make me a performer of the prayer, and of my seed. Our Lord, and receive my petition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Make me to establish proper worship, and some of my posterity (also); our Lord! and accept my prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, grant that I may keep up the prayer, and so may my offspring. My Lord, accept my prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! make me establisher of prayer and also from my progeny, our Lord! and accept Thou my supplication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Make me a maintainer of prayer, and my descendants [as well]. Our Lord, accept my supplication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord! make me one who establishes regular Prayer, and also (raise such) among my offspring O our Lord! and accept Thou my Prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord! Make me one who performs As-Salat (Iqamat-as-Salat), and (also) from my offspring, our Lord! And accept my invocation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, make me and my descendants establishers of prayer. Our Lord, accept my prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“My Lord, make me one who performs the prayer, and from my offspring. Our Lord, accept my supplication.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, make me an establisher of prayer, and [many] from my descendants. Our Lord, and accept my supplication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:40] My Lord, make me an establisher of prayer, and, make, of my seed, those who will establish it (the use of [partitive] min [in min dhurriyatī, ‘of my seed’] is because God informed him that some of them [his seed] would be disbelievers). Our Lord! And accept my supplication, the [supplication] mentioned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(My Lord!) my lord! (Make me to establish proper worship) make me perform the prayer properly, (and some of my posterity (also)) he says: bless me and bless my offspring so that we perform the prayer properly; (our Lord!) our Lord! (and accept the prayer) accept my worship.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رَبِّ ٱجْعَلْنِي مُقِيمَ ٱلصَّلاَةِ } على وجه الخضوع والخشوع والتبتل والأخلاص { وَ } اجعل { مِن ذُرِّيَتِي } أيضاً من يقيمها على الوجه المذكور { رَبَّنَا } استجب مني { وَتَقَبَّلْ دُعَآءِ } [إبراهيم: 40] في حقي وحق أولادي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ربنا وتقبل دعاء } أي: استجب، أو تقبل عبادتي\n { ربنا اغفر لي ولوالدي } ، وكان هذا الدعاء قبل النهي، أو قبل تحقق موتهما على الكفر، أو يريد آدم وحواء\n { وللمؤمنين يوم يقول الحسابُ } أي: يثبت ويتحقق وجوده، مستعار من القيام على الرِّجل، كقولهم: قامت الحرب على ساق\n أو يقوم إليه أهله، فحذف المضاف، أي: يقوم أهل الحساب إليه، وأسند إليه قيامهم مجازاً\n الإشارة: إتيان النسل البشري، أو الروحاني، من أجلِّ النعم وأكملها على العبد، وفي الحديث:\n\n \" إذَا مَاتَ العَبْدُ انْقََطََعَ عَمَلُه إِلاَّ مَن ثَلاثٍَ، صدقةٍ جَاريةٍ، أو عَلْم بَثَه في صُدُور الرِّجالِ، أو وَلدٍ صالح يدعُو له بَعدَ مَوتهِ \" \n\nوالولد الروحاني أتم، لتحقق استقامته في الغالب\n وطلب ذلك محمود كما فعل الخليل وزكريا، وغيرهما، وقد مدح الله مَنْ فعل ذلك بقوله:\n\n[الفرقان: 74]\n وقرة عين في الذرية: أن يكونوا على الاستقامة في الدين، وسلوك منهاج الصالحين\n وكل ما أتوا به من الطاعة والإحسان فللوالدين حظ ونصيب من ذلك، ولا فرق بين الولد الروحاني والبشري، وفي ذلك يقول الشاعر:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:34",
      "similarity": 0.5526061363452534
    },
    {
      "verse": "37:77",
      "similarity": 0.4698812700257705
    },
    {
      "verse": "13:38",
      "similarity": 0.44879437169326786
    },
    {
      "verse": "99:7",
      "similarity": 0.4201189909753851
    },
    {
      "verse": "57:26",
      "similarity": 0.3727487672610554
    }
  ]
}