{
  "chapter": "ابراهيم",
  "text": "وانذر الناس يوم ياتيهم العذاب فيقول الذين ظلموا۟ ربنا اخرنا الى اجل قريب نجب دعوتك ونتبع الرسل اولم تكونوا۟ اقسمتم من قبل ما لكم من زوال",
  "translations": [
    {
      "translation": "Warn mankind of the Day when the punishment will reach them. Those who did wrong will say. 'Our Lord. reprieve us for a short time. We will respond to Your call and follow the Messengers.' 'But did you not swear to",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn the people of that Day when the punishment would be inflicted upon them. Then will the wicked say: \"O our Lord, give us respite a while more. We shall heed Your call and follow the apostles.\" (But they will be told,): \"Are you not those who used to swear: 'There is no reverse for us?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), warn mankind of the Day when a severe chastisement shall overtake them, and the wrong-doers will say: \"Our Lord, grant us respite for a short while; we shall respond to Your call and will follow Your Messengers.\" (But they will be clearly told): \"Are you not the same who swore earlier that they shall never suffer decline?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), warn the people of the day when torment will approach them and the unjust will say, \"Lord, give us respite for a little time so that we may answer your call and follow the Messengers.\" (The answer to their prayer will be), \"Did you not swear before that you would never perish?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn the people of a day when the punishment will come upon them, therefore the unjust will say, “O our Lord! Give us respite for a little while – for us to obey Your call and follow the Noble Messengers”; (It will be said) “So had you not sworn before that, ‘We have not to move to any place else from the earth’?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn mankind of the Day when the torment will come unto them; then the wrongdoers will say: \"Our Lord! Respite us for a little while, we will answer Your call and follow the Messengers!\" (It will be said:) \"Had you not sworn aforetime that you would not leave (the world for the Hereafter).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn people of the day when the chastisement shall come to them, then those who were unjust will say: O our Lord! respite us to a near term, (so) we shall respond to Thy call and follow the apostles. What! did you not swear before (that) there will be no passing away for you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn mankind of the day when the chastisement comes on them, And those who did evil shall say, 'Our Lord, defer us to a near term, and we will answer Thy call, and follow the Messengers.' 'Ah, but did you not swear aforetime there should be no removing for you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn mankind of a day when the doom will come upon them, and those who did wrong will say: Our Lord! Reprieve us for a little while. We will obey Thy call and will follow the messengers. (It will be answered): Did ye not swear before that there would be no end for you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn men of the Day when the punishment will come upon them, and when the wrongdoers will say, \"Our Lord, grant us respite for a short while. We will respond to Your call and will follow the messengers.\" [But God will answer], are you not those who swore that you would never suffer any decline?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn thou the mankind of the Day whereon the torment will come unto them; then those who have done wrong shall say: our Lord! defer us to a term near at hand we will answer Thy call and we will follow the apostles. Were ye not wont to swear afore that for you there was to be no decline?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn the people of the day when the punishment will overtake them, whereat the wrongdoers will say, ‘Our Lord! Respite us for a short time so that we may respond to Your call and follow the apostles.’ [They will be told,] ‘Did you not use to swear earlier that there would be no reverse for you,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So warn mankind of the Day when the Wrath will reach them: then will the wrong-doers say: \"Our Lord! respite us (if only) for a short term: we will answer Thy call, and follow the messengers!\" \"What! were ye not wont to swear aforetime that ye should suffer no decline?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn (O Muhammad SAW) mankind of the Day when the torment will come unto them; then the wrong-doers will say: \"Our Lord! Respite us for a little while, we will answer Your Call and follow the Messengers!\" (It will be said): \"Had you not sworn aforetime that you would not leave (the world for the Hereafter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn mankind of the Day when the punishment will overtake them, when the evildoers will say: 'Our Lord, grant us respite for awhile, we will answer Your call, and follow the Messengers' Did you not once swear that you would never cease?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn mankind of the Day when the punishment will come upon them, and the wicked will say, “Our Lord, defer us for a little while, and we will answer Your call and follow the messengers.” Did you not swear before that there will be no passing away for you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, [O Muhammad], warn the people of a Day when the punishment will come to them and those who did wrong will say, \"Our Lord, delay us for a short term; we will answer Your call and follow the messengers.\" [But it will be said], \"Had you not sworn, before, that for you there would be no cessation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:44] And warn, make [them] have fear, O Muhammad (s), mankind, the disbelievers, of the day when chastisement will come upon them, namely, the Day of Resurrection, and those who did evil, who disbelieved, will say, ‘Our Lord, give us respite, by returning us to the world, for a brief while, that we might respond to Your call, by affirming [Your] Oneness, and follow the messengers’. It is then said to them in rebuke: ‘But did you not use to swear formerly, in the world, that for you there would be no passing [away]? (min zawālin: min is extra) from this [world] to the Hereafter?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And warn mankind) warn the people of Mecca by means of the Qur'an (of a day) the Day of Badr; it is also said that this is a reference to the Day of Judgement (when the doom will come upon them, and those who did wrong) the idolaters (will say: Our Lord!) our Lord! (Reprieve us for a little while) in the life of this world. (We will obey Your call) to monotheism (and will follow the messengers) we will obey the messengers. Allah will then say to them: (Did ye not swear before) before this, when you were in the life of the lower world (that there would be no end for you) in the life of the world and that there is no resurrection?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } متى سمعت يا أكمل الرسل أهوال يوم القيامة وأحوال الأنام فيها { أَنذِرِ ٱلنَّاسَ } الناسين عهود الحق ومواثيقه التي عهدوا معه في بدء فطرتهم أي بشيء يفعلون { يَوْمَ يَأْتِيهِمُ ٱلْعَذَابُ } في اليوم الموعود، وحينئذٍ انقطعت أسباب النجاة وتدبيرات الخلاص ولا يسع لهم التدارك أصلاً { فَيَقُولُ ٱلَّذِينَ ظَلَمُوۤاْ } أنفسهم بتكذيب الله وتكذيب رسله حين رأوا العذاب، مناجين متضرعين متمنين: { رَبَّنَآ أَخِّرْنَآ } أي: أعدنا وأرجعنا إلى الدنيا وأمهلنا فيها { إِلَىٰ أَجَلٍ قَرِيبٍ } أي: أيام قلائل { نُّجِبْ دَعْوَتَكَ } وتقبلها عن ألسنة رسلك { وَنَتَّبِعِ ٱلرُّسُلَ } ونصدقهم بجميع ما جاءوا به من عندك فيقال لهم على سبيل التهكم والتقريع: { أَوَلَمْ تَكُونُوۤاْ } أيها الظالمون المسرفون { أَقْسَمْتُمْ مِّن قَبْلُ } في دار الدنيا بطرين مغرورين { مَا لَكُمْ مِّن زَوَالٍ } [إبراهيم: 44] أي: ما لنا وبال ولأموالنا زوال، وما لنا عن أماكننا ارتحال وانتقال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنذر الناس } يا محمد، أي: خوفهم هذا اليوم، وهو: { يوم يأتيهم العذابُ } ، يعني يوم القيامة، أو يوم الموت فإنه أول مطلع عذابهم، { فيقول الذين ظلموا } بالشرك والتكذيب: { ربنا أخِّرنا إلى أجل قريب } أي: أخِّر العذاب عنا، وردنا إلى الدنيا، وأمهلنا إلى أجل قريب، { نُجب دعوتك } حينئذٍ { ونتبع الرسلَ } ونظيره:\n\n[المنافقون: 10]\n قال تعالى لهم: { أو لم تكونوا أقسمتم من قبلُ } أنكم باقون في الدنيا، { ما لكم من زوال } عنها بالموت ولا بغيره، ولعلهم أقسموا بطراً وغروراً\n أو دل عليه حالهم حيث بنوا مشيداً، وأمَّلوا بعيداً\n أو أقسموا أنهم لا يُنقلون إلى دار أخرى، وأنهم إذا ماتوا لا يُزالون عن تلك الحالة، ولا ينقلون إلى دار الجزاء، كقوله:\n\n[النحل: 38]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:46",
      "similarity": 0.7519205701601965
    },
    {
      "verse": "35:41",
      "similarity": 0.7176176944299433
    },
    {
      "verse": "63:10",
      "similarity": 0.16054843075152642
    },
    {
      "verse": "28:64",
      "similarity": 0.14412325749085914
    },
    {
      "verse": "10:89",
      "similarity": 0.14369670849709765
    }
  ]
}