{
  "chapter": "ابراهيم",
  "text": "وسكنتم فى مسكن الذين ظلموا۟ انفسهم وتبين لكم كيف فعلنا بهم وضربنا لكم الامثال",
  "translations": [
    {
      "translation": "even though you inhabited the houses of those who had wronged themselves and it was made clear to you how We had dealt with them and We gave you many examples?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet you dwelt in the dwellings of those who had exceeded themselves, and it was evident to you how We had dealt with them; and We held out examples before you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You said so even though you had lived in the dwellings of those who had wronged themselves (by sinning), and you were aware how We dealt with them, and We had even explained to you all this by giving examples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You lived in the dwellings of those who wronged themselves, even though it was made clear to you how We dealt with them. We also showed you examples.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And you dwelt in the houses of those who had wronged themselves and it became very clear to you how We had dealt with them, and We illustrated several examples for you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you dwelt in the dwellings of men who wronged themselves, and it was clear to you how We dealt with them. And We put forth (many) parables for you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you dwell in the abodes of those who were unjust to themselves, and it is clear to you how We dealt with them and We have made (them) examples to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you dwelt in the dwelling-places of those who wronged themselves, and it became clear to you how We did with them, and how We struck similitudes for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (have ye not) dwelt in the dwellings of those who wronged themselves (of old) and (hath it not) become plain to you how We dealt with them and made examples for you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You lived in the dwellings of those who wronged themselves, and it was made clear to you how We had dealt with them and We gave you many examples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye dwell in the dwellings of those who had wronged themselves and it had become manifest unto you in what wise We had dealt with them, and We had propounded for you similitudes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "while you dwelt in the dwellings of those who had wronged themselves [before], and it had been made clear to you how We had dealt with them [before you], and We had [also] cited examples for you?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye dwelt in the dwellings of men who wronged their own souls; ye were clearly shown how We dealt with them; and We put forth (many) parables in your behoof!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you dwelt in the dwellings of men who wronged themselves, and it was clear to you how We had dealt with them. And We put forth (many) parables for you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You lived in the dwellings of those who wronged themselves, and it was clear to you how We dealt with them, and how We struck parables for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you inhabited the homes of those who wronged themselves, and it became clear to you how We dealt with them, and We cited for you the examples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you lived among the dwellings of those who wronged themselves, and it had become clear to you how We dealt with them. And We presented for you [many] examples.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:45] And you dwelt, in it, in the dwelling-places of those who wronged themselves, through unbelief, [those] from among communities of old, and it became clear to you how We dealt with them, by way of punishment — but you were not restrained [thereby] — and We struck, made clear, similitudes for you, in the Qur’ān, but you did not take heed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (have ye not) dwelt in the dwellings of those who wronged themselves (of old)) through idolatry and denial without take heed from their destruction (and (hath it not) become plain to you how We dealt with them) in this worldly life, (and made) struck (examples for you) in the Qur'an of all sorts: of promises, of threats, of mercy and of chastisement?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مقسمين بما أقسمتم { وَتَبَيَّنَ لَكُمْ } وظهر عندكم الآن { كَيْفَ فَعَلْنَا بِهِمْ } وكيف انتقمنا عنهم وأستأصلناهم { وَ } صار أمر إهلاكهم من الفضاحة إلى أن { ضَرَبْنَا لَكُمُ ٱلأَمْثَالَ } [إبراهيم: 45] لتعتبروا عن حالهم وتتركوا أفعالهم\n لئلا تُنتقموا أمثالهم\n ومع ذلك لم تعتبروا ولم تتركوا\n فالآن تصابون وتؤاخذون بأشد مما أصيبوا وأُخذوا\n\n\n{ وَ } لا يفيدكم اليوم المكر والحيلة كما لا يفيد لهم مكرهم حين أخذهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } قد { ضربنا لكم الأمثالَ } من أحوالهم\n أي: بيَّنا لكم أنكم مثلهم في الكفر واستحقاق العذاب\n أو بيَّنا لكم صفات ما فعلوا\n وما فُعل بهم\n التي هي في الغرابة كالأمثال المضروبة\n\nالإشارة: كما أمهل\n سبحانه الظالمين إلى دار الشدائد والأهوال\n أمهل عباده الصالحين إلى دار الكرامة والنوال لأن هذه الدار لا تسع ما أراد أن يعطيهم من الخيرات لأنها ضيقة الزمان والمكان\n فقد أجلَّ مقدارهم أن يجازيهم في دار لا بقاء لها\n وتلك الدار باقية لا نفاذ لها\n ففيها يتمحض الجمال والجلال\n فبقدر ما ينزل على أهل الجلال من الأهوال ينزل على أهل الجمال من الكرامة والنوال\n وتأمل ما تمناه أهل الجلال حين نزلت بهم الأهوال من قولهم: { ربنا أخرنا إلى اجل قريب نُجب دعوتك ونتبع الرسل } \n ثم بادر إلى إجابة الداعي\n واتباع الرسول الهادي\n في كل ما جاء به من الأوامر والنواهي\n واعتبر بمساكن الذين ظلموا أنفسهم\n كيف فعل بهم الزمان؟ وكيف غرتهم الأماني وخدعهم الشيطان\n حتى أسكنهم دار الذل والهوان؟ فشد يدك على الطاعة والإحسان والشكر لله على الهداية لنعمة الإسلام\n والإيمان\n وعلق قلبك بمقام الإحسان فإن الله يرزق العبد على قدر نيته\n وبالله التوفيق\n ثمَّ ذكر ما فعل بأهل المكر والخذلان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:48",
      "similarity": 0.5310209131540908
    },
    {
      "verse": "25:9",
      "similarity": 0.5310209131540908
    },
    {
      "verse": "16:74",
      "similarity": 0.5005281593562394
    },
    {
      "verse": "29:43",
      "similarity": 0.40524334490895364
    },
    {
      "verse": "39:27",
      "similarity": 0.3891198639555189
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/014045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/014045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/14:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}