{
  "chapter": "ابراهيم",
  "text": "ولا تحسبن الله غفلا عما يعمل الظلمون انما يؤخرهم ليوم تشخص فيه الابصر",
  "translations": [
    {
      "translation": "Do not consider Allah to be unaware of what the wrongdoers perpetrate. He is merely deferring them to a Day on which their sight will be transfixed,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not God is oblivious of the deeds of the wicked. He has only allowed them respite till the Day on which all eyes would stare aghast,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think Allah is heedless of the evil deeds in which the evil-doers are engaged. He is merely granting them respite until a Day when their eyes shall continue to stare in horror,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), do not think that God is unaware of what the unjust people do. He only gives them a respite until the day when the eyes will stare fixedly,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not ever assume that Allah is unaware of what the unjust do; He does not give them respite but for a day in which the eyes will become fixed, staring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consider not that Allah is unaware of that which the wrongdoers do, but He gives them respite up to a Day when the eyes will stare in horror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not think Allah to be heedless of what the unjust do; He only respites them to a day on which the eyes shall be fixedly open,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deem not that God is heedless of what the evildoers work; He is only deferring them to a day when eyes shall stare,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deem not that Allah is unaware of what the wicked do. He but giveth them a respite till a day when eyes will stare (in terror),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think God is unaware of the wrongdoers' actions. He only gives them respite till the Day on which all eyes will stare fixedly in horror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And deem not Allah negligent of that which the wrong-doers work: He only deferreth them to a Day whereon the sighthall remain staring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not suppose that Allah is oblivious of what the wrongdoers are doing. He is only granting them respite until the day when the eyes will be glazed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think not that Allah doth not heed the deeds of those who do wrong. He but giveth them respite against a Day when the eyes will fixedly stare in horror,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consider not that Allah is unaware of that which the Zalimun (polytheists, wrong-doers, etc.) do, but He gives them respite up to a Day when the eyes will stare in horror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not think that Allah is unaware of the harmdoers work. He only gives them respite till the Day on which all eyes will stare,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not ever think that God is unaware of what the wrongdoers do. He only defers them until a Day when the sights stare.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never think that Allah is unaware of what the wrongdoers do. He only delays them for a Day when eyes will stare [in horror].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:42] And do not suppose that God is heedless of what the evildoers, the disbelievers from among the people of Mecca, do. He but gives them respite, without chastisement, until a day when eyes shall stare wide-open, because of the terror of what they see (one says shakhasa basaru fulān to mean ‘he opened them [his eyes] and did not shut them’);\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Deem not that Allah is unaware of what the wicked do) do not think that Allah will not punish the idolaters for what they do. (He but gives them a respite till a day when eyes will stare (in terror)) the eyes of the disbelievers will stare in terror on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَحْسَبَنَّ } يا أكمل الرسل { ٱللَّهَ } المطلع على سرائر الأمور وخفياته { غَافِلاً } ناسياً ذاهلاً { عَمَّا يَعْمَلُ ٱلظَّالِمُونَ } الخارجون عن حدود الله بإمهالهم زماناً\n بل { إِنَّمَا يُؤَخِّرُهُمْ } ويسوِّف عذابهم { لِيَوْمٍ تَشْخَصُ } وتتحير { فِيهِ ٱلأَبْصَارُ } [إبراهيم: 42] وصاروا من شدة الهول والمهابة لا يقدرون على أن يطرفوا عيونهم\n بل تبقى مفتوحة حائرة كيعون الموتى\n كأنهم قد انقطعت أرواحهم عن أجسادهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يوم يأتيهم: مفعول ثانٍ لأَنذِر\n ولا يصح أن يكون ظرفاً\n ونُجبْ دعوتك جواب الأمر\n يقول الحق جل جلاله: { ولا تحسبنَّ } أيها السامع\n أن { اللَّهَ غافلاً عما يعملُ الظالمون } \n أو أيها الرسول\n بمعنى: دُمْ على ما أنت عليه من أن الله مطلع على أفعالهم\n لا تخفى عليه خافية\n غير غافل عنهم\n وهو وعيد بأنه معاقبهم على قليله وكثيره لا محالة\n وقيل: إنه تسلية للمظلوم وتهديد للظالم فالحق تعالى يمهل ولا يهمل\n { إنما يؤخرهم } \n أي: يؤخر عذابهم { ليوم تشخص فيه الأبصارُ } \n أي: تحد فيه النظر\n من غير أن تطرف من هول ما ترى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:97",
      "similarity": 0.9134001888212239
    },
    {
      "verse": "21:1",
      "similarity": 0.12515449136857432
    },
    {
      "verse": "30:7",
      "similarity": 0.11126618672694763
    },
    {
      "verse": "27:93",
      "similarity": 0.11022366167575329
    },
    {
      "verse": "46:5",
      "similarity": 0.10848595477594725
    }
  ]
}