{
  "chapter": "ابراهيم",
  "text": "وقد مكروا۟ مكرهم وعند الله مكرهم وان كان مكرهم لتزول منه الجبال",
  "translations": [
    {
      "translation": "They concocted their plots, but their plots were with Allah, even if they were such as to make the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Still they are plotting their plots, but evident are their plots to God, even though they are so adroit as to make the mountains move.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the unbelievers contrived their plan, but it is in Allah's power to nullify their plan, even though their plans were such that would move even mountains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They devised evil plans which were so sinful that even the mountains could not endure them. All these were known to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed they carried out their scheme, and their scheming is within Allah’s control; and their scheme was not such that could move these mountains*. (* The revelations / signs of Allah.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they planned their plot, and their plot was with Allah, though their plot was not such as to remove the mountains from their places.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have indeed planned their plan, but their plan is with Allah, though their plan was such that the mountains should pass away thereby.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They devised their devising, and their devising is known to God; though their devising were such as to remove mountains.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily they have plotted their plot, and their plot is with Allah, though their plot were one whereby the mountains should be moved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hatched their plots; but these plots were all within God's knowledge. Though their plots were such as to shake the mountains, God will bring their plots to nothing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of a surety theys Plotted their plot, and with Allah was their plot, though their plot was such as to remove thereby mountains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They certainly devised their plots, but their plots are known to Allah, and their plots are not such as to dislodge the mountains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mighty indeed were the plots which they made, but their plots were (well) within the sight of Allah, even though they were such as to shake the hills!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they planned their plot, and their plot was with Allah, though their plot was a great (one, still) it would never be able to remove the mountains (real mountains or the Islamic law) from their places (as it is of no importance) [Tafsir Ibn Kathir, Vol. 2, Page 597]. [It is said by some interpreters regarding this Verse that the Quraish pagans plotted against Prophet Muhammad SAW to kill him but they failed and were unable to carry out their plot which they plotted].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They plotted their plots, but their plots are (known) to Allah, even though their plots were such as to move mountains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They planned their plans, but their plans are known to God, even if their plans can eliminate mountains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they had planned their plan, but with Allah is [recorded] their plan, even if their plan had been [sufficient] to do away with the mountains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:46] And verily they plotted, against the Prophet (s), their plot — when they desired to kill him, or detain him [in his house] or banish him — but their plotting is with God, that is to say, knowledge or the requital thereof [is with God], and their plotting, even though it be great, was not such whereby mountains should be moved, meaning that it is not of any importance, but that they are only harming themselves thereby. It is said that the use of ‘mountains’ here is meant to be literal; alternatively, it is also said [to be a reference to] the laws of Islam, which are likened to these [mountains] in the way that they are established and fixed (a variant reading has la-tazūlu [instead of li-tazūla], with in softened [from inna, ‘verily’], in which case the intended meaning is that [the extent of] their plotting is great. It is said that ‘plotting’ here is [actually a reference to] their unbelief. This second [reading] is consonant with [God’s saying]: Whereby the heavens are almost torn and the earth split asunder and the mountains fall crashing [Q. 19:90]; according to the former [reading], however, one should read it as [if it were] wa-mā kāna, and [their plotting] was not such …).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily they have plotted their plot) they did their deed through their denial of the messengers, (and their plot is with Allah) the punishment of their deed is with Allah, (though their plot were one whereby the mountains should be moved) whereby the mountains should crumble; it is also said that this means: the plotting of Nimrod was such that the mountains would have crumbled, for the sounds of the Ark and eagles were heard.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لا يفيدكم اليوم المكر والحيلة كما لا يفيد لهم مكرهم حين أخذهم؛ إذ { قَدْ مَكَرُواْ مَكْرَهُمْ } الذي خيلوه دلائل قاطعة وظنوه براهين ساطعة { وَعِندَ ٱللَّهِ مَكْرُهُمْ } إي: لم يفهموا أن عند الله سبحانه ما يزيل مكرهم وحيلهم { وَإِن كَانَ مَكْرُهُمْ } في المتانة والقوة { لِتَزُولَ مِنْهُ ٱلْجِبَالُ } [إبراهيم: 46] إذ لا يعارض فعله ولا ينازع حكمه، بل له الغلبة والاستيلاء والتعزز والكبرياء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وإن كان مكرُهم \" إن \" نافية، واللام للجحود، ومن قرأ \" لّتزول \" بفتح اللام، فإن مخففة، واللام فارقة و يوم تُبدل: بدل من يوم يأتيهم، أو ظرف للانتقام، أو مقدر باذكر، أو بمخلف وعده\n ولا يجوز ان ينتصب بمخلف لأن ما قبل \" إن \" لا يعمل فيما بعدها\n والسماوات: عطف على الأرض، أي: وتبدل السماوات\n يقول الحق جل جلاله: { وقد مكروا } بك يا محمد { مكرَهُم } الكلي، واستفرغوا جهدهم في إبطال الحق وتقرير الباطل، { وعند الله مكرُهُم } اي: مكتوب عنده فعلهم، فيجازيهم عليه\n أو عند الله ما يمكرهم به جزاء لمكرهم، وإبطالاً له، { وإن كان مكرُهُم } في العظم والشدة، { لِتزولَ منه الجبال } الثوابت لو زالت تقديراً، أو ما كان مكرهم لِتزولَ منه الجبال، أي: الشرائع والنبوات الثابتة كالجبال الرواسي\n والمعنى على هذا تحقير مكرهم لأنه لا تزول منه تلك الجبال الثابتة الراسخة، أو: وإن مكرهم لَتزولُ منه الجبال من شدته، ولكن الله عصم ووقى\n وقيل: الآية متصلة بما قبلها، أي وسكنتم في مساكن الذين ظلموا أنفسهم، ومكروا مكرهم في إبطال الحق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:41",
      "similarity": 0.7738735420788395
    },
    {
      "verse": "14:44",
      "similarity": 0.7519205701601968
    },
    {
      "verse": "3:54",
      "similarity": 0.19190536960579543
    },
    {
      "verse": "71:22",
      "similarity": 0.18849620523830832
    },
    {
      "verse": "7:99",
      "similarity": 0.1834752594891727
    }
  ]
}