{
  "chapter": "ابراهيم",
  "text": "ليجزى الله كل نفس ما كسبت ان الله سريع الحساب",
  "translations": [
    {
      "translation": "That God may reward each soul for its deeds. Indeed God is swift at reckoning!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that Allah may requite each person for his deeds. Allah is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is how God will recompense each soul for its deeds. God's reckoning is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that Allah may repay each soul what it had earned; indeed Allah spends no time in judging the account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may requite each person according to what he has earned. Truly, Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may requite each soul (according to) what it has earned; surely Allah is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that God may recompense every soul for its earnings; surely God is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may repay each soul what it hath earned. Lo! Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will requite each soul according to its deeds. Swift is God's reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may requite each soul according to that which he hath earned: verily Allah is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that Allah may reward every soul for what it has earned. Indeed Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may requite each soul according to its deserts; and verily Allah is swift in calling to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may requite each person according to what he has earned. Truly, Allah is Swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will recompense each soul according to its earnings. Swift is the Reckoning of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That God may repay each soul according to what it has earned. God is Quick in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that Allah will recompense every soul for what it earned. Indeed, Allah is swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:51] that God may requite (li-yajziya is semantically connected to [the verb] barazū, ‘they shall come forth’) every soul for what it has earned, of good and evil. Truly God is swift at reckoning — He shall reckon with all creatures in about half a day of the days of this world, as one hadīth states to that effect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "They emerge and become manifest to Allah so (That Allah may repay each soul) whether it is a believing or a sinful soul (what it hath earned) of good or evil. (Lo! Allah is swift at reckoning) Allah is severe in His chastisement. 271\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوما ذلك؛ أي: انتقامهم وأخذهم إلاَّ { لِيَجْزِىَ ٱللَّهُ } الحكيم العليم المتقن في أفعاله ومأموراته ومنهياته وجميع تدبيراته { كُلَّ نَفْسٍ } متعينة بتعين مخصوص { مَّا كَسَبَتْ } وامتثلت ما أُمرت به ونُهيت عنه أو أعرضت { إِنَّ ٱللَّهَ } الرقيب على عباده، المطلع لجميع أفعالهم { سَرِيعُ ٱلْحِسَابِ } [إبراهيم: 51] يحاسبهم ويجازيهم على مقتضى حسابه عدلاً منه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إن الله سريع الحساب } ، فيحاسب الناس في ساعة واحدة لأنه لا يشغله حسابٌ عن حساب، فكل شخص يظهر له أنه واقف بين يديه، يُحاسب في وقتِ حسابِ الآخر لأن ذلك وقت خرق العوائد",
      "translations": []
    }
  ]
}