{
  "chapter": "ابراهيم",
  "text": "هذا بلغ للناس ولينذروا۟ به وليعلموا۟ انما هو اله وحد وليذكر او۟لوا۟ الالبب",
  "translations": [
    {
      "translation": "This is a communication to be transmitted to mankind so that they may be warned by it and so that they will know that He is One God and so that people of intelligence will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a message for mankind that they may take a warning from it, and may know that He is the one and only God, and that men of wisdom may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a proclamation for all mankind that they may be warned by it, and that they may know that their God is none but the One True God, and that men of understanding may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is an admonition for the people that they will be warned and know that He is the only God, and so that the people of understanding may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the message to be conveyed to all mankind – and in order to warn them with it, and for them to know that He is the only One God, and for men of understanding to heed advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (Qur'an) is a Message for mankind (and a clear proof against them), in order that they may be warned thereby, and that they may know that He is the only One God and that men of understanding may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a sufficient exposition for the people and that they may be warned thereby, and that they may know that He is One Allah and that those possessed of understanding may mind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Message to be delivered to mankind that they may be warned by it, and that they may know that He is One God, and that all possessed of minds may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a clear message for mankind in order that they may be warned thereby, and that they may know that He is only One Allah, and that men of understanding may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a message for mankind. Let them take warning from it and know that He is but one God. Let those possessed of understanding may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a preaching for mankind, and that they may be warned thereby, and that they may know that there is only one God, and that the men of understanding may be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a proclamation for mankind, so that they may be warned thereby and know that He is indeed the One God, and those who possess intellect may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here is a Message for mankind: Let them take warning therefrom, and let them know that He is (no other than) One Allah: let men of understanding take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This (Quran) is a Message for mankind (and a clear proof against them), in order that they may be warned thereby, and that they may know that He is the only One Ilah (God - Allah) - (none has the right to be worshipped but Allah), and that men of understanding may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a message to be delivered to mankind so that they may be warned by it, and know that He is (Allah) One God, and so all those possessed of minds may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a proclamation for mankind, that they may be warned thereby, and know that He is One God, and that people of understanding may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This [Qur'an] is notification for the people that they may be warned thereby and that they may know that He is but one God and that those of understanding will be reminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:52] This, Qur’ān, is a Proclamation for mankind, in other words, it was revealed in order to proclaim to them, and so that they may be warned thereby, and that they may know, by way of the arguments contained in it, that He, namely, God, is One God, and that people of pith, possessors of intellect, may remember (yadhdhakkara: the original tā’ [of yatadhakkara] has been assimilated with the dhāl), [that they] may be admonished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالإشارة إلى الكلام السابق في السورة كلها من أيْنَ ابتدأتهُ أصبت مراد الإشارة ، والأحسن أن يكون للسورة كلها .والبلاغ اسم مصدر التبليغ ، أي هذا المقدار من القرآن في هذه السورة تبليغ للناس كلهم .واللام في { للناس } هي المعروفة بلام التبليغ ، وهي التي تدخل على اسم من يَسمع قولاً أو ما في معناه .وعطف { ولينذروا } على { بلاغ } عطف على كلام مقدر يدل عليه لفظ { بلاغ } ، إذ ليس في الجملة التي قبله ما يصلح لأن يعطف هذا عليه فإن وجود لام الجر مع وجود واو العطف مانع من جعله عطفاً على الخبر ، لأن المجرور إذا وقع خبر عن المبتدإ اتصل به مباشرة دون عطف إذ هو بتقدير كائِن أو مستَقر ، وإنما تعطف الأخبار إذا كانت أوصافاً . والتقدير هذا بلاغ للناس ليستيقظوا من غفلتهم ولينذروا به .واللام في { ولينذروا } لام كي . وقد تقدم قريب من نظم هذه الآية في قوله تعالى { وهذا كتاب أنزلناه مبارك مصدق الذي بين يديه ولتنذر أم القرى ومن حولها } في سورة الأنعام ( 92 ).والمعنى وليعلموا مِما ذكر فيه من الأدلة مَا الله إلا إلهٌ واحد ، أي مقصور على الإلهية الموحدة . وهذا قصر موصوف على صفة وهو إضافي ، أي أنه تعالى لا يتجاوز تلك الصفة إلى صفة التعدد بالكثرة أو التثليث ، كقوله : { إنما الله إله واحد سبحانه أن يكون له ولد } \\[ سورة النساء : 171 \\].والتذكر : النظر في أدلة صدق الرسول عليه الصلاة والسلام ووجوب اتباعه ، ولذلك خص بذوي الألباب تنزيلاً لغيرهم منزلة من لا عقول لهم { إن هم إلا كالأنعام بل هم أضل سبيلا } \\[ سورة الفرقان : 44 \\].وقد رتبت صفات الآيات المشار إليها باسم الإشارة على ترتيب عقلي بحسب حصول بعضها عقب بعض ، فابتدىء بالصفة العامة وهي حصول التبليغ . ثم ما يعقب حصول التبليغ من الإنذار ثم ما ينشأ عنه من العلم بالوحدانية لما في خلال هذه السورة من الدلائل . ثم بالتذكير في ما جاء به ذلك البلاغ وهو تفاصيل العلم والعمل . وهذه المراتب هي جامع حكمة مما جاء به الرسول صلى الله عليه وسلم موزعة على من بَلّغ إليهم . ويختص المسلمون بمضمون قوله : { وليذكر أولوا الألباب }.\n\n",
      "translations": [
        {
          "translation": "(This is a clear message for mankind) convey it them on behalf of Allah; it is also said: this is an exposition for them detailing commands and prohibitions, promises and threats, the lawful and the prohibited (in order that they may be warned thereby) that they may be warned by means of the Qur'an, (and that they may know) and acknowledge (that He is only One God) without a son or partner, (and that men of understanding) people endowed with intelligence (may take heed) through the Qur'an'. And of the surah in which al-Hijr is mentioned, which is Meccan in its entirety and which consists of 654 words and 2,770 letters: Surah 15: Al-Hijr And of the surah in which al-Hijr is mentioned, which is Meccan in its entirety and which consists of 654 words and 2,770 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هَـٰذَا } أي: ما ذكر من أوصاف يوم القيامة وأهوالها وأفزاعها { بَلاَغٌ } أي: تذكرة كافية وموعظة وافية { لِّلنَّاسِ } الذين نسوا طريق التوحيد وأعرضوا عنها بعروض الغفلة لهم\n فليتعظوا { وَلِيُنذَرُواْ بِهِ } عن المعاصي والإجرام حتى لا يؤخذوا عليها\n وليجتنبوا عن الشرك ولا يركنوا إليه { وَلِيَعْلَمُوۤاْ } عموم العباد إيماناً وإذعاناً { أَنَّمَا هُوَ إِلَـٰهٌ وَاحِدٌ } يُعبد بالحق ويُرجع إليه إلى أن ينكشفوا بالحقيقة الحقية { وَلِيَذَّكَّرَ } خصوصاً { أُوْلُواْ ٱلأَلْبَابِ } [إبراهيم: 52] الناظرين بنور الله\n الفانين به\n الباقين ببقائه\n\n\nجعلنا الله ممن ذكر له فتذكر\n وتحقق في مقر التوحيد وتقرر\n\n\nخاتمة السورة\n\n\nعليك أيها اللبيب المتذكر لمرتبة الأحدية التي هي ينبوع بحر الوجود أن تتذكر وتتعظ بمواعظ الكتاب الإلهي من مواعيده\n وإنذاراته وحكمه وأسراره\n لتتفطن بتطوراته وتجلياته\n وشئونه في مراتب تنزلاته\n حتى يسهل لك التقيظ من المنامات العارضة والغفلات الطارئة عليك من الإضافات الحاصلة بين الشئون والتجليات المبعدة عن صرافة الوحدة الذاتية\n ويتيسر لك الوصول إلى منع جميع الأسماء والصفات\n المستتبعة لأنواع الكثرات\n ومرجع جميع الكائنات والفاسدات المترتبة عليها\n\nفاعلم أيها الطالب القاصد لسلوك طريق الهداية الموصلة إلى صفاء التوحيد الذاتي أن التوجه إليها والوقوف على أماراتها لا يتيسر إلا بعد تنبيه منبه نبيه\n وإرشاد مرشد كامل خبير بصير\n\n\nلذلك جرت عادة الله\n واستمرت سنته السنية على إرسال الرسل والأنبياء المؤدين بالكتب والصحف\n لتمكن لهم إرشاد الناقصين المنحطين عن درجة التدبر والتدرب في غوامض طرق العرفان ومغالق مسالك التوحيد\n ومع ذلك لا يتيسر لهم إلا البلاغ من التبليغ والتوفيق\n إنما هو من عند العزيز العليم\n\n\nوأكمل الرسل نبينا صلى الله الله عليه وسلم\n وأفضلْ الكتب القرآن الجامع المنزل عليه\n الناسخ لجميع ما نزل قبله من الكتب\n لذلك قال سبحانه على سبيل العموم: { هَـٰذَا } [إبراهيم: 52] أي: القرآن { بَلاَغٌ لِّلنَّاسِ } [إبراهيم: 52] أي: كامل من التبليغ والإرشاد لقاطبة الأنام إلى توحيد الملك العلام\n فلك أن تتأمل يه وتتذكر به على الوجه المأمور\n لتتمكن من قعد الصدق عند الملك الغفور",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { هذا } القرآن\n أو ما فيه من الوعظ والتذكير\n أو ما وصفه من قوله\n[إبراهيم: 42] إلخ\n { بلاغ للناس } أي: كفاية لهم عن غيره في الوعظ وبيان الأحكام\n يقال: أعطيته من المال ما فيه بلاغ له\n أي: كفاية\n أو بلاغ أي: تبليغ لهم\n كقوله:\n[الشورى: 48]\n[النور: 54]\nوقوله: { وليُنذروا به }: عطف على محذوف\n أي: ليُنصحوا به\n ولينذروا به\n أو متعلق بمحذوف\n أي: ولينذروا به أنزلناه\n { وليعلموا أنما هو إله واحد } بالنظر والتأمل فيما فيه من الآيات الدالة على وحدانيته تعالى\n أو المنبهة على ما يدل عليه\n { وليذَّكَّر } أي: ليتعظ به { أولو الألباب } أي: القلوب الصافية بالتدبر في أسرار معانيه وعجائب علومه وحكمه\n فيرتدعوا عما يُرديهم\n ويتذرعوا بما يحظيهم\n واعلم أنه سبحانه ذكر لهذا البلاغ ثلاث فوائد هي الغاية والحكمة في إنزال الكتاب: تكميل الرسل للناس\n واستكمالهم القوة النظرية التي منتهى كمالها التوحيد\n وإصلاح القوة العملية التي هي التدرع بكمال التقوى\n جعلنا الله من الفائزين بغايتها\n قال معناه البيضاوي\n الإشارة: قد مكر أهلُ الغفلة بالأولياء\n قديماً وحديثاً\n واحتالوا على إطفاء نورهم\n فأبى الله إلا نصرهم وعزهم { إن الله عزيز ذو انتقام } فينتقم لهم وينصرهم\n ووقت نصرهم هو حين يتحقق فناؤهم عن الرسوم والأشكال\n فتبدل الأرض عندهم غير الأرض والسماوات فتنقلب كلها نوراً مجموعاً ببحر الأنوار\n وبمحيطات أفلاك الأسرار\n فتذهب ظلمة الأكوان بتجلي نور المكون\n[النور: 35]\n وبرزوا من سجن الأكوان لشهود الواحد القهار\n وقال الورتجبي: يريد أن أرض الظاهر وسماء الظاهر\n تبدل من هذه الأوصاف\n وظلمة الخلقية\n إلا أنها منورة بنور جلال الحق عليها\n وأنها صارت مَشْرق عيان الحق للخلق حين بدا سطوات عزته\n بوصف الجبارية والقهارية بقوله\n\n[الزمر: 69] وهناك يا أخي يدخل الوجود تحت أذيال العدم من استيلاء قهر أنوار القدم\n قال:\n[القصص: 88]\n وقيل: فأين الأشياء إذ ذاك؟ قال: عادت إلى مصادرها\n وقال: متى كانوا شيئاً حتى صاروا لا شيء؟! لأنهم أقل من البهاء في الهواء في جنب الحق\n هـ\n وترى المجرمين\n وهم الغافلون\n مقرنين في قيود الأوهام\n والشكوك\n مسجونين في محيطات الأكوان\n سرابيلهم ظلمة الغفلة\n تغشى وجوههم نارُ القطيعة\n لا تظهر عليها بهجة المحبين\n ولا أسرار العارفين\n فعل ذلك بهم ليظهر فضيلة المجتهدين\n هذا بلاغ للناس\n وليُنذروا به وبال الغفلة والحجاب\n وليتحقق أولو الألباب أن الوجود إنما هو للواحد القهار\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:54",
      "similarity": 0.7411304098111556
    },
    {
      "verse": "2:269",
      "similarity": 0.6664351261572823
    },
    {
      "verse": "39:18",
      "similarity": 0.6575393682169516
    },
    {
      "verse": "13:19",
      "similarity": 0.6071193691038403
    },
    {
      "verse": "65:10",
      "similarity": 0.6015388385207459
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/014052.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/014052.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/14:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}