{
  "chapter": "ابراهيم",
  "text": "ولقد ارسلنا موسى بـايتنا ان اخرج قومك من الظلمت الى النور وذكرهم بايىم الله ان فى ذلك لءايت لكل صبار شكور",
  "translations": [
    {
      "translation": "We sent Musa with Our Signs: 'Bring your people from the darkness to the light, and remind them of the Days of Allah.' There are certainly Signs in that for everyone who is steadfast, thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when We sent Moses with Our signs (We said): \"Bring your people out of darkness into light, and remind them of the visitations of God. Indeed there are signs in this for every steadfast, thankful soul\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We indeed sent Moses with Our Signs, saying: \"Lead your people out of all kinds of darkness into light, and admonish them by narrating to them anecdotes from the Days of Allah.\" Verily in it there are great Signs for everyone who is patient and gives thanks (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses and gave him miracles in order to lead his people from darkness into light and to remind them of the days of God. In this there is evidence (of the truth) for those who exercise patience and give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Moosa along with Our signs that, “Bring your people from the realms of darkness into light – and remind them of the days of Allah*; indeed in them are signs for every greatly enduring, grateful person.” (* When various favours were bestowed – in order to give thanks and be patient.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Musa with Our Ayat (saying): \"Bring out your people from darkness into light, and remind them of the annals (or days) of Allah. Truly, therein are Ayat for every patient, thankful (person).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent Musa with Our communications, saying: Bring forth your people from utter darkness into light and remind them of the days of Allah; most surely there are signs in this for every patient, grateful one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Moses with Our signs -- 'Bring forth thy people from the shadows to the light and remind thou them of the Days of God.' Surely in that are signs for every man enduring, thankful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We verily sent Moses with Our revelations, saying: Bring thy people forth from darkness unto light. And remind them of the days of Allah. Lo! therein are revelations for each steadfast, thankful (heart).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our signs, saying, \"Lead your people out of the darkness into the light, and remind them of God's Days. In that there are signs for every patient, grateful person.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We sent Musa with our signs saying: bring thy people forth from the darknesses unto the light, and remind them of the annals of Allah. Verily therein are signs for everyone patient, and thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Moses with Our signs: ‘Bring your people out from darkness into light and remind them of Allah’s [holy] days. There are indeed signs in that for every patient and grateful [servant].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our signs (and the command). \"Bring out thy people from the depths of darkness into light, and teach them to remember the Days of Allah.\" Verily in this there are Signs for such as are firmly patient and constant,- grateful and appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Musa (Moses) with Our Ayat (signs, proofs, and evidences) (saying): \"Bring out your people from darkness into light, and make them remember the annals of Allah. Truly, therein are evidences, proofs and signs for every patient, thankful (person).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our signs, 'Bring your nation out of darkness into the light, and remind them of the Days of Allah' Surely, in that are signs for every patient, thankful (person).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Moses with Our signs: “Bring your people out of darkness into light, and remind them of the Days of God.” In that are signs for every patient and thankful person.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly sent Moses with Our signs, [saying], \"Bring out your people from darknesses into the light and remind them of the days of Allah.\" Indeed in that are signs for everyone patient and grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:5] And verily We sent Moses with Our signs, the nine [signs], and We said to him: ‘Bring forth your people, the Children of Israel, out of darkness, [out of] unbelief, into light, [into] faith, and remind them of the Days of God’, of His graces. Surely in that, reminder, are signs for every man enduring, in obedience [to God], thankful, for [His] graces.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We verily sent Moses with Our revelations) the nine signs: the hand, the staff, the flood, the locusts, the lice, the frogs, blood and the drought and shortage of foodstuff, (saying: Bring your people forth) invite your people (from darkness unto light) to embrace faith and leave disbelief. (And remind them of the days of Allah) of the days when Allah sent His chastisement; it is also said that this means: remind them of the days of Allah's mercy. (Lo! Therein) in what I have mentioned (are revelations) signs (for each steadfast) in obedience, (thankful (heart)) for the blessings bestowed upon him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أَبو جعفر قالَ: حدَّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السَّلامُ في قولِه تعالى: { وَذَكِّرْهُمْ بِأَيَّامِ ٱللَّهِ } معناهُ بِنِعَمِ الله\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us that Ali ibn Ahmad told him\n\n\nHe said: We were told by `Ata' ibn al-Sa'ib from Abu Khalid from Zayd ibn `Ali, peace be upon them, regarding the saying of Allah, {And remind them of the days of Allah}, that it means the goodness of Allah.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم ذكر سبحانه قصة إرسال موسى إلى قومه حيث فشا الجدال والمراء بينهم وانحرفوا عن طريق الحق؛ ليتعط به المؤمنون ويعتبروا، فقال: { وَلَقَدْ أَرْسَلْنَا } من مقام فضلنا وجودنا { مُوسَىٰ } المؤيد { بِآيَاتِنَآ } الباهرة مثل: العصا واليد البيضاء وسائر المعجزات الظاهرة على يده، وقلنا له { أَنْ أَخْرِجْ قَوْمَكَ } الضالين عن سواء السبيل بمتابعة الأهوية الفاسدة { مِنَ } أنواع { ٱلظُّلُمَاتِ } الطارئة عليهم من الكفر والفسوق والعصيان والتقليدات والتخمينات الناشئة من الأوهام والخيالات، المنبعثة عن الكثرة المستدعية للأنانية التي هي الظلمة الحقيقية { إِلَى ٱلنُّورِ } الحقيقي الذي هو صرافة التوحيد والوحدة الذاتية المسقطة لجميع الإضافات والكثرات { وَذَكِّرْهُمْ } أيضاً { بِأَيَّامِ ٱللَّهِ } التي مضت على الأمم الهالكة من أمثال هذه الأفعال المورثة لأنواع الظلمات؛ لعلهم يعتبروا عن سماعها وينصرفوا عما هم عليه من القبائح والذمائم { إِنَّ فِي ذٰلِكَ } أي: في ذكر تلك الوقائع الهائلة والبليات العظيمة { لآيَاتٍ } أي: دلائل واحضات وعبر { لِّكُلِّ } مؤمن معتبر من أمثاله خائف من بطش الله { صَبَّارٍ } على ما جرى عليه من قضائه { شَكُورٍ } [إبراهيم: 5] مبالغ في الشكر على ما وصل إليه من آلائه ونعمائه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أنْ أخرج: إما تفسيرية لا محل لها، أي: وقلنا: أن أخرج لأن في الإرسال معنى القول، أو على إسقاط الخافض، أي: بأن أخرج، فإنَّ صيغ الأفعال سواء في الدلالة على المصدر، فيصح أن توصل بها \" إن \" الناصبة\n يقول الحق جل جلاله: { ولقد ارسلنا موسى بأياتنا } كاليد والعصا، وسائر معجزاته التسع، وقلنا له: { أن أخرج قومَك } بني إسرائيل، وفرعون وملأه { من الظلمات إلى النور } من ظلمات الكفر إلى نور الإيمان، أما فرعون وملؤه فظاهر، وأما بنو أسرائيل فقد كان فرعون فَتَنَ جُلّهم، وأضلهم مع القبط، فكانوا أشياعاً متفرقين، لم يبق لهم دين\n فإن قلتَ: إذا كان موسى عليه السلام مبعوثاً إلى القبط، فِلمَ لَمْ يرجع إليهم بعد خروجه عنهم إلى الشام؟ فالجواب: أنه لما بلَّغهم الرسالة قامت الحجة عليهم، فيجب عليهم أن يهاجروا إليه للدين\n ثم أمره بالتذكير فقال: { وذكِّرْهُم بأيامِ الله }: بوقائعه التي وقعت على الأمم الدارجة قبلهم، وأيام العرب: حروبها\n أو ذكِّرهم بِنَعم الله وآلائه، وبنقمه وبلائه فالأيام تطلق على المعنيّين\n { إنَّ في ذلك لآياتٍ لكل صبارٍ } في بلائه، { شكور } لنعمائه، وإنما خصه لأنه إذا سمع ما نزل على من قبله من البلاء، وأُفِيض عليهم من النعماء، اعتبر وتنبه لما يجب عليه من الصبر والشكر\n وقيل: المراد لكل مؤمن، وإنما عبَّر بذلك تنبيهاً على أن الصبر والشكر عنوان الإيمان\n قاله البيضاوي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:152",
      "similarity": 0.3959216012137481
    },
    {
      "verse": "49:5",
      "similarity": 0.34658203988765973
    },
    {
      "verse": "31:31",
      "similarity": 0.34516852224894606
    },
    {
      "verse": "5:37",
      "similarity": 0.32971654120341387
    },
    {
      "verse": "33:43",
      "similarity": 0.3267993082007472
    }
  ]
}