{
  "chapter": "ابراهيم",
  "text": "واذ قال موسى لقومه اذكروا۟ نعمة الله عليكم اذ انجىكم من ءال فرعون يسومونكم سوء العذاب ويذبحون ابناءكم ويستحيون نساءكم وفى ذلكم بلاء من ربكم عظيم",
  "translations": [
    {
      "translation": "Remember when Musa said to his people, 'Remember Allah's blessing to you when He rescued you from the people of Pharaoh. They were inflicting an evil punishment on you, slaughtering your sons and letting your women live. In that there was a terrible trial from your Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Moses said to his people: \"Remember the favours of God when He saved you from the people of Pharaoh who afflicted you with oppression, slaying your sons but keeping alive your women, which was a great trial from your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind when Moses said to his people: \"Remember Allah's favour upon you when He delivered you from Pharaoh's people who afflicted you with a grievous chastisement, slaughtering your sons, while letting your women live. In it there was a terrible trial from your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses told his people, \"Remember the favors that God granted you when He saved you from the people of the Pharaoh who had punished you in the worst manner by murdering your sons and keeping your women alive. It was a great trial for you from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moosa said to his people, “Remember Allah’s favour upon you when He rescued you from the people of Firaun who were inflicting you with a dreadful torment, and were slaying your sons and sparing your daughters; and in it occurred a great favour of your Lord.”* (* On the 10th day of Moharram – therefore the Jews used to fast on that day as thanksgiving.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa said to his people: \"Call to mind Allah's favor to you, when He delivered you from Fir`awn's people who were afflicting you with horrible torment, and were slaughtering your sons and letting your women live; and in it was a tremendous trial from your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa said to his people: Call to mind Allah's favor to you when He delivered you from Firon's people, who subjected you to severe torment, and slew your sons and spared your women; and in this there was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses said to his people, 'Remember God's blessing upon you when He delivered you from the folk of Pharaoh, who were visiting you with evil chastisement, slaughtering your sons, and sparing your women -- and in that was a grievous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remind them) how Moses said unto his people: Remember Allah's favour unto you when He delivered you from Pharaoh's folk who were afflicting you with dreadful torment, and were slaying your sons and sparing your women; that was a tremendous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to his people, \"Remember God's goodness to you when He delivered you from Pharaoh's people who were treating you cruelly, putting your sons to death and sparing only your daughters. Surely that was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Musa said unto his people: remember the favour of Allah upon you when He delivered you from the house of Fir'awn who were imposing upon you evil torment, slaughtering your sons and letting your women live, and therein was from your Lord a trial terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his people, ‘Remember Allah’s blessing upon you when He delivered you from Pharaoh’s clan who inflicted a terrible torment on you, and slaughtered your sons and spared your women, and in that there was a great test from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember! Moses said to his people: \"Call to mind the favour of Allah to you when He delivered you from the people of Pharaoh: they set you hard tasks and punishments, slaughtered your sons, and let your women-folk live: therein was a tremendous trial from your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa (Moses) said to his people: \"Call to mind Allah's Favour to you, when He delivered you from Fir'aun's (Pharaoh) people who were afflicting you with horrible torment, and were slaughtering your sons and letting your women alive, and in it was a tremendous trial from your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to his nation: 'Remember the blessing of Allah to you when He saved you from Pharaoh's family, who had oppressed you cruelly, and who slew your sons and spared your women. Surely, that was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to his people, “Remember God’s blessings upon you, as He delivered you from the people of Pharaoh, who inflicted on you terrible suffering, slaughtering your sons while sparing your daughters. In that was a serious trial from your Lord.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall, O Children of Israel], when Moses said to His people, \"Remember the favor of Allah upon you when He saved you from the people of Pharaoh, who were afflicting you with the worst torment and were slaughtering your [newborn] sons and keeping your females alive. And in that was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:6] And, mention, when Moses said to his people, ‘Remember God’s grace to you when He delivered you from the folk of Pharaoh, who were inflicting upon you a dreadful chastisement, and were slaughtering your sons, the new-born, and sparing, keeping alive, your women — this was because some of the priests [of Egypt] had stated that a child born among the Israelites shall be the cause of the destruction of Pharaoh’s kingdom; and in that, deliverance — or [in that] chastisement — was a tremendous trial, grace — or [a tremendous] test — from your Lord.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remind them) how Moses said unto his people) the Children of Israel: (Remember Allah's favour unto you when He delivered you from Pharaoh's folk) from Pharaoh and his folk, the Copts, (who were afflicting you with dreadful torment, and were slaying your sons) at a young age (and sparing) and using (your women) when they are mature; (that was a tremendous trial from your Lord) that was a tremendous test from your Lord; it is also said that this means: saving you from such a tremendous trial was a great blessing from your Lord.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَسُومُونَكُمْ سُوۤءَ ٱلْعَذَابِ } معناهُ يُولونَكُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل { إِذْ قَالَ مُوسَىٰ لِقَوْمِهِ } حين أراد تعديد نعم الله عليهم وإحسانه إليهم؛ ليستحيوا عن مخالفة أمره وترك طاعته وعبادته { ٱذْكُرُواْ } أيها المغمورون بنعم الله { نِعْمَةَ ٱللَّهِ عَلَيْكُمْ } وقوموا لشكرها؛ أداء لحق شيء منها سيما { إِذْ أَنجَاكُمْ مِّنْ آلِ فِرْعَوْنَ } حين { يَسُومُونَكُمْ } ويقصدون لكم { سُوۤءَ ٱلْعَذَابِ } أي: أفضحة وأقبحة { وَ } هو أنه { يُذَبِّحُونَ أَبْنَآءَكُمْ } قمعاً وقلعاً لعرقكم { وَيَسْتَحْيُونَ نِسَآءَكُمْ } توبيخاً وتقريعاً عليكم { وَفِي ذٰلِكُمْ بَلاۤءٌ } نازل { مِّن رَّبَّكُمْ } إذ هو بإقدار الله إياهم { عَظِيمٌ } [إبراهيم: 6] لا بلاء أعظم منه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذ قال موسى لقومه اذكروا نعمةَ الله عليكم إذ أنجاكم }: حين أنجاكم { من آلِ فرعونَ }: رهطه، { يسومونكم }: يُولونكم { سُوء العذابِ }: أقبحه يستعبدونكم ويُكلفونكم مشاق الأعمال، { ويُذبِّحُون أبناءكم ويستحْيون نساءكم } ، قال البيضاوي: المراد بالعذاب هنا غير المراد به في سورتَيْ البقرة والأعراف لأنه هناك مفسر بالتذبيح والقتل، ومعطوف عليه هنا، فهو هنا إما جنس العذاب، أو استعبادهم واستعمالهم بالأعمال الشاقة\n هـ\n { وفي ذلكم } الامتحان { بلاء } أي: ابتلاء { من ربكم عظيم } اختبركم به حتى أنقذكم منه، ليعظم شكركم، أو: في ذلك الإنجاء بلاء، أي: نعمة واختبار عظيم، لينظر كيف تعملون في شكر هذه النعمة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:49",
      "similarity": 0.9633836183811137
    },
    {
      "verse": "7:141",
      "similarity": 0.7263036466751618
    },
    {
      "verse": "28:4",
      "similarity": 0.4720304463449409
    },
    {
      "verse": "27:21",
      "similarity": 0.4697142406622462
    },
    {
      "verse": "37:107",
      "similarity": 0.4593094733011328
    }
  ]
}