{
  "chapter": "ابراهيم",
  "text": "واذ تاذن ربكم لئن شكرتم لازيدنكم ولئن كفرتم ان عذابى لشديد",
  "translations": [
    {
      "translation": "And when your Lord announced: \"If you are grateful, I will certainly give you increase, but if you are ungrateful, My punishment is severe.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, your Lord proclaimed: \"I shall give you more if you are grateful; but if you are thankless then surely My punishment is very great.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also call to mind when your Lord proclaimed: \"If you give thanks, I will certainly grant you more; but if you are ungrateful for My favours, My chastisement is terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when your Lord said to you, 'If you give thanks, I shall give you greater (favors), but if you deny the Truth, know that My retribution is severe \".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when your Lord proclaimed, “If you give thanks, I will give you more, and if you are ungrateful then (know that) My punishment is severe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when your Lord proclaimed: \"If you give thanks, I will give you more; but if you are thankless, verily, My punishment is indeed severe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord made it known: If you are grateful, I would certainly give to you more, and if you are ungrateful, My chastisement is truly severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord proclaimed, \"If you are thankful, surely I will increase you, but if you are thankless My chastisement is surely terrible.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord proclaimed: If ye give thanks, I will give you more; but if ye are thankless, lo! My punishment is dire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember also the time when your Lord declared, 'If you are grateful, I will surely bestow more favours on you; but if you are ungrateful, then know that My punishment is severe indeed.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what time your Lord proclaimed: if ye give thanks, surely I will increase you, and if ye disbelieve, verily My torment severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord proclaimed, “If you are grateful, I will surely enhance you [in blessing], but if you are ungrateful, My punishment is indeed severe.” ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember! your Lord caused to be declared (publicly): \"If ye are grateful, I will add more (favours) unto you; But if ye show ingratitude, truly My punishment is terrible indeed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when your Lord proclaimed: \"If you give thanks (by accepting Faith and worshipping none but Allah), I will give you more (of My Blessings), but if you are thankless (i.e. disbelievers), verily! My Punishment is indeed severe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord proclaimed: \"If you give thanks, I will increase you, but, if you are unthankful My punishment is indeed stern.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord proclaimed: “If you give thanks, I will grant you increase; but if you are ungrateful, My punishment is severe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] when your Lord proclaimed, 'If you are grateful, I will surely increase you [in favor]; but if you deny, indeed, My punishment is severe.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:7] And when your Lord proclaimed, [when] He made it known that: “If you are thankful, for My graces, through affirmation of [My] Oneness and obedience [to Me], then assuredly I shall give you more; but if you are thankless, [if] you deny [the truth of] the grace, through disbelief and disobedience, then assuredly I shall chastise you — as is indicated by [His following words] — My chastisement is indeed severe” ’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when your Lord proclaimed) when your Lord said and informed you in the Scripture: (If ye give thanks) for your success, safety, favour and blessings, (I will give you more) success, safety, favour and blessings; (but if ye are thankless) if you do not believe me or are ungrateful for the blessings bestowed upon you, (lo! my punishment is dire) for the one who disbelieves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذْ تَأَذَّنَ رَبُّكُمْ } معناهُ أعْلمكُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالإنجاء عن أمثال هذا البلاء من أعظم النعماء، فعليكم أن تواظبوا لشكره { وَ } اذكروا أيضاً { إِذْ تَأَذَّنَ رَبُّكُمْ } أي: أعلمكم إعلاماً بليغاً، وأوصاكم وصية عظيمة تتميماً لتربيتكم { لَئِن شَكَرْتُمْ } على ما أُعطيتم من النعم العظام وقمتم لأداء حقها { لأَزِيدَنَّكُمْ } وأضاعفنكم بأمثالها وأضعافها { وَلَئِن كَفَرْتُمْ } في مقابلة الإحسان والعطاء، فلا يلحق على أثر كفرانكم، بل { إِنَّ عَذَابِي } ونكالي على من صرف عن أمري وخرج عن إطاعتي وانقيادي { لَشَدِيدٌ } [إبراهيم: 7] مبرم محكم لا يندفع أصلاً، فعليكم أن تلازموا الشكر وتجانبوا عن الكفران\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولذلك قال لهم موسى عليه السلام: { وإذْ تأذَّنَ ربكُمْ } أي: آذن، بمعنى أعلمَ، كتوعَّد وأوعد، غير أنَّ تأذن أبلغ من آذن لما في تفعّل من التكلف والمبالغة، أي أعلمكم، وقال: والله { لئن شكرتم } يا بني إسرائيل ما أنعمتُ به عليكم من الإنجاء وغيره، بالإيمان والعمل الصالح، وبالإقرار باللسان، وإفراد النعمة للمنعم بالجَنَان، { لأَزيدَنَّكُمْ } نعمة على نعمة\n وهذ الخطاب، وإن كان لبني إسرائيل، يعم جميع الخلق، والزيادة إما من خير الدنيا، أو ثواب الآخرة\n وشكر الخواص يكون على السراء والضراء فتكون الزيادة في الضراء، إما في ثواب أو في التقريب\n\n\nثم ذكر ضده فقال: { ولئن كفرتم } ما أنعمتُ به عليكم، وقابلتموه بالكفر والعصيان، { أنَّ عذابي لشديد } فأعذبكم به على كفركم\n قال البيضاوي: ومن عادة أكرم الأكرمين أن يصرح بالوعد ويُعرض بالوعيد\n هـ\n فصرح بوصول الزيادة إليهم، ولم يقل: أعذبكم عذاباً شديداً، بل عظم عذابه في الجملة",
      "translations": []
    }
  ]
}