{
  "chapter": "ابراهيم",
  "text": "وقال موسى ان تكفروا۟ انتم ومن فى الارض جميعا فان الله لغنى حميد",
  "translations": [
    {
      "translation": "Musa said, 'If you were to be ungrateful, you and everyone on the earth, Allah is Rich Beyond Need, Praiseworthy.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said: \"What if you and all the people of the world deny, God is unconcerned and worthy of praise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"Were you to disbelieve - you and all those who live on earth - Allah is still Self-Sufficient, Innately Praiseworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses told his people, \"If you and everyone on the earth turn to disbelief, know that God is Self-sufficient and Praiseworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moosa said, “If you and all who are in the earth turn disbelievers, then indeed Allah is definitely Independent (Unwanting), Most Praiseworthy.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: \"If you disbelieve, you and all on earth together, then verily, Allah is Rich (free of all needs), Worthy of all praise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: If you are ungrateful, you and those on earth all together, most surely Allah is Self-sufficient, Praised;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said, 'If you are thankless, you and whoso is on earth, all together, yet assuredly God is All-sufficient, All-laudable.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said: Though ye and all who are in the earth prove thankless, lo! Allah verily is Absolute, Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"Even if you should deny the truth, and all who dwell on earth together, God is self-sufficient, praiseworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa said: if ye disbelive, -- ye and all those who are on the earth-then verily Allah is self-sufficient, Praiseworthy. disquieting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said, ‘Should you be faithless,—you and everyone on the earth, all together—indeed Allah is all-sufficient, all-laudable.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said: \"If ye show ingratitude, ye and all on earth together, yet is Allah free of all wants, worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa (Moses) said: \"If you disbelieve, you and all on earth together, then verily! Allah is Rich (Free of all wants), Owner of all Praise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said: 'If you and all mankind are thankless, He is surely Rich, Praised'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said, “Even if you are ungrateful, together with everyone on earth—God is in no need, Worthy of Praise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses said, \"If you should disbelieve, you and whoever is on the earth entirely - indeed, Allah is Free of need and Praiseworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:8] And Moses said, to his people: ‘If you are thankless, you and all who are on earth, lo! assuredly God is Independent, [without need] of His creatures, Praised’, praiseworthy in what He does with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Moses said: Though you and all who are in the earth prove thankless) disbelieve, (lo! Allah verily is Absolute) He is free of need for your faith, (Owner of Praise) in the sight of he who professes His divine Oneness. 265\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما فرغ عن التعديد والتذكير { قَالَ } لهم { مُوسَىۤ } قولاً ناشئاً عن محض الحكمة والرزانة على مقتضى نور النبوة والولاية: { إِن تَكْفُرُوۤاْ } أيها الغافلون عن كمال استغناء الله وعلو شأنه وسمو سلطانه { أَنتُمْ } بأجمعكم، بل { وَمَن فِي ٱلأَرْضِ جَمِيعاً } لا يزن في جنب استغنائه سبحانه مقدار جناح بعوضة { فَإِنَّ ٱللَّهَ } المتردي برداء العظمة والكبرياء { لَغَنِيٌّ } في ذاته عما سواه من أظلاله مطلقاً { حَمِيدٌ } [إبراهيم: 8] بمقتضيات أوصافه وأسمائه وأسمائه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقال موسى } ، في شأن من لم يشكر: { إن تكفروا أنتم ومن في الأرض جميعاً } من الثقلين، { فإنَّ الله لغنيٌّ } عن شكركم، { حميد }: محمود على ألسنة خلقه، من الملائكة وغيرهم\n فكل ذرة من المخلوقات ناطقة بحمده حالاً أو مقالاً، فهو غني أيضاً عن حمدكم، فما ضررتم بالكفر إلا أنفسكم حيث حرمتموها مزيد الإنعام، وعرضتموها لشديد الانتقال\n وبالله التوفيق\n الإشارة: ذكر الحق تعالى في هذه الآية مقامين من مقامات اليقين: الصبر والشكر، ومدح من تخلق بهما واستعملهما في محلهما، فيركب أيهما توجه إليه منهما، ويسير بهما إلى ربه\n فالصبر عنوان الظفر، وأجره لا ينحصر، والشكر ضامن للزيادة، قال بعض العارفين: لم يضمن الحق تعالى الزيادة في مقام من المقامات إلا الشكر، فدل أنه أفضل المقامات وأحسن الطاعات، من حيث إنه متضمن للفرح بالله، وموجب لمحبة الله\n ولا شك أن مقام الشكر أعلى من مقام الصبر لأن الشاكر يرى المنن في طي المحن، فيتلقى المهالك بوجه ضاحك لأنه لا يكون شاكراً حقيقة حتى يشكر في السراء والضراء، ولا يشكر في الضراء حتى يراها سراء، باعتبار ما يُواجَه به في حال الضراء من الفتوحات القلبية، والمواهب اللدنية، فتنقلب النقمة نعمة\n بخلاف مقام الصبر، صاحبه يتجرع مرارة الصبر لأنه لم يترق إلى شهود المبلى في حال بلائه، ولو ترقى إلى شهوده لَلَذَّتْ لديه البلايا، كما قال صاحب العينية:\n\nلكن هذه الأحوال تختلف على العبد باعتبار القوة والضعف فتارة تجده قوياً يتلقى المهالك بوجه ضاحك، وتارة تصادفه الأقدار ضعيفاً فلا يبقى معه إلا الصبر وتجرع مرارة البلاء، والعياذ بالله\n قال الشيخ أبو الحسن الشاذلي رضي الله عنه في كتاب القصد: \" رأيت كأني مع النبيين والصديقين، فأردت الكون معهم، ثم قلت: اللهم اسلك بي سبيلهم مع العافية مما ابتليتهم، فإنهم أقوى ونحن أضعف منهم، فقيل لي: قل: وما قدّرت من شيء فأيَّدْنا كما أيدتهم\n ثمَّ ذكرهم عن سلف قبلهم\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:64",
      "similarity": 0.7478109996789623
    },
    {
      "verse": "31:26",
      "similarity": 0.7478109996789623
    },
    {
      "verse": "64:6",
      "similarity": 0.5788602394112764
    },
    {
      "verse": "45:36",
      "similarity": 0.49330036065734983
    },
    {
      "verse": "37:182",
      "similarity": 0.4557346305273405
    }
  ]
}