{
  "chapter": "ابراهيم",
  "text": "الم ياتكم نبؤا۟ الذين من قبلكم قوم نوح وعاد وثمود والذين منۢ بعدهم لا يعلمهم الا الله جاءتهم رسلهم بالبينت فردوا۟ ايديهم فى افوههم وقالوا۟ انا كفرنا بما ارسلتم به وانا لفى شك مما تدعوننا اليه مريب",
  "translations": [
    {
      "translation": "Has news not reached you of those who came before you, the peoples of Nuh and 'Ad and Thamud, and those who came after them who are known to no one but Allah? Their Messengers came to them with Clear Signs, but they put their hands to their mouths, saying, 'We reject what you have been sent with. We have grave doubts about what you are calling us to.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the news of those before you, the people of Noah and 'Ad and Thamud, and those who came after them, come to you? None knows (about) them except God. Their apostles came to them with clear proofs, but they tried to silence them and said: \"We do not believe in what you have been sent with, and we are in doubt of what you call us to, about which we are in disquiet.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have the accounts of your predecessors not reached you: the people of Noah, the Ad, the Thamud, and those who came after them - they whose number is not known to any except Allah? Their Messengers came to them with Clear Signs, but they thrust their hands in their mouths, and said: \"We do surely reject the Message you have brought, and we are in disquieting doubt about what you are summoning us to.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you (believers) ever heard the news about those who lived before you, like the people of Noah, Ad, Thamud, and those who lived after them? No one knows about them except God. Messengers were sent to them with miracles, but they put their hands to their mouths and said, \"We do not believe in whatever you preach and we are also doubtful and uncertain about that to which you invite us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did not the tidings of those before you reach you? The people of Nooh, and the A’ad and the Thamud, and those after them? Only Allah knows them; their Noble Messengers came to them with clear proofs, they therefore raised their hands towards their own mouths, and said, “We disbelieve in what you have been sent with, and we are in a deeply intriguing doubt regarding the path you call us to.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the news reached you, of those before you, the people of Nuh, `Ad, and Thamud And those after them None knows them but Allah. To them came their Messengers with clear proofs, but they put their hands in their mouths and said: \"Verily, we disbelieve in that with which you have been sent, and we are really in grave doubt as to that to which you invite us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the account reached you of those before you, of the people of Nuh and Ad and Samood, and those after them? None knows them but Allah. Their apostles come to them with clear arguments, but they thrust their hands into their mouths and said: Surely we deny that with which you are sent, and most surely we are in serious doubt as to that to which you invite us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not come to you the tidings of those who were before you -- the people of Noah, Ad, Thamood, and of those after them whom none knows but God? Their Messengers came to them with the clear signs; but they thrust their hands into their mouths, saying, 'We certainly disbelieve in the Message you have been sent with, and we are in doubt, concerning that you call us unto, disquieting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath not the history of those before you reached you: the folk of Noah, and (the tribes of) A'ad and Thamud, and those after them? None save Allah knoweth them. Their messengers came unto them with clear proofs, but they thrust their hands into their mouths, and said: Lo! we disbelieve in that wherewith ye have been sent, and lo! we are in grave doubt concerning that to which ye call us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not news come to you concerning those who preceded you, such as Noah's people, and the 'Ad and Thamud, as well as those who came after them? Only God knows who they were. The messengers came to them with clear signs, but they put their hands to their mouths saying, \"We deny the message you have been sent with. We have grave doubts about what you are inviting us to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath not the tidings come to you of those before you: the people of Nuh and the 'Aad and the Thamud and those after them! None knoweth them save Allah. There came unto them their apostles with the evidences, but they put their hands to their mouths, and said: verily we disbelieve in that where- with ye have been sent, and verily regarding that to which ye call Us We are in doubt disquieting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not come to you the account of those who were before you—the people of Noah, ‘Ad and Thamud, and those who were after them, whom no one knows [well] except Allah? Their apostles brought them manifest proofs, but they did not respond to them, and said, ‘We disbelieve in what you have been sent with. Indeed we have grave doubts concerning that to which you invite us.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the story reached you, (O people!), of those who (went) before you? - of the people of Noah, and 'Ad, and Thamud? - And of those who (came) after them? None knows them but Allah. To them came messengers with Clear (Signs); but they put their hands up to their mouths, and said: \"We do deny (the mission) on which ye have been sent, and we are really in suspicious (disquieting) doubt as to that to which ye invite us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the news reached you, of those before you, the people of Nuh (Noah), and 'Ad, and Thamud? And those after them? None knows them but Allah. To them came their Messengers with clear proofs, but they put their hands in their mouths (biting them from anger) and said: \"Verily, we disbelieve in that with which you have been sent, and we are really in grave doubt as to that to which you invite us (i.e. Islamic Monotheism).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not heard what befell the nations that have gone before you? The nations of Noah, Aad, and Thamood, and those who came after? None knows them but Allah. Their Messengers came to them with clear signs, but they thrust their hands into their mouths and said: 'Without doubt we disbelieve the Message you have been sent with. That which you call us to is disquieting'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the story reached you, of those before you, the people of Noah, and Aad, and Thamood—and those after them? None knows them except God. Their messengers came to them with the clear proofs, but they tried to silence them, and said, “We reject what you are sent with, and we are in serious doubt regarding what you are calling us to.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not reached you the news of those before you - the people of Noah and 'Aad and Thamud and those after them? No one knows them but Allah. Their messengers brought them clear proofs, but they returned their hands to their mouths and said, \"Indeed, we disbelieve in that with which you have been sent, and indeed we are, about that to which you invite us, in disquieting doubt.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[14:9] Has there not come to you (an interrogative meant as an affirmative) the tidings, the news, of those who were before you — the people of Noah, and ‘Ād — the people of Hūd — and Thamūd — the people of Sālih — and those after them? None knows them save God. [This is] on account of their multitude. Their messengers brought them clear signs, with lucid arguments demonstrating their truthfulness; but they, that is, the communities, thrust their hands into their mouths, to bite on them, out of extreme spite, and said, ‘Lo! we disbelieve in that wherewith you have been sent, according to what you claim, and lo! we are in grave doubt concerning that to which you call us’, [doubt] creating [great] uncertainty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Has not the history) the news (of those before you reached you) people of Mecca: (the folk of Noah, and (the tribes of) 'Aad and Thamud) i.e. the people of Salih, (and those after them) after the folk of Salih, i.e. the people of Shu'ayb and others: how Allah destroyed them when they disbelieved in Him? (None save Allah knoweth them) none knows their numbers or their punishment save Allah. (Their messengers came unto them with clear proofs) they came to them with commands, prohibitions and signs, (but they thrust their hands into their mouths) He says: they rejected what the messengers brought to them; it is also said that this means: they thrust their hands into their mouths, as if saying: be quiet or we will silence you, (and said) to the messengers: (Lo! we disbelieve) we reject (in that wherewith ye have been sent) of Scripture and monotheism, (and lo! we are in grave doubt) in manifest doubt (concerning that to which ye call us) of Scripture and monotheism.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَرَدُّوۤاْ أَيْدِيَهُمْ فِيۤ أَفْوَاهِهِمْ } معناه عَضوا عَليها\n ويقال كَفُّوا عَن قَبولِ الإِيمانِ، وَلَمْ يُؤمِنوا بهِ\n ويقال إِذا أَمسَكَ ولَمْ يُجبْ رَدَّ يَدهُ فِي فَمهِ\n ويقالُ: إِنَّ الرَّسُولَ إِذَا أَخْبَرَهُمْ بِرِسَالتِهِ قَالُوا لَهُ اسْكُتْ وأَشاروا بأَصَابِعِهِمْ إِلى أَفْواهِ أَنْفُسِهمْ رَدعاً لَهُ وَتَكْذِيباً\n ويقالُ كانوا يَرُدُونَ القَولَ بِأَيْدِيهِمْ إِلى أَفواهِ الرُّسلِ\n ويقال: ردُّوا بهِ لو قَبلوه كَانَتْ نعماً علَيهم، وأَيادِيَ مِن الله فِي أَفواهِهِم، معناه فِي ألسِنتِهِم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And they thrust their hands into their mouths}, means they are pressing them (their hands) against their mouths.\n\n\n{They are said to have rejected faith, and yet they have not truly rejected it.}\n\n\nIt is said that if one withholds what should be given, and does not return it to the mouth, then his hand will be held back in punishment.\n\n\nIt is said that when the Messenger told them about his message, they said to him, \"Be silent and pointed with their fingers to their mouths, turning away from him and denying him.\n\n\nThey used to return the statement with their hands to the mouths of the messengers.\n It is said: \"Return it {the trust} to them if they had been before it {the trust}, and the hands of Allah are in their mouths {i.e. if they are truthful}, meaning in their tongues.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ يَأْتِكُمْ } أيها التائهون في تيه الغفلة والغرور { نَبَأُ ٱلَّذِينَ } مضو { مِن قَبْلِكُمْ } لمثل { قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَٱلَّذِينَ مِن بَعْدِهِمْ } من الأمم الهالكة { لاَ يَعْلَمُهُمْ إِلاَّ ٱللَّهُ } المطلع لجميع ما كان ويكون، لا يعزب عن حيطة حضرة علمه مثقال ذرة في الأرض ولا في السماء حين { جَآءَتْهُمْ رُسُلُهُمْ } المبعوثون إليهم { بِٱلْبَيِّنَـٰتِ } الواضحات، والمعجزات الباهرات المثبتة لرسالاتهم، فدعوهم إلى الإيمان والتوحيد وأمروهم بالمعروفات ونهوهم عن المنكرات { فَرَدُّوۤاْ أَيْدِيَهُمْ فِيۤ أَفْوَٰهِهِمْ } مشيرين إليها من غاية إنكارهم واستهزائهم { وَقَالُوۤاْ إِنَّا كَفَرْنَا } أي: اعترفنا بالكفر بأفواهنا، كأنهم أخبروا عن كفرهم بالجملة الماضية تحقيقاً وتقريراً لما هم عليه من الكفر والطغيان { بِمَآ أُرْسِلْتُمْ بِهِ } من عند ربكم وكيف نؤمن لكم { وَإِنَّا لَفِي شَكٍّ } عظيم { مِّمَّا تَدْعُونَنَآ إِلَيْهِ } من الإله الواحد، الأحد الصمد المتصف بجميع صفات الكمال، الموجد المظهر للكائنات { مُرِيبٍ } [إبراهيم: 9] موقع للريب المؤدي إلى الإنكار؛ إذ المتصف بهذه الصفات لا بدَّ أن يكون أظهر من الشمس، مع أنه أخفى من كل شيء، بل لا وجود له أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: شك: فاعل بالمجرور، وفاطر: نعت له\n  يقول الحق جل جلاله: حاكياً عن نبيه موسى عليه السلام في تذكير قومه، أو من كلامه تذكيراً لهذه الأمة { ألم يأتكم نبأ الذين مِن قبلكم }: ما جرى عليهم حين عصوا أنبياءهم { قوم نوح وعادٍ وثمود والذين من بعدهم } كقوم شعيب، وأمم كثيرة { لا يعلمهم إلا اللهُ } لكثرة عددهم، واندراس آثارهم\n ولذلك قال ابن مسعود: كذب النسَّابُون\n { جاءتهم رسلهم بالبيناتِ } بالمعجزات الواضحات، { فرَدُّوا أيديَهُمْ في أفواههم } ليعضوا عليها غيظاً مما جاءت به الرسل كقوله\n\n{ آل عمران: 119 }\n أو: وضعوها عليها تعجباً منهم، أو: استهزاءً بهم، كمن غلب عليه الضحك\n أو إسكاتاً للأنبياء، وأمراً لهم بإطباق الأفواه، أو: ردوها في أفواه الأنبياء، يمنعونهم من التكلم، أو: ردوا أيديهم، أي: نِعَم الأنبياء عليهم، وهي: مواعظهم والشرائع التي أتوهم بها من عند الله، ردوها في أفواه الأنبياء حيث كذبوها، ولم يعملوا بها، كما تقول لمن لم يمتثل أمرك: ترك كلامي في فمي وذهب\n { وقالوا إنا كفرنا بما أرسلتُمْ به } على زعمكم، { وإنا لفي شكٍّ مما تدعوننا إليه } من التوحيد والإيمان، { مُريب }: مُوقع في الريبة، أو: ذي ريبة، وهو: قلق النفس بحيث لا تطمئن إلى شيء\n فإجابهم الرسل عن دعواهم الشك في الربوبية، { قالت رُسُلُهم أفي الله شكٌّ }: أفي وجوده شك، أو في ألوهيته، أو في وحدانيته شك؟ قال البيضاوي: أُدخلت همزة الإنكار على الظرف لأن الكلام في المشكوك فيه، لا في الشك، أي: إنما ندعوكم إلى الله، وهو لا يحتمل الشك لكثرة الأدلة، وظهور دلالتها عليه\n هـ\n وأشار إلى ذلك بقوله: { فاطر السماواتِ والأرض } أي: خالقهما ومبدعهما على هذا الشكل الغريب، والإتقان العجيب إذ لا يصدر إلا من إله عظيم القدرة، باهر الحكمة، واحد في ملكه\n\n[الأنبياء: 22]، وهو { يدعوكم } إلى الإيمان والتوحيد ببعثه إيانا، والتصديق بنا، { ليغفر لكم من ذُنُوبكم } إن آمنتم، أي: يغفر لكم بعض ذنوبكم، وهو ما تقدم قبل الإسلام، ويبقى ما يُذنب بعده في المشيئة، أو: ما بينكم وبينه دون المظالم\n والجمهور: أنه يغفر للكافر ما سلف مطلقاً، وقيل: \" من \": زائدة، على غير مذهب سيبويه\n قال البيضاوي: وجيء بمن، في خطاب الكفرة، دون المؤمنين في جميع القرآن، تفرقةً بين الخطابين، ولعل المعنى فيه أن المغفرة، حيث جاءت في خطاب الكفار، مرتبة على الإيمان، وحيث جاءت في خطاب المؤمنين مشفوعة بالطاعة، والتجنب عن المعاصي، ونحو ذلك، فيتناول الخروج عن المظالم\n هـ\n { ويُؤخّرَكُم إلى أجلٍ مسمّى }: إلى وقت سماه الله، وجعله آخر أعماركم\n\n\nوقال الزمخشري تبعاً للمعتزلة: يؤخركم إن آمنتم إلى آجالكم، وإن لم تؤمنوا عاجلكم بالهلاك قبل ذلك الوقت، وهذا على قولهم بالأجلين\n وأهل السنة يأبون هذا، فإن الأجل عندهم واحد محتوم، والله تعالى أعلم\n  الإشارة: التفكر والاعتبار أفضل عبادة الأبرار، وفي الحديث:\n\n \" تفكر ساعة أفضل من عبادة سبعين سنة \" \n\nفيتفكر العبد فيما سلف قبله من القرون الماضية والأمم الخالية، كيف رحلوا عن ديارهم المشيدة، وفروشهم الممهدة، واستبدلوها بضيق القبور، وافتراش التراب تحت الجُنوب، وجاءهم الموت وهم غافلون، وتجرعوا كأسها وهم كارهون، فلا ما كانوا أمّلوا أدركوا، ولا إلى ما فاتهم رجعوا قدِموا على ما قدَّموا، وندموا على ما خلفوا، ولم ينفع الندم وقد جف القلم، فيوجب هذا التفكرُ الانحياش إلى الله، والمسارعة إلى طاعة الله، والزهد في هذه الدار الفانية، والتأهب للسفر إلى الدار الباقية فيفوز فوزاً عظيماً\n وفي تكذيب الصادقين تسلية للعارفين، وللمتوجهين من المريدين، إذا قُوبلوا بالإيذاء والتكذيب، وبالله التوفيق\n ثمَّ ذكر ما أصاب به الكفار رسلهم\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:62",
      "similarity": 0.42246635493704376
    },
    {
      "verse": "22:42",
      "similarity": 0.4103808236113464
    },
    {
      "verse": "9:70",
      "similarity": 0.39124440147515693
    },
    {
      "verse": "11:110",
      "similarity": 0.38699997271023545
    },
    {
      "verse": "41:45",
      "similarity": 0.38699997271023545
    }
  ]
}