{
  "chapter": "الحجر",
  "text": "ولقد علمنا المستقدمين منكم ولقد علمنا المستـخرين",
  "translations": [
    {
      "translation": "We know those of you who have gone ahead and those who are still to come.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We surely know those of you who go forward and those of you who lag behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We know those of you who have passed before and those who will come later.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know the people who lived before you and those who will come into existence after you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We know those among you who came forward and indeed We know those among you who remained behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We know the first generations of you who have passed away, and indeed, We know the present generations of you (mankind), and also those who will come afterwards.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We know those of you who have gone before and We certainly know those who shall come later.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know the ones of you who press forward, and We know the laggards;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We know the eager among you and verily We know the laggards.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know those who lived before you and those who will come after you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We know those of you who have gone before and those who will come hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We know the predecessors among you and certainly We know the successors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Us are known those of you who hasten forward, and those who lag behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We know the first generations of you who had passed away, and indeed, We know the present generations of you (mankind), and also those who will come afterwards.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know those of you who press forward, and We know the laggards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We know those of you who go forward, and We know those who lag behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have already known the preceding [generations] among you, and We have already known the later [ones to come].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:24] And verily We know the predecessors among you, that is, those creatures from Adam who have already passed, and verily We know the successors, those who will come afterwards, until the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلما ذكر الإحياء والإماتة وكان الإحياء بكسر الهمزة يذكر بالأحياء بفتحها ، وكانت الإماتة تذكّر بالأموات الماضين تخلص من الاستدلال بالأحياء والإماتة على عظم القدرة إلى الاستدلال بلازم ذلك على عظم علم الله وهو علمه بالأمم البائدة وعلم الأمم الحاضرة؛ فأريد بالمستقدمين الذين تقدموا الأحياء إلى الموت أو إلى الآخرة ، فالتقدم فيه بمعنى المضي؛ وبالمستأخرين الذين تأخروا وهم الباقون بعد انقراض غيرهم إلى أجل يأتي .والسين والتاء في الوصفين للتأكيد مثل استجاب؛ ولكن قولهم استقدم بمعنى تقدم على خلاف القياس لأن فعله رباعي . وقد تقدم عند قوله تعالى { لا يستأخرون ساعة ولا يستقدمون } في سورة الأعراف ( 34 ).وقد تقدم في طالع تفسير هذه السورة الخبر الذي أخرجه الترمذي في جامعه من طريق نوح بن قيس ومن طريق جعفر بن سليمان في سبب نزول هذه الآية . وهو خبر واهٍ لا يلاقي انتظام هذه الآيات ولا يكون إلا من التفاسير الضعيفة .\n\n",
      "translations": [
        {
          "translation": "(And verily We know the eager among you) i.e. those who have died of your fathers and mothers; it is also said that this means: those who come forward to the first line (and verily We know the laggards) those who are still alive among their sons and daughter; it is also said that this means: those who withdraw to the last line.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ عَلِمْنَا ٱلْمُسْتَقْدِمِينَ مِنكُمْ } يعني في الصَّفِ المُتقَدِمِ من المَسجِدِ\n و { ٱلْمُسْتَأْخِرِينَ } في الصَّفِ الآخرِ\n ويقالُ: المستقدمينَ مَن مَاتَ من القرونِ، وفِي الخَيرِ\n ويقال: في صفوفِ القِتالِ والمستَأخرينَ مَنْ بَقي\n ويقالُ أُمةُ محمدٍ صلَّى الله عليهِ وآلهِ وسَلَّمَ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {And We have certainly known the forward among you} [refers to] those in the front rows of the mosque.\n\n\nAnd {the last} in the last row.\n It is said: The deceased are those who have died from the generations, and in Paradise.\n It is said: In the ranks of those who fight and the latecomers, whoever remains\n###\nالجملة العربية: في صفوف القتال والمستأخرين من بقي\n\nThe Arabic sentence: In the ranks of those who fight and the latecomers, whoever remains\n The Muhammadan community is said to be { }.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال علمنا وخبرتنا أنا { لَقَدْ عَلِمْنَا ٱلْمُسْتَقْدِمِينَ } المتقدمين في الوجود { مِنكُمْ } أي: من أسلافكم\n بل من شئونكم ونشأتكم التي في أصلابل آباءكم وأرحام أمهاتكم\n بل استعداداتكم في ذرائر العناصر\n بل حصصكم من الروح الأعظم { وَلَقَدْ عَلِمْنَا ٱلْمُسْتَأْخِرِينَ } [الحجر: 24] المتأخيرين منكم في الوجود على الوجه المذكور\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين } أي: علمنا من تقدم ولادةً\n ومن تأخر\n أو من خرج من أصلاب الرجال ومن لم يخرج بعدُ\n أو من تقدم إلى الإسلام والجهاد وسبق إلى الطاعة\n ومن تأخر\n لا يخفى علينا شيء من أحوالكم\n وهو بيان لكمال علمه بعد الاحتجاج على كمال قدرته\n فإنَّ ما يدل على كمال قدرته دليل على كمال علمه\n وقيل: رغّب رسول الله صلى الله عليه وسلم في الصف الأول\n فازدحموا عليه\n فنزلت\n وقيل: إن امرأة حسناء كانت تصلي خلف رسول الله صلى الله عليه\n فتقدم بعض القوم لئلا ينظر إليها\n وتأخر بعض ليبصرها\n فنزلت\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "82:5",
      "similarity": 0.871744680070864
    },
    {
      "verse": "74:37",
      "similarity": 0.8037004555170666
    },
    {
      "verse": "75:13",
      "similarity": 0.7049024752551772
    },
    {
      "verse": "26:76",
      "similarity": 0.6978385193827287
    },
    {
      "verse": "34:30",
      "similarity": 0.5537722695332938
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/015024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/015024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/15:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}