{
  "chapter": "الحجر",
  "text": "ربما يود الذين كفروا۟ لو كانوا۟ مسلمين",
  "translations": [
    {
      "translation": "The unbelievers would haply like to wish that they had submitted (and become Muslim).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon will the time come when the unbelievers will wish they were Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How strongly the unbelievers will wish that they had been Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers will ardently wish that if only they had been Muslims! (At the time of death / in their graves / on the Day of Resurrection.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How much would those who disbelieved wish that they had been Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Often will those who disbelieve wish that they had been Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perchance the unbelievers will wish that they had surrendered:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that those who disbelieve wish ardently that they were Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A time will surely come when those who are bent on denying the truth will wish that they had surrendered themselves to God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Oft times would those who disbelieve fain that they had been Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Much will the faithless wish that they had been Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Again and again will those who disbelieve, wish that they had bowed (to Allah's will) in Islam.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps (often) will those who disbelieve wish that they were Muslims [those who have submitted themselves to Allah's Will in Islam Islamic Monotheism, this will be on the Day of Resurrection when they will see the disbelievers going to Hell and the Muslims going to Paradise].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It could be that those who disbelieve will wish that they were Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps those who disbelieve would like to become Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps those who disbelieve will wish that they had been Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:2] It may be that (read rubbamā or rubamā) those who disbelieve, on the Day of Resurrection, when they witness their predicament and that of the Muslims, will wish that they had been muslims (rubba here is used to indicate ‘many’, since many of them will wish this; but it is also said to indicate ‘few’, since they will be so stupefied by the terrors that they will not come out of their stupor to wish such a thing, except on a few occasions:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It may be that those who disbelieve) in Muhammad (pbuh) and in the Qur'an (wish ardently that they were Muslims) in this worldly life. He says: there may come a day when the disbeliever would wish that he was a Muslim. This is because when Allah takes out of hell whoever was a sincere believer and enters them into Paradise, the disbeliever wishes at that moment he had been a Muslim in this worldly life.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوحين فاقوا عن سكرتهم أحياناً { رُّبَمَا يَوَدُّ } أي: قلما يحب ويستحسن على وجه التمني { ٱلَّذِينَ كَفَرُواْ } أي: ستروا الحق، ولم يصرفوا عقولهم إلى كشفه { لَوْ كَانُواْ مُسْلِمِينَ } [الحجر: 2] مصرفين عقولهم إلى معرفة الله، ومفوضين أمورهم كلها إليه، ومتوكلين على الله في جميع حالاتهم، لكن من شدة طغيانهم، ونهاية غوايتهم وخسرانهم لم يقبلوا دعوتك، ولم يؤمنوا بك وبكتابه يا أكمل الرسل عناداً واستكباراً؛ حتى ينجومن خذلان الدنيا وخسران الآخرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}