{
  "chapter": "الحجر",
  "text": "وجعلنا لكم فيها معيش ومن لستم له برزقين",
  "translations": [
    {
      "translation": "And We put livelihoods in it both for you and for those you do not provide for.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have provided on it sustenance for you, and for those you cannot provide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have provided sustenance for you on it and also for those of whom you are not the providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to provide you and those for whose sustenance you are not responsible, with the necessities of life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And created livelihoods for you in it, and created those for whom you do not provide the sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in it We have provided means of living, for you and for those whom you provide not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made in it means of subsistence for you and for him for whom you are not the suppliers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there appointed for you livelihood, and for those you provide not for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we have given unto you livelihoods therein, and unto those for whom ye provide not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have provided therein a means of livelihood for you and for all those creatures for whom you do not provide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have appointed thereon for you livelihoods and also for those of whom ye are not the providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and made in it [various] means of livelihood for you and for those whom you do not provide for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have provided therein means of subsistence,- for you and for those for whose sustenance ye are not responsible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have provided therein means of living, for you and for those whom you provide not [moving (living) creatures, cattle, beasts, and other animals].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there appointed for you is a livelihood, and for those you do not provide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in it We created livelihoods for you, and for those for whom you are not the providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made for you therein means of living and [for] those for whom you are not providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:20] And We have made for you therein [means of] livelihood (read ma‘āyish), such as fruits and grains, and, We have made [this] for you, those for whom you do not provide, such as servants, [crawling] creatures and cattle; it is God Who provides for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We have given unto you) We have created for you (livelihoods therein) on the earth: vegetations and fruits and that which you eat, drink and wear, (and unto those for whom ye provide not) and He also provides livelihood for those to whom you do not provide such as birds and wild beasts; it is also said that this refers to children in the wombs of their mothers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلْنَا لَكُمْ فِيهَا مَعَايِشَ وَمَن لَّسْتُمْ لَهُ بِرَازِقِينَ } معناهُ الوَحشُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And We have made for you therein { مَعَايِشَ } and { مَن لَّسْتُمْ لَهُ بِرَازِقِينَ } whom you are not provided for}, His meaning is the wild beasts.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إنما { جَعَلْنَا } وخلقنا كل ذلك؛ أي: العلويات والسلفليات؛ ليحصل { لَكُمْ فِيهَا مَعَايِشَ } تعيشون بها، وتقومون مزاجكم منها؛ لتتمكنوا وتقدروا على سلوك طريق التوحيد والعرفان الذي هو سبب إيجادكم، والباعث على إظهاركم؛ إذ ما خُلقتم وجُبلتم إلاَّ لأجله { وَ } كذا معايش { مَن لَّسْتُمْ لَهُ بِرَازِقِينَ } [الحجر: 20] من أخلاقكم وأولادكم، وإن كنتم تظنون أنكم رازقون لهم ظناً كاذباً، بل رزقكم وزقهم ورزق جميع من في حيطة الوجود علينا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وجعلنا لكم فيها معايش } تعيشون بها من المطاعم والملابس، { و } خلقنا لكم { من لستم له برازقين } من الولدان والخدمة والمماليك، وسائر ما تظنون أنكم ترزقونهم كاذباً فإن الله يرزقكم وإياهم\n قال البيضاوي: وفذلكة الآية: الاستدلال بجعل الأرض ممدودة بمقدار معين، مختلفة الأجزاء في الوضع، محدثة فيها أنواع النباتات والحيوانات المختلفة خلقة وطبيعة، مع جواز ألا تكون كذلك على كمال قدرته، وتناهي حكمته، والتفرد في ألوهيته، والامتنان على العباد بما أنعم في ذلك ليوحدوه ويعبدوه\n ثم بالغ في ذلك فقال: { وإن من شيء إلا عندنا خزائنه } أي: وما من شيء إلا ونحن قادرون على إيجاده وتكوينه أضعاف ما وجد منه، فضرب الخزائن مثلاً لاقتداره أو شبه مقدوراته بالأشياء المخزونة التي لا يجوج إخراجها إلى كلفة واجتهاد\n هـ\n قال ابن جزي: { وإن من شيء إلا عندنا خزائنُه } قيل: المطر، واللفظ أعم من ذلك، والخزائن: المواضع الخازنة، وظاهر هذا أن الأشياء موجودة قد خلقت\n\n\nهـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:11",
      "similarity": 0.8861750503698937
    },
    {
      "verse": "69:21",
      "similarity": 0.8576488150269471
    },
    {
      "verse": "101:7",
      "similarity": 0.8576488150269471
    },
    {
      "verse": "7:10",
      "similarity": 0.6870439494528425
    },
    {
      "verse": "43:32",
      "similarity": 0.5064112233516647
    }
  ]
}