{
  "chapter": "الحجر",
  "text": "قال لم اكن لاسجد لبشر خلقته من صلصل من حما مسنون",
  "translations": [
    {
      "translation": "He said, 'I will not prostrate to a human being whom You have created out of dried clay formed from fetid black mud.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How could I bow,\" said he, \"before a mortal whom You created from fermented clay dried tingling hard?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"It does not behove of me to prostrate myself before a human being whom You have created out of dry ringing clay wrought from black mud.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Iblis replied, \"I did not want to prostrate before a human being whom You have created out of mud-moulded clay\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answered, “It does not befit me to prostrate myself to a human whom You have created from sounding clay made out of black smelly mud.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblis] said: \"I am not one to prostrate myself to a human, whom You created from dried (sounding) clay of altered mud.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I am not such that I should make obeisance to a mortal whom Thou hast created of the essence of black mud fashioned in shape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'I would never bow myself before a mortal whom Thou hast created of a clay of mud moulded.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I am not one to prostrate myself unto a mortal whom Thou hast created out of potter's clay of black mud altered!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"I am not one to prostrate myself to a man whom You have created out of a clay of moulded mud.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said it was not for me that should prostrate myself unto a human being whom Thou hast created from ringing clay of loam moulded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, ‘I will not prostrate before a human whom You have created out of a dry clay [drawn] from an aging mud.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Iblis) said: \"I am not one to prostrate myself to man, whom Thou didst create from sounding clay, from mud moulded into shape.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblis (Satan)] said: \"I am not the one to prostrate myself to a human being, whom You created from sounding clay of altered black smooth mud.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'I will not prostrate to a mortal You have created of clay, from molded mud'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I am not about to prostrate myself before a human being, whom You created from clay, from molded mud.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Never would I prostrate to a human whom You created out of clay from an altered black mud.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:33] Said he, ‘I was not about to prostrate myself, I should not prostrate myself, before a mortal whom You have created out of a dry clay [drawn] from malleable mud’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: Why should I prostrate myself unto a mortal whom Thou hast created out of potter's clay of black mud altered?) he said: it is not becoming of me to prostrate to clay.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } إبليس محتجاً على الله، طالباً للرجحان والمزية على سبيل الإنكار والتعريض: { لَمْ أَكُن } أي: لم يصح مني، ولم يستحسن عني، ولم يلق لمرتبتي { لأَسْجُدَ لِبَشَرٍ } جسماني ظلماني كثيف { خَلَقْتَهُ مِن صَلْصَالٍ } أكشف وأظلم منه، وأخذت الصلصال { مِّنْ حَمَإٍ مَّسْنُونٍ } [الحجر: 33] لا شيء أظلم منه وأبعد عن ساحة عز القبول، والتمثالُ المشتمل على هذه الظلمات المتراكمة لا يليق أن يَخضع ويسجد له الروحاني النوراني\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { يا إبليس ما لكَ } أي شيء عرض لك، { ألا تكونَ مع الساجدين } لآدم؟ { قال لم أكن لأسجُدَ } أي: لا يصح مني، بل ينافي حالي أن أسجد { لبشرٍ } جسماني كثيف، وأنا روحاني لطيف، وقد { خلقتَه من صلصالٍ من حمإ مسنونٍ } ، وهو أخس العناصر، وخلقتني من نار وهي أشرفها\n استنقص آدم من جهة الأصل، وغفل عن الكمالات التي خصه الله بها، منها: أنه خلقه بيديه بلا واسطة، أي: بيد القدرة والحكمة، بخلاف غيره، ومنها: أنه خصه بالعلوم التي لم توجد عند غيره من الملائكة، ومنها: أنه نفخ فيه من روحه المضافة إلى نفسه، ومنها: أنه جعله خليفة في أرضه\n\n\n إلى غيره ذلك من الخواص التي تشرف بها فاستحق السجود",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:28",
      "similarity": 0.9772384194875318
    },
    {
      "verse": "15:26",
      "similarity": 0.9731455273093705
    },
    {
      "verse": "55:14",
      "similarity": 0.4969951968650004
    },
    {
      "verse": "18:86",
      "similarity": 0.4512926381479926
    },
    {
      "verse": "4:26",
      "similarity": 0.19092869996224746
    }
  ]
}