{
  "chapter": "الحجر",
  "text": "قال رب فانظرنى الى يوم يبعثون",
  "translations": [
    {
      "translation": "He said, 'My Lord, grant me a reprieve until the Day they are raised again.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord,\" said he, \"give me respite till the day the dead are raised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Iblis said: \"My Lord! Grant me respite till the Day when they will be resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Iblis prayed, \"Lord, grant me respite until the Day of Judgment\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord! Grant me respite till the day when they will all be raised.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblis] said: \"O my Lord! Then give me respite until the Day they (the dead) will be resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! then respite me till the time when they are raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'My Lord, respite me till the day they shall be raised.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! Reprieve me till the day when they are raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan said, \"O my Lord! Grant me respite till the Day of Resurrection.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: my Lord! respite me then till the Day whereon they will be raised up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! Respite me till the day they will be resurrected.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Iblis) said: \"O my Lord! give me then respite till the Day the (dead) are raised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblis (Satan)] said: \"O my Lord! Give me then respite till the Day they (the dead) will be resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'My Lord, reprieve me till the Day they are raised'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, reprieve me until the Day they are resurrected.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, then reprieve me until the Day they are resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:36] Said he, ‘My Lord! Reprieve me until the day when they, mankind, shall be resurrected’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Iblis said: (My Lord!) O my Lord! (Reprieve me till the day when they are raised) from the grave; the accursed did not wish to taste death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وقنط عن رحمة الله { قَالَ } مشتكياً متحسراً متأوهاً: { رَبِّ } يا من ربَّاني بأنواع الكرم والنعم\n فكفرت نعمك بمخالفة أمرك { فَأَنظِرْنِي } وأمهلني { إِلَىٰ يَوْمِ يُبْعَثُونَ } [الحجر: 36] ويحشرون\n لأغوي بني آدم\n وأنتقم عنهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال ربِّ فأنْظِرني }: أخرني { إلى يوم يُبعثون } ، أراد أن يجد فسحة في الإغواء، ونجاة من الموت، إذ لا موت بعد وقت البعث، فأجابه إلى الأول دون الثاني، { قال فإنك من المنظرين إلى يوم الوقت المعلوم }: المعين فيه أجلك عند الله، وانقراض الناس كلهم، وهو النفخة الأولى عند الجمهور\n وهذه المخاطبة، وإن لم تكن بواسطة، لا تدل على منصب إبليس لأن خطاب الله له على سبيل الإهانة والإذلال\n قاله البيضاوي\n وجزم ابن العربي، في سراج المريدين، بأن كلام الحق تعالى إنما كان بواسطة، قال: لأن الله لا يكلم الكفار الذين هم من جند إبليس، فكيف يكلم من تولى إضلالهم\n هـ\n وتردد المازُريُّ في ذلك وقال: لا قاطع في ذلك، وإنما فيه ظواهر، والظاهر لا تفيد اليقين\n ثم قال: وأما قوله: { ما منعك أن تسجد }: فيحتمل أن يكون بواسطة أو بغيرها، تقول العرب: كلمت فلاناً مشافهة، بالكلام، وتارة بالبعث\n هـ\n قلت: الظاهر أنه كلمه بلا واسطة من وراء حجاب، كلامَ عتابٍ وإهانة، كما يوبخ الكفار يوم القيامة، مع أن الواسطة محذوفة عند المحققين، وإن وُجِدَتْ صُورَةً\n ثم قال: { ربِّ بما أغويتني } أي: بسبب إغوائك لي، { لأُزَيِّنَنَّ لهم في الأرض } ، وقيل: الباء للقسم، أي: بقدرتك على إغوائي، لأزينن لهم المعاصي والكفر في الدنيا، التي هي دار الغرور\n قال ابن عطية: قوله: { رَبِّ }: مع كفره، يُخرج على أنه يقر بالربوبية والخلق، وهذا لا يدفع في صدر كفره\n وقال، على قوله: { لم أكن لأسجد }: ليس هذا موضع كفره عند الحذاق لأن إبايته إنما هي معصية فقط، أي: وإنما كفره لاعتراضه لأمر الحق واستكباره\n وأما قوله وتعليله فإنما يقتضي أن آدم مفضول، وقد أمره أن يسجد لمن هو أفضل منه، فرأى أن ذلك جور، فقاس وأخطأ، وجهل أن الفضائل إنما هي حيث جعلها الله تعالى المالك للجميع\n هـ\n مختصراً\n وقال المازري: أما كفر إبليس فمقطوع به لقوله:\n\n[البقرة: 34] ثم قال: ويؤكده قوله: { ربِّ بما أغويتني } ، وقوله:\n\nالآية [ص: 85]، وغير ذلك من ظواهر ما يدل على كفره\n وأما: هَلْ حدث هذا الكفر بعد إيمان سابق، أو لم يزل كافراً منذ كان؟ فهذا لا يحصله إلا نص قرآن، أو خبر متواتر، أو إجماع أمة، وهي المحصلة للعلم، وهذه الثلاثة مفقودة هنا\n هـ\n قلت: والظاهر أن كفره لم يظهر إلا بعد الأمر بالسجود لآدم، وإنما سبق به العلم القديم، وكان قد أظهر الإيمان والعبادة والله تعالى أعلم\n وقوله: { ولأغوينّهم أجمعين } أي: لأحملنهم على الغواية أجمعين، { إلا عبادكَ منهم المخلَصين } الذين أخلصتهم لطاعتك، وطهرتهم من الشهوات، فلا يعمل فيهم كيدي\n\n\nومن قرأ بالكسر فمعناه: الذين أخلصوا دينهم لله، وتحصنوا بالإخلاص في سائر أعمالهم\n { قال } تعالى: { هذا صراطٌ عليَّ مستقيمٌ } الإشارة إلى نجاة المخلصين، أو إلى العبادة والإخلاص، أي: هذا الطريق الذي سلكه أهل الإخلاص في عبوديتهم هو طريق وارد عليَّ، وموصل إلى جواري، لا سبيل لك على أهله لأنه مستقيم لا عوج فيه\n وقيل: الإشارة إلى انقسام الناس إلى غاوٍ ومخلص، أي: هذا أمر إليَّ مصيره، والنظر فيه لي، عليَّ أن أراعيه وأبينه، مستقيم لا انحراف فيه\n وقرأ الضحاك ومجاهد والنخعي، وغيرهم: \" عَلِيٌّ بكسر اللام والتنوين، من العلو والشرف، والإشارة حينئذٍ إلى الإخلاص، أي: هذا الإخلاص طريق رفيع مستقيم لا تنال أنت بإغوائك أهلَه يا إبليس\n الإشارة: إنما يصعب الخضوع للجنس أو لمن دونه، في حق من يغلب حسه على معناه، وفرقُه على جمعه وأما من غلب معناه على حسه، حتى رأى الأشياء الحسية أواني حاملة للمعاني، أي: لمعاني أسرار الربوبية، بل رآها أنواراً بارزة من بحر الجبروت، لم يصعب عليه الخضوع لشيء من الأشياء لأنه يراها قائمة بالله، ولا وجود لها مع الله، فلا يخضع حينئذٍ إلا لله، فالملائكة - عليهم السلام - نفذت بصيرتهم، فرأوا آدم عليه السلام قبلة للحضرة القدسية، فغلب عليهم شهود المعاني دون الوقوف مع الأواني، فخضعوا لآدم صورةً، ولله حقيقة\n وإبليس وقف مع الحس، وحجب بالفرق عن الجمع، فلم ير إلا حس آدم دون معناه، فامتنع عن السجود، وفي الحِكَم العطائية: \" فمن رأى الكون، ولم يشهد الحق فيه، أو عنده، أو قبله، أو بعده، أو معه، فقد أعوزه وجود الأنوار، وحجبت عنه شموس المعارف بحب الآثار \"\n ولهذا المعنى صعب الخضوع للأشباح لغلبة الفرق على الناس، إلا من سبقت له العناية، فإنه يخضع مع الفرق محبة لله، حتى يفتح الله عليه في مقام الجمع، فيخضع لله وحده\n والتوفيق لهذا، والسير على منهاجه ـ أعني الخضوع لمن يوصل إلى الله ـ هو الصراط الذي أشار إليه الحق تعالى بقوله: { هذا صراط عَلَيَّ مستقيم }\n والله تعالى أعلم\n ثمَّ ذكر من لا تسل للشيطان عليه فقال: { إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ\n\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:79",
      "similarity": 1.0
    },
    {
      "verse": "7:14",
      "similarity": 0.9728422369898219
    },
    {
      "verse": "23:16",
      "similarity": 0.6617999105313134
    },
    {
      "verse": "75:23",
      "similarity": 0.5436141879284242
    },
    {
      "verse": "6:29",
      "similarity": 0.5078952017643901
    }
  ]
}