{
  "chapter": "الحجر",
  "text": "ذرهم ياكلوا۟ ويتمتعوا۟ ويلههم الامل فسوف يعلمون",
  "translations": [
    {
      "translation": "Leave them to eat and enjoy themselves. Let false hope divert them. They will soon know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them to feast and revel, beguiled by hope; they will come to know soon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them to eat and enjoy life and let false hopes amuse them. They will soon come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), leave them alone to eat and enjoy themselves and let their desires deceive them; they will soon know (the Truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them to eat and enjoy, and for aspiration to involve them in play – so they will shortly come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them to eat and enjoy, and let them be preoccupied with (false) hope. They will come to know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them that they may eat and enjoy themselves and (that) hope may beguile them, for they will soon know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "leave them to eat, and to take their joy, and to be bemused by hope; certainly they will soon know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them eat and enjoy life, and let (false) hope beguile them. They will come to know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so leave them to eat and enjoy themselves and let them be beguiled by vain hopes; for soon they will realise [the truth].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them thou to eat and to enjoy, and let vain hope divert them; presently they will know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them to eat and enjoy and to be diverted by longings. Soon they will know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them alone, to enjoy (the good things of this life) and to please themselves: let (false) hope amuse them: soon will knowledge (undeceive them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them to eat and enjoy, and let them be preoccupied with (false) hope. They will come to know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them eat and enjoy; and let their hopes deceive them, soon they shall know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave them to eat, and enjoy, and be lulled by hope. They will find out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them eat and enjoy themselves and be diverted by [false] hope, for they are going to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:3]   Leave them, the disbelievers, O Muhammad (s), to eat and to enjoy, this world of theirs, and that they be diverted, distracted, by hope, of a long life and other [such] matters, [that keep them] away from faith, for they will come to know, the sequel of their affair — this was [revealed] before the command to fight [them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Let them) Muhammad (eat) without having any proof or resolve for that which lies ahead (and enjoy life) and live a life of disbelief and illicitness, (and let (false) hope beguile them) and let long hope preoccupy them from obeying Allah. (They will come to know!) they will come to know upon death and in the grave and on the Day of Judgement what will be done to them. This is a threat to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَرْهُمْ } يا أكمل الرسل وشُغلهم في دنياهم { يَأْكُلُواْ } من مأكولاتها المورثة لأنواع المرض في قلوبهم { وَيَتَمَتَّعُواْ } بمزخرفاتها الفانية ولذاتها الوهمية { وَيُلْهِهِمُ ٱلأَمَلُ } ويشغلهم عن الاشتغال بالطاعات، ويحرمهم عن اللذات الأخروية مطلقاً { فَسَوْفَ يَعْلَمُونَ } [الحجر: 3] قبح صنيعهم، وسوء فعالهم حين انكشف الأمر وتبلى السرائر، فحينئذٍ يتنبهون بما فوتوا لأنفسهم من اللذات الروحانية باعراضهم عن الله وكتابه ونبيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}