{
  "chapter": "الحجر",
  "text": "قال رب بما اغويتنى لازينن لهم فى الارض ولاغوينهم اجمعين",
  "translations": [
    {
      "translation": "He said, 'My Lord, because You misled me, I will make things on the earth seem good to them and I will",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord,\" he said, \"since You have led me into error I'll beguile them with the pleasures of the world and lead them astray,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Iblis said: \"My Lord! In the manner You led me to error, I will make things on earth seem attractive to them and lead all of them to error,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Iblis said, \"Lord, because you have caused me to go astray, I shall make earthly things attractive to (people) and mislead all of them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord! I swear by the fact that You sent me astray, I shall distract them in the earth, and I shall lead all of them astray.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblis] said: \"O my Lord! Because You misled me, I shall indeed adorn the path of error for them (mankind) on the earth, and I shall mislead them all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! because Thou hast made life evil to me, I will certainly make (evil) fair-seeming to them on earth, and I will certainly cause them all to deviate\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'My Lord, for Thy perverting me I shall deck all fair to them in the earth, and I shall pervert them, all together,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! Because Thou hast sent me astray, I verily shall adorn the path of error for them in the earth, and shall mislead them every one,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, since You have let me go astray. I shall make the path of error seem alluring to them on the earth and shall mislead them all,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: my Lord! because Thou hast led me to err I will surely make things fairseeming unto them on the earth and will surely seduce them all:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! As You have consigned me to perversity, I will surely glamorize [evil] for them on the earth, and I will surely pervert them, all\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Iblis) said: \"O my Lord! because Thou hast put me in the wrong, I will make (wrong) fair-seeming to them on the earth, and I will put them all in the wrong,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblis (Satan)] said: \"O my Lord! Because you misled me, I shall indeed adorn the path of error for them (mankind) on the earth, and I shall mislead them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(satan) said: 'My Lord, for Your perverting me, I shall make (matters) in the earth seem most fair to them and I shall pervert all,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, since You have lured me away, I will glamorize for them on earth, and I will lure them all away.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblees] said, \"My Lord, because You have put me in error, I will surely make [disobedience] attractive to them on earth, and I will mislead them all\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:39] Said he, ‘My Lord, because You have lead me astray (bi-mā, ‘because’, the bi- is for oaths, the response for which is [what follows]) I shall adorn for them [evil acts], acts of disobedience, in the earth and I shall lead them astray, all of them;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: My Lord) my Lord, (Because Thou hast sent me astray) as you made me err from guidance, (I verily shall adorn the path of error) lusts and desires (for them) for the children of Adam (in the earth, and shall mislead them) make them to err (every one) from guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأخرجتني من بين أحبتي وأخوتي { لأُزَيِّنَنَّ لَهُمْ } أعمالهم الفاسدة\n وأحسن عليهم الأفعال القبيحة { فِي ٱلأَرْضِ } وإغريتهم إلى ارتكاب أنواع المفاسد والمقابح عليها\n وأصناف الجرائم والآثام المائلة إليها نفوسهم طبعاً { وَ } بالجملة: { لأُغْوِيَنَّهُمْ } وأضلنهم { أَجْمَعِينَ } [الحجر: 39] بحيث لا يشذ عنهم أحد من ذوي النفوس الأمارة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:82",
      "similarity": 0.7902269495103876
    },
    {
      "verse": "37:32",
      "similarity": 0.7108649653737678
    },
    {
      "verse": "53:2",
      "similarity": 0.6535292923428649
    },
    {
      "verse": "26:224",
      "similarity": 0.6015123135548377
    },
    {
      "verse": "7:16",
      "similarity": 0.5616525120813755
    }
  ]
}