{
  "chapter": "الحجر",
  "text": "لها سبعة ابوب لكل باب منهم جزء مقسوم",
  "translations": [
    {
      "translation": "It has seven gates and each gate has its allotted share.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which has several gates, and each gate is marked for every section of them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are seven gates in it, and to each gate a portion of them has been allotted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has seven gates and each gate is assigned for a certain group of people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has seven gates; for each gate is a portion assigned from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has seven gates, for each of those gates is a class assigned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has seven gates; for every gate there shall be a separate party of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seven gates it has, and unto each gate a set portion of them belongs.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It hath seven gates, and each gate hath an appointed portion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it has seven gates: and each gate has a portion of them allotted to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto it are seven portals; unto each portal is a Portion of them assigned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has seven gates, and to each gate belongs a separate portion of them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To it are seven gates: for each of those gates is a (special) class (of sinners) assigned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It (Hell) has seven gates, for each of those gates is a (special) class (of sinners) assigned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has seven gates, and through each gate a portion of them belong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“It has seven doors; for each door is an assigned class.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has seven gates; for every gate is of them a portion designated.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:44] It has seven gates, [seven] layers — to each gate, therein, belongs an appointed portion, lot, of them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It hath seven gates) some higher than others: its highest is Gehenna and lowest al-Hawiyah, (and each gate hath an appointed portion) each gate has a specific number of disbelievers who will enter it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَهَا سَبْعَةُ أَبْوَابٍ } على عدد مداخلها من الشهوات السبعة المقتضية إياها، المذكورة في كريمة\n\n[آل عمران: 14]\n\n\n\n\n{ لِكُلِّ بَابٍ } من الأبواب السبعة الجهنمية { مِّنْهُمْ جُزْءٌ مَّقْسُومٌ } [الحجر: 44] أي: طائفة مفروزة منهم بالدخول من كل بابٍ، وإن كان الكل شريكاً في الكل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { منهم }: حال من جزء مقدم، أي: لكل باب جزء حاصلٌ منهم مقسوم، أو من المستكن في الظرف لا من مقسوم، لأن الصفة لا تعمل فيما تقدم موصوفها\n و { إخواناً }: حال من الضمير المضاف إليه لأنه جزء ما أضيف إليه، والعامل فيه: الاستقرار، أو معنى الإضافة، وكذا: { على سُرُر متقابلين } ، ويجوز أن يكون صفتين لإخوان، أو حالين من ضميره\n يقول الحق جل جلاله: { إنَّ عبادي } المتحققين بالعبودية لي، المخلصين في أعمالهم، { ليس لك } يا إبليس { عليهم سلطانٌ } أي: غلبة وتسلط بالغواية والإضلال، { إلا من اتبعك من الغاوين } الذين سبقت لهم الغواية، وتنكبتهم العناية\n { وإنَّ جهنم لموعدهم }: لموضع إبعاد الغاوين أو المتبعين لك { أجمعين } ، { لها سبعة أبواب } يدخلون فيها لكثرتهم، أو طبقات ينزلونها بحسب مراتبهم في المتابعة، وفي كل طبقة باب يسلك منه إليها، فأعلاها: جهنم، وهي للمذنبين من الموحدين، ثم لظى لليهود، ثم الحُطمة للنصارى، ثم السعير للصابئين، ثم سقر للمجوس، ثم الجحيم للمشركين، وكبيرهم أبو جهل، ثم الهاوية، وهي الدرك الأسفل، للمنافقين، وعبَّر في الآية عن النار جملة، بجهنم إذ هي أشهر منازلها وأولها، وهو موضع العصاة الذين لا يخلدون، ولهذا رُوي أن جهنم تخرب وتبلى، يعني: حين يخرج العصاة منها\n وقيل: أبواب الطبقات السبع كلها من جهنم، ثم ينزل من كل باب إلى طبقته التي تفضى إليه\n قاله ابن عطية\n قال البيضاوي: ولعل تخصيص العدد بالسبعة، لانحصار مجامع المهلكات في الركون إلى المحسوسات، ومتابعة القوة الشهوية والغضبية\n هـ\n فالقوة الشهوية محلها ست وهي: السمع والبصر والشم واللسان والبطن والفرج\n والقوة الغضبية في البطش باليد والرجل، فالمعاصي المهلكات جلها من هذه السبع، ومَلِكها القلب، إذا صلح صلحت، وإذا فسد فسدت\n كما في الحديث ثم قال البيضاوي: أو لأن أهلها فرق سبع هـ يعني الفرق التي تقدمت للطبقات، قال تعالى: { لكل بابٍ منهم }  أي: من الأتباع { جُزْءٌ مَقْسومٌ } أفرد له، لا يدخل إلا منه، ولا يسكن إلا في طبقته\n\n\nوقد تقدم أهل كل طبقة، من عصاة الموحدين إلى المنافقين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:15",
      "similarity": 0.8328495478691726
    },
    {
      "verse": "2:260",
      "similarity": 0.544886462939312
    },
    {
      "verse": "2:29",
      "similarity": 0.16618295305684327
    },
    {
      "verse": "78:19",
      "similarity": 0.15750645448085837
    },
    {
      "verse": "23:86",
      "similarity": 0.15610183689932258
    }
  ]
}