{
  "chapter": "الحجر",
  "text": "الا امراته قدرنا انها لمن الغبرين",
  "translations": [
    {
      "translation": "except for his wife. We have decreed her to be one of those who stay behind.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other than his wife who, it is decreed, will remain with those who will stay behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except his wife (about whom Allah says that) We have decreed that she shall be among those who stay behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except his wife who is doomed to be left behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Except his wife – we have decided that she is of those who will stay behind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for his wife, of whom We have decreed that she shall be of those who remain behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except his wife; We ordained that she shall surely be of those who remain behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "all together, excepting his wife -- we have decreed, she shall surely be of those that tarry.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except his wife, of whom We had decreed that she should be of those who stay behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except his wife. We have decreed that she will be among those who remain behind [and will be lost].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But not his wife; we have decreed that she will be of those staying behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except his wife, [who], We have ordained, will indeed be among those who remain behind.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except his wife, who, We have ascertained, will be among those who will lag behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except his wife, of whom We have decreed that she shall be of those who remain behind (i.e. she will be destroyed).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but his wife. We decreed that she should be amongst those who remain behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Except for his wife.” We have determined that she will be of those who lag behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except his wife.\" Allah decreed that she is of those who remain behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:60] except his wife — We have decreed that she indeed should be of those who will remain behind’, [of] those who will stay behind in the chastisement, because of her unbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Except his wife) his other wife, Wa'ilah the hypocrite, (of whom We had decreed that she should be of those who stay behind) and be destroyed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ ٱمْرَأَتَهُ } المجرمة العاصية { قَدَّرْنَآ } بإعلام الله وإذنه إياه علينا { إِنَّهَا لَمِنَ ٱلْغَابِرِينَ } [الحجر: 60] الباقين مع الكفرة الهالكين؛ لكونها باقية على اعتقادهم وعنادهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ويحتمل أن يكون استثناء من الضمير في { مجرمين } فيكون متصلاً، كأنه قال: إلى قوم أجرموا كلهم إلا آل لوط فلم يجرموا، قوله: { إلا امرأته } استثناء من آل لوط، فهو استثناء من استثناء\n قيل: وفيه دليل على أن الأزواج من الآل لأنه استثنى امرأته من آله\n وقال الزمخشري: إنما هو استثناء من الضمير المجرور في قوله: { إنا لمنجوهم } ، وذلك هو الذي يقتضيه المعنى\n هـ\n أي: إنا لمنجوهم من العذاب { إلا امرأته قدَّرنا إنها لمن الغابرين } الباقين في العذاب مع الكفرة لتهلك معهم، وقرأ أبو بكر عن عاصم: \" قدرنا \" بالتخفيف، وهما لغتان، يقال: قدّر الله وكذا وقدره، قال البيضاوي: وإنما علق، والتعليق من خواص أفعال القلوب لتضمنه معنى العلم، ويجوز أن يكون قدرنا: أجرى مجرى قلنا لأن التقدير بمعنى القضاء قول، وأصله: جعل الشيء على مقدار غيره، وإسناد التقدير إلى إنفسهم، وهو فعل الله تعالى لما لهم من القرب والاختصاص\n هـ\n قلت: وفيه إشارة إلى حذف الوسائط، كما هو توحيد المحققين\n والله تعالى أعلم\n  الإشارة: لا يلزم من ثبوت الخصوصية عدم وصف البشرية، فالوجل والخوف والفرح والحزن والتعجب والاستعظام للأشياء الغريبة، كل ذلك من وصف البشر، يقع من الخصوص وغيرهم، لكن فرق بين خاطر وساكن، فالخصوص تهجم عليهم ولا تثبت، بخلاف العموم\n ويؤخذ من الآية: أن صحبة الخصوص لا تنفع إلا مع الاعتقاد والتعظيم، فإنَّ امرأة نبي الله لوط كانت متصلة به حساً، ومصاحبة له، ولم ينفعها ذلك، حيث لم يكن لها فيه اعتقاد ولا تعظيم\n وكذلك صحبة الأولياء: لا تنفع إلا مع صدق والتعظيم\n وقول ابن عطاء الله: سبحان من لم يجعل الدليل على أوليائه إلا من حيث الدليل عليه\n ولم يوصل إليهم إلا من اراد أن يوصله إليه \": مقيد بوصول التعظيم والاعتقاد، والاستماع والاتباع\n والله تعالى أعلم\n ثمَّ ذكر قصة هلاك قوم لوط\n",
      "translations": []
    }
  ]
}