{
  "chapter": "الحجر",
  "text": "فاسر باهلك بقطع من اليل واتبع ادبرهم ولا يلتفت منكم احد وامضوا۟ حيث تؤمرون",
  "translations": [
    {
      "translation": "Travel with your family in the dead of night, following behind with them in front of you. None of you must look back. Go where you are ordered to.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So leave with your family late in the night, yourself remaining in the rear, and let none turn back to look, and go where you will be commanded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set out with your family in a watch of the night, and keep yourself behind them, and no one of you may turn around, and keep going ahead as you have been commanded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave the town with your family sometime during the night. Walk behind them and let no one turn around. Proceed as you are commanded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore journey with your household while a portion of the night remains, and you tread behind them – and none of you may turn around and see, and proceed directly to the place you are commanded to.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then travel for a portion of the night with your family, and you go behind them in the rear, and let no one amongst you look back, but go on to where you are ordered.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore go forth with your followers in a part of the night and yourself follow their rear, and let not any one of you turn round, and go forth whither you are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set forth, thou with thy family, in a watch of the night, and follow after the backs of them, and let not any one of you turn round; and depart unto the place you are commanded.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So travel with thy household in a portion of the night, and follow thou their backs. Let none of you turn round, but go whither ye are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so leave with your family some time in the latter part of the night, and walk behind them. Let none of you look back. Go where you are commanded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set out thou with thy house hold in a portion of the night, and follow thou their backs, and let not one of you look back, and pass whither ye are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take your family in a watch of the night; and follow in their rear, and none of you should turn round, and proceed as you are bidden.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then travel by night with thy household, when a portion of the night (yet remains), and do thou bring up the rear: let no one amongst you look back, but pass on whither ye are ordered.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then travel in a part of the night with your family, and you go behind them in the rear, and let no one amongst you look back, but go on to where you are ordered.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Depart with your family in a part of the night and walk behind them and let none of you turn round. Go to a place where you are commanded'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Travel with your family at the dead of the night, and follow up behind them, and let none of you look back, and proceed as commanded.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So set out with your family during a portion of the night and follow behind them and let not anyone among you look back and continue on to where you are commanded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:65] So travel with your family in a portion of the night and follow their rear, walk behind them; and let none of you turn round, lest he see the dreadful nature of that [punishment] which will be sent down on them, and go whither you are commanded’, namely, [to] Syria.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So travel with thy household in a portion of the night) at the end of the night, at dawn, (and follow you their backs) walk behind them in the direction of Sa'ar . (Let none of you turn round) let none of you lag behind, (but go whither ye are commanded) towards Sa'ar.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالآن وقت إنجاز ما وعد الله لك من إنزال العذاب عليهم { فَأَسْرِ بِأَهْلِكَ } أي: سر واذهب معهم { بِقِطْعٍ مِّنَ ٱلَّيلِ } أي: في طائفة من آنات الليل وساعاته، فقدمهم أمامك { وَٱتَّبِعْ أَدْبَارَهُمْ } وأثرهم، والعذابُ منزل عليهم عقيب خروجك بلا تراخ، وإذا كانوا خلفك أصابتهم منه { وَ } بعدما خرجتم إليهم من بينهم { لاَ يَلْتَفِتْ مِنكُمْ أَحَدٌ } خلفه، ولا ينظر إلى ما وراءه حتى لا يصيبه ما أصابهم، ولا بهوله ولا بفزعه { وَٱمْضُواْ } أيها المأمورون { حَيْثُ تُؤْمَرُونَ } [الحجر: 65]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأسرِ بأهلك }: فاذهب بهم { بقطْعٍ من الليل } أي: فاخرح بهم في طائفة من الليل، قيل: آخره، { واتَّبع أدبارَهم } أي: كن خلفهم في ساقتهم، حتى لا يبقى منهم أحد، أو: أمره بالتأخر عنهم ليكونوا قدامه، فلا يشتغل قلبه بهم لو كانوا خلفه لخوفه عليهم، أي: ليسرع بهم، ويطلع على أحوالهم\n { ولا يلتفت منكم أحدٌ } خلفه، لينظر ما وراءه فيرى من الهول ما لا يطيقه، أو: ولا ينصرف أحد منكم، ولا يتخلف لغرض فيصيبه ما أصابهم\n وقيل: نهوا عن الالتفات ليوطنوا أنفسهم على الهجرة\n { وامضوا حيث تُؤمرون } أي: إلى حيث أمركم الله، وهو الشام أو مصر، وقال بعضهم: \" ما من نبي هلك إلا لحق بمكة، وجاور بها حتى مات \"",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:81",
      "similarity": 0.6644084052664634
    },
    {
      "verse": "10:78",
      "similarity": 0.5733886580510895
    },
    {
      "verse": "43:8",
      "similarity": 0.34799568841915496
    },
    {
      "verse": "8:38",
      "similarity": 0.3243537945313456
    },
    {
      "verse": "44:23",
      "similarity": 0.30821135968096325
    }
  ]
}