{
  "chapter": "الحجر",
  "text": "وقالوا۟ يايها الذى نزل عليه الذكر انك لمجنون",
  "translations": [
    {
      "translation": "They say, 'You, to whom the Reminder has been sent down, are clearly mad.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And yet they say: \"You, to whom this Exposition has been sent are surely possessed of the Devil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"O you to whom the Admonition has been revealed, you are surely crazed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The unbelievers have said), \"You to whom the Quran has been revealed are insane.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “O you upon whom the Qur’an has been sent, you are indeed insane.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"O you (Muhammad) to whom the Dhikr (the Qur'an) has been revealed! Verily, you are a madman!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: O you to whom the Reminder has been revealed! you are most surely insane:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Thou, upon whom the Remembrance is sent down, thou art assuredly possessed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: O thou unto whom the Reminder is revealed, lo! thou art indeed a madman!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"You to whom the Reminder [the Quran] has been sent down, you are surely possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: O thou unto whom the Admonition hath been sent down! verily thou art possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O you, to whom the Reminder has been sent down, you are indeed crazy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"O thou to whom the Message is being revealed! truly thou art mad (or possessed)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"O you (Muhammad SAW) to whom the Dhikr (the Quran) has been sent down! Verily, you are a mad man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'You to whom the Remembrance is sent down, you are indeed mad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “O you who received the message, you are insane.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"O you upon whom the message has been sent down, indeed you are mad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:6] And they, that is, the disbelievers of Mecca, say, to the Prophet (s): ‘O you, to whom the Remembrance, the Qur’ān — as you claim — has been revealed, lo! you are indeed possessed!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they) this refers to 'Abdullah Ibn Umayyah al-Makhzumi and his host who (say) to Muhammad (pbuh): (0 thou unto whom the Reminder is revealed) you who claim that Gabriel brought you the Qur'an, (lo! thou art indeed a madman!) who is inventing lies. 272\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا نهلكهم ونعذبهم بأشد العذاب ولا ننتقم عنهم؛ إذ هم { قَالُواْ } حين دعوتك إياهم وإلقائك إليهم شعائر الإيمان والإسلام منادين لك، مستهزئين معك متهكمين: { يٰأَيُّهَا } النبي { ٱلَّذِي نُزِّلَ عَلَيْهِ } من عند ربه { ٱلذِّكْرُ } أي: الكتاب المبين له أمثال هذه الكلمات التي نسمع منك { إِنَّكَ } في دعوتك وادعائك النبوة والكتاب { لَمَجْنُونٌ } الحجر:6] مخبط مختل العقل، يخبطك الجن، ويعلمك أمثال هذه الكلمات والحكايات، تخليت أنهم ملائكة ينزلون إليك بها، وإن اطلعت على الملائكة وصاحبت معهم، مع أنك بشر مثلنا؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وقالوا } أي: كفار قريش: { يا أيها الذين نُزِّل عليه الذكْرُ } في زعمه، أو قالوه تَهكماً، { إنك لمجنون } أي: إنك لتقول قول المجانين، حين تدعي أنه ينزل عليك الذكر، أي: القرآن",
      "translations": []
    }
  ]
}