{
  "chapter": "الحجر",
  "text": "ما ننزل الملئكة الا بالحق وما كانوا۟ اذا منظرين",
  "translations": [
    {
      "translation": "The angels only descend with the truth and then they would be granted no reprieve.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But then We never send the angels down save with the purpose (of enforcing their doom), after which they will not be given more respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not send down the angels (in frivolity); and when We do send them down, We do so with Truth; then people are granted no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not send down angels except for a genuine purpose, at which time none will be given any further respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not send down angels without reason, and if the angels descend they would not get any respite!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not send the angels down except with the truth, and in that case, they (the disbelievers) would have no respite!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not send the angels but with truth, and then they would not be respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We send not down the angels, save with truth;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We send not down the angels save with the Fact, and in that case (the disbelievers) would not be tolerated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We send down the angels only to bring justice and then they will not be reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We send not the angels down save with judgment, and then they would not be respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not send down the angels except with due reason, and then they will not be granted any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We send not the angels down except for just cause: if they came (to the ungodly), behold! no respite would they have!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We send not the angels down except with the truth (i.e. for torment, etc.), and in that case, they (the disbelievers) would have no respite!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not send angels except with the truth. Then they shall have no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not send the angels down except with reason, and they will not be held back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not send down the angels except with truth; and the disbelievers would not then be reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:8] God, exalted be He, says: The angels do not descend (tanazzalu: one of the two tā’ letters [of tatanazzalu] has been omitted) save with the truth, with the chastisement; and then, that is, upon the descent of the angels with the chastisement, they [the disbelievers] would not be reprieved, [would not] be granted respite.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah said: (We send not down the angels) from heaven (save with the Fact) with destruction or for taking their souls away, (and that case (the disbelievers) would not be tolerated) they would not be given any respite when the angels come down to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل لهم يا أكمل الرسل نيابةً عنا: { مَا نُنَزِّلُ ٱلْمَلائِكَةَ } لكل واحد من البشر، بل لمن نؤتى الحكمة منه له في أصل فطرته واستعداده، وهم الأنبياء والرسل المأمورون بالإرشاد والتكميل، وماننزلهم { إِلاَّ } تأيدداً لهم ملتبساً { بِٱلحَقِّ } أي: بالدين الثابت المطابق للواقع؛ ليتدين بدينهم من يتبعهم، ويؤمن لهم إطاعةً وانقياداً، ولو اطلع الكل على نزولهم، ورأوا صورهم لبطل حكمة الإطاعة والإرسال والتكميل؛ إذ الكل في الرشد والهداية على السواء حنيئذٍ { وَ } أيضاً { مَا كَانُواْ إِذاً مُّنظَرِينَ } [الحجر: 8] منتظرين إلى يوم الجزاء، إذ الكل ناجون مهديون في النشأة الأولى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}