{
  "chapter": "الحجر",
  "text": "لا تمدن عينيك الى ما متعنا به ازوجا منهم ولا تحزن عليهم واخفض جناحك للمؤمنين",
  "translations": [
    {
      "translation": "So covet not things We have bestowed on a portion of them to enjoy, and do not grieve for them, and protect those who believe;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not even cast your eyes towards the worldly goods We have granted to different kinds of people, nor grieve over the state they are in, but turn your loving attention to the believers instead,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not yearn for other people's property and wives and do not grieve (that they do not believe). Be kind to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not direct your eyes towards the things We have given to some of their couples to enjoy, and do not at all grieve because of them, and take the Muslims within the folds of your mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look not with your eyes ambitiously at what We have given to certain classes of them, nor grieve over them. And lower your wings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not strain your eyes after what We have given certain classes of them to enjoy, and do not grieve for them, and make yourself gentle to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stretch not thine eyes to that We have given pairs of them to enjoy; and do not sorrow for them, and lower thy wing unto the believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Strain not thine eyes toward that which We cause some wedded pairs among them to enjoin, and be not grieved on their account, and lower thy wing (in tenderness) for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not strain your eyes towards the worldly benefits We have bestowed on some of them, nor grieve on their account. Lower your wing of mercy for the believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cast not thine eyes toward that which We have let classes of them to enjoy; and grieve not over them, and lower thy wing unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not extend your glance toward what We have provided to certain groups of them, and do not grieve for them, and lower your wing to the faithful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Strain not thine eyes. (Wistfully) at what We have bestowed on certain classes of them, nor grieve over them: but lower thy wing (in gentleness) to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look not with your eyes ambitiously at what We have bestowed on certain classes of them (the disbelievers), nor grieve over them. And lower your wings for the believers (be courteous to the fellow-believers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not stretch your eyes to that We have given pairs of them to enjoy, nor sorrow for them, and lower your wing to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not extend your eyes towards what We have bestowed on some couples of them to enjoy, and do not grieve over them, and lower your wing to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not extend your eyes toward that by which We have given enjoyment to [certain] categories of the disbelievers, and do not grieve over them. And lower your wing to the believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:88] Do not extend your glance toward that which We have given different groups of them to enjoy, and do not grieve for them, should they not believe, and lower your wing, temper your nature, for the believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Strain not thine eyes towards) covet not (that which We cause some wedded pairs among them) men from the Banu Qurayzah and the Banu'l-Nadir; it is also said that this refers to men from the Quraysh-because that with which We honoured you, prophethood, the Qur'an and Islam, is far greater than that which We have given them (to enjoy) in terms of wealth, (and be not grieved on their account) do not grieve for their destruction if they choose not to believe, (and lower thy wing (in tenderness) for the believers) be compassionate with them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفعليك بعدما اصطفيناك يا أكمل الرسل من بين سائر الأنبياء بأمثال هذه الكرامات أن { لاَ تَمُدَّنَّ عَيْنَيْكَ } نحوهم، ولا تنظر نظر متحسر راغب، بل نظر معتبر كاره { إِلَىٰ مَا مَتَّعْنَا بِهِ } من الزخارف { أَزْوَاجاً مِّنْهُمْ } أي: أصنافاً من الأمتعة معطاه منها للكفرة ابتلاءً لهم، بحيث صاروا بها مفتخرين، بطرين بين الناس { وَلاَ تَحْزَنْ عَلَيْهِمْ } بعد اتباعهم لك وإيمانهم بك؛ إذ هذه المزخرفات الدنية تحجبهم عن الإيمان، وتعوقهم عن العرفان؛ لأنهم مفتونون بها { وَٱخْفِضْ جَنَاحَكَ } وابسطها كل البسط { لِلْمُؤْمِنِينَ } [الحجر: 8] الذين يتبعونك عن خلال القلب، وصفاء القريحة بلا شوب الرياس والسمعة، وشين الأهوية الفاسدة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا تمُدَّن عينيك }: لا تطمح ببصرك طموح راغب { إلى ما متعنا به أزواجاً منهم } أي: أصنافاً من الكفار، من زهرة الحياة الدنيا، فإنه مستحقر بالإضافة إلى ما أوتيته\n وفي حديث أبي بكر: \" من أوتي القرآن، فرأى أن أحداً أوتي من الدنيا أفضل مما أوتي، فقد صغر عظيماً وعظم صغيراً \"\n قال ابن جزي: لا تنظر إلى ما متعنا به في الدنيا، ومعنى الآية: تزهيد في الدنيا، كأنه يقول: قد آتيناك السبع المثاني والقرآن العظيم فلا تنظر إلى الدنيا، فإن الذي أعطيناك أعظم منها\n هـ\n  وروي أنه صلى الله عليه وسلم وافى مع أصحابه أذْرِعَات، فرأى سبع قوافل ليهود بني قُرَيْظَة والنَّضير، فيها أنواع البُرِّ، والطيب والجواهر، وسائر الأمتعة، فقال المسلمون: لو كانت هذه الأموال لنا لتقربنا بها، ولأنفقناها في سبيل الله، فقال لهم ـ عليه الصلاة والسلامـ:\n\n \" قد أعطيتم سبع آيات هي خير من هذه السبع القوافل \"\n \n\n{ ولا تحزنْ عليهم }: لا تتأسف على كفرهم حيث أنذرتهم فلم ينزجروا ولم يؤمنوا\n أو: حيث متعناهم بالدنيا فلم ينفعوا بها، ولم يصرفوها في مرضاة الله، { وأخفض جناحك للمؤمنين } أي: تواضع وألن جانبك للمؤمنين، وارفق بهم\n والجناح، هنا، استعارة\n { وقل إني انا النذيرُ المبين }: البين الإنذار، أنذرتكم ببيان وبرهان أن عذاب الله نازل بكم إن لم تؤمنوا\n\n\nوفي الحديث:\n\n \" أنا النذير، وأنذرتكم ببيان وبرهان أن عذاب الله نازل بكم إن لم تؤمنوا \" \n\nوفي الحديث:\n\n \" أنا النذير، والموت مغير، والقيامة الموعد \" \n\nأو كما قال عليه الصلاة والسلام، وفي حديث آخر:\n\n \" أنا النَّذير العُريَانُ \" \n\nوكانت العرب إذا رأى أحْدهم جيشاً يقصدهم، تجرد من ثيابه، ثم أنذر قومه ليصدقوه، أي: وقل: إني أنذرتكم ان ينزل بكم عذابه",
      "translations": []
    }
  ]
}