{
  "chapter": "الحجر",
  "text": "وما خلقنا السموت والارض وما بينهما الا بالحق وان الساعة لءاتية فاصفح الصفح الجميل",
  "translations": [
    {
      "translation": "We have not created but with reason the heavens and the earth and all that lies within them. The Hour (of the great change) is certain to come. So turn away (from them) with a grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not created the heavens and the earth and all that is in between them except with Truth. Surely the Hour will come. So, (O Muhammad), do graciously overlook them (despite their misdeeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created the heavens and the earth and all that is between them, for a genuine purpose. The Day of Judgment will certainly approach, so (Muhammad) forgive them graciously.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not created the heavens and the earth and all that is between them, except with the Truth; and indeed the Last Day will come, therefore (O dear Prophet Mohammed – peace and blessings be upon him), forbear graciously.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not create the heavens and the earth and all that is between them except with the truth, and the Hour is surely coming, so overlook their faults with gracious forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not create the heavens and the earth and what is between them two but in truth; and the hour is most surely coming, so turn away with kindly forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens and the earth, and all that is between them, save in truth. Surely the Hour is coming; so pardon thou, with a gracious pardoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens and the earth and all that is between them save with truth, and lo! the Hour is surely coming. So forgive, (O Muhammad), with a gracious forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created the heavens and the earth and all that is between the two in accordance with the requirements of truth and wisdom. The Hour is surely coming. So overlook [their faults] with gracious forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not created the heaven and the earth and that which is in between them save with a purpose. And verily the Hour is surely coming; so overlook thou with a seemly overlooking,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heavens and the earth and whatever is between them except with consummate wisdom, and indeed the Hour is bound to come. So forbear with a graceful forbearance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens, the earth, and all between them, but for just ends. And the Hour is surely coming (when this will be manifest). So overlook (any human faults) with gracious forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We created not the heavens and the earth and all that is between them except with truth, and the Hour is surely coming, so overlook (O Muhammad SAW), their faults with gracious forgiveness. [This was before the ordainment of Jihad holy fighting in Allah's Cause].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heavens and the earth, and what is between them except in truth. The Hour is sure to come, therefore, forgive them with a graciouspardon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heavens and the earth, and what lies between them, except with truth. The Hour is coming, so forgive with gracious forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not created the heavens and earth and that between them except in truth. And indeed, the Hour is coming; so forgive with gracious forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:85] We did not create the heavens and the earth and all that is between them save with the Truth. And truly the Hour shall come, without doubt, whereupon every person will be requited according to his deeds. So be forgiving, O Muhammad (s), to your people, with gracious forgiveness: turn away from them without [any feeling of] anxiety — this was abrogated by the ‘sword’ verse [Q. 9:5].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We created not the heavens and the earth and all that is between them) of created beings and marvels (save with truth) in order to expound the Truth, falsehood and the proofs against them, (and lo! the Hour is surely coming. So forgive, Muhammad, with a gracious forgiveness) turn away from them gently without using foul language nor feel alarmed at their denial. This was, however, abrogated by the verse of fighting.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه قولاً دالاً على كمال قدرته ومشيئته، ولطفه وقهره، وإنعامه وانتقامه تنبيهاً على ذوي البصائر الاعتبار المتفكرين في خلق الله، وإيجاده وإعدامه، واستقلال تصرفاته في ملكه وملكوته: { وَمَا خَلَقْنَا } وقدرنا { ٱلسَّمَٰوَٰتِ } وما فيها من الآثار والمؤثرات العلوية { وَٱلأَرْضَ } وما عليها من المتأثرات السفلية { وَمَا بَيْنَهُمَآ } من الكائنات والفاسدات الحادثة في الجو باطلاً عبثاً لا عبرة لها ولا اعتبار لإظهارها وظهورها، بل ما خَلَقْنَا مَا خَلَقْنَا { إِلاَّ } ملتبساً { بِٱلْحَقِّ } المثبت لأصحاب الدلائل والبراهين، وتوحيد الحق الثابت المحقق لأرباب الكشف واليقين\n\n\n{ وَ } اعلموام أيها العقلاء والمكلفون المعتبرون { إِنَّ ٱلسَّاعَةَ } الموعودة لانقهار التعينات، واضمحلال التشكلات { لآتِيَةٌ } جزماً بلا تردد وشبهة فيجازي فيها كل على مقتضى ماكسبت في عالم التعينات والتطورات، وإذا كان الكل مجازون بأعمالهم، مسئولون عنها { فَٱصْفَحِ } يا أكمل الرسل، وأعرض عن انتقام من يؤذيك ويريدك { ٱلصَّفْحَ ٱلْجَمِيلَ } [الحجر: 85] أي: الإعراض المستحسن عند الطباع، واحلم معهم، والطف عليهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}