{
  "chapter": "الحجر",
  "text": "الذين جعلوا۟ القرءان عضين",
  "translations": [
    {
      "translation": "those who divide the Qur'an into little pieces.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And severed their Scripture into fragments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who had split up their Qur'an into pieces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and also divided the Quran believing in some parts and rejecting others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who broke the Word of Allah into several parts. (Those who broke the Torah / Bible or changed its text – or those who called the Qur’an a fabrication / poetry.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who have made the Qur'an into parts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who made the Quran into shreds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who have broken the Koran into fragments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who break the Qur'an into parts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and who have broken the Scripture into fragments --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have made the scripture bits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who represented the Quran as magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(So also on such) as have made Qur'an into shreds (as they please).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who have made the Quran into parts. (i.e. believed in a part and disbelieved in the other).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who have broken the Koran into parts,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who made the Quran obsolete.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who have made the Qur'an into portions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:91] those who have reduced the Recitation, namely, those scriptures revealed to them, to parts, believing in some and disbelieving in others. It is [alternatively] said that the individuals meant here were those who ‘divided up’ among themselves the roads to Mecca, barring people from Islam. Some of them said that the Qur’ān was sorcery, some that it was soothsaying, and others that it was poetry.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who break the Qur'an into parts) they said many different things about the Qur'an; some said it was 280 magic, others said it was poetry, others said it was a form of divination; some said it was fables of the people of old while others said that it was mere lies invented by the Prophet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n اقتضاءً ومطلعاً { عِضِينَ } [الحجر: 91] أي: ذي أجزاء مختلفة\n بعضها حق\n لأنه مطابق للكتب السالفة\n وبعضها باطل\n لأنه مخالف لها\n وبعضها شِعْر\n وبعضها كهانة\n مع أن الكل هداية لا ضلال فيها أصلاً\n تعالى شأنه وكتابه عما يقولون علواً كبيراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو: آتيناك القرآن، وأنزلناه عليك كما أنزلنا التوراة على المقتسمين، وهم اليهود، { الذين جعلوا القرآن عِضين } ، أي: أجزاء متفرقة، وقالوا فيه أقوالاً مختلفة، فقالوا عناداً وكفراً: بعضه موافق للتوراة والأنجيل، وبعضه باطل مخالف لهما\n وإذا قلنا المقتسمين: هم كفارقريش، حيث اقتسموا أبواب مكة، فقد جعلوا القرآن عضين إجزاء متفرقة، فقد قسموه إلى شعر وسحر وكهانة وأساطير الأولين، أو جعلوه بهتاناً متعدداً، على تفسير العضة بالبهت\n وفي الحديث:\n\n \" لعن رسول الله صلى الله عليه وسلم العاضهة والمستعضهة \" \n\nأي: الباهتة، والمستبهتة: الطالبة له\n قال تعالى في وعيد المقتسمين: { فوربك لنسألنهم أجمعين عما كانوا يعملون } من التقسيم والتكذيب، أو عن كل ما عملوه من الكفر والمعاصي، وفي البخاري: \" لنسألنهم عن لا إله إلا الله \"\n فإن قيل: كيف يجمع بين هذا وبين قوله\n\n[الرحمن: 39] فالجواب: أن السؤال المثبت هو على وجه الحساب والتوبيخ، والسؤال المنفي هو على وجه الاستفهام المحض لأن الله تعالى يعلم الأعمال، فلا يحتاج إلى سؤال\n وقيل: في القيامة مواطن وخوارق، فموطن يقع فيه السؤال، وموطن يذهب بهم إلى النار بغير سؤال\n قال تعالى لنبيه عليه الصلاة والسلام: { فاصدع بما تؤمر }: فاجهر، وصرح به، وأنْفِذْه، من صدع بالحجة: إذا تكلم بها جهاراً\n أو: فَرِّقْ بما تؤمر به، بين الحق والباطل، وأصله: الشق والإبانة، و { ما }: مصدرية، أو موصولة، والعائد محذوف، أي: بما تؤمر به من الشرائع\n { وأعرضْ عن المشركين } فلا تلتفت إلى ما يقولون، ولا يمنعك ذلك من تبليغ الوحي والصدع به وإظهاره\n { إنا كفيناك المستهزئين } بك، وبما أنزلنا إليك، بأن أهلكنا كل واحد منهم بمصيبة تخصه، من غير سعي من النبي صلى الله عليه وسلم في ذلك\n\n\nوكانوا خمسة من أشراف قريش: الوليد بن المغيرة، والعاصي بن وائل، وعدي بن قيس، والأسود بن المطلب، والأسود بن يغوث، كانوا يبالغون في إيذاء النبي صلى الله عليه وسلم، والاستهزاء به، فقال جبريلُ للنبي صلى الله عليه وسلم: \" أمرتُ بأن أكفيكهم \" فأومأ إلى ساق الوليد فمرَّ بنبَّالٍ فتعلق بثوبه سهم، فلم ينعطف لأخذه، تعظماً، فأصاب عرقاً في عقبه فمات\n وقيل: خدش بأسفل رجله فمات من تلك الخدشة\n وأومأ إلى أخمص العاص فدخلت فيها شوكة، فانتفخت حتى صارت كالرحى، فمات\n وأشار إلى أنف الحارث فامتخط قيحاً فمات\n وأومأ إلى الأسود بن عبد يغوث، وهو قاعد في أصل شجرة، فجعل ينطح رأسه بالشجرة، ويضرب وجهه بالشوك حتى مات\n وقيل: استسقى بطنه فمات، ولعله جمع بينهما\n وأومأ إلى عيني الأسود بن المطلب فعمي\n وفي السيرة، بدل عدي بن قيس، الحارث بن الطلاطلة، وأن جبريل أشار إلى رأسه فامتخط قيحاً فقتله\n وقيل: هم الذين قُتلوا ببدر كأبي جهل، وعتبة بن ربيعة، وشيبة بن ربيعة، وأمية بن خلف، وعقبة بن أبي معيط\n والأول أرجح لأن الله تعالى كفاه أمرهم بمكة قبل الهجرة\n إلا أن يكون عبّر بالماضي عن المستقبل لتحققه، أي: إنا سنكفيك المستهزئين { الذين يجعلون مع الله إلهاً آخر } يعبدونه من دون الله { فسوف يعلمون } عاقبة أمرهم في الدارين\n ثم سلّى نبيه عن أذاهم فقال: { ولقد نعلمُ أنك يضيق صدرُك بما يقولون } في جانبنا من الشرك والطعن في القرآن، والاستهزاء بك، فلا تعبأ بهم، ولا تلتفت إليهم\n { فسِّبح بحمد ربك } أي: فنزه أنت ذاتنا وصفتنا، مكان مقالتهم فينا فإن مثلك منزهنا لا غير، { وكن من الساجدين } أي: المصلين، أو: فافرغ إلى الله فيما نابك وضاق منه صدرك بالتسبيح والتحميد\n { وكن من الساجدين } من المصلين، يكفك ويكشف الغم عنك، وعنه صلى الله عليه وسلم:\n\n \" أنه كان إذا حزبه أمر فزع إلى الصلاة \" \n\n، أو: فنزهه عما يقولون، حامداً له على أن هداك للحق، وكن من الساجدين له شكراً\n { واعبدْ ربك حتى يأتيك اليقين } أي: الموت، فإنه متيقن لحاقه، وليس اليقين من أسماء الموت، وإنما العلم به يقين، لا يمتري فيه، فسمي يقيناً تجوزاً\n أو: لما كان يحصل اليقين بعده بما كان غيباً سمي يقيناً\n والمعنى: فاعبده ما دمت حياً، ولا تُخِلّ بالعبادة لحظة\n وفي بعض الأحاديث عنه ـ عليه الصلاة والسلام ـ أنه قال:\n\n \" إن الله لم يُوح إليَّ أن أجمع المال، وأكون من التاجرين، وإنما أوحى إليَّ أن: سبح بحمد ربك وكن من الساجدين، واعبد ربك حتى يأتيك اليقين \" \n\nأو كما قال عليه الصلاة والسلام\n\n\nالإشارة: يقال للعابد، أو الزاهد: ولقد آتيناك سبعاً من المثاني والقرآن العظيم، تتمتع بحلاوته، وبالتجهد بتلاوته، ففيه كفايتك وغناك، فلا تمدن عينيك إلى ما متعنا به أصنافاً من أهل الدنيا، الراغبين فيها، المشتغلين بها عن عبادة خالقها\n قيل: لما نزلت هذه الآية قال صلى الله عليه وسلم:\n\n \" إياكم والنظر في أبناء الدنيا، فإنه يقسي القلب ويورث حب الدنيا، ولا تكثروا الجلوس مع أهل الثروة، فتميلوا لزينة الدنيا فوالله لو كانت الدنيا تزن عند الله جناح بعوضة ما سقي الكافر منها جرعة ماء \" \n\nوقال صلى الله عليه وسلم:\n\n \" من تواضع لغني لأجل غناه اقترب من النار مسيرة سنة، وذهب ثلثا دينه \" \n\nهذا إن تواضع بجسمه فقط، فإن تواضع بجسمه وقلبه ذهب دينه كله\n ويقال للعارف: ولقد آتيناك شهود المعاني، وغيبناك عن حس الأواني، حتى شهدت المتكلم بالسبع المثاني، فسمعت القرآن من مُنزله دون واسطة\n وذلك بالفناء، عن الوسائط، في شهود الموسوط، حتى يفنى عن نفسه في حال قراءته\n  ويقال له: لا تمدن عينيك إلى شهود الحس، ولا إلى ما متعنا به أصنافاً من أهل الحس، الواققين مع شهود الحس فإن ذلك يحجبك عن شهود المعاني القائمة بالأواني، بل المفنية للأواني عند سطوع المعاني\n ولا تحزن عليهم حيث رايتهم منهمكين في الحس فإن قيام عالم الحكمة لا يكون إلا بوجود أهل الحس، واخفض جناحك لمن اتبعك من المؤمنين بخصوصيتك، وقل: إني أنا النذير المبين من الاشتغال بالبطالة، والغفلة، حتى ينزل بأهلهما ما نزل على المقتسمين، الذين جعلوا القرآن عضين اجزاء متفرقة فما كان فيه مما يدل على التسهيل لجواز جمع الدنيا واحتكارها والاشتغال بها أخذوا به، وما كان فيه مما يدل على الزهد فيها، والانقطاع إلى الله عنها، والتجريد عن أسبابها، رفضوه\n فوربك لنسألنهم أجمعين عما كانوا يعملون\n فاصدع، أيها العارف الواعظ يما تُؤمر من الأمر بالزهد، والانقطاع إلى الله، ولرفض كل ما يشغل عن الله، ولا تراقب أحداً في ذات الله، وأعرض عن المشركين، الذين أشركوا في محبة الله سواه، وشهدوا الأكوان موجودة مع الله، وهي ثابتة بإثباته، ممحوة بأحدية ذاته، فلا وجود لها في الحقيقة مع الله\n فإن استهزؤوا بك، وصغروا أمرك، فسيكفيكهم الله\n فاشتغل بالله عنهم، فلا يضيق صدرك بما فيه يخوضون\n فسبح بحمد ربك أي: نزهه عن شهود السِّوى معه، حامداً الله على ما أولاك من نعمة توحيده\n وكن من الساجدين لله شكراً، وقياماً برسم العبودية، أو: كن من الساجدين بقلبك في حضرة القدس، حتى يأتيك اليقين\n  وفي الورتجبي، في قوله: ولقد نعلم أنك يضيقُ صدرك، قال: واسى الحقُّ حبيبَه بما سمع من أعدائه، وقال له: أنت بمرأىً منا، يضيق صدرك من لطافتك، بما يقول الجاهلون بنا في حقنا، مما لا يليق بتنزيهنا، فنزه أنت صفتنا مكان مقالتهم فينا، فإنَّ مثلك منزهنا لا غير، وكن من الساجدين حتى ترانا بوصف ما علمت منا، وتخرج من ضيق الصدر بما تشاهد من جمالنا، فإذا كنت تعايننا سقط عنك ضيق صدرك من جهة مقالتهم\nهـ\n وبالله التوفيق، وهو الهادي إلى سواء الطريق\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:3",
      "similarity": 0.028675843702126027
    },
    {
      "verse": "17:60",
      "similarity": 0.027530465989832813
    },
    {
      "verse": "96:1",
      "similarity": 0.02590018725396224
    },
    {
      "verse": "17:9",
      "similarity": 0.025450392940522613
    },
    {
      "verse": "55:2",
      "similarity": 0.02502496450029676
    }
  ]
}