{
  "chapter": "الحجر",
  "text": "واعبد ربك حتى ياتيك اليقين",
  "translations": [
    {
      "translation": "And go on worshipping your Lord till the certainty (of death) comes upon you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and worship your Lord until the last moment (of your life) that will most certainly come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship your Lord until you achieve the ultimate certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep worshipping your Lord, till death* comes to you. (* The certainty.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And worship your Lord until the certainty (i.e. death) comes to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And serve your Lord until there comes to you that which is certain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and serve thy Lord, until the Certain comes to thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And serve thy Lord till the Inevitable cometh unto thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and worship your Lord until what is certain [death] comes to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And worship thy Lord until there cometh unto thee the certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and worship your Lord until certainty comes to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And serve thy Lord until there come unto thee the Hour that is Certain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And worship your Lord until there comes unto you the certainty (i.e. death).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship your Lord till the certainty (death) comes to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And worship your Lord in order to attain certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And worship your Lord until there comes to you the certainty (death).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[15:99] and worship your Lord until Certainty — Death — comes to you. Meccan, except for the last three verses, which are Medinese; it consists of 128 verses, revealed after [sūrat] al-Kahf.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And serve your Lord) persevere in obeying your Lord (till the inevitable cometh unto thee) i.e. until death comes to you'. And of the surah in which the bees are mentioned, which is all Meccan, except for four verses which were revealed in Medina-(If ye punish, then punish with the like of that wherewith ye were afflicted. But if ye endure patiently, verily it is better for the patient.), (Endure thou patiently (0 Muhammad). Thine endurance 281 is only by (the help of) Allah. Grieve not for them, and be not in distress because of that which they devise.), (Then lo! thy Lord for those who become fugitives after they had been persecuted, and then fought and were steadfast lo! your Lord afterward is (for them) indeed Forgiving, Merciful), and (And those who became fugitives for the cause of Allah after they had been oppressed, We verily shall give them goodly lodging in the world, and surely the reward of the Hereafter is greater, if they but knew)-and which consists of 128 verses, 1,841 words and 6,707 letters: Surah 16: The Bees (al-Nahl) And of the surah in which the bees are mentioned, which is all Meccan, except for four verses which were revealed in Medina— {If ye punish, then punish with the like of that wherewith ye were afflicted. But if ye endure patiently, verily it is better for the patient.), (Endure thou patiently (O Muhammad). Thine endurance is only by (the help of) Allah. Grieve not for them, and be not in distress because of that which they devise.), (Then lo! thy Lord for those who become fugitives after they had been persecuted, and then fought and were steadfast lo! your Lord afterward is (for them) indeed Forgiving, Merciful), and (And those who became fugitives for the cause of Allah after they had been oppressed, We verily shall give them goodly lodging in the world, and surely the reward of the Hereafter is greater, if they but knew)— and which consists of 128 verses, 1,841 words and 6,707 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَتَّىٰ يَأْتِيَكَ ٱلْيَقِينُ } معناهُ المَوتُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱعْبُدْ رَبَّكَ } واجتهد في سلوك طريق المعرفة { حَتَّىٰ يَأْتِيَكَ ٱلْيَقِينُ } [الحجر: 99] ويحصل لك الكشف والشهود، ويرتفع عنك حجب الأنانية والوجود\n\n\n\n\nجعلنا الله من الموقنين المنكشفين بمنِّه وجوده\n\n\n\n\nخاتمة السورة\n\n\n\nعلك أيها السالك القاصد لسلوك طريق التوحيد - أنجح الله آمالك - أن تبتدئ أولاً بعدما هذبت ظاهرك بالشرائع، وباطنك بالجلاء عن الموانع، بذكر الله الواحد الأحد الصمد، المتصف بجميع أوصاف الكمال إلى أن يؤدي ذكرك إلى الفكر المورث للمجاهدة والانزعاج، والشوق والابتهاج أحياناً، وواظب عليها إلى أن يستوعب جميع أوقاتك وحالاتك، وحينئذٍ ظهرت ولاحت على قلبك مقدمات المحبة والمودة، والعشف المزعج المفني، وصرت عليها زماناً إلى أن اشتاق وتعطش قلبك إلى فنائك وانقهارك في محبوبك\n\n\nوفي تلك الحالة عرضت عليك الحيرة والحسرة، والوحشة والقلق والاضطراب، والخوف والرجاء، واللذة والألم، وصرت بين بين، وأين أين، وكيف كيف\n\n\n\n\nوبالجملة: كنت في تلوينٍ وتكوينٍ، وإطلاق وتقييدٍ، وما هي سكراتك عند موتك الإرادي، واضطراباتك دونها، وحينئذٍ لا يسع لك إلاَّ الرضا والتسليم، والتوكل والتفويض، إلى أن جذبك الحق، ووفقك بالتمكين والتسكين، وأطلقك عن التقييد والتعيين، وأفناك عنك، وأبقاك بذاته، وفزتَ بما فزت، وتكون حينئذٍ { مِّنَ ٱلسَّاجِدِينَ } [الحجر: 98] قد أتاك اليقين والتمكين، وأخلصك عن التردد والتلوين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}