{
  "chapter": "النحل",
  "text": "ادع الى سبيل ربك بالحكمة والموعظة الحسنة وجدلهم بالتى هى احسن ان ربك هو اعلم بمن ضل عن سبيله وهو اعلم بالمهتدين",
  "translations": [
    {
      "translation": "Call to the way of your Lord with wisdom and fair admonition, and argue with them in the kindest way. Your Lord knows best who is misguided from His way. And He knows best who are guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them to the path of your Lord with wisdom and words of good advice; and reason with them in the best way possible. Your Lord surely knows who strays from His path, and He knows those who are guided the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), call to the way of your Lord with wisdom and goodly exhortation, and reason with them in the best manner possible. Surely your Lord knows best who has strayed away from His path, and He also knows well those who are guided to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call (the pagans) to the path of your Lord through wisdom and good advice and argue with them in the best manner. God knows well about those who stray from His path and those who seek guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call towards the path of your Lord with sound planning and good advice, and debate with them in the best possible way; indeed your Lord well knows him who has strayed from His path, and He well knows the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Invite to the way of your Lord with wisdom and fair preaching, and argue with them with that which is best. Truly, your Lord best knows who has strayed from His path, and He best knows those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call to the way of your Lord with wisdom and goodly exhortation, and have disputations with them in the best manner; surely your Lord best knows those who go astray from His path, and He knows best those who follow the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call thou to the way of thy Lord with wisdom and good admonition, and dispute with them in the better way. Surely thy Lord knows very well those who have gone astray from His way, and He knows very well those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call unto the way of thy Lord with wisdom and fair exhortation, and reason with them in the better way. Lo! thy Lord is Best Aware of him who strayeth from His way, and He is Best Aware of those who go aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call to the way of your Lord with wisdom and fair exhortation and reason with them in a way that is best. Your Lord knows best those who have strayed away from His path, and He knows best those who are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call them unto the way of thy Lord with Wisdom and goodly exhortation, and argue with them with that which is best. Verily thy Lord! He is the Best Knower of him who hath strayed from His way, and He is the Best Knower of the guided ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Invite to the way of your Lord with wisdom and good advice and dispute with them in a manner that is best. Indeed your Lord knows best those who stray from His way, and He knows best those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Invite (all) to the Way of thy Lord with wisdom and beautiful preaching; and argue with them in ways that are best and most gracious: for thy Lord knoweth best, who have strayed from His Path, and who receive guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Invite (mankind, O Muhammad SAW) to the Way of your Lord (i.e. Islam) with wisdom (i.e. with the Divine Inspiration and the Quran) and fair preaching, and argue with them in a way that is better. Truly, your Lord knows best who has gone astray from His Path, and He is the Best Aware of those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call to the Path of your Lord with wisdom and fine admonition. Dispute with them in the best manner. Your Lord is well aware of those who have gone astray from His Path and He is well aware of those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Invite to the way of your Lord with wisdom and good advice, and debate with them in the most dignified manner. Your Lord is aware of those who stray from His path, and He is aware of those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Invite to the way of your Lord with wisdom and good instruction, and argue with them in a way that is best. Indeed, your Lord is most knowing of who has strayed from His way, and He is most knowing of who is [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:125] Call, mankind, O Muhammad (s), to the way of your Lord, [to] His religion, with wisdom, [with] the Qur’ān, and fair exhortation, its [the Qur’ān’s] fair exhortations, or with gentle words, and dispute with them by way of that which, that is, by way of that [manner of] disputation which, is best, such as calling [them] to God by way of His signs and calling [them] to His definitive arguments. Truly your Lord knows best, that is, He is fully knowledgeable [of], those who stray from His way and He knows best those who are guided, and will requite them — this was [revealed] before the command to fight [them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Call unto the way of thy Lord) the religion of your Lord (with wisdom) with the Qur'an (and fair exhortation) exhort them with the exhortations of the Qur'an, (and reason with them in the better way) with the Qur'an; it is also said that this means: by means of \"there is no god but Allah\". (Lo! thy Lord is best aware of him who strayeth from His way) from His religion, (and He is Best Aware of those who go aright) to His religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ادْع إلى سبيل ربّك } الخ\n أي: لتكن دعوتك منحصرة في هذه الوجوه الثلاثة لأن المدعو إما أن يكون خالياً عن الإنكار أو لا\n فإن كان خالياً لكونه في مقام الجهل البسيط غير معتقد لشيء\n فإما أن يكون مستعداً غير قاصر عن درك البرهان بل يكون برهاني الطباع أو لا\n فإن كان الأول فادعه بالحكمة وكلمه بالبرهان والحجة واهده إلى صراط التوحيد بالمعرفة\n وإن كان قاصر الاستعداد فادعه بالموعظة الحسنة والنصيحة البالغة من الإنذار والبشارة والوعد والوعيد والزجر والترهيب واللطف والترغيب\n وإن كان منكراً ذا جهل مركب واعتقاد باطل فجادله بالطريقة التي هي أحسن من إبطال معتقده بما يلزم من مذهبه بالرفق والمداراة على وجه يلوح له أنك تثبت الحق وتبطل الباطل لا غرض لك سواه\n { إنّ ربك هو أعلم بمن ضلّ عن سبيله } في الأزل لشقاوته الأصلية فلا ينجع فيه أحد هذه الطرق الثلاثة { وهو أعلم بالمهتدين } المستعدّين\n القابلين للهداية لصفاء الفطرة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفقال مخاطباً له خطاب تمكينٍ وتكريم: { ٱدْعُ } يا أكمل الرسل { إِلَىٰ سَبِيلِ رَبِّكَ } أي: إلى طريق توحيد مربيك الذي أرشدك إلى معارج عنايته\n وهداك إلى كمال كرامته كافة البرايا\n وعامة العباد { بِٱلْحِكْمَةِ } البالغة المكيفة لقلبهم عن صلابة التقليدات الراسخة الموروثة لهم عن أسلافهم\n المصفية نفوسهم عن الحمية الجاهلية المتمكنة فيها\n الخالية عن توهم السطوة والاستيلاء\n المثيرة لأنواع الأعراض النفسانية المترتبة فيها\n الخالية عن توهم السطوة والاستيلاء\n المثيرة لأنواع الأعراض النفسانية المترتبة على البشرية\n المزيلة لأنواع الشبه والتخيلات الناشئة من الأسباب والوسائل العادية المقنعة\n ملائمة للفطرة الأصلية التي فطر الناس عليها رجاء أن يتفطنوا\n ويتنبهوا بمقتضى جِبِلَّتهم وفطرتهم\n\n{ وَٱلْمَوْعِظَةِ ٱلْحَسَنَةِ } الموروثة لهم يقظاناً من سِنَة الغفلة\n ونوم النيسان\n المحصلة لهم شوقاً وسروراً إلى مُبدئهم ومُنشئهم\n الموغّبة لهم إلى اللذات الروحانية الدائمة الباقية المستمرة بلا ورود زوالٍ وانقطاعٍ\n المنفِّرة عما هم عليه من العوائق\n والعلائق العائقة من اللذات الوهمية المنقضية المنقطعة المورِثة لأنواع المحن والأحزان\n\n\n{ وَ } إن احتجت يا أكمل الرسل في دعوتهم إلى المجادلة معهم والمكالمة { جَٰدِلْهُم بِٱلَّتِي } أي: بالطريق التي { هِيَ أَحْسَنُ } الطرق وأسلمها\n وأعدلها من المقدمات المعتدلة الدالة على المساواة من كلا الجنابين برفق وتليين ومسكنة\n وإرخاء عنان خالٍ عن السطوة والتهور\n والغضب والتجبر\n وعن التمسخر والضحك والاستهزاء\n والتجهيل والتسفيه\n والتشنيع الشنيع\n كما يفعله عوام العلماء في محاوراتهم ومنظاراتهم\n إذ هي بعيدة عن الحكمة بمراحل\n مثيرة لأنواع الفتن والخصومات\n فلك ألاَّ تبالغ في إهدائهم وإيمانهم\n ولا تتشوش وتتحزن عن ضلالهم وطغيانهم\n إذ ما عليك إلاَّ تبليغ ما أُرسلت به\n\n\nوأما حصول الهداية والضلالة فيهم فأمر خارج عن وسعك وطاقتك { إِنَّ رَبَّكَ } المطلع على استعدادات عباده وقابلياتهم { هُوَ أَعْلَمُ بِمَن ضَلَّ عَن سَبِيلِهِ } الموصل إلى توحيده { وَهُوَ } أيضاً { أَعْلَمُ بِٱلْمُهْتَدِينَ } [النحل: 125] إذ قدَّر في سابق قضائه هدايتهم وضلالهم\n وكذا جميع ما جرى عليهم في شئونهم وتطوراتهم على التفصيل\n بحيث لا يشذّ عن حيطة علمه شيء منها\n\n\nوبعدما أمر سبحانه حبيبه بما أمر من آداب الدعوة\n وأخلاق الرسالة والنبوة\n ومراعاة حقوق الأنام\n والمداراة معهم\n أشار إلى المجازاة والمحاذاة\n والقصاص والعقوبات الواقعة في أمر الرسالة\n ووضع التشريع والتبليغ\n إذ هي مبنية على الأمر بترك المألوفات\n وترك العادات والاعتقادات\n وترك التخمينات والتقليدات\n لذلك لا يخلو عن المنازعات والمخاصمات المؤدية إلى أنواع الجنايات\n\n\nفقال سبحانه مخاطباً له ولمن تبعه من المؤمين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ادْعُ } يا محمد الناسَ { إلى سبيل ربك } إلى طريقه الموصل إليه، وهو: الإسلام والإيمان، والإحسان لمن قدر عليه، { بالحكمة } بسياسة النبوة، أو بالمقالة المحكمة، وهو الدليل الموضح للحق المزيح للشبهة، { والموعظة الحسنة } مواعظ القرآن ورقائقه، أو الخطابات المقنعة والعبر النافعة، { وجادلهم } أي: جادل معاندتهم { بالتي هي أحسن } بالطرق التي هي أحسن طرق المجادلة من الرفق واللين، وإيثار الوجه الأيسر، والمقدمات التي هي أشهر فإن ذلك أنفع في تليين لهبهم، وتبيين شغبهم، فالأولى: لدعوة خواص الأمة الطالبين للحق. والثانية: لدعوة عوامهم، والثالثة: لدعوة معاندهم. قال ابن جزي: الحكمة هي: الكلام الذي يظهر جوابه، والموعظة: هي: الترغيب والترهيب. والجدال هو: الرد على الخصم. وهذه الأشياء الثلاثة يسميها أهل العلوم العقلية بالبرهان والخطابة والجدل، وهذه الآية تقتضي مهادنة نُسخت بالسيف. وقيل: إن الدعاء بهذه الطريقة، من التلطف والرفق، غير منسوخ، وإنما السيف لمن لا تنفعه هذه الموعظة من الكفار، وأما العصاة فهي في حقهم مُحكمة إلى يوم القيامة باتفاق. هـ. { إِنَّ ربك هو أعلم بمن ضل عن سبيله وهو أعلم بالمهتدين } أي: إنما عليك البلاغ والدعوة. وأما حصول الهداية والضلال والمجازاة عليهما فليس من شأنك، بل الله أعلم بالضالين والمهتدين، وهو المجازي للجميع. الإشارة: الدعاء بالحكمة هو الدعاء بالهمة والحال، يكون من أهل الحق والتحقيق لأهل الصدق والتصديق. والدعاء بالموعظة الحسنة هو الدعاء بالمقال من طريق الترغيب والتشويق، يكون لأهل التردد في سلوك الطريق. والدعاء بالمجادلة الحسنة هو الدعاء بالوعظ والتذكير. وذِكْرُ بيانِ الطريق، وفضيلة علم التحقيق، يكون لأهل الإنكار إن وصلوا إلى أهل التحقيق. والحاصل: أن الدعاء بالحكمة لأهل المحبة والتصديق. والدعاء بالموعظة: لأهل التردد في الطريق. والدعاء بالمجادلة: لأهل الإنكار حتى يعرفوا الحق من الباطل. وإن شئت قلت: الدعاء بالحكمة هو للعارفين الكبار، والدعاء بالموعظة الحسنة هو لأهل الوعظ والتذكار من الصالحين الأبرار، والدعاء بالمجادلة الحسنة هو للعلماء الأخيار. وقد تجتمع في واحد إن جمع بين الظاهر والباطن. والله تعالى أعلم. ولما أمره بالدعوة العامة أمره بالصبر العام لأن الدعوة لا تنفك عن الأذى، فيحتاج صاحبها إلى صبر كبير.  ولما أمره بالدعوة العامة أمره بالصبر العام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:138",
      "similarity": 0.5124373139621529
    },
    {
      "verse": "22:68",
      "similarity": 0.4805957811472465
    },
    {
      "verse": "22:8",
      "similarity": 0.4708558731843725
    },
    {
      "verse": "4:63",
      "similarity": 0.44532563701027905
    },
    {
      "verse": "26:136",
      "similarity": 0.4441822320423504
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/16:125.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/16:125.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/16:125.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}