{
  "chapter": "النحل",
  "text": "ثم اوحينا اليك ان اتبع ملة ابرهيم حنيفا وما كان من المشركين",
  "translations": [
    {
      "translation": "Then We revealed to you: 'Follow the religion of Ibrahim, a man of pure natural belief. He was not one of the idolaters.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We commanded you to follow the way of Abraham the upright who was not of idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed to you: \"Follow the way of Abraham with exclusive devotion to Allah. He was not one of those who associated others with Allah in His Divinity.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent you, (Muhammad), a revelation that you should follow the tradition of Abraham, the upright one, who was not a pagan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then We sent you (O dear Prophet Mohammed – peace and blessings be upon him) the divine revelation that, “Follow the religion of Ibrahim, who was free from all falsehood; and was not a polytheist.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We have sent the revelation to you: \"Follow the religion of Ibrahim (he was a) Hanif, and he was not one of the idolators.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed to you: Follow the faith of Ibrahim, the upright one, and he was not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed to thee: 'Follow thou the creed of Abraham, a man of pure faith and no idolater.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And afterward We inspired thee (Muhammad, saying): Follow the religion of Abraham, as one by nature upright. He was not of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed Our will to you [O Muhammad], saying, \"Follow the religion of Abraham, the upright in faith; he was not one of the polytheists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Afterwards We revealed unto thee: follow thou the faith of Ibrahim the upright; and he was not of the associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter We revealed to you [saying], ‘Follow the creed of Abraham, a Hanif, who was not a polytheist.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We have taught thee the inspired (Message), \"Follow the ways of Abraham the True in Faith, and he joined not gods with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We have inspired you (O Muhammad SAW saying): \"Follow the religion of Ibrahim (Abraham) Hanifa (Islamic Monotheism - to worship none but Allah) and he was not of the Mushrikun (polytheists, idolaters, disbelievers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We revealed to you: 'Follow the Creed of Abraham, he of pure faith, he was not among the idolaters'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We inspired you: “Follow the religion of Abraham, the Monotheist. He was not an idol-worshiper.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed to you, [O Muhammad], to follow the religion of Abraham, inclining toward truth; and he was not of those who associate with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:123] Then We revealed to you, O Muhammad (s), [saying]: ‘Follow the creed, the religion, of Abraham, a hanīf, and he was not of the idolaters’: this [remark] is repeated in order to refute to the claim of the Jews and Christians that they follow his religion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And afterward We inspired thee (0 Muhammad)) We commanded you ((saying): Follow the religion of Abraham) adhere to the religion of Abraham, (as one by nature upright) surrendered to Allah. (He was not of the idolaters) he did not follow the religion of the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما أشرنا إليك يا أكمل الرسل كما استحقاقه، ولياقته للاقتدار والمتابعة { أَوْحَيْنَآ إِلَيْكَ } تكريماً لك وله { أَنِ ٱتَّبِعْ } في إيصال الدعوة، وتبليغ الرسالة، وإظهار الدين والأحكام، والرق والتليين مع الأنام، والحكم والتواضع معهم على أبلغ وجه وأكمل نظام { مِلَّةَ إِبْرَاهِيمَ } أي: خصلة جدك - عليك و عليه الصلاة والسلام - إذ كان { حَنِيفاً } مائلاً عن كلا طرفي الإفراط والتفريط في جميع الأطوار والأخلاق، والأفعال والأقوال { وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ } [النحل: 123] المستكبرين في خُلُقٍ من الأخلاق، ووصفٍ من الأوصاف، بل كان على مقتضى صرافة التوحيد، وعدالة اليقين والتحقيق؛ لذلك صار إماماً للموحدين إلى قيام الساة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}