{
  "chapter": "النحل",
  "text": "انما سلطنه على الذين يتولونه والذين هم به مشركون",
  "translations": [
    {
      "translation": "He only has authority over those who take him as a friend and associate others with Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His power is only over those who take him as their patron, and those who ascribe equals (to God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has power only over those who take him as their patron and who, under his influence, associate others with Allah in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only authority which he has is over his friends and those who consider things equal to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan’s power is only over those who make friendship with him and ascribe him as a partner (in worship).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His power is only over those who obey and follow him (Shaytan), and those who join partners with Him (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His authority is only over those who befriend him and those who associate others with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "his authority is over those who take him for their friend and ascribe associates to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His power is only over those who make a friend of him, and those who ascribe partners unto Him (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he has power only over those who are willing to follow him and associate others with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His authority is only over those who befriend him and those who are in respect of Him associators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His authority is only over those who befriend him and those who make him a partner [of Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His authority is over those only, who take him as patron and who join partners with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His power is only over those who obey and follow him (Satan), and those who join partners with Him (Allah) [i.e. those who are Mushrikun - polytheists - see Verse 6:121].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has authority over those who are guided by him, and those who ascribe associates to Him (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His authority is only over those who follow him, and those who associate others with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His authority is only over those who take him as an ally and those who through him associate others with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:100] His [Satan’s] power is only over those who choose him as [their] patron, by obeying him, and those who ascribe partners to Him, that is, to God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(His power) way and overpowering (is only over those who make a friend of him) those who obey him, (and those who ascribe partners unto Him (Allah)).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يكون للشيطان استيلاء على المؤمنين الموقنين؛ إذ هم يعادونه عداوةً شديدةً، ويخاصمون معه مخاصمة مستمرة { إِنَّمَا سُلْطَانُهُ } واستيلاؤه { عَلَىٰ ٱلَّذِينَ يَتَوَلَّوْنَهُ } ويحبونه ويقبلون قوله، ويسمعون غوايته، ويطيعون أمره { وَٱلَّذِينَ هُم بِهِ } أي: بسبب إغوائه وإغرائه ووسوسته { مُشْرِكُونَ } [النحل: 100] بالله الواحد الأحد، المنزه عن الشريك والولد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنما سلطانه } أي: تَسَلُّطُهُ { على الذين يتولونه }: يحبونه ويطيعونه، { والذين هم به } أي: بالله، أو: بسبب الشيطان، { مشركون } حيث حملهم على الشرك فأطاعوه\n الإشارة: الاستعاذة الحقيقية من الشيطان هي: الغيبة عنه في ذكر الله أو شهوده، فلا ينجح في دفع الشيطان إلا الفرار منه إلى الرحمن\n قال تعالى:\n\n[الذَّاريات: 50]\n فإن الشيطان كالكلب، كلما اشتغلت بدفعه قوي نبحه عليك، فإما أن يخرق الثياب، أو يقطع الإهاب، فإذا رفعت أمره إلى مولاه كفه عنك\n وقد قال شيخ شيوخنا سيدي علي الجمل رضي الله عنه: عداوة العدو حقًا هو اشتغالك بمحبة الحبيب حقا، وأما إذا اشتغلت بعداوة العدو، فاتتك محبة الحبيب، ونال مراده منك\n هـ\n فالعاقل هو الذي يشتغل بذكر الله باللسان، ثم بالقلب، ثم بالروح، ثم بالسر، فحينئذ يذوب الشيطان ولا يبقى له أثر قط، أو يذعن له ويسلم شيطانه، فإنما حركه عليك ليوحشك إليه\n وفي الحكم: \" إذا علمت أن الشيطان لا يغفل عنك، فلا تغفل أنت عمن ناصيتك بيده \"\n فإذا تعلقْتَ بالقوي المتين، هرب عنك الشيطان اللعين\n وسيأتي مزيد كلام إن شاء الله عند قوله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:35",
      "similarity": 0.6708280519569396
    },
    {
      "verse": "37:156",
      "similarity": 0.6627772872448208
    },
    {
      "verse": "11:96",
      "similarity": 0.6259800008865437
    },
    {
      "verse": "40:23",
      "similarity": 0.6259800008865437
    },
    {
      "verse": "44:19",
      "similarity": 0.6147509716971395
    }
  ]
}