{
  "chapter": "النحل",
  "text": "ثم ان ربك للذين هاجروا۟ منۢ بعد ما فتنوا۟ ثم جهدوا۟ وصبروا۟ ان ربك منۢ بعدها لغفور رحيم",
  "translations": [
    {
      "translation": "But to those who made hijra after they were persecuted and then did jihad and remained steadfast, to them your Lord is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (to) those who were victimised and left their homes and then fought and endured patiently, your Lord will surely be forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely your Lord will be Most Forgiving and Most Merciful towards those who left their homes after they were persecuted, and who thereafter struggled hard and remained constant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who left their homes for the cause of God after they had been persecuted, strove hard for His cause and exercised patience should know (even though they had verbally renounced their faith) that your Lord is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then indeed your Lord – for those who migrated after they had been oppressed, and then fought and remained patient – indeed your Lord is then, surely, Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, verily, your Lord for those who emigrated after they were put to trials and then performed Jihad, and were patient, - after this, your Lord is indeed Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet surely your Lord, with respect to those who fly after they are persecuted, then they struggle hard and are patient, most surely your Lord after that is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, surely thy Lord -- unto those who have emigrated after persecution, then struggled and were patient -- surely thy Lord thereafter is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then lo! thy Lord - for those who became fugitives after they had been persecuted, and then fought and were steadfast - lo! thy Lord afterward is (for them) indeed Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, your Lord will be forgiving and merciful towards those who migrated after persecution and strove hard for the cause of God and remained steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, verily, thy Lord unto those who have emigrated after they had been tempted and have thereafter striven hard and endured, verily thy Lord thereafter is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter your Lord will indeed be forgiving and merciful to those who migrated after they were persecuted, waged jihad and remained steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But verily thy Lord,- to those who leave their homes after trials and persecutions,- and who thereafter strive and fight for the faith and patiently persevere,- Thy Lord, after all this is oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, verily! Your Lord for those who emigrated after they had been put to trials and thereafter strove hard and fought (for the Cause of Allah) and were patient, verily, your Lord afterward is, Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then indeed your Lord? to those who emigrated, after they were persecuted, and then strove and were patient, surely, your Lord is thereafter Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But then your Lord—for those who emigrated after being persecuted, then struggled and persevered—your Lord thereafter is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, indeed your Lord, to those who emigrated after they had been compelled [to renounce their religion] and thereafter fought [for the cause of Allah] and were patient - indeed, your Lord, after that, is Forgiving and Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:110] Then indeed your Lord — as for those who emigrated, to Medina, after they were persecuted, [after] they   were tortured and [compelled to] pronounce [words of] unbelief (a variant reading [for futinū, ‘they were persecuted’] has fatanū, in other words, ‘[after] they disbelieved’, or ‘[after] they turned people away from belief’), and then struggled and were patient, in obedience — indeed your Lord after that, that is, [after] such a trial, is Forgiving, of them, Merciful, to them (the predicate of the first inna, ‘indeed’, is indicated by the predicate of the second one).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then lo! thy Lord) O Muhammad (for those who do evil in ignorance) intentionally even if they are ignorant of committing it (and afterward repent) after committing such an evil (and amend) their work between themselves and their Lord-(lo! (for them) thy Lord is afterward) after repentance (indeed Forgiving, Merciful) towards them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما سمعت أحوال أولئك المقهورين المطرودين { إِنَّ رَبَّكَ } الذي ربَّاك بأنواع الكرامات، وأوصلك إلى أعلى المقامات يجزي خير الجزاء تفضلاً وإحساناً { لِلَّذِينَ هَاجَرُواْ } عن بقعة الإمكان حين كوشفوا بما فيها من الخذلان والخسران، وأنواع الرذائل والنقصان، وذلك { مِن بَعْدِ مَا فُتِنُواْ } بأنواع الفتن والمحن باستيلاء جنود الأمارة بالسوء عليهم { ثُمَّ جَاهَدُواْ } معها بترك مألوفاتها، وقطع تعلقاتها، وصرفها عن مشتهياتها ومستلذاتها { وَصَبَرُواْ } على متاعب الرياضات، ومشاق المجاهدات إلى أن صارت أماراتهم مطمئنةً راضيةً مرضيةً، ثمَّ بعدما قطعوا مسالك السلوك، ومنازل التلوين والتزلزل { إِنَّ رَبَّكَ } المفضل المحسن إليك يا أكمل الرسل، وإلى من تبعك من خيار المؤمنين { مِن بَعْدِهَا } أي: بعد المجاهدات والرياضيات { لَغَفُورٌ } يسترُ أنانيتهم، ويغنيهم عن هوياتهم مطلقاً { رَّحِيمٌ } [النحل: 110] لهم، يمكنّهم في مقام الرضا والتسليم مطمئنين مرضيين\n\n\n\n\nهب لنا من لدنك رحمةً با ذا القوة المتين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:75",
      "similarity": 0.6424459808424381
    },
    {
      "verse": "2:218",
      "similarity": 0.6366216905543632
    },
    {
      "verse": "8:74",
      "similarity": 0.5396045273498594
    },
    {
      "verse": "25:30",
      "similarity": 0.43390578749216685
    },
    {
      "verse": "9:20",
      "similarity": 0.43098637638102755
    }
  ]
}