{
  "chapter": "النحل",
  "text": "ثم اوحينا اليك ان اتبع ملة ابرهيم حنيفا وما كان من المشركين",
  "translations": [
    {
      "translation": "Then We revealed to you: 'Follow the religion of Ibrahim, a man of pure natural belief. He was not one of the idolaters.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We commanded you to follow the way of Abraham the upright who was not of idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed to you: \"Follow the way of Abraham with exclusive devotion to Allah. He was not one of those who associated others with Allah in His Divinity.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent you, (Muhammad), a revelation that you should follow the tradition of Abraham, the upright one, who was not a pagan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then We sent you (O dear Prophet Mohammed – peace and blessings be upon him) the divine revelation that, “Follow the religion of Ibrahim, who was free from all falsehood; and was not a polytheist.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We have sent the revelation to you: \"Follow the religion of Ibrahim (he was a) Hanif, and he was not one of the idolators.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed to you: Follow the faith of Ibrahim, the upright one, and he was not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed to thee: 'Follow thou the creed of Abraham, a man of pure faith and no idolater.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And afterward We inspired thee (Muhammad, saying): Follow the religion of Abraham, as one by nature upright. He was not of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed Our will to you [O Muhammad], saying, \"Follow the religion of Abraham, the upright in faith; he was not one of the polytheists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Afterwards We revealed unto thee: follow thou the faith of Ibrahim the upright; and he was not of the associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter We revealed to you [saying], ‘Follow the creed of Abraham, a Hanif, who was not a polytheist.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We have taught thee the inspired (Message), \"Follow the ways of Abraham the True in Faith, and he joined not gods with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We have inspired you (O Muhammad SAW saying): \"Follow the religion of Ibrahim (Abraham) Hanifa (Islamic Monotheism - to worship none but Allah) and he was not of the Mushrikun (polytheists, idolaters, disbelievers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We revealed to you: 'Follow the Creed of Abraham, he of pure faith, he was not among the idolaters'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We inspired you: “Follow the religion of Abraham, the Monotheist. He was not an idol-worshiper.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed to you, [O Muhammad], to follow the religion of Abraham, inclining toward truth; and he was not of those who associate with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:123] Then We revealed to you, O Muhammad (s), [saying]: ‘Follow the creed, the religion, of Abraham, a hanīf, and he was not of the idolaters’: this [remark] is repeated in order to refute to the claim of the Jews and Christians that they follow his religion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ ثُمّ } للترتيب الرتبي المشير إلى أن مضمون الجملة المعطوفة متباعد في رتبة الرفعة على مضمون ما قبلها تنويهاً جليلاً بشأن النبي صلى الله عليه وسلم وبشريعة الإسلام ، وزيادة في التّنويه بإبراهيم عليه السلام ، أي جعلناك متّبعاً ملّة إبراهيم ، وذلك أجلّ ما أوليناكما من الكرامة . وقد بيّنت آنفاً أن هذه الجملة هي المقصود ، وأن جملة { إن إبراهيم كان أمة } \\[ سورة النحل : 120 \\] الخ . تمهيد لها .وزيد { أوحينا إليك } للتّنبيه على أن اتّباع محمد ملّة إبراهيم كان بوحي من الله وإرشاد صادق ، تعريضاً بأن الذين زعموا اتباعهم ملّة إبراهيم من العرب من قبلُ قد أخطأوها بشبهة مثل أميّةَ بن أبي الصَلت ، وزيد بن عمرو بن نُفيل ، أو بغير شبهة مثل مزاعم قريش في دينهم .و { أن } تفسيرية لفعل { أوحينا } لأن فيه معنى القول دون حروفه ، فاحتيج إلى تفسيره بحرف التفسير .والاتّباع : اقتفاء السير على سَير آخر . وهو هنا مستعار للعمل بمثل عمل الآخر .وانتصب { حنيفاً } على الحال من { إبراهيم } فيكون زيادة تأكيد لمماثله قبله أو حالاً من ضمير { إليك } أو من ضمير { اتبع } ، أي كن يا محمد حنيفاً كما كان إبراهيم حنيفاً . ولذلك قال النبي صلى الله عليه وسلم « بعثت بالحنيفية السمحة » . وتفسير فعل { أوحينا } بجملة { أن اتبع ملة إبراهيم } تفسير بكلام جامع لما أوحَى الله به إلى محمد عليه الصلاة والسلام من شرائع الإسلام مع الإعلام بأنها مقامة على أصول ملّة إبراهيم . وليس المراد أوحينا إليك كلمة { اتبع ملة إبراهيم حنيفاً } لأن النبي صلى الله عليه وسلم لا يعلم تفاصيل ملّة إبراهيم ، فتعيّن أن المراد أن الموحى به إليه منبجس من شريعة إبراهيم عليه السلام .وقوله : { وما كان من المشركين } هو مما أوحاه الله إلى محمد صلى الله عليه وسلم المحكي بقوله : { ثم أوحينا إليك } ، وهو عطف على { حنيفاً } على كلا الوجهين في صاحب ذلك الحال ، فعلى الوجه الأول يكون الحال زيادة تأكيد لقوله قبله : { ولم يك من المشركين } \\[ سورة النحل : 120 \\] ، وعلى الوجه الثاني يكون تنزيهاً لشريعة الإسلام المتبعَة لملّة إبراهيم من أن يخالطها شيء من الشرك .ونُفي كونه من المشركين هنا بحرف ما } النافية لأن { ما } إذا نفت فعل { كان } أفادت قوّة النفي ومباعدة المنفي . وحسبك أنها يبنى عليها الجحود في نحو : ما كان ليفعل كذا .فحصل من قوله السابق { ولم يك من المشركين } \\[ النحل : 120 \\] ومن قوله هنا : { وما كان من المشركين } ثلاث فوائد : نفي الإشراك عن إبراهيم في جميع أزمنة الماضي ، وتجدّد نفي الإشراك تجدّداً مستمرّاً ، وبراءته من الإشراك براءة تامة .وقد علم من هذا أن دين الإسلام منزّه عن أن تتعلّق به شوائب الإشراك لأنه جاء كما جاء إبراهيم معلناً توحيداً لله بالإلهية ومجتثّاً لوشيج الشرك .والشرائعُ الإلهية كلها وإن كانت تحذّر من الإشراك فقد امتاز القرآن من بينها بسدّ المنافذ التي يتسلّل منها الإشراك بصراحة أقواله وفصاحة بيانه ، وأنه لم يترك في ذلك كلاماً متشابهاً كما قد يوجد في بعض الكتب الأخرى ، مثل ما جاء في التوراة من وصف اليهود بأبناء الله ، وما في الأناجيل من موهم بنوّة عيسى عليه السلام لله سبحانه عما يصفون .وقد أشار إلى هذا المعنى قول النبي صلى الله عليه وسلم في خطبة حجّة الوداع : « أيها الناس إن الشيطان قد يئس أن يُعبد في أرضكم هذه ( أي أرض الإسلام ) أبداً ، ولكنه قد رضي أن يُطاع فيما سوى ذلك مما تَحْقِرون من أعمالكم فاحذروه على دينكم » . ومعنى اتّباع محمد ملّة إبراهيم الواقع في كثير من آيات القرآن أن دين الإسلام بُني على أصول ملّة إبراهيم ، وهي أصول الفطرة ، والتوسّط بين الشدّة واللّين ، كما قال تعالى : { وما جعل عليكم في الدين من حرج ملّة أبيكم إبراهيم } \\[ سورة الحج : 78 \\].وفي قضية أمر إبراهيم بذبح ولده عليهما السلام ، ثم فدائه بذبح شاة رمز إلى الانتقال من شدّة الأديان الأخرى في قرابينها إلى سماحة دين الله الحنيف في القربان بالحيوان دون الآدمي . ولذلك قال تعالى : { وناديناه أن يا إبراهيم قد صدقت الرؤيا إنّا كذلك نجزي المحسنين إن هذا لهو البلاء المبين وفديناه بذبح عظيم } \\[ سورة الصافات : 107 \\].فالشريعة التي تبنى تفاصيلها وتفاريعها على أصول شريعة تعتبر كأنها تلك الشريعة . ولذلك قال المحققون من علمائنا : إن الحكم الثابت بالقياس في الإسلام يصح أن يقال إنه دين الله وإن كان لا يصح أن يقال : قالَه الله . وليس المراد أن جميع ما جاء به الإسلام قد جاء به إبراهيم عليه السلام إذ لا يخطر ذلك بالبال ، فإن الإسلام شريعة قانونية سلطانية ، وشرع إبراهيم شريعة قبائلية خاصة بقوم ، ولا أن المراد أن الله أمر النبي محمداً باتّباع ملّة إبراهيم ابتداءً قبل أن يوحي إليه بشرائع دين الإسلام ، لأن ذلك وإن كان صحيحاً من جهة المعنى وتحتمله ألفاظ الآية لكنه لا يستقيم إذ لم يرد في شيء من التشريع الإسلامي ما يشير إلى أنه نَسْخ لما كان عليه النبي من قبلُ .فاتّباع النبي ملّة إبراهيم كان بالقول والعمل في أصول الشريعة من إثبات التوحيد والمحاجّة له واتّباع ما تقتضيه الفطرة . وفي فروعها مما أوحى الله إليه من الحنيفية مثل الختان وخصال الفطرة والإحسان .\n\n",
      "translations": [
        {
          "translation": "(And afterward We inspired thee (0 Muhammad)) We commanded you ((saying): Follow the religion of Abraham) adhere to the religion of Abraham, (as one by nature upright) surrendered to Allah. (He was not of the idolaters) he did not follow the religion of the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ُ { ثم أوحينا إليك } أي: بعد هذه الكرامات والحسنات التي أعطيناه إياها في الدارين شرّفناه وكرمناه بأمرنا باتباعك إياه { أن اتّبع ملّة إبراهيم } في التوحيد وأصول الدين التي لا تتغير في الشرائع كأمر المبدأ والمعاد والحشر والجزاء وأمثالها\n لا في فروع الشريعة وأوضاعها وأحكامها\n فإنها تتغير بحسب المصالح واختلاف الأزمنة والطبائع وما عليه أحوال الناس من العادات والخلائق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما أشرنا إليك يا أكمل الرسل كما استحقاقه\n ولياقته للاقتدار والمتابعة { أَوْحَيْنَآ إِلَيْكَ } تكريماً لك وله { أَنِ ٱتَّبِعْ } في إيصال الدعوة\n وتبليغ الرسالة\n وإظهار الدين والأحكام\n والرق والتليين مع الأنام\n والحكم والتواضع معهم على أبلغ وجه وأكمل نظام { مِلَّةَ إِبْرَاهِيمَ } أي: خصلة جدك - عليك و عليه الصلاة والسلام - إذ كان { حَنِيفاً } مائلاً عن كلا طرفي الإفراط والتفريط في جميع الأطوار والأخلاق\n والأفعال والأقوال { وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ } [النحل: 123] المستكبرين في خُلُقٍ من الأخلاق\n ووصفٍ من الأوصاف\n بل كان على مقتضى صرافة التوحيد\n وعدالة اليقين والتحقيق\n لذلك صار إماماً للموحدين إلى قيام الساة\n\n\nثمَّ قال سبحانه تعييراً على المشركين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم أوحينا إليك } يا محمد { أن اتبعْ ملةَ إِبراهيم } دينه ومنهاجه في التوحيد\n والدعوة إليه بالرفق\n والمجادلة بالتي هي أحسن\n كل واحد بحسب فهمه\n وكان { حنيفًا } مائلاً عما سوى الله\n { وما كان من المشركين } \n بل كان قدوة الموحدين\n كرره ردًا على اليهود والنصارى والمشركين في زعمهم أنهم على دينه مع إشراكهم\n والله تعالى أعلم\n الإشارة: كل من تمسك بطاعة الله ظاهرًا\n أو مال عما سوى الله باطنًا\n وشكر الله دائمًا\n ودعا الناس إلى هذا الأمر العظيم: كان وليًا إبراهيميًا\n محمديًا\n خليلاً حبيبًا\n مقربًا\n قد اجتباه الحق تعالى إلى حضرته\n وهداه إلى صراط مستقيم\n وعاش في الدنيا سعيدًا\n ومات شهيدًا\n وألحق بالصالحين\n جعلنا الله منهم بمنِّه وكرمه\n ولما ادعت اليهود أنهم على ملة إبراهيم دون غيرهم ردَّ الله عليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:95",
      "similarity": 0.9243621413456967
    },
    {
      "verse": "6:161",
      "similarity": 0.838061494259961
    },
    {
      "verse": "2:135",
      "similarity": 0.7992534147942238
    },
    {
      "verse": "4:125",
      "similarity": 0.6921896600862438
    },
    {
      "verse": "3:67",
      "similarity": 0.5952476801053428
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016123.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016123.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:123.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}