{
  "chapter": "النحل",
  "text": "ولقد جاءهم رسول منهم فكذبوه فاخذهم العذاب وهم ظلمون",
  "translations": [
    {
      "translation": "A Messenger from among them came to them but they denied him. So the punishment seized them and they were wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An apostle came to them who was one of them, but they called him a liar. Then they were seized by torment for they were sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most certainly a Messenger came to them from among them; but they rejected him, calling him a liar. Therefore chastisement seized them while they engaged in wrong-doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Messenger from their own people came to them and they called him a liar. Torment struck them because of their injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed a Noble Messenger came to them from among them – in response they denied him, and therefore the punishment seized them, and they were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has come to them a Messenger from among themselves, but they denied him, so the torment seized them while they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly there came to them an Apostle from among them, but they rejected him, so the punishment overtook them while they were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There came indeed to them a Messenger from amongst them, but they cried him lies; so they were seized by the chastisement while they were evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily there had come unto them a messenger from among them, but they had denied him, and so the torment seized them while they were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There came to them a messenger from among themselves, but they rejected him as false, so punishment overtook them, as they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly there came to them an apostle from among them, but they belied him, wherefore the torment took hold of them while yet they were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly there had come to them an apostle from among themselves, but they impugned him. So the punishment seized them while they were doing wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there came to them a Messenger from among themselves, but they falsely rejected him; so the Wrath seized them even in the midst of their iniquities.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, there had come unto them a Messenger (Muhammad SAW) from among themselves, but they denied him, so the torment overtook them while they were Zalimun (polytheists and wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Messenger from their own was sent to them, but they belied him. So while they were harmdoers they were seized by the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A messenger from among them had come to them, but they denounced him, so the punishment seized them in the midst of their wrongdoing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there had certainly come to them a Messenger from among themselves, but they denied him; so punishment overtook them while they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:113] And verily there came to them a messenger from among them, Muhammad (s), but they denied him, and so the chastisement, of hunger and fear, seized them while they were evildoers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily there had come unto them a messenger) Muhammad (pbuh) (from among them) a Qurayshite Arab like themselves, (but they had denied him) they denied the revelation he brought to them, (and So the torment seized them) Allah's torment in the form of hunger, killing and being taken captive seized them (while they were wrong-doers) disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يأخذهم، ولا يذيقهم { لَقَدْ جَآءَهُمْ رَسُولٌ مِّنْهُمْ } أفضل وأكمل من جميع الرسل مع كتابٍ أكمل وأشمل من سائر الكتب { فَكَذَّبُوهُ } أشد تكذيبٍ، وأنكروه أقبح إنكارٍ { فَأَخَذَهُمُ ٱلْعَذَابُ } العاجل، وهو الجدب الواقع بينهم، أو وقعة بدر { وَ } الحال أنهم في تلك الحالة { هُمْ ظَالِمُونَ } [النحل: 113] خارجون على الله، وعلى رسوله، والعذابُ الآجل سيأخذهم في النشأة الأخرى بأضعاف ما في النشأة الأولى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:92",
      "similarity": 0.3748354207498553
    },
    {
      "verse": "35:4",
      "similarity": 0.3667003428468351
    },
    {
      "verse": "26:158",
      "similarity": 0.3619661277495675
    },
    {
      "verse": "63:1",
      "similarity": 0.35605587893316426
    },
    {
      "verse": "20:48",
      "similarity": 0.3523682322948817
    }
  ]
}