{
  "chapter": "النحل",
  "text": "وان تعدوا۟ نعمة الله لا تحصوها ان الله لغفور رحيم",
  "translations": [
    {
      "translation": "If you tried to number Allah's blessings, you could never count them. Allah is Ever-Forgiving, Most",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you count the favours of God you will not be able to calculate. Assuredly God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For, were you to count the favours of Allah, you will not be able to count them. Surely Allah is Ever Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you wanted to count up all of God's blessings, you would not be able to. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you enumerate the favours of Allah, you will never be able to count them; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you would try to count the favors of Allah, you would never be able to count them. Truly, Allah is Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you would count Allah's favors, you will not be able to number them; most surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you count God's blessing, you will never number it; surely God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye would count the favour of Allah ye cannot reckon it. Lo! Allah is indeed Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you tried to count God's blessings, you would never be able to number them. God is ever forgiving and most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye would count the favours of Allah ye could not compute them verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you enumerate Allah’s blessings, you will not be able to count them. Indeed Allah is all-forgiving, all-merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye would count up the favours of Allah, never would ye be able to number them: for Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you would count the graces of Allah, never could you be able to count them. Truly! Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you count the favors of Allah, you could not number them. Indeed, Allah is Forgiving and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you tried to enumerate the favors of God, you will not be able to count them. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you should count the favors of Allah, you could not enumerate them. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:18] And if you were to count God’s grace you could never reckon it, number it precisely, let alone be able to give thanks for it. Indeed God is Forgiving, Merciful, since He bestows graces upon you despite your shortcomings and your [acts of] disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if ye would count the favour of Allah ye cannot reckon it) it is also said that this means: you will not be able to give thanks to it. (Lo! Allah is indeed Forgiving) He pardons, (Merciful) towards whoever repents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنكم { إِن تَعُدُّواْ نِعْمَةَ ٱللَّهِ } الفائضة عليكم\n وآلاءه الواصلة إليكم { لاَ تُحْصُوهَآ } لكثرتها ووفورها\n ومع ذلك أشركتم معه غيره\n وكفرتم بنعمه\n مع أن المناسب لكم الرجوع إليه\n والإنابة نحوه { إِنَّ ٱللَّهَ } المطلع لضمائر عباده { لَغَفُورٌ } لمن تاب وآمن\n وعمل صالحاً { رَّحِيمٌ } [النحل: 18] يقبل توبتهم\n ويتجاوز عن سيئاتهم لو أخلصوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و \" جَرَم \": فعل، بمعنى وجب، أو حق، و { أن الله }: فاعل بجَرَم\n يقول الحقّ جلّ جلاله: { أفمن يَخلُقُ } كل شيء، ويَقدر على كل شيء، { كمن لا يَخْلُق } شيئًا، ولا يقدر على شيء، بل هو أعجز من كل شيء؟ وهو إنكار على من أشرك مع الله غيره، بعد إقامة الدلائل المتكاثرة على كمال قدرته، وباهر حكمته، بذكر ما تقدم من أنواع المخلوقات وبدائع المصنوعات، وكان حق الكلام: أفمن لا يخلق كمن يخلق، لكنه عكس تنبيهًا على أنهم، بالإشراك بالله، جعلوه من جنس المخلوقات العجزة، شبيهًا بها\n والمراد بمن لا يخلق، كل ما عُبد من دون الله، وغلب أولي العلم منهم، فعبَّر بمن، أو يريد الأصنام، وأجراها مجرى أولي العلم لأنهم سموها آلهة، ومن حق الإله أن يعلم، أو للمشاكلة بينه وبين من يخلق\n { أفلا تذكَّرون } فتعرفوا فساد ذلك فإنه لظهوره كالحاصل للعقل الذي يحضر عنده بأدنى تذكر والتفات\n ولما ذكر أنواعًا من المخلوقات على وجه الاستدلال على وحدانيته - وفي ضمنها: تعداد النِعَم على خلقه - أعقبها بقوله: { وإن تعدوا نِعمةَ الله لا تُحصوها } أي: لا تطيقوا عدها، فضلاً أن تطيقوا القيام بشكرها\n ثم أعقبها بقوله: { إنَّ الله لغفور رحيم } تنبيهًا على أن العبد في محل التقصير، لولا أن الله يغفر له تقصيره في أداء شكر نعمه، ويرحمه ببقائها مع تقصيره في شكرها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:94",
      "similarity": 0.9172171960680418
    },
    {
      "verse": "14:34",
      "similarity": 0.8849696154796266
    },
    {
      "verse": "78:29",
      "similarity": 0.7966234857889637
    },
    {
      "verse": "72:28",
      "similarity": 0.6305085484721932
    },
    {
      "verse": "58:6",
      "similarity": 0.612839981671556
    }
  ]
}