{
  "chapter": "النحل",
  "text": "ان ابرهيم كان امة قانتا لله حنيفا ولم يك من المشركين",
  "translations": [
    {
      "translation": "Abraham was certainly a model of faith, obedient to God and upright, and not one of idolaters,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Abraham was a whole community by himself, obedient to Allah, exclusively devoted to Him. And he was never one of those who associated others with Allah in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was, certainly, an obedient and upright person. He was not a pagan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Ibrahim was a leader, obedient to Allah, and detached from all; and he was not a polytheist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Ibrahim was (himself) an Ummah, obedient to Allah, a Hanif (monotheist), and he was not one of the idolators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Ibrahim was an exemplar, obedient to Allah, upright, and he was not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, Abraham was a nation obedient unto God, a man of pure faith and no idolater,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Abraham was a nation obedient to Allah, by nature upright, and he was not of the idolaters;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was a community in himself devoted to God and true in faith, He was not one of the polytheists;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Ibrahim was a pattern, devout unto Allah, upright, and, not of the associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Abraham was a nation [all by himself], obedient to Allah, a Hanif, and he was not a polytheist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was indeed a model, devoutly obedient to Allah, (and) true in Faith, and he joined not gods with Allah:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Ibrahim (Abraham) was an Ummah (a leader having all the good righteous qualities), or a nation, obedient to Allah, Hanifa (i.e. to worship none but Allah), and he was not one of those who were Al-Mushrikun (polytheists, idolaters, disbelievers in the Oneness of Allah, and those who joined partners with Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was (equal to) a nation, obedient to Allah, of pure faith and was not among the idolaters,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was an exemplary leader, devoted to God, a monotheist, and was not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Abraham was a [comprehensive] leader, devoutly obedient to Allah, inclining toward truth, and he was not of those who associate others with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:120] Truly Abraham was a community, a leader (imām), a [good] example, comprising [in his character] all the good traits, obedient to God, a hanīf, inclining towards the upright religion, and he was not of the idolaters;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Abraham was a nation) a leader who was emulated (obedient to Allah, by nature upright) sincerely surrendered to Allah, (and he was not of the idolaters) he did not follow the idolaters in their religion;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً قَانِتاً } معناهُ مُعلمٌ للخَيرِ\n قالَ زيدُ بن علي عليهما السّلامُ: كان مُؤمناً وحدهُ مُطيعاً لله، والنّاسُ كُلُّهُم كُفارٌ\n وقانتٌ: معناهُ إِمامٌ مُطيعٌ\n\n\n\n\nوقوله تعالى: { حَنِيفاً } مسلماً\n فالحَنِيفُ: الذي يَختتنُ ويَحجُ البيتَ\n وقالَ الحَنيفُ: المُخلصُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن إبراهيم كان أمّة } قد مرّ أن كل نبي يبعث في قوم يكون كماله شاملاً لجميع كمالات أمته وغاية لا يمكن لأمّته الوصول إلى رتبة إلا وهى دونه، فهو مجموع كمالات قومه ولا يصل إليهم الكمال في صفة من صفات الخير والسعادة إلا بواسطته بل وجوداتهم فائضة من وجوده فهو وحده أمة لاجتماعهم بالحقيقة في ذاته، ولهذا قال عليه الصلاة والسلام:\n\n \" لو وزنت بأمتي لرجحت بهم \" \n\n{ قانتاً } لله مطيعاً له، منقاداً بحيث لا يتحرك منه شعرة إلا بأمره لاستيلاء سلطان التوحيد عليه ومحو صفاته بصفاته، واتحاده بذاته، ولهذا سمي خليل الله لمخالة الحق إياه في شهوده\n فخلّته عبارة عن مزج بقية من ذاته تؤذن بالإثنينية أما ترى رسول الله صلى الله عليه وسلم لما لم يبق منه شيء من بقيته سمي حبيب الله فمحو صفاته في صفات الحق بالكلية وبقاء أثر من ذاته دون العين قنوته لله وإلا كان قانتاً بالله لا لله، كما قال لمحمد عليه الصلاة والسلام:\n\n[النحل، الآية: 127] { حنيفاً } مائلاً عن كل باطل حتى عن وجوده ووجود كل ما سواه تعالى معرضاً عن إثباته\n وما كان { من المشركين } بنسبة الوجود والتأثير إلى الغير",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أشار سبحانه إلى فضائل خليله - صلوات الرحمن عليه وسلامه - وكمال كرامته، نجابة فطرته، وطهارة أصله وطينته، وعلو شأ،ه ورتبته، وارتفاع قدره ومنزلته - فقال: { إِنَّ } جدّك يا أكمل الرسل { إِبْرَاهِيمَ } الذي اختاره الله لخلته، واصطفاه لرسالته { كَانَ أُمَّةً } أي: إماماً مقتدىً، لائقاً للقدوة بالأمور الدينية؛ لأنه كان { قَانِتاً } مطيعاً { لِلَّهِ } راغباً إلى امتثال مأموراته، واجتناب منهياته { حَنِيفاً } مائلاً عن الأديان الباطلة، والآراء الفاسدة { وَلَمْ يَكُ مِنَ ٱلْمُشْرِكِينَ } [النحل: 120] في حالٍ من الأحوال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { إِنَّ إِبراهيم كان أُمةً } أي: إمامًا قدوة قال تعالى:\n\n[البقرة: 124]، قال ابن مسعود: \" الأُمة: معلّم الناس الخيرَ \" ، أو أمة وحده، اجتمع فيه ما افترق في غيره، فكان وحده أمة من الأمم لكماله واستجماعه لخصال الكمال التي لا تكاد تجتمع إلا في أشخاص كثيرة، كقول الشاعر:\n\nوهو رئيس الموحدين، وقدوة المحققين، جادل فرق المشركين، وأبطل مذاهبهم الزائفة بالحجج الدامغة\n ولذلك عقَّب ذكره بتزييف مذاهب المشركين\n أو: لأنه كان وحده مؤمنًا وسائر الناس كفارًا\n قاله البيضاوي\n وكان { قانتًا لله } مطيعًا قائمًا بأوامره، { حنيفًا } مائلاً عن الباطل، { ولم يَكُ من المشركين } ، وأنتم يا معشر قريش تزعمون أنكم على دينه، وأنتم مشركون",
      "translations": []
    }
  ]
}