{
  "chapter": "النحل",
  "text": "او۟لئك الذين طبع الله على قلوبهم وسمعهم وابصرهم واو۟لئك هم الغفلون",
  "translations": [
    {
      "translation": "They are the ones whose hearts and ears and eyes have been sealed by God; and these are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones upon whose hearts and hearing and eyes Allah has set a seal. They are utterly steeped in heedlessness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sealed their hearts, ears and eyes and they are not aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the ones whose hearts, ears, and eyes Allah has sealed; and they are the neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those upon whose hearts, hearing (ears) and sight (eyes) Allah has set a seal over. And they are the heedless!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they on whose hearts and their hearing and their eyes Allah has set a seal, and these are the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those -- God has set a seal on their hearts, and their hearing, and their eyes, and those -- they are the heedless ones;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are they whose hearts and ears and eyes Allah hath sealed. And such are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the ones upon whose hearts and hearing and sight God has set a seal. It is they who are heedless,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they upon whose hearts and hearing and sight Allah hath set a seal; and these! they are the negligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones Allah has set a seal on their hearts, their hearing and their sight, and it is they who are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they whose hearts, ears, and eyes Allah has sealed up, and they take no heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those upon whose hearts, hearing (ears) and sight (eyes) Allah has set a seal. And they are the heedless!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whose hearts, hearing and sight are sealed by Allah; they are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they whom God has sealed their hearts, and their hearing, and their sight. It is they who are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones over whose hearts and hearing and vision Allah has sealed, and it is those who are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:108] They are the ones on whose hearts God has set a seal, and on their hearing and their sight [as well], and it is they who are heedless, of what [punishment] is being prepared for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such are they whose hearts and ears and eyes Allah hath sealed. And such are the heedless) of the Hereafter and further shun it; it is also said that this means: they are heedless of Allah's divine Oneness, and deniers of it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُولَـٰئِكَ } المجبولون على الكفر هم { ٱلَّذِينَ طَبَعَ ٱللَّهُ } وختم { عَلَىٰ قُلُوبِهِمْ } إلى حيث لا يفهمون، ولا يتفطنون بسرائر الإيمان والتوحيد أصلاً، ولا يتلذذون بلذاتها؛ لغلظ حجبهم وكثافتها { وَ } على { سَمْعِهِمْ } إلى حيث لا يسمعون، ولا يبلون دلائل التوحيد وأماراتها من أرباب الكشف واليقين { وَ } على { أَبْصَارِهِمْ } إلى حيث لا ينظرون نظر عبرة وبصارة إلى المظاهر والآثار المترتبة على الأوصاف الذاتية الإلهية { وَ } بالجملة: { أُولَـٰئِكَ } البعداء المطرودون عن عزِّ الحضور { هُمُ ٱلْغَافِلُونَ } [النحل: 108] المقصورون على الغفلة والنسيان، التائهون في تيه الضلال والطغيان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك الذين طَبَعَ اللهُ على قلوبهم وسمعهم وأبصارهم } فغابت عن إدراك الحق والتدبر فيه، { وأولئك هم الغافلون } الكاملون في الغفلة، حتى أغفلتهم الحالة الزائفة عن التأمل في العواقب",
      "translations": []
    }
  ]
}