{
  "chapter": "النحل",
  "text": "ثم ان ربك للذين عملوا۟ السوء بجهلة ثم تابوا۟ منۢ بعد ذلك واصلحوا۟ ان ربك منۢ بعدها لغفور رحيم",
  "translations": [
    {
      "translation": "But to those who do evil in ignorance and then after that make tawba and put things right, to them your Lord is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who do wrong out of ignorance, then repent and correct themselves, your Lord is indeed forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But to those who commit evil out of ignorance and then repent and amend their ways, thereafter your Lord will be Much Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who commit sins in their ignorance then repent and reform, your Lord is certainly All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then indeed your Lord – for those who unwittingly commit evil and then repent and reform themselves – indeed your Lord is then, surely, Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, your Lord for those who did evil out of ignorance and afterward repent and do righteous deeds - verily, after that, your Lord is Pardoning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet surely your Lord, with respect to those who do an evil in ignorance, then turn after that and make amends, most surely your Lord after that is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, surely thy Lord -- unto those who did evil in ignorance, then repented after that and put things right -- surely thy Lord thereafter is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then lo! thy Lord - for those who do evil in ignorance and afterward repent and amend - lo! (for them) thy Lord is afterward indeed Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, your Lord is most forgiving and ever merciful towards those who do evil in ignorance and truly repent thereafter and make amends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, verily, thy Lord unto those who work evil from ignorance, and then repent thereafter and amend, verily thy Lord thereafter is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moreover, your Lord will indeed be forgiving and merciful to those who repent after they having committed evil out of ignorance and reform themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But verily thy Lord,- to those who do wrong in ignorance, but who thereafter repent and make amends,- thy Lord, after all this, is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, verily! Your Lord for those who do evil (commit sins and are disobedient to Allah) in ignorance and afterward repent and do righteous deeds, verily, your Lord thereafter, (to such) is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, your Lord to those who commit evil through ignorance and afterwards repent, and mend their ways your Lord thereafter is surely Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But towards those who do wrongs in ignorance, and then repent afterwards and reform, your Lord thereafter is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, indeed your Lord, to those who have done wrong out of ignorance and then repent after that and correct themselves - indeed, your Lord, thereafter, is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:119]   Then indeed your Lord — to those who did evil, associating others [with God], out of ignorance, and then repented, returned [to God’s way], after that and made amends, in their actions — indeed your Lord after that, that is, [after] that ignorance, or that repentance, is Forgiving, of them, Merciful, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then lo! thy Lord) Muhammad (for those who do evil in ignorance) intentionally even if they are ignorant 296 of committing it (and afterward repent) after committing such an evil (and amend) their work between themselves and their Lord - (lo! (for them) thy Lord is afterward) after repentance (indeed Forgiving, Merciful) towards them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بشِّر سبحانه على عموم أصحاب المعاصي والآثام بالعفو والمغفرة\n والشفقة عليهم بعدما تابوا وندموا عما هم عليهم مخلصين\n فقال لحبيبه: { إِنَّ رَبَّكَ } الذي يعثك يا أكمل الرسل إلى كافة البرايا بشيراً ونذيراً\n يحسن ويرحم { لِلَّذِينَ عَمِلُواْ ٱلسُّوۤءَ } أي: الفعلة القبيحة\n والديدنة الشنيعة المذمومة في الشرع\n مع كونهم في حين ارتكابها ملتبسين { بِجَهَالَةٍ } ناشئةٍ من عدم التدبر والتأمل بوخامة عواقبها شرعاً مع تدينهم\n وقبولهم بأحكام الشريعة\n وكانوا ممن لا يؤمن\n ولا يقبل ما رود به الشرع { ثُمَّ تَابُواْ } وندموا { مِن بَعْدِ } ارتكاب { ذَلِكَ } السوء { وَأَصْلَحُوۤاْ } بالتوبة والاستغفار ما أفسدوا على نفوسهم بالفساد والإصرار { إِنَّ رَبَّكَ } المحسن المفضل على التائب المخلص { مِن بَعْدِهَا } أ ي: بعد التوبة والندم { لَغَفُورٌ } يستر ذلتهم { رَّحِيمٌ } [النحل: 119] يقبل توبتهم\n\n\nثمَّ أشار سبحانه إلى فضائل خليله - صلوات الرحمن عليه وسلامه - وكمال كرامته\n نجابة فطرته\n وطهارة أصله وطينته\n وعلو شأ\nه ورتبته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:54",
      "similarity": 0.8597418177324543
    },
    {
      "verse": "4:17",
      "similarity": 0.7835160399270644
    },
    {
      "verse": "7:153",
      "similarity": 0.635028713564351
    },
    {
      "verse": "3:89",
      "similarity": 0.5503157506070828
    },
    {
      "verse": "24:5",
      "similarity": 0.5503157506070828
    }
  ]
}