{
  "chapter": "النحل",
  "text": "واصبر وما صبرك الا بالله ولا تحزن عليهم ولا تك فى ضيق مما يمكرون",
  "translations": [
    {
      "translation": "Be patient. But your patience is only by Allah. Do not be grieved by them and do not be constricted by the plots they hatch.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Endure with patience, for your endurance is not without the help of God. Do not grieve for them, and do not be distressed by their plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bear with patience, (O Muhammad) - and your patience is only because of the help of Allah - and do not grieve over them, nor feel distressed by their evil plans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exercise patience and let it be only for the cause of God. Do not be grieved about them nor disappointed at their evil plans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him) patiently endure – and your patience is only due to the guidance of Allah – and do not grieve for them, and do not be disheartened by their deceits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient, and your patience will not be, but by the help of Allah. And do not grieve over them, and do not be distressed by their plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient and your patience is not but by (the assistance of) Allah, and grieve not for them, and do not distress yourself at what they plan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient; yet is thy patience only with the help of God. And do not sorrow for them, nor be thou straitened for what they devise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Endure thou patiently (O Muhammad). Thine endurance is only by (the help of) Allah. Grieve not for them, and be not in distress because of that which they devise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Endure with patience; truly, your patience is possible only with the help of God. Do not grieve for them, or feel distressed because of their plottings,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And endure them patiently; and thy patience is not but from Allah; and grieve not over them, and be not thou in straitness because of that which they plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be steadfast, and you cannot be steadfast except with Allah [’s help]. And do not grieve for them, nor be upset by their guile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do thou be patient, for thy patience is but from Allah; nor grieve over them: and distress not thyself because of their plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And endure you patiently (O Muhammad SAW), your patience is not but from Allah. And grieve not over them (polytheists and pagans, etc.), and be not distressed because of what they plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient; yet your patience is only by the help of Allah. Do not grieve for them (the unbelievers), nor distress yourself because of their devising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient. Your patience is solely from God. And do not grieve over them, and do not be stressed by their schemes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient, [O Muhammad], and your patience is not but through Allah. And do not grieve over them and do not be in distress over what they conspire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:127] So be patient, and your patience is only by [the help of] God, [only] by His assistance. And do not grieve for them, that is, [for] the disbelievers if they do not believe, despite your eagerness that they believe, nor be in   distress because of that which they scheme, in other words, do not be concerned with their scheming, for I [God] will make victorious over them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Endure thou patiently) their harm, Muhammad. (Thine endurance is only by (the help of) Allah) by Allah's given success. (Grieve not for them) grieve not for the destruction of those who derided you, (and be not in distress because of that which they devise) because of what they say about you and do to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي ضَيْقٍ } معناه في شِدةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in a tight place} means in a severe situation.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ واصْبِر وما صبرك إلا بالله } اعلم أنّ الصبر أقسام: صبر لله، وصبر في الله، وصبر مع الله، وصبر عن الله، وصبر بالله\n فالصبر لله هو من لوازم الإيمان وأول درجات أهل الإسلام\n قال النبي عليه الصلاة والسلام:\n\n \" الإيمان نصفان، نصف صبر ونصف شكر \" \n\n، وهو حبس النفس عن الجزع عند فوات مرغوب أو وقوع مكروه، وهو من فضائل الأخلاق الموهوبة من فضل الله لأهل دينه وطاعته المقتضى للثواب الجزيل\n والصبر في الله هو الثبات في سلوك طريق الحق، وتوطين النفس على المجاهدة بالاختيار، وترك المألوفات واللذات، وتحمل البليّات، وقوّة العزيمة في التوجه إلى منبع الكمالات، وهو من مقامات السالكين، يهبه الله لمن يشاء من فضله من أهل الطريقة\n والصبر مع الله هو لأهل الحضور، والكشف عند التجرّد عن ملابس الأفعال والصفات، والتعرّض لتجليات الجمال والجلال، وتوارد واردات الأنس والهيبة، فهو بحضور القلب لمن كان له قلب، والاحتراس عن الغفلة والغيبة عند التلوينات بظهور النفس وهو أشقّ على النفس من الضرب على الهام، وإن كان لذيذاً جداً\n والصبر عن الله هو لأهل الجفاء والحجاب، نورانياً كان أو ظلمانياً، وهو مذموم جداً، وصاحبه ملوم حقاً وكلما كان أصبر كان أسوأ حالاً وأبعد، وكلما كان في ذلك أقوى كان ألوم وأجفى أو لأهل العيان والمشاهدة من العشاق والمشتاقين المتقلبين في أطوار التجلي والاستتار\n والمنخلعين عن الناسوت المتنوّرين بنور اللاهوت ما بقي لهم قلب ولا وصف كلما لاح لهم نور من سبحات أنوار الجمال احترقوا وتفانوا، وكلما ضرب لهم حجاب ورد وجوههم تشويقاً وتعظيماً ذاقوا من ألم الشوق وحرقة الفرقة ما عيل به صبرهم وتحقق موتهم وهو من أحوال المحبين ولا شيء أشق من هذا الصبر وأشد تحملاً واقْتَل، فإن أطاقه المحب كان خافياً وإن لم يطق كان فانياً فيه هالكاً، وفي هذا المقام قال الشبلي:\n\nأي: صابر الحبيب الصبر، فاستغاث به الصبر عند إشرافه على النفاد فصاح المحب بالصبر صبراً على النفاد والهلاك، فإن فيه النجاح والفلاح\n والصبر بالله هو لأهل التمكين في مقام الاستقامة الذين أفناهم الله بالكلية وما ترك عليهم شيئاً من بقية الأنية والإثنينية ثم وهب لهم وجوداً من ذاته حتى قاموا به وفعلوا بصفاته وهو من أخلاق الله تعالى ليس لأحد فيه نصيب ولهذا أمره به\n ثم بيّن أن ذلك الصبر الذي أمرت به ليس من سائر أقسام الصبر حتى يكون بنفسك أو بقلبك بل هو صبري لا تباشره إلا بي ولا تطيقه إلا بقوّتي، ولعدم وفاء قوته بهذا الصبر قال:\n\n\n\n \" شيّبتني سورة هود \"\n \n\n{ ولا تحزن عليهم } بالتلوين بظهور القلب بصفته لأن صاحب هذا الصبر يرى الأشياء بعين الحق فكل ما يصدر عنهم يراه فعل الله وكل صفة تظهر عليهم يراه تجلياً من تجلياته وينكر المنكر بحكمه لأن الله بصّره بأنوع التجليات القهرية واللطفية والغضبية والرضوية وعرّفه أحكامه وأمره بإنفاذ الأحكام في مواقعها\n { ولا تك في ضيق هما يمكرون } لانشراح صدرك بي، فكن معهم كما تراني معهم سائراً بسيري قائماً بي وبأمري",
      "translations": [
        {
          "translation": "\n\nAnd be patient; your patience can only come from Allah. Know that patience has different aspects: patience in worshipping Allah.,\n\nHave patience in God.,\n\nBe patient with God.,\n\nAnd be patient with what Allah has decreed.,\n\nWait patiently for God.\n\n\nPatience for Allah is one of the requirements of faith, and the first of the degrees of the people of Islam.\n\n\nThe Prophet (peace and blessings of Allaah be upon him) said:\n\n\n\"Faith is Half the Battle\",\n\nHalf of patience and half of thankfulness.\n\n\n{In the name of God, the Most Merciful, the Most Compassionate}\n\nPraise be to God, the Lord of all creation, and may the blessings and peace of God be upon our Prophet Muhammad, his family, and all his companions.,\n\nAnd he restrains the soul from grief when a desired thing is missed or an undesirable thing occurs.,\n\nAnd it is from the virtues of good character that Allah bestows upon His believing servants as a reward for their obedience.\n\n\nAnd patience in Allah is the steadfastness in one's conduct on the right path.,\n\nAnd anchoring the soul onto jihad by choice,\n\nAnd leave behind the familiar and the pleasurable., The mountains carry {the burden}., The power of {Azimah} in heading towards the source of perfection.,\n\nAnd he is from the positions of the travellers.,\n\nMay Allah bestow His grace upon whom He wills of the people of the Way.\n\n\nAnd patience with God is for those who are present.,\n\nAnd the disclosure when {tajrid} of the clothes of the actions and the attributes.,\n\nAnd be exposed to the beauty and majesty {of the divine}.,\n\nAnd the import of Anas and Hajib.,\n\nHe is present in the heart of whoever has a heart.,\n\nAnd guarding against negligence and heedlessness at times of coloring with the appearance of the self, and it is more difficult on the self than striking the hump., {And if it was very delicious}\n\n\nAnd patience with Allah is for those who are firm in their commitment and have hijab.,\n\nNooraniya was either {nooran} or {zalman}., He is very blameworthy.,\n\nAnd his companion was truly blameworthy, and the more patient he was, the worse his condition became, and the further away he was.,\n\nThe more powerful it was, the more it afflicted and grieved the beholders and spectators, among whom were lovers and those who longed, who turned in the ups and downs of its vicissitudes.\n\n\nAnd those who are detached from the material world, illuminated by the light of God, they have no heart or description. Whenever they catch a glimpse of the light of the divine realms, they are consumed by it and disappear.,\n\nAnd every time they were struck with the veil and their faces were covered with excitement and admiration, they tasted the pain of longing and the burning of separation {as if} they were patient and their death was certain. And this is among the conditions of the lovers. There is nothing more difficult than this patience and more tolerable than this endurance.,\n\nIf his love was hidden, it was because he was afraid; if it was not hidden, it was because he was desperate.,\n\nIn this position, the Shibili said:\n\n\n{O patient one}, endure for the sake of your beloved.,\n\n{He asked for patience in the face of adversity, and the lover of patience responded with patience in the face of adversity and destruction.},\n\nIn it lies success and prosperity.\n\nAnd patience with Allah is for those who are enabled in the position of uprightness, whom Allah has given the fullness and left for them nothing of the remaining of the desires and the twos, then He gave them provision from Himself until they stood with it and did with its characteristics, and it is from the ethics of Allah Almighty, and no one has a share in it, and for this He ordered him with it.\n\n\nThen he explains that this patience which you have been commanded to exhibit is not like other forms of patience, in that it is not something you can do on your own or with your own strength. Rather, it is my patience that you cannot experience except with me, and that you cannot endure except with my power.,\n\nAnd in spite of his weariness, he said {this} with patience.\n\n\n\"Please read me Surah Hood.\"\n\n\nDo not grieve for them in coloring your heart with the appearance of patience, because the owner of this patience sees things with the eye of truth. Everything they say, he sees it as Allah sees it, and every trait that appears to them, he sees it as a manifestation of Allah's attributes. He rejects what is rejected by the command of Allah, because Allah sees all things with the various attributes of His power, His mercy, His anger, and His pleasure. He knows the rulings and commands of His religion, and He orders them to be carried out in their proper places.\n\n\nAnd do not be {constricted by their schemes}, for they plot to constrict your chest.,\n\nBe with them as you would with anyone else, walking upright and following my orders.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما خاطب وأوصى سبحانه للمؤمنين بالصبر والعفو على وجه العموم، وترك الانتقام، خص رسوله صلى الله عليه وسلم بالخطاب؛ لكونه أحق وأولى بامتثال أمثاله؛ إذ هو جامع جميع مرابت الكمال بالاستحقاق والاستقلا ل، فقال: { وَٱصْبِرْ } أيها المتحقق المتمكن في مقر التوحيد، المسقط لجميع الإضافات على ما جرى عليك من الأذيات المترتبة على بشريتك وناسوتك { وَمَا صَبْرُكَ } وكظمُك بعد فنائك عن بشريتك { إِلاَّ بِٱللَّهِ } المتجلي عليك بالإطلاق إلى أن انخلعتُ عنك لوازم ناسوتك، وما بقيت لك إلاَّ لوازم لاهوتك، وظاهر أنه لا يجري فيها المكروه والمنكر { وَلاَ تَحْزَنْ عَلَيْهِمْ } أي: على المؤمنين بما لحقهم من المنافرات والمشوشات { وَلاَ تَكُ } بعد انشراح صدرك بالتوحيد الذاتي { فِي ضَيْقٍ } ضيق صدر، وحزن وكآبة { مِّمَّا يَمْكُرُونَ } [النحل: 127] أولئك الماكرون المعاندون المكابرون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم صرح بالأمر لرسوله به لأنه أولى الناس به لزيادة علمه بالله، فقال: { واصبر وما صبرك إِلا بالله } إلا بتوفيقه وتثبيته\n رُوي أنه صلى الله عليه وسلم قال لأصحابه:\n\n \" أما أنا فأصبر كما أمرت، فماذا تصنعون؟ \" \n\nقالوا: نصبر كما ندبنا\n { ولا تحزنْ عليهم } على الكافرين حيث لم يؤمنوا حِرْصًا عليهم\n أو على المؤمنين لأجل ما فعل بهم\n { ولا تَكُ في ضيق مما يمكرون } أي: لا يضيق صدرك بمكرهم، ولا تهتم بشأنهم، فأنا ناصرك عليهم\n والضيق - بفتح الضاد مُخَفَّفًا - من ضَيِّقٍ كَمَيْتِ ومَيِّتٍ\n وقرئ بالكسر، وهو مصدر\n ويجوز أن يكون الضيق والضيق مصدريْن، معًا، لِضاق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:70",
      "similarity": 0.9583378519539542
    },
    {
      "verse": "15:97",
      "similarity": 0.5989140438571066
    },
    {
      "verse": "3:54",
      "similarity": 0.40476286565146175
    },
    {
      "verse": "26:13",
      "similarity": 0.4019059113737025
    },
    {
      "verse": "71:22",
      "similarity": 0.3996346757298315
    }
  ]
}