{
  "chapter": "النحل",
  "text": "ان ابرهيم كان امة قانتا لله حنيفا ولم يك من المشركين",
  "translations": [
    {
      "translation": "Ibrahim was a community in himself, exemplary, obedient to Allah, a man of pure natural belief. He was not one of the idolaters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was certainly a model of faith, obedient to God and upright, and not one of idolaters,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Abraham was a whole community by himself, obedient to Allah, exclusively devoted to Him. And he was never one of those who associated others with Allah in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was, certainly, an obedient and upright person. He was not a pagan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Ibrahim was a leader, obedient to Allah, and detached from all; and he was not a polytheist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Ibrahim was (himself) an Ummah, obedient to Allah, a Hanif (monotheist), and he was not one of the idolators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Ibrahim was an exemplar, obedient to Allah, upright, and he was not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, Abraham was a nation obedient unto God, a man of pure faith and no idolater,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Abraham was a nation obedient to Allah, by nature upright, and he was not of the idolaters;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was a community in himself devoted to God and true in faith, He was not one of the polytheists;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Ibrahim was a pattern, devout unto Allah, upright, and, not of the associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Abraham was a nation [all by himself], obedient to Allah, a Hanif, and he was not a polytheist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was indeed a model, devoutly obedient to Allah, (and) true in Faith, and he joined not gods with Allah:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Ibrahim (Abraham) was an Ummah (a leader having all the good righteous qualities), or a nation, obedient to Allah, Hanifa (i.e. to worship none but Allah), and he was not one of those who were Al-Mushrikun (polytheists, idolaters, disbelievers in the Oneness of Allah, and those who joined partners with Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was (equal to) a nation, obedient to Allah, of pure faith and was not among the idolaters,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham was an exemplary leader, devoted to God, a monotheist, and was not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Abraham was a [comprehensive] leader, devoutly obedient to Allah, inclining toward truth, and he was not of those who associate others with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:120] Truly Abraham was a community, a leader (imām), a [good] example, comprising [in his character] all the good traits, obedient to God, a hanīf, inclining towards the upright religion, and he was not of the idolaters;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Abraham was a nation) a leader who was emulated (obedient to Allah, by nature upright) sincerely surrendered to Allah, (and he was not of the idolaters) he did not follow the idolaters in their religion;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً قَانِتاً } معناهُ مُعلمٌ للخَيرِ\n قالَ زيدُ بن علي عليهما السّلامُ: كان مُؤمناً وحدهُ مُطيعاً لله، والنّاسُ كُلُّهُم كُفارٌ\n وقانتٌ: معناهُ إِمامٌ مُطيعٌ\n\n\n\n\nوقوله تعالى: { حَنِيفاً } مسلماً\n فالحَنِيفُ: الذي يَختتنُ ويَحجُ البيتَ\n وقالَ الحَنيفُ: المُخلصُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - exalted be He: {Indeed, Abraham was a [comprehensive] nation, obedient} Its meaning is a teacher of good.\n Zayd ibn `Ali, peace be upon him, said: \"There was a believer who was obedient to God, and all of the people were disbelievers.\"\n\n\n{The} Imam {who is} obeyed.\n And His saying - the Most High - \"Muslim\"\n\n\nThe Hanif is the one who circumcises and pilgrimages to the House.\n\n\nAnd the Hanafis said: The Mukhlis (the one who is sincere)",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن إبراهيم كان أمّة } قد مرّ أن كل نبي يبعث في قوم يكون كماله شاملاً لجميع كمالات أمته وغاية لا يمكن لأمّته الوصول إلى رتبة إلا وهى دونه\n فهو مجموع كمالات قومه ولا يصل إليهم الكمال في صفة من صفات الخير والسعادة إلا بواسطته بل وجوداتهم فائضة من وجوده فهو وحده أمة لاجتماعهم بالحقيقة في ذاته\n ولهذا قال عليه الصلاة والسلام:\n \" لو وزنت بأمتي لرجحت بهم \" \n{ قانتاً } لله مطيعاً له\n منقاداً بحيث لا يتحرك منه شعرة إلا بأمره لاستيلاء سلطان التوحيد عليه ومحو صفاته بصفاته\n واتحاده بذاته\n ولهذا سمي خليل الله لمخالة الحق إياه في شهوده\n فخلّته عبارة عن مزج بقية من ذاته تؤذن بالإثنينية أما ترى رسول الله صلى الله عليه وسلم لما لم يبق منه شيء من بقيته سمي حبيب الله فمحو صفاته في صفات الحق بالكلية وبقاء أثر من ذاته دون العين قنوته لله وإلا كان قانتاً بالله لا لله\n كما قال لمحمد عليه الصلاة والسلام:\n[النحل\n الآية: 127] { حنيفاً } مائلاً عن كل باطل حتى عن وجوده ووجود كل ما سواه تعالى معرضاً عن إثباته\n وما كان { من المشركين } بنسبة الوجود والتأثير إلى الغير\n { شاكراً لأنعمه } أي: مستعملاً لها على الوجه الذي ينبغي لكونه متصرفاً فيها بصفات الله فتكون أفعاله إلهية مقصودة لذاتها لا لغرض فلا يمكنه ولا يسعه إلا توجيه كل نعمة إلى ما هو كمالها على مقتضى الحكمة الإلهية والعناية السرمدية { اجتباه } اختاره في العناية الأولى بلا توسط عمل منه وكذا لكونه من المحبوبين الذين سبقت لهم منه الحسنى\n فتتقدم كشوفهم على سلوكهم { وهداه إلى صراط مستقيم } أي: بعد الكشف والتوحيد والوصول إلى عين الجمع هداه إلى سلوك صراطه ليقتدي به\n وردّه من الوحدة إلى الكثرة وإلى الفرق بعد الجمع لإعطاء كل ذي حق حقه من مراتب التفاصيل\n وتبيين أحكام التجليات في مقام التمكين والاستقامة وإلا لم يصلح للنبوّة\n { وآتيناه في الدنيا حسنة } من تمتيعه بالحظوظ لتتقوى نفسه على تقنين القوانين الشرعية والقيام بحقوق العبودية في مقام الاستقامة والإطاقة بحمل أعباء الرسالة { وآتيناه } المُلْك العظيم مع النبوة\n كما قال:\n[النساء\n الآية: 54] ليتمكن من تقرير الشريعة ويضطلع بأحكام الدعوة والذكر الجميل كما قال:\n[مريم\n الآية: 50] والصلاة والسلام عليه كما قال:\n[الصافات\n الآيات: 108-109] { وإنه في الآخرة } أي: في عالم الأرواح { لمن الصالحين } المتمكنين في مقام الاستقامة بإيفاء كل ذي حق حقه\n وتبليغه إلى كماله وحفظه عليه ما أمكن\n ُ { ثم أوحينا إليك } أي: بعد هذه الكرامات والحسنات التي أعطيناه إياها في الدارين شرّفناه وكرمناه بأمرنا باتباعك إياه { أن اتّبع ملّة إبراهيم } في التوحيد وأصول الدين التي لا تتغير في الشرائع كأمر المبدأ والمعاد والحشر والجزاء وأمثالها\n لا في فروع الشريعة وأوضاعها وأحكامها\n فإنها تتغير بحسب المصالح واختلاف الأزمنة والطبائع وما عليه أحوال الناس من العادات والخلائق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وارتفاع قدره ومنزلته - فقال: { إِنَّ } جدّك يا أكمل الرسل { إِبْرَاهِيمَ } الذي اختاره الله لخلته\n واصطفاه لرسالته { كَانَ أُمَّةً } أي: إماماً مقتدىً\n لائقاً للقدوة بالأمور الدينية\n لأنه كان { قَانِتاً } مطيعاً { لِلَّهِ } راغباً إلى امتثال مأموراته\n واجتناب منهياته { حَنِيفاً } مائلاً عن الأديان الباطلة\n والآراء الفاسدة { وَلَمْ يَكُ مِنَ ٱلْمُشْرِكِينَ } [النحل: 120] في حالٍ من الأحوال\n\nبل هو رأس الموحدينن",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { إِنَّ إِبراهيم كان أُمةً } أي: إمامًا قدوة قال تعالى:\n[البقرة: 124]\n قال ابن مسعود: \" الأُمة: معلّم الناس الخيرَ \" \n أو أمة وحده\n اجتمع فيه ما افترق في غيره\n فكان وحده أمة من الأمم لكماله واستجماعه لخصال الكمال التي لا تكاد تجتمع إلا في أشخاص كثيرة\n كقول الشاعر:\nوهو رئيس الموحدين\n وقدوة المحققين\n جادل فرق المشركين\n وأبطل مذاهبهم الزائفة بالحجج الدامغة\n ولذلك عقَّب ذكره بتزييف مذاهب المشركين\n أو: لأنه كان وحده مؤمنًا وسائر الناس كفارًا\n قاله البيضاوي\n وكان { قانتًا لله } مطيعًا قائمًا بأوامره\n { حنيفًا } مائلاً عن الباطل\n { ولم يَكُ من المشركين } \n وأنتم يا معشر قريش تزعمون أنكم على دينه\n وأنتم مشركون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:67",
      "similarity": 0.5805971373935573
    },
    {
      "verse": "30:26",
      "similarity": 0.5671158803215174
    },
    {
      "verse": "10:105",
      "similarity": 0.5568949846708999
    },
    {
      "verse": "3:95",
      "similarity": 0.5548252173792639
    },
    {
      "verse": "16:123",
      "similarity": 0.5360756028700493
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016120.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016120.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:120.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}