{
  "chapter": "النحل",
  "text": "وان عاقبتم فعاقبوا۟ بمثل ما عوقبتم به ولئن صبرتم لهو خير للصبرين",
  "translations": [
    {
      "translation": "If you want to retaliate, retaliate to the same degree as the injury done to you. But if you are patient, it is better to be patient.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you have to retaliate, do so to the extent you have been injured; but if you forbear it is best for those who bear with fortitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you take retribution, then do so in proportion to the wrong done to you. But if you can bear such conduct with patience, indeed that is best for the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you want retaliation, let it be equal to that which you faced. But if you exercise patience it will be better for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you mete out punishment, then punish similarly as you were afflicted; and if you patiently endure, then indeed patience is better for the patiently enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you punish them, then punish them with the like of that with which you were afflicted. But if you have patience with them, then it is better for those who are patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you take your turn, then retaliate with the like of that with which you were afflicted; but if you are patient, it will certainly be best for those who are patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you chastise, chastise even as you have been chastised; and yet assuredly if you are patient, better it is for those patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye punish, then punish with the like of that wherewith ye were afflicted. But if ye endure patiently, verily it is better for the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you want to retaliate, retaliate to the same degree as the injury done to you. But if you are patient, it is better to be so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye chastise, then chastise with the like of that wherewith ye were afflicted, and if ye endure patiently, then surely it is better for the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should you retaliate, retaliate with the like of what you have been made to suffer, but if you are patient that is surely better for the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye do catch them out, catch them out no worse than they catch you out: But if ye show patience, that is indeed the best (course) for those who are patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you punish (your enemy, O you believers in the Oneness of Allah), then punish them with the like of that with which you were afflicted. But if you endure patiently, verily, it is better for As-Sabirin (the patient ones, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you punish, let your punishment be proportionate to the punishment you received. But if you are patient, it is better for the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you were to retaliate, retaliate to the same degree as the injury done to you. But if you resort to patience—it is better for the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you punish [an enemy, O believers], punish with an equivalent of that with which you were harmed. But if you are patient - it is better for those who are patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:126] After Hamza [b. ‘Abd al-Muttalib] had been killed and mutilated, and the Prophet (s) had seen him and said, ‘Verily I will mutilate 70 of them for you’, the following was revealed: And if you retaliate, retaliate with the like of what you have been made to suffer; and yet if you endure patiently, [refraining] from revenge, verily that, namely, [that] enduring, is better for the patient. Thus the Prophet (s) refrained [from taking revenge] and made atonement for his oath, as reported by al-Bazzār.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If ye punish) mutilate, (then punish) mutilate (with the like of that wherewith ye were afflicted) with the like of that which your dead were mutilated. (But if ye endure patiently) and abstain from mutilation, (verily it is better for the patient) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n  { وإن عاقبتم } الخ، أي: الزموا سيرة العدالة والفضيلة لا تجاوزوها فإنها أقلّ درجات كمالكم، فإن كان لكم قدم في الفتوة وعرق راسخ في الفضل والكرم والمروءة فاتركوا الانتصار والانتقام ممن جنى عليكم وعارضوه بالعفو مع القدرة واصبروا على الجناية فإنه { لهو خير للصابرين } ألا تراه كيف أكده بالقسم واللام في جوابه وترك المضمر إلى المظهر حيث ما قال: لهو خير لكم، بل قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَإِنْ عَاقَبْتُمْ } أيها المؤمنون منتقمين عنهم { فَعَاقِبُواْ } أي: فعليكم أن تعاقبوا { بِمِثْلِ مَا عُوقِبْتُمْ بِهِ } لا أزيد منه\n إذ الزيادة منافية لاعتدال الإيمان والتوحيد { وَلَئِن صَبَرْتُمْ } أيها المؤمنون على ما أصابكم من العقوبات\n وأعرضتم عن الانتقام صفحاً\n وكظمتم الغيظ كظماً { لَهُوَ } أي: العفو والكظم { خَيْرٌ لِّلصَّابِرينَ } [النحل: 126] الذين صبروا على ما أصابهم من المكروهات\n مسترجعين إلى الله\n منزلين إنزاله إليه سبحانه بلا رؤية الوسائل في البين\n بل يعدون العناء عطاءً\n والترح فرحاً\n والنقمة نعمةً\n والمحنة منحةً\n لصدورها من الله\n\n\nوبعدما خاطب وأوصى سبحانه للمؤمنين بالصبر والعفو على وجه العموم\n وترك الانتقام\n خص رسوله صلى الله عليه وسلم بالخطاب\n لكونه أحق وأولى بامتثال أمثاله\n إذ هو جامع جميع مرابت الكمال بالاستحقاق والاستقلا ل\n فقال: { وَٱصْبِرْ } أيها المتحقق المتمكن في مقر التوحيد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وإِنْ عاقبتم } من آذَاكُمْ { فعَاقِبوا بمثل ما عُوقبتم به } أي: إن صنع بكم صنيع سوء فافعلوا مثله، ولا تزيدوا عليه\n والعقوبة، في الحقيقة، إنما هي في الثانية\n وسميت الأولى عقوبة لمشاكلة اللفظ\n وقال الجمهور: إن الآية نزلت في شأن حمزة بن عبد المطلب، لما بَقَر المشركون بطنه يوم أحد، قال النبي صلى الله عليه وسلم:\n\n \" لئن أظْفَرَنِي اللهُ بِهمْ لأُمَثِّلَنَّ بسِبْعِينَ منهم \" \n\nفنزلت الآية، فكفّر النبيّ صلى الله عليه وسلم عن يمينه، وترك ما أراد من المُثْلَةِ\n ولا خلاف أن المثلة حرام، وقد وردت أحاديث بذلك\n ومقتضى هذا: أن الآية مدنية\n ويحتمل أن تكون الآية عامة، ويكون ذكرهم حمزة على وجه المثال\n وتكون، على هذا، مكية كسائر السورة\n واختلف العلماء فيمن ظلمه رجل في مال، ثم ائتمن عليه، هل يجوز خيانته، في القدر الذي ظلمه فيه؟ فأجاز ذلك قوم لظاهر الآية، ومنعه مالك لقوله صلى الله عليه وسلم:\n\n \" أَدِّ الأَمَانَةَ لِمَنْ ائْتَمَنَك، ولا تَخُنْ مَنْ خَانَكَ \" \n\nقاله ابن جزي\n { ولئن صبرتم } ، ولم تعاقبوا من أساء إليكم، { لهو } أي: الصبر { خيرٌ للصابرين } فإن العقوبة مباحة، والصبر أفضل من الانتقام، ويحتمل أن يريد بالصابرين هنا العموم، أو يريد المخاطبين، كأنه قال: فهو خير لكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:24",
      "similarity": 0.5171417007267736
    },
    {
      "verse": "20:132",
      "similarity": 0.4554101387153765
    },
    {
      "verse": "74:7",
      "similarity": 0.44966806684018573
    },
    {
      "verse": "11:49",
      "similarity": 0.4377617005717042
    },
    {
      "verse": "91:15",
      "similarity": 0.43635619494773253
    }
  ]
}