{
  "chapter": "النحل",
  "text": "وسخر لكم اليل والنهار والشمس والقمر والنجوم مسخرتۢ بامره ان فى ذلك لءايت لقوم يعقلون",
  "translations": [
    {
      "translation": "He has made night and day subservient to you, and the sun and moon and stars, all subject to His command. There are certainly Signs in that for people who use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He harnessed the day and night for you, as also the sun, the moon and the stars, by His command. In this are signs for men who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has subjected for you the night and the day and the sun and the moon and the stars have also been made subservient by His command. Surely there are Signs in this for those who use their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made the day and the night, the sun and the moon, and all the stars subservient to you by His command. In this there is evidence of the truth for people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He subjected the night and the day for you – and the sun and the moon; and the stars are subjected to His command; indeed in this are signs for people of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has subjected the night and the day for you, and the sun and the moon; and the stars are subjected by His command. Surely, in this are proofs for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has made subservient for you the night and the day and the sun and the moon, and the stars are made subservient by His commandment; most surely there are signs in this for a people who ponder;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He subjected to you the night and day, and the sun and moon; and the stars are subjected by His command. Surely in that are signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath constrained the night and the day and the sun and the moon to be of service unto you, and the stars are made subservient by His command. Lo! herein indeed are portents for people who have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has made the night and the day and the sun and the moon subservient to you; and all the stars are subservient to His command. Surely in this there are signs for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath subiected for you the night and the day and the sun and the moon, and the stars are subjected by His command. Verily therein are signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He disposed the night and the day for you, and the sun, the moon and the stars are disposed by His command. There are indeed signs in that for people who exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has made subject to you the Night and the Day; the sun and the moon; and the stars are in subjection by His Command: verily in this are Signs for men who are wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has subjected to you the night and the day, the sun and the moon; and the stars are subjected by His Command. Surely, in this are proofs for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has subjected to you the night, the day, the sun and the moon. The stars are subjected by His Command. Surely, in that there is a sign for a nation who understands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He regulated for you the night and the day; and the sun, and the moon, and the stars are disposed by His command. Surely in that are signs for people who ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has subjected for you the night and day and the sun and moon, and the stars are subjected by His command. Indeed in that are signs for a people who reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:12] And He disposed for you the night and the day and the sun (wa’l-shamsa, read in the accusative as a supplement to what precedes it; or read wa’l-shamsu in the nominative as a subject [of a new sentence]) and the moon and the stars (also read both ways) are disposed (musakhkharātin, read in the accusative as a circumstantial qualifier, or in the nominative [musakhkharātun] as a predicate) by His command, by His will. Surely in that there are signs for people who understand, [a people] who reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nآيات أخرى على دقيق صنع الله تعالى وعلمه ممزوجة بامتنان .وتقدم ما يفسّر هذه الآية في صدر سورة يونس . وتسخير هذه الأشياء تقدم عند قوله تعالى : { والشمس والقمر والنجوم مسخّرات بأمره ألا له الخلق والأمر } في أوائل سورة الأعراف ( 54 ) وفي أوائل سورة الرعد وفي سورة إبراهيم .وهذا انتقال للاستدلال بإتقان الصنع على وحدانية الصانع وعلمه ، وإدماج بين الاستدلال والامتنان . ونيطت الدلالات بوصف العقل لأن أصل العقل كاف في الاستدلال بها على الوحدانية والقدرة ، إذ هي دلائل بيّنة واضحة حاصلة بالمشاهدة كل يوم وليلة .وتقدم وجه إقحام لفظ ( قوم ) آنفاً ، وأن الجملة تذييل .وقرأ الجمهور جميع هذه الأسماء منصوبة على المفعولية لِفعل سخر . وقرأ ابن عامر { والشمسُ والقمرُ والنجومُ } بالرفع على الابتداء ورفع { مسخرات } على أنه خبر عنها . فنكتة اختلاف الإعراب الإشارة إلى الفرق بين التسخيرين . وقرأ حفص برفع { النجومُ } و { مسخراتٌ }. ونكتة اختلاف الأسلوب الفرق بين التسخيرين من حيث إن الأول واضح والآخر خفيّ لقلّة من يرقب حركات النجوم .والمراد بأمره أمر التكوين للنظام الشمسي المعروف .وقد أبدى الفخر في كتاب «درّة التنزيل» وجهاً للفرق بين إفراد آية في المرة الأولى والثالثة وبين جمع آيات في المرة الثانية : بأن ما ذكر أول وثالثاً يرجع إلى ما نجم من الأرض ، فجميعه آية واحدة تابعة لخلق الأرض وما تحتويه ( أي وهو كله ذو حالة واحدة وهي حالة النبات في الأرض في الأول وحالة واحدة وهي حالة الذرء في التناسل في الحيوان في الآية الثالثة ) وأما ما ذكر في المرة الثانية فإنه راجع إلى اختلاف أحوال الشمس والقمر والكواكب ، وفي كل واحد منها نظام يخصّه ودلائل تخالف دلائل غيره ، فكان ما ذكر في ذلك مجموع آيات ( أي لأن بعضها أعراض كالليل والنهار وبعضها أجرام لها أنظمة مختلفة ودلالات متعددة ).\n\n",
      "translations": [
        {
          "translation": "(And He hath constrained the night and the day and the sun and the moon to be of service unto you) to be subservient to you, (and the stars are made subservient by His command) by His leave. (Lo! Herein) in the subservience of that which I have mentioned (indeed are portents) signs (for people who have sense) for people who act and believe that it is Allah Who made all these things subservient.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من آياته سبحانه المتعلقة لتدبير أحوالكم: إنه { سَخَّرَ لَكُمُ ٱلَّيلَ } لستكنوا فيه وتستريحوا { وَٱلْنَّهَارَ } لتعيشوا فيه وتكتسبوا { وَ } أيضاً { ٱلشَّمْسَ وَٱلْقَمَرَ } لإنضاج ما تتقون\n إصلاح ما تتفكهون { وَ } سخر { ٱلْنُّجُومُ } أيضاً\n لتهتدوا بها في ظلمات البر والبحر\n حل كون كل منها { مُسَخَّرَاتٌ بِأَمْرِهِ } تابعاتٍ لحكمه وتقديره على تقدير النصب\n أو مع أن الكل مسخرات في قبضة قضائه\n يصرفها حسب إرادته ومشيئته على تقدير الرفع { إِنَّ فِي ذَلِكَ } أي: التسخير المذكور { لآيَاتٍ } أي: في كلٍ منها دليل واضح\n وبرهان لائح { لِّقَوْمٍ يَعْقِلُونَ } [النحل: 12] ويستدلون من الآثار إلى المؤثر\n ومن المصنوعات إلى الصانع الحكيم\n\n\n{ وَ } سخر لكم أيضاً { مَا ذَرَأَ } وخلق { لَكُمْ فِي ٱلأَرْضِ مُخْتَلِفاً أَلْوَانُهُ } أشكاله وطبعه على مقتضى أهويتكم وأمزجتكم من الحوائج المتعلقة لحظوظكم وترفهكم { إِنَّ فِي ذَلِكَ لآيَةً لِّقَوْمٍ يَذَّكَّرُونَ } [انحل: 13] ويتفطنون منها إلى كرامة الإنسان من بين سائر الأكوان\n وإلى خلافته ونيابته عن الله\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { مسخراتٍ بأمره } \n أي: مذللات لما يريد منها\n وهو حال من الجميع\n أي: نفعكم بها حال كونها مسخرات لله\n منقادة لحكمه\n أو لما خلقن له\n { إن في ذلك لآيات لقوم يعقلون } أي: لأهل العقول السليمة الصافية من ظلمة الغفلة والشهوات\n وإنما جمع هنا\n دون ما قبله وما بعده لأن الأولى راجعة إلى إنزال المطر\n وهو متحد\n والثالثة راجعة إلى ما ذرأ في الأرض\n وهو متحد في الجنس والهيئة\n بخلاف العوالم العلوية\n فإنها مختلفة في الجنس والهيئة\n\nوقال البيضاوي: جمع الآية وذكر العقل لأنها تتضمن أنواعًا من الدلالة ظاهرة لذوي العقول السليمة\n غير مُحْوِجَةٍ إلى استيفاء فكر\n كأحوال النبات\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:49",
      "similarity": 0.5068480607378739
    },
    {
      "verse": "16:16",
      "similarity": 0.49898193305801136
    },
    {
      "verse": "37:88",
      "similarity": 0.4925145167777536
    },
    {
      "verse": "21:33",
      "similarity": 0.48717488291180716
    },
    {
      "verse": "41:37",
      "similarity": 0.48457492169092325
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}