{
  "chapter": "النحل",
  "text": "هو الذى انزل من السماء ماء لكم منه شراب ومنه شجر فيه تسيمون",
  "translations": [
    {
      "translation": "It is He who sends down water from the sky. From it you drink and from it come the shrubs among which you graze your herds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down water from the sky of which you drink, and which nourishes the plants you feed your cattle,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends down water for you from the sky out of which you drink and out of which grow the plants on which you pasture your cattle,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who sends down water from the sky for you to drink and produces plants as pasture for your cattle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sent down water from the sky – you drink from it, and from it are trees you use as pasture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends water down from the sky; from it you drink and from it (grows) the vegetation on which you send your cattle to pasture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends down water from the cloud for you; it gives drink, and by it (grow) the trees upon which you pasture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down to you out of heaven water of which you have to drink, and of which trees, for you to pasture your herds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sendeth down water from the sky, whence ye have drink, and whence are trees on which ye send your beasts to pasture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down water from the sky. From it you drink and with it trees grow on which you pasture your cattle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who sendeth down from the heaven water for you, wherefrom is drinking and wherefrom are trees whereas ye pasture your herds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down water from the sky: from it you get your drink and with it are [sustained] the plants wherein you pasture your herds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down rain from the sky: from it ye drink, and out of it (grows) the vegetation on which ye feed your cattle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends down water (rain) from the sky; from it you drink and from it (grows) the vegetation on which you send your cattle to pasture;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down water from heaven, which provides drink for you and brings forth trees on which your herds feed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sends down for you from the sky water. From it is drink, and with it grows vegetation for grazing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down rain from the sky; from it is drink and from it is foliage in which you pasture [animals].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:10] He it is Who sends down water from the heaven, whence you have drink, for you to drink, and whence are trees, which grow because of this [water], whereat you let your animals graze.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who sendeth down water) rain (from the sky, whence ye have drink) from the rain which remains in springs and rivers, (and whence are trees) and by means of which tress and vegetation grow (on which ye send your beasts to pasture) on which your cattle are sent to pasture.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِيهِ تُسِيمُونَ } معناه تَرعَون\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"In it you will be dispersed,\" means that you will be scattered.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ليحصل { لَّكُم مِّنْهُ شَرَابٌ } تشربون منه\n أو تعصرونه من القصب والفواكه { وَ } يحل { مِنْهُ شَجَرٌ } أي: أنواع النباتات المستخرجة من الأرض لرعي مواشيكم\n { فِيهِ تُسِيمُونَ } [النحل: 10] وتُسرحون دوابكم للرعي إلى أن يسمن فيؤكل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { لكم منه شراب }: يحتمل أن يتعلق بأنزل، أو يكون في موضع خبر { شراب } ، أو صفة لماء و { مواخر }: جمع ماخرة، يقال: مخرت السفينة الماء مخرًا: شقّته، وقيل: المخر: صوت جَرْىِ الفلك في البحر من هبوب الريح\n وقيل: معناه: تجيء وتذهب بريح واحدة\n و { لتبتغوا }: عطف على \" لتأكلوا \" ، و { أن تميد }: مفعول من أجله، أي: كراهة أن تميد بكم\n و { أنهارًا وسُبلاً }: مفعول بمحذوف، أي: وخلق أو وجعل أنهارًا، وقيل: معطوف على \" رواسي \" لأن ألقى، فيه معنى الجعل، و { علامات }: عطف على { أنهارًا وسبلاً } ، أو نصب على المصدر، أي: ألقى ذلك لعلكم تعتبرون، وعلامات دالة على وحدانيته\n يقول الحقّ جلّ جلاله: { هو الذي أنزل من السماء } أي: السحاب، أو جانب السماء، { ماء }: مطراً { لكم منه شراب } تشربونه بلا واسطة، أو بواسطة العيون والأنهار والآبار لأنه يُحبس فيها، ثم يشرب منها، لقوله:\n\n[الزُّمَر: 21]، وقوله:\n\n[المؤمنون: 18]، { ومنه شجرٌ } أي: ومنه يكون شجر، يعني: الشجر الذي ترعاه المواشي، وقيل: كل ما نبت على الأرض فهو شجر، { فيه تُسِيمُون }: ترعون مواشيكم، من أسام الماشية: رعاها، وأصلها: السومة، التي هي العلامة لأنها تؤثر بالرعي علامات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:83",
      "similarity": 0.5542611517604953
    },
    {
      "verse": "51:34",
      "similarity": 0.47704912540936006
    },
    {
      "verse": "56:68",
      "similarity": 0.4409752730462898
    },
    {
      "verse": "7:48",
      "similarity": 0.41484955089271847
    },
    {
      "verse": "7:167",
      "similarity": 0.39155661151347304
    }
  ]
}