{
  "chapter": "النحل",
  "text": "ولا تقولوا۟ لما تصف السنتكم الكذب هذا حلل وهذا حرام لتفتروا۟ على الله الكذب ان الذين يفترون على الله الكذب لا يفلحون",
  "translations": [
    {
      "translation": "Do not say about what your lying tongues describe: 'This is halal and this is haram,' inventing lies against Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not utter the lies your tongues make up: \"This is lawful, and this is forbidden,\" in order to impute lies to God; for they who impute lies to God will not find fulfilment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not utter falsehoods by letting your tongues declare: \"This is lawful\" and \"That is unlawful,\" thus fabricating lies against Allah. Surely those who fabricate lies against Allah will never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Unbelievers), do not follow whatever your lying tongues may tell you is lawful or unlawful to invent lies against God. Those who invent lies against God will have no happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not say – the lie which your tongues speak – “This is lawful, and this is forbidden” in order to fabricate a lie against Allah; indeed those who fabricate lies against Allah will never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not describe what your tongues have lied about, saying: \"This is lawful and this is forbidden,\" to invent lies against Allah. Verily, those who invent lies against Allah, will never succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, for what your tongues describe, do not utter the lie, (saying) This is lawful and this is unlawful, in order to forge a lie against Allah; surely those who forge the lie against Allah shall not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not say, as to what your tongues falsely describe, 'This is lawful; and this is forbidden, so that you may forge against God falsehood; surely those who forge against God falsehood shall not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And speak not, concerning that which your own tongues qualify (as clean or unclean), the falsehood: \"This is lawful, and this is forbidden,\" so that ye invent a lie against Allah. Lo! those who invent a lie against Allah will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not falsely declare, \"This is lawful, and this is forbidden,\" so as to invent a lie against God. Surely, those who invent a lie against God do not prosper --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say not concerning that wherein Your togues utter a lie: this is lawful, and this is unlawful, that ye may fabricate a lie againt Allah, verily those who fabricate lie against Allah shall not fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not say, asserting falsely with your tongues, ‘This is lawful, and that is unlawful,’ attributing lies to Allah. Indeed those who attribute lies to Allah will not be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But say not - for any false thing that your tongues may put forth,- \"This is lawful, and this is forbidden,\" so as to ascribe false things to Allah. For those who ascribe false things to Allah, will never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say not concerning that which your tongues put forth falsely: \"This is lawful and this is forbidden,\" so as to invent lies against Allah. Verily, those who invent lies against Allah will never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not say what your tongues falsely describe 'This is lawful, and that is forbidden' in order to forge a lie about Allah. Indeed, those who forge a lie about Allah shall never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not say of falsehood asserted by your tongues, “This is lawful, and this is unlawful,” in order to invent lies and attribute them to God. Those who invent lies and attribute them to God will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not say about what your tongues assert of untruth, \"This is lawful and this is unlawful,\" to invent falsehood about Allah. Indeed, those who invent falsehood about Allah will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:116] And do not say, concerning that which your own tongues qualify, falsehood [such as] ‘This is lawful, and this is unlawful’, for what God [respectively] has not made lawful, and what He has not made unlawful, in order to invent lies against God, by attributing such [claims] to Him. Truly those who invent lies against God will not prosper.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And speak not, concerning that which your own tongues qualify (as clean or unclean), the falsehood: \"This) crop and cattle (is lawful) for men, (and this is forbidden\",) for women (so that ye invent a lie against Allah) by means of it. (Lo! those who invent a lie against Allah will not succeed) they will neither be safe nor escape Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَلاَ تَقُولُواْ } أيها المتدينون بدين الإسلام المنزل على خير الأنام { لِمَا تَصِفُ أَلْسِنَتُكُمُ ٱلْكَذِبَ } أي: شيء نصف ومراءً\n بأن تقولوا: { هَـٰذَا حَلاَلٌ وَهَـٰذَا حَرَامٌ } وتنسبوه إلى الله { لِّتَفْتَرُواْ عَلَىٰ ٱللَّهِ ٱلْكَذِبَ } تزينناً لقولكم الباطل\n وترويجاً له\n كما قالوا:\n[الأنعام: 139]\n { إِنَّ ٱلَّذِينَ يَفْتَرُونَ } وينسبون { عَلَىٰ ٱللَّهِ } المنزه عن مطلق الأباطيل { ٱلْكَذِبَ } ظلماً وزوراً { لاَ يُفْلِحُونَ } [النحل: 116] ولا يفوزون بخير الدارينز\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الكذب }: مفعول بتقولوا، و { هذا حلال وهذا حرام }: بدل منه، أي: لا تقولوا الكذب، وهو قولكم: { هذا حلال وهذا حرام } ، و { ما } في قوله: { لما تصف } ويجوز أن ينتصب الكذب بـ { تصف } ، ويكون \" ما \" مصدرية\n ويكون قوله: { هذا حلال وهذا حرام } معمولاً لتقولوا، أي: لا تقولوا: هذا كذا وهذا كذا لأجل وصف ألسنتكم الكذب\n يقول الحقّ جلّ جلاله: { فكلوا مما رزقكم الله حلالاً طيبًا } ، أمرهم بأكل ما أحل لهم، وشُكر ما أنعم عليهم، بعد ما زجرهم عن الكفر، وهددهم عليه، بما ذكر من التمثيل والعذاب الذي حل بهم صدًا لهم عن صنيع الجاهلية ومذاهبها الفاسدة\n قاله البيضاوي: { واشكروا نعمتَ الله } لتدوم لكم { إن كنتم إياه تعبدون } فلا تنسبوا نعمه إلى غيره، كشفاعة الأصنام وغيرها\n { إنما حرّم عليكم الميتةَ والدمَ ولحم الخنزيرِ وما أهلّ لغير الله به فمن اضطر غير باغٍ ولا عادٍ فإن الله غفور رحيم } ، تقدم تفسيرها في البقرة والمائدة\n قال البيضاوي: أمرهم بتناول ما أحل لهم، وعدد عليهم محرماته، ليعلم أن ما عداها حل لهم\n ثم أكد ذلك بالنهي عن التحريم والتحليل بأهوائهم بقوله: { ولا تقولوا لما تَصفُ ألسنتُكم الكذبَ هذا حلالٌ وهذا حرام } لما لم يحله الله ولم يحرمه، كما قالوا:\n\n[الأنعام: 139] الآية\n هـ\n تقولون ذلك { لتفتروا على الله الكذب } بنسبة ذلك إليه\n { إن الذين يفترون على الله الكذب لا يفلحون } أبدًا لأنهم تعجلوا فلاح الدنيا بتحصيل أهوائهم، فحُرموا فلاح الآخرة، ولذلك قال: { متاع قليل } أي: لهم تمتع في الدنيا قليل، يفنى ويزول",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:159",
      "similarity": 0.4948885577302721
    },
    {
      "verse": "37:180",
      "similarity": 0.4775918784043423
    },
    {
      "verse": "16:62",
      "similarity": 0.46825532641433304
    },
    {
      "verse": "43:82",
      "similarity": 0.4384108105087322
    },
    {
      "verse": "6:139",
      "similarity": 0.42107364775222433
    }
  ]
}