{
  "chapter": "النحل",
  "text": "وعلمت وبالنجم هم يهتدون",
  "translations": [
    {
      "translation": "And they are guided by the stars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As well as many other signs, as by the stars (you) find direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He has set other landmarks in the earth. And by the stars too do people find their way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The stars and other signs also help people to find their way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And landmarks; and they are guided by the star.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (by the) landmarks; and by the stars, they guide themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And landmarks; and by the stars they find the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and waymarks; and by the stars they are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And landmarks (too), and by the star they find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He has set up other landmarks. By these and by the stars people set their course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also landmarks; and by the stars they are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—and the landmarks [as well]—and by the stars they are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And marks and sign-posts; and by the stars (men) guide themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And landmarks (signposts, etc. during the day) and by the stars (during the night), they (mankind) guide themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And waymarks; and by the star they are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And landmarks. And by the stars they guide themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And landmarks. And by the stars they are [also] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:16] — and landmarks [as well], by which you might find the roads, [landmarks] such as mountains, during the day, and by the star, meaning, by the stars, they are guided, to the roads and to the direction of prayer (qibla) by night.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And landmarks (too)) mountains and other things for travellers, (and by the star) and by the sun, the moon and the North Star (they) the travellers (find a way) by means of them when travelling on land and in the sea.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } نصب لكم { عَلامَاتٍ } دالة على مقاصدكم في البوادي والبراري بالتلال والوهاد { وَ } في البحار { بِٱلنَّجْمِ } أي: بالنجوم المتعارفة عند البحارين؛ إذ { هُمْ يَهْتَدُونَ } [النحل: 16] بها حين وقوعهم في لجج البحار، كل ذلك من الدلائل الدالة على وحدة الفاعل المختار، المتصف بجميع أوصاف الكمال، المنزه عن مشاركة الأضداد والأمثال، مبدع المخلوقات من كتم العدم بلا سبق مادة وزمان، ومخترع الكائنات بلا علل وأعراض على سبيل الفضل والإحسان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } جعل فيها { علاماتٍ }: معالم يَسْتَدِلُّ بها السابلة على معرفة الطرق من الجبال، والمناهل، والرياح، وغير ذلك، { وبالنجم هم يهتدون } إلى الطرق بالليل، في البراري والبحار، والمراد بالنجم: الجنس، بدليل قراءة: \" وبالنُّجُمِ \" بضمتين على الجمع\n\n\nوقيل: المراد: الثريا، والفرقدان وبنات نعش، والجَدْي\n والضمير لقريش لأنهم كانوا كثيري الأسفار للتجارة، مشهورين بالاهتداء في مسايرهم بالنجوم، وإخراج الكلام عن سنن الخطاب، وتقديم النجم، وإقحام الضمير للتخصيص، كأنه قيل: وبالنجم خصوصًا، هؤلاء خصوصًا يهتدون، يعني: قريشًا، فالاعتبار بذلك، والشكر عليهم ألزم لهم وأوجب عليهم\n هـ\n وأصله للزمخشري\n الإشارة: هو الذي أنزل من سماء الغيوب ماء، أي: علمًا لدنيًا تحيا به القلوب، وتتطهر به النفوس من أدناس العيوب\n لكم منه شراب، خمرة تحيا بها الأرواح، وتغيب عن حضرة الأشباح، ويخرج منه على الجوارح أشجار العمل، تثمر بالأذواق، فيه تسيمون، أي: في أذواق العمل ترعون بنفوسكم وقلوبكم، ثم ترحلون عنه إلى حلاوة شهود ربكم، فمن وقف مع حلاوة العمل، أو المقامات أو الكرامات، بقي محجوبًا عن ربه، وعليه نبّه صاحب البردة بقوله:\n\nوقال في الحكم: \" ربما وقفت القلوب مع الأنوار، كما حُجِبَت النفوس بكثائف الأغيار \"\n وقال الششتري:\n\nيُنبت بذلك العلم طعام نَفوسكم من قوت الشريعة، ومصباح قلوبكم من عمل الطريقة، وثمرة الأعمال في عوالم الحقيقة، وفواكه العلوم من مخازن الفهوم\n وسخر لكم ليل القبض، ونهار البسط لتسكنوا فيه لِمَا خصكم فيه من مقام التسليم والرضا، ولتبتغوا من فضله من فيض العلوم وكشف الغطاء، فتشرق حينئذ شمس العرفان، ويستنير قمر الإيمان، وتطلع نجوم العلم، كل مسخر في محله، لا يستتر أحد بنور غيره، وهذا مقام أهل التمكين، يستعملون كل شيء في محله\n وما ذرأ لكم في أرض نفوسكم من أنواع العبادات وأحوال العبودية، متلونة باعتبار الأزمنة والأمكنة، وهو الذي سخر بحر المعاني لتأكلوا منه لحمًا طريًا علمًا جديدًا لم يخطر على قلب بشر، وتستخرجوا منه جواهر ويواقيت من الحِكَم، تلبسونها وتتزين قلوبكم وألسنتكم بها\n وترى الفلك، أي: سفن الفكرة، فيه مواخر عائمة في بحر الوحدة، بين أنوار الملكوت وأسرار الجَبروت لتبتغوا من فضله، وهي معرفة الحق بذاته وأسمائه وصفاته، ولعلكم تشكرون، فتقيدوا هذه النعم الجسام لئلا تزول\n وألقى في أرض البشرية جبال العقول لئلا يلعب بها ريحُ الهوى، وأجرى عليها أنهارًا من العلوم حين انزجرت عن هواها، وجعل لها طُرقًا تهتدي بها إلى معرفة ربّها، فَتهتدي أولاً إلى نجم الإسلام، ثم إلى قمر توحيد البرهان، ثم إلى شهود شمس العرفان\n وبالله التوفيق\n ولما ذكر دلائل التوحيد أنكره من اشرك بعد هذا البيان\n ثم ذكر بقية التجليات، فقال: { هُوَ ٱلَّذِي أَنْزَلَ مِنَ ٱلسَّمَاءِ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:88",
      "similarity": 0.9074229063981735
    },
    {
      "verse": "53:1",
      "similarity": 0.8152048862023996
    },
    {
      "verse": "52:49",
      "similarity": 0.7447294592150497
    },
    {
      "verse": "55:6",
      "similarity": 0.7327918969776298
    },
    {
      "verse": "56:75",
      "similarity": 0.6483481105204664
    }
  ]
}