{
  "chapter": "النحل",
  "text": "انما جعل السبت على الذين اختلفوا۟ فيه وان ربك ليحكم بينهم يوم القيمة فيما كانوا۟ فيه يختلفون",
  "translations": [
    {
      "translation": "The Sabbath was only enjoined on those who differed about it. Your Lord will judge between them on the Day of Rising regarding the things about which they differed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the Sabbath, it was imposed on those who had differed about it; and your Lord will tell them on the Day of Resurrection what it was they had differed about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the Sabbath, it was made incumbent only on those who differed about its laws. Certainly your Lord will judge on the Day of Resurrection between them regarding the matters they disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The observance) of the Sabbath was only sanctioned for those who disputed it. Your Lord will certainly issue His decree about their dispute on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was made obligatory only upon those who differed in it; and indeed your Lord will judge between them on the Day of Resurrection concerning the matter in which they differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was only prescribed for those who differed concerning it, and verily, your Lord will judge between them on the Day of Resurrection about what they differed over.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was ordained only for those who differed about it, and most surely your Lord will judge between them on the resurrection day concerning that about which they differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was only appointed for those who were at variance thereon; surely thy Lord will decide between them on the Day of Resurrection, touching their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was appointed only for those who differed concerning it, and lo! thy Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was only enjoined on those who differed about it. Your Lord will judge between them on the Day of Resurrection regarding the things about which they differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sabbath was only appointed for those who differed thereon; and verily thy Lord will judge between them on the Judgment-Day concerning that wherein they have been differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was only prescribed for those who differed about it. Your Lord will indeed judge between them on the Day of Resurrection concerning that about which they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was only made (strict) for those who disagreed (as to its observance); But Allah will judge between them on the Day of Judgment, as to their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was only prescribed for those who differed concerning it, and verily, your Lord will judge between them on the Day of Resurrection about that wherein they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was ordained only for those who differed about it. On the Day of Resurrection, your Lord will decide the differences that were between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sabbath was decreed only for those who differed about it. Your Lord will judge between them on the Day of Resurrection regarding their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sabbath was only appointed for those who differed over it. And indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:124] The Sabbath was only prescribed, in other words, its consecration was made obligatory [only], for those who differed concerning it, with their prophet — these were the Jews. They were commanded to devote themselves solely to worship on Friday, but they said, ‘We do not want it’, and chose Saturday; consequently thereon [the observance of] it was enforced strictly on them; and lo! your Lord will judge between them on the Day of Resurrection, concerning that wherein they used to differ, with regard this matter [of the Sabbath], by rewarding the obedient and chastising the one who disobeyed by [his] violating its sanctity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The Sabbath was appointed) was made sacrosanct (only for those who differed concerning it) concerning the day of Friday, (and lo! thy Lord will judge between them) between the Jews and Christians (on the Day of Resurrection concerning that wherein they used to differ) concerning that which they used to oppose in religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنما جعل السبت على الذين اختلفوا فيه } أي: ما فُرِض عليك إنما فرض عليهم فلا يلزمك اتباع موسى في ذلك بل اتباع إبراهيم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتقريعاً لهم: { إِنَّمَا جُعِلَ ٱلسَّبْتُ } أي: قُدر وفرض لحوق وبال يوم السبت\n وأنواع العقوبات والمسخ { عَلَىٰ } المشركين { ٱلَّذِينَ ٱخْتَلَفُواْ فِيهِ } وجادلوا مع نبيهم في تعيينه واختياره\n إذ أمرَهم موسى عليه السلام بتعظيم يوم الجمعة واتخاذها عيداً\n فأبوا معللين: إن الله قد فرغ من خلق السماوات والأرض في السبت\n فنحن نوافقه\n ونتخذه عيداً\n فألزمهم الله تعظيم السبت\n وتحريم الصيد فيه\n فاحتالوا فيه\n فاصطادوا بالمكر\n فمسخهم الله\n ولحقهم من الوبال ما لحقهم { وَإِنَّ رَبَّكَ } يا أكمل الرسل { لَيَحْكُمُ بَيْنَهُمْ يَوْمَ ٱلْقِيَامَةِ فِيمَا كَانُواْ فِيهِ يَخْتَلِفُونَ } [النحل: 124] ويجادلون مع الرسل\n فيجازيهم ويعاقبهم على مقتضى ما صدر عنهم\n\n\nثمَّ أشار سبحانه إلى تتميم تكريم حبيبه صلى الله عليه وسلم\n وتعظيم رتبته\n وتهذيب أخلاقه\n وتكميل حكمته ورسالته\n وتعميم رأفته ورحمته إلى جميع البرية\n وكافة الخليقة\n إذ هو مبعوث على الكل بالرحمة العامة\n وهو خاتم الرسالة والنبوة\n ومكمل أمر التشريع والتكميل\n إذ العلة الغائبة في مطلق التشريع والإنزال والإرسال إنما هي ظهور مرتبته ومكانته التي هي الدعوة إلى التوحيد الذاتي\n ومتى ظهرت فقد كملت وتمت\n لذلك نزل في شأنه:\n[المائدة: 3]\n\n\nوهي آخر أية نزلت من القرآن\n وقال صلى الله عليه وسلم:\n \" بُعِثْتُ لأُِتَمَّمَ مَكَارِمَ الأَخْلاَقِ \" ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { إِنما جُعِل السبتُ } أي: فُرض تعظيمه وإفراده للعبادة، { على الذين اختلفوا فيه } على نبيهم، وهم: اليهود أمرهم موسى عليه السلام أن يتفرغوا للعبادة يوم الجمعة، فأبوا وقالوا: نريد يوم السبت لأنه تعالى فرغ فيه من خلق السماوات والأرض، فألزمهم الله السبت، وشدَّد عليهم فيه. وقيل: لما أمرهم بيوم الجمعة، قَبِلَ بعضهم، وأبى أكثرهم، فاختلفوا فيه. وقيل: اختلافهم: هو أن منهم من حرَّم الصيد فيه، ومنهم من أحله، فعاقبهم الله بالمسخ. والتقدير على هذا: إنما جعل وبال السبت - وهو المسخ -، { على الذين اختلفوا } فأحلوا فيه الصيد تارة، وحرموه أخرى، أو أحله بعضهم، وحرمه بعضهم، وذكرهم هنا تهديدًا للمشركين، كذكر القرية التي كفرت بأنعم الله، { وإِن ربك ليحكم بينهم يوم القيامة فيما كانوا فيه يختلفون } فيجازي كل فريق بما يستحقه، فيثيب المطيع، ويعاقب العاصي. الإشارة: الاختلاف على الأكابر كالشيوخ والعلماء، والتقدم بين أيديهم بالرأي والكلام، من أقبح المساوئ، وسوء الأدب يوجب لصاحبه العطب كالقطع عن الله، والبعد من ساحة حضرته. قال بعضهم: إذا جالست الكبراء فدع ما تعلم لما لا تعلم لتفوز بالسر المكنون. والله تعالى أعلم. ثمَّ أمر نبيه بالدعوة إلى الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:9",
      "similarity": 0.6807211679267432
    },
    {
      "verse": "25:47",
      "similarity": 0.5338077424295784
    },
    {
      "verse": "4:154",
      "similarity": 0.4386604530154288
    },
    {
      "verse": "4:47",
      "similarity": 0.43618099696825474
    },
    {
      "verse": "7:163",
      "similarity": 0.33643056860874754
    }
  ]
}