{
  "chapter": "النحل",
  "text": "ذلك بانهم استحبوا۟ الحيوة الدنيا على الءاخرة وان الله لا يهدى القوم الكفرين",
  "translations": [
    {
      "translation": "That is because they prefer the life of this world to the Next World and because Allah does not guide kafir people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For they loved the life of this world more than the life to come; and God does not guide those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they love the life of this world more than the Hereafter; and Allah does not guide those who are ungrateful to Allah for His favours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they have given preference to this life over the life to come and God does not guide disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because the worldly life was dearer to them than the Hereafter; and because Allah does not guide such disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they preferred the life of this world over that of the Hereafter. And Allah does not guide the people who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they love this world's life more than the hereafter, and because Allah does not guide the unbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that, because they have preferred the present life over the world to come, and that God guides not the people of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they have chosen the life of the world rather than the Hereafter, and because Allah guideth not the disbelieving folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they prefer the life of this world to the Hereafter and because God does not guide those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they loved the life of the world above the Hereafter, and because Allah guideth not an infidel people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, because they preferred the life of the world to the Hereafter and that Allah does not guide the faithless lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This because they love the life of this world better than the Hereafter: and Allah will not guide those who reject Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they loved and preferred the life of this world over that of the Hereafter. And Allah guides not the people who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they loved this present life above the Everlasting Life. Allah does not guide the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they have preferred the worldly life to the Hereafter, and because God does not guide the people who refuse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they preferred the worldly life over the Hereafter and that Allah does not guide the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:107] That, threat [of chastisement] for them, is because they have preferred the life of this world, they have chosen it [in preference], to the Hereafter, and because God does not guide the disbelieving folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) torment (is because they have chosen the life of the world) they preferred this worldly life (rather than the Hereafter) and chose disbelief instead of faith, (and because Allah guideth not) to His religion nor save them from His torment (the disbelieving folk) who do not deserve it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوما { ذٰلِكَ } أي: تحسينهم الكفر، واستطابتهم به إلاَّ { بِأَنَّهُمُ ٱسْتَحَبُّواْ } واستطابوا { ٱلْحَيَاةَ ٱلْدُّنْيَا } أي: الحياة الصورية المستعارة الزائلة { عَلَىٰ } حياة { ٱلآخِرَةِ } التي هي الحياة المعنوية الحقيقية السرمدية التي لا زوال لها أصلاً { وَ } أيضاً بسبب { أَنَّ ٱللَّهَ } المطلع على استعدادات عباده { لاَ يَهْدِي } إلى الإيمان والتحيد { ٱلْقَوْمَ ٱلْكَافِرِينَ } [النحل: 107] المجبولين على الكفر والعناد بحسب أصل فطرتهم واستعداداتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم علل نزول العذاب بهم، فقال: { ذلك } الوعيد { بأنهم استحبُّوا الحياةَ الدنيا على الآخرة } أي: بسبب أنهم آثروها عليها، { وأنَّ الله لا يهدي القوم الكافرين } ، الذين سبق لهم الشقاء، فلا يهديهم إلى ما يوجب ثبات الإيمان في قلوبهم، ولا يعصمهم من الزيغ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:56",
      "similarity": 0.48605187712723164
    },
    {
      "verse": "36:33",
      "similarity": 0.4143147361391433
    },
    {
      "verse": "3:148",
      "similarity": 0.41381483261869856
    },
    {
      "verse": "3:32",
      "similarity": 0.4118011109085379
    },
    {
      "verse": "40:51",
      "similarity": 0.3941699036257576
    }
  ]
}