{
  "chapter": "النحل",
  "text": "انما حرم عليكم الميتة والدم ولحم الخنزير وما اهل لغير الله به فمن اضطر غير باغ ولا عاد فان الله غفور رحيم",
  "translations": [
    {
      "translation": "He has forbidden carrion and blood and the flesh of the swine, and what has been killed in the name of any other but God; but if one is driven by necessity (to eat it) without craving or reverting to it, then God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has forbidden you only carrion, and blood, and the flesh of swine; also any animal over which the name of any other than Allah has been pronounced. But whoever eats of them under compelling necessity - neither desiring it nor exceeding the limit of absolute necessity - surely for such action Allah is Much Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only things which are made unlawful for you are the flesh of dead animals, blood, pork and that which is not consecrated with the Name of God. But in an emergency, without the intention of transgression and rebellion, (it is not an offense for one to consume such things). God is certainly All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only these are forbidden for you – the carrion, and blood, and flesh of swine, and that which has been slaughtered while proclaiming the name of any other besides Allah; so one who is compelled and does not eat out of desire, nor more than what is necessary, then indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has only forbidden dead flesh, blood, the flesh of swine, and any animal which is slaughtered as a sacrifice for other than Allah. But if one is forced by necessity, without willful disobedience, nor transgressing, then, Allah is Pardoning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has only forbidden you what dies of itself and blood and flesh of swine and that over which any other name than that of Allah has been invoked, but whoever is driven to necessity, not desiring nor exceeding the limit, then surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These things only He has forbidden you: carrion, blood, the flesh of swine, what has been hallowed to other than God. Yet whoso is constrained, not desiring nor transgressing, God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath forbidden for you only carrion and blood and swineflesh and that which hath been immolated in the name of any other than Allah; but he who is driven thereto, neither craving nor transgressing, lo! then Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only carrion, blood and the flesh of swine; also any [flesh] consecrated in the name of any but God. But if anyone is forced by dire necessity, not desiring it or exceeding his immediate need, God is forgiving and merciful towards him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath only disallowed unto you the dead-meat and blood and swine-flesh and that over which is invoked the name of other than Allah. Then whosoever is driven by necessity, not alusting nor transgressing verily Allah Is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only carrion, blood, the flesh of swine, and that which has been offered to other than Allah. But if someone is compelled [to eat any of that], without being rebellious or aggressive, indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has only forbidden you dead meat, and blood, and the flesh of swine, and any (food) over which the name of other than Allah has been invoked. But if one is forced by necessity, without wilful disobedience, nor transgressing due limits,- then Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only Al-Maytatah (meat of a dead animal), blood, the flesh of swine, and any animal which is slaughtered as a sacrifice for others than Allah (or has been slaughtered for idols etc. or on which Allah's Name has not been mentioned while slaughtering). But if one is forced by necessity, without wilful disobedience, and not transgressing, then, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These things alone He has forbidden to you: what is already dead, blood, the flesh of swine, what has been offeredup to other than Allah. But to whoever is forced to eat any of these, neither desiring nor wanting to transgress, Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you carrion, and blood, and the flesh of swine, and anything consecrated to other than God. But if anyone is compelled by necessity, without being deliberate or malicious, then God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has only forbidden to you dead animals, blood, the flesh of swine, and that which has been dedicated to other than Allah. But whoever is forced [by necessity], neither desiring [it] nor transgressing [its limit] - then indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:115] He has forbidden you only carrion, blood, the flesh of swine, and that which has been hallowed to other than God. Yet whoever is compelled, neither craving nor transgressing, then truly God is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He hath forbidden for you only carrion) which He commanded you to immolate (and blood) shed blood (and swine flesh and that which hath been immolated in the name of any other than Allah) and that which is intentionally immolated in other than the name of Allah, or in the name of idols; (but he who is driven thereto) he who is forced to indulge in what is made unlawful by Allah, (neither craving) declaring it lawful (nor transgressing) intentionally eating without being forced to, (lo! then Allah is Forgiving) of eating carrion, (Merciful) since He gave a legal dispensation to eat carrion in case of dire necessity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّمَا حَرَّمَ عَلَيْكُمُ ٱلْمَيْتَةَ } أي: اعلموا ما حرَّم عليكم ربكم في دينكم إلاَّ الميتة المائتة حتف أنفه بلا تزكية وتسمية { وَٱلْدَّمَ } المسفوح السائل من الحيوانات المباحة { وَلَحْمَ ٱلْخَنْزِيرِ وَمَآ أُهِلَّ لِغَيْرِ ٱللَّهِ بِهِ } وسُمِّي عليه من أسماء الأصنام { فَمَنِ ٱضْطُرَّ } منكم أيها المؤمنون إلى أكل هذه المحرمات، حال كونه { غَيْرَ بَاغٍ } خارج على السلطان العادل، المقيم للشرائع والأحكام { وَلاَ عَادٍ } مجاوزٍ عن الحدود الشرعية لغرضٍ فاسدٍ من أنواع المعاصي، وقطع الطريق والإباق { فَإِنَّ ٱللَّهَ } المطلع على سرائر عباده وضمائرهم { غَفُورٌ } يستر زلتهم الاضطرارية { رَّحِيمٌ } [النحل: 115] يقبل توبتهم عنها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}