{
  "chapter": "النحل",
  "text": "فكلوا۟ مما رزقكم الله حللا طيبا واشكروا۟ نعمت الله ان كنتم اياه تعبدون",
  "translations": [
    {
      "translation": "So eat from what Allah has provided for you, halal and good, and be thankful for the blessing of Allah if it is Him you worship.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat the good and lawful of things that God has given you, and be grateful for the bounty of God, if you really worship Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat out of the lawful and good sustenance that Allah has bestowed upon you, and thank Allah for His bounty, if it is Him that you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(People), consume the pure and lawful sustenance which God has given to you and thank God for his bounty if you are His true worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore eat the lawful and good sustenance Allah has provided you, and be grateful for the blessings of your Lord, if you worship Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of the lawful and good food which Allah has provided for you. And be grateful for Allah's favor, if it is He Whom you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore eat of what Allah has given you, lawful and good (things), and give thanks for Allah's favor if Him do you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of what God has provided you lawful and good; and be you thankful for the blessing of God, if it be Him that you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of the lawful and good food which Allah hath provided for you, and thank the bounty of your Lord if it is Him ye serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat the lawful and good things which God has provided for you, and be thankful for the blessing of God, if it is Him you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of that which Allah hath provided you of lawful and clean things, and give thanks for Allah's favour, if it is He whom ye are went to Worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat out of what Allah has provided you as lawful and good, and give thanks for Allah’s blessing, if it is Him that you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of the sustenance which Allah has provided for you, lawful and good; and be grateful for the favours of Allah, if it is He Whom ye serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of the lawful and good food which Allah has provided for you. And be grateful for the Graces of Allah, if it is He Whom you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of the lawful and good things with which Allah has provided you and be thankful for the favors of Allah if it is He you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of the lawful and good things God has provided for you, and be thankful for God’s blessings, if it is Him that you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then eat of what Allah has provided for you [which is] lawful and good. And be grateful for the favor of Allah, if it is [indeed] Him that you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:114] So eat, O believers, of the lawful and good food which God has provided you, and be thankful for God’s grace, if it is Him that you worship.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So eat of the lawful and good food which Allah hath provided for you) of crops and cattle and wholesome things, (and thank) and remember (the bounty of your Lord if it is Him ye serve) if it is really Him you want to worship through the prohibition of some cattle and crops. If you have done so to worship Allah, then make them lawful, for worshipping Allah entails making lawful that which you have made forbidden.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا سمعتم أيها المؤمنون المعتبرون من أحوال أولئك الأشقياء، المغمورين في بحر الغفلة والغرور، البَطِرين بما عندهم من اللذة والسرور، وسمعتم أيضاً أحوالهم وأهوالهم { فَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَـٰلاً } مباحاً بحسب الشرع { طَيِّباً } مما كسبتم بيمينكم على مقتضى سنة الله من خلق الأيدي والأرجل للمكاسب، أو مما اتجرتم وربحتم، وهو من الكسب أيضاً { وَٱشْكُرُواْ نِعْمَتَ ٱللَّهِ } الذي أقدركم ومكَّنكم على الكسب { إِن كُنْتُمْ إِيَّاهُ تَعْبُدُونَ } [النحل: 114] أي: تطيعون وتقصدون عبادته برفع الوسائل والأسباب العادية عن البَيْن\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}