{
  "chapter": "النحل",
  "text": "وما ذرا لكم فى الارض مختلفا الونه ان فى ذلك لءاية لقوم يذكرون",
  "translations": [
    {
      "translation": "And also the things of varying colours He has created for you in the earth. There is certainly a Sign in that for people who pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And other things of different shades has He produced on the earth for you. In this are signs for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are also Signs for those who take heed in the numerous things of various colours that He has created for you on earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that He has created for you on the earth are of different colors. In this there is evidence of the Truth for the people who take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the things He has created for you in the earth, of numerous colours; indeed in this is a sign for people who remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all He has created of varying colors on the earth for you. Verily, in this is a sign for people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what He has created in the earth of varied hues most surely there is a sign in this for a people who are mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which He has multiplied for you in the earth of diverse hues. Surely in that is a sign for a people who remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever He hath created for you in the earth of divers hues, lo! therein is indeed a portent for people who take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the earth He has fashioned for you objects of various hues: there is certainly a sign in that for people who pay heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath subjected for you whatsoever He hath multiplied for you on the earth of various kinds. Verily therein is a sign for a people who receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [He disposed for your benefit] whatever He has created for you in the earth of diverse hues—there is indeed a sign in that for a people who take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the things on this earth which He has multiplied in varying colours (and qualities): verily in this is a sign for men who celebrate the praises of Allah (in gratitude).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever He has created for you on this earth of varying colours [and qualities from vegetation and fruits, etc. (botanical life) and from animal (zoological life)]. Verily! In this is a sign for people who remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what He has multiplied for you in the earth is of various hues; surely, in that there is a sign for a nation who remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatsoever He created for you on earth is of diverse colors. Surely in that is a sign for people who are mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [He has subjected] whatever He multiplied for you on the earth of varying colors. Indeed in that is a sign for a people who remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:13] And, He has disposed for you, whatever He has created for you in the earth, of animals, plants and otherwise, diverse in hue, such as red, yellow, green and otherwise. Surely in that there is a sign for people who remember, [a people who] are admonished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whatsoever He hath created for you in the earth of diverse hues) of different species of plants and fruits and other things, (lo! Therein) in the different things that Allah has created (is indeed a portent) a sign and lesson (for people who take heed) for people who take admonition from that which is in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا ذَرَأَ لَكُمْ } معناه مَا خَلَقَ لَكُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And He has not created you for amusement\" - this means that He has not created you for His own amusement or enjoyment.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما ذرأ } أي: وسخر لكم ما ذرأ\n فهو عطف على الليل\n أي: سخر لكم ما خلق لكم في الأرض من حيوانات ونبات\n { مختلفاً ألوانه } أبيض وأسود\n أحمر وأصفر\n مع اتحاد المادة\n فالماء واحد والزهر ألوان\n { إن في ذلك لآية لقوم يذّكرون } يتذكرون أن اختلافها في الألوان والطبائع\n والهيئات والمناظر\n ليس إلا بصنع صانع حكيم\n { وهو الذي سخَّر البحرَ }: ذللـه بحيث هيأه للتمكن من الانتفاع به بالركوب فيه\n والاصطياد\n والغوص",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:79",
      "similarity": 0.6456371380343564
    },
    {
      "verse": "67:24",
      "similarity": 0.6447525802183877
    },
    {
      "verse": "30:22",
      "similarity": 0.5866724226406496
    },
    {
      "verse": "42:11",
      "similarity": 0.5466364858680328
    },
    {
      "verse": "35:28",
      "similarity": 0.51428354593643
    }
  ]
}