{
  "chapter": "النحل",
  "text": "وهو الذى سخر البحر لتاكلوا۟ منه لحما طريا وتستخرجوا۟ منه حلية تلبسونها وترى الفلك مواخر فيه ولتبتغوا۟ من فضله ولعلكم تشكرون",
  "translations": [
    {
      "translation": "It is He who made the sea subservient to you so that you can eat fresh flesh from it and bring out from it ornaments to wear. And you see the ships cleaving through it so that you can seek His bounty, and so that hopefully you will show thanks.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has subdued the sea that you may eat fresh meat from it, and obtain ornaments to wear. You see the ships plough through it that you may seek of His bounties and, perhaps, be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has subjected the sea that you may eat fresh fish from it and bring forth ornaments from it that you can wear. And you see ships ploughing their course through it so that you may go forth seeking His Bounty and be grateful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who put the oceans at your disposal so that you could find therein fresh fish for food and ornaments with which to deck yourselves with. You will find ships that sail for you so that you may travel in search of the bounties of God and give Him thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who subjected the sea for you, so you eat fresh meat from it, and extract ornaments from it which you wear; and you see ships ploughing through it and in order that you may seek His munificence and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who subjected the sea (to you), that you may eat from the fresh tender meat, and that you bring forth out of it ornaments to wear. And you see the ships plowing through it, that you may seek from His bounty and that you may perhaps be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has made the sea subservient that you may eat fresh flesh from it and bring forth from it ornaments which you wear, and you see the ships cleaving through it, and that you might seek of His bounty and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who subjected to you the sea, that you may eat of it fresh flesh, and bring forth out of it ornaments for you to wear; and thou mayest see the ships cleaving through it; and that you may seek of His bounty, and so haply you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who hath constrained the sea to be of service that ye eat fresh meat from thence, and bring forth from thence ornaments which ye wear. And thou seest the ships ploughing it that ye (mankind) may seek of His bounty and that haply ye may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who subjected to you the sea, so that you may eat its fresh seafood and bring forth from it ornaments to wear. You see the ships cleaving through it. All this, so that you may seek His bounty and feel grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is who hath subjected the sea that ye may eat thereout flesh fresh and bring forth therefrom ornaments that ye wear. And thou beholdest ships ploughing therein, and it is in order that ye may seek of His grace, and that haply ye may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who disposed the sea [for your benefit] that you may eat from it fresh meat, and obtain from it ornaments which you wear, and you see the ships plowing through it, that you may seek His bounty and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has made the sea subject, that ye may eat thereof flesh that is fresh and tender, and that ye may extract therefrom ornaments to wear; and thou seest the ships therein that plough the waves, that ye may seek (thus) of the bounty of Allah and that ye may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has subjected the sea (to you), that you eat thereof fresh tender meat (i.e. fish), and that you bring forth out of it ornaments to wear. And you see the ships ploughing through it, that you may seek (thus) of His Bounty (by transporting the goods from place to place) and that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has subjected the sea to you, so that you eat of its soft flesh and bring up from it ornaments which you wear. And you see the ships plowingtheir course through it in order that you seek His bounty and give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who made the sea to serve you, that you may eat from it tender meat, and extract from it ornaments that you wear. And you see the ships plowing through it, as you seek His bounties, so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who subjected the sea for you to eat from it tender meat and to extract from it ornaments which you wear. And you see the ships plowing through it, and [He subjected it] that you may seek of His bounty; and perhaps you will be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:14] And He it is Who disposed the sea, [He it is Who] subdued it, that it might be sailed upon and dived in, that you may eat from it fresh meat, that is, fish, and bring forth from it ornaments which you wear, namely, pearls and coral. And you see, observe, the ships ploughing therein, ploughing through the water, that is, cleaving it as they sail upon it, coming and going with the same wind; and that you may seek (wa-litabtaghū is a supplement to li-ta’kulū, ‘that you may eat’) of His bounty, exalted He be, by way of commerce, and that you might be thankful, to God for [all] that.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He it is Who hath constrained the sea to be of service) to be subservient (that ye eat fresh meat) i.e. 283 fish (from thence, and bring forth from thence) from the sea (ornaments) embellishments: pearls and other things (which ye wear. And thou seest the ships ploughing it) you see the ships coming and going in the sea by means of the same wind (that ye (mankind) may seek of His bounty) of His deeds; it is also said that this means: of His provision, (and that haply ye may give thanks) to His bounty.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَرَى ٱلْفُلْكَ مَوَاخِرَ فِيهِ } وهي السُّفنُ التي تَشقُّ المَاءَ شقاً ذَاهِبةً وجَائيةً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَهُوَ ٱلَّذِي سَخَّرَ } لكم { ٱلْبَحْرَ } من كمال لطفه وتكريمه إياكم { لِتَأْكُلُواْ مِنْهُ لَحْماً طَرِيّاً } وهو السمك { وَتَسْتَخْرِجُواْ مِنْهُ حِلْيَةً } وزينة من الجواهر النفيسة { تَلْبَسُونَهَا } وتتزينون بها ترفهاً وتنعماً { وَتَرَى } أيها الرائي { ٱلْفُلْكَ } أي: السفن { مَوَاخِرَ فِيهِ } أي: جواري مشققات للبحر، مسيرات لمن فيها على الماء { وَ } ما ذلك إلاَّ { لِتَبْتَغُواْ } وتطلبوا { مِن فَضْلِهِ } وجوده ما يعينكم، ويليق بكم من الحوائج والأرباح وغير ذلك { وَ } إنما سخر سبحاه ما سخر عليكم من البرح والبحر { لَعَلَّكُمْ تَشْكُرُونَ } [النحل: 14] رجاء أن تواظبوا وتداوموا على شكر نعمه، وتصرفوها طلباً لمرضاته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو الذي سخَّر البحرَ }: ذللـه بحيث هيأه للتمكن من الانتفاع به بالركوب فيه، والاصطياد، والغوص، { لتأكلوا منه لحمًا طريًّا } هو السمك، ووصفة بالطراوة لأنه أرطب اللحوم، فيسرع إليه الفساد، فيسارع إلى أكله طريًّا، ولإظهار قدرته في خلقه عذبًا طريًّا في ماء زُعاق أُجاج، واحْتَج به مالك على أن من حلف ألا يأكل لحمًا حنث بأكل السمك، وأجيب بأن مبني الأيمان على العُرف، وهو لا يُفهم منه عند الإطلاق ألا ترى أن الله سمى الكافر دابة، ولا يحنث من حلف ألا يركب دابة بركوبه\n قاله البيضاوي\n ويجاب بالاحتياط فالحنث يقع بأدنى شيء، بخلاف البِر، لا يقع إلا بأتم الأشياء\n { وتستخرجوا منه حِلْيةً } كاللؤلؤ والمرجان، { تلْبسونها } يلبسها نساؤكم، وأسند اللباس إليهم لأن لباس النساء تزين للرجال، فكأنه مقصودٌ لهم، { وترى الفلك }: السفن { مواخر فيه } جواري فيه تمخر الماء، أي: تشقه، أو تُصوت من هبوب الريح، { ولتبتغوا من فضله }: من سعة رزقه بركوبه للتجارة، أو: وترى الفلك جواري فيه لتركبوها، ولتبتغوا من سعة رزقه\n قال ابن عطية: فيه إباحة ركوب البحر للتجارة وطلب الأرباح\n هـ\n { ولعلكم تشكرون } أي: تعرفون نعم الله فتقوموا بشكرها\n ولعل تخصيصه بتعقيب الشكر لأنه أقوى في باب الإنعام من حيث جعل المهالك سببًا للانتفاع، وتحصيل المعاش\n قاله البيضاوي",
      "translations": []
    }
  ]
}