{
  "chapter": "النحل",
  "text": "والقى فى الارض روسى ان تميد بكم وانهرا وسبلا لعلكم تهتدون",
  "translations": [
    {
      "translation": "He cast firmly embedded mountains on the earth so it would not move under you, and rivers and pathways so that hopefully you would be guided, and landmarks.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He placed stablisers in the earth so that while it revolves you live undisturbed, and rivers and tracks so that you may find your way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has placed firm mountains on the earth lest it should move away from you, and has made rivers and tracks that you may find your way,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has fixed the mountains on earth lest you should be hurled away when it quakes. Therein He has also made rivers and roads so that you will find your way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He placed mountains as anchors in the earth so that it may not shake along with you, and streams and roads for you to find course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has driven firm standing mountains into the earth, lest it should shake with you; and rivers and roads, that you may guide yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has cast great mountains in the earth lest it might be convulsed with you, and rivers and roads that you may go aright,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He cast on the earth firm mountains, lest it shake with you, and rivers and ways; so haply you will be guided;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath cast into the earth firm hills that it quake not with you, and streams and roads that ye may find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has set up on the earth firm mountains, lest it shake under you, and rivers and tracks, so that you may find your way,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath cast on the earth firm mountains lest it move away with you, and rivers and paths that haply ye may be directed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He cast firm mountains in the earth lest it should shake with you, and [made] streams and ways, so that you may be guided\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has set up on the earth mountains standing firm, lest it should shake with you; and rivers and roads; that ye may guide yourselves;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has affixed into the earth mountains standing firm, lest it should shake with you, and rivers and roads, that you may guide yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He set firm mountains upon the earth lest it should shake with you; and rivers, and roads, in order that you are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he cast mountains on the earth, lest it shifts with you; and rivers, and roads, so that you may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has cast into the earth firmly set mountains, lest it shift with you, and [made] rivers and roads, that you may be guided,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:15] And He cast into the earth firm mountains, lest it should shake, move, with you, and, He made therein, rivers, such as the Nile, and ways, roads, so that you might be guided, to your destinations,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He hath cast into the earth firm hills) firm mountains (that it) the earth (quake not with you, and streams) and He made rivers flow therein for your own benefit (and roads) and He made therein roads (that ye may find a way) in order that you find your way therein.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَن تَمِيدَ بِكُمْ } معناهُ تَمِيلُ بكُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"that you may incline [to them]\" - its meaning is that you may lean towards them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من رحمته ولطفه أيضاً { أَلْقَىٰ فِي ٱلأَرْضِ } التي هي مستقركم ومشؤكم { رَوَاسِيَ } مخافة { أَن تَمِيدَ } وتتحرك { بِكُمْ } ولا يمكن استقراركم علهيا لاضطرابها وتزلزلها؛ إذ هي في طبعها كرة حقيقية، ملقاة على الماء، مغمورة فيه، فلما ألقاها سبحانه عنايةً منه رواسي ثقالاً، صارت متفارقة الأطراف في الثقل، فاستقرت وتثبتت { وَ } أيضاً جرى لكم { أَنْهَاراً } عليها؛ كي يمكنكم الاستقساء منها لدى الحاجة { وَ } عين لكم بين الجبال الراسيات { سُبُلاً } نافذات { لَّعَلَّكُمْ تَهْتَدُونَ } [النحل: 15] إلى ما تقصدون من البلدان البعيدة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وألقى في الأرض رواسي } جبالاً رواسي أرست الأرض كراهة { أن تميد بكم } تميل وتضطرب لأن الأرض قبل أن تُخلق فيها الجبال كانت كرة خفيفة بسيطة، وكان من حقها أن تتحرك كالسفينة على البحر، فلما خُلقت الجبال تقاومت جوانبها بثقلها نحو المركز، فصارت كالأوتاد التي تمنعها عن الحركة\n وقيل: لما خلق الله الأرض جعلت تمور - أي: تتحرك - فقالت الملائكة: ما يستقر أحد على ظهرها، فأصبحت وقد أرْسيَتْ بالجبال\n { وأنهارًا } أي: وجعل فيها أنهارًا تطرد لسقي الناس والبهائم، وسائر المنافع، وذكره بعد الجبال لأن الغالب انفجارها منها، { وسُبلاً } أي: وجعل فيها طُرقًا { لعلكم تهتدون } لمقاصدكم، أو لمعرفة ربكم، بالنظر في دلالة هذه المصنوعات المتقدمة، على صانعها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:31",
      "similarity": 0.6246927399429116
    },
    {
      "verse": "5:112",
      "similarity": 0.5606719715673993
    },
    {
      "verse": "31:10",
      "similarity": 0.5536156390068416
    },
    {
      "verse": "5:114",
      "similarity": 0.4722703678339423
    },
    {
      "verse": "79:32",
      "similarity": 0.35142530005142913
    }
  ]
}