{
  "chapter": "النحل",
  "text": "اتى امر الله فلا تستعجلوه سبحنه وتعلى عما يشركون",
  "translations": [
    {
      "translation": "Allah's command is coming, so do not try to hasten it. Glory be to Him! He is exalted above anything they associate with Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "THE DECREE of GOD will surely come; so do not try to hasten it: Too glorious and high is He for what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's judgement has (all but) come; do not, then, call for its speedy advent. Holy is He, and far above their associating others with Him in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God's help will certainly support (the believers), so pagans do not (seek) to hasten it. God is too Glorious and Exalted to be considered equal to idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The command of Allah is arriving soon, therefore do not seek to hasten it; Purity and Supremacy are to Him, above all the partners (they ascribe).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Event ordained by Allah has indeed come, so do not seek to hasten it. Glorified and Exalted be He above all that they associate as partners with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's commandment has come, therefore do not desire to hasten it; glory be to Him, and highly exalted be He above what they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God's command comes; so seek not to hasten it. Glory be to Him! High be He exalted above that they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The commandment of Allah will come to pass, so seek not ye to hasten it. Glorified and Exalted be He above all that they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The decree of God is at hand, so do not seek to hasten it. Holy is He, and exalted far above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The affair of Allah cometh, so seek not to hasten it. Hallowed be He and Exalted above that which they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah’s edict is coming! So do not seek to hasten it. Immaculate is He and exalted above [having] any partners that they ascribe [to Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Inevitable) cometh (to pass) the Command of Allah: seek ye not then to hasten it: Glory to Him, and far is He above having the partners they ascribe unto Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Event (the Hour or the punishment of disbelievers and polytheists or the Islamic laws or commandments), ordained by Allah will come to pass, so seek not to hasten it. Glorified and Exalted be He above all that they associate as partners with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Command of Allah will surely come; do not seek to hasten it. Highly exalted is He above that they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The command of God has come, so do not rush it. Glory be to Him; exalted above what they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The command of Allah is coming, so be not impatient for it. Exalted is He and high above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:1] When the idolaters found chastisement slow in coming, the following was revealed: God’s commandment has come, that is, the Hour [has come] ([this verb] atā is in the past tense because it means that [the event therein described] will come to pass) in other words, it [God’s commandment] is close at hand, so do not seek to hasten it, do not demand it before its [due] time, for it will come to pass without doubt. Glory be to Him — an affirmation of His transcendence — and exalted be He above what they associate, with Him, in the way of others.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his chain of transmitters on the authority of Ibn 'Abbas that he said: 'When the words of Allah (The reckoning draws near for mankind...) [21:1] and (The hour drew near...) [54:1], people waited whatever time Allah willed them to wait, but nothing happened. So they said: \"0 Muhammad! When will the torment which you promised us happen?\" As a response, Allah revealed: (The commandment of Allah will come to pass) the chastisement of Allah has come. The Prophet (pbuh) was sitting at that point and he suddenly stood, having no doubt in his mind that the chastisement had come. But immediately after that, Allah said: (so seek not ye to hasten it) i.e. the chastisement, at which the Prophet (pbuh) sat down. (Glorified) Allah exonerated Himself from having a son or partner (and Exalted be He) He is too elevated and absolves Himself (above all that they associate (with Him)) of idols.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأَخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قالَ: حدّثنا عطاءُ بن السائب عن أبي خالد عن زيد بن علي عليهما السلام في قوله تعالى: { أَتَىٰ أَمْرُ ٱللَّهِ } معناه الأَحكامُ والحُدُودُ والفَرائِضُ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\n{He} said: {We} were told by {Ali ibn Ahmad}\n\n\nHe said: Ata ibn al-Saaib narrated to us from Abu Khalid from Zayd ibn Ali, peace be upon them, regarding the saying of Allah, {the affair of Allah has come}, its meaning is the rulings and boundaries and obligations.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أتى أمرُ الله } لما كان صلى الله عليه وسلم من أهل القيامة الكبرى يشاهدها ويشاهد أحوالها في عين الجمع\n كما قال صلى الله عليه وسلم:\n \" بُعِثْتُ أنا والساعة كهاتين \" \nأخبر عن شهوده بقوله تعالى: { أتى أمر الله } ولما كان ظهورها على التفصيل بحيث تظهر لكل أحد لا يكون إلا بوجود المهدي عليه السلام قال: { فلا تستعجلوه } لأن هذا ليس وقت ظهوره\n ثم أكد شهوده لوجه الله وفناء الخلق في القيامة بقوله: { سبحانه وتعالى عمّا يُشْرِكون } من إثبات وجود الغير\n ثم فصّل ما شهد في عين الجمع لكونه في مقام الفرق بعد الجمع يشاهد كثرة الصفات في عين أحدية الذات بحيث لا يحتجب بالوحدة عن الكثرة ولا بالعكس\n كما ذكر في قوله تعالى:\n[آل عمران\n الآية: 18] الآية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك أخبر سبحانه عن إتيانه ووقوعه بالجلمة الماضوية تنبيهاً على تحقق وقوعه\n فقال: { أَتَىٰ أَمْرُ ٱللَّهِ } أي: يومه الموعود الذي انكشفت فيه السدول\n ولاحت الأسرار\n واترتفعت حجب التعينات والأستار\n واضمحلت السّوى والأغيار\n ونودي من وراء سرادقات العز والجلال بعد انقهار الكل:\n[غافر: 16]؟ وأيجب أيضاً من ورائها:\n[غافر: 16]\n { أَتَىٰ أَمْرُ ٱللَّهِ فَلاَ تَسْتَعْجِلُوهُ } أي: لا تستعجلوا وقوعه أيها المترددون الشاكون في أمره { سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ } [النحل: 1] له من الآلهة الباطلة\n ويدّعون شفاعتها لهم عند الله لدى الحاجة\n\n\nبل هو الله الاحد الأحد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { أتى أمرُ الله } أي: البعث والحساب. وعبّر بالماضي لتحقق وقوعه، أو: ثبت أمره وقضاؤه، وقد جفّ القلم بما يكون لا عن سؤال واستعجال، وتدبير من الخلق، ولو كان كذلك لنافى انفراده بتدبير ملكه، ولذلك نزّه نفسه بقوله: { سبحانه وتعالى عما يشركون }. أو: إهلاك الله إياهم يوم بدر، وكانوا يستعجلون ما أوعدهم الرسول من قيام الساعة، وإهلاكهم ونصره عليهم، استهزاء وتكذيباً ولذلك قال: { فلا تستعجلوه } ، والمعنى: أن الأمر الموعود به بمنزلة الماضي، لتحقّق وقوعه من حيث إنه واجب الوقوع فلا تستعجلوا وقوعه، فإنه لا خير لكم فيه، ولا خلاص لكم منه. ورُوِيَ لمّا نزل قوله: { أتى أمر الله } ، وثب رسولُ الله صلى الله عليه وسلم قائماً، ورفع الناس رؤوسهم، فلما قال: { فلا تستعجلوه } ، سكن. وكان المشركون يقولون: إن صح ما يقول محمد من قيام الساعة، فالأصنام تشفع لنا وتخلصنا، فقال تعالى: { سبحانه وتعالى عما يشركون } أي: تنزه وجلَّ عن أن يكون له شريك، فيدفع ما أراد بهم. هـ. وقرأ الأخوان بالخطاب، على وفق قوله: { فلا تستعجلوه } ، والباقون بالغيب، على تلوين الخطاب، أو على أن الخطاب للمؤمنين، أي: أتى أمر الله أيها المؤمنون فلا تستعجلوه، سبحانه وتعالى عما يشركه به المشركون. أو: لهم ولغيرهم. والله تعالى أعلم. الإشارة: إذا أشرق نورُ اليقين في صميم القلوب تحقق وقوع ما وعد الله به من أمر الغيوب، فصار الماضي آتياً، والمستقبل واقعًا. وفي الحكم: \" لو أشرق نور اليقين في قلبك، لرأيت الآخرة أقرب من أن ترحل إليها، ولرأيت الدنيا وكسفةُ الفناء ظاهرةٌ عليها \". وكذلك المقادير المستقبلة والمواعيد الغيبية، كلها عند أهل اليقين محققة الوقوع، واجبة الحصول، ينتظرون وقوعها في مواقيتها، شيئًا فشيئًا، ويتلقونها بالمعرفة والأدب فإن كانت جلالية فبالرضى والتسليم، وإن كانت جمالية فبالحمد والشكر، هكذا نظرهم دائمًا إلى ما يبرز من عنصر القدرة، ليس لهم وقت دون ما هم فيه، ولا أمل دون ما أقامهم الحق تعالى فيه، ليس لهم عن أنفسهم إخبار، ولا مع غير الله قرار، ولا يستعجلون ما تأخر وقوعه من أقداره، ولا يشركون مع الله في تدبيره واختياره. قد هجم عليهم اليقين، فهم، في عموم أوقاتهم، مستغرقون في شهود المحبوب، غائبون عن كل مرغوب ومطلوب، سوى شهود وجه المحبوب، جعلنا الله منهم بمنِّه وكرمه. آمين. وسبب وجود هذا في قلوبهم حياة روحهم بالإيمان التام\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:68",
      "similarity": 0.6184457115012674
    },
    {
      "verse": "17:43",
      "similarity": 0.5646474382595748
    },
    {
      "verse": "87:1",
      "similarity": 0.5360959374175519
    },
    {
      "verse": "7:190",
      "similarity": 0.49535255029397257
    },
    {
      "verse": "20:83",
      "similarity": 0.49132149688127574
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}