{
  "chapter": "النحل",
  "text": "واذا بدلنا ءاية مكان ءاية والله اعلم بما ينزل قالوا۟ انما انت مفترۭ بل اكثرهم لا يعلمون",
  "translations": [
    {
      "translation": "If we replace one ayat with another one - and Allah knows best what He is sending down - they say, 'You are just inventing this!' No indeed! Most of them have no knowledge.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We replace a message with another -- and God knows best what He reveals -- they say: \"You have made it up;\" yet most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever We replace one verse by another verse - and Allah knows what He should reveal - they are wont to say: \"You are nothing but a fabricator (who has invented the Qur'an).\" The fact is that most of them are ignorant of the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God replaces one revelation with another, He knows best what to reveal. But they say, \"(Muhammad), you have falsely invented it.\" Most people are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We replace a verse* by another – and Allah well knows what He sends down – the disbelievers say, “You are just fabricating”; in fact most of them do not know. (* The command of one verse by another.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We change a verse in place of another - and Allah knows best what He reveals - they (the disbelievers) say: \"You (O Muhammad) are but a forger.\" Rather, most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We change (one) communication for (another) communication, and Allah knows best what He reveals, they say: You are only a forger. Nay, most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We exchange a verse in the place of another verse and God knows very well what He is sending down -- they say, 'Thou art a mere forger!' Nay, but the most of them have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We put a revelation in place of (another) revelation, - and Allah knoweth best what He revealeth - they say: Lo! thou art but inventing. Most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We substitute one revelation for another, and God knows best what He reveals, they say, \"You are but a fabricator.\" Indeed, most of them have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever We change a verse in place of anot her verse - -and Allah is the Best Knower of that wwhich He revealeth --they say: thou art but a fabricator, Aye! most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We change a sign for another in its stead—and Allah knows best what He sends down—they say, ‘You are indeed a fabricator.’ Indeed, most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We substitute one revelation for another,- and Allah knows best what He reveals (in stages),- they say, \"Thou art but a forger\": but most of them understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We change a Verse [of the Quran, i.e. cancel (abrogate) its order] in place of another, and Allah knows the best of what He sends down, they (the disbelievers) say: \"You (O Muhammad SAW) are but a Muftari! (forger, liar).\" Nay, but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We exchange a verse for another and Allah knows best what He is sending down they say: 'You are but a forger' No, most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We substitute a verse in place of another verse—and God knows best what He reveals—they say, “You are an impostor.” But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We substitute a verse in place of a verse - and Allah is most knowing of what He sends down - they say, \"You, [O Muhammad], are but an inventor [of lies].\" But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:101] And when We exchange a verse in place of a [different] verse, by abrogating it and revealing another, for the welfare of [God’s] servants — and God knows best what He reveals — they say, that is, the disbelievers [say] to the Prophet (s): ‘You are just a fabricator’, a liar, making it up yourself. Nay, most of them do not know, the true nature of the Qur’ān and the benefit [to God’s servants] of abrogation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We put a revelation) when We send Gabriel with an abrogating verse (in place of (another) revelation) in place of another abrogated verse, (and Allah knoweth best what He revealeth) and Allah knows the probity of that with which He commands His servants, (they say) the disbelievers of Mecca say: (Lo! thou art but inventing) from yourself, Muhammad. (Most of them know not) that Allah commands His servants with that which is good for them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { ٱللَّهُ } المطلع لجميع ما كان ويكون اطلاع حضور وشهود { أَعْلَمُ بِمَا يُنَزِّلُ } بحسب الأوقات والأزمان\n فله نسخ ما ثبت\n وإثبات ما نسخ { قَالُوۤاْ } أي: المشركون المعاندون حين ظهر في القرآن نسخ بعض الآيات المثبتة\n وإثبات بعض المنسوخات القديمة متهكمين طاعنين: { إِنَّمَآ أَنتَ مُفْتَرٍ } أي: ما أنت أيها المدَّعي للرسالة والوحي إلاَّ مفترٍ كذاب\n قلتَ بقولٍ من تلقاء نفسك\n ثمَّ ظهر لك ما فيه\n بلدتَ بأخرى على مقتضى أهوائك وأمانيك\n ونسبته إلى ربك افتراءً ومراً\n مع أنك أخبرت أن ربك يقول:\n[ق: 29]\n كل ذلك\n أي: النسخ والتبديل\n والإنزال من عندنا لحكمة ظهرت علينا { بَلْ أَكْثَرُهُمْ لاَ يَعْلَمُونَ } [النحل: 101] حكمة النسخ والتبديل في الأحكام\n فينكرونها\n\n\n{ قُلْ } لهم يا أكمل الرسل\n ما أنا مفتر في هذا النسخ والتبديل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { والله أعلمُ بما يُنزَّل }: معترض بين الشرط\n وهو: { إذا } وجوابه\n وهو: { قالوا } لتوبيخ الكفار\n والتنبيه على فساد سندهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:105",
      "similarity": 0.45513631449035596
    },
    {
      "verse": "2:181",
      "similarity": 0.40819210017019253
    },
    {
      "verse": "34:8",
      "similarity": 0.4071805549854573
    },
    {
      "verse": "32:3",
      "similarity": 0.3953905600757854
    },
    {
      "verse": "70:41",
      "similarity": 0.38933131163431367
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/16:101.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/16:101.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:101.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}