{
  "chapter": "النحل",
  "text": "واصبر وما صبرك الا بالله ولا تحزن عليهم ولا تك فى ضيق مما يمكرون",
  "translations": [
    {
      "translation": "Be patient. But your patience is only by Allah. Do not be grieved by them and do not be constricted by the plots they hatch.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Endure with patience, for your endurance is not without the help of God. Do not grieve for them, and do not be distressed by their plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bear with patience, (O Muhammad) - and your patience is only because of the help of Allah - and do not grieve over them, nor feel distressed by their evil plans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exercise patience and let it be only for the cause of God. Do not be grieved about them nor disappointed at their evil plans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him) patiently endure – and your patience is only due to the guidance of Allah – and do not grieve for them, and do not be disheartened by their deceits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient, and your patience will not be, but by the help of Allah. And do not grieve over them, and do not be distressed by their plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient and your patience is not but by (the assistance of) Allah, and grieve not for them, and do not distress yourself at what they plan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient; yet is thy patience only with the help of God. And do not sorrow for them, nor be thou straitened for what they devise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Endure thou patiently (O Muhammad). Thine endurance is only by (the help of) Allah. Grieve not for them, and be not in distress because of that which they devise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Endure with patience; truly, your patience is possible only with the help of God. Do not grieve for them, or feel distressed because of their plottings,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And endure them patiently; and thy patience is not but from Allah; and grieve not over them, and be not thou in straitness because of that which they plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be steadfast, and you cannot be steadfast except with Allah [’s help]. And do not grieve for them, nor be upset by their guile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do thou be patient, for thy patience is but from Allah; nor grieve over them: and distress not thyself because of their plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And endure you patiently (O Muhammad SAW), your patience is not but from Allah. And grieve not over them (polytheists and pagans, etc.), and be not distressed because of what they plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient; yet your patience is only by the help of Allah. Do not grieve for them (the unbelievers), nor distress yourself because of their devising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient. Your patience is solely from God. And do not grieve over them, and do not be stressed by their schemes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient, [O Muhammad], and your patience is not but through Allah. And do not grieve over them and do not be in distress over what they conspire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:127] So be patient, and your patience is only by [the help of] God, [only] by His assistance. And do not grieve for them, that is, [for] the disbelievers if they do not believe, despite your eagerness that they believe, nor be in   distress because of that which they scheme, in other words, do not be concerned with their scheming, for I [God] will make victorious over them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Endure thou patiently) their harm, Muhammad. (Thine endurance is only by (the help of) Allah) by Allah's given success. (Grieve not for them) grieve not for the destruction of those who derided you, (and be not in distress because of that which they devise) because of what they say about you and do to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي ضَيْقٍ } معناه في شِدةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in a tight place} means in a severe situation.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ واصْبِر وما صبرك إلا بالله } اعلم أنّ الصبر أقسام: صبر لله\n وصبر في الله\n وصبر مع الله\n وصبر عن الله\n وصبر بالله\n فالصبر لله هو من لوازم الإيمان وأول درجات أهل الإسلام\n قال النبي عليه الصلاة والسلام:\n \" الإيمان نصفان\n نصف صبر ونصف شكر \" \n\n وهو حبس النفس عن الجزع عند فوات مرغوب أو وقوع مكروه\n وهو من فضائل الأخلاق الموهوبة من فضل الله لأهل دينه وطاعته المقتضى للثواب الجزيل\n والصبر في الله هو الثبات في سلوك طريق الحق\n وتوطين النفس على المجاهدة بالاختيار\n وترك المألوفات واللذات\n وتحمل البليّات\n وقوّة العزيمة في التوجه إلى منبع الكمالات\n وهو من مقامات السالكين\n يهبه الله لمن يشاء من فضله من أهل الطريقة\n والصبر مع الله هو لأهل الحضور\n والكشف عند التجرّد عن ملابس الأفعال والصفات\n والتعرّض لتجليات الجمال والجلال\n وتوارد واردات الأنس والهيبة\n فهو بحضور القلب لمن كان له قلب\n والاحتراس عن الغفلة والغيبة عند التلوينات بظهور النفس وهو أشقّ على النفس من الضرب على الهام\n وإن كان لذيذاً جداً\n والصبر عن الله هو لأهل الجفاء والحجاب\n نورانياً كان أو ظلمانياً\n وهو مذموم جداً\n وصاحبه ملوم حقاً وكلما كان أصبر كان أسوأ حالاً وأبعد\n وكلما كان في ذلك أقوى كان ألوم وأجفى أو لأهل العيان والمشاهدة من العشاق والمشتاقين المتقلبين في أطوار التجلي والاستتار\n والمنخلعين عن الناسوت المتنوّرين بنور اللاهوت ما بقي لهم قلب ولا وصف كلما لاح لهم نور من سبحات أنوار الجمال احترقوا وتفانوا\n وكلما ضرب لهم حجاب ورد وجوههم تشويقاً وتعظيماً ذاقوا من ألم الشوق وحرقة الفرقة ما عيل به صبرهم وتحقق موتهم وهو من أحوال المحبين ولا شيء أشق من هذا الصبر وأشد تحملاً واقْتَل\n فإن أطاقه المحب كان خافياً وإن لم يطق كان فانياً فيه هالكاً\n وفي هذا المقام قال الشبلي:\nأي: صابر الحبيب الصبر\n فاستغاث به الصبر عند إشرافه على النفاد فصاح المحب بالصبر صبراً على النفاد والهلاك\n فإن فيه النجاح والفلاح\n والصبر بالله هو لأهل التمكين في مقام الاستقامة الذين أفناهم الله بالكلية وما ترك عليهم شيئاً من بقية الأنية والإثنينية ثم وهب لهم وجوداً من ذاته حتى قاموا به وفعلوا بصفاته وهو من أخلاق الله تعالى ليس لأحد فيه نصيب ولهذا أمره به\n ثم بيّن أن ذلك الصبر الذي أمرت به ليس من سائر أقسام الصبر حتى يكون بنفسك أو بقلبك بل هو صبري لا تباشره إلا بي ولا تطيقه إلا بقوّتي\n ولعدم وفاء قوته بهذا الصبر قال:\n\n \" شيّبتني سورة هود \"\n \n{ ولا تحزن عليهم } بالتلوين بظهور القلب بصفته لأن صاحب هذا الصبر يرى الأشياء بعين الحق فكل ما يصدر عنهم يراه فعل الله وكل صفة تظهر عليهم يراه تجلياً من تجلياته وينكر المنكر بحكمه لأن الله بصّره بأنوع التجليات القهرية واللطفية والغضبية والرضوية وعرّفه أحكامه وأمره بإنفاذ الأحكام في مواقعها\n { ولا تك في ضيق هما يمكرون } لانشراح صدرك بي\n فكن معهم كما تراني معهم سائراً بسيري قائماً بي وبأمري\n { إنّ الله مع الذين اتّقوا } بقاياهم وأنياتهم بالاستهلاك في الوحدة والاستغراق في عين الجمع { واللذين هم مُحْسِنون } بشهود الوحدة في عين الكثرة\nوالطاعة في عين المعصية\n والقيام بالأمر والنهي في مقام الاستقامة\n وإبقاء حقوق التفاصيل في عين الجمع\n فلا يحجبهم الفرق عن الجمع ولا الجمع عن الفرق\n ويسعهم مراعاة الحق والخلق للرجوع إلى الكثرة بوجود القلب الحقانيّ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المسقط لجميع الإضافات على ما جرى عليك من الأذيات المترتبة على بشريتك وناسوتك { وَمَا صَبْرُكَ } وكظمُك بعد فنائك عن بشريتك { إِلاَّ بِٱللَّهِ } المتجلي عليك بالإطلاق إلى أن انخلعتُ عنك لوازم ناسوتك\n وما بقيت لك إلاَّ لوازم لاهوتك\n وظاهر أنه لا يجري فيها المكروه والمنكر { وَلاَ تَحْزَنْ عَلَيْهِمْ } أي: على المؤمنين بما لحقهم من المنافرات والمشوشات { وَلاَ تَكُ } بعد انشراح صدرك بالتوحيد الذاتي { فِي ضَيْقٍ } ضيق صدر\n وحزن وكآبة { مِّمَّا يَمْكُرُونَ } [النحل: 127] أولئك الماكرون المعاندون المكابرون\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { واصبر وما صبرك إِلا بالله } إلا بتوفيقه وتثبيته\n رُوي أنه صلى الله عليه وسلم قال لأصحابه:\n \" أما أنا فأصبر كما أمرت\n فماذا تصنعون؟ \" \nقالوا: نصبر كما ندبنا\n { ولا تحزنْ عليهم } على الكافرين حيث لم يؤمنوا حِرْصًا عليهم\n أو على المؤمنين لأجل ما فعل بهم\n { ولا تَكُ في ضيق مما يمكرون } أي: لا يضيق صدرك بمكرهم\n ولا تهتم بشأنهم\n فأنا ناصرك عليهم\n والضيق - بفتح الضاد مُخَفَّفًا - من ضَيِّقٍ كَمَيْتِ ومَيِّتٍ\n وقرئ بالكسر\n وهو مصدر\n ويجوز أن يكون الضيق والضيق مصدريْن\n معًا\n لِضاق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:70",
      "similarity": 0.9583378519539542
    },
    {
      "verse": "15:97",
      "similarity": 0.5989140438571066
    },
    {
      "verse": "3:54",
      "similarity": 0.40476286565146175
    },
    {
      "verse": "26:13",
      "similarity": 0.4019059113737025
    },
    {
      "verse": "71:22",
      "similarity": 0.3996346757298315
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/16:127.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/16:127.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/16:127.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}