{
  "chapter": "النحل",
  "text": "ان الله مع الذين اتقوا۟ والذين هم محسنون",
  "translations": [
    {
      "translation": "Allah is with those who have taqwa of Him and with those who are good-doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is verily with those who are pious and devout, and those who are doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For surely Allah is with those who hold Him in fear and do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is certainly with the pious and the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah is with the pious and the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, Allah is with those who have Taqwa, and the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah is with those who guard (against evil) and those who do good (to others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God is with those who are godfearing, and those who are good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah is with those who keep their duty unto Him and those who are doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for God is with those who are righteous and those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah is with those who fear and those who are well- doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah is with those who are Godwary and those who are virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Allah is with those who restrain themselves, and those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, Allah is with those who fear Him (keep their duty unto Him), and those who are Muhsinun (good-doers, - see the footnote of V. 9:120).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is with the cautious and those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is with those who are righteous and those who are virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah is with those who fear Him and those who are doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:128] Truly God is with those who fear, [falling into] unbelief and [committing] acts of disobedience, and those who are virtuous, by way of obedience and patience, [granting them] assistance and victory. Meccan, except for verses 26, 33 [or 32], 57, and from 73 to the end of 80, which are Medinese; it consists of 111 verses and was revealed after [sūrat] al-Qasas.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah is with those who keep their duty unto Him) those who ward off disbelief, idolatry and indecencies 297 (and those who are doers of good) in their speech and action and further profess Allah's divine Oneness'. And of the surah in which the Children of Israel are mentioned, which is Meccan in its entirety-except for the verses concerning the news of the delegation of Thaqif and the story when the Jews said \"this is not a land of prophets\" upon which Allah said: (And they indeed wished to scare thee from the land that they might drive thee forth from thence, and then they would have stayed (there) but a little after thee. (Such was Our) method in the case of those whom We sent before thee (to mankind), and thou wilt not find for Our method aught of power to change. Establish worship at the going down of the sun until the dark of night, and (the recital of) the Qur'an at dawn. Lo! (the recital of) the Qur'an at dawn is ever witnessed. And some part of the night awake for it, a largess for thee. It may be that thy Lord will raise thee to a praised estate. And say: My Lord! Cause me to come in with a firm incoming and to go out with a firm outgoing. And give me from Thy presence a sustaining Power) which are Medinan-and it consists of 110 verses, 1,533 words and 6,400 letters: /i 24 Surah 17: The Night Journey (al-lsra') And of the surah in which the Children of Israel are mentioned, which is Meccan in its entirety— except for the verses concerning the news of the delegation of Thaqif and the story when the Jews said \"this is not a land of prophets\" upon which Allah said: (And they indeed wished to scare thee from the land that they might drive thee forth from thence, and then they would have stayed (there) but a little after thee. (Such was Our) method in the case of those whom We sent before thee (to mankind), and thou wilt not find for Our method aught of power to change. Establish worship at the going down of the sun until the dark of night, and (the recital of) the Qur'an at dawn. Lo! (the recital of) the Qur'an at dawn is ever witnessed. And some part of the night awake for it, a largess for thee. It may be that thy Lord will raise thee to a praised estate. And say: My Lord! Cause me to come in with a firm incoming and to go out with a firm outgoing. And give me from Thy presence a sustaining Power) which are Medinan— and it consists of 110 verses, 1,533 words and 6,400 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ وَّٱلَّذِينَ هُم مُّحْسِنُونَ } قالَ زيدُ بن علي عليهما السَّلامُ: اتَّقَوا مَا حَرَمَ عَليهِم فِيما افْتَرَضَ عَليهِم\n وأَحسنَوا معناه أَدَّوا الفرائضَ\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah, {Indeed, Allah is with those who fear Him and those who are doers of good} Zayd ibn Ali, peace be upon him, said: \"Beware of what He has made unlawful for you in what He has made obligatory for you.\"\n\n\nAnd they did their best with us, fulfilling their obligations.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱللَّهَ } المختبر لأنبيائه وأوليائه\n وخواص عباده بأنواع الأذى والمحن الجسمانية { مَعَ } الصابرين { ٱلَّذِينَ ٱتَّقَواْ } وأَخذوا عن الانتقام وقت الغدوة طلباً لمرضاة الله وجرياً على مقتضى توحيده { وَّٱلَّذِينَ هُم مُّحْسِنُونَ } [النحل: 128] على من أساء إليهم رفقاً له\n وتلطيفاً إيام ابتغاءً لمرضاة الله\n وتثبيتاً في طريق وتوحيده\n\n\nأذقنا حلاوة توحيدك\n وأصبرنا على ما جرى علينا من المحن\n والعطاء والعناء طلباً لمرضاتك\n إنك على ما تشاء قدير\n\n\nخاتمة السورة\n\nعليك أيها المسترشد الخبير البصير - أرشدك الله إلى امتثال ما سمعتَ في هذه السورة\n سيما في الكريمة المذكورة آنفاً\n ورزقك الاتصاف بما فيها من الحِكَم والآداب\n والأخلاق المرضية\n والسجايا الفاضلة - أن تتأمل فيها حق التأمل والتعمق\n حالَ كونك خالياً صافياً عن الكدورات العارضة من طغيان القوى البهيمية\n والحميّة الجاهلية\n تاركاً بما عرض عليك من الأغراض النفسانية المترتبة على الأمور العادية\n المستلزمة فيه لأنواع الضلال والفساد من التفوق على الأقران\n والترفع على الإخوان\n والتكبر على ضعفاء الأنام\n والتلذذ بالسمعة والرياء المثيرة لأصناف الأهواء الفاسدة\n والآراء الباطلة التي لا يمكن قلعها وقمعها أصلاً\n سيما تمرنتَ ورسختَ\n فلك أن تراجع وجدانك بأي شيء أردت الترفع\n وقصدت التفوق والتفضل\n أما ترى منشأك ماذا؟! أما استحييت التفوه من هذا وهذا؟!\n\n\nوأمّا قصة كرامتك وخلافتك التي هي من المواهب الإلهية\n والعطاءات الغيبية\n فإنما هي مبنية على محض التذلل والتواضع\n والخضوع والانكسار مع كل ذرةٍ من ذرائر الكائنات\n إذ مبناه على الحكمة المتقنة المتشعبة من أسرار سرائر الرسالة والنبوة\n وهي عبارة عن اعتدال جميع الأوصاف\n وتزكية النفس عن جميع الرذائل\n بل هي مبنية على إفناء متقضيات الأوصاف البشرية رأساً إرادةً واختياراً\n\n\nوبالجملة: من أنصف على نفسه أدرك أن جميع ما في نفسه سوى التذلل والانكسار\n والمسكنة والافتقار\n حال كونه خالياً عن شوب الرياء والسمعة\n والعُجب والجَرْبَزَة\n إنما هي رعونات صدرت من طغيان القوى البهيمية المؤيدة بالعقل المستعار المموه بتمويهات الأوهام الباطنة\n وتزيينات الخيالات الكاذبة\n\n\nهب لنا من لدنك جذبةً تنجينا من أنانيتنا\n ولذةً تلجئنا إلى سلوك طريق الفناء الموصل إلى البقاء السرمدي\n إنك أنت الوهاب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ الله مع الذين اتقوا } الكفر والمعاصي\n { والذين هم محسنون } في أعمالهم\n فهو معهم بالولاية والنصر والرعاية والحفظ\n أو مع الذين اتقوا الله بتعظيم أمره\n والذين هم محسنون بالشفقة على خلقه\n أو مع الذين اتقوا ما يقطعهم عن الله\n والذين هم محسنون بشهود الله كما قال النبي صلى الله عليه وسلم:\n \" الإحسان أن تعبد الله كأنك تراه \" \nفهو معهم بالمحبة والوداد \" فإذا أحببته كنت له \"\n والله تعلى أعلم\n الإشارة: من شأن الصوفية: الأخذ بالعزائم\n والتمسك بالأحسن في كل شيء\n متمثلين لقوله تعالى:\n[الزُّمَر: 18]\n ولذلك قالوا: الصوفي: دمه هدر\n وماله مباح لأنه لا ينتصر لنفسه\n بل يدفع بالتي هي أحسن السيئة\n\nفالصبر دأبهم\n والرضى والتسليم خُلقهم\n وحقيقة الصبر هي: حبس القلب على حكم الرب\n من غير جزع ولا شكوى\n ومواطنه أربعة: الطاعة\n والمعصية\n والنعمة\n والبلية\n فالصبر على الطاعة: بالمبادرة إليها\n وعن المعصية: بتركها\n وعلى النعمة: بشكرها\n وأداء حق الله فيها\n وعلى البلية: بالرضى وعدم الشكوى بها\n وأقسام الصبر ستة: صبر في الله\n وصبر لله\n وصبر مع الله\n وصبر بالله\n وصبر على الله\n وصبر عن الله\n أما الصبر في الله: فَهُوَ الصبر في طلب الوصول إلى الله\n بارتكاب مشاق المجاهدات والرياضات\n وهو صبر الطالبين والسائرين\n وأما الصبر لله: فهو الصبر على مشاق الطاعات وترك المنهيات ونزول البليات\n يكون ذلك ابتغاء مرضاة الله\n لا لطلب أجر ولا نيل حظ\n وهو صبر المخلصين\n وأما الصبر مع الله: فهو الصبر على حضور القلب مع الله\n على سبيل الدوام مراقبة أو مشاهدة\n فالأول: صبر المحبين\n والثاني: صبر المحبوبين\n وأما الصبر بالله: فهو الصبر على ما ينزل به من المقادير\n لكنه بالله لا بنفسه\n وهو صبر أهل الفناء من العارفين المجذوبين السالكين\n وأما الصبر على الله: فهو الصبر على كتمان أسرار الربوبية عن غير أهلها\n أو الصبر على دوام شهود الله\n وأما الصبر عن الله: فهو الصبر على الوقوف بالباب عند جفاء الأحباب\n فإذا كان العبد في مقام القرب واجدًا لحلاوة الأنس\n مشاهدًا لأسرار المعاني\n ثم فقد ذلك من قلبه\n وأحس بالبعد والطرد - والعياذ بالله - فليصبر\n وليلزم الباب حتى يَمن الكريم الوهاب\n ولا يتزلزل\n ولا يتضعضع\n ولا يبرح عن مكانه\n مبتهلاً\n داعيًا إلى الله\n راجيًا كرم مولاه\n فإذا استعمل هذا فقد استعمل الصبر قيامًا بأدب العبودية\n وهو أشد الصبر وأصعبه\n لا يطيقه إلا العارفون المتمكنون\n الذين كملت عبوديتهم\n فكانوا عبيدًا لله في جميع الحالات\n قَرَّبهم أو أبعدهم\n  رُوِيَ أن رجلاً دخل على الشبلي رضي الله عنه\n فقال: أي صبر أشد على الصابر؟ فقال له الشبلي: الصبر في الله\n قال: لا\n قال: الصبر لله\n قال: لا\n قال: الصبر مع الله\n قال: لا\n فقال له: وأي شيء هو؟ فقال: الصبر عن الله\n فصاح الشبلي صيحة عظيمة\n كادت تتلف فيها روحه\n هـ\n لأن الحبيب لا يصبر عن حبيبه\n لكن إذا جفا الحبيب لا يمكن إلا الصبر والوقوف بالباب\n كما قال الشاعر:\nوقال رجل لأبي محمد الحريري رضي الله عنه: كنت على بساط الأنس\n وفتح على طريق البسط\n فزللت زلة\n فحجبت عن مقامي\n فكيف السبيل إليه؟ دلني على الوصول إلى ما كنت عليه\n فبكى أبو محمد وقال: يا أخي\n الكل في قهر هذه الخطة\n لكني أنشدك أبياتًا لبعضهم\n فأنشأ يقول:\n\nومن هذا المعنى قضية الرجل الذي بقي في الحرم أربعين سنة يقول: لبيك\n فيقول له الهاتف: لا لبيك ولا سعديك\n وحجك مردود عليك\n فقيل له في ذلك\n فقال: هذه بابه\n وهل ثَمَّ باب أخرى أقصده منها؟ فقبله الحق تعالى\n ولبى دعوته\n وكذلك قضية الرجل الذي قيل له\n من قِبَلِ الوحي: إنك من أهل النار فزاد في العبادة والاجتهاد\n فهذا كله يصدق عليه الصبر عن الله\n لكن لا يفهم كماله إلا من كملت معرفته\n وتحقق بمقام الفناء\n فحينئذ قد يسهل عليه أمره لكمال عبوديته\n كما قال القائل:\nوأما من لم تكمل معرفته\n فقد ينكره ويذمه\n كالعباد والزهاد والعشاق\n فإنهم لا يطيقونه\n فإما أن يختل عقلهم\n أو يرجعون إلى الانهماك في البطالة\n والله تعالى أعلم\n وصلى الله عليه سيدنا محمد وآله وصحبه وسلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:119",
      "similarity": 0.5207713084092968
    },
    {
      "verse": "92:9",
      "similarity": 0.40708767508937893
    },
    {
      "verse": "20:8",
      "similarity": 0.40702323332670615
    },
    {
      "verse": "10:63",
      "similarity": 0.40669750693058193
    },
    {
      "verse": "55:70",
      "similarity": 0.37276640141399237
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016128.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016128.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:128.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}