{
  "chapter": "النحل",
  "text": "وءاتينه فى الدنيا حسنة وانه فى الءاخرة لمن الصلحين",
  "translations": [
    {
      "translation": "And gave him what is good in the world, and in the Hereafter he will be among the righteous and the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed good upon him in this world, and in the Hereafter he shall certainly be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We granted him virtue in this life and he shall be among the righteous ones in the life to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him goodness in this world; and indeed in the Hereafter he is worthy of proximity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him good in this world, and in the Hereafter he shall be of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him good in this world, and in the next he will most surely be among the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him in this world good, and in the world to come he shall be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him good in the world, and in the Hereafter he is among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave him blessings in this world, and in the Hereafter he shall be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We vouchsafed unto him good in this world, and in the Hereafter he shall be of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave him good in this world, and in the Hereafter he will indeed be among the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him Good in this world, and he will be, in the Hereafter, in the ranks of the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him good in this world, and in the Hereafter he shall be of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave goodness to him in this world, and in the Everlasting Life he shall be amongst the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him goodness in this world, and in the Hereafter he will be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him good in this world, and indeed, in the Hereafter he will be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:122] And We gave him (herein is a shift [to the first person plural] from the third person) in this world good, which is handsome praise [of him] by members of all [three] religions, and in the Hereafter he will indeed be among the righteous, for whom there will be the highest degrees [of reward].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We gave him good in the world) We gave him a righteous progeny; it is also said that this means: good praise; it is also said that this means: We gave him good mention and praise among people, (and in the Hereafter he is among the righteous) with his forefathers among the messengers in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وآتيناه في الدنيا حسنة } من تمتيعه بالحظوظ لتتقوى نفسه على تقنين القوانين الشرعية والقيام بحقوق العبودية في مقام الاستقامة والإطاقة بحمل أعباء الرسالة { وآتيناه } المُلْك العظيم مع النبوة، كما قال:\n\n[النساء، الآية: 54] ليتمكن من تقرير الشريعة ويضطلع بأحكام الدعوة والذكر الجميل كما قال:\n\n[مريم، الآية: 50] والصلاة والسلام عليه كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَآتَيْنَاهُ فِي ٱلْدُّنْيَا } من لدنا تفضلاً عليه وإحساناً { حَسَنَةً } صورية إلى حيث لا تنقطع آثار إنفاقه وجُوده إلى يوم القيامة { وَإِنَّهُ فِي ٱلآخِرَةِ لَمِنَ ٱلصَّالِحِينَ } [النحل: 122] لقبولنا، الواصلين إلى صفاء توحيدنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}