{
  "chapter": "النحل",
  "text": "والذين يدعون من دون الله لا يخلقون شيـا وهم يخلقون",
  "translations": [
    {
      "translation": "Those you call on besides Allah do not create anything. They are themselves created.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": ", As for those they call besides God, they cannot create a thing, and have themselves been created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they call upon beside Allah have created nothing; rather, they themselves were created;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever (idols) they worship besides God can create nothing for they are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they worship other than Allah, do not create anything but are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they invoke besides Allah have not created anything, but are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whom they call on besides Allah have not created anything while they are themselves created;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those they call upon, apart from God, created nothing, and themselves are created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom they cry beside Allah created naught, but are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those you call on besides God cannot create anything. They are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those upon whom they call beside Allahls have not created aught, and are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they invoke besides Allah do not create anything and are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they invoke besides Allah create nothing and are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they (Al-Mushrikun) invoke besides Allah have not created anything, but are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those whom you invoke, other than Allah do not create anything they are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those they invoke besides God create nothing, but are themselves created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those they invoke other than Allah create nothing, and they [themselves] are created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:20] And those whom you invoke (tad‘ūna, or read yad‘una ‘they invoke’) besides God, namely, the idols, do not create anything, but are themselves created, fashioned from stones and other [materials].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those unto whom they cry) they worship (beside Allah created naught) they cannot create anything like Our creation, (but are themselves created) they are themselves carved.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها المشركون المكابرون أن { ٱلَّذِينَ يَدْعُونَ مِن دُونِ ٱللَّهِ } المعبود بالحق آلهةً، وتعبدونها إفكاً كعبادته سبحانه، مع أنهم لا يستحقون الألوهية؛ إذ { لاَ يَخْلُقُونَ شَيْئاً } حقيراً، وكيف بالعظيم، بل { وَهُمْ يُخْلَقُونَ } [النحل: 20] مخلوقون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم علل عجزها، وعدم استحقاقها للألوهية بقوله: { وهم يُخْلقون } أي: وهم مخلوقون مفتقرون في وجودهم إلى التخليق، والإله لا بدّ أن يكون واجب الوجود",
      "translations": []
    }
  ]
}