{
  "chapter": "النحل",
  "text": "ينزل الملئكة بالروح من امره على من يشاء من عباده ان انذروا۟ انه لا اله الا انا۠ فاتقون",
  "translations": [
    {
      "translation": "He sends down angels with the Ruh of His command to any of His slaves He wills: 'Give warning that there is no god but Me, so have taqwa of Me!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends the angels with revelation by His command, to any of His creatures as He please, (saying): \"Warn that there is no god but I, so fear Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down this spirit (of prophecy) by His command through His angels on any of His servants whom He wills, (directing them): \"Warn people that there is no deity but Me; so hold Me alone in fear.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends the angels with the Spirit to carry His orders to whichever of His servants He wants so that they would warn people that He is the only God and that people must have fear of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels with the soul of faith – the divine revelations – towards those among His bondmen He wills that, “There is no worship except for Me, therefore fear Me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels with the Ruh (revelation) of His command to those servants of His whom He wills (saying): \"Warn mankind that none has the right to be worshipped but I, so have Taqwa of Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels with the inspiration by His commandment on whom He pleases of His servants, saying: Give the warning that there is no god but Me, therefore be careful (of your duty) to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels with the Spirit of His command upon whomsoever He will among His servants, saying: Give you warning that there is no God but I; so fear you Me!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sendeth down the angels with the Spirit of His command unto whom He will of His bondmen, (saying): Warn mankind that there is no Allah save Me, so keep your duty unto Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels with revelations by His command to whoever of His servants He pleases, saying, \"Warn mankind that there is no god save Me, so fear Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sendeth down the angels with the spirit by His command upon whomsoever of his bondmen He willeth: warn that there is no god but I, wherefore fear Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels with the spirit of His command to whomever He wishes of His servants: ‘Warn [the people] that there is no god except Me; so be wary of Me.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He doth send down His angels with inspiration of His Command, to such of His servants as He pleaseth, (saying): \"Warn (Man) that there is no god but I: so do your duty unto Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels with inspiration of His Command to whom of His slaves He pleases (saying): \"Warn mankind that La ilaha illa Ana (none has the right to be worshipped but I), so fear Me (by abstaining from sins and evil deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels with the Spirit (Gabriel) by His command to those of His worshipers whom He chooses, (saying:) 'Warn, there is no god except Me, therefore fear Me'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels with the Spirit by His command, upon whom He wills of His servants: “Give warning that there is no god but Me, and fear Me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down the angels, with the inspiration of His command, upon whom He wills of His servants, [telling them], \"Warn that there is no deity except Me; so fear Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:2] He sends down the angels, namely, Gabriel, with the Spirit, with the Revelation, of His command, by His will, to whomever He will of His servants, and these are the prophets, [saying] that (an is explicative): Warn, threaten the disbelievers with chastisement and make them aware, that there is no God save Me: so fear Me, fear Me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكان استعجالُهم بالعذاب استهزاءً بالرسول صلى الله عليه وسلم وتكذيبه ، وكان ناشئاً عن عقيدة الإشراك التي من أصولها استحالة إرسال الرسل من البشر .وأُتبع تحقيق مجيء العذاب بتنزيه الله عن الشريك فقفّي ذلك بتبرئة الرسول عليه الصلاة والسلام من الكذب فيما يبلغه عن ربّه ووصف لهم الإرسال وصفاً موجزاً . وهذا اعتراض في أثناء الاستدلال على التوحيد .والمراد بالملائكة الواحد منهم وهو جبرئيل عليه السلام .والروح : الوحي . أطلق عليه اسم الروح على وجه الاستعارة لأن الوحي به هدي العقول إلى الحقّ ، فشبّه الوحي بالروح كما يشبّه العلم الحقّ بالحياة ، وكما يشبّه الجهل بالموت قال تعالى : { أومن كان ميتاً فأحييناه } \\[ سورة الأنعام : 122 \\].ووجه تشبيه الوحي بالروح أن الوحي إذا وعته العقول حلّت بها الحياة المعنوية وهو العلم ، كما أن الروح إذا حلّ في الجسم حلّت به الحياة الحسيّة ، قال تعالى : { وكذلك أوحينا إليك روحاً من أمرنا } \\[ سورة الشورى : 52 \\].ومعنى { من أمره } الجنس ، أي من أموره ، وهي شؤونه ومقدراته التي استأثر بها . وذلك وجه إضافته إلى الله كما هنا وكما في قوله تعالى : { وكذلك أوحينا إليك روحاً من أمرنا } ، وقوله تعالى : { يحفظونه من أمر الله } \\[ سورة الرعد : 11 \\] ، وقوله تعالى : { قل الروح من أمر ربي } \\[ سورة الإسراء : 85 \\] لما تفيده الإضافة من التخصيص .وقرأ الجمهور { ينزل } بياء تحتية مضمومة وفتح النون وتشديد الزاي مكسورة . وقرأه ابن كثير وأبو عمرو ورويس عن يعقوب بسكون النون وتخفيف الزاي مكسورة ، و { الملائكة } منصوباً .وقرأه روح عن يعقوب بتاء فوقية مفتوحة وفتح النون وتشديد الزاي مفتوحة ورفع { الملائكة } على أن أصله تتنزل .وقوله تعالى : { على من يشاء من عباده } رد على فنون من تكذيبهم؛ فقد قالوا : { لولا نزل هذا القرآن على رجل من القريتين عظيم } \\[ سورة الزخرف : 31 \\] وقالوا : { فلولا ألقي عليه أسورة من ذهب } \\[ سورة الزخرف : 53 \\] أي كان ملكاً ، وقالوا : { ما لهذا الرسول يأكل الطعام ويمشي في الأسواق } \\[ سورة الفرقان : 7 \\]. ومشيئة الله جارية على وفق حكمته ، قال تعالى : { الله أعلم حيث يجعل رسالته } \\[ سورة الأنعام : 124 \\].{ وأن أنذروا } تفسير لفعل { ينزل } لأنه في تقدير ينزل الملائكة بالوحي .وقوله : { بالروح من أمره على من يشاء من عباده } اعتراض واستطراد بين فعل { ينزل } ومفسره .و { أنه لا إله إلا أنا } متعلق ب { أنذروا } على حذف حرف الجر حذفاً مطرداً مع ( أنّ ). والتقدير : أنذروا بأنه لا إله إلا أنا . والضمير المنصوب ب ( أنّ ) ضمير الشأن . ولما كان هذا الخبر مسوقاً للذين اتّخذوا مع الله آلهة أخرى وكان ذلك ضلالاً يستحقون عليه العقاب جعل إخبارهم بضدّ اعتقادهم وتحذيرهم مما هم فيه إنذاراً .وفرع عليه { فاتقون } وهو أمر بالتقوى الشاملة لجميع الشريعة .وقد أحاطت جملة { أن أنذروا } إلى قوله تعالى : { فاتقون } بالشريعة كلها ، لأن جملة { أنذروا أنه لا إله إلا أنا } تنبيه على ما يرجع من الشريعة إلى إصلاح الاعتقاد وهو الأمر بكمال القوة العقلية .وجملة { فاتقون } تنبيه على الاجتناب والامتثال اللذين هما منتهى كمال القوة العملية .\n\n",
      "translations": [
        {
          "translation": "(He sendeth down the angels) i.e. Gabriel and the angels with him (with the Spirit of His command) with prophethood and scripture by His command (unto whom He will of His bondmen) He means Muhammad and other prophets, ((saying): Warn mankind) warn mankind by means of the Qur'an and recite it until they say (that there is no god save Me, so keep your duty unto Me) so obey me and profess my divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فقال: { ينزل الملائكة بالروح } أي: العِلْم الذي يحيي به القلوب\n يعني: القرآن { من } عالم { أمره } الذي انتقش فيه { على من يشاء من عباده } المخصوصين بمزيد عنايته\n إن أخبروهم بالتوحيد والتقوى\n فبين بعد بيان أحدية الذات عالم الصفات الحقيقية بتنزيل الروح الذي هو العلم\n وإثبات المشيئة التي هي الإرادة\n وعالم الأسماء بإثبات الملائكة\n وعالم الأفعال بالإنذار",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n الصمد الذي { يُنَزِّلُ ٱلْمَلاۤئِكَةَ } المقربين عنده { بِٱلْرُّوحِ } أي: بالوحي الناشئ { مِنْ أَمْرِهِ } توفيقاً وتأييداً { عَلَىٰ مَن يَشَآءُ مِنْ } خلَّص { عِبَادِهِ } وهم الأنبياء والمرسلون المأمورون { أَنْ أَنْذِرُوۤاْ } أي: بأن خوفوا عباد الله المنحرفين عن استقامة صراطه\n وجادة توحيده من بطشه وانتقامه إياهم\n وقولوا لهم نيابةً عن الله: { أَنَّهُ لاَ إِلَـٰهَ } يُعبد بالحق { إِلاَّ أَنَاْ فَٱتَّقُونِ } [النحل: 2] عن مخالفة أمري وحكمي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { أن أنذروا }: مفسرة، بمعنى أي لأن الوحي فيه معنى القول. أو مصدرية في موضع الجر، بدلاً من الروح، أو النصب بنزع الخافض، أو مخففة من الثقيلة. وقوله: { لا إله إلا أنا } جرى على المعنى، ولم يجر على اللفظ، وإلا لقال: لا إله إلا الله. انظر ابن عطية. قال المحشى الفاسي: وسر ذلك هنا: التصريح بالمقصود، وأن الإله الواحد هو المتكلم لا غيره، كما قيل في قوله:\n[النّحل: 51]، أي: ولم يقل: فإياه فارهبوا، بل نقل الكلام من الغيبة إلى التكلم مبالغة في الترهيب، وتصريحًا بالمقصود، كأنه قال: فأنا ذلك الإله الواحد، فإياي فارهبون لا غير. هـ. قلت: وكأنه قال هنا: يُنزل الملائكةَ بالوحي أن أَعلِموا أنه لا يُعبد إلا إله واحد، وأنا ذلك الواحد. يقول الحقّ جلّ جلاله: تحقيقًا لِمَا وعدهم به، وأن ذلك الوعد، مع دنوه وقربه بالوحي، فلا خلف فيه، فقال: { يُنَزِّلُ الملائكةَ } أي: جبريل، جمعه تعظيمًا، أو: لأنه قد ينزل معه غيره من الملائكة، فيحضرون الوحي حُرّسا له. أو: لأنه قد ينزل بالوحي غيره من الملائكة، كما في صحيح مسلم:\n \" إن سورة الحمد نزل بها ملك لم ينزل إلى الأرض قبل ذلك \" \nوقال عليه الصلاة والسلام:\n \" إن إسرافيل وُكِّلَ بي في ثلاث سنين، فكان يأتيني بالكلمة والكلمتين، ثم كان جبريل يأتيني بالقرآن في كل وقت \" \nورُوي أن خالد بن سنان كان نبيًا، وكان يأتيه بالوحي مالك خازن النار، وكان بعد عيسى عليه السلام، ولم يبق في النبوة إلا عشرين يومًا، ثم مات، فلقصر مدته لم يُعد نبيًا، بعد عيسى ونبينا محمد صلى الله عليه وسلم، وإنما كانت فترة خمسمائة عام. وذكر ابن العربي أن ذا القرنين كان ينزل عليه ملك، يقال له: رفائيل، فكان يلقي إليه الوحي، ويطوي له الأرض. هكذا نقل الشطيبي عنه في اللباب، فانظره. وقوله: { بالروح } أي: بالوحي، أو القرآن فإنه سبب حياة القلوب والأرواح الميتة بالجهل والحجاب، أو سبب حياة الدين بعد موته واندراسه بالكفر فإن الوحي يقوم في الدين مقام الروح من الجسد. يُنزل ذلك { من أمره } أي: من أجل أمره وبيان شأنه، أو بأمره وإذنه، { على مَن يشاء من عباده } أن يصطفيه للرسالة، قائلاً لهم: { أنْ أنذروا }: خوفوا أهل الشرك، أو أعْلِموا عبادي { أنه } أي: الأمر والشأن، { لا إله إلا أنا فاتقون } بترك الكفر والمعاصي، أي: اجعلوا بينكم وبين غضبه وقاية، بأن تُوحدوه، وتطيعوه فيما أمر به. قال البيضاوي: والآية تدل على أن نزول الوحي بواسطة الملائكة، وأن حاصله: التنبيه على التوحيد، الذي هو القوة العلمية، والأمر بالتقوى الذي هو أقصى كمالات القوة العملية.\nوأن النبوة عطائية - أي: لا كسبية-، والآيات التي بعدها دليل على وحدانيته، من حيث إنها تدل على أنه تعالى هو الموجد لأصول العالم وفروعه، على وفق الحكمة والمصلحة، ولو كان له شريك لقَدَرَ على ذلك، فيلزم التمانع. هـ. الإشارة: قوله تعالى: { بالروح }: قال الورتجبي: الوحي الإلهي، سماه بالروح لأن كلامه صدر من ذاته، وهو حياة قلوب الصديقين من المكلَّمين والمحدَّثين، وهو سبب حياة قلوب المؤمنين، يحييهم بعلمه من موت الجهالة. هـ. وقال القشيري في قوله: { على مَن يشاء من عباده }: على الأنبياء بالوحي والرسالة، وعلى أسرار أرباب التوحيد، وهم المُحَدَّثُون بالتعريف والعلم. فالتعريف للأولياء من حيث الإلهام والخواطر، أي: الواردات. وإنزال الملائكة على قلوبهم غير ممنوعٍ، ولكنهم لا يُؤْمَرُون أن يتكلموا بذلك، ولا يَحْمِلون الرسالة إلى الخلق. هـ. قلت: وكأنه ينظر إلى قوله - عليه الصلاة والسلام -:\n \" علماء أمتي كأنبياء بني إسرائيل \" \n، فهم يشاركون الأنبياء في الوحي الإلهامي، ولا يبلغون ذلك إلا لمن صدقهم وتبعهم في طريقهم. والله تعالى أعلم. ثمَّ عرف بنفسه بما أظهر من تجلياته العلوية والسفلية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "97:4",
      "similarity": 0.6253955499008517
    },
    {
      "verse": "26:193",
      "similarity": 0.5698716106391954
    },
    {
      "verse": "17:85",
      "similarity": 0.45155389783946837
    },
    {
      "verse": "56:89",
      "similarity": 0.432021354528379
    },
    {
      "verse": "11:2",
      "similarity": 0.40462179511422297
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}