{
  "chapter": "النحل",
  "text": "ليحملوا۟ اوزارهم كاملة يوم القيمة ومن اوزار الذين يضلونهم بغير علم الا ساء ما يزرون",
  "translations": [
    {
      "translation": "On the Day of Resurrection they will carry their own burden and some of the load of those they have led astray without any knowledge. Oh, how evil a burden they will carry!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They say so) that they may bear the full weight of their burdens on the Day of Resurrection and also of the burdens of those whom they misled on account of their ignorance. What a heavy burden are they undertaking to bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides their own burdens, on the Day of Judgment, they will have to carry on the burdens of those whom they have misled without knowledge. How evil that burden will be!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to bear their full burdens on the Day of Resurrection, and some burdens of those whom they mislead with their ignorance; pay heed! What an evil burden they bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will bear their own burdens in full on the Day of Resurrection, and also the burdens of those whom they misled without knowledge. Evil indeed is that which they shall bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may bear their burdens entirely on the day of resurrection and also of the burdens of those whom they lead astray without knowledge; now surely evil is what they bear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may bear their loads complete on the Day of Resurrection, and some of the loads of those that they lead astray without any knowledge. O evil the load they bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may bear their burdens undiminished on the Day of Resurrection, with somewhat of the burdens of those whom they mislead without knowledge. Ah! evil is that which they bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them bear all their own burdens on Resurrection Day as well as some of the burdens of those whom they lead astray without any knowledge. How evil the load with which they shall be burdened!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may bear their burthens in full on the Judgment- Day and also some of the burthens of those whom they have led astray without knowledge. Lo! vile is that which they shall bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[with the result] that they will bear the full weight of their own burden on the Day of Resurrection, along with part of the burden of those whom they mislead without any knowledge. Behold! Evil is what they bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them bear, on the Day of Judgment, their own burdens in full, and also (something) of the burdens of those without knowledge, whom they misled. Alas, how grievous the burdens they will bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will bear their own burdens in full on the Day of Resurrection, and also of the burdens of those whom they misled without knowledge. Evil indeed is that which they shall bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall carry their sins completely on the Day of Resurrection, and some of the sins of those who were led astray by them without knowledge. Evil is that which they sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let them carry their loads complete on the Day of Resurrection, and some of the loads of those they misguided without knowledge. Evil is what they carry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may bear their own burdens in full on the Day of Resurrection and some of the burdens of those whom they misguide without knowledge. Unquestionably, evil is that which they bear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:25] That they may bear, at the conclusion of the matter, their burdens, their sins, complete, none of them expunged, on the Day of Resurrection and also, [bear] some, of the burdens of those whom they lead astray without any knowledge, because they summoned them to error and they [the latter] followed them, and thus both share in the sin. How evil, awful, is the burden they bear, this load [of sins] of theirs which they carry.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That they may bear their burdens) their sins (undiminished on the Day of Resurrection, with somewhat of the burdens) as well as the sins (of those whom they mislead) those whom they drove away from Muhammad (pbuh) and from the Qur'an and faith (without knowledge) or proof. (Ah! evil is that which they bear!) evil are the sins which they bear, i.e. those who were slain at the valley of Badr among the leaders of Quraysh.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِيَحْمِلُواْ أَوْزَارَهُمْ كَامِلَةً } معناه آثامُهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما قالوا ذلك وشاعوا به بين الأنامه { لِيَحْمِلُواْ أَوْزَارَهُمْ } وآثامهم { كَامِلَةً } بلا تخفيف شيء منها ولا نقصانٍ؛ ليؤاخذوا عليها { يَوْمَ ٱلْقِيَامَةِ وَ } يحملوا أيضاً { مِنْ أَوْزَارِ ٱلَّذِينَ يُضِلُّونَهُمْ } من ضعفاء الناس بقولهم هذا إياهم، مع أنهم خالية الأذهان { بِغَيْرِ عِلْمٍ } يتعلق منهم بالقبرآن وإعجازه، ومع ذلك لا يعذرون؛ لعدم التفاتهم إلى التأمل والتدبر حتى يظهر عليهم حقيته وبطلان قولهم { أَلاَ سَآءَ مَا يَزِرُونَ } [انحل: 25] المضلون بضلالهم، والضالون بضلالهم، وعدم تأملهم وتدبرهم، مع أنهم مجبولون على التأمل والتدبر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ماذا } ، يجوز أن يكون اسمًا واحدًا مركبًا منصوبًا بـ { أَنزل } ، وأن تكون ما: استفهامية في موضع رفع بالابتداء، و ذا: بمعنى \" الذي \": خبر، وفي أنزل ضميرٌ محذوف، أي: ما الذي أنزله ربكم؟ واللام في { ليحملوا }: لام العاقبة والصيرورة، أي: قالوا: هو أساطير الأولين فأوجب ذلك أن يحملوا أوزارهم وأوزار غيرهم، وقيل: لام الأمر، و { بغير علم }: حال من المفعول في { يُضلونهم } ، أو من الفاعل، و { تُشاقُّون }: من قرأه بالكسر فالمفعول: ضمير المتكلم، وهو الله تعالى، ومن قرأه بالفتح فالمفعول محذوف، أي: تشاقون المؤمنين من أجلهم\n و { ظالمي أنفسهم }: حال من ضمير المفعول في: \" تتوفاهم \"\n يقول الحقّ جلّ جلاله: { وإذا قيل لهم } أي: كفار قريش: { ماذا أنزل ربكم } على رسوله محمد - عليه الصلاة والسلام -؟ { قالوا }: هو { أساطير الأولين } أي: ما سطره الأولون وكتبوه من الخرافات\n وكان النضر بن الحارث قد اتخذ كتب التواريخ، ويقول: إنما يُحدِّث مُحمدٌ بأساطير الأولين، وحديثي أجمل من حديثه\n والقائل لهم هم المقتسِمُون، وتسميته، حينئذ، مُنزلاً إما على وجه التهكم، أو على الفَرض والتقدير، أي: على تقدير أنه منزل، فهو أساطير لا تحقيق فيه\n ويحتمل أن يكون القائل لهم المؤمنين، فلا يحتاج إلى تأويل\n { ليحملوا أوزارهَم كاملةً يوم القيامة } أي: قالوا ذلك ليُضلوا الناس، فكان عاقبتهم أن حملوا أوزار ضلالهم كاملة، { ومن أوزارِ الذين يُضلونهم }: وبعض أوزار ضلال من كانوا يضلونهم - وهو حصة التسبب في الوقوع في الضلال - حال كونهم { بغير علم } أي: يضلون من لا يعلم أنهم ضُلاّل\n وفيه دليل على أن الجاهل في العقائد غير معذور إذ كان يجب عليه أن يبحث عن الحق وأهله، وينظر في دلائله وحُججه\n قال البيضاوي: { بغير علم }: حال من المفعول أي: يضلون من لا يعلم أنهم ضُلاّل، وفائدتها: الدلالة على أن جهلهم لا يعذرهم إذ كان عليهم أن يبحثوا، ويميزوا بين المحق والمبطل\n هـ\n وقال المحشي: ففيه ذم تقليد المبطل، وأن مقلده غير معذور، بخلاف تقليد المحق الذي قام بشاهد صدقه المعجزة، أو غير ذلك، كدليل العقل والنقل فيما تعتبر دلالته\n هـ\n قلت: ويجوز أن يكون حالاً من الفاعل، أي: يُضِلُّونَ في حال خلوهم من العلم، فقد جمعوا بين الضلال والإضلال\n قال تعالى في شأن أهل الإضلال: { ألا سَاءَ ما يَزِرُون } ، أي: بئس شيئًا يزرونه فعلهم هذا",
      "translations": []
    }
  ]
}