{
  "chapter": "النحل",
  "text": "لا جرم ان الله يعلم ما يسرون وما يعلنون انه لا يحب المستكبرين",
  "translations": [
    {
      "translation": "There is no doubt that Allah knows what they keep secret and what they make public. He does not love people puffed up with pride.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God knows what they hide and what they disclose. He certainly does not love the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah knows all that they conceal and all that they disclose. He certainly does not love those who are steeped in arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God certainly knows whatever you conceal or reveal. He does not love the proud ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah knows what they hide and what they disclose; indeed He does not like the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, Allah knows what they conceal and what they reveal. Truly, He does not like the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly Allah knows what they hide and what they manifest; surely He does not love the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without a doubt God knows what they keep secret and what they publish; He loves not those that wax proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly Allah knoweth that which they keep hidden and that which they proclaim. Lo! He loveth not the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God surely knows what they conceal and what they reveal. He does not love the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly Allah knoweth that which they keep secret and that which they publish; verily He loveth not the stiff- necked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly, Allah knows whatever they hide and whatever they disclose. Indeed, He does not like the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly Allah doth know what they conceal, and what they reveal: verily He loveth not the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, Allah knows what they conceal and what they reveal. Truly, He likes not the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah knows without doubt what they hide and what they make known. He does not love the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without a doubt, God knows what they conceal and what they reveal. He does not like the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly, Allah knows what they conceal and what they declare. Indeed, He does not like the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:23] Without doubt, verily, God knows what they keep secret and what they disclose, and will requite them for it. Indeed He does not love the arrogant, meaning, He will punish them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Assuredly Allah knoweth that which they keep hidden) of hatred, resentful envy, plotting and treachery (and that which they proclaim) of vilification, slander and violent confrontation. (Lo! He loveth not the proud) those who are too proud to believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ جَرَمَ } أي حقاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"There is no sin,\" is true.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك { لاَ جَرَمَ } أي: حقاً على الله يعذبهم، مع { أَنَّ ٱللَّهَ } المطلع لسرائرهم وضمائرهم { يَعْلَمُ } بعلمه الحضوري { مَا يُسِرُّونَ وَمَا يُعْلِنُونَ } من الكفر والضلال، فيجازيهم على مقتضى علمه بحالهم، ولا يحسن إليهم سبحانه بدل إستاءتهم؛ لأنهم مستكبرون { إِنَّهُ } سبحانه { لاَ يُحِبُّ ٱلْمُسْتَكْبِرِينَ } [النحل: 23] لاشتراكهم معه سبحانه في أخص أوصافه؛ إذ الكبرياء مخصوص به، لا يسع لأحد أن يشارك معه فيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: تهديدًا لمن هذا وصفه: { لا جَرَمَ }: لا بدّ، أو لا شك، أو حَقٌّ { أنَّ الله يعلم ما يُسرون وما يعلنون } ، فيجازيهم عليه { إنه لا يحب المستكبرين } مطلقًا، فضلاً عن الذين استكبروا عن توحيده واتّباع رسوله\n ومفهومه: أنه يحب المتواضعين الخاضعين للحق، ولمن جاء به، وهم المؤمنون\n والله تعالى أعلم\n الإشارة: قد تضمنت الآية ثلاث خصال من خصال أهل التوحيد: الأولى: رفع الهمة عن الخلق، وتعلقها بالخالق في جميع المطالب والمآرب إذ لا يترك العبد من هو خالق كل شيء، قادر على كل شي، دائم لا يموت، ويتعلق بعبد عاجز ضعيف، لا يقدر على نفع نفسه، فكيف ينفع غيره؟ { أفمن يخلق كمن لا يخلق أفلا تذكرون } ، { والذين تدعون من دون الله لا يَخلقون شيئًا وهم يُخلقون أموات غير أحياء }\n وأنشدوا في هذا المعنى:\n\nوالخصلة الثانية: تذكر البعث وما بعده، وتقريبُه وجعله نصب العين إذ بذلك يحصل الزهد في هذه الدار الفانية، والاستعداد والتأهب للدار الباقية، وبه تلين القلوب، وتتحقق بعلم الغيوب، وبه يحصل الخضوع للحق، والتعظيم لمن جاء به\n بخلاف من أنكره، أو استبعده، قال تعالى: { فالذين لا يؤمنون بالآخرة قلوبهم منكرة وهم مستكبرون }\n الخصلة الثالثة: التواضع والخضوع لله، ولمن دعا إلى الله، وهو سبب المحبة من الله، ورفع الدرجات عند الله قال صلى الله عليه وسلم:\n\n \" مَنْ تَوَاضَعَ للهِ رَفَعَهُ، ومَنْ تَكَبر وَضَعَهُ الله \" \n\nوقال أيضًا:\n\n \" مَنْ تَوَاضَعَ دُون قَدْره، رَفَعَهُ الله فوق قَدْره \" \n\nبخلاف المتكبر فإنه ممقوت عند الله، مطرود عن باب الله قال تعالى: { إنه لا يحب المستكبرين }\n وفي الحديث:\n\n \" لاَ يَدْخُلُ الجنَّةَ مَنْ في قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ خَرْدلٍ مِنْ كِبْرٍ \" \n\n، أو كما قال صلى الله عليه وسلم،\n\n \" والتكبر: بَطَرُ الحق وغَمْطُ الناس \" \n\n، أي: جحد الحق، واحتقار الناس\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:77",
      "similarity": 0.8319229148060613
    },
    {
      "verse": "16:19",
      "similarity": 0.8291375930789324
    },
    {
      "verse": "71:9",
      "similarity": 0.8044726195114431
    },
    {
      "verse": "36:76",
      "similarity": 0.7461707589535722
    },
    {
      "verse": "64:4",
      "similarity": 0.7094416889204663
    }
  ]
}