{
  "chapter": "النحل",
  "text": "قد مكر الذين من قبلهم فاتى الله بنينهم من القواعد فخر عليهم السقف من فوقهم واتىهم العذاب من حيث لا يشعرون",
  "translations": [
    {
      "translation": "Those before them also plotted, and Allah came at their building from the foundations and the roof caved in on top of them. The punishment came at them from where they did not expect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have gone before them had also conspired; then God uprooted their structure from its foundation; the roof fell over them from above, and punishment came upon them from somewhere they did not suspect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely many people before them had plotted in a similar manner to (vanquish the Truth), but Allah uprooted the whole structure of their plot from its foundations so that the roof fell in upon them, and the chastisement (of Allah) visited them from unknown directions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who went before them had also devised evil plans. God demolished their houses, destroying their very foundations. Their ceilings toppled on their heads and torment struck them from a direction which they had never expected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those before them had plotted, so Allah seized the foundations of their building, therefore the roof fell down upon them from a height, and the punishment came upon them from a place they did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them indeed plotted, but Allah struck at the foundation of their building, the roof fell down upon them from above them, and the torment overtook them from directions they did not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them did indeed devise plans, but Allah demolished their building from the foundations, so the roof fell down on them from above them, and the punishment came to them from whence they did not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that were before them contrived; then God came upon their building from the foundations, and the roof fell down on them from over them, and the chastisement came upon them from whence they were not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them plotted, so Allah struck at the foundations of their building, and then the roof fell down upon them from above them, and the doom came on them whence they knew not;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who went before them also plotted. But God struck at the foundations of their building, and the roof fell down upon them from above. The punishment came upon them from where they did not expect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely there plotted those before them, but Allah came upon their structures from the foundations, so the roof fell down upon them from above them and the torment came upon them whence they perceived not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were before them [had also] schemed. Then Allah came at their edifice from the foundations and the roof fell down upon them from above and the punishment overtook them whence they were not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them did also plot (against Allah's Way): but Allah took their structures from their foundations, and the roof fell down on them from above; and the Wrath seized them from directions they did not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them indeed plotted, but Allah struck at the foundation of their building, and then the roof fell down upon them, from above them, and the torment overtook them from directions they did not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have gone before them also plotted. Then, Allah came upon their building from the foundations, and the roof fell down on them from above them. And the punishment overtook them from where they did not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them also schemed, but God took their structures from the foundations, and the roof caved in on them. The punishment came at them from where they did not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those before them had already plotted, but Allah came at their building from the foundations, so the roof fell upon them from above them, and the punishment came to them from where they did not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:26] Those before them had indeed plotted, [those] such as Nimrod — he built a lofty tower that he might ascend through it to the heavens and wage war against its inhabitants; then God came at, He aimed at, their edifice from the foundations, from the base, unleashing against it winds and earthquake, which demolished it; and so the roof collapsed upon them from above them, that is, while they were beneath it, and the chastisement came upon them whence they were not aware, from a direction which would not have occurred to them: [alternatively] it is said that this [description] is a simile for [demonstrating] the thwarting of that which they had settled on in the way of plots against [God’s] messengers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلمّا ذكر عاقبة إضلالهم وصدّهم السائلين عن القرآن والإسلام في الآخرة أتبع بالتهديد بأن يقع لهم ما وقع فيه أمثالهم في الدّنيا من الخزي والعذاب مع التأييس من أن يبلغوا بصنعهم ذلك مبلغ مرادهم ، وأنهم خائبون في صنعهم كما خاب من قبلهم الذين مكَروا برسلهم .ولما كان جوابهم السائلين عن القرآن بقولهم هو { أساطير الأولين } \\[ سورة النحل : 24 \\] مظهرينه بمظهر النصيحة والإرشاد وهم يريدون الاستبقاء على كفرهم ، سمّي ذلك مكراً بالمؤمنين ، إذ المكر إلحاق الضرّ بالغير في صورة تمويهه بالنّصح والنّفع ، فنُظّر فعلهم بمكر من قبلهم ، أي من الأمم السابقة الذين مكروا بغيرهم مثل قوم هود ، وقوم صالح ، وقوم لوط ، وقوم فرعون ، قال تعالى في قوم صالح : { ومكروا مكراً ومكرنا مكراً } \\[ سورة النحل : 50 \\] الآية ، وقال : { وكذلك جعلنا في كل قرية أكابر مجرميها ليمكروا فيها وما يمكرون إلا بأنفسهم وما يشعرون } \\[ سورة الأنعام : 123 \\].فالتعريف بالموصول في قوله تعالى : { الذين من قبلهم } مساوٍ للتعريف بلام الجنس .ومعنى «أتى الله بنيانهم» استعارة بتشبيه القاصد للانتقام بالجائي نحو المنتقم منه ، ومنه قوله تعالى : { فأتاهم الله من حيث لم يحتسبوا } \\[ سورة الحشر : 2 \\].وقوله تعالى : { فأتى الله بنيانهم من القواعد } تمثيل لحالات استئصال الأمم ، فالبنيان مصدر بمعنى المفعول . أي المبنى ، وهو هنا مستعار للقوّة والعزّة والمنعة وعلوّ القدر .وإطلاق البناء على مثل هذا وارد في فصيح الكلام . قال عبدة بن الطبيب :فما كان قيس هُلْكُه هُلْكَ واحد ... ولكنّه بنيان قوم تهدّماوقالت سعدة أمّ الكميت بن معروف :بنى لك معروفٌ بناءً هدمته ... وللشرف العاديّ باننٍ وهادمو { من القواعد } متعلق ب «أتى» . { ومِن } ابتدائيّة ، ومجرورها هو مبْدأ الإتيان الذي هو بمعنى الاستئصال ، فهو في معنى هدمه .و { القواعد } : الأسس والأساطين التي تجعل عَمداً للبناء يقام عليها السقف . وهو تخييل أو ترشيح ، إذ ليس في الكلام شيء يشبّه بالقواعد .والخرور : السقوط والهويّ ، ففعل خرّ مستعار لِزوال ما به المنعة نظير قوله تعالى : { يخرّبون بيوتهم بأيديهم } \\[ سورة الحشر : 2 \\].{ والسّقْف } : حقيقته غطاء الفراغ الذي بين جدران البيت ، يجعل على الجدران ويكون من حَجر ومن أعواد ، وهو هنا مستعار لما استعير له البناء .و { من فوقهم } تأكيد لجملة { فسخرّ عليهم السّقف }.ومن مجموع هذه الاستعارات تتركّب الاستعارة التمثيليّة . وهي تشبيه هيئة القوم الّذين مكروا في المنعة فأخذهم الله بسرعة وأزال تلك العزّة بهيئة قوم أقاموا بنياناً عظيماً ذا دعائم وآووا إليه فاستأصله الله من قواعده فخرّ سقف البناء دفعة على أصحابه فهلكوا جميعاً . فهذا من أبدع التمثيليّة لأنها تنحلّ إلى عدّة استعارات .وجملة { وأتاهم العذاب } عطف على جملة { فأتى الله بنيانهم من القواعد }. وأل في { العذاب } للعهد فهي مفيدة مضمون قوله { من فوقهم } مع زيادة قوله تعالى : { من حيث لا يشعرون }. فباعتبار هذه الزيادة وردت معطوفة لحصول المغايرة وإلا فإن شأن الموكدة أن لا تعطف . والمعنى أن العذاب المذكور حلّ بهم بغتة وهم لا يشعرون فإن الأخذ فَجْأ أشدّ نكاية لما يصحبه من الرّعب الشديد بخلاف الشيء الوارد تدريجاً فإنّ النّفس تتلقّاه بصبر .\n\n",
      "translations": [
        {
          "translation": "(Those before them plotted) against their prophets, just as the leaders of Quraysh who were slain in the valley of Badr plotted against Muhammad (pbuh); the reference here is to the tyrant Nimrod who built the tower, (so Allah struck at the foundations of their building) Allah extracted their tower from its foundation, (and then the roof fell down upon them) the tower fell upon him (from above them, and the doom came on them) through this destruction (whence they knew not);\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَتَى ٱللَّهُ بُنْيَانَهُمْ مِّنَ ٱلْقَوَاعِدِ } معناه دُمَّرَ الله عليهم - والله لَيس بِزَائلٍ ولا مُنتَقلٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah {So Allah destroyed their building from the foundations} means that Allah destroyed them - and Allah is not wasteful or moving.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { قَدْ مَكَرَ ٱلَّذِينَ } مضوا { مِنْ قَبْلِهِمْ } واحتالوا لإضلال العوام\n وبنوا أبنية رفيعة للصعود إلى السماء\n والمقاتلة مع سكانها وإلهها\n ثمَّ لما تم بنيانهم وقصورهم { فَأَتَى ٱللَّهُ بُنْيَانَهُمْ } أي: أتى أمره سبحانه بإهلاكهم وتعذيبهم بهدم بنائهم { مِّنَ ٱلْقَوَاعِدِ } والأعمدة والأساس التي بُنيت عليها البناء\n فتضعضعت وتحركت الدعائم { فَخَرَّ عَلَيْهِمُ ٱلسَّقْفُ مِن فَوْقِهِمْ } وهم تحته متمكنون مترفهون\n فهلكوا { وَ } بالجملة: { أَتَاهُمُ ٱلْعَذَابُ } بغتةً { مِنْ حَيْثُ لاَ يَشْعُرُونَ } [النحل: 26] أماراتها قبل نزوله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:5",
      "similarity": 0.6213483891809188
    },
    {
      "verse": "21:32",
      "similarity": 0.6111740400668673
    },
    {
      "verse": "43:33",
      "similarity": 0.4645698517142533
    },
    {
      "verse": "16:45",
      "similarity": 0.28651458238843386
    },
    {
      "verse": "32:15",
      "similarity": 0.25642211377284896
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}