{
  "chapter": "النحل",
  "text": "الهكم اله وحد فالذين لا يؤمنون بالءاخرة قلوبهم منكرة وهم مستكبرون",
  "translations": [
    {
      "translation": "Your God is One God. As for those who do not have iman in the Next World, their hearts are in denial and they are puffed up with pride.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is one God. But the hearts of those who believe not in the life to come are filled with denial, and they are puffed up with pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is the One God. But the hearts of those who do not believe in the Hereafter are steeped in rejection of the Truth, and they are given to arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is only One. The hearts of those who do not believe in the life hereafter dislike (the truth). They are puffed up with pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is One God; so those who do not believe in the Hereafter – their hearts deny and they are proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your god is one God. But for those who believe not in the Hereafter, their hearts are in denial, and they are proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Allah is one Allah; so (as for) those who do not believe in the hereafter, their hearts are ignorant and they are proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is One God. And they who believe not in the world to come, their hearts deny, and they have waxed proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Allah is One Allah. But as for those who believe not in the Hereafter their hearts refuse to know, for they are proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is the One God. As for those who do not believe in the Hereafter, their hearts refuse to admit the truth and they are arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God of you all is One God; so those who believe not in the Hereafter-their hearts are perverse and they are stiff-necked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is the One God. Those who do not believe in the Hereafter, their hearts are in denial [of the truth], and they are arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Allah is one Allah: as to those who believe not in the Hereafter, their hearts refuse to know, and they are arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Ilah (God) is One Ilah (God Allah, none has the right to be worshipped but He). But for those who believe not in the Hereafter, their hearts deny (the faith in the Oneness of Allah), and they are proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is One God. Those who do not believe in the Everlasting Life their hearts disbelieve, and are puffed up with pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is one God. As for those who do not believe in the Hereafter, their hearts are in denial, and they are arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your god is one God. But those who do not believe in the Hereafter - their hearts are disapproving, and they are arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:22] Your God, the One deserving of your worship, is One God, without [any] equal in [terms of] His essence or His attributes, and this is God, exalted He be. But as for those who do not believe in the Hereafter their hearts are in denial, rejecting the Oneness [of God], and they are arrogant, scorning to believe in it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Your God is One God) He knows this, not your idols. (But as for those who believe not in the Hereafter) those who do not believe in resurrection after death (their hearts refuse to know) acknowledge Allah's divine Oneness, (for they are proud) too proud to believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { إِلٰهُكُمْ } الذي أوجدكم من كتم العدم، وأظهركم في فضاء الوجود { إِلٰهٌ وَاحِدٌ } أحد صمد، لم يكن له كف، ولا شريك\n\n[الشورى: 11]، إنما يظهر وينكشف توحيده سبحانه لأولي العزائم والنهي، من أرباب المحبة والولاء في النشأة الأولى والأخرى { فَٱلَّذِينَ لاَ يُؤْمِنُونَ بِٱلآخِرَةِ } المعدة لشرف اللقاء { قُلُوبُهُم مُّنكِرَةٌ } بلقاء الله فيها { وَهُم } من شدة شكيمتهم، وكثافة حجبهم مع إنزال الكتب المبينة لأحوالها وأهوالها، والرسل المنبهين لهم عليها { مُّسْتَكْبِرُونَ } [النحل: 22] مترددون عتواً وعناداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال ابنُ جُزَيْ: نفى عن الأصنام صفة الربوبية، وأثبت لهم أضدادها وهي أنهم مخلوقون غير خالقين، وغير أحياء، وغير عالمين وقت البعث، فلما قام البرهان على بطلان ربوبيتهم، أثبت الربوبية لله وحده، فقال: { إلهكم إله واحد }\n هـ\n وهو تصريح بما أقام عليه الحجج والبراهين بما تقدم\n ثم ذكر سبب إصرارهم على الكفر - وهو إنكار البعث والتكبر - فقال: { فالذين لا يؤمنون بالآخرة قلوبهم مُنْكِرةٌ وهم مستكبرون } أي: فالمنكرون للبعث قلوبهم منكرة لوحدانيته تعالى، وهم مستكبرون عن اتّباع الرسل فيما جاؤوا به، والخضوع لهم لأن المؤمن بالآخرة يكون طالبًا للدلائل، متأملاً فميا يسمع، فينتفع به، خاضعًا للحق، متبعًا لمن جاء به، بخلاف الكافر، يكون حاله بالعكس منهمكًا في الغفلة، متبعًا للهوى، يُنكر بقلبه ما لا يعرف إلا بالبرهان، اتّباعًا للأسلاف، وتقليدًا لهم، وركونًا إلى المالوف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:81",
      "similarity": 0.5798715830840326
    },
    {
      "verse": "15:62",
      "similarity": 0.5752516426518582
    },
    {
      "verse": "54:6",
      "similarity": 0.5014407349279306
    },
    {
      "verse": "35:26",
      "similarity": 0.4930186846464389
    },
    {
      "verse": "67:18",
      "similarity": 0.4907967360250895
    }
  ]
}