{
  "chapter": "النحل",
  "text": "الذين تتوفىهم الملئكة ظالمى انفسهم فالقوا۟ السلم ما كنا نعمل من سوءۭ بلى ان الله عليمۢ بما كنتم تعملون",
  "translations": [
    {
      "translation": "As for those the angels take in death while they are wronging themselves, they will offer their submission: 'We did not do any evil.' Oh yes you did! Allah knows what you were doing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They whose souls are drawn out by the angels while they are sinning, shall offer submission: \"We did no evil.\" But God knows well what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the same unbelievers who, when the angels seize them and cause them to die while they are engaged in wrong-doing, they will proffer their submission saying: \"We were engaged in no evil.\" (The angels will answer them): \"Surely Allah knows well all that you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unjust, who will be seized by the angels, will submit themselves, obey, and say, \"We were not evil-doers.\" But God certainly knows what they had been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose souls the angels remove whilst they were wronging themselves; so now they will plead “We never used to do any wrong”; \"Yes you did, why not? Indeed Allah well knows what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose lives the angels take while they are doing wrong to themselves. Then, they will (falsely) submit (saying): \"We did not do any evil.\" (The angels will reply): \"Yes! Truly, Allah is Most Knowing of what you did.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom the angels cause to die while they are unjust to themselves. Then would they offer submission: We used not to do any evil. Aye! surely Allah knows what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whom the angels take while still they are wronging themselves.' Then they will offer surrender: 'We were doing nothing evil. 'Nay; but surety God has knowledge of the things you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whom the angels cause to die while they are wronging themselves. Then will they make full submission (saying): We used not to do any wrong. Nay! Surely Allah is Knower of what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose lives the angels take while they are wronging their own souls will offer submission saying, \"We were not doing anything evil!\" \"Indeed!\" the angels will reply, \"God is aware of what you have been doing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom the angels cause to die while they are wronging them selves, and then they proffer submission: we have not been working any evil. Yea! verily Allah is the Knower of that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—Those whom the angels take away while they were wronging themselves. Thereat they submit: ‘We were not doing any evil!’ ‘Yes, [the angels say to them,] indeed Allah knows best what you used to do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Namely) those whose lives the angels take in a state of wrong-doing to their own souls.\" Then would they offer submission (with the pretence), \"We did no evil (knowingly).\" (The angels will reply), \"Nay, but verily Allah knoweth all that ye did;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose lives the angels take while they are doing wrong to themselves (by disbelief and by associating partners in worship with Allah and by committing all kinds of crimes and evil deeds).\" Then, they will make (false) submission (saying): \"We used not to do any evil.\" (The angels will reply): \"Yes! Truly, Allah is All-Knower of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whom the angels take while they were still harming themselves' Then they will offer submission, saying: 'We have done no evil' No, surely Allah knows what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those wronging their souls while the angels are taking them away—they will propose peace: “We did no wrong.” Yes you did. God is aware of what you used to do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ones whom the angels take in death [while] wronging themselves, and [who] then offer submission, [saying], \"We were not doing any evil.\" But, yes! Indeed, Allah is Knowing of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:28] those whom the angels take [in death] (read [feminine person] tatawaffāhum or [masculine] yatawaffāhum) while they are wronging themselves’, through disbelief. Then they will offer submission, becoming compliant and submitting themselves [to belief in God] upon death, saying: ‘We were not doing any evil’, [any] associating others with God, whereat the angels say: ‘Nay! Surely God is Knower of what you used to do’, and will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whom the angels cause to die) on the Day of Badr (while they are wronging themselves) through disbelief. (Then will they make full submission (saying)) they will answer; it is also said that this means: they resign to Allah, saying: (We used not to do any wrong) we did not worship anything beside Allah nor did we associate partners with Him. (Nay!) Allah will say: nay! (Surely Allah is Knower of what ye used to do) and say and worship beside Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَلْقَوُاْ ٱلسَّلَمَ } معناه صَالَحُوا وسَالَمُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {So cast your lot}, means \"do right and be at peace.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومطابقته للواقع { فَأَلْقَوُاْ ٱلسَّلَمَ } أي: الانقياد والتسليم\n مبرئين نفوسهم عن التكمذيب والإساءة مع القرآن\n قائلين: { مَا كُنَّا } في النشأة الأولى { نَعْمَلُ مِن سُوۤءٍ } أي: ما نريد ونعتقد الإساءة في حقه\n فيقول الملائكة لهم على سبيل التهكم: { بَلَىٰ } أنتم لا تسيئون الأدب مع الرسول والقرآن { إِنَّ ٱللَّهَ } المطلع بجميع ما كان ويكون { عَلِيمٌ بِمَا كُنْتُمْ تَعْمَلُونَ } [النحل: 28] من الرد والإكار والتكذيب\n فيجازيكم على مقتضى علمهز\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فألقَوُا السَّلَمَ } أي: استسلموا\n وألقوا القياد من أنفسهم\n حين عاينوا الموت\n قائلين: { ما كنا نعملُ من سُوء }: من كفر وعدوان\n يحتمل أن يكون قولهم ذلك قصدوا به الكذب اعتصامًا به\n كقولهم:\n[الأنعَام: 23]\n أو يكونوا أخبروا على حساب اعتقادهم في أنفسهم\n فلم يقصدوا الكذب\n ولكنه كذب في نفس الأمر\n قال الحسن: هي مواطن\n فمرة يُقرون على أنفسهم\n كما قال تعالى:\n[الأنعَام: 130]\n ومرة يجحدون كهذه الآية\n فتجيبهم الملائكة بقولهم: { بلى } قد كنتم تعملون السوء والعدوان\n { إن الله عليم بما كنتم تعملون } فهو يجازيكم عليه\n وقيل: إن قوله: { فألقَوُا السَّلَمَ } إلى آخر الآية\n راجع إلى شرح حالهم يوم القيامة\n فيتصل في المعنى بقوله عزّ وجلّ: { أين شركائي الذين كنتم تُشاقون فيهم } إلخ\n فيكون الرَّادُ عليهم بقوله: { بلى\n هو الله تعالى\n أو: أولو العلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:76",
      "similarity": 0.5998997504533168
    },
    {
      "verse": "84:15",
      "similarity": 0.5900015775819571
    },
    {
      "verse": "39:59",
      "similarity": 0.5518358262115302
    },
    {
      "verse": "40:50",
      "similarity": 0.5298559046855419
    },
    {
      "verse": "36:81",
      "similarity": 0.4987823038573628
    }
  ]
}