{
  "chapter": "النحل",
  "text": "فادخلوا۟ ابوب جهنم خلدين فيها فلبئس مثوى المتكبرين",
  "translations": [
    {
      "translation": "'Enter the gates of Hell, remaining in it timelessly, for ever. How evil is the abode of the arrogant!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So enter the gates of Hell, and dwell there for ever. How dreadful a dwelling for the haughty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go now, and enter the gate of Hell, and abide in it for ever. \" Evil indeed is the abode of the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be commanded to enter hell to live therein forever. How terrible will be the place of the proud ones!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So now enter the gates of hell, remaining in it for ever”; so what an evil destination for the arrogant!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So enter the gates of Hell, to abide therein, and indeed, what an evil abode there is for the arrogant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore enter the gates of hell, to abide therein; so certainly evil is the dwelling place of the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So enter the gates of Gehenna, there to dwell forever.' Evil is the lodging of those that wax proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So enter the gates of hell, to dwell therein for ever. Woeful indeed will be the lodging of the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so enter the gates of Hell. There you shall abide forever.\" Evil indeed is the abode of the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore enter the portals of Hell as abiders therein. Vile is the abode of the arrogant\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enter the gates of hell to remain in it [forever]. Evil is the [final] abode of the arrogant.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So enter the gates of Hell, to dwell therein. Thus evil indeed is the abode of the arrogant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So enter the gates of Hell, to abide therein, and indeed, what an evil abode will be for the arrogant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enter the gates of Gehenna (Hell) to be in it for ever. Evil is the lodging of the proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enter the gates of Hell, to dwell therein forever. Miserable is the residence of the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So enter the gates of Hell to abide eternally therein, and how wretched is the residence of the arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:29] And it will also be said to them: So enter the gates of Hell, to abide therein! Evil indeed is the lodging, the abode, of the arrogant.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So enter the gates of hell, to dwell therein for ever) neither to die nor leave it. (Woeful indeed will be the lodging of the arrogant) the abode of the disbelievers is Gehenna.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قيل لهم زجراً وقهراً: { فَٱدْخُلُوۤاْ } أيها المشركون المستكبرون\n المعاندون مع الله ورسوله { أَبْوَابَ جَهَنَّمَ } كل فرقة منكم من باب منها\n على تفاوت طبقاتكم في موجباتها\n وادخلوا أنواع عذابها ونكالها\n حال كونكم { خَالِدِينَ فِيهَا } مخلدين مؤيدين { فَلَبِئْسَ مَثْوَى ٱلْمُتَكَبِّرِينَ } [النحل: 29] جنهم البعد والخذلان التي هي منزل الطرد والحرمان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقيل: إن قوله: { فألقَوُا السَّلَمَ } إلى آخر الآية، راجع إلى شرح حالهم يوم القيامة، فيتصل في المعنى بقوله عزّ وجلّ: { أين شركائي الذين كنتم تُشاقون فيهم } إلخ، فيكون الرَّادُ عليهم بقوله: { بلى، هو الله تعالى، أو: أولو العلم، ويُقوي هذا قوله بعده { فادخلوا أبواب جهنم } لأن دخولها لا يكون إلا بعد البعث والحساب، لا بعد الموت إذ لا يكون بعد الموت إلا العرض عليها غُدوًا وعشيًا، والمراد بدخول أبوابها، أي: التي تفضي إلى طبقاتها، التي هي بعضها على بعض، وأبوابها كذلك، كل صنف يدخل من بابه المُعَدِّ له، { خالدين فيها فلبئس مثوى } أي: مقام { المتكبرين } جهنم\n الإشارة: وإذا قيل لأهل الغفلة والإنكار: ماذا أنزل ربكم، على قلوب أولياء زمانكم من المواهب وأسرار الخصوصية؟ قالوا: أساطير الأولين، ثم عَوَّقُوا الناس عن الدخول في طريقهم لتطهير قلوبهم، فيحملوا أوزارهم كاملة يوم القيامة حيث ماتوا مصرين على الكبائر وهم لا يشعرون\n\n\nويحملون من أوزار الذين يضلونهم عن طريق الخصوص بغير علم، بل جهلاً وعنادًا وحسدًا، ألا ساء ما يزرون\n قلت: الذي أتلف العوام عن الدين ثلاثة أصناف: علماء السوء، وفقراء السوء - وهم أهل الزوايا والنسبة -، وقراء السوء لأن هؤلاء هم المقتدى بهم، والمنظور إليهم، فإذا رأوهم أقبلوا على الدنيا، وقصروا في الدين، تبعوهم على ذلك فضلوا معهم، فقد ضلوا وأضلوا، وإذا أنكروا على أولياء الله، ومكروا بهم، اقتدوا بهم في ذلك فيتولى الله حفظ أوليائه، ويهدم مكرهم قال تعالى: { فأتى الله بنيانهم من القواعد }\n\n\n الآية، فإذا كان يوم القيامة أبعدهم عن حضرته، وأسكنهم مع عوام خلقه\n فإذا أنكروا ما فعلوا في الدنيا، يقال لهم: { بلى إن الله عليم بما كنتم تعملون } ، فيخلدون في عذاب القطيعة والحجاب، فبئس مثوى المتكبرين\n والله تعالى أعلم\n ثمَّ ذكر اضدادهم فقال: { وَقِيلَ لِلَّذِينَ ٱتَّقَوْاْ مَاذَا أَنْزَلَ رَبُّكُمْ }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:76",
      "similarity": 0.9989484937281211
    },
    {
      "verse": "39:72",
      "similarity": 0.9968180678238389
    },
    {
      "verse": "39:32",
      "similarity": 0.5832271269195397
    },
    {
      "verse": "29:68",
      "similarity": 0.538755193522464
    },
    {
      "verse": "47:19",
      "similarity": 0.5044133741180881
    }
  ]
}