{
  "chapter": "النحل",
  "text": "خلق السموت والارض بالحق تعلى عما يشركون",
  "translations": [
    {
      "translation": "He created the heavens and the earth with truth. He is exalted above anything they associate with Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with reason. Too glorious and high is He for what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with Truth. Exalted is He above whatever they associate with Allah in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth for a genuine purpose. He is too Exalted to be considered equal to anything else.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with the truth; Supreme is He above their ascribing of partners (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth with truth. High is He, Exalted above all that they associate as partners with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with the truth, highly exalted be He above what they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth in truth; high be He exalted above that they associate With Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath created the heavens and the earth with truth. High be He Exalted above all that they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth for a true purpose. He is exalted above anything they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath created the heavens and the earth with a purpose. Exalted is He above that which they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with consummate wisdom. He is above having any partners that they ascribe [to Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth for just ends: Far is He above having the partners they ascribe to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth with truth. High be He Exalted above all they associate as partners with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with truth. Exalted is He above what they associate (with Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with justice. He is exalted above the associations they attribute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and earth in truth. High is He above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:3] He created the heavens and the earth with the Truth, that is, with the purpose of [manifesting] truth. Exalted be He above what they associate, with Him in the way of idols.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف بياني ناشىء عن قوله : { سبحانه وتعالى عما يشركون } \\[ سورة النحل : 1 \\] لأنهم إذا سمعوا ذلك ترقّبوا دليل تنزيه الله عن أن يكون له شركاء . فابتدىء بالدلالة على اختصاصه بالخلق والتقدير؛ وذلك دليل على أن ما يخلق لا يوصف بالإلهية كما أنبأ عنه التفّريع عقب هذه الأدلّة بقوله الآتي { أفمن يخلق كمن لا يخلق أفلا تذكرون } \\[ سورة النحل : 17 \\].وأعقب قوله : { سبحانه } بقوله : { وتعالى عما يشركون } تحقيقاً لنتيجة الدليل ، كما يذكر المطلوب قبل ذكر القياس في صناعة المنطق ثم يذكر ذلك المطلوب عقب القياس في صورة النتيجة تحقيقاً للوحدانية ، لأن الضلال فيها هو أصل انتقاض عقائد أهل الشرك ، ولأن إشراكهم هو الذي حداهم إلى إنكار نبوءة من جاء ينهاهم عن الشرك فلا جرم كان الاعتناء بإثبات الوحدانية وإبطال الشرك مقدماً على إثبات صدق الرسول عليه الصلاة والسلام المُبدأ به في أول السورة بقوله تعالى : { ينزل الملائكة بالروح من أمره } \\[ سورة النحل : 2 \\].وعُددت دلائل من الخلق كلها متضمنة نعماً جمّة على الناس إدماجاً للامتنان بنعم الله عليهم وتعريضاً بأن المنعم عليهم الذين عبدوا غيره قد كفروا نعمته عليهم؛ إذ شكروا ما لم يُنعم عليهم ونسوا من انفرد بالإنعام ، وذلك أعظم الكفران ، كما دلّ على ذلك عطف { وإن تعدوا نعمة الله لا تُحصوها } \\[ سورة إبراهيم : 34 \\] على جملة { أفمن يخلق كمن لا يخلق } \\[ سورة النحل : 17 \\].والاستدلال بخلق السماوات والأرض أكبر من سائر الأدلّة وأجمع لأنها محوية لهما ، ولأنهما من أعظم الموجودات ، فلذلك ابتدىء بهما ، لكن ما فيه من إجمال المَحويات اقتضى أن يعقّب بالاستدلال بأصناف الخلق والمخلوقات فثنّي بخلق الإنسان وأطواره وهو أعجب الموجودات المشاهدة ، ثم بخلق الحيوان وأحواله لأنه يجمع الأنواع التي تلي الإنسان في إتقان الصنع مع ما في أنواعها من المنن ، ثم بخلق ما به حياة الإنسان والحيوان وهو الماء والنبات ، ثم بخلق أسباب الأزمنة والفصول والمواقيت ، ثم بخلق المعادن الأرضية ، وانتقل إلى الاستدلال بخلق البحار ثم بخلق الجبال والأنهار والطرقات وعلامات الاهتداء في السير . وسيأتي تفصيله .والباء في قوله : { بالحق } للملابسة . وهي متعلقة ب { خلق } إذ الخلق هو الملابس للحقّ .والحقّ : هنا ضد العبث ، فهو هنا بمعنى الحكمة والجدّ؛ ألا ترى إلى قوله { وما خلقنا السموات والأرض وما بينهما لاعبين ما خلقناهما إلا بالحق } \\[ سورة الأنبياء : 16 \\] وقوله تعالى : { وما خلقنا السماء والأرض وما بينهما باطلاً } \\[ سورة ص : 27 \\]. والحقّ والصدق يطلقان وصفين لكمال الشيء في نوعه .وجملة { تعالى عما يشركون } معترضة .وقرأ حمزة والكسائي وخلف { تعالى عما تشركون } بمثناة فوقية .\n\n",
      "translations": [
        {
          "translation": "(He hath created the heavens and the earth with truth) for the Truth; it is also said that this means: for evanescence and extinction. (High be He exalted) He exonerates Himself (above all that they associate (with Him)) of idols.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nثم عدّ الصفات الإضافية كالخلق والرزق\n وفصّل النِعَم المتعددة كالنعم وغيرها\n ولما ظهر الحق والخلق ظهر طريق الحق والباطل\n فقال: { وعلى الله قصد السبيل } أي: عليه لزوم السبيل المستقيم والهداية إليها لأهله\n كما قال:\n[هود\n الآية: 56] أي: كل من كان على هذا الصراط الذي هو طريق التوحيد لا بدّ وأن يكون من أهله تعالى لأنه طريقه الذي يلزمه\n ومن السبيل { جائر } يعني بعض السبل\n وهي السبل المتفرقة مما عدا سبيل التوحيد جائر عادل عن الحق\n موصل إلى الباطل لا محالة\n فهي سبيل الضلالة كيفما كانت\n ولم يشأ هداية الجميع إلى السبيل المستقيم لكونها تنافي الحكمة\n { الذين تتوفّاهم الملائكة ظالمي أنفسهم } قد مرّ أن السابقين الموحدين يتوفاهم الله تعالى بذاته\n وأما الأبرار والسعداء فقسمان: فمن ترقى عن مقام النفس بالتجرّد ووصل إلى مقام القلب بالعلوم والفضائل يتوفّاهم ملك الموت\n ومن كان في مقام النفس من العباد والصلحاء والزهّاد والمتشرّعين الذين لم يتجرّدوا عن علائق البدن بالتزكية والتحلية تتوفاهم ملائكة الرحمة بالبشرى بالجنة\n أي: جنّة النفس التي هي جنة الأفعال والآثار\n وأما الأشرار الأشقياء فكيفما كانوا تتوفاهم ملائكة العذاب\n إذ القوى الملكوتية المتصلة بالنفوس تتشكل بهيئات تلك النفوس\n فإذا كانت محجوبة ظالمة كانت هيئاتهم غاسقة ظلمانية هائلة\n فتتشكل القوى الملكوتية القابضة لنفوسهم بتلك الهيئات لمناسبتها\n ولهذا قيل: إنما يظهر ملك الموت على صورة أخلاق المحتضر\n فإذا كانت رديئة\n ظلمانية\n كانت صورته هائلة\n موحشة\n غلب على من يحضره الخوف والذعر\n وتذلّل وتمسكن\n ونزل عن استكباره\n وأظهر العجز والمسكنة\n وهذا معنى قوله: { فألقوا السلم } أي: سالموا\n وهانوا\n ولانوا\n وتركوا العناد والتمرّد وقالوا: { ما كنا نعمل من سوء } فأجيبوا بقولهم: { بلى إن الله عليم بما كنتم تعملون فادخلوا أبواب جهنم } الأفعال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف تشركون أيها المشركون ما لا يقدر على خلق أحقر الأشياء وأضعفها للقادر الحكيم الذي { خَلَقَ ٱلسَّمَٰوَٰتِ } مع كمال عظمتها وفعتها { وَٱلأَرْضَ } بكمال بسطتها\n وإنماخلق ما خلق\n وأظهر ما أظهر ملتبساً { بِٱلْحَقِّ } أي: بانبساط نور الوجود الكائن الثابت في نفسه\n وامتداد أظلال أوصافه وأسمائه عليهما\n مع أنه على صرافة وحدته\n وهما على عدميتهما الأصلية { تَعَالَىٰ } وتقدس { عَمَّا يُشْرِكُونَ } [النحل: 3] له شيئاً لا وجود له\n ولا تحقق سوى الظلية والعكسية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:4",
      "similarity": 0.7287394166802171
    },
    {
      "verse": "28:68",
      "similarity": 0.6519889454127202
    },
    {
      "verse": "42:4",
      "similarity": 0.6046152998653561
    },
    {
      "verse": "7:190",
      "similarity": 0.5895349162093823
    },
    {
      "verse": "23:92",
      "similarity": 0.5505459704212684
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}