{
  "chapter": "النحل",
  "text": "ان تحرص على هدىهم فان الله لا يهدى من يضل وما لهم من نصرين",
  "translations": [
    {
      "translation": "However eager you are for them to be guided, Allah will not guide those whom He misguides. They will have no helpers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you are eager to guide them, God does not surely guide those who have gone astray: They will have no one to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), howsoever eager you may be to show them the Right Way, Allah does not bestow His guidance on those whom He lets go astray; and in fact none will be able to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), even though you have a strong desire to guide them, be sure that God will not guide those who have gone astray and no one will be able to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you (O dear Prophet Mohammed – peace and blessings be upon him) desire for their guidance, then indeed Allah does not guide one whom He misleads, and they do not have any aides.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Even] if you desire that they be guided, then verily, Allah does not guide those whom He allowed to stray, and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you desire for their guidance, yet surely Allah does not guide him who leads astray, nor shall they have any helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though thou art ever so eager to guide them, God guides not those whom He leads astray; they have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if thou (O Muhammad) desirest their right guidance, still Allah assuredly will not guide him who misleadeth. Such have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though you [Prophet] may be eager to guide them, God does not guide those whom He lets go astray, [because of their refusal to give a positive response to the truth]. They will have no supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou art solicitous for their guidance, then verily Allah guideth not whomsoever He sendeth astray, and for them there are no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you are eager for them to be guided, indeed Allah does not guide those who mislead [others], and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou art anxious for their guidance, yet Allah guideth not such as He leaves to stray, and there is none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you (O Muhammad SAW) covet for their guidance, then verily Allah guides not those whom He makes to go astray (or none can guide him whom Allah sends astray). And they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though you are ever so eager to guide them, Allah will not guide those who mislead (others). There shall be none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even though you may be concerned about their guidance, God does not guide those who misguide. And they will have no saviors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Even] if you should strive for their guidance, [O Muhammad], indeed, Allah does not guide those He sends astray, and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:37] If you, O Muhammad (s), are eager for them to be guided, when God has already made them go astray, you will not be able to achieve this: For God does not guide (read passive lā yuhdā [?], or active lā yahdī) he whom He has [already] sent astray, he whom He desires to send astray, and they will have no helpers, [no] protectors from God’s chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Even if thou (0 Muhammad) desirest their right guidance) their profession of Allah's divine Oneness, (still Allah assuredly will not guide) to His religion (him who misleadeth) His created beings from His religion, because this makes him undeserving of His religion. (Such) the disbelievers of Mecca (have no helpers) no one to save them from Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِن تَحْرِصْ } يا أكمل الرسل { عَلَىٰ هُدَاهُمْ } وتريد هدايتهم، إنك لا تهدي من أحببت { فَإِنَّ ٱللَّهَ } الحكيم الهادي لعباده على مقتضى علمه باستعدادتهم { لاَ يَهْدِي مَن يُضِلُّ } أي: لا يريد هداية من أراد ضلاله في ساب علمه، ولوح وفضائه { وَمَا لَهُمْ } بعدما أراد الله إظلالهم { مِّن نَّاصِرِينَ } [النحل: 37] ينصرهم على الهداية، ويشفع فهم حتى ينقذهم على الضلال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nثم نهى نبيه عن الحرص عليهم فقال: { إنْ تَحرِصْ } يا محمد { على هُداهم فإن الله لا يَهْدي من يُضِلُّ } أي: من يريد إضلاله وقضى بشقائه وهو الذي حقت عليه الضلالة، وقرأ غير الكوفيين بالبناء للمفعول، وهو أبلغ، أي: فإن الله لا يُهدي من يضله، أي: لا يهدي غيرُ الله من يريد اللهُ إضلاله\n { وما لهم من ناصرين } ليس لهم من ينصرهم يدفع العذاب عنهم\n الإشارة: هل ينظر مَن عكف على دنياه، وأكب على متابعة حظوظه وهواه، إلا أن تنزل الملائكة لقبض روحه، فيندم حيث لا ينفع الندم، وقد زلت به القدم، فيتمنى ساعة تُزاد في عمره فلا يجدها، أو يأتي أمر ربك أمرٌ يحول بينه وبين العمل الصالح كمرض مزمن، أو فتنة مضلة\n كذلك فعل من قبله، اغتر بدنياه حتى اختطف لأخراه\n وما ظلمهم الله، بل بعث الرسل وأخلفهم بأهل الوعظ والتذكير، فحادوا عنهم، فأصابهم جزاء سيئات ما عملوا من الغفلة والبطالة، وحاق بهم ما كانوا به يستهزئون، من وبال التقصير، وفوات مقام أهل الجد والتشمير\n وقال الذين أشركوا في محبة الله سواه من الحظوظ وزهرة الدنيا: لو شاء الله ما فعلنا ذلك، محتجين بالقدر، مع الإقامة على البطالة والخذلان\n كذلك فعل مَنْ قَبْلَهُمْ من أهل الغفلة، فهل على الرسل وخلفائهم إلا البلاغ المبين؟ فقد حذَّروا من متابعة الدنيا، وبلَّغوا أن الله غيور لا يُحب من أشرك معه غيره في محبته، فقد بعث في كل أمة وعصر نذيرًا، يأمر بعبادة الله وحده، واجتناب كل ما سواه فمنهم من هداه الله، فاختاره لحضرته، فلم يُحب سواه\n ومنهم من حقت عليه الضلالة عن مقام الخصوص، فبقي في مقام البعد مُكَذِّبًا بطريق الخصوص\n فسيروا في الأرض فانظروا كيف كان عاقبة المكذبين كان عاقبتهم الحرمان ولزوم الخذلان\n ويقال للعارف المذكِّر لمثل هؤلاء: { إن تحرص على هداهم فإن الله لا يهدي من يضل }\n\n\n الآية\n وبالله التوفيق\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:103",
      "similarity": 0.9145508349212416
    },
    {
      "verse": "9:128",
      "similarity": 0.556129501555539
    },
    {
      "verse": "4:129",
      "similarity": 0.38180036177130694
    },
    {
      "verse": "2:96",
      "similarity": 0.3437392752658574
    },
    {
      "verse": "30:29",
      "similarity": 0.13139148160077682
    }
  ]
}