{
  "chapter": "النحل",
  "text": "ليبين لهم الذى يختلفون فيه وليعلم الذين كفروا۟ انهم كانوا۟ كذبين",
  "translations": [
    {
      "translation": "It is so that He can make clear to them the things they differed about and so that those who were kafir will know that they were liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For (they fear) He might make what they differed about plain to them, and that the infidels may realise that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(That is bound to happen in order that) He may make clear to them the reality regarding the matters on which they differ and that the unbelievers may realize that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Through the resurrection) God wants to make a clear distinction between right and wrong and make the unbelievers know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may make clear to them the matter in which they differed, and the disbelievers may realise that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may make clear to them what they differed over, and so that those who disbelieved may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that He might make manifest to them that about which they differ, and that those who disbelieve might know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may make clear to them that whereon they were at variance, and that the unbelievers may know that they were truly liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may explain unto them that wherein they differ, and that those who disbelieved may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "this is so that He may make clear to them what they have differed about and so that those who are bent on denying the truth may realize that they were lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This will be in order that he may manifest unto them that wherein they differ, and that those who disbelieved should come to know that they had been liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may clarify for them what they differ about, and that the faithless may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They must be raised up), in order that He may manifest to them the truth of that wherein they differ, and that the rejecters of Truth may realise that they had indeed (surrendered to) Falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may make manifest to them the truth of that wherein they differ, and that those who disbelieved (in Resurrection, and in the Oneness of Allah) may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is in order that He may make clear to them that which they differed upon, and in order that those who disbelieve might know that they were indeed lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To clarify for them what they differed about, and for the faithless to know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It is] so He will make clear to them [the truth of] that wherein they differ and so those who have disbelieved may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:39] That He may make clear to them (li-yubayyina is semantically connected to an implied yab‘athuhum, ‘He will resurrect them’) what they differ, with believers, in, of matters of religion, by punishing them and rewarding the believers, and that the disbelievers may know that they were liars, when they denied the Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ ليبين } تعليل لقوله تعالى : { وعداً عليه حقاً } \\[ سورة النحل : 38 \\] لقصد بيان حكمة جعله وعداً لازماً لا يتخلّف ، لأنه منوط بحكمة ، والله تعالى حكيم لا تجري أفعاله على خلاف الحكمة التامّة ، أي جعل البعث ليبيّن للناس الشيء الذي يختلفون فيه من الحقّ والباطل فيظهر حقّ المحقّ ويظهر باطل المبطل في العقائد ونحوها من أصول الدّين وما ألحق بها .وشمل قوله : { يختلفون } كل معاني المحاسبة على الحقوق لأن تمييز الحقوق من المظالم كلّه محل اختلاف الناس وتنازعهم .وعطف على هذه الحكمة العامّة حكمةٌ فرعيّة خاصّة بالمردود عليهم هنا ، وهي حصول العلم للّذين كفروا بأنهم كانوا كاذبين فيما اخترعوه من الشرك وتحريم الأشياء وإنكار البعث .وفي حصول علمهم بذلك يوم البعث مثارٌ للندامة والتحسّر على ما فرط منهم من إنكاره . وقد تقدّم بيان حكمة الجزاء في يوم البعث في أول سورة يونس .و { كانوا كاذبين } أقوى في الوصف بالكذب من ( كذَبوا أو كاذبون ) ، لما تدلّ عليه ( كان ) من الوجود زيادة على ما يقتضيه اسم الفاعل من الاتّصاف ، فكأنه قيل : وُجد كذبهم ووصفوا به . وكذبهم يستلزم أنهم معذّبون عقوبة على كذبهم . ففيه شتم صريح تعريض بالعقاب .\n\n",
      "translations": [
        {
          "translation": "(That he may explain unto them) to the people of Mecca (that wherein they differ) that which they oppose in the matter of Religion, (and that those who disbelieved) in Muhammad (pbuh) and in the Qur'an and the Day of Judgement (may know that they were liars) in this worldly life when they claimed that there is no Paradise, hell, resurrection or reckoning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأنكروا عليه عناداً ومكبارةً { أَنَّهُمْ كَانُواْ كَاذِبِينَ } [النحل: 39] في إصرار عدم وقوعه وتكذيبه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:3",
      "similarity": 0.6235022129328743
    },
    {
      "verse": "51:8",
      "similarity": 0.581895853341698
    },
    {
      "verse": "22:69",
      "similarity": 0.5464983187757251
    },
    {
      "verse": "69:49",
      "similarity": 0.4647708138903277
    },
    {
      "verse": "16:64",
      "similarity": 0.4610352489139368
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016039.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016039.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}