{
  "chapter": "النحل",
  "text": "وقيل للذين اتقوا۟ ماذا انزل ربكم قالوا۟ خيرا للذين احسنوا۟ فى هذه الدنيا حسنة ولدار الءاخرة خير ولنعم دار المتقين",
  "translations": [
    {
      "translation": "When those who have taqwa of Allah are asked, 'What has your Lord sent down?' their reply is, 'Good!' There is good in this world for those who do good, and the abode of the Next World is even better. How wonderful is the abode of those who have taqwa:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who took heed for themselves would be asked: \"What did your Lord send down?\" They will answer: \"The best.\" For those who do good there is good in the world, but certainly the abode of the next is better. How excellent the home of the virtuous!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the God-fearing are asked: \"What has your Lord revealed?\" they answer: \"Something excellent!\" Good fortune in this world awaits those who do good; and certainly the abode of the Hereafter is even better for them. How excellent is the abode of the God-fearing:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pious ones will be asked, \"What did your Lord reveal to you?\" They will reply, \"He revealed only good.\" The share of the righteous ones is virtue in this world and greater virtue in the life to come. How blessed will be the dwelling of the pious ones!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was said to the pious, “What has your Lord sent down?” They said, “Goodness”; for those who did good in this world is goodness, and the final home is the best; and indeed what an excellent final home for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (when) it is said to those who had Taqwa (piety and righteousness), \"What is it that your Lord has revealed\" They say: \"That which is good.\" For those who do good in this world, there is good, and the home of the Hereafter will be better. And excellent indeed will be the home (i.e. Paradise) of those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is said to those who guard (against evil): What is it that your Lord has revealed? They say, Good. For those who do good in this world is good, and certainly the abode of the hereafter is better; and certainly most excellent is the abode of those who guard (against evil);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it shall be said to the godfearing, 'What has your Lord sent down?' They will say, 'Good! For those who do good in this world good; and surely the abode of the world to come is better; excellent is the abode of the godfearing --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is said unto those who ward off (evil): What hath your Lord revealed? They say: Good. For those who do good in this world there is a good (reward) and the home of the Hereafter will be better. Pleasant indeed will be the home of those who ward off (evil) -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who fear God are asked, \"What has your Lord sent down?\" Their reply is, \"Goodness!\" The reward of those who do good works in this world is good, but the abode of the Hereafter is even better. The home of the righteous is indeed excellent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto those who fear: what is it that your Lord hath sent down? They say: that which is better. For those who do good is good in this world, and the dwelling of the Hereafter is better. Excellent is the dwelling of the God-fearing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who were Godwary will be asked, ‘What is it that your Lord has sent down?’ They will say, ‘Good.’ For those who do good in this world there will be a good [reward], and the abode of the Hereafter is better, and the abode of the Godwary is surely excellent:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the righteous (when) it is said, \"What is it that your Lord has revealed?\" they say, \"All that is good.\" To those who do good, there is good in this world, and the Home of the Hereafter is even better and excellent indeed is the Home of the righteous,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (when) it is said to those who are the Muttaqun (pious - see V. 2:2) \"What is it that your Lord has sent down?\" They say: \"That which is good.\" For those who do good in this world, there is good, and the home of the Hereafter will be better. And excellent indeed will be the home (i.e. Paradise) of the Muttaqun (pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is said to the cautious: 'What has your Lord revealed' They will reply: 'Good' For those who did good in this world is goodness; indeed the lodging in the Everlasting Life is better an excellent dwelling for the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said to those who maintained piety, “What has your Lord revealed?” They will say, “Goodness.” To those who do good in this world is goodness, and the Home of the Hereafter is even better. How wonderful is the residence of the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said to those who feared Allah, \"What did your Lord send down?\" They will say, \"[That which is] good.\" For those who do good in this world is good; and the home of the Hereafter is better. And how excellent is the home of the righteous -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:30] And it is said to those who fear, idolatry, ‘What has your Lord revealed?’ They will say, ‘Good! For those who were virtuous, by [embracing] faith, in this world, there will be a virtuous [reward], namely, a goodly life; and truly the abode of the Hereafter, that is, Paradise, is better, than the world and all that is in it. God says [the following] regarding it: And truly excellent is the abode of the God-fearing, it [the Hereafter] is.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And it is said unto those who ward off (evil)) disbelief, idolatry and indecencies; the reference here is to 'Abdullah Ibn Mas'ud and his fellow believers: (What hath your Lord revealed?) what does Muhammad (pbuh) say to you from your Lord? (They say Good) the profession of Allah's divine Oneness and keeping ties of kinship: (For those who do good) for those who profess monotheism (in this world there is a good (reward)) Paradise on the Day of Judgement (and the home of the Hereafter) i.e. Paradise (will be better) than this worldly life and all there is in it. (Pleasant indeed will be the home of those who ward off (evil)) disbelief, idolatry, and indecencies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقِيلَ لِلَّذِينَ ٱتَّقَوْاْ } عن محارم الله\n وحفظوا نفوسهم عن العرض على المهالك الموجبة لسخط الله وعضبه: { مَاذَا أَنْزَلَ رَبُّكُمْ } على نبيكم لتربية دينكم\n وتصفية مشربكم عن أكدار التقليدات والتخمينات { قَالُواْ } أنزل { خَيْراً } محضاً في النشأة الأولى والأخرى\n أما في الأولى: { لِّلَّذِينَ أَحْسَنُواْ فِي هٰذِهِ ٱلْدُّنْيَا } وعملوا الصالحات المقربة إلى الله { حَسَنَةٌ } كاملة من العلوم والمعارف المثمرة للمكاشفات والمشاهدات { وَ } أما في الآخرة: فا { لَدَارُ ٱلآخِرَةِ } المعدة للفوز بشرف اللقاء\n والوصول إلى سدرة المنتهى { خَيْرٌ } من جميع الكاملات الأقصى\n والدرجات العليا { وَلَنِعْمَ دَارُ ٱلْمُتَّقِينَ } [النحل: 30] المتحفظين نفوسهم عن الالتفات إلى ما سوى الحق\n\n\nدار الآخرة التي هي { جَنَّاتُ عَدْنٍ } مصونة عن أمارات الكثرة المشعرة للاثنينية { يَدْخُلُونَهَا } مجردة عن جلباب التعينات العدمية { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } المنتشئة عن التجليات المترتبة على الأوصاف الذاتية الإلهية { لَهُمْ فِيهَا مَا يَشَآؤونَ } من مقتضيات الأوصاف اللطفية الحبية الجمالية { كَذَلِكَ يَجْزِي ٱللَّهُ ٱلْمُتَّقِينَ } [النحل: 31] المائلين عن غير الله مطلقاً\n الباذلين مهجهم في سبيله طوعاً المنخلعين عن مقتضيات أوصاف بشريتهم إرادةً واختياراً\n الصابرين على ما جرى عليهم من القضاء تسليماً ورضاً\n\nوهم { ٱلَّذِينَ تَتَوَفَّاهُمُ ٱلْمَلاۤئِكَةُ } الموكلون عليهم في نشأتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { خيراً }: منصوب بفعل محذوف، أي: أنزل خيرًا، فهو مطابق للسؤال لأن المؤمنين معترفون بالإنزال، بخلاف قوله: { أساطير الأولين } فهو مرفوع على الخبر لأنهم لا يُقرون بالإنزال، فلا يصح تقدير فعله\n وإنما عدلوا بالجواب عن السؤال لإنكارهم له، وقالوا: هو أساطير الأولين ولم ينزله الله\n و { للذين }: خبر، و { حسنة }: مبتدأ، والجملة: بدل من { خيرًا } ، أو تفسير الخير الذي قالوه، والظاهر أنه استئناف من كلام الحق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:85",
      "similarity": 0.4903262633142888
    },
    {
      "verse": "4:39",
      "similarity": 0.4744247057616729
    },
    {
      "verse": "31:11",
      "similarity": 0.47423440404767564
    },
    {
      "verse": "7:110",
      "similarity": 0.464438114780641
    },
    {
      "verse": "10:101",
      "similarity": 0.42735521388963427
    }
  ]
}