{
  "chapter": "النحل",
  "text": "جنت عدن يدخلونها تجرى من تحتها الانهر لهم فيها ما يشاءون كذلك يجزى الله المتقين",
  "translations": [
    {
      "translation": "Gardens of Eden which they enter, with rivers flowing under them, where they have whatever they desire. That is how Allah repays those who have taqwa:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will enter perennial gardens with streams of water and all they wish. Thus will the pious and devout be rewarded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "everlasting gardens that they shall enter; the gardens beneath which rivers shall flow, and where they shall have whatever they desire! Thus does Allah reward the God-fearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be admitted into the gardens of Eden wherein steams flow and they will have therein whatever they want. This is how God will reward the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everlasting Gardens of Eden which they will enter, beneath which rivers flow – in it they will get whatever they wish; this is how Allah rewards the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`Adn (Eden) Paradise (Gardens of Eternity) which they will enter, under which rivers flow, in it they will have all that they wish. Thus Allah rewards those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The gardens of perpetuity, they shall enter them, rivers flowing beneath them; they shall have in them what they please. Thus does Allah reward those who guard (against evil),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens of Eden they shall enter, underneath which rivers flow, wherein they shall have all they will. So God recompenses the godfearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens of Eden which they enter, underneath which rivers flow, wherein they have what they will. Thus Allah repayeth those who ward off (evil),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will enter Gardens of Eternity, where rivers will flow at their feet. There they will have all that they wish for. Thus God rewards the righteous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens Everlasting which they shall enter, whereunder rivers flow; theirs therein shall be whatsoever they list; Thus Allah recompenseth the God-fearing-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Gardens of Eden, which they will enter, with streams running in them. There they will have whatever they wish, and thus does Allah reward the Godwary\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens of Eternity which they will enter: beneath them flow (pleasant) rivers: they will have therein all that they wish: thus doth Allah reward the righteous,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Adn (Eden) Paradise (Gardens of Eternity) which they will enter, under which rivers flow, they will have therein all that they wish. Thus Allah rewards the Muttaqun (pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall enter the Gardens of Eden, under which rivers flow, and there they shall have all they desire. So Allah recompenses the cautious,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Gardens of Perpetuity, which they will enter, beneath which rivers flow, where they will have whatever they desire. Thus God rewards the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens of perpetual residence, which they will enter, beneath which rivers flow. They will have therein whatever they wish. Thus does Allah reward the righteous -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:31] Gardens of Eden, as a [place of] residence (jannātu ‘Adnin is a subject, the predicate of which is [what follows]) which they will enter, [Gardens] underneath which rivers flow, wherein they shall have whatever they wish. So, [with such] a reward, God rewards the God-fearing,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Gardens of Eden) this is the chamber of the All-Merciful (which they enter) on the Day of Judgement, 285 (underneath which) beneath its trees and dwellings (rivers) of wine, water, honey and milk (flow, wherein) in Paradise (they have what they will) whatever they desire and like. (Thus Allah repayeth those who ward off (evil)) disbelief, idolatry, and indecencies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { جنات عدن }: يحتمل أن يكون هو المخصوص بالمدح، فيكون مبتدأ، وخبره فيما قبله، أو خبر ابتداء مضمر، أو مبتدأ، وخبره: { يدخلونها } ، أو محذوف، أي: لهم جنات عدن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:76",
      "similarity": 0.860087198370162
    },
    {
      "verse": "98:8",
      "similarity": 0.725170007853884
    },
    {
      "verse": "61:12",
      "similarity": 0.6951792558566154
    },
    {
      "verse": "9:72",
      "similarity": 0.6531457931204651
    },
    {
      "verse": "19:61",
      "similarity": 0.6282983949517859
    }
  ]
}