{
  "chapter": "النحل",
  "text": "هل ينظرون الا ان تاتيهم الملئكة او ياتى امر ربك كذلك فعل الذين من قبلهم وما ظلمهم الله ولكن كانوا۟ انفسهم يظلمون",
  "translations": [
    {
      "translation": "What are they waiting for but the angels to come to them or your Lord's command to come? That is like what those before them did. Allah did not wrong them; rather they wronged themselves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Do the (unbelievers) expect that the angels should descend, or the sentence of your Lord come to pass? So had the people done before them; yet God did not wrong them, they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), are they waiting for anything else than that the angels should appear before them, or that your Lord's judgement should come? Many before them acted with similar temerity. And then what happened with them was not Allah's wrong-doing; they rather wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they (the disbelievers) waiting for the angels and the decree of your Lord to be fulfilled before they believe? The people who lived before them had also done the same thing. God did not do injustice to them, but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So what are they waiting for, except that the angels come upon them or that your Lord’s punishment comes? Those before them did exactly this; and Allah did not oppress them at all, but it is they who used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they but waiting for the angels to come to them, or there comes the command of your Lord Thus did those before them. And Allah did not wrong them, but they were wronging themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not wait aught but that the angels should come to them or that the commandment of your Lord should come to pass. Thus did those before them; and Allah was not unjust to them, but they were unjust to themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they look for aught but that the angels shall come to them, or thy Lord's command shall come? So did those before them, and God wronged them not, but themselves they wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Await they aught say that the angels should come unto them or thy Lord's command should come to pass? Even so did those before them. Allah wronged them not, but they did wrong themselves,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for the angels to come to them, or the fulfillment of your Lord's will? Those who went before them did the same. God did not wrong them; rather they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Await they aught but that the angels should come unto them or the command of thy Lord should come Likewise did those before them. Allah wronged them not, but they were wont to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider that the angels may come to them, or your Lord’s edict may come? Those who were before them had acted likewise; Allah did not wrong them, but they used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the (ungodly) wait until the angels come to them, or there comes the Command of thy Lord (for their doom)? So did those who went before them. But Allah wronged them not: nay, they wronged their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they (the disbelievers and polytheists) await but that the angels should come to them [to take away their souls (at death)], or there should come the command (i.e. the torment or the Day of Resurrection) of your Lord? Thus did those before them. And Allah wronged them not, but they used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they looking for the angels to come down or the order of your Lord to come? As such did those who have gone before them. Allah did not wrong them, but they wronged themselves,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they but waiting for the angels to come to them, or for the command of your Lord to arrive? Those before them did likewise. God did not wrong them, but they used to wrong their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the disbelievers await [anything] except that the angels should come to them or there comes the command of your Lord? Thus did those do before them. And Allah wronged them not, but they had been wronging themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:33] Do they, the disbelievers, await anything but that the angels should come to them (read [feminine person] ta’tīhim or [masculine] ya’tīhim) to seize their spirits, or that there should come your Lord’s command?, chastisement, or the resurrection that entails it. So, just as these have done, did those before them, from among the [former] communities: they denied their messengers and were therefore destroyed. And God did not wrong them, destroying them for no sin, but they used to wrong themselves, through disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Await they) what are the people of Mecca waiting for after their disbelief (aught save that the angels should come unto them) to take away their souls (or your Lord's command should come to pass?) or that the chastisement of your Lord should come to destroy them. (Even so) just as your people denied you and vilified you so (did those before them) they denied their prophets and vilified them. (Allah wronged them not) when He destroyed them, (but they did wrong themselves) through their idolatry and denial of the prophets,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه توبيخاً وتقريعاً على المشركين: { هَلْ يَنْظُرُونَ } أي: ما ينتظرون أولئك التائهون في تيه الغفلة والغرور { إِلاَّ أَن تَأْتِيَهُمُ ٱلْمَلائِكَةُ } المأمورون لقبض أرواحهم الخبيثة { أَوْ يَأْتِيَ أَمْرُ رَبِّكَ } يا أكمل الرسل؛ أي: يوم القيامة المعدة لتعذيبهم وانتقامهم { كَذَلِكَ } أي: مثل إمهال هؤلاء الهالكين وإهمالهم في أمر الإيمان { فَعَلَ ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } في زمن الأنبياء الماضين { وَ } بالجملة: { مَا ظَلَمَهُمُ ٱللَّهُ } المجازي لهم على مقتضى إساءتهم { وَلـٰكِن كَانُواْ أَنْفُسَهُمْ يَظْلِمُونَ } [النحل: 33] أي: يظلمون هم أنفسهم بعرضها على المهالك الموجبة أنواع العذاب والعقاب من تذكيب الرسل، وإنكار الكتب، وترك المأمورات، وإرتكاب المنهيات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { هل ينظرون } أي: ما ينظر هؤلاء الكفرة، الذين قالوا فيما أنزل الله من الوحي: هو أساطير الأولين، { إلا أن تأتيهُم الملائكةُ } لقبض أرواحهم، { أو يأتي أمرُ ربك }: قيام الساعة، أو العذاب المستأصِل لهم في الدنيا، { كذلك } أي: مثل ذلك التكذيب والشرك، { فعل الذين من قبلهم } ، فأصابهم ما أصابهم، { وما ظلمهم الله } بإهلاكهم، { ولكن كانوا أنفسهم يظلمون } لكفرهم ومعاصيهم، المؤدية إلى عذابهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:158",
      "similarity": 0.47662108702480555
    },
    {
      "verse": "26:203",
      "similarity": 0.40464207484677456
    },
    {
      "verse": "16:35",
      "similarity": 0.37478121985377105
    },
    {
      "verse": "10:102",
      "similarity": 0.3390172735986762
    },
    {
      "verse": "15:8",
      "similarity": 0.33090133923709586
    }
  ]
}