{
  "chapter": "النحل",
  "text": "ولقد بعثنا فى كل امة رسولا ان اعبدوا۟ الله واجتنبوا۟ الطغوت فمنهم من هدى الله ومنهم من حقت عليه الضللة فسيروا۟ فى الارض فانظروا۟ كيف كان عقبة المكذبين",
  "translations": [
    {
      "translation": "We sent a Messenger among every people saying: 'Worship Allah and keep clear of all false gods.' Among them were some whom Allah guided but others received the misguidance they deserved. Travel about the earth and see the final fate of the deniers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every community We have sent an apostle. (saying:) \"Worship God, and keep away from all other deities.\" Thus some of them were guided by God, and ruin was justified on some. Travel over the earth and see what befell those who accused (the apostles) of lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We raised a Messenger in every community (to tell them): \"Serve Allah and shun the Evil One.\" Thereafter Allah guided some of them while others were overtaken by error. Go about the earth, then, and observe what was the end of those who rejected the Messengers, calling them liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every nation We sent a Messenger who told its people, \"Worship God and stay away from satan.\" Some of them were guided by God and others were doomed to go astray. Travel through the land and see how terrible was the end for those who rejected the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent to every nation a Noble Messenger (proclaiming) that “Worship Allah and beware of the devil”; therefore Allah guided some of them, and error proved true upon some of them; therefore travel in the land and see what sort of fate befell the deniers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have indeed sent a Messenger to every Ummah (community, nation) (saying): \"Worship Allah (Alone), and shun the Taghut (all false deities). \" Then among them were some whom Allah guided, and among them were some who deserved to be left to stray. So travel through the land and see the end of those who denied (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We raised in every nation an apostle saying: Serve Allah and shun the Shaitan. So there were some of them whom Allah guided and there were others against whom error was due; therefore travel in the land, then see what was the end of the rejecters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent forth among every nation a Messenger,; saying: 'Serve you God, and eschew idols.' Then some. of them God guided, and some were justly disposed to error. So journey in the land, and behold how was the end of them that cried lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We have raised in every nation a messenger, (proclaiming): Serve Allah and shun false gods. Then some of them (there were) whom Allah guided, and some of them (there were) upon whom error had just hold. Do but travel in the land and see the nature of the consequence for the deniers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We raised among every people a messenger who enjoined, \"Worship God alone and shun the evil one.\" Then among them were some whom God guided and among them were others who became deserving of ruin. So travel across the earth and observe what was the end of those who rejected the messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have raised in every community an apostle saying: worship Allah and avoid the devil. Then of them were some whom Allah guided, and of them were some upon whom the straying was justified. Wherefore travel about on the earth, and look on what wise hath been the end of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We raised an apostle in every nation [to preach:] ‘Worship Allah, and shun fake deities.’ Among them were some whom Allah guided, and among them were some who deserved to be in error. So travel over the land and observe how was the fate of the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For We assuredly sent amongst every People a messenger, (with the Command), \"Serve Allah, and eschew Evil\": of the People were some whom Allah guided, and some on whom error became inevitably (established). So travel through the earth, and see what was the end of those who denied (the Truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, We have sent among every Ummah (community, nation) a Messenger (proclaiming): \"Worship Allah (Alone), and avoid (or keep away from) Taghut (all false deities, etc.i. e. do not worship Taghut besides Allah).\" Then of them were some whom Allah guided and of them were some upon whom the straying was justified. So travel through the land and see what was the end of those who denied (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent a Messenger to every nation, saying: 'Worship Allah and avoid the idols' Amongst them were some whom Allah guided, and some justly disposed to error. Travel in the land and see what was the end of those who belied (the Revelation and the prophets)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every community We sent a messenger: “Worship God, and avoid idolatry.” Some of them God guided, while others deserved misguidance. So travel through the earth, and see what the fate of the deniers was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly sent into every nation a messenger, [saying], \"Worship Allah and avoid Taghut.\" And among them were those whom Allah guided, and among them were those upon whom error was [deservedly] decreed. So proceed through the earth and observe how was the end of the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:36] And verily We sent forth among every community a messenger, just as We have sent you forth among these [Meccans], [to say]: ‘Worship God, profess [belief in] His Oneness, and shun false deities’, graven images, and do not worship them. Then among them were some whom God guided, and they believed, and among them were some who deserved to be in error, according to God’s knowledge, and so they did not believe. So travel, O disbelievers of Mecca, in the land and observe the nature of the consequence of those who denied, their messengers, in that they were destroyed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We have raised in every nation) We have sent to every people (a messenger) just as We have sent you to your people, ((proclaiming): Serve Allah) believe in Allah's divine Oneness (and shun false gods) and leave the worship of idols; it is also said that this means: leave the worship of Satan; and it is also said that this means: leave the worship of soothsayers. (Then some of them) We sent messengers ((there were) whom Allah guided) to His religion, and so they accepted faith from the messengers, (and some of them (there were) upon whom error had just hold) it was decreed that they would not accept faith from the messengers. (Do but travel in the land and sea) reflect upon (the nature of the consequence for the deniers!) the end result of those who denied the messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱجْتَنِبُواْ ٱلْطَّاغُوتَ } معناه الشَّيطانُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Avoid the Taghut\" - that is, Satan.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ فصل سبحانه ما أجمل بقوله: { وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ } من الأمم الهالكة السالفة حين اختل أمور دينهم { رَّسُولاً } منهم، قائلاً لهم: { أَنِ ٱعْبُدُواْ ٱللَّهَ } المنصف بالوحدانية والفردانية، المستقل بالوجود والآثار المترتبة عليه، المنزه عن الشريك والأمثال { وَٱجْتَنِبُواْ ٱلْطَّاغُوتَ } أي: الآلهة المضلة التي أنتم تتخذونها من تلقاء أنفسكم ظلماً وزوراً، ثمَّ لما بلغهم الرسول جميع ما جاء به من عندنا { فَمِنْهُم مَّنْ هَدَى ٱللَّهُ } بأن أراد هدايته فهداه { وَمِنْهُمْ مَّنْ حَقَّتْ } أي: استمرت وثبتت { عَلَيْهِ ٱلضَّلالَةُ } وتمرنت بقلبه؛ لتعلق مشيئة الله بضلاله، وإن ترددتم فيه { فَسِيرُواْ } أيها الشاكون المترددون { فِي ٱلأَرْضِ } التي هي مساكنهم ومنازلهم { فَٱنظُرُواْ } واعتبروا من آثارهم وأطلالهم { كَيْفَ كَانَ عَاقِبَةُ ٱلْمُكَذِّبِينَ } [النحل: 36] المستهزئين للرسل والكتب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بيَّن أن البعثة أمر جرت به السنة الإلهية في الأمم الماضية، جعلها سببًا لهدى من أراد اهتداءه، وزيادة الضلال لمن أراد إضلاله، كالغذاء الصالح، فإنه ينفع المزاج السوي - أي: المعتدل - ويقويه، ويضر المزاج المنحرف ويعييه، فقال: { ولقد بعثنا في كل أمةٍ رسولاً } قائلاً: { أن اعبدُوا الله واجتنبوا الطاغوت } أي: يأمر بعبادة الله وحده واجتناب ما سواه، { فمنهم من هدى الله } وفقهم للإيمان وأرشدهم إليه، { ومنهم من حقتْ عليه الضلالةُ } فلم يوفقهم، ولم يُرد إرشادهم فليس كل من تمسك بشيء وأمْهل فيه يدل أنه على صواب، كما ظن المشركون، بل النظر إلى ما جاءت به الرسل من الشرائع، وكلها متفقة على وجوب التوحيد وإبطال الشرك\n ثم أمرهم بالنظر والاعتبار بحال من أشرك وكذب الرسل، فقال: { فسيروا في الأرض } يا معشر قريش، { فانظروا كيف كان عاقبة المكذبين } كعاد وثمود وغيرهم، لعلكم تعتبرون\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:11",
      "similarity": 0.5864977448143615
    },
    {
      "verse": "27:69",
      "similarity": 0.5452486610380669
    },
    {
      "verse": "30:42",
      "similarity": 0.5432154587051337
    },
    {
      "verse": "3:137",
      "similarity": 0.4441722210668241
    },
    {
      "verse": "35:44",
      "similarity": 0.42691616484001543
    }
  ]
}