{
  "chapter": "النحل",
  "text": "خلق السموت والارض بالحق تعلى عما يشركون",
  "translations": [
    {
      "translation": "He created the heavens and the earth with truth. He is exalted above anything they associate with Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with reason. Too glorious and high is He for what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with Truth. Exalted is He above whatever they associate with Allah in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth for a genuine purpose. He is too Exalted to be considered equal to anything else.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with the truth; Supreme is He above their ascribing of partners (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth with truth. High is He, Exalted above all that they associate as partners with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with the truth, highly exalted be He above what they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth in truth; high be He exalted above that they associate With Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath created the heavens and the earth with truth. High be He Exalted above all that they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth for a true purpose. He is exalted above anything they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath created the heavens and the earth with a purpose. Exalted is He above that which they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with consummate wisdom. He is above having any partners that they ascribe [to Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth for just ends: Far is He above having the partners they ascribe to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created the heavens and the earth with truth. High be He Exalted above all they associate as partners with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with truth. Exalted is He above what they associate (with Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth with justice. He is exalted above the associations they attribute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and earth in truth. High is He above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:3] He created the heavens and the earth with the Truth, that is, with the purpose of [manifesting] truth. Exalted be He above what they associate, with Him in the way of idols.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He hath created the heavens and the earth with truth) for the Truth; it is also said that this means: for evanescence and extinction. (High be He exalted) He exonerates Himself (above all that they associate (with Him)) of idols.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nثم عدّ الصفات الإضافية كالخلق والرزق، وفصّل النِعَم المتعددة كالنعم وغيرها\n ولما ظهر الحق والخلق ظهر طريق الحق والباطل، فقال: { وعلى الله قصد السبيل } أي: عليه لزوم السبيل المستقيم والهداية إليها لأهله، كما قال:\n",
      "translations": [
        {
          "translation": "\n\nThen there are the additional attributes, such as creation and provision.,\n\nAnd distinguish between the various kinds of blessings, such as those that are material and those that are not.\n\n\nAnd when the truth and the creation became apparent, the path of truth and falsehood became apparent.,\n\nHe said: \"It is incumbent upon Allah to take the straight path,\" that is, it is His responsibility to guide His people to the straight path.,\n\nAs he said:",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف تشركون أيها المشركون ما لا يقدر على خلق أحقر الأشياء وأضعفها للقادر الحكيم الذي { خَلَقَ ٱلسَّمَٰوَٰتِ } مع كمال عظمتها وفعتها { وَٱلأَرْضَ } بكمال بسطتها، وإنماخلق ما خلق، وأظهر ما أظهر ملتبساً { بِٱلْحَقِّ } أي: بانبساط نور الوجود الكائن الثابت في نفسه، وامتداد أظلال أوصافه وأسمائه عليهما، مع أنه على صرافة وحدته، وهما على عدميتهما الأصلية { تَعَالَىٰ } وتقدس { عَمَّا يُشْرِكُونَ } [النحل: 3] له شيئاً لا وجود له، ولا تحقق سوى الظلية والعكسية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:4",
      "similarity": 0.7287394166802171
    },
    {
      "verse": "28:68",
      "similarity": 0.6519889454127202
    },
    {
      "verse": "42:4",
      "similarity": 0.6046152998653561
    },
    {
      "verse": "7:190",
      "similarity": 0.5895349162093823
    },
    {
      "verse": "23:92",
      "similarity": 0.5505459704212684
    }
  ]
}