{
  "chapter": "النحل",
  "text": "ليبين لهم الذى يختلفون فيه وليعلم الذين كفروا۟ انهم كانوا۟ كذبين",
  "translations": [
    {
      "translation": "It is so that He can make clear to them the things they differed about and so that those who were kafir will know that they were liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For (they fear) He might make what they differed about plain to them, and that the infidels may realise that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(That is bound to happen in order that) He may make clear to them the reality regarding the matters on which they differ and that the unbelievers may realize that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Through the resurrection) God wants to make a clear distinction between right and wrong and make the unbelievers know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may make clear to them the matter in which they differed, and the disbelievers may realise that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may make clear to them what they differed over, and so that those who disbelieved may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that He might make manifest to them that about which they differ, and that those who disbelieve might know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may make clear to them that whereon they were at variance, and that the unbelievers may know that they were truly liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may explain unto them that wherein they differ, and that those who disbelieved may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "this is so that He may make clear to them what they have differed about and so that those who are bent on denying the truth may realize that they were lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This will be in order that he may manifest unto them that wherein they differ, and that those who disbelieved should come to know that they had been liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may clarify for them what they differ about, and that the faithless may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They must be raised up), in order that He may manifest to them the truth of that wherein they differ, and that the rejecters of Truth may realise that they had indeed (surrendered to) Falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may make manifest to them the truth of that wherein they differ, and that those who disbelieved (in Resurrection, and in the Oneness of Allah) may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is in order that He may make clear to them that which they differed upon, and in order that those who disbelieve might know that they were indeed lying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To clarify for them what they differed about, and for the faithless to know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It is] so He will make clear to them [the truth of] that wherein they differ and so those who have disbelieved may know that they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:39] That He may make clear to them (li-yubayyina is semantically connected to an implied yab‘athuhum, ‘He will resurrect them’) what they differ, with believers, in, of matters of religion, by punishing them and rewarding the believers, and that the disbelievers may know that they were liars, when they denied the Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That he may explain unto them) to the people of Mecca (that wherein they differ) that which they oppose in the matter of Religion, (and that those who disbelieved) in Muhammad (pbuh) and in the Qur'an and the Day of Judgement (may know that they were liars) in this worldly life when they claimed that there is no Paradise, hell, resurrection or reckoning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما ينجز الوعد الموعود { لِيُبَيِّنَ } ويوضح { لَهُمُ ٱلَّذِي يَخْتَلِفُونَ فِيهِ } بل يستعبدونه ويستحيلونه { وَلِيَعْلَمَ ٱلَّذِينَ كَفَرُواْ } له، وأنكروا عليه عناداً ومكبارةً { أَنَّهُمْ كَانُواْ كَاذِبِينَ } [النحل: 39] في إصرار عدم وقوعه وتكذيبه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بيَّن حكمة البعث، فقال: { ليُبيِّن لهم } أي: يبعثهم ليبين لهم { الذي يختلفون فيه } وهو الحق من الباطل فإن الناس مختلفون في أديانهم ومذاهبهم فيبعثهم الله ليُبين لهم الحق فيما اختلفوا فيه، فيظهر من كان على الحق ممن كان على الباطل، { ولِيَعْلَم الذين كفروا أنهم كانوا كاذبين } فيما كانوا يزعمون من عدم البعث، وتمسكهم بالحق، وهو إشارة إلى السبب الداعي إلى البعث، المقتضي له من حيث الحكمة، وهو التمييز بين الحق والباطل، والمحق والمبطل\n ثم بيَّن كمال قدرته الموجبة للبعث وغيره فقال: { إنما قولُنا لشيء إذا أردناه أن نقولَ له كن فيكون } ، فأمره بين الكاف والنون، فإذا كان إيجاد الأشياء من العدم بلفظ \" كن \" ، فأولى إعادتها\n وكون أمره بين الكاف والنون كناية عن السرعة، وإلاَّ فلا يحتاج إلى لفظ \" كن \" ، بل مهما أراد شيئًا، أظهره أقرب من لحظ العيون، وإنما جاءت العبارة على قدر ما تفهم العقول، وعلى هذا فلا يحتاج إلى ما تَعَسَّفَهُ ابن عطية وغيره من كون القول في الأزل، وإظهاره فيما لا يزال - يعني: في وقت إظهاره - فإن الكلام إنما خرج مخرج الاستعارة أو المجاز، فلا يتوقف إيجاد الأشياء على \" كن \"\n والله تعالى أعلم\n الإشارة: ترى بعضَ الجهال يقسمون بالله جهد أيمانهم: أن الله لا يفتح على فلان، لِمَا يرون فيه من الجهل والغباوة، أو من الطغيان والمعاصي، فلا يبعث الله روحه بإحيائها بعد موتها، وتلفها في عالم الحس، مع أن القدرة صالحة قال في الحكم: \" من استغرب أن ينقذه الله من شهوته، وأن يخرجه من وجود غفلته، فقد استعجز القدرة الإلهية، وكان الله على كل شيء مقتدرًا \"\n\n\nفإن سبقت له العناية يَقُلِ الحقُّ تعالى في شأنه: بلى، يبعثه، ويحيي روحه بالمعرفة واليقين، وعدًا عليه حقًا، ولكن أكثر الناس لا يعلمون أن قدرته عامة\n فكم من جاهل غبي يخرج منه عالِمَ ولي، وكم من خصوص خرجوا من اللصوص، والله يختص برحمته من يشاء\n يبعثهم ليُبين لهم الذي يختلفون فيه من نفوذ قدرته تعالى وعموم تعلقها، وليعلم الذين كفروا بطريق الخصوص أنهم كانوا كاذبين فيما زعموا { إنما قولنا لشيء إذا أردناه أن نقول له كن فيكون }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:3",
      "similarity": 0.6235022129328743
    },
    {
      "verse": "51:8",
      "similarity": 0.581895853341698
    },
    {
      "verse": "22:69",
      "similarity": 0.5464983187757251
    },
    {
      "verse": "69:49",
      "similarity": 0.4647708138903277
    },
    {
      "verse": "16:64",
      "similarity": 0.4610352489139368
    }
  ]
}