{
  "chapter": "النحل",
  "text": "ولله يسجد ما فى السموت وما فى الارض من دابة والملئكة وهم لا يستكبرون",
  "translations": [
    {
      "translation": "Everything in the heavens and every creature on the earth prostrates to Allah, as do the angels. They are not puffed up with pride.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All things that move on the earth and in the heavens, and the angels, bow in homage to God, and do not behave with pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All living creatures and all angels in the heavens and on the earth are in prostration before Allah; and never do they behave in arrogant defiance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and the earth, the cattle and the angels prostrate themselves before God without pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah only prostrates whatsoever is in the heavens and whatsoever moves in the earth, and the angels – and they are not proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah prostrate all that are in the heavens and all that are in the earth, the moving creatures and the angels, and they are not proud [i.e. they worship their Lord (Allah) with humility].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever creature that is in the heavens and that is in the earth makes obeisance to Allah (only), and the angels (too) and they do not show pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God bows everything in the heavens, and every creature crawling on the earth, and the angels. They have not waxed proud;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Allah maketh prostration whatsoever is in the heavens and whatsoever is in the earth of living creatures, and the angels (also) and they are not proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything in the heavens and all the creatures on the earth prostrate themselves before God, as do the angels, and they do not behave proudly:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Allah prostrateth itself whatsoever is in the heavens and whatsoever is in the earth of the living creatures and also the angels; and they are not stiff-necked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah prostrates whatever is in the heavens and whatever is on the earth, including animals and angels, and they are not arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah doth obeisance all that is in the heavens and on earth, whether moving (living) creatures or the angels: for none are arrogant (before their Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah prostate all that is in the heavens and all that is in the earth, of the live moving creatures and the angels, and they are not proud [i.e. they worship their Lord (Allah) with humility].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything in the heavens and every crawling creature on earth, and the angels prostrate to Allah and they are not proud;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God bows down everything in the heavens and everything on earth—every living creature, and the angels, and without being proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah prostrates whatever is in the heavens and whatever is on the earth of creatures, and the angels [as well], and they are not arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:49] And to God prostrates whatever is in the heavens and whatever is on the earth of living creatures, that is, [of] every single thing that moves thereupon; in other words, to Him it [everything] is subservient in terms of what is required of it — most of what is given [by way of example] is non-rational, since these are [the more] numerous — and the angels [also prostrate] — these are singled out for mention because of their merit — and they are not arrogant, they do [not] disdain to worship Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلما ذُكر في الآية السابقة السجود القسري ذُكر بعده هنا سجود آخر بعضه اختيار وفي بعضه شبه اختيار .وتقديم المجرور على فعله مؤذن بالحصْر ، أي سجد لله لا لغيره ما في السماوات وما في الأرض ، وهو تعريض بالمشركين إذ يسجدون للأصنام .وأوثرت { ما } الموصولة دون ( من ) تغليباً لكثرة غير العقلاء .و { من دابة } بيان ل { ما في الأرض } ، إذ الدابة ما يدبّ على الأرض غير الإنسان .ومعنى سجود الدواب لله أن الله جعل في تفكيرها الإلهامي التذاذها بوجودها وبما هي فيه من المرح والأكل والشرب ، وتطلب الدفع عن نفسها من المتغلّب ومن العوارض بالمدافعة أو بالتوقّي ، ونحو ذلك من الملائمات . فحالها بذلك كحال شاكر تتيسر تلك الملائمات لها ، وإنما تيسيرها لها ممن فطرها . وقد تصحب أحوال تنعّمها حركاتٌ تشبه إيماء الشاكر المقارب للسجود ، ولعلّ من حركاتها ما لا يشعر به الناس لخفائه وجهلهم بأوقاته ، وإطلاقُ السجود على هذا مجاز .ويشمل { ما في السموات } مخلوقاتتٍ غير الملائكة ، مثل الأرواح ، أو يراد بالسماوات الأجواء فيراد بما فيها الطيُور والفراش .وفي ذكر أشرف المخلوقات وأقلّها تعريض بذمّ من نزل من البشر عن مرتبة الدواب في كفران الخالق ، وبمدح من شابَه من البشر حال الملائكة .وفي جعل الدوابّ والملائكة معمولين ل { يسجد } استعمال للفظ في حقيقته ومجازه .ووصف الملائكة بأنهم { لا يستكبرون } تعريض ببعد المشركين عن أوج تلك المرتبة الملكية . والجملة حال من { الملائكة }.\n\n",
      "translations": [
        {
          "translation": "(And unto Allah maketh prostration whatsoever is in the heavens) of the sun, moon and stars (and whatsoever is in the earth of living creatures) of beasts and birds, (and the angels (also)) do prostrate in heaven, (and they are not proud) to prostrate to Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ورش رشحات زلال وجوده عليها { وَ } خصوصاً { ٱلْمَلاۤئِكَةُ } المهيمون المستغرقون في مطالعة جمال الله وجلاله { وَهُمْ } من غاية قربهم\n وتنزههم عن العلائق المبعدة عن الله\n وتجردهم عن أوصاف الإمكان مطلقاً { لاَ يَسْتَكْبِرُونَ } [النحل: 49] عن عبادة الله\n والتذلل نحوه\n فكي أنتم أيها الهلكي الغرقى\n المنغمسون في بحر الغفلة والضلال\n\n\nوإنما يسجد أولئك الساجدون المتذللون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { من دابة }: بيان لهما لأن الدبيب هو الحركة الجسمانية\n سواء كان في أرض أو سماء\n { والملائكةُ } عطف على المبين به\n عطف خاص على عام\n أو عطف المجردات على الجسمانيات\n وبه احتج من قال: إن الملائكة أرواح مجردة\n قاله البيضاوي\n قلت: وهو خلاف الجمهور\n بل الملائكة: أجسام لطيفة نورانية متحيزة\n لها مادة نورانية وتشكيل مخصوص\n غير أن الله تعالى أعطاها قوة التشكيل لأنها قريبة من أسرار المعاني الأزلية\n وعبَّر الحق تعالى بـ \" ما \" ليشمل العقلاء وغيرهم\n ثم قال تعالى في وصف الملائكة: { وهم لا يستكبرون } عن عبادته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:55",
      "similarity": 0.6023115520249017
    },
    {
      "verse": "27:82",
      "similarity": 0.45740175230059205
    },
    {
      "verse": "16:61",
      "similarity": 0.43855672112113925
    },
    {
      "verse": "35:45",
      "similarity": 0.43458424081555924
    },
    {
      "verse": "42:29",
      "similarity": 0.43198331723081246
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016049.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016049.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}