{
  "chapter": "النحل",
  "text": "او ياخذهم على تخوف فان ربكم لرءوف رحيم",
  "translations": [
    {
      "translation": "Or that He will not seize them little by little? For your Lord is All-Compassionate, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He may seize them by diminishing their portion. Yet your Lord is compassionate and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or that He will not seize them when they are apprehensive of the impending calamity? Surely your Lord is Most Compassionate, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they confident that God will not slowly destroy them? Your Lord is Compassionate and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He may seize them whilst constantly ruining them? For indeed your Lord is Most Compassionate, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He may punish them where they fear it most Indeed, Your Lord is full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He may not seize them by causing them to suffer gradual loss, for your Lord is most surely Compassionate, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He will not seize them, little by little destroying them? Surely thy Lord is All-clement, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He will not seize them with a gradual wasting? Lo! thy Lord is indeed Full of Pity, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He will not punish them by giving them a fright? Indeed, your Lord is kind and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, that he will not take hold of them by giving them a fright? verily thy Lord is Kind, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He will not visit them with attrition? Indeed your Lord is most kind and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He may not call them to account by a process of slow wastage - for thy Lord is indeed full of kindness and mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He may catch them with gradual wasting (of their wealth and health). Truly! Your Lord is indeed full of Kindness, Most Merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, that He will not seize them, a little at a time and destroy them? Indeed, your Lord is Clement, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He will not seize them while in dread? Your Lord is Gentle and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that He would not seize them gradually [in a state of dread]? But indeed, your Lord is Kind and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:47] Or that He will not seize them amid [growing] fear?, [amid] a gradual diminishing [of their numbers] little by little, until all are destroyed (‘alā takhawwufin is a circumstantial qualifier referring to the subject of the verb [God] or the object). Indeed then your Lord is Gentle, Merciful, insofar as He does not hasten for them their punishment.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or that He will not seize them with a gradual wasting) of their leaders and companions? (Lo! thy Lord is 287 indeed Full of Pity, Merciful!) towards him who repents; it is also said that this means: He is full of pity in that He defers His punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ يَأْخُذَهُمْ عَلَىٰ تَخَوُّفٍ } معناهُ عَلَى تَنقّصٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوْ يَأْخُذَهُمْ } العذاب { عَلَىٰ تَخَوُّفٍ } وتنقص من أموالهم وأولادهم على سبيل التدريج إلى أن يستأصلهم بالمرة { فَإِنَّ رَبَّكُمْ } أيها المجترئون على الله ورسوله، المسيئون الأدب معهما { لَرَؤُوفٌ } عطوف مشفق، لا يعاجلكم بالعذاب { رَّحِيمٌ } [النحل: 47] يمهلكم ويؤخر انتقامكم رجاء أن تتذكروا وتتعظوا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:20",
      "similarity": 0.7766747910096582
    },
    {
      "verse": "57:9",
      "similarity": 0.7624142502005993
    },
    {
      "verse": "2:207",
      "similarity": 0.5892940252323581
    },
    {
      "verse": "59:10",
      "similarity": 0.4977631442976621
    },
    {
      "verse": "16:7",
      "similarity": 0.45645642635988753
    }
  ]
}