{
  "chapter": "النحل",
  "text": "افامن الذين مكروا۟ السيـات ان يخسف الله بهم الارض او ياتيهم العذاب من حيث لا يشعرون",
  "translations": [
    {
      "translation": "Do those who plot evil actions feel secure that Allah will not cause the earth to swallow them up or that a punishment will not come upon them from where they least expect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have the plotters of mischief become unafraid that God will not split the earth to swallow them, or that punishment will not fall upon them from somewhere they do not (even) suspect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who have been devising evil plans (against the mission of the Messenger) feel secure that Allah will not cause the earth to swallow them up or that chastisement will not come upon them from a direction that they will not even be able to imagine;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can they who have devised evil plans expect to be safe from the command of God to the earth to swallow them up, or from a torment which might strike them from an unexpected direction?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do they who conspire evils, not fear that Allah may bury them in the earth, or that the punishment may come to them from a place they do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do then those who devise evil plots feel secure that Allah will not cause them to sink into the earth, or that torment will not seize them from where they do not perceive it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then who plan evil (deeds) feel secure (of this) that Allah will not cause the earth to swallow them or that punishment may not overtake them from whence they do not perceive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they feel secure, those who devise evil things, that God will not cause the earth to swallow them, or that the chastisement will not come upon them, from whence they are not aware?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they who plan ill-deeds then secure that Allah will not cause the earth to swallow them, or that the doom will not come on them whence they know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who devise evil plans feel secure that God will not make them sink into the land, or that a punishment will not come upon them from where they least expect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Feel then they secure who have plctted vices that Allah will not sink them into the earth or that the torment may come upon them whence they perceive not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who devise evil schemes feel secure that Allah will not make the earth swallow them, or the punishment will not overtake them whence they are not aware?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do then those who devise evil (plots) feel secure that Allah will not cause the earth to swallow them up, or that the Wrath will not seize them from directions they little perceive?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do then those who devise evil plots feel secure that Allah will not sink them into the earth, or that the torment will not seize them from directions they perceive not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who do evil feel secure that Allah will not make the earth to swallow them, or that the punishment will not fall upon them from where they do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who scheme evils feel secure that God will not cause the earth to cave in with them, or that the punishment will not come upon them from where they do not perceive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, do those who have planned evil deeds feel secure that Allah will not cause the earth to swallow them or that the punishment will not come upon them from where they do not perceive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:45] Do they feel secure, those who have schemed evil, schemes against the Prophet (s) at the Council Assembly, [schemes] such as detaining him, killing him or banishing him, as mentioned in [sūrat] al-Anfāl [Q. 8:30], that God will not cause the earth to swallow them, as [God did] with Qārūn [Q. 28:81], or that the chastisement will not come upon them whence they are not aware of?, that is, in a way which would not occur to them. Indeed, they were destroyed at Badr even though they had never anticipated it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Are they who plan ill deeds) associating partners with Allah (then secure that Allah will not cause the earth to swallow them, or that the doom will not come on them whence they know not) it will come?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه تهديداً على أهل الزيغ الضلال، المنحرفين عن طريق الحق عتواً وعناداً: { أَفَأَمِنَ ٱلَّذِينَ مَكَرُواْ ٱلسَّيِّئَاتِ } واحتلوا لهلاك الأنبياء، سيما معك يا أكمل الرسل، ولم يخافوا { أَن يَخْسِفَ ٱللَّهُ } القادر الغالب على الانتقام { بِهِمُ ٱلأَرْضَ } كما خسفنا على قارون { أَوْ يَأْتِيَهُمُ ٱلْعَذَابُ } بغتةً، حال كونهم بائتين في مراقدهم { مِنْ حَيْثُ } هم { لاَ يَشْعُرُونَ } [النحل: 45] أماراتها ومقدماتها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مكروا السيئات }: صفة لمحذوف، أي: المكرات السيئات، والتخوّف، قيل: معناه: التنقص، وهو أن تنقصهم شيئًا فشيئًا\n رُوي أن أمير المؤمنين عمر بن الخطاب صلى الله عليه وسلم توقف في معناها، فقال على المنبر: ما تقولون فيها؟ فسكتوا، فقام شيخ من هذيل، فقال: هذه لغتنا، التخوف: التنقص\n فقال: هل تعرف العرب ذلك في أشعارها؟ فقال: نعم\n قال شاعرنا أبو كثير يصف ناقته:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:8",
      "similarity": 0.5979010485570705
    },
    {
      "verse": "28:81",
      "similarity": 0.48773499550241717
    },
    {
      "verse": "27:50",
      "similarity": 0.4268501101585873
    },
    {
      "verse": "39:25",
      "similarity": 0.40767864345962274
    },
    {
      "verse": "17:68",
      "similarity": 0.3951680724617337
    }
  ]
}