{
  "chapter": "النحل",
  "text": "اولم يروا۟ الى ما خلق الله من شىء يتفيؤا۟ ظلله عن اليمين والشمائل سجدا لله وهم دخرون",
  "translations": [
    {
      "translation": "Do they not see the things Allah has created, casting their shadows to the right and to the left, prostrating themselves before Allah in complete humility?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see the shadows of all things God has created incline to the right and the left, bowing in obeisance to God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the people not see how the objects Allah has created cast their shadows right and left, prostrating themselves in utter submission to Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can they not see that the shadows of whatever God has created turn to the right and to the left in prostration and submission to Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And have they not observed that the shadows of the things Allah has created incline to the right and to the left, in prostration to Allah, and that they are servile?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not observed things that Allah has created: (how) their shadows shift from right to left, prostrating to Allah while they are humble\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider every thing that Allah has created? Its (very) shadows return from right and left, making obeisance to Allah while they are in utter abasement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded all things that God has created casting their shadows to the right and to the left, bowing themselves before God in all lowliness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not observed all things that Allah hath created, how their shadows incline to the right and to the left, making prostration unto Allah, and they are lowly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not observed the things God has created, casting their shadows right and left, prostrating themselves before God in all humility?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not observed the things which Allah hath created? shadows thereof turn themselves on the right and on the left. prostrating themselves unto Allah, and they are lowly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded that whatever thing Allah has created casts its shadow to the right and to the left, prostrating to Allah in utter humility?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not look at Allah's creation, (even) among (inanimate) things,- How their (very) shadows turn round, from the right and the left, prostrating themselves to Allah, and that in the humblest manner?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not observed things that Allah has created, (how) their shadows incline to the right and to the left, making prostration unto Allah, and they are lowly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how every thing Allah created casts its shadow right and left, prostrating itself before Allah in all humility?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not observed what God has created? Their shadows revolve from the right and the left, bowing to God as they shrink away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered what things Allah has created? Their shadows incline to the right and to the left, prostrating to Allah, while they are humble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:48] Or have they not observed the things which God has created, which cast a shadow, such as trees or a mountain, how their shadows incline to the right and to the left (shamā’il is the plural of shimāl), in other words, towards both sides, at the beginning of the day and at its end, prostrating to God (sujjadan is a circumstantial qualifier), that is to say, subservient to Him with respect to what is required of them, and [how] they, the shadows, are subject?, humbled: they [the shadows] are likened to rational beings [in this description].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they) the people of Mecca (not observed all things that Allah hath created) of trees and beasts, (how their shadows incline to the right) in the morning (and to the left) in the afternoon, (making prostration unto Allah) and their shadows also making prostration to Allah in the morning and in the afternoon, (and they are lowly?) and they are obedient.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُمْ دَاخِرُونَ } معناه صَاغِرونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أو لم يروا إلى ما خلق الله من شيء } أي: ذات وحقيقة مخلوقة، أية ذات كانت من المخلوقات { يتفيأ ظلاله } أي: يتجسد ويتمثل هياكله وصوره، فإن لكل شيء حقيقة هي ملكوت ذلك الشيء وأصله الذي هو به، هو كما قال تعالى:\n\n[يس، الآية: 83]\n وظلاله هو: صفته ومظهره، أي: جسده الذي به يظهر ذلك الشيء\n { عن اليمين و } عن { الشمائل } أي: عن جهة الخير والشرّ { سُجّدَاً لله } منقادة بأمره، مطواعة لا تمتنع عما يريد فيها، أي: يتحرك هياكله إلى جهات الأفعال الخيرية والشرّية بأمره { وهم داخرون } صاغرون، متذللون لأمره، مقهورون",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } يصرون ويستمرون أولئك المشركون المسرفون على الشرك والنفاق { وَلَمْ يَرَوْاْ } وينظروا نظر العبرة والاستصبار { إِلَىٰ } انقياد جميع { مَا خَلَقَ ٱللَّهُ } وأوجده وأظهره من كتم العدم إظهاراً إبداعياً لحكمه وأمره { مِن شَيْءٍ } من الأشياء التي { يَتَفَيَّؤُاْ } أي: يميل وينقلب { ظِلاَلُهُ } بانقلاب الشمس وحركتها { عَنِ ٱلْيَمِينِ } مرة { وَٱلْشَّمَآئِلِ } أخرى، على مقتضى اختلاف أوضاع الشمس، حال كونهم { سُجَّداً } ساجدين متذللين خاضعين، واضعين جباهم على تراب المذلة إطاعةً وانقياداً { لِلَّهِ } الواحد الأحد، المستقل في الألوهية والربوبية { وَهُمْ } في جميع حالاتهم وتقلباتهم { دَاخِرُونَ } [النحل: 48] ضاغرون ذليلون، خائفون من جلال الله وكبريائه، مستوحشون على سطوة قهره، وصولة استيلائه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الاستفهام للإنكار، و { من شيء }: بيان لـ \" ما \"\n والضمير في { ظلاله } يعود على { ما } ، أو على { شيء }\n و { سُجَّدًا }: حال من الظلال، وكذا جملة: { وهم داخرون } ، وجمعه بالواو لأنه من صفة العقلاء\n وقال الزمخشري: هما حالان من الضمير في { ظلاله } إذ هو بمعنى الجمع لأنه يعود على قوله: { من شيء } ، فعلى الأول يكون السجود من صفة الظلال، وعلى الثاني يكون من صفة الأجرام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:18",
      "similarity": 0.5900865083937602
    },
    {
      "verse": "40:60",
      "similarity": 0.5518505331972091
    },
    {
      "verse": "27:87",
      "similarity": 0.44518992846944894
    },
    {
      "verse": "49:9",
      "similarity": 0.3583302969963459
    },
    {
      "verse": "2:226",
      "similarity": 0.33485023764273536
    }
  ]
}