{
  "chapter": "النحل",
  "text": "بالبينت والزبر وانزلنا اليك الذكر لتبين للناس ما نزل اليهم ولعلهم يتفكرون",
  "translations": [
    {
      "translation": "And We have sent down the Reminder to you so that you can make clear to mankind what has been sent down to them so that hopefully they will reflect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had Sent them with miracles and Books; and We have sent to you this Reminder so that you may explain distinctly to men what was sent down to them: They may haply reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We raised the Messengers earlier with Clear Signs and Divine Books, and We have now sent down this Reminder upon you that you may elucidate to people the teaching that has been sent down for them, and that the people may themselves reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed the Quran to you so that you could tell the people what has been revealed to them and so that perhaps they will think.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Along with clear proofs and writings; and We have sent down this Remembrance towards you (O dear Prophet Mohammed – peace and blessings be upon him) so that you may explain to mankind what has been revealed towards them, and that they may ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With clear signs and Books (We sent the Messengers). And We have also revealed the Dhikr to you so that you may clearly explain to men what was revealed to them, and that perhaps they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With clear arguments and scriptures; and We have revealed to you the Reminder that you may make clear to men what has been revealed to them, and that haply they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "with the clear signs, and the Psalms; and We have sent down to thee the Remembrance that thou mayest make clear to mankind what was sent down to them; and so haply they will reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With clear proofs and writings; and We have revealed unto thee the Remembrance that thou mayst explain to mankind that which hath been revealed for them, and that haply they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We sent them] with clear signs and scriptures. We have sent down the Reminder to you, to enable you to make clear to mankind what has been sent down to them, so that they may reflect upon it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With evidences and scriptures We sent them. And We have sent down unto thee the Admonition that thou mayest expound unto mankind that which hath been revealed toward them, and that haply they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We sent them] with manifest proofs and scriptures. We have sent down the reminder to you so that you may clarify for the people that which has been sent down to them, so that they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We sent them) with Clear Signs and Books of dark prophecies; and We have sent down unto thee (also) the Message; that thou mayest explain clearly to men what is sent for them, and that they may give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With clear signs and Books (We sent the Messengers). And We have also sent down unto you (O Muhammad SAW) the reminder and the advice (the Quran), that you may explain clearly to men what is sent down to them, and that they may give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We sent them) with clear signs and the Psalms. And We sent down to you the Remembrance so that you can make clear to people what has been sent down to them, in order that they reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With the clarifications and the scriptures. And We revealed to you the Reminder, that you may clarify to the people what was revealed to them, and that they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We sent them] with clear proofs and written ordinances. And We revealed to you the message that you may make clear to the people what was sent down to them and that they might give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:44] [We sent them] with clear signs (bi’l-bayyināt is semantically connected to an omitted [verb]), namely, We sent them with clear arguments, and the Books and We have revealed to you the Remembrance, the Qur’ān, that you may make clear to mankind what has been revealed to them, therein, in the way of [what is] lawful   and unlawful, and that perhaps they might reflect, upon this and take heed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(With clear proofs) with commands, prohibitions and signs (and writings) the events of the scriptures of the people of old; (and We have revealed unto thee the Remembrance) We have sent Gabriel with the Qur'an (that thou mayst explain to mankind that which hath been revealed for them) that with which they were commanded in the Qur'an, (and that haply they may reflect) upon what they were commanded in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِٱلْبَيِّنَاتِ وَٱلزُّبُرِ } فالزُّبرُ: الكُتبُ\n واحدُها زَبورٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {with the clear proofs and the scriptures} - so the scriptures are the books.\n\n\nOne of them is a psalm.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكما أيدنا الرسل والأنبياء الماضين { بِٱلْبَيِّنَاتِ } الواضحة { وَٱلزُّبُرِ } اللائحة ترويجاً لما جاءوا به\n وأرسلوا معه\n ليبينوا ويوضحوا بها أحكام أديانهم { وَ } كذلك أيضاً { أَنْزَلْنَا إِلَيْكَ } يا أكمل الرسل { ٱلذِّكْرَ } أي: الكتاب المعجز المشتمل على شعائر الإسلام وأحكامه { لِتُبَيِّنَ لِلنَّاسِ } المتوغلين في الغفلة والنسيان { مَا نُزِّلَ إِلَيْهِمْ } من عند ربهم على مقتضى إزمانهم وأطوارهم من الأوامر والنواهي\n والآداب والأخلاق { وَلَعَلَّهُمْ } بعد تبليغك إياهم\n وتبيينك لهم { يَتَفَكَّرُونَ } [النحل: 44] في آياته وأحكامه\n ويتأملون في حكمه ومرموزاته\n كي يتفطنوا إلى معارفه وحقائقه\n وكشوفاته وشهوداته الموعودة فيه\n\nثمَّ قال سبحانه تهديداً على أهل الزيغ الضلال\n المنحرفين عن طريق الحق عتواً وعناداً: { أَفَأَمِنَ ٱلَّذِينَ مَكَرُواْ ٱلسَّيِّئَاتِ } واحتلوا لهلاك الأنبياء\n سيما معك يا أكمل الرسل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { بالبينات }: يتعلق بأرسلنا الذي في أول الآية\n على التقديم والتأخير\n أي: وما أرسلنا إلا رجالاً بالبينات\n فاسألوا أهل الذكر\n أو بأرسلنا مضمرًا\n وكأنه جواب سائل قال: بم أُرسلوا به؟ فقال: بالبينات\n أو: صفة لرجال\n أي: رجالاً ملتبسين بالبينات\n أو: بيوحى\n انظر البيضاوي\n يقول الحقّ جلّ جلاله: في الرد على قريش\n حيث قالوا: الله أعظم من أن يكون رسوله بشرًا: وما أرسلنا من قَبْلِكَ يا محمد { إلا رجالاً } بشرًا\n { يوحى إليهم } كما يُوحى إليك\n فليس ببدع أن يكون الرسول بشرًا\n بل جرت السنة الإلهية بأن لا يبعث للدعوة العامة إلا بشرًا يوحى إليه على ألسنة الملائكة إذ لا يطيق كل البشر رؤية الملائكة ولا التلقي منهم\n فإن شككتم { فاسألوا أهل الذكر }: أهل الكتاب\n أو علماءهم الأحبار\n أي: الذين لم يسلموا\n لأنهم لا يتهمون في شهادتهم\n من حيث إنهم مدافعون في صدر ملة محمد صلى الله عليه وسلم\n وأنتم إلى تصديق من لم يؤمن من أهل الكتاب أقرب من تصديقكم المؤمنين منهم\n فاسألوهم ليخبروكم: هل كانت الرسل ملائكة أو بشرًا\n { إن كنتم لا تعلمون } ذلك\n قال البيضاوي: وفي الآية دليل على أنه تعالى لم يرسل امرأة ولا ملكًا للدعوة العامة\n وأما قوله:\n[فَاطِر: 1] فمعناه: رسلاً إلى الأنبياء\n وقيل: لم يُبعثوا إلى الأنبياء إلا متمثلين بصورة الرجال\n ورُدَّ بما رُوي أنه عليه صلى الله عليه وسلم رأى جبريل عليه السلام على صورته التي هو عليها مرتين\n وعلى وجوب المراجعة إلى العلماء فيما لا يعلم\n هـ\n ومفهوم قوله: \" الدعوة العامة \" أن الدعوة الخاصة كالأنبياء - عليهم السلام-\n فإن الله يبعث إليهم الملك ليعلمهم أمر دينهم\n ثم قال تعالى: { بالبينات والزُّبر } أي: أرسلناهم بالمعجزات والكتب\n { وأنزلنا إليك الذكر } أي: القرآن لأنه تذكير ووعظ\n { لتُبيِّن للناس ما نُزِّل إليهم } من الأحكام\n مما أمروا به ونهوا عنه\n ومما تشابه عليهم منه\n والتبيين أعم من أن ينص على المقصود\n أو يرشد إلى ما يدل عليه\n كالقياس ودليل العقل\n قاله البيضاوي\n قال ابن جزي: يحتمل أن يريد: لتبين القرآن بسردك نَصَّهُ وتعليمِهِ\n أو لتُبين معانيه بتفسير مُشكله\n فيدخل في هذا ما سنته السنة من الشريعة\n هـ\n { ولعلهم يتفكرون } في عجائبه وأسراره\n فيخوضون بسفن أفكارهم في تيار بحر معانيه وأنواره\n فينتبهون للحقائق والشرائع\n الإشارة: كما لم يبعث الله في الدعوة العامة - وهي دعوة الرسالة - إلا رجالاً من البشر\n كذلك لم يبعث الله في الدعوة الخاصة - وهي دعوة الولاية إلى سر الخصوصية - إلا رجالاً من البشر أحياء\n يُربون التربية النبوية العرفية\n فلا يصلح للتربية النساء لقلة عقلهن\n ولا الجن لانحرافه عن الاعتدال الذي في البشر\n ولا الميت لعدم وجود بشريته فإنَّ بشرية الحي تمد البشرية\n والروحانية تمد الروحانية\n\nفلا تتهذب البشرية إلا بشهود بشرية الشيخ\n ولا تصفى الروحانية إلا بالقرب من روحانية الشيخ\n ولذلك قالوا: الثدي الميتة لا تُرضع\n وقولنا: \" التربية العرفية \" أعني: بالصحبة العرفية\n وأما التربية الغيبية\n على وجه خرق العادة\n كطيران الشيخ إلى المريد\n أو المريد إلى الشيخ\n فلا تجد صاحب هذه التربية إلا منحرفًا لإحدى الجهتين\n إما إلى الحقيقة أو إلى الشريعة\n بخلاف التربية العرفية\n فلا يكون صاحبها\n في الغالب\n إلا معتدلاً كاملاً\n وقوله تعالى: { فاسألوا أهل الذكر } هم العارفون بالله\n فإذا أشكل علينا أمر من أمر القلوب كأسرار التوحيد\n وأمر الخواطر\n رجعنا إليهم لأنهم أهل الذوق والكشف\n يُجيبون سائلهم بالهمة والحال\n حتى يقلعوا عروق ما أشكل على السائل\n إن أتاهم متعطشًا لهفانًا\n وكذا ما أشكل في أمر الدنيا\n من فعل تريد أن تفعله أو تتركه\n فينبغي الرجوع إليهم لأنهم ينظرون بنور الله\n فلا ينطقهم الله إلا بما هو حق سبق به القدر\n وأما أمور الدين\n فإن كان له علم بالشريعة الظاهرة فالرجوع إليه\n وإن لم يكن له علم بالظاهر\n فالعلماء قائمون بهذا الأمر\n وقوله تعالى: { إن كنتم لا تعلمون } يُفهم منه أن من كان من أهل الفهم عن الله\n يأخذ العلم عن الله بإلهام أو تجل حقيقي\n فلا يحتاج إلى سؤالهم\n حيث صفت مرآة قلبه\n وقد يكون الولي ذاكرًا\n باعتبار قوم\n وغير ذاكر\n باعتبار آخرين\n الذين هم أنهض منه حالاً\n وأصوب مقالاً\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:196",
      "similarity": 0.6738878408540396
    },
    {
      "verse": "54:52",
      "similarity": 0.6578089370542849
    },
    {
      "verse": "3:184",
      "similarity": 0.6449301715080342
    },
    {
      "verse": "35:25",
      "similarity": 0.6431599787447068
    },
    {
      "verse": "21:105",
      "similarity": 0.5952791129419079
    }
  ]
}