{
  "chapter": "النحل",
  "text": "وله ما فى السموت والارض وله الدين واصبا افغير الله تتقون",
  "translations": [
    {
      "translation": "Everything in the heavens and earth belongs to Him, and the deen belongs to Him, firmly and for ever. So why do you fear anyone other than Allah?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and the earth belongs to Him, and His the judgement for ever. So will you fear any other than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is whatever is in the heavens and the earth, and obedience to Him inevitably pervades the whole universe. Will you, then, hold in awe any other than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and the earth. God's retribution is severe. Should you then have fear of anyone other than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him only belongs all whatever is in the heavens and in the earth, and obeying Him only is obligatory; so will you fear anyone other than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and the earth and the religion. Will you then fear any other than Allah\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever is in the heavens and the earth is His, and to Him should obedience be (rendered) constantly; will you then guard against other than (the punishment of) Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and earth; His is the religion for ever. Then will you fear other than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him belongeth whatsoever is in the heavens and the earth, and religion is His for ever. Will ye then fear any other than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatsoever is in the heavens and on the earth, and obedience is due to Him alone. Will you then fear anyone other than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And His is whatsoever is in the heavens and the earth, and unto Him is obedience due perpetually; will ye then fear any other than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatever is in the heavens and the earth, and to Him belongs the enduring religion. Will you, then, be wary of other than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatever is in the heavens and on earth, and to Him is duty due always: then will ye fear other than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and (all that is in) the earth and Ad-Din Wasiba is His [(i.e. perpetual sincere obedience to Allah is obligatory). None has the right to be worshipped but Allah)]. Will you then fear any other than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and the earth. His is the Religion for ever. Would you then fear any but Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs everything in the heavens and the earth; and to Him obedience is due always. Do you, then, fear anyone other than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him belongs whatever is in the heavens and the earth, and to Him is [due] worship constantly. Then is it other than Allah that you fear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:52] And to Him belongs whatever is in the heavens and the earth, as possessions, creatures and servants. And to Him belongs the religion, the obedience, that endures, the [one] everlasting (wāsiban, is a circumstantial   qualifier referring to al-dīn, ‘the religion’, and is operated by the sense of the adverbial clause). Will you then fear any other than God?, when He is the True God, other than Whom there is no god (the interrogative is a [statement of] rejection and rebuke).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Him belongeth whatsoever is in the heavens and the earth) of created beings and marvels, (and religion is His for ever) it is also said that this means: sincerely unto Him. (Will ye then fear) worshipping (any other than Allah?)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَهُ ٱلدِّينُ وَاصِباً } يعني دائماً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His is the religion, forever.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أن { لَهُ } ومنه { مَا } ظهر { فِي ٱلْسَّمَٰوَٰتِ } أي: عالم الأسماء والصفات التي هي الفواعل والمفيضات المؤثرات { وَ } ما ظهر في { ٱلأَرْضِ } أي: عالم الطبيعة من الاستعدادات التي هي القوابل المتأثرات من العلويات { وَلَهُ } لا لغيره من الأسباب والوسائل العادية { ٱلدِّينُ } أي: الإطاعة والانقياد\n والتوجه والرجوع { وَاصِباً } دائماً حتماً لازماً { أَفَغَيْرَ ٱللَّهِ } المحيط للكل إحاطة شهود وحضور { تَتَّقُونَ } [النحل: 52] وتحذرون أيها الجاهلون بحق قدره\n مع أنه لا ضار سواه\n ولا نافع غيره؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { واصبًا }: حال من { الدين }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:9",
      "similarity": 0.778251067259212
    },
    {
      "verse": "3:83",
      "similarity": 0.08940129370091424
    },
    {
      "verse": "49:16",
      "similarity": 0.07470874068403052
    },
    {
      "verse": "56:86",
      "similarity": 0.06639125307265183
    },
    {
      "verse": "3:85",
      "similarity": 0.06596317930974827
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/16:52.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/16:52.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/16:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}