{
  "chapter": "النحل",
  "text": "ويجعلون لما لا يعلمون نصيبا مما رزقنهم تالله لتسـلن عما كنتم تفترون",
  "translations": [
    {
      "translation": "They allot a portion of the provision We have given them to things they have no knowledge of at all. By Allah, you will be asked about what you invented!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They set aside a portion of the food We have given them for those they do not know. By God, you will surely have to answer for all you contrive!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They set apart for those, whose reality they do not even know, a portion of the sustenance We have provided them. By Allah, you will surely be called to account for the lies that you have invented!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They give to unknown images a share out of the sustenance that We gave them. By God, you will be questioned about that which you have falsely invented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for things unknown, they assign a portion of the sustenance We have given them; by Allah – you will certainly be questioned regarding all that you used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they assign a portion of that which We have provided them with, to what they have no knowledge of (false deities). By Allah, you shall certainly be questioned about (all) that you used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set apart for what they do not know a portion of what We have given them. By Allah, you shall most certainly be questioned about that which you forged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they appoint a share of that We have provided them to what they know not. By God, you shall be questioned as to that you forged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they assign a portion of that which We have given them unto what they know not. By Allah! but ye will indeed be asked concerning (all) that ye used to invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They even appoint a share of what We have provided for them [to false gods] they know nothing of. You shall surely be questioned about the lies you have been fabricating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they appoint for that which they knew not a portion of that wherewith We have provided them By Allah! ye will surely be questioned regarding that which ye have been fabricating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They assign a share in what We have provided them to what they do not know. By Allah, you will surely be questioned concerning what you used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (even) assign, to things they do not know, a portion out of that which We have bestowed for their sustenance! By Allah, ye shall certainly be called to account for your false inventions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they assign a portion of that which We have provided them unto what they know not (false deities). By Allah, you shall certainly be questioned about (all) that you used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They set aside a share of that which We have provided them for what they did not know. By Allah, you shall be questioned about your forgeries!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they allocate, to something they do not know, a share of what We have provided for them. By God, you will be questioned about what you have been inventing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they assign to what they do not know a portion of that which We have provided them. By Allah, you will surely be questioned about what you used to invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:56] And they, that is, the idolaters, assign, to what they do not know, that they cause harm and cannot benefit [them] — namely, the idols — a portion of that which We have provided them with, of crops and cattle, saying that ‘this is for God and this is for our partners’. By God, you will indeed be questioned (a questioning of rebuke; there is a shift herein from the third [to the second] person) about what you used to fabricate, against God, such as [claiming] that He commanded you to [do] this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they assign a portion) a share for men to the exclusion of women (of that which We have given them) of cattle and crops (unto what they know not) and say: Allah commanded us to do so. (By Allah! but ye will indeed be asked) on the Day of Judgement (concerning (all) that ye used to invent) to lie about Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالعجب كل العجب ينكرن بنا\n مع أنا متصفون بجميع أوصاف الكمال\n منعمون لهم بالنعم الجليلة الجزيلة { وَيَجْعَلُونَ } ويعينون { لِمَا لاَ يَعْلَمُونَ } أي: لآلهتهم التي لا يعلمون ولا يفهمون منهم حصول الفائدة لهم\n وجلب النفع إليهم أصلاً\n إذ هي جمادات نحتوها بأيديهم { نَصِيباً } أي: حظاً كاملاً { مِّمّا رَزَقْنَاهُمْ } وسقنا نحوهم جهلاً وعناداً\n ومع ذلك خيلوا أنهم لا يسألون عنها\n ولا يؤاخذون عليها\n بل يثابون بها على زعمهم الفاسد\n ورأيهم الكاسد { تَٱللَّهِ لَتُسْأَلُنَّ } أيها المسرفون { عَمَّا كُنْتُمْ تَفْتَرُونَ } [النحل: 56] علينا بإثبات الشركاء\n وإسناد نعمنا إليهم افتراءً ومراءً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الضمير في { يجعلون } للكفار، وفي { يعملون } لهم، أو للأصنام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:97",
      "similarity": 0.7057863417112987
    },
    {
      "verse": "12:95",
      "similarity": 0.6616758598278313
    },
    {
      "verse": "16:63",
      "similarity": 0.5725777498494323
    },
    {
      "verse": "12:91",
      "similarity": 0.5476176227366876
    },
    {
      "verse": "12:73",
      "similarity": 0.4721427094596504
    }
  ]
}