{
  "chapter": "النحل",
  "text": "وقال الله لا تتخذوا۟ الهين اثنين انما هو اله وحد فايى فارهبون",
  "translations": [
    {
      "translation": "Allah says, 'Do not take two gods. He is only One God. So dread Me alone.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God says: \"Do not take to two gods, for there is only one God. So fear Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has commanded: \"Do not take two gods; for He is but One God. So fear Me alone.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God says, \"Do not worship two gods. There is only One God. Have fear of Me\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has proclaimed, “Do not ascribe two Gods; indeed He is the only One God; therefore fear Me alone.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah said \"Do not worship two gods. Indeed, He (Allah) is only One God. Then fear Me Alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has said: Take not two gods, He is only one Allah; so of Me alone should you be afraid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God says: 'Take not to you two gods. He is only One God; so have awe of Me.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath said: Choose not two gods. There is only One Allah. So of Me, Me only, be in awe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God says, \"Do not take two gods. He is only One God. So fear Me alone.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath said: take not two gods; He is only One God so Me alone, Me dread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has said, ‘Do not worship two gods. Indeed He is the One God, so be in awe of Me [alone].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has said: \"Take not (for worship) two gods: for He is just One Allah: then fear Me (and Me alone).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah said (O mankind!): \"Take not ilahain (two gods in worship, etc.). Verily, He (Allah) is (the) only One Ilah (God). Then, fear Me (Allah) much [and Me (Alone), i.e. be away from all kinds of sins and evil deeds that Allah has forbidden and do all that Allah has ordained and worship none but Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah says: 'Do not take to yourself two gods. He is only One God; so have awe of Me'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has said: “Do not take two gods; He is only One God; so fear only Me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has said, \"Do not take for yourselves two deities. He is but one God, so fear only Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:51] And God has said: ‘Do not choose two gods (ithnayn is for emphasis). Truly there is only One God — He has added this [statement] to affirm [His] Divinity and Oneness — so be in awe of Me [alone]’: fear Me, to the exclusion of anyone else — herein is a shift from the third person [to the first].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلما أُشبع القول في إبطال تعدّد الآلهة الشائع في جميع قبائل العرب ، وأتبع بإبطال الاختلاق على الرسول صلى الله عليه وسلم والقرآن ، نُقل الكلام إلى إبطال نوع آخر من الشّرك متّبع عند قبائل من العرب وهو الإشراك بإلهية أصلين للخير والشرّ ، تقلّدته قبائل العرب المجاورة بلاد فارس والساري فيهم سلطان كِسرى وعوائدُهم ، مثلُ بني بكر بن وائل وبني تميم ، فقد دان منهم كثير بالمجوسية ، أي المَزْدكية والمانوية في زمن كِسرى أبرويش وفي زمن كِسرى أنوشروان ، والمجوسية تثبت عقيدةً بإلهين : إلهٍ للخير وهو النّور ، وإلهٍ للشرّ وهو الظلمة ، فإله الخير لا يصدر منه إلا الخير والأنعام ، وإله الشرّ لا يصدر عنه إلا الشرّ والآلام ، وسمّوا إله الخير ( يَزْدَان ) ، وسموا إله الشرّ ( اَهْرُمُنْ ). وزعموا أن يزدان كان منفرداً بالإلهية وكان لا يخلق إلا الخير فلم يكن في العالم إلا الخير ، فخطر في نفسه مرةً خاطرُ شرّ فتولّد عنه إلهٌ آخرُ شريك له هو إلهٌ الشرّ ، وقد حكى هذا المعرّي في لزومياته بقوله :فَكّرَ يَزْدانُ على غِرة ... فصيغ من تفكيره أهْرُمُنْولم يكونوا يجعلون لهذين الأصلين صُوراً مجسّمة ، فلذلك لم يكن دينهم من عداد عبادة الطاغوت لاختصاص اسم الطاغوت بالصور والأجسام المعبودة . وهذا الدين من هذه الجهة يشبه الأديان التي لا تعبُد صُوَراً محسوسة . وسيأتي الكلام على المجوسيّة عند تفسير قوله تعالى : { إن الذين آمنوا والذين هادوا إلى قوله { والمَجوسَ } في سورة الحج ( 170 ).ويدلّ على أن هذا الدين هو المراد التّعقيب بآية { ما بكم من نعمة فمن الله ثم إذا مسّكم الضرّ فإليه تجأرون } \\[ سورة النحل : 53 \\] كما سيأتي .فقوله تعالى : { وقال الله لا تتخذوا إلهين اثنين } عطف قصّة على قصّة وهو مرتبط بجملة { ولقد بعثنا في كل أمّة رسولاً أن اعبدوا الله واجتنبوا الطاغوت } \\[ سورة النحل : 36 \\].ومعنى { وقال الله لا تتخذوا إلهين } أنه دعا الناس ونَصب الأدلّة على بطلان اعتقاده . وهذا كقوله تعالى : { يريدون أن يبدلوا كلام الله } \\[ سورة الفتح : 15 \\] وقوله : { كذلكم قال الله من قبل } \\[ سورة الفتح : 15 \\].وصيغة التّثنية من قوله : { إلهين } أكدت بلفظ { اثنين } للدّلالة على أن الإثنينية مقصودة بالنّهي إبطالاً لشرك مخصوص من إشراك المشركين ، وأن لا اكتفاء بالنّهي عن تعدّد الإله بل المقصود النّهي عن التّعدد الخاص وهو قول المجوس بإلهين . ووقع في «الكشاف» توجيه ذكر { اثنين } بأنه لدفع احتمال إرادة الجنس حقيقة لا مجازاً .وإذ نُهوا عن اتخاذ إلهين فقد دلّ بدلالة الاقتضاء على إبطال اتخاذ آلهة كثيرة .وجملة { إنما هو إله واحد } يجوز أن تكون بياناً لجملة { لا تتخذوا إلهين اثنين } ، فالجملة مقولة لفعل { وقال الله } لأن عطف البيان تابع للمبيّن كموقع الجملة الثانية في قول الشاعر :أقول له ارحَلْ لا تَقيمَنّ عندنا ... فلذلك فُصلت ، وبذلك أفيد بالمنطوق ما أفيد قبلُ بدلالة الاقتضاء .والضمير من قوله تعالى : { إنما هو إله واحد } عائد إلى اسم الجلالة في قوله : { وقال الله } ، أي قال الله إنما الله إله واحد ، وهذا جَريٌ على أحد وجهين في حكاية القول وما في معناه بالمعنى كما هنا ، وقوله تعالى حكاية عن عيسى عليه السلام { أن اعبدوا الله ربي وربكم } \\[ سورة المائدة : 117 \\] ف { أن اعبدوا الله } مفسرُ «أمَرْتني» ، وفعل «أمَرْتني» فيه معنى القول ، والله قال له : قل لهم اعبُدوا الله ربك وربهم ، فحكاه بالمعنى ، فقال : ربّي .والقصر في قوله : { إنما هو إله واحد } قصر موصوف على صفة ، أي الله مختصّ بصفة توحّد الإلهية ، وهو قصر قلب لإبطال دعوى تثنية الإله .ويجوز أن تكون جملة { إنما هو إله واحد } معترضةً واقعة تعليلاً لجملة { لا تتخذوا إلهين اثنين } أي نَهى الله عن اتخاذ إلهين لأن الله واحد ، أي والله هو مسمّى إله فاتّخاذ إلهين اثنين قلب لحقيقة الإلهية .وحصر صفة الوحدانية في عَلَم الجلالة بالنّظر إلى أن مسمّى ذلك العلم مساوٍ لمسمّى إله ، إذ الإله منحصر في مسمّى ذلك العلَم .وتفريع { فإياي فارهبون } يجوز أن يكون تفريعاً على جملة { لا تتخذوا إلهين اثنين } فيكون { فإياي فارهبون } من مقول القول ، ويكون في ضمير المتكلم من قوله : { فارهبون } التفات من الغيبة إلى الخطاب .ويجوز أن يكون تفريعاً على فعل { وقال الله } فلا يكون من مقول القول ، أي قال الله لا تتخذوا إلهين فلا ترهبوا غيري . وليس في الكلام التفات على هذا الوجه .وتفرّع على ذلك قوله تعالى : { فإياي فارهبون } بصيغة القصر ، أي قصر قلب إضافياً ، أي قصر الرهبة التامة منه عليه فلا اعتداد بقدرة غيره على ضرّ أحد . وهو ردّ على الذين يرهبون إله الشرّ فالمقصود هو المرهوب .والاقتصار على الأمر بالرّهبة وقصرها على كونها من الله يفهم منه الأمر بقصر الرغبة عليه لدلالة قصر الرهبة على اعتقاد قصر القدرة التامة عليه تعالى فيفيد الردّ على الذين يطمعون في إله الخير بطريق الأولى ، وإنما اقتصر على الرّهبة لأن شأن المزدكية أن تكون عبادتهم عن خوف إله الشرّ لأن إله الخير هم في أمن منه فإنه مطبوع على الخير .ووقع في ضمير { فإياي } التفات من الغيبة إلى التكلم لمناسبة انتقال الكلام من تقرير دليل وحدانية الله على وجه كلّي إلى تعيين هذا الواحد أنه الله منزل القرآن تحقيقاً لتقرير العقيدة الأصلية . وفي هذا الالتفات اهتمام بالرّهبة لما في الالتفات من هزّ فهم المخاطبين . وتقدّم تركيب نظيره بدون التفات في سورة البقرة .واقتران فعل { فارهبون } بالفاء ليكون تفريعاً على تفريع فيفيد مفاد التأكيد لأن تعلّق فعل «ارهبون» بالمفعول لفظاً يجعل الضمير المنفصل المذكور قبله في تقدير معمول لفعل آخر ، فيكون التقدير : فإياي ارهبُوا فارهبون ، أي أمرتكم بأن تقصُروا رهبتكم عليّ فارهبون امتثالاً للأمر .\n\n",
      "translations": [
        {
          "translation": "(Allah hath said: Choose not) worship not (two gods) i.e. Himself as well as the idols. (There is only One God) without a son or partner. (So of Me, Me only, be in awe) fear Me in relation to worshipping idols.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا تمنعون عن إثبات الشركاء لله الواحد الأحد الصمد أيها المشركون المعاندون بعدما { قَالَ ٱللَّهُ } عز شأنه\n وجل بركاته: { لاَ تَتَّخِذُواْ } أيها المكلفون بالإيمان والعرفان { إِلـٰهَيْنِ ٱثْنَيْنِ } مستحقين للعبادة والانقياد\n فيكف الزيادة { إِنَّمَا هُوَ إِلـٰهٌ وَاحِدٌ } يُعبد بالحق\n يُرجع نحوه في الوقائع\n ويُفوض إليه الأمور كلها\n وما هو إلاَّ أنا { فَإيَّايَ } لا إلى غيري من مخلوقاتي ومصنوعاتي { فَٱرْهَبُونِ } [النحل: 51] أي: خصوني بالخوف والرجاء\n وارجعوا إليّ عند هجوم البلاء\n ونزول القضاء\n إذ لا راد لقضائي إلاَّ فضلي وعطائي\n\n\n{ وَ } كيف لا يُرجع إليه\n ويُستغاث منه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إلهين اثنين } \n إلهين: مفعول أول\n واثنين: تأكيد\n والثاني: محذوف\n أي: معبودين لكم\n وفائدة التأكيد: التنبيه على أن المقصود هو النهي عن الإثنينية تنبيهًا على أن الإثنينية تنافي الألوهية\n كما ذكر الواحد في قوله: { إنما هو إله واحد } إثبات الوحدانية دون الإلهية\n قاله البيضاوي\n وعبارة صاحب المطول: لفظ إلهين حامل لمعنى الجنسية - أعني: الإلهية - ومعنى العدد - أعني: الإثنينية - وكذا لفظ \" الله \" حامل لمعنى الجنسية والوحدة\n والغرض المسوق له الكلام في الأول: النهي عن اتخاذ الاثنين من الإله لا إثبات جنسه\n فَوَصَفَ الإلهين باثنين وإله بواحد إيضاحًا لهذا الغرض وتفسيرًا له\n هـ\n ويحتمل أن يكون \" اثنين \" مفعولاً أولاً\n و \" إلهين \" مفعولاً ثانيًا\n وقوله: { فإياي }: مفعول بفعل محذوف\n أي: ارهبوا\n ولا يعمل فيه ارهبون لأنه أخذ مفعوله\n وهو: ياء المتكلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:40",
      "similarity": 0.6225845391425843
    },
    {
      "verse": "7:116",
      "similarity": 0.5008314163483297
    },
    {
      "verse": "59:13",
      "similarity": 0.4635184667863276
    },
    {
      "verse": "68:18",
      "similarity": 0.36475135105535644
    },
    {
      "verse": "34:24",
      "similarity": 0.33666924662745046
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}