{
  "chapter": "النحل",
  "text": "ليكفروا۟ بما ءاتينهم فتمتعوا۟ فسوف تعلمون",
  "translations": [
    {
      "translation": "ungrateful for what We have given them. Enjoy yourselves. You will soon know!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as to deny what We have bestowed on them. Well, enjoy yourselves, you will come to know soon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they may show ingratitude for the bounties We bestowed upon them. So enjoy yourselves for a while, soon you will come to know (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the end you will reject Our bounties. Enjoy yourselves; you will soon know (the consequences of your deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to deny the favours We have given them; so enjoy a little; for you will soon come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they are ungrateful for that which We have given them! Then enjoy yourselves but you will soon come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they be ungrateful for what We have given them; then enjoy yourselves; for soon will you know\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they may show unthankfulness for that We have given them. So take your joy; certainly you will soon know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as to deny that which We have given them. Then enjoy life (while ye may), for ye will come to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "showing no gratitude for what We have given them. Enjoy yourselves awhile; but soon you will know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may show ingratitude for that which We have vouchsafed unto them. Enjoy then, presently ye shall know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "being unthankful for what We have given them. So let them enjoy. Soon they shall know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As if) to show their ingratitude for the favours we have bestowed on them! then enjoy (your brief day): but soon will ye know (your folly)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So (as a result of that) they deny (with ungratefulness) that (Allah's Favours) which We have bestowed on them! Then enjoy yourselves (your short stay), but you will come to know (with regrets).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they may show ingratitude for what We gave them. So, take your pleasure, you shall soon know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To show ingratitude for what We have given them. Enjoy yourselves. You will soon know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they will deny what We have given them. Then enjoy yourselves, for you are going to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:55] in order to deny that, grace, which We have given them. So enjoy, that consent of yours to worship idols (an imperative meant as a threat): for soon you shall know, the consequence of this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So as to deny that which We have given them) of bounty and thus say it was given to us through the intercession of our gods. (Then enjoy life (while you may)) live in disbelief and the forbidden, (for ye will come to know) what will be done to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما فعلوا ذلك وأشركوا { لِيَكْفُرُواْ بِمَآ آتَيْنَاهُمْ } من النعم، ولم يقوموا بشكرها عناداً ومكابرةً، بل أسندوها إلى ما لا شعور لها أصلاً ظلماً وزوراً { فَتَمَتَّعُواْ } أيها المشركون بنا، الكافرون لنعمنا { فَسَوْفَ تَعْلَمُونَ } [النحل: 55] ما تكسبون لنفوسكم من العذاب المخلد، والعقاب المؤبد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وأصله للبيضاوي، والجملة: يحتمل أن تكون استئنافية، أو حالية، فيتصل الكلام بما قبله، أي: كيف تتقون غير الله، والحال أن ما بكم من نعمة فمنه وحده؟ واللام في { ليكفروا }: لام الأمر على وجه التهديد، كقوله بعدُ: { فتمتعوا } فعلى هذا يبتدأ بها، وقيل: هي لام العاقبة، فعلى هذا توصف بما قبلها لأنها في الأصل لام كي، وهو بعيد\n يقول الحقّ جلّ جلاله: { وقال الله لا تتخذوا إلهين اثنين } ، بأن تعبدوا الله تعالى، وتعبدوا معه الأصنام، { إنما هو إله واحد } لا شريك له ولا ظهير، ولا معين ولا وزير، { فإياي فارهبون } ، عَدَلَ من الغيبة إلى التكلم مبالغةً في الترهيب، وتصريحًا بالمقصود، كأنه قال: فأنا ذلك الإله الواحد، فإياي فارهبون، لا غيري، { وله ما في السماوات والأرض } خلقًا وملكًا وعبيدًا، { وله الدين } أي: الطاعة والانقياد { واصباً }: لازماً، أو: واجباً وثابتاً لما تقرر أنه الإله وحده، والحقيق بأن يرهَبَ منه فلا يُدَان لأحد إلا هو\n وقيل: { وله الدِّينُ } أي: الجزاء { واصِبًا } أي: دائمًا، فلا ينقطع ثوابه لمن آمن، ولا عقابه لمن كفر\n { أفغير الله تتقون } مع أنه ليس بيد غيره نفع ولا ضر؟! كما قال: { وما بكم من نعمة فمن الله } أيْ: وأيّ شيء اتصل بكم من نعمة فهو من الله وحده، { ثم إذا مسكم الضرُّ فإليه تجأرون } أي: فلا تتضرعون عند الشدة إلا إليه، ولا تستغيثون إلا به\n\n\nوالجؤار: رفع الصوت في الدعاء والاستغاثة، { ثم إذا كشف الضر عنكم إذا فريقٌ منكم بربهم يشركون } وهم: كفاركم، ففي وقت الشدة ينسون أصنامهم، وفي الرخاء يرجعون إليها\n فعلوا ذلك { ليكفروا بما آتيناهم } من نعمة الكشف عنهم، كأنهم قصدوا بشركهم كفران النعمة، أو يكون تهديدًا، أي: ليكفروا ما شاؤوا فسوف يعلمون، كقوله: { فتمتعوا } بكفركم { فسوف تعلمون } عاقبة أمركم\n الإشارة: قال في التنوير: أبى المحققون أن يشهدوا غير الله لما حققهم به من شهود القيومية، وإحاطة الديمومية\n هـ\n فمن فتح الله بصيرته، لم يشهد مع الحق سواه إذ الأكوان ثابتة بإثباته، ممحوة بأحدية ذاته، فما حجبك عن الحق وجود موجود معه إذ لا شيء معه، وإنما حجبك توهم موجود معه \"\n فمن غاب عن ثنوية نفسه غاب عن ثنوية الأكوان، ووقع على عين الشهود والعيان\n فما ظهر في الوجود إلا أسرار ذاته وأنوار صفاته\n وبالله التوفيق\n ثم ذكر أهل الشرك وسفاهة رأيهم\n",
      "translations": []
    }
  ]
}