{
  "chapter": "النحل",
  "text": "واذا بشر احدهم بالانثى ظل وجهه مسودا وهو كظيم",
  "translations": [
    {
      "translation": "When one of them is given the good news of a baby girl, his face darkens and he is furious.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when news of the birth of a daughter reaches one of them, his face is darkened, and he is overwhelmed with silent grief,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When any of them is told about the birth of a female his face turns dark, and he is filled with suppressed anger,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the glad news of the birth of their daughter is brought to them, their faces turn gloomy and black with anger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when one among of them receives the glad tidings of a daughter, his face turns black for the day, and he remains seething.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the news of (the birth of) a female (child) is brought to any of them, his face becomes dark, and he is filled with inner grief!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a daughter is announced to one of them his face becomes black and he is full of wrath.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when any of them is given the good tidings of a girl, his face is darkened and he chokes inwardly,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When if one of them receiveth tidings of the birth of a female, his face remaineth darkened, and he is wroth inwardly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the birth of a girl is announced to any of them, his face darkens and he is filled with gloom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there is announced unto any of them a female his countenance remainoth darkened the whole day and he is wroth inwardly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When one of them is brought the news of a female [newborn], his face becomes darkened, and he chokes with suppressed agony.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When news is brought to one of them, of (the birth of) a female (child), his face darkens, and he is filled with inward grief!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the news of (the birth of) a female (child) is brought to any of them, his face becomes dark, and he is filled with inward grief!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When good news of the birth of a female is given to any of them, his face grows dark and inwardly he chokes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when one of them is given news of a female infant, his face darkens, and he chokes with grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when one of them is informed of [the birth of] a female, his face becomes dark, and he suppresses grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:58] And when one of them is given the tidings of a girl, that will be born to him, his face becomes darkened, transformed like that of one [suddenly] struck by grief, and he chokes inwardly, filled with anguish: so how is it that daughters are attributed to Him, exalted be He?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When if one of them receiveth tidings of the birth of a female, his face remaineth darkened) with grief, (and he is wroth inwardly) grief stricken and is inwardly devastated.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُوَ كَظِيمٌ } معناه حَزِينٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He is {kathimun},\" means He is sad.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الحال أنهم { إِذَا بُشِّرَ أَحَدُهُمْ بِٱلأُنْثَىٰ } أي: بولادتها { ظَلَّ وَجْهُهُ مُسْوَدّاً } أي: صار وجهه أسود من غاية الحزن والكراهة { وَهُوَ } حينئذٍ { كَظِيمٌ } [النحل: 58] ممتلئ من الغيظ والبغض على الزوجة والوليدة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:17",
      "similarity": 0.9112290949885351
    },
    {
      "verse": "3:134",
      "similarity": 0.4397260118242451
    },
    {
      "verse": "33:67",
      "similarity": 0.4226261755006377
    },
    {
      "verse": "68:48",
      "similarity": 0.4117934529437437
    },
    {
      "verse": "39:60",
      "similarity": 0.3979372058139778
    }
  ]
}