{
  "chapter": "النحل",
  "text": "ولو يؤاخذ الله الناس بظلمهم ما ترك عليها من دابة ولكن يؤخرهم الى اجل مسمى فاذا جاء اجلهم لا يستـخرون ساعة ولا يستقدمون",
  "translations": [
    {
      "translation": "If Allah were to punish people for their wrong actions, not a single creature would be left upon the earth, but He defers them till a predetermined time. When their specified time arrives, they cannot delay it for a single hour nor can they bring it forward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God were to punish men for their inequity He would not leave a single moving thing on earth. Yet He gives them latitude for a time ordained. When that time is come, there will not be a moment's delay nor a moment's haste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were Allah to take people to task for their wrong-doing, He would not have spared even a single living creature on the face of the earth. But He grants them respite until an appointed term. And when that term arrives, they have no power to delay it by a single moment, nor to hasten it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Was God to seize people immediately for their injustice, no living creature would be left on earth. He gives them respite for an appointed time. When their term is over, they will not be able to change the inevitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were Allah to seize people on account of their injustices, He would not have left anyone walking on the earth, but He gives them respite up to an appointed promise; then when their promise comes they cannot go back one moment nor come forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to punish (all) mankind for their wrongdoing, He would not leave on it (the earth) a single moving creature, but He defers them to an appointed term; and when their term comes, they can neither delay nor advance it an hour (or a moment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah had destroyed men for their iniquity, He would not leave on the earth a single creature, but He respites them till an appointed time; so when their doom will come they shall not be able to delay (it) an hour nor can they bring (it) on (before its time).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God should take men to task for their evildoing, He would not leave on the earth one creature that crawls; but He is deferring them to a term stated; and when their term is come they shall not put it back by a single hour nor put it forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah were to take mankind to task for their wrong-doing, he would not leave hereon a living creature, but He reprieveth them to an appointed term, and when their term cometh they cannot put (it) off an hour nor (yet) advance (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God were to take people to task for their wrongdoing, He would not leave even one living creature on earth, but He gives them respite till an appointed time: when their time comes they cannot delay it for an hour, nor can they bring it forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to lay hold of mankind for their wrong- doing, not a living creature He would leave on it, but he deferreth them to a term appointed, then, when their term cometh, they cannot put it off by an hour not anticipate it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were Allah to take mankind to task for their wrongdoing, He would not leave any living being upon it. But He respites them until a specified time; so when their time comes they shall not defer it by a single hour nor shall they advance it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah were to punish men for their wrong-doing, He would not leave, on the (earth), a single living creature: but He gives them respite for a stated Term: When their Term expires, they would not be able to delay (the punishment) for a single hour, just as they would not be able to anticipate it (for a single hour).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to seize mankind for their wrong-doing, He would not leave on it (the earth) a single moving (living) creature, but He postpones them for an appointed term and when their term comes, neither can they delay nor can they advance it an hour (or a moment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah punished people for their sins, He would not leave one creature that crawls on the earth. He reprieves them to an appointed term; when their term is come, they shall neither delay it by a single hour nor can they hasten it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God were to hold mankind for their injustices, He would not leave upon it a single creature, but He postpones them until an appointed time. Then, when their time arrives, they will not delay it by one hour, nor will they advance it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah were to impose blame on the people for their wrongdoing, He would not have left upon the earth any creature, but He defers them for a specified term. And when their term has come, they will not remain behind an hour, nor will they precede [it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:61] And if God were to take mankind to task for their wrongdoing, [wrongdoing] through acts of disobedience, He would not leave upon it, that is, [upon] the earth, any living being, any single [living] thing moving upon it; but He gives them respite until an appointed term; and when their term comes they will not defer, from it, by a single hour nor advance, it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If Allah were to take mankind to task for their wrong-doing) their idolatry, (he would not leave hereon) on the face of the earth (a living creature) a jinn or human being, (but He reprieveth them to an appointed term) He reprieves them to the time of their destruction, (and when their term cometh) when the time of their destruction comes (they cannot put (it) off an hour nor (yet) advance (it)) nor can they be destroyed before their appointed term.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { وَلَوْ يُؤَاخِذُ ٱللَّهُ } الحكيم المتقن في أفعاله { ٱلنَّاسَ } الناسين عهود العبودية على مقتضى عدله وانتقامه { بِظُلْمِهِمْ } ومعاصبهم الصادرة عنهم دائماً { مَّا تَرَكَ عَلَيْهَا } أي: على وجه الأرض { مِن دَآبَّةٍ } أي: ذي حركة تتحرك عليها؛ إذ ما من متحرك إلاَّ وينحرف عن جادة العدالة كثيراً { وَلٰكِن يُؤَخِّرُهُمْ } ويمهلهم على مقتضى فضل وحكمته ولطفه { إلَىٰ أَجَلٍ مُّسَمًّىٰ } أي: سمّاه الله وعينه في علمه لموتهم { فَإِذَا جَآءَ أَجَلُهُمْ } المسمى المبرم المقضى به { لاَ يَسْتَأْخِرُونَ سَاعَةً وَلاَ يَسْتَقْدِمُونَ } [النحل: 61] أي: لا يسع لهم الاستئخار والاستقدام، بل لا بدَّ أن يموتوا فيه حتماً مقضياً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولو يُؤاخذ اللهُ الناسَ بظلمهم } أي: بكفرهم ومعاصيهم الصادرة من بعضهم، { كما ترك عليها } أي: على الأرض { من دابة }: نسمة تدب عليها، بشؤم ظلمهم\n وعن ابن مسعود: كاد الجُعَل يهلك في جُحره بذنب ابن آدم\n وقيل: لو هلك الآباء بكفرهم لم يكن الأبناء، { ولكن يُؤخرهم إلى أجل مسمى } سماه لأعمارهم، أو لعذابهم، { فإذا جاء أجلهم لا يستأخرون } عنه { ساعة ولا يستقدمون } عليه، بل يهلكون، أو يُعذبون حينئذ لا محالة، فالحكمة في إمهال أهل الكفر والمعاصي لئلا يعم العذاب، كقوله:\n\n[الأنفال: 25]، و لعل الله تعالى يُخرج من أصلابهم من يُوحد الله }\n والله تعالى أعلم\n الإشارة: إن الله يهم أن ينزل إلى أهل الأرض عذابًا لما يرى فيهم من كثرة الظلم والفجور، فإذا رأى حِلَق الذكر ومجالس العلم رفع عنهم العذاب\n وفي بعض الأخبار:\n\n \" لَوْلاَ شُيوخٌ ركع، وصِبْيَانٌ رُضَّعٌ، وبَهَائمُ رُتَّعٌ، لصُبَّ عَليكُمُ العَذَابُ صَبًّا \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:45",
      "similarity": 0.7506420927892966
    },
    {
      "verse": "7:34",
      "similarity": 0.5469603094593553
    },
    {
      "verse": "10:49",
      "similarity": 0.47128574850972654
    },
    {
      "verse": "16:49",
      "similarity": 0.43855672112113936
    },
    {
      "verse": "8:55",
      "similarity": 0.3955078175612479
    }
  ]
}