{
  "chapter": "النحل",
  "text": "للذين لا يؤمنون بالءاخرة مثل السوء ولله المثل الاعلى وهو العزيز الحكيم",
  "translations": [
    {
      "translation": "Those who do not have iman in the Next World have an evil likeness. Allah's is the Highest Likeness. He is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The semblance of those who believe not in the life to come is that of the meanest; but the semblance of God is the most sublime, for He is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not believe in the Hereafter deserve to be characterized with evil attributes whereas Allah's are the most excellent attributes. He is the Most Mighty, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not believe in the life to come are evil examples. To God belongs all the exalted attributes; He is the Majestic and the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not believe in the Hereafter, for them only is the evil state; and the Majesty of Allah is Supreme; and He only is the Most Honourable, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who do not believe in the Hereafter is an evil description, and for Allah is the highest description. And He is the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who do not believe in the hereafter is an evil attribute, and Allah's is the loftiest attribute; and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe not in the world to come, theirs is the evil likeness; God's is the loftiest likeness; He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who believe not in the Hereafter is an evil similitude, and Allah's is the Sublime Similitude. He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The attribute of evil applies to those who do not believe in the Hereafter, while to God applies the highest attribute, for He is Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who believe not in the Hereafter is an evil similitude, and for Allah is the sublime similitude, and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is an evil description for those who do not believe in the Hereafter, and the loftiest description belongs to Allah, and He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who believe not in the Hereafter, applies the similitude of evil: to Allah applies the highest similitude: for He is the Exalted in Power, full of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who believe not in the Hereafter is an evil description, and for Allah is the highest description. And He is the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not believe in the Everlasting Life, theirs is the evil likeness; and for Allah is the highest likeness. He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not believe in the Hereafter set a bad example, while God sets the Highest Example. He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who do not believe in the Hereafter is the description of evil; and for Allah is the highest attribute. And He is Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:60] For those who do not believe in the Hereafter, namely, [for] the disbelievers, there is an evil description, in other words, [theirs is] the most evil attribute, meaning, the most vile, which is their burying alive of [newborn] girls, despite the fact that they are needed for the purposes of marriage; and the loftiest   description belongs to God, [His is] the attribute most sublime, namely, that there is no god except Him. And He is the Mighty, in His kingdom, the Wise, in His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For those who believe not in the Hereafter) in resurrection after death (is an evil similitude) i.e. the Fire, (and Allah's is the Sublime Similitude) the most sublime attribute: Godhood and Lordship without offspring or partners. (He is the Mighty) in His retribution against those who do not believe in Him, (the Wise) He ordered that none should be worshipped beside Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { لِلَّذِينَ لاَ يُؤْمِنُونَ بِٱلآخِرَةِ } المعدة لعرض الأعمال على الله والجزاء منه على مقتضاها { مَثَلُ ٱلسَّوْءِ } في حق الله المنزه عن الأهل والولد، سيما نسبتهم إليه ما يستقبحه نفوسهم من إثبات البنات له، تعالى عما يقول الظالمون علواً كبيراً { وَلِلَّهِ ٱلْمَثَلُ ٱلأَعْلَىٰ } هو الغني عن العالم ما فيها، فكيف الزواج الإيلاد، واللذين هما من أقوى أسباب الإمكان النافي للوجوب الذاتي الذي هو من لوازم الألوهية والربوبية { وَهُوَ ٱلْعَزِيزُ } الغالب المتفرد، المنيع ساحة عزته عن الاحتياج إلى غيره مطلقاً، فكيف إلى الزجة والولد { ٱلْحَكِيمُ } [النحل: 60] المتصف بكمال الحكمة المتقنة، كيف يختار لذاته ما لا يخلو عن وصمة النقصان؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { للذين لا يؤمنون بالآخرة مَثَلُ السَّوْءِ } أي: صفة السوء، وهي: الحاجة إلى الولد المنادية بالموت، واستبقاء الذكور استظهارًا بهم، وكراهة البنات ووأدهن خشية الإملاق، { ولله المثَلُ الأعلى } أي: الصفة العليا، وهو الوجوب الذاتي والغنى المطلق، والجود الفائق، والنزاهة عن صفات المخلوقين، والوحدانية في الذات والصفات والأفعال\n وقال الأزهري: المثل الأعلى، أي: التوحيد والخلق والأمر، ونفى كل إله سواه\n ويتَرجم عن هذا كله بقول: \" لا إله إلا الله \"\n هـ\n { وهو العزيز } في ملكه، { الحكيم } في صنعه، أي: المنفرد بكمال القدرة والحكمة، فالقدرة مُظهرة للأشياء في أوقاتها، والحكمة تسترها برداء أسبابها وشروطها\n والله تعالى أعلم\n الإشارة: ينبغي لأهل التوحيد الكامل أن يتنزهوا عن شبهة الشرك في أعمالهم وأموالهم، فلا يشركون فيما رزقهم الله، من الأموال، أحدًا من المخلوقين، يجعلون لهم نصيبًا في أموالهم، على قصد الحفظ، أو إصلاح النتاج، كما تفعله العامة مع الصالحين، فإن ذلك مما يقدح في صفاء التوحيد إذ لا فاعل سواه\n\n\nوقوله تعالى: { وإذا بُشِّر أحدهم بالأنثى\n\n\n } الآية، فيه ذم وتهديد لمن يكره البنات، وينقبض من زيادتهن لأن فيه نزغة من فعل الجاهلية، بل ينبغي إظهار البسط والبرور بهن أكثر من الذكور، ولا شك أن النفقة عليهن أكثر ثوابًا من الذكور، وفي الحديث:\n\n \" مَنِ ابْتُلِيَ بهذه البَنَاتِ، فأحْسَنَ إليْهِنَّ، كُنَّ لَهُ حِجَابًا مِنَ النَّار \" \n\nإلى غير ذلك من أحاديث كثيرة تُرغب في الإحسان إليهن\n والله تعالى أعلم\n ثمَّ ذكر حكمة امهاله تعالى للكفار فقال: { وَلَوْ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِظُلْمِهِمْ مَّا تَرَكَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:24",
      "similarity": 0.43852483717296586
    },
    {
      "verse": "69:22",
      "similarity": 0.41169065243148084
    },
    {
      "verse": "88:10",
      "similarity": 0.41169065243148084
    },
    {
      "verse": "20:68",
      "similarity": 0.4096068998896163
    },
    {
      "verse": "40:12",
      "similarity": 0.40130560273049365
    }
  ]
}