{
  "chapter": "النحل",
  "text": "وما انزلنا عليك الكتب الا لتبين لهم الذى اختلفوا۟ فيه وهدى ورحمة لقوم يؤمنون",
  "translations": [
    {
      "translation": "We have only sent down the Book to you so that you can make clear to them the things about which they differ, and as a guidance and a mercy to people who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down this Book to you that you may explain to them what it is that they are differing about, and as guidance and a grace for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down the Book that you may explain to them the truth concerning what they are disputing and that the Book may serve as a guidance and mercy for those who believe in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent you the Book for no other reason than to settle their differences and to be a guide and mercy for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send down this Book towards you except for you to clearly explain to them the matters in which they may differ, and a guidance and a mercy for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not revealed the Book to you, except that you may clearly explain to them those things in which they differ, and (as) a guidance and a mercy for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not revealed to you the Book except that you may make clear to them that about which they differ, and (as) a guidance and a mercy for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not sent down upon thee the Book except that thou mayest make clear to them that whereon they were at variance, and as a guidance and as a mercy to a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have revealed the Scripture unto thee only that thou mayst explain unto them that wherein they differ, and (as) a guidance and a mercy for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have only sent down the Book to you so that you can make clear to them that concerning which they differ, and as a guidance and a mercy to people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not sent down the Book unto thee save in order that thou mayest expound unto them that wherein they differ, and as a guidance and a mercy unto a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send down the Book to you except [for the purpose] that you may clarify for them what they differ about, and as a guidance and mercy for a people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent down the Book to thee for the express purpose, that thou shouldst make clear to them those things in which they differ, and that it should be a guide and a mercy to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not sent down the Book (the Quran) to you (O Muhammad SAW), except that you may explain clearly unto them those things in which they differ, and (as) a guidance and a mercy for a folk who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not revealed to you (Prophet Muhammad) the Book except that you may clarify for them that upon which they differ, and as guidance and mercy to a nation who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We revealed to you the Scripture only to clarify for them what they differ about, and guidance and mercy for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not revealed to you the Book, [O Muhammad], except for you to make clear to them that wherein they have differed and as guidance and mercy for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:64] And We have not revealed to you, O Muhammad (s), the Book, the Qur’ān, except [for the purpose] that you may make clear to them, to mankind, that wherein they differ, in the matter of religion, and as a guidance (wa-hudan is a supplement to wa-li-tubayyina, ‘and that you may make clear’) and as a mercy for a people who believe, in it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جملة القسم . والمناسبة أن القرآن أنزل لإتمام الهداية وكشف الشبهات التي عرضت للأمم الماضية والحاضرة فتَرَكَتْ أمثالها في العرب وغيرهم .فلما ذكرت ضلالاتهم وشبهاتهم عقّب ذلك ببيان الحكمة في إرسال محمد صلى الله عليه وسلم وإنزال القرآن إليه ، فالقرآن جاء مبيّناً للمشركين ضلالهم بياناً لا يترك للباطل مسلكاً إلى النفوس ، ومفصحاً عن الهدى إفصاحاً لا يترك للحَيرة مجالاً في العقول ، ورحمةً للمؤمنين بما جازاهم عن إيمانهم من خير الدنيا والآخرة .وعبّر عن الضلال بطريقة الموصولية { الذين اختلفوا فيه } للإيماء إلى أن سَبَب الضلال هو اختلافهم على أنبيائهم ، فالعرب اختلفت ضلالتهم في عبادة الأصنام ، عبدت كل قبيلة منهم صنماً ، وعبد بعضهم الشمس والكواكب ، واتّخذت كل قبيلة لنفسها أعمالاً يزعمونها ديناً صحيحاً . واختلفوا مع المسلمين في جميع ذلك الدّين .والإتيان بصيغة القصر في قوله تعالى : { وما أنزلنا عليك الكتاب إلا لتبين } لقصد الإحاطة بالأهمّ من غاية القرآن وفائدته التي أنزل لأجلها . فهو قصر ادعائي ليرغب السامعون في تلقّيه وتدبّره من مؤمن وكافر كلّ بما يليق بحاله حتى يستووا في الاهتداء .ثم إن هذا القصر يعرّض بتفنيد أقوال من حسبوا من المشركين أن القرآن أنزل لذكر القِصص لتعليل الأنفس في الأسمار ونحوها حتى قال مضلّهم : أنَا آتيكم بأحسن مما جاء به محمد ، آتيكم بقصة ( رستم ) و ( اسفنديار ). فالقرآن أهم مقاصده هذه الفوائد الجامعة لأصول الخير ، وهي كشف الجهالات والهدى إلى المعارف الحقّ وحصول أثر ذيْنِك الأمرين ، وهو الرحمة الناشئة عن مجانبة الضلال وإتباع الهدى .وأدخلت لام التعليل على فعل «تبين» الواقع موقع المفعول لأجله لأنه من فعل المخاطب لا من فعل فاعل { أنزلنا } ، فالنبي هو المباشر للبيان بالقرآن تبليغاً وتفسيراً . فلا يصحّ في العربية الإتيان بالتبيين مصدراً منصوباً على المفعولية لأجله إذ ليس متّحداً مع العامل في الفاعل ، ولذلك خولف في المعطوف فنُصب { هدى ورحمةً } لأنهما من أفعال مُنْزِل القرآن ، فالله هو الهادي والراحم بالقرآن ، وكل من البيان والهدى والرحمة حاصل بالقرآن فآلت الصفات الثلاث إلى أنها صفات للقرآن أيضاً .والتعبير ب { لقوم يؤمنون } دون للمؤمنين ، أو للذين آمنوا ، للإيماء إلى أنهم الذين الإيمان كالسّجية لهم والعادة الراسخة التي تتقوّم بها قوميّتهم ، كما تقدم في قوله تعالى : { لآيات لقوم يعقلون } في سورة البقرة ( 164 ).وهاته الآية بمنزلة التذييل للعبر والحجج الناشئة عن وصف أحوال المخلوقات ونِعم الخالق على الناس المبتدئة من قوله تعالى : { أفمن يخلق كمن لا يخلق } \\[ سورة النحل : 17 \\].\n\n",
      "translations": [
        {
          "translation": "(And we have revealed the Scripture unto thee) We did send Gabriel to you with the Qur'an (only that thou mayst explain unto them that wherein) in Religion (they differ) they opposed, (and (as) a guidance) from error (and a mercy) from chastisement (for a people who believe) in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَآ أَنْزَلْنَا } من مقام جودنا وفضلنا { عَلَيْكَ } يا أكمل الرسل { ٱلْكِتَابَ } الجامع لما في الكتب السالفة مع زيادات خلت عنهم تلك الكتب { إِلاَّ لِتُبَيِّنَ } وتوضح { لَهُمُ } أي: للناس الأمر { ٱلَّذِي ٱخْتَلَفُواْ فِيهِ } أي: التوحيد الذاتي وأحوال النشأة الأخرى\n والمكاشفات والمشاهدات الواقعة فيها { وَ } أنزلناه أيضاً { هُدًى } أي: هادياً\n يهديهم إلى التوحيد ببيان براهنيه وحججه الموصلة إليه بالنسبة إلى أرباب المعاملات والمجاهدات\n من الأبرار السائرين إلى الله بارتكاب الرياضات القالعة لدرن الإمكان\n ورين التعلقات\n\n\n{ وَرَحْمَةً } أي: كشفاً وشهوداً بالنسبة إلى المجذوبين المنجذبين نحو الحق\n المنخلعين عن جلباب ناسوتهم بغتة\n بلا صنعٍ صدر عنهم\n وأمرٍ ظهر منهم\n بل جذبهم الحق عن بشريتهم\n وبدَّلهم تبديلاً\n كل ذلك { لِّقَوْمٍ يُؤْمِنُونَ } [النحل: 64] ويوقنون بتوحيد الله وصفاته الذاتية\n ويتأملون في آثار مصنوعاته تأملاً صادقاً\n ويعتبرون منها اعتباراً حقّاً إلى أن ينكشفوا ويفوزوا بما فازوا\n وينالوا بما نالوا\n وليس وراء الله مرمى ولا منتهى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وهدى ورحمة }: معطوفتان على \" لتبين \" \n وانتصبا على المفعولية من أجله\n أي: لأجل البيان والهدى والرحمة\n يقول الحقّ جلّ جلاله: { تالله لقد أرسلنا } رسلاً { إلى أمم من قَبلكَ } يا محمد\n { فزَيَّن لهم الشيطانُ أعمالهم } السوء\n فرأوها حسنة\n فأسروا على قبائحها\n وكذبوا الرسل\n فصبروا حتى نُصروا\n فاصبر كما صبروا\n حتى تنصر كما انتصروا\n فكان عاقبة من اتبع الشيطان الهلاك والوقوع في العذاب\n { فهو وليّهم } أي: متولي أمورهم { اليومَ } في الدنيا\n { ولهم عذاب أليم } في الآخرة\n أو: فهو وليهم يوم القيامة\n على أنه حكاية حال آتية\n أي: لا ولي لهم غيره في ذلك اليوم\n وهو عاجز عن نصر نفسه\n فكيف ينصر غيره؟ { وما أنزلنا عليك الكتاب }: القرآن { إلا لتُبين لهم }: للناس { الذي اختلفوا فيه } من التوحيد\n والقَدَر\n وأحوال المعاد\n وأحكام الأفعال\n { وهُدًى ورحمةً لقوم يؤمنون } به\n فإنهم المنتفعون بإنزاله\n الإشارة: كل من وقف دون الوصول إلى مشاهدة الحق\n فهو مُزين له في عمله\n مُستدرج به وهو لا يشعر\n وحظه يوم القيامة الندم والأسف\n وفي ذلك يقول أبو المواهب:\nفهذه علامات الوصول إلى الحق\n بحيث ترتفع همته إلى حضرة الحق\n ويصرف نظره في معاني أسرار التوحيد\n وسمعه فيما يقرب إلى صريح التفريد\n ومن لم يبلغ هذا المقام\n لم ينقطع عنه تزيين الشيطان\n فيُزين له عمله\n فيقف معه\n وبالله التوفيق\n ثم ذكر دلائل توحيد وباهر قدرته ومن معرفتهما معرفة ذاته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:69",
      "similarity": 0.4946899939413257
    },
    {
      "verse": "78:3",
      "similarity": 0.4632096850646782
    },
    {
      "verse": "16:39",
      "similarity": 0.4610352489139368
    },
    {
      "verse": "51:8",
      "similarity": 0.43495203191608006
    },
    {
      "verse": "27:77",
      "similarity": 0.421328390932891
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016064.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016064.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:64.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}