{
  "chapter": "النحل",
  "text": "تالله لقد ارسلنا الى امم من قبلك فزين لهم الشيطن اعملهم فهو وليهم اليوم ولهم عذاب اليم",
  "translations": [
    {
      "translation": "By Allah, We sent Messengers to communities before your time, but Shaytan made their actions seem good to them. Therefore today he is their protector. They will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By God, We sent apostles to many a people before you, but Satan made their acts seem attractive to them, and he is their friend this day, and a painful torment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah, (O Muhammad), We sent Messengers to other communities before you but Satan made their evil deeds attractive to them (so they paid no heed to the call of the Messengers). The same Satan is their patron today and they are heading towards a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By God, We sent (Messengers) to nations who lived before you. Satan made their deeds seem attractive to them and, on the Day of Judgment, satan will be their guardian. For them there will be a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah, We indeed sent Noble Messengers to several nations before you, but Satan made their misdeeds appear good to them – so he only is their companion this day, and for them is a punishment, most painful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah, We indeed sent (Messengers) to the nations before you, but Shaytan made their deeds seeming fair to them. So today he is their helper, and theirs will be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah, most certainly We sent (apostles) to nations before you, but the Shaitan made their deeds fair-seeming to them, so he is their guardian today, and they shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By God, assuredly We sent Messengers to nations before thee, but Satan decked out fair to them their deeds; he is their protector today, and there yet awaits them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah, We verily sent messengers unto the nations before thee, but the devil made their deeds fairseeming unto them. So he is their patron this day, and theirs will be a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By God! We have sent messengers before you to other nations. But Satan made their [foul] deeds seem fair to them and today he is their patron. They shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah! assuredly We have sent apostles to communities before thee, then the Satan made their works fairseeming unto them, so he is their patron to-day, and unto them shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah, We have certainly sent [apostles] to nations before you. But Satan made their deeds seem decorous to them. So he is their master today and there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah, We (also) sent (Our messengers) to Peoples before thee; but Satan made, (to the wicked), their own acts seem alluring: He is also their patron today, but they shall have a most grievous penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah, We indeed sent (Messengers) to the nations before you (O Muhammad SAW), but Shaitan (Satan) made their deeds fair-seeming to them. So he (Satan) is their Wali (helper) today (i.e. in this world), and theirs will be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, by Allah, We have sent Messengers before you to other nations. But satan made their deeds seem fair to them so that today he is their guardian, and a painful punishment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By God, We sent messengers to communities before you, but Satan made their deeds appear alluring to them. He is their master today, and they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By Allah, We did certainly send [messengers] to nations before you, but Satan made their deeds attractive to them. And he is the disbelievers' ally today [as well], and they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:63] By God, We verily sent to communities before you, messengers. But Satan adorned for them their deeds, [their] evil [deeds], so that they considered them to be good [deeds] and therefore they denied the messengers. So he is their patron, the guardian of their affairs, today, that is, [now] in this world, and for them there will be a painful chastisement, in the Hereafter. It is also said that by al-yawm, ‘today’, is meant the Day of Resurrection, narrating the events as though they are taking place [now]. In other words, they have no guardian other than him [in other words, Satan], and as he is incapable of helping himself, how could he possibly help them?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(By Allah, We verily sent messengers unto the nations before thee, but the devil made their deeds fair- seeming unto them) he made their religion fair-seeming to them. (So he is their patron this day) in this worldly life and their companion in hell, (and theirs will be a painful doom) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تَٱللَّهِ } يا أكمل الرسل { لَقَدْ أَرْسَلْنَآ } رسلاً { إِلَىٰ أُمَمٍ } مضوا { مِّن قَبْلِكَ } حين فشا الجدال والمراد بينهم\n فانحرفوا عن جادة الاعتدال\n وأيدنا الرسل بالكتب المبينة لطريق العدالة والاستقامة\n فبينوا لهم على أبلغ وجه { فَزَيَّنَ } وحسّن { لَهُمُ ٱلشَّيْطَانُ } المغوي المضل { أَعْمَالَهُمْ } التي كانوا عليها\n فأصروا على أعمالهم\n فلم يقبلوا قول الأنبياء\n لذلك نزل عليهم من العذاب ما نزل في الدنيا\n وسينزل في الآخرة بأضعافه وآلافه { فَهُوَ } أي: الشيطان { وَلِيُّهُمُ } أي: متولي أمور هؤلاء عنهم { ٱلْيَوْمَ } لذلك لم يقبلوا قولك\n ولم يسمعوا بيانك\n بل أصروا على ما عليه أسلافهم من الغواية والضلالة { وَلَهُمْ } أيضاً مثل أسلافهم\n بل أشد منهم { عَذَابٌ } في النشأة الأولى والأخرى { أَلِيمٌ } [النحل: 63] مؤلم أشد إيلام\n لأن بيانك وتبليغك أكمل من بيان سائر الأنبياء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:97",
      "similarity": 0.7045449309177726
    },
    {
      "verse": "12:95",
      "similarity": 0.6667655699262911
    },
    {
      "verse": "16:56",
      "similarity": 0.5725777498494323
    },
    {
      "verse": "12:91",
      "similarity": 0.5584841184858522
    },
    {
      "verse": "12:73",
      "similarity": 0.4741690006013381
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016063.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016063.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}