{
  "chapter": "النحل",
  "text": "ثم كلى من كل الثمرت فاسلكى سبل ربك ذللا يخرج منۢ بطونها شراب مختلف الونه فيه شفاء للناس ان فى ذلك لءاية لقوم يتفكرون",
  "translations": [
    {
      "translation": "Then eat from every kind of fruit and travel the paths of your Lord, which have been made easy for you to follow.' From inside them comes a drink of varying colours, containing healing for mankind. There is certainly a Sign in that for people who reflect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And suck from all fruits and flit about the unrestricted paths of their Lord. A drink of various hues comes out of their bellies which contains medicine for men. In this is a sign for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then suck the juice of every kind of fruit and keep treading the ways of your Lord which have been made easy.\" There comes forth from their bellies a drink varied in colours, wherein there is healing for men. Verily there is a sign in this for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then eat of every fruit and follow the path of your Lord submissively.\" From out of their bellies comes a drink of different color in which there is a cure for the human being. In this there is evidence (of the truth) for the people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Then eat from all kinds of fruits, and tread the ways of your Lord which are soft and easy for you”; from their bellies comes a drink of various colours, in which is health for mankind; indeed in this is a sign for people who ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, eat of all fruits, and follow the routes that your Lord made easy (for you).\" There comes forth from their bellies, a drink of varying colors, in which there is a cure for men. There is indeed a sign in that for people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then eat of all the fruits and walk in the ways of your Lord submissively. There comes forth from within it a beverage of many colours, in which there is healing for men; most surely there is a sign in this for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then eat of all manner of fruit, and follow the ways of your Lord easy to go upon.' Then comes there forth out of their bellies a drink of diverse hues wherein is healing for men. Surely in that is a sign for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then eat of all fruits, and follow the ways of thy Lord, made smooth (for thee). There cometh forth from their bellies a drink divers of hues, wherein is healing for mankind. Lo! herein is indeed a portent for people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then feed on every kind of fruit, and follow the trodden paths of your Lord.\" From its belly comes a drink with different colours which provides healing for mankind. Indeed, in this there is a sign for people who give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then eat thou of all the fruits and tread the ways of thy Lord made easy. There springeth forth from their bellies a drink varied in colours; therein is healing for mankind; verily therein is a sign for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then eat from every [kind of] fruit and follow meekly the ways of your Lord.’ There issues from its belly a juice of diverse hues, in which there is a cure for the people. There is indeed a sign in that for a people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then to eat of all the produce (of the earth), and find with skill the spacious paths of its Lord: there issues from within their bodies a drink of varying colours, wherein is healing for men: verily in this is a Sign for those who give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, eat of all fruits, and follow the ways of your Lord made easy (for you).\" There comes forth from their bellies, a drink of varying colour wherein is healing for men. Verily, in this is indeed a sign for people who think.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat every kind of fruit, and follow the easy ways of your Lord' From its belly comes forth a drink (honey) of many hues in which there is healing for people. Surely, in this there is a sign for a nation who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then eat of all the fruits, and go along the pathways of your Lord, with precision. From their bellies emerges a fluid of diverse colors, containing healing for the people. Surely in this is a sign for people who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then eat from all the fruits and follow the ways of your Lord laid down [for you].\" There emerges from their bellies a drink, varying in colors, in which there is healing for people. Indeed in that is a sign for a people who give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:69] Then eat from every [kind of] fruit, and follow, enter, the ways of your Lord, [follow] His paths in seeking pastures, [ways] made easily accessible’ (dhululan is the plural of dhalūl, and is a circumstantial qualifier referring to al-subul, ‘the ways’, in other words, [those paths] disposed for you, such that they pose no difficulty for you, even if it should be rough [terrain], and [such that] you would not lose your way when returning therefrom, even if it be far away; it [dhululan] is also said to be [a circumstantial qualifier] referring to the person of [the pronominal suffix of] fa’slukī, ‘you follow’, meaning [in this case] [follow those paths] in compliance with what is required of you). There comes forth from their bellies a drink, namely, honey, of diverse hues, wherein is a cure for mankind, from [all] ailments; it is also said [that it means that it is a cure only] for some [ailments], as indicated by the indefinite [noun] shifā’un, ‘a cure’; or [that it is a cure] for all [ailments] when supplemented with some other [remedy]; or without these [other remedies] but with the resolve (niyya) [to get better]. The Prophet (s) used to prescribe it for anyone suffering from stomach pains, as reported by the two Shaykhs [Bukhārī and Muslim]. Surely in that there is a sign for a people who reflect, upon God’s handiwork, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then eat of all fruits) from all types of fruits, (and follow the ways of your Lord, made smooth (for thee)) made tractable for you. (There cometh forth from their bellies) from the bellies of bees (a drink diverse of hues) red, yellow and white, (wherein) in honey there (is healing for mankind) from illness; it is also said that this means: there is in the Qur'an healing for mankind. (Lo! Herein) in that which I have mentioned there (is indeed a portent) a sign and lesson (for people who reflect) on what I have created.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لما عملتْ على مقتضى ما أوحيت وألهمت { يَخْرُجُ } لكم أيها المكلفون بالإيمان والمعارف { مِن بُطُونِهَا } أي: بطون البيونات { شَرَابٌ مُّخْتَلِفٌ أَلْوَانُهُ } أبيض وأسود\n وأخضر وأصفر { فِيهِ شِفَآءٌ لِلنَّاسِ } عن الأمراض البلغمية بالأصالة\n وعن غيرها بالتبعية { إِنَّ فِي ذٰلِكَ } الإلهام والوحي والخطاب على الزنبور الضعيفة بأوامر عجز عنه فحول العقلاء\n الكاملين في القوة النظرية والعلمية\n وامتثالها وصنعها على الوجه الأمور بلا فوت شيء منها { لآيَةً } أي: دليلاً واضحاً\n وبرهاناً قاطعاً لائحاً على قدرة القادر العليم\n والصانع الحكيم الذي ألهمها وأوصاها ما أوصاها { لِّقَوْمٍ يَتَفَكَّرُونَ } [النحل: 69] ويتدبرون في الأمور\n ويتعمقون فيها متدبرين في أنيتها\n كي يصلوا إلى لميتها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { ذُللاً }: حال من السبل\n أو من الضمير في { اسلكي }\n يقول الحقّ جلّ جلاله: { وأوْحَى ربك إلى النحل } أي: ألهمها\n وقذف في قلوبها ذلك\n والوحي على ثلاثة أقسام: وحْيُ إلهام\n ووحيُ منام ووحْيُ أحكام\n وقال الراغب: أصل الوحي: الإشارة السريعة\n إما بالكلام رمزًا\n وإما بصوت مجرد عن التركيب\n أو بإشارة ببعض الجوارح\n والكناية\n ويقال للكلمة الإلهية التي تُلقى إلى الأنبياء: وحي\n وذلك أضْرُبٌ إما برسول مشاهَد\n وإما بسماع كلام من غير معاينة\n كسماع موسى كلام الله\n وإما بإلقاءٍ في الروع\n وإما بإلهام\n نحو:\n[القَصَص: 7]\n وإما تسخير\n كقوله: { وأوحى ربك إلى النحل } \n أو بمنام\n كقوله صلى الله عليه وسلم:\n \" انقطع الوحي\n وبقي المبشرات رؤيا المؤمن \" \nثم بيَّن ما أوحي إليها فقال: { أنِ اتخذي } \n أو بأن اتخذي { من الجبال بيوتًا } تأوين إليها\n كالكهوف ونحوها\n { ومن الشجر } بيوتًا\n كالأجْبَاح ونحوها\n { ومما يَعرِشُون } أي: يهيئون\n أو يبنون لك الناس من الأماكن\n وإلا لم تأو إليها\n وذكرها بحرف التبعيض لأنها لا تُبنى في كل جبل\n وكل شجر\n وكل ما يعرش من كرْم أو سقف\n ولا في كل مكان منها\n وإنما سمي ما تبنيه\n لتتعسل فيه\n بيتًا تشبيهًا ببناء الإنسان لما فيه من حسن الصنعة وصحة القسْمة\n التي لا يقوى عليها حُذَّاق المهندسين إلا بآلات وأنظار دقيقة\n ولعل ذكره: للتنبيه على ذلك\n قاله البيضاوي\n قلت: وليس للنحل فعل في الحقيقة\n وإنما هو صنع العليم الحكيم في مظاهر النحل\n ثم قال لها: { ثم كُلِي من كل الثمرات } التي تشتهيها\n حلوها ومرها\n قيل: إنها ترعى من جميع النوار إلا الدفلة\n { فاسْلُكي } أي: ادخلي { سُبل ربك } طُرقه في طلب المرعى\n أو: فاسلكي راجعة إلى بيوتك\n سبلَ ربك\n لا تتوعر عليك ولا تلتبس\n وأضافها إليه لأنها خلقه وملْكه\n { ذُللاً }: مطيعة منقادة لما يراد منك\n أو اسلكي طرقَه مذللة مسخرة لكِ\n فلا تعسر عليك وإن توعرت\n ولا تضل عن العْود منها وإن بَعُدت\n قال مجاهد: لم يتوعَّر على النحل قط طريق\n { يخرجُ من بطونها شرابٌ } وهو العسل\n عَدل عن خطاب النحل إلى خطاب الناس: لأنه محل الإنعام عليهم\n والمقصود من خلق النحل وإلهامه لأجلهم\n وسماه شرابًا لأنه مما يشرب\n وظاهر الآية أن العسل يخرج من بطون النحل\n وهو ظاهر كلام سيدنا علي بن أبي طالب رضي الله عنه في تحقيره للدنيا\n قال: أشرف لباس ابن آدم فيها نفثة دود\n وأشرف شراب فيها رجيع نحلة - أو قيء نحلة-\n وأشرف لذة فيها مَبَال في مبال\n\nوجمهور الناس على أن العسل يخرج من أفواه النحل\n قاله ابن عطية\n قلت: والذي ألفيناه\n ممن يتعاطاهم\n أنه يخرج من دبرهم\n وقوله: { مختلفٌ ألوانه } أي: أبيض\n وأحمر\n وأسود\n وأصفر\n بحسب اختلاف سن النحل\n ومراعيها\n وقد يختلف طعمه ورائحته باختلاف مرعاه\n ومنه قول عائشة للنبي - عليه الصلاة والسلام -: جَرَسَتْ نَحْلُهُ العُرْفُطَ وهو نبت مُنتن الرائحة\n شُبهت رائحته برائحة المغافير\n ثم قال تعالى: { فيه شفاء للناس } إما بنفسه\n كما في الأمراض البلغمية\n أو مع غيره\n كما في سائر الأمراض\n إذ قلما ما يكون معجون إلا والعسل جزء منه\n قاله البيضاوي\n قال السيوطي: قيل: لبعضها\n كما دل عليه تنكير شفاء\n أو لكلها بضميمةٍ إلى غيره - أقول: وبدونها\n بنية - وقد أمر به صلى الله عليه وسلم من استطلق بطنه\n رواه الشيخان\n هـ\n قال ابن جزي: لأن أكثر الأدوية مستعملة من العسل كالمعاجن\n والأشربة النافعة من الأمراض\n وكان ابن عمر يتداوى به من كل شيء\n فكأنه أخذه من العموم\n وعلى ذلك يدل الحديث عن النبي صلى الله عليه وسلم: \" أن رجلاً جاء إليه فقال: أَخي يَشْتَكِي بَطْنَهُ\n فقال:\n \" اسْقِهِ عَسَلاً\n فَذَهَب ثُمَ رَجَع\n فقال: قَدْ سَقَيْتُهُ فَما نَفعَ\n قال: \" فاذْهَبْ فَاسْقِهِ عَسَلاً\n فَقَدً صَدَقَ اللهُ وَكَذَبَ بَطْنُ أَخِيكَ \" \n\n فَسَقَاهُ فشفاه الله عزّ وجلّ \"\n { إن في ذلك لآية لقوم يتفكرون } فإن من تدبر اختصاص النحل بتلك العلوم الدقيقة والأفعال العجيبة حق التدبر\n عَلِمَ\n قطعًا\n أنه لا بدّ له من قادر مدبر حكيم\n يلهمها ذلك ويحملها عليه\n وهو الحق تعالى\n الإشارة: إنما كان العسل فيه شفاء للناس لأن النحل ترعى من جميع العشب\n فتأخذ خواص منافعها\n وكذلك العارف الكامل يأخذ النصيب من كل شيء\n ويعرف الله في كل شيء\n فإذا كان بهذه المنزلة\n كان فيه شفاء للقلوب\n كل من صحبه\n بصدق ومحبة\n شفاه الله\n وكل من رآه\n بتعظيم وصدق\n أحياه الله\n وقد قالوا في صفة العارف: هو الذي يأخذ النصيب من كل شيء\n ولا يأخذ النصيب منه شيئًا\n يصفو به كدر كل شيء\n ولا يكدر صفوه شيء\n قد شغله واحد عن كل شيء\n ولم يشغله عن الواحد شيء\n\n\n إلى غير ذلك من نعوته\n وقال الورتجبي: قال أبو بكر الوراق: النحلة لَمَّا تبعت الأمر\n وسلكت سبيلها على ما أمرت به\n جعل لعابها شفاء للناس\n كذلك المؤمن\n إذا اتبع الأمر\n وحفظ السر\n وأقبل على مولاه\n جعل رؤيته وكلامه ومجالسته شفاء للخلق\n ومن نظر إليه اعتبر\n ومن سمع كلامه اتعظ\n ومن جالسه سعد\n هـ\n ثمَّ ذكر دلالة أخرى على قدرته وهي الإحياء والإماتة: { وَٱللَّهُ خَلَقَكُمْ ثُمَّ يَتَوَفَّاكُمْ وَمِنكُم مَّن يُرَدُّ إِلَىٰ أَرْذَلِ ٱلْعُمُرِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:80",
      "similarity": 0.3848127775618121
    },
    {
      "verse": "10:57",
      "similarity": 0.3812688985090725
    },
    {
      "verse": "17:82",
      "similarity": 0.3791326491490825
    },
    {
      "verse": "9:14",
      "similarity": 0.366074000136026
    },
    {
      "verse": "30:22",
      "similarity": 0.3619865556752834
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016069.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016069.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:69.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}