{
  "chapter": "النحل",
  "text": "والله انزل من السماء ماء فاحيا به الارض بعد موتها ان فى ذلك لءاية لقوم يسمعون",
  "translations": [
    {
      "translation": "Allah sends down water from the sky and by it brings the dead earth back to life. There is certainly a Sign in that for people who hear.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God sends down water from the skies and quickens the dead earth to a new birth. Here is a sign for those who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sends down water from the heaven, and thereby He instantly revives the earth after it lay dead. Verily there is a sign in it for those who have ears.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sent down water from the sky and has brought the dead earth to life. In this there is evidence (of the truth) for those who listen (carefully).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah sent down water from the sky and with it revived the earth after its death; indeed in this is a sign for people who keep ears*. (* That listen to the truth.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah sends water down from the sky, then He revives the earth with it after its death. Surely that is a sign for people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has sent down water from the cloud and therewith given life to the earth after its death; most surely there is a sign in this for a people who would listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is God who sends down out of heaven water, and therewith revives the earth after it is dead. Surely in that is a sign for a people who have ears.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sendeth down water from the sky and therewith reviveth the earth after her death. Lo! herein is indeed a portent for a folk who hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God sends down water from the sky and with it revives the earth when it is dead. There is truly a sign in this for people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath sent down from the heaven water, then he reviveth the earth thereby after the death thereof; verily therein is a sign for a people who hearken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sends down water from the sky with which He revives the earth after its death. There is indeed a sign in that for a people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah sends down rain from the skies, and gives therewith life to the earth after its death: verily in this is a Sign for those who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah sends down water (rain) from the sky, then He revives the earth therewith after its death. Verily, in this is a sign (clear proof) for people who listen (obey Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sends down water from the sky with which He revives the earth after its death. Surely, in this there is a sign for people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God sends down water from the sky, with which He revives the earth after its death. In this is a sign for people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has sent down rain from the sky and given life thereby to the earth after its lifelessness. Indeed in that is a sign for a people who listen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:65] And God sends down water from the heaven and therewith revives the earth, with plants, after its death, [after] its drying up. Surely in that, which is mentioned, there is a sign, indicating the [truth of the] Resurrection, for a people who listen, listening and then reflecting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah sendeth down water) rain (from the sky and therewith reviveth the earth after her death!) after being dry and affected by drought (Lo! Herein) in the revival of that which I have mentioned (is indeed a portent) a sign (for a folk who hear) who obey and believe. 289\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱللَّهُ } الهادي لعباده إلى زلال توحيده { أَنْزَلَ مِنَ ٱلْسَّمَآءِ } أي: الطبيعة الهيولانية { مَآءً } أي: معارف وحقائق وعلوماً لدنية { فَأَحْيَا بِهِ ٱلأَرْضَ } أي: الطبيعة الهيلاونية { بَعْدَ مَوْتِهَآ } أي: بعدما كانت عدماً صرفاً\n فاتصفت بالعلوم الإدراكات الجزئية\n وترقت منها متدرجاً إلى أن وصلت إلى مرتبة التوحيد المسقط للإضافات مطلقاً { إِنَّ فِي ذٰلِكَ } التبيين والتذكير { لآيَةً } دلائل وشواهد دالة على توحيد الحق { لِقَوْمٍ يَسْمَعُونَ } [النحل: 65] سمع قبول وتأمل وتدبر\n\n\n{ وَإِنَّ لَكُمْ } أيضاً أيها المتأملون المتدبرون { فِي ٱلأَنْعَامِ لَعِبْرَةً } لو تعتبرون بها\n وتتفكرون فيها حق التفكر والتدبر لانكشفتم بعجائب صنعنا\n وكمال قدرتنا\n ومتانة حكمتنا\n وحيطة علمنا وإرادتنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { والله أنزل من السماء ماءً مطرًا { فأحيا بِهِ الأرض بعد موتها } أنبت فيها أنواع النبات بعد يبسها، فكانت هامدة غبْراءٍ، غير منبتة، شبيهة بالميت، فصارت، بعد إنزال المطر، مخضرة مهتزة رابية شبيهة بالحي. { إن في ذلك لآيةً لقوم يسمعون } سماع تدبر وإنصاف فإن هذه الآية ظاهرة، تُدرك بأدنى تنبيه وسماع، غير محتاجة إلى كثرة تفكر واعتبار. الإشارة: والله أنزل من سماء الغيوب ماء العلوم النافعة، فأحيا به أرض النفوس الميتة بالغفلة والجهل، فصارت مبتهجة بأنوار التوحيد وأسرار التفريد، وفي ذلك يقول الشاعر:\nثمَّ ذكر دليلاً آخر.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:63",
      "similarity": 0.548133680884471
    },
    {
      "verse": "30:19",
      "similarity": 0.4903100024381483
    },
    {
      "verse": "23:18",
      "similarity": 0.45141924276966244
    },
    {
      "verse": "57:2",
      "similarity": 0.394307637616886
    },
    {
      "verse": "9:116",
      "similarity": 0.3920550281110411
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/16:65.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/16:65.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/16:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}