{
  "chapter": "النحل",
  "text": "وان لكم فى الانعم لعبرة نسقيكم مما فى بطونه منۢ بين فرث ودم لبنا خالصا سائغا للشربين",
  "translations": [
    {
      "translation": "There is instruction for you in cattle. From the contents of their bellies, from between the dung and blood, We give you pure milk to drink, easy for drinkers to swallow.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely in cattle there is a lesson for you: We give you a drink from the extract of food in their bellies and blood-purest milk so delicious to drink;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely there is a lesson for you in the cattle: We provide you to drink out of that which is in their bellies between the faeces and the blood - pure milk - which is a palatable drink for those who take it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a lesson for you to learn concerning cattle. We provide pleasant milk for you to drink within the delicate system of their veins and arteries.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed in cattle is a lesson for you; We provide you drink from what is in their bellies – pure milk from between the excretion and the blood, palatable for the drinkers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is indeed a lesson for you in the An'am (cattle). We have made a drink for you out of what is in its belly, from between excretions and blood, pure milk; palatable to the drinkers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely there is a lesson for you in the cattle; We give you to drink of what is in their bellies-- from betwixt the feces and the blood-- pure milk, easy and agreeable to swallow for those who drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely in the cattle there is a lesson for you; We give you to drink of what is in their bellies, between filth and blood, pure milk, sweet to drinkers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! in the cattle there is a lesson for you. We give you to drink of that which is in their bellies, from betwixt the refuse and the blood, pure milk palatable to the drinkers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is also a lesson for you in cattle. From the contents of their bellies, from between the dung and blood, We give you pure milk to drink, pleasant for those who drink it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily there is for you in the cattle a lesson: We give you to drink of that which is in their bellies, from betwixt the dung and the blood: milk Pure and pleasant to swallow for the drinkers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is indeed a lesson for you in the cattle: We give you a drink pleasant to those who drink, pure milk, which is in their bellies, between [intestinal] waste and blood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily in cattle (too) will ye find an instructive sign. From what is within their bodies between excretions and blood, We produce, for your drink, milk, pure and agreeable to those who drink it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily! In the cattle, there is a lesson for you. We give you to drink of that which is in their bellies, from between excretions and blood, pure milk; palatable to the drinkers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, in the cattle there is a lesson for you. We give you to drink of that which is in their bellies, between the filth (bowels) and blood, pure milk, which is sweet to those who drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is a lesson for you in cattle: We give you a drink from their bellies, from between waste and blood, pure milk, refreshing to the drinkers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, for you in grazing livestock is a lesson. We give you drink from what is in their bellies - between excretion and blood - pure milk, palatable to drinkers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:66] And truly for you there is in the cattle a lesson, an example to learn from. We give you to drink — [this introduces] the explanation of the ‘lesson’ — of that which is in their bellies, the cattle’s [bellies], from (min indicates a new subject and is semantically connected to nusqīkum, ‘We give you to drink’) between the refuse, the intestinal waste, and the blood, pure milk, uncontaminated by either the refuse or the blood, neither in its taste, odour or colour, even though it [the milk] is [situated] between the two, palatable to drinkers, easily passing down their throats, not causing any choking.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! in the cattle there is a lesson for you. We give you to drink of that which is in their bellies, from betwixt the refuse and the blood), We extract (pure milk palatable to the drinkers) savoury to the drinkers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { نُّسْقِيكُمْ } ونُشربكم { مِّمَّا فِي بُطُونِهِ } أي: مما في بطون بعض الأنعام مستخرجاً { مِن بَيْنِ فَرْثٍ } أي: أخلاط وفضلات مستقرة في كرشها { وَدَمٍ } نجس سائل\n سارٍ في العروق والشرايين { لَّبَناً } طاهراً { خَالِصاً } صافياً عن كدورات كلا الطرفين\n بحيث لا يشوبه شيء منهما\n لا من لون الدم\n ولا من ريح الفرث { سَآئِغاً } سهل المرور والانحدار\n هنيئاً مرئياً { لِلشَّارِبِينَ } [النحل: 66] بلا تسعر لهم في شربه ولا كلفة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: سقى وأسقى: لغتان، على المشهور\n والضمير في { بطونه }: للأنعام، وذكِّره باعتبار ما ذكر، كقوله:\n\n[عَبَسَ: 11، 12]، أو: باعتبار الجنس، وعَدَّه سيبويه في المفردات المبنية على: أفعال، كأخلاق وأكباش، فهو، عنده، اسم جمع، كقوم ورهط، فلفظه مفرد ومعناه جمع، فذكَّره هنا مراعاة للفظه، وأنثه، في سورة المؤمنين مراعاة لمعناه\n ومن قال: إنه جمع \" نعَم \" ، جعل الضمير للبعض فإن اللبن لبعضها دون جميعها\n و { من } في قوله: \" مما \" للتبعيض، و { من بين فرث } لابتداء الغاية، و { من ثمرات }: يتعلق بمحذوف، أي: ونسقيكم من ثمرات النخيل، يدل عليه { نُسقيكم } الأول",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:17",
      "similarity": 0.18073098609096433
    },
    {
      "verse": "47:15",
      "similarity": 0.1749069003646819
    },
    {
      "verse": "23:21",
      "similarity": 0.1665864022260758
    },
    {
      "verse": "35:12",
      "similarity": 0.14243160039723243
    },
    {
      "verse": "79:26",
      "similarity": 0.09664015576778556
    }
  ]
}