{
  "chapter": "النحل",
  "text": "واوحى ربك الى النحل ان اتخذى من الجبال بيوتا ومن الشجر ومما يعرشون",
  "translations": [
    {
      "translation": "Your Lord revealed to the bees: 'Build dwellings in the mountains and the trees, and also in the structures which men erect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord predisposed the bees to make their hives in mountains, trees and trellices,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord inspired the bee, saying: \"Set up hives in the mountains and in the trees and in the trellises that people put up,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord inspired the bees, \"Make hives in the mountains, in the trees and in the trellises,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord inspired the bee that, “Build homes in hills, and in trees, and in rooftops.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord inspired the bee, saying: \"Take you habitations in the mountains and in the trees and in what they (humans) erect.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord revealed to the bee saying: Make hives in the mountains and in the trees and in what they build:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord revealed unto the bees, saying: 'Take unto yourselves, of the mountains, houses, and of the trees, and of what they are building.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord inspired the bee, saying: Choose thou habitations in the hills and in the trees and in that which they thatch;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord inspired the bee, saying, \"Make your homes in the mountains, in the trees, and also in the structures which men erect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord inspired the bee saying: take thou for thyself of the mountains houses and of the trees and of that which they erect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord inspired the bee [saying]: ‘Make your home in the mountains, and on the trees and the trellises that they erect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord taught the Bee to build its cells in hills, on trees, and in (men's) habitations;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord inspired the bee, saying: \"Take you habitations in the mountains and in the trees and in what they erect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord revealed to the bee: 'Build your homes in the mountains, in the trees, and in what they are building.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord inspired the bee: “Set up hives in the mountains, and in the trees, and in what they construct.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord inspired to the bee, \"Take for yourself among the mountains, houses, and among the trees and [in] that which they construct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:68] And your Lord revealed to the bee, a revealing [effected] through inspiration, [saying] (an, ‘that’, is either explicative or relates to the verbal noun): ‘Choose among the hills habitations, to which you can resort, and among the trees, [also] habitations, and among the trellises which they raise, that is, the places which humans build for you — for otherwise it [the bee] would not resort to these [places].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thy Lord inspired the bee, saying: Choose thou habitations in the hills and in the trees and in that which they thatch) and in that which they build;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَوْحَىٰ رَبُّكَ إِلَىٰ ٱلنَّحْلِ } أي ألْهَمَها إِلهَاماً ولَم يُرسِلْ إِليها رَسولاً\n\n\n\n\nوقوله تعالى: { وَمِمَّا يَعْرِشُونَ } معناه يَجعَلُونهُ عَرْشاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من عجائب المبدعات، وغرائب المخترعات التي يجب العبرة الاعتبار عنها: { أَوْحَىٰ } وألهم { رَبُّكَ } يا أكمل الرسل { إِلَىٰ ٱلنَّحْلِ } الضعيف المنحول المستحقر إظهاراً لكمال قدرته وحكمته { أَنِ ٱتَّخِذِي } أي: بأن اتخذي - أنثها باعتبار المعنى، وإن كان لفظ النحل مذكراً - { مِنَ } شقوق { ٱلْجِبَالِ بُيُوتاً } تأوين إليها { وَ } كذا { مِنَ } شقوق { ٱلشَّجَرِ } في الآجام { وَ } كذا { مِمَّا يَعْرِشُونَ } [النحل: 68] ويبنون لك من الأبنية والأماكن، واصنعي فيها بالهام الله إياك بيوتات من الشمعة المتخذة من أنواع الأزهار والنباتات التي لا علم لنا بتعيينها وإحصائها كلها مسدسات، متساويات الأضلاع والزوايا، بحيث لا تفاوت بين أضلاعها وزواياها أصلاً، بحيث عجز عن تصويرها حذّاق المهندسين، فيكف عن تحقيقها وكنهها، تاهت في بيداء ألوهيته أنظار العقل وآراؤه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أن اتخذي }: مفسرة للوحي الذي أوحي إلى النحل، أو مصدرية، أي: بأن اتخذي\n و { من }: للتبعيض في الثلاثة مواضع، { ثم كُلِي }: عطف على { اتخذي }\n و { من }: للتبعيض لأنها لا تأكل من جميع الشجر، وقيل: من كل الثمرات التي تشتهيها، فتكون للبيان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:4",
      "similarity": 0.7367789376545653
    },
    {
      "verse": "22:18",
      "similarity": 0.13029146022585777
    },
    {
      "verse": "56:72",
      "similarity": 0.10655745477736496
    },
    {
      "verse": "55:6",
      "similarity": 0.10167186039750994
    },
    {
      "verse": "16:10",
      "similarity": 0.0985129345556457
    }
  ]
}