{
  "chapter": "النحل",
  "text": "والله فضل بعضكم على بعض فى الرزق فما الذين فضلوا۟ برادى رزقهم على ما ملكت ايمنهم فهم فيه سواء افبنعمة الله يجحدون",
  "translations": [
    {
      "translation": "Allah has favoured some of you over others in provision, but those who have been favoured do not give their provision to their slaves so they become the same in respect of it. So why do they renounce the blessings of Allah?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has favoured some of you over others in the means of subsistence. But those who have been favoured with more do not give of their means to their dependents so that they may become equal with them. Do they then deny God's beneficence?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has favoured some of you with more worldly provisions than others. Then those who are more favoured do not give away their provisions to their slaves lest they become equal sharers in it. Do they, then, deny the favour of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made some of you richer than others. The rich ones do not have to give away their property to their slaves to make them equally rich. Do they reject the bounties of God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has made some among you superior above others in livelihood; so those to whom the superiority is given, will not return their livelihood to their slaves, so they may all become equal in this respect; so do they deny the favours of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah honored some of you over others with wealth and properties. Then, those who are so honored will by no means hand over their wealth and properties to those (captives of war) whom their right hands possess, so that they may be equal with them in that. Do they then deny the favor of Allah\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has made some of you excel others in the means of subsistence, so those who are made to excel do not give away their sustenance to those whom their right hands possess so that they should be equal therein; is it then the favor of Allah which they deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God has preferred some of you over others in provision;, but those that were preferred shall not give over their provision to that their right hands possess, so that they may be equal therein. What, and do they deny God's blessing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath favoured some of you above others in provision. Now those who are more favoured will by no means hand over their provision to those (slaves) whom their right hands possess, so that they may be equal with them in respect thereof. Is it then the grace of Allah that they deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has given some of you more provision than others. Those who have been given more are unwilling to pass their provision to the servants they possess so that they become their equals. Will they then deny the favour of God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath preferred some of you over some other in provision; then those who are preferred are not going to hand over their provision to those whom their right hands possess as to be equal in respect thereof. Gainsay they then the favour of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has granted some of you an advantage over others in [respect of] provision. Those who have been granted an advantage do not give over their provision to their slaves so that they become equal in its respect. What, do they deny the blessing of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has bestowed His gifts of sustenance more freely on some of you than on others: those more favoured are not going to throw back their gifts to those whom their right hands possess, so as to be equal in that respect. Will they then deny the favours of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has preferred some of you above others in wealth and properties. Then, those who are preferred will by no means hand over their wealth and properties to those (slaves) whom their right hands possess, so that they may be equal with them in respect thereof. Do they then deny the Favour of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In your provisions Allah has preferred some of you above others. But, those who have been preferred do not give their provisions to those whom their right hand possess so that they might be equal therein. What, do they vainly disbelieve the favor of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has favored some of you over others in livelihood. Those who are favored would not give their properties to their servants, to the extent of making them partners in it. Will they then renounce God’s blessings?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has favored some of you over others in provision. But those who were favored would not hand over their provision to those whom their right hands possess so they would be equal to them therein. Then is it the favor of Allah they reject?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:71] And God has favoured some of you above others in [respect of] provision, thus, some of you are poor, some are rich, some owners, others are owned. Now those who have been [more] favoured, namely, the masters, would not hand over their provision to those [slaves] whom their right hands possess, that is, they would not assign that wealth and other things which We have given them as something to be shared [equally] between them and their slaves, so that they, that is, the slaves and [their] masters, become equal, partners, in respect thereof. The meaning is: they do not have partners from among their slaves in respect of their wealth, so how can they make certain of God’s servants partners of His? Is it then the grace of God that they deny?, [that] they reject, when they ascribe partners to Him?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Allah hath favoured some of you above others in provision) this verse was revealed about the delegation of Najran who claimed that Jesus was the son of Allah. So Allah revealed this verse to tell people that He has favoured some people to the exclusion of others in relation to the possession of wealth and servants. (Now those who are more favoured) with wealth and servants (will by no means hand over their provision to those (slaves) whom their right hands possess, so that they) i.e. the master and the slave (may be equal with them in respect thereof) about wealth. They said: \"We will not do so nor are we happy about this\", and so Allah said: (Is it then the grace of Allah that they deny?) Do you like for Me what you do not like for yourselves, and thus deny the Oneness of Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { فَهُمْ } أي: المماليك والموالي { فِيهِ } أي: في تقدير الرزق وقسمته { سَوَآءٌ } أي: كما قدّر للمُلاََك قدَّر للماليك أيضاً\n غاية ما في الباب: إن الرزق المقدر للمماليك إنما يصل إليهم من يد المولي { أَفَبِنِعْمَةِ ٱللَّهِ يَجْحَدُونَ } [النحل: 71] ينكرون ويكفرون بإسناد أرزاق المماليك إلى الموالي\n لا إلى الله الرزاق لجميع العباد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { والله فضَّل بعضكم على بعض في الرزق } ، فمنكم غني ومنكم فقير، ومنكم ملوك مستغنون عن غيرهم، ومنكم مماليك محتاجون إلى غيرهم، { فما الذين فُضِّلوا } وهم الموالي، أي: السادات، { برادِّي رِزقهم }: بمعطي رزقهم { على ما ملكتْ أيمانُهم }: على مماليكهم، أي: ليس الموالي بجاعلي ما رزقناهم من الأموال وغيرها، شركة بينهم وبين مماليكهم، { فهُم } أي: المماليك { فيه سواءٌ } مع ساداتهم. وهو احتجاج على وحدانيته تعالى، وإنكارٌ ورد على المشركين، فكأنه يقول: أنتم لا تسَوّون بين أنفسكم وبين مماليككم في الزرق، ولا تجعلونهم شركاء لكم، بل تأنفون من ذلك، فكيف تجعلون عبيدي شركاء لي في ألوهيتي؟! وهذا كقوله:\n[الرُّوم: 28]. ويحتمل أن يكون ذمًا وعتابًا لمن لا يحسن إلى مملوكه، حتى يرد ما رزقه الله عليه، كما في الحديث:\n \" أطعموهم مما تأكلون، وألبسوهم مما تلبسون \". \n{ أفبنعمة الله يجحدون } ، حيث يجعلون له شركاء، فإنه يقتضي أن يضاف إليهم بعض ما أنعم الله عليهم، ويجحدوا أنه من عند الله، أو حيث أنكروا هذه الحجج، بعد ما أنعم الله عليهم بإيضاحها، أو حيث بخسوا مماليكهم مما يجب لهم من الإنفاق. على التفسير الثاني. الإشارة: والله فضَّل بعضكم على بعض في أرزاق العلوم، والأسرار والمواهب، فمنكم غني بالله، ومنكم فقير منه في قلبه، ومنكم عالم به ومنكم جاهل، ومنكم قوي اليقين ومنكم ضعيف، فما الذين فُضِّلوا بالعلوم اللدنية والأسرار الربانية برادِّي تلك العلوم على الجهلة وضعفاء اليقين، بأن يُطلعوهم على أسرار الربوبية قبل استحقاقها - فإن ذلك بخس بحقها - حتى يرونهم أهلاً لها بأن يبذلوا لهم أنفسهم وأموالهم، ويملكون لهم رقابهم يتصرفون فيها تصرف المالك في مملوكه، فحينئذ يشاركونهم فيما منحهم الله من أرزاق العلوم وأسرار الفهوم، وقد قيل: لا تؤتوا الحكمة غير أهلها فتظلموها، ولا تمنعوها أهلها فتظلموهم. وفي هذا المعنى يقول الشاعر:\nثمَّ ذكرهم بالنعم التي لا قدرة لأحد عليها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:47",
      "similarity": 0.5891103480868545
    },
    {
      "verse": "29:49",
      "similarity": 0.5555558937144693
    },
    {
      "verse": "40:63",
      "similarity": 0.5532635355427779
    },
    {
      "verse": "6:33",
      "similarity": 0.5488122770246755
    },
    {
      "verse": "41:28",
      "similarity": 0.5257313816081502
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/16:71.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/16:71.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/16:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}