{
  "chapter": "النحل",
  "text": "الم يروا۟ الى الطير مسخرت فى جو السماء ما يمسكهن الا الله ان فى ذلك لءايت لقوم يؤمنون",
  "translations": [
    {
      "translation": "Do they not see the birds suspended in mid-air up in the sky? Nothing holds them there except Allah. There are certainly Signs in that for people who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see the birds held high between the heavens and the earth? Nothing holds them (aloft) but God. There are verily signs in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they never noticed the birds how they are held under control in the middle of the sky, where none holds them (from falling) except Allah? Surely there are signs in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered the free movements of the birds high in the sky above? What keeps them aloft except God? In this there is evidence (of the truth) for the believing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the birds, subservient in the open skies? No one holds them up except Allah; indeed in this are signs for the people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see the birds held (flying) in the midst of the sky None holds them up but Allah. Verily, in this are clear signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see the birds, constrained in the middle of the sky? None withholds them but Allah; most surely there are signs in this for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded the birds, that are subjected in the air of heaven? Naught holds them but God; surely in that are signs for' a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the birds obedient in mid-air? None holdeth them save Allah. Lo! herein, verily, are portents for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see the birds held poised in the vault of heaven? Nothing holds them up except God. Truly, there are signs in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold they not the birds subjected in the firmament of the heaven? Naught supporteth them save Allah; verily therein are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded the birds disposed in the air of the sky: no one sustains them except Allah. There are indeed signs in that for a people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not look at the birds, held poised in the midst of (the air and) the sky? Nothing holds them up but (the power of) Allah. Verily in this are signs for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see the birds held (flying) in the midst of the sky? None holds them but Allah [none gave them the ability to fly but Allah]. Verily, in this are clear proofs and signs for people who believe (in the Oneness of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the birds that are subjected in the air of the heaven? Nothing holds them except Allah. Surely, in this are signs for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the birds, flying in the midst of the sky? None sustains them except God. In this are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see the birds controlled in the atmosphere of the sky? None holds them up except Allah. Indeed in that are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:79] Have they not observed the birds [how they are] made subservient, disposed to [be able to] fly, in the air of heaven?, that is, in the air between the heaven and the earth. Nothing holds them, when they draw in their wings or open them, lest they fall, except God, by His power. Indeed in that there are signs for a people who believe, [the signs] which are that they have been created in a way that enables them to fly, as well as the creation of the air in such a way that it allows for flight, and the holding of them [up in the air so that they do not fall].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nموقع هذه الجملة موقع التّعليل والتّدليل على عظيم قدرة الله وبديع صنعه وعلى لطفه بالمخلوقات ، فإنه لما ذكر موهبة العقل والحواس التي بها تحصيل المنافع ودفع الأضرار نبّه الناس إلى لطف يشاهدونه أجلَى مشاهدةً لأضعف الحيوان ، بأن تسخير الجوّ للطير وخلْقَها صالحة لأن ترفرف فيه بدون تعليم هو لطف بها اقتضاه ضعف بنيّاتها ، إذ كانت عادمة وسائل الدفاع عن حياتها ، فجعل الله لها سرعة الانتقال مع الابتعاد عن تناول ما يعدو عليها من البشر والدوابّ .فلأجل هذا الموقع لم تعطف الجملة على التي قبلها لأنها ليس في مضمونها نعمةٌ على البشر ، ولكنها آية على قدرة الله تعالى وعلمه ، بخلاف نظيرتها في سورة المُلك ( 19 ) { أو لم يروا إلى الطير فوقهم صافّات } فإنها عُطفت على آيات دالّة على قدرة الله تعالى من قوله : { ولقد زيّنا السماء الدنيا بمصابيح } \\[ الملك : 5 \\] ، ثم قال : { وللذين كفروا بربّهم عذاب جهنّم وبئس المصير } \\[ الملك : 6 \\] ثم قال : { أأمنتم من السماء أن يخسف بكم الأرض } \\[ سورة الملك : 16 \\] ثم قال : أو لم يروا إلى الطير الآية . ولذلك المعنى عقبت هذه وحدها بجملة إن في ذلك لآيات لقوم يؤمنون .والتّسخير : التّذليل للعمل . وقد تقدّم عند قوله تعالى : { والشمس والقمر والنجوم مسخّرات بأمره } في سورة الأعراف ( 54 ).والجوّ : الفضاء الذي بين الأرض والسماء ، وإضافته إلى السماء لأنه يبدو متّصلاً بالقبّة الزرقاء في ما يخال النّاظر .والإمساك : الشدّ عن التفّلّت . وتقدم في قوله تعالى : { فإمساك بمعروف } في سورة البقرة ( 229 ).والمراد هنا : ما يمسكهنّ عن السقوط إلى الأرض من دون إرادتها ، وإمساك الله إيّاها خلقه الأجنحة لها والأذنَاب ، وجعله الأجنحة والأذناب قابلة للبسط ، وخلق عظامها أخفّ من عظام الدوابّ بحيث إذا بسطت أجنحتها وأذنابها ونهضت بأعصابها خفّتْ خفّة شديدة فسبحت في الهواء فلا يصلح ثقلها لأن يخرق ما تحتها من الهواء إلا إذا قبضت من أجنحتها وأذنابها وقوّست أعصاب أصلابها عند إرادتها النّزول إلى الأرض أو الانخفاضَ في الهواء . فهي تحوم في الهواء كيف شاءت ثم تقع متى شاءت أو عييت . فلولا أن الله خلقها على تلك الحالة لما استمسكت ، فسُمّي ذلك إمساكاً على وجه الاستعارة ، وهو لطف بها .والرؤية : بصرية . وفعلها يتعدّى بنفسه ، فتعديته بحرف إلى لتضمين الفعل معنى ( ينظروا ).ومسخرات } حال . وجملة { ما يمسكهن إلا الله } حال ثانية .وقرأ الجمهور { ألم يروا } بياء الغائب على طريقة الالتفات عن خطاب المشركين في قوله تعالى : { والله أخرجكم من بطون أمهاتكم } \\[ سورة النحل : 78 \\].وقرأ ابن عامر وحمزة ويعقوب وخلف { ألم تَرَوْا } بتاء الخطاب تبعاً للخطاب المذكور .والاستفهام إنكاري . معناه : إنكار انتفاء رؤيتهم الطير مسخّرات في الجوّ بتنزيل رؤيتهم إيّاها منزلة عدم الرؤية ، لانعدام فائدة الرؤية من إدراك ما يدلّ عليه المرئيّ من انفراد الله تعالى بالإلهية .وجملة { إن في ذلك لآيات لقوم يؤمنون } مستأنفة استئنافاً بيانياً ، لأن الإنكار على المشركين عدم الانتفاع بما يرونه من الدلائل يثير سؤالاً في نفس السامع : أكان عدم الانتفاع بدلالة رؤية الطير عاماً في البشر ، فيجاب بأن المؤمنين يستدلّون من ذلك بدلالات كثيرة .والتأكيد ب { إنّ } مناسب لاستفهام الإنكار على الذين لم يروا تلك الآيات ، فأكّدت الجملة الدّالة على انتفاع المؤمنين بتلك الدّلالة ، لأن الكلام موجّه للذين لم يهتدوا بتلك الدّلالة ، فهم بمنزلة من ينكر أن في ذلك دلالة للمؤمنين لأن المشركين ينظرون بمرآة أنفسهم .وبين الإنكار عليهم عدم رؤيتهم تسخير الطير وبين إثبات رؤية المؤمنين لذلك محسّن الطباق . وبين نفي عدم رؤية المشركين وتأكيد إثبات رؤية المؤمنين لذلك محسّن الطباق أيضاً . وبين ضمير { يروا } وقوله : «قوم يؤمنون» التضادّ أيضاً ، فحصل الطباق ثلاث مرّات . وهذا أبلغ طباق جاء محوياً للبيان .وجمع الآيات لأن في الطير دلائل مختلفة : من خلقة الهواء ، وخلقة أجساد الطير مناسبة للطيران في الهواء ، وخلق الإلهام للطير بأن يسبح في الجو ، وبأن لا يسقط إلى الأرض إلا بإرادته . وخصّت الآيات بالمؤمنين لأنهم بخلُق الإيمان قد ألفوا إعمال تفكيرهم في الاستدلال على حقائق الأشياء ، بخلاف أهل الكفر فإن خلق الكفر مطبوع على النفرة من الاقتداء بالنّاصحين وعلى مكابرة الحقّ .\n\n",
      "translations": [
        {
          "translation": "(Have you not seen) people of Mecca, so that you realise Allah's power and divine Oneness (the birds obedient) subservient (in mid-air) flying between the sky and earth? (None holdeth them save Allah) after they fly. (Lo! Herein) in holding in mid-air, (verily, are portents) signs for Allah's divine Oneness (for a people who believe) that they are held in mid-air by Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي جَوِّ ٱلسَّمَآءِ } يعني فِي الهَواءِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in the heaven's} means in the air.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ألم يروا إلى الطير } القوى الروحانية والنفسانية من الفكر والعقل النظري والعملي\n بل الوهم والتخيّل { مسخرات في جوّ السماء } أي: فضاء عالم الأرواح { ما يمسكهنّ } من غير تعلق بمادة ولا اعتماد على جسم ثقيل { إلا الله }\n { يعرفون نعمة الله } أي: هداية النبي أو وجوده لما ذكرنا أنّ كل نبيّ يبعث على كمال يناسب استعدادات أمّته ويجانسهم بفطرته\n فيعرفونه بقوّة فطرتهم { ثم ينكرونها } لعنادهم وتعنتهم بسبب غلبة صفات نفوسهم من الكبر والأنفة وحبّ الرياسة أو لكفرهم واحتجابهم عن نور الفطرة بالهيئات الغاسقة الظلمانية وتغير الاستعداد الأول { وأكثرهم الكافرون } في إنكاره لشهادة فطرهم بحقيته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مسخرات }: حال من { الطير } ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:19",
      "similarity": 0.1285949306460688
    },
    {
      "verse": "22:65",
      "similarity": 0.11874784797951944
    },
    {
      "verse": "24:41",
      "similarity": 0.08411527819592689
    },
    {
      "verse": "39:38",
      "similarity": 0.07775517594242887
    },
    {
      "verse": "39:42",
      "similarity": 0.07660361771828089
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016079.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016079.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:79.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}