{
  "chapter": "النحل",
  "text": "ولله غيب السموت والارض وما امر الساعة الا كلمح البصر او هو اقرب ان الله على كل شىء قدير",
  "translations": [
    {
      "translation": "The Unseen of the heavens and earth belongs to Allah. The matter of the Hour is only the blink of an eye away, or even nearer. Allah has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the secrets of the heavens and the earth, and the Hour of Doom is a matter of the winking of an eye, even less, for God has certainly power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has full knowledge of the truths beyond the reach of perception both in the heavens and the earth; and the coming of the Hour will take no more than the twinkling of an eye; it may take even less. Indeed Allah has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all the secrets of the heavens and the earth. It only takes God a twinkling of an eye or even less to make it the Day of Judgment. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for Allah only are the hidden things of the heavens and the earth, and the matter of Resurrection is not but like the batting of an eyelid – in fact closer than this; indeed Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the Unseen of the heavens and the earth. And the matter of the Hour is not but as a twinkling of the eye, or even nearer. Truly, Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the unseen of the heavens and the earth; and the matter of the hour is but as the twinkling of an eye or it is higher still; surely Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the Unseen in the heavens and in the earth. And the matter of the Hour is as a twinkling of the eye, or nearer. Surely God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Allah belongeth the Unseen of the heavens and the earth, and the matter of the Hour (of Doom) is but as a twinkling of the eye, or it is nearer still. Lo! Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God alone has knowledge of the hidden reality of the heavens and the earth; and the coming of the Hour [of Judgement] is like the twinkling of an eye, or even quicker. Surely God has full power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the Unseen of the heavens and the earth, and the affair of the Hour will be not but as a flash of the eye, or it is even nearer, verily Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the Unseen of the heavens and the earth. The matter of the Hour is just like the twinkling of an eye, or [even] swifter. Indeed Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongeth the Mystery of the heavens and the earth. And the Decision of the Hour (of Judgment) is as the twingkling of an eye, or even quicker: for Allah hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the unseen of the heavens and the earth. And the matter of the Hour is not but as a twinkling of the eye, or even nearer. Truly! Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the unseen of the heavens and the earth. The matter of the Final Hour shall be like the twinkling of an eye, or even less. Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the unseen of the heavens and the earth. The coming of the Hour is only as the twinkling of the eye, or even nearer. God has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the unseen [aspects] of the heavens and the earth. And the command for the Hour is not but as a glance of the eye or even nearer. Indeed, Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:77] And to God belongs the Unseen of the heavens and the earth, in other words, the knowledge of what is hidden in them. And the matter of the Hour is but as the twinkling of an eye, or it is [even] nearer, since it takes place as a result of the words, ‘Be’ and it is (kun fa-yakūn). Truly God has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Unto Allah belongeth the Unseen of the heavens and the earth) that which is hidden from the servants, (and the matter of the Hour (of Doom)) in its swiftness (is but as a twinkling of the eye, or it is nearer still. Lo! Allah is Able to do all things) the Resurrection as well as other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولله غيبُ السموات والأرض } أي: ولله علم الذي خفي في السموات والأرض من أمر القيامة الكبرى\n أو علم مراتب الغيوب السبعة التي أشرنا إليه من غيب الجنّ والنفس والقلب والسرّ والروح والخفي وغيب الغيوب أو ما غاب من حقيقتهما أي: ملكوت عالم الأرواح وعالم الأجساد { وما أمر } القيامة الكبرى بالقياس إلى الأمور الزمانية { إلاّ } كأقرب زمان يعبر عنه مثل لمح البصر { أو هو أقرب } وهو بناء على التمثيل وإلا فأمر الساعة ليس بزماني وما ليس بزماني يدركه من يدركه لا في الزمان { إن الله على كل شيء قدير } يقدر على الإماتة والإحياء والحساب لا في زمان كما يشاهد أهله وخاصته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَلِلَّهِ } خاصةً واستقلالاً { غَيْبُ ٱلسَّمَٰوَٰتِ } أي: ما فيها من جنود الله ومخلوقاته { وَ } غيب { ٱلأَرْضِ } أي: ما عليها أيضاً من جنوده\n لا اطلاع لأحدٍ منَّا عليها { وَمَآ أَمْرُ ٱلسَّاعَةِ } الموعودة\n وقصة وقوعها وقيامها بالنسبة إلى قبضة قدرته { إِلاَّ كَلَمْحِ ٱلْبَصَرِ } أي: كرجع الطرف من أعلى الحدقة إلى أسفلها في القرب والدنوّ { أَوْ هُوَ أَقْرَبُ } أي: بل هو أقرب من رجع الطرف\n إذ الآن فيه متحقق في سرعة نفوذ فضاء الله بعد تعلق إرادته\n الآن موهوم مخيل\n إلا تراخي بين الأمر الألهي ووقوع المأمور المراد له إلاَّ وهماً على ما مر في تفسير قوله سبحانه: { كُنْ فَيَكُونُ } [البقرة: 117]\n ولا يستبعد عن الله سبحانه أمثال هذا { إِنَّ ٱللَّهَ } المتصف بجميع أوصاف الكمال { عَلَىٰ كُلِّ شَيْءٍ } داخلٍ في حيطة حضرة علمه وقدرته { قَدِيرٌ } [النحل: 77] لا ينتهي قدرته دون مقدورٍ أصلاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:50",
      "similarity": 0.9188501530385348
    },
    {
      "verse": "21:49",
      "similarity": 0.10663296175684084
    },
    {
      "verse": "33:63",
      "similarity": 0.10284975577372948
    },
    {
      "verse": "49:18",
      "similarity": 0.09934817985567894
    },
    {
      "verse": "54:1",
      "similarity": 0.09674717035472928
    }
  ]
}