{
  "chapter": "النحل",
  "text": "ويعبدون من دون الله ما لا يملك لهم رزقا من السموت والارض شيـا ولا يستطيعون",
  "translations": [
    {
      "translation": "And worship, instead of Allah, things that have no control over their provision from the heavens or earth in any way, and are themselves completely impotent?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they worship those apart from God who cannot provide for them any sustenance from the heavens or the earth, nor will they have power to do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and worship instead of Allah, those helpless beings who have no control over providing them any sustenance from the heavens and the earth; do you worship those who have no power to do anything of this sort?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they worship things other than God which neither provide them with any sustenance from the heavens and the earth nor have the ability to do so?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship such besides Allah, who do not have power to provide them any sustenance from the heavens or the earth, nor can they do anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship others besides Allah such as do not have power to grant them any provision from the heavens or the earth nor the ability to do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they serve besides Allah that which does not control for them any sustenance at all from the heavens and the earth, nor have they any power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do they serve, apart from God, that which has no power to provide them anything from the heavens and the earth and can do nothing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship beside Allah that which owneth no provision whatsoever for them from the heavens or the earth, nor have they (whom they worship) any power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship, instead of God, things that have no control over their provision from the heavens or the earth in any way, nor do they have any power [to do so].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship, beside Allah, that which owneth them not any provision from the heavens and the earth, and they cannot\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship besides Allah what has no power to provide them with anything from the heavens and the earth, nor are they capable [of anything].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And worship others than Allah,- such as have no power of providing them, for sustenance, with anything in heavens or earth, and cannot possibly have such power?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship others besides Allah, such as do not and cannot own any provision for them from the heavens or the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they worship, other than Allah, that which has no power to provide them with anything either from the heavens or earth, and can do nothing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And yet they serve besides God what possesses no provisions for them in the heavens, nor on earth, nor are they capable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship besides Allah that which does not possess for them [the power of] provision from the heavens and the earth at all, and [in fact], they are unable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:73]   And they worship besides God, that is, other than Him, what has no power to give them any [sort of] provision from the heavens, such as water, and the earth, such as plants (shay’an, ‘any[thing]’, is a substitute for rizqan, ‘provision’) nor do they have the capacity, [nor] are they able to do anything — and these are the idols.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they worship beside Allah that which owneth) that which is capable of (no provision whatsoever for them) i.e. idols (from the heavens) by means of rain (or the earth) by means of vegetation, (nor have they 290 (whom they worship) any power) to do so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وثمرة كفرانهم نعم الله أنهم { يَعْبُدُونَ مِن دُونِ ٱللَّهِ } المالك لأزمة الأمور الجارية في خلال الزمان والدهور { مَا لاَ يَمْلِكُ لَهُمْ رِزْقاً } معنوياً روحانياً فائضاً { مِّنَ ٱلسَّمَٰوَٰتِ } أي: عالم الأسماء\n والصفات على مقتضى الجود الإلهي { وَ } لا رزقاً صورياً جسمانياً معنوياً\n لاكتساب المعارف الروحانية\n مستخرجة من { ٱلأَرْضِ } أي: معالم الهيولي والطبيعة { شَيْئاً وَ } هم أيضاً { لاَ يَسْتَطِيعُونَ } [النحل: 73] لأنفسهم\n فكيف لغيرهم؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { رِزْقًا }: مفعول بيملك\n فيحتمل أن يكون مصدرًا\n أو اسمًا لما يرزق\n فإن كان مصدرًا\n فشيئًا مفعول به لأن المصدر ينصب المفعول\n وإن كان اسمًا\n فشيئًا بدل منه\n وجمع الضمير في { يستطيعون } \n وأفرده في { يمْلك } لأن { ما } مفردة لفظًا\n واقعة على الآلهة\n فراعى أولاً اللفظ\n وفي الثاني المعنى\n يقول الحقّ جلّ جلاله: { ويعبدون من دون الله } أي: غيره { ما لا يَملك لهم رزقًا من السماوات } بالمطر { والأرض } بالنبات\n فلا يرزقونهم من ذلك { شيئًا ولا يستطيعون }: لا يقدرون على شيء من ذلك لعجزهم\n وهم الأصنام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:107",
      "similarity": 0.48271214851409067
    },
    {
      "verse": "9:116",
      "similarity": 0.4518081851610566
    },
    {
      "verse": "7:197",
      "similarity": 0.43061246954196813
    },
    {
      "verse": "71:3",
      "similarity": 0.41963968308973953
    },
    {
      "verse": "48:14",
      "similarity": 0.40564527782906334
    }
  ]
}