{
  "chapter": "النحل",
  "text": "والله جعل لكم من انفسكم ازوجا وجعل لكم من ازوجكم بنين وحفدة ورزقكم من الطيبت افبالبطل يؤمنون وبنعمت الله هم يكفرون",
  "translations": [
    {
      "translation": "Allah has given you wives from among yourselves, and given you children and grandchildren from your wives, and provided good things for you. So why do they have iman in falsehood and reject the blessings of Allah,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has provided mates for you of your own kind, and has bestowed on you sons and daughters from your mates, and has given you good things for food. Will they even then believe in the false and deny God's grace?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has given you spouses from your kind, and has granted you through your spouses, sons and grandsons, and has provided you wholesome things as sustenance. (After knowing all this), do they still believe in falsehood and deny Allah's bounty,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has created spouses for you from your own selves. He has created your sons and grandsons from your spouses and has given you pure things for your sustenance. Do they then believe in falsehood and reject the bounties of God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has created for you wives of your own breed, and has given you from your wives, sons and grandsons, and has provided sustenance for you from good things; so do they believe in falsehood and deny the favours of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has made for you mates of your own kind, and has made for you, from your mates, sons and grandsons, and has granted you good provisions. Do they then believe in false deities and deny favor of Allah\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has made wives for you from among yourselves, and has given you sons and grandchildren from your wives, and has given you of the good things; is it then in the falsehood that they believe while it is in the favor of Allah that they disbelieve?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has appointed for you of yourselves wives, and He has appointed for you of your wives sons and grandsons, and He has provided you of the good things. What, do they believe in vanity, and do they disbelieve in God's blessing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath given you wives of your own kind, and hath given you, from your wives, sons and grandsons, and hath made provision of good things for you. Is it then in vanity that they believe and in the grace of Allah that they disbelieve?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has given you wives from among yourselves, and given you children and grandchildren from your wives, and provided wholesome things for you. Will they then believe in falsehood and deny God's favours?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath appointed for yourselves spouses, and from your spouses He hath appointed for you sons and grandsons, and He hath provided you with clean foods. In falsehood then believe they, and in Allah's favour disbelieve they?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made for you mates from your own selves and appointed for you children and grandchildren from your mates, and We provided you with all the good things. What, do they believe in falsehood while they deny the blessing of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has made for you mates (and companions) of your own nature, and made for you, out of them, sons and daughters and grandchildren, and provided for you sustenance of the best: will they then believe in vain things, and be ungrateful for Allah's favours?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has made for you wives of your own kind, and has made for you, from your wives, sons and grandsons, and has bestowed on you good provision. Do they then believe in false deities and deny the Favour of Allah (by not worshipping Allah Alone).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has given you wives from among yourselves, and has given you and your wives, sons and grandsons and He has provided you with good things. What, do they believe in vanity; do they disbelieve in the favor of Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has given you mates from among yourselves; and has produced for you, from your mates, children and grandchildren; and has provided you with good things. Will they then believe in falsehood, and refuse God’s favors?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has made for you from yourselves mates and has made for you from your mates sons and grandchildren and has provided for you from the good things. Then in falsehood do they believe and in the favor of Allah they disbelieve?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:72] And God made for you mates from your own selves, thus He created Eve from Adam’s rib and [created] all mankind from the seminal fluids of men and women, and made for you, from your mates, children and grandchildren, and He provided you with the good things, of [all] kinds of fruits, seeds and animals. Is it then in falsehood, [in] the idol, that they believe and in the grace of God that they disbelieve?, when they associate others [with God]?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على التي قبلها ، وهو استدلال ببديع الصنع في خلق النسل إذ جعل مقارناً للتأنّس بين الزوجين ، إذ جعل النسل منهما ولم يجعله مفارقاً لأحد الأبوين أو كليهما .وجعل النسل معروفاً متصلاً بأصوله بما ألهمه الإنسان من داعية حفظ النسب ، فهي من الآيات على انفراده تعالى بالوحدانية كما قال تعالى في سورة الروم ( 21 ) : { ومن ءاياته أن خلق لكم من أنفسكم أزواجاً لتسكنوا إليها وجعل بينكم مودّة ورحمة إن في ذلك لآيات لقوم يتفكرون } فجعلها آية تنطوي على آيات ، ويتضمّن ذلك الصنع نعماً كثيرة ، كما أشار إليه قوله تعالى : { وبنعمت الله هم يكفرون }.والقول في جملة { والله جعل لكم } كالقول في نظيرتيها المتقدمتين .واللام في { جعل لكم } لتعدية فعل { جعل } إلى ثانٍ .ومعنى { من أنفسكم } من نوعكم ، كقوله تعالى : { فإذا دخلتم بيوتاً فسَلّموا على أنفسكم } \\[ سورة النور : 21 \\] أي على الناس الذين بالبيوت ، وقوله : { رسولا من أنفسهم } \\[ سورة آل عمران : 164 \\] وقوله : { ثم أنتم هؤلاء تقتلون أنفسكم } \\[ سورة البقرة : 85 \\].والخطاب بضمير الجماعة المخاطبين موجّه إلى الناس كلّهم ، وغلب ضمير التذكير .وهذه نعمة إذ جعل قرين الإنسان متكوّناً من نوعه ، ولو لم يجعل له ذلك لاضطُرّ الإنسان إلى طلب التأنّس بنوع آخر فلم يحصل التأنّس بذلك للزوجين . وهذه الحالة وإن كانت موجودة في أغلب أنواع الحيوان فهي نعمة يدركها الإنسان ولا يدركها غيره من الأنواع . وليس من قوام ماهيّة النّعمة أن ينفرد بها المنعم عليه .والأزواج : جمع زوج ، وهو الشيء الذي يصير مع شيء آخر اثنين ، فلذا وصف بزوج المرادف لثان . وقد مضى الكلام عليه في قوله تعالى : { اسكن أنت وزوجك الجنة } في \\[ سورة البقرة : 35 \\].والوصف بالزوج يؤذن بملازمته لآخر ، فلذا سمّي بالزوج قرين المرأة وقرينةُ الرجل . وهذه نعمة اختصّ بها الإنسان إذ ألهمه الله جعل قرين له وجبله على نظام محبّة وغيرة لا يسمَحان له بإهمال زوجه كما تُهمل العجماوات إناثها وتنصرف إناثها عن ذكورها .و { من } الداخلة على { أنفسكم } للتّبعيض .وجعل البنين للإنسان نعمة ، وجعل كونهم من زوجة نعمة أخرى ، لأن بها تحقّق كونهم أبناءه بالنسبة للذكر ودوام اتّصالهم به بالنّسبة ، ووجود المشارك له في القيام بتدبير أمرهم في حالة ضعفهم .و { من } الداخلة على { أزواجكم } للابتداء ، أي جعل لكم بنين منحدرين من أزواجكم .والحفدة : جمع حافد ، مثل كَملة جمع كامل . والحافد أصله المسرع في الخدمة . وأطلق على ابن الابن لأنه يكثر أن يخدم جدّه لضعف الجدّ بسبب الكبر ، فأنعم الله على الإنسان بحفظ سلسلة نسبه بسبب ضبط الحلقة الأولى منها ، وهي كون أبنائه من زوجه ثم كون أبناء أبنائه من أزواجهم ، فانضبطت سلسلة الأنساب بهذا النظام المحكم البديع .وغير الإنسان من الحيوان لا يشعر بحفدته أصلاً ولا يَشعر بالبنوّة إلا أنثى الحيوان مدة قليلة قريبَة من الإرضاع . والحفدة للإنسان زيادة في مسرّة العائلة ، قال تعالى : { فبشرّناها بإسحاق ومن وراء إسحاق يعقوب } \\[ سورة هود : 71 \\]. وقد عملت { من } الابتدائية في { حفدة } بواسطة حرف العطف لأن الابتداء يكون مباشرة وبواسطة .وجملة { ورزقكم من الطيبات } معطوفة على جملة { جعل لكم من أنفسكم أزواجاً } وما بعدها ، لمناسبة ما في الجمل المعطوف عليها من تضمّن المنّة بنعمة أفراد العائلة ، فإن من مكمّلاتها سعة الرزق ، كما قال تعالى في آل عمران { زيّن للناس حبّ الشّهوات من النساء والبنين والقناطير المقنطرة من الذهب والفضة } \\[ سورة النحل : 14 \\] الآية . وقال طرفة :فأصبحت ذا مال كثير وطاف بي ... بنون كرام سادة لمسودفالمال والعائلة لا يروق أحدها بدون الآخر .ثم الرزق يجوز أن يكون مراداً منه المال كما في قوله تعالى في قصة قارون : { وأصبح الذين تمنّوا مكانه بالأمس يقولون ويكأنّ الله يبسط الرزق لمن يشاء من عباده ويقدر } \\[ سورة القصص : 82 \\]. وهذا هو الظاهر وهو الموافق لما في الآية المذكورة آنفاً . ويجوز أن يكون المراد منه إعطاء المأكولات الطيّبة ، كما في قوله تعالى : { وجد عندها رزقاً } \\[ سورة آل عمران : 37 \\] و { من } تبعيضية .و { الطيبات } : صفة لموصوف محذوف دلّ عليه فعل رزقكم ، أي الأرزاق الطيّبات . والتأنيث لأجل الجمع . والطيّب : فَيْعِللٍ صفة مبالغة في الوصف بالطّيِب . والطِيبُ : أصله النزاهة وحسن الرائحة ، ثم استعمل في الملائم الخالص من النّكد ، قال تعالى : { فلنحيينه حياة طيبة } \\[ سورة النحل : 97 \\]. واستعمل في الصالح من نوعه كقوله تعالى : { والبلد الطيّب يخرج نباته بإذن ربه } في سورة الأعراف ( 58 ). ومنه قوله تعالى : { الذين تتوفّاهم الملائكة طيّبين } \\[ سورة النحل : 32 \\] وقد تقدم آنفاً .فالطيّبات هنا الأرزاق الواسعة المحبوبة للناس كما ذكر في الآية في سورة آل عمران؛ أو المطعومات والمشروبات اللذيذة الصالحة . وقد تقدم ذكر الطيّبات عند قوله تعالى : { اليوم أحل لكم الطيّبات } في سورة العقود ( 5 ) ، وذكر الطيّب في قوله تعالى : { كلوا مما في الأرض حلالاً طيّباً } في سورة البقرة ( 168 ).وفرع على هذه الحجّة والمنّة استفهامُ توبيخ على إيمانهم بالباطل البيّن ، فتفريع التوبيخ عليه واضح الاتجاه .والباطل : ضد الحقّ لأن ما لا يخلق لا يُعبد بحقّ . وتقديم المجرور في قوله تعالى : { أفبالباطل } على متعلّقه للاهتمام بالتعريف بباطلهم .والالتفات عن الخطاب السابق إلى الغيبة في قوله تعالى : { أفبالباطل } يجري الكلام فيه على نحو ما تقدم في قوله تعالى : { أفبنعمة الله يجحدون } \\[ سورة النحل : 71 \\].وقوله تعالى : { وبنعمت الله هم يكفرون } عطف على جملة التوبيخ ، وهو توبيخ متوجّه على ما تضمّنه قوله تعالى : { والله جعل لكم من أنفسكم أزواجاً } إلى قوله : { ورزقكم من الطيبات } من الامتنان بذلك الخلق والرزق بعد كونهما دليلاً على انفراد الله بالإلهية .وتقديم المجرور في قوله تعالى : { بنعمت الله هم يكفرون } على عامله للاهتمام .وضمير الغيبة في قوله تعالى : { هم يكفرون } ضمير فصل لتأكيد الحكم بكفرانهم النّعمة لأن كفران النّعمة أخفى من الإيمان بالباطل ، لأن الكفران يتعلّق بحالات القلب ، فاجتمع في هذه الجملة تأكيدان : التأكيد الذي أفاده التقديم ، والتأكيد الذي أفاده ضمير الفصل .والإتيان بالمضارع في { يؤمنون } و { يكفرون } للدّلالة على التجدّد والتّكرير .وفي الجمع بين { يؤمنون } و { يكفرون } محسنّ بديع الطباق .\n\n",
      "translations": [
        {
          "translation": "(And Allah hath given you wives of your own kind) a human being like yourselves, (and hath given you, from your wives, sons and grandsons, and hath made provision of good things for you) he made your provision softer and more wholesome that the provision of beasts. (Is it then in vanity that they believe) is it in Satan and idols that they believe (and in the grace of Allah) and in the Oneness of Allah and His religion (that they disbelieve?)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَنِينَ وَحَفَدَةً } الحَفَدةُ: الخِدّامُ والأَعوانُ ويقالُ: الأَخْتَانُ\n ويقالُ هُم بَنو المَرأةِ مِن زَوجِها الأَولِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Baniina wa hafadaatan}, Hafadatu: Khiddamu wa al-a'waanu, it is said: al-akhthaanu.\n They are called the sons of the woman from her first husband.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱللَّهُ } المدبر المصلح لأحوال عباده { جَعَلَ لَكُمْ } تفضلاً عليكم { مِّنْ أَنْفُسِكُمْ } أي: من جنسكم\n وبني نوعكم { أَزْوَاجاً } نساءاً\n تستأذنون بهن\n وتستنسلون منهم { وَجَعَلَ لَكُمْ مِّنْ أَزْوَاجِكُم بَنِينَ } ليخلفوا فيكم\n ويحيوا أسماءكم { وَ } جعل لكم من أبنائكم وبناتكم { حَفَدَةً } يسرعون إلى خدمتكم وطاعتكم { وَ } بالجملة: { رَزَقَكُم } الله تفضلاً عليكم وامتناناً { مِّنَ ٱلطَّيِّبَاتِ } العقوبة المقومة لأمزجتكم وبنيتكم\n لتواظبوا على طاعة الله\n وتداوموا الميلَ إلى جنابه\n وتلازموا شكر: نعمه { أَ } تتركون متابعة الحق الحقيق بالنعمة\n وهو القرآن المعجز\n والرسول المبين له { فَبِٱلْبَاطِلِ } الذي هو الأصنام والأوثان { يُؤْمِنُونَ } يصدقون ويعبدون { وَ } بالجملة: { بِنِعْمَتِ ٱللَّهِ } النعم المكرم بأنواع الكرم { هُمْ يَكْفُرُونَ } [النحل: 72] حيث صرفوها إلى خلاف ما أُمروا يصرفها\n إذ إعطاء النعم إياهم إنما هو لتقوية طاعة الله\n وكسب معارفه وحقائقه\n لا لعبادة الأصنام والأوثان الباطلة\n\n\n{ وَ } من خبث باطنهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الحفدة: جمع حافد، وهو الخديم المسرع في الخدمة، والحفْد في اللغة: الخدمة، ومنه في القنوت: \" وإليك نسعى ونحفد \" ، أي: نسرع في خدمتك. وسموا أولاد الأولاد حفدة لأنهم يُسرعون في خدمة جدهم، حين كبر ولزم الدار، وقيل: هم البنات لأنهن يخدمن الدار. يقول الحقّ جلّ جلاله: { والله جعل لكم من أنفسكم أزواجًا } حيث خلق حواء من ضلع آدم، وسائر النساء من نطفة الرجال، والنساء خلقهن لكم، لتتأنسوا بهن، ولتتمتعوا بهن في الحلال، وليكون أولادكم مثلكم. { وجعل لكم من أزواجكم بَنين } من صلبكم { وحفَدةً } أولاد أولادكم أو بناتكم فإن البنات يخدمن في البيوت أشد الخدمة، أو الأصهار من قِبل النساء، أو الخدَم، { ورزقكم من الطيبات } من اللذائذ والمشتهيات كأنواع الثمار والحبوب والفواكه، والحيوان أكلاً وركوبًا وزينة، أو الحلالات، و \" من \": للتبعيض فإن طيبات الدنيا أنموذج من نعيم الآخرة. { أفَبِالباطل يؤمنون } وهو أن الأصنام تنفعهم لأن الأصنام باطلة لا حقيقة لوجودها، وإضافة النفع لها: كفرٌ بنعمة الله، ولذلك قال: { وبنعمة الله هم يكفرون } حيث أضافوها إلى أصنامهم، أو حيث حَرَّموا منها ما أحله الله لهم كالبحائر والسوائب. والله تعالى أعلم. الإشارة: والله جعل لكم من أنفسكم المطهرة أصنافًا من العلوم اللدنية. قال أبو سليمان الداراني: إذا اعتقدت النفوس على ترك الآثام، جالت في الملكوت، ثم عادت إلى ذلك العبد بطرائف الحكمة، من غير أن يؤدي إليها عالم علمًا. وجعل لكم من تلك العلوم بنين روحانيين، وهو التلامذة، يحملون تلك العلوم، وحفدة: من ينقل ذلك عنهم إلى يوم القيامة، ورزقكم من الطيبات، وهي حلاوة المعرفة عند العارفين، وحلاوة الطاعات عند المجتهدين. أفبالباطل - وهو ما سوى الله - يؤمنون، فيقفون مع الوسائط والأسباب، ويغيبون عن مسبب الأسباب، وبنعمة الله - التي هي شهود الحق بلا وسائط - هم يكفرون. ثمَّ عاب على من وقف مع غير الله فقال: { وَيَعْبُدُونَ مِن دُونِ ٱللَّهِ مَا لاَ يَمْلِكُ لَهُمْ رِزْقاً... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:67",
      "similarity": 0.06969092425708003
    },
    {
      "verse": "40:64",
      "similarity": 0.06724798353171678
    },
    {
      "verse": "45:16",
      "similarity": 0.06464714063667992
    },
    {
      "verse": "16:114",
      "similarity": 0.06462848461527854
    },
    {
      "verse": "10:93",
      "similarity": 0.06098700869295784
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016072.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016072.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:72.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}