{
  "chapter": "النحل",
  "text": "ضرب الله مثلا عبدا مملوكا لا يقدر على شىء ومن رزقنه منا رزقا حسنا فهو ينفق منه سرا وجهرا هل يستون الحمد لله بل اكثرهم لا يعلمون",
  "translations": [
    {
      "translation": "Allah does make a metaphor: an owned slave possessing no power over anything, and someone We have given plentiful provision who gives out from it secretly and openly. Are they the same? Praise be to Allah! They are not! But most people do not know it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God presents the example of a man who is a hired servant with no power over anything, and another on whom We have bestowed a handsome fortune, who spends from it in private and in public: Can they be equal? Praised be God! But most men do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sets forth a parable: There is one who is a slave and is owned by another and has no power over anything; and there is one whom We have granted good provision Ourselves, of which he spends both secretly and openly. Can they be equal? All praise be to Allah. But most of them do not even know (this simple fact).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God tells a parable about a helpless servant and one to whom He has given honorable provisions and who has spent for the cause of God privately and in public. Can these two people be considered equal? It is only God who deserves all praise, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has illustrated an example – there is a slave, himself the property of another, not owning anything – and another one upon whom We have bestowed a good livelihood from Us, he therefore spends from it, secretly and publicly; will they be equal? All praise is to Allah; in fact, most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah gives the example of a servant under the possession of another, he has no power of any sort, and a man on whom We have bestowed good provisions from Us, and he spends from that secretly and openly. Can they be equal (By no means). All the praises and thanks are to Allah. Nay! (But) most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sets forth a parable: (consider) a slave, the property of another, (who) has no power over anything, and one whom We have granted from Ourselves a goodly sustenance so he spends from it secretly and openly; are the two alike? (All) praise is due to Allah! Nay, most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has struck a similitude: a servant possessed by his master, having no power over anything, and one whom We have provided of Ourselves with a provision fair, and he expends of it secretly and openly. Are they equal? Praise belongs to God! Nay, most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah coineth a similitude: (on the one hand) a (mere) chattel slave, who hath control of nothing, and (on the other hand) one on whom we have bestowed a fair provision from Us, and he spendeth thereof secretly and openly. Are they equal? Praise be to Allah! But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God makes a comparison between an owned slave possessing no power over anything, and someone to whom We have given plentiful provision, who gives out from it privately and openly. Are they equal? Praise be to God! But most people do not know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah propoundeth a similitude: there is a bondman enslaved who hath not power over aught; and there is one whom We have provided from Ourselves with goodly provision and he expendeth thereof secretly and openly; can they be equal? All praise Unto Allah; but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah draws a parable: a slave owned [by his master] who has no power over anything, and another one [a free man] whom We have provided a goodly provision and who spends out of it secretly and openly. Are they equal? All praise belongs to Allah. But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sets forth the Parable (of two men: one) a slave under the dominion of another; He has no power of any sort; and (the other) a man on whom We have bestowed goodly favours from Ourselves, and he spends thereof (freely), privately and publicly: are the two equal? (By no means;) praise be to Allah. But most of them understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah puts forward the example (of two men a believer and a disbeliever); a slave (disbeliever) under the possession of another, he has no power of any sort, and (the other), a man (believer) on whom We have bestowed a good provision from Us, and He spends thereof secretly and openly. Can they be equal? (By no means, not). All the praises and thanks be to Allah. Nay! (But) most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah strikes a parable. A servant owned by his master, having no power over anything, and one to whom We have given from Us a fine provision who spends it secretly and openly, are they equal? Praise be to Allah! No, most of them do not know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God cites the example of a bonded slave, who has no power over anything; and someone to whom We have given plentiful provision, from which he gives secretly and openly. Are they equal in comparison? All praise belongs to God, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah presents an example: a slave [who is] owned and unable to do a thing and he to whom We have provided from Us good provision, so he spends from it secretly and publicly. Can they be equal? Praise to Allah! But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:75] God strikes a similitude (mathalan, this is substituted by [the following, ‘abdan mamlūkan]) a slave who is a chattel (mamlūkan, an adjective to distinguish him [this type of slave] from a free man, who is the servant of God [alone]) having no power over anything, since he has no mastery, and one on whom (man, is an indefinite [noun], adjectivally qualified, in other words, a free man) We have bestowed a fair provision from Us, such that he spends thereof secretly and openly, that is, disposing of it as he wishes: the first similitude is for the idols, while the second is His, exalted be He. Are they equal?, the powerless slaves and the dispensing free men? No. Praise belongs to God, alone. But most of them, that is, the people of Mecca, do not know, the chastisement they will come to, and so they associate others with God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then gave a parable regarding the believer and the disbeliever, saying: (Allah coineth a similitude: (on the one hand) a (mere) chattel slave) Allah explained the traits of this slave, (who hath control of nothing) he has no power to spend or do any good, and in this respect he is just like the disbeliever from whom no good ever comes, (and (on the other hand) one on whom We have bestowed a fair provision) abundant wealth (from Us, and he spendeth thereof secretly) between him and his Lord (and openly) between him and other people for the sake of Allah; this is the simile of the sincere believer. (Are they equal) in their reward and obedience? (Praise be to Allah!) gratitude is due to Allah and divine Oneness is also Allah's. (But most of them know not) the parable of the Qur'an. It is also said that this verse was revealed about 'Uthman Ibn 'Affan and an Arab man called Abu'l-'Is Ibn Umayyah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ضَرَبَ ٱللَّهُ مَثَلاً عَبْداً مَّمْلُوكاً لاَّ يَقْدِرُ عَلَىٰ شَيْءٍ } يعني ليسَ لَهُ شَيءٌ، ولاَ يَملِكُ شَيئاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, { Allah has set forth an example for those who disbelieve: the wife of Noah and the wife of Lot }. This means that they had no power or control over anything.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ضرَبَ الله مثلاً } للمجرّد والمقيد والمُشْرِك والموحد { عبداً مملوكاً } محبّاً لغير الله\n مؤثراً له بهواه\n فإن المقيد بالشيء يدين بدينه ويصدر عن حكمه\n ويتصرّف بأمره\n فهو عبده إذ كل من أحب شيئاً أطاعه\n وإذا أطاعه فقد عبده\n فمنهم من يعبد الشيطان ومنهم من يعبد الشهوة ومنهم من يعبد الدنيا أو الدينار أو اللباس\n كما قال عليه الصلاة والسلام:\n \" تِعْس عبد الدينار\n تعس عبد الدرهم\n وتعس عبد الخميصة \" \n\n وقال الله تعالى:\n[الجاثية\n الآية: 23] وإذا عبده كان مملوكه ورقيقه\n { لا يقدر على شيء } لأن المحب والعابد لا يرتقي همته وتأثيره وقوّة نفسه من محبوبه ومعبوده وإلا لما كان مقهوراً له\n أسيراً في وثاقه\n بل ينقض منه ومعبوده عاجز لا تأثير له\n بل لا وجود سواء كان جماداً أو حيواناً أو إنساناً أو ما شئت\n فهو أعجز منه وأذلّ\n ولهذا قيل: إن الدنيا كالظلّ\n إذا تبعته فاتك وإن تركته تبعك\n فإن تابع الدنيا أحقر قدراً من الدنيا وأقلّ خطراً\n ولا تأثير للدنيا فكيف به حتى يحصل له وبسببه شيء؟ وإنّ الدنيا ظلّ زائل\n فهو ظل الظل ولا ظلّ لظلّ الظلّ\n بل الظلّ للذات ولا ذات له فلا ملك له ولا قدرة\n { ومن رزقناه منا رزقاً حسناً } ومن أحبنا وأقبل بقلبه علينا\n وتجرّد عما سوانا\n وانقطع إلينا\n أعطيناه الأيد والقوة\n ورزقناه المُلْك والحكمة\n وأسبغنا عليه النعمة الظاهرة والباطنة لأنه متوجه إلى مالك المُلْك\n منعم الكل\n منيع القوى والقدر\n فأكسب نفسه القوة و التأثير والقدرة منه\n وتأثر منه الأكوان والأجرام وأطاعه الملك والملكوت كما أوحى الله تعالى إلى داود عليه السلام: \" يا دنيا اخدمي من خدمني\n واتعبي من خدمك \"\n ثم إذا ربت همّته الشريفة عن الأكوان ولم تقف بمحبته مع غير الله ولم يلتفت إلى ما سواه زدنا في رزقه فآتيناه صفاتنا ومحونا عنه صفاته\n فعلمناه من لدنا علماً وأقدرناه بقدرتنا\n كما قال تعالى:\n \" لا يزال العبد يتقرّب إليّ بالنوافل حتى أحبّه\n فإذا أحببته كنت سمعه الذي يسمع به \" \n\n الحديث\n { فهو يُنْفِق منه سرّاً وجهراً } يُنْفق من النعم الباطنة كالعلم والحكمة سرّاً\n ومن الظاهرة جهراً\n أو ينفق من كلتيهما سرّاً كالذي يصل إلى الناس من غير تسببه لوصوله ظاهراً وهو في الحقيقة منه وصل لأنه حينئذ واسطة الوجود الإلهي ووكيل حضرته وجهراً كالذي يتسبب هو بنفسه ظاهراً لوصوله { هل يستوون } استفهام بطريق الإنكار وكذا المشرك كالأبكم الذي لم يكن له استعداد النطق في الخلقة لأنه ما استعدّ للإدراك والعقل الذي هو خاصية الإنسان\n فيدرك وجوب وجود الحق تعالى وكماله وإمكان الغير ونقصانه فيتبرأ عن غيره ويلوذ به عن حول نفسه وغيره وقوّتهما\n\n{ لا يقدر على شيء } لعدم استطاعته وقصور قوته للنقص اللازم لاستعداده { وهو كلّ على مولاه } لعجزه بالطبع عن تحصيل حاجته\n فهو عبد بالطبع محتاج\n متذلّل للغير\n ناقص عن رتبة كل شيء لكونه أقل من لا شيء\n فإن الممكن الذي يعبده ليس بشيء سواء كان ملكاً أو ملكاً أو فلكاً أو كوكباً أو عقلاً أو غيرها { أينما يوجهه لا يأت بخير } لعدم استعداده وشرارته بالطبع فلا يناسب إلا الشرّ الذي هو العدم فكيف يأتي بالخير { هل يستوي هو } والموحد القائم بالله\n الفاني عن غيره حتى نفسه يقوم بالحق\n ويعامل الخلق بالعدل\n ويأمر بالعدل\n لأن العدل ظلّ الوحدة في عالم الكثرة فحيث قام بوحدة الذات وقع ظله على الكل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولمن آثبت المشركون له سبحانه شريكاً من الأصنام والأوثان مثّل سبحانه شركاءهم { عَبْداً مَّمْلُوكاً } رقيقاً لا مكاتباً { لاَّ يَقْدِرُ عَلَىٰ شَيْءٍ } من التصرف في مكاسبه بغير إذن مولاه { وَ } مثَّل سبحانه نفسه { مَن رَّزَقْنَاهُ مِنَّا } يعني: من أحرارنا لأرقائهم تفضلاً وإحساناً { رِزْقاً حَسَناً } حلالاً وافراً { فَهُوَ يُنْفِقُ } ويتصرف { مِنْهُ } أي: من رزقه وكسبه { سِرّاً } بحيث لا يطلع على إنفاقه أحد\n حتى الفقراء المستحقون { وَجَهْراً } وعلانية على رءوس الملأ\n\n\n{ هَلْ يَسْتَوُونَ } الأحرار المتصرفون أموالهم بالاستقلال والاختيار\n وأولئك العبيد المعزولون عن التصرف رأساً { ٱلْحَمْدُ لِلَّهِ } على ما أعطانا عقلاً نجزم به عدم المساواة بين الفريقين\n ونميز به الحق عن الباطل\n والهداية عن الضلال { بَلْ أَكْثَرُهُمْ لاَ يَعْلَمُونَ } [النحل: 75] الفرق بين كلا الفريقين\n لعدم صرفهم نعمه العقل إلى ما خُلق لأجله\n وهو الامتياز المذكور\n\n\n{ وَضَرَبَ ٱللَّهُ } وَهُوَ أيضاً { مَثَلاً } لنفسه\n ولتك المعبودات الباطلة\n فقال: مثَلُنا ومثَلُهم مثلُ { رَّجُلَيْنِ أَحَدُهُمَآ أَبْكَمُ } أي: أخرس وأصم { لاَ يَقْدِرُ عَلَىٰ شَيْءٍ } من التفهم والتفيهم { وَ } كيف يقدر على النفع للغير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { عبدًا }: بدل من { مَثَلاً } \n و { مَن }: نكرة موصوفة\n أي: عبدًا مملوكًا\n وحرًا رزقناه منا رزقًا حسنًا\n وقيل: موصولة\n و { سرًّا وجهرًا }: على إسقاط الخافض\n وجمع الضمير في { يستوون } لأنه للجنسين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:3",
      "similarity": 0.5506073018972812
    },
    {
      "verse": "20:7",
      "similarity": 0.5328735594561537
    },
    {
      "verse": "67:13",
      "similarity": 0.527101957122417
    },
    {
      "verse": "71:8",
      "similarity": 0.45062779911403733
    },
    {
      "verse": "87:7",
      "similarity": 0.4370234161021586
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016075.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016075.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}