{
  "chapter": "النحل",
  "text": "والله خلقكم ثم يتوفىكم ومنكم من يرد الى ارذل العمر لكى لا يعلم بعد علم شيـا ان الله عليم قدير",
  "translations": [
    {
      "translation": "Allah created you and then will take you back again. And some of you revert to the lowest form of life so that after having knowledge, you know nothing at all. Allah is All-Knowing, Ail-Powerful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who creates you, then makes you die; and some reach the age of dotage when they forget what they had known before. God is indeed all-knowing and all-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has created you, and then He causes you to die. Some of you have your lives prolonged to an abject old age, when one loses all knowledge after having acquired it. Allah is All-Knowing, All-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has created you and He causes you to die. Some of you will grow to an extremely old age and lose your memory. God is All-knowing and Almighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah created you, and will then remove your souls; and among you is one who is sent back to the most lowly age, so knowing nothing after having had knowledge; indeed Allah knows everything, is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah created you and then He will cause you to die; and among you there are some who are sent back to senility, so that they know nothing after having known (much). Truly, Allah is Knowing, capable of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has created you, then He causes you to die, and of you is he who is brought back to the worst part of life, so that after having knowledge he does not know anything; surely Allah is Knowing, Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God created you; then He will gather you to Him; and some of you will be kept back unto the vilest state of life, that after knowing somewhat, they may know nothing; God is All-knowing, All-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah createth you, then causeth you to die, and among you is he who is brought back to the most abject stage of life, so that he knoweth nothing after (having had) knowledge. Lo! Allah is Knower, Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God created you; then He shall cause you to die: and some shall have their lives prolonged to abject old age, ceasing to know anything after once having had knowledge. God is all knowing and powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath created you, then He taketh your souls; of you are some who are brought back to the meanest of age, so that they know not aught after having knowledge; verily Allah is Knowing, Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has created you, then He takes you away, and there are some among you who are relegated to the nethermost age so that he knows nothing after [having possessed] some knowledge. Indeed Allah is all-knowing, all-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who creates you and takes your souls at death; and of you there are some who are sent back to a feeble age, so that they know nothing after having known (much): for Allah is All-Knowing, All-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has created you and then He will cause you to die, and of you there are some who are sent back to senility, so that they know nothing after having known (much). Truly! Allah is All-Knowing, All-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah created you, and causes you to die. There are some of you who, after knowing something, will be kept back to the vilest state of life, knowing nothing. Allah is the Knowing, Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God created you; then He takes you away. Some of you will be brought back to the worst age, so that he will no longer know anything, after having acquired knowledge. God is Omniscient and Omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah created you; then He will take you in death. And among you is he who is reversed to the most decrepit [old] age so that he will not know, after [having had] knowledge, a thing. Indeed, Allah is Knowing and Competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:70] And God has created you, when you were nothing, then He takes you [in death], when your terms [of life] are concluded; and there are some among you who are relegated to the most abject stage of life, that is, the most diminished, because of old-age and senility, so that he knows nothing after [having possessed] some knowledge. ‘Ikrima said, ‘Whoever recites the Qur’ān will not come to such a predicament’. God is Knowing, of how to manage [the affairs of] His creation, Powerful, in [doing] what He will.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nانتقال من الاستدلال بدقائق صنع الله على وحدانيته إلى الاستدلال بتصرّفه في الخلق التصرّفَ الغالب لهم الذي لا يستطيعون دفعهُ ، على انفراده بربوبيّتهم ، وعلى عظيم قدرته . كما دلّ عليه تذييلها بجملة { إن الله عليم قدير } فهو خَلقهم بدون اختيار منهم ثم يتوفّاهم كَرهاً عليهم أو يردّهم إلى حالة يكرهونها فلا يستطيعون ردّاً لذلك ولا خلاصاً منه ، وبذلك يتحقّق معنى العبودية بأوضح مظهر .وابتدئت الجملة باسم الجلالة للغرض الذي شرحناه عند قوله تعالى : { والله أنزل من السماء ماء } \\[ سورة النحل : 65 \\]. وأما إعادة اسم الجلالة هنا دون الإضمار فلأن مقام الاستدلال يقتضي تكرير اسمَ المستدلّ بفتح الدال على إثبات صفاته تصريحاً واضحاً .وجيء بالمسند فعلياً لإفادة تخصيص المسند إليه بالمسند الفعلي في الإثبات ، نحو : أنا سعيت في حاجتك . وقد تقدم نظيره في قوله تعالى : { والله أنزل من السماء ماء }. فهذه عبرة وهي أيضاً منّة ، لأن الخلق وهو الإيجاد نعمة لشرف الوجود والإنسانية ، وفي التوفّي أيضاً نعم على المتوفّى لأن به تندفع آلام الهَرم ، ونعم على نوعه إذ به ينتظم حال أفراد النوع الباقين بعد ذهاب من قبلهم ، هذا كلّه بحسب الغالب فرداً ونوعاً ، والله يخصّ بنعمته وبمقدارها من يشاء .ولما قوبل «ثم توفّاكم» بقوله تعالى : { ومنكم من يرد إلى أرذل العمر } علم أن المعنى ثم يتوفّاكم في إبان الوفاة ، وهو السنّ المعتادة الغالبة لأن الوصول إلى أرذل العمر نادر .والأرذل : تفضيل في الرذالة ، وهي الرداءة في صفات الاستياء .و { العمر } : مدة البقاء في الحياة ، لأنه مشتقّ من العَمْر ، وهو شغل المكان ، أي عَمر الأرض ، قال تعالى : { وأثاروا الأرض وعمروها } \\[ سورة الروم : 9 \\]. فإضافة { أرذل } إلى { العمر } التي هي من إضافة الصّفة إلى الموصوف على طريقة المجاز العقلي ، لأن الموصوف بالأرذل حقيقة هو حال الإنسان في عمره لا نفسُ العُمر . فأرذل العمر هو حال هرم البدن وضعف العقل ، وهو حال في مدة العمر . وأما نفس مدّة العمر فهي هي لا توصف برذالة ولا شرف .والهرم لا ينضبط حصوله بعدد من السنين ، لأنه يختلف باختلاف الأبدان والبلدان والصحة والاعتلال على تفاوت الأمزجة المعتدلة ، وهذه الرذالة رذالة في الصحّة لا تعلّق لها بحالة النفس ، فهي مما يعرض للمسلم والكافر فتسمّى أرذل العمر فيهما ، وقد استعاذ رسول الله صلى الله عليه وسلم من أن يردّ إلى أرذل العمر .ولام التعليل الداخلة على ( كي ) المصدرية مستعملة في معنى الصيرورة والعاقبة تشبيهاً للصيرورة بالعلّة استعارة تشير إلى أنه لا غاية للمرء في ذلك التعمير تعريضاً بالناس ، إذ يرغبون في طول الحياة؛ وتنبيهاً على وجوب الإقصار من تلك الرغبة ، كأنه قيل : منكم من يردّ إلى أرذل العمر ليصير غير قابل لعلم ما لم يعلمه لأنه يبطىء قبولُه للعلم .وربّما لم يتصوّر ما يتلقاه ثم يسْرع إليه النسيان . والإنسان يكره حالة انحطاط علمه لأنه يصير شبيهاً بالعجماوات .واستعارة حرف العلّة إلى معنى العاقبة مستعملة في الكلام البليغ في مقام التوبيخ أو التخطئة أو نحو ذلك . وتقدم عند قوله تعالى : { إنما نملي لهم ليزدادوا إثماً } في سورة آل عمران : ( 178 ). وقد تقدّم القول قريباً في ذلك عند قوله تعالى : { إذا فريق منكم بربّهم يشركون ليكفروا بما ءاتيناهم } في هذه السورة ( 55 ).وتنكير { علم } تنكير الجنس . والمعنى : لكيلا يعلم شيئاً بعد أن كان له علم ، أي ليزول منه قبول العلم .وجملة { إن الله عليم قدير } تذييل تنبيهاً على أن المقصود من الجملة الدلالة على عظم قدرة الله وعظم علمه . وقدم وصف العليم لأن القدرة تتعلّق على وفق العلم ، وبمقدار سعة العلم يكون عظم القدرة ، فضعيف القدرة يناله تعب من قوة علمه لأن همّته تدعوه إلى ما ليس بالنائل ، كما قال أبو الطيّب :وإذا كانت النفوس كبارا ... تعبت في مرادها الأجسام\n\n",
      "translations": [
        {
          "translation": "(And Allah createth you, then causeth you to die) He takes away your souls when your lifespan expires, (and among you is he who is brought back to the most abject stage of life, so that he knoweth) he understands (nothing after (having had) knowledge) before this state. (Lo! Allah is Knower) of the transformation of his creation, (Powerful) to turn them from one state to another.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { وَٱللَّهُ } القادر المتقدر للإحياء والإماتة { خَلَقَكُمْ } وأظهركم من كتم العدم إظهاراً إبداعياً\n وإيحاءً اختراعياً مقدراً مدة معينة لبقائكم في النشأة الأولى { ثُمَّ } بعد انقضاء المدة المقدرة { يَتَوَفَّاكُمْ } أي: يميتكم ويفنيكم { وَمِنكُم مَّن } يقدر لبقائه في هذه النشأة مدة متطاولة\n بحيث { يُرَدُّ إِلَىٰ أَرْذَلِ ٱلْعُمُرِ } وأخسِّه وأسوئه\n وإنما يرد بعض التاس إليه { لِكَيْ لاَ يَعْلَمَ } ويفهم { بَعْدَ } تعلق { عِلْمٍ } منه بمعلومٍ مخصوصٍ { شَيْئاً } من أحوال ذلك المعلوم\n يعني: يرجع إلى مرتبة الطفولية بعد كمال العقل\n وإنما رده سبحاه إظهاراً للقدرة الكاملة\n وتذكيراً وعبرةً للناس\n لئلا يطلبوا من الله طول الأعمار\n وبُعد الآجال { إِنَّ ٱللَّهَ } المدبر لأمور عباده { عَلِيمٌ } بمصالحهم ومفاسدهم { قَدِيرٌ } [النحل: 70] مقدر مقتدر للأصلح لهم تفضلاً وامتناناً\n\n\n{ وَٱللَّهُ } المقدر لمصالحكم أيضاً { فَضَّلَ بَعْضَكُمْ عَلَىٰ بَعْضٍ فِي ٱلْرِّزْقِ } بأن قدر للبعض غنى\n وللبعض فقراً\n وللبعض كفايةً\n على حسب تفاوت مراتبهم واستعداداتهم في علم الله\n ولوح قضائه\n وقدر البعث مالكاً للبعض\n والبعض مملوكاً له { فَمَا ٱلَّذِينَ فُضِّلُواْ } بسعة الرزق والبسطة من الموالي والملاك { بِرَآدِّي رِزْقِهِمْ } أي: بعض ما رزقهم الله { عَلَىٰ مَا مَلَكَتْ أَيْمَانُهُمْ } من المماليك بأن يقدّر للماليك في قسمة الله رزق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { والله خلقكم }: أظهركم إلى عالم الشهادة، { ثم يتوفاكم }: يردكم إلى عالم الغيب عند انتهاء آجالكم، { ومنكم مَن يُردُّ إلى أرذَلِ العُمُرِ } أي: أخسه، يعني: الهِرَم والخرف، الذي يشابه الطفولية في نقصان القوة والعقل. وقيل: هو خمس وتسعون سنة، وقيل: خمس وسبعون سنة، والتحقيق: أن ذلك لا ينضبط بسن. { لكي لا يَعْلَم بعد عِلْمٍ شيئًا } ليصير إلى حالة شبيهة بحالة الطفولية، في نقصان العقل والنسيان وسوء الفهم. وليس المراد نفي العلم بالكلية، بل عبارة عن قلة العلم لغلبة النسيان. وقيل: المعنى: لئلا يعلم زيادة على علمه شيئًا. قال عكرمة: من قرأ القرآن لم يصر بهذه المنزلة. قلت: جاء في بعض الأحاديث ما يقتضي تخصيص القارئ للقرآن بالمتبع له، وأنه الذي يُمتعه الله بعقله حتى يموت، وهو الذي يشهد له الحس، أي: الوجود في الخارج، بالصدق، لوجود الخرف في كثير ممن يحفظه. قاله في الحاشية. { إن الله عليم قدير } أي: عليم بمقادير الأشياء وأوقاتها، قدير على إيجاد الأشياء وإعدامها، عند انتهاء آجالها، فيميت الشاب النشط عند تمام أجله، ويبقى الهرم الفاني إلى انقضاء أجله. قال البيضاوي: وفيه تنبيه على أن تفاوت أعمار الناس ليس إلا بتقدير قادر حكيم، ركب أبنيتهم، وعدل أمزجتهم، على قدر معلوم، ولو كان في ذلك بمقتضى الطبائع لم يقع التفاوت إلى هذا المبلغ. هـ. الإشارة: الخلق والتوفي هو من جملة الظهور والبطون، عند أهل التوحيد الخاص، والرد إلى أرذل العمر لا يلحق العارفين بالله. وقد قيل، في استثناء قوله:\n[العَصر: 3] من الرد إلى أسفل سافلين: إن الصالح لا يدركه الخَرف وإن أدركه الهرم. وذلك دليل على سعادته، وعدم تشويه صورته في الآخرة، والله تعالى قادر على وقاية أوليائه مما يشين به أعداءه عاجلاً. وفي الحديث:\n \" إذا قرأ الرجلُ القرآنَ، واحتْشَى من أحاديث رسول الله صلى الله عليه وسلم - أي: امتلأ - وكانتْ هناك غزيرةٌ - يعني: فقه نفس ومعرفة -، كان خليفةً من خلفاء الأنبياء \". \nثمَّ سفَّه رأي من أشرك بعد هذه الدلائل فقال: { وَٱللَّهُ فَضَّلَ بَعْضَكُمْ عَلَىٰ بَعْضٍ فِي ٱلْرِّزْقِ... }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:111",
      "similarity": 0.6910002061080036
    },
    {
      "verse": "11:27",
      "similarity": 0.5913595875085977
    },
    {
      "verse": "28:13",
      "similarity": 0.35452049188869317
    },
    {
      "verse": "20:33",
      "similarity": 0.34347407366958477
    },
    {
      "verse": "22:5",
      "similarity": 0.23920742746088167
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016070.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016070.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:70.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}