{
  "chapter": "النحل",
  "text": "وتحمل اثقالكم الى بلد لم تكونوا۟ بلغيه الا بشق الانفس ان ربكم لرءوف رحيم",
  "translations": [
    {
      "translation": "They carry your loads to lands you would never reach except with great difficulty. Your Lord is All-Gentle,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They carry your burdens to lands so distant you could not have reached without much hardship. Indeed your Lord is compassionate and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they carry your loads to many a place which you would be unable to reach without much hardship. Surely your Lord is Intensely Loving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They carry your heavy loads to lands which you would not have been able to reach without great difficulty. Your Lord is certainly Compassionate and All-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they transport your loads to a town where you could not reach except utterly exhausted; indeed your Lord is Most Compassionate, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they carry your loads to a land that you could not reach yourselves except with great trouble. Truly, your Lord is full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they carry your heavy loads to regions which you could not reach but with distress of the souls; most surely your Lord is Compassionate, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they bear your loads unto a land that you never would reach, excepting with great distress. Surely your Lord is All-clement, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they bear your loads for you unto a land ye could not reach save with great trouble to yourselves. Lo! your Lord is Full of Pity, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They carry your loads to places which you could otherwise not reach without great hardship, surely, your Lord is compassionate and merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they bear Your loads to a city Which ye could not reach except with travail of souls; verily your Lord is Kind, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they bear your burdens to towns, which you could not reach except by straining yourselves. Indeed your Lord is most kind and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they carry your heavy loads to lands that ye could not (otherwise) reach except with souls distressed: for your Lord is indeed Most Kind, Most Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they carry your loads to a land that you could not reach except with great trouble to yourselves. Truly, your Lord is full of Kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They carry your loads to a land which you could not otherwise reach except by painful toil to oneself. Your Lord is the Clement, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they carry your loads to territory you could not have reached without great hardship. Your Lord is Clement and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they carry your loads to a land you could not have reached except with difficulty to yourselves. Indeed, your Lord is Kind and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:7] And they bear your burdens, your baggage, to a land which you could not reach, without being on camelback, save with great trouble to yourselves, [save by] straining them. Indeed your Lord is Gentle, Merciful, to you, in having created these for you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they bear your loads) your luggage and provision (for you unto a land) i.e. Mecca (ye could not reach save with great trouble to yourselves) except with great toil. (Lo! your Lord is Full of Pity) towards him who believes, (Merciful) by deferring your chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ بِشِقِّ ٱلأَنفُسِ } معناهُ بِمَشقَّتِها\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Except by piercing souls} means by their difficulty.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من أعظم فوائدها أنها { تَحْمِلُ أَثْقَالَكُمْ } أي: أحمالكم التي تستثقلونها { إِلَىٰ بَلَدٍ } بعيد { لَّمْ تَكُونُواْ بَالِغِيهِ }  أي: لم يحصل لكم بلوغها إليها لولاها { إِلاَّ بِشِقِّ ٱلأَنفُسِ } أي: بالمشقة التامة\n والعسر المفرط\n فخلقها سبحانه تيسيراً لكم وتسهيلاً\n تتميماً لتكرمكم { إِنَّ رَبَّكُمْ } الذي ربَّاكم بأنواع اللطف والكرم { لَرَؤُوفٌ } عطوف مشفق لكم\n يسهل عليكم كل عسير { رَّحِيمٌ } [النحل: 7] لكم\n يوفقكم ويهيئ أسبابكم\n لتواظبوا على أداء ما أُفترض عليكم من كسب المعارف والحقائق الرافعة لكم إلى أرفع المنازل\n وأعلى المراتب\n\nثمَّ أشار سبحانه أيضاً إلى ما يضركم\n ويدفع أذاكم\n ويرفع جاهكم تتميماً لتعظيمكم وتربيتكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا بشق }: فيه لغتان: الكسر والفتح، بمعنى التعب والكلفة، وقيل: المفتوح مصدر شَقَّ الأمرُ عليه، أي: صَعُبَ، والمكسور بمعنى: النصف، كأنه ذهب نصف قُوَّتِهِ بالتعب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:47",
      "similarity": 0.45645642635988753
    },
    {
      "verse": "57:9",
      "similarity": 0.44872008497078447
    },
    {
      "verse": "24:20",
      "similarity": 0.43895852816269487
    },
    {
      "verse": "2:207",
      "similarity": 0.38995025936929717
    },
    {
      "verse": "89:8",
      "similarity": 0.3414994885380839
    }
  ]
}