{
  "chapter": "النحل",
  "text": "والله اخرجكم منۢ بطون امهتكم لا تعلمون شيـا وجعل لكم السمع والابصر والافـدة لعلكم تشكرون",
  "translations": [
    {
      "translation": "Allah brought you out of your mothers' wombs knowing nothing at all, and gave you hearing, sight and hearts so that perhaps you would show thanks.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God produced you from your mothers' wombs knowing nothing, but gave you ears and eyes and hearts so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has brought you forth from your mothers' wombs when you knew nothing, and then gave you hearing, and sight and thinking hearts so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God brought you out of your mothers wombs, you knew nothing. He gave you ears, eyes, and hearts so that perhaps you would give Him thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah brought you forth from your mothers’ wombs, whilst you did not know anything* – and gave you ears and eyes and hearts, for you to be grateful. (* Prophet Mohammed and Prophet Jesus, among others, are exceptions to this rule – peace and blessings be upon them.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has brought you out from the wombs of your mothers while you knew nothing. And He gave you hearing, sight, and hearts, that you might give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has brought you forth from the wombs of your mothers-- you did not know anything-- and He gave you hearing and sight and hearts that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is God who brought you forth from your mothers' wombs, and He appointed for you hearing, and sight, and hearts, that haply so you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah brought you forth from the wombs of your mothers knowing nothing, and gave you hearing and sight and hearts that haply ye might give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God brought you forth from the wombs of your mothers while you knew nothing, and gave you hearing and sight and hearts, so that you might be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath brought you forth from the bellies of your mothers while ye know not aught, and He hath appointed for you hearing and sight and hearts that haply ye might give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has brought you forth from the bellies of your mothers while you did not know anything. He made for you hearing, eyesight, and hearts so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who brought you forth from the wombs of your mothers when ye knew nothing; and He gave you hearing and sight and intelligence and affections: that ye may give thanks (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has brought you out from the wombs of your mothers while you know nothing. And He gave you hearing, sight, and hearts that you might give thanks (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah brought you out of your mothers' wombs, and gave you hearing, sight and hearts, in order that you be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God brought you out of your mothers’ wombs, not knowing anything; and He gave you the hearing, and the eyesight, and the brains; that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has extracted you from the wombs of your mothers not knowing a thing, and He made for you hearing and vision and intellect that perhaps you would be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:78] And God brought you forth from the bellies of your mothers while you did not know anything (the statement [lā ta‘lamūna shay’an, ‘while you did not know anything’] is a circumstantial qualifier), and He gave you hearing and sight and hearts that perhaps you might give thanks, to Him for this [gift] and become believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Allah brought you forth from the wombs of your mothers knowing nothing) not knowing different kinds of things; it is also said that this means: not knowing anything, (and gave you hearing) with which you hear goodness (and sight) with which you see goodness (and hearts) with which you perceive goodness (that haply ye might give thanks) so that you give thanks to Allah for his blessings and believe in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف ينتهي قدرته؛ إذ { ٱللَّهُ أَخْرَجَكُم مِّن بُطُونِ أُمَّهَاتِكُمْ } وأنتم خاوون عن العلوم كلها، بحيث { لاَ تَعْلَمُونَ شَيْئاً } من المعلومات أصلاً { وَجَعَلَ لَكُمُ } أسباباً وأدوات تعلمون بها أنواعاً من العلوم، هيأ لكم { ٱلْسَّمْعَ } لإدراك المسموعات الجزئية { وَٱلأَبْصَارَ } لإدراك المبصرات الجزئية { وَٱلأَفْئِدَةَ } لإدراك الكليات والجزئيات، والمناسبات والمباينات الواقعة بين العلوم والإدراكات، كل ذلك بقدرة الله وإرادته، وفضله وجُوده { لَعَلَّكُمْ تَشْكُرُونَ } [النحل: 78] يعني: رجاء أن تعدُّوا نِعمَ منعمكم عليكم في شئونكم وتطوراتكم، وتواظبوا على شكرها؛ كي تعرفوا ذاته، وتصلوا إليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:23",
      "similarity": 0.612911255700283
    },
    {
      "verse": "23:78",
      "similarity": 0.6002620668275074
    },
    {
      "verse": "53:11",
      "similarity": 0.5527454025158357
    },
    {
      "verse": "32:9",
      "similarity": 0.5322449067851818
    },
    {
      "verse": "104:7",
      "similarity": 0.45906302904442675
    }
  ]
}