{
  "chapter": "النحل",
  "text": "وضرب الله مثلا رجلين احدهما ابكم لا يقدر على شىء وهو كل على مولىه اينما يوجهه لا يات بخير هل يستوى هو ومن يامر بالعدل وهو على صرط مستقيم",
  "translations": [
    {
      "translation": "God presents another example of two men, one dumb and unable to do a thing and is a burden on his master. Wherever he is sent he returns without any good (result). Could he be equal to one who enjoins what is just, and follows the right path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sets forth another parable: There are two men, one of whom is dumb and has no power over anything; he is a burden to his master, and wheresoever his master directs him, he fails to bring forth any good. Can such a person be the equal of one who enjoins justice and himself follows the Right Way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God tells a parable about two men. One of them is dumb and useless and a burden on his friend. Wherever he goes, he returns with nothing. Can he be considered equal to the one who maintains justice and follows the right path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has illustrated an example – two men – one of them dumb, unable to do anything, and he is a burden on his master – wherever his master sends him, he brings back no good; will he be equal to one who gives the command of justice and is on the Straight Path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah gives an example of two men, one of them dumb, who has no power over anything, and he is a burden on his master; whichever way he directs him, he brings no good. Is such a man equal to one who commands justice, and is himself on the straight path\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah sets forth a parable of two men; one of them is dumb, not able to do anything, and he is a burden to his master; wherever he sends him, he brings no good; can he be held equal with him who enjoins what is just, and he (himself) is on the right path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has struck a similitude: two men, one of them dumb, having no power over anything, and he is a burden upon his master -- wherever he despatches him, he brings no good. Is he equal to him who bids to justice, and is on a straight path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah coineth a similitude: Two men, one of them dumb, having control of nothing, and he is a burden on his owner; whithersoever he directeth him to go, he bringeth no good. Is he equal with one who enjoineth justice and followeth a straight path (of conduct)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God makes another comparison between two men, one of whom is dumb and cannot do a thing, and is a burden on his master. Wherever he sends him on an errand, he brings [him] no good. Is he equal to someone who commands justice and is on a straight path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah propoundeth a similitude: there are two men, one of them dumb who hath of Power over aught and is a weariness unto his master, whithersoever he directeth him he bringeth not any good; is he equal with one who commandeth justice and in himself on a straight patht?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah draws [another] parable: Two men, one of whom is dumb, having no power over anything and who is a liability to his master: wherever he directs him he does not bring any good. Is he equal to someone who enjoins justice and is [steady] on a straight path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sets forth (another) Parable of two men: one of them dumb, with no power of any sort; a wearisome burden is he to his master; whichever way be directs him, he brings no good: is such a man equal with one who commands Justice, and is on a Straight Way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah puts forward (another) example of two men, one of them dumb, who has no power over anything (disbeliever), and he is a burden to his master, whichever way he directs him, he brings no good. Is such a man equal to one (believer in the Islamic Monotheism) who commands justice, and is himself on a Straight Path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah strikes a parable. Two men, one is dumb and powerless, a burden to his master wherever he sends him he returns with no good. Is he equal with one who orders justice and follows the Straight Path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God cites the example of two men: one of them dumb, unable to do anything, and is a burden on his master; whichever way he directs him, he achieves nothing good. Is he equal to him who commands justice, and is on a straight path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah presents an example of two men, one of them dumb and unable to do a thing, while he is a burden to his guardian. Wherever he directs him, he brings no good. Is he equal to one who commands justice, while he is on a straight path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:76] And God strikes a similitude (mathalan, this is substituted by [the following, rajulayn]) two men, one of whom is dumb [from birth], having no power over anything, as he cannot understand nor be understood, and who is a liability, burdensome, to his master: — the [legal] guardian of his affairs — wherever he directs him, he does not bring, therefrom, any good, he does [not] succeed, and this is the similitude of the disbeliever. Is he, that is, the dumb one mentioned, equal to one who enjoins justice, that is, to one who is able to speak, of benefit to people, since he enjoins it [justice] and encourages [others to] it, and follows a path, a way, that is straight? — this being the second [man], the believer — No [he is not equal to him]. It is also said that this [last similitude] is a similitude of God, while the [similitude of the] dumb one is of the idols, so that the preceding [verse] contains the similitude of the disbeliever and the believer.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah gave a simile regarding Himself and the idols, saying: (And Allah coineth a similitude) Allah explains the traits of (two men, one of them dumb, having control of nothing) he cannot talk, this is the idol, (and he is a burden on his owner) his guardian and relatives; (whithersoever he directeth him) or call him (to go) east or west, (he bringeth no good) he does not respond to his caller with any good; this is the parable of the idol. (Is he equal) in terms of bringing benefit and driving away harm, i.e. the idol (with one who enjoineth justice) the Oneness of Allah (and followeth a straight path) i.e. Allah's divine Oneness, meaning Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُوَ كَلٌّ عَلَىٰ مَوْلاهُ } معناهُ عِيالٌ عَليهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لا يقدر على شيء } لعدم استطاعته وقصور قوته للنقص اللازم لاستعداده { وهو كلّ على مولاه } لعجزه بالطبع عن تحصيل حاجته، فهو عبد بالطبع محتاج، متذلّل للغير، ناقص عن رتبة كل شيء لكونه أقل من لا شيء، فإن الممكن الذي يعبده ليس بشيء سواء كان ملكاً أو ملكاً أو فلكاً أو كوكباً أو عقلاً أو غيرها { أينما يوجهه لا يأت بخير } لعدم استعداده وشرارته بالطبع فلا يناسب إلا الشرّ الذي هو العدم فكيف يأتي بالخير { هل يستوي هو } والموحد القائم بالله، الفاني عن غيره حتى نفسه يقوم بالحق، ويعامل الخلق بالعدل، ويأمر بالعدل، لأن العدل ظلّ الوحدة في عالم الكثرة فحيث قام بوحدة الذات وقع ظله على الكل، فلم يكن إلا آمراً بالعدل { وهو على صراط مستقيم } أي: صراط الله الذي عليه خاصته من أهل البقاء بعد الفناء الممدود على نار الطبيعة لأهل الحقيقة يمرّون عليه كالبرق اللامع\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَضَرَبَ ٱللَّهُ } وَهُوَ أيضاً { مَثَلاً } لنفسه، ولتك المعبودات الباطلة، فقال: مثَلُنا ومثَلُهم مثلُ { رَّجُلَيْنِ أَحَدُهُمَآ أَبْكَمُ } أي: أخرس وأصم { لاَ يَقْدِرُ عَلَىٰ شَيْءٍ } من التفهم والتفيهم { وَ } كيف يقدر على النفع للغير؛ إذ { هُوَ } في نفسه { كَلٌّ } ثقل { عَلَىٰ مَوْلاهُ } أي: حافظه ومولي أموره { أَيْنَمَا يُوَجِّههُّ } ويصرفه لطلب المهام { لاَ يَأْتِ بِخَيْرٍ } نجحٍ ونيلٍ، وهو مثل الأصنام العاطلة الكليلة التي لا خير فيها أصلاً { هَلْ يَسْتَوِي } أيها العقلاء المميزون { هُوَ } أي: هذا الموصوف بالأوصاف المذكورة { وَمَن } هو ذو منطق فصيح معرب { يَأْمُرُ بِٱلْعَدْلِ } وينال بالخير والحسنى أينما توجهه بنفسه { وَهُوَ عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } [النحل: 76] معتدلٍ مائلٍ عن كلا طرفي الافراط والتفريط المذمومَين، وهو مثل لله الواحد الأحد الصمد، المتصرف المستقل في ملكه بالإرادة والاختيار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}