{
  "chapter": "النحل",
  "text": "ويوم نبعث فى كل امة شهيدا عليهم من انفسهم وجئنا بك شهيدا على هؤلاء ونزلنا عليك الكتب تبينا لكل شىء وهدى ورحمة وبشرى للمسلمين",
  "translations": [
    {
      "translation": "On that Day We will raise up among every community a witness against them from amongst themselves, and bring you as a witness against them. We have sent down the Book to you making all things clear and as guidance and mercy and good news for the Muslims.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remind them of the Day when We shall call from every people a witness against them, and make you a witness over them, for We have revealed to you the Book as an exposition of everything, and as guidance and grace and happy tidings for those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), warn them of the coming of a Day when We shall bring forth a witness against them from each community and We shall bring you forth as a witness against them all; (and it is for that purpose that) We sent down the Book to you which makes everything clear, and serves as a guidance and mercy and glad tidings to those who have submitted to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We call a witness against every nation from their own people, We will call you, (Muhammad), as a witness against them all. We have sent you the Book which clarifies all matters. It is a guide, a mercy, and glad news to the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day when We will raise from every group, a witness from among them, in order to testify against them and will bring you O dear Prophet (Mohammed – peace and blessings be upon him) as a witness upon them all; and We have sent down this Qur’an upon you which is a clear explanation of all things, and a guidance and a mercy and glad tidings to the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when We resurrect a witness from each nation from among themselves, and We bring you (O Muhammad) as a witness against these. And We have revealed the Book (the Qur'an) to you as an explanation of everything, a guidance, a mercy, and good news for the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We will raise up in every people a witness against them from among themselves, and bring you as a witness against these-- and We have revealed the Book to you explaining clearly everything, and a guidance and mercy and good news for those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day We shall raise up from every nation a witness against them from amongst them, and We shall bring thee as a witness against those. And We have sent down on thee the Book making clear everything, and as a guidance and a mercy, and as good tidings to those who surrender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (bethink you of) the day when We raise in every nation a witness against them of their own folk, and We bring thee (Muhammad) as a witness against these. And We reveal the Scripture unto thee as an exposition of all things, and a guidance and a mercy and good tidings for those who have surrendered (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day will come when We raise up in every people a witness against them from amongst themselves, and We will bring you as a witness against these people. We have sent down the Book to you to make everything clear, a guidance, and a mercy, and glad tidings for those who submit to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beware a Day whereon We shall raise up in every community a witness regarding them from amongst them selves, and We shall bring thee as a witness regarding these. And We, have revealed unto thee the Book as an exposition of everything and as a guidance and mercy and glad tidings to the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We raise in every nation a witness against them from among themselves, We shall bring you as a witness against these. We have sent down the Book to you as a clarification of all things and as guidance, mercy and good news for the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day We shall raise from all Peoples a witness against them, from amongst themselves: and We shall bring thee as a witness against these (thy people): and We have sent down to thee the Book explaining all things, a Guide, a Mercy, and Glad Tidings to Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day when We shall raise up from every nation a witness against them from amongst themselves. And We shall bring you (O Muhammad SAW) as a witness against these. And We have sent down to you the Book (the Quran) as an exposition of everything, a guidance, a mercy, and glad tidings for those who have submitted themselves (to Allah as Muslims).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that Day We shall raise up from every nation a witness from their own against them, and We shall bring you (Prophet Muhammad) as a witness against those. And We have sent down to you the Book making everything clear, as a guidance, and mercy, and glad tidings to those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We raise in every community a witness against them, from among them, and bring you as a witness against these. We have revealed to you the Book, as an explanation of all things, and guidance, and mercy and good news for those who submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] the Day when We will resurrect among every nation a witness over them from themselves. And We will bring you, [O Muhammad], as a witness over your nation. And We have sent down to you the Book as clarification for all things and as guidance and mercy and good tidings for the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:89] And, mention, the day We shall raise up from every community a witness against them from among themselves, and this will be their [that community’s] prophet, and We shall bring you, O Muhammad (s), as a witness against these, namely, your people. And We have revealed to you the Book, the Qur’ān, as a clarification of all things, that people [might] need concerning the Law, and as a guidance, from error, and a mercy and good tidings, of Paradise, to those who submit, [those who] affirm the Oneness [of God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (bethink you of) the day when We raise in every nation) when We take from every group (a witness) a prophet (against them) testifying that he conveyed the message to them (of their own folk) a human being like them, (and We bring thee) Muhammad (as a witness against these) against your people; it is also said that this means: a witness for your nation that they had accepted the message. (And We reveal the Scripture unto thee) and We send Gabriel to you with the Qur'an (as an exposition of all things) of the lawful and unlawful, the commands and prohibitions, (and a guidance) from error (and a mercy) preventing from chastisement (and good tidings for those who have surrendered (to Allah)) that they will have Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تِبْيَاناً لِّكُلِّ شَيْءٍ } معناهُ بَيانٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {a explanation for every thing} its meaning is an explanation.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر لهم { يَوْمَ نَبْعَثُ فِي كُلِّ أُمَّةٍ شَهِيداً عَلَيْهِمْ مِّنْ أَنْفُسِهِمْ } وهو نبيهم ورسولهم { وَجِئْنَا بِكَ } أي أكمل الرسل { شَهِيداً عَلَىٰ هَـٰؤُلآءِ } الغواة البغاة\n المنهمكين في بحر الإعراض الإضلال { وَ } الحال: أنا قد { نَزَّلْنَا عَلَيْكَ ٱلْكِتَابَ } المشتمل لفوائد جميع الأديان والكتب\n وجعلناه { تِبْيَاناً } موضحاً مفصلاً { لِّكُلِّ شَيْءٍ } يُحتاج إليه من أمور الدين من الشعائر والأحكام والأركان\n والآداب والأخلاق\n واملندوبات والمحظورات\n والمواعظ والتذكيرات\n والقصص التي عتبر منها المعتبرون المسترشدون بالنسبة إلى عوام المؤمنين { وَهُدًى } إلى معارف وحقائق\n يهديهم إلى طريق التوحيد المنجي عن غياهب التقليدات والتخمينات بالنسبة إلى خواصهم\n\n\n{ وَرَحْمَةً } أي: كشفاً وشهوداً مترتبة على الجذبة الخطفة\n والخطوة بالنسبة إلى خواص الخواص { وَ } بالجملة: ما هو إلاَّ { بُشْرَىٰ لِلْمُسْلِمِينَ } [النحل: 89] المنقادين لله بسرائرهم وظواهرهم\n مفوضين أمورهم كلها إليه بلا تلعثهم وتذبذب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وجئنا بك } يا محمد { شهيدًا على هؤلاء } على أمتك\n أو على هؤلاء الشهداء\n { ونزَّلنا عليك الكتابَ }: القرآن { تبيانًا } بيانًا بليغًا { لكل شيءٍ } من أمور الدين على التفصيل\n أو الإجمال بالإحالة على السنة أو القياس\n { وهُدىً } من الضلالة\n { ورحمة }  بنور الهداية لجميع الخلق\n\nوإنما حُرم المحروم لتفريطه\n { وبُشرى } بالجنة\n وغيرها\n { للمسلمين } الموحدين خاصة\n وبالله التوفيق\n الإشارة: قد بعث الله في كل دهر وعصر شهيدًا يشهد على أهله\n ويكون حجة عليهم يوم القيامة\n وهم صنفان: صنف يشهد على من فرط في أحكام الشريعة\n وهم: العلماء الأتقياء\n وصنف يشهد على من فرط في أسرار الحقيقة\n وهم: الأولياء الكبراء\n أعني: العارفين بالله\n فمن فرط في شيء منهما قامت عليه الحجة فإذا اعتذر لا ينفعه\n وإذا طلب الرجوع لا يجده\n وإذا أحاط به عذاب الحجاب لا ينفك عنه\n وكل من أحب شيئًا من دون الله\n تبرأ منه يوم القيامة\n وكل من أنكر الخصوصية على أولياء زمانه\n وصد الناس عنه تضاعف عذابه\n وكثف حجابه يوم القيامة\n والله تعالى أعلم\n ولما ذكر أن القرآن تبيان كل شيء ذكر آية تضمنت أصول الاحكام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:41",
      "similarity": 0.44481827372874994
    },
    {
      "verse": "2:213",
      "similarity": 0.4240196624999942
    },
    {
      "verse": "19:33",
      "similarity": 0.38740127127826907
    },
    {
      "verse": "19:15",
      "similarity": 0.3845771301088021
    },
    {
      "verse": "62:2",
      "similarity": 0.37731770000392845
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/16:89.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/16:89.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/16:89.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}