{
  "chapter": "النحل",
  "text": "يعرفون نعمت الله ثم ينكرونها واكثرهم الكفرون",
  "translations": [
    {
      "translation": "They acknowledge Allah's blessing and then deny it. Most of them are kuffar.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do know the favours of God, and yet they deny them, for most of them are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are aware of the favours of Allah, and yet refuse to acknowledge them. Most of them are determined not to accept the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize the bounties of God but they refuse them and most of them are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognise the favour* of Allah and then deny it, and most of them are disbelievers. (* Prophet Mohammed (peace and blessings be upon him) and / or all the favours of Allah.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize the grace of Allah, yet they deny it (by worshipping others besides Allah) and most of them are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize the favor of Allah, yet they deny it, and most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize the blessing of God, then they deny it, and the most of them are the unthankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They know the favour of Allah and then deny it. Most of them are ingrates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize the favour of God, yet they deny it; and most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize the favour of Allah, then they deny it, and most of them are infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize the blessing of Allah and then deny it, and most of them are faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognise the favours of Allah; then they deny them; and most of them are (creatures) ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognise the Grace of Allah, yet they deny it (by worshipping others besides Allah) and most of them are disbelievers (deny the Prophethood of Muhammad SAW).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize the favors of Allah, then they disbelieve them; most of them are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize God’s blessing, but then deny it, as most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They recognize the favor of Allah; then they deny it. And most of them are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:83] They recognise God’s grace, that is, they affirm that it comes from Him, and then deny it, by associating others [with Him], and most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When the Prophet (pbuh) mentioned to them all those blessings, they agreed that all those blessings came from Allah, but then they denied this afterward, and said: no, we have all these blessings through the intercession of our gods. Allah said in response: (They know the favour of Allah) they acknowledge that all these blessings are from Allah (and then deny it) saying: we got them through the intercession of our gods. (Most of them are ingrates) all of them are disbelievers in Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَعْرِفُونَ نِعْمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا } يعني محمداً صلَّى الله عليهِ وعَلَى آلهِ وسَلَّمَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {They recognize the favor of Allah, then they deny it} refers to Muhammad - peace and blessings be upon him and his family.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إنهم { يَعْرِفُونَ نِعْمَتَ ٱللَّهِ } التي عدَّها وهيأها لهم { ثُمَّ يُنكِرُونَهَا } من خبث بواطنهم بإسنادها إلى شركائهم وشفعائهم { وَأَكْثَرُهُمُ } أي: عرفائهم وعقلائهم الذين يعرفون النعمة والمنعم\n ثمَّ ينكرون إنعامه\n وأتباعهم\n أي: ضعفاؤهم في العقل والتمييز كلهم هم { ٱلْكَافِرُونَ } [النحل: 83] الجاحدون لله وإنعامه\n يجازون على مقتضى جحودهم وإنكارهم\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يعرفون نِعْمَتَ الله } أي: يُقرون بأنها من عنده، { ثم يُنكرونها } بإشراكهم وعبادتهم غيرَ المنعِم بها، وبقولهم: إنها بشفاعة آلهتنا، أو بسبب كذا، أو بإعراضهم عن حقوقها\n وقيل: نعمة الله: نبوة نبينا محمد صلى الله عليه وسلم، عرفوها بالمعجزات، ثم أنكروها عنادًا\n { وأكثرهم الكافرون } الجاحدون عنادًا\n وذكر الأكثر إمَّا لأن بعضهم لم يعرف الحق لنقصان عقله، أو لتفريطه في النظر، أو لم تقم عليه الحجة لأنه لم يبلغ حد التكليف، أو كان فيهم من داخله الإسلام، ومن أسلم بعد ذلك\n وإما لأنه أقام الأكثر مقام الكل، كقوله:\n\n[النّحل: 75]\n قال بعضه البيضاوي\n الإشارة: قال الورتجبي: بيَّن الحقُّ تعالى قدرته في إمساكه أطيار الأرواح في هواء الملكوت وسماء الجبروت، حتى ترفرفت بأجنحة العرفان والإيقان،على سرادق مجده وبساط كبريائه، مسخرات بأنوار جذبه، ما يمسكهن إلا الله، بكشف جماله لها، أمسكها به عن قهر سلطانه وسُبحات جلاله، حتى لا تفنى - أي: تتلاشى - في بهائه\n هـ\n والله جعل لكم من بيوتكم سكنًا - وهي العبودية -، تسكنون فيها وتأوون إليها، بعد طيران الفكرة في جو أنوار الملكوت، وميادين أسرار الجبروت\n أو الحضرة تسكن فيها قلوبكم، فتصير مُعَشَّشَ أرواحكم، إليها تأوون، وفيها تسكنون\n وجعل لكم منازل تنزلون فيها عند السير إلى حضرة ربكم، وهي المقامات التي يقطعها المريد، ينزل فيها ويرتحل عنها\n وجعل لكم من أردية الأكوان وألوانها واختلاف أصنافها، تمتعًا بشهود أنوار مكونها فيها، إلى انطوائها وظهور أضدادها بقيام الساعة، فتظهر القدرة وتبطن الحكمة، ويظهر المعنى ويبطن الحس\n والله جعل لكم مما خلق من الأكوان ظلالاً، والظلال لا وجود لها من ذاتها، فكذلك الأكوان لا وجود لها مع الحق، وإنما هي ظلال\n والظلال ليست بموجودة ولا مفقودة\n وجعل لكم من جبال العقل أكنانًا، تستترون بنوره من جذب الاصطلام بمواجهة أنوار الحضرة\n وجعل لكم سرابيل الشرائع تقيكم حَرَّ الحقيقة، وسرابيل الحقائق تقيكم بأس سهام الأقدار، فإنَّ من عرف الله حقيقة هان عليه ما يُواجَهُ به من المكاره\n وفي هذا المعنى أنشد بعضهم:\n\nوالمراد بعمامة الماء: كناية عن الحقيقة لأنها كالماء لحياة النفوس\n وميل شدها: كناية عن قوتها، وتكبيرها على الشريعة\n والمراد ببرنس الثلج: برد التشريع، فإذا قويت الحقيقة، وخاف من الاحتراق، نزل إلى برد التشريع\n والمراد بالريح: هبوب نسيم الواردات الإلهية، يشعل منها قنديل الفكرة - التي هي سراج القلب -، فإذا ذهبت فلا إضاءة له، وهذه حالة السائر، وأما الواصل فقد سكن النور في قلبه، فلا يحتاج إلى سراجٍ غيره تعالى\n وفي ذلك يقول الشاعر:\n\nوالمراد بالضباب: وجود السِّوى، فإنه يحترق عند اشتعال الفكرة\n والله تعالى أعلم\n وباقي الآية ظاهر إشارته\n ثم ذكر وعيد من أعرض عن هذه النعم، التي هي دلائل قدرته\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:69",
      "similarity": 0.7129931716218301
    },
    {
      "verse": "15:62",
      "similarity": 0.5809142871813207
    },
    {
      "verse": "40:81",
      "similarity": 0.5757716248679955
    },
    {
      "verse": "35:26",
      "similarity": 0.570674392445556
    },
    {
      "verse": "12:58",
      "similarity": 0.5023296648648778
    }
  ]
}