{
  "chapter": "النحل",
  "text": "والله جعل لكم منۢ بيوتكم سكنا وجعل لكم من جلود الانعم بيوتا تستخفونها يوم ظعنكم ويوم اقامتكم ومن اصوافها واوبارها واشعارها اثثا ومتعا الى حين",
  "translations": [
    {
      "translation": "Allah has made your houses places of rest for you and made houses for you out of cattle hides which are light for you to carry both when you are travelling and when you are staying in one place. And from their wool and fur and hair you obtain clothing and carpets and household utensils for a time.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has given you homes to live in, and tents (made) from the hides of cattle convenient for days of travelling and halting; and from their wool and fur and hair you make domestic articles and goods that last a certain time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made your houses a repose, and has provided you with the skins of the cattle for your habitation which are light to handle both when you travel and when you camp; and out of their wool and their fur and their hair He has given you furnishings and goods for use over a period of time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made your house the place for you to rest. He has also made homes for you out of the skins of cattle which are easy to carry along on a journey or at a camp. He has made wool, fur and the hair of cattle a temporary means of enjoyment for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has given you houses for staying, and made some houses from the hides of animals, which are easy for you on your day of travel and on the day of stopover – and from their wool, and fur, and hair, some household items and utilities for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah had made your homes a place of rest for you, and made dwellings for you out of the hides of the cattle which you find so light when you travel and when you camp; and furnishings and articles of convenience out of their wool, fur, and hair - comfort for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has given you a place to abide in your houses, and He has given you tents of the skins of cattle which you find light to carry on the day of your march and on the day of your halting, and of their wool and their fur and their hair (He has given you) household stuff and a provision for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is God who has appointed a place of rest for you of your houses, and He has appointed for you of the skins of the cattle houses you find light on the day that you journey, and on the day you abide, and of their wool, and of their fur, and of their hair furnishing and an enjoyment for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah hath given you in your houses an abode, and hath given you (also), of the hides of cattle, houses which ye find light (to carry) on the day of migration and on the day of pitching camp; and of their wool and their fur and their hair, caparison and comfort for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made your houses places of rest for you and made tents for you out of cattle hides, which are light for you to carry, both when you are travelling and when you are staying in one place. He provides for you from the wool and fur and hair of cattle, household goods and articles for use for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath appointed for you from your houses a repose, and He hath appointed for you from the skins of the cattle houses which ye find light, on the day of your flitting and on the day of your stopping, and from their wools and their furs and their hair a furnishing and an enjoyment for a season.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has made your homes as a place of rest for you and He made for you homes out of the skins of the cattle which you find portable on the day of your shifting and on the day of your halt, and out of their wool, fur and hair [He has appointed] furniture and wares [enduring] for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who made your habitations homes of rest and quiet for you; and made for you, out of the skins of animals, (tents for) dwellings, which ye find so light (and handy) when ye travel and when ye stop (in your travels); and out of their wool, and their soft fibres (between wool and hair), and their hair, rich stuff and articles of convenience (to serve you) for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has made for you in your homes an abode, and made for you out of the hides of the cattle (tents for) dwelling, which you find so light (and handy) when you travel and when you stay (in your travels), and of their wool, fur, and hair (sheep wool, camel fur, and goat hair), a furnishing and articles of convenience (e.g. carpets, blankets, etc.), a comfort for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is Allah who has given you houses in which to rest, and from the hides of cattle homes so they are light for you on the day you travel and on the day of settling; while from their wool, fur, and hair (He has given you) furnishing and enjoyment for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God has given you in your homes habitats for you, and has provided for you out of the hides of livestock portable homes for you, so you can use them when you travel, and when you camp; and from their wool, and fur, and hair, furnishings and comfort for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has made for you from your homes a place of rest and made for you from the hides of the animals tents which you find light on your day of travel and your day of encampment; and from their wool, fur and hair is furnishing and enjoyment for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:80]   And it is God Who has made for you your homes as a place of rest, a place that you can inhabit, and He has made for you out of the skins of the cattle homes, such as tents and pavilions, which you find light, to carry, on the day of your migration, your travel, and on the day of your halting; and of their wool, that is, the sheep’s, and their fur, that is, the camels’, and their hair, that is, the goats’, [He has made for you] furniture, chattels such as rugs and blankets, and wares, for you to use, for a while, until they perish.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned his blessings so that they thank Him and believe in Him, saying: (And Allah hath given you in your houses) the houses of mud (an abode) and dwelling, (and hath given you (also), of the hides of cattle) of their wool, fur and hair, (houses) i.e. tents and canopies (which ye find light (to carry) on the day of migration) travel (and on the day of pitching camp; and of their wool) the wool of sheep (and their fur) the fur of camels (and their hair) the hair of goats, (caparison) wealth (and comfort) benefit (for a while) 291 until their extinction or wearing out.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَثَاثاً وَمَتَاعاً إِلَىٰ حِينٍ } قال: زيدُ بن علي عليهما السَّلامُ فالأَثَاثُ: المَالُ\n والأَثَاثُ: المَتَاعُ\n قالَ: صلواتُ الله [عليه] وسَلامُهُ وفِي سُورة مريم\n\n[مريم: 74] فالزَّي المَنظرُ والكُسوةُ الظَّاهِرةُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {Furniture and possessions until a time} said: Zaid ibn Ali, peace be upon him, the furniture: the money.\n\n\nThe furniture: the belongings\n He said: \"The prayers of God [be upon him] and His peace and in the Surah of Mary.\"\n\n\nThe view is clear and the beauty is apparent.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱللَّهُ جَعَلَ لَكُمْ } أي: من جملة مقدرواته المتعلقة بأمور معاشكم: إنه جعل لكم { مِّن بُيُوتِكُمْ } التي بنيتم بأيديكم بإقدار الله وتمكينه وتعليمه إياكم { سَكَناً } أي: مسكناً تسكنون فيها\n كالبيوت المتخذة من الحجر والمدر\n والآجر والخشب { وَجَعَلَ لَكُمْ } أيضاً { مِّن جُلُودِ ٱلأَنْعَامِ بُيُوتاً تَسْتَخِفُّونَهَا } أي: تحملونها وتنقلونها { يَوْمَ ظَعْنِكُمْ } وترحالكم من مكانٍ إلى مكانٍ { وَ } كذا { يَوْمَ إِقَامَتِكُمْ } وحضركم { وَ } جعل لكم أيضاً { مِنْ أَصْوَافِهَا } هي للضائنة والغنم { وَأَوْبَارِهَا } هي للإبل { وَأَشْعَارِهَآ } هي للمعز { أَثَاثاً } أي: ما يُلبَس ويُفرَش { وَ } وصار { مَتَاعاً } لكم\n تتمتعون بها { إِلَىٰ حِينٍ } [النحل: 80] أي: إلى مدة متطاولة من الزمان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { سكنًا }: مصدر وُصف به\n أي: شيئًا سكنًا\n أو: فَعَلٌ بمعنى مفعول\n و { أثاثًا }: مفعول بمحذوف\n أي: وجعل من أوبارها أثاثًا\n يقول الحقّ جلّ جلاله: { ألم يروا } \n وفي قراءة: { ألم تروا } بتوجيه الخطاب لعامة الناس\n { إلى الطير مسخراتٍ }: مذللات للطيران بما خلق لها من الأجنحة والأسباب المواتية\n { في جو السماء } في الهواء المتباعد من الأرض\n { ما يُمسكهنَّ } فيه { إلا اللهُ } فإن ثِقلَ جسدها يقتضي سقوطها\n ولا علاقة فوقها ولا دعامة تحتها تمسكها\n { إنَّ في } تسخيره { ذلك } لها { لآيات } لعبرًا ودلالة على قدرته تعالى إذ لا فاعل سواه فإنَّ إمساك الطيران في الهواء هو على خلاف طباعها\n لولا أن القدرة تحملها\n ففيه آيات { لقوم يؤمنون } لأنهم هم المنتفعون بها\n { والله جعل لكم من بيوتكم سكنًا }: موضعًا تسكنون فيه وقت إقامتكم\n كالبيوت المتخذة من الحجر والمدَر\n و \" مِنْ \" للبيان\n أي: جعل لكم سكنًا\n أي: موضعًا تسكنونه\n وهو بيوتكم\n { وجعل لكم من جلود الأنعام بيوتًا } \n هي القباب المتخذة من الأدم\n ويجوز أن يتناول المتخذة من الوبَر والصوف والشعر\n فإنها\n من حيث إنها نابتة على جلودها\n كأنها من جلودها\n { تستخفونها } أي: تجدونها خفيفة\n يخف عليكم حملها وثقلها { يوم ظعنكم } أي: سفركم\n وفيه لغتان: الفتح والسكون\n { ويوم إقامتكم }: حضوركم\n أو نزولكم\n { و } جعل { من أصوافها } أي: الغنم\n { وأوبارها } أي: الإبل\n { وأشعارها } أي: المعز\n { أثاثًا }: متاعًا لبيوتكم كالبسُط والأكسية\n { ومتاعًا } تمتعون به { إلى حينٍ } إلى مدة من الزمان\n فإنها\n لصلابتها\n تبقى مدة مديدة\n أو: إلى مماتكم\n أو: إلى أن تقضوا منها أوطاركم\n أو: إلى أن تبلى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:74",
      "similarity": 0.22763378803805712
    },
    {
      "verse": "41:20",
      "similarity": 0.056448574344072314
    },
    {
      "verse": "41:21",
      "similarity": 0.055938665343435515
    },
    {
      "verse": "24:2",
      "similarity": 0.05222395784970825
    },
    {
      "verse": "41:22",
      "similarity": 0.05221476920391037
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/16:80.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/16:80.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:80.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}