{
  "chapter": "النحل",
  "text": "والخيل والبغال والحمير لتركبوها وزينة ويخلق ما لا تعلمون",
  "translations": [
    {
      "translation": "And horses, mules and donkeys both to ride and for adornment. And He creates other things you do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created horses, mules and donkeys for riding and for splendour. He created other things too which you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He created horses and mules and asses for you to ride, and also for your adornment. And He creates many things (for you) that you do not even know about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created horses, mules, and donkeys for you to ride and as a means of beauty. He has also created things that you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And horses, and mules, and donkeys so that you may ride them, and for adornment; and He will create what you do not know*. (* All modern means of transport – by air, sea, land and even in space – evidence this.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (He has created) horses, mules and donkeys for you to ride, and as an adornment. And He creates (other) things of which you have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (He made) horses and mules and asses that you might ride upon them and as an ornament; and He creates what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And horses, and mules, and asses, for you to ride, and as an adornment; and He creates what you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And horses and mules and asses (hath He created) that ye may ride them, and for ornament. And He createth that which ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created horses, mules and donkeys, so that you may ride them, and also so that they may be put on show, and He creates other things beyond your knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath created horses and mules and asses that ye may ride there on, and as an adornment; and He createth that which ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And horses, mules and asses, for you to ride them, and for pomp, and He creates what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (He has created) horses, mules, and donkeys, for you to ride and use for show; and He has created (other) things of which ye have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (He has created) horses, mules and donkeys, for you to ride and as an adornment. And He creates (other) things of which you have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He has created for you) horses, mules, and donkeys, which you ride and as an adornment; and He creates what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the horses, and the mules, and the donkeys—for you to ride, and for luxury. And He creates what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [He created] the horses, mules and donkeys for you to ride and [as] adornment. And He creates that which you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:8] And, He created, horses and mules and asses, that you may ride them, and for adornment (wa-zīnatan is an object denoting reason; the use of both of these reasons [‘to ride’ and ‘for adornment’] as illustrations of [God’s] graces does not preclude that they may have been created for other purposes, such as for consumption in the case of horses — which is established [as lawful] by a hadīth in both Sahīhs [of Bukhārī and Muslim]); and He creates what you do not know, of marvelous and strange things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And horses and mules and asses (hath He created) that ye may ride them) in the way of Allah, (and for ornament) they are good to look at. (And He createth that which ye know not) He says: He created things that you do not know, since He has not named them to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَٱلْخَيْلَ وَٱلْبِغَالَ وَٱلْحَمِيرَ } إنما خلقها وأظهرها سبحانه { لِتَرْكَبُوهَا وَ } تجعلوها { زِينَةً } لأنفسكم بين بني نوعكم { وَ } بالجملة: { يَخْلُقُ } لكم ربكم على مقتضى عمله بحوائجكم ومزيناتكم { مَا لاَ تَعْلَمُونَ } [النحل: 8] وتأملون أنتم لأنفسهم مما يعنيكم ويعينكم في النشأة والأخرى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والخيل }: عطف على \" الأنعام \"\n و { زينة }: مفعول من أجله، عطف على موضع \" لتركبوها \": أي: للركوب والزينة، أو مفعول مطلق، أي: لتتزينوا بها زينة\n يقول الحقّ جلّ جلاله: { خلق السماوات والأرض }: أوجدهما { بالحق } أي: ملتبسًا بالحق لتدل على وحدانية الحق، وكمال قدرته وباهر حكمته، حيث أوجدهما على مقدار مخصوص، وشكل بديع، وأوضاع مختلفة، وهيئات متعددة\n أو: خلقهما بقضائه وتدبيره الحق، لا بمشاركةِ وتدبيرِ أحد معه، ولا بمعاونة شريك ولا ظهير، ولذلك نزه نفسه بقوله: { تعالى عمّا يشركون } ، كما نزه نفسه، ابتداءً، لَمَّا نفَى الاستعجال لأنه من تدبير الخلق أيضًا والصدور عن رأيهم، وفي معناه: تنزيل الوحي على ما يشاء لا على ما يشاء غيره لانفراده أيضًا في ملكه\n وفي إبرازه ذلك، على ما يخالف آراء الخلق، أدل دليل على وحدانيته في ملكه، وإنما وضع كل شيء ودبره دلالة على وحدانيته وهدايته لخلقه إليه\n ثم شفع بخلق الإنسان فقال: { خلق الإنسان } أي: جنسه { من نُطفة }: من ماء مهين يخرج من مكان مهين، { فإذا هو خصيم مبين }: مجادل، كثير الجدل والخصام، مبين لحجته، أو: خصيم: مكافح لخالقه، قائل: { مَن يحيي العظام وهي رميم }\n\n\n \" رُوي أن أُبيّ بن خَلَف أتى النبي صلى الله عليه وسلم بِعَظْمٍ رَمِيم، فقال: يا محمد، أترَى الله يُحيِي هذا بعد ما قد رمَّ؟ فقال: نعم \" \n\nفنزلت\n فعلى الأول: تكون الآية عامة لكل إنسان، وعلى الثاني: خاصة بالكافر\n والأول أظهر\n ولمَّا ذكر نعمة الإيجاد ذكر نعمة الإمداد، فقال: { والأنعامَ } وهي: الإبل والبقر والغنم، { خلقها }: أوجدها { لكم فيها دِفءٌ } ما يُدْفأُ به فيقي البرد، يعني: ما يتخذ من جلود الأنعام وأصوافها من الثياب، { و } لكم فيها أيضًا { منافعُ } أُخر كنسلها وظهورها\n وإنما عبَّر بالمنافع ليتناول عِوضها\n { ومنها تأكلون } أي: تأكلون ما يؤكل منها من اللحوم والشحوم والألبان\n\n\n{ ولكم فيها جَمَالٌ } أي: زينة وبهجة { حين تُريحون } تردونها من مراعيها إلى مِرَاحِها بالعشي، { وحين تسرحون } تخرجونها إلى المرعى بالغداة فإن الأفنية والمشارعَ والطرق تتزين بها في الذهاب والرواح، ويجل أهلها في أعين الناظرين إليها\n وقدَّم الإراحة لأن الجمال فيها أظهر لأنها تقبل ملأى البطون، حاملة الضروع، ثم تأوي إلى الحظائر حاضرة لأهلها\n { وتحمل أثقالكم }: أحمالكم عليها من الأمتعة وغيرها { إلى بلدٍ } بعيد، { لم تكونوا بالغيه } عليها، فضلاً عن أن تحملوها على ظهوركم، { إلا بِشِقِّ الأنفس } إلا بكلفة ومشقة فديحة، أو: إلا بذهاب شِقها، أي: نصف قوتها من التعب\n { إن ربكم لرؤوف رحيم } حيث رحمكم بخلقها وذللها للحمل، والركوب عليها، وأنعم عليكم بالكل من لحومها وألبانها\n { و } خلق لكم { الخيلَ والبغال والحميرَ لتركبوها } ، { و } تتزينوا بها { زينةً } ، أو للركوب والزينة\n قال البيضاوي: وتغيير النظم - أي: حيث لم يقل: وللزينة - لأن الزينة بفعل الخالق، والركوب من فعل المخلوق - أي: باعتبار الحكمة -، ولأن المقصود خلقها للركوب، وأما التزين بها فحاصل بالعَرَضِ\n وقرئ بغير واو، فيحتمل أن يكون علة لركوبها، أو مصدرًا في موضع الحال من الضمير، أي: متزينين، أو متزينًا بها\n واستُدِلَّ به على حرمة لحومها، ولا دليل فيه إذ لا يلزم من تعليل الفعل بما يُقصد منه، غالبًا، ألا يقصد منه غيره أصلاً، ويدل عليه أن الآية مكية\n وعامة المفسرين والمحدثين أن الحمر الأهلية حرمت عام خيبر\n هـ\n { ويخلق ما لا تعلمون } مما لا يُحيط البشرُ بعلمها من عجائب المخلوقات، وضروب المصنوعات، مما يؤكل ومما لا يؤكل، وما خلق في الجنة والنار، مما لا يخطر على قلب بشر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:50",
      "similarity": 0.2033198223456545
    },
    {
      "verse": "62:5",
      "similarity": 0.1911331013515145
    },
    {
      "verse": "59:6",
      "similarity": 0.15777021162349966
    },
    {
      "verse": "35:27",
      "similarity": 0.15473916536397214
    },
    {
      "verse": "31:19",
      "similarity": 0.14963517944594462
    }
  ]
}