{
  "chapter": "النحل",
  "text": "ويوم نبعث من كل امة شهيدا ثم لا يؤذن للذين كفروا۟ ولا هم يستعتبون",
  "translations": [
    {
      "translation": "On the Day We raise up a witness from every nation, those who were kafir will not be excused nor will they be able to appease Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We shall call a witness from every people, the unbelievers will not be allowed to make excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are heedless of) the Day when We shall raise a witness from each community and then the unbelievers will neither be allowed to plead nor will they be asked to repent and seek pardon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We will call a witness from every nation, the disbelievers will not be given permission for anything, nor will they be allowed to seek solicitation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day when We will raise up a witness from every nation – then there will be no leave for the disbelievers, nor will they be appeased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when We resurrect a witness from each nation, then those who disbelieve will not be given leave, nor will they be allowed (to return to the world) to repent and ask for Allah's forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We will raise up a witness out of every nation, then shall no permission be given to those who disbelieve, nor shall they be made to solicit favor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day We shall raise up from every nation a witness, then to the unbelievers no leave shall be given, nor shall they be suffered to make amends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (bethink you of) the day when we raise up of every nation a witness, then there is no leave for disbelievers, nor are they allowed to make amends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We raise up a witness from every people, those who were bent on denying the truth will not be permitted to put forward excuses, or to make amends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bewore a Day whereon We will raise up from each community a witness, then those who have disbelieved will not be given leave, nor they will be permitted to please Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We shall raise a witness from every nation, the faithless will not be permitted [to speak], nor will they be asked to propitiate [Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One Day We shall raise from all Peoples a Witness: then will no excuse be accepted from Unbelievers, nor will they receive any favours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day when We shall raise up from each nation a witness (their Messenger), then, those who have disbelieved will not be given leave (to put forward excuses), nor will they be allowed (to return to the world) to repent and ask for Allah's Forgiveness (of their sins, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day We shall raise up from every nation a witness, then permission will not be given to the unbelievers, nor shall they be allowed to make restitution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We raise up a witness from every community—those who disbelieved will not be permitted, nor will they be excused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] the Day when We will resurrect from every nation a witness. Then it will not be permitted to the disbelievers [to apologize or make excuses], nor will they be asked to appease [Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:84] And, mention, the day We shall raise up from every community a witness, and this will be it [that community’s] prophet, to bear witness for it and against it, and this [day] is the Day of Resurrection; then the disbelievers will not be given permission, to make excuses, nor will they be asked to make amends, that is, [nor will they be asked] to [repent and] return to that which pleases God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (bethink you of) the day when We raise up of every nation) We take from every people (a witness) a prophet who testifies that he conveyed the message to them, (then there is no leave for disbelievers) to speak, (nor are they allowed to make amends) nor are they allowed to return to this worldly life.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويوم نبعث من كل أمة شهيداً } أي: نبعث نبيهم على غاية الكمال الذي يمكن لأمّته الوصول إليه أو التقرّب منه والتوجه إليه لإمكان معرفتهم إياه فيعرفونه، ولهذا يكون لكل أمة شهيد غير شهيد الأمة الأخرى، ويعرف كل من قصر وخالف نبيه بالإعراض عن الكمال الذي هو يدعو إليه، والوقوف في حضيض النقصان قصوره واحتجابه فلا حجة له ولا نطق، فيبقى متحيّراً متحسراً، وهو معنى قوله: { ثم لا يؤذن للذين كفروا } ولا سبيل له إلى إدراك ما فاته من كماله لعدم آلته، ولا يمكن أن يرضى بحاله لقوّة استعداده الفطري الذي جُبِلَ عليه، وشوقه الأصلي الغريزي إليه، فهو مكظوم لا يستعتب ولا يسترضي\n { وألقوا إلى الله يومئذ السلم } أي: الاستسلام والانقياد\n وقد جاء إنكارهم كقوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل { يَوْمَ نَبْعَثُ مِن كُلِّ أُمَّةٍ شَهِيداً } وهو نبيهم القائم بأمرهم\n المشرف الناظر بحالهم من قبل الحق\n يشهد لهم وعليهم بالإيمان والكفر\n ويوم العرض والجزاء { ثُمَّ لاَ يُؤْذَنُ لِلَّذِينَ كَفَرُواْ } لا يُمهلون للاعتذار\n ولا يُقبل منهم إن اعتذروا { وَلاَ هُمْ يُسْتَعْتَبُونَ } [النحل: 84] ويسترضون من العتبى\n وهي الرضا\n\n\n{ وَإِذَا رَأى ٱلَّذِينَ ظَلَمُواْ } أنفسهم بالعرض على المهالك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { تبيانًا }: حال من الكتاب، وهو مصدر، قال في القاموس: والتبيان: مصدر شاذ\n وفي ابن عطية: والتبيان: اسم، لا مصدر\n والمصادر في مثله مفتوحة، كالترداد والتكرار\n هـ\n وقال في الصحاح: لم يجيء على الكسر إلا هذا، والتِّلقاء\n هـ\n يقول الحقّ جلّ جلاله: { و } اذكر { يومَ نبعثُ من كل أمة } من الأمم { شهيدًا } أي: رسولاً يشهد لها أو عليها، بالإيمان أو بالكفر، وهو يوم القيامة، { ثم لا يُؤْذَنُ للذين كفروا } في الاعتذار إذ لا عذر لهم\n أو: في الرجوع إلى الدنيا\n وعبَّر بثم لزيادة ما يحيق بهم من شدة المنع من الاعتذار، مع ما فيه من الإقناط الكلي\n { ولا هم يُستعتَبون }: لا يطلب منهم العتبى، أي: الرجوع إلى ما يرضي الله\n والمعنى: أنهم لا يؤذن لهم في الاعتذار عما فرطوا فيه مما يرضي الله، ولا يطلب منهم الرجوع إلى تحصيله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:24",
      "similarity": 0.7747065010055945
    },
    {
      "verse": "45:35",
      "similarity": 0.7580224766849721
    },
    {
      "verse": "30:57",
      "similarity": 0.7473021422251874
    },
    {
      "verse": "16:89",
      "similarity": 0.1981416837947411
    },
    {
      "verse": "2:213",
      "similarity": 0.15724097383037536
    }
  ]
}