{
  "chapter": "النحل",
  "text": "الذين كفروا۟ وصدوا۟ عن سبيل الله زدنهم عذابا فوق العذاب بما كانوا۟ يفسدون",
  "translations": [
    {
      "translation": "As for those who were kafir and barred access to the way of Allah. We will heap punishment on top of their punishment because of the corruption they brought about.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who deny the truth and obstruct (others) from the way of God, We shall add torment to torment as they were perpetrating corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieved and barred others from the way of Allah, We shall add further chastisement to their chastisement for all the mischief they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers who had created obstacles in the way leading to God will face manifold torments as a result of their evil deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved and prevented from the way of Allah – We added punishment upon the punishment – the recompense of their mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved and tried to obstruct the path of Allah, for them We will add torment on top of the torment because of the corruption they spread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who disbelieve and turn away from Allah's way, We will add chastisement to their chastisement because they made mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that disbelieve and bar from the way of God -- them We shall give increase of chastisement upon chastisement, for that they were doing corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who disbelieve and debar (men) from the way of Allah, We add doom to doom because they wrought corruption,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon all who were bent on denying the truth and who turned others away from the path of God, We will heap punishment upon punishment, in return for all the corruption that they brought about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved and hindered others from the way of Allah- We shall increase for them torment upon torment for they have been spreading corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are faithless and bar from the way of Allah—We shall add punishment to their punishment because of the corruption they used to cause.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Allah and hinder (men) from the Path of Allah - for them will We add Penalty to Penalty; for that they used to spread mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved and hinder (men) from the Path of Allah, for them We will add torment over the torment; because they used to spread corruption [by disobeying Allah themselves, as well as ordering others (mankind) to do so].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and bar others from the Path of Allah, We shall add punishment upon their punishment because they were corrupting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and obstruct from God’s path—We will add punishment to their punishment, on account of the mischief they used to make.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved and averted [others] from the way of Allah - We will increase them in punishment over [their] punishment for what corruption they were causing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:88] Those who disbelieve and bar, people, from the way of God, [from] His religion, them, We shall add chastisement to [their] chastisement, that [chastisement] which they have merited for their disbelief — Ibn Mas‘ūd said, ‘[Their chastisment will consist of] scorpions whose fangs are [as long] as the tallest palm trees’ — because of the corruption they used to cause, by their barring people from belief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For those who disbelieve) in Muhammad (pbuh) and in the Qur'an, (and debar (men) from the way of Allah) from the religion and obedience of Allah, (We add doom) the doom of snakes, scorpions, hunger, thirst, biting cold and other things (to doom) to the doom of hell (because they wrought corruption) because of what they said and did of transgressions and idolatry. 292\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَذَاباً فَوْقَ ٱلْعَذَابِ } قالَ زيدُ بن علي عليهما السلامُ معناهُ عَقارِبٌ لَها أَنيابٌ كَأنيابِ النَّخلِ الطّوالِ، وهي أَفاعي النَّار!\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { ٱلَّذِينَ كَفَرُواْ } وأعرضوا عن الحق بأنفسهم { وَ } مع ذلك { صَدُّواْ } ومنعا ضعفاء الأنام { عَن سَبِيلِ ٱللَّهِ } الموصِل إلى توحيده، وهو اشرع الشريف المصطفوي { زِدْنَاهُمْ } في النشأة الأخرى بسبب ضلالهم وإضلالهم { عَذَاباً فَوْقَ ٱلْعَذَابِ بِمَا كَانُواْ يُفْسِدُونَ } [النحل: 88] الغير عن متابعتك يا أكمل الرسل، ويفسدون في أنفسهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الذين كفروا وصدُّوا } الناس { عن سبيل الله } بالمنع من الإسلام، والحمل على الكفر، { زدناهم عذابًا } بصدهم، { فوق العذابِ } المستحق بكفرهم\n قال ابن مسعود: \" عقارب، أنيابها كالنخل الطوال، تلسعهم \"\n وعن عبيد بن عمير: عقارب كالبغال الدُّلْم - أي: السود جدًا -، والأدلم: الشديد السواد\n وذلك العذاب { بما كانوا يُفسدون } أي: بكونهم مفسدين بصدهم عما فيه صلاح العالم\n { و } اذكر أيضًا: { يومَ نبعثُ في كل أمةٍ شهيدًا عليهم من أنفسهم } يعني: نبيهم فإنَّ نبي كل أمة بعث منها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "47:1",
      "similarity": 0.4876489776036517
    },
    {
      "verse": "4:167",
      "similarity": 0.4738020453336698
    },
    {
      "verse": "47:34",
      "similarity": 0.4366567687520287
    },
    {
      "verse": "43:37",
      "similarity": 0.4348252134822945
    },
    {
      "verse": "63:2",
      "similarity": 0.3975776482516493
    }
  ]
}