{
  "chapter": "النحل",
  "text": "واذا رءا الذين اشركوا۟ شركاءهم قالوا۟ ربنا هؤلاء شركاؤنا الذين كنا ندعوا۟ من دونك فالقوا۟ اليهم القول انكم لكذبون",
  "translations": [
    {
      "translation": "When the idolaters see their partners they will call out: \"O our Lord, these are the partners we invoked instead of You;\" but they will retort: \"You are liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who associated others with Allah in His Divinity will see those to whom they ascribed this share, they will say: \"Our Lord! These are the beings to whom we ascribed a share in Your Divinity and whom we called upon instead of You,\" whereupon those beings will fling at them the words: \"You are liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the idolators see their idols, they will say, \"Lord, these are the idols whom we worshipped instead of you.\" But the idols will say, \"They are liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the polytheists will see their ascribed partners, they will say, “Our Lord! These are our partners whom we used to worship besides You”; so they will strike back at them with the saying, “You are indeed liars!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who associated partners with Allah see their partners, they will say: \"Our Lord! These are our partners whom we used to call upon besides you.\" But they will throw back their statement at them (saying): \"You indeed are liars!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who associate (others with Allah) shall see their associate-gods, they shall say: Our Lord, these are our associate-gods on whom we called besides Thee. But they will give them back the reply: Most surely you are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the idolaters behold their associates, they shall say, 'Our Lord, these are our associates on whom we called apart from Thee.' They will fling back at them the saying, 'Surely, you are truly liars.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who ascribed partners to Allah behold those partners of theirs, they will say: Our Lord! these are our partners unto whom we used to cry instead of Thee. But they will fling to them the saying: Lo! ye verily are liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who associate partners with God see their associate gods, they will say, \"Our Lord, these are our associate gods whom we used to call upon instead of You.\" But they will throw back their words at them, [saying], \"Indeed you are liars,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who have associated will behold their associate-gods, they will say: our Lord! yonder are our associate-gods upon whom we have been calling beside Thee, they Will proffer them the saying: verily ye are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the polytheists sight their partners, they will say, ‘Our Lord! These are our partners whom we used to invoke besides You.’ But they will retort to them, ‘You are indeed liars!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who gave partners to Allah will see their \"partners\", they will say: \"Our Lord! these are our 'partners,' those whom we used to invoke besides Thee.\" But they will throw back their word at them (and say): \"Indeed ye are liars!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who associated partners with Allah see their (Allah's so-called) partners, they will say: \"Our Lord! These are our partners whom we used to invoke besides you.\" But they will throw back their word at them (and say): \"Surely! You indeed are liars!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the idolaters see their associates they will say: 'Our Lord, these are our associates on whom we called other than You' But they will throw back at them saying: 'Surely, you are truly liars'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the idolaters see their associates, they will say, “Our Lord, these are our associates whom we used to invoke besides You.” They will strike back at them with the saying, “Surely you are liars.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who associated others with Allah see their \"partners,\" they will say,\" Our Lord, these are our partners [to You] whom we used to invoke besides You.\" But they will throw at them the statement, \"Indeed, you are liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:86] And when the idolaters behold their associates, of devils and others, they will say, ‘Our Lord, these are our associates whom we used to invoke, [whom we used] to worship, besides You’. But they will fling to them the saying, that is, they will say to them: ‘You are indeed liars!’, when you say that you used to worship us — as is stated [by them] in another verse: ‘It was not us that they worshipped’ [Q. 28:63]; [and also in the verse] They will deny their worship of them [Q. 19:82].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when those who ascribed partners to Allah behold those partners of theirs) their gods, (they will say: Our Lord!) our Lord! (these are our partners) our gods (unto whom we used to cry instead of Thee) they commanded us to worship them. (But they will fling to them the saying) i.e. the idols will answer them and say: (Lo! ye verily are liars!) in what you say: we never commanded you to worship us nor were we aware of your worship.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَألْقَوْا إِلَيْهِمُ ٱلْقَوْلَ } معناهُ قالُوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الله { إِذَا رَأى ٱلَّذِينَ أَشْرَكُواْ شُرَكَآءَهُمْ } حين يأسوا وقنطوا من شفاعتهم ومعاونتهم، وعاينوهم أنهم هكلى أمثالهم { قَالُواْ } متضرعين إلى الله نادمين: { رَبَّنَا } يا من ربَّانا بأنواع اللطف والكرم، فكَفَرنا نعمك و بك، وبأوامرك ونواهيك الجارية على ألسنة رسلك { هَـٰؤُلآءِ } الهلكى الغاوون { شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدْعُوْا مِن دُونِكَ } عناداً ومكابرةً، وبواسطة هؤلاء الضُلاّل رَدَدْنا قول أنبيائك ورسلك وكتبك، ثمَّ لما سمع شركاؤهم منهم قولهم هذا { فَألْقَوْا } وأجابوا { إِلَيْهِمُ ٱلْقَوْلَ }: ما تَدْعُون وما تعبدون إيها الضالون الظالمون إلاَّ أهويتكم وأمانيكم { إِنَّكُمْ لَكَاذِبُونَ } [النحل: 86] مقصورون على الكذب والزور في دعوى إطاعتنا وعبادتنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا رأى الذين أشركوا شركاءَهم }: أوثانهم التي دعوها شركاء الله، أو الشياطين الذين شاركوهم في الكفر بالحمل عليه، { قالوا ربنا هؤلاء شركاؤنا الذين كنا ندعُو من دونك } أي: نعبدهم ونطيعهم من دونك\n وهو اعتراف بأنهم كانوا مخطئين في ذلك\n { فأَلْقَوا إليهم القولَ } قالوا لهم: { إنكم لكاذبون } أي: أجابوا بالتكذيب في أنهم شركاء الله، أو أنهم عبدوهم حقيقة، وإنما عبدوا أهواءهم كقوله:\n\n[مريَم: 82]، وقوله:\n\n[القَصَص: 63]، أو لأنهم، لما كانوا غير راضين بعبادتهم، فكأن عبادتهم لم تكن لهم",
      "translations": []
    }
  ]
}