{
  "chapter": "النحل",
  "text": "ولا تكونوا۟ كالتى نقضت غزلها منۢ بعد قوة انكثا تتخذون ايمنكم دخلۢا بينكم ان تكون امة هى اربى من امة انما يبلوكم الله به وليبينن لكم يوم القيمة ما كنتم فيه تختلفون",
  "translations": [
    {
      "translation": "Do not be like a woman who spoils the thread she has spun by unravelling it after it is strong, by making your oaths a means of deceiving one another, merely because one community is bigger than another. Allah is only testing you by this. He will make clear to you on the Day of Rising the things about which you differed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like her who untwists her yarn having spun it into durable thread. Do not use your oaths deceitfully because one party has ascendency over you. God surely tries you in this way: He will make it clear to you on the Day of Resurrection what you were differing about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not become like the woman who, after having painstakingly spun her yarn, caused it to disintegrate into pieces. You resort to oaths as instruments of mutual deceit so that one people might take greater advantage than another although Allah puts you to the test through this. Surely on the Day of Resurrection He will make clear the Truth concerning the matters over which you differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like the lady behind the spinning wheel who has broken the yarn by pulling it with unnecessary force. You must not consider your oaths as means of deceit to benefit one party and incur loss upon the other. God tests your faith by your oaths. He will make clear to you who was right and who was wrong on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like the woman broke her thread into bits after she had manufactured it; you make your oaths a phoney excuse between yourselves lest one nation may not be more than the other; Allah just tries you with it; and He will surely clarify for you on the Day of Resurrection, the matters in which you differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like the one who undoes the thread which she has spun, after it has become strong, by taking your oaths as a means of deception among yourselves when one group is more numerous than another group. Allah only tests you by this, and on the Day of Resurrection, He will certainly clarify that which used to differ over.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like her who unravels her yarn, disintegrating it into pieces after she has spun it strongly. You make your oaths to be means of deceit between you because (one) nation is more numerous than (another) nation. Allah only tries you by this; and He will most certainly make clear to you on the resurrection day that about which you differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not as a woman who breaks her thread, after it is firmly spun, into fibres, by taking your oaths as mere mutual deceit, one nation being more numerous than another nation. God only tries you thereby; and certainly He will make clear to you upon the Day of Resurrection that whereon you were at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like unto her who unravelleth the thread, after she hath made it strong, to thin filaments, making your oaths a deceit between you because of a nation being more numerous than (another) nation. Allah only trieth you thereby, and He verily will explain to you on the Day of Resurrection that wherein ye differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not, like the woman who unravels her yarn after its strands have been firmly spun, use your oaths as a means of deceiving one another, just because one community could become bigger than another. God is only testing you by means of this. On the Day of Resurrection He will make it clear to you what you differed about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like unto her who unravelleth her yarn into strands after its strength, holding your oaths a means of discord amongst you that a community may be more numerous than anot her community; Allah only proveth you there by; and He will surely manifest unto you on the Judgment Day that wherein ye have been differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like her who would undo her yarn, breaking it up after [spinning it to] strength, by making your oaths a means of [mutual] deceit among yourselves, so that one community may become more affluent than another community. Indeed Allah tests you thereby, and He will surely clarify for you on the Day of Resurrection what you used to differ about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like a woman who breaks into untwisted strands the yarn which she has spun, after it has become strong. Nor take your oaths to practise deception between yourselves, lest one party should be more numerous than another: for Allah will test you by this; and on the Day of Judgment He will certainly make clear to you (the truth of) that wherein ye disagree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like her who undoes the thread which she has spun after it has become strong, by taking your oaths a means of deception among yourselves, lest a nation may be more numerous than another nation. Allah only tests you by this [i.e. who obeys Allah and fulfills Allah's Covenant and who disobeys Allah and breaks Allah's Covenant]. And on the Day of Resurrection, He will certainly make clear to you that wherein you used to differ [i.e. a believer confesses and believes in the Oneness of Allah and in the Prophethood of Prophet Muhammad SAW which the disbeliever denies it and that was their difference amongst them in the life of this world].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like the woman who breaks her thread, after it is firmly spun into fibers, by taking your oaths as mere mutual deceit, one nation being more numerous than the other. Allah tries you with it. On the Day of Resurrection, He will clarify to you everything on which you were at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like her who unravels her yarn, breaking it into pieces, after she has spun it strongly. Nor use your oaths as means of deception among you, because one community is more prosperous than another. God is testing you thereby. On the Day of Resurrection, He will make clear to you everything you had disputed about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like she who untwisted her spun thread after it was strong [by] taking your oaths as [means of] deceit between you because one community is more plentiful [in number or wealth] than another community. Allah only tries you thereby. And He will surely make clear to you on the Day of Resurrection that over which you used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:92] And do not be like her who undoes, spoils, her yarn, that which she has spun, after having made it strong, [having] set and spun it, [breaking it up] into fibres (ankāthan is a circumstantial qualifier, [ankāth is] the plural of nikth, and means that which is undone [yunkathu]) — this was an imbecile Meccan woman who used to spin all day and then undo it — by making (tattakhidhūna is a circumstantial qualifier referring to the person of [the verb] takūnū, ‘[do not] be like’), in other words, [what is meant is] ‘do not be like her by making’, your oaths a [means of] deceit, (dakhal, is what enters [yadkhulu] into something but does not belong to it), in other words, as [a means of causing] mischief or as trickery, between you, by breaking these [oaths], so that one group may become more numerous than [another] group. They used to enter into an alliance with a given group, but if they encountered another more numerous and more powerful [group], they would renege on their alliance with the former and forge a [new] alliance with these [latter]. God only tries, tests, you thereby, in other words, by that which He enjoins, in the way of fulfilling the covenant, so that He may observe the obedient and the disobedient among you, or when [it is the case that] one group is more numerous [than another], that He may observe whether you fulfil [your obligation to them] or not; and certainly He will make clear to you on the Day of Resurrection that wherein you used to differ, during [the life of] this world, with regard to covenants and otherwise, by punishing he who reneged and rewarding he who was faithful [to his covenant].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And be not) in terms of breaking pledges (like unto her) i.e. Ra'itah, the fool (who unravelleth the thread, after she has made it strong, to thin filaments, making your oaths) your pledges (a deceit) and treachery (between you because of a nation) a group (being more numerous than (another) nation) another group. (Allah only trieth you thereby) He tests you with your numerousness; and it is also said: He tests you with the breaking of pledges, (and He verily will explain to you on the Day of Resurrection that wherein ye differed) in the matter of religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُوَّةٍ أَنكَاثاً } فالقُوةُ: الكُبَّةُ\n والأَنْكَاثُ: المَنقوضةُ مِنهَا\n\n\n\n\nوقوله تعالى: { دَخَلاً بَيْنَكُمْ } معناهُ فَسَادٌ\n\n\n\n\nوقوله تعالى: { هِيَ أَرْبَىٰ مِنْ أُمَّةٍ } معناه أكثرُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {with power and great ability}, the meaning of \"power\" here is \"greatness\".\n\n\nAnd the ankath: the broken-off part of it.\n\n\nAnd His saying, \"Enter between you,\" means corruption.\n\n\nAnd His saying, \"She is the most beloved of all nations,\" means that she is more beloved.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما علم الله منكم ما فعلتم ونقضتم من الأيمان { لاَ تَكُونُواْ } في نقضها وعدم وثوقها { كَٱلَّتِي } أي: كالمرأة التي { نَقَضَتْ } ونفقيت { غَزْلَهَا مِن بَعْدِ قُوَّةٍ } أي: بعدما غزلتها وفتلتها قويةً محكمةً نقضتها { أَنكَاثاً } بلا غرضٍ يترتب على نقضها سوى الجنون والجزن\n فأنتم كذلك في نقضكم أيمانكم الوثيقة بذكر الله وعلمه بلا غرضٍ منكم يتعلق بنقضها سوى أنكم { تَتَّخِذُونَ أَيْمَانَكُمْ } أي: نقضها { دَخَلاً } أي: خديعةً ومكيدةً واقعةً { بَيْنَكُمْ } محفوظةً إلى { أَن تَكُونَ } وتقع { أُمَّةٌ } قوية { هِيَ أَرْبَىٰ } أيك أقوى وأزيد عَدَداً وعُدَداً { مِنْ أُمَّةٍ } أنتم تحلفون معهم\n فتنقضون حلف الأمة الضعيفة\n وتتبعون القوية بعد نقض العهود واليمين\n وما هذا إلاَّ مكر وخديعة مع الله\n ومع عباده { إِنَّمَا يَبْلُوكُمُ } ويختبركم { ٱللَّهُ بِهِ } أي: بازدياد القوية\n لكي يظهر أتمسكون إيمانكم أم تنقضون { وَلَيُبَيِّنَنَّ } ويوضح { لَكُمْ يَوْمَ ٱلْقِيَامَةِ مَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ } [النحل: 92] فيثيبكم بالوفاء\n ويفضحكم ويعاقبكم بالنقض\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أن تكون }: مفعول من أجله، و { تتخذون }: جملة حالية من ضمير \" تكونوا \"\n يقول الحقّ جلّ جلالة: { وأوفوا بعهد الله } كالبيعة للرسول - عليه الصلاة والسلام - وللأمراء، والأيمان، والنذور، وغيرها، { إذا عاهدتم } الله على شيء من ذلك، { ولا تَنقضوا الأيمان } أيمان البيعة، أو مطلق الأيمان، { بعد توكيدها } بعد توثيقها بذكر الله، أو صفته، أو أسمائه، { وقد جعلتم الله عليكم كفيلاً } شاهدًا ورقيبًا، بتلك البيعة فإن الكفيل مراع لحال المكفول رقيب عليه، { إن الله يعلم ما تفعلون } في نقض الأيمان والعهود\n وهو تهديد لمن ينقض العهد، وهذا في الأيمان التي في الوفاء بها خير، وأما ما كان تركه أولى فيُكَفِّرْ عن يمينه، وليفعل الذي هو خير، كما في الحديث\n { ولا تكونوا كالتي نَقَضَتْ غزلها }: أفسدته { من بعد قوة } أي: إبرام وإحكام { أنكاثًا } أي: طاقات، أي: صيرته طاقات كما كان قبل الغزل، بحيث حلت إحكامه وإبرامه، حتى صار كما كان، والمراد: تشبيه الناقض بمَن هذا شأنه، وقيل: هي \" ريطة بنت سعد القرشية \" فإنها كانت خرقاء - أي: حمقاء - تغزل طول يومها ثم تنقضه، فكانت العرب تضرب به المثل لمن قال ولم يُوف، أو حلف ولم يَبر في يمينه\n { تتخذون أيمانكم دخلا بينكم } أي: لا تكونوا متشبهين بامرأة خرقاء، متخذين أيمانكم مفسدة ودخلا بينكم\n وأصل الدخل: ما يدخل الشيء، ولم يكن منه، يقال: فيه الدخل والدغل، وهو قصد الخديعة\n تفعلون ذلك النقض لأجل { أن تكون أُمةٌ هي أربى من أمةٍ }: بأن تكون جماعة أزيد عدداً وأوفر مالاً، من جماعة أخرى، فتنقضون عهد الأولى لأجل الثانية لكثرتها\n نزلت في العرب، كانت القبيلة منهم تحالف الأخرى، فإذا جاءها قبيلة أقوى منها، غدرت الأولى، وحالفت الثانية\n وقيل: الإشارة بالأربى هنا إلى كفار قريش إذ كانوا حينئذ أكثر من المسلمين، فحذر من بايع على الإسلام أن ينقضه لما يرى من قوة كفار قريش\n { إنما يبلوكم }: يختبركم { اللهُ به } بما أمر من الوفاء بالعهد لينظر المطيع منكم والعاصي\n أو: بكون أمة هي أربى، لينظر أتتمسكون بحبل الوفاء بعهد الله وبيعة رسوله، أم تَغْتَرُّونَ بكثرة قريش وشوكتهم، وقلة المؤمنين وضعفهم؟ { وليُبَيننَّ لكم يوم القيامة ما كنتم فيه تختلفون } في الدنيا حين يجازيكم على أعمالكم بالثواب والعقاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:50",
      "similarity": 0.19585480877497569
    },
    {
      "verse": "9:13",
      "similarity": 0.19419476291123305
    },
    {
      "verse": "48:10",
      "similarity": 0.18455745479116759
    },
    {
      "verse": "7:135",
      "similarity": 0.18057764933699708
    },
    {
      "verse": "9:12",
      "similarity": 0.17744704081439303
    }
  ]
}