{
  "chapter": "النحل",
  "text": "فاذا قرات القرءان فاستعذ بالله من الشيطن الرجيم",
  "translations": [
    {
      "translation": "Whenever you recite the Qur'an, seek refuge with Allah from the accursed Shaytan.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when you recite the Qur'an seek refuge in God from Satan the execrable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever you read the Qur'an seek refuge with Allah from Satan, the accursed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), when you recite the Quran, seek refuge in God from the mischief of satan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you recite the Qur’an, seek the refuge of Allah from Satan the outcast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you recite the Qur'an, seek refuge with Allah from Shaytan, the outcast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you recite the Quran, seek refuge with Allah from the accursed Shaitan,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou recitest the Koran, seek refuge in God from the accursed Satan;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou recitest the Qur'an, seek refuge in Allah from Satan the outcast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you read the Quran, seek God's protection from Satan, the rejected one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou wouldst read the Qur'an seek refuge with Allah from Satan the damned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you recite the Quran, seek the protection of Allah against the outcast Satan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou dost read the Qur'an, seek Allah's protection from Satan the rejected one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you want to recite the Quran, seek refuge with Allah from Shaitan (Satan), the outcast (the cursed one).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you recite the Koran, seek refuge in Allah from the stoned satan:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you read the Quran, seek refuge with God from Satan the outcast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you recite the Qur'an, [first] seek refuge in Allah from Satan, the expelled [from His mercy].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:98] And when you recite the Qur’ān, that is, when you intend to recite it, seek refuge in God from Satan the outcast, in other words, say a‘ūdhu bi’Lllāhi min al-shaytān al-rajīm, ‘I seek refuge in God from the accursed Satan’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when thou recitest the Qur'an) so if you want, Muhammad, to recite the Qur'an at the beginning of the prayer or at any other time, (seek refuge in Allah) say: I seek refuge in Allah (from Satan the outcast) the accursed, the one stoned with a shooting star, the debarred from Allah's mercy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن جملة الأعمال الصالحة المثمرة للحياة الطيبة المعنوية، بل من أجلّها: قراءة القرآن المشتمل على المعارف والحقائق، والمكاشفات والمشاهدات المترتبة على سلوك طريق التوحيد والعرفان { فَإِذَا قَرَأْتَ ٱلْقُرْآنَ } أي: قصدتَ قراءته أيها القارئ الطالب لاستكشاف غوامض مرمزاته، ومعضلات إشاراته { فَٱسْتَعِذْ } والتجأ أولاً { بِٱللَّهِ } المتجلي بصفة الكلام المعجز لقاطبة الأنام، الحفيظ لخلَّص عباده من جميع ما لا يعنيهم من المعاصي والآثام { مِنَ } وساوس { ٱلشَّيْطَانِ ٱلرَّجِيمِ } [النحل: 98] المطرود والمعبد عن ساحة عزِّ الحضور برجوم آثار الأوصاف القهرية الإلهية، ومن غوائله وتسويلاته التي هي جنود الهوى والغفلة، والتخيلات الباطلة، والتوهمات المثيرة لأنواع الأماني والشهوات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { فإِذا قرأتَ القرآنَ } أردت قراءته، كقوله:\n\n[المَائدة: 6]، { فاستعذ بالله من الشيطان الرجيم } أي: فسل الله أن يعيذك من وسواسه لئلا يوسوسك في القراءة، فيحرمك حلاوة التلاوة فإنه عدو لا يحب لابن آدم الربح أبدًا، والجمهور على أنه مستحق عند التلاوة، وعن عطاء: أنه واجب\n ومذهب مالك: أنه لا يتعوذ في الصلاة\n وعند الشافعي وأبي حنيفة: يتعوذ في كل ركعة تمسكًا بظاهر الآية لأن الحكم المرتب على شرط يتكرر بتكرره، وأخذ مالك بعمل أهل المدينة في ترك التعوذ في الصلاة\n وهو تابع للقراءة في السر والجهر، وعن ابن مسعود: قرأتُ على النبي صلى الله عليه وسلم فقلت: أعوذ بالله السميع العليم من الشيطان الرجيم، فقال:\n\n \" قل: أعوذ بالله من الشيطان الرجيم \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:20",
      "similarity": 0.8890429601869265
    },
    {
      "verse": "81:25",
      "similarity": 0.6876146991647375
    },
    {
      "verse": "15:17",
      "similarity": 0.6228017016965616
    },
    {
      "verse": "3:36",
      "similarity": 0.6066078328568806
    },
    {
      "verse": "15:34",
      "similarity": 0.6018373173635494
    }
  ]
}