{
  "chapter": "النحل",
  "text": "ان الله يامر بالعدل والاحسن وايتائ ذى القربى وينهى عن الفحشاء والمنكر والبغى يعظكم لعلكم تذكرون",
  "translations": [
    {
      "translation": "Allah commands justice and doing good and giving to relatives. And He forbids indecency and doing wrong and tyranny. He warns you so that hopefully you will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily God has enjoined justice, the doing of good, and the giving of gifts to your relatives; and forbidden indecency, impropriety and oppression. He warns you so that you may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah enjoins justice, kindness and the doing of good to kith and kin, and forbids all that is shameful, evil and oppressive. He exhorts you so that you may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God commands (people) to maintain justice, kindness, and proper relations with their relatives. He forbids them to commit indecency, sin, and rebellion. God gives you advice so that perhaps you will take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah decrees the commands of justice and kindness, and of giving to relatives, and forbids from the shameful and evil and rebellion; He advises you so that you may pay heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah orders justice and kindness, and giving (help) to the relatives, and He forbids immoral sins, and evil and tyranny. He admonishes you, so that perhaps you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah enjoins the doing of justice and the doing of good (to others) and the giving to the kindred, and He forbids indecency and evil and rebellion; He admonishes you that you may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God bids to justice and good-doing and giving to kinsmen; and He forbids indecency, dishonour, and insolence, admonishing you, so that haply you will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah enjoineth justice and kindness, and giving to kinsfolk, and forbiddeth lewdness and abomination and wickedness. He exhorteth you in order that ye may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God commands justice, kindness and giving their [due to] near relatives, and He forbids all shameful deeds, and injustice and transgression. He admonishes you so that you may take heed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah commandeth justice and well-doing and giving to kindred; and He prohibiteth lewdness and wickedness and oppression; He exhorteth you that haply ye may beadmonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah enjoins justice and kindness, and generosity towards relatives, and He forbids indecency, wrongdoing, and aggression. He advises you, so that you may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah commands justice, the doing of good, and liberality to kith and kin, and He forbids all shameful deeds, and injustice and rebellion: He instructs you, that ye may receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah enjoins Al-Adl (i.e. justice and worshipping none but Allah Alone - Islamic Monotheism) and Al-Ihsan [i.e. to be patient in performing your duties to Allah, totally for Allah's sake and in accordance with the Sunnah (legal ways) of the Prophet SAW in a perfect manner], and giving (help) to kith and kin (i.e. all that Allah has ordered you to give them e.g., wealth, visiting, looking after them, or any other kind of help, etc.): and forbids Al-Fahsha' (i.e. all evil deeds, e.g. illegal sexual acts, disobedience of parents, polytheism, to tell lies, to give false witness, to kill a life without right, etc.), and Al-Munkar (i.e. all that is prohibited by Islamic law: polytheism of every kind, disbelief and every kind of evil deeds, etc.), and Al-Baghy (i.e. all kinds of oppression), He admonishes you, that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah orders justice, and good deeds, and giving to one's kindred. He forbids indecency, dishonor and insolence. He admonishes you in order that you take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God commands justice, and goodness, and generosity towards relatives. And He forbids immorality, and injustice, and oppression. He advises you, so that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah orders justice and good conduct and giving to relatives and forbids immorality and bad conduct and oppression. He admonishes you that perhaps you will be reminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:90] Indeed God enjoins justice — [that is] affirmation of [His] Oneness, or [actually] being fair, and virtue, performance of the [religious] obligations, or that you should worship God as if you were able to see Him, as [reported] in the hadīth; and giving to kinsfolk — He has singled it [kinship] out for mention by way of [highlighting] its importance — and He forbids lewdness, fornication, and abomination, with regard to the [stipulations of the] Law, [abomination] such as disbelief and acts of disobedience, and aggression, wrongdoing against people — He also singles this out for mention by way of [showing] its importance; just as He began with [the mention of] ‘lewdness’, in this way, He admonishes you, through commands and prohibitions, so that you might remember, [that you might] be admonished (tadhakkarūna, ‘you [might] remember’, the original tā’ [of tatadhakkarūna] has been assimilated with the dhāl). In the Mustadrak [of alHākim al-Naysābūrī] it is reported from Ibn Mas‘ūd that [he said]: ‘This [verse] is the most comprehensive verse in the Qur’ān in terms of [what is] good and [what is] evil’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلما جاء أن هذا القرآن تبيان لكل شيء وهدى ورحمة وبشرى للمسلمين حسن التخلّص إلى تبيان أصول الهدى في التشريع للدين الإسلامي العائدة إلى الأمر والنهي ، إذ الشريعة كلها أمر ونهي ، والتّقوى منحصرة في الامتثال والاجتناب ، فهذه الآية استئناف لبيان كون الكتاب تبياناً لكل شيء ، فهي جامعة أصول التّشريع .وافتتاح الجملة بحرف التوكيد للاهتام بشأن ما حوته . وتصديرُهما باسم الجلالة للتّشريف ، وذكر { يأمر } { وينهى } دون أن يقال : اعدلوا واجتنبوا الفحشاء ، للتّشويق . ونظيره ما في الحديث \" إن الله يرضى لكم ثلاثاً ويكره لكم ثلاثاً \" الحديث .والعدل : إعطاء الحقّ إلى صاحبه . وهو الأصل الجامع للحقوق الراجعة إلى الضروري والحاجي من الحقوق الذاتية وحقوق المُعاملات ، إذ المسلم مأمور بالعدل في ذاته ، قال تعالى : { ولا تلقوا بأيديكم إلى التهلكة } \\[ سورة البقرة : 191 \\] ، ومأمور بالعدل في المعاملة ، وهي معاملة مع خالقه بالاعتراف له بصفاته وبأداء حقوقه؛ ومعاملة مع المخلوقات من أصول المعاشرة العائلية والمخالطة الاجتماعية وذلك في الأقوال والأفعال ، قال تعالى : { وإذا قلتم فاعدلوا ولو كان ذا قربى } \\[ سورة الأنعام : 152 \\] ، وقال تعالى : { وإذا حكمتم بين الناس أن تحكموا بالعدل } وقد تقدم في سورة النساء ( 58 ).ومن هذا تفرّعت شعب نظام المعاملات الاجتماعية من آداب ، وحقوق وأقضية ، وشهادات ، ومعاملة مع الأمم ، قال تعالى : { ولا يجرمنّكم شنآن قوم على ألا تعدلوا اعدلوا هو أقرب للتقوى } \\[ سورة المائدة : 8 \\].ومرجع تفاصيل العدل إلى أدلّة الشريعة . فالعدل هنا كلمة مُجملة جامعة فهي بإجمالها مناسبة إلى أحوال المسلمين حين كانوا بمكّة ، فيصار فيها إلى ما هو مقرّر بين الناس في أصول الشرائع وإلى ما رسمته الشريعة من البيان في مواضع الخفاء ، فحقوق المسلمين بعضهم على بعض من الأخوّة والتناصح قد أصبحت من العدل بوضع الشريعة الإسلامية .وأما الإحسان فهو معاملة بالحسنى ممن لا يلزمه إلى من هو أهلها . والحسَن : ما كان محبوباً عند المعامَل به ولم يكن لازماً لفاعله ، وأعلاه ما كان في جانب الله تعالى مما فسّره النبي بقوله : الإحسان أن تعبد الله كأنّك تراه ، فإن لم تكن تراه فإنه يراك . ودون ذلك التقرّب إلى الله بالنوافل . ثم الإحسان في المعاملة فيما زاد على العدل الواجب ، وهو يدخل في جميع الأقوال والأفعال ومع سائر الأصناف إلا ما حُرم الإحسانَ بحكم الشرع .ومن أدْنى مراتب الإحسان ما في حديث الموطأ : «أن امرأة بَغِيّا رأت كلباً يلهث من العطش يأكل الثّرى فنزعت خُفَّها وأدْلَتْه في بئر ونزعت فسقته فغفر الله لها» .وفي الحديث \" إن الله كتب الإحسان على كل شيء فإذا قتلتم فأحسنوا القِتْلة ، وإذا ذبحتم فأحسنوا الذِبْحة \" . ومن الإحسان أن يجازي المحسَنُ إليه المحسِن على إحسانه إذ ليس الجزاء بواجب .فإلى حقيقة الإحسان ترجع أصول وفروع آداب المعاشرة كلها في العائلة والصحبة . والعفوُ عن الحقوق الواجبة من الإحسان لقوله تعالى : { والعافيّن عن الناس والله يحبّ المحسنين } \\[ سورة آل عمران : 134 \\]. وتقدم عند قوله تعالى : { وبالوالدين إحسانا } في سورة الأنعام ( 151 ).وخَصّ الله بالذّكر من جنس أنواع العدل والإحسان نوعاً مُهمّاً يكثر أن يغفل الناس عنه ويتهاونوا بحقّه أو بفضله ، وهو إيتاء ذي القربى فقد تقرّر في نفوس الناس الاعتناء باجتلاب الأبعدِ واتّقاء شرّه ، كما تقرّر في نفوسهم الغفلة عن القريب والاطمئنان من جانبه وتعوّد التساهل في حقوقه . ولأجل ذلك كثر أن يأخذوا أموال الأيتام من مواليهم ، قال تعالى : { وآتوا اليتامى أموالهم } \\[ سورة النساء : 2 \\] ، وقال : { وآت ذا القربى حقّه } \\[ سورة الإسراء : 26 \\] ، وقال : { وما يتلى عليكم في الكتاب في يتامى النساء } \\[ سورة النساء : 127 \\] الآية . ولأجل ذلك صرفوا معظم إحسانهم إلى الأبْعدين لاجتلاب المحمدة وحسن الذّكر بين الناس . ولم يزل هذا الخلق متفشّياً في الناس حتى في الإسلام إلى الآن ولا يكترثون بالأقربين .وقد كانوا في الجاهلية يقصدون بوصايا أموالهم أصحابهم من وجوه القوم ، ولذلك قال تعالى : { كتب عليكم إذا حضر أحدكم الموت إن ترك خيراً الوصية للوالدين والأقربين } \\[ سورة البقرة : 180 \\]. فخصّ الله بالذكر من بين جنس العدل وجنس الإحسان إيتاء المال إلى ذي القربى تنبيهاً للمؤمنين يومئذٍ بأن القريب أحقّ بالإنصاف من غيره . وأحقّ بالإحسان من غيره لأنه محل الغفلة ولأن مصلحته أجدى من مصلحة أنواع كثيرة .وهذا راجع إلى تقويم نظام العائلة والقبيلة تهيئةً بنفوس الناس إلى أحكام المواريث التي شرعت فيما بعد .وعطف الخاص على العام اهتماماً به كثير في الكلام ، فإيتاء ذي القربى ذو حكمين : وجوب لبعضه ، وفضيلة لبعضه ، وذلك قبل فرض الوصية ، ثم فرض المواريث .وذو القربى : هو صاحب القرابة ، أي من المؤتي . وقد تقدّم عند قوله تعالى : { وإذا قلتم فاعدلوا ولو كان ذا قربى } في سورة الأنعام ( 152 ).والإيتاء الإعطاء . والمراد إعطاء المال ، قال تعالى : { قال أتمدّونني بمال فما آتاني الله خير مما آتاكم } \\[ سورة النمل : 76 \\] ، وقال : { وآتى المال على حبّه } \\[ سورة البقرة : 177 \\].ونهى الله عن الفحشاء والمنكر والبغي وهي أصول المفاسد .فأما الفحشاء : فاسم جامع لكل عمل أو قول تستفظعه النفوس لفساده من الآثام التي تفسد نفس المرء : من اعتقاد باطل أو عمل مفسد للخلق ، والتي تضرّ بأفراد الناس بحيث تلقي فيهم الفساد من قتل أو سرقة أو قذف أو غصب مال ، أو تضرّ بحال المجتمع وتدخل عليه الاضطراب من حرابة أو زنا أو تقامر أو شرب خمر . فدخل في الفحشاء كل ما يوجب اختلال المناسب الضروري ، وقد سمّاها الله الفواحش . وتقدم ذكر الفحشاء عند قوله تعالى : { إنما يأمركم بالسوء والفحشاء } في سورة البقرة ( 169 ) ، وقوله : { قل إنما حرّم ربّي الفواحش } في سورة الأعراف ( 33 ) وهي مكية .وأما المنكر فهو ما تستنكره النفوس المعتدلة وتكرهه الشريعة من فعل أو قول ، قال تعالى : { وإنهم ليقولون منكراً من القول وزوراً } \\[ سورة المجادلة : 2 \\] ، وقال : { وتأتون في ناديكم المنكر } \\[ سورة العنكبوت : 29 \\]. والاستنكار مراتب ، منها مرتبة الحرام ، ومنها مرتبة المكروه فإنه منهيّ عنه . وشمل المنكر كل ما يفضي إلى الإخلال بالمناسب الحاجي ، وكذلك ما يعطّل المناسب التحسيني بدون ما يفضي منه إلى ضرّ .وخصّ الله بالذّكر نوعاً من الفحشاء والمنكر ، وهو البغي اهتماماً بالنّهي عنه وسدّاً لذريعة وقوعه ، لأن النفوس تنساق إليه بدافع الغضب وتغفل عما يشمله من النهي من عموم الفحشاء بسبب فُشُوّه بين الناس؛ وذلك أن العرب كانوا أهل بأس وشجاعة وإباء ، فكانوا يكثر فيهم البغي على الغير إذا لقي المُعجَب بنفسه من أحد شيئاً يكرهه أو معاملةً يعُدّها هضيمة وتقصيراً في تعظيمه . وبذلك كان يختلط على مُريد البغي حُسْنُ الذبّ عما يسمّيه الشرف وقُبْحُ مجاوزة حدّ الجزاء .فالبغيُ هو الاعتداء في المعاملة ، إما بدون مقابلة ذنب كالغارة التي كانت وسيلة كسب في الجاهلية ، وإما بمجاوزة الحدّ في مقابلة الذنب كالإفراط في المؤاخذة ، ولذا قال تعالى : { فمن اعتدى عليكم فاعتدوا عليه بمثل ما اعتدى عليكم واتّقوا الله } \\[ سورة البقرة : 194 \\]. وقال : { ذلك ومن عاقب بمثل ما عوقب به ثم بُغِيَ عليه لينصرنّه الله } \\[ سورة الحج : 60 \\]. وقد تقدم عند قوله تعالى : { والإثم والبغي بغير الحقّ } في سورة الأعراف ( 33 ).فهذه الآية جمعت أصول الشريعة في الأمر بثلاثة ، والنهي عن ثلاثة ، بل في الأمر بشيئين وتكملة ، والنّهي عن شيئين وتكملة .روى أحمد بن حنبل : أن هذه كانت السبب في تمكّن الإيمان من عثمان بن مظعون ، فإنها لما نزلت كان عثمان بن مظعون بجانب رسول الله وكان حديثَ الإسلام ، وكان إسلامه حياءً من النبي وقرأها النبي عليه . قال عثمان : فذلك حين استقرّ الإيمان في قلبي . وعن عثمان بن أبي العاص : كنت عند رسول الله جالساً إذ شخص بصره ، فقال : أتاني جبريل فأمرني أن أضع هذه الآية بهذا الموضع { إن الله يأمر بالعدل } الآية اه . وهذا يقتضي أن هذه الآية لم تنزل متّصلة بالآيات التي قبلها فكان وضعها في هذا الموضع صَالحاً لأن يكون بياناً لآية { ونزلنا عليك الكتاب تبياناً لكل شيء } \\[ سورة النحل : 89 \\] الخ ، ولأن تكون مقدّمة لما بعدها { وأوفوا بعهد الله إذا عاهدتم } \\[ سورة النحل : 91 \\] الآية .وعن ابن مسعود : أن هذه الآية أجمع آية في القرآن .وعن قتادة : ليس من خلق حسن كان أهل الجاهلية يعملون به ويستحسنونه إلا أمر الله به في هذه الآية ، وليس من خلق كانوا يتعايرونه بينهم إلا نهى الله عنه وقدح فيه ، وإنما نهى عن سفاسف الأخلاق ومذامّها .وروى ابن ماجه عن عليّ قال : أمر الله نبيئه أن يعرض نفسه على قبائل العرب ، فخرج ، فوقف على مجلس قوم من شيبان بن ثعلبة في الموسم .فدعاهم إلى الإسلام وأن ينصروه ، فقال مفروق بن عمرو منهم : إلاَم تدعونا أخا قريش ، فتلا عليهم رسول الله : إن الله يأمر بالعدل والإحسان } الآية . فقال : دعوتَ والله إلى مكارم الأخلاق ومحاسن الأعمال ولقد أفك قوم كذّبوك وظاهروا عليك .وقد روي أن الفقرات الشهيرة التي شهد بها الوليد بن المغيرة للقرآن من قوله : «إن له لحلاوة ، وإن عليه لطلاوة ، وإن أعلاه لمثمر ، وإن أسفله لمغدق ، وما هو بكلام بشر» قالها عند سماع هذه الآية .وقد اهتدى الخليفة عمر بن عبد العزيز رحمه الله إلى ما جمعته هذه الآية من معاني الخير فلما استخلف سنة 99 كتب يأمر الخطباء بتلاوة هذه الآية في الخطبة يوم الجمعة وتُجعل تلاوتها عوضاً عما كانوا يأتونه في خطبة الجمعة من كلمات سبّ عليّ بن أبي طالب رضي الله عنه . وفي تلاوة هذه الآية عوضاً عن ذلك السبّ دقيقةُ أنها تقتضي النّهي عن ذلك السبّ إذ هو من الفحشاء والمنكر والبغي .ولم أقف على تعيين الوقت التي ابتدع فيه هذا السبّ ولكنه لم يكن في خلافة معاوية رضي الله عنه .وفي «السيرة الحلبية» أن الشيخ عز الدين بن عبد السلام ألّف كتاباً سماه «الشجرة» بيّن فيه أن هذه الآية اشتملت على جميع الأحكام الشرعية في سائر الأبواب الفقهية وسمّاه السبكي في الطبقات «شجرة المعارف» .وجملة { يعظكم } في موضع الحال من اسم الجلالة .والوعظ : كلام يقصد منه إبعاد المخاطب به عن الفساد وتحريضه على الصلاح . وتقدم عند قوله تعالى : { فأعرض عنهم وعظهم } في سورة النساء ( 63 ).والخطاب للمسلمين لأن الموعظة من شأن من هو محتاج للكمال النفساني ، ولذلك قارنها بالرجاء بلعلكم تذَّكرون }.والتذكر : مراجعة المنسيّ المغفول عنه ، أي رجاء أن تتذكروا ، أي تتذكروا بهذه الموعظة ما اشتملت عليه فإنها جامعة باقية في نفوسكم .\n\n",
      "translations": [
        {
          "translation": "(Lo! Allah enjoineth justice) Allah's divine Oneness (and kindness) through fulfilling the obligations; it is also said that this means: kindness to people, (and giving to kinsfolk) i.e. keeping ties with one's kinsfolk, (and forbideth lewdness) all transgressions (and abomination) that which is not known in the Shari'ah or Sunnah (and wickedness) overbearing and oppression. (He exhorteth you) He forbids you from engaging in lewdness, abomination and wickedness (in order that ye may take heed) in order that you take admonition from the parable of the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِيتَآءِ ذِي ٱلْقُرْبَىٰ } يعني اعطاءَهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And give to the nearest}, means giving to them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يسلمون ويفوضون { إِنَّ ٱللَّهَ } المدبر لمصالح عباده { يَأْمُرُ } أولاً عباده { بِٱلْعَدْلِ } أي: القِسط والاعتدال في جميع الأفعال والأقوال\n والشئون والأطوار { وَٱلإحْسَانِ } ثانياً\n لأنهم ما لم يعتدلوا ولم يستقيموا لم يتأت لهم التخلق بأخلاق الله التي هي كمال الإحسان والعرفان { وَإِيتَآءِ ذِي ٱلْقُرْبَىٰ } ثالثاً\n أي: إيصال ما حصل لهم من الم عارف والحقائق\n والمكاشفات والمشاهدات إلى مستحقهم من ذوي القربى من جهة الدين\n المتوجهين نحو الحق عن ظهر القلب\n الراغبين إليه عن محض المحبة والوداد\n المتعطشين إلى زلال توحيده\n لأنهم ما لم يتمكنوا ويتقرروا في مرتبة الإحسان\n لم يتأت منهم الاستكمال والاسترشاد\n\nوكما يرغِّب سبحانه عباده بموجبات الإيمان والتوحيد\n ومعظِّمات أصوله وأركانه\n ينفِّرهم أيضاً عن غوائله ومهلكاتهم ومغوياتهم\n فقال: { وَيَنْهَىٰ } أولاً { عَنِ ٱلْفَحْشَاءِ } أي: إفراط القوة الشهوية الموجبة لرذالة النفس\n وسقوطها عن المروءة والعدالة المقتضية للتخلق بالأخلاق المرضية الإلهية\n وخروجها عن الحدود الشرعية الموضوعة لحفظه حكمة الزواج والتناسل بمتابعة القوى البهيمية الناشئة عن طغيان الطبيعة الهيولانية الناسوتية\n المناقية لصفاء القوى الروحانية اللاهوتية\n\n\n{ وَ } عن { ٱلْمُنْكَرِ } ثانياً\n إذ كل من رُكّب على جموح القوة الغضبية\n وأخذ سيق الهذيانات المثيرة لأنواع الفتن والبليات\n وعمل بمقتضاها\n ونبذَ الحلم والرحمة وراء ظهره\n فهو بمراحلٍ عن مرتبة الإحسان\n بل لا يرجى منه إلاَّ الخذلان والخسران { وَ } عن { ٱلْبَغْيِ } ثالثاً\n لأن من تمكن وتمادى على مقتضى كلتا القوتين الشهوية والغضبية فقط\n سقط عن المروءة والعدالة اللتين هما من أقوى أسباب الكمال المستلزم للإرشاد والتكميل\n ومتى سقطتا عنه فقد استكبر على خلق الله\n وتجبر ويقى وظلم\n ألا لعنة الله على الظلمين \n إنما { يَعِظُكُمْ } الله المصلح لأحوالكم بما يعظكم { لَعَلَّكُمْ تَذَكَّرُونَ } [النحل: 90] رجاء أن تتعظوا وتتمثلوا بما أمروا\n وتجنبوا عما نهوا\n كي تصلوا إلى صفاء توحيده المسقط للمنافرات رأساً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { إنَّ الله يأمر بالعدل } أي: التوحيد، أو الإنصاف، أو فعل الفرائض، { والإحسانِ } ، وهو: فعل المندوبات. وذلك في حقوق الله تعالى، وفي حق عباده، أو العدل في الأحكام، كل واحد فيما ولي فيه \" كلكم راع \". والإحسان إلى عباد الله بَرهم وفَاجرهم. قال ابن عطية: العدل: هو فعل كل مفروض من عقائد وشرائع، وسير مع الناس في أداء الأمانات، وترك الظلم، والإنصاف، وإعطاء الحق. والإحسان هو: فعل كل مندوب إليه. وقال البيضاوي: { إن الله يأمر بالعدل }: بالتوسط في الأمور اعتقادًا، كالتوحيد المتوسط بين التعطيل والتشريك، والقول بالكسب، المتوسط بين محض الجبر والقدر، وعملاً، كالتعبد بأداء الواجبات، المتوسط بين البطالة والترهب، وخُلُقًا، كالجود المتوسط بين البخل والتبذير، والإحسان: إحسان الطاعات، وهو إما بحسب الكمية، كالتطوع بالنوافل، أو بحسب الكيفية، كما قال - عليه الصلاة والسلام -:\n \" الإحسان أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك \" \n{ وإيتاء ذي القربى }: وإعطاء الأقارب ما يحتاجون إليه، وهو تخصيص بعد تعميم للمبالغة. { وينهى عن الفحشاء }: عن الإفراط في متابعة القوة الشهوية، كالزنى فإنه أقبح أحوال الإنسان وأشنعها، { والمنكر }: ما ينكر على متعاطيه في إيثاره القوة الغضبية، { والبغي }: الاستعلاء والاستيلاء على الناس، والتجبر عليهم، فإنها الشيطنة التي هي مقتضى القوة الوهمية، ولا يوجد من الإنسان شر إلا وهو مندرج في هذه الأقسام، صادر بتوسط إحدى هذه القوى الثلاث، ولذلك قال ابن مسعود رضي الله عنه: \" هي أجمع آية في القرآن للخير والشر \". وصارت سبب إسلام عثمان بن مظعون، فلو لم يكن في القرآن غير هذه الآية لصدق عليه أنه تبيان لكل شيء، وهدى ورحمة للعالمين، ولعل إيرادها عقب قوله: { ونزلنا عليك الكتاب تبيانًا لكل شيء } للتنبيه عليه. هـ. وفي القوت: هي قطب القرآن. هـ. وعن عثمان بن مظعون: أنه قال: لَمَّا نزلت هذه الآية قرأتُها على أبي طالب، فعجب، وقال: آلَ غالبٍ، اتبعوه تُفلحوا، فوالله إن الله أرسله ليأمر بمكارم الأخلاق. هـ. قال ابن عطية: { وإيتاء ذي القربى }: لفظ يقتضي صلة الرحم، ويعم جميع إسداء الخير إلى القرابة، وتركه مبهمًا أبلغ لأن كل من وصل في ذلك إلى غاية - وإن علت - يرى أنه مقصر، وهذا المعنى المأمور به في جانب ذي القربى داخل تحت العدل والإحسان، لكنه تعالى خصه بالذكر اهتمامًا به وحضًا عليه. هـ. { يَعِظُكُم } بما ذكر من التمييز بين الأمر والنهي، والخير والشر، { لعلكم تذكَّرون }: تتعظون فتنهضون إلى ما أمرتكم به وندبتكم إليه، وتنكفوا عما نهيتكم عنه وحذرتكم منه. الإشارة: { إن الله يأمر بالعدل } بالتوسط في الأمور كلها، كالتوسط في السير والمجاهدة فإن الإسراف يوقع في الملل، قال - عليه الصلاة والسلام-:\n\n \" لا يكن أحدكم كالمنبت لا أرضًا قطع، ولا ظهرًا أبقى \" \nوقال صلى الله عليه وسلم أيضًا:\n \" إنَّ اللهَ لا يملَ حتى تَملوا \" \nوالله ما رأيت أحداً أسرف في الأحوال فوصل إلى ما قصد، إلا النادر، وخير الأمور أوسطها. ويأمر بالإحسان، وهو: مقام الشهود والعيان. { وإيتاء ذي القربى } قرابة الدين، وهم: الإخوان في الله، ما يستحقونه من النصح والإرشاد، { وينهى عن الفحشاء }: الركون لغير الله، { والمنكر }: التكبر على عباد الله، { والبغي }: ظلم أحد من خلق الله، من الفيل إلى الذرة. وقال في الإحياء: بين التبذير والإقتار المذمومين وسط، وهو المحمود المأمور به، والواجب منه شيئان: واجب بالشرع، وواجب بالمروءة. والسخي هو الذي لا يمنع واجب الشرع ولا واجب المروءة، فإن منع واحدًا منهما فهو بخيل، كالذي يمنع أداء الزكاة، ويمنع أهله وعياله النفقة، أو يؤديها لا بطيب نفسه، بل بتكلف، ومشقة. وكالذي يتيمم الخبيث من ماله، ولا يعطي من أطيبه وأوسطه، فهذا كله بُخل. وأما واجب المروءة فهو: ترك المضايفة والاستقصاء في المحقرات، وذلك يختلف فيستقبح من الغني ما لا يستقبح من الفقير، ويستقبح من الرجل مع أقاربه ما لا يستقبح مع الأجانب، وكذلك الجار والمماليك والضيف. هـ. وقال الورتجبي: إن الله تعالى دعا عباده إلى الاتّصاف بصفته، منها: العدل والإحسان والشفقة والرحمة، والقدس، والطهارة عما لا يليق به. فهو العادل والمحسن، والرحمن الرحيم، غير ظالم جائر، وهو مُنزه عن جميع العلل، فمن كُسِي أنوار هذه الصفات، بنعت الذوق والمباشرة، واستحلى تربيتها يخرج عادلاً محسنًا، رؤوفًا رحيمًا، طاهرًا مطهرًا، صادقًا مصدقًا، وليًا، حبيبًا محبوبًا، مريدًا مرادًا، مُراعَى محفوظًا، يعدل بنفسه فيدفعها عن الشك والشرك، ورؤية الغير وطلب العوض في العبودية، ويأخذ منها الإنصاف بينها وبين عباد الله، ويحسن إلى من أساء إليه، ويعبد الله بوصف الرؤية وشهود غيبه، ويراعي ذوي القرابة، في المعرفة والمحبة من المريدين والصادقين، ويرحم الجهال من المسلمين، وينهى نفسه عن مباشرة فواحش الأنانية، ومباشرة الهوى والشهوة، ويدفعها عن الظلم باستكباره عن العبودية، ويأمرها بإذعانها عند تراب أقدام أولياء الله لتكون مطمئنة في عبودية الحق، ذاكرة لسلطان ربوبيته، وقهر جبروته وملكوته وإحاطته بكل ذرة، وفناء الخليقة في حقيقته. هـ.  ومن مكارم الأخلاق الداخلة تحت العدل الوفاء بالعهد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:45",
      "similarity": 0.4429133012473608
    },
    {
      "verse": "65:2",
      "similarity": 0.3900101571698904
    },
    {
      "verse": "2:169",
      "similarity": 0.3425742842694609
    },
    {
      "verse": "4:58",
      "similarity": 0.31665796470357316
    },
    {
      "verse": "5:79",
      "similarity": 0.3151703616040583
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016090.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016090.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:90.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}