{
  "chapter": "النحل",
  "text": "وعلى الله قصد السبيل ومنها جائر ولو شاء لهدىكم اجمعين",
  "translations": [
    {
      "translation": "The Way should lead to Allah, but there are those who deviate from it. If He had wished He could have guided every one of you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God leads the right path, though some deviate. If He willed He could guide you all to the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It rests with Allah alone to show you the Right Way, even when there are many crooked ways. Had He so willed, He would have (perforce) guided you all aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some paths lead away from God but one must follow the path that leads to God. Had God wanted, He could have guided (all to the right path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the middle path rightly leads to Allah – any other path is wayward; and had He willed He would have brought all of you upon guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is up to Allah to show the right way. But there are ways that stray. And had He willed, He would have guided you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And upon Allah it rests to show the right way, and there are some deviating (ways); and if He please He would certainly guide you all aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God's it is to show the way; and some do swerve from it. If He willed, He would have guided you all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the direction of the way, and some (roads) go not straight. And had He willed He would have led you all aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The straight way leads to God and there are ways which deviate from the right course. If He so wished, He would guide you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And upon Allah is the direction of the way, and thereof is some crooked; and had He willed He would have guided you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With Allah rests guidance to the straight path, and some of the paths are devious, and had He wished He would have guided you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Allah leads straight the Way, but there are ways that turn aside: if Allah had willed, He could have guided all of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And upon Allah is the responsibility to explain the Straight Path (i.e. Islamic Monotheism for mankind i.e. to show them legal and illegal, good and evil things, etc. so, whosoever accepts the guidance, it will be for his own benefit and whosoever goes astray, it will be for his own destruction), but there are ways that turn aside (such as Paganism, Judaism, Christianity, etc.). And had He willed, He would have guided you all (mankind).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is for Allah to show the way. Some swerve from it, but had He willed, He would have guided all of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is for God to point out the paths, but some of them are flawed. Had He willed, He could have guided you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And upon Allah is the direction of the [right] way, and among the various paths are those deviating. And if He willed, He could have guided you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:9] And God’s is the direction of the way, that is, to point out the straight path, and some of them, that is, the paths, are deviant, swerving away from straightness. And had He willed, to guide you, He would have guided you, to seek the way, all, so that you would be [rightly] guided of your own choice.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Allah's is the direction of the way) He is the guide whether it is in the sea or on the land, (and some (roads) go not straight) they are crooked and one cannot find one's way through them. (And had He willed He would have led you all aright) in your way whether you are in the sea or on the land; it is also said that (And Allah's is the direction of the way) means: it is Allah Who guides to monotheism, and some of the religions are crooked and unjust such as Judaism, Christianity and Zoroastrianism. And if Allah had willed, He would have guided you all to His religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَعَلَىٰ ٱللَّهِ قَصْدُ ٱلسَّبِيلِ } معناهُ بَيانُ الهُدى\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of the Most High: {And the goal of the path is to God} means the explanation of the guidance.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كما يدبر سبحانه أمور معاش عباده على الوجه الأليق الأحسن بحالهم، كذلك له أن يدبر أمور معادكم، بل هي أولى للتبدير؛ لذلك { عَلَىٰ ٱللَّهِ } المصلح لأحوال عباده { قَصْدُ ٱلسَّبِيلِ } أي: إرشادهم وهدياتهم إلى طريق مستقيم موصل إلى توحيده؛ ليصلوا إليه، ويفوزوا بما وعدوا عنده { وَ } كيف لا يرشدهم سبحانه إلى سواء السبيل { مِنْهَا } أي: من السبيل { جَآئِرٌ } مائل منصرف عن الحق وتوحيده على مقتضى أوصافه الجلالية المذلة المضلة تتميماً للقدرة الكاملة، والسلطنة العامة الشاملة لكلا طرفي اللطف والقهر، والجمال والجلال { وَلَوْ شَآءَ } وأراد سبحانه هدايتكم { لَهَدَاكُمْ أَجْمَعِينَ } [النحل: 9] على مقضى تجليات الأوصاف اللطيفة الجمالية، المثمرة للّذة الدائمة، والسرور المستمر الغير المنقطعة، لكن اقتضى حكمته البالغة أن يكون جنابه رفيعاً متعالياً عن أن يطّلع عله واحد بعد واحدٍ؛ لذلك تجلى على بعض المظاهر بالأوصاف القهرية الجلالية المورثة للحزن الدائم، والألم المخلَّد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وعلى الله قصدُ السبيل } أي: وعلى الله بيان السبيل القصد، أي: الطريق الموصل إلى المقصود\n أو: على الله تقويم طريق الهدى بنصب الأدلة وبعث الرسل، فهو من إضافة الصفة إلى الموصوف، أي: السبيل القصد، أي: القاصد المستقيم الموصل إلى المطلوب كأنه يقصد الوجه الذي يقصده السالك لا يميل عنه\n والمراد من السبيل: الجنس، ولذلك أضاف إليه القصد، وقال: { ومنها جائرٌ } عن القصد، أو عن الله، كطريق اليهود والنصارى وغيرهم\n والسبيل بمعنى الطريق، يُذكر ويؤنث، وأُنِّثَ هنا\n وتغيير الأسلوب - أي: حيث لم يقل: قصد السبيل والجائر - لأنه ليس بحق على الله أن يبين طريق الضلالة، ولأن المقصود، بالأصالة، بيان سبيله، وتقسيمُ السبيل إلى القصد والجائر إنما جاء بالعرض\n { ولو شاء لهداكم أجمعين } أي: ولو شاء هدايتكم أجمعين لهداكم إلى قصد السبيل، هداية مستلزمة للاهتداء\n قاله البيضاوي\n الإشارة: هذه العوالم من العرش إلى الفرش كلها نُصبت للآدمي، وخلقت من أجله، السماوات تُظله، والأرض تُقله، والحيوانات تخدمه وتنفعه، يتصرف فيها خليفة عن الله في ملكه\n\n\nفالواجب عليه شكر هذه النعم، وألا يقف معها، ويشتغل بها عن خدمة خالقها\n يقول الحق تعالى، في بعض كلامه بلسان الحال أو المقال:\n\n \" يا ابنَ آدم، خَلَقْتُ الأَشياءَ مِن أَجْلِكَ، وخَلَقْتُكَ مِنْ أجِلْي، فَلا تَشْتَغِل بما خُلِق لأجلك عَمَّا خُلِقْت لأجْله \" \n\nوالواجب عليه أيضًا من طريق الخصوص: ألا يقف مع حس أجرامها، دون النفوذ إلى أسرار معاني خالقها ومُظهرها لئلا يبقى مسجونًا بمحيطاته، محصورًا في هيكل ذاته، بل ينفذ إلى فضاء شهود بحر المعاني، المحيط بالأواني، والمفني لها، بصحبة شيخ كامل، يُخرجه من سجن الأكوان إلى فضاء شهود المُكوِّن\n وبالله التوفيق\n وقوله: { وعلى الله قصد السبيل }: اعلم أن الحق - جلّ جلاله - بيَّن طريق الوصول إلى نعيمه الحسي والفوز برضوانه، وطريق الوصول إلى حضرة قدسه ومحل شهوده وعيانه، وأرسل الرسل ببيان الطريقين\n فوكل ببيان الأولى العلماء، ووكل ببيان الثانية الأولياء\n فالعلماء قاموا ببيان الشرائع الموصلة إلى نعيم الأشباح، والأولياء العارفون قاموا ببيان الحقائق الموصلة إلى نعيم الأرواح، وهو النعيم الأكبر قال تعالى:\n\n[التّوبَة: 72]\n فالرضوان على قسمين: قوم نالهم الرضوان من طريق الخطاب مع سدْل الحجاب، وهم أهل الشرائع، وقوم نالهم الرضوان بمكافحة الخطاب ورفع الحجاب، وهم أهل الحقائق، وهم المقربون، نفعنا الله بهم، وخرطنا في سلكهم\n آمين\n ثمَّ ذكر بقية التجليات فقال: { هُوَ ٱلَّذِي أَنْزَلَ مِنَ ٱلسَّمَاءِ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:32",
      "similarity": 0.5274602221972595
    },
    {
      "verse": "23:88",
      "similarity": 0.4934257103421712
    },
    {
      "verse": "5:66",
      "similarity": 0.4819909274558707
    },
    {
      "verse": "9:42",
      "similarity": 0.4489641668074146
    },
    {
      "verse": "67:28",
      "similarity": 0.44843538055704474
    }
  ]
}