{
  "chapter": "النحل",
  "text": "ولو شاء الله لجعلكم امة وحدة ولكن يضل من يشاء ويهدى من يشاء ولتسـلن عما كنتم تعملون",
  "translations": [
    {
      "translation": "If Allah had willed He would have made you one community. However, He misguides anyone He wills and guides anyone He wills. You will be questioned about what you did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had pleased He would surely have made you a single community of belief; but He leads whosoever He wills astray, and guides whosoever He please. But you will surely be questioned about what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah so willed, He would have made you all one single community. However, He lets go astray whomsoever He wills and shows the Right Way to whomsoever He wills. Surely you shall be called to account regarding what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God wanted, He would have made you one single nation but He guides or causes to go astray whomever He wants. You will certainly be questioned about what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed He would have made you all one nation, but He sends astray whomever He wills and guides whomever He wills; and you will certainly be questioned regarding your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah willed, He would have made you (all) one nation, but He allows whom He wills to stray and He guides whom He wills. But you shall certainly be called to account for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah please He would certainly make you a single nation, but He causes to err whom He pleases and guides whom He pleases; and most certainly you will be questioned as to what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had willed, He would have made you one nation; but He leads astray whom He will, and guides whom He will; and you will surely be questioned about the things you wrought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed He could have made you (all) one nation, but He sendeth whom He will astray and guideth whom He will, and ye will indeed be asked of what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God pleased, He would have united you in one community; but He lets go astray whoever He will, and guides whoever He will, and you will surely be called upon to account for all your actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah willed, He would have made you all one community, but he sendeth astray whomsoever He willeth, and guideth whomsoever He willeth; and surely ye shall be questioned regarding that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah wished, He would have made you one community, but He leads astray whomever He wishes and guides whomever He wishes, and you will surely be questioned concerning what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah so willed, He could make you all one people: But He leaves straying whom He pleases, and He guides whom He pleases: but ye shall certainly be called to account for all your actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah willed, He could have made you (all) one nation, but He sends astray whom He wills and guides whom He wills. But you shall certainly be called to account for what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed, He would have made you one nation. But He leads astray whomsoever He will and gives guidance to whomsoever He will. You shall be questioned about what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God willed, He would have made you one congregation, but He leaves astray whom He wills, and He guides whom He wills. And you will surely be questioned about what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah had willed, He could have made you [of] one religion, but He causes to stray whom He wills and guides whom He wills. And you will surely be questioned about what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:93] For if God had willed, He could have made you one community, people of a single religion, but He leads astray whom He will and guides whom He will, and you will surely be questioned, on the Day of Resurrection, a questioning of rebuke, about what you used to do, so that you might be requited for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Had Allah willed He could have made you (all) one nation) He could have made you followers of one religion: the religion of Islam, (but He sendeth whom He will astray) from His religion; he who is not deserving of it (and guideth whom He will) to His religion; he who is deserving of it, (and ye will indeed be asked) on the Day of Judgement (of what ye used to do) of good or evil in your states of disbelief or faith; it is also said that this means: of what you used to do in terms of honouring or breaking your pledges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ شَآءَ ٱللَّهُ } القادر على جميع المقدورات هدايتكم جميعاً { لَجَعَلَكُمْ } وخلقكم { أُمَّةً وَاحِدَةً } منفقةً على الهداية والإسلام { وَلـٰكِن } حكمته تقتضي خلاف ذلك، ولذلك { يُضِلُّ مَن يَشَآءُ } على مقتضى قهره وجلاله { وَيَهْدِي مَن يَشَآءُ } على مقتضى لطفه وجماله { وَلَتُسْأَلُنَّ } وتحاسبنَّ كل منكم في يوم الجزاء { عَمَّا كُنْتُمْ تَعْمَلُونَ } [النحل: 93] إن خيراً فخير، وإن شراً فشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولو شاء اللهُ لجعلكم أمةً واحدة } أهل دين واحد متفقين على الإسلام، { ولكن يُضل من يشاء } بعدله، { ويهدي من يشاء } بفضله، { ولتُسألنَّ يوم القيامة } سؤال تبكيت ومجازاة، { عما كنتم تعملون } في الدنيا لتُجازوا عليه\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:8",
      "similarity": 0.6013638282218808
    },
    {
      "verse": "21:92",
      "similarity": 0.45095990458689883
    },
    {
      "verse": "23:52",
      "similarity": 0.4499815232487287
    },
    {
      "verse": "37:4",
      "similarity": 0.34822921008803126
    },
    {
      "verse": "2:163",
      "similarity": 0.32647165822065216
    }
  ]
}