{
  "chapter": "النحل",
  "text": "ما عندكم ينفد وما عند الله باق ولنجزين الذين صبروا۟ اجرهم باحسن ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "What is with you runs out but what is with Allah goes on for ever. Those who were steadfast will be recompensed according to the best of what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For what you possess will pass, but what is with God will abide. We shall certainly award those who persevere a recompense in keeping with their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you have is bound to pass away and whatever is with Allah will last. And We shall surely grant those who have been patient their reward according to the best of what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you possess is transient and whatever is with God is everlasting. We will recompense those who exercise patience with their due reward and even more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What you have will perish, and that which is with Allah will remain forever; and indeed We shall pay the patiently enduring a recompense which befits the best of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you have will be exhausted, and what is with Allah will remain. And to those who are patient, We will certainly grant them their rewards in proportion to the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is with you passes away and what is with Allah is enduring; and We will most certainly give to those who are patient their reward for the best of what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is with you comes to an end, but what is with God abides; and surely We shall recompense those who were patient their wage, according to the best of what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which ye have wasteth away, and that which Allah hath remaineth. And verily We shall pay those who are steadfast a recompense in proportion to the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What you have shall pass away, but what is with God is lasting. We will certainly give those who are patient their reward according to the best of their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which is with you is exhausted, and that which is with Allah is lasting. And We will surely recompense those who have been patient their hire for the best of that which they have been working\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which is with you will be spent [and gone], but what is with Allah shall last, and We will surely pay the patient their reward by the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is with you must vanish: what is with Allah will endure. And We will certainly bestow, on those who patiently persevere, their reward according to the best of their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is with you, will be exhausted, and whatever with Allah (of good deeds) will remain. And those who are patient, We will certainly pay them a reward in proportion to the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which you have is transitory, but that which is with Allah endures. We shall reward the patient according to the best of their deeds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What you have runs out, but what is with God remains. We will reward those who are patient according to the best of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you have will end, but what Allah has is lasting. And We will surely give those who were patient their reward according to the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:96] That which is with you, of [the things of] this world, will come to an end, will perish, but that which is with God remains, [it is] everlasting. And He shall surely pay (read la-yajziyanna or la-najziyanna, ‘We shall surely pay’) those who were patient, in fulfilling their covenants, their reward according to the best of what they used to do, ‘the best’ [here] means ‘the good’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة { ما عندكم ينفد وما عند الله باق } تذييل وتعليل لمضمون جملة { إنما عند الله هو خير لكم } بأن ما عند الله لهم خير متجدّد لا نفاد له ، وأن ما يعطيهم المشركون محدود نافد لأن خزائن الناس صائرة إلى النفاد بالإعطاء وخزائن الله باقية .والنفاد : الانقراض . والبقاء : عدم الفناء .أي ما عند الله لا يفنى فالأجدر الاعتماد على عطاء الله الموعود على الإسلام دون الاعتماد على عطاء الناس الذين ينفَد رزقهم ولو كَثُر .وهذا الكلام جرى مجرى التذييل لما قبله ، وأرسل إرسال المثل فيحمل على أعمّ ، ولذلك كان ضمير { عندكم } عائداً إلى جميع الناس بقرينة التذييل والمثل ، وبقرينة المقابلة بما عند لله ، أي ما عندكم أيها الناس ما عند الموعود وما عند الواعد ، لأن المنهيّين عن نقض العهد ليس بيدهم شيء .ولما كان في نهيهم عن أخذ ما يعدهم به المشركون حَمْلٌ لهم على حرماننِ أنفسهم من ذلك النّفع العاجل وُعِدو الجزاء على صبرهم بقوله تعالى : { وليجزينّ الذين صبروا أجرهم} .قرأه الجمهور { وليجزين } بياء الغيبة . والضمير عائد إلى اسم الجلالة من قوله تعالى : { بعهد الله } وما بعده ، فهو النّاهي والواعد فلا جرم كان هو المجازي على امتثال أمره ونهيه .وقرأه ابن كثير وعاصم وابن ذكوان عن ابن عمر في إحدى روايتين عنه وأبو جعفرَ بنون العظمة فهو التفات .و { أجرهم } منصوب على المفعولية الثانية ل«يَجزين» بتضمينه معنى الإعطاء المتعدّي إلى مفعولين .والباء للسببية . و «أحسن» صيغة تفضيل مستعملة للمبالغة في الحسن . كما في قوله تعالى : { قال ربّ السجن أحبّ إليّ مما يدعونني إليه } \\[ سورة يوسف : 33 \\] ، أي بسبب عملهم البالغ في الحسن وهو عمل الدوام على الإسلام مع تجرّع ألم الفتنة من المشركين . وقد أكد الوعد بلام القسم ونون التوكيد .\n\n",
      "translations": [
        {
          "translation": "(That which ye have) of wealth (is wasted away, and that which Allah hath) of reward (remaineth. And verily We shall pay those who are steadfast) in refraining from making a false pledge and acknowledge the Truth (a recompense) their reward in the Hereafter (in proportion to the best of what they used to do) because of their beneficence in this worldly life.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { مَا عِندَكُمْ } من حطام الدنيا ومزخرفاتها { يَنفَدُ } أي: يزول ويضمحل { وَمَا عِندَ ٱللَّهِ } من اللذات الأخروية\n والمعارف اليقينية { بَاقٍ } بقاءً أبدياً سمردياً إلى ما شاء الله\n لا حول ولا قوة إلا بالله\n\n\nثمَّ قال سبحانه: { وَلَنَجْزِيَنَّ ٱلَّذِينَ صَبَرُوۤاْ } على ما فوتوا من الأعراض الدنيوية\n بسبب ثباتهم وتقررهم على الأمور الأخروية\n ولم ينقضوا العهود والمواثيق المتعلقة بالدين\n ولم يتسبدلوا الأعلى الباقي بالأدنى الفاني\n ولحقهم بذلك ما لحقهم من المحن والشدائد القاحلة\n وضاع عنهم ما ضاع من لذاتها وشهواتها\n فصبروا على جميع ما أعطيناهم { أَجْرَهُمْ بِأَحْسَنِ مَا كَانُواْ يَعْمَلُونَ } [النحل: 96] أي: لنجزينهم ونثيبنهم بجزاءٍ أحسن من مقتضى عملهم\n لوفائهم على عهودنا ومواثيقنا\n وجريهم على مقتضى أمرنا ونهينا\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وجزيل نعمته { باقٍ } لا يفنى\n وهو تعليل للنهي عن نقض العهد طمعًا في العَرَضِ الفاني\n { وليجزين الذين صبروا } على الوفاء بالعهود\n أو على الفاقات وأذى الكفار\n أو مشاق التكاليف\n { أجرهم بأحسنِ ما كانوا يعملون } بما يرجح فعله من أعمالهم\n كالواجبات والمندوبات\n أو بجزاء أحسن من أعمالهم\n وبالله التوفيق\n الإشارة: الوفاء بالعهود\n والوقوف مع الحدود\n من شأن الصالحين الأبرار\n كالعباد والزهاد\n والعلماء الأخيار\n وأما أهل الفناء والبقاء من العارفين: فلا يقفون مع شيء\n ولا يعقدون على شيء\n هم مع ما يبرز من عند مولاهم في كل وقت وحين\n ليس لهم عن أنفسهم إخبار\n ولا مع غير الله قرار\n يتلونون مع المقادير كيفما تلونت\n وذلك من شدة قربهم وفنائهم في ذات مولاهم\n قال تعالى:\n[الرحمن: 29]\n فهم يتلونون مع الشؤون البارزة من السر المكنون فمن عقد معهم عقدًا\n أو أخذ منهم عهدًا\n فلا يعول على شيء من ذلك إذ ليست أنفسهم بيدهم\n بل هي بيد مولاهم\n وليس ذلك نقصًا في حقهم\n بل هو كمال لأنه يدل على تغلغلهم في التوحيد حتى هدم عزائمهم\n ونقض تدبيرهم واختيارهم\n ولا يذوق هذا إلا من دخل معهم\n وإلاَّ فحسبه التسليم\n وطرح الميزان عنهم\n إن أراد الانتفاع بهم\n والله تعالى أعلم\n وهذه الحالة التي اقامهم الحق تعالى فيها هي الحياة الطيبة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:54",
      "similarity": 0.8158841071813412
    },
    {
      "verse": "18:109",
      "similarity": 0.7208607970105453
    },
    {
      "verse": "31:27",
      "similarity": 0.4857139577881541
    },
    {
      "verse": "20:127",
      "similarity": 0.23814075936436233
    },
    {
      "verse": "42:36",
      "similarity": 0.23752672983745193
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016096.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016096.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:96.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}