{
  "chapter": "النحل",
  "text": "واوفوا۟ بعهد الله اذا عهدتم ولا تنقضوا۟ الايمن بعد توكيدها وقد جعلتم الله عليكم كفيلا ان الله يعلم ما تفعلون",
  "translations": [
    {
      "translation": "Be true to Allah's contract when you have agreed to it, and do not break your oaths once they are confirmed and you have made Allah your guarantee. Allah knows what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfil your covenant with God, having made the covenant, and do not break your oaths once you have sworn them, as you have made God a witness over you. Indeed God knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fulfil the covenant which you have made with Allah and do not break your oaths after having firmly made them, and after having made Allah your witness. Surely Allah knows all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He commands people) to keep their established covenants with God, not to disregard their firm oaths; they have already appointed God as their Guarantor. God certainly knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fulfil the covenant of Allah when you have made the promise, and do not break your oaths after ratifying them, and you have made Allah a Guarantor over you; indeed Allah knows your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fulfill the covenants (taken in the Name of) Allah when you have taken them, and do not break the oaths after you have confirmed them - and indeed you have appointed Allah as your guarantor. Verily, Allah knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fulfill the covenant of Allah when you have made a covenant, and do not break the oaths after making them fast, and you have indeed made Allah a surety for you; surely Allah knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfil God's covenant, when you make covenant, and break not the oaths after they have been confirmed, and you have made God your surety; surely God knows the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfil the covenant of Allah when ye have covenanted, and break not your oaths after the asseveration of them, and after ye have made Allah surety over you. Lo! Allah knoweth what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfill the covenant of God when you have made one; and do not break your pledges after their confirmation. Indeed you have made God your surety; for God knows all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fulfil the covenant of Allahs when ye have covenanted, and violate not the oaths after the ratification thereof, and surely ye have appointed Allah a surety over you. verily Allah knoweth that which ye do:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfill Allah’s covenant when you pledge, and do not break [your] oaths, after pledging them solemnly and having made Allah a witness over yourselves. Indeed Allah knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfil the Covenant of Allah when ye have entered into it, and break not your oaths after ye have confirmed them; indeed ye have made Allah your surety; for Allah knoweth all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fulfill the Covenant of Allah (Bai'a: pledge for Islam) when you have covenanted, and break not the oaths after you have confirmed them, and indeed you have appointed Allah your surety. Verily! Allah knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfill the covenant of Allah, when you make a covenant and do not break your oaths after they have been confirmed (by swearing in His Name) for you make Allah your surety. Allah has knowledge of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfill God’s covenant when you make a covenant, and do not break your oaths after ratifying them. You have made God your guarantor, and God knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fulfill the covenant of Allah when you have taken it, [O believers], and do not break oaths after their confirmation while you have made Allah, over you, a witness. Indeed, Allah knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[16:91] And fulfil God’s covenant, [effected] by way of pledges of allegiance and oaths and in other ways, when you made a covenant, and do not break [your] oaths after pledging them and having made God surety over you, that you will fulfill [the covenant], for you have sworn [the oath] by Him (the sentence wa-qad ja‘altumu’Llāha ‘alaykum kafīlan, ‘and having made God surety over you’, is a circumstantial qualifier). Truly God knows what you do — [this is] a threat for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Fulfil the covenant of Allah when ye have covenanted). This verse was revealed about the tribes of Kindah and Murad; it is also said that this means: honour your pledges when you swear by Allah, (and break not your oaths) i.e. the pledges that you pledge between yourselves (after the asseveration of them) after ascertaining and confirming them, (and after ye have made Allah surety over you) i.e. a Witness over you; it is also said that this means: a Guardian over you. Meaning: both parties made their pledge and said: Allah is witness that we will honour our pledge. (Lo! Allah knoweth what ye do) whether you break or honour your pledges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأوفوا بعهد الله } الذي هو تذكر العهد السابق وتجديده بالعقد اللاحق بالبقاء على حكمه في الإعراض عن الغير والتجرّد عن العوائق والعلائق في التوجه إليه { إذا عاهدتم } أي: تذكرتموه بإشراق نور النبيّ عليكم وتذكيره إياكم\n { من عَمِل صالحاً من ذكر أو أنثى } أي: عملاً يوصله إلى كماله الذي يقتضيه استعداده\n إذ الصلاح في الشخص توجهه إلى كماله أو كونه على ذلك الكمال\n والفساد بالضدّ وفي العمل كونه وصلة وسيلة إليه من صاحب قلب بالغ إلى كمال الرجولية أو صاحب نفس قابلة لتأثير القلب مستفيضة منه { وهو مؤمن } أي: معتقد للحق اعتقاداً جازماً\n إذ صلاح العمل مشروط بصحة الاعتقاد وإلا لم يتصور كماله على ما هو عليه ولم يعتقده على الوجه الذي ينبغي فلم يمكنه عمل يوصله إليه فلا يكون ما يعمله صالحاً حينئذ في الحقيقة\n وإن كان في صورة الصلاح { فلنحيينه حياة طيبة } أي: حياة حقيقية لا موت بعدها بالتجرّد عن المواد البدنية والانخراط في سلك الأنوار السرمدية\n والتلذّذ بكمالات الصفات في مشاهدات التجليات الأفعالية والصفاتية { ولنجزينهم أجرهم } من جنان الأفعال والصفات { بأحسن ما كانوا يعملون } إذ عملهم يناسب صفاتهم التي هي مبادئ أفعالهم وأجرهم يناسب صفاتنا التي هي مصادر أفعالنا\n فانظر كم بينهما من التفاوت في الحسن\n { فإذا قرأت القرآن فاسْتَعذ بالله } فادرج عن مقام النفس بالعروج إلى جناب القدس\n فإن النفس مأوى كل كدورة ومنبع كل رجس تناسب وساوس الشيطان\n وتجرّدها بأحاديثها\n فإن ارتقيت من مقرّها لم يكن للشيطان عليك سلطان لأنه لا يطيق نور حضور الحق وحضرة القلب مهبط أنواره وجناب صفاته المقدّسة ومحل تجلياته النورية\n فعذ إليها وعذ بنور الله فيها تستحكم بنيان إيمانك باليقين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من علامة اتعاظكم وتذكركم الوفاء بالعهود والمواثيق { أَوْفُواْ } أيها الطالبون لمرتبة العدالة { بِعَهْدِ ٱللَّهِ } وميثاقه الذي عهدتم مع الله بألسنة استعداداتكم في بدء فطرتكم\n وكذا بجميع العهود والمواثيق { إِذَا عَاهَدتُّمْ } مع إخوانكم\n وبني نوعكم { وَ } أيضاً { لاَ تَنقُضُواْ ٱلأَيْمَانَ } سيما { بَعْدَ تَوْكِيدِهَا } وتغليظها { وَ } كيف تنقضونها\n إذ { قَدْ جَعَلْتُمُ ٱللَّهَ } الرقيب { عَلَيْكُمْ كَفِيلاً } وكيلاً لتلك البيعة { إِنَّ ٱللَّهَ } المطلع لضمائرهم ومخائلهم { يَعْلَمُ } بعلمه الحضوري { مَا تَفْعَلُونَ } [النحل: 91] من نقض الأيمان وأمراتها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وقد جعلتم }: حال",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:20",
      "similarity": 0.21040995658965825
    },
    {
      "verse": "8:56",
      "similarity": 0.1887964223805972
    },
    {
      "verse": "2:27",
      "similarity": 0.1757592327711146
    },
    {
      "verse": "13:25",
      "similarity": 0.17192015965135388
    },
    {
      "verse": "94:3",
      "similarity": 0.15562449956303134
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/016091.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/016091.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/16:91.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}