{
  "chapter": "الإسراء",
  "text": "وكل انسن الزمنه طئره فى عنقه ونخرج له يوم القيمة كتبا يلقىه منشورا",
  "translations": [
    {
      "translation": "We have fastened the destiny of every man about his neck and on the Day of Rising We will bring out a Book for him which he will find spread open in front of him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Round each man's neck We have hung his ledger of deeds, and on the Day of Resurrection will present it as a book spread out (and say):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have fastened every man's omen to his neck. On the Day of Resurrection We shall produce for him his scroll in the shape of a wide open book, (saying):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made every person's actions cling to his neck. On the Day of Judgment, We will bring forth the record of his actions in the form of a wide open book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have attached the destiny of every man to his neck; and We shall bring forth a register for him on the Day of Resurrection, which he will find open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have fastened every man's Ta'irah (deeds) to his neck, and on the Day of Resurrection, We shall bring out for him a Book which he will find wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made every man's actions to cling to his neck, and We will bring forth to him on the resurrection day a book which he will find wide open:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every man -- We have fastened to him his bird of omen upon his neck; and We shall bring forth for him, on the Day of Resurrection, a book he shall find spread wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every man's augury have We fastened to his own neck, and We shall bring forth for him on the Day of Resurrection a book which he will find wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tied the fate of every man about his neck; and We shall produce a book for him on Resurrection Day that he will find spread open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every man: We have fastened his action round his neck, and We shall bring forth unto him on the Day of Judgment a book proffered him open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have attached every person’s omen to his neck, and We shall bring it out for him on the Day of Resurrection as a book that he will find wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every man's fate We have fastened on his own neck: On the Day of Judgment We shall bring out for him a scroll, which he will see spread open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have fastened every man's deeds to his neck, and on the Day of Resurrection, We shall bring out for him a book which he will find wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to every human? We have fastened to him his bird of deeds upon his neck; and on the Day of Resurrection We shall bring forth to him a book spread open wide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every person We have attached his fate to his neck. And on the Day of Resurrection, We will bring out for him a book which he will find spread open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [for] every person We have imposed his fate upon his neck, and We will produce for him on the Day of Resurrection a record which he will encounter spread open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:13] And We have attached every person’s omen — his deeds — for him to carry, upon his neck — this [site] is singled out for mention because fastening [something] to it is [much] more severe; Mujāhid [b. Jabr alMakkī] said, ‘There is not a child born but it has a leaf around its neck in which it is decreed [that the child will be either] fortunate or damned’ — and We shall bring forth for him, on the Day of Resurrection, a book, in which his deeds are recorded [and], which he will find wide open (yalqāhu manshūran: both are adjectival qualifications of kitāban, ‘a book’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلما كان سياق الكلام جارياً في طريق الترغيب في العمل الصالح والتحذير من الكفر والسيئات ابتداء من قوله تعالى : { إن هذا القرآن يهدي للتي هي أقوم ويبشر المؤمنين } إلى قوله تعالى : { عذاباً أليماً } \\[ الإسراء : 9 10 \\] وما عقبه مما يتعلق بالبشارة والنذارة وما أدمج في خلال ذلك من التذكير ثم بما دل على أن علم الله محيط بكل شيء تفصيلاً ، وكان أهم الأشياء في هذا المقام إحاطة علمه بالأعمال كلها ، فأعقب ذكر ما فصله الله من الأشياء بالتنبيه على تفصيل أعمال الناس تفصيلاً لا يقبل الشك ولا الإخفاء وهو التفصيل المشابه للتقييد بالكتابة ، فعطف قوله : { وكل إنسان } الخ على قوله : { وكل شيء فصلناه تفصيلاً } \\[ الإسراء : 12 \\] عطف خاص على عام للاهتمام بهذا الخاص . والمعنى : وكل إنسان قدرنا له عمله في علمنا فهو عامل به لا محالة وهذا من أحوال الدنيا .والطائر : أطلق على السهم ، أو القرطاس الذي يُعين فيه صاحب الحَظّ في عطاء أو قرعة لقسمة أو أعشار جزور الميسر ، يقال : اقتسموا الأرض فطار لفلان كذا ، ومنه قول أم العَلاء الأنصارية في حديث الهجرة : اقتسم الأنصارُ المهاجرين فطار لنا عُثمان بن مظعون . . . وذكرت قصة وفاته .وأصل إطلاق الطائر على هذا : إما لأنهم كانوا يرمون السهام المرقومة بأسماء المتقاسمين على صبر الشيء المقسوم المعدة للتوزيع . فكل من وقع السهم المرقوم باسمه على شيء أخذَه . وكانوا يطلقون على رمي السهم فعل الطيران لأنهم يجعلون للسهم ريشاً في قُذذه ليخف به اختراقه الهواء عند رميه من القوس ، فالطائر هنا أطلق على الحظ من العمل مثل ما يطلق اسم السهم على حظ الإنسان من شيء ما .وإما من زجر الطير لمعرفة بختتِ أو شُؤم الزاجر من حالة الطير التي تعترضه في طريقه ، والأكثر أن يفعلوا ذلك في أسفارهم ، وشاع ذلك في الكلام فأطلق الطائر على حظ الإنسان من خير أو شر .والإلزام : جعله لازماً له ، أي غير مفارق ، يقال : لَزمه إذا لم يفارقه .وقوله : في عُنُقِهِ } يجوز أن يكون كناية عن الملازمة والقرب ، أي عمله لازم له لزوم القلادة . ومنه قول العرب تقلدها طَوْقَ الحمامة ، فلذلك خصت بالعنق لأن القلادة توضع في عنق المرأة . ومنه قول الأعشىوالشِعْرَ قلدتُه سَلامَةَ ذَا فا ... ئش والشيءُ حيثما جُعلاويحتمل أن يكون تمثيلاً لحالة لعلها كانت معروفة عند العرب وهي وضع علامات تعلق في الرقاب للذين يعيّنون لعمل ما أو ليؤخذ منهم شيء ، وقد كان في الإسلام يجعل ذلك لأهل الذمة ، كما قال بشاركَتب الحبُّ لها في عُنقي ... مَوْضِعَ الخَاتم من أهله الذِممويجوز أن يكون { في عنقه } تمثيلاً بالبعير الذي يوسم في عنقه بسمة كيلا يختلط بغيره ، أو الذي يوضع في عنقه جلجل لكيلا يضل عن صاحبه .والمعنى على الجميع أن كل إنسان يعامل بعمله من خير أو شر لا يُنقص له منه شيء . وهذا غير كتابة الأعمال التي ستذكر عقب هذا بقوله : { ونخرج له يوم القيامة كتاباً } الآية .وعَطف جملة { ونخرج له يوم القيامة كتاباً } إخبار عن كون تلك الأعمال المعبر عنها بالطائر تظهر يوم القيامة مفصلة معينة لا تغادَر منها صغيرةٌ ولا كبيرة إلا أحصيت للجزاء عليها .وقرأ الجمهور { ونخرج } بنون العظمة وبكسر الراء ، وقرأه يعقوب بياء الغيبة وكسر الراء ، والضمير عائد إلى الله المعلوم من المقام ، وهو التفات . وقرأه أبو جعفر بياء الغيبة في أوله مبنياً للنائب على أن { له } نائب فاعل و { وكتاباً } منصوباً على المفعولية وذلك جائز .والكتاب : ما فيه ذكر الأعمال وإحصاؤها . والنشر : ضد الطي .ومعنى { يلقاه } يجده . استعير فعل يلقى لمعنى يَجد تشبيهاً لوجدان النسبة بلقاء الشخص . والنشر كناية عن سرعة اطلاعه على جميع ما عمله بحيث إن الكتاب يحضر من قبل وصُول صاحبه مفتوحاً للمطالعة .وقرأ ابن عامر ، وأبو جعفر { يُلَقّاه بضم الياء وتشديد ، القاف مبنياً للمجهول على أنه مضاعف لقي تضعيفاً للتعدية ، أي يجعله لاقياً كقوله : { ولقاهم نضرة وسروراً } \\[ الإنسان : 11 \\]. وأسند إلى المفعول بمعنى يجعله لاقياً . كقوله : { وما يلقاها إلا الذين صبروا } \\[ فصّلت : 35 \\] وقوله : { ويلقون فيها تحية وسلاما } \\[ الفرقان : 75 \\].ونشر الكتاب إظهاره ليقرأ ، قال تعالى : { وإذا الصحف نشرت } \\[ التكوير : 10 \\].\n\n",
      "translations": [
        {
          "translation": "(And every man's augury) the scroll containing his answer to [the angels] Munkar and Nakir in the grave (have We fastened to his own neck) it is also said that this refers to every man's good and evil deeds; and it is also said that it refers to whether he is felicitous or damned, (and We shall bring forth for him on the Day of Resurrection a book which he will find) he will be given (wide open) containing his good and bad deeds.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكُلَّ إِنْسَانٍ أَلْزَمْنَاهُ طَآئِرَهُ فِي عُنُقِهِ } معناه كِتابهٌ\n قالَ صَلواتُ الله عَليهِ وَسَلامُهُ: هو عَمَلُهُ وحَظُّهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And We have imposed upon every man his fate upon his neck} [means that] his record is with him.\n\n\nThe Prophet Muhammad (peace and blessings be upon him) said, \"It is his work and his portion.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وكل إنسان ألزمناه طائره في عنقه } أي: جعلنا سعادته وشقاوته وسبب خيره وشره لازماً لذاته لزوم الطوق في العنق\n كما قال: \" السعيد من سعد في بطن أمه والشقيّ من شقى في بطن أمه \"\n { ونخرج له يَوْم القيامة } الصغرى عند الخروج من قبر جسده { كتاباً } هيكلاً مصوراً بصور أعماله مقلّداً في عنقه { يلقاه } للزومه إياه { منشوراً } لظهور تلك الهيئات فيه بالفعل مفصلة لا مطوياً كما كان عند كونها فيه بالقوة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n كأن الأعمال جناح له { وَ } بعد انقضاء النشأة الأولى المعدَّة للاختبار والاعتبار { نُخْرِجُ لَهُ يَوْمَ ٱلْقِيَامَةِ كِتَاباً } جامعاً لجميع ما صدر عنه في دار الابتلاء { يَلْقَاهُ } وينال إليه { مَنْشُوراً } [الإسراء: 13] على رءوس الملأ والأشهاد تكريماً وتعظيماً\n أو تفضيحاً وتقريعاً\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وكذا: { وكل إنسان } و { يلقاه منشورًا }: صفتان لكتاب\n يقول الحق جلّ جلاله: { ويدعُ الإنسانُ } على نفسه وولده وماله { بالشرِّ } عند الغضب والقنط\n { دعاءَهُ بالخير } مثل دعائه بالخير\n وهو ذم له يدل على عدم صبره\n وربما وافق وقت الإجابة فيهلك\n { وكان الإِنسانُ عَجُولاً } يُسارع إلى كل ما يخطر بباله\n لا ينظر عاقبته\n ويجوز أن يريد بالإنسان الكافر\n وبالدعاء استعجاله بالعذاب استهزاء\n كقول النضر بن الحارث: اللهم انصر خير الحزبين\n[الأنفال: 32] الآية\n وقيل: المراد بالإنسان: آدم عليه السلام\n فإنه لما انتهى الروح إلى سُرَّته ذهب ليقوم\n فسقط\n وهو بعيد\n فإذا نزلت بالإنسان قهرية فلا يقنط ولا يستعجل\n فإنَّ وقت الفرج محدود\n فالليل والنهار مطيتان\n يُقربان كل بعيد\n ويبليان كل جديد\n ويأتيان بكل موعود\n ولذا قال تعالى إثره: { وجعلنا الليلَ والنهارَ آيتين } دالتين على كمال قدرتنا\n وباهر حكمتنا\n يتعاقبان على الإنسان\n يُقربان له كل بعيد\n ويأتيان له بكل موعود\n { فمحونا آيةَ الليل } أي: فمحونا الآية التي هي الليل بأن جعلناها مظلمة\n لتسكنوا فيه\n { وجعلنا آية النهار مُبصرةً } أي: مضيئة مشرقة لتبتغوا من فضله\n أو: وجعلنا نيري الليل والنهار آيتين\n وهما: الشمس والقمر\n { فمحونا آية الليل } \n وهو القمر بأن جعلناه أطلس\n لا نور فيه من ذاته\n بل نوره مستمد من نور الشمس\n { وجعلنا آية النهار } \n وهي الشمس { مبصرةً } للناس\n أو مبصرًا فيها بالضوء الذاتي\n { لتبتغوا فضلاً من ربكم } لتطلبوا في بياض النهار أسباب معاشكم\n { ولتعلموا } باختلافهما وبحركتهما\n { عددَ السنينَ والحسابَ } وحساب الأوقات من الأشهر والأيام\n في معاملتكم وتصرفاتكم\n { وكلَّ شيء } تفتقرون إليه في أمر الدين والدنيا { فصَّلناه تفصيلاً } بيَّناه تبيينًا لا لبس فيه\n أو: وكل شيء يظهر في الوجود\n فصّلناه وقدّرناه في اللوح المحفوظ تفصيلاً\n فلا يظهر في عالم الشهادة إلا ما فُصل في عالم الغيب\n { وكل إِنسانٍ ألزمناه طائره } أي: حظه وما قُدر له من خير وشر\n فهو لازم { في عُنقه } لا ينفك عنه\n ويقال لكل ما لزم الإنسان: قد لزم عنقه\n وإنما قيل للحظ المقدر في الأزل من الخير والشر: طائر لقول العرب: جرى لفلان الطائر بكذا من الخير والشر\n على طريق الفأل والطيرة\n فخاطبهم الله بما يستعملون\n وأعلمهم أن ذلك الأمر الذي يجعلونه بالطائر هو ملزم لأعناقهم\n لا محيد لهم عنه\n كالسلسلة اللازمة للعنق\n يُجر بها إلى ما يُراد منه\n\nومثله:\n[الأعرَاف: 131]\n وقال مجاهد: \" ما من مولود يولد إلا في عنقه ورقة\n مكتوب فيها شقي أو سعيد \"\n أو: وكل إنسان ألزمناه عمله يحمله في عنقه\n { ونُخرج له يوم القيامة كتابًا } مكتوب فيه عمله\n وهو صحيفته\n { يلقاه منشورًا } ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:129",
      "similarity": 0.5614958883900412
    },
    {
      "verse": "11:28",
      "similarity": 0.5604686855591859
    },
    {
      "verse": "48:26",
      "similarity": 0.42797072643071643
    },
    {
      "verse": "13:5",
      "similarity": 0.2637698323806982
    },
    {
      "verse": "17:29",
      "similarity": 0.2580423632045719
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017013.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017013.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}