{
  "chapter": "الإسراء",
  "text": "قل لو انتم تملكون خزائن رحمة ربى اذا لامسكتم خشية الانفاق وكان الانسن قتورا",
  "translations": [
    {
      "translation": "Say: 'Even if you possessed the vast storehouses of my Lord's mercy, you would still hold back, fearing they would run out.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Even if you owned the stores of the mercy of my Lord, you would have held them back for fear of spending them, for man is niggardly.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): \"Even if you owned the treasures of my Lord's Mercy you would have held them back for fear of spending them.\" Man is indeed ever niggardly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Had you owned the treasures of the Mercy of my Lord, you would have locked them up for fear of spending them. The human being has always been stingy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “If you owned the treasures of the mercy of my Lord, you would hoard them too for fear that they may get spent; and man is a big miser.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If you possessed the treasure of the mercy of my Lord, then you would surely hold back for fear of spending, and man is ever miserly!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If you control the treasures of the mercy of my Lord, then you would withhold (them) from fear of spending, and man is niggardly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If you possessed the treasuries of my Lord's mercy, yet would you hold back for fear of expending; and man is ever niggardly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them): If ye possessed the treasures of the mercy of my Lord, ye would surely hold them back for fear of spending, for man was ever grudging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Even if you possessed the treasures of the mercy of my Lord, you would surely hold them back for fear of spending. Man is indeed niggardly!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: if it were ye who owned the treasures of the mercy of my Lord, ye would surely refrain for fear of expending; and man is ever miserly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Even if you possessed the treasuries of my Lord’s mercy, you would withhold them for the fear of being spent, and man is very niggardly.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If ye had control of the Treasures of the Mercy of my Lord, behold, ye would keep them back, for fear of spending them: for man is (every) niggardly!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (to the disbelievers): \"If you possessed the treasure of the Mercy of my Lord (wealth, money, provision, etc.), then you would surely hold back (from spending) for fear of (being exhausted), and man is ever miserly!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If you possessed the treasuries of my Lord's Mercy, you would hold them back for fear of spending and mankind is ever grudging!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If you possessed the treasuries of my Lord’s mercy, you would have withheld them for fear of spending.” The human being has always been stingy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say [to them], \"If you possessed the depositories of the mercy of my Lord, then you would withhold out of fear of spending.\" And ever has man been stingy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:100] Say, to them: ‘If you possessed the treasuries of my Lord’s mercy, [those treasuries] of provision and rain, you would surely withhold [them], [you would] stint, for fear of spending, fearing that they would be depleted if [one] spent [from them] and [that] you would then become impoverished; and man is ever niggardly’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca: (If you possessed the treasures of the mercy of my Lord) if you possessed the keys to the stores of the provision of my Lord, (ye would surely hold them back for fear of spending) for fear of becoming poor, (for man) i.e. the disbelieving man (was ever grudging) parsimonious, stingy and tight-fisted.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَانَ ٱلإنْسَانُ قَتُوراً } معناه مُقترٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And the man was Qatūrāan\" means Muqturun.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } للمنكرين المتوهمين نفاد قدرة الله وانصرام حوله وقوته عن مراده: لا تقيسوا الغائب على الشاهد، ولا تتوهموا الشح والبخل والعجز والاضطرار في حق الله بل الكل هو من أوصافكم وخواصكم؛ إذ { لَّوْ أَنْتُمْ تَمْلِكُونَ خَزَآئِنَ رَحْمَةِ رَبِّي } مع سمعتها وعدم نفادها وتناهيها أصلاً { إِذاً لأمْسَكْتُمْ } وبخلتم { خَشْيَةَ ٱلإِنْفَاقِ } أيك مخافة النفاد بالإنفاق بلا وضع شيءٍ بدل ما ينفق { وَكَانَ ٱلإنْسَانُ } خُلق في أصل فطرته { قَتُوراً } [الإسراء: 100] ممسكاً لازدحام لوازم الإمكان الافتقار فيه؛ إذ هو أحوج المظاهر وأبعدهم عن الوحدة الذاتية؛ لأنه آخر نقطة قوس الإمكان، وهي نهاية الكثرة، وصار أول نقطة قوس الوجوب إن انخلع عن ملابس الإمكان، وتجرد عنها بالمرة بلا شوب شينٍ ونقصانس\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { لو أنتم }: الضمير: فاعل بفعل يفسره ما بعده، كقول حاتم:\n\nوفائدة ذلك الحذف والتفسير للدلالة على الاختصاص والمبالغة\n وقيل في إعرابه غير هذا\n يقول الحقّ جلّ جلاله: { أوَ لم يَروا } أي: أوَ لم يتفكروا ولم يعلموا { أنَّ الله الذي خلق السماواتِ والأرضَ } من غير مادة، مع عِظمها، { قادرٌ على أن يخلق مثلهم } في الصِّغر والحقارة\n على أن المثل مقحم، أي: على أن يخلقهم خلقًا جديدًا فإنهم ليسوا أشد خلقًا منهم، ولا الإعادة بأصعب من الإبداء، { وجعل لهم } أي: لموتهم وبعثهم { أجلاً } محققًا { لا ريب فيه } وهو: القيامة\n { فأبى الظالمون إِلا كفورًا } إلا جحودًا، وضع الظاهر موضع الضمير تسجيلاً عليهم بالظلم وتجاوز الحد فيه\n { قلْ } لهم: { لو أنتم تملكونَ خزائنَ رحمةِ ربي } خزائن رزقه وسائر نعمه التي أفاضها على كافة الموجودات، { إِذًا لأمْسَكْتُم } لبخلتم، { خشيةَ الإِنفاق } مخافة النفاد بالإِنفاق، إذ ليس في الدنيا أحد إلا وهو يختار النفع لنفسه، ولو آثر غيره بشيء فإنما يُؤثره لغرض يفوقه، فهو إذًا بخيل بالإضافة إلى وجود الله سبحانه، إلا من تخلق بخلق الرحمن من الأنبياء وأكابر الصوفية\n { وكان الإِنسانُ قَتورًا } مبالغًا في البخل لأن مبني أمره على الحاجة والضنة بما يحتاج إليه، وملاحظة العوض فيما يبذل\n يعني: أن طبع الإنسان ومنتهى نظره: أن الأشياء تتناهى وتفنى، وهو لو ملك خزائن رحمة الله لأمسك خشية الفقر، وكذلك يظن أن قدرة الله تقف دون البعث، والأمر ليس كذلك، بل قدرته لا تتناهى، فهو يخترع من الخلق ما يشاء، ويخترع من الأرزاق ما يريد، فلا يخاف نفاد خزائن رحمته\n وبهذا النظر تتصل الآية بما قبلها\n انظر ابن عطية\n قلت: ويمكن أن تتصل في المعنى بقوله: { أَبعثَ اللهُ بشرًا رسولاً } ، فكأنَّ الحق تعالى يقول لهم: لو كانت بيدكم خزائن رحمته، لخصصتم بالنبوة من تريدون، لكن ليست بيدكم، ولو كانت بيدكم تقديرًا، لأمسكتم خشية الإنفاق لأن طبع الإنسان البخل وخوف الفقر، فهو كقوله تعالى:\n\n[ص: 9]، بعد قوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:67",
      "similarity": 0.6631474584613545
    },
    {
      "verse": "80:41",
      "similarity": 0.5899627059000346
    },
    {
      "verse": "10:26",
      "similarity": 0.5082100358584798
    },
    {
      "verse": "2:236",
      "similarity": 0.4670527369309797
    },
    {
      "verse": "15:21",
      "similarity": 0.321542049002183
    }
  ]
}