{
  "chapter": "الإسراء",
  "text": "وكل انسن الزمنه طئره فى عنقه ونخرج له يوم القيمة كتبا يلقىه منشورا",
  "translations": [
    {
      "translation": "We have fastened the destiny of every man about his neck and on the Day of Rising We will bring out a Book for him which he will find spread open in front of him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Round each man's neck We have hung his ledger of deeds, and on the Day of Resurrection will present it as a book spread out (and say):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have fastened every man's omen to his neck. On the Day of Resurrection We shall produce for him his scroll in the shape of a wide open book, (saying):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made every person's actions cling to his neck. On the Day of Judgment, We will bring forth the record of his actions in the form of a wide open book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have attached the destiny of every man to his neck; and We shall bring forth a register for him on the Day of Resurrection, which he will find open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have fastened every man's Ta'irah (deeds) to his neck, and on the Day of Resurrection, We shall bring out for him a Book which he will find wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made every man's actions to cling to his neck, and We will bring forth to him on the resurrection day a book which he will find wide open:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every man -- We have fastened to him his bird of omen upon his neck; and We shall bring forth for him, on the Day of Resurrection, a book he shall find spread wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every man's augury have We fastened to his own neck, and We shall bring forth for him on the Day of Resurrection a book which he will find wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tied the fate of every man about his neck; and We shall produce a book for him on Resurrection Day that he will find spread open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every man: We have fastened his action round his neck, and We shall bring forth unto him on the Day of Judgment a book proffered him open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have attached every person’s omen to his neck, and We shall bring it out for him on the Day of Resurrection as a book that he will find wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every man's fate We have fastened on his own neck: On the Day of Judgment We shall bring out for him a scroll, which he will see spread open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have fastened every man's deeds to his neck, and on the Day of Resurrection, We shall bring out for him a book which he will find wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to every human? We have fastened to him his bird of deeds upon his neck; and on the Day of Resurrection We shall bring forth to him a book spread open wide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every person We have attached his fate to his neck. And on the Day of Resurrection, We will bring out for him a book which he will find spread open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [for] every person We have imposed his fate upon his neck, and We will produce for him on the Day of Resurrection a record which he will encounter spread open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:13] And We have attached every person’s omen — his deeds — for him to carry, upon his neck — this [site] is singled out for mention because fastening [something] to it is [much] more severe; Mujāhid [b. Jabr alMakkī] said, ‘There is not a child born but it has a leaf around its neck in which it is decreed [that the child will be either] fortunate or damned’ — and We shall bring forth for him, on the Day of Resurrection, a book, in which his deeds are recorded [and], which he will find wide open (yalqāhu manshūran: both are adjectival qualifications of kitāban, ‘a book’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And every man's augury) the scroll containing his answer to [the angels] Munkar and Nakir in the grave (have We fastened to his own neck) it is also said that this refers to every man's good and evil deeds; and it is also said that it refers to whether he is felicitous or damned, (and We shall bring forth for him on the Day of Resurrection a book which he will find) he will be given (wide open) containing his good and bad deeds.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكُلَّ إِنْسَانٍ أَلْزَمْنَاهُ طَآئِرَهُ فِي عُنُقِهِ } معناه كِتابهٌ\n قالَ صَلواتُ الله عَليهِ وَسَلامُهُ: هو عَمَلُهُ وحَظُّهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And We have imposed upon every man his fate upon his neck} [means that] his record is with him.\n\n\nThe Prophet Muhammad (peace and blessings be upon him) said, \"It is his work and his portion.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكُلَّ إِنْسَانٍ أَلْزَمْنَاهُ طَآئِرَهُ فِي عُنُقِهِ } أي: بعدما رتبنا أمور معاش الإنسان ومعاده على ما ينبغي ويليق بحاله، كتبنا جميع ما صدر عنه من الأعمال الصالحة والفاسدة في مكتوبٍ جامع لها، محيط بها، وعلقناه في عنقه تعليقاً لازماً، شبّه الأعمال بالطائر؛ لأن الإنسان يطير ويميل نحو السعادة والشقاة بما صدر عنه من الأعمال، كأن الأعمال جناح له { وَ } بعد انقضاء النشأة الأولى المعدَّة للاختبار والاعتبار { نُخْرِجُ لَهُ يَوْمَ ٱلْقِيَامَةِ كِتَاباً } جامعاً لجميع ما صدر عنه في دار الابتلاء { يَلْقَاهُ } وينال إليه { مَنْشُوراً } [الإسراء: 13] على رءوس الملأ والأشهاد تكريماً وتعظيماً، أو تفضيحاً وتقريعاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n الخ، و { كل شيء }: منصوب بفعل مضمر، يفسره ما بعده، وكذا: { وكل إنسان } و { يلقاه منشورًا }: صفتان لكتاب\n يقول الحق جلّ جلاله: { ويدعُ الإنسانُ } على نفسه وولده وماله { بالشرِّ } عند الغضب والقنط\n { دعاءَهُ بالخير } مثل دعائه بالخير\n وهو ذم له يدل على عدم صبره، وربما وافق وقت الإجابة فيهلك، { وكان الإِنسانُ عَجُولاً } يُسارع إلى كل ما يخطر بباله، لا ينظر عاقبته\n ويجوز أن يريد بالإنسان الكافر، وبالدعاء استعجاله بالعذاب استهزاء، كقول النضر بن الحارث: اللهم انصر خير الحزبين\n\n[الأنفال: 32] الآية\n وقيل: المراد بالإنسان: آدم عليه السلام، فإنه لما انتهى الروح إلى سُرَّته ذهب ليقوم، فسقط، وهو بعيد\n فإذا نزلت بالإنسان قهرية فلا يقنط ولا يستعجل، فإنَّ وقت الفرج محدود، فالليل والنهار مطيتان، يُقربان كل بعيد، ويبليان كل جديد، ويأتيان بكل موعود\n ولذا قال تعالى إثره: { وجعلنا الليلَ والنهارَ آيتين } دالتين على كمال قدرتنا، وباهر حكمتنا، يتعاقبان على الإنسان، يُقربان له كل بعيد، ويأتيان له بكل موعود\n { فمحونا آيةَ الليل } أي: فمحونا الآية التي هي الليل بأن جعلناها مظلمة، لتسكنوا فيه، { وجعلنا آية النهار مُبصرةً } أي: مضيئة مشرقة لتبتغوا من فضله، أو: وجعلنا نيري الليل والنهار آيتين، وهما: الشمس والقمر، { فمحونا آية الليل } ، وهو القمر بأن جعلناه أطلس، لا نور فيه من ذاته، بل نوره مستمد من نور الشمس، { وجعلنا آية النهار } ، وهي الشمس { مبصرةً } للناس، أو مبصرًا فيها بالضوء الذاتي، { لتبتغوا فضلاً من ربكم } لتطلبوا في بياض النهار أسباب معاشكم، { ولتعلموا } باختلافهما وبحركتهما، { عددَ السنينَ والحسابَ } وحساب الأوقات من الأشهر والأيام، في معاملتكم وتصرفاتكم، { وكلَّ شيء } تفتقرون إليه في أمر الدين والدنيا { فصَّلناه تفصيلاً } بيَّناه تبيينًا لا لبس فيه، أو: وكل شيء يظهر في الوجود، فصّلناه وقدّرناه في اللوح المحفوظ تفصيلاً، فلا يظهر في عالم الشهادة إلا ما فُصل في عالم الغيب\n { وكل إِنسانٍ ألزمناه طائره } أي: حظه وما قُدر له من خير وشر، فهو لازم { في عُنقه } لا ينفك عنه\n ويقال لكل ما لزم الإنسان: قد لزم عنقه\n وإنما قيل للحظ المقدر في الأزل من الخير والشر: طائر لقول العرب: جرى لفلان الطائر بكذا من الخير والشر، على طريق الفأل والطيرة، فخاطبهم الله بما يستعملون، وأعلمهم أن ذلك الأمر الذي يجعلونه بالطائر هو ملزم لأعناقهم، لا محيد لهم عنه، كالسلسلة اللازمة للعنق، يُجر بها إلى ما يُراد منه\n\n\nومثله:\n\n[الأعرَاف: 131]، وقال مجاهد: \" ما من مولود يولد إلا في عنقه ورقة، مكتوب فيها شقي أو سعيد \"\n أو: وكل إنسان ألزمناه عمله يحمله في عنقه، { ونُخرج له يوم القيامة كتابًا } مكتوب فيه عمله، وهو صحيفته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:129",
      "similarity": 0.5614958883900412
    },
    {
      "verse": "11:28",
      "similarity": 0.5604686855591859
    },
    {
      "verse": "48:26",
      "similarity": 0.42797072643071643
    },
    {
      "verse": "13:5",
      "similarity": 0.2637698323806982
    },
    {
      "verse": "17:29",
      "similarity": 0.2580423632045719
    }
  ]
}