{
  "chapter": "الإسراء",
  "text": "ويخرون للاذقان يبكون ويزيدهم خشوعا",
  "translations": [
    {
      "translation": "they fall to the ground in prostration, and it increases them in humility.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And weeping they kneel down, and this increases their humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they fall down upon their faces, weeping, and their humility increases when (the Qur'an) is recited to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They bow down in prostration and weep and it makes them more humble (before the Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they fall down on their faces weeping, and this Qur’an increases their humility. (Command of prostration # 4).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they fall down on their chins (faces) weeping and it increases their humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they fall down on their faces weeping, and it adds to their humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they fall down upon their faces weeping; and it increases them in humility.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fall down on their faces, weeping, and it increaseth humility in them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fall down upon their faces weeping, and [the Quran] increases their humility.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they fall down on their chins weeping, and it increaseth them in humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Weeping, they fall down on their faces, and it increases them in humility.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fall down on their faces in tears, and it increases their (earnest) humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they fall down on their faces weeping and it adds to their humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fall down upon their chin, weeping and it increases them in humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they fall to their chins, weeping, and it adds to their humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they fall upon their faces weeping, and the Qur'an increases them in humble submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:109] And they fall down on their faces, weeping (yabkūna is a supplement [to yakhirrūna, ‘they fall down’] also containing an adjectival qualification [of those falling down]); and it, the Qur’ān, increases them in humility’, in humbleness before God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They fall down on their faces) in prostration, (weeping) in their prostration, (and it increaseth humility in them) this was revealed about 'Abdullah Ibn Salam and his companions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَخِرُّونَ لِلأَذْقَانِ } يكُونَ [والأَذقانُ] واحدُها ذِقنٌ وهو مَجمعُ اللحَيين\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَيَخِرُّونَ } أيضاً العالمون العارفون بحقية القرآن بعد تأملهم، وتوغلهم في حِكَمِه وأحكامه وحقائقه ومعارفه { لِلأَذْقَانِ } حال كونهم { يَبْكُونَ } من خشية الله { وَ } بالجملة: { يَزِيدُهُمْ } التأمل والتدبر فيه على وجه التدقيق والتعمق { خُشُوعاً } [الإسراء: 109] وخضوعاً؛ لاطلاعهم على سرائر شهِدَت بها أذواقهم، وذاق حلاوتَها وجدانُهم وسرائرُهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والثاني: لِمَا أثر فيهم من مواعظ القرآن، { يَبْكُونَ }: حال، أي: حال كونهم باكين من خشية الله، { ويزيدهم } القرآنُ { خشوعًا } ، كما يزيدهم علمًا بالله تعالى\n\n\nالإشارة: وبالحق أنزلناه، أي بالتعريف بأسرار الربوبية، وبالحق نزل لتعليم آداب العبودية\n أو: بالحق أنزلناه، يعني: علم الحقيقة، وبالحق نزل علم الشريعة والطريقة\n وما أرسلناك إلا مبشرًا لأهل الإخلاص بالوصول والاختصاص، ونذيرًا لأهل الخوض بالطرد والبعد\n وقرآنا فرقناه، لتقرأه نيابة عنا، كي يسمعوه منا بلا واسطة، عند فناء الرسوم والأشكال، ونزّلناه، للتعريف بنا تنزيلاً، قل آمنوا به لتدخلوا حضرتنا، أو لا تؤمنوا، فإن أهل العلم بنا قائمون بحقه، خاشعون عند تلاوته، متنعمون بشهودنا عند سماعه منا\n وبالله التوفيق\n ولما كان القرآن مشتملاً على أسماء كثيرة من أسماء الله الحسنى، وكان عليه الصلاة والسلام يقول في دعائه: \" يا الله، يا رحمن \" ، قالوا: إنه ينهانا عن عبادة إلٰهين، وهو يدعو إلهًا آخر\n وقالت اليهود: إنك لتُقل ذكر الرحمن، وقد أكثر الله تعالى ذكره في التوراة، فأنزل الله ردًا على الفريقين\n { قُلِ ٱدْعُواْ ٱللَّهَ أَوِ ٱدْعُواْ ٱلرَّحْمَـٰنَ أَيّاً مَّا تَدْعُواْ فَلَهُ ٱلأَسْمَآءَ ٱلْحُسْنَىٰ\n\n\n } قلت: \" أي \" شرطية، و { ما }: زائدة تأكيدًا لما في \" أيًّا \" من الإبهام، وتقدير المضاف: أيَّ الأسماء تدعو به فأنت مُصيب\n يقول الحقّ جلّ جلاله: { قُلْ } يا ممد للمؤمنين: { ادعوا الله أو ادعوا الرحمن } نادوه بأيهما شئتم، أو سموه بأيهما أردتم\n والمراد: إما التسوية بين اللفظين فإنهما عبارتان عن ذاتِ واحد، وإن اختلف الاعتبار، والتوحيد إنما هو للذات، الذي هو المعبود بالحق، وإما أنهما سيان في حسن الإطلاق والوصول إلى المقصود، فلذلك قال: { أَيَّا مَا تدعو } أيَّ اسم تدعو به تصب، { فله الأسماءُ الحسنى } فيكون الجواب محذوفًا، دلَّ عليه الكلام\n وقيل: التقدير أيًّا ما تدعو به فهو حسن، فوضع موضعه: { فله الأسماء الحسنى } للمبالغة والدلالة على ما هو الدليل عليه إذ حسن جميع الأسماء يستدعي حسن ذَيْنِك الاسمين، وكونها حسنى لدلالتها على صفات الكمال من الجلال والجمال إذ كلها راجعة إلى حسن ذاتها، وكمالها جمالاً وجلالاً\n قال في شرح المواقف: ورد في الصحيحين:\n\n \" إنَّ للهِ تِسْعَةً وتَسْعِينَ اسْمًا، مائةً إلاَّ وَاحِدًا، مَنْ أَحْصَاهَا دَخَلَ الجَنَّةَ \" \n\n، وليس فيها تعيين تلك الأسماء\n لكن الترمذي والبيهقي عيَّناها\n وهي الطريقة المشهورة، ورواية الترمذي: \" الله الذي لا إله إلا هو، الرحمن، الرحيم، الملك، القدوس، السلام، المؤمن، المهيمن، العزيز، الجبار، المتكبر، الخالق، البارئ المصور، الغفار القهار، الوهاب الرزاق، الفتاح العليم، القابض الباسط، الخافض الرافع، المعز المذل، السميع البصير، الحكم العدل، اللطيف الخبير، الحليم العظيم، الغفور الشكور، العلي الكبير، الحفيظ المقيت، الحسيب الجليل، الكريم الرقيب، المجيب، الواسع الحكيم، الودود المجيد، الباعث الشهيد، الحق الوكيل، القوي المتين، الولي الحميد، المحصي المبدئ المعيد، المحيي المميت، الحي القيوم، الواجد الماجد، الواحد، الأحد الصمد، القادر المقتدر، المقدم المؤخر، الأول الآخر، الظاهر الباطن، الوالي المتعالي، البر التواب، المنتقم العفو الرؤوف، مالك الملك ذو الجلال والإكرام، المقسط الجامع، الغني المغني المانع، الضار النافع، النور الهادي، البديع الباقي، الوارث، الرشيد، الصبور \"\n\n\nوقد ورد التوقيف بغيرها، أمَّا في القرآن فكالمولى، والنصير والغالب، والقاهر والقريب، والرب والأعلى، والناصر والأكرم، وأحسن الخالقين، وأرحم الراحمين، وذي الطول، وذي القوة، وذي المعارج، وغير ذلك\n وأما في الحديث، فكالمنان، والحنان، وقد ورد في رواية ابن ماجة أسماء ليست في الرواية المشهورة كالقائم، والقديم، والوتر، والشديد، والكافي، وغيرها\n وإحصاؤها: إما حفظها لأنه إما يحصل بتكرار مجموعها وتعدادها مرارًا، وإما ضبطها حصرًا وعلمًا وإيمانًا وقيامًا بحقوقها، وإما تعلقًا وتخلقًا وتحققًا\n وقد ذكرنا في شرح الفاتحة الكبير كيفية التعلق والتخلق والتحقق بها\n وفي ابن حجر: أن أسماء الله مائة، استأثر الله بواحد، وهو الاسم الأعظم، فلم يُطلع عليه أحدًا، فكأنه قيل: مائة لكن واحد منها عند الله\n وقال غيره: ليس الاسم الذي يكمل المائة مخفيًا، بل هو الجلالة\n وممن جزم بذلك البيهقي، فقال: الأسماء الحسنى مائة، على عدد درجات الجنة، والذي يكمل المائة: \" الله \" ، ويؤيده قوله تعالى:\n\n[الأعرَاف: 180]\n فالتسعة والتسعون لله فهي زائدة عليه وبه تكمل المائة\n هـ\n قلت: ولعله ذكر اسمًا آخر يكمل التسعة والتسعين\n وإلا فهو مذكور في الرواية المتقدمة من التسعة والتسعين\n والله تعالى أعلم\n الإشارة: { قل ادعوا الله أو ادعوا الرحمن } ، قال الورتجبي: إن الله سبحانه دعا عباده إلى معرفة الاسمين الخاصين، الذين فيهما أسرار جميع الأسماء والصفات والذات، والنعوت والأفعال فالله اسمُهُ، وهو اسمُ عَيْنِ جَمْعِ الجَمعِ، والرحمن اسم عين الجمع فالرحمن مندرج تحت اسمه: \" الله \" لأَنه عين الكل، وإذا قلت: الله ذكرت عين الكل\n ثم قال: وإذا قال \" الله \" يفنى الكل، وإذا قال: \" الرحمن \" يبقى الكل، من حيث الاتصاف والاتحاد، فالاتصاف بالرحمانية يكون، والاتحاد بالألوهية يكون\n ثم قال: عن الأستاذ: من عظيم نعمه سبحانه على أوليائه: أنه يُنزههم بأسرارهم في رياض ذكره بتعداد أسمائه الحسنى، فيتنقلون من روضة إلى روضة، ومن مأنس إلى مأنس، ويقال: الأغنياء تنزههم في بساتينهم، وتنزههم في منابت رياحِينهم\n والفقراء تنزههم في مشاهد تسبيحهم، ويستروحون إلى ما يلوح لأسرارهم من كشوفات جلاله وجماله\n هـ\n قلت: والعارفون تنزههم في مشاهدة أسرار محبوبهم، وما يكشف لهم من روض جماله وجلاله\n وبالله التوفيق\n ثمَّ أمر باخفاء قراءته عن المشركين\n",
      "translations": []
    }
  ]
}