{
  "chapter": "الإسراء",
  "text": "وكم اهلكنا من القرون منۢ بعد نوح وكفى بربك بذنوب عباده خبيرۢا بصيرا",
  "translations": [
    {
      "translation": "How many generations have We laid low after Noah, for your Lord knows and notices well enough the sins of His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many a generation has been destroyed by Our command since Noah's time. Your Lord is well aware and fully observant of the sins of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have destroyed many generations after the time of Noah. Your Lord is All knowing and Well Aware of the sins of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a generation We did destroy after Nooh! And Allah is Sufficient, Aware of the sins of His bondmen, the Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many generations have We destroyed after Nuh! And sufficient is your Lord as All-Knower and Seer of the sins of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many of the generations did We destroy after Nuh! and your Lord is sufficient as Knowing and Seeing with regard to His servants' faults.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations We have destroyed after Noah! Thy Lord suffices as one who is aware of and sees the sins of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed since Noah! And Allah sufficeth as Knower and Beholder of the sins of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed since Noah's time. Your Lord is well aware of the sins of His servants and observes them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation have We destroyed after Nuh; and sufficeth for the offences of His bondmen thy Lord as the Aware, the Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations We have destroyed since Noah! Your Lord is sufficient as [a witness who is] well aware and percipient of His servants’ sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed after Noah? and enough is thy Lord to note and see the sins of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many generations have We destroyed after Nuh (Noah)! And Sufficient is your Lord as an All-Knower and All-Beholder of the sins of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed since Noah! Your Lord suffices as One who is Aware of and sees the sins of His worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed after Noah? Your Lord is sufficient as Knower and Beholder of the sins of his servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many have We destroyed from the generations after Noah. And sufficient is your Lord, concerning the sins of His servants, as Acquainted and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:17] How many — in other words, many — generations, communities, We have destroyed since Noah! And your Lord suffices as One Informed and Beholder of the sins of His servants, Knower of the hidden and manifest aspects of these [sins] (bi-rabbika, ‘your Lord’, is semantically connected to bi-dhunūb, ‘of the sins’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How many generations) of old (have we destroyed since Noah!) since the people of Noah (And Allah sufficeth as knower and Beholder of the sins of His slaves) that they were destroyed even We have not explained this to you; and We know their sins and chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nليس أمثال هذا الإهلاك ببدعٍ منا، بل { وَكَمْ } أي: كثيراً { أَهْلَكْنَا مِنَ ٱلْقُرُونِ } الماضية { مِن بَعْدِ نُوحٍ } كعادٍ وثمود؛ لتعوّهم وعنادهم مع رسول الله { وَ } لا يحتاج لإثبات ضلال أولئك الضالين المضلين إلى شاهدٍ ومبينٍ، بل { كَفَىٰ بِرَبِّكَ } أي: كفى ربك يا أكمل الرسل { بِذُنُوبِ عِبَادِهِ } وخروجهم عن إطاعته وانقياده { خَبِيرَاً } إذ هو عالم بما في سرائرهم وضمائرهم، بل ما في استعداداتهم { بَصِيراً } [الإسراء: 17] بما هو في ظواهرهم وعلنهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكم أهلكنا } أي: كثيرًا أهلكنا { من القُرون } أي: الأمم { من بعد نوح } كعاد وثمود وأصحاب الأيكة، { وكفى بربك بذنوب عباده خبيرًا بصيرًا } عالمًا ببواطنها وظواهرها، فيعاقب عليها أو يعفو\n وبالله التوفيق\n الإشارة: من اهتدى إلى حضرة قدسنا فإنما يهتدي لينعم نفسه بأسرار قدسنا، ومن ضل عنها فإنما يضل عليها حيث حرمها لذيذ المعرفة\n فإن كان في رفقة السائرين، ثم غلبه القضاء، فلا يتعدى وبال رجوعه إلى غيره، بل ما كان يصل إليه من المدد يرجع إلى أصحابه، وما كنا معذبين أحدًا بإسدال الحجاب بيننا وبينه، حتى نبعث من يُعَرِّف بنا، ويكشف الحجاب بيننا وبين من يريد حضرتنا\n والمراد بالحجاب: حجاب الوهم بإثبات حس الكائنات، فلو انهتك حجاب الوهم لوقع العيان على فقد الأعيان، ولو أشرق نورُ الإيقان لغطى وجودَ الأكوان\n وإذا أردنا أن نتلف قلوبًا أمرنا أربابها بالتنعم بالحظوظ والشهوات، فخرجوا عن طريق المجاهدة والرياضة، فحق عليها القول بغم الحجاب، فدمرناها تدميرًا، أي: تركناها تجول في أودية الخواطر والشكوك، فتلفت وهلكت، نعوذ بالله من شر الفتن ودرك المحن\n وسبب الهلاك هو حب الدنيا\n",
      "translations": []
    }
  ]
}