{
  "chapter": "الإسراء",
  "text": "سبحن الذى اسرى بعبده ليلا من المسجد الحرام الى المسجد الاقصا الذى بركنا حوله لنريه من ءايتنا انه هو السميع البصير",
  "translations": [
    {
      "translation": "Glory be to Him who took His slave on a journey by night from the Masjid al-Haram to the Masjid al-Aqsa, whose surroundings We have blessed, in order to show him some of Our Signs. He is the All-Hearing, the All- Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "GLORY TO HIM who took His votary to a wide and open land from the Sacred Mosque (at Makkah) to the distant Mosque whose precincts We have blessed, that We may show him some of Our signs. Verily He is all-hearing and all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Holy is He Who carried His servant by night from the Holy Mosque (in Makkah) to the farther Mosque (in Jerusalem) whose surroundings We have blessed that We might show him some of Our Signs. Indeed He alone is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the Exalted One who took His servant one night for a visit from the Sacred Mosque (in Mecca) to the Aqsa Mosque (in Jerusalem). God has blessed the surroundings of the Aqsa Mosque. He took His servant on this visit to show him (miraculous) evidence of His (existence). It is He who is All-hearing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Purity is to Him Who took His bondman in a part of the night from the Sacred Mosque to the Aqsa Mosque around which We have placed blessings, in order that We may show him Our great signs; indeed he is the listener, the beholder. (This verse refers to the physical journey of Prophet Mohammed – peace and blessings be upon him – to Al Aqsa Mosque and from there to the heavens and beyond. The entire journey back to Mecca was completed within a small part of the night.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorified be He Who took His servant for a Journey by Night from Al-Masjid Al-Haram to Al-Masjid Al-Aqsa, the neighborhood whereof We have blessed, in order that We might show him of Our Ayat. Verily, He is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him Who made His servant to go on a night from the Sacred Mosque to the remote mosque of which We have blessed the precincts, so that We may show to him some of Our signs; surely He is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory be to Him, who carried His servant by night from the Holy Mosque to the Further Mosque the precincts of which We have blessed, that We might show him some of Our signs. He is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorified be He Who carried His servant by night from the Inviolable Place of Worship to the Far distant place of worship the neighbourhood whereof We have blessed, that We might show him of Our tokens! Lo! He, only He, is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Holy is He who took His servant by night from the sacred place of worship [at Makkah] to the remote house of worship [at Jerusalem] -- the precincts of which We have blessed, so that We might show him some of Our signs. Surely, it is He who is All Hearing, and All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hallowed be He Who translated His bondman in a night from the Sacred Mosque to the Furthest Mosque, the environs whereof We have blest, that We might shew him of Our signs; verily He! He is the Hearer, the Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Immaculate is He who carried His servant on a journey by night from the Sacred Mosque to the Farthest Mosque whose environs We have blessed, that We might show him some of Our signs. Indeed, He is the All-hearing, the All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory to (Allah) Who did take His servant for a Journey by night from the Sacred Mosque to the farthest Mosque, whose precincts We did bless,- in order that We might show him some of Our Signs: for He is the One Who heareth and seeth (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorified (and Exalted) be He (Allah) [above all that (evil) they associate with Him] [Tafsir Qurtubi, Vol. 10, Page 204] Who took His slave (Muhammad SAW) for a journey by night from Al-Masjid-al-Haram (at Makkah) to the farthest mosque (in Jerusalem), the neighborhood whereof We have blessed, in order that We might show him (Muhammad SAW) of Our Ayat (proofs, evidences, lessons, signs, etc.). Verily, He is the All-Hearer, the All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is He who carried His worshiper (Prophet Muhammad) to travel in the night from the Sacred Mosque to the Furthest Mosque which We have blessed around it so that We might show him some of Our signs. He is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glory to Him who journeyed His servant by night, from the Sacred Mosque, to the Farthest Mosque, whose precincts We have blessed, in order to show him of Our wonders. He is the Listener, the Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is He who took His Servant by night from al-Masjid al-Haram to al-Masjid al-Aqsa, whose surroundings We have blessed, to show him of Our signs. Indeed, He is the Hearing, the Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:1] Glory be to Him — an affirmation of [God’s] transcendence — Who carried His servant, Muhammad (s), by night (laylan is in the accusative as an adverbial qualification; isrā’ means ‘to travel by night’; what is instructive about this mention [of laylan, ‘by night’] is that, through its being indefinite, there is an indication of the brevity of its duration) from the Sacred Mosque, that is, Mecca, to the Farthest Mosque, the Holy House [of Jerusalem], so called because of its distance from the former; the environs of which We have blessed, with fruits and rivers, that We might show him some of Our signs, the marvels of Our power. Indeed He is the Hearing, the Seeing, that is to say, the Knower of the Prophet’s (s) sayings and deeds. Thus He [God] was gracious to him by way of [carrying him on] the night journey, which comprised his encountering the [other] prophets, his ascension to heaven and the sight of the marvels of the [Divine] Realm and His communion, exalted be He, with him. For he [the Prophet] (s) said: ‘I was brought al-Burāq, a white animal, larger than a donkey but smaller than a mule; it was able to place its hoof [back] towards its extremity and so I mounted it. It set off carrying me until I reached the Holy House [of Jerusalem]. [There] I fastened the animal to the ring where the prophets fasten [their animals]. I then went in and prayed two units inside it. As I came out, Gabriel came to me with a jug of wine and a jug of milk, and so I chose the milk. Gabriel said [to me], “You have made the right choice [by choosing] the primordial nature (fitra)”.’ He [the Prophet] continued [the narration], ‘We then ascended to the heaven of this world, whereat Gabriel asked to be let in. Someone asked, “Who are you?”. He replied, “Gabriel”, “And who is with you?”, “Muhammad (s)”, he said. “Has he been sent for?”. “Yes, he has been sent for”. Then it was opened for us, and lo! Adam stood before me; he greeted me and prayed for well-being for me. We then ascended to the second heaven and Gabriel asked to be let in. Someone asked, “Who are you?”. He replied, “Gabriel”, “And who is with you?”, “Muhammad (s)”, he said. “Has he been called forth?”. “Yes, he has been called forth”. And it was opened up for us, and lo! there were the two [maternal] cousins, John and Jesus. They greeted me and prayed for well-being for me. We then ascended to the third heaven and Gabriel asked to be let in. Someone asked, “Who are you?”. He replied, “Gabriel”, “And who is with you?”, “Muhammad (s)”, he said. “Has he been sent for?” it was asked. “Yes, he has been sent for”. And it was opened up for us, and lo! there was Joseph standing before me, and indeed he had been given one half of all beauty! He greeted me and prayed for well-being for me. We then ascended to the fourth heaven and Gabriel asked to be let in. Someone asked, “Who are you?”. He replied, “Gabriel”, “And who is with you?”, “Muhammad (s)”, he said. “Has he been called forth?”, it was asked. “Yes, he has been called forth”, he replied. And it was opened up for us, and lo! there before me was Enoch (Idrīs). He greeted me and prayed for well-being for me. We then ascended to the fifth heaven and Gabriel asked to be let in. Someone asked, “Who are you?”. He replied, “Gabriel”. “And who is with you?” it was asked, “Muhammad (s)”, he replied. “Has he been sent for?”, it was said. “Yes, he has been sent for”, he replied. And it was opened up for us, and lo! there before me was Aaron. He greeted me and prayed for well-being for me. We then ascended to the sixth heaven and Gabriel asked to be let in. Someone asked, “Who are you?”. He replied, “Gabriel”; “and who is with you?”, “Muhammad (s)”, he said. “Has he been called forth?”, it was asked. “Yes, he has been called forth”. And it was opened up for us, and lo! there before me was Moses. He greeted me and prayed for well-being for me. We then ascended to the seventh heaven and Gabriel asked to be let in. Someone asked, “Who are you?”. He replied, “Gabriel”, “And who is with you?”; “Muhammad (s)”, he said. “Has he been called forth?”, it was asked. “Yes, he has been called forth”, he replied. And it was opened up for us, and lo! there before me was Abraham, leaning [seated] against the Frequented House (al-bayt al-ma‘mūr), into which 70,000 angels enter every day never to return thereto. I was then taken to the Lote-Tree of the Boundary (sidrat al-   muntahā), and lo! its leaves resemble the ears of elephants, its fruits like pitchers [in size]. When some command of God’s enveloped it, it changed, and lo! none of God’s creation could describe it for all its beauty’. He [the Prophet] continued: ‘God then revealed to me what He revealed and prescribed for me fifty prayers each day and night. I then descended until I reached Moses and he said, “What has your Lord prescribed for your community?” I said, “Fifty prayers each day and night”. He said, “Go back to your Lord and ask Him for an alleviation, for your community will not have the capacity for it: I have tried the Children of Israel and have experience of them [not being up to the task].” I then went back to my Lord and said, “My Lord! Lighten that [prescription] for my community”, and so He reduced it for me by five. I went back to Moses who asked me, “What did you do?”. I said to him, ‘He has reduced it for me by five’, to which he said, “Your community will not have the capacity for this; so go back to your Lord and ask Him for an alleviation for your community”. Thus I kept going back and forth between my Lord and Moses, with Him reducing it by five each time until He said, “O Muhammad (s)! They shall be five prayers each day and night, every prayer will be worth [the reward of] ten [prayers]; that then makes fifty prayers. And whoever intends a good deed but does not perform it, I shall count it for him as one [done]; and if he performs it, I shall count it for him as ten; and whoever intends an evil deed, but does not perform it, it shall not be recorded against him; but if he performs it, it shall be recorded [only] as one evil deed”. I then descended until I reached Moses. I informed him and he said, “Go back to your Lord and ask Him for an alleviation for your community, because your community will not have the capacity for this”; and I said, “I have gone back to my Lord so many times that I am ashamed [to go again]”. This [hadīth] is reported by the two Shaykhs [al-Bukhārī and Muslim]; but the wording [of this version] is that of [the report in the Sahīh of] Muslim. Al-Hākim [alNaysābūrī] reports in the Mustadrak by way of Ibn ‘Abbās that he said, ‘The Prophet (s) said, “I did see my Lord, Mighty and Majestic”.’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالافتتاح بكلمة التسبيح من دون سبق كلام مُتضمّننٍ ما يَجب تنزيه الله عنه يؤذن بأن خبراً عجيباً يستقبله السامعون دالاً على عظيم القدرة من المتكلم ورفيع منزلة المتحدث عنه .فإن جملة التسبيح في الكلام الذي لم يقع فيه ما يوهم تشبيهاً أو تنقيصاً لا يليقان بجلال الله تعالى مثل { سبحان ربك رب العزة عما يصفون } \\[ الصافّات : 180 \\] يتعين أن تكون مستعملة في أكثر من التنزيه ، وذلك هو التعجيب من الخبر المتحدث به كقوله { قلتم ما يكون لنا أن نتكلم بهذا سبحانك هذا بهتان عظيم } \\[ النور : 16 \\] ، وقول الأعشى:قد قلتُ لما جاءني فخرُه...سُبْحَان من علقمَةَ الفاخِرِ ... ولما كان هذا الكلام من جانب الله تعالى والتسبيح صادراً منه كان المعنى تعجيب السامعين ، لأن التعجب مستحيلة حقيقته على الله لا لأن ذلك لا يلتفت إليه في محامل الكلام البليغ لإمكان الرجوع إلى التمثيل ، مثل مجيء الرجاء في كلامه تعالى نحو { لعلكم تفلحون } \\[ البقرة : 189 \\] ، بل لأنه لا يستقيم تعجب المتكلم من فعل نفسه ، فيكون معنى التعجيب فيه من قبيل قولهم أتعجب من قول فلان كيْت وكيْت .ووجه هذا الاستعمال أن الأصل أن يكون التسبيح عند ظهور ما يدل على إبطال ما لا يليق بالله تعالى . ولما كان ظهور ما يدل على عظيم القدرة مزيلاً للشك في قدرة الله وللإشراك به كان من شأنه أن يُنطق المتأمل بتسبيح الله تعالى ، أي تنزيهه عن العجز .وأصل صيغ التسبيح هو كلمة { سبحان الله } التي نُحت منها السبحلة . ووقع التصرف في صيغها بالإضمار نحو سبحانَك وسبحانه ، وبالموصول نحو { سبحان الذي خلق الأزواج كلها } \\[ يس : 36 \\] ومنه هذه الآية .والتعبير عن الذات العلية بطريق الموصول دون الاسم العلم للتنبيه على ما تفيده صلة الموصول من الإيماء إلى وجه هذا التعجيب والتنويه وسببه ، وهو ذلك الحادث العظيم والعناية الكبرى . ويفيد أن حديث الإسراء أمر فَشا بين القوم ، فقد آمن به المسلمون وأكبَره المشركون .وفي ذلك إدماج لرفعة قدر محمد وإثباتُ أنه رسول من الله ، وأنه أوتي من دلائل صدق دعوته ما لا قِبل لهم بإنكاره ، فقد كان إسراؤه إطلاعاً له على غائب من الأرض ، وهو أفضل مكان بعد المسجد الحرام .و { أسرى } لغة في سَرَى ، بمعنى سار في الليل ، فالهمزة هنا ليست للتعدية لأن التعدية حاصلة بالباء ، بل أسرى فعل مفتح بالهمزة مرادف سَرى ، وهو مثل أبان المرادف بَان ، ومثل أنهج الثوبُ بمعنى نَهَجَ أي بلِيَ ، ف { أسرى بعبده } بمنزلة { ذهب الله بنورهم } \\[ البقرة : 17 \\].وللمبرد والسهيلي نكتة في التفرقة بين التعدية بالهمزة والتعدية بالباء بأن الثانية أبلغ لأنها في أصل الوضع تقتضي مشاركة الفاعل المفعولَ في الفعل ، فأصل ( ذهب به ) أنه استصحبه ، كما قال تعالى{ وسار بأهله } \\[ القصص : 29 \\]. وقالت العرب أشبعهم شتماً ، ورَاحوا بالإبل . وفي هذا لطيفة تناسب المقام هنا إذ قال { أسرى بعبده } دون سرّى بعبْدَه ، وهي التلويح إلى أن الله تعالى كان مع رسوله في إسرائه بعنايتهِ وتوفيقه ، كما قال تعالى { فإنك بأعيننا } \\[ الطور : 48 \\] ، وقال : إذ يقول لصاحبه لا تحزن إن الله معنا \\[ التوبة : 40 \\].فالمعنى : الذي جعل عبده مُسرياً ، أي سارياً ، وهو كقوله تعالى : { فأسر بأهلك بقطع من الليل } \\[ هود : 81 \\].وإذ قد كان السُرى خاصاً بسير الليل كان قوله : { ليلاً } إشارة إلى أن السير به إلى المسجد الأقصى كان في جُزء ليلة ، وإلا لم يَكن ذكره إلا تأكيداً ، على أن الإفادة كما يقولون خير من الإعادة .وفي ذلك إيماء إلى أنه أسراء خارق للعادة لقطع المسافة التي بين مبدأ السير ونهايته في بعض ليلة ، وأيضاً ليتوسل بذكر الليل إلى تنكيره المفيد للتعظيم .فتنكير { ليلاً } للتعظيم ، بقرينة الاعتناء بذكره مع علمه من فعل { أسرى } ، وبقرينة عدم تعريفه ، أي هو ليل عظيم باعتبار جعله زمناً لذلك السرى العظيم ، فقام التنكير هنا مقام ما يدل على التعظيم . ألا ترى كيف احْتيج إلى الدلالة على التعظيم بصيغة خاصة في قوله تعالى : { إنا أنزلناه في ليلة القدر وما أدراك ما ليلة القدر } \\[ القدر : 1 2 \\] إذ وقعت ليلة القدر غير منكرة .و ( عَبْد ) المضاف إلى ضمير الجلالة هنا هو محمد كما هو مصطلح القرآن ، فإنه لم يقع فيه لفظ العبد مضافاً إلى ضمير الغيبة الراجع إلى الله تعالى إلا مراداً به النبي؛ ولأن خبر الإسراء به إلى بيت المقدس قد شاع بين المسلمين وشاع إنكاره بين المشركين ، فصار المراد { بعبده } معلوماً .والإضافة إضافة تشريف لا إضافة تعريف لأن وصف العبودية لله متحقق لسائر المخلوقات فلا تفيد إضافته تعريفاً .والمسجد الحرام هو الكعبة والفِناء المحيط بالكعبة بمكة المتخذ للعبادة المتعلقة بالكعبة من طواف بها واعتكاف عندها وصلاة .وأصل المسجد : أنه اسم مكان السجود . وأصل الحرام : الأمر الممنوع ، لأنه مشتق من الحَرْم بفتح فسكون وهو المنع ، وهو يرادف الحرم . فوصف الشيء بالحرام يكون بمعنى أنه ممنوع استعماله استعمالاً يناسبه ، نحو { حرمت عليكم الميتة } \\[ المائدة : 3 \\] أي أكل الميتة ، وقول عنترة:حُرمت علي وليتها لم تَحرم...أي ممنوع قربانها لأنها زوجة أبيه وذلك مذموم بينهم .ويكون بمعنى الممنوع من أن يعمل فيه عمل ما . ويبين بذكر المتعلق الذي يتعلق به . وقد لا يذكر متعلّقة إذا دل عليه العرف ، ومنه قولهم : { الشهر الحرام } \\[ البقرة : 194 \\] أي الحرام فيه القتال في عرفهم . وقد يحذف المتعلق لقصد التكثير ، فهو من الحذف للتعميم فيَرجع إلى العموم العرفي ، ففي نحو { البيت الحرام } \\[ المائدة : 2 \\] يراد الممنوع من عُدوان المعتدين ، وغزوِ الملوك والفاتحين ، وعمللِ الظلم والسوءِ فيه .والحرام : فَعال بمعنى مفعول ، كقولهم : امرأة حَصان ، أي ممنوعة بعفافها عن الناس .فالمسجد الحرام هو المكان المعد للسجود ، أي للصلاة ، وهو الكعبة والفناء المجعول حرماً لها . وهو يختلف سعة وضيقاً باختلاف العصور من كثرة الناس فيه للطواف والاعتكاف والصلاة .وقد بنى قريش في زمن الجاهلية بيوتهم حول المسجد الحرام . وجعل قُصي بقربه دارَ الندوة لقريش وكانوا يجلسون فيها حول الكعبة ، فانحصر لما أحاطت به بيوت عشائر قريش . وكانت كل عشيرة تتخذ بيوتها متجاورة . ومجموع البيوت يسمى شِعباً بكسر الشين . وكانت كل عشيرة تسلك إلى المسجد الحرام من منفذ دُورها ، ولم يكن للمسجد الحرام جدار يُحفظ به . وكانت المسالك التي بين دُور العشائر تسمى أبواباً لأنها يسلك منها إلى المسجد الحرام ، مثل باب بني شيبة ، وباب بني هاشم ، وباب بني مخزوم وهو باب الصفا ، وباب بني سهم ، وباب بني تيم . وربما عُرِف بعض الأبواب بجهة تقرب منه مثل بَاب الصفا ويسمى باب بني مخزوم . وباب الحزورة سمي بمكان كانت به سوق لأهل مكة تسمى الحَزْورة . ولا أدري هل كانت أبواباً تغلق أم كانت منافذ في الفضاء فإن الباب يطلق على ما بين حاجزين .وأول من جعل للمسجد الحرام جداراً يُحفظ به هو عمر بن الخطاب رضي الله عنه سنة سبعَ عشرة من الهجرة .ولُقب بالمسجد لأن إبراهيم عليه الصلاة والسلام جعله لإقامة الصلاة في الكعبة كما حكى الله عنه { ربنا ليقيموا الصلاة } \\[ إبراهيم : 37 \\]. ولما انقرضت الحنيفية وترك أهل الجاهلية الصلاة تناسوا وصفهُ بالمسجد الحرام فصاروا يقولون : البيت الحرام . وأما قول عمر : إني نذرت في الجاهلية أن أعتكف ليلة في المسجد الحرام ، فإنه عبر عنه باسمه في الإسلام .فغلبَ عليه هذا التعريف التوصيفي فصار له علماً بالغلبة في اصطلاح القرآن . ولا أعرف أنه كان يعرف في الجاهلية بهذا الاسم ، ولا على مسجد بيت المقدس في عصر تحريمه عند بَني إسرائيل . وقد تقدم وجه ذلك عند قوله تعالى : { فول وجهك شطر المسجد الحرام } في \\[ البقرة : 144 \\] ، وعند قوله تعالى : { أن صدوكم عن المسجد الحرام } في أول العقود \\[ المائدة : 2 \\].وعلميته بمجموع الوصف والموصوف وكلاهما معَرّف باللام . فالجزء الأول مثل النجم والجزء الثاني مثل الصعِق ، فحصل التعريف بمجموعهما ، ولم يعد النحاةُ هذا النوع في أقسام العلم بالغلبة . ولعلهم اعتبروه راجعاً إلى المعرف باللام . ولا بد من عده لأن علميته صارت بالأمرين .والمسجد الأقصى هو المسجد المعروف ببيتتِ المقدِس الكائن بإيلياء ، وهو المسجد الذي بناه سليمان عليه الصلاة والسلام .والأقصى ، أي الأبعد . والمراد بعده عن مكة ، بقرينة جعله نهاية الإسراء من المسجد الحرام ، وهو وصف كاشف اقتضاه هنا زيادة التنبيه على معجزة هذا الإسراء وكونه خارقاً للعادة لكونه قطْعَ مسافة طويلة في بعض ليلة .وبهذا الوصف الوارد له في القرآن صار مجموع الوصف والموصوف علماً بالغلبة على مسجد بيت المقدس كما كان المسجد الحرام علماً بالغلبة على مسجد مكة . وأحسب أن هذا العلم له من مبتكرات القرآن فلم يكن العرب يصفونه بهذا الوصف ولكنهم لما سمعوا هذه الآية فهموا المراد منه أنه مسجد إيلياء . ولم يكن مسجد لدين إلهي غيرهما يومئذٍ .وفي هذا الوصف بصيغة التفضيل باعتبار أصل وضعها معجزةٌ خفية من معجزات القرآن إيماء إلى أنه سيكون بين المسجدين مسجد عظيم هو مسجد طيبة الذي هو قَصِيٌ عن المسجد الحرام ، فيكون مسجد بيت المقدس أقصى منه حينئذٍ .فتكون الآية مشيرة إلى جميع المساجد الثلاثة المفضلة في الإسلام على جميع المساجد الإسلامية ، والتي بينها قول النبي : » \" لا تُشدّ الرحال إلا إلى ثلاثة مساجد : مسجد الحرام ، ومسجد الأقصى ، ومسجدي \"وفائدة ذكر مبدأ الإسراء ونهايته بقوله : { من المسجد الحرام إلى المسجد الأقصا } أمران :أحدهما : التنصيص على قطع المسافة العظمية في جزء ليلة ، لأن كلا من الظرف وهو { ليلاً } ومن المجرورين { من المسجد الحرام إلى المسجد الأقصا } قد تعلق بفعل { أسرى } ، فهو تعلق يقتضي المقارنة ، ليعلم أنه من قبيل المعجزات .وثانيهما : الإيماء إلى أن الله تعالى يجعل هذا الإسراء رمزاً إلى أن الإسلام جمع ما جاءت به شرائع التوحيد والحنيفية من عهد إبراهيم عليه الصلاة والسلام الصادر من المسجد الحرام إلى ما تفرع عنه من الشرائع التي كان مقرها بيت المقدس ثم إلى خاتمتها التي ظهرت من مكة أيضاً؛ فقد صدرت الحنيفية من المسجد الحرام وتفرعت في المسجد الأقصى . ثم عادت إلى المسجد الحرام كما عاد الإسراء إلى مكة لأن كل سُرى يعقبه تأويب . وبذلك حصل رد العجز على الصدر .ومن هنا يظهر مناسبة نزول التشريع الاجماعي في هذه السورة في الآيات المفتتحة بقوله تعالى : { وقضى ربك ألا تعبدوا إلا إياه ، ففيها : ولا تقتلوا النفس التي حرم الله إلا بالحق ، ولا تقربوا مال اليتيم إلا بالتي هي أحسن ، { وأوفوا الكيل إذا كلتم وزنوا بالقسطاس المستقيم } \\[ الإسراء : 23 35 \\] إيماء إلى أن هذا الدين سيكون ديناً يحكم في الناس وتنفذ أحكامه .والمسجد الأقصى هو ثاني مسجد بناه إبراهيم عليه السلام كما ورد ذلك عن النبي . ففي الصحيحين } عن أبي ذر قال : قلتُ يا رسول الله أي مسجد وُضع في الأرض أولُ؟ قال المسجدُ الحرام . قلت : ثم أي؟ قال : المسجد الأقصى . قلت كمْ بينهما؟ قال أربعون سنة» .فهذا الخبر قد بين أن المسجد الأقصى من بناء إبراهيم لأنه حُدد بمدة هي من مدة حياة إبراهيم عليه السلام . وقد قُرن ذكره بذكر المسجد الحرام .وهذا مما أهملَ أهل الكتاب ذكره .وهو مما خَصّ الله نبيئه بمعرفته . والتوراة تشهد له ، فقد جاء في سفر التكوين في الإصحاح الثاني عشر : أن إبراهيم لما دخل أرض كنعان ( وهي بلاد فلسطين ) نصب خيمته في الجبل شرقي بيت إيل ( بيت إيل مدينة على بعد أحد عشر ميلاً من أورشليم إلى الشمال وهو بلد كان اسمه عند الفلسطينيين ( لوزا ) فسماه يعقوب : بيت إيل ، كما في الإصحاح الثامن والعشرين من سفر ( التكوين ) وغربي بلاد عاي ( مدينة عبرانية تعرف الآن «الطيبة» ) وبنى هنالك مذبحاً للرب .وهم يطلقون المذبح على المسجد لأنهم يذبحون القرابين في مساجدهم . قال عمر بن أبي ربيعة:دُميةٌ عند راهب قسيس...صوروها في مذبح المحراب ... أي مَكانَ المذبح من المسجد ، لأن المحراب هو محل التعبد ، قال تعالى : { وهو قائم يصلي في المحراب } \\[ آل عمران : 39 \\].ولا شك أن مسجد إبراهيم هو الموضع الذي توخى داود عليه السلام أن يضع عليه الخيمة وأن يبني عليه محرابه أو أوحى الله إليه بذلك ، وهو الذي أوصى ابنَه سليمان عليه السلام أن يبني عليه المسجدَ ، أي الهيكل . وقد ذكر مؤرخو العبرانيين ومنهم ( يوسيفوس ) أن الجبل الذي سكنه إبراهيم بأرض كنعان اسمه ( نَابو ) وأنه هو الجبل الذي ابتنى عليه سليمان الهيكل وهو المسجد الذي به الصخرة .وقصة بناء سليمان إياه مفصلة في سفر الملوك الأول من أسفار التوراة .وقد انتابه التخريب ثلاث مرات :أولاها : حين خربه بختَنَصّر ملكُ بابل سنة 578 قبل المسيح ثم جدده اليهود تحت حكم الفُرس .الثانية : خربه الرومان في مدة طيطوس بعد حروب طويلة بينه وبين اليهود وأعيد بناؤه ، فأكمل تخريبَه أدريانوس سنة 135 للمسيح وعفى آثاره فلم تبق منه إلا أطلال .الثالثة لما تنصرت الملكة هيلانة أم الأنبراطور قسطنطين ملككِ الروم ( بيزنطة ) وصارت متصلبة في النصرانية ، وأشرب قلبُها بُغْض اليهود بما تعتقده من قتلهم المسيح كان مما اعتدت عليه حين زارت أورشليم أن أمرت بتعفية أطلال هيكل سليمان وأن ينقل ما بقي من الأساطين ونحوها فتبني بها كنيسة على قبر المسيح المزعوم عندهم في موضع توسموا أن يكون هو موضع القبر ( والمؤرخون من النصارى يشكون في كون ذلك المكان هو المكان الذي يُدَّعَى أن المسيح دفن فيه ) وأن تسميها كنيسة القيامة ، وأمَرَت بأن يجعل موضعُ المسجد الأقصى مرمَى أزبال البلد وقُماماته فصار موضعُ الصخرة مَزْبلة تراكمت عليها الأزبال فغطتها وانحدرت على درجها .ولما فتح المسلمون بقية أرض الشام في زمن عمر وجاء عمر بن الخطاب ليشهد فتح مدينة إيلياء وهي المعروفة من قبلُ ( أورشليم ) وصارت تسمى إيلياء بكسر الهمزة وكسر اللام وكذلك كان اسمها المعروف عند العرب عندما فتح المسلمون فلسطين . وإيلياء اسم نبيء من بني إسرائيل كان في أوائل القرن التاسع قبل المسيح .قال الفرزدق:وبيتان بيتُ الله نحن ولاته...وبيتٌ بأعلى إيلياء مشرَّف ... وانعقد الصلح بين عُمر وأهل تلك المدينة وهم نصارى . قال عمر لبطريق لهم اسمه ( صفرونيوس ) «دُلني على مسجد داوود» ، فانطلق به حتى انتهى إلى مكان الباب وقد انحدر الزبل على دَرَج الباب فتجشم عمر حتى دخَل ونظر فقال : الله أكبر ، هذا والذي نفسي بيده مسجدُ داوود الذي أخبرنَا رسول الله صلى الله عليه وسلم أنه أُسري به إليه» . ثم أخذ عمر والمسلمون يكنسون الزبل عن الصخرة حتى ظهرت كلها ، ومضى عمر إلى جهة محراب داوود فصلى فيه ، ثم ارتحل من بلد القدس إلى فلسطين .ولم يَبن هنالك مسجداً إلى أن كان في زمن عبد الملك بن مروان أمر بابتداء بناء القبة على الصخرة وعمارة المسجد الأقصى . ووكل على بنائها رَجاء بن حَيْوَة الكِندي أحد علماء الإسلام ، فابتدأ ذلك سنة ست وستين وكان الفراغ من ذلك في سنة ثلاث وسبعين .كان عمر أول من صلى فيه من المسلمين وجعل له حرمة المساجد .ولهذا فتسمية ذلك المكان بالمسجد الأقصى في القرآن تسمية قرآنية اعتبر فيها ما كان عليه من قبل لأن ، حكم المسجدية لا ينقطع عن أرض المسجد . فالتسمية باعتبار ما كان ، وهي إشارة خفية إلى أنه سيكون مسجداً بأكمل حقيقة المساجد .واستقبله المسلمون في الصلاة من وقت وجوبها المقارن ليلة الإسراء إلى ما بعد الهجرة بستة عشر شهراً . ثم نسخ استقباله وصارت الكعبة هي القبلة الإسلامية .وقد رأيت أن سائحاً نصرانياً اسمه ( اركولف ) زار القدس سنة 670 م ، أي بعد خلافة عمر بأربع وثلاثين سنة ، وزعم أنه رأى مسجداً بناه عمر على شكل مربع من ألواح وجذوع أشجار ضخمة وأنه يسع نحو ثلاثة آلاف .والظاهر أن نسبة المسجد الأقصى إلى عمر بن الخطاب وهَم من أوهام النصارى اختلط عليهم كشف عمر موضع المسجد فظنوه بناءً . وإذا صدق اركولف فيما ذكر من أنه رأى مكاناً مربعاً من ألواح وعمد أشجار كان ذلك شيئاً أحدثه مسلمو البلاد لصيانة ذلك المكان عن الامتهان .وقوله { الذي باركنا حوله } صفة للمسجد الأقصى . وجيء في الصفة بالموصولية لقصد تشهير الموصوف بمضمون الصلة حتى كأن الموصوف مشتهر بالصلة عند السامعين . والمقصود إفادة أنه مبارك حوله .وصيغة المفاعلة هنا للمبالغة في تكثير الفعل ، مثل عافاك الله .والبركة : نماء الخير والفضل في الدنيا والآخرة بوفرة الثواب للمصلين فيه وبإجابة دعاء الداعين فيه . وقد تقدم ذكر البركة عند قوله تعالى : { مباركاً وهدى للعالمين } في \\[ آل عمران : 96 \\].وقد وصف المسجد الحرام بمثل هذا في قوله تعالى : { إن أول بيت وضع للناس للذي ببكة مباركاً وهدىً للعالمين } \\[ آل عمران : 96 \\].ووجه الاقتصار على وصف المسجد الأقصى في هذه الآية بذكر هذا التبريك أن شهرة المسجد الحرام بالبركة وبكونه مقام إبراهيم معلومة للعرب؛ وأما المسجد الأقصى فقد تناسى الناس ذلك كله ، فالعرب لا علم لهم به والنصارى عفوا أثره من كراهيتهم لليهود ، واليهود قد ابتعدوا عنه وأيسوا من عوده إليهم ، فاحتيج إلى الإعلام ببركته .و حولَ يدل على مكان قريب من مكان اسم ما أضيف ( حولَ ) إليه .وكونُ البركة حولَه كنايةٌ عن حصول البركة فيه بالأوْلى ، لأنها إذا حصلت حوله فقد تجاوزت ما فيه؛ ففيه لطيفة التلازم ، ولطيفة فحوَى الخطاب ، ولطيفة المبالغة بالتكثير . وقريب منه قول زياد الأعجم:إنّ السماحةَ والمروءة والندى...في قبةٍ ضُربت على ابن الحشرج ... ولكلمة { حوله } في هذه الآية من حسن الموقع ما ليس لكلمة ( في ) في بيت زياد ، ذلك أن ظرفية ( في ) أعم . فقوله : ( في قبة ) كناية عن كونها في ساكن القبة لكن لا تفيد انتشارها وتجاوزها منه إلى ما حوله .وأسباب بركة المسجد الأقصى كثيرة كما أشارت إليه كلمة { حوله }. منها أن واضعه إبراهيم عليه السلام ، ومنها ما لحقه من البركة بمن صلى به من الأنبياء من داوود وسليمان ومن بعدهما من أنبياء بني إسرائيل ، ثم بحلول الرسول عيسى عليه السلام وإعلانه الدعوة إلى الله فيه وفيما حوله ، ومنها بركة من دُفن حوله من الأنبياء ، فقد ثبت أن قبري داوود وسليمان حول المسجد الأقصى . وأعظم تلك البركات حلول النبي صلى الله عليه وسلم فيه ذلك الحلول الخارق للعادة ، وصلاته فيه بالأنبياء كلهم .وقوله : { لنريه من آياتنا } تعليل الإسراء بإرادة إراءة الآيات الربانية ، تعليلٌ ببعض الحِكَم التي لأجلها منح الله نبيئه منحة الإسراء ، فإن للإسراء حِكماً جمة تتضح من حديث الإسراء المروي في «الصحيح» . وأهمها وأجمعها إراءته من آيات الله تعالى ودلائل قدرته ورحمته ، أي لنريه من الآيات فيخبرهم بما سألوه عن وصف المسجد الأقصى .ولام التعليل لا تفيد حصر الغرض من متعلقها في مدخولها .وإنما اقتُصر في التعليل على إراءة الآيات لأن تلك العلة أعلق بتكريم المُسرَى به والعناية بشأنه ، لأن إراءة الآيات تزيد يقين الرائي بوجودها الحاصل من قبل الرؤية . قال تعالى : { وكذلك نري إبراهيم ملكوت السماوات والأرض وليكون من الموقنين } \\[ الأنعام : 75 \\].فإن فطرة الله جعلت إدراك المحسوسات أثبت من إدراك المدلولات البرهانية . قال تعالى : { وإذ قال إبراهيم رب أرني كيف تحيي الموتى قال أو لم تؤمن قال بلى ولكن ليطمئن قلبي } \\[ البقرة : 260 \\] ، ولذلك لم يقل الله بعد هذا التعليل أو لم يطمئن قلبك ، لأن اطمئنان القلب مُتَّسِعُ المدى لا حد له فقد أنطق الله إبراهيم عن حكمة نبوءة ، وقد بادر محمداً بإراءة الآيات قبل أن يسأله إياها توفيراً في الفضل .قال علي بن حزم الظاهري وأجاد: ... ولكن للعيان لطيفُ معنىله سأل المعايَنة الكليمُ ...واعلم أن تقوية يقين الأنبياء من الحكم الإلهية لأنهم بمقدار قوة اليقين يزيدون ارتقاء على درجة مستوى البشر والتحاقاً بعلوم عالم الحقائق ومساواة في هذا المضمار لمراتب الملائكة .وفي تغيير الأسلوب من الغيبة التي في اسم الموصول وضميريه إلى التكلم في قوله : باركنا . . . ولنُريه من آياتنا سلوكٌ لطريقة الالتفات المتبعة كثيراً في كلام البلغاء . وقد مضى الكلام على ذلك في قوله تعالى : { إياك نعبد } في \\[ الفاتحة : 5 \\].والالتفات هنا امتاز بلطائف :منها : أنه لما استُحضرت الذات العلية بجملة التسبيح وجملة الموصولية صار مقام الغيبة مقام مشاهدة فناسب أن يغير الإضمار إلى ضمائر المشاهدة وهو مقام التكلم .ومنها : الإيماء إلى أن النبي عليه الصلاة والسلام عند حلوله بالمسجد الأقصى قد انتقل من مقام الاستدلال على عالم الغيب إلى مقام مصيره في عالم المشاهدة .ومنها : التوطئة والتمهيد إلى محمل معاد الضمير في قوله : إنه هو السميع البصير } ، فيتبادر عود ذلك الضمير إلى غير من عاد إليه ضمير { نريه } لأن الشأن تناسق الضمائر ، ولأن العود إلى الالتفات بالقرب ليس من الأحسن .فقوله : { إنه هو السميع البصير } الأظهرُ أن الضميرين عائدان إلى النبي صلى الله عليه وسلم وقاله بعض المفسرين ، واستقرَبَه الطيبي ، ولكن جمهرة المفسرين على أنه عائد إلى الله تعالى . ولعل احتماله للمعنيين مقصود .وقد تجيء الآيات محتملة عدّةَ معاننٍ . واحتمالها مقصود تكثيراً لمعاني القرآن ، ليأخذ كل منه على مقدار فهمه كما ذكرنا في المقدمة التاسعة . وأياما كان فموقع ( إنّ ) التوكيد والتعليل كما يؤذن به فصل الجملة عما قبلها .وهي إما تعليل لإسناد فعل { نريه إلى فاعله؛ وإما تعليل لتعليقه بمفعوله ، فيفيد أن تلك الإراءة من باب الحكمة ، وهي إعطاء ما ينبغي لمن ينبغي ، فهو من إيتاء الحكمة من هو أهلها .والتعليل على اعتبار مرجع الضمير إلى النبي أوقع ، إذ لا حاجة إلى تعليل إسناد فعل الله تعالى لأنه محقق معلوم . وإنما المحتاج للتعليل هو إعطاء تلك الإراءة العجيبة لمن شك المشركون في حصولها له ومن يحسبون أنه لا يطيقها مثله .على أن الجملة مشتملة على صيغة قصر بتعريف المسند باللام وبضمير الفصل قصراً مؤكداً ، وهو قصر موصوف على صفة قصراً إضافياً للقلب ، أي هو المدرك لما سمعه وأبصرهُ لا الكاذِبُ ولا المتوهمُ كما زعم المشركون . وهذا القصر يؤيد عود الضمير إلى النبي لأنه المناسب للرد . ولا ينازع المشركون في أن الله سميع وبصير إلا على تأويل ذلك بأنه المُسمع والمبصِر لرسوله الذي كذبتموه ، فيؤول إلى تنزيه الرسول عن الكذب والتوهم .ثم إن الصفتين على تقدير كونهما للنبيء هما على أصل اشتقاقهما للمبالغة في قوة سمعه وبصره وقبولهما لتلقي تلك المشاهدات المدهشة ، على حد قوله تعالى : { ما زاغ البصر وما طغى }\\[ النجم : 17 \\] ، وقوله : { أفتمارونه على ما يرى } \\[ النجم : 12 \\].وأما على تقدير كونهما صفتين لله تعالى فالمناسب أن تؤولا بمعنى المسمع المبصر ، أي القادر على إسماع عبده وإبصاره ، كما في قول عمرو بن معد يكرب: ... أمن ريحانة الداعي السميعأي المُسمع .وقد اختلف السلف في الإسراء أكان بجسد رسول الله من مكة إلى بيت المقدس أم كان بروحه في رؤيا هي مشاهدة رُوحانية كاملة ورؤيا الأنبياء حق . والجمهور قالوا : هو إسراء بالجسد في اليقظة ، وقالت عائشة ومعاوية والحسن البصري وابن إسحاق رضي الله عنهم أنه إسراء بروحه في المنام ورؤيا الأنبياء وحي .واستدل الجمهور بأن الامتنان في الآية وتكذيبَ قريش بذلك دليلان على أنه ما كان الإخبار به إلا على أنه بالجسد . واتفق الجميع على أن قريشاً استوصفوا من النبي علامات في بيت المقدس وفي طريقه فوصفها لهم كما هي ، ووصف لهم عيراً لقريش قافلة في طريق معين ويوم معين فوجدوه كما وصف لهم .ففي صحيح البخاري } أن النبي صلى الله عليه وسلم قال : \" بينما أنا في المسجد الحرام بين النائم واليقظان إذ أتاني جبريل . . . \" إلى آخر الحديث . وهذا أصح وأوضح مما روي في حديث آخر أن الإسراء كان من بيته أو كان من بيت أم هاني بنت أبي طالب أو من شعب أبي طالب .والتحقيق حمل ذلك على أنه إسراء آخر ، وهو الوارد في حديث المعراج إلى السماوات وهو غير المراد في هذه الآية . فللنبيء صلى الله عليه وسلم كرامتان : أولاهما الإسراء وهو المذكور هنا ، والأخرى المعراج وهو المذكور في حديث «الصحيحين» مطولاً وأحاديث غيرِه . وقد قيل : إنه هو المشار إليه في سورة النجم .\n\n",
      "translations": [
        {
          "translation": "And from his own narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Glorified be): '(Glorified be) He says: He is far exalted above and exonerated from having a son or partner (He Who carried His servant) He Who took His servant Muhammad, peace be on him, (by night) at the beginning of the night (from the Inviolable Place of Worship) from the Sacred Precinct, from the house of Umm Hani' the daughter of Abu Talib (to the Far Distant Place of Worship) far in distance, but close to heaven, i.e. the Mosque of Jerusalem (the neighbourhood whereof We have blessed) with water, trees and fruits, (that We might show him) that We might show Muhammad (pbuh) (of Our tokens!) of Our marvels, for all the things He saw that night were marvels of Allah. (Lo! He, only He, is the Nearer) of what the Quraysh say, (the Seer) He sees them just as He sees His servant Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قالَ: حدّثنا علي بن أحمد\n قال حدّثنا عطاءُ بن السائب عن أبي خالد عن الإِمامِ زيد بن علي عليهما السَّلامُ في قولهِ تعالى: { سُبْحَانَ ٱلَّذِى أَسْرَىٰ بِعَبْدِهِ } فَسُبحان: تَنزِيهٌ لَهُ تَعالى عَن كُلِّ سُوءٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: Ali ibn Ahmad narrated to us.\n\n\n{Imam Zaid ibn Ali} narrated that {Allah said}, \"Exalted is He who took His servant {on a journey} by night.\" So Allah is free of all imperfection.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ سبحان الذي أسرى } أي: أنزهه عن اللواحق المادية والنقائص التشبيهية بلسان حال التجرّد والكمال في مقام العبودية الذي لا تصرف فيه أصلاً { ليلاً } أي: في ظلمة الغواشي البدنية والتعلقات الطبيعية لأنّ العروج والترقي لا يكون إلا بواسطة البدن { من المسجد الحرام } أي: من مقام القلب المحرّم عن أن يطوف به مشرك القوى البدنية ويرتكب فيه فواحشها وخطاياها ويحجّه غوى القوى الحيوانية من البهيمية والسبعية المنكشفة سوأتا إفراطها وتفريطها لعروها عن لباس الفضيلة { إلى المسجد الأقصى } الذي هو مقام الروح الأبعد من العالم الجسماني بشهود تجليات الذات وسبحات الوجه، وتذكر ما ذكرنا أن تصحيح كل مقام لا يكون إلا بعد الترقي إلى ما فوقه لتفهم من قوله. { لنريه من آياتنا } مشاهدة الصفات، فإن مطالعة تجليات الصفات وإن كانت في مقام القلب لكن الذات الموصوفة بتلك الصفات لا تشاهد على الكمال بصفة الجلال والجمال إلا عند الترقي إلى مقام الروح، أي: لنريه آيات صفاتنا من جهة أنها منسوبة إلينا ونحن المشاهدون بها، البارزون بصورها { إنه هو السميع } لمناجاته في مقام السر لطلب الفناء { البصير } بقوة استعداده وتوجهه إلى محل الشهود وانجذابه إليه بقوة المحبة وكمال الشوق.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ سُبْحَانَ ٱلَّذِى أَسْرَىٰ) نزه سبحاه ذاته بما يجب تنزهه عنه في حضرة علمه\n وأيهم اسمه على مقتضى تعاليه وترفعه عن أفهام عبداه عن إخراج العبد من ظلمة الإمكان الذي هو الليل الحقيقي إكلى نور الوجوب الذي هو النهار الحقيقي { بِعَبْدِهِ } يعني: حبيبه محمد صلى الله عليه وسلم بعدما أخلع عنه كسوة ناسوته\n وألبسه خلعة لاهوته\n بحيث تجرد عن مقتضيات بشريته مطلقاً\n وارتفعت عنه حجب تعيناته جملةً\n وانكشفت سدل الغفلة والغشاوات عن بصيرته وبصره\n\n\nوحينئذٍ انطوت المسافات مطلقاً { لَيْلاً } أي: في قطعةٍ منه\n صرح به\n وإن كان الإسراء في اللغة عبارة عن السير في الليل\n ليُعلم أن ابتداؤه وانتهاؤه كان فيه { مِّنَ ٱلْمَسْجِدِ ٱلْحَرَامِ } الذي حُرمت ما أبيحت في الأماكن الأخر من الصيد وغنيره\n ألا وهو قلب الإنسان الكامل الذي هو بيت الله الأعظم حقيقةً\n إذ حرمت فيه التوجه إلى الغير والسّوى مطلقاً\n وإن كان مبنياً في بقعة جسدانية إمكانية { إِلَىٰ ٱلْمَسْجِدِ ٱلأَقْصَا ٱلَّذِي بَارَكْنَا حَوْلَهُ } أي: كثَّرنا فيه الخير والبركة على زوارها وساكنيها\n ألا وهو البيت المعمور الأبدي الأزلي الذي هو الوجود المطلق\n المفيض على كافة المظاهر وحواليه عبارةً عن مقتضيات الأوصاف والأسماء الإلهية\n وزوارها استعدادات المظاهر وقابلياتها المستفيدة منها\n الناشئةُ عن أضلال أوصافها\n\n\nوإنما أسريناه { لِنُرِيَهُ مِنْ آيَاتِنَآ } الدالة على كمال قدرتنا وحكمتنا\n ووفور جودنا وكرامتنا { إِنَّهُ } بعد تجرده عن جلباب تعيينه وهويته { هُوَ ٱلسَّمِيعُ } بسمعنا\n فيسمع بنا منا { ٱلبَصِيرُ } [الإسراء: 1] ببصرنا\n فيبصر ببصرنا عجائب صنعنا\n وغرائر مبدعاتنا\n\n\n{ وَ } كما أيّدنا حبيبنا بما أيدناه من الإسراء به\n وإراءة عجائب صنعنا وقدرتنا إياه\n بأن أسريناه من مكة في ساعةٍ إلى بيت المقدس\n ثمَّ فيها إلى فوق السماوات السبع\n ومثَّلنا له أرواح الأنبياء والأولياء\n فتكلم معهم\n ثمَّ منها إلى ما شاء الله\n وأخبر عنه سبحانه بقوله:\n[النجم: 8-9]\n وسمع كلاماً لا من جنس الأصوات والحروف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { سبحان }: مصدر غير متصرف، منصوب بفعل واجب الحذف، أي أسبحُ سبحان. وهو بمعنى التسبيح، أي: التنزيه، وقد يستعمل عَلَمًا له، فيقطع عن الإضافة ويمنع الصرف، كقول الشاعر:\nو { ليلاً }: منصوب على الظرفية لأسرى. وفائدة ذكره، مع أن السرى هو السير بالليل، ليفيد التقليل، ولذلك نكّره، كأنه قال: أسرى بعبده مسيرة أربعين ليلة في بعض الليل، وذلك ابلغ في المعجزة. ويقال: أسرى وسرى، رباعيًا وثلاثيًا. يقول الحقّ جلّ جلاله: { سبحان الذي أسرى بعبده } وهو: نبينا محمد صلى الله عليه وسلم، أي: تنزيهًا له عن الأماكن والحدود والجهات، إذ هو أقرب من كل شيء إلى كل شيء. وإنما وقع الإسراء برسوله - عليه الصلاة والسلام - ليقتبس أهلُ العالم العلوي، كما اقتبس منه أهل العالم السفلي، فأسرى به { ليلاً من المسجد الحرام } بعينه لِمَا رُوي أنه - عليه الصلاة والسلام - قال:\n \" بَينَما أَنَا في المسْجِدِ الحَرَامِ في الحِجْر، عِنْدَ البَيْتِ، بَيْنَ النَّائِم واليقْظَانِ، إذْ أَتَانِي جِبْرِيلُ بالبُراقِ \". \nأو: من الحرم لِمَا رُوي أنه كان نائمًا في بيت أم هانئ بعد صلاة العشاء، فأُسْرِيَ به، وسماه مسجدًا لأن الحرم كله مسجد. قاله البيضاوي. قلت: والظاهر أنه وقع مرتين: مرة بجسده من البيت، ومرة بروحه من بيت أم هانئ. والله تعالى أعلم بما كان. قال في المستخْرج من تفسير الغزنوني وغيره: قيل: كان رؤيا صادقة، وقيل: أسرى بروحه، وهو خلاف القرآن، وإن أسند إلى عائشة - رضي الله عنها -، والجمهور على ما رواه عامة الصحابة، دخل كلام بعضهم في بعض، عن رسول الله صلى الله عليه وسلم أنه قال:\n \" أتاني جبريل عليه السلام، وإذا دابة فوق الحمار ودون البغل، خطوها مد بصرها، فمرّ بي بين السماء والأرض إلى بيت المقدس، فَنُشِرَ لي رَهْطٌ من الأنبياء، فصليت بهم. وإذا أنا بالمعراج، وهو أحسن ما رأيت، فعرج بي، فرأيت في سماء الدنيا رجلاً أعظم الناس وجهًا وهيكلاً، فقيل: هذا أبوك آدم، وفي السماء الثانية شابيْن، فقيل: هما يحيى وعيسى، وفي الثالثة رجلاً أفضل الناس حُسنًا، فقيل: أخوك يوسف، وفي الرابعة إدريس، وفي الخامسة هارون، وفي السادسة موسى، وفي السابعة إبراهيم - صلوات الله على جميعهم -. فانتهيتُ إلى سِدرة المنتهى، فَغَشِيَتْهَا ملائكةٌ، كأنهم جراد من ذهب، فرأيتُ جبريل عليه السلام يتضاءل كأنه صَعْوة - أي: عصفور - فتخلف، وقال: وما منا إلا له مقام معلوم، فجاوزت سبعين حجابًا، ثم احتملني الرفرف إلى العرش، فنُوديتُ: حَيِّ ربك. فقلت: لا اُحصي ثناء عليك، أنت كما أثنيت على نفسك \". \n \nفلما أخبر بما رأى كذَّبه أهل مكة، ولو كان في النوم ما أنكره المشركون. وقيل: كانا معراجين، بمكة والمدينة، في النوم واليقظة. هـ. قلت: وقوع المعراج بالمدينة غريب. قال المهدوي: مرْتَبة الإسراء بالجسم إلى تلك الحضرات العَلِية خاصة بنبينا، لم يكن لغيره من الأنبياء. وعدَّه السيوطي من الخصائص. قال ابن جزي: وحجة الجمهور: أنه لو كان منامًا، لم تُنكره قريش، ولم يكن في ذلك ما يُكَذَّبُ، ألا ترى أن أُم هانئ قالت له - عليه الصلاة والسلام-: لا تُخبر بذلك أحدًا. وحجة من قال إنه كان منامًا: قوله تعالى:\n[الإسراء: 60]، وإنما يقال: الرؤيا، في المنام، ويقال، فيما يرى بالعين: رؤية، وقوله، في آخر حديث الإسراء: \" فاستيقظتُ وأنا في المسجد الحرام \" ، ثم قال: وقد يجمع بينهما بأنه وقع مرتين. هـ. وقوله تعالى: { إلى المسجد الأقصى } هو: بيت المقدس لأنه لم يكن حينئذ وراءه مسجد، { الذي باركنا حوله } ببركات الدين والدنيا لأنه مهبط الوحي ومتعبد الأنبياء، ومحفوف بالأنهار والأشجار والثمار. أسرينا به { لِنُريه من آياتنا } الدالة على عجائب قدرتنا، ونكشفَ له عن أسرار ذاتنا، فأَطْلعه الله على عجائب الملكوت، وأراه سَنَا الجبروت. رَوَى عكرمةُ عن ابن عباس: أنه قال: قد رأى محمدٌ ربه، قلت: أليس الله يقول:\n[الأنعَام: 103]، قال: ويحك، ذلك إذا تجلى بنوره الذي هو نوره، وقد رأى ربه مرتين. هـ. قلت: معنى كلامه: أنه إذا تجلى بنوره الأصلي، من غير واسطة، لا يمكن إدراكه، وأما إذا تجلى بواسطة المظهر فإنه يُمكن إدراكه، والحاصل: أن الحق تعالى إنما يتجلى على قدر الرائي، لا على قدره إذ لا يطيقه أحد. وسيأتي، في الإشارة، بقية الكلام عليه، إن شاء الله. { إِنه هو السميعُ البصير } أي: السميع لأقوال حبيبه في حال مناجاته، البصيرُ بأحواله، فيكرمه ويُقربه على حسب ذلك. الإشارة: قال بعض الصوفية: إنما قال تعالى: { بعبده } ، ولم يقل: بنبيه: ولا برسوله ليدل على أن كل من كملت عبوديته كان له نصيب من الإسراء. غير أن الإسراء بالجسد مخصوص به - عليه الصلاة والسلام -، وأما الإسراء بالروح فيقع للأولياء على قدر تصفية الروح، وغيبتها عن هذا العالم الحسي، فتعرج أفكارهم وأرواحهم إلى ما وراء العرش، وتخوض في بحار الجبروت، وأنوار الملكوت، كلٌّ على قدر تخليته وتحليته. وإنما خص الإسراء بالليل لكونه محل فراغ المناجاة والمواصلات، ولذلك رتب بعثه مقامًا محمودًا على التهجد بالليل في هذه السورة. قاله المحشي. وقوله تعالى: { سبحان الذي أسرى } ، قال الورتجبي: أي: تنزه عن إشارة الجهات والأماكن في الفوقية، وما يتوهم الخلق من أنه إذ أوْصل عبده إلى وراء الوراء، أنه كان في مكان، أي: لا تتوهموا برفع عبده إلى ملكوت السماوات، أنه رفع إلى مكان، أو هو في مكان، فإن الأكوان والمكان أقل من خردلة في وادي قدرته، أي: في بحر عظمته ألا ترى إلى قوله عليه الصلاة والسلام:\n\n \" الكون في يمين الرحمن أقل من خردلة \" \nوالعندية والفوقية منه، ونزّه نفسه عن أوهام المشبّهات، حيث توهموا أنه أسرى به إلى المكان، أي: سبحان من تنزه عن هذه التهمة. هـ. وقال القشيري: أرسله الحق تعالى ليتعلم أهلُ الأرض منه العبادة، ثم رَقَّاه إلى السماء ليتعلّمَ منه الملائكةُ - عليهم السلام - آدابَ العبادة، قال تعالى:\n[النّجْم: 17]، وما التَفَتَ يمينًا ولا شمالاً، ما طمع في مقام، ولا في إكرام، تحرر عن كلِّ طلبٍ وأرَبٍ، تلك الليلة. هـ. قلت: ولذلك أكرمه الله تعالى بالرؤية، التي مُنِعَ منها نبيه موسى عليه السلام، حيث وقع منه الطلب \" ربما دلهم الأدب على ترك الطلب \" ، وقال الورتجبي: أسرى به عن رؤية فعله وآياته، إلى رؤية صفاته، ومن رؤية صفاته إلى رؤية ذاته، وأشهده مَشاهد جماله، فرأى الحق بالحق، وصار هنالك موصوفًا بوصف الحق، فكان صورتُه روحَه، وروحُه عقلَه، وعقلُه قلبَه، وقلبُه سره، فرأى الحق بجميع وجوده لأن وجوده فانٍ بجميعه، فصار عينًا من عيون الحق، فرأى الحق بجميع العيون، وسمع خطابه بجميع الأسماع، وعرف الحق بجميع القلوب. هـ. وقال، في قوله تعالى: { إِلى المسجد الأقصى }: سبب بداية المعراج بالذهاب إلى المسجد الأقصى، لأن هناك الآية الكبرى من بركة أنوار تجليه لأرواح الأنبياء وأشباحهم، وهناك بقربه طور سيناء، وطور زيتا، والمصيصة، ومقام إبراهيم وموسى وعيسى، وفي تلك الجبال مواضع كشوف الحق، ولذلك قال: { باركنا حوله } ، انظر تمامه. ولما كان لسيدنا موسى عليه السلام مزيد كلام ومراجعة مع نبينا عليه الصلاة والسلام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:22",
      "similarity": 0.5151472961022711
    },
    {
      "verse": "36:20",
      "similarity": 0.5145973739513333
    },
    {
      "verse": "44:23",
      "similarity": 0.4574120142394748
    },
    {
      "verse": "89:4",
      "similarity": 0.4484780977920863
    },
    {
      "verse": "28:20",
      "similarity": 0.44216660766510796
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}