{
  "chapter": "الإسراء",
  "text": "اقرا كتبك كفى بنفسك اليوم عليك حسيبا",
  "translations": [
    {
      "translation": "'Read your Book! Today your own self is reckoner enough against you!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read your ledger; this day you are sufficient to take your own account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read your scroll; this Day you suffice to take account of yourself.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will tell him, \"Read it and judge for yourself.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said, “Read your ledger; this day you are sufficient to take your own account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said to him): \"Read your Book. You yourself are sufficient as a reckoner against you this Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read your book; your own self is sufficient as a reckoner against you this day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read thy book! Thy soul suffices thee this day as a reckoner against thee.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And it will be said unto him): Read thy Book. Thy soul sufficeth as reckoner against thee this day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will say, \"Read your record, today there will be none but yourself to call you to account!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read thine book; sufficeth to-day thy soul against thee as a reckoner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Read your book! Today your soul suffices as your own reckoner.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said to him:) \"Read thine (own) record: Sufficient is thy soul this day to make out an account against thee.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said to him): \"Read your book. You yourself are sufficient as a reckoner against you this Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read your book. Your self suffices you this Day as a reckoner against you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Read your book; today there will be none but yourself to call you to account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It will be said], \"Read your record. Sufficient is yourself against you this Day as accountant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:14] And it will be said to him: ‘Read your book! This day your soul suffices as your own reckoner’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And it will be said to him: (Read thy book. Thy soul sufficeth as reckoner against thee this day) your soul is a witness of what you did.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوحين إلقائه إليه يُقال له: { ٱقْرَأْ } أيها المكلّف في دار الابتلاء بأنواع التكليفات، والمأمور فيها بامتثال الأوامر، وترك المنهيات { كِتَٰبَكَ } أي: مكتوبك المشتمل على جميع ما صدر عنك؛ إذ { كَفَىٰ بِنَفْسِكَ ٱلْيَوْمَ } أي: كفى نسك اليوم { عَلَيْكَ حَسِيباً } [الإسراء: 14] أي: كافياً وشهيداً بلا احتياج لك إلى محاسب آخر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يلقاه منشورًا } ، ويقال له: { اقرأ كتابك كفى بنفسك اليومَ عليك حسيبًا } محاسبًا، لا تحاسبك إلا نفسك، أو: رقيبًا وشهيدًا علىعملك، أو: لا يَعُد عليك أعمالك إلا نفسك\n والله تعالى أعلم\n الإشارة: ينبغي للإنسان أن يكون داعيًا بلسانه، مفوضًا لله في قلبه، لا يعقد على شيء من الحظوظ والمآرب، فقد يدعو بالخير في زعمه، وهو شر في نفس الأمر في حقه، وقد يدعو بالشر وهو خير\n وقد تأْتيه المضار من حيث يرتقب المسار، وقد تأتيه المسار من حيث يخاف الضرر { والله يعلم وأنتم لا تعلمون }\n فالتأني والسكون من علامة العقل، والشَّرَّةُ والعَجَلَة من علامة الحمق\n فما كان من قسمتك لا بدّ يأتيك في وقته المقدر له، وما ليس من قسمتك لا يأتيك، ولو حرصت كل الحرص\n فكل شيء سبق تفصيله وتقديره، فمن وجد خيرًا فليحمد الله، ومن وجد غير ذلك فلا يلوم إلا نفسه\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:70",
      "similarity": 0.5732809419201546
    },
    {
      "verse": "33:3",
      "similarity": 0.5689844674988261
    },
    {
      "verse": "4:132",
      "similarity": 0.530052086900266
    },
    {
      "verse": "13:43",
      "similarity": 0.5219638366968471
    },
    {
      "verse": "4:45",
      "similarity": 0.5212180072736712
    }
  ]
}