{
  "chapter": "الإسراء",
  "text": "واذا اردنا ان نهلك قرية امرنا مترفيها ففسقوا۟ فيها فحق عليها القول فدمرنها تدميرا",
  "translations": [
    {
      "translation": "When We desire to destroy a city, We send a command to the affluent in it and they become deviant in it and the Word is justly carried out against it and We annihilate it completely.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We destroy a human habitation We send Our command to (warn) its people living a life of ease; and when they disobey, the sentence against them is justified, and We destroy them utterly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We decide to destroy a town We command the affluent among them, whereupon they commit sins in it, then the decree (of chastisement) becomes due against them and thereafter We destroy that town utterly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We decide to destroy a town We warn the rich ones therein who commit evil. Thus it becomes deserving to destruction and We destroy its very foundations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We will to destroy a township We send the commands to its prosperous people, thereupon they do not obey them, and so the Word is proved upon it – We therefore destroy and ruin it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We decide to destroy a town (population), Amarna those who live luxuriously. Then, they transgress therein, and thus the word (of torment) is justified against it (them). Then We destroy it with complete destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We wish to destroy a town, We send Our commandment to the people of it who lead easy lives, but they transgress therein; thus the word proves true against it, so We destroy it with utter destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We desire to destroy a city, We command its men who live at ease, and they commit ungodliness therein, then the Word is realized against it, and We destroy it utterly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We would destroy a township We send commandment to its folk who live at ease, and afterward they commit abomination therein, and so the Word (of doom) hath effect for it, and we annihilate it with complete annihilation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We decide to destroy a town, We command the affluent section of its people, but they transgress therein; thus the word [sentence of punishment] is justified, then We destroy the town utterly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We intend that We shall destroy a town We command the affluent people thereof, then they transgress therein; wherefore the word is justified on them; then We annihilate it with Utter annihilation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We desire to destroy a town We command its affluent ones [to obey Allah]. But they commit transgression in it, and so the word becomes due against it, and We destroy it utterly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We decide to destroy a population, We (first) send a definite order to those among them who are given the good things of this life and yet transgress; so that the word is proved true against them: then (it is) We destroy them utterly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We decide to destroy a town (population), We (first) send a definite order (to obey Allah and be righteous) to those among them [or We (first) increase in number those of its population] who are given the good things of this life. Then, they transgress therein, and thus the word (of torment) is justified against it (them). Then We destroy it with complete destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We desire to annihilate a village, We command those who live in ease, but they commit evil therein, then the Word is realized against it and it is utterly annihilated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We decide to destroy a town, We command its affluent ones, they transgress in it, so the word becomes justified against it, and We destroy it completely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We intend to destroy a city, We command its affluent but they defiantly disobey therein; so the word comes into effect upon it, and We destroy it with [complete] destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:16] And when We desire to destroy a town We command its affluent ones, those [inhabitants] of its who enjoy the graces [of God], meaning its leaders, [We command them] to obedience, by the tongue of Our messengers; but they fall into immorality therein, rebelling against Our command, and so the Word is justified concerning it, that it should be chastised, and We destroy it utterly, We annihilate it by annihilating its inhabitants and leaving it in ruins.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We would destroy a township We send commandment to its folk who live at ease) We send commandments to its leaders and tyrants to obey; it is also said that this means: We increase the number of its chiefs, tyrants and wealthy people; and it is also said that this means: We rouse against them their tyrants and leaders, (and afterward they commit abomination therein) they commit acts of disobedience therein, (and so the Word (of doom) hath effect for it) its destruction takes effect, (and We annihilate it with complete annihilation) We completely destroy them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذَآ أَرَدْنَآ أَن نُّهْلِكَ قَرْيَةً أَمَرْنَا مُتْرَفِيهَا فَفَسَقُواْ فِيهَا } معناهُ أَمرْناهُم بالطَّاعةِ فَعَصُوا، قالَ الإِمامُ زيدُ بن علي عليهما السلام: وتقرأ أمَّرَنا من الإِمارة\n وآمَرنا: معناهُ كَثّرَنا\n\n\n\n\nوقوله تعالى: { فَحَقَّ عَلَيْهَا ٱلْقَوْلُ } يعني وَجَبَ عَليها العَذابُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"When We desire to destroy a city, We command its affluent but they defiantly disobey therein,\" [means that] We commanded them to obey, but they disobeyed. Imam Zayd ibn Ali said, \"And You commanded us to rule.\"\n\n\nWe ordered: {meaning} we increased.\n\n\nAnd His saying - exalted be He - \"The punishment is due on her\" - means that the punishment is obligatory on her.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أُخذوا وعُذبوا { وَ } كذلك جرت سنتنا أنَّا { إِذَآ أَرَدْنَآ أَن نُّهْلِكَ } ونستأصل { قَرْيَةً } مستحقةً للإهلاك والاستئصال { أَمَرْنَا مُتْرَفِيهَا } أي: متنعميها بالإطاعة والانقياد { فَفَسَقُواْ فِيهَا } وخرجوا عن مقتضى الأمر\n ولم يبالوا به { فَحَقَّ } أي: ثبت واستقر { عَلَيْهَا ٱلْقَوْلُ } أي: على أهل القرية العذابُ الموعود والمعهود { فَدَمَّرْنَاهَا } وأهلكنا أهلها\n بسبب فسقهم\n وخروجهم عن الإطاعة والامتثال بالمأمور { تَدْمِيراً } [الإسراء: 16] أي: هلاكاً كلياً\n واستئصالاً حقيقياً إلى حيث لم يبقَ منهم ومن عمرانهم وزراعتهم شيء\n\n\nليس أمثال هذا الإهلاك ببدعٍ منا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { وإِذا أردنا أن نُهلك قريةً } أي: تعلقت إرادتنا بإهلاكها لإنفاذ قضائنا السابق، ودنا وقتُ إهلاكها، { أمرنا مُتْرفيها } منعميها، بمعنى رؤسائها بالطاعة على لسان رسول بعثناه إليهم، ويدل على ذلك ما قبله وما بعده، فإن الفسق هو الخروج عن الطاعة، لقوله: { ففسقُوا فيها } خرجوا عن أمرنا\n وقيل: أمرناهم: ألهمناهم الفسق وحملناهم عليه، أو: جعلنا لهم أسباب حملهم على الفسق بأن صببنا عليهم من النعم ما أبطرهم، وأفضى بهم إلى الفسوق، { فحقَّ عليها القولُ } وجب عليها كلمة العذاب السابق بحلوله، أو بظهور معاصيهم\n { فدمرناها تدميرًا } أهلكناها بإهلاك أهلها وتخريبها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:34",
      "similarity": 0.5946179139919187
    },
    {
      "verse": "56:45",
      "similarity": 0.5462562731928899
    },
    {
      "verse": "26:172",
      "similarity": 0.5456780703673946
    },
    {
      "verse": "37:136",
      "similarity": 0.5456780703673946
    },
    {
      "verse": "25:36",
      "similarity": 0.5258658136068477
    }
  ]
}