{
  "chapter": "الإسراء",
  "text": "قل ءامنوا۟ به او لا تؤمنوا۟ ان الذين اوتوا۟ العلم من قبله اذا يتلى عليهم يخرون للاذقان سجدا",
  "translations": [
    {
      "translation": "Say: 'Have iman in it or do not have iman in it.' Certainly, when it is recited to them, those who were given knowledge before it fall on their faces in prostration,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Believe in it or do not believe: Those who were given knowledge before it bow in adoration when it is read out to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): \"Whether you believe in it, or do not believe,\" but when it is recited to those who were given the knowledge before its revelation, they fall down upon their faces in prostration\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It does not matter whether you believe in it or not, for when it is read to those who had received the knowledge (heavenly Books) that were sent before, they bow down and prostrate themselves before the Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Whether you accept faith in it or not”; indeed those who received knowledge before the Qur’an came, fall down prostrate on their faces when it is recited to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Believe in it or do not believe (in it). Verily, those who were given knowledge before it, when it is recited to them, fall down on their chins (faces) in humble prostration.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Believe in it or believe not; surely those who are given the knowledge before it fall down on their faces, making obeisance when it is recited to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Believe in it, or believe not; those who were given the knowledge before it when it is recited to them, fall down upon their faces prostrating,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Believe therein or believe not, lo! those who were given knowledge before it, when it is read unto them, fall down prostrate on their faces, adoring,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"You may believe in it or not. Those to whom knowledge had been revealed, fall on their faces in prostration when it is recited,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: whether ye believe it or believe it not, verily those who were vouchsafed knowledge before it, when it is recited unto them, fall down on their chins, prostrating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Whether you believe in it, or do not believe in it, indeed when it is recited to those who were given knowledge before it, they fall down in prostration on their faces,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Whether ye believe in it or not, it is true that those who were given knowledge beforehand, when it is recited to them, fall down on their faces in humble prostration,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to them): \"Believe in it (the Quran) or do not believe (in it). Verily! Those who were given knowledge before it (the Jews and the Christians like 'Abdullah bin Salam and Salman Al-Farisi), when it is recited to them, fall down on their faces in humble prostration.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Believe in it, or do not believe. When it is recited to those to whom knowledge was given before they fall prostrate upon their faces\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Believe in it, or do not believe.” Those who were given knowledge before it, when it is recited to them, they fall to their chins, prostrating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Believe in it or do not believe. Indeed, those who were given knowledge before it - when it is recited to them, they fall upon their faces in prostration,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:107] Say, to the disbelievers of Mecca, ‘Believe in it or do not believe, as a threat to them; indeed those who were given knowledge before it, before its revelation, namely, the believers from among the People of the Scripture, when it is recited to them, fall down in prostration on their faces,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) O Muhammad, to them: (Believe therein) believe in the Qur'an (or believe not) this is a threat to them, (lo! those who were given knowledge) those who were given knowledge of the Torah and are aware of the description and attributes of Muhammad (pbuh) (before it) before the Qur'an, (when it is read unto them) when the Qur'an is read to them, (fall down prostrate on their faces, adoring) they prostrate to Allah,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قل آمنوا به أو لا تؤمنوا } أي: أن وجوداتكم كالعدم عندنا\n ليس المراد منه هدايتكم لكونكم مطبوعاً على قلوبكم لا محل لكم عند الله ولا في الوجود لكونكم أحلاس بقعة الإمكان معدومي الأعيان بالذات إنما الاعتبار بالعلماء الذين لهم وجود عند الله في عالم البقاء المعتدّ بهم في الأنباء\n فانظر كيف تراهم عند تلاوته عليهم وسماعهم إياه { يخرّون } أي: ينقادون له ويعترفون به ويعرفون حقيقته لعلمهم به ومعرفتهم إياه بنورية الاستعداد ومناسبته له",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل للطاعنين في القرآن\n المائلين عن حقيته جهلاً وعناداً على سبيل التهديد والتوبيخ: { آمِنُواْ بِهِ أَوْ لاَ تُؤْمِنُوۤاْ } أي: سواء منكم الإيمان بالقرآن وعدم الإيمان به\n لأنكم جهلاء عما فيه من الحقائق والمعارف\n غفلاء عن الرموز والإشارات المودعة فيه\n فتصديقكم وتكذيبكم لا يجدي نفعاص\n ولا يورث ضراً\n إنما العبرة لذوي الخبرة { إِنَّ ٱلَّذِينَ أُوتُواْ ٱلْعِلْمَ } من لدن حكيمٍ عليمٍ بحقية ما فيه\n وما في جميع الكتب الإلهية\n وهم الأنبياء والأولياء المجبولون على فطرة التوحيد والعرفان\n كانوا يؤمنون به ويصدقون به { مِن قَبْلِهِ } أي: قبل نزوله\n وبعد نزوله كذلك { إِذَا يُتْلَىٰ عَلَيْهِمْ يَخِرُّونَ } ويسقطون { لِلأَذْقَانِ سُجَّداً } [الإسراء: 107] متذللين\n واضعين جباههم وأذقانهم على تراب المذلة تعظيماً لأمر الله\n وشكراً له لإنجازه وعده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل } للذين كفروا: { آمِنُوا به أو لا تُؤمنوا } \n فإنَّ إيمانكم لا يزيده كمالاً\n وامتناعكم منه لا يزيده نقصانًا\n أو: أُمِرَ باحتقارهم وعدم الاكتراث بهم\n كأنه يقول: سواء آمنتم به أو لم تؤمنوا لأنكم لستم بحجة\n وإنما الحجة لأهل العلم\n وهم: المؤمنون من أهل الكتاب\n الذين أشار إليهم بقوله: { إِن الذين أُوتوا العلم من قَبْلِهِ } أي: العلماء الذين قرأوا الكتب السالفة من قبل تنزيله\n وعرفوا حقيقة الوحي وأمارات النبوة\n وتمكنوا من التمييز بين الحق والباطل\n والمحق والمبطل\n { إِذا يُتلى عليهم } القرآن { يَخرُّون للأذقانِ } أي: يسقطون على وجوههم { سُجَّدًا } تعظيمًا لأمر الله\n أو شكرًا لإنجازه ما وعد في تلك الكتب من نعتك\n وإظهارك\n وإنزال القرآن عليك\n والأذقان: جمع ذقن\n وهو: أسفل الوجه حيث اللحية\n وخصها بالذكر لأنها أول ما تلقى في الأرض من وجه الساجد\n والجملة: تعليل لما قبلها من قوله: { آمِنُوا به أو لا تؤمنوا } من عدم المبالاة\n والمعنى: إن لم تؤمنوا فقد آمن منْ هو أعلى منكم وأحسن إيمانًا منكم\n ويجوز أن يكون تعليلاً لقُل\n على سبيل التسلية للرسول - عليه الصلاة والسلام -\n كأنه يقول: تسلّ بإيمان العلماء عن إيمان الجهلة\n ولا تكترث بإيمانهم وإعراضهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:109",
      "similarity": 0.7546397178705124
    },
    {
      "verse": "32:15",
      "similarity": 0.33542868767882433
    },
    {
      "verse": "36:8",
      "similarity": 0.3350744713435657
    },
    {
      "verse": "25:73",
      "similarity": 0.26299337181142385
    },
    {
      "verse": "19:58",
      "similarity": 0.23559823022158627
    }
  ]
}