{
  "chapter": "الإسراء",
  "text": "وقل الحمد لله الذى لم يتخذ ولدا ولم يكن له شريك فى الملك ولم يكن له ولى من الذل وكبره تكبيرۢا",
  "translations": [
    {
      "translation": "And say: 'Praise be to Allah Who has had no son and Who has no partner in His Kingdom and Who needs no one to protect Him from abasement.' And proclaim His Greatness repeatedly!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"All praise be to God who has neither begotten a son nor has a partner in His kingdom; nor has He need of any one to protect Him from ignominy. So extol Him by extolling His majesty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"All praise be to Allah Who has neither taken to Himself a son, nor has He any partner in His kingdom, nor does He need anyone, out of weakness, to protect Him.\" So glorify Him in a manner worthy of His glory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is only God who deserves all praise. He has not begotten a son and has no partner in His Kingdom. He does not need any guardian to help Him in His need. Proclaim His greatness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, “All praise is to Allah, Who has not chosen a son for Himself, and none is His partner in kingship, and none is His supporter due to weakness, and say ‘Allah is Great’ to proclaim His greatness.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"All the praises and thanks be to Allah, Who has not begotten a son, and Who has no partner in (His) dominion, nor is He low to have a supporter. And magnify Him with all magnificence.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: (All) praise is due to Allah, Who has not taken a son and Who has not a partner in the kingdom, and Who has not a helper to save Him from disgrace; and proclaim His greatness magnifying (Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: 'Praise belongs to God, who has not taken to Him a son, and who has not any associate in the Kingdom, nor any protector out of humbleness.' And magnify Him with repeated magnificats.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: Praise be to Allah, Who hath not taken unto Himself a son, and Who hath no partner in the Sovereignty, nor hath He any protecting friend through dependence. And magnify Him with all magnificence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and say, \"All praise is due to God who has never begotten a son and who has no partner in His kingdom; nor does anyone aid Him because of any weakness of His. Proclaim His greatness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say thou: all praise is unto Allah who hath not taken a son, and whose is no associate in the dominion, nor hath He a protector through weakness, and magnify Him with all magnificence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and say, ‘All praise belongs to Allah, who has neither taken any son, nor has He any partner in sovereignty, nor has He any wali out of weakness,’ and magnify Him with a magnification [worthy of Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Praise be to Allah, who begets no son, and has no partner in (His) dominion: Nor (needs) He any to protect Him from humiliation: yea, magnify Him for His greatness and glory!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"All the praises and thanks be to Allah, Who has not begotten a son (nor an offspring), and Who has no partner in (His) Dominion, nor He is low to have a Wali (helper, protector or supporter). And magnify Him with all the magnificence, [Allahu-Akbar (Allah is the Most Great)].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Praise be to Allah who has not taken a son; who has no associate in the Kingdom; nor out of humility any guardian' And exalt Him repeatedly with exaltations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, “Praise be to God, who has not begotten a son, nor has He a partner in sovereignty, nor has He an ally out of weakness, and glorify Him constantly.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, \"Praise to Allah, who has not taken a son and has had no partner in [His] dominion and has no [need of a] protector out of weakness; and glorify Him with [great] glorification.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:111] And say: ‘Praise be to God, Who has neither taken a son, nor has He any partner in sovereignty, in divineness, nor has He [taken] any ally, to assist Him, out of, because of [any], weakness’, that is to say, He would never become weak and thus need an assistant. And magnify Him with magnifications [worthy of Him], extol Him with a perfect extolling above that He should have taken a son or a partner, and [above] any weakness and [above] all that does not befit Him. The arrangement whereby ‘praise’ is [invoked] together with this [statement] is meant to indicate that He is the One worthy of all praise, because of the   perfection of His Essence and the fact that He alones possesses those attributes of His. Imam Ahmad [b. Hanbal] relates in his Musnad [by way of a report] from Mu‘ādh al-Juhanī [who heard it] from the Messenger of God (s), who used to say, ‘The “glory” verse [in the Qur’ān] is: Praise be to God, Who has neither taken a son, nor has He any partner in sovereignty … to the end [of the above-mentioned sūra, 17:111]’, and God, exalted be He, knows best. The author of this [commentary] says, ‘This [last commentary] constitutes the end of my complement to the commentary on the Noble Qur’ān composed by the inquisitive scholar, the shaykh, Imam Jalāl al-Dīn alMahallī al-Shāfi‘ī, may God be pleased with him. I have expended every effort in it and reflected throughout it exhaustively, [especially] in those precious things that I have deemed, God willing, to be profitable. I composed it [this commentary] in the same length of time appointed for the one spoken to by God [sc. Moses] and I have made it a means to attaining the Gardens of Bliss. It [this commentary] actually draws on the work which it complements, relying and depending on it for [an understanding of] those allegorical verses. May God have mercy on one who examines it with impartiality, chances upon an error and informs me of it. As I have said: “I praise God, my Lord, for He guided me in what I have expressed despite my incapacity and weakness; for who [other than God] is there to avert me from error and who is there to accept from me even a single letter”. In fact, it never occurred to me to embark upon such [a task], knowing that I was incapable of delving into such issues. Perhaps God will make it of ample profit [to others] and through it open sealed hearts, blinded eyes and deaf ears. I have the impression that I am before those [sort of readers] who would prefer works of prolixity, refraining from [referring to] this complementary work, rejecting it outright, tending to obvious obstinacy [regarding it], without addressing its intricacies with any understanding: And whoever is blind in this world shall be blind in the Hereafter [Q. 17:72]. May God thereby provide us with a [way of] guidance to the path of truth, with success, an awareness of the subtle intricacies of His words and with an ascertainment. May He thereby also make us with those to whom God has been gracious from among the prophets and the truthful and the martyrs and the righteous — and excellent companions are they! [Q. 4:69]. He [Jalāl al-Dīn al-Suyūtī] completed the composition of this [work] on Sunday, 10th of Shawwāl, in the year 870 (AH) [1465 AD], having commenced it on the first Wednesday of Ramadān of the same year. He completed the fair copy [of this work] on Wednesday, 6th of Safar in the year 871 (AH) [1466 AD], and God knows best. Shaykh Shams al-Dīn Muhammad b. Abī Bakr al-Khatīb al-Tūkhī said: my friend the erudite shaykh Kamāl al-Dīn al-Mahallī, brother of the above-mentioned shaykh of ours, shaykh Jalāl al-Dīn alMahallī, may God have mercy on both of them, that he saw his brother, the above-mentioned shaykh Jalāl al-Dīn, in his dream: before him stood our friend the inquiring erudite scholar shaykh Jalāl al-Dīn al-Suyūtī, compiler of this complement. He [Mahallī] had this complement in his hand and, perusing it, he was saying to its above-mentioned compiler [Suyūtī], ‘Which of the two is better, my composition or yours?’. He [Suyūtī] said, ‘Mine’. He [Mahallī] then said, ‘But look at this …’, and he showed him parts of it, politely pointing out to him his objections thereto. Each time he [Mahallī] brought something up, the compiler of this complement [Suyūtī] would respond to him, while shaykh [Mahallī] would smile and laugh. Our shaykh, the imam, the erudite scholar Jalāl al-Dīn ‘Abd al-Rahmān b. Abī Bakr al-Suyūtī, compiler of this complement said: What I believe, and what I am absolutely certain of, is that the part composed by shaykh Jalāl al-Dīn al-Mahallī, may God have mercy on him, in his section [of the commentary] is actually better than mine by far. How [could it be otherwise], when most of what I have written here draws on his work and relies on it? I have no doubt about this. As regards what was seen in the above-mentioned dream, then perhaps it is the case that the shaykh meant to point out those few places in which I disagreed with what he had written on account of some little comment [that I had made therein]. But these [instances] are very few and I do not think that they add up to more than ten such instances. Among these is where shaykh [al-Mahallī] comments in sūrat Sād: ‘The Spirit is a delicate organism (jism latīf) that gives life to a human being by permeating it’. I followed this [opinion] at first, but then I remembered the restriction [made by God] while [working on the commentary] at sūrat al-Hijr; and so I erased it because of where God says, And they will question you concerning the Spirit. Say, ‘The Spirit is of the command of my Lord. And of knowledge you have not been given except a little […]’ [to the end of] the verse [Q. 15:85]. For, it is explicit, or almost explicit, in stating that the [true nature of the] Spirit is of God’s knowledge [only], exalted be He — we do not know it. Thus, it is better that we should refrain from trying to define it. For this reason also, shaykh Tāj al-Dīn b. al-Subkī says in [his work] Jam‘ al-jawāmi‘ (The compendium of compendiums’): ‘As for the spirit, Muhammad (s) never spoke about it and we should [also] therefore refrain [from speaking about it].’ Another [instance] is where the shaykh says in [his commentary to] sūrat al-Hajj [Q. 22:17], ‘The Sabaeans (al-sābi’ūn) are a   Jewish sect’. I mention this in [my commentary to] sūrat al-Baqara [Q. 2:62], where I added the following [gloss] ‘or [they are] a Christian [sect]’, in order to point out a variant opinion, generally acknowledged, particularly by our colleagues, the [Shāfi‘ī] jurists, and [also acknowledged] by the Minhāj (‘The Method […]’), where it is stated that the Samaritans opposed the Jews and the Sabaeans [opposed] the Christians [respectively] over the fundamentals of their religion. In his [Mahallī’s] Sharh (‘Commentary’), al-Shāfi‘ī, may God be pleased with him, is reported to have said that the Sabaeans were a Christian sect. At this moment, I cannot recall a third instance [of Mahallī’s objections]. Perhaps these are the sort of examples which the Shaykh, may God have mercy on him, was pointing out [in the dream]. And God knows best what is correct, and to Him is the return and the [final] resort. Meccan, except for verses 28, and from [verses] 82 to the end of 101, which are Medinese; it consists of 110 or 115 verses, revealed after sūrat al-Ghāshiya.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And say: Praise be to Allah) gratitude and divinity are Allah's, (Who hath not taken unto Himself a son) from amongst the angels or humans such that he inherits His dominion, (and Who hath no partner in the Sovereignty) such that he shows enmity towards Him, (nor hath He any protecting friend) a helper (through dependence) from among the Jews and Christians; it is also said that this means: He has not been humiliated such that He needs a helper from the Jews or Christians. (And magnify Him with all magnificence) deem Him far exalted above what the Jews, Christians and idolaters say about Him; and Allah knows better the secrets of His Book. And of the surah in which the Cave is mentioned, which is all Meccan except for two Medinan verses in which 'Uyaynah Ibn Hisn al-Fazari was mentioned, and it consists of 111 verses, 1,567 words and 6,460 letters: Surah 18: The Cave (al-Kahf) And of the surah in which the Cave is mentioned, which is all Meccan except for two Medinan verses in which 'Uyaynah Ibn Hisn al-Fazari was mentioned, and it consists of 111 verses, 1,567 words and 6,460 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَمْ يَكُنْ لَّهُ وَلِيٌّ مِّنَ ٱلذُّلِّ } معناهُ لَم يَكنْ لَهُ حَليفٌ وَلاَ نَاصرٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And he had no helper or supporter from among the weak}, its meaning is that he had no ally or helper.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقُلِ } بعدما تحققتَ وتمكنتَ في مقر التوحيد شكراً لما أنعمك الحق الوصل إليه، وأمكنك التحقق دونه والورود عليه: { ٱلْحَمْدُ لِلَّهِ ٱلَّذِي } توحد بذاته ونقدس بأسمائه وصفاته، وتفرد بألوهيته، واستقل بوجوده وربوبيته إلى حيث { لَمْ يَتَّخِذْ وَلَداً } يخلف عنه لكونه صمداً قيوماً أزلياً سرمدياً، لا يعرضه الفناء ولا يعتريه الانصرام والانقضاء { وَلَم يَكُنْ لَّهُ شَرِيكٌ فِي ٱلْمُلْكِ } والملكوت يظاهره أو يزاحمه ويخاصمه؛ إذ لا شيء في الوجود سواه { وَلَمْ يَكُنْ لَّهُ وَلِيٌّ } يولي أمره ويعين عليه حين ما لحقه { مِّنَ ٱلذُّلِّ } المسقطِ لعزه الأصلي وعِظَمِهِ الحقيقي الأزلي؛ إذ لا تغيرَ ولا تبدلَ في ذاته أصلاً\n\n\n\n\n{ وَ } بالجملة: { كَبِّرْهُ تَكْبِيراً } [الإسراء: 111] ذاتياً حقيقياً وعظِّمه تعظيماً صورياً ومعنوياً؛ إذ لا وجود للغير معه حتى يتصور هناك النسبة والإضافة، بل هو أجل وأكبر لذاته بلا توهم الإضافة فيه\n\n\n\n\nاهدنا بفضلك سواء سبيلك إلى توحيدك، واجعلنا من زممرة أرباب تمييزك وتمجيدك\n\n\n\n\nخاتمة السورة\n\n\n\n\nعليك أيها الموحد المحقق في مقام تمجيد الحق وتحميده\n مكّنك الله بما أوصاك إليه وقررك دونه\n أن تعظمَ الحقَ غاية التعظيم، وتكبره كمال التكبير والتكريم، واعلم أن تعظيمه إنما هو بتعظيم مظاهره ومجاليه؛ إذ ما من ذرةٍ من ذرائر الكائنات إلا وقد ظهر الحق فيه، وتجلى عليه بأسمائه الحسنى وصفاته العليا، فلك أن تتواضع وتتذلل عند المظاهر طوعاً ورغبةً، ولا تتكبر عليها، ولا تتعظم دونها؛ إذ التكبر والتفوق على ذرةٍ صغيرةٍ من أمارات عدم الوصول إلى مرتبة اليقين الحقي ومقرِّ التوحيد الحقيقي\n\n\n\n\nوذلك إنما يحصل لك بعد رفع مقتضيات أوصافك البشرية بموتك الإرادي الاختياري، وهو إنما يحصل بالرياضات الشاقة القالعة لدرن الهوى والغفلات، وترك العادات الراسخات في نفوس أصحاب الجهالات، والركون إلى العزلة والخلوات، والانقطاع عن رسوم أصحاب التخمينات والتقليدات، والتبتل نحو الحق في عموم الأوقات والحالات\n\n\n\n\nوفقنا الله وإياكم سلوك طريق التوحيد، ورزقنا الوصول إلى منزلة التجريد والتفريد، وجعلنا من زمرة أهل المحبة والولاء الوالهين في مقام التمجيد والتحميد، إنك قريب مجيب حميد مجيد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولم يكن له وَلِيٌّ من الذُّلِّ } أي: لم يكن له ناصر ينصره { من الذُّل } أي: لم يذل فيحتاج إلى ولي يُواليه ليدفع ذلك عنه\n وفي التعرض في أثناء الحمد لهذه الصفات الجليلة إيذان بأن المستحق للحمد من هذه نعوته، دون غيره إذ بذلك يتم الكمال، وما عداه ناقص حقير، ولذلك عطف عليه: { وكبِّره تكبيرًا } عظيمًا، وفيه تنبيه على أن العبد وإن بالغ في التنزيه والتمجيد، واجتهد في العبادة والتحميد، ينبغي أن يعترف بالقصور عن حقه في ذلك\n رُوي أنه عليه الصلاة والسلام كان إذا أفصح الغلام من بني عبد المطلب علَّمه هذه الآية: وقل الحمد لله\n\n\n الخ\n والله تعالى أعلم\n الإشارة: الإجهار بالذكر والقراءة والدعاء، مباح لأهل البدايات، لمن وجد قلبه في ذلك، وأما النهي الذي في الآية فمنسوخ لأن الصحابة، حين هاجروا من مكة، رفعوا أصواتهم بالقراءة والتكبير\n لكن المداومة عليه من شأن أهل البُعد عن الحضرة، وأما أهل القُرب فالغالب عليهم السكوت أو المخافتة قال تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "58:20",
      "similarity": 0.4451179851073215
    },
    {
      "verse": "25:2",
      "similarity": 0.42422682181360855
    },
    {
      "verse": "27:34",
      "similarity": 0.4128817250290774
    },
    {
      "verse": "36:72",
      "similarity": 0.38932786017988585
    },
    {
      "verse": "63:8",
      "similarity": 0.3719175604584852
    }
  ]
}