{
  "chapter": "الإسراء",
  "text": "ولقد ءاتينا موسى تسع ءايتۭ بينت فسـل بنى اسرءيل اذ جاءهم فقال له فرعون انى لاظنك يموسى مسحورا",
  "translations": [
    {
      "translation": "We gave Musa nine Clear Signs. Ask the tribe of Israel about when he came to them and Pharaoh said to him, 'Musa, I think you are bewitched.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses nine clear signs; so ask the children of Israel. When (Moses) came to them the Pharaoh said: \"I think, O Moses, you have been deluded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We granted Moses nine clear signs. Ask the Children of Israel about that: when these signs came forth, Pharaoh said to him: \"Moses, I think that you are bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Moses We gave nine illustrious miracles. Ask the Israelites; Moses came to them. The Pharaoh said to him,\"Moses, I believe that you are bewitched\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Moosa nine clear signs, therefore ask the Descendants of Israel when he came to them – in response Firaun said, “O Moosa – I think you are under a magic spell.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa nine clear signs. Ask then the Children of Israel, when he came to them, then Fir`awn said to him: \"O Musa! I think you are indeed bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave Musa nine clear signs; so ask the children of Israel. When he came to them, Firon said to him: Most surely I deem you, O Musa, to be a man deprived of reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses nine signs, clear signs. Ask the Children of Israel when he came to them, and Pharaoh said to him, 'Moses, I think thou art bewitched.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We gave unto Moses nine tokens, clear proofs (of Allah's Sovereignty). Do but ask the Children of Israel how he came unto them, then Pharaoh said unto him: Lo! I deem thee one bewitched, O Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did indeed give Moses nine manifest signs; you can enquire from the Children of Israel. When he came to them, Pharaoh said to him, \"Moses, I can see that you are bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed unto Musa nine manifest signs - ask thou the Children of Israel--so when he came unto them, Fir'awn said unto him, verily imagine thee, O Musa! enchanted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Moses nine manifest signs. So ask the Children of Israel. When he came to them, Pharaoh said to him, ‘O Moses, indeed I think you are bewitched.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Moses We did give Nine Clear Signs: As the Children of Israel: when he came to them, Pharaoh said to him: \"O Moses! I consider thee, indeed, to have been worked upon by sorcery!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave to Musa (Moses) nine clear signs. Ask then the Children of Israel, when he came to them, then Fir'aun (Pharaoh) said to him: \"O Musa (Moses)! I think you are indeed bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Moses We gave nine clear signs. Ask the Children of Israel about how he came to them. When Pharaoh said to him: 'Moses, I think you are bewitched.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses nine clear signs—ask the Children of Israel. When he went to them, Pharaoh said to him, “I think that you, Moses, are bewitched.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had certainly given Moses nine evident signs, so ask the Children of Israel [about] when he came to them and Pharaoh said to him, \"Indeed I think, O Moses, that you are affected by magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:101] And verily We gave Moses nine manifest signs, clear [signs], namely, [those of] the hand, the staff, the flood, the locusts, the lice, the frogs, the blood and the obliteration [of their possessions, cf. Q. 10:88], the years [of dearth] and scarcity of fruits [cf. Q. 7:130]. Ask, O Muhammad (s), the Children of Israel, about this (a [rhetorical] question meant as an affirmation for the idolaters of your sincerity; or [it means that] We said to him [Muhammad, s], ‘Ask’; a variant reading has the past tense [fa-sā’ala, ‘and he asked’]), when he came to them, Pharaoh said to him, ‘O Moses, I truly think that you are bewitched’, duped, your mind deceived.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "310 (And verily We gave unto Moses nine tokens clear proofs (of Allah's Sovereignty)) nine clear signs: the hand, the staff, the flood, the locusts, the lice, blood, the years of drought and the disappearance of properties. (Do but ask the Children of Israel) 'Abdullah Ibn Salam and his followers (how he) Moses (came unto them, then Pharaoh said unto him: Lo! I deem thee one bewitched, Moses) I think that you are possessed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ آتَيْنَا مُوسَىٰ تِسْعَ آيَاتٍ بَيِّنَاتٍ } قال: الإِمامُ أَبو الحُسين زيد بن علي عليهما السَّلامُ: وهي الطُّوفانُ، والمَوتُ والجَرادُ، والقمَّلُ، والضَّفَادعُ، والدَّمُ، ولِسَانُهُ وعَصاهُ والبَحرُ\n ويقالُ الطُّوفانُ، والجَرادُ، والقُمّلُ، والضَّفادعُ، والدَّمُ، والعَصا، والسِنينُ ونَقصٍ منَ الثَّمراتِ، وَيَدُّهُ\n ويقالُ [الطُّوفان] والجَرادُ، والقُمّلُ، والضَّفادعُ، والدَّمُ، وعَصَاه، ويَدُّه، قال الإِمام زيد بن علي عليهما السلام: وكانتْ عَصا مُوسى عَليهِ السَّلامُ مِن عَوسجٍ، وَلَم تُسَخرْ لأحدٍ بَعدَهُ\n وكان اسمُها مَاسا\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah: {And We have certainly given Moses nine clear signs} Abu al-Husayn Zayd ibn Ali, peace be upon him, said: These are the flood, and death, and locusts, and lice, and frogs, and blood, and his tongue and his staff, and the sea.\n The tornado, the locust, the lice, the frog, the blood, the stick, the years and the lack of fruits, and his hand.\n\nIt is said that {الطُّوفان} and the locust, and the mosquito, and the frog, and the blood, and his stick, and his hand, said Imam Zaid bin Ali peace be upon them: The staff of Moses peace be upon him was from {عَوسج}, and was not mocked by anyone after him.\n\n\nHer name was Masa.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهو وإن كانَ من العقل والدارية: اعتقدُك { مَسْحُوراً } [الإسراء: 101] مجنوناً مخبطاً مختلّ العقل بادعائك الرسالة والنبوة من خالق السماء ونزول الملَك والمصحف إليك من عنده مع انسداد الطرق وانعدام السبل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال في الأساس: ثبره الله: أهلكه هلاكًا دائمًا\n لا ينتعش بعده\n ومن ثَم يدعو أهلُ النار: واثبوراه\n وما ثبرك عن حاجتك: ما ثبطك عنها\n وهذا مثبَرُ فلانة: لمكان ولادتها\n حيث يثبرها النفاس\n وفي القاموس: الثبر: الحبْسُ والمنع\n كالتثبير والصرف عن الأمر وعن الحبيب\n واللعن والطرد\n والثبور: الهلاك والويل والإهلاك\n هـ\n و { إذا جاءهم }: إما متعلق بآياتنا\n أو بقلنا محذوف\n يقول الحقّ جلّ جلاله: { ولقد آتينا موسى تسع آيات بيناتٍ } واضحات الدلالة على نبوته\n وصحة ما جاء به من عند الله\n وهي: العصا\n واليد\n والجراد\n والقُمل\n والضفادع\n والدم\n والطوفان\n والسنون\n ونقص الثمرات\n وقيل: انفجار الماء من الحجر\n ونتق الطور\n وانفلاق البحر\n بدل الثلاث\n وفيه نظر فإن هذه الثلاث لم تكن لفرعون\n وإنما كانت بعد خروج سيدنا موسى عليه السلام\n وعن صفوان بْن عسال: أن يهوديًا سأل النبي صلى الله عليه وسلم عنها فقال:\n \" ألاَّ تُشْرِكُوا به شَيْئًا\n ولا تَسْرقُوا\n ولا تَزْنُوا\n ولا تَقْتُلُوا النَّفس التِي حَرَّم اللهُ إلاَّ بالحَقِّ\n ولا تَسْحُروا\n ولا تأكُلُوا الرِّبَا\n ولا تمشوا ببريء إلى ذي سُلْطَانٍ ليَقْتُلَهُ\n ولا تَقذفُوا المُحْصَنَة\n ولا تَفِرُّوا مِنَ الزَّحْفِ\n وعليكم\n خاصَّة اليهود\n ألاَّ تَعْدُوا في السَّبْتِ \" \nفقبَّل اليهوديُ يَدَه ورجْلَه - عليه الصلاة والسلام\n قلت: ولعل الحق تعالى أظهر لهم تسعًا\n وكلفهم بتسع\n شكرًا لما أظهر لهم\n فأخبر - عليه الصلاة والسلام - السائل عما كلفهم به لأنه أهم\n وسكت عما أظهر لهم لأنه معلوم\n وإنما قبَّل السائلُ يده لموافقته لما في التوراة\n وقد علم أنه ما علمه رسول الله صلى الله عليه وسلم إلا بالوحي\n وقوله عليه الصلاة والسلام:\n \" وعليكم\n خاصة اليهود\n ألا تعدوا \" \n\n حكم مستأنف زائد على الجواب\n ولذلك غيَّر فيه سياق الكلام\n قال تعالى: { فسلْ بني إسرائيل } أي: سل\n يا محمد\n بني إسرائيل المعاصرين لك عما ذكرنا من قصة موسى لتزداد يقينا وطمأنينة\n أو: ليظهر صدقك لعامة الناس\n أو: قلنا لموسى: سل بني إسرائيل مِن فرعون\n أي: اطلبهم منه ليرسلَهم معك\n أو سل بني إسرائيل أن يعضدوك ويكونوا معك\n ويؤيد هذا: قراءة رسول الله صلى الله عليه وسلم \" فَسَال \" على صيغة الماضي\n بغير همز\n وهي لغة قريش\n { إِذْ جاءهم } أي: آتينا موسى تسع آيات حين جاءهم بالرسالة\n أو قلنا له: سل بني إسرائيل حين جاءهم بالوحي\n { فقال له فرعونُ } حين أظهر له ما آتيناه من الآيات\n وبلغة ما أرسل به: { إِني لأظنك يا موسى مسحورًا } أي: سُحرت فتخبط عقلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:30",
      "similarity": 0.6800015466970071
    },
    {
      "verse": "27:48",
      "similarity": 0.39106193334683453
    },
    {
      "verse": "27:12",
      "similarity": 0.38897632834190615
    },
    {
      "verse": "18:25",
      "similarity": 0.37042533889538265
    },
    {
      "verse": "38:23",
      "similarity": 0.28715822199802726
    }
  ]
}