{
  "chapter": "الإسراء",
  "text": "من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلىها مذموما مدحورا",
  "translations": [
    {
      "translation": "As for anyone who desires this fleeting existence, We hasten in it whatever We will to whoever We want. Then We will consign him to Hell where he will roast, reviled and driven out.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever desires what hastes away, We hasten to give him (in this life) as much as We please to whosoever We will; but afterwards there is Hell for him in which he will burn, disgraced and ostracised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anyone desires immediate benefits, We hasten to grant whatever benefits We will in the present life to whomsoever We please, but thereafter We decree for him Hell wherein he shall burn, condemned and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires (only) the enjoyment of this life will receive it if We want it to be so. Then We will make Hell his reward wherein he will suffer, despised and driven away from Our mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires this fleeting one, We may give him quickly – whatever We will, to whomever We will; and then assign hell for him; for him to enter it condemned, pushed around.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the quick-passing (transitory enjoyment of this world), We readily grant him what We will for whom We like. Then, afterwards, We have appointed for him Hell; he will burn therein disgraced and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires this present life, We hasten to him therein what We please for whomsoever We desire, then We assign to him the hell; he shall enter it despised, driven away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever desires this hasty world, We hasten for him therein what We will unto whomsoever We desire; then We appoint for him Gehenna wherein he shall roast, condemned and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso desireth that (life) which hasteneth away, We hasten for him therein what We will for whom We please. And afterward We have appointed for him hell; he will endure the heat thereof, condemned, rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We give whatever We will to whoever desires immediate gains; but then We have prepared Hell for him which he will enter, disgraced and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "- Whosoever intendeth the quick Passing world, We hasten to him therein whatsoever We please unto whomsoever We intend; thereafter We shall appoint for him Hell wherein he shall roast, reproved, rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires this transitory life, We expedite for him therein whatever We wish, for whomever We desire. Then We appoint hell for him, to enter it, blameful and spurned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any do wish for the transitory things (of this life), We readily grant them - such things as We will, to such person as We will: in the end have We provided Hell for them: they will burn therein, disgraced and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever wishes for the quick-passing (transitory enjoyment of this world), We readily grant him what We will for whom We like. Then, afterwards, We have appointed for him Hell, he will burn therein disgraced and rejected, (far away from Allah's Mercy).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For whosoever desires this fleeting life We hasten for him whatever We will and to whom We want. Then, We have prepared Gehenna for him where he will be roasted, condemned and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the fleeting life, We expedite for him what We decide to give him, to whomever We desire. Then We consign him to Hell, where he will roast, condemned and defeated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever should desire the immediate - We hasten for him from it what We will to whom We intend. Then We have made for him Hell, which he will [enter to] burn, censured and banished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:18] Whoever desires, through his deeds, the hasty world, that is, [the life of] this world, We hasten for him therein whatever We will, for whom We please, [such] a hastening, (li-man nurīd, ‘for whom We please’, is a substitute for lahu, ‘for him’, with the repetition of the genitive particle [li-]). Then We appoint for him, in the Hereafter, Hell, to which he will be exposed, [to which] he will be admitted, condemned, blameful, and rejected, banished from [God’s] mercy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso desireth that (life) which hasteneth away) i.e. this worldly life by performing that which was made obligatory upon him, (We hasten for him therein) We give him in this worldly life (that We will) to give (for whom We please) to destroy in the Hereafter. (And afterward We have appointed) We have decreed (for him hell; he will endure the heat thereof, condemned, rejected) and deprived from the reward of any good 300 deed. This verse was revealed about Marthad Ibn Thumamah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَّدْحُوراً } معناه مُبعدٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {مَّدْحُوراً} [He is] removed.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ من كان يريد العاجلة } لكدورة استعداده وغلبة هواه وطبيعته { عجَّلنا له فيها ما نشاء لمن نريد } أي: لا نزيده بإرادته زيادة على ماقدرنا له من النصيب في اللوح ولذلك قيده بالمشيئة ثم بقوله { لمن نريد } يعني: لو لم نقدر له شيئاً مما أراده لم نعجل له تخليصه\n إنّا لا نعطي إلا ما أردنا { من أردنا ثم جعلنا له جهنَّم } أي: قعر بئر الطبيعة الظلمانية لانجذابه بإرادته إلى الجهة السفلية وميله إليها { يصلاها } بنيران الحرمان { مذموماً } عند أهل الدنيا والآخرة { مدحوراً } من جناب الرحمة والرضوان في سخط الله وقهره\n { ومن أراد الآخرة } لصفاء استعداده وسلامة فطرته وقام بشرائط إرادته من الإيمان والعمل الصالح شكر سعيه بحصول مراده كما قيل: من طلب وجدَّ وَجَدَ\n لأن الطلب الحقيقي والإرادة الصادقة لا يكونان إلا عند حصول استعداد المطلوب\n وإذا قارن الاستعداد الدالّ على أن المطلوب حاصل له بالقوة\n مقدّر له في اللوح أسباب خروج المطلوب إلى الفعل وبروزه من الغيب إلى الشهادة وهو السعي الذي ينبغي له ومن حقه أن يسعى له على هذا الوجه المعنيّ بقوله: { وسعى لها سعيها } أي: السعي الذي يحق لها بشرط الإيمان الغيبي اليقيني وجب حصوله له { كلاًّ نمدّ هؤلاء وهؤلاء } أي: كلهم من طالبي الدنيا وطالبي الآخرة نمد من عطائنا ليس بمجرد إرادتهم وسعيهم شيء وإنما إرادتهم وسعيهم معرّفات وعلامات لما قدّرنا لهم من العطاء { وما كان عطاء ربّك } ممنوعاً من أحد\n لا من أهل الطاعة ولا من أهل المعصية\n { انظر كيف فضلنا بعضهم على بعض } في الدنيا بمقتضى مشيئتنا وحكمتنا { وللآخرة أكبر درجات } إذ بقدر رجحان الروح على البدن يكون رجحان درجات الآخرة على الدنيا وبقدر تفاضلهما يكون تفاضل درجاتهما",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَّن كَانَ } منهم { يُرِيدُ } اللذات { ٱلْعَاجِلَةَ } والشهوات الفانية الزائلة { عَجَّلْنَا } وأعطيناه { لَهُ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ } أي: في النشأة الأولى ابتلاءً له\n واختباراً وتلبيساً عليه واغتراراً\n مطلعون على ما في سه وضميره { ثُمَّ جَعَلْنَا } وهيأنا في النشأة الأخرى { لَهُ جَهَنَّمَ } منزل الطرد والحرمان\n حال كونه { يَصْلاهَا مَذْمُوماً } مشئوماً محروماً { مَّدْحُوراً } [الإسراء: 18] مطروداً مقهوراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { لمن نُريد }: بدل من ضمير { له } بدل بعض من كل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:39",
      "similarity": 0.5706535867904784
    },
    {
      "verse": "37:9",
      "similarity": 0.3853189004888426
    },
    {
      "verse": "17:22",
      "similarity": 0.3586562119766491
    },
    {
      "verse": "68:49",
      "similarity": 0.3143698194634349
    },
    {
      "verse": "9:10",
      "similarity": 0.3065583787911369
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/17:18.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/17:18.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/17:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}