{
  "chapter": "الإسراء",
  "text": "قل ادعوا۟ الله او ادعوا۟ الرحمن ايا ما تدعوا۟ فله الاسماء الحسنى ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا",
  "translations": [
    {
      "translation": "Say: 'Call on Allah or call on the All-Merciful, whichever you call upon, the Most Beautiful Names are His.' Do not be too loud in your salat or too quiet in it, but try to find a way between the two.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Call Him Allah or call Him Ar-Rahman; whatever the name you call Him by, all His names are beautiful.\" Do not say your prayers too loudly or in too low a voice, but follow a middle coarse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them (O Prophet!): \"Call upon Him as Allah or call upon Him as al-Rahman; call Him by whichever name you will, all His names are beautiful. Neither offer your Prayer in too loud a voice, nor in a voice too low; but follow a middle course.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"It is all the same whether you call Him God or the Beneficent. All the good names belong to Him.\" (Muhammad), do not be too loud or slow in your prayer. Choose a moderate way of praying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Pray calling (Him) Allah or calling (Him) the Most Gracious; whichever name you call with – they are all His magnificent names; and do not offer your prayers very loudly or very softly, and seek a way between them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Invoke Allah or invoke Ar-Rahman (the Most Gracious), by whatever name you invoke Him (it is the same), for to Him belong the Best Names. And offer your Salah (prayer) neither aloud nor in a low voice, but follow a way between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Call upon Allah or call upon, the Beneficent Allah; whichever you call upon, He has the best names; and do not utter your prayer with a very raised voice nor be silent with regard to it, and seek a way between these.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Call upon God, or call upon the Merciful; whichsoever you call upon, to Him belong the Names Most Beautiful.' And be thou not loud in thy prayer, nor hushed therein, but seek thou for a way between that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto mankind): Cry unto Allah, or cry unto the Beneficent, unto whichsoever ye cry (it is the same). His are the most beautiful names. And thou (Muhammad), be not loud-voiced in thy worship nor yet silent therein, but follow a way between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Whether you call on God or on the Merciful One: His are the finest names.\" Pray neither in too loud a voice nor in silence, but between these two extremes. Seek a middle way\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: call upon Allah or call upon Rahman, by whichsoever ye call, His are the excellent names. And shout not thy prayer, nor speak it low, but Seek between these a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Invoke ‘‘Allah’’ or invoke ‘‘the All-beneficent.’’ Whichever [of His Names] you may invoke, to Him belong the Best Names.’ Be neither loud in your prayer, nor murmur it, but follow a middle course between these,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Call upon Allah, or call upon Rahman: by whatever name ye call upon Him, (it is well): for to Him belong the Most Beautiful Names. Neither speak thy Prayer aloud, nor speak it in a low tone, but seek a middle course between.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Invoke Allah or invoke the Most Beneficent (Allah), by whatever name you invoke Him (it is the same), for to Him belong the Best Names. And offer your Salat (prayer) neither aloud nor in a low voice, but follow a way between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Call upon Allah, or call upon the Merciful; whichever (Name) you call upon, to Him belong the Most Beautiful Names' Pray neither loudly nor to quietly, rather, seek a middle course between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Call Him God, or call Him the Most Merciful. Whichever name you use, to Him belong the Best Names.” And be neither loud in your prayer, nor silent in it, but follow a course in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Call upon Allah or call upon the Most Merciful. Whichever [name] you call - to Him belong the best names.\" And do not recite [too] loudly in your prayer or [too] quietly but seek between that an [intermediate] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:110] The Prophet (s) would often say, ‘O God, O Compassionate One’. So they said, ‘He [Muhammad, s] forbids us to worship more than one god, and yet he calls upon another [god] together with Him [God]’. The following was then revealed: Say, to them: ‘Invoke God or invoke the Compassionate One, that is to say, invoke Him by either of these [Names] or call upon Him by saying, ‘O God! O Compassionate One!’, whichever (ayyan is conditional; mā is extra), in other words, whichever of these two [Names], you invoke, is beautiful — this [predicate, ‘beautiful’] is indicated by the following [statement]), to Him, to the One called by these two [Names], belong the Most Beautiful Names’, these two [Names] being from among them; and they [the other Names] are [the following] as [mentioned] in hadīth: God, there is no god except Him, the Compassionate, the Merciful, the King, the Holy, the Peace, the Securer, the Controller, the Mighty, the Compeller, the Sublime, the Creator, the Maker [out of nothing], the Fashioner, the [ever] Forgiving, the Almighty, the Bestower, the Provider, the Deliverer, the Knower, the Seizer, the Extender, the Lowerer, the Raiser, the Glorifier, the Abaser, the Hearer, the Seer, the Arbiter, the Just, the Subtle, the Aware, the Forbearing, the Tremendous, the Forgiver, the Thankful, the High, the Great, the Preserver, the Conserver, the Reckoner, the Majestic, the Generous, the Watcher, the Responsive, the Embracing, the Wise, the Loving, the Glorious, the Resurrector, the Witnessing, the Truth, the Guardian, the Strong, the Firm, the Patron, the Praiseworthy, the Numberer, the Initiator, the Restorer, the Life-giver, the Death-maker, the Living, the Eternal Sustainer, the Originator, the Magnificent, the One, the Single, the Everlasting Refuge, the Powerful, the Omnipotent, the Advancer, the Deferrer, the First, the Last, the Outward, the Inward, the Ruler, Exalted, the Benign, the Relenting, the Avenger, the Pardoning, the Gentle, Master of the Kingdom, One of Majesty and Munificence, the Equitable, the Gatherer, the Independent, the Availing, the Restrainer, the Harming, the Benefactor, the Light, the Guiding, the Innovator, the Enduring, the Inheritor, the Reasonable, the Patient, as reported by al-Tirmidhī. God, exalted be He, says: And do not be loud in your prayer, when you recite [the Qur’ān] therein, lest the idolaters hear you and curse you, as well as the Qur’ān and the One Who has revealed it; nor be silent, do [not] murmur, therein, so that your companions might [be able to hear it and] benefit [therefrom]; but seek between that, loudness and silence, a, middle, way.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "311 (Say) to them, Muhammad: (Cry unto Allah, or cry unto the Beneficent, unto whichsoever ye cry (it is the same). His are the most beautiful names) the most sublime attributes such as knowledge, power, hearing, sight; so call Him by using them. (And thou (Muhammad), be not loud voiced in thy worship) do not be too loud in your recitation of the Qur'an during prayer so that the idolaters do not harm you (nor yet silent therein) such that your Companions cannot hear you, (but follow a way between) a middle ground between loud and silent recitation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلِ } يا أكمل الرسل للمحجوبين الغافلين عن سر سريان الوحدة الذاتية الإلهية في المظاهر كلها والمجالي برمتها: { ٱدْعُواْ ٱللَّهَ } أي: سمُّو الذات الأحدية باسم الله المستجمع لجميع الصفات إجمالاً { أَوِ ٱدْعُواْ ٱلرَّحْمَـٰنَ } أي: سموه باسم الصفات التي اتصفت بها الذات الأحدية تفصيلاً { أَيّاً مَّا تَدْعُواْ } وتسَمُّوا من أسماء الذات والصفات { فَلَهُ } أي: لله المنزله عن سِمَة الكثرة والحدوث مطلقاً، ووصمه الشركة والتعدد رأساً عن { ٱلأَسْمَآءَ ٱلْحُسْنَىٰ } الكاملة الدالة على أحدية ذاته، غايته في الباب أنها باعتبار شؤونه وتجلياته، إذ الاسم والمسمى كلاهما يتحدان عن سقوط الإضافات ورفع التعينات؛ إذ لا يتصور التعدد دون جنابه إلا وهما واعتباراً\n\n\n{ وَ } إذا كان الكل من المسميات راجعة إلى الذات الأحدية بعد رفع التعينات وسقوط الإضافات { لاَ تَجْهَرْ } أيها العارف المتمكن في مقام التوحيد، الراشح فيه بلا تلوين وتقييد ولا تعقل { بِصَلاَتِكَ } وميلك نحو الحق بَوحاً وشطحاً، ولا تقل في حال صحوك إفاقتك كلامَ أرباب السكر والحيرة { وَلاَ تُخَافِتْ بِهَا } أيضاً خيفةً وشحاً على ذوي الاستعداد الاسترشاد { وَٱبْتَغِ } وأختر يا صاحب التمكين { بَيْنَ ذٰلِكَ سَبِيلاً } [الإسراء: 110] مقتصداً معتدلاً مائلاً عن كلا طرفي الإفراط والتفريط؛ إذ الخير في كل الأمور أوسطها وأعدلها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولا تجهرْ } بقراءة صلاتك، بحيث تُسمع المشركين، فإن ذلك يحملهم على السب واللغو فيها، { ولا تُخافت } أي: تُسر { بها } حتى لا تُسمع من خلفك من المؤمنين، { وابتغ بين ذلك سبيلاً } واطلب بين المخافتة والإجهار طريقًا قصدًا، فإنَّ خير الأمور أوسطها\n والتعبير عن ذلك بالسبيل باعتبار أنه طريق يتوجه إليه المتوجهون، ويؤمه المقتدون ليوصلهم إلى المطلوب\n رُوي أن أبا بكر رضي الله عنه كان يخفت، ويقول: أُنَاجِي ربِّي، وَقَدْ عَلِمَ حَاجَتِي\n وعُمَرُ رضي الله عنه كان يجهر، ويقول: أطردُ الشَّيْطَانَ وأُوقِظُ الوَسْنَانَ\n فلما نزلت، أَمَرَ رسولُ الله صلى الله عليه وسلم أبا بَكْرٍ أَنْ يَجْهَر قليلاً، وعمر أن يَخْفِض قليلاً\n وقيل: المعنى: { ولا تجهر بصلاتك } كلها، { ولا تُخافت بها } بأسرها، { وابتغِ بين ذلك سبيلاً } بالمخافتة نهارًا والجهر ليلاً\n وقيل: { بصلاتك } بدعائك\n وذهب قوم إلى أنها منسوخة لزوال علة السب واللغو بإظهار الدين وإخفاء الشرك وبطلانه فالحمد لله على ذلك كما قال تعالى: { وقل الحمدُ لله الذي لم يتخذ ولدًا } كما يزعم اليهود والنصارى وبنو مدلج حيث قالوا: عُزير ابن الله، والمسيح ابن الله، والملائكة بنات الله\n تعالى الله عن قولهم علوًا كبيرًا، { ولم يكن له شريك في الملك } في الألوهية كما تقول الثنوية القائلون بتعدد الآلهة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:23",
      "similarity": 0.7941087872224186
    },
    {
      "verse": "20:103",
      "similarity": 0.7688568909955666
    },
    {
      "verse": "71:8",
      "similarity": 0.2694633448150848
    },
    {
      "verse": "67:13",
      "similarity": 0.24861204921999142
    },
    {
      "verse": "4:148",
      "similarity": 0.24821726844028302
    }
  ]
}