{
  "chapter": "الإسراء",
  "text": "وجعلنا اليل والنهار ءايتين فمحونا ءاية اليل وجعلنا ءاية النهار مبصرة لتبتغوا۟ فضلا من ربكم ولتعلموا۟ عدد السنين والحساب وكل شىء فصلنه تفصيلا",
  "translations": [
    {
      "translation": "We made the night and day two Signs. We blotted out the Sign of the night and made the Sign of the day a time for seeing so that you can seek favour from your Lord and will know the number of years and the reckoning of time. We have made all things very clear.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created night and day as two signs, then We efface the sign of the night, and make the sign of the day resplendent that you may seek the bounty of your Lord, and know the computation of years and numbers. We have expounded most distinctly everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made night and day as two signs. We made the sign of the night devoid of light, and made the sign of the day radiant that you may seek the bounty of your Lord and know the computation of years and numbers. Thus We have expounded everything in detail to keep everything distinct from the other.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the day and night each as evidence (of Our existence). The night is invisible and the day is visible so that you may seek favors from your Lord and determine the number of years and mark the passing of time. For everything We have given a detailed explanation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We created the night and the day as two signs – We therefore kept the sign of the night indistinct, and the sign of the day visible – so that you may seek the munificence of your Lord, and know the calculation of the years, and the accounting; and We have explained all things in detail, distinctively.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have appointed the night and the day as two Ayat (signs). Then, We have obliterated the sign of the night (with darkness) while We have made the sign of the day illuminating, that you may seek bounty from your Lord, and that you may know the number of the years and to count (periods of time). And We have explained everything (in detail) with full explanation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made the night and the day two signs, then We have made the sign of the night to pass away and We have made the sign of the day manifest, so that you may seek grace from your Lord, and that you might know the numbering of years and the reckoning; and We have explained everything with distinctness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed the night and the day as two signs; then We have blotted out the sign of the night, and made the sign of the day to see, and that you may seek bounty from your Lord, and that you may know the number of the years, and the reckoning; and everything We have distinguished very distinctly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appoint the night and the day two portents. Then We make dark the portent of the night, and We make the portent of the day sight-giving, that ye may seek bounty from your Lord, and that ye may know the computation of the years, and the reckoning; and everything have We expounded with a clear expounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the night and the day as two signs. We blotted out the sign of night and made the sign of the day illuminating, so that you may seek the bounty of your Lord and learn to compute the seasons and the years. We have set everything forth in detail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have appointed the night and the day as two signs; then We blurred the sign of the night and made the sign of the day illuminating that ye may seek grace from Your Lord, and that ye may know the number of the years and the reckoning; and everything We have detailed in full details.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the night and the day two signs. Then We faded out the sign of the night, and made the sign of the day lightsome, so that you may seek from your Lord’s bounty and that you may know the number of years and calculation [of time], and We have elaborated everything in detail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the Night and the Day as two (of Our) Signs: the Sign of the Night have We obscured, while the Sign of the Day We have made to enlighten you; that ye may seek bounty from your Lord, and that ye may know the number and count of the years: all things have We explained in detail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have appointed the night and the day as two Ayat (signs etc.). Then, We have made dark the sign of the night while We have made the sign of day illuminating, that you may seek bounty from your Lord, and that you may know the number of the years and the reckoning. And We have explained everything (in detail) with full explanation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed the night and the day as two signs. Then, We blotted out the sign of the night and made the sign of the day to see, so that you seek the bounty of your Lord and that you know the number of years and the reckoning. And We have clearly distinguished everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the night and the day two wonders. We erased the wonder of the night, and made the wonder of the day revealing, that you may seek bounty from your Lord, and know the number of years, and the calculation. We have explained all things in detail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made the night and day two signs, and We erased the sign of the night and made the sign of the day visible that you may seek bounty from your Lord and may know the number of years and the account [of time]. And everything We have set out in detail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:12] And We made the night and the day two signs, [both] indicators of Our power. Then We effaced the sign of the night, extinguishing its light with darkness, so that you might repose therein (the annexation [āyata’layli, ‘the sign of the night’, is explicative), and made the sign of the day sight-giving, in other words, one in which it is possible to see because of the light; that you may seek, therein, bounty from your Lord, by earning [your livelihood], and that you may know, by both [day and night], the number of years and the reckoning, of the times [of the day], and everything, that might be needed, We have detailed very distinctly, We have explained clearly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And we appoint the night and the day two portents) two signs; the reference here is to the sun and the moon. (Then We make dark the portent of the night) the light of the sign of the night, i.e. the moon, (and We make) and leave (the portent of the day) i.e. the sun (sight giving) bright and clear, (that ye may seek bounty from your Lord) the bounty of this worldly life and that of the Hereafter, (and that ye may know) and that you may know through the increase and decrease of the phases of the moon (the computation of the years and the reckoning) how to count days and months; (and everything) the lawful and the unlawful, the commands and prohibitions (have We exposited with a clear expositing) We have clearly explained it in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَمَحَوْنَآ آيَةَ ٱلَّيلِ } قال زيدُ بن علي عليهما السلام المَحو: هو السَّوادُ الذي فِي القَمَرِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال رحمتنا وإشفاقنا { جَعَلْنَا ٱلَّيلَ وَٱلنَّهَارَ آيَتَيْنِ فَمَحَوْنَآ آيَةَ ٱلَّيلِ وَجَعَلْنَآ آيَةَ ٱلنَّهَارِ مُبْصِرَةً } ذا نورٍ وإضاءةٍ { لِتَبْتَغُواْ } وتطلبوا { فَضْلاً } وعطايا ناشئة { مِّن رَّبِّكُمْ } لتعيشوا بها، وتقوّموا أمزجتكم منها { وَلِتَعْلَمُواْ } بتجدد الملوين { عَدَدَ ٱلسِّنِينَ وَٱلْحِسَابَ } المتداولة بينكم في معاملتكم وجرائتكم وتجارتكم { وَ } بالجملة: في { كُلَّ شَيْءٍ } تحتاجون إليه في أمور معاشكم ومعادكم { فَصَّلْنَاهُ } أي: بيّناه وأوضحناه لكم، وعلّمنا طريق وصولكم ونيلكم إليها { تَفْصِيلاً } [الإسراء: 12] وتبييناً واضحاً لائحاً، فعليكم أن تتخذوني وكيلاً في جميع حوائجكم الدنيوية والأخروية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والإضافة في قوله: { آية الليل } و { آية النهار }: بيانية، أي: فمحونا الآية التي هي الليل، وجعلنا الآية التي هي النهار مبصرة\n وإذا أريد بالآيتين الشمس والقمر تكون للتخصيص، أي: وجعلنا نيرى الليل والنهار آيتين، أو: وجعلنا الليل والنهار ذوي آيتين\n\n",
      "translations": []
    }
  ]
}