{
  "chapter": "الإسراء",
  "text": "ولقد ءاتينا موسى تسع ءايتۭ بينت فسـل بنى اسرءيل اذ جاءهم فقال له فرعون انى لاظنك يموسى مسحورا",
  "translations": [
    {
      "translation": "We gave Musa nine Clear Signs. Ask the tribe of Israel about when he came to them and Pharaoh said to him, 'Musa, I think you are bewitched.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses nine clear signs; so ask the children of Israel. When (Moses) came to them the Pharaoh said: \"I think, O Moses, you have been deluded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We granted Moses nine clear signs. Ask the Children of Israel about that: when these signs came forth, Pharaoh said to him: \"Moses, I think that you are bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Moses We gave nine illustrious miracles. Ask the Israelites; Moses came to them. The Pharaoh said to him,\"Moses, I believe that you are bewitched\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Moosa nine clear signs, therefore ask the Descendants of Israel when he came to them – in response Firaun said, “O Moosa – I think you are under a magic spell.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa nine clear signs. Ask then the Children of Israel, when he came to them, then Fir`awn said to him: \"O Musa! I think you are indeed bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave Musa nine clear signs; so ask the children of Israel. When he came to them, Firon said to him: Most surely I deem you, O Musa, to be a man deprived of reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses nine signs, clear signs. Ask the Children of Israel when he came to them, and Pharaoh said to him, 'Moses, I think thou art bewitched.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We gave unto Moses nine tokens, clear proofs (of Allah's Sovereignty). Do but ask the Children of Israel how he came unto them, then Pharaoh said unto him: Lo! I deem thee one bewitched, O Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did indeed give Moses nine manifest signs; you can enquire from the Children of Israel. When he came to them, Pharaoh said to him, \"Moses, I can see that you are bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed unto Musa nine manifest signs - ask thou the Children of Israel--so when he came unto them, Fir'awn said unto him, verily imagine thee, O Musa! enchanted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Moses nine manifest signs. So ask the Children of Israel. When he came to them, Pharaoh said to him, ‘O Moses, indeed I think you are bewitched.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Moses We did give Nine Clear Signs: As the Children of Israel: when he came to them, Pharaoh said to him: \"O Moses! I consider thee, indeed, to have been worked upon by sorcery!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave to Musa (Moses) nine clear signs. Ask then the Children of Israel, when he came to them, then Fir'aun (Pharaoh) said to him: \"O Musa (Moses)! I think you are indeed bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Moses We gave nine clear signs. Ask the Children of Israel about how he came to them. When Pharaoh said to him: 'Moses, I think you are bewitched.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses nine clear signs—ask the Children of Israel. When he went to them, Pharaoh said to him, “I think that you, Moses, are bewitched.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had certainly given Moses nine evident signs, so ask the Children of Israel [about] when he came to them and Pharaoh said to him, \"Indeed I think, O Moses, that you are affected by magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:101] And verily We gave Moses nine manifest signs, clear [signs], namely, [those of] the hand, the staff, the flood, the locusts, the lice, the frogs, the blood and the obliteration [of their possessions, cf. Q. 10:88], the years [of dearth] and scarcity of fruits [cf. Q. 7:130]. Ask, O Muhammad (s), the Children of Israel, about this (a [rhetorical] question meant as an affirmation for the idolaters of your sincerity; or [it means that] We said to him [Muhammad, s], ‘Ask’; a variant reading has the past tense [fa-sā’ala, ‘and he asked’]), when he came to them, Pharaoh said to him, ‘O Moses, I truly think that you are bewitched’, duped, your mind deceived.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "310 (And verily We gave unto Moses nine tokens clear proofs (of Allah's Sovereignty)) nine clear signs: the hand, the staff, the flood, the locusts, the lice, blood, the years of drought and the disappearance of properties. (Do but ask the Children of Israel) 'Abdullah Ibn Salam and his followers (how he) Moses (came unto them, then Pharaoh said unto him: Lo! I deem thee one bewitched, Moses) I think that you are possessed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ آتَيْنَا مُوسَىٰ تِسْعَ آيَاتٍ بَيِّنَاتٍ } قال: الإِمامُ أَبو الحُسين زيد بن علي عليهما السَّلامُ: وهي الطُّوفانُ، والمَوتُ والجَرادُ، والقمَّلُ، والضَّفَادعُ، والدَّمُ، ولِسَانُهُ وعَصاهُ والبَحرُ\n ويقالُ الطُّوفانُ، والجَرادُ، والقُمّلُ، والضَّفادعُ، والدَّمُ، والعَصا، والسِنينُ ونَقصٍ منَ الثَّمراتِ، وَيَدُّهُ\n ويقالُ [الطُّوفان] والجَرادُ، والقُمّلُ، والضَّفادعُ، والدَّمُ، وعَصَاه، ويَدُّه، قال الإِمام زيد بن علي عليهما السلام: وكانتْ عَصا مُوسى عَليهِ السَّلامُ مِن عَوسجٍ، وَلَم تُسَخرْ لأحدٍ بَعدَهُ\n وكان اسمُها مَاسا\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah: {And We have certainly given Moses nine clear signs} Abu al-Husayn Zayd ibn Ali, peace be upon him, said: These are the flood, and death, and locusts, and lice, and frogs, and blood, and his tongue and his staff, and the sea.\n The tornado, the locust, the lice, the frog, the blood, the stick, the years and the lack of fruits, and his hand.\n\nIt is said that {الطُّوفان} and the locust, and the mosquito, and the frog, and the blood, and his stick, and his hand, said Imam Zaid bin Ali peace be upon them: The staff of Moses peace be upon him was from {عَوسج}, and was not mocked by anyone after him.\n\n\nHer name was Masa.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قل لو أنتم تملكون خزائن رحمة ربي إذاً لأمسكتم } لوقوفكم مع صفات نفوسكم التي من لوازمها الشح الجبلي لكون إدراكها مقصوراً على ما يدرك بالحسّ من الأمور المادية المحصورة واحتجابها عن البركات الغير المتناهية والرحمة الواسعة الغير المنقطعة التي لا تدرك إلا عند اكتحال البصيرة بنور الهداية فتخشى نفادها وانقطاعها { تسع آيات بيّنات } مرّت الإشارة إليها في سورة الحجر\n { وبالحق أنزلناه } أي: ما أنزلنا القرآن إلا بعد زوال بشرية النبي صلى الله عليه وسلم بالكلية في مقام الفناء وانتفاء الحدثان عن وجه القدم وانقشاع ظلمة الإمكان عن سبحات الوجه الواجب الباقي بالفرق الثاني ليكون له محل وجودي فما كان إنزاله إلا ظهور أحكام التفاصيل من عين الجمع على المظهر التفصيلي فكان إنزاله بالحق من الحق على الحق ونزوله بالحق على هذا التأويل هو كما يقال: نزل بكذا إذا حل به، على أن تكون الباء الثانية للظرفية كقولك: نزلت ببغداد والولى للحال أي: ملتبساً بالحق على معنيين إما بالحق الذي هو نقيض الباطل أي: بالحقيقة والحكمة، وإما بالحق الذي هو الله تعالى أي: أنزل على صفته وهو الحق { وقرآناً فرقناه } على حسب ظهور استعدادات المظاهر المقتضية لقبوله بحسب الأحوال والمصالح والصفات كما أشرنا إليه في قوله:\n",
      "translations": [
        {
          "translation": "\n\n{Say, \"If you possessed the stores of the mercy of my Lord, then you would withhold out of fear of spending.\"} {But you are stingy because of your love of money - {even though it is} the mountain {that} you {claim to} own. So fear Allah and give up what remains {of your due} rights. {And do not fear} the reduction of your wealth or your children's wealth, {for} Allah {is the} Possessor of {both} {and} He {is the} best of {those who} inherit.} {The nine {clear} verses} {have} passed, {and} the reference {to them} {in} {the} Sura {of} Al-Hajj {has} gone.\n {And with truth We have sent it down} that is, We have not sent down the Quran except after the disappearance of human prophets with full authority at the station of {fanā'} and the extinction of the two witnesses {'an wajh al-qadam} and the rise of darkness of impossibility {'an sūbḥāt al-wajh} from the remaining necessary {al-bāqī bi-l-farq al-thānī} so that it has a place of existence, so its descent was not but the appearance of the details of the rulings from the eye of the gathering to the detailed appearance, so its descent was with truth upon truth and its descent with truth upon this interpretation is as it is said: {He descended with such-and-such} when it became applicable by it.\n, The second letter of the alphabet is said to be like your saying: I came down to Baghdad and the ruler is still {illegible} meaning either with the truth which is the opposite of falsehood meaning: reality and wisdom.,\n\nAnd if it is according to the truth that is God, that is, He has revealed Himself and His Quran {clearly} according to the apparent readiness of the conditions necessary for accepting it, according to the circumstances and interests and attributes, as we have mentioned to him in His saying:",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة كفورية الإنسان وفتوريته: أنا { لَقَدْ آتَيْنَا } من سعة رحمتنا وكمال حولنا وقدرتنا { مُوسَىٰ } المؤيد من عندنا { تِسْعَ آيَاتٍ } أي: معجزاتٍ { بَيِّنَاتٍ } واضحاتٍ دالةٍ على صدقة في رسالته وحقيته في نوبته، وهي: العصا واليد البيضاء والجراد والقمل والضفادع ةالدم، وانفجار الماء من الحجر وانفلاق الحر ونتق الجبل فوقهم\n\n\n\n\nوإن شئت يأ أكمل الرسل زيادة إيضاح وإلزامِ المشركين اليهود { فَسْئَلْ بَنِي إِسْرَائِيلَ } أي: بقية أخبارهم؛ ليخبروك وقت { إِذْ جَآءَهُمْ } موسى { فَقَالَ لَهُ فِرْعَونُ } بعدما رأى منه ما رأى من الخوارق بدل من الإيمان الإطاعة { إِنِّي لأَظُنُّكَ يٰمُوسَىٰ } بعدما جئت بسحرٍ عظيمٍ وكيدٍ كبيرٍ، وهو وإن كانَ من العقل والدارية: اعتقدُك { مَسْحُوراً } [الإسراء: 101] مجنوناً مخبطاً مختلّ العقل بادعائك الرسالة والنبوة من خالق السماء ونزول الملَك والمصحف إليك من عنده مع انسداد الطرق وانعدام السبل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال في الأساس: ثبره الله: أهلكه هلاكًا دائمًا، لا ينتعش بعده، ومن ثَم يدعو أهلُ النار: واثبوراه\n وما ثبرك عن حاجتك: ما ثبطك عنها\n وهذا مثبَرُ فلانة: لمكان ولادتها، حيث يثبرها النفاس\n وفي القاموس: الثبر: الحبْسُ والمنع، كالتثبير والصرف عن الأمر وعن الحبيب، واللعن والطرد\n والثبور: الهلاك والويل والإهلاك\n هـ\n و { إذا جاءهم }: إما متعلق بآياتنا، أو بقلنا محذوف\n يقول الحقّ جلّ جلاله: { ولقد آتينا موسى تسع آيات بيناتٍ } واضحات الدلالة على نبوته، وصحة ما جاء به من عند الله\n وهي: العصا، واليد، والجراد، والقُمل، والضفادع، والدم، والطوفان، والسنون، ونقص الثمرات\n وقيل: انفجار الماء من الحجر، ونتق الطور، وانفلاق البحر، بدل الثلاث\n وفيه نظر فإن هذه الثلاث لم تكن لفرعون، وإنما كانت بعد خروج سيدنا موسى عليه السلام\n وعن صفوان بْن عسال: أن يهوديًا سأل النبي صلى الله عليه وسلم عنها فقال:\n\n \" ألاَّ تُشْرِكُوا به شَيْئًا، ولا تَسْرقُوا، ولا تَزْنُوا، ولا تَقْتُلُوا النَّفس التِي حَرَّم اللهُ إلاَّ بالحَقِّ، ولا تَسْحُروا، ولا تأكُلُوا الرِّبَا، ولا تمشوا ببريء إلى ذي سُلْطَانٍ ليَقْتُلَهُ، ولا تَقذفُوا المُحْصَنَة، ولا تَفِرُّوا مِنَ الزَّحْفِ، وعليكم، خاصَّة اليهود، ألاَّ تَعْدُوا في السَّبْتِ \" \n\nفقبَّل اليهوديُ يَدَه ورجْلَه - عليه الصلاة والسلام\n قلت: ولعل الحق تعالى أظهر لهم تسعًا، وكلفهم بتسع، شكرًا لما أظهر لهم، فأخبر - عليه الصلاة والسلام - السائل عما كلفهم به لأنه أهم، وسكت عما أظهر لهم لأنه معلوم\n وإنما قبَّل السائلُ يده لموافقته لما في التوراة، وقد علم أنه ما علمه رسول الله صلى الله عليه وسلم إلا بالوحي، وقوله عليه الصلاة والسلام:\n\n \" وعليكم، خاصة اليهود، ألا تعدوا \" \n\n، حكم مستأنف زائد على الجواب، ولذلك غيَّر فيه سياق الكلام\n قال تعالى: { فسلْ بني إسرائيل } أي: سل، يا محمد، بني إسرائيل المعاصرين لك عما ذكرنا من قصة موسى لتزداد يقينا وطمأنينة، أو: ليظهر صدقك لعامة الناس، أو: قلنا لموسى: سل بني إسرائيل مِن فرعون، أي: اطلبهم منه ليرسلَهم معك، أو سل بني إسرائيل أن يعضدوك ويكونوا معك\n ويؤيد هذا: قراءة رسول الله صلى الله عليه وسلم \" فَسَال \" على صيغة الماضي، بغير همز، وهي لغة قريش\n { إِذْ جاءهم } أي: آتينا موسى تسع آيات حين جاءهم بالرسالة، أو قلنا له: سل بني إسرائيل حين جاءهم بالوحي\n { فقال له فرعونُ } حين أظهر له ما آتيناه من الآيات، وبلغة ما أرسل به: { إِني لأظنك يا موسى مسحورًا } أي: سُحرت فتخبط عقلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:30",
      "similarity": 0.6800015466970071
    },
    {
      "verse": "27:48",
      "similarity": 0.39106193334683453
    },
    {
      "verse": "27:12",
      "similarity": 0.38897632834190615
    },
    {
      "verse": "18:25",
      "similarity": 0.37042533889538265
    },
    {
      "verse": "38:23",
      "similarity": 0.28715822199802726
    }
  ]
}