{
  "chapter": "الإسراء",
  "text": "من اهتدى فانما يهتدى لنفسه ومن ضل فانما يضل عليها ولا تزر وازرة وزر اخرى وما كنا معذبين حتى نبعث رسولا",
  "translations": [
    {
      "translation": "Whoever is guided is only guided to his own good. Whoever is misguided is only misguided to his detriment. No burden-bearer can bear another's burden. We never punish until We have sent a Messenger.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who finds the right path does so for himself; and he who goes astray does so to his own loss; and no one who carries a burden bears another's load. We never punish till We have sent a messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who follows the Right Way shall do so to his own advantage; and he who strays shall incur his own loss. No one shall bear another's burden. And never do We punish any people until We send a Messenger (to make the Truth distinct from falsehood).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who follows guidance does so for himself and one who goes astray does so against his soul. No one will suffer for the sins of others. We have never punished anyone without sending them Our Messenger first.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever came to guidance, has come for his own good; and whoever went astray, has strayed for his own ruin; and no burdened soul will bear another’s burden; and We never punish until We have sent a Noble Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever goes right, then he goes right only for the benefit of himself. And whoever goes astray, then he goes astray at his own loss. No one laden with burdens can bear another's burden. And We never punish until We have sent a Messenger (to give warning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever goes aright, for his own soul does he go aright; and whoever goes astray, to its detriment only does he go astray: nor can the bearer of a burden bear the burden of another, nor do We chastise until We raise an apostle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever is guided, is only guided to his own gain, and whosoever goes astray, it is only to his own loss; no soul laden bears the load of another. We never chastise, until We send forth a Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever goeth right, it is only for (the good of) his own soul that he goeth right, and whosoever erreth, erreth only to its hurt. No laden soul can bear another's load, We never punish until we have sent a messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever chooses to follow the right path, follows it for his own good; and whoever goes astray, goes astray at his own peril; no bearer of burdens shall bear the burdens of another. Nor do We punish until We have sent forth a messenger to forewarn them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever is guided, it is only for himself that he is guided and whosoever Strayeth, it is only against the same that he strayeth; and a burthen-bearer beareth not the burthen of anot her. And We have not been tormentors until We had raised an apostle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is guided is guided only for [the good of] his own soul, and whoever goes astray, goes astray only to its detriment. No bearer shall bear another’s burden. We do not punish [any community] until We have sent [it] an apostle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who receiveth guidance, receiveth it for his own benefit: who goeth astray doth so to his own loss: No bearer of burdens can bear the burden of another: nor would We visit with Our Wrath until We had sent an messenger (to give warning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever goes right, then he goes right only for the benefit of his ownself. And whoever goes astray, then he goes astray to his own loss. No one laden with burdens can bear another's burden. And We never punish until We have sent a Messenger (to give warning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever is guided is only guided for his own self, and whosoever goes astray it is only against it. No soul shall bear another's burden. Nor do We punish until we have sent a Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is guided—is guided for his own good. And whoever goes astray—goes astray to his detriment. No burdened soul carries the burdens of another, nor do We ever punish until We have sent a messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is guided is only guided for [the benefit of] his soul. And whoever errs only errs against it. And no bearer of burdens will bear the burden of another. And never would We punish until We sent a messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:15] Whoever is guided, is guided only to [the good of] his own soul, because the reward of his guidance will be for him; and whoever goes astray, goes astray only to its [his soul’s] detriment, because the sin thereof will be held against it. No burdened, [no] sinful, soul shall bear the burden of another, soul. And We never chastise, anyone, until We have sent a messenger, to make clear to him that which is his obligation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whosoever goeth right) whosoever believes, (it is only for (the good of) his own soul that he goeth right) the reward for his belief will go to himself, (and whosoever erreth) and whoever disbelieves, (erreth only to its hurt) the punishment for his disbelief will be against his soul. (No laden soul can bear another's load) no soul laden with sin shall bear another person's sins with a good disposition of the soul, but rather she will bear them through retaliation; it is also said that this means: no soul will be punished for the sins committed by another soul; and it is also said that this means: no soul shall be chastised for the sins of another. (We never punish) a folk by causing their destruction (until We have sent) to them (a messenger) in order to establish a proof against them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَزِرُ وَازِرَةٌ } معناه آثِمةٌ { وِزْرَ أُخْرَىٰ } يعني إِثمَ أُخرى\n أَثِمتَهُ، وَلَمْ تَأْثَمْهُ الأَخرى مَنهُما\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, \"There is no bearer of burdens {wazirah} {wazirah}\", meaning that there is no other sin.\n\nYou committed the sin, and the other did not commit the sin from among them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فبين لها غيرها { ولا تزر وازرة وِزْرَ أخرى } لرسوخ هيئة ما فعلته فيها وصيرورتها ملكة لازمة دون الذي فعل غيرها\n ولم يعرض لها منه شيء\n وإنما يتعذب من يتعذب بالهيئات التي فيه لا من خارج\n { وما كنَّا مُعَذبين حتى نَبْعث رسولاً } رسول العقل بإلزام الحجة وتمييز الحق والباطل\n ألا ترى أن الصبي والسفيه غير مكلفين؟\n أو رسول الشرع لظهور ما في الاستعداد من الخير والشرّ والسعادة والشقاوة بسببه ومقابلته بالإقرار والإنكار\n فإن المستعد للكمال يتحرك ما فيه بالقوة عند سماع الدعوة فيشتاق ويطلب متلقياً لها بالإقرار والقبول لما يدعوه إليه لمناسبته إياه وقربه وغير المستعد ينكر ويعاند لمنافاته لما يدعوه إليه ويعده",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ألاَّ على وجه الإرشاد والتنبيه { وَ } كذا { مَن ضَلَّ } عن طريق الحق\n وانحرف عن مسلك التوحيد بترك المأمورات\n وارتكاب المنهيات { فَإِنَّمَا يَضِلُّ عَلَيْهَا } أي: إنما لا يعود ويرجع وبال ضلالها إلاَّ على نفسها بلا سرايةٍ إلى غيرها\n إلاَّ تسبباً وإضلالاً\n\n\n{ وَ } بالجملة: { لاَ تَزِرُ } ولا تحمل نفس { وَازِرَةٌ } آثمة عاصية { وِزْرَ } نفس { أُخْرَىٰ } مثلها\n بل كل نفسٍ رهينة ما كسبت\n سواء كان خيراً أو شراً { وَ } بعدما قرر سبحانه أن الهداية والضلالة لا تسري إلى الغير\n أراد أن يبين سبحانه أن الأخذ على الضلال إنما هو بعد الإرشاد والتنبيه\n فقال: { مَا كُنَّا مُعَذِّبِينَ } لأهل الضلال { حَتَّىٰ نَبْعَثَ } ونرسل إليهم { رَسُولاً } [الإسراء: 15] منهم\n حين ظهر عليهم علامات الفسوق والعصيان\n وأمارات الضلال والطغيان\n ليبين لهم طريق الهداية\n ويرغبهم إليها\n ويجنبهم عن الضلال\n وينفرهم عنها\n\n\nوبعد بعثنا وإرسالنا\n إن لم يقبلوا قول الرسل\n ولم يمتثلوا بما أُمروا على ألسنتهم\n ونُهوا عليها\n بل أصروا على ما هم عليه من الضلال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { مَن اهتدى } وآمن بالله وبما جاءت به الرسل { فإِنما يهتدي لنفسه } لأن ثواب اهتدائه له\n لا يُنجي اهتداؤه غيره\n { ومن ضلَّ } عن طريق الله { فإِنما يضلُّ عليها } لأن إثم إضلاله على نفسه\n لا يضر به غيره في الآخرة { ولا تزر } أي: لا تحمل نفس { وازرةٌ } آثمة { وِزرَ } نفس { أخرى } أي: ذنوب نفس أخرى\n بل إنما تحمل وزرها\n إلا من كان إمامًا في الضلالة\n فيحمل وزره ووزر مَن تبعه\n على ما يأتي في آية أخرى:\n[العنكبوت: 13]\n ومن كمال عدله تعالى: أنه لا يُعذِّب حتى يُنذر ويُعذر على ألسنة الرسل\n كما قال تعالى: { وما كنا مُعذبين } أحدًا في الدنيا ولا في الآخرة { حتى نبعث رسولاً } يُبين الحجج ويمهد الشرائع\n ويلزمهم الحجة\n وفيه دليل على أن لا حُكم قبل الشرع\n بل الأمر موقوف إلى وروده\n فمن بلغته دعوته\n وخالف أمره\n واستكبر عن أتباعه\n عذبناه بما يستحقه\n وهذا أمر قد تحقق بإرسال آدم عليه السلام ومن بعده من الأنبياء الكرام - عليهم السلام - في جميع الأمم\n قال تعالى:\n[النحل: 36]\n\n[فاطر: 24]\n فإن دعوتهم إلى الله قد انتشرت\n وعمت الأقطار\n واشتهرت\n انظر إلى قول قريش الذين لم يأتهم نبي بعد إسماعيل عليه السلام:\n[ص: 7] فإنه يُفهم منه أنهم سمعوه في الملة الأولى\n فمن بلغته دعوة أحد منهم\n بوجه من الوجوه فقصَّر\n فهو كافر مستحق للعذاب\n فلا تغتر بقول كثير من الناس بنجاة أهل الفترة\n مع إخبار النبي صلى الله عليه وسلم أن آباءهم\n الذين مضوا في الجاهلية\n في النار\n وأن ما يدحرج من الجُعَل\n خير منهم\n إلى غير ذلك من الأخبار\n قاله البقاعي\n وقال الإمام أبو عبد الله الحليمي - أحد أجلاء الشافعية\n وعظماء أئمة الإسلام - في أول منهاجه\n في باب: \" من لم تبلغه الدعوة \": وإنما قلنا: إن من كان منهم عاقلاً مميزًا إذا رأى ونظر\n إلا أنه لا يعتقد دينًا فهو كافر لأنه\n وإن لم يكن سمع دعوة نبينا محمد صلى الله عليه وسلم\n فلا شك أنه سمع دعوة أحد من الأنبياء قبله\n على كثرتهم وتطاول أزمان دعوتهم\n ووفور مُددِ الذين آمنوا واتبعوهم\n والذين كفروا بهم وخالفوهم\n فإنَّ الخبر قد يبلغ على لسان المخالف\n كما يبلغ على لسان الموافق\n وإذا سمع آيَّةَ دعوة كانت إلى الله تعالى\n فترك أن يستدل بعقله\n كان مُعْرِضًا عن الدعوة فكفر\n والله أعلم\n وإن أمكن أن يكون لم يسمع قط بدين\n ولا بدعوة نبي\n ولا عرف أن في العالم من يُثبت إلهًا\n وما نرى أن ذلك يكون\n فأمره على الاختلاف\n يعني: عند من يُوجب الإيمان بمجرد العقل\n ومن لا يُوجبه إلا بانضمام النقل\n\nهـ\n وقال الزركشي\n في آخر باب النيات\n من شرحه على المنهاج: وقد أشار الشافعي إلى عسر تصور عدم بلوغ الدعوة\n حيث قال: وما أظن أحدًا إلا بلغته الدعوة\n إلا أن يكون قوم من وراء النهر\n وقال الدميري: وقال الشافعي: ولم يبق أحد لم تبلغه الدعوة\n انتهى على نقل شيخ شيوخنا سيدي عبد الرحمن الفاسي رضي الله عنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:38",
      "similarity": 0.7649730305564962
    },
    {
      "verse": "20:29",
      "similarity": 0.7029816176714853
    },
    {
      "verse": "75:11",
      "similarity": 0.6457268279852202
    },
    {
      "verse": "20:100",
      "similarity": 0.6187998123412585
    },
    {
      "verse": "94:2",
      "similarity": 0.6028324889839447
    }
  ]
}