{
  "chapter": "الإسراء",
  "text": "وقلنا منۢ بعده لبنى اسرءيل اسكنوا۟ الارض فاذا جاء وعد الءاخرة جئنا بكم لفيفا",
  "translations": [
    {
      "translation": "We said to the tribe of Israel after that, 'Inhabit the land and, when the promise of the Next World comes, We will produce you as a motley crowd.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After this We told the children of Israel: \"Dwell in the land. When the promise of reckoning comes, We shall bring you together from a motley crowd.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and thereafter We said to the Children of Israel: \"Now dwell in the land, but when the promised time of the Hereafter comes, We shall bring you all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We told the Israelites after this to settle in the land until Our second promise will come true. We would then gather them all together (on the Day of Judgment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And after him, We said to the Descendants of Israel, “Reside in this land – then when the promise of the Hereafter comes, We will bring you all huddled together.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said to the Children of Israel after him: \"Dwell in the land, then, when the final and the last promise comes near, We shall bring you altogether as mixed crowd.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said to the Israelites after him: Dwell in the land: and when the promise of the next life shall come to pass, we will bring you both together in judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said to the Children of Israel after him, 'Dwell in the land; and when the promise of the world to come comes to pass, We shall bring you a rabble.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said unto the Children of Israel after him: Dwell in the land; but when the promise of the Hereafter cometh to pass We shall bring you as a crowd gathered out of various nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter, We said to the Israelites, \"Dwell in the land. When the promise of the Hereafter comes to be fulfilled, We shall assemble you all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said, after him, unto the Children of Isra'l: dwell on the earth, then when there cometh the promise of the Hereafter, We shall bring you as a crowd.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After him We said to the Children of Israel, ‘Take up residence in the land, and when the occasion of the other [promise] comes, We shall gather you in mixed company.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said thereafter to the Children of Israel, \"Dwell securely in the land (of promise)\": but when the second of the warnings came to pass, We gathered you together in a mingled crowd.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said to the Children of Israel after him: \"Dwell in the land, then, when the final and the last promise comes near [i.e. the Day of Resurrection or the descent of Christ ['Iesa (Jesus), son of Maryam (Mary) on the earth]. We shall bring you altogether as mixed crowd (gathered out of various nations). [Tafsir Al-Qurtubi, Vol. 10, Page 338]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thereafter We said to the Children of Israel: 'Dwell in the land. When the promise of the Everlasting Life comes We shall bring you all together'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After him, We said to the Children of Israel, “Inhabit the land, and when the promise of the Hereafter arrives, We will bring you all together.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said after Pharaoh to the Children of Israel, \"Dwell in the land, and when there comes the promise of the Hereafter, We will bring you forth in [one] gathering.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:104] And after him We said to the Children of Israel, ‘Dwell in the land; but when the promise of the Hereafter, namely, the Hour, comes to pass, We shall bring you [gathered] in mixed company’, all together, you and them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We said unto the Children of Israel after him) after his destruction: (Dwell in the land) the land of Jordan and Palestine; (but when the promise of the Hereafter) when resurrection after death; and it is also said that this means: when Jesus son of Mary descends (cometh to pass we shall bring you as a crowd gathered out of various nations.)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جِئْنَا بِكُمْ لَفِيفاً } يعني مِن كُلِّ قَومٍ مِنْ هَا هُنَا ومِنْ هَا هنا\n ويقال جَميعٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {We will come to you with your host} [means] from every people, some from here and some from there.\n All of them are said",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهو التوراة { ٱسْكُنُواْ ٱلأَرْضَ } التي أراد فرعون أن يستفزكم منها بالقهر والغلبة\n آمنين صالحين مؤمنين بما أرسل إليكم وأنزل عليكم\n عاملين بمقضتى أوامرنا ونواهينا { فَإِذَا جَآءَ وَعْدُ ٱلآخِرَةِ } وقيام الساعة { جِئْنَا بِكُمْ لَفِيفاً } [الإسراء: 104] ملتفين مختلطين سعداؤكم مع أشقياءكم\n فنميز بينكم\n وندخلكم منزل الشقاوة والسعادة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { جئنا بكم لفيفًا } مختلطين إياكم وإياهم\n ثم نحكم بينكم ونميز سعداءكم من أشقيائكم\n واللفيف: الجماعات من قبائل شتى\n والله تعالى أعلم\n  الإشارة: لا ينفع في أهل الحسد والعناد ظهور معجزة ولا آية\n ولا يتوقف عليها من سبقت له العناية\n لكنها تزيد تأييدًا\n وطمأنينة لأهل اليقين\n وتزيد نفورًا وعنادًا\n لأهل الحسد من المعاندين\n وبالله التوفيق\n ولما ذكر آية موسى ذكر آية نبينا محمد عليه الصلاة والسلام وهو القرآن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:16",
      "similarity": 0.8943084805888668
    },
    {
      "verse": "75:29",
      "similarity": 0.8315336979093741
    },
    {
      "verse": "7:105",
      "similarity": 0.1590738560055364
    },
    {
      "verse": "20:47",
      "similarity": 0.15471056436444527
    },
    {
      "verse": "2:83",
      "similarity": 0.14796399691674592
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/17:104.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/17:104.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:104.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}