{
  "chapter": "الإسراء",
  "text": "ربكم اعلم بما فى نفوسكم ان تكونوا۟ صلحين فانه كان للاوبين غفورا",
  "translations": [
    {
      "translation": "Your Lord knows best what is in your selves. If you are righteous, He is Ever-Forgiving to the remorseful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows what is in your heart. If you are righteous, then He is indeed forgiving to those who turn (to Him) in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is best aware of what is in your hearts. If you are righteous, He will indeed forgive those who relent and revert (to serving Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows what is in your souls. If you would be righteous, know that He is All-forgiving to those who turn to Him in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is Well Aware of what is in your hearts; if you are worthy, then indeed He is Oft Forgiving for those who repent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best what is in your souls. If you are righteous, then, verily, He is Ever Most Forgiving to those who turn to Him in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best what is in your minds; if you are good, then He is surely Forgiving to those who turn (to Him) frequently.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows very well what is in your hearts if you are righteous, for He is All-forgiving to those who are penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is Best Aware of what is in your minds. If ye are righteous, then lo! He was ever Forgiving unto those who turn (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best what is in your hearts; if you are righteous, He is most forgiving to those who constantly turn to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is the Best Knower of that which is in your souls; if ye have been righteous, then He is unto thee Oftreturning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best what is in your hearts. Should you be righteous, He is indeed most forgiving toward penitents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knoweth best what is in your hearts: If ye do deeds of righteousness, verily He is Most Forgiving to those who turn to Him again and again (in true penitence).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best what is in your inner-selves. If you are righteous, then, verily, He is Ever Most Forgiving to those who turn unto Him again and again in obedience, and in repentance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows very well what is in your hearts. If you are good, He is forgiving to those who are penitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best what is in your minds. If you are righteous—He is Forgiving to the obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is most knowing of what is within yourselves. If you should be righteous [in intention] - then indeed He is ever, to the often returning [to Him], Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:25] Your Lord knows best what is in your hearts, [in the way] of what may be concealed of dutifulness or disobedience [to parents]. If you are righteous, obedient to God, then truly, to those who are penitent, those who return to obedience of Him, He is Forgiving, of any slip that might have issued on their part regarding their duty to the parents, so long as they do not conceal [within themselves] any disrespect [towards them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Your Lord is best aware of what is in your minds) what is in your hearts of goodness and kindness towards the parents. (If ye are righteous) if you are dutiful towards your parents, (then lo! He was ever Forgiving unto those who turn (unto Him)) He forgives those who repent. This verse was revealed about Sa'd Ibn Abi Waqqas.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِنَّهُ كَانَ لِلأَوَّابِينَ غَفُوراً } قال الإِمامُ الشهيدُ زيد بن علي عليهما السلام: الأَوابُ: الذي يُذنِبُ سِراً ويَتوبُ سِراً\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah, {Indeed, it is for the repentant} Imam al-Shahid Zayd ibn Ali, peace be upon them, said: The repentant: the one who commits a sin secretly and repents secretly.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويقبل توبتكم { إِن تَكُونُواْ صَالِحِينَ } مصلحين ما فوّتم وأفسدتم على نفوسكم من حق تعظيمهما وتوقيرهما { فَإِنَّهُ } سبحانه من كمال جوده وفضله { كَانَ لِلأَوَّابِينَ } الرجَّاعين إليه سبحانه\n النادمين بما صدر عنهم من المعاصي\n سيما ما يتلعق بعقوق الوالدين { غَفُوراً } [الإسراء: 25] يغفرهم ويتجاوز عنهم\n\n\n{ وَ } لا تقتصر أيها الولد على تعظيم والديك فقط\n بل عليك تعظيم كل من ينتمي إليك من قبلهما",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِن تكونوا صالحين } قاصدين للصلاح\n أو طائعين لله\n { فإِنه كان للأوابين }: التوابين\n أو الرجّاعين إلى طاعته\n { غفورًا } لما فرط منهم عند حرج الصدر من إذاية ظاهرة أو باطنة\n أو تقصير في حقهما\n ويجوز أن يكون عامًا لكل تائب\n ويندرج فيه الجاني على أبويه اندراجًا أوليًا\n والله تعالى أعلم\n الإشارة: كل ما أوحى الله تعالى به في حق والدي البشرية\n يجري مثله في والد الروحانية\n وهو الشيخ\n ويزيد لأنه أوكد منه لأنَّ أب البشرية كان السبب في خروجه إلى دار الدنيا\n معرضًا للعطب أو السلامة\n وأب الروحانية كان سببًا في خروجه من ظلمة الجهل إلى نور العلم والوصلة\n وهما السبب في التخليد في النعيم الذي لا يفنى ولا يبيد\n وقد تقدم في سورة النساء تمام هذه الإشارة\n والله تعالى أعلم\n ثمَّ أمر بالإحسان إلى القرابة لقربهما من الوالدين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "88:25",
      "similarity": 0.8417788857301538
    },
    {
      "verse": "78:39",
      "similarity": 0.7798685765711584
    },
    {
      "verse": "38:49",
      "similarity": 0.7627639463480717
    },
    {
      "verse": "13:29",
      "similarity": 0.7320794602899209
    },
    {
      "verse": "78:22",
      "similarity": 0.7195046344308433
    }
  ]
}