{
  "chapter": "الإسراء",
  "text": "انظر كيف فضلنا بعضهم على بعض وللءاخرة اكبر درجت واكبر تفضيلا",
  "translations": [
    {
      "translation": "Look how We favour some of them over others. But the Next World has higher ranks and greater favours.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See, how We favour one over the other; and in life to come are higher ranks and favours greater still.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See, how We have exalted some above others in this world, and in the Life to Come they will have higher ranks and greater degrees of excellence over others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consider how We have given preference to some people above others, yet the life to come has more honor and respect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe how We have given superiority to some over others; and indeed the Hereafter is the greatest in rank and the highest in excellence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how We prefer one above another (in this world), and verily, the Hereafter will be greater in degrees and greater in preferment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how We have made some of them to excel others, and certainly the hereafter is much superior in respect of excellence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, how We prefer some of them over others! And surely the world to come is greater in ranks, greater in preferment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how We prefer one of them above another, and verily the Hereafter will be greater in degrees and greater in preferment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "see how We have exalted some above others [in the present life]. Yet the Hereafter shall be greater in degrees of rank and greater in excellence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold thou! how We have preferred some of them over some others; and surely: the Hereafter is greater in degrees and greater in preferment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe how We have given some of them an advantage over some others; yet the Hereafter is surely greater in respect of ranks and greater in respect of relative merit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how We have bestowed more on some than on others; but verily the Hereafter is more in rank and gradation and more in excellence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how We prefer one above another (in this world) and verily, the Hereafter will be greater in degrees and greater in preference.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how We have preferred some above others. Yet the Everlasting Life is greater in rank and greater in preferment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how We have favored some of them over others; yet the Hereafter is greater in ranks, and greater in favors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look how We have favored [in provision] some of them over others. But the Hereafter is greater in degrees [of difference] and greater in distinction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:21] See how We have given preference to some of them over others, in provision and renown. And truly the Hereafter is greater, grander, in degrees and greater in preferment, to this world, and so one ought to devote one’s attention to it [the Hereafter], to the exclusion of the other.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(See) Muhammad (how We prefer one above another) in this worldly life by means of wealth and servants, (and verily the Hereafter) in the Hereafter (will be greater in degrees) greater merits for the believers (and greater in preferment) for the believers who will have more rewards and higher degrees.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالتفاوت الجاري بين عباده إنما هو لحكمةٍ ومصلحةٍ استأثر الله به في غيبه، لا اطلاع لأحدٍ عليه؛ لذلك قال: { ٱنظُرْ } أيها الناظر المعتبر { كَيْفَ فَضَّلْنَا بَعْضَهُمْ } في النشأة الأولى بالمال والجاه، والثورة والرئاسة { عَلَىٰ بَعْضٍ } مبتلى بالفقر والمسكنة، وأنواع المذلة والهوان { وَلَلآخِرَةُ } المعدَّة للذات الروحانية، والحقائق والمعارف، والمكاشفات والمشهادات { أَكْبَرُ دَرَجَاتٍ } لبقاء ذاتها أبد الآباد { وَأَكْبَرُ تَفْضِيلاً } [الإسراء: 21] من فضل المستعار الفاني الزائل بسرعة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { كيف }: حال، و { درجات } و { تفضيلاً }: تمييز\n يقول الحقّ جلّ جلاله: { مَن كان يُريد } بعمله الدنيا { العاجلةَ } ، مقصورًا عليها همه، { عجَّلنا له فيها ما نشاء لمن نُريد } التعجيل له\n قيَّد المعجل والمعجل له بالمشيئة والإرادة لأنه لا يجد كل متمن ما يتمناه، ولا كل واحد جميع ما يهواه\n قاله البيضاوي: { ثم جعلنا له } في الآخرة { جهنم يصلاها } يدخلها ويحترق بها، حال كونه { مذمومًا مدحورًا } مطرودًا من رحمة الله\n والآية في الكفار، وقيل: في المنافقين، الذين يغزون مع المسلمين لقصد الغنائم\n والأصح: أنها تعم كل من اتصف بهذا الوصف\n { ومَن أراد الآخرةَ وسعى لها سعيها } عمل لها عملها اللائق بها، وهو: الإتيان بما أمر به، والانتهاء عما نهى عنه، لا التقرب بما يخترعون بآرائهم\n وفائدة اللام في قوله: \" لها \": اعتبار النية والإخلاص\n والحال أن العامل { مؤمن } إيمانًا صحيحًا لا شرك معه ولا تكذيب، فإنه العمدة، { فأولئك } الجامعون للشروط الثلاثة { كان سعيهم مشكورًا } عند الله، مقبولاً مثابًا عليه فإن شُكر الله هو الثواب على الطاعة\n { كُلاًّ نُّمدُّ } أي: كل واحد من الفريقين نُمد بالعطاء مرة بعد أخرى، { هؤلاء } المريدين للدنيا، { وهؤلاء } المريدين للآخرة، نُمد كلا { من عطاء ربك } في الدنيا، { وما كان عطاءُ ربك } فيها { محظورًا } ممنوعًا من أحد، لا يمنعه في الدنيا مؤمن ولا كافر، تفضلاً منه تعالى\n { انظر كيف فضلنا بعضهم على بعض } في الرزق والجاه، { وللآخِرةُ أكبرُ درجاتٍ وأكبرُ تفضيلاً } من الدنيا، فينبغي الاعتناء بها دونها، والتفاوت في الآخرة حاصل للفريقين، فكما تفاوتت الدرجات في الجنة تفاوتت الدركات في النار\n وسبب التفاوت: زيادة اليقين، والترقي في أسرار التوحيد لأهل الإيمان، أو الانهماك في الكفر والشرك لأهل الكفران",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:96",
      "similarity": 0.6065853901009843
    },
    {
      "verse": "3:163",
      "similarity": 0.5807595511642353
    },
    {
      "verse": "46:19",
      "similarity": 0.553297316923935
    },
    {
      "verse": "20:75",
      "similarity": 0.5407646264621703
    },
    {
      "verse": "6:132",
      "similarity": 0.5171857297850186
    }
  ]
}