{
  "chapter": "الإسراء",
  "text": "ولا تجعل يدك مغلولة الى عنقك ولا تبسطها كل البسط فتقعد ملوما محسورا",
  "translations": [
    {
      "translation": "Do not keep your hand chained to your neck but do not extend it either to its full extent so that you sit there blamed and destitute.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be niggardly, nor extravagant that you may later feel reprehensive and constrained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(vi) Do not keep your hand fastened to your neck nor outspread it, altogether outspread, for you will be left sitting rebuked, destitute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be stingy nor over generous lest you become empty handed and bankrupt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not keep your hand tied to your neck nor open it completely, lest you remain seated – reproached, weary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not your hand be tied (like a miser) to your neck, nor overextend it (like a spendthrift), so that you become blameworthy and in severe poverty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not make your hand to be shackled to your neck nor stretch it forth to the utmost (limit) of its stretching forth, lest you should (afterwards) sit down blamed, stripped off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep not thy hand chained to thy neck, nor outspread it widespread altogether, or thou wilt sit reproached and denuded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not thy hand be chained to thy neck nor open it with a complete opening, lest thou sit down rebuked, denuded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be neither miserly, nor so open-handed that you suffer reproach and become destitute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not thine hand be chained to thy neck, nor stretch it forth to the utmost stretching, lest thou sit down reproached, impoverished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not keep your hand chained to your neck, nor open it altogether, or you will sit blameworthy and regretful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make not thy hand tied (like a niggard's) to thy neck, nor stretch it forth to its utmost reach, so that thou become blameworthy and destitute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not your hand be tied (like a miser) to your neck, nor stretch it forth to its utmost reach (like a spendthrift), so that you become blameworthy and in severe poverty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not keep your hand chained to your neck (when spending), nor open it completely, so that you will sit blamed and destitute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not keep your hand tied to your neck, nor spread it out fully, lest you end up liable and regretful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not make your hand [as] chained to your neck or extend it completely and [thereby] become blamed and insolvent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:29] And do not keep your hand chained to your neck, in other words, do not withhold it completely from expending, nor open it, in order to expend, completely, or you will sit blameworthy — this refers to the first case — and denuded, cut off, having nothing — this refers to the latter case.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعود إلى بيان التبذير والشح ، فالجملة عطف على جملة { ولا تبذر تبذيراً } \\[ الإسراء : 26 \\]. ولولا تخلل الفصل بينهما بقوله؛ { وإما تعرضن عنهم ابتغاء رحمة من ربك } \\[ الإسراء : 28 \\] الآية لكانت جملة ولا تجعل يدك مغلولة إلى عنقك غَيْر مقترنة بواو العطف لأن شأن البيان أن لا يعطف على المبين ، وأيضاً على أن في عطفها اهتماماً بها يجعلها مستقلة بالقصد لأنها مشتملة على زيادة على البيان بما فيها من النهي عن البخل المقابل للتبذير .وقد أتت هذه الآية تعليماً بمعرفة حقيقة من الحقائق الدقيقة فكانت من الحكمة . وجاء نظمها على سبيل التمثيل فصيغت الحكمة في قالب البلاغة .فأما الحكمة فإذ بينت أن المحمود في العطاء هو الوسط الواقع بين طرفي الإفراط والتفريط ، وهذه الأوساط هي حدود المحامد بين المذام من كل حقيقة لها طرفان . وقد تقرر في حكمة الأخلاق أن لكل خلق طرفين ووسطاً ، فالطرفان إفراط وتفريط وكلاهما مقر مفاسد للمصدر وللمورد ، وأن الوسط هو العدل ، فالإنفاق والبذل حقيقة أحد طرفيها الشح وهو مفسدة للمحاويج ولصاحب المال إذ يجر إليه كراهية الناس إياه وكراهتيه إياهم . والطرف الآخر التبذير والإسراف ، وفيه مفاسد لذي المال وعشيرته لأنه يصرف ماله عن مستحقه إلى مصارف غير جديرة بالصرف ، والوسط هو وضع المال في مواضعه وهو الحد الذي عبر عنه في الآية بنفي حالين بين ( لا ولا ).وأما البلاغة فبتمثيل الشح والإمساك بغل اليد إلى العُنق ، وهو تمثيل مبني على تخيل اليد مصدراً للبذل والعطاء ، وتخيُّل بَسطها كذلك وغلها شحاً ، وهو تخيل معروف لدى البلغاء والشعراء ، قال الله تعالى : وقالت اليهود يد الله مغلولة ثم قال : { بل يداه مبسوطتان } \\[ المائدة : 64 \\] وقال الأعشى: ... يَداك يدَا صدق فكف مفيدةوكف إذا ما ضُن بالمال تنفق ... ومن ثم قالوا : له يدُ على فلان ، أي نعمة وفضل ، فجاء التثميل في الآية مبنياً على التصرف في ذلك المعنى بتمثيل الذي يشح بالمال بالذي غُلّت يده إلى عنقه ، أي شدت بالغُلّ ، وهو القيد من السير يشد به يد الأسير ، فإذا غُلت اليد إلى العنق تعذر التصرف بها فتعطل الانتفاع بها فصار مصدر البذل معطلاً فيه ، وبضده مُثِّلَ المسرف بباسط يده غاية البسط ونهايته وهو المفاد بقوله : كل البسط } أي البسطَ كله الذي لا بسط بعده ، وهو معنى النهاية . وقد تقدم من هذا المعنى عند قوله تعالى : { وقالت اليهود يد الله مغلولة } إلى قوله : { بل يداه مبسوطتان ينفق كيف يشاء } في سورة العقود \\[ المائدة : 64 \\]. هذا قالب البلاغة المصوغةُ في تلك الحكمة .وقوله : فتقعد ملوما محسوراً } جواب لكلا النهيين على التوزيع بطريقة النشر المرتب ، فالملوم يرجع إلى النهي عن الشح ، والمحسور يرجع إلى النهي عن التبذير ، فإن الشحيح ملوم مذموم . وقد قيل: ... إن البخيل ملوم حيثما كاناوقال زهيرومن يك ذا فضل فيبخل بفضله ... على قومه يُستغن عنه ويذمموالمحسور : المنهوك القوى . يقال : بعير حسير ، إذا أتعبه السير فلم تبق له قوة ، ومنه قوله تعالى : { ينقلب إليك البصر خاسئاً وهو حسير } \\[ الملك : 4 \\] ، والمعنى : غير قادر على إقامة شؤونك . والخطاب لغير معين . وقد مضى الكلام على تقعد آنفاً .\n\n",
      "translations": [
        {
          "translation": "(And let not thy hand be chained to thy neck) let your hand not refrain from spending and giving gifts as would the person whose hand is chained to his neck (nor open it) in spending and giving gifts (with a complete opening) in spendthriftness. He says: do not give everything you have to one needy person or to one relative and leave all the rest, (lest thou sit down) lest you remain (rebuked) reproached by the needy and kinsmen, (denuded) cut off from kinsmen and the needy, without any wealth left. It is also said that this verse was revealed about a woman who asked for the shirt of the Prophet (pbuh). The latter took his shirt off, gave it to her and remained with his top bare. So Allah forbade him from doing so, telling him: do not open your hand completely when spending to the extent that you take off your shirt and give it away, and thus remain naked and blamed by people for remaining naked.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَىٰ عُنُقِكَ وَلاَ تَبْسُطْهَا كُلَّ ٱلْبَسْطِ فَتَقْعُدَ مَلُوماً مَّحْسُوراً } قالَ الإِمامُ عليه السلام معناهُ: لا تَمتنعْ عَن إِنفاقِ مَا يَجبُ إِنفاقُهُ فِي وُجُوهِهِ\n ولا تَبْسُطهَا: لاَ تُسْرفْ فِيهَا؛ فَتَقعدَ مَلُوماً عِندَ النَّاسِ مَّحسوراً مِن المَالِ: أَي خَالياً مِنهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of {And do not make your hand chained to your neck or extend it fully; then you will sit blamed and regretful.}, Imam 'Ali (as) said its meaning: \"Do not withhold from spending what you must spend in his face.\"\n\n\nDo not squander it, or you will find yourself hated and despised by others for being stingy with your money.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَلاَ تَجْعَلْ يَدَكَ مَغْلُولَةً } معقودة { إِلَىٰ عُنُقِكَ } بحيث لا يسع لك إعطاء شيء مما رزق الله لك على مستحقه شُحّاً وبخلاً\n إذ هو إفراطٌ وتقترٌ { وَ } أيضاً { لاَ تَبْسُطْهَا كُلَّ ٱلْبَسْطِ } بحيث لا قرار لك عندها أصلاً\n فهذا تفريطٌ وتبذيرٌ\n وكلاهما مذمومان شرعاً وعقلاً\n فعليك بالاقتصاد الذي هو عبارة عن الكرم والجود\n وهو صراط الله الأعدل الأقوم { فَتَقْعُدَ } بعد اتصافك بالبخل والتقتير { مَلُوماً } عند الله\n وعند الملائكة والناس أجمعين\n واتصفت بالتبذير والإسراف\n تقعد { مَّحْسُوراً } [الإسراء: 29] نادماً متحسراً\n قلقاً حائزاً في نظم معاشك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { ولا تجعل يدكَ مغلولةً إِلى عُنقك } أي: لا تمسكها عن الإنفاق كل الإمساك\n { ولا تبسطها كل البسط } \n وهو استعارة لغاية الجود\n فنهى الحقُّ تعالى عن الطرفين\n وأمر بالتوسط فيهما\n كقوله:\n[الفُرقان: 67] الآية\n { فتقعُدَ ملومًا محسورًا } أي: فتصير\n إذا أسرفت\n ملومًا عند الله وعند الناس بالإسراف وسوء التبذير\n محسورًا: منقطعًا بك\n لا شيء عندك\n وهو من قولهم: حسر السفر بالبعير: إذا أتعبه\n ولم يُبْقِ له قوة\n وعن جابر رضي الله عنه: بينا رَسُولُ اللهِ صلى الله عليه وسلم جَالِسٌ\n أتاهُ صبي\n فقال له: إن أُمِّي تَسْتَكْسِيكَ الدِّرْعَ الذي عَليْكَ\n فَدَخَلَ دَارَهُ ونَزَعَ قَمِيصَهُ وأعْطَاهُ\n وقَعَدَ عُرْيَانًا\n وأذَّن بلالٌ\n وانتظره للصلاة\n فلم يخرُجْ\n فأنزل الله: { ولا تجعل يدك } الآية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:5",
      "similarity": 0.43061292576723487
    },
    {
      "verse": "40:71",
      "similarity": 0.35169995763557915
    },
    {
      "verse": "34:33",
      "similarity": 0.3373434763013052
    },
    {
      "verse": "69:50",
      "similarity": 0.30883936279581514
    },
    {
      "verse": "51:54",
      "similarity": 0.3062804962809184
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}