{
  "chapter": "الإسراء",
  "text": "وقضى ربك الا تعبدوا۟ الا اياه وبالولدين احسنا اما يبلغن عندك الكبر احدهما او كلاهما فلا تقل لهما اف ولا تنهرهما وقل لهما قولا كريما",
  "translations": [
    {
      "translation": "Your Lord has decreed that you should worship none but Him, and that you should show kindness to your parents. Whether one or both of them reach old age with you, do not say 'Ugh!' to them out of irritation and do not be harsh with them but speak to them with gentleness and generosity.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So your Lord has decreed: Do not worship anyone but Him, and be good to your parents. If one or both of them grow old in your presence, do not say fie to them, nor reprove them, but say gentle words to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has decreed: (i) Do not worship any but Him; (ii) Be good to your parents; and should both or any one of them attain old age with you, do not say to them even \"fie\" neither chide them, but speak to them with respect,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has ordained that you must not worship anything other than Him and that you must be kind to your parents. If either or both of your parents should become advanced in age, do not express to them words which show your slightest disappointment. Never yell at them but always speak to them with kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has ordained that you do not worship anyone except Him, and treat your parents with kindness; if either of them or both reach old age in your presence, do not say “Uff”* to them and do not rebuff them, and speak to them with the utmost respect. (* Any expression of disgust.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has Qada [decreed] that you worship none but Him. And that you be dutiful to your parents. If one of them or both of them attain old age in your life, say not to them a word of disrespect, nor reprimand them but address them in terms of honor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has commanded that you shall not serve (any) but Him, and goodness to your parents. If either or both of them reach old age with you, say not to them (so much as) \"Ugh\" nor chide them, and speak to them a generous word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord has decreed you shall not serve any but Him, and to be good to parents, whether one or both of them attains old age with thee; say not to them 'Fie' neither chide them, but speak unto them words respectful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord hath decreed, that ye worship none save Him, and (that ye show) kindness to parents. If one of them or both of them attain old age with thee, say not \"Fie\" unto them nor repulse them, but speak unto them a gracious word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has commanded that you should worship none but Him, and show kindness to your parents. If either or both of them attain old age with you, say no word of contempt to them and do not rebuke them, but always speak gently to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord hath decreed that ye shall Worship none but Him, and unto parents shew kindness; and if either of them or both of them attain old age with thee, Say not unto them: pooh: And browbeat them not, and Speak unto them a respectful speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has decreed that you shall not worship anyone except Him, and [He has enjoined] kindness to parents. Should any of them or both reach old age at your side, do not say to them, ‘Fie!’ And do not chide them, but speak to them noble words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord hath decreed that ye worship none but Him, and that ye be kind to parents. Whether one or both of them attain old age in thy life, say not to them a word of contempt, nor repel them, but address them in terms of honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has decreed that you worship none but Him. And that you be dutiful to your parents. If one of them or both of them attain old age in your life, say not to them a word of disrespect, nor shout at them but address them in terms of honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has ordered you to worship none except Him, and to be good to your parents. If either or both of them attain old age with you, do not say: \"Fieon you\", nor rebuke them, but speak to them with words of respect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has commanded that you worship none but Him, and that you be good to your parents. If either of them or both of them reach old age with you, do not say to them a word of disrespect, nor scold them, but say to them kind words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has decreed that you not worship except Him, and to parents, good treatment. Whether one or both of them reach old age [while] with you, say not to them [so much as], \"uff,\" and do not repel them but speak to them a noble word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:23]   And your Lord has decreed, He has commanded, that you worship none save Him, and, that you show, kindness to parents, by being dutiful to them. If they should reach old age with you, one of them (ahaduhumā is the subject [of the verb]) or both (a variant reading [for yablughanna] has yablughān, ‘both [should] reach’, in which case ahaduhumā would be substituting for the [dual indicator] alif [of yablughān]) then do not say to them ‘Fie’ (read uffan or uffin, uffa or uffi, a verbal noun meaning tabban, ‘perish!’ or qubhan, ‘evil!’) nor repulse them, but speak to them gracious words, fair and gentle [words].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thy Lord hath decreed) your Lord has commanded, (that ye worship none save Him) that you declare the divine Oneness of none save Allah, Exalted is He, (and (that you show) kindness to parents) be dutiful to them. (If one of them) one of the parents (or both of them to attain old age with thee, say not \"Fie\" unto them) do not address them with foul language (nor repulse them) nor be harsh with them, (but speak unto them a gracious word) kind words.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ تَقُل لَّهُمَآ أُفٍّ وَلاَ تَنْهَرْهُمَا } قالَ الإِمامُ الشهيدُ أبو الحسين زيد بن علي بن الحسين عليهم السلام معناه: لاَ تَمْنَعُهُما شَيئاً أرادهُ، وإِنْ وَجدتَ مِنهُمَا رِيحاً يُؤذِيكَ فَلاَ تَقُلْ لَهُمَا أُفّ\n\n",
      "translations": [
        {
          "translation": "\n\nDo not say to them {uff} and do not scold them. Imam al-Shaheed Abu al-Husayn Zayd ibn Ali ibn al-Husayn, peace be upon them, said: Do not prevent him from anything he wants. And if you find a smell from them that bothers you, do not say to them {uff}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف تتخذ إلهاً سواه، مع أنه { قَضَىٰ رَبُّكَ } وحكم حكماً مقطواً مبرماً { أَلاَّ تَعْبُدُوۤاْ } أي: بألاَّ تعبدوا أيها البالغون لحد التكليف { إِلاَّ إِيَّاهُ } إذ لا مستحق للعبادة والانقياد سواه؛ إذ هو المستقل بإيجادكم وإظهاركم بلا مشاركة ومعاونة، فعليكم أن تعظّموه وتوقّروه، وتذللوا نحوه غايى التذلل والخضوع\n\n\n{ وَ } أن تسحنوا { بِٱلْوَالِدَيْنِ } اللذين هما السبب الظاهري لتربيتكم وظهوركم { إِحْسَاناً } سلساً طلقاً فرحاناً، بلا شوب المنة والأذى، سيما { إِمَّا يَبْلُغَنَّ } أي: أن يبلغن { عِندَكَ } أيها الولد { ٱلْكِبَرَ } أي: سن الكهولة، بحيث عجز عن خدمة نفسه { أَحَدُهُمَا } أي: أحد الوالدين { أَوْ كِلاَهُمَا } معاً { فَلاَ تَقُل لَّهُمَآ } في جميع الأحوال، سيما عند الكبر والكهولة: { أُفٍّ } أي: صوتاً شديداً دالاً على تضجرهما وردعهما { وَ } إن خرجا عن مقتضى العقل، وفعلا فعلاً يجب لك صرفهما عنه { لاَ تَنْهَرْهُمَا } ولا تقهرهما زجراً عليهام { وَقُل لَّهُمَا قَوْلاً كَرِيماً } [الإسراء: 23]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قضى } ، هنا، بمعنى حكم وأوجب وأمر، لا بمعنى القضاء إذ لو كان كذلك لما عُبد غير الله\n وفي مصحف ابن مسعود: \" ووصى ربك ألا تعبدوا \"\n و أن: مفسرة، أو مصدرية، أي: بأن لا تعبدوا، و { إما }: إن الشرطية دخلت عليها \" ما \" المؤكدة\n و { فلا تقل }: جوابها\n وتوحيد ضمير الخطاب في { عندك } ، وفيما سبق - مع أن ما سبق ضمير الجمع - للاحتراز عن التباس المراد، فإنَّ المقصود نهي كل أحد عن تأفيف والديه ونهرهما\n ولو قوبل الجمع بالجمع، أو بالتثنية، لم يحصل هذا المرام\n و \" أفُّ \": اسم فعل، معناها: قول مكروهُ، يقال عند الضجر ونحوه\n قال الهروي: أي: لا تقل لهما ما يكون فيه أدنى تبرم، ويقال لكل ما يضجر منه ويستثقل: أُفّ لَهُ\n وقال في القاموس: أَفّ، يَؤُفُّ، ويَئِفُّ: تأففَ من كَرْبٍ أوْ ضَجَر\n وأُفّ: كلمة تكره، وأفف تأفِيفًا، وتَأَفَّفَ، قالها، ولغتها أربعون، ثم ذكرها\n وحركتها للبناء، وتنوينها للتنكير\n يقول الحقّ جلّ جلاله: { وقضى ربُّك } أَمر أمْرًا مقطوعًا به، بـ { ألاَّ تعبدوا إِلا إِياه } لأن غاية التعظيم لا يكون إلا لمن له غاية العظمة ونهاية الإنعام، وهو الله وحده، { و } أحسنوا { بالوالدين إِحسانًا } لأنهما السبب الظاهر في وجود العبد، وبهما قامت نعمة الإمداد من التربية والحفظ في مظاهر الحكمة، وإلاَّ فما ثَمَّ إلا تربية الحق تعالى، ظهرت في مظاهر الوالدين، لكن أمر بشكر الواسطة \" من لم يشكر الناس لم يشكر الله \"\n ثم أمر ببرهما، فقال: { إِما يبلغنَّ عندك الكبَرَ أحدُهما أو كلاهما } أي: مهما بلغ زمن الكِبَرِ، وهما عندك في كفالتك، هما أو أحدهما، { فلا تقلْ لهما أُفٍّ } أي: فلا تضجر فيما يستقذر منهما ويستثقل من مؤنتهما، ولا تنطق بأدنى كلمة توجعهما، فأحرى ألا يقول لهما ما فوق ذلك\n فالنهي عن ذلك يدل على المنع من سائر أنواع الإيذاء قياسًا بطريق الأخرى\n وقال في الإحياء: الأُفّ: وسخ الظفر، والتف: وسخ الأذن، أي: لا تصفهما بما تحت الظفر من الوسخ، فأحرى غيره، وقيل: لا تتأذّ بهما كما يتأذى بما تحت الظفر\n هـ\n { ولا تنهرهما } ولا تزجرهما عما لا يعجبك بإغلاظٍ، فإن كان لإرشاد ديني فبرفق ولين\n { وقل لهما قولاً كريمًا } جميلاً لينًا لا غلظ فيه، { واخفض لهما جناحَ الذل } أَلِنْ لهما جانبك الذليل، وتذلل لهما وتواضع\n استعار للذل جناحًا، وأضافه إليه مبالغة فإنَّ الطير إذا تذلل أرخى جناحه إلى الأرض، كذلك الولد، ينبغي أن يخضع لأبويه، ويلين جانبه، ويتذلل لهما غاية جهده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:33",
      "similarity": 0.5913106058078763
    },
    {
      "verse": "21:67",
      "similarity": 0.4726459540839568
    },
    {
      "verse": "46:17",
      "similarity": 0.3768298823054303
    },
    {
      "verse": "23:93",
      "similarity": 0.12142073535846497
    },
    {
      "verse": "40:77",
      "similarity": 0.12108112934021187
    }
  ]
}