{
  "chapter": "الإسراء",
  "text": "وءات ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا",
  "translations": [
    {
      "translation": "Give your relatives their due, and the very poor and travellers but do not squander what you have.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give to your relatives what is their due, and to those who are needy, and the wayfarers; and do not dissipate (your wealth) extravagantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(iii) Give to the near of kin his due, and also to the needy and the wayfarer. (iv) Do not squander your wealth wastefully,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the relatives, the destitute and those who when on a journey have become needy, their dues.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the relatives their rights, and to the needy, and to the traveller; and do not waste needlessly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the kinsman his due, and to the Miskin (poor), and to the wayfarer. But spend not wastefully (your wealth) in the manner of a spendthrift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the near of kin his due and (to) the needy and the wayfarer, and do not squander wastefully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the kinsman his right, and the needy, and the traveller; and never squander;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the kinsman his due, and the needy, and the wayfarer, and squander not (thy wealth) in wantonness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give to your relatives their due, and also to the needy and the wayfarer. Yet do not spend extravagantly;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give thou to the kinsman his due, and also unto the needy and the wayfarer; and squander not in squandering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the relatives their [due] right, and the needy and the traveller [as well], but do not squander wastefully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And render to the kindred their due rights, as (also) to those in want, and to the wayfarer: But squander not (your wealth) in the manner of a spendthrift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the kindred his due and to the Miskin (poor) and to the wayfarer. But spend not wastefully (your wealth) in the manner of a spendthrift. [Tafsir. At-Tabari, Vol. 10, Page 158 (Verse 9:60)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give to the near of kin, the needy and the destitute traveler their rights and do not squander,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the relative his rights, and the poor, and the wayfarer, and do not squander wastefully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the relative his right, and [also] the poor and the traveler, and do not spend wastefully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:26] And give the kinsman his due, of dutifulness and kindness, and the needy and the traveller [as well]; and do not squander, by expending for [any purpose] other than in obedience to God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Give the kinsman his due) enjoin keeping ties with kinsmen, (and the needy) enjoin beneficence towards the needy, (and the wayfarer) enjoin honouring the guest for three days, (and squander not (your wealth) in wantonness) and do not squander your wealth in other than the right of Allah, if it is a very small amount; it is also said that this means: do not squander your wealth in other than in obedience of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تُبَذِّرْ تَبْذِيراً } قالَ الإِمامُ الشهيدُ أبو الحسين زيد بن علي عليهما السلام: التّبذِيرُ: إِنْفاقُ المَالِ فِي غَيرِ حَقّهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لا تقتصر أيها الولد على تعظيم والديك فقط، بل عليك تعظيم كل من ينتمي إليك من قبلهما؛ لذلك { آتِ } وأعط { ذَا ٱلْقُرْبَىٰ حَقَّهُ } أي: حق تواضعهم وتوقيرهم إن كانوا إغنياء، وأنفِق عليهم إن كانوا فقراء { وَ } آت من زكاة أموالك، وفواضل صدقاتكم { ٱلْمِسْكِينَ } الذي لا يقدر على قوته وقوت عياله { وَٱبْنَ ٱلسَّبِيلِ } أيضاً الذي يبعد عن بلده، ولس معه مؤنة معاشه، وكن في إنفاقك مقتصداً معتلاً { وَلاَ تُبَذِّرْ تَبْذِيراً } [الإسراء: 26] أي: لا تسرف إسرافاً مفرطاً خارجاً عن حد الاعتدال، سيما فيما لا يعني وينبغي؛ إذ التبذير والتقتير كلاهما مذموم عقلاً وشرعاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وآتِ ذا القُربى حقه } أي: أعط ذا القربة حقه من البر، وصلة الرحم، وحسن المعاشرة\n وقال أبو حنيفة: إذا كانوا محاويج فقراء: أن ينفق عليهم\n وقيل: الخطاب للرسول صلى الله عليه وسلم أن يُؤتى قرابته من بيت المال، { و } آت { المسكينَ } حقه { وابنَ السبيل } الغريب، من برهما والإحسان إليهما، { ولا تبذرْ تبذيرًا } بصرف المال فيما لا ينبغي، وإنفاقه على وجه السرف\n قال ابن عزيز: التبذير في النفقة: الإسراف فيها، وتفريقها في غير ما أحل الله\n هـ\n وأصل التبذير: التفريق\n\n\n \" رُوي عن النبي صلى الله عليه وسلم أنه قال لسعد، وهو يتوضأ: مَا هذَا السَّرَفُ؟ فقال: أَو فِي الوُضُوءِ سَرَفٌ؟ فقال: \" نَعَمْ، وإِنْ كنْتَ عَلَى نَهَرٍ جَارٍ \"\n \n",
      "translations": []
    }
  ]
}