{
  "chapter": "الإسراء",
  "text": "وءات ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا",
  "translations": [
    {
      "translation": "Give your relatives their due, and the very poor and travellers but do not squander what you have.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So give to your relatives what is their due, and to those who are needy, and the wayfarers; and do not dissipate (your wealth) extravagantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(iii) Give to the near of kin his due, and also to the needy and the wayfarer. (iv) Do not squander your wealth wastefully,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the relatives, the destitute and those who when on a journey have become needy, their dues.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the relatives their rights, and to the needy, and to the traveller; and do not waste needlessly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the kinsman his due, and to the Miskin (poor), and to the wayfarer. But spend not wastefully (your wealth) in the manner of a spendthrift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the near of kin his due and (to) the needy and the wayfarer, and do not squander wastefully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the kinsman his right, and the needy, and the traveller; and never squander;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the kinsman his due, and the needy, and the wayfarer, and squander not (thy wealth) in wantonness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give to your relatives their due, and also to the needy and the wayfarer. Yet do not spend extravagantly;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give thou to the kinsman his due, and also unto the needy and the wayfarer; and squander not in squandering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the relatives their [due] right, and the needy and the traveller [as well], but do not squander wastefully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And render to the kindred their due rights, as (also) to those in want, and to the wayfarer: But squander not (your wealth) in the manner of a spendthrift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the kindred his due and to the Miskin (poor) and to the wayfarer. But spend not wastefully (your wealth) in the manner of a spendthrift. [Tafsir. At-Tabari, Vol. 10, Page 158 (Verse 9:60)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give to the near of kin, the needy and the destitute traveler their rights and do not squander,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the relative his rights, and the poor, and the wayfarer, and do not squander wastefully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the relative his right, and [also] the poor and the traveler, and do not spend wastefully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:26] And give the kinsman his due, of dutifulness and kindness, and the needy and the traveller [as well]; and do not squander, by expending for [any purpose] other than in obedience to God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالقرابة كلها متشعبة عن الأبوة فلا جرم انتقل من الكلام على حقوق الأبوين إلى الكلام على حقوق القرابة .وللقرابة حقّان : حق الصلة ، وحق المواساة . وقد جمعهما جنس الحق في قوله؛ { حقه }. والحوالة فيه على ما هو معروف وعلى أدلة أخرى .والخطاب لغير معين مثل قوله : { إما يبلغن عندك الكبر } \\[ الإسراء : 23 \\].والعدول عن الخطاب بالجمع في قوله : { ربكم أعلم بما في نفوسكم إن تكونوا صالحين } \\[ الإسراء : 25 \\] الآية إلى الخطاب بالإفراد بقوله : { وآت ذا القربى } تفنن لتجنب كراهة إعادة الصيغة الواحدة عدة مرات ، والمخاطب غير معين فهو في معنى الجمع . والجملة معطوفة على جملة { ألا تعبدوا إلا إياه } \\[ الإسراء : 23 \\] لأنها من جملة ما قضى الله به .والإيتاء : الإعطاء . وهو حقيقة في إعطاء الأشياء ، ومجاز شائع في التمكين من الأمور المعنوية كحسن المعاملة والنصرة . ومنه قول النبي : ورجل آتاه الله الحِكمة فهو يقضي بها الحديث .وإطلاق الإيتاء هنا صالح للمعنيين كما هي طريقة القرآن في توفير المعاني وإيجاز الألفاظ .وقد بينت أدلّة شرعية حقوق ذي القربى ومراتبها : من واجبة مثل بعض النفقة على بعض القرابة مبينة شروطها عند الفقهاء ، ومن غير واجبة مثل الإحسان .وليس لهاته تعلق بحقوق قرابة النبي لأن حقوقهم في المال تقررت بعد الهجرة لما فرضت الزكاة وشرعت المغانم والأفياء وقسمتها . ولذلك حمل جمهور العلماء هذه الآية على حقوق قرابة النسب بين الناس . وعن علي زين العابدين أنها تشمل قرابة النبي .والتعريف في { القربى } تعريف الجنس ، أي القربى منك ، وهو الذي يعبر عنه بأن ( ال ) عوض عن المضاف إليه . وبمناسبة ذكر إيتاء ذي القربى عطف عليه من يماثله في استحقاق المواساة .وحق المسكين هو الصدقة . قال تعالى : { ولا تحضون على طعام المسكين } \\[ الفجر : 18 \\] وقوله : { أو إطعام في يوم ذي مسغبة يتيماً ذا مقربة أو مسكيناً ذا متربة } \\[ البلد : 14 16 \\]. وقد بينت آيات وأحاديث كثيرة حقوق المساكين وأعظمها آية الزكاة ومراتب الصدقات الواجبة وغيرها .و { ابن السبيل } هو المسافر يمر بحي من الأحياء ، فله على الحي الذي يمر به حق ضيافته .وحقوق الأضياف جاءت في كلام النبي صلى الله عليه وسلم كقوله : \" من كان يؤمن بالله واليوم الآخر فليكرم ضيفه جايزته يوم وليلة \" وكانت ضيافة ابن السبيل من أصول الحنيفية مما سنّه إبراهيم عليه السلام قال الحريري : «وحُرمة الشيخ الذي سَن القِرى» .وقد جعل لابن السبيل نصيب من الزكاة .وقد جمعت هذه الآية ثلاث وصايا مما أوصى الله به بقوله : { وقضى ربك } الآيات \\[ الإسراء : 23 \\].فأما إيتاء ذي القربى فالمقصد منه مقارب للمقصد من الإحسان للوالدين رعياً لاتحاد المنبت القريب وشدًّا لآصرة العشيرة التي تتكون منها القبيلة .وفي ذلك صلاح عظيم لنظام القبيلة وأمنها وذبها عن حوزتها .وأما إيتاء المسكين فلمقصد انتظام المجتمع بأن لا يكون من أفراده من هو في بؤس وشقاء ، على أن ذلك المسكين لا يعدو أن يكون من القبيلة في الغالب أقعده العجز عن العمل والفقر عن الكفاية .وأما إيتاء ابن السبيل فلإكمال نظام المجتمع ، لأن المارّ به من غير بنيه بحاجة عظيمة إلى الإيواء ليلاً ليقيه من عوادي الوحوش واللصوص ، وإلى الطعام والدفء أو التظلل وقاية من إضرار الجوع والقر أو الحر .لما ذكر البذل المحمود وكان ضده معروفاً عند العرب أعقبه بذكره للمناسبة .ولأن في الانكفاف عن البذل غير المحمود الذي هو التبذير استبقاء للمال الذي يفي بالبذل المأمور به ، فالانكفاف عن هذا تيسير لذاك وعون عليه ، فهذا وإن كان غرضاً مهماً من التشريع المسوق في هذه الآيات قد وقع موقع الاستطراد في أثناء الوصايا المتعلقة بإيتاء المال ليظهر كونه وسيلة لإيتاء المال لمستحقيه ، وكونه مقصوداً بالوصاية أيضاً لذاته . ولذلك سيعود الكلام إلى إيتاء المال لمستحقيه بعد الفراغ من النهي عن التبذير بقوله : { وإما تعرضن عنهم } الآية ، \\[ الإسراء : 28 \\] ثم يعود الكلام إلى ما يبين أحكام التبذير بقوله : { ولا تجعل يدك مغلولة إلى عنقك } \\[ الإسراء : 29 \\].وليس قوله : { ولا تبذر تبذيراً } متعلقاً بقوله : { وآت ذا القربى حقه } الخ . . لأنّ التبذير لا يوصف به بذل المال في حقّه ولو كان أكثر من حاجة المعطى ( بالفتح ).فجملة { ولا تبذر تبذيرا } معطوفة على جملة { ألا تعبدوا إلا إياه } \\[ الإسراء : 23 \\] لأنها من جملة ما قضى الله به ، وهي معترضة بين جملة وآت ذا القربى حقه } الآية وجملة { وإما تعرضن عنهم } الآية \\[ الإسراء : 2 \\] ، فتضمنت هذه الجملة وصية سادسة مما قضى الله به .والتبذير : تفريق المال في غير وجهه ، وهو مرادف الإسراف ، فإنفاقه في الفساد تبذير ، ولو كان المقدار قليلاً ، وإنفاقه في المباح إذا بلغ حد السرف تبذير ، وإنفاقه في وجوه البر والصلاح ليس بتبذير . وقد قال بعضهم لمن رآه ينفق في وجوه الخير : لا خير في السرف ، فأجابه المنفق : لا سرف في الخير ، فكان فيه من بديع الفصاحة محسن العكس .ووجه النهي عن التبذير هو أن المال جُعل عوضاً لاقتناء ما يحتاج إليه المرء في حياته من ضروريات وحاجيات وتحسينات . وكان نظام القصد في إنفاقه ضَامِنَ كفايته في غالب الأحوال بحيث إذا أنفق في وجهه على ذلك الترتيب بين الضروري والحاجي والتحسيني أمِن صاحبه من الخصاصة فيما هو إليه أشد احتياجاً ، فتجاوز هذا الحد فيه يسمى تبذيراً بالنسبة إلى أصحاب الأموال ذات الكفاف ، وأما أهل الوفر والثروة فلأن ذلك الوفر ءَاتتٍ من أبواب اتسعت لأحد فضاقت على آخر لا محالة لأن الأموال محدودة ، فذلك الوفر يجب أن يكون محفوظاً لإقامة أود المعوزين وأهل الحاجة الذين يزداد عددهم بمقدار وفرة الأموال التي بأيدي أهل الوفر والجدة ، فهو مرصود لإقامة مصالح العائلة والقبيلة وبالتالي مصالح الأمة .فأحسن ما يبذل فيه وفر المال هو اكتساب الزلفى عند الله ، قال تعالى : { وجاهدوا بأموالكم وأنفسكم في سبيل الله } \\[ التوبة : 41 \\] ، واكتساب المحمدة بين قومه . وقديماً قال المثل العربي نعم العون على المروءة الجِدة . وقال . . . اللهم هب لي حمداً ، وهب لي مجداً ، فإنه لا حَمد إلا بِفعال ، ولا فِعال إلا بمال .والمقصد الشرعي أن تكون أموال الأمة عُدة لها وقوة لابتناء أساس مجدها والحفاظ على مكانتها حتى تكون مرهوبة الجانب مرموقة بعين الاعتبار غير محتاجة إلى من قد يستغل حاجتها فيبتز منافعها ويدخلها تحت نِير سلطانه .ولهذا أضاف الله تعالى الأموال إلى ضمير المخاطبين في قوله : { ولا تؤتوا السفهاء أموالكم التي جعل الله لكم قياماً } \\[ النساء : 5 \\] ولم يقل أموالهم مع أنها أموال السفهاء ، لقوله بعده : { فإن آنستم منهم رشداً فادفعوا إليهم أموالهم } \\[ النساء : 6 \\] فأضافها إليهم حين صاروا رشداء .وما مُنع السفهاء من التصرف في أموالهم إلا خشية التبذير . ولذلك لو تصرف السفيه في شيء من ماله تصرف السداد والصلاح لمضى .وذكر المفعول المطلق { تبذيراً } بعد { ولا تبذر } لتأكيد النهي كأنه قيل : لا تبذر ، لا تبذر ، مع ما في المصدر من استحضار جنس المنهي عنه استحضاراً لما تُتصور عليه تلك الحقيقة بما فيها من المفاسد .\n\n",
      "translations": [
        {
          "translation": "(Give the kinsman his due) enjoin keeping ties with kinsmen, (and the needy) enjoin beneficence towards the needy, (and the wayfarer) enjoin honouring the guest for three days, (and squander not (your wealth) in wantonness) and do not squander your wealth in other than the right of Allah, if it is a very small amount; it is also said that this means: do not squander your wealth in other than in obedience of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تُبَذِّرْ تَبْذِيراً } قالَ الإِمامُ الشهيدُ أبو الحسين زيد بن علي عليهما السلام: التّبذِيرُ: إِنْفاقُ المَالِ فِي غَيرِ حَقّهِ\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of the Most High: {Do not squander extravagantly}, the Imam al-Shahid Abu al-Husayn Zayd ibn Ali, peace be upon them, said: \"Tubdirun is spending money on something that is not rightfully yours.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لذلك { آتِ } وأعط { ذَا ٱلْقُرْبَىٰ حَقَّهُ } أي: حق تواضعهم وتوقيرهم إن كانوا إغنياء\n وأنفِق عليهم إن كانوا فقراء { وَ } آت من زكاة أموالك\n وفواضل صدقاتكم { ٱلْمِسْكِينَ } الذي لا يقدر على قوته وقوت عياله { وَٱبْنَ ٱلسَّبِيلِ } أيضاً الذي يبعد عن بلده\n ولس معه مؤنة معاشه\n وكن في إنفاقك مقتصداً معتلاً { وَلاَ تُبَذِّرْ تَبْذِيراً } [الإسراء: 26] أي: لا تسرف إسرافاً مفرطاً خارجاً عن حد الاعتدال\n سيما فيما لا يعني وينبغي\n إذ التبذير والتقتير كلاهما مذموم عقلاً وشرعاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وآتِ ذا القُربى حقه } أي: أعط ذا القربة حقه من البر\n وصلة الرحم\n وحسن المعاشرة\n وقال أبو حنيفة: إذا كانوا محاويج فقراء: أن ينفق عليهم\n وقيل: الخطاب للرسول صلى الله عليه وسلم أن يُؤتى قرابته من بيت المال\n { و } آت { المسكينَ } حقه { وابنَ السبيل } الغريب\n من برهما والإحسان إليهما\n { ولا تبذرْ تبذيرًا } بصرف المال فيما لا ينبغي\n وإنفاقه على وجه السرف\n قال ابن عزيز: التبذير في النفقة: الإسراف فيها\n وتفريقها في غير ما أحل الله\n هـ\n وأصل التبذير: التفريق\n\n \" رُوي عن النبي صلى الله عليه وسلم أنه قال لسعد\n وهو يتوضأ: مَا هذَا السَّرَفُ؟ فقال: أَو فِي الوُضُوءِ سَرَفٌ؟ فقال: \" نَعَمْ\n وإِنْ كنْتَ عَلَى نَهَرٍ جَارٍ \"\n ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:27",
      "similarity": 0.9236943600006903
    },
    {
      "verse": "30:38",
      "similarity": 0.1574214284736868
    },
    {
      "verse": "2:215",
      "similarity": 0.10793251635279415
    },
    {
      "verse": "2:83",
      "similarity": 0.10682470901751485
    },
    {
      "verse": "8:41",
      "similarity": 0.09761375752503719
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}