{
  "chapter": "الإسراء",
  "text": "وقضى ربك الا تعبدوا۟ الا اياه وبالولدين احسنا اما يبلغن عندك الكبر احدهما او كلاهما فلا تقل لهما اف ولا تنهرهما وقل لهما قولا كريما",
  "translations": [
    {
      "translation": "Your Lord has decreed that you should worship none but Him, and that you should show kindness to your parents. Whether one or both of them reach old age with you, do not say 'Ugh!' to them out of irritation and do not be harsh with them but speak to them with gentleness and generosity.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So your Lord has decreed: Do not worship anyone but Him, and be good to your parents. If one or both of them grow old in your presence, do not say fie to them, nor reprove them, but say gentle words to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has decreed: (i) Do not worship any but Him; (ii) Be good to your parents; and should both or any one of them attain old age with you, do not say to them even \"fie\" neither chide them, but speak to them with respect,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has ordained that you must not worship anything other than Him and that you must be kind to your parents. If either or both of your parents should become advanced in age, do not express to them words which show your slightest disappointment. Never yell at them but always speak to them with kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has ordained that you do not worship anyone except Him, and treat your parents with kindness; if either of them or both reach old age in your presence, do not say “Uff”* to them and do not rebuff them, and speak to them with the utmost respect. (* Any expression of disgust.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has Qada [decreed] that you worship none but Him. And that you be dutiful to your parents. If one of them or both of them attain old age in your life, say not to them a word of disrespect, nor reprimand them but address them in terms of honor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has commanded that you shall not serve (any) but Him, and goodness to your parents. If either or both of them reach old age with you, say not to them (so much as) \"Ugh\" nor chide them, and speak to them a generous word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord has decreed you shall not serve any but Him, and to be good to parents, whether one or both of them attains old age with thee; say not to them 'Fie' neither chide them, but speak unto them words respectful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord hath decreed, that ye worship none save Him, and (that ye show) kindness to parents. If one of them or both of them attain old age with thee, say not \"Fie\" unto them nor repulse them, but speak unto them a gracious word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has commanded that you should worship none but Him, and show kindness to your parents. If either or both of them attain old age with you, say no word of contempt to them and do not rebuke them, but always speak gently to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord hath decreed that ye shall Worship none but Him, and unto parents shew kindness; and if either of them or both of them attain old age with thee, Say not unto them: pooh: And browbeat them not, and Speak unto them a respectful speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has decreed that you shall not worship anyone except Him, and [He has enjoined] kindness to parents. Should any of them or both reach old age at your side, do not say to them, ‘Fie!’ And do not chide them, but speak to them noble words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord hath decreed that ye worship none but Him, and that ye be kind to parents. Whether one or both of them attain old age in thy life, say not to them a word of contempt, nor repel them, but address them in terms of honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has decreed that you worship none but Him. And that you be dutiful to your parents. If one of them or both of them attain old age in your life, say not to them a word of disrespect, nor shout at them but address them in terms of honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has ordered you to worship none except Him, and to be good to your parents. If either or both of them attain old age with you, do not say: \"Fieon you\", nor rebuke them, but speak to them with words of respect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has commanded that you worship none but Him, and that you be good to your parents. If either of them or both of them reach old age with you, do not say to them a word of disrespect, nor scold them, but say to them kind words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord has decreed that you not worship except Him, and to parents, good treatment. Whether one or both of them reach old age [while] with you, say not to them [so much as], \"uff,\" and do not repel them but speak to them a noble word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:23]   And your Lord has decreed, He has commanded, that you worship none save Him, and, that you show, kindness to parents, by being dutiful to them. If they should reach old age with you, one of them (ahaduhumā is the subject [of the verb]) or both (a variant reading [for yablughanna] has yablughān, ‘both [should] reach’, in which case ahaduhumā would be substituting for the [dual indicator] alif [of yablughān]) then do not say to them ‘Fie’ (read uffan or uffin, uffa or uffi, a verbal noun meaning tabban, ‘perish!’ or qubhan, ‘evil!’) nor repulse them, but speak to them gracious words, fair and gentle [words].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ وقضى رَبُّكَ أَلاَّ تعبدوا إِلاَّ إياه }.عطف على الكلام السابق عطف غرض على غرض تخلصاً إلى أعمدة من شريعة الإسلام بمناسبة الفذلكة المتقدمة تنبيهاً على أن إصلاح الأعمال متفرع على نبذ الشرك كما قال تعالى : { فك رقبة أو إطعام في يوم ذي مسغبة يتيماً ذا مقربة أو مسكيناً ذا متربة ثم كان من الذين آمنوا } \\[ البلد : 13 17 \\].وقد ابتُدىء تشريع للمسلمين أحكاماً عظيمة لإصلاح جامعتهم وبناء أركانها ليزدادوا يقيناً بارتفاعهم على أهل الشرك وبانحطاط هؤلاء عنهم ، وفي جميعها تعريض بالمشركين الذين كانوا منغمسين في المنهيات . وهذه الآيات أول تفصيل للشريعة للمسلمين وقع بمكة ، وأن ما ذكر في هذه الآيات مقصود به تعليم المسلمين . ولذلك اختلف أسلوبه عن أسلوب نظيره في سورة الأنعام الذي وُجه فيه الخطاب إلى المشركين لتوقيفهم على قواعد ضلالتهم .فمن الاختلاف بين الأسلوبين أن هذه الآية افتتحت بفعل القضاء المقتضي الإلزام ، وهو مناسب لخطاب أمة تمتثل أمر ربها ، وافتتح خطاب سورة \\[ الأنعام : 151 \\] ب { تعالوا أتل ما حرم ربكم عليكم } كما تقدم هنالك .ومنها أن هذه الآية جعلت المقضي هو توحيد الله بالعبادة ، لأنه المناسب لحال المسلمين فحذرهم من عبادة غير الله . وآية الأنعام جعلت المحرم فيها هو الإشراك بالله في الإلهية المناسب لما كانوا عليه من الشرك إذ لا عبادة لهم .وأن هذه الآية فصل فيها حكم البر بالوالدين وحكم القتل وحكم الإنفاق ولم يفصل ما في آية الأنعام .وكان ما ذكر في هذه الآيات خمسة عشر تشريعاً هي أصول التشريع الراجع إلى نظام المجتمع .وأحسب أن هذه الآيات اشتهرت بين الناس في مكة وتناقلها العرب في الآفاق ، فلذلك ألَمّ الأعشى ببعضها في قصيدته المروية التي أعدها لمدح النبي صلى الله عليه وسلم حين جاء يريد الإيمان فصدته قريش عن ذلك ، وهي القصيدة الدالية التي يقول فيها :أجدّك لم تسمع وَصاة محمد ... نبيء الإله حين أوصى وأشهدافإياك والميتاتتِ لا تأكلنها ... ولا تأخذنْ سهماً حديداً لتفصداوذا النُصُب المنصوب لا تنسكنه ... ولا تَعبد الشيطانَ والله فاعبداوذا الرحم القربى فلا تقطعنه ... لفاقته ولا الأسيرَ المقيداولا تسخرن من بائس ذي ضرارة ... ولا تَحسبن المال للمرء مخلداولا تقربَنّ جارةً إن سرها ... عليك حَرام فانكحَنّ أو تأبّداوافتتحت هذه الأحكام والوصايا بفعل القضاء اهتماماً به وأنه مما أمر الله به أمراً جازماً وحكماً لازماً ، وليس هو بمعنى التقدير كقوله : { وقضينا إلى بني إسرائيل في الكتاب } \\[ الإسراء : 4 \\] لظهور أن المذكورات هنا مما يقع ولا يقع .و ( أنْ ) يجوز أن تكون تفسيرية لما في ( قضى ) من معنى القول . ويجوز أن تكون مصدرية مجرورة بباء جر مقدرة ، أي قضى بأن لا تعبدوا . وابتدىء هذا التشريع بذكر أصل التشريعة كلها وهو توحيد الله ، فذلك تمهيد لما سيذكر بعده من الأحكام .وجيء بخطاب الجماعة في قوله : { ألا تعبدوا إلا إياه } لأن النهي يتعلق بجميع الناس وهو تعريض بالمشركين .والخطاب في قوله : { ربك } للنبيء صلى الله عليه وسلم كالذي في قوله قبل : { من عطاء ربك } \\[ الإسراء : 20 \\] ، والقرينة ظاهرة . ويجوز أن يكون لغير معين فيعم الأمة والمآل واحد .وابتدىء التشريع بالنهي عن عبادة غير الله لأن ذلك هو أصل الإصلاح ، لأن إصلاح التفكير مقدم على إصلاح العمل ، إذ لا يشاق العقل إلى طلب الصالحات إلا إذا كان صالحاً . وفي الحديث : « ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله وإذا فسدت فسد الجسد كله ألا وهي القلب » وقد فصلت ذلك في كتابي المسمى { أصول النظام الاجتماعي في الإسلام }.هذا أصل ثاننٍ من أصول الشريعة وهو بر الوالدين .وانتصب { إحساناً } على المفعولية المطلقة مصدر نائباً عن فعله . والتقدير : وأحسنوا إحساناً بالوالدين كما يقتضيه العطف على { ألا تعبدوا إلا إياه } أي وقضى إحساناً بالوالدين .{ وبالوالدين } متعلق بقوله؛ { إحساناً } ، والباء فيه للتعدية يقال : أحسن بفلان كما يقال أحسن إليه ، وقد تقدم قوله تعالى : { وقد أحسن بي } في سورة \\[ يوسف : 100 \\]. وتقديمه على متعلقه للاهتمام به ، والتعريف في الوالدين للاستغراق باعتبار والدي كل مكلف ممن شملهم الجمع في { ألا تعبدوا }.وعطف الأمر بالإحسان إلى الوالدين على ما هو في معنى الأمر بعبادة الله لأن الله هو الخالق فاستحق العبادة لأنه أوجد الناس . ولما جعل الله الأبوين مظهرَ إيجاد الناس أمر بالإحسان إليهما ، فالخالق مستحق العبادة لغناه عن الإحسان ، ولأنها أعظم الشكر على أعظم منة ، ، وسببُ الوجود دون ذلك فهو يستحق الإحسان لا العبادة لأنه محتاج إلى الإحسان دون العبادة ، ولأنه ليس بمُوجد حقيقي ، ولأن الله جبل الوالدين على الشفقة على ولدهما ، فأمر الولد بمجازاة ذلك بالإحسان إلى أبويه كما سيأتي { وقل رب أرحمهما كما ربياني صغيراً }.وشمل الإحسان كل ما يصدق فيه هذا الجنس من الأقوال والأفعال والبذل والمواساة .وجملة { إما يبلغن } بيان لجملة { إحساناً } ، و { إما } مركبة من ( إن ) الشرطية و ( ما ) الزائدة المهيئة لنون التوكيد ، وحقها أن تكتب بنون بعد الهمزة وبعدها ( ما ) ولكنهم راعوا حالة النطق بها مدغمة فرسموها كذلك في المصاحف وتبعها رسم الناس غالباً ، أي إن يبلغ أحدُ الوالدين أو كلاهما حد الكبَر وهما عندك ، أي في كفالتك فَوَطّىء لهما خُلُقك ولين جانبك .والخطاب لغير معين فيعم كل مخاطب بقرينة العطف على { ألا تعبدوا إلا إياه } وليس خطاباً للنبيء صلى الله عليه وسلم إذ لم يكن له أبوان يومئذٍ . وإيثار ضمير المفرد هنا دون ضمير الجمع لأنه خطاب يختص بمن له أبوان من بين الجماعة المخاطبين بقوله : { ألا تعبدوا إلا إياه } فكان الإفراد أنسب به وإن كان الإفراد والجمع سواء في المقصود لأن خطاب غير المعين يساوي خطاب الجمع .وخص هذه الحالة بالبيان لأنها مظنة انتفاء الإحسان بما يلقى الولد من أبيه وأمّه من مشقة القيام بشؤونهما ومن سوء الخلق منهما .ووجه تَعدد فاعل { يبلغن } مُظهراً دون جعله بضمير التثنية بأن يقال إما يبلغَانِّ عندك الكبر ، الاهتمام بتخصيص كل حالة من أحوال الوالدين بالذكر ، ولم يستغن بإحدى الحالتين عن الأخرى لأن لكل حالة بواعث على التفريط في واجب الإحسان إليهما ، فقد تكون حالة اجتماعهما عند الابن تستوجب الاحتمال منهما لأجل مراعاة أحدهما الذي الابن أشد حُبّاً له دون ما لو كان أحدهما منفرداً عنده بدون الآخر الذي ميله إليه أشد ، فالاحتياج إلى ذكر أحدهما في هذه الصورة للتنبيه على وجوب المحافظة على الإحسان له . وقد تكون حالة انفراد أحد الأبوين عند الابن أخف كلفة عليه من حالة اجتماعهما ، فالاحتياج إلى { أو كلاهما } في هذه الصورة للتحذير من اعتذار الابن لنفسه عن التقصير بأن حالة اجتماع الأبوين أحرَج عليه ، فلأجل ذلك ذكرت الحالتان وأجري الحكم عليهما على السواء ، فكانت جملة { فلا تقل لهما أف } بتمامها جواباً ل ( إما ).وأكد فعل الشرط بنون التوكيد لتحقيق الربط بين مضمون الجواب ومضمون الشرط في الوجود . وقرأ الجمهور { إما يبلغن } على أن { أحدهما } فاعل { يبلغن } فلا تلحق الفعل علامة لأنّ فاعله اسم ظاهر .وقرأ حمزة والكسائي وخلف { يبلغان } بألف التثنية ونون مشددة والضمير فاعل عائد إلى الوالدين في قوله : { وبالوالدين إحساناً } ، فيكون { أحدهما أو كلاهما } بدلاً من ألف المثنى تنبيهاً على أنه ليس الحكم لاجتماعهما فقط بل هو للحالتين على التوزيع .والخطاب ب { عندك } لكل من يصلح لسماع الكلام فيعم كل مخاطب بقرينة سبق قوله : { ألا تعبدوا إلا إياه } ، وقوله اللاحق { ربكم أعلم بما في نفوسكم } \\[ الإسراء : 25 \\].{ أف } اسم فعل مضارع معناه أتضخر . وفيه لغات كثيرة أشهرها كلها ضم الهمزة وتشديد الفاء ، والخلاف في حركة الفاء ، فقرأ نافع ، وأبو جعفر ، وحفص عن عاصم بكسر الفاء منونة . وقرأ ابن كثير ، وابن عامر ، ويعقوب بفتح الفاء غيرَ منونة . وقرأ الباقون بكسر الفاء غير منونة .وليس المقصود من النهي عن أن يقول لهما { أف } خاصة ، وإنما المقصود النهي عن الأذى الذي أقله الأذى باللسان بأوْجز كلمة ، وبأنها غير دالة على أكثر من حصُول الضجر لقائلها دون شتم أو ذم ، فيفهم منه النهي مما هو أشد أذى بطريق فحوى الخطاب بالأوْلى .ثم عطف عليه النهي عن نهرهما لئلا يُحسب أن ذلك تأديب لصلاحهما وليس بالأذى . والنهر الزجر ، يقال : نهره وانتهره .ثم أمر بإكرام القول لهما . والكريم من كل شيء : الرفيع في نوعه .وتقدم عند قوله تعالى : { ومغفرة ورزق كريم } في سورة \\[ الأنفال : 4 \\].وبهذا الأمر انقطع العذر بحيث إذا رأى الولد أن ينصح لأحد أبويه أو أن يحذر مما قد يضر به أدى إليه ذلك بقول لين حسن الوقع .\n\n",
      "translations": [
        {
          "translation": "(Thy Lord hath decreed) your Lord has commanded, (that ye worship none save Him) that you declare the divine Oneness of none save Allah, Exalted is He, (and (that you show) kindness to parents) be dutiful to them. (If one of them) one of the parents (or both of them to attain old age with thee, say not \"Fie\" unto them) do not address them with foul language (nor repulse them) nor be harsh with them, (but speak unto them a gracious word) kind words.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ تَقُل لَّهُمَآ أُفٍّ وَلاَ تَنْهَرْهُمَا } قالَ الإِمامُ الشهيدُ أبو الحسين زيد بن علي بن الحسين عليهم السلام معناه: لاَ تَمْنَعُهُما شَيئاً أرادهُ، وإِنْ وَجدتَ مِنهُمَا رِيحاً يُؤذِيكَ فَلاَ تَقُلْ لَهُمَا أُفّ\n\n",
      "translations": [
        {
          "translation": "\n\nDo not say to them {uff} and do not scold them. Imam al-Shaheed Abu al-Husayn Zayd ibn Ali ibn al-Husayn, peace be upon them, said: Do not prevent him from anything he wants. And if you find a smell from them that bothers you, do not say to them {uff}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنه { قَضَىٰ رَبُّكَ } وحكم حكماً مقطواً مبرماً { أَلاَّ تَعْبُدُوۤاْ } أي: بألاَّ تعبدوا أيها البالغون لحد التكليف { إِلاَّ إِيَّاهُ } إذ لا مستحق للعبادة والانقياد سواه\n إذ هو المستقل بإيجادكم وإظهاركم بلا مشاركة ومعاونة\n فعليكم أن تعظّموه وتوقّروه\n وتذللوا نحوه غايى التذلل والخضوع\n\n{ وَ } أن تسحنوا { بِٱلْوَالِدَيْنِ } اللذين هما السبب الظاهري لتربيتكم وظهوركم { إِحْسَاناً } سلساً طلقاً فرحاناً\n بلا شوب المنة والأذى\n سيما { إِمَّا يَبْلُغَنَّ } أي: أن يبلغن { عِندَكَ } أيها الولد { ٱلْكِبَرَ } أي: سن الكهولة\n بحيث عجز عن خدمة نفسه { أَحَدُهُمَا } أي: أحد الوالدين { أَوْ كِلاَهُمَا } معاً { فَلاَ تَقُل لَّهُمَآ } في جميع الأحوال\n سيما عند الكبر والكهولة: { أُفٍّ } أي: صوتاً شديداً دالاً على تضجرهما وردعهما { وَ } إن خرجا عن مقتضى العقل\n وفعلا فعلاً يجب لك صرفهما عنه { لاَ تَنْهَرْهُمَا } ولا تقهرهما زجراً عليهام { وَقُل لَّهُمَا قَوْلاً كَرِيماً } [الإسراء: 23]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قضى } \n هنا\n بمعنى حكم وأوجب وأمر\n لا بمعنى القضاء إذ لو كان كذلك لما عُبد غير الله\n وفي مصحف ابن مسعود: \" ووصى ربك ألا تعبدوا \"\n و أن: مفسرة\n أو مصدرية\n أي: بأن لا تعبدوا\n و { إما }: إن الشرطية دخلت عليها \" ما \" المؤكدة\n و { فلا تقل }: جوابها\n وتوحيد ضمير الخطاب في { عندك } \n وفيما سبق - مع أن ما سبق ضمير الجمع - للاحتراز عن التباس المراد\n فإنَّ المقصود نهي كل أحد عن تأفيف والديه ونهرهما\n ولو قوبل الجمع بالجمع\n أو بالتثنية\n لم يحصل هذا المرام\n و \" أفُّ \": اسم فعل\n معناها: قول مكروهُ\n يقال عند الضجر ونحوه\n قال الهروي: أي: لا تقل لهما ما يكون فيه أدنى تبرم\n ويقال لكل ما يضجر منه ويستثقل: أُفّ لَهُ\n وقال في القاموس: أَفّ\n يَؤُفُّ\n ويَئِفُّ: تأففَ من كَرْبٍ أوْ ضَجَر\n وأُفّ: كلمة تكره\n وأفف تأفِيفًا\n وتَأَفَّفَ\n قالها\n ولغتها أربعون\n ثم ذكرها\n وحركتها للبناء\n وتنوينها للتنكير\n يقول الحقّ جلّ جلاله: { وقضى ربُّك } أَمر أمْرًا مقطوعًا به\n بـ { ألاَّ تعبدوا إِلا إِياه } لأن غاية التعظيم لا يكون إلا لمن له غاية العظمة ونهاية الإنعام\n وهو الله وحده\n { و } أحسنوا { بالوالدين إِحسانًا } لأنهما السبب الظاهر في وجود العبد\n وبهما قامت نعمة الإمداد من التربية والحفظ في مظاهر الحكمة\n وإلاَّ فما ثَمَّ إلا تربية الحق تعالى\n ظهرت في مظاهر الوالدين\n لكن أمر بشكر الواسطة \" من لم يشكر الناس لم يشكر الله \"\n ثم أمر ببرهما\n فقال: { إِما يبلغنَّ عندك الكبَرَ أحدُهما أو كلاهما } أي: مهما بلغ زمن الكِبَرِ\n وهما عندك في كفالتك\n هما أو أحدهما\n { فلا تقلْ لهما أُفٍّ } أي: فلا تضجر فيما يستقذر منهما ويستثقل من مؤنتهما\n ولا تنطق بأدنى كلمة توجعهما\n فأحرى ألا يقول لهما ما فوق ذلك\n فالنهي عن ذلك يدل على المنع من سائر أنواع الإيذاء قياسًا بطريق الأخرى\n وقال في الإحياء: الأُفّ: وسخ الظفر\n والتف: وسخ الأذن\n أي: لا تصفهما بما تحت الظفر من الوسخ\n فأحرى غيره\n وقيل: لا تتأذّ بهما كما يتأذى بما تحت الظفر\n هـ\n { ولا تنهرهما } ولا تزجرهما عما لا يعجبك بإغلاظٍ\n فإن كان لإرشاد ديني فبرفق ولين\n { وقل لهما قولاً كريمًا } جميلاً لينًا لا غلظ فيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:33",
      "similarity": 0.5913106058078763
    },
    {
      "verse": "21:67",
      "similarity": 0.4726459540839568
    },
    {
      "verse": "46:17",
      "similarity": 0.3768298823054303
    },
    {
      "verse": "23:93",
      "similarity": 0.12142073535846497
    },
    {
      "verse": "40:77",
      "similarity": 0.12108112934021187
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}