{
  "chapter": "الإسراء",
  "text": "واخفض لهما جناح الذل من الرحمة وقل رب ارحمهما كما ربيانى صغيرا",
  "translations": [
    {
      "translation": "Take them under your wing, out of mercy, with due humility and say: 'Lord, show mercy to them as they did in looking after me when I was small.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And look after them with kindness and love, and say: \"O Lord, have mercy on them as they nourished me when I was small.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and be humble and tender to them and say: \"Lord, show mercy to them as they nurtured me when I was small.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be humble and merciful towards them and say, \"Lord, have mercy upon them as they cherished me in my childhood.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lower your wing humbly for them, with mercy, and pray, “My Lord! Have mercy on them both, the way they nursed me when I was young.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lower unto them the wing of submission and humility through mercy, and say: \"My Lord! Bestow on them Your mercy as they did bring me up when I was young.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make yourself submissively gentle to them with compassion, and say: O my Lord! have compassion on them, as they brought me up (when I was) little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and lower to them the wing of humbleness out of mercy and say; 'My Lord, have mercy upon them, as they raised me up when I was little.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lower unto them the wing of submission through mercy, and say: My Lord! Have mercy on them both as they did care for me when I was little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and treat them with humility and tenderness and say, \"Lord, be merciful to them both, as they raised me up when I was little.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lower unto them the wing of meekness out of mercy, and say: O my Lord! have mercy on the twain even as they brought me up when young.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lower the wing of humility to them, mercifully, and say, ‘My Lord! Have mercy on them, just as they reared me when I was [a] small [child]!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, out of kindness, lower to them the wing of humility, and say: \"My Lord! bestow on them thy Mercy even as they cherished me in childhood.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lower unto them the wing of submission and humility through mercy, and say: \"My Lord! Bestow on them Your Mercy as they did bring me up when I was small.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lower to them the wing of humbleness out of mercy and say: 'My Lord, be merciful to them, as they raised me since I was little'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lower to them the wing of humility, out of mercy, and say, “My Lord, have mercy on them, as they raised me when I was a child.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lower to them the wing of humility out of mercy and say, \"My Lord, have mercy upon them as they brought me up [when I was] small.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:24] And lower to them the wing of humility, show them your submissive side, out of mercy, that is, on account of your affection for them, and say, ‘My Lord, have mercy on them, just as they, had mercy on me when [they], reared me when I was little’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nثم ارتقى في الوصاية بالوالدين إلى أمر الولد بالتواضع لهما تواضعاً يبلغ حد الذل لهما لإزالة و حشة نفوسهما إن صارا في حاجة إلى معونة الولد ، لأن الأبوين يبغيان أن يكونا هما النافعين لولدهما . والقصد من ذلك التخلق بشكره على أنعامهما السابقة عليه .وصيغ التعبير عن التواضع بتصويره في هيئة تذلل الطائر عندما يعتريه خوف من طائر أشد منه إذ يخفض جناحه متذللاً . ففي التركيب استعارة مكنية والجناح تخييل بمنزلة تخييل الأظفار للمنية في قول أبي ذُؤْيبَ :وإذا المنية أنشبت أظفارها ... ألفيتَ كل تميمة لا تنفعوبمنزلة تخييل اليد للشمال بفتح الشين والزمام للقرة في قول لبيد :وغداة ريح قد كشفت وقِرةٍ ... إذْ أصبحت بيد الشمال زِمامهاومجموع هذه الاستعارة تمثيل . وقد تقدم في قوله : { واخفض جناحك للمؤمنين } في سورة \\[ الحجر : 88 \\].والتعريف في { الرحمة } عوض عن المضاف إليه ، أي من رحمتك إياهما . و ( من ) ابتدائية ، أي الذل الناشىء عن الرحمة لا عن الخوف أو عن المداهنة . والمقصود اعتياد النفس على التخلق بالرحمة باستحضار وجوب معاملته إياهما بها حتى يصير له خلقاً ، كما قيل :إن التخلق يأتي دونه الخلق ... وهذه أحكام عامة في الوالدين وإن كانا مشركين ، ولا يُطاعان في معصية ولا كفر كما في آية سورة العنكبوت .ومقتضى الآية التسوية بين الوالدين في البر وإرضاؤهما معاً في ذلك ، لأن موردها لفعل يصدر من الولد نحو والديه وذلك قابل للتسوية . ولم تتعرض لما عدا ذلك مما يختلف فيه الأبوان ويتشاحان في طلب فعل الولد إذا لم يمكن الجمع بين رغبتيهما بأن يأمره أحد الأبوين بضد ما يأمره به الآخر . ويظهر أن ذلك يجري على أحوال تعارض الأدلة بأن يسعى إلى العمل بطلبيهما إن استطاع .وفي الحديث الصحيح عن أبي هريرة : « أن رجلاً سأل النبي صلى الله عليه وسلم مَن أحقّ الناس بحسن صحابتي؟ قال : أمك . قال : ثم مَن؟ قال : ثم أمُّك . قال : ثم مَن؟ قال : ثم أمُّك . قال : ثمّ من؟ قال : ثم أبوك «وهو ظاهر في ترجيح جانب الأم لأن سؤال السائل دل على أنه يسأل عن حسن معاملته لأبويه .وللعلماء أقوال :أحدها : ترجيح الأم على الأب وإلى هذا ذهب الليث بن سعد ، والمحاسبي ، وأبو حنيفة . وهو ظاهر قول مالك ، فقد حكى القرافي في الفرق 23 عن مختصر الجامع أن رجلاً سأل مالكاً فقال : إن أبي في بلد السودان وقد كتب إليّ أن أقدم عليه وأمي تمنعني من ذلك؟ فقال مالك : أَطِعْ أباك ولا تعْص أمك .وذكر القرافي في المسألة السابعة من ذلك الفرق أن مالكاً أراد منع الابن من الخروج إلى السودان بغير إذن الأم .الثاني : قول الشافعية أن الأبوين سواء في البر . وهذا القول يقتضي وجوب طلب الترجيح إذا أمرا ابنهما بأمرين متضادين .وحكى القرطبي عن المحاسبي في كتاب «الرعاية» أنه قال : لا خلاف بين العلماء في أن للأم ثلاثة أرباع البر وللأب الربع . وحكى القرطبي عن الليث أن للأم ثلثي البر وللأب الثلث ، بناء على اختلاف رواية الحديث المذكور أنه قال : ثم أبوك بعد المرة الثانية أو بعد المرة الثالثة .والوجه أن تحديد ذلك بالمقدار حوالة على ما لا ينضبط وأن محمل الحديث مع اختلاف روايتيه على أن الأم أرجح على الإجمال .ثم أمر بالدعاء لهما برحمة الله إياهما وهي الرحمة التي لا يستطيع الولد إيصالها إلى أبويه إلا بالابتهال إلى الله تعالى .وهذا قد انتُقل إليه انتقالاً بديعاً من قوله : { واخفض لهما جناح الذل من الرحمة } فكان ذكر رحمة العبد مناسبة للانتقال إلى رحمة الله ، وتنبيهاً على أن التخلق بمحبة الولد الخير لأبويه يدفعه إلى معاملته إياهما به فيما يعلمانه وفيما يخفى عنهما حتى فيما يصل إليهما بعد مماتهما . وفي الحديث \" إذا مات ابن آدم انقطع عمله إلا من ثلاث : صدقة جارية ، وعلم بثه في صدور الرجال ، وولد صالح يدعو له بخير \"وفي الآية إيماء إلى أن الدعاء لهما مستجاب لأن الله أذن فيه . والحديث المذكور مؤيد ذلك إذ جعل دعاء الولد عملاً لأبويه .وحكم هذا الدعاء خاص بالأبوين المؤمنين بأدلة أخرى دلت على التخصيص كقوله : { ما كان للنبي والذين آمنوا أن يستغفروا للمشركين } \\[ التوبة : 113 \\] الآية .والكاف في قوله : كما ربياني صغيراً } للتشبيه المجازي يعبر عنه النحاة بمعنى التعليل في الكاف ، ومثاله قوله تعالى : { واذكروه كما هداكم } \\[ البقرة : 198 \\] ، أي ارحمهما رحمة تكافىء ما ربياني صغيرا .وصغيراً } حال من ياء المتكلم .والمقصود منه تمثيل حالة خاصة فيها الإشارة إلى تربية مكيفة برحمة كاملة فإن الأبوة تقتضي رحمة الولد ، وصغرالولد يقتضي الرحمة به ولو لم يكن ولداً فصار قوله : { كما ربياني صغيراً } قائماً مقام قوله كما ربياني ورحماني بتربيتهما . فالتربية تكملة للوجود ، وهي وحدها تقتضي الشكر عليها . والرحمة حفظ للوجود من اجتناب انتهاكه وهو مقتضى الشكر ، فجمع الشكر على ذلك كله بالدعاء لهما بالرحمة .والأمر يقتضي الوجوب . وأما مواقع الدعاء لهما فلا تنضبط وهو بحسب حال كل امرىء في أوقات ابتهاله . وعن سفيان بن عيينة إذا دعا لهما في كل تشهد فقد امتثل .ومقصد الإسلام من الأمر ببر الوالدين وبصلة الرحم ينحل إلى مقصدين :أحدهما : نفساني وهو تربية نفوس الأمة على الاعتراف بالجميل لصانعه ، وهو الشكر ، تخلقاً بأخلاق الباري تعالى في اسمه الشكور ، فكما أمر بشكر الله على نعمة الخلق والرزق أمر بشكر الوالدين على نعمة الإيجاد الصوري ونعمة التربية والرحمة .وفي الأمر بشكر الفضائل تنويه بها وتنبيه على المنافسة في إسدائها .والمقصد الثاني عمراني ، وهو أن تكون أواصر العائلة قوية العُرى مشدودة الوثوق فأمر بما يحقق ذلك الوثوق بين أفراد العائلة ، وهو حسن المعاشرة ليربي في نفوسهم من التحاب والتواد ما يقوم مقام عاطفة الأمومة الغريزية في الأم ، ثم عاطفة الأبوة المنبعثة عن إحساسسٍ بعضه غريزي ضعيف وبعضه عقلي قوي حتى أن أثر ذلك الإحساس ليساوي بمجموعه أثر عاطفة الأم الغريزية أو يفوقها في حالة كبر الابن . ثم وزع الإسلام ما دعا إليه من ذلك بين بقية مراتب القرابة على حسب الدنو في القرب النسبي بما شرعه من صلة الرحم ، وقد عزز الله قابلية الانسياق إلى تلك الشرعة في النفوس .جاء في الحديث : « أن الله لما خلق الرحم أخذت بقائمة من قوائم العرش وقالت : هذا مقام العائذ بكَ من القطيعة . فقال الله : أما تَرْضَيْنَ أن أصل من وصلك وأقطع من قطعك » وفي الحديث : « إن الله جعل الرحم من اسمه الرحيم » .وفي هذا التكوين لأواصر القرابة صلاح عظيم للأمة تظهر آثاره في مواساة بعضهم بعضاً ، وفي اتحاد بعضهم مع بعض ، قال تعالى : { يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوباً وقبائل لتعارفوا } \\[ الحجرات : 13 \\].وزاده الإسلام توثيقاً بما في تضاعيف الشريعة من تأكيد شد أواصر القرابة أكثر مما حاوله كل دين سلف . وقد بينا ذلك في بابه من كتاب مقاصد الشريعة الإسلامية }.\n\n",
      "translations": [
        {
          "translation": "(And lower unto them the wing of submission) humble yourself to them (through mercy) be compassionate towards them, (and say: My Lord! Have mercy on them both) if they are Muslims (as they did care for me when I was little).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { ٱخْفِضْ } وابسط { لَهُمَا جَنَاحَ ٱلذُّلِّ } والتواضع والمسكنة { مِنَ } كمال { ٱلرَّحْمَةِ } والشفقة عليهما { وَ } لا يقتصر على الخفض والشفقة الدنيوية\n بل { قُل } لهما ولأجلهما مناجياً مع الله: { رَّبِّ ٱرْحَمْهُمَا } على مقتضى رحمتك الواسعة\n وجودك الشامل { كَمَا رَبَّيَانِي صَغِيراً } [الإسراء: 14] أي: ارحمهما بفضلك\n مثل رحمتهما وتربيتهما إياي في حال صغري وطفولتي\n\n\nفعليكم أن تكونوا في دعائهما على العزيمة الصحيحة\n والمحبة الخالصة\n بحيث يكون بواطنكم موافقة لظواهركم\n مثل تربيتهما إياكم حالة صغركم\n ولا تتمنوا موتهما في قلوبكم\n إذ { رَّبُّكُمْ } المطلع على سرائركم { أَعْلَمُ بِمَا فِي نُفُوسِكُمْ } من ابتغائكم موتهما\n أو برهما وتكريمهما\n فالله سبحانه يعفو عنكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واخفض لهما جناحَ الذل } أَلِنْ لهما جانبك الذليل\n وتذلل لهما وتواضع\n استعار للذل جناحًا\n وأضافه إليه مبالغة فإنَّ الطير إذا تذلل أرخى جناحه إلى الأرض\n كذلك الولد\n ينبغي أن يخضع لأبويه\n ويلين جانبه\n ويتذلل لهما غاية جهده\n وذلك { مِنَ الرحمة } أي: من إفراط الرحمة لهما والرقة والشفقة عليهما\n\n{ وقل ربِّ ارحمهما } أي: وادع الله أن يرحمهما برحمته الباقية\n ولا تكتف برحمتك الفانية\n وإن كانا كافرين لأن من الرحمة أن يهديهما للإسلام\n فقل اللهم ارحمهما { كما ربياني صغيرًا } أي: رحمة مثل رحمتهما عليّ وتربيتهما وإرشادهما لي في صغري\n وفاء بعهدك للراحمين\n فالكاف في محل نصب على أنه نعت لمصدر محذوف\n أي: رحمة مثل تربيتهما\n أو مثل رحمتهما لي\n على أن التربية رحمة\n ويجوز أن يكون لهما الرحمة والتربية معًا\n وقد ذكر أحدهما في أحد الجانبين والآخر في الآخر\n كما يلوح له التعرض لعنوان الربوبية\n كأنه قيل: رب ارحمهما\n ورَبِّهِمَا كما ربياني صغيرا\n ويجوز أن يكون الكاف للتعليل\n كقوله:\n[البقرة: 198]\n ولقد بالغ الحق تعالى في التوصية بالوالدين حيث شفع الإحسان إليهما بتوحيده سبحانه\n ونظمهما في سلك القضاء بعبادته\n ثم ضيق في برهما حتى لم يُرخص في أدنى كلمة تتفلت من المتضجر\n وختمها بأن جعل رحمته التي وسعت كلَّ شيء مشبهة بتربيتهما\n وعن النبي صلى الله عليه وسلم أنه قال:\n \" رِضَا اللهِ في رضا الوَالِدَين\n وَسَخَطُهُ في سَخَطِهِمَا \" \n\n \" ورُوي: أن رجلاً قال لرسول الله صلى الله عليه وسلم: إن أبَويَّ بَلَغَا مِنْ الكِبَر إلى أنِّي ألي منهما ما وَلَيَا مِنِّي في الصغر\n فهل قضيتهما حقهما؟ قال: لا فإنهما كانا يفعلان ذلك وهما يحبان بقاءك\n وأنت تفعل ذلك وأنت تريد موتهما \" \nورُوي أن شيخًا أتى النبي صلى الله عليه وسلم فقال: إن ابني هذا له مال كثير\n ولا ينفق عليّ من ماله شيئًا\n فنزل جبريل وقال: إن هذا الشيخ أنشأ في ابنه أبياتًا\n ما قُرعَ سَمْعٌ بمثلها\n فاستنشدها\n فأنشدها الشيخ\n فقال:\nومن تمام برهما: زيارتهما بعد موتهما\n والدعاء لهما\n والتصدق عليهما\n ففي الحديث:\n \" إنما الميت في قبره كالغريق\n ينتظر دعوة تلحقه من ابنه أو أخيه أو صديقه\n فإذا لحقته كانت أحب إليه من الدنيا وما فيها \" \nوروى مالك في الموطأ عن سعيد بن المسيب أنه قال: كان يقال: إن الرجل ليرفع بدعاء ولده من بعده\n وأشار بيده نحو السماء\n وهو مرفوع إلى النبي صلى الله عليه وسلم: من طريق أبي هريرة قال:\n \" إن الله ليرفع العبد الدرجة\n فيقول: يا رب\n أنَّى لي بها؟! فيقول: باستغفار ابنك لك \" \n \n\n وسأل رجل النبي صلى الله عليه وسلم: هل بقي من بر أبويَّ شيء أبرهما به\n بعد موتهما؟ فقال:\n \" نعم\n\n\n الصلاة عليهما - أي: الترحم والاستغفار لهما -\n وإنفاذ عهدهما من بعدهما\n وصلة الرحم التي لا توصل إلا بهما\n وإكرام صديقهما \"\n \nقال تعالى: { ربكم أعلمُ بما في نفوسكم } من قصد البر إليهما\n واعتقاد ما يجب لهما من التوقير\n وكأنه تهديد على أن يُضمر لهما كراهة واستثقالاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:215",
      "similarity": 0.7346446503038823
    },
    {
      "verse": "56:3",
      "similarity": 0.6550625518412458
    },
    {
      "verse": "15:88",
      "similarity": 0.6464831509914052
    },
    {
      "verse": "27:37",
      "similarity": 0.3637091262844632
    },
    {
      "verse": "54:53",
      "similarity": 0.24576164694579586
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}