{
  "chapter": "الإسراء",
  "text": "ان المبذرين كانوا۟ اخون الشيطين وكان الشيطن لربه كفورا",
  "translations": [
    {
      "translation": "Those who dissipate (their wealth) are the brethren of the devils, and the Devil was ungrateful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for those who squander wastefully are Satan's brothers, and Satan is ever ungrateful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be a wasteful spender. Squanderers are the brothers of satan. Satan was faithless to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who needlessly waste are brothers of the devils; and the devil is very ungrateful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the spendthrifts are brothers of the Shayatin (devils), and the Shaytan is ever ungrateful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the squanderers are the fellows of the Shaitans and the Shaitan is ever ungrateful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the squanderers are brothers of Satan, and Satan is unthankful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the squanderers were ever brothers of the devils, and the devil was ever an ingrate to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "spendthrifts are the brothers of Satan, and Satan is ever ungrateful to his Lord --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the squanderers are ever the brethren of the Satans, and the satan is ever unto his Lord ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the wasteful are brothers of satans, and Satan is ungrateful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily spendthrifts are brothers of the Evil Ones; and the Evil One is to his Lord (himself) ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, spendthrifts are brothers of the Shayatin (devils), and the Shaitan (Devil - Satan) is ever ungrateful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for the wasteful are the brothers of satan; and satan is ungrateful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The extravagant are brethren of the devils, and the devil is ever ungrateful to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the wasteful are brothers of the devils, and ever has Satan been to his Lord ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:27] Indeed squanderers are brothers of devils, that is, they follow their way, and the Devil was ever ungrateful to his Lord, extremely rejective of His graces: likewise his brother the squanderer.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "301 (Lo! the squanderers) those who squander their wealth in other than the right of Allah (were ever brothers of the devils) the aids of the devils, (and the devil was ever an ingrate to his Lord).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك قال سبحانه: { إِنَّ ٱلْمُبَذِّرِينَ } المسرفين أموالهم رياءً وسمعةً { كَانُوۤاْ إِخْوَانَ ٱلشَّيَاطِينِ } أي: أشباههم وأتباعهم في صرف الأموال الموهوبة من الله إلى غير المصرف و غير المستحق من المصارف، بل صرفوها إلى المحظورات والمكروهات، بإغواء الشياطين وإغرائهم { وَكَانَ ٱلشَّيْطَانُ } الغوي الطاغي { لِرَبِّهِ كَفُوراً } [الإسراء: 27] لنعم الله، فيغري أتباعه إلى الكفران أيضاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ إِنَّ المبذّرين كانوا إِخوانَ الشياطين } أي: أمثالهم في الشر فإن التضييع والإتلاف شر\n أو: على طريقتهم، أو: أصدقاؤهم وأتباعهم لأنهم يطيعونهم في الإسراف، رُوي أنهم كانوا ينحرون الإبل ويتياسرون عليها - أي: يتقامرون - من الميسر، وهو القمار - ويُبذرون أموالهم - في السمعة، فنهاهم الله تعالى عن ذلك، وأمرهم بالإنفاق في القرابات\n { وكان الشيطانُ لربِّه كفورًا } مبالغاً في الكفر، فينبغي ألا يطاع",
      "translations": []
    }
  ]
}