{
  "chapter": "الإسراء",
  "text": "ذلك مما اوحى اليك ربك من الحكمة ولا تجعل مع الله الها ءاخر فتلقى فى جهنم ملوما مدحورا",
  "translations": [
    {
      "translation": "That is part of the wisdom your Lord has revealed to you. Do not set up another god together with Allah and so be thrown into Hell, blamed and driven out.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is some of the wisdom your Lord has revealed to you. So do not take another god apart from God, or you will be cast into Hell, reproved, ostracised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is part of the wisdom your Lord has revealed to you. So do not set up any deity beside Allah lest you are cast into Hell, rebuked and deprived of every good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), these are words of wisdom which your Lord has revealed to you. Do not consider anything equal to God lest you be thrown into hell, despised, and driven away from God's mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is part of the divine revelations of wisdom that your Lord has sent down to you (O dear Prophet Mohammed – peace and blessings be upon him); and O listener, do not set up another God with Allah, for you will then be thrown into hell – rebuked, rebuffed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is (part) of Al-Hikmah (wisdom) which your Lord has revealed to you. And set not up with Allah any other god lest you should be thrown into Hell, blameworthy and rejected (from Allah's mercy).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is of what your Lord has revealed to you of wisdom, and do not associate any other god with Allah lest you should be thrown into hell, blamed, cast away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is of the wisdom thy Lord set not up with God another god, or thou wilt be cast into Gehenna, reproached and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is (part) of that wisdom wherewith thy Lord hath inspired thee (O Muhammad). And set not up with Allah any other god, lest thou be cast into hell, reproved, abandoned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is part of the wisdom that your Lord has revealed to you. Do not set up any other deity with God, lest you be cast into Hell, condemned and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Part of that wisdom which thy Lord hath revealed unto thee, and set not up thou along with Allah anot her god, lest thou be cast into Hell, reproved, rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are among [precepts] that your Lord has revealed to you of wisdom. Do not set up another god besides Allah, or you will be cast into hell, being blameworthy and banished [from His mercy].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are among the (precepts of) wisdom, which thy Lord has revealed to thee. Take not, with Allah, another object of worship, lest thou shouldst be thrown into Hell, blameworthy and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is (part) of Al-Hikmah (wisdom, good manners and high character, etc.) which your Lord has inspired to you (O Muhammad SAW). And set not up with Allah any other ilah (god) lest you should be thrown into Hell, blameworthy and rejected, (from Allah's Mercy).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is of the wisdom your Lord has revealed to you. Do not set up with Allah another god, or you will be cast into Gehenna, condemned and rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is some of the wisdom your Lord has revealed to you. Do not set up with God another god, or else you will be thrown in Hell, rebuked and banished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is from what your Lord has revealed to you, [O Muhammad], of wisdom. And, [O mankind], do not make [as equal] with Allah another deity, lest you be thrown into Hell, blamed and banished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:39] This is [part] of the wisdom, the admonition, which your Lord has revealed to you, O Muhammad (s). And do not set up with God any other god, or you will be cast into Hell, blameworthy, abandoned, banished from God’s mercy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ ذلك مِمَّآ أوحى إِلَيْكَ رَبُّكَ مِنَ الحكمة }عدل عن مخاطبة الأمة بضمائر جمع المخاطبين وضمائر المخاطَب غير المعين إلى خطاب النبي صلى الله عليه وسلم ردًّا إلى ما سبق في أول هذه الآيات من قوله : { وقضى ربك } الخ \\[ الإسراء : 23 \\]. وهو تذييل معترض بين جمل النهي . والإشارة إلى جميع ما ذكر من الأوامر والنواهي صراحةً من قوله : { وقضى ربك } \\[ الإسراء : 23 \\].وفي هذا التذييل تنبيه على أنّ ما اشتملت عليه الآيات السبع عشرةَ هو من الحكمة ، تحريضاً على اتباع ما فيها وأنه خير كثير . وفيه امتنان على النبي بأن الله أوحى إليه ، فذلك وجه قوله : مما أوحى إليك تنبيهاً على أن مثل ذلك لا يصل إليه الأميون لولا الوحي من الله ، وأنه علمه ما لم يكن يعلم وأمره أن يعلمه الناس .والحكمة : معرفة الحقائق على ما هي عليه دون غلط ولا اشتباه ، وتطلق على الكلام الدال عليها . وتقدم في قوله تعالى : { يؤتي الحكمة من يشاء } \\[ البقرة : 269 \\].عطف على جمل النهي المتقدمة ، وهذا تأكيد لمضمون جملة { ألا تعبدوا إلا إياه } \\[ الإسراء : 23 \\] ، أعيد لقصد الاهتمام بأمر التوحيد بتكرير مضمونه وبما رتب عليه من الوعيد بأن يجازى بالخلود في النار مهانا .والخطاب لغير معين على طريقة المنهيات قبله ، وبقرينة قوله عقبه : { أفأصفاكم ربكم بالبنين } الآية \\[ الإسراء : 40 \\].والإلقاء : رمْي الجسم من أعلى إلى أسفل ، وهو يؤذن بالإهانة .والملوم : الذي يُنكر عليه ما فعله .والمدحور : المطرود ، أي المطرود من جانب الله ، أي مغضوب عليه ومبعد من رحمته في الآخرة .و تُلقى منصوب في جواب النهي بفاء السببية والتسبب على المنهي عنه ، أي فيتسبب على جعلك مع الله إلهاً آخر إلقاؤك في جهنَم .\n\n",
      "translations": [
        {
          "translation": "(This) which I have commanded you with (is (part) of that wisdom) in the Qur'an (wherewith thy Lord hath inspired you) commanded thee ((0 Muhammad). And set not up) and pronounce not (with Allah any other god, lest thou be cast into hell, reproved) reproached by your soul, (abandoned) deprived of all that which is good.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } المذكور من الأحكام المتقدمة\n مِنْ أول السورة إلى هنا { مِمَّآ أَوْحَىٰ إِلَيْكَ رَبُّكَ } يا أكمل الرسل تربيتةً لك\n وتأييداً لأمرك { مِنَ ٱلْحِكْمَةِ } المتقنة التي يجب الامتثال والانصاف بها على من أراد سلوك سبيل التوحيد\n المبنيِّ على عدالة الأخلاق والأطوار والشئون { وَ } معظم المنهيات والمحظورات: الشرك بالله\n العياذ بالله منه\n لذلك كرره تأكيداً ومبالغةً\n وبالغ في الاحتراز عنه حبيبه\n حيث قال: { لاَ تَجْعَلْ مَعَ ٱللَّهِ } المتوحد المتفرد في ذاته\n المعبود بالحق والاستحقاق { إِلَـٰهاً آخَرَ } يعبد له كعبادته\n وإن اتخذتَ إليهاً سواه { فَتُلْقَىٰ فِي جَهَنَّمَ } البعد والخذلان\n حال كونك { مَلُوماً } تلوم نفسك بأنواع الملومات بما ضاع عنك من التوحيد المنجي عن جميع المضائق والمهالك { مَّدْحُوراً } [الإسراء: 39] مبعدً عن رحمة الله\n وسعة فضله وإحسانه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك مما أَوحى إِليك ربُّك من الحكمة } التي هي علم الشرائع\n أو معرفة الحق لذاته\n والعلم للعمل به\n\n{ ولا تجعلْ مع الله إلهًا آخر } \n كرره\n للتنبيه على أن التوحيد مبدأ الأمر ومنتهاه\n وأنه رأس الحكمة وملاكها\n ومن عُدِمَهُ لم تَنْفَعْهُ علومه وحِكمه\n ولو جمع أساطير الحكماء\n ولو بلغت عنان السماء\n والخطاب للرسول صلى الله عليه وسلم\n والمراد: غيره ممن يتصور منه ذلك\n ورتب عليه\n أولاً: ما هو عاقبة الشرك في الدنيا\n وهو: الذم والخذلان\n وثانيًا: ما هو نتيجته في العقبى\n فقال: { فتُلقى في جهنم ملومًا } تلوم نفسك\n وتلومك الملائكة والناس\n { مدحورًا } مطرودًا من رحمة الله\n ثم قبَّح رأيهم في الشرك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:18",
      "similarity": 0.5706535867904783
    },
    {
      "verse": "37:9",
      "similarity": 0.4363347700938671
    },
    {
      "verse": "51:54",
      "similarity": 0.3462308857147865
    },
    {
      "verse": "68:30",
      "similarity": 0.33878577285049916
    },
    {
      "verse": "75:2",
      "similarity": 0.32777539088013424
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017039.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017039.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}