{
  "chapter": "الإسراء",
  "text": "ان ربك يبسط الرزق لمن يشاء ويقدر انه كان بعباده خبيرۢا بصيرا",
  "translations": [
    {
      "translation": "Your Lord expands the provision of anyone He wills and restricts it. He is aware of and sees His slaves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly your Lord provides with open hands whosoever He will, but according to capacity, for He knows and watches His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Your Lord makes plentiful the provision of whomsoever He wills and straitens it for whomsoever He wills. He is well-aware and is fully observant of all that relates to His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord increases and determines the sustenance of whomever He wants. He is Well Aware and watches over His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord eases the livelihood and restricts it, for whomever He wills; He Well Knows, Beholds His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, your Lord expands the provision for whom He wills and straitens (for whom He wills). Verily, He is Ever All-Knower, All-Seer of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord makes plentiful the means of subsistence for whom He pleases and He straitens (them); surely He is ever Aware of, Seeing, His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely thy Lord outspreads and straitens His provision unto whom He will; surely He is aware of and sees His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! thy Lord enlargeth the provision for whom He will, and straiteneth (it for whom He will). Lo, He was ever Knower, Seer of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord gives abundantly to whom He will and sparingly to whom He pleases. He is informed and observant about His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily thy Lord extendeth the provision for whomsoever He will and He measureth it out; verily He is in respect of His bondmen Aware, Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord expands the provision for whomever He wishes, and tightens it. Indeed, He is well aware of His servants and a keen observer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily thy Lord doth provide sustenance in abundance for whom He pleaseth, and He provideth in a just measure. For He doth know and regard all His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, your Lord enlarges the provision for whom He wills and straitens (for whom He wills). Verily, He is Ever All-Knower, All-Seer of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord gives to whom He will His provisions both abundantly and sparingly. He is aware and sees His worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord expands the provision for whomever He wills, and restricts it. He is fully Informed, Observant of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your Lord extends provision for whom He wills and restricts [it]. Indeed He is ever, concerning His servants, Acquainted and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:30] Truly your Lord expands provision, He makes it abundant, for whomever He will and He straitens, He restricts it for whomever He will. Indeed He is ever Aware and Seer of His servants, Knower of what they hide and what they manifest, giving them provision in accordance with their welfare.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nموقع هذه الجملة موقع اعتراض بالتعليل لما تقدم من الأمر بإيتاء ذي القربى والمساكين ، والنهي عن التبذير ، وعن الإمساك المفيد الأمرَ بالقصد ، بأن هذا واجب الناس في أموالهم وواجبهم نحو قرابتهم وضعفاء عشائرهم ، فعليهم أن يمتثلوا ما أمرهم الله من ذلك . وليس الشح بمبق مال الشحيح لنفسه ، ولا التبذير بمغننٍ من يبذر فيهم المال فإن الله قدر لكل نفس رزقها .فيجوز أن يكون الكلام جارياً على سنن الخطاب السابق لغير معين . ويجوز أن يكون قد حُول الكلام إلى خطاب النبي صلى الله عليه وسلم فَوُجّه بالخطاب إلى النبي صلى الله عليه وسلم لأنه الأولى بعلم هذه الحقائق العالية ، وإن كانت أمته مقصودة بالخطاب تبعاً له ، فتكون هذه الوصايا مخللة بالإقبال على خطاب النبي صلى الله عليه وسلم{ ويقدر } ضد { يبسط }. وقد تقدم عند قوله تعالى : { الله يبسط الرزق لمن يشاء ويقدر } في سورة \\[ الرعد : 26 \\].وجملة { إنه كان بعباده خبيرا بصيرا تعليل لجملة إن ربك يبسط الرزق } إلى آخرها ، أي هو يفعل ذلك لأنه عليم بأحوال عباده وما يليق بكل منهم بحسب ما جبلت عليه نفوسهم ، وما يحف بهم من أحوال النظم العالمية التي اقتضتها الحكمة الإلهية المودعة في هذا العالم .والخبير : العالم بالأخبار . والبصير : العالم بالمبصرات . وهذان الاسمان الجليلان يرجعان إلى معنى بعض تعلق العلم الإلهي .\n\n",
      "translations": [
        {
          "translation": "(Lo! thy Lord) Muhammad (enlargeth the provision) He enlarges wealth (for whom He will) of His servants as an act of consideration towards them, (and straiteneth (it for whom He will)) and He makes His provision straitened for some of His servants out of consideration for them. (Lo, He was ever Knower, Seer) of the enlarging and straitening (of His slaves) regarding that which is good for His servants.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ رَبَّكَ يَبْسُطُ ٱلرِّزْقَ } الصوري والمعنوي\n ويوسعه { لِمَن يَشَآءُ } من عباده على مقتضى علمه بحالهم\n وسعة استعدادهم\n وقابلية حوصلتهم { وَيَقْدِرُ } أي: يقبض ويضيّق لمن يشاء منهم على مقتضى علمه يضيق صدرهم\n وقلة تمكنهم ووقارهم\n إذ الله الحكيم المتقن في أفعاله لا يتجاوز عن مقتضى حكمته { إِنَّهُ كَانَ بِعِبَادِهِ } عليماً { خَبِيراً } عن بواطنهم وصمائرهم\n وما يؤول إليهم أمورهم { بَصِيراً } [الإسراء: 30] بظواهر أحوالهم\n وتقلباتهم في شئونهم وتطوراتههم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم سلاَّه بقوله: { إِنَّ ربك يبسط الرزق } يوسعه { لمن يشاءُ ويَقْدِرُ } يضيقه على من يشاء\n\nفكل ما يصيبك من الضيق فإنما هو لمصلحة باطنية\n { إِنه كان بعباده خبيرًا بصيرًا } يعلم سرهم وعلانيتهم\n فيعلم مِنْ مصالحهم ما يخفى عليهم فيرزقهم على حسب مصالحهم\n ويضيق عليهم على قدر صبرهم\n والحاصل: أنه يُعطي كل واحد ما يَصلح به\n والله أعلم\n الإشارة: أمر الحق - جلّ جلاله - رسوله صلى الله عليه وسلم\n وخلفاءه ممن كان على قدمه\n أن يعطوا حق الواردين عليهم من قرابة الدين والنسب\n والمساكين والغرباء\n من البر والإحسان حسًا ومعنى كتعظيم ملاقاته\n وإرشادهم إلى ما ينفع بواطنهم\n والإنفاق عليهم\n من أحسن ما يجد\n حسًا ومعنى\n وخصوصًا الإخوان في الله\n فكل ما يُنفق عليهم فهو قليل في حقهم\n ولا يُعد سرفًا\n ولو أنفق ملء الأرض ذهبًا\n قال في القوت: دعا إبراهيمُ بن أدهم الثوريَّ وأصحابَه إلى طعام\n فأكثر منه\n فقال له سفيانُ: يا أبا إسحاق أما تخاف أن يكون هذا سرفًا؟ فقال إبراهيم: ليس في الطعام سرف\n هـ\n قلت: هذا إن قدَّمه إلى الإخوان الذاكرين الله قاصدًا وجه الله\n وأما إن قدمه مفاخرة ومباهاة دخله السرف\n قاله في الحاشية الفاسية\n ومثله في تفسير القشيري\n وأنه لا سَرف فيما كان لله\n ولو أنفق ما أنفق\n بخلاف ما كان لدواعي النفس ولو فلسًا\n هـ\n وأما الخروج عن المال كله فمذموم\n إلا من قوي يقينه\n كالصدِّيق\n ومن كان على قدمه\n وكذلك الاستقراض على الله\n واشتراؤه بالدَّين من غير مادة معلومة\n إن كان قوي اليقين\n وجرّب معاملته مع الحق\n فلا بأس بفعل ذلك وإلاَّ فليكف لئلا يتعرض لإتلاف أموال الناس فيتلفه الله\n وبالله التوفيق\n ولما أمر بما يقربها إليه نهى عما يبعدنا عنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:27",
      "similarity": 0.8465858515228702
    },
    {
      "verse": "29:62",
      "similarity": 0.8071934543379538
    },
    {
      "verse": "39:52",
      "similarity": 0.7307284016628766
    },
    {
      "verse": "30:37",
      "similarity": 0.722615832833654
    },
    {
      "verse": "34:36",
      "similarity": 0.7179946804292227
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017030.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017030.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}