{
  "chapter": "الإسراء",
  "text": "ولا تقتلوا۟ اولدكم خشية املق نحن نرزقهم واياكم ان قتلهم كان خطـا كبيرا",
  "translations": [
    {
      "translation": "Do not kill your children out of fear of being poor. We will provide for them and you. Killing them is a terrible mistake.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not abandon your children out of fear of poverty. We will provide for them and for you. Killing them is certainly a great wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(vii) Do not kill your children for fear of want. We will provide for them and for you. Surely killing them is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not kill your children for fear of poverty. We will give sustenance to all of you. To kill them is certainly a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not kill your children, fearing poverty; We shall provide sustenance to them as well as to you; indeed killing them is a great mistake.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And kill not your children for fear of poverty. We shall provide for them as well as for you. Surely, the killing of them is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not kill your children for fear of poverty; We give them sustenance and yourselves (too); surely to kill them is a great wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And slay not your children for fear of poverty; We will provide for you and them; surely the slaying of them is a grievous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Slay not your children, fearing a fall to poverty, We shall provide for them and for you. Lo! the slaying of them is great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall not kill your offspring for fear of want. It is We who provide for them, and for you. Indeed, killing them is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And saly not your offspring for fear of want; We provide for them and for yourselves; verily their slaying is a great crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not kill your children for the fear of penury: We will provide for them and for you. Killing them is indeed a great iniquity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kill not your children for fear of want: We shall provide sustenance for them as well as for you. Verily the killing of them is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And kill not your children for fear of poverty. We provide for them and for you. Surely, the killing of them is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not kill your children because you fear poverty. We will provide for you and them. Killing them is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not kill your children for fear of poverty. We provide for them, and for you. Killing them is a grave sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not kill your children for fear of poverty. We provide for them and for you. Indeed, their killing is ever a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:31] And do not slay your children, by burying them alive, fearing penury, poverty. We shall provide for them and for you. Slaying them is truly a great sin.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Slay not your children). This verse was revealed about the tribe of Khuza'ah who used to bury their new born daughters alive, and so Allah forbade them from doing so, telling them not bury their daughters alive, (fearing a fall to poverty) for fear of humiliation and poverty, (We shall provide for them) i.e. for your daughters (and for you. Lo! the slaying of them) burying them alive (is great sin) is a tremendous sin which deserves a great punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَقْتُلُوۤاْ أَوْلادَكُمْ خَشْيَةَ إِمْلاقٍ } معناه فَقرٌ وَفاقةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَقْتُلُوۤاْ } أيها البالغون لرتبة التكليف الإلهي { أَوْلادَكُمْ } الحاصلة من أصلابكم، سواء كانوا بنين أو بنات بلا رخصة شرعية، سيما { خَشْيَةَ إِمْلاقٍ } أي: فقر وفاقة؛ إذ { نَّحْنُ } من سعةً جودنا، ووفور رحمتنا { نَرْزُقُهُمْ وَإِيَّاكُم } إذ لا رازق لكم ولهم سوانا { إنَّ قَتْلَهُمْ } إن صدر عنكم { كَانَ خِطْئاً كَبِيراً } [الإسراء: 31] أي: ذنباً عظيماً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { خشية }: مفعول من أجله لأن الخشية قلبية، بخلاف الإملاق، فإنه حسي فَجُرَّ بمن في سورة الأنعام\n وهذه الآية في أغنياء العرب، الذين كانوا يخشون وقوع الفقر، وما في \" الأنعام \" نزلت في فقرائهم، الذين كان الفقر واقعًا بهم، ولذلك قدَّم هناك كاف الخطاب، وأخَّره هنا، فتأمله\n و \" خِطًا \" يقال: خطئ خطأ، كأثم إثمًا\n وقرأ ابن عامر: \" خَطأً \" ، بفتحتين، فهو إما اسم مصدر أخطأ، أو لغة في خطئ، كمِثل ومَثل، وحِذر وحَذر\n وقرأ ابن كثير: \" خِطاء \" بالمد، إما لغة، أو مصدر خاطأ\n انظر البيضاوي\n يقول الحقّ جلّ جلاله: { ولا تقتلوا أولادكم } مخافة الفاقة المستقبلة، وقد كانوا يقتلون البنات - وهو الوأد - مخافة الفقر، فنهاهم، عن ذلك، وضمن لهم أرزاقهم، فقال: { نحن نرزقهم وإِياكم إِنَّ قتلهم كان خِطأً } إثمًا { كبيرًا } لما فيه من قطع التناسل وانقطاع النوع وإيلام الروح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:151",
      "similarity": 0.7672431165513516
    },
    {
      "verse": "34:24",
      "similarity": 0.14506319925613048
    },
    {
      "verse": "69:37",
      "similarity": 0.1410806709679199
    },
    {
      "verse": "2:172",
      "similarity": 0.1404498679422386
    },
    {
      "verse": "16:114",
      "similarity": 0.13656237566307658
    }
  ]
}