{
  "chapter": "الإسراء",
  "text": "ولا تقربوا۟ مال اليتيم الا بالتى هى احسن حتى يبلغ اشده واوفوا۟ بالعهد ان العهد كان مسـولا",
  "translations": [
    {
      "translation": "Do not go near the property of orphans before they reach maturity, except in a good way. Fulfil your contracts. Contracts will be asked about.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not touch the property of the orphans except for bettering it, until they come of age; and fulfil the promise made: You will surely be questioned about the promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(x) And do not even go near the property of the orphan - except that it be in the best manner - till he attains his maturity. (xi) And fulfil the covenant, for you will be called to account regarding the covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not get close to the property of the orphans (unless it is for a good reason) until they are mature and strong. Keep your promise; you will be questioned about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not approach the wealth of the orphan except in the best possible way, till he reaches adulthood; and fulfil the promise; indeed the promise will be asked about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And come not near to the orphan's property except to improve it, until he attains the age of full strength. And fulfill (every) covenant. Verily, the covenant will be questioned about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And draw not near to the property of the orphan except in a goodly way till he attains his maturity and fulfill the promise; surely (every) promise shall be questioned about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not approach the property of the orphan save in the fairest manner, until he is of age. And fulfil the covenant; surely the covenant shall be questioned of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Come not near the wealth of the orphan save with that which is better till he come to strength; and keep the covenant. Lo! of the covenant it will be asked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not go near the orphans' property, except with the best of intentions, until they reach maturity. Keep your promises; you will be called to account for every promise which you have made!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And approach not the substance of an'orphan save with that which is best, until he attaineth his age of strength. And fulfil the covenant; verily the covenant shall be asked about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not approach the orphan’s property except in the best manner, until he comes of age. Fulfill the covenants; indeed all covenants are accountable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Come not nigh to the orphan's property except to improve it, until he attains the age of full strength; and fulfil (every) engagement, for (every) engagement will be enquired into (on the Day of Reckoning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And come not near to the orphan's property except to improve it, until he attains the age of full strength. And fulfil (every) covenant. Verily! the covenant, will be questioned about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not draw near the wealth of the orphan except in the best manner, until he reaches maturity. And keep your promise. Surely, the promise will be questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not go near the orphan’s property, except with the best of intentions, until he has reached his maturity. And honor your pledge, because the pledge involves responsibility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not approach the property of an orphan, except in the way that is best, until he reaches maturity. And fulfill [every] commitment. Indeed, the commitment is ever [that about which one will be] questioned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:34] And do not come [anywhere] near an orphan’s property, except in the fairest manner until he comes of age. And fulfil the covenant, should you make a covenant with God or with people [in general]. Indeed the covenant will be enquired into.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Come not near the wealth of the orphan save with that which is better) through generating profit from it 302 and by means of preserving it (till he come to strength) 15 or 18 years old; (and keep the covenant) that you pledged in the name of Allah between you and people. (Lo! of the covenant) the one who breaks the covenant (it will be asked) why he broke it on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَقْرَبُواْ مَالَ ٱلْيَتِيمِ إِلاَّ بِٱلَّتِي هِيَ أَحْسَنُ } معناه بالتّجارةِ فيهِ\n\n\n\n\nوقوله تعالى: { إِنَّ ٱلْعَهْدَ كَانَ مَسْؤُولاً } معناهُ مطلوبٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } عليكم أيضاً أيها المتوجهون نحو الحق بالعزيمة الصحيحة، والقصد الخالص أن { لاَ تَقْرَبُواْ مَالَ ٱلْيَتِيمِ } الذي لا متعهد له من الأبوين { إِلاَّ بِٱلَّتِي هِيَ أَحْسَنُ } بحالهم من ازدياد أموالهم وتنميته، وحفظه وتعميره على وجه العدالة والمروءة { حَتَّىٰ يَبْلُغَ } اليتيم { أَشُدَّهُ } أي: رشده، وبلغ إلى سن التمييز والتصرف، فلكم أيها المتعهدون المتحفظون لأموال اليتامى ردها إليهم بعد اختيارهم وامتحانهم مراراً، وبالجملة: لكم أيها الموحدون الإيفاء والوفاء بالعهود والمواثيق مطلقاً، سواء كانت مما بينكم وبين الله، أو بين المؤمنين من عباده { وَأَوْفُواْ بِالْعَهْدِ إِنَّ ٱلْعَهْدَ } والميثاق { كَانَ مَسْؤُولاً } [الإسراء: 34] في النشأة الأخرى، وناقضة مؤاخذاً، وموفيه مأجوراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تقربُوا مالَ اليتيم } فضلاً عن أن تتصرفوا فيه { إِلا بالتي هي أحسنُ } إلا بالطريقة التي هي أحسن، كالحفظ والتنمية، { حتى يبلغ أشُدَّه } حتى يتم رشده، ثم يدفع له، فإن دفعه لمن يتصرف فيه بالمصلحة فلا بأس، { وأوفُوا بالعهد } إذا عاهدتم الله أو الناس، { إِن العهد كان مسؤولاً } أي: مطلوبًا الوفاء به، فيطلب من المعاهد ألا يُضيعه، أو: مسؤولاً عنه، فيُسأل عنه الناكث ويُعاتب عليه، أو: يُسأل العهد نفسُه لِمَ نكثْتَ، تبكيتًا للناكث، { وأوفوا الكيل إِذا كِلْتُم } ولا تبخسوا فيه، { وزِنُوا بالقسطاس المستقيم } بالميزان السّوي\n\n\nوالقسطاس: لغة رومية، ولا يقدح ذلك في عربية القرآن لأن غير العربي، إذا استعملته العرب، فأجرته مجرى كلامهم في الإعراب والتعريف والتنكير، صار عربيًا\n قاله البيضاوي",
      "translations": []
    }
  ]
}