{
  "chapter": "الإسراء",
  "text": "واذا قرات القرءان جعلنا بينك وبين الذين لا يؤمنون بالءاخرة حجابا مستورا",
  "translations": [
    {
      "translation": "When you recite the Qur'an, We place an obscuring veil between you and those who do not believe in the akhira.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you recite the Qur'an, We place a hidden veil between you and those who do not believe in the Hereafter;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you recite the Qur'an, We place a hidden barrier between you and those who do not believe in the Hereafter;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you recite the Quran We place a curtain as a barrier between you and those who do not believe in the life to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you read the Qur’an O dear Prophet (Mohammed – peace and blessings upon him), We created an invisible barrier between you and those who do not believe in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you recite the Qur'an, We put between you and those who believe not in the Hereafter, an invisible veil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you recite the Quran, We place between you and those who do not believe in the hereafter a hidden barrier;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou recitest the Koran, We place between thee, and those who do not believe in the world to come, a curtain obstructing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou recitest the Qur'an we place between thee and those who believe not in the Hereafter a hidden barrier;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you recite the Quran, We place an invisible barrier between you and those who do not believe in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou recitest the Qur'an, We set up between thee and those who believe not in the Hereafter a curtain drawn down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you recite the Quran, We draw a hidden curtain between you and those who do not believe in the Hereafter,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou dost recite the Qur'an, We put, between thee and those who believe not in the Hereafter, a veil invisible:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you (Muhammad SAW) recite the Quran, We put between you and those who believe not in the Hereafter, an invisible veil (or screen their hearts, so they hear or understand it not).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you recite the Koran, We place between you and those who do not believe in the Everlasting Life an obstructing barrier.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you read the Quran, We place between you and those who do not believe in the Hereafter an invisible barrier.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you recite the Qur'an, We put between you and those who do not believe in the Hereafter a concealed partition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:45] And when you recite the Qur’ān, We place between you and those who do not believe in the Hereafter a hidden barrier, that is, one that hides you from them, so that they cannot see you — this was revealed regarding those who wanted to assassinate him (s) [the Prophet].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when thou recitest the Qur'an) in Mecca (We place between thee, and those who believe not in the Hereafter) those who do not believe in resurrection after death, meaning: Abu Jahl and his host (a hidden barrier) a veiled barrier.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومراقبة حالك { جَعَلْنَا } وصيرنا { بَيْنَكَ وَبَيْنَ } القوم { ٱلَّذِينَ لاَ يُؤْمِنُونَ بِٱلآخِرَةِ } ولا يوقنون بالأمور المترتبة عليها فيها { حِجَاباً } غليظاً\n وغشاءً كثيفاً { مَّسْتُوراً } [الإسراء: 45] بسترك عن أعين أعدائك\n القاصدين لك سوءاً\n مع أنهم لا يرون الحجب أيضاً\n\n\nروى سعيد بن جبير رضي الله عنه أنه لما نزلت:\n[المسد: 1] جاءت امرأته بحجرٍ لترضخ به رأس رسول الله صلى الله عليه وسلم\n وهو جالس مع أبي بكر رضي الله عنه\n فسألت: أين صاحبك\n لقد بلغني أنه هجاني؟ فقال أبو بكر: ما نطق صاحبي بالشعر\n ثمَّ قال أبو بكر: ما رأتك يا رسول الله\n فقال: صلى الله عليه سلم\n \" لَمْ يَزَلْ مَلَكٌ بَيْنِيْ وَبَيْنَ أَعْدَائِيْ\n أَنَا أَرَاهُمْ وَلاْ يَرَوْنَنِيْ \"\n \n \n \n{ وَ } كيف لا يكون الكافر محجوباً مستوراً عن سرائر القرآن ومرموزاته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:90",
      "similarity": 0.7086579017402526
    },
    {
      "verse": "41:22",
      "similarity": 0.6724472232056256
    },
    {
      "verse": "83:15",
      "similarity": 0.3837440578666492
    },
    {
      "verse": "38:32",
      "similarity": 0.3706832458798745
    },
    {
      "verse": "19:17",
      "similarity": 0.37035389153146686
    }
  ]
}