{
  "chapter": "الإسراء",
  "text": "قل لو كان معه ءالهة كما يقولون اذا لابتغوا۟ الى ذى العرش سبيلا",
  "translations": [
    {
      "translation": "Say: 'If there had, as you say, been other gods together with Him, they would have sought a way to the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Had there been other gods with Him, as they assert, they would surely have sought a way (of opposition) against the Lord of the Throne.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, (O Muhammad): \"Had there been other gods with Him, as they claim, they would surely have attempted to find a way to the Lord of the Throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Had there been many other gods besides Him, as they say, they should have found a way to the Lord of the Throne\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “If there were other Gods besides Him” – as they utter – “then they would have certainly found a way towards* the Owner of the Throne!”. (* To fight against Him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If there had been other gods along with Him as they assert, then they would certainly have sought out a way to the Lord of the Throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If there were with Him gods as they say, then certainly they would have been able to seek a way to the Lord of power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If there had been other gods with Him, as they say, in that case assuredly they would have sought a way unto the Lord of the Throne.' Glory be to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad, to the disbelievers): If there were other gods along with Him, as they say, then had they sought a way against the Lord of the Throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If there were [other] deities along with Him, as they claim, then they would surely have tried to find a way to the Lord of the Throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: were there along with Him other gods, as they say, then they would have brought unto the Owner of the Throne a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Were there [other] gods besides Him, as they say, they would surely have encroached on the Lord of the Throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If there had been (other) gods with Him, as they say,- behold, they would certainly have sought out a way to the Lord of the Throne!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to these polytheists, pagans, etc.): \"If there had been other aliha (gods) along with Him as they assert, then they would certainly have sought out a way to the Lord of the Throne (seeking His Pleasures and to be near to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If there had been other gods with Him, as they say, they would surely have sought a way to the Lord of the Throne'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If there were other gods with Him, as they say, they would have sought a way to the Lord of the Throne.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"If there had been with Him [other] gods, as they say, then they [each] would have sought to the Owner of the Throne a way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:42] Say, to them: ‘If there were with Him, that is, with God, [other] gods, as they say, they would, in that case, have sought against the Lord of the Throne, that is, [against] God, some path, some way, in order to fight Him [off].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعود إلى إبطال تعدد الآلهة زيادة في استئصال عقائد المشركين من عروقها ، فالجملة استئناف ابتدائي بعد جملة { ولا تجعل مع اللَّه إلها آخر فتلقى في جهنم ملوماً مدحوراً } \\[ الإسراء : 39 \\]. والمخاطب بالأمر بالقول هو النبي لدمغهم بالحجة المقنعة بفساد قولهم . وللاهتمام بها افتتحت ب قل } تخصيصاً لهذا بالتبليغ وإن كان جميع القرآن مأموراً بتبليغه .وجملة { كما تقولون } معترضة للتنبيه على أن تعدد الآلهة لا تحقق له وإنما هو مجرد قول عار عن المطابقة لما في نفس الأمر .وابتغاء السبيل : طلب طريق الوصول إلى الشيء ، أي توخيه والاجتهاد لإصابته ، وهو هنا مجاز في توخي وسيلة الشيء . وقد جاء في حديث موسى والخضر عليهما السلام أن موسى سأل السبيل إلى لُقيا الخضر .و ( إذن ) دالة على الجواب والجزاء فهي مؤكدة لمعنى الجواب الذي تدل عليه اللام المقترنة بجواب ( لو ) الامتناعية الدالة على امتناع حصول جوابها لأجل امتناع وقوع شرطها ، وزائدة بأنها تفيد أن الجواب جزاء عن الكلام المجاب . فالمقصود الاستدلال على انتفاء إلهية الأصنام والملائكة الذين جعلوهم آلهة .وهذا الاستدلال يحتمل معنيين مآلهما واحد :والمعنى الأول : أن يكون المراد بالسبيل سبيل السعي إلى الغلبة والقهر ، أي لطلبوا مغالبة ذي العرش وهو الله تعالى . وهذا كقوله تعالى : { وما كان معه من إله إذاً لذهب كل إله بما خلق ولعلا بعضهم على بعض } \\[ المؤمنون : 91 \\]. ووجه الملازمة التي بني عليها الدليل أن من شأن أهل السلطان في العرف والعادة أن يتطلبوا توسعة سلطانهم ويسعى بعضهم إلى بعض بالغزو ويتألّبُوا على السلطان الأعظم ليسلبوه ملكه أو بَعضه ، وقديماً ما ثارت الأمراء والسلاطين على ملك الملوك وسلبوه ملكه فلو كان مع الله آلهة لسلكوا عادة أمثالهم .وتمام الدليل محذوف للإيجاز يدل عليه ما يستلزمه ابتغاءُ السبيل على هذا المعنى من التدافع والتغالب اللازمين عرفاً لحالة طلب سبيل النزول بالقرية أو الحَي لقصد الغزو . وذلك المفضي إلى اختلال العالم لاشتغال مدبريه بالمقاتلة والمدافعة على نحو ما يوجد في ميثلوجيا اليونان من تغالب الأرباب وكَيد بعضهم لبعض ، فيكون هذا في معنى قوله تعالى : { لو كان فيهما آلهة إلا الله لفسدتا } \\[ الأنبياء : 22 \\]. وهو الدليل المسمى ببرهان التمانع في علم أصول الدين ، فالسبيل على هذا المعنى مجاز عن التمكن والظفر بالمطلوب . والابتغاء على هذا ابتغاء عن عداوة وكراهة .وقوله : { كما تقولون } على هذا الوجه تنبيه على خطئهم ، وهو من استعمال الموصول في التنبيه على الخطأ .والمعنى الثاني : أن يكون المراد بالسبيل سبيل الوصول إلى ذي العرش ، وهو الله تعالى ، وصول الخضوع والاستعطاف والتقرب ، أي لطلبوا ما يوصلهم إلى مرضاته كقوله : { يبتغون إلى ربهم الوسيلة } \\[ الإسراء : 57 \\].ووجه الاستدلال أنكم جعلتموهم آلهة وقلتم ما نعبدهم إلا ليكونوا شفعاءنا عند الله ، فلو كانوا آلهة كما وصفتم إلهيتهم لكانوا لا غنى لهم عن الخضوع إلى الله ، وذلك كاف لكم بفساد قولكم ، إذ الإلهية تقتضي عدم الاحتياج فكان مآل قولكم إنهم عباد لله مكرمون عنده ، وهذا كاف في تفطنكم لفساد القول بإلهيتهم .والابتغاء على هذا ابتغاء محبة ورغبة ، كقوله : { فمن شاء اتخذ إلى ربه سبيلا } \\[ المزمّل : 19 \\]. وقريب من معناه قوله تعالى : { وقالوا اتخذ الرحمان ولداً سبحانه بل عباد مكرمون } \\[ الأنبياء : 26 \\] ، فالسبيل على هذا المعنى مجاز عن التوسل إليه والسعي إلى مرضاته .وقوله : { كما تقولون } على هذا المعنى تقييد للكون في قوله : { لو كان معه آلهة أي لو كان معه آلهة حال كونهم كما تقولون ، أي كما تصفون إلهيتهم من قولكم : { هؤلاء شفعاؤنا عند الله } \\[ يونس : 18 \\].واستحضار الذات العلية بوصف { ذي العرش } دون اسمه العَلم لما تتضمنه الإضافة إلى العرش من الشأن الجليل الذي هو مثار حسد الآلهة إياه وطمعهم في انتزاع ملكه على المعنى الأول ، أو الذي هو مطمع الآلهة الابتغاء من سعة ما عنده على المعنى الثاني .وقرأ الجمهور { كما تقولون } بتاء الخطاب على الغالب في حكاية القول المأمور بتبليغه أن يحكى كما يقول المبلغ حين إبلاغه . وقرأه ابن كثير وحفص بياء الغيبة على الوجه الآخر في حكاية القول المأمور بإبلاغه للغير أن يحكى بالمعنى . لأن في حال خطاب الآمر المأمور بالتبليغ يكون المبلغ له غائباً وإنما يصير مخاطباً عند التبليغ فإذا لوحظ حاله هذا عبر عنه بطريق الغيبة كما قرىء قوله تعالى : { قل للذين كفروا ستغلبون } \\[ آل عمران : 12 \\] بالتاء وبالياء أو على أن قوله : { كما يقولون } اعتراض بين شرط ( لو ) وجوابه .\n\n",
      "translations": [
        {
          "translation": "(Say (0 Muhammad, to the disbelievers): If there were other gods along with Him, as they say, then had they sought a way against the Lord of the Throne) they would have sought status and prestige with Allah; it is also said that this means: they would have sought to rise up to Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { قلْ } يا محمد: { لو كان معه } في الوجود { آلهةٌ } تستحق أن تُعبد\n { كما تقولون } أيها المشركون\n أو كما يقول المشركون أيها الرسول\n { إِذًا لابتَغَوا } لطلبوا { إلى ذي العرش سبيلاً } طريقًا يقاتلونه\n وهذا جواب عن مقالتهم الشنعاء\n والمعنى: لطلبوا إلى من هو ملك الملك طريقًا بالمعاداة\n كما تفعل الملوك بعضهم مع بعض\n وهذا كقوله:\n[المؤمنون: 91]\n وقيل: لابتغوا إليه سبيلاً بالتقرب إليه والطاعة لعلمهم بقدرته\n وتحققهم بعجزهم\n كقوله:\n[الإسرَاء: 57]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:26",
      "similarity": 0.5283750376394689
    },
    {
      "verse": "20:5",
      "similarity": 0.5008037881704103
    },
    {
      "verse": "9:129",
      "similarity": 0.42217301258432693
    },
    {
      "verse": "27:38",
      "similarity": 0.4105573703111912
    },
    {
      "verse": "27:41",
      "similarity": 0.40819749520032694
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}