{
  "chapter": "الإسراء",
  "text": "نحن اعلم بما يستمعون به اذ يستمعون اليك واذ هم نجوى اذ يقول الظلمون ان تتبعون الا رجلا مسحورا",
  "translations": [
    {
      "translation": "We know how they listen when they listen to you, and when they confer together secretly, and when the wrongdoers say, 'You are only following a man who is bewitched!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know well with what (intent) they hear you, for when they confer privately the wicked say: \"You follow but a man deluded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are well aware of what they wish to hear when they listen to you and what they say when they confer in whispers, when the wrong-doers say: \"You are only following one who is bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know what they want to hear when they listen to you. They whisper to each other and say, \"You are only following a bewitched person\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know well why they listen when they lend ears to you, and when they discuss among themselves, when the unjust say, “You have not followed except a man who is under a magic spell.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best of what they listen to, when they listen to you. And when they take secret counsel, then the wrongdoers say: \"You follow none but a bewitched man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best what they listen to when they listen to you, and when they take counsel secretly, when the unjust say: You follow only a man deprived of reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know very well how they listen when they listen to thee, and when they conspire, when the evildoers say, 'You are only following a man bewitched!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are Best Aware of what they wish to hear when they give ear to thee and when they take secret counsel, when the evil-doers say: Ye follow but a man bewitched.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are fully aware of what they wish to hear when they listen to you; and what they say when they converse in private; and when the wrongdoers say, \"You are only following a man who is bewitched!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are Best Knower of that wherewith they listen what time they listen to thee and what time they counsel together in secret, when the wrong-doers say: ye but follow a man enchanted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best what they listen for, when they listen to you, and when they hold their secret talks, when the wrongdoers say, ‘[If you follow him] You will be following just a bewitched man.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best why it is they listen, when they listen to thee; and when they meet in private conference, behold, the wicked say, \"Ye follow none other than a man bewitched!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best of what they listen to, when they listen to you. And when they take secret counsel, behold, the Zalimun (polytheists and wrong-doers, etc.) say: \"You follow none but a bewitched man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they listen to you, We know very well how they listen. When they conspire, when the evildoers declare: 'You are only following a man who is bewitched'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know well what they listen to, when they listen to you, as they conspire, when the wrongdoers say, “You only follow a man bewitched.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are most knowing of how they listen to it when they listen to you and [of] when they are in private conversation, when the wrongdoers say, \"You follow not but a man affected by magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:47] We know best what they listen to, the reason for [which they listen to] it, in order to mock [it], when they listen to you, [to] your recital, and when they are in secret counsel, holding secret talks among themselves, in other words, when they talk, when (idh substitutes for the preceding idh, ‘when’) the evildoers say, in their secret conversation: ‘You are only following a man bewitched, one duped, his mind overcome’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We are best aware of what they wish to hear) the recitation of the Qur'an (when they give ear to you) when they listen to your recitation, i.e. Abu Jahl and his host (and when they take secret counsel) about your matter; some of them say you are a sorcerer, some a soothsayer, some a madman and others say you are a poet, (when the evil-doers say) when the idolaters say to one another: (Ye follow but a man bewitched) you follow Muhammad and he is bewitched.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِن تَتَّبِعُونَ إِلاَّ رَجُلاً مَّسْحُوراً } أي لَهُ سِحرٌ\n\n",
      "translations": [
        {
          "translation": " And His saying, {You only follow a man who is spellbound}, that is, he has magic.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولا تبال يا أكمل الرسل بهم، وبسماعهمه واستماعهم وعدمه، ولا تلتفت نحوهم؛ إذ { نَّحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِ } أي: يفرضون المتعلق باستماعهم الذي هو الاستهزاء والسخرية، وقت { إِذْ يَسْتَمِعُونَ إِلَيْكَ وَ } كيف لا يكونون مستهزئين مستسخرين { إِذْ هُمْ } حين استماعهم كلامك { نَجْوَىٰ } أي: ذوو مناجاة، يضمرون في نفوسهم مقتك وهلاكك، وأقله الاستهزاء معك؟! اذكر { إِذْ يَقُولُ ٱلظَّالِمُونَ } منهم على سبيل العناد والمكابرة لأهل العدل والتوحيد: { إِن تَتَّبِعُونَ } أي: ما تتبعون أيها الضالون { إِلاَّ رَجُلاً مَّسْحُوراً } [الإسراء: 47] سحر به فجن، فاختلط كلامه، وذهب عقله، وتكلم من تلقاء نفسه كلاماً يشبه كلام العقلاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:153",
      "similarity": 0.41469588438954935
    },
    {
      "verse": "26:185",
      "similarity": 0.41469588438954935
    },
    {
      "verse": "37:15",
      "similarity": 0.41109955326495606
    },
    {
      "verse": "7:112",
      "similarity": 0.393213184545748
    },
    {
      "verse": "26:37",
      "similarity": 0.393213184545748
    }
  ]
}