{
  "chapter": "الإسراء",
  "text": "افاصفىكم ربكم بالبنين واتخذ من الملئكة انثا انكم لتقولون قولا عظيما",
  "translations": [
    {
      "translation": "Has your Lord honoured you with sons and Himself taken the angels as daughters? It is truly something terrible that you say!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has God chosen to give you sons, and taken for Himself daughters from among the angels? You utter grievous things indeed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, has your Lord favoured you with sons and has taken for Himself daughters from among the angels? You are indeed uttering a monstrous lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Pagans) has your Lord given you preference over Himself by granting you sons and taking the angels as His own daughters? What you say is a monstrous utterance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has your Lord chosen sons for you, and created daughters for Himself from among the angels? Indeed you utter a profound word!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has then your Lord preferred for you sons, and taken for Himself from among the angels daughters Verily, you indeed utter an awful saying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! has then your Lord preferred to give you sons, and (for Himself) taken daughters from among the angels? Most surely you utter a grievous saying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, has your Lord favoured you with sons and taken to Himself from the angels females? Surely it is a monstrous thing you are saying!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath your Lord then distinguished you (O men of Makka) by giving you sons, and hath chosen for Himself females from among the angels? Lo! verily ye speak an awful word!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Has your Lord then favoured you with sons and Himself adopted females from among the angels? What you say is monstrous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath then your Lord distinguished you with sons and taken for Himself females from among the angels? Verily ye say a saying mighty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did your Lord prefer you for sons, and [Himself] adopt females from among the angels? Indeed, you say a monstrous word!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has then your Lord (O Pagans!) preferred for you sons, and taken for Himself daughters among the angels? Truly ye utter a most dreadful saying!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has then your Lord (O pagans of Makkah) preferred for you sons, and taken for Himself from among the angels daughters. Verily! You utter an awful saying, indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Has your Lord favored you with sons and taken to Himself females from among the angels? Indeed, you utter a monstrous thing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has your Lord favored you with sons, while choosing for Himself daughters from among the angels? You are indeed saying a terrible thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, has your Lord chosen you for [having] sons and taken from among the angels daughters? Indeed, you say a grave saying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:40] Has your Lord then preferred you, has He distinguished you [exclusively], O Meccans, with sons and chosen for Himself females from among the angels?, as daughters for Himself, in the way that you [are wont to] claim. Truly, by [saying] this, you are speaking a monstrous word!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hath your Lord then distinguished you) chosen you ((0 men of Mecca) by giving you sons, and hath chosen for Himself females from among the angels) as daughters? (Lo! verily you speak) about Allah (an awful word!) which deserves a severe punishment; it is also said that this means: you speak an awful word as a lie about Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَفَأَصْفَاكُمْ رَبُّكُم بِٱلْبَنِينَ } معناه اخْتَصَّكُمْ بهِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Exalted is your Lord, the Lord of might}, [means that] He has distinguished you with it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } تزعمون أيها المشركون المستكبرون أن الله المتعزز برداء العظمة والكبرياء فضَّلكم على نفسه { فَأَصْفَاكُمْ } أي: خصصكم واجتباكم { رَبُّكُم بِٱلْبَنِينَ } الذين هم أكرم الأولاد وأشرفها { وَٱتَّخَذَ } لنفسه أولاداً { مِنَ ٱلْمَلاۤئِكَةِ إِنَاثاً } نواقص عقلاً وديناً { إِنَّكُمْ } أيها المسرفون بإقدامكم واجترائكم على الله بأمثال هذه الهذيانات الباطلة { لَتَقُولُونَ } في حق الله { قَوْلاً عَظِيماً } [الإسراء: 40] بهتاناً وزوراً\n تعالى الله عما يقولون علواً كبيراً\n\n\nإذ نسبة الأولاد إلى الصمد المنزه عن الأنداد في نهاية الشناعة والفساد\n وأشنعُ منه نسبة الإناث إليه\n ثمَّ نسبة الملائكة الذين هم من أفضل عباد الله وأشرفهم إلى الأنوثة المستحقرة المذمومة شرعاً وعقلاً\n هذا مع غاية الإفراط في حق الله\n والتفريط في خلَّص عباده\n لذلك وصف سبحانه هذا القول الشنيع بالعظمة\n\n\nثمَّ قال سبحانه توبيخاً لهم وتقريعاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واتخذَ من الملائكة إِناثًا } بناتٍ لنفسه\n { إِنكم لتقولون قولاً عظيمًا } أي: عظيم النكر والشناعة\n لا يُقْدَرُ قَدْرُهُ في إيجاب العقوبة لخرمه لقضايا العقول\n بحيث لا يجترئ عليه أحد حيث تجعلونه تعالى من قبيل الأجسام المتجانسة السريعة الزوال\n ثم تضيفون إليه ما تكرهونه\n وتُفضلون عليه أنفسكم بالبنين\n ثم جعلتم الملائكة\n الذين هم أشرف الخلق\n أدونهم\n تعالى الله عن قولكم علوًا كبيرًا\n الإشارة: ينبغي للإنسان الكامل أن يكون في أموره كلها على بينة من ربه\n فَيُحَكِّمُ على ظاهره الشريعة المحمدية\n وعلى باطنه الحقيقة القدسية\n فإذا تجلى في باطنه شيء من الواردات أو الخواطر فليعرضه على الكتاب والسُنَّة\n فإن قبلاه أظهره وفعله\n وإلاَّ رده وكتمه\n كان ذلك الأمر قوليًا أو فعليًا\n أو تركًا او عقدًا فقد انعقد الإجماع على أنه لا يحل لامرئٍ مسلم أن يقدم على أمر حتى يعلم حكم الله فيه\n وإليه الإشارة بقوله: { ولا تَقْفُ ما ليس لك به علم } \n فإن لم يجد نصًا في الكتاب أو السنة فليستفت قلبه\n إن صفا من خوض الحس\n وإن لم يَصْفُ فليرجع إلى أهل الصفاء\n وهم أهل الذكر\n قال تعالى:\n[النّحل: 43]\n ولا يستفت أهل الظنون\n وهم أهل الظاهر\n قال تعالى:\n[يُونس: 36]\n وقال القشيري في تفسير الآية هنا: { ولا تَقْفُ ما ليس لك به علم } أي: جانب محاذاة الظنون\n وما لم يُطْلِعْكَ الله عليه\n فلا تتكلف الوقوف عليه من غير برهان\n فإذا أُشْكِلَ عليك شيءٌ في حكم الوقت\n فارجعْ إلى الله\n فإِنْ لاحَ لقلبك وَجْهٌ من التحقيق فكن مع ما أريد\n وإن بقي الحال على حدِّ الالتباس فَكِلْ عِلْمَه إلى الله\n وقِفْ حيثما وقفت\n ويقال: الفرق بين من قام بالعلم\n ومن قام بالحق: أنَّ العلماء يعرفون الشيء أولاً\n ثم يعملون بعلمهم\n وأصحابُ الحقائق يجْرِي\n بحكم التصريف عليهم\n شيءٌ\n ولا عِلمَ لهم به على التفصيل\n وبعد ذلك يُكْشَف لهم وجههُ\n فربما يجري على لسانهم شيءٌ لا يدرون وَجْهَه\n ثم بعد فراغهم من النطق به يظهر لقلوبهم برهانُ ما قالوه من شواهد العلم إذ يتحقق ذلك بجريان الحال في ثاني الوقت\n\nانتهى\n قلت: وإلى هذا المعنى أشار في الحكم العطائية بقوله: \" الحقائق ترد في حال التجلي مُجْمَلَةً\n وبعد الوعي يكون البيان\n { فإذا قرأناه فاتبع قرآنه } \"\n قوله تعالى: { ولا تمشِ في الأرض مرحًا } \n ورد في بعض الأخبار\n في صفة مشي الصوفية: أنهم يدبون على أقدامهم دبيب النمل\n متواضعين خاشعين\n ليس فيه إسراع مُخل بالمروءة\n ولا اختيال مُخل بالتواضع\n والله تعالى أعلم\n ثمَّ أمر بالرجوع إلى كتابه فقال: { وَلَقَدْ صَرَّفْنَا فِي هَـٰذَا ٱلْقُرْآنِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:153",
      "similarity": 0.7014549638962905
    },
    {
      "verse": "43:16",
      "similarity": 0.6803965990627491
    },
    {
      "verse": "22:75",
      "similarity": 0.628334695330436
    },
    {
      "verse": "38:47",
      "similarity": 0.6216006253288462
    },
    {
      "verse": "7:144",
      "similarity": 0.5574922831675002
    }
  ]
}