{
  "chapter": "الإسراء",
  "text": "تسبح له السموت السبع والارض ومن فيهن وان من شىء الا يسبح بحمده ولكن لا تفقهون تسبيحهم انه كان حليما غفورا",
  "translations": [
    {
      "translation": "The seven heavens and the earth and everyone in them glorify Him. There is nothing which does not glorify Him with praise but you do not understand their glorification. He is All-Forbearing, Ever-Forgiving.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven skies, the earth, and all that lies within them, sing hallelujas to Him. There is nothing that does not chant His praises, but you do not understand their hymns of praise. He is verily clement and forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens, the earth, and all that is within them give glory to Him. There is nothing but gives glory to Him with His praise, though you do not understand their hymns of praise. He is Most Forbearing, Exceedingly Forgiving.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens, the earth, and whatever is between them all glorify Him. There is nothing that does not glorify Him and always praise him, but you do not understand their praise and glorification. He is All-forbearing and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens and the earth and all those in them say His Purity; and there is not a thing that does not proclaim His purity with praise, but you do not understand their proclamation of purity; indeed He is Most Forbearing, Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens and the earth and all that is therein, glorify Him and there is not a thing but glorifies His praise. But you understand not their glorification. Truly, He is Ever Forbearing, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens declare His glory and the earth (too), and those who are in them; and there is not a single thing but glorifies Him with His praise, but you do not understand their glorification; surely He is Forbearing, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens and the earth, and whosoever in them is, extol Him; nothing is, that does not proclaim His praise, but you do not understand their extolling. Surely He is All-clement, All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens and the earth and all that is therein praise Him, and there is not a thing but hymneth His praise; but ye understand not their praise. Lo! He is ever Clement, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens and the earth and all who dwell therein glorify Him. There is not a single thing but glorifies Him with His praise; but you do not understand their glorification. Truly, He is forbearing and most forgiving.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There hallow Him the seven heavens and the earth and whosoever is therein. And naught there is but halloweth His praise, but ye understand not their hallowing; verily He is ever Forbearing, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens glorify Him, and the earth [too], and whoever is in them. There is not a thing but celebrates His praise, but you do not understand their glorification. Indeed, He is all-forbearing, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens and the earth, and all beings therein, declare His glory: there is not a thing but celebrates His praise; And yet ye understand not how they declare His glory! Verily He is Oft-Forbear, Most Forgiving!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens and the earth and all that is therein, glorify Him and there is not a thing but glorifies His Praise. But you understand not their glorification. Truly, He is Ever Forbearing, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens, the earth, and whosoever in them, exalt Him. There is nothing that does not exalt with His praise, but you do not understand their exaltation. Surely, He is Clement, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praising Him are the seven heavens, and the earth, and everyone in them. There is not a thing that does not glorify Him with praise, but you do not understand their praises. He is indeed Forbearing and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The seven heavens and the earth and whatever is in them exalt Him. And there is not a thing except that it exalts [Allah] by His praise, but you do not understand their [way of] exalting. Indeed, He is ever Forbearing and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:44] The seven heavens and the earth and all that is therein proclaim His praise, [they] affirm His transcendence. And there is not a thing, among things created, but proclaims, enwrapped [in], His praise, in other words, [everything] says subhāna’Llāh wa-bi-hamdihi, ‘Glory and praise be to God’; but you do not understand their glorification, because it is not [proclaimed] in your language. Lo! He is Forbearing, Forgiving, for He does not hasten [to bring about] your punishment.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The seven heavens and the earth and all that is therein) of created beings (praise Him, and there is not a thing) among plants (but hymneth his praise) His command; (but ye understand not their praise) you do not understand the language in which it is said. (Lo! He is ever Clement) with His servants since He does not hasten punishment on them, (Forgiving) of those who repent.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكيف تغفلون وتذهلون عن دلائل توحيده الحق وشواهده أيها الضالون المضلون، مع أنكم مجبولون على فطرة المعرفة والتوحيد، ومع ذلك { تُسَبِّحُ لَهُ } وتُقدّس ذاته عن الشريك والولد، والكفء والنظير { ٱلسَّمَٰوَٰتُ ٱلسَّبْعُ } المطبقة المعلقة المنضودة، المنظومة على أبلغ النظام وأعجبه، مع ما فيها من الكواكب المختلفة الألوان والأشكال، والمنازل والحركات والآثار المترتبة عليها، ومع ما فيها من عجائب المخلوقات، وغرائب المبدعات والمخترعات التي لا علم لنا إلاَّ بأنياتها دون لمياتها، كل ذلك يدل على وحدة مظهرها وبارئها { وَٱلأَرْضُ } وما عليها من أنواع النباتات والمعادن والحيوانات التي عجزت عن إحصائها ألسنة أولي البصائر والنهى، المعتبرين المتأملين في مصنوعات الحق، وعجائب مخترعاته { وَمَن فِيهِنَّ } من الملائكة والثقلين المجبولين على عبادة الحق وعرفانه\n\n\n\n\n{ وَ } بالجملة: { إِن مِّن شَيْءٍ } أي: ما من شيء مما يطلق عليه اسم الشيء، ويمتد عليه ظلُّ الوجود { إِلاَّ يُسَبِّحُ بِحَمْدِهِ } أي: ينزهه ويقدسه عن شوب الحدوث والإمكان، بعضها بالحال، وبعضها بالمقال، سيما عن أقوى أمارات الإمكان التي هي الإيلاد والاستيلاد\n\n\n\n\n{ وَلَـٰكِن لاَّ تَفْقَهُونَ } تفهمون أيها المنهمكون في الغيِّ والضلال { تَسْبِيحَهُمْ } لعدم اشتغالكم بالتدبر والتأمل في مصنوعات الحق، والتفكر في آياته، بل تنكرونها وتصرون على القدح فيها عناداً ومكابرةً، وتشركون بالله\n العياذ بالله منه\n أنداداً وبذلك استوجبتم أشدَّ العذاب والنكال، فأمهلكم الله { إِنَّهُ كَانَ حَلِيماً } لا يعاجل بالانتقام والعقوبة رجاءَ أن تتعظوا وترجعوا نحوه بالتوبة والندم على وجه الإخلاص، فيغفر زلتكم كلها، إنه كان { غَفُوراً } [الإسراء: 44] للأوَّابين التوابين، الرجَّاعين إليه بكمال الندم والإخلاص، وإن عظمت زلتهم، وثرت معصيتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يسبح له السماواتُ السبعُ } أي: تنزهه، { والأرضُ ومَن فيهن } كلها تدل على تنزيهه عن الشريك والولد، { وإِنْ من شيء إِلا يُسبح بحمده } ينزهه عما هو من لوازم الإمكان، وتوابع الحدوث، بلسان الحال، حيث تدل بإمكانها وحدوثها على الصانع القديم، الواجب لذاته\n قاله البيضاوي\n وظاهره: أن تسبيح الأشياء حَالِيُّ لا مقالي، والراجح أنه مقالي\n ثم مع كونه مقالياً لا يختص بقول مخصوص، كما قال الجلال السيوطي، أي: تقول: سبحان الله وبحمده\n بل كل أحد يُسبح بما يناسب حاله\n وإلى هذا يرشد كلام أهل الكاشف، حتى ذكر الحاتمي: أن من لم يسمعها مختلفة التسبيح لم يسمعها، وإنما سمع الحالة الغالبة عليه\n وورد في الحديث:\n\n \" ما اصطيد حوت في البحر، ولا طائر يطير، إلاَّ بما ضيع من تسبيح الله تعالى \" \n\nوفي الحديث أيضًا:\n\n \" ما تطلع الشمس فيبقى خلق من خلق الله، إلا يسبح الله بحمده، إلا ما كان من الشيطان وأعتى بني آدم \"\n \n\nومذهب أهل السنة: عدم اشتراط البِنية للعلم والحياة، فيصح الخشوع من الجماد، والخشية لله والتسبيح منه له\n وقد قال ابن حجر على حديث حنين الجذع: فيه دلالة على أن الجمادات قد يخلق الله لها إدراكًا كالحيوان، بل كأشرف الحيوان، وفيه تأييد لمن يحمل قوله: { وإِن من شيء إِلا يُسبح بحمده } على ظاهره\n هـ\n وقال ابن عطية: اختلف أهلُ العلم في هذا التسبيح فقالت فرقة: هو تجوز، ومعناه: أن كل شيء تبدو فيه صفة الصانع الدالة عليه، فتدعو رؤية ذلك إلى التسبيح من المعتبر\n وقالت فرقة: قوله: { من شيء }: لفظه عموم، ومعناه الخصوص في كل حي ونام، وليس ذلك في الجمادات الميتة\n\n\nفمن هذا قول عكرمة: الشجرة تُسبح، والاسطوانة لا تُسبح\n قال يزيد الرقاشي للحسن - وهما في طعام، وقد قدّم الخِوان-: أيسبح هذا الخوان يا أبا سعيد؟ فقال: قد كان يُسبح مدة\n يريد أن الشجرة، في زمان نموها واغتذائها، تُسَبح\n وقد صارت خوانًا أو نحوه، أي: صارت جمادًا\n وقالت فرقة: هذا التسبيح حقيقة، وكل شيء، على العموم، يُسبح تسبيحًا لا يسمعه البشر ولا يفقهه، ولو كان التسبيح ما قاله الآخرون من أنه أثر الصنعة، لكان أمرًا مفهومًا، والآية تنطق بأنه لا يُفقه، وينفصل عنه بأن يريد بقوله: { لا تفقهون }: الكفار والغفلة، أي: أنهم يُعرضون عن الاعتبار فلا يفقهون حكمة الله في الأشياء\n هـ\n قال شيخ شيوخنا سيدي عبد الرحمن العارف: وربما يدل للعموم تسبيح الحصى في يده - عليه الصلاة والسلام -، وكذا حنين الجذع ومحبة أُحد، وكذا تسبيح الطعام\n وأما التخصيص بالناميات من نبات غير يابس، وحجر متصل بموضعه، فهو خصوص تسبيح بالاستمداد إلى الحياة، ولا ينتفي مطلق الاستمداد لأن الجماد يستمد الوجود وبقاءه من الله، فهو عام، وقد قال تعالى:\n\n[سَبَأ: 10]، وتدبر حنين الجذع\n هـ\n وسيأتي في الإشارة بقية كلام عليه، وقال البيضاوي أيضًا في قوله: { ولكن لا تفقهون تسبيحهم } أيها المشركون لإخلالكم بالنظر الصحيح الذي به يفهم التسبيح\n ويجوز أن يحمل التسبيح على المشترك من اللفظ والدلالة لإسناده إلى ما يتصور منه اللفظ، وإلى ما لا يتصور منه، وعليهما، أي: ويحمل - عند من جوز إطلاق اللفظ على معنييه\n هـ\n { إِنه كان حليمًا } حيث لم يُعاجلكم بالعقوبة، مع ما أنتم عليه من موجباتها من الإعراض عن النظر في الدلائل الواضحة، الدالة على التوحيد، والانهماك في الكفر والإشراك، { غفورًا } لمن تاب منكم\n وبالله التوفيق\n الإشارة: كل ما دخل عالم التكوين من العرش إلى الفرش، أو ما قُدر وجوده من غيرهما كله قائم بين حس ومعنى، بين عبودية وربوبية، بين قدرة وحكمة\n فالحس محل العبودية، فيه تظهر قهرية الربوبية، والمعنى هو أسرار الربوبية القائمة بالأشياء، فالأشياء كلها تنادي بلسان معناها، وتقول: سبحانه ما أعظم شأنه، ولكن لا يفقه هذا التسبيح إلا من خاض بحار التوحيد، وغاص في أسرار التفريد\n فالأشياء ثابتة بإثباته، ممحوة بأحدية ذاته، قائمة من حيث حسها، ممحوة من حيث معناها، ولا وجود للحس من ذاته، وإنما هو رداء لكبرياء ذاته\n وفي الحديث، في وصف أهل الجنة:\n\n \" وليس بينهم وبين أن ينظروا إلى الرحمن إلا رداء الكبرياء على وجهه في جنة عدن \" \n\nفمن خرق حجاب الوهم، وفنى عن دائرة الحس في دار الدنيا، لم يحتجب الحق تعالى عنه في الدارين طرفة عين\n فتحصل أن الأشياء كلها تُسبح من جهة معناها بلسان المقال، ومن جهة حسها بلسان الحال، وتسبيحها كما ذكرنا\n ولا يذوق هذا إلا من صحب العارفين الكبار، حتى يخرجوه عن دائرة حس الأكوان إلى شهود المكون\n وحسب من لم يصحبهم التسليم، كما قال القائل:\n\nوالله تعالى أعلم\n وسبب عدم فقه التسبيح الأشياء غفلة القلوب وطبع الأكنة\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:28",
      "similarity": 0.40736260980625905
    },
    {
      "verse": "22:59",
      "similarity": 0.3681075663662759
    },
    {
      "verse": "2:29",
      "similarity": 0.3624544843190926
    },
    {
      "verse": "52:32",
      "similarity": 0.3504093614027063
    },
    {
      "verse": "2:225",
      "similarity": 0.3306416216252212
    }
  ]
}