{
  "chapter": "الإسراء",
  "text": "ولقد صرفنا فى هذا القرءان ليذكروا۟ وما يزيدهم الا نفورا",
  "translations": [
    {
      "translation": "We have made things clear in this Qur'an so that they might pay heed, but it only makes them run away the more!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have explained (the truth) in various ways in this Qur'an, that they may be warned; but it only increased their refractoriness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have expounded (the Truth) in diverse ways in this Qur'an that they might take it to heart but all this only aggravates their aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have given you various facts (about the Truth in this Quran) so that they (unbelievers) would take heed, but this has only increased their aversion (to the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have explained in this Qur’an in various ways, for them to understand; and it increases nothing except their hatred towards it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We have explained in this Qur'an that they may take heed, but it increases them in naught save aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have repeated (warnings) in this Quran that they may be mindful, but it does not add save to their aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have turned about in this Koran, that they may remember; and it increases them only in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We verily have displayed (Our warnings) in this Qur'an that they may take heed, but it increaseth them in naught save aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have explained [the truth] in this Quran in various ways, so that they may take heed, but it has only increased their aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assurelly We have propounded it variously in this Qur'an that they might be admonished, but it increaseth them only in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have variously paraphrased [the principles of guidance] in this Quran so that they may take admonition, but it increases them only in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have explained (things) in various (ways) in this Qur'an, in order that they may receive admonition, but it only increases their flight (from the Truth)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We have explained [Our Promises, Warnings and (set forth many) examples] in this Quran that they (the disbelievers) may take heed, but it increases them in naught save aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this Koran We have clarified so that they may remember; but it has only increased their aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have explained in this Quran in various ways, that they may remember, but it only adds to their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly diversified [the contents] in this Qur'an that mankind may be reminded, but it does not increase the disbelievers except in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:41] And verily We have dispensed, We have elucidated, in this Qur’ān, similitudes, promises [of reward] and threats [of retribution], so that they may remember, [that they may] be admonished, but it, that   [elucidation], only increases them in aversion, to the Truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We verily have displayed) We have indeed explained (in this Qur'an) Our promises and warnings (that they may take heed) that they may be admonished, (but it) the threat of the Qur'an (increaseth them in naught save aversion) from faith.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه توبيخاً لهم وتقريعاً، وإشارةً إلى تناهيهم في الضلال والطغيان: { وَلَقَدْ صَرَّفْنَا } وكررنا مراراً شناعةَ هذا القول؛ أي: نسبة الولد إلى الله الصمد المنزه في ذاته عن الأهل والولد { فِي هَـٰذَا ٱلْقُرْآنِ } المنزل لهداية أهل الغي والضلال { لِيَذَّكَّرُواْ } أي: ليتذكروا ويتعظوا، ويتفطنوا إلى وخامة عواقبه ومآله، ومع ذلك لم يتذكروا ولم يتفطنوا، بل { وَمَا يَزِيدُهُمْ } التكرار والمبالغة { إِلاَّ نُفُوراً } [الإسراء: 41] إعراضاً عن الحق، وإصراراً على ما عليه من الباطل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}