{
  "chapter": "الإسراء",
  "text": "وجعلنا على قلوبهم اكنة ان يفقهوه وفى ءاذانهم وقرا واذا ذكرت ربك فى القرءان وحده ولوا۟ على ادبرهم نفورا",
  "translations": [
    {
      "translation": "We have placed covers on their hearts, preventing them from understanding it, and heaviness in their ears. When you mention your Lord alone in the Qur'an, they turn their backs and run away.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We put covers over their hearts and deafness in their ears that they should not understand it. So when you invoke your Lord alone in the Qur'an they turn their backs and walk away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We place a covering on their hearts so that they do not comprehend it, and We cause a heaviness in their ears; and when you mention your Lord, the Only True Lord, in the Qur'an, they turn their backs in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We put a veil over their hearts so that they cannot understand it. We deafen their ears. When you mention your Lord in this Quran as One (Supreme Being), they run away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We placed covers upon their hearts so they may not understand it, and deafness in their ears; and when you mention your Only Lord in the Qur’an, they flee turning their backs in hatred.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have put Akinnah over their hearts, lest they should understand it, and in their ears deafness. And when you make mention of your Lord Alone in the Qur'an, they turn on their backs, fleeing in extreme dislike.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have placed coverings on their hearts and a heaviness in their ears lest they understand it, and when you mention your Lord alone in the Quran they turn their backs in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We lay veils upon their hearts lest they understand it, and in their ears heaviness. And when thou mentionest thy Lord only in the Koran, they turn in their traces in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We place upon their hearts veils lest they should understand it, and in their ears a deafness; and when thou makest mention of thy Lord alone in the Qur'an, they turn their backs in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We put veils over their hearts to prevent them from comprehending it, and We afflict their ears with deafness. When you mention your one and only Lord in your recitation of the Quran, they turn their backs in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We set up over their hearts veils lest they understand it, and in their ears heaviness and when thou mentionest in reciting the Qur'an thy Lord alone, they turn backward as averters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We cast veils on their hearts, lest they should understand it, and a deafness into their ears. When you mention your Lord alone in the Quran, they turn their backs in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We put coverings over their hearts (and minds) lest they should understand the Qur'an, and deafness into their ears: when thou dost commemorate thy Lord and Him alone in the Qur'an, they turn on their backs, fleeing (from the Truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have put coverings over their hearts lest, they should understand it (the Quran), and in their ears deafness. And when you make mention of your Lord Alone [La ilaha ill-Allah (none has the right to be worshipped but Allah) Islamic Monotheism] in the Quran, they turn on their backs, fleeing in extreme dislikeness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We lay veils upon their hearts and heaviness in their ears, lest they understand it. When you (Prophet Muhammad) mention your Lord alone in the Koran, they turn their backs in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We drape veils over their hearts, preventing them from understanding it, and heaviness in their ears. And when you mention your Lord alone in the Quran, they turn their backs in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And when you mention your Lord alone in the Qur'an, they turn back in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:46] And We place upon their hearts veils, covers, lest they should understand it, lest they should understand the Qur’ān, in other words, and so [in this way] they do not understand it, and in their ears a deafness, a heaviness, thus they cannot hear it. And when you mention your Lord alone in the Qur’ān, they turn their backs in aversion, to it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We place upon their hearts veils) coverings (lest they should understand it) such that they do not understand the Truth, (and in their ears a deafness; and when thou makest mention of thy Lord alone in the Qur'an) saying: there is no god but Allah, (they turn their backs) they return to their idols and resume the worship of their deities (in aversion) of what you say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَفِيۤ آذَانِهِمْ وَقْراً } أي صَمَماً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And in their hearing is deafness} [meaning] complete deafness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يكون الكافر محجوباً مستوراً عن سرائر القرآن ومرموزاته؛ إذ { جَعَلْنَا } أي: غطَّينا { عَلَىٰ قُلُوبِهِمْ أَكِنَّةً } غشاوةً كثيفةً تمنعهم { أَن يَفْقَهُوهُ } ويفهموا معناه { وَ } جعلنا { فِيۤ ءَاذَانِهِمْ وَقْراً } أي: حمماً وثقلاً، يمنعهم عن استماع ألفاظه حتى يتأملوا ويتدبروا في معناه { وَ } من غلظ غشاوتهم، وكثافة أكنتهم { إِذَا ذَكَرْتَ رَبَّكَ فِي ٱلْقُرْءَانِ وَحْدَهُ } منفرداً، بلا ذكر آلهتهم { وَلَّوْاْ عَلَىٰ أَدْبَٰرِهِمْ } معرضين كارهين { نُفُوراً } [الإسراء: 46] متنفرين ساخطين عليك؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أن يفقهوه }: مفعول من أجله، أي كراهة أن يفقهوه، و { نفورًا }: مصدر في موضع الحال\n والضمير في { به }: يعود على \" ما \" ، أي: نحن أعلم بالأمر الذي يستمعون به من الاستهزاء والسخرية\n يقول الحقّ جلّ جلاله: { وإِذا قرأتَ القرآنَ } الناطق بالتنزيه والتسبيح، ودعوتهم إلى العمل بما فيه من التوحيد، ورفض الشرك، وغير ذلك من الشرائع، { جعلنا } بقدرتنا ومشيئتنا المبنية على دواعي الحِكَمِ الخفية { بينَك وبين الذين لا يُؤمنون بالآخرة } ، خَصَّ الآخرة بالذكر من بين سائر ما كفروا به دلالة على أنها معظم ما أمروا بالإيمان به، وتمهيدًا لما سينقل عنهم من إنكار البعث، أي: جعلنا بينك وبينهم { حجابًا } يمنعهم عن فهمه والتدبر فيه، { مستورًا } عن الحس، خفيًا، معنويًا، وهو الران الذي يَسْبَحُ على قلوبهم من الكفر، والانهماك في الغفلة\n أو: ذا ستر، كقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:57",
      "similarity": 0.6838079885045696
    },
    {
      "verse": "6:25",
      "similarity": 0.6678355636507285
    },
    {
      "verse": "41:5",
      "similarity": 0.5704547797009831
    },
    {
      "verse": "51:2",
      "similarity": 0.42386012038841786
    },
    {
      "verse": "71:13",
      "similarity": 0.408516274095115
    }
  ]
}