{
  "chapter": "الإسراء",
  "text": "وربك اعلم بمن فى السموت والارض ولقد فضلنا بعض النبين على بعض وءاتينا داود زبورا",
  "translations": [
    {
      "translation": "My Lord knows best everyone in the heavens and earth. We favoured some of the Prophets over others. And We gave Dawud the Zabur.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows whoever is in the heavens and the earth. We exalted some of the prophets over the others; and to David We gave the Book of Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows all who dwell in the heavens and the earth. We have exalted some Prophets over others, and We gave the Psalms to David.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have given preference to some Prophets over others and We gave the psalms to David.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord knows well all those who are in the heavens and the earth; and indeed among the Prophets We gave excellence to some above others, and We gave the Zaboor to Dawud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord knows best all who are in the heavens and the earth. And indeed, We have preferred some of the Prophets above others, and to Dawud We gave the Zabur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord best knows those who are in the heavens and the earth; and certainly We have made some of the prophets to excel others, and to Dawood We gave a scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord knows very well all who are in the heavens and the earth; and We have preferred some Prophets over others; and We gave to David Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord is Best Aware of all who are in the heavens and the earth. And we preferred some of the prophets above others, and unto David We gave the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best about everyone in the heavens and on the earth. We gave some prophets more than others: We gave David the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thine Lord is the Best Knower of those who are in the heavens and the earth. And assuredly We have preferred some prophets over some others: and We vouchsafed unto Daud a Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best whoever is in the heavens and the earth. Certainly, We gave some prophets an advantage over the others, and We gave David the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is your Lord that knoweth best all beings that are in the heavens and on earth: We did bestow on some prophets more (and other) gifts than on others: and We gave to David (the gift of) the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord knows best all who are in the heavens and the earth. And indeed, We have preferred some of the Prophets above others, and to Dawud (David) We gave the Zabur (Psalms).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows very well all who are in the heavens and the earth. We have preferred some Prophets above others, and to David We gave the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows well everyone in the heavens and the earth. We have given some prophets advantage over others; and to David We gave the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is most knowing of whoever is in the heavens and the earth. And We have made some of the prophets exceed others [in various ways], and to David We gave the book [of Psalms].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:55] And your Lord knows best all who are in the heavens and the earth, thus endowing them [each one] with what He will, according to the measure of their states. And verily We have preferred some of the prophets above others, endowing each of them with a particular merit: Moses, with being spoken to; Abraham, with Friendship; and Muhammad (s), with the Night Journey; and We gave David the Psalms.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتماثل القرينتين في فاصلتيْ هذه الآية من كلمة { والأرض } وكلمة { على بعض } ، يدل دلالة واضحة على أنهما كلام مرتبط بعضه ببعض ، وأن ليس قوله : { وربك أعلم بمن في السماوات والأرض } تكملة لآية { ربكم أعلم بكم } \\[ الإسراء : 54 \\] الآية .وتغيير أسلوب الخطاب في قوله : { وربك أعلم } بعد قوله : { ربكم أعلم بكم } \\[ الإسراء : 54 \\] إيماء إلى أن الغرض من هذه الجملة عائد إلى شأن من شؤون النبي التي لها مزيد اختصاص به ، تقفية على إبطال أقوال المشركين في شؤون الصفات الإلهية ، بإبطال أقوالهم في أحوال النبي . ذلك أن المشركين لم يقبلوا دعوة النبي بغرورهم أنه لم يكن من عظماء أهل بلادهم وقادتهم ، وقالوا : أبعث الله يتيم أبي طالب رسولاً ، أبعث الله بشراً رسولاً ، فأبكتهم الله بهذا الرد بقوله : وربك أعلم بمن في السماوات والأرض } فهو العالم حيث يجعل رسالته .وكان قوله : { وربك أعلم بمن في السماوات والأرض } كالمقدمة لقوله : { ولقد فضلنا بعض النبيئين } الآية . أعاد تذكيرهم بأن الله أعلم منهم بالمستأهل للرسالة بحسب ما أعده الله فيه من الصفات القابلة لذلك ، كما قال الله تعالى عنهم { قالوا لن نؤمن حتى نؤتى مثل ما أوتي رسل الله الله أعلم حيث يجعل رسالاته } في سورة \\[ الأنعام : 124 \\].وكان الحكم في هذه المقدمة على عموم الموجودات لتكون بمنزلة الكلية التي يؤخذ منها كل حكم لجزئياتها ، لأن المقصود بالإبطال من أقوال المشركين جامع لصور كثيرة من أحوال الموجودات من البشر والملائكة وأحوالهم؛ لأن بعض المشركين أحالوا إرسال رسول من البشر ، وبعضهم أحالوا إرسال رسول ليس من عظمائهم ، وبعضهم أحالوا إرسال من لا يأتي بمثل ما جاء به موسى عليه الصلاة والسلام . وذلك يثير أحوالاً جمة من العصور والرجال والأمم أحياءً وأمواتاً . فلا جرم كان للتعميم موقع عظيم في قوله : { بمن في السماوات والأرض } ، وهو أيضاً كالمقدمة لجملة { ولقد فضلنا بعض النبيئين على بعض } ، مشيراً إلى أن تفاضل الأنبياء ناشىء على ما أودعه الله فيهم من موجبات التفاضل . وهذا إيجاز تضمن إثباتَ النبوءة وتقررها فيما مضى ما لا قبل لهم بإنكاره ، وتعدّدَ الأنبياء مما يجعل محمداً صلى الله عليه وسلم ليس بدعا من الرسل ، وإثباتَ التفاضل بين الأفراد من البشر ، فمنهم رسول ومنهم مرسل إليهم ، وإثباتَ التفاضل بين أفراد الصنف الفاضل . وتقرر ذلك فيما مضى تقرراً لا يستطيع إنكاره إلا مكابر بالتفاضل حتى بين الأفضلين سنةً إلهية مقررة لا نكران لها . فعلم أن طعنهم في نبوءة محمد صلى الله عليه وسلم طعن مكابرة وحسد . كما قال تعالى في شأن اليهود { أم يحسدون الناس على ما آتاهم الله من فضله فقد آتينا آل إبراهيم الكتاب والحكمة وآتيناهم مُلكاً عظيماً } في سورة \\[ النساء : 54 \\].وتخصيص داوود عليه السلام بالذكر عقب هذه القضية العامة وجهه صاحب «الكشاف» ومن تبعه بأن فائدة التلميح إلى أن محمداً صلى الله عليه وسلم أفضل الأنبياء وأمته أفضل الأمم لأن في الزبور أن الأرض يرثها عباد الله الصالحون . وهذا حسن . وأنا أرى أن يكون وجه هذا التخصيص الإيماء إلى أن كثيراً من الأحوال المرموقة في نظر الجاهلين وقاصري الأنظار بنظر الغضاضة هي أحوال لا تعوق أصحابها عن الصعود في مدارج الكمال التي اصطفاها الله لها ، وأن التفضيل بالنبوءة والرسالة لا ينشأ عن عظمة سابقة؛ فإن داوود عليه السلام كان راعياً من رعاة الغنم في بني إسرائيل ، وكان ذا قوة في الرمي بالحجر ، فأمر الله شاول ملك بني إسرائيل أن يختار داوود لمحاربة جالوت الكنعاني ، فلما قَتل داوودُ جالوتَ آتاه الله النبوءة وصيره ملِكاً لإسرائيل ، فهو النبي الذي تجلى فيه اصطفاء الله تعالى لمن لم يكن ذا عظمة وسيادة .وذكر إيتائه الزبور هو محل التعريض للمشركين بأن المسلمين سيرثون أرضهم وينتصرون عليهم لأن ذلك مكتوب في الزبور كما تقدم آنفاً . وقد أوتي داوود الزبور ولم يؤت أحد من أنبياء بني إسرائيل كتاباً بعد موسى عليه السلام .وذكر داوود تقدم في سورة الأنعام وفي آخر سورة النساء .وأما الزبور فذكر عند قوله تعالى : { وآتينا داوود زبورا } في آخر سورة \\[ النساء : 163 .والزبور : اسم لمجموع أقوال داوود عليه السلام التي بعضها مما أوحاه إليه وبعضها مما ألهمه من دعوات ومناجاة وهو المعروف اليوم بكتاب المزامير من كتب العهد القديم .\n\n",
      "translations": [
        {
          "translation": "(And thy Lord is best aware of all who are in the heavens and the earth) of the believers and what is best for them. (And we preferred some of the Prophets above others) through bestowing upon some Our friendship and speaking directly to others, (and unto David We gave the Psalms) and We gave Moses the Torah, Jesus the Gospel and Muhammad (pbuh) the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وسليمان بالمُلك العظيم { وَ } من جملة تفضيلنا: { آتَيْنَا دَاوُودَ زَبُوراً } [الإسراء: 55] مشتملاً على أنواع الحكمة\n وفصل الخطاب\n سيما على ألقاب خاتم الرسالة سيدنا محمد صلى الله عليه وسلم\n وظهوره ونسخة جميع الأديان والكتب\n وكون أمته أشرف الأمم\n ودينه أكمل الأديان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولذا قال: { وآتينا داود زبورًا } وقيل: هو إشارة إلى تفضيل نبينا محمد صلى الله عليه وسلم فإنه مذكور في الزبور\n وهو أنه خاتم الأنبياء\n وأمته خير الأمم\n وأنهم يرثون الأرض بالفتح عليهم قال تعالى:\n[الأنبياء: 105]\n والله تعالى أعلم\n الإشارة: من أوصاف الصوفية - رضي الله عنهم - أنهم هينون لينون كلَّفة حرير\n لا ينطقون إلا بالكلام الحسن\n ولا يفعلون إلا ما هو حسن\n ويفرحون ولا يحزنون وينبسطون ولا ينقبضون\n من رأوه مقبوضًا بسطوه\n ومن رأوه حزينًا فرّحوه\n ومن رأوه جاهلاً أرشدوه بالتي هي أحسن\n وهم متفاوتون في هذا الأمر\n مفضل بعضهم على بعض في الأخلاق والولاية\n فكل من زاد في الأخلاق الحسنة زاد تفضيله عند الله\n وفي الحديث:\n \" إنَّ الرَّجلُ لَيُدرِكُ بحُسْن الخلُق\n دَرَجََة الصَائِم النهار\n القَائِمِ اللَّيْل \" \nوبالله التوفيق\n ثم رجع إلى الكلام مع المشرعين والردّ عليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:196",
      "similarity": 0.6177214201134331
    },
    {
      "verse": "54:52",
      "similarity": 0.60409932417297
    },
    {
      "verse": "3:184",
      "similarity": 0.5948790567958683
    },
    {
      "verse": "35:25",
      "similarity": 0.5933847666253963
    },
    {
      "verse": "21:105",
      "similarity": 0.5614448451311755
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017055.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017055.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}