{
  "chapter": "الإسراء",
  "text": "فاذا جاء وعد اولىهما بعثنا عليكم عبادا لنا او۟لى باس شديد فجاسوا۟ خلل الديار وكان وعدا مفعولا",
  "translations": [
    {
      "translation": "When the promised first time came, We sent against you slaves of Ours possessing great force, and they ransacked your houses, rampaging right through them. It was a promise which was fulfilled.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when the time of the first prediction came, We sent against you Our creatures full of martial might, who ransacked your cities; and the prediction was fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when the occasion for the first of the transgressions arrived, We raised against you some of Our creatures who were full of might, and they ran over the whole of your land. This was a promise that was bound to be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We told them) during your first uprising of evil We shall send to you\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the first of those promises came, We sent upon you Our extremely militant bondmen – they therefore entered the cities pursuing you; and this was a promise that had to be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when the promise came for the first of the two, We sent against you servants of Ours given to terrible warfare. They entered the very innermost parts of your homes. And it was a promise (completely) fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the promise for the first of the two came, We sent over you Our servants, of mighty prowess, so they went to and fro among the houses, and it was a promise to be accomplished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when the promise of the first of these came to pass, We sent against you servants of Ours, men of great might, and they went through the habitations, and it was a promise performed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the time for the first of the two came, We roused against you slaves of Ours of great might who ravaged (your) country, and it was a threat performed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the time of the first of these warnings came, We sent against you  servants of Ours, of great might, who ravaged your homes. So the warning was fulfilled,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when the promise for the first of the two came, We raised against you bondmen of Ours endued with exceeding violence, so they entered the dwellings; and it was a promise fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the first occasion of the two [prophecies] came, We aroused against you Our servants possessing great might, and they ransacked [your] habitations, and the promise was bound to be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the first of the warnings came to pass, We sent against you Our servants given to terrible warfare: They entered the very inmost parts of your homes; and it was a warning (completely) fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when the promise came for the first of the two, We sent against you slaves of Ours given to terrible warfare. They entered the very innermost parts of your homes. And it was a promise (completely) fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the promise of the first came, We sent against you Our worshipers, those of great might, and they went through the habitations, and the promise was accomplished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the first of the two promises came true, We sent against you servants of Ours, possessing great might, and they ransacked your homes. It was a promise fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the [time of] promise came for the first of them, We sent against you servants of Ours - those of great military might, and they probed [even] into the homes, and it was a promise fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:5] So when the time for the first of the two [prophecies], the first of the two occasions for corruption, came, We roused against you servants of Ours of great might, men who are strong in war and assault, who ransacked, who came and went, seeking you out [through], [your] habitations, in the [very] midst of your homes, in order to slay you and take [others among] you captive, and it was a promise fulfilled. Their first act of corruption was their slaying of [the prophet] Zachariah. So Goliath and his army were roused against them, and they slew them and took their children captive and destroyed the Holy House [of Jerusalem].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So when the time for the first of the two) the first of the two punishments; it is also said that this means: the first of the two corruptions (came, We roused against you slaves of Ours) Nebuchadnezzar and the host of the king of Babylon (of great might) of tremendous fighting skills (who ravaged (your) country) who killed you in the streets in the middle of your country, (and it was a threat performed) a decreed threat that surely takes place, that if you do such-and-such I will do this to you. Thus they stayed in captivity of Nebuchadnezzar for 90 years until Allah helped them with Koresh from Hamadan [Persia].\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَجَاسُواْ خِلاَلَ ٱلدِّيَارِ } معناهُ قَتلُوا\n وخلالُ الدِّيارِ معناهُ بَينَ الدِّيارِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفاعلموا أيها المسرفون أنَّا ننتقم منكم في النشأة الأولى لكلّ جريمةٍ صدرت عنكم من الجريمتين العظيمتين { فَإِذَا جَآءَ وَعْدُ } انتقام { أُولاهُمَا } أي: أولى الجريمتين { بَعَثْنَا } وسلَّطنا { عَلَيْكُمْ } حين أردنا الانتقام، والأخذ عليها { عِبَاداً لَّنَآ } منتفعين عنكم من قبلنا { أُوْلِي بَأْسٍ شَدِيدٍ } وشوكةٍ عظيمةٍ، وصَوْلَةٍ قويةٍ، وإذا دخلوا عليكم { فَجَاسُواْ } أي: تجسسوا وترددوا لطلبكم { خِلاَلَ ٱلدِّيَارِ } ووسطها للتقل والاستئصال { وَكَانَ } ما ذُكر من الانتقام { وَعْداً } من الله { مَّفْعُولاً } [الإسراء: 5] حقّاً عليه إنجازه وإيقاعه، وذلك حين استولى بُختُنَصَّر عليهم، فقتل كبارهم، وسَبَى صغارهم، ونهب أموالهم، وخرب بلدانهم، وحرق التوراة، وخرب الأقصى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإِذا جاء وعدُ } عقاب { أُولاهما } أي: أول مرتي الإفساد بأن أفسدوا في الأرض المرة الأولى { بعثنا عليكم عبادًا لنا } بختنصر وجنوده { أُولي بأس شديد } ذوي قوة وبطش في الحرب شديد، { فجاسوا } فترددوا لطلبكم { خلال الديار } وسطه للقتل أو الغارة، فقتلوا كبارهم وسبوا صغارهم، وحرقوا التوراة، وخربوا المسجد\n وفي التذكرة للقرطبي: أنه سلط عليهم في المرة الأولى بخُتنصر، فسباهم، ونقل ذخائر بيت المقدس على سبعين ألف عَجَلَة، وبقوا في يده مائة سنة\n ثم رحمهم الله تعالى وأنقذهم من يده، على يد ملك من ملوك فارس، ثم عصوا، فسلط عليهم ملك الروم قيصر\n هـ\n قال تعالى: { وكان وعدًا مفعولاً } أي: وكان وعد عقابهم وعدًا مقضيًا لا بدّ أن يُفعل",
      "translations": []
    }
  ]
}