{
  "chapter": "الإسراء",
  "text": "ربكم اعلم بكم ان يشا يرحمكم او ان يشا يعذبكم وما ارسلنك عليهم وكيلا",
  "translations": [
    {
      "translation": "Your Lord knows you best. If He wills, He will have mercy on you, and, if He wills, He will punish you. We did not send you to be their guardian.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows you better: He may have mercy on you if He please, or punish you if He will. Yet We have not sent you as warden over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows you best. He will have mercy on you if He wills and chastise you if He wills. We have not sent you, (O Muhammad), as an overseer over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows better than you (people). He will have mercy on you or will punish you as He wills. We have not sent you to watch over them. Your Lord knows best about those in the heavens and the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows you well; if He wills He may have mercy upon you, or if He wills, He may punish you; and We have not sent you (O dear Prophet Mohammed – peace and blessings be upon him) as a guardian over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord knows you best; if He wills, He will have mercy on you, or if He wills, He will punish you. And We have not sent you as a guardian over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows you best; He will have mercy on you if He pleases, or He will chastise you if He pleases; and We have not sent you as being in charge of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows you very well; if He will, He will have mercy on you, or, if He will, He will chastise you. We sent thee not to be a guardian over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is Best Aware of you. If He will, He will have mercy on you, or if He will, He will punish you. We have not sent thee (O Muhammad) as a warden over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is fully aware of you. He may show you mercy if He will, or punish you if He will. We have not sent you as their guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is the Best Knower of you; if He willeth He will have mercy upon you, or if He willeth He will torment you. And We have not sent thee over them as a trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows you best. He will have mercy on you if He wishes, or punish you, if He wishes, and We did not send you to watch over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is your Lord that knoweth you best: If He please, He granteth you mercy, or if He please, punishment: We have not sent thee to be a disposer of their affairs for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows you best, if He will, He will have mercy on you, or if He will, He will punish you. And We have not sent you (O Muhammad SAW) as a guardian over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows you very well. He will have mercy on you if He will, or punish you if He will. We have not sent you to be their guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows you best. If He wills, He will have mercy on you; and if He wills, He will punish you. We did not send you as their advocate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is most knowing of you. If He wills, He will have mercy upon you; or if He wills, He will punish you. And We have not sent you, [O Muhammad], over them as a manager.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:54] Your Lord knows you best. If He will, He will have mercy on you, by way of [granting you] repentance and faith, or, if He will, for you to be chastised, He will chastise you, by having you die in disbelief. And We did not send you to be a guardian over them, and so compel them to [embrace] faith — this was [revealed] before the command to fight [them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Your Lord is best aware of you) He knows what is best for you. (If He will, He will have mercy on you) and save you from the people of Mecca, (or if He will, He will punish you) and arouse them against you. (We have not sent thee (0 Muhammad) as a warden over them) such that you will be taken to task over them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفلكم أيها الهادون الناصحون ألاَّ تغلطوا، ولا تخشنوا في دعوة الناس إلى طريق الحق، ولا تبالغوا أيضاً في إرشادهم وإهدائهم؛ إذ ما عليكم إلاَّ تبليغ ما أُمرتم بتبليغه، وليس في وسعكم وظاقتكم رشدهم وهدايتهم ألبتة؛ إذ هو مبين على العلم باستعداداتهم وقابليتهم، ولا علم لكم أيها الناصحون عليها، بل { رَّبُّكُمْ } الذي ربَّاكم أيها الناس المجبولون على فطرة المعرفة والإيمان { أَعْلَمُ بِكُمْ إِن يَشَأْ } هدايتَكم { يَرْحَمْكُمْ } على مقتضى جوده، ويوفقكم على قبول الإيمان، وحصول العرفان عانيةً منه وفضلاً { أَوْ إِن يَشَأْ يُعَذِّبْكُمْ } أي: يبقيكم ويغويكم في تيه الحرمان والخذلان، خاسرين خائبين بمتابعة الشيطان\n\n\n\n\n{ وَ } بالجلمة: { مَآ أَرْسَلْنَاكَ } يا أكمل الرسل، وأفضل البرايا، مع أنك لولاك ما خلقت الأفلاك؛ إذ كل من في العلم منوط بمرتبتك المحيطة الجامعة { عَلَيْهِمْ } أي: على الناس { وَكِيلاً } [الإسراء: 54] أي: ليكون أمروهم موكولاً إليك، بحيث إ ذا أردت هداية بعض، وضلال آخرين، فيقع مرادك بلا خلف، بل إنما أرسلناك مبلغاً بشيراً ونذيراً، وما عليك إلاَّ البلاغ، وعلينا الإصلاح والفساد؛ إذ نحن بكمال استغنائنا عن مطلق مظاهرنا ومصنوعاتنا، مستقلون في تدبيرات أمور ملكنا وملكوتنا، وشهادتنا وغيبنا، وجبروتنا ولاهوتنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يقولون لهم في المخاطبة الحسنة: { ربكم أعلمُ إِن يشأ يرحمْكُم } بالتوبة والإيمان، { أو إِن يشأ يُعذِّبكُم } بالموت على الكفر\n وهذا تفسير للكلمة التي هي أحسن، وما بينهما اعتراض، أي: قولوا هذه الكلمة ونحوها، ولا تصرحوا بأنهم من أهل النار فإنه يثير الشر، مع أن ختام أمرهم غيب\n { وما أرسلناك عليهم وكيلاً } موكولاً إليك أمرهم، فتجبرهم على الإيمان، وإنما أَرْسلْنَاكَ مبشرًا ونذيرًا، فَدارهِم، ومُر أصحابك باحتمال الأذى منهم\n رُوي أن المشركين أفرطوا في إيذائهم فشكوا إلى رسول الله صلى الله عليه وسلم فنزلت، وقيل: شتم رجل عمر رضي الله عنه، فهمَّ به، فأمره الله بالعفو\n { وربك أعلمُ بمن في السماوات والأرض } وبأحوالهم، فيختار منهم لنبوته وولايته من يشاء\n وهو رد لاستبعاد قريش أن يكون يتيم أبي طالب نبيًا، وأن يكون العُراة الجياع أصحابه\n { ولقد فضّلنا بعض النبيين على بعض } بالفضائل النفسانية، والتفرغ من العلائق الجسمانية، لا بكثرة الأموال والأتباع، حتى يستبعدوا نبوة سيدنا محمد صلى الله عليه وسلم لقلة ماله، وضعف أصحابه فإن سيدنا داود عليه السلام كان مثله في قلة ماله وأتباعه، ثم قواه بالملك والنبوة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:217",
      "similarity": 0.6218285987729187
    },
    {
      "verse": "39:62",
      "similarity": 0.6094217880910873
    },
    {
      "verse": "64:13",
      "similarity": 0.5833045144638859
    },
    {
      "verse": "27:79",
      "similarity": 0.572866302732654
    },
    {
      "verse": "6:102",
      "similarity": 0.5628166138046915
    }
  ]
}