{
  "chapter": "الإسراء",
  "text": "وما منعنا ان نرسل بالءايت الا ان كذب بها الاولون وءاتينا ثمود الناقة مبصرة فظلموا۟ بها وما نرسل بالءايت الا تخويفا",
  "translations": [
    {
      "translation": "Nothing has prevented Us sending you Signs except the fact that the previous peoples denied them. We gave Thamud the she-camel as a visible Sign, and then they mistreated her. We do not send Signs except to frighten people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing could stop Us from sending signs except that the earlier people had rejected them as lies. We sent to Thamud the she-camel as a token to make it clear to them, but they treated her cruelly; and We send signs only to deter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing hindered Us from sending Our Signs except that the people of olden times rejected them as lies. We publicly sent the she-camel to the Thamud to open their eyes but they wronged her. We never send Our Signs except to cause people to fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not abstain from sending miracles to any of Our Messengers. These miracles were called lies by the people who lived in ancient times. To the people of Thamud, We sent the she-camel as a visible miracle and they did injustice to it. We only send miracles as warnings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We remained constrained from sending such signs, because the former people denied them; and We gave the Thamud the she-camel for enlightenment, so they oppressed it; and We do not send such signs except to warn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing stops Us from sending the Ayat but that the people of old denied them. And We sent the she-camel to Thamud as a clear sign, but they did her wrong. And We sent not the signs except to make them afraid (of destruction).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing could have hindered Us that We should send signs except that the ancients rejected them; and We gave to Samood the she-camel-- a manifest sign-- but on her account they did injustice, and We do not send signs but to make (men) fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught prevented Us from sending the signs but that the ancients cried lies to them; and We brought Thamood the She-camel visible, but they did her wrong. And We do not send the signs, except to frighten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught hindereth Us from sending portents save that the folk of old denied them. And We gave Thamud the she-camel - a clear portent save to warn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing has prevented Us from sending signs, except the fact that previous peoples denied them. We gave the people of Thamud the she-camel as a clear sign, yet they mistreated her. We give signs only by way of warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught hinderedeth Us from sending the signs except that the ancients belied them. And We vouchsafed unto Thamud a she-camel as an illumination, but they did her wrong. And We send not the signs save to frighten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing keeps Us from sending signs except that the former peoples denied them. We gave Thamud the she-camel as an eye-opener, but they wronged her. We do not send the signs except as warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We refrain from sending the signs, only because the men of former generations treated them as false: We sent the she-camel to the Thamud to open their eyes, but they treated her wrongfully: We only send the Signs by way of terror (and warning from evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing stops Us from sending the Ayat (proofs, evidences, signs) but that the people of old denied them. And We sent the she-camel to Thamud as a clear sign, but they did her wrong. And We sent not the signs except to warn, and to make them afraid (of destruction).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing prevented Us from sending the signs but that the ancients belied them. To Thamood, We brought the shecamel as a visible (sign), yet they wronged her. We do not send signs except to frighten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing prevents Us from sending miraculous signs, except that the ancients called them lies. We gave Thamood the she-camel, a visible sign, but they mistreated her. We do not send the signs except to instill reverence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing has prevented Us from sending signs except that the former peoples denied them. And We gave Thamud the she-camel as a visible sign, but they wronged her. And We send not the signs except as a warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:59] Nothing prevented Us from sending the signs, requested by the people of Mecca, except that the ancients denied them, when We sent such [signs] and so We destroyed them: if We were to send them to these [people of Mecca], they would deny them and would thus deserve destruction. However, We have judged that they be given respite so that the mission of Muhammad (s) be completed. And We gave Thamūd the she-camel as, a sign [that was], apparent, [one that was] clear and evident, but they wronged, they disbelieved, it, and were therefore destroyed. And We do not send signs, miracles, except for deterrence, to servants, so that they might believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Naught hindereth Us from) We were not hindered from (sending portents) the proofs they requested (save that the folk of old denied them) except the denial of the people of old, for upon denial of these proofs, We shall destroy them just as We destroyed those before them. (And We gave Thamud the she-camel) We gave the people of Salih a pregnant she-camel (a clear portent) a clear sign for the prophethood of Salih (but they did wrong about her) they denied the sign and killed her. (We send not portents) signs (save to warn) from torment, for We destroy them if they do not believe in them. 305\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَآتَيْنَا ثَمُودَ ٱلنَّاقَةَ مُبْصِرَةً فَظَلَمُواْ بِهَا } معناه كفروا وقوله تعالى: { وَمَا جَعَلْنَا ٱلرُّءْيَا ٱلَّتِي أَرَيْنَاكَ إِلاَّ فِتْنَةً لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلْمَلْعُونَةَ فِي ٱلقُرْآنِ } فالفِتنةُ: البَِلاءُ\n والشَّجرةُ المَلعونِة: الزَِّقومُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا مَنَعَنَآ أَن نُّرْسِلَ بِٱلآيَاتِ } أي: ما صرفنا عن إرسال الآيات المقترحة عنك يا أكمل الرسل والإتيان بها { إِلاَّ أَن كَذَّبَ بِهَا } وبأمثالها { ٱلأَوَّلُونَ } أي: الأمم الماضون بعد إتيان ما اقترحوا عتواً وعناداً، فاستأصلناهم بتكذيبهم؛ إذ من سنتنا القديمة وعادتنا المستمرة استئصال المقترحين المكذبين على أنبيائنا بعد إتيانهم بمقترحاتهم، فلو حصل مقترحات هؤلاء المقترحين أيضاً ليكذبوك ألبتة، فلزم علينا حينئذٍ إهلاكهم واستئصالهم على مقتضى سنتنا المستمرة، لكن مضى حكمنا ألا ننتقم من مكذبيك في النشأة الأولى؛ لأن منهم من يؤمن ومنهم من يُولد مؤمناً، لذلك ما جئنا بمقترحاتهم\n\n\n\n\n{ وَ } اذكر لهم إن كانوا شاكين مترددين فيما ذكرنا بعض قصص الأمم الماضية المشهودة في الآفاق، وذكِّرهم كيف { آتَيْنَا ثَمُودَ ٱلنَّاقَةَ } المقترحة حين اقترحوا على نبينا صالح عليه السلام بإخراجها من الحجر المعيِّن، فأخرجها منه بإذن الله وقدرته، حال كون أعينهم { مُبْصِرَةً } خروجها منه، ومع ذلك { فَظَلَمُواْ بِهَا } أي: بالناقة بعدما أمرهم سبحانه بمحافظتها ورعايتها على لسان صالح، فكذبوه قعقروها، واستأصلناهم لأجلها، وأمثالها من الأمم الهالكة بتكذيبهم بعد إتيان ما اقترحوا أكثر من أن يحصى\n\n\n\n\n{ وَ } بالجملة: { مَا نُرْسِلُ } ونأتي { بِٱلآيَاتِ } المقترحة { إِلاَّ تَخْوِيفاً } [الإسراء: 59] من نزول العذاب المهلك المستأصِل على المقترحين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أنْ نرسل }: مفعول \" منعنا \" ، و { إلا أن كَذَّب }: فاعل\n يقول الحق جلّ جلاله: وما صَرَفَنَا عن إرسال الآيات التي اقْتَرَحَتْهَا قريش بقولهم: اجعل لنا الصّفَا ذَهَبًا، إلا تكذيب الأولين بها، فهلكوا، وهم أمثالهم في الطبع، كعاد وثمود، وأنها لو أرسلت لكذبوها، فيهلكوا أمثالهم، كما مضت به سنتُنا، وقد قضينا في أزلنا ألا نستأصلهم لأن فيهم من يُؤمن، أو يلد من يؤمن\n ثم ذكر بعض الأمم المهلكة بتكذيب الآيات المقترحة فقال: { وآتينا ثمودَ الناقةَ } بسبب سؤالهم، { مُبصرةً } بينة ذات إبصار، أو بصائر واضحة الدلالة، يُدركها كلُّ من يبصرها\n { فظلموا بها } فكفروا بها، أو: فظلموا أنفسهم بسبب عقرها، فهلكوا، { وما نُرسل بالآياتِ } المقترحة { إِلا تخويفًا } من نزول العذاب المستأصِلِ، فإن لم يخافوا نزل بهم، أو: وما نرسل بالآيات غير المقترحة، كالمعجزات وآيات القرآن، إلا تخويفًا بعذاب الآخرة فإن أمر من بعث إليهم مؤخر إلى يوم القيامة\n قاله البيضاوي\n قال في الحاشية: ومقتضى حديث الكسوف، وقوله فيه: \" ذلك يُخوف بهما عبادة \": أن التخويف لا يختص بالخوارق، بل يعم غيرها، مما هو معتاد نفيه، ويأتي غِبا\n وفي الوجيز: بالآيات أي: العبر والدلالات\n وفي الورتجبي: الآيات هي: الشباب والكهولة والشيبة، وتقلب الأحوال بك، لعلك تعتبر بحال، أو تتعظ بوقت\n هـ\n الإشارة: إمساك الكرامات عن المريد السائر أو الولي: رحمة واعتناء به، فلعله حين تظهر له، يقف معها ويستحسن حاله، أو يزكي نفسه ويرفع عنها عصا التأديب، فيقف عن السير، ويُحرم الوصول إلى غاية الكمال، وفي الحكم: \" ما أرادت همة سالك أن تقف عندما كشف لها، إلاّ نادته هواتف الحقيقة: الذي تطلب أمامك \"\n وقال الششتري رضي الله عنه:\n",
      "translations": []
    }
  ]
}