{
  "chapter": "الإسراء",
  "text": "وان من قرية الا نحن مهلكوها قبل يوم القيمة او معذبوها عذابا شديدا كان ذلك فى الكتب مسطورا",
  "translations": [
    {
      "translation": "There is no city We will not destroy before the Day of Rising, or punish with a terrible punishment. That is inscribed in the Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a habitation We shall not destroy before the Day of Resurrection, or not inflict severe punishment upon it. This is in accordance with the law (of God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a town but We shall destroy it or upon which We shall inflict severe chastisement before the Day of Resurrection. This is written down in the Eternal Book (of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The decree that all the towns were to be destroyed or afflicted with severe punishment was already written in the Book before the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no such dwelling but which We shall destroy before the Day of Resurrection, or punish it severely; this is written in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not a town (population) but We shall destroy it before the Day of Resurrection, or punish it with a severe torment. That is written in the Book (of Our decrees)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not a town but We will destroy it before the day of resurrection or chastise it with a severe chastisement; this is written in the Divine ordinance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No city is there, but We shall destroy it before the Day of Resurrection, or We shall chastise it with a terrible chastisement; that is in the Book inscribed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a township but We shall destroy it ere the Day of Resurrection, or punish it with dire punishment. That is set forth in the Book (of Our decrees).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there is not a town [community] but We shall destroy or sternly punish it before the Day of Judgement. That is recorded in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not a town is there but VVe are going to destroy it before the Day of Judgment or to torment it With a severe torment; that is in the Book inscribed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a town but We will destroy it before the Day of Resurrection, or punish it with a severe punishment. That has been written in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a population but We shall destroy it before the Day of Judgment or punish it with a dreadful Penalty: that is written in the (eternal) Record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not a town (population) but We shall destroy it before the Day of Resurrection, or punish it with a severe torment. That is written in the Book (of our Decrees)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no village except that it shall be destroyed or that We will punish it with a stern punishment before the Day of Resurrection. That is inscribed in theBook.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no city but We will destroy before the Day of Resurrection, or punish it with a severe punishment. This is inscribed in the Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no city but that We will destroy it before the Day of Resurrection or punish it with a severe punishment. That has ever been in the Register inscribed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:58] There is not a town — its inhabitants are the ones meant — but We shall destroy it before the Day of Resurrection, through death, or chastise it with terrible chastisement, by killing [its inhabitants] or otherwise. That has been inscribed in the Book, the Preserved Tablet (al-lawh al-mahfūz).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There is not a township but We shall destroy it) We shall destroy its people (ere the Day of Resurrection, or punish it with dire punishment) with the sword and diseases. (That) destruction and torment (is set forth in the Book (of Our decrees)) is written in the Guarded Tablet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِن مِّن قَرْيَةٍ إِلاَّ نَحْنُ مُهْلِكُوهَا } بالمَوتِ { أَوْ مُعَذِّبُوهَا } بالسَّيفِ\n\n\n\n\nوقوله تعالى: { كَانَ ذٰلِك فِي ٱلْكِتَابِ مَسْطُوراً } معناهُ مَكتوبٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {And no city but We will destroy it} [by] death {or punish it} [with] the sword.\n And His saying, {It is in the Book, excellently recorded}, its meaning is [that it is] written.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: ِ { وَإِن مِّن قَرْيَةٍ } أي: ما من قريةٍ من القرى الهالكة { إِلاَّ نَحْنُ مُهْلِكُوهَا قَبْلَ يَوْمِ ٱلْقِيَامَةِ } بالخسف والكسف\n والزلزلة والطاعون وغير ذلك { أَوْ مُعَذِّبُوهَا عَذَاباً شَدِيداً } كالقتل والنهب والأسر\n وأنواع البليات والآذيات والمصيبات { كَانَ ذٰلِك } الإهلاك والتعذيب { فِي ٱلْكِتَابِ } الذي هو عبارة عن حضرة علمنا\n ولوح قضائنا { مَسْطُوراً } [الإسراء: 58] على التفصيل الذي وقع بلا مخالفةٍ أصلاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وإِن من قرية } أي: أهلها، { إلا نحن مُهلكوها قبلَ يوم القيامة } بالموت والاستئصال، { أو مُعذبوها عذابًا شديدًا } بالقتل وغيره، { كان ذلك في الكتاب } في اللوح المحفوظ { مسطورًا } مكتوبًا. وقال في المستخرج: وإن من قرية إلا نحن مهلكوها الصالحة بالإفناء، والطالحةُ بالبلاء، أو معذبوها بالسيف إذا ظهر فيهم الزنى والربا. هـ. قال ابن جزي: رُوي أن هلاك مكة بالحبشة، والمدينة بالجوع، والكوفة بالترك، والأندلس بالخيل. ثم قال: وأما هلاك قرطبة وأشبيلية وطُليطلة وغيرها، فبأخذ الروم لها. هـ. قلت: قد استولى العدو على الأندلس كلها فهو خرابها. أعاد الله عمارتها بالإسلام. آمين. وقال في حُسْن المحاضرة: وأخرج الحاكم في المستدرك عن كعب قال: الجزيرة آمنة من الخراب حتى تخرب أرمينية - والجزيرة أرض بالبصرة، وموضع باليمامة، لا جزيرة الأندلس - ثم قال: ومصر آمنة من الخراب حتى تخرب الجزيرة: والكوفة آمنة من الخراب حتى تخرب مصر، ولا تكون الملحمة حتى تخرب الكوفة، ولا تفتح مدينة الكفر حتى تكون الملحمة، ولا يخرج الدجال حتى تُفتح مدينة الكفر. قال: وأخرج الديلمي في مسند الفردوس، وأورده القرطبي في التذكرة من حديث حذيفة مرفوعًا: يبدو الخراب في أطراف الأرض، حتى تخرب مصر، ومصر آمنة من الخراب حتى تخرب البصرة، وخراب البصرة من العراق، وخراب مصر من جفاف النيل، وخراب مكة من الحبشة، وخراب المدينة من الجوع، وخراب اليمن من الجراد، وخراب الأُبُلَّةِ من الحِصار، وخراب فارس من الصعاليك، وخراب الترك من الديلم، وخراب الديلم من الأرمن، وخراب الأرمن من الخَرز، وخراب الخرز من الترك، وخراب الترك من الصواعق، وخراب السند من الهند، وخراب الهند من الصين، وخراب الصين من الرمل، وخراب الحبشة من الرجفة، وخراب العراق من القحط. هـ. قلت: وسكت عن المغرب، ولعله المعنِيُّ بقوله عليه الصلاة والسلام:\n \" لا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي ظَاهِرِينَ عَلَى الحَقِّ حَتَّى يَأتِي أمْرُ اللهِ \" \nزاد في رواية: وهم أهل المغرب، ورجحه صاحب المدخل، قال: لأنهم متمسكُون بالسنة أكثر من المشرق. والله تعالى أعلم بغيبه. الإشارة: القرية محل تقرر السر، وهو القلب، فإما أن يُهلكه الله بالتلف والضلال، وإما أن يُعذبه عذابًا شديدًا بالمجاهدات والمكابدات، ثم ينعمه نعيمًا كبيرًا بالمشاهدات والمناجاة. كان ذلك في الكتاب مسطورًا، فريق في الجنة وفريق في السعير. ثمَّ أجاب عن تأخر الآيات بعد اقتراحها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:2",
      "similarity": 0.6694927862695467
    },
    {
      "verse": "23:83",
      "similarity": 0.6056555787580615
    },
    {
      "verse": "27:68",
      "similarity": 0.6056555787580615
    },
    {
      "verse": "88:22",
      "similarity": 0.6026619438891664
    },
    {
      "verse": "68:15",
      "similarity": 0.5575005345365619
    }
  ]
}