{
  "chapter": "الإسراء",
  "text": "وربك اعلم بمن فى السموت والارض ولقد فضلنا بعض النبين على بعض وءاتينا داود زبورا",
  "translations": [
    {
      "translation": "My Lord knows best everyone in the heavens and earth. We favoured some of the Prophets over others. And We gave Dawud the Zabur.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows whoever is in the heavens and the earth. We exalted some of the prophets over the others; and to David We gave the Book of Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows all who dwell in the heavens and the earth. We have exalted some Prophets over others, and We gave the Psalms to David.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have given preference to some Prophets over others and We gave the psalms to David.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord knows well all those who are in the heavens and the earth; and indeed among the Prophets We gave excellence to some above others, and We gave the Zaboor to Dawud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord knows best all who are in the heavens and the earth. And indeed, We have preferred some of the Prophets above others, and to Dawud We gave the Zabur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord best knows those who are in the heavens and the earth; and certainly We have made some of the prophets to excel others, and to Dawood We gave a scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord knows very well all who are in the heavens and the earth; and We have preferred some Prophets over others; and We gave to David Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord is Best Aware of all who are in the heavens and the earth. And we preferred some of the prophets above others, and unto David We gave the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best about everyone in the heavens and on the earth. We gave some prophets more than others: We gave David the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thine Lord is the Best Knower of those who are in the heavens and the earth. And assuredly We have preferred some prophets over some others: and We vouchsafed unto Daud a Scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best whoever is in the heavens and the earth. Certainly, We gave some prophets an advantage over the others, and We gave David the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is your Lord that knoweth best all beings that are in the heavens and on earth: We did bestow on some prophets more (and other) gifts than on others: and We gave to David (the gift of) the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord knows best all who are in the heavens and the earth. And indeed, We have preferred some of the Prophets above others, and to Dawud (David) We gave the Zabur (Psalms).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows very well all who are in the heavens and the earth. We have preferred some Prophets above others, and to David We gave the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows well everyone in the heavens and the earth. We have given some prophets advantage over others; and to David We gave the Psalms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is most knowing of whoever is in the heavens and the earth. And We have made some of the prophets exceed others [in various ways], and to David We gave the book [of Psalms].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:55] And your Lord knows best all who are in the heavens and the earth, thus endowing them [each one] with what He will, according to the measure of their states. And verily We have preferred some of the prophets above others, endowing each of them with a particular merit: Moses, with being spoken to; Abraham, with Friendship; and Muhammad (s), with the Night Journey; and We gave David the Psalms.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thy Lord is best aware of all who are in the heavens and the earth) of the believers and what is best for them. (And we preferred some of the Prophets above others) through bestowing upon some Our friendship and speaking directly to others, (and unto David We gave the Psalms) and We gave Moses the Torah, Jesus the Gospel and Muhammad (pbuh) the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وسليمان بالمُلك العظيم { وَ } من جملة تفضيلنا: { آتَيْنَا دَاوُودَ زَبُوراً } [الإسراء: 55] مشتملاً على أنواع الحكمة\n وفصل الخطاب\n سيما على ألقاب خاتم الرسالة سيدنا محمد صلى الله عليه وسلم\n وظهوره ونسخة جميع الأديان والكتب\n وكون أمته أشرف الأمم\n ودينه أكمل الأديان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولذا قال: { وآتينا داود زبورًا } وقيل: هو إشارة إلى تفضيل نبينا محمد صلى الله عليه وسلم فإنه مذكور في الزبور\n وهو أنه خاتم الأنبياء\n وأمته خير الأمم\n وأنهم يرثون الأرض بالفتح عليهم قال تعالى:\n[الأنبياء: 105]\n والله تعالى أعلم\n الإشارة: من أوصاف الصوفية - رضي الله عنهم - أنهم هينون لينون كلَّفة حرير\n لا ينطقون إلا بالكلام الحسن\n ولا يفعلون إلا ما هو حسن\n ويفرحون ولا يحزنون وينبسطون ولا ينقبضون\n من رأوه مقبوضًا بسطوه\n ومن رأوه حزينًا فرّحوه\n ومن رأوه جاهلاً أرشدوه بالتي هي أحسن\n وهم متفاوتون في هذا الأمر\n مفضل بعضهم على بعض في الأخلاق والولاية\n فكل من زاد في الأخلاق الحسنة زاد تفضيله عند الله\n وفي الحديث:\n \" إنَّ الرَّجلُ لَيُدرِكُ بحُسْن الخلُق\n دَرَجََة الصَائِم النهار\n القَائِمِ اللَّيْل \" \nوبالله التوفيق\n ثم رجع إلى الكلام مع المشرعين والردّ عليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:196",
      "similarity": 0.6177214201134331
    },
    {
      "verse": "54:52",
      "similarity": 0.60409932417297
    },
    {
      "verse": "3:184",
      "similarity": 0.5948790567958683
    },
    {
      "verse": "35:25",
      "similarity": 0.5933847666253963
    },
    {
      "verse": "21:105",
      "similarity": 0.5614448451311755
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/17:55.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/17:55.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}