{
  "chapter": "الإسراء",
  "text": "يوم يدعوكم فتستجيبون بحمده وتظنون ان لبثتم الا قليلا",
  "translations": [
    {
      "translation": "On the Day He calls you, you will respond by praising Him and think that you have only tarried a very short time.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when He will call you, and you will answer with His praises and imagine you did not tarry but a while.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the Day when He will call you and you will rise praising Him in response to His call, and you will believe that you had lain in this state only for a while.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when He will call you, you will answer Him with praise and think that you have tarried for only a little while.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“The day when He will call you and you will come praising Him, thinking you have stayed only a little.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He will call you, and you will answer with (words of) His praise and obedience, and you will think that you have stayed (in this world) but a little while!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when He will call you forth, then shall you obey Him, giving Him praise, and you will think that you tarried but a little (while).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the day when He will call you, and you will answer praising Him, and you will think you have but tarried a little.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A day when He will call you and ye will answer with His praise, and ye will think that ye have tarried but a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day He will call you, and you will answer by praising Him, thinking that you have stayed for only a little while.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day whereon He will call you, and ye will answerl with His praise, and ye will imagine that ye had tarried but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day He calls you, you will respond to Him, praising Him, and you will think you remained [in the world] only for a little while.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be on a Day when He will call you, and ye will answer (His call) with (words of) His praise, and ye will think that ye tarried but a little while!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He will call you, and you will answer (His Call) with (words of) His Praise and Obedience, and you will think that you have stayed (in this world) but a little while!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on that Day, He will summon you, and you shall answer Him with praise and you shall think you have stayed but for a little'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He calls you, you will respond with His praise, and you will realize that you stayed only a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day He will call you and you will respond with praise of Him and think that you had not remained [in the world] except for a little.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:52] The day He calls you, [the day] He calls out to you from your graves by the tongue of [the archangel] Isrāfīl, you will respond, you will answer His call from your graves, with His praise, by His command — it is also said to mean [that you will respond] ‘and praise be to Him’ — and you will think that you have remained, in this world, only a little, because of the terror of what you will see [on that day].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then He explained to them further, saying: (A day) on a Day (when He will call you) when Seraphiel will call you upon the blowing of the trumpet (and ye will answer with His praise) you will answer the caller of Allah by His command, (and ye will think that ye have tarried but a little while) you will think that you have stayed in your graves but a short time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَوْمَ يَدْعُوكُمْ فَتَسْتَجِيبُونَ بِحَمْدِهِ } قالَ الإِمامُ زيد بن علي عليهما السَّلامُ: يَخرُجُونَ مِن قِبُورِهم يَقُولُونَ سُبحانَكَ وبِحَمْدِكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفانتظروا أيها المؤمنون المصدقون ليوم البعث والحشر مترصدين مترقبين { يَوْمَ يَدْعُوكُمْ } الله للبعث والحشر { فَتَسْتَجِيبُونَ } طائعين راغبين ملتبسين { بِحَمْدِهِ } معترفين على كمال قدرته، ووفور حوله وقوته { وَ } تذكروا من طول ذلك اليوم، وشدة أهواله وإفزاعه، حيث { تَظُنُّونَ } وتعتقدون فيه { إِن لَّبِثْتُمْ } أي: ما لبثتم وأقمتم في النشأة الأولى { إِلاَّ قَلِيلاً } [الإسراء: 52] أي: تستقلون وتستقصرون مدة لبثكم فيها من كثرة شدائدها وأهوالها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}