{
  "chapter": "الإسراء",
  "text": "او خلقا مما يكبر فى صدوركم فسيقولون من يعيدنا قل الذى فطركم اول مرة فسينغضون اليك رءوسهم ويقولون متى هو قل عسى ان يكون قريبا",
  "translations": [
    {
      "translation": "Or indeed any created thing that you think is harder still!' They will say, 'Who will bring us back again?' Say: 'He who brought you into being in the first place.' They will shake their heads at you and ask, 'When will it happen?' Say: 'It may well be that it is very near.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or some other created thing which may seem to you most difficult (to create)!\" They will then say: \"Who will revert us back?\" Say: \"He who originated you in the first place.\" They will shake their heads at you and say: \"When will that be?\" Say: \"In the near future, perhaps,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or any other form of creation you deem hardest of all (to recreate from).\" They will certainly ask: \"Who will bring us back (to life)?\" Say: \"He Who created you in the first instance.\" They will shake their heads at you and inquire: \"When will that be?\" Say: \"Perhaps that time might have drawn near;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or anything that you think is harder to be brought to life.\" They will soon ask, \"Who will bring us back to life?\" Say,\"The One who created you in the first place.\" They will shake their heads and say, \"When will He bring us back to life?\" Say, \"Perhaps very soon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Or some other creation which you deem great”; so they will now say, “Who will create us again?”; proclaim, “He Who created you for the first time”; so now they will mockingly shake their heads at you, and question, “When is this going to occur?”; say, “It could perhaps be soon.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or some created thing that is yet greater (or harder) in your breasts.\" Then, they will say: \"Who shall bring us back (to life)\" Say: \"He Who created you first!\" Then, they will shake their heads at you and say: \"When will that be\" Say: \"Perhaps it is near!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or some other creature of those which are too hard (to receive life) in your minds! But they will say: Who will return us? Say: Who created you at first. Still they will shake their heads at you and say: When will it be? Say: Maybe it has drawn nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or some creation yet more monstrous in your minds!' Then they will say, 'Who will bring us back?' Say: 'He who originated you the first time.' Then they will shake their heads at thee, and they will say, 'When will it be?' Say: 'It is possible that it may be nigh,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or some created thing that is yet greater in your thoughts! Then they will say: Who shall bring us back (to life). Say: He Who created you at the first. Then will they shake their heads at thee, and say: When will it be? Say: It will perhaps be soon;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or any other substance which you think unlikely to be given life.\" Then they will ask, \"Who is it that shall restore us to life?\" Answer them, \"He who created you the first time.\" They will then shake their heads at you and say, \"When will that be?\" Say, \"It may well be very soon.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or anything created of the things more remote in your breasts. Then they will say: who will restore us! Say thou: He who created you the first time. Then they will wag their heads at thee and say; when will it be! Say thou: belike it is nigh-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or a creature more fantastic to your minds!’ They will say, ‘Who will bring us back?’ Say, ‘He who originated you the first time.’ They will nod their heads at you, and say, ‘When will that be?’ Say, ‘Maybe it is near!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or created matter which, in your minds, is hardest (to be raised up),- (Yet shall ye be raised up)!\" then will they say: \"Who will cause us to return?\" Say: \"He who created you first!\" Then will they wag their heads towards thee, and say, \"When will that be?\" Say, \"May be it will be quite soon!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or some created thing that is yet greater (or harder) in your breasts (thoughts to be resurrected, even then you shall be resurrected)\" Then, they will say: \"Who shall bring us back (to life)?\" Say: \"He Who created you first!\" Then, they will shake their heads at you and say: \"When will that be?\" Say: \"Perhaps it is near!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or any other creation yet more monstrous in your minds' They will ask: 'Who will restore us' Say: 'He who originated you at first' They will shake theirheads and ask: 'When will this be' Say: 'Maybe it is near,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or some substance, which, in your minds, is even harder.” Then they will say, “Who will restore us?” Say, “The One who originated you the first time.” Then they will nod their heads at you, and say, “When will it be?” Say, “Perhaps it will be soon.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or [any] creation of that which is great within your breasts.\" And they will say, \"Who will restore us?\" Say, \"He who brought you forth the first time.\" Then they will nod their heads toward you and say, \"When is that?\" Say, \"Perhaps it will be soon -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:51] or some creation yet greater in your breasts, [something yet] far less able to accept life, aside from bones and fragments, a spirit will undoubtedly be made to exist in you [to bring you back to life]. They will then say, ‘Who shall bring us back?’, to life. Say: ‘He Who originated you, created you, the first time, when you had not been anything [in existence], because the One Who is able to initiate [creation] is also able to repeat [it], indeed, this [repetition] is easier [than the initiation]. Then they will shake their heads at you, stupefied, and they will say, mockingly: ‘When will it be?’, that is, the Resurrection. Say: ‘Maybe it is near!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or some created thing that is yet greater in your thoughts) i.e. death! You will nonetheless be resurrected after death. (Then they will say: Who shall bring us back (to life)) who will revive us? (Say) to them, Muhammad: (He who created you at the first) in the wombs of your mothers. (Then will they shake their heads at thee) in amazement at what you say to them, (and say: When will it be) when will be what you are promising us? (Say: It will perhaps) and 'perhaps' from Allah means that it is ordained (be soon); 304\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ خَلْقاً مِّمَّا يَكْبُرُ فِي صُدُورِكُمْ } فالخَلقُ: السِّحرُ ومعنى يَكبرُ: يَعظُمُ\n\n\n\n\nوقوله تعالى: { فَسَيُنْغِضُونَ إِلَيْكَ رُؤُوسَهُمْ } معناه: يُحرِّكونَها\n استهزاءً مِنهُم\n\n\n\n\nوقوله تعالى: { عَسَىٰ أَن يَكُونَ قَرِيباً } قالَ الإِمامُ عليه السلام: عَسَى من الله وَاجبةٌ فِي كُلِّ القُرآنِ\n وكُلُّ شَيءٍ دُونَ السَّاعةِ فَهْوَ قَرِيبٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوْ خَلْقاً } آخر مثلاً، هو { مِّمَّا يَكْبُرُ فِي صُدُورِكُمْ } ويستحيل في نفوسكم اتصافه بالحياة، فالله المقتدر بالقدرة الكاملة، والقوة الشاملة قادر على إحيائها وإيجادها، إن تعلقتْ إرادته، ومضت مشيئته على تكوينه وإظهاره، ثمَّ بعدما أُفحموا من سماع الحجة القوية، وانحسرت عقولهم عن المقابلة معها { فَسَيَقُولُونَ } مستفهمين عن تعيين الحق المبدئ المعيد على سبيل الإنكار: { مَن يُعِيدُنَا } بعد موتنا وصيرورتنا عظاماً ورفاتاً؟ { قُلِ ٱلَّذِي فَطَرَكُمْ } وأظهركم من كتم العدم { أَوَّلَ مَرَّةٍ } إظهاراً إبداعياً، وإيجاداً اختراعياً، بلا سبق مادةٍ ومدةٍ، فإعادتكم أهون عليه من إبدائكم وإبداعكم\n\n\n\n\nوبعدما سمعوا منك قولك { فَسَيُنْغِضُونَ } ويحركون { إِلَيْكَ } أيها المؤيَّد من عند الله لإلزام أولئك الغواة الطغاة، الهالكين في تيه المكابرة والعناد { رُؤُوسَهُمْ } على وجه الاستبعاد والاستهزاء { وَيَقُولُونَ } مستسخرين: { مَتَىٰ هُوَ } مع أن الأنبياء الماضين يدَّعون مثلك قيامها، فلم تقع بعدُ، وأنت أيضاً تدَّعى، فلا تقع، وما هي إِلاَّ مجرد الدعوى منكم ومنهم، بلا وقوعٍ ولا وروردٍ؟! { قُلْ } لهم يا أكمل الرسل: { عَسَىٰ أَن يَكُونَ قَرِيباً } [الإسراء: 51] أي: بعدما ختم أمر الرسالة والتشريع، وكمُل بناء الدين، قَرُبَ وقوعها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:48",
      "similarity": 0.1492603333942743
    },
    {
      "verse": "21:38",
      "similarity": 0.1492603333942743
    },
    {
      "verse": "27:71",
      "similarity": 0.1492603333942743
    },
    {
      "verse": "34:29",
      "similarity": 0.1492603333942743
    },
    {
      "verse": "36:48",
      "similarity": 0.1492603333942743
    }
  ]
}