{
  "chapter": "الإسراء",
  "text": "او۟لئك الذين يدعون يبتغون الى ربهم الوسيلة ايهم اقرب ويرجون رحمته ويخافون عذابه ان عذاب ربك كان محذورا",
  "translations": [
    {
      "translation": "Those they call on are themselves seeking the means by which they might approach their Lord - even those who are the closest to Him - and are hoping for His mercy and fearing his punishment. The punishment of your Lord is truly something to be feared.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those they invoke themselves seek the way to their Lord, (striving) which one of them shall be nearest (to Him); and hope for His grace, and dread His punishment. Indeed, the punishment of your Lord is to be feared!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they call upon are themselves seeking the means of access to their Lord, each trying to be nearer to Him. They crave for His Mercy and dread His chastisement. Surely your Lord's punishment is to be feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they worship seek to find intercessors for themselves with God. (They try to find out which of the intercessors) are closer to God. They have hope for His mercy and fear of His punishment; the punishment of your Lord is awesome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The devoted bondmen whom these disbelievers worship, themselves seek the means of proximity from their Lord, that who among them is the closest (to his Lord), and hope for His mercy and fear His punishment; indeed the punishment of your Lord is to be feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they call upon, desire a means of access to their Lord, as to which of them should be the nearest; and they hope for His mercy and fear His torment. Verily, the torment of your Lord is (something) to be afraid of!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they call upon, themselves seek the means of access to their Lord-- whoever of them is nearest-- and they hope for His mercy and fear His chastisement; surely the chastisement of your Lord is a thing to be cautious of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those they call upon are themselves seeking the means to come to their Lord, which of them shall be nearer; they hope for His mercy, and fear His chastisement. Surely thy Lord's chastisement is a thing to beware of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom they cry seek the way of approach to their Lord, which of them shall be the nearest; they hope for His mercy and they fear His doom. Lo! the doom of thy Lord is to be shunned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they invoke are themselves seeking a way of approach to their Lord, vying with each other to be near Him. They hope for His mercy and fear His punishment. Surely, the punishment of your Lord is to be feared:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they call upon themselves seek access to their Lord, striving which of them shall be the nearest; and they hope for His mercy and fear His torment; verily the torment of thy Lord is ever to be guarded against.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They [themselves] are the ones who supplicate, seeking a recourse to their Lord, whoever is nearer [to Him], expecting His mercy and fearing His punishment.’ Indeed your Lord’s punishment is a thing to beware of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they call upon do desire (for themselves) means of access to their Lord, - even those who are nearest: they hope for His Mercy and fear His Wrath: for the Wrath of thy Lord is something to take heed of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they call upon [like 'Iesa (Jesus) - son of Maryam (Mary), 'Uzair (Ezra), angel, etc.] desire (for themselves) means of access to their Lord (Allah), as to which of them should be the nearest and they ['Iesa (Jesus), 'Uzair (Ezra), angels, etc.] hope for His Mercy and fear His Torment. Verily, the Torment of your Lord is something to be afraid of!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those, they call upon are themselves seeking a means to come to their Lord, competing with each other to be nearer; they hope for His Mercy and fear His punishment. Indeed, the punishment of your Lord is the subject of caution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those they call upon are themselves seeking means of access to their Lord, vying to be nearer, and hoping for His mercy, and fearing His punishment. The punishment of your Lord is to be dreaded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom they invoke seek means of access to their Lord, [striving as to] which of them would be nearest, and they hope for His mercy and fear His punishment. Indeed, the punishment of your Lord is ever feared.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:57] Those whom they call, gods, [they themselves] seek a means to their Lord, [they seek] nearness, by way of obedience, which of them (ayyuhum substitutes for the [third person indicator] wāw of [the verb] yabtaghūna, ‘they seek’) in other words, [even] he seeks it [this nearness] the one who, is nearer, to Him, so how [much more] is it [sought] in the case of others?; and they hope for His mercy and fear His chastisement, just like others, so how can you call them gods? Truly your Lord’s chastisement is a thing to beware of.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those unto whom they cry) worship (seek the way of approach to their Lord) seek nearness and merit with their Lord, (which of them shall be the nearest) to Allah; (they hope for His mercy) His Paradise (and they fear His doom. Lo! the doom of thy Lord is to be shunned) safety has not been granted to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَبْتَغُونَ إِلَىٰ رَبِّهِمُ ٱلْوَسِيلَةَ } معناه: القُربَةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { أُولَـٰئِكَ } الفقراء الضعفاء { ٱلَّذِينَ يَدْعُونَ } إليهم، وتدعونهم آلهة، كالملائكة وعيسى وعزير - عليهما السلام\n { يَبْتَغُونَ } ويطلبون من غاية افتقارهم واحتياجهم { إِلَىٰ رَبِّهِمُ } الذي أوجدهم وأظهرهم من كتم العدم { ٱلْوَسِيلَةَ } المقربة إليه من الأعمال الصالحة، والأخلاق المرضية المقبولة عند الله؛ ليظهر لهم { أَيُّهُمْ أَقْرَبُ } إليه، وأقبل عنده { وَ } مع ذلك { يَرْجُونَ } في مناجاتهم وخلواتهم { رَحْمَتَهُ } على مقتضى لطفه وفضله { وَيَخَافُونَ عَذَابَهُ } على مقتضى قهره وعدله { إِنَّ عَذَابَ رَبِّكَ كَانَ مَحْذُوراً } [الإسراء: 57] واجب الحذر لكل من دخل تحت حيطة التكليف، سواء كان نبيّاً أو وليّاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:35",
      "similarity": 0.8352268573391812
    },
    {
      "verse": "39:9",
      "similarity": 0.1767652125094107
    },
    {
      "verse": "26:56",
      "similarity": 0.15197291383385225
    },
    {
      "verse": "5:92",
      "similarity": 0.14673628635618544
    },
    {
      "verse": "3:28",
      "similarity": 0.14126538883630307
    }
  ]
}