{
  "chapter": "الإسراء",
  "text": "افامنتم ان يخسف بكم جانب البر او يرسل عليكم حاصبا ثم لا تجدوا۟ لكم وكيلا",
  "translations": [
    {
      "translation": "Do you feel secure against Him causing the shore to swallow you up or sending against you a sudden squall of stones? Then you will find no one to be your guardian.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you then become so sure that He will not cleave the earth and sink you in it by the shore, or send a gale against you, when you will not find any protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you, then, feel secure against His causing you to be swallowed up by a tract of the earth, or letting loose a deadly whirlwind charged with stones towards you, and there you will find none to protect you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that We will not cause a part of the land to sink or engulf you with sand storms when you would find no one to protect you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you unafraid that He may bury an edge of the same land along with you, or send a shower of stones upon you, and you find no supporter for yourselves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you then feel secure that He will not cause a side of the land to swallow you up, or that He will not send against you a Hasib Then, you shall find no guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Do you then feel secure that He will not cause a tract of land to engulf you or send on you a tornado? Then you shall not find a protector for yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He will not cause the shore to swallow you up, or loose against you a squall of pebbles, then you will find no guardian for you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Feel ye then secure that He will not cause a slope of the land to engulf you, or send a sand-storm upon you, and then ye will find that ye have no protector?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you then feel secure against His causing you to be swallowed up by the earth when you are back on land, or His sending a deadly sand storm upon you? Then you will find none to protect you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are ye then secure that he will not cause a side of the land to swallow you up, or send over you a sand-storm, and then ye will not find for yourselves a trustee?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He will not make the coastland swallow you, or He will not unleash upon you a rain of stones? Then you will not find any defender for yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do ye then feel secure that He will not cause you to be swallowed up beneath the earth when ye are on land, or that He will not send against you a violent tornado (with showers of stones) so that ye shall find no one to carry out your affairs for you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you then feel secure that He will not cause a side of the land to swallow you up, or that He will not send against you a violent sand-storm? Then, you shall find no Wakil (guardian one to guard you from the torment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He will not cause the shore to swallow you, or let loose a squall of pebbles upon you? Then you shall find no guardian for yourself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you confident that He will not cause a track of land to cave in beneath you, or unleash a tornado against you, and then you find no protector?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do you feel secure that [instead] He will not cause a part of the land to swallow you or send against you a storm of stones? Then you would not find for yourselves an advocate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:68] Do you feel secure that He will not cause a side of the earth, in other words, the land, to swallow you up, as [He did] with Korah (Qārūn), or unleash upon you a squall of pebbles? that is, hurl a shower of stones upon you, as [He did] with the people of Lot. Then you will not find for yourselves any guardian, any protector from Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Feel ye) people of Mecca (then secure that He will not cause a slope of the land to engulf you) just as Korah was engulfed, (or send) or that He will not send (a sandstorm upon you,) stones upon you as He did send on the people of Lot, (and then ye will find that ye have no protector) no one to help you?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ يُرْسِلَ عَلَيْكُمْ حَاصِباً } معناهُ رِيحٌ شَديدٌ تَحْصِبُ التُّرابَ\n\n",
      "translations": [
        {
          "translation": "\nOr He will send against you a violent whirlwind { } which will { } the soil.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } أعرضتم عنه سبحانه بعد إنجائه وصلاخه إياكم { فَأَمِنْتُمْ } عنه قهره وسخطه حين وصلتم إلى البر، مع أنه سبحانه قادراً على إهلاككم من البر أيضاً، أما تخافون { أَن يَخْسِفَ بِكُمْ جَانِبَ ٱلْبَرِّ } أي: يقلب عليك الأرض كما خسفها على قارون { أَوْ يُرْسِلَ عَلَيْكُمْ } ريحاً شديداً { حَاصِباً } ترميكم وترجمكم بحجارة كما رجمنا قوم لوط { ثُمَّ } بعدما أخذناكم في البر بأمثال هذه البليات { لاَ تَجِدُواْ لَكُمْ وَكِيلاً } [الإسراء: 68] حفيظاَ يحفظكم عن أمثال هذه المصيبات، أو يشفع لكم بتخفيفها وكشفها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أفأمِنْتُم } أي: أنجوتم من البحر، وأمنتم { أن يَخْسف بكم جانبَ البرِّ } بأن يقلبه عليكم وأنتم عليه، أو يخسف بكم في جوفه، كما فعل بقارون، { أو يُرسلَ عليكم حاصبًا } أي: ريحًا حاصبًا، يرميكم بحصباء كقوم لوط، { ثم لا تجدوا لكم وكيلاً } حافظاً لكم منه، فإنه لا رادّ لفعله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:40",
      "similarity": 0.7021722080495174
    },
    {
      "verse": "67:17",
      "similarity": 0.6031953605903589
    },
    {
      "verse": "54:34",
      "similarity": 0.5682635482691795
    },
    {
      "verse": "21:98",
      "similarity": 0.5183707366130582
    },
    {
      "verse": "75:8",
      "similarity": 0.4179943050755461
    }
  ]
}