{
  "chapter": "الإسراء",
  "text": "واذ قلنا لك ان ربك احاط بالناس وما جعلنا الرءيا التى ارينك الا فتنة للناس والشجرة الملعونة فى القرءان ونخوفهم فما يزيدهم الا طغينا كبيرا",
  "translations": [
    {
      "translation": "When We said to you, 'Surely your Lord encompasses the people with His knowledge.' We only appointed the vision We showed you and the Accursed Tree in the Qur'an as a trial and temptation for the people. We frighten them, but it only increases them in their excessive insolence.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We said to you: \"Verily your Lord circumscribes mankind,\" and showed you the vision and the accursed tree of the Qur'an, it was as a bone of contention for men. Thus do We (instil) fear in them; but they only transgress the more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when We said to you, (O Muhammad), that your Lord encompasses these people; and that We have made that vision that We have shown you, and the tree accursed in the Qur'an, but as a trial for people. We go about warning them, but each warning leads them to greater transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), We told you that your Lord has encompassed all mankind. We made the vision which We showed you and the condemned tree, mentioned in the Quran, as a trial for the human being. Even though We warn them, it only increases their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We proclaimed to you, “Indeed all mankind is within the control of your Lord”; and We did not create the spectacle* which We showed you except to try mankind, and the Tree** which is cursed in the Qur’an; and We warn them – so nothing increases for them except extreme rebellion. (* The Ascent of the Holy Prophet to the heavens and beyond, which the disbelievers denied as just a dream. ** The Zakkum tree which will grow in hell and be the food for its inhabitants.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We told you: \"Verily, your Lord has encompassed mankind.\" And We made not the vision which We showed you but a trial for mankind, and (likewise) the accursed tree in the Qur'an. We warn and make them afraid but it only increases them in naught save great disbelief, oppression and disobedience to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We said to you: Surely your Lord encompasses men; and We did not make the vision which We showed you but a trial for men and the cursed tree in the Quran as well; and We cause them to fear, but it only adds to their great inordinacy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We said to thee, 'Surely thy Lord encompasses men,' and We made the vision that We showed thee and the tree cursed in the Koran to be only a trial for men; and We frighten them, but it only increases them in great insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (it was a warning) when we told thee: Lo! thy Lord encompasseth mankind, and We appointed the sight which We showed thee as an ordeal for mankind, and (likewise) the Accursed Tree in the Qur'an. We warn them, but it increaseth them in naught save gross impiety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We told you that your Lord encompasses mankind. We granted the vision which We showed you, as well as the tree that is cursed in the Quran, only as a test for mankind. We warn them, but this only increases their insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We said unto thee: verily thy Lord hath encompassed mankind. And We made the vision We shewed thee but a temptation for men, and likewise the tree accurst in the Qur'an. And We frighten them, but it only increaseth them in exorbitance great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We said to you, ‘Indeed your Lord encircles those people,’ We did not appoint the vision that We showed you except as a tribulation for the people and the tree cursed in the Quran. We warn them, but it only increases them in their outrageous rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! We told thee that thy Lord doth encompass mankind round about: We granted the vision which We showed thee, but as a trial for men,- as also the Cursed Tree (mentioned) in the Qur'an: We put terror (and warning) into them, but it only increases their inordinate transgression!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We told you: \"Verily! Your Lord has encompassed mankind (i.e. they are in His Grip).\" And We made not the vision which we showed you (O Muhammad as an actual eye-witness and not as a dream on the night of Al-Isra') but a trial for mankind, and likewise the accursed tree (Zaqqum, mentioned) in the Quran. We warn and make them afraid but it only increases them in naught save great disbelief, oppression and disobedience to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We said to you: 'Indeed, your Lord encompasses all people' We did not make the vision which We showed to you, and the tree cursed in the Koran except to be a trial for people, and We frighten them, but it only increases them in great insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said to you that your Lord encompasses humanity. We did not make the vision We showed you, except as a test for the people, and the tree cursed in the Quran. We frighten them, but that only increases their defiance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember, O Muhammad], when We told you, \"Indeed, your Lord has encompassed the people.\" And We did not make the sight which We showed you except as a trial for the people, as was the accursed tree [mentioned] in the Qur'an. And We threaten them, but it increases them not except in great transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:60] And, remember, when We said to you, ‘Truly your Lord encompasses mankind’, in knowledge and power [over them], such that they are within His grasp: so deliver the Message to them and do not fear anyone, because God will protect you from them. And We did not appoint the vision that We showed you, before your very eyes, during the Night Journey, except as a test for people, [for] the people of Mecca — since they denied it and some of them [even] apostatised when he [the Prophet] informed them of it — and [likewise] the tree cursed in the Qur’ān, namely, the [tree called] Zaqqūm [Q.37:62ff] that issues from the very root of the Blazing Fire [of Hell]; We made it a test for them, because they said, ‘Fire consumes trees, so how can it cause it [the Zaqqūm tree] to issue forth?’. And We [seek to] deter them, with it, but it, Our deterrence, only increases them in gross insolence.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (it was a warning) when We told thee: Lo! thy Lord encompasseth mankind) He is aware of the people of Mecca: those who will believe and those who will not, (and We appointed the vision) We did not show you the vision (which We showed thee) in your nocturnal ascension (as an ordeal for mankind) as a misfortune for the people of Mecca, (and (likewise) the Accursed Tree in the Qur'an) and the same applies to the mention of the Zaqqum tree in the Qur'an. (We warn them) by the Zaqqum tree, (but it) the warning (increaseth them in naught save gross impiety) save further engagement in transgression.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر للمؤمنين وقت { إِذْ قُلْنَا } موحياً { لَكَ } مسلياً عليك: لا تحزن من كثرة عدَدَ عودك وعُدَدهم\n ولا تخفْ من شوكتهم { إِنَّ رَبَّكَ } الذي اصطفاك من البرية للرسالة العامة قد { أَحَاطَ بِٱلنَّاسِ } إحاطة الظل بأظلالها\n فهم مقهورون تحت قبضة قدرته يفعل بهم حسب إرادته ومشيئته\n فامضِ على ما أُمرت بلا خوفٍ وترددٍ فلك الاستيلاء والغلبة\n\n\n{ وَ } أيضاً { مَا جَعَلْنَا ٱلرُّءْيَا ٱلَّتِي أَرَيْنَاكَ } حين نزولك ماء بدرٍ\n وأصبحت تقول مشيراً بإصبعك: \" هَذَا مَصْرَعُ فُلاَنٍ\n وَهَذَا مَصْرَعُ فُلاَن \" فأخبر قريشُ بقولك وإشارتك إلى مصارعهم\n فاستهزءوا معك واستبعد بعض المؤمنين أيضاً { إِلاَّ فِتْنَةً } واختباراً { لِّلنَّاسِ } هل يؤمنون بك ويصدّقون قولك\n أم يكذبونك وينكرون بك\n\n\nثم لما وقع الأمر على الوجه الذي أُريت في منامك\n اطمأن المؤمنون وازدادوا يقيناً وإخلاصاً\n وجحد الكافرون وأزدادوا شقاقاً ونفاقاً\n ونسبوا أمرك هذا إلى السحر والكهانة الرجم بالغيب عناداً ومكابرةً\n\n\n{ وَ } أيضاً ما جعلنا { ٱلشَّجَرَةَ ٱلْمَلْعُونَةَ } المكروهة التي يلعنها كل من يذوقها ويطعمها\n وهي الزقوم المنبت على أدوية الجحيم\n لذلك لُعنت { فِي ٱلقُرْآنِ } حتى يحترز المؤمنون عن الأعمال المقربة إليها الموجبة لأكلها إلا قتنةً وابتلاءً للناس\n لذلك لما سمعت قريش شجرة الزقوم\n جعلوها منشأ الهزل والسخرية مع الرسول صى الله عليه وسلم حتى قال أبو جهل: إن محمداً يخوفنا عن نار تحرق الحجارة\n ويزعم أنها تنبت الشجرة\n وقد علمتم أن النار تحرق الشجر\n وما هي إلى قرية بلا مرية\n\nثم اعلم أن الأمور الدينية كلها تعبدي\n فلو ظهر لما وجه عقلي فيها ولو لم يظهر\n لزم الإطاعة والانقياد على سبيل التعبيد والتسليم من الصادق المصدوق\n مع أن نبت الشجر في النار\n مما لا يمتنع عقلاً أيضاً\n لأن وجود الحيوان في النار أبعد من وجود النبات فيها\n\n\nوحكاية الدويبة التي يقال لها: السمندل\n هي تعيش في النار كالسمك في الماء متى خرجت منها ماتت\n واتخاذ الناس من شعرها منديلاً متى اتسخت\n طرحت على النار فأحرقت\n وأخرجت سالمة نظفية منها\n مشهورة معروفة\n لا شك في وقوعها\n\n\nوأعجب من ذلك ابتلاع النعامة الجمرة والجذوة والحديدة المحماة المحمرة في النار\n ولا تضرها اصلاً { وَ } من قساوة قلوب أولئك الغواة\n وغلظ حجبهم { نُخَوِّفُهُمْ } بأنواع المخاوف الدنيوية والأخروية { فَمَا يَزِيدُهُمْ } تلك التخويفات الهائلة { إِلاَّ طُغْيَاناً كَبِيراً } [الإسراء: 60] متجاوزاً عن الحد غاية التجاوز لشدة عمههم وعتوهم\n\n\n{ وَ } ليس طغيانهم وإصرارهم عليه إلا بتسويلات الشياطين وتغريراتهمه على مقتضى العداوة القديمة\n والخصومة المستمرة بين الشيطان وبني آدم\n اذكر وقت { إِذْ قُلْنَا لِلْمَلاۤئِكَةِ } بأجمعهم بعدما جاوءا بما جاءوا من الحجج والدلائل الدالة على عدم لياقة آدمة ب الخلافة والنيابة إلى أن أُفحموا وأُلزموا: { ٱسْجُدُواْ لأَدَمََ } وتذللوا عنده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وإِذْ قلنا لك } فيما أوحينا إليك { إِنَّ ربك أحَاطَ بالناس } علماً وقدرة، وأسراراً وأنواراً، كما يليق بجلاله وتجليه، فلا يختص بمكان ولا زمان، بل هو مظهر الزمان والمكان، وقد كان ولا زمان ولا مكان، وهو الآن على ما عليه كان، { وما جعلنا الرؤيا التي أريناك } في قضية الإسراء، قال ابن عباس: \" هي رؤيا عين \" حيث رأى أنوار جبروته في أعلى عليين، وشاهد أسرار ذاته أريناك ذلك في ذلك المكان { إلا فتنةً للناس } اختباراً لهم، من يصدق بذلك ولا يكيف، ومن يجحده من الكفرة. ومن يقف مع ظاهره، فيقع في التجسيم والتحييز، ومن تنهضه السابقة إلى التعشق فيجاهد نفسه حتى تعرج روحه إلى عالم الملكوت، فتكاشف بإحاطة أسرار الذات بكل شيء. وإنما خص الحق تعالى إحاطته بالناس، مع أنه محيط بكل شيء، كما في الآية الأخرى:\n[فُصِّلَت: 54] لأنهم المقصودون بالذات من هذا العالم، وما خلق إلا لأجلهم. فاكتفى بالإحاطة بهم عن إحاطته بكل شيء. ثم قال تعالى: { والشجرة الملعونة في القرآن } وهي: شجرة الزقوم، أي: ما جعلناها إلا فتنة للناس. وذلك أن قريشاً لما سمعوا أن في جهنم شجرة الزقوم، سخروا من ذلك، فافتتنوا بها، حيث أنكروها، وكفروا بالقرآن، وقالوا: كيف تكون شجرة في النار، والنار تحرق الشجر؟! وقفوا مع الإلف والعادة، ولم ينفذوا إلى عموم تعلق القدرة. ومن قدر على حفظ وبر السَّمَنْدَل منها، وهو يمشي فيها، قدر على أن يخلق في النار شجرة، ولم تحرقها. وقال أبو جهل: ما أعرف الزقوم إلا التمر بالزبد. فإن قيل: أين لُعِنت شجرة الزقوم في القرآن؟ فالجواب: أن المراد لعنة آكلها، وقيل: إن اللعنة هنا بمعنى الإبعاد، وهي في أصل الجحيم. قال تعالى: { ونُخوِّفهم } بأنواع التخويف، أو بالزقوم، { فما يزيدُهُم إِلا طغيانًا كبيرًا } عنوًا مجاوزاً للحد. الإشارة: الأكوان ثابتة بإثباته، ممحوة بأحدية ذاته. فإذا انمحت الأكوان ثبتت وحدة المكون. \" كان الله ولا شيء معه، وهو الآن على ما كان عليه \" ، من قامت به الأشياء، وهو وجودها ونور ذاتها، ومحيط بها، كيف تحصره، أو تحيزه، أو تحول بينه وبين موجوداته؟ قيل لسيدنا علي - كرم الله وجهه -: يا ابن عم رسول الله صلى الله عليه وسلم: أين كان ربنا قبل خلق الأشياء؟ فتغير وجهه، وسكت، ثم قال: قولكم: أين؟ يقتضي المكان، وكان الله ولا زمان ولا مكان، وهو الآن على ما عليه كان. هـ. وقال الشيخ الشاذلي: قيل لي: يا عليّ بي قُلْ، وعليّ دُل، وأنا الكل. وفي الحديث:\n \" لاَ تَسُبُّوا الدَهْرَ، فَإنَّ الله هُوَ الدَّهْرُ، بِيَده الليْلُ والنَّهَار \" \n، ولا يفهم هذا على التحقيق إلا أهل الذوق، بصحبة أهل الذوق. وإلا فسلِّم تسلم، واعتقد التنزيه وبطلان التشبيه. وبالله التوفيق، وهو الهادي إلى سواء الطريق. ثمَّ بين عداوة ابليس المتقدمة: { وَإِذْ قُلْنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِ وَمَا جَعَلْنَا... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:126",
      "similarity": 0.30095767673525564
    },
    {
      "verse": "20:110",
      "similarity": 0.2810382350453469
    },
    {
      "verse": "48:21",
      "similarity": 0.27434944480222984
    },
    {
      "verse": "4:108",
      "similarity": 0.2726324435953352
    },
    {
      "verse": "27:84",
      "similarity": 0.2667446154737605
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/17:60.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/17:60.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/17:60.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}