{
  "chapter": "الإسراء",
  "text": "ثم رددنا لكم الكرة عليهم وامددنكم بامول وبنين وجعلنكم اكثر نفيرا",
  "translations": [
    {
      "translation": "Then once again We gave you the upper hand over them and supplied you with more wealth and children and made you the most numerous group.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave you a chance against them, and strengthened you with wealth and children, and increased your numbers (and said):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We granted you an upper hand against them, and strengthened you with wealth and children, and multiplied your numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Mighty servants, who will chase you from house to house. This is a decree already ordained. We, then, gave you a chance to defeat your enemies with the help of increasing your wealth and offspring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then reversed your attack upon them, and aided you with wealth and sons and increased your numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave you a return of victory over them. And We helped you with wealth and children and made you more numerous in manpower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave you back the turn to prevail against them, and aided you with wealth and children and made you a numerous band.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave back to you the turn to prevail over them, and We succoured you with wealth and children, and We made you a greater host.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then we gave you once again your turn against them, and We aided you with wealth and children and made you more in soldiery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and after a time We allowed you to prevail over them once again and aided you with wealth and offspring and made you greater in number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter We gave you a return of victory over them, and We supported you with riches and children, and We made you a numerous concourse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave you back the turn [to prevail] over them, and We aided you with children and wealth, and made you greater in number,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then did We grant you the Return as against them: We gave you increase in resources and sons, and made you the more numerous in man-power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave you once again, a return of victory over them. And We helped you with wealth and children and made you more numerous in man power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We gave the turn back to you to prevail over them, and We helped you with wealth and children, and made you the greater host.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave you back your turn against them, and supplied you with wealth and children, and made you more numerous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave back to you a return victory over them. And We reinforced you with wealth and sons and made you more numerous in manpower\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:6] Then We gave you back the turn, the [rule of the] state and victory, [to prevail] over them, one hundred years later, by having Goliath slain, and We aided you with children and wealth, and made you greater in number, in clan.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then we gave you once again your turn against them) through Koresh's defeat of Nebuchadnezzar; it is also said that this means: and We had pity on you and thus gave you once again your turn against them, (and We aided you with wealth and children and made you more in soldiery) We made you more in men and numbers,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ رَدَدْنَا لَكُمُ ٱلْكَرَّةَ } معناهُ أَعْقَبنا لَكُم الدَّولَة\n\n\n\n\nوقوله تعالى: { أَكْثَرَ نَفِيراً } معناهُ الذين نَفَرُوا مَعهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Then We turned you back\" - this means that We brought you back to your state.\n The saying of the Most High: { Most of them turn away } means those who turned away with him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ثم رددنا لكم } الدولة بتنوّركم بنور القلب وإقبالكم على الصدر وانصرافكم إلى مقتضى نظر العقل ورأيه { وأمددناكم بأموال } العلوم النافعة والحِكَم العقلية والشرعية والمعارف القلبية { وبنين } من الفضائل الخلقية والهيئات النورانية { وجعلناكم أكثر نفيراً } بكثرة الفضائل والملكات الفاضلة والأخلاق الحسنة",
      "translations": [
        {
          "translation": "\n\n{Then We turned to you} The state enlightens you with the light of the heart, and your inclination towards the breast, and your return to the dictates of reason and opinion {and We provided you with} beneficial sciences, rational and legal judgments, and heart-based knowledge {and built you} from noble character traits and spiritual faculties {and made you more virtuous} with the abundance of virtues, good character traits, and noble manners.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما ضعفناكم وأخذناكم { رَدَدْنَا لَكُمُ ٱلْكَرَّةَ } الدولة والغلبة والصولة { عَلَيْهِمْ } أي: على أعدائكم { وَأَمْدَدْنَاكُم بِأَمْوَالٍ } عظام { وَبَنِينَ } معاونين ناصرين { وَجَعَلْنَاكُمْ } في الكرَّة الثانية { أَكْثَرَ نَفِيراً } [الإسراء: 6] من الكثرة الأولى؛ أي: أكثر عسكراً وجنوداً منها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم رددنا لكم الكرّة } أي: الدولة والغلبة { عليهم } أي: على الذين بُعثوا عليكم، فرجع المُلك إلى بني إسرائيل، واستنقذوا أسراهم، فقيل: على يد \" بهْمَن بن إسفنديار \" ملك فارس، فاستنقذهم، ورد أسراهم إلى الشام، وملَّكَ دَانْيال عليهم، فاستولوا على من كان فيها من أتباع بختنصر، وقيل: على يد داود عليه السلام حين قتل جالوت\n قال تعالى: { وأمددناكم بأموال وبنين وجعلناكم أكثرَ نفيرًا } أي: عددًا مما كنتم\n والنفير: من ينفر مع الرجل من قومه، وقيل: جمع نَفر، وهم: المجتمعون للذهاب إلى الغزو",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:102",
      "similarity": 0.6798514638032451
    },
    {
      "verse": "79:12",
      "similarity": 0.6639259454020051
    },
    {
      "verse": "39:58",
      "similarity": 0.6213484871277433
    },
    {
      "verse": "2:167",
      "similarity": 0.5254111635797287
    },
    {
      "verse": "67:4",
      "similarity": 0.40393366609979725
    }
  ]
}