{
  "chapter": "الإسراء",
  "text": "ام امنتم ان يعيدكم فيه تارة اخرى فيرسل عليكم قاصفا من الريح فيغرقكم بما كفرتم ثم لا تجدوا۟ لكم علينا به تبيعا",
  "translations": [
    {
      "translation": "Or do you feel secure against Him taking you back into it another time and sending a violent storm against you and drowning you for your ingratitude? Then you will find no one to defend you against Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or you feel so secure that He will not send you back (to sea) again or send a gravel-hurtling storm against you, and drown you for your ingratitude? Then you will not find any avenger against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you feel secure that He will not cause you to revert to the sea, and let a tempest loose upon you and then drown you for your ingratitude whereupon you will find none even to inquire of Us what happened to you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that We will not drive you back to the sea, send a fierce gale to you, and cause you to drown because of your disbelief when you would not be able to find anyone who would intercede for you with Us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are you unafraid that He may again take you back to the sea, then send against you a ship-breaking gust of wind, therefore drowning you because of your disbelief – then you may not find for yourself anyone to come after Us for this?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you feel secure that He will not send you back a second time to sea and send against you a Qasif and drown you because of your disbelief Then you will not find any avenger therein against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do you feel secure that He will (not) take you back into it another time, then send on you a fierce gale and thus drown you on account of your ungratefulness? Then you shall not find any aider against Us in the matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you feel secure that He will not send you back into it a second time, and loose against you a hurricane of wind and drown you for your thanklessness, then you will find no prosecutor for you against Us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or feel ye secure that He will not return you to that (plight) a second time, and send against you a hurricane of wind and drown you for your thanklessness, and then ye will not find therein that ye have any avenger against Us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you feel secure against His sending you back to sea once again, and raising a fierce gale against you  and causing you to drown in requital for your ingratitude? You will find no helper against Us there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are ye secure that he will not send you back therein anot her time and then send upon you a gale of wind and drown you for your having disbelieved, so that therein you will not find for yourselves against Us an avenger?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He will not send you back into it another time and unleash against you a shattering gale and drown you because of your unfaith? Then you will not find for yourselves any redresser against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do ye feel secure that He will not send you back a second time to sea and send against you a heavy gale to drown you because of your ingratitude, so that ye find no helper. Therein against Us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you feel secure that He will not send you back a second time to sea and send against you a hurricane of wind and drown you because of your disbelief, then you will not find any avenger therein against Us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do you feel secure that He will not send you back into it a second time, and send against you a violent tempest and drown you because of disbelief? Then you shall find no prosecutor (to help) you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are you confident that He will not return you to it once again, and unleash a hurricane against you, and drown you for your ingratitude? Then you will find no helper against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you feel secure that He will not send you back into the sea another time and send upon you a hurricane of wind and drown you for what you denied? Then you would not find for yourselves against Us an avenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:69] Or do you feel secure that He will not return you to it, that is, [to] the sea, a second time and unleash upon you a shattering gale, that is, a violent wind that shatters everything in its path, to destroy your ship, and drown you for your ungratefulness? And then you will not find for yourselves any redresser of this against Us, [any] helper or advocate to demand restitution from Us for what We [will] have done to you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nو ( أم ) عاطفة الاستفهام ، وهي للإضراب الانتقالي ، أي بل أأمنتم ، فالاستفهام مقدر مع ( أم ) لأنها خاصة به ، أي أو هل كنتم آمنين من العود إلى ركوب البحر مرة أخرى فيرسل عليكم قاصفاً من الريح .والتارة : المرة المتكررة ، قيل عينه همزة ثم خففت لكثرة الاستعمال . وقيل : هي واو . والأول أظهر لوجوده مهموزاً وهم لا يهمزون حرف العلة في اللغة الفصحى ، وأما تخفيف المهموز فكثير مثل : فأس وفاس ، وكأس وكاس .ومعنى { أن يعيدكم } أن يُوجد فيكم الدواعي إلى العود تهيئة لإغراقكم وإرادة للانتقام منكم ، كما يدل عليه السياق وتفريعُ { فيرسل } عليه .والقاصف : التي تقصف ، أي تكسر . وأصل القصف : الكسر . وغلب وصف الريح به . فعومل معاملة الصفات المختصة بالمؤنث فلم يلحقوه علامة التأنيث ، مثل { عاصف } في قوله :{ جاءتها ريح عاصف } في سورة \\[ يونس : 22 \\]. والمعنى : فيرسل عليكم ريحاً قاصفاً ، أي تقصف الفلك ، أي تعطبه بحيث يغرق ، ولذلك قال : { فيغرقكم }.قرأ الجمهور { من الريح } بالإفراد . وقرأ أبو جعفر { من الرياح } بصيغة الجمع .والباء في { بما كفرتم } للسببية . و ( ما ) مصدرية ، أي بكفركم ، أي شرككم .و ( ثم ) للترتيب الرتبي كشأنها في عطفها الجمل . وهو ارتقاء في التهديد بعدم وجود مُنقذ لهم ، بعد تهديدهم بالغرق لأن الغريق قد يجدُ منقذاً .والتبيع : مبالغة في التابع ، أي المتتبع غيره المطالب لاقتضاء شيء منه . أي لا تجدوا من يسعى إليه ولا من يطالب لكم بثأر .ووصف ( تبيع ) يناسب حال الضر الذي يلحقهم في البحر ، لأن البحر لا يصل إليه رجال قبيلة القوم وأولياؤهم ، فلو راموا الثأر لهم لركبوا البحر ليتابعوا آثار من ألحق بهم ضراً . فلذلك قيل هنا { تبيعا } وقيل في التي قبلها { وكيلاً } كما تقدم .وضمير { به } عائد إما إلى الإغراق المفهوم من { يغرقكم } ، وإما إلى المذكور من إرسال القاصف وغيره .وقرأ الجمهور ألفاظ { يخسف } و { يرسل } و { يعيدكم } و { فيرسل } و { فيغرقكم } خمسُتها بالياء التحتية . وقرأها ابن كثير وأبو عمرو بنون العظمة على الالتفات من ضمير الغيبة الذي في قوله : { فلما نجاكم إلى البر } إلى ضمير التكلم . وقرأ أبو جعفر ورويس عن يعقوب { فتغرقكم } بمثناة فوقية . والضمير عائد إلى { الريح } على اعتبار التأنيث ، أو { على الرياح } على قراءة أبي جعفر .\n\n",
      "translations": [
        {
          "translation": "(Or feel ye) people of Mecca (secure that He will not return you to that (plight)) to the sea (a second time, and send against you a hurricane of wind and drown you) in the sea (for your thanklessness) for your denial of Allah and your ingratitude towards His bounty, (and then ye will not find therein that ye have any avenger against Us) for drowning you?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَارَةً أُخْرَىٰ } يعني مرةً أُخرى\n والجَمعُ تاراتٌ وتيرٌ\n\n\n\n\nوقوله تعالى: { فَيُرْسِلَ عَلَيْكُمْ قَاصِفاً مِّنَ ٱلرِّيحِ } معناه حاطمٌ يَحطِمُ كُلَّ شَيءٍ\n\n\n\n\nوقوله تعالى: { لاَ تَجِدُواْ لَكُمْ عَلَيْنَا بِهِ تَبِيعاً } معناه من يَطلُبَكُم بِتَبعةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"another time\" means once again.\n\n\nAnd the gathering of stars and planets.\n\nAnd His saying - exalted be He: {Then a blast [of wind] will hit you from where you do not expect}, its meaning is a destroyer that destroys everything.\n\nAnd His saying, {You will not find for yourselves against Us any substitution}, its meaning is that no one will ask you for allegiance.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ أَمِنْتُمْ } أيها القاصرون عن إدراك قدر الله\n وكما قدرته { أَن يُعِيدَكُمْ } ويلجئكم إلى الرجوع { فِيهِ } أي: في البحر { تَارَةً أُخْرَىٰ } بأسباب ووسائ لا تخطر ببالكم { فَيُرْسِلَ عَلَيْكُمْ } في الكرة الأخرى لأخذكم وانتقامكم { قَاصِفاً } كاسراً { مِّنَ ٱلرِّيحِ } لتكسر مركبكم { فَيُغْرِقَكُم } فيه { بِمَا كَفَرْتُمْ } في اللكرة الأولى { ثُمَّ } بعد إرجاعنا إلى البحر\n وإغراقنا فيه على نحو إنعامنا وإنجائنا ن قبل { لاَ تَجِدُواْ لَكُمْ عَلَيْنَا بِهِ تَبِيعاً } [الإسراء: 69] أي: لا تجدوا ناصراً ومعيناً لكم\n فيظهر علينا بأخذكم وانتقامكم\n ويطالب منا قصاص ما فعلنا بكم\n إذ لا رادّ لفعلنا\n ولا معقب لحكمنا\n نفعل ما نشاء ونحكم ما نريد\n\n\nثم قال سبحانه على سبيل الإنعام والامتنان: { وَلَقَدْ كَرَّمْنَا } وفضلنا { بَنِي ءَادَمَ } بأنواع الكرامة والتفضيل على سائر المخلوقات من حسن الصورة والسيرة واعتدال المزاج\n واستواء القامة\n والعقل المفاض المتشعب من العقل الكل الذي هو حضرة العلم الحضوري الإلهي\n وكذا بالقدرة والإدارة\n وسائر الصفات المترتبة على الصفات الذاتية الإلهية يشعر بخلافته ونيابته { وَ } مع ذلك { حَمَلْنَاهُمْ فِي ٱلْبَرِّ } بركوب النجائب من الخيل والبغال والبعير وغير ذلك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم أمنتم أن يُعيدكم فيه تارةً أخرى } بأن يخلق فيكم دواعي تحملكم إلى أن ترجعوا لتركبوا فيه { فيُرسلَ عليكم قاصِفًا من الريح } أي: ريحًا شديدة\n لا تمر بشيء إلا قصفته\n أي: كسرته\n { فيُغرقكم } \n وعن يعقوب: \" فتغرقكم \" على إسناده إلى ضمير الريح\n وقرأ ابن كثير وأبو عمرو: بنون التكلم في الخمسة\n يفعل ذلك بكم { بما كفرتم } بكفركم\n أي: بسبب إشراككم\n أو كفرانكم نعمة الإنجاء\n { ثم لا تجدوا لكم علينا به تبيعًا } مطالبًا يتبعنا بثأركم\n كقوله:\n[الشمس: 15]\n أو: لا تجدوا نصيرًا ينصركم منه\n والله تعالى أعلم\n الإشارة: العباد الذين ليس للشيطان عليهم سلطان\n هم الذين أضافهم إلى نفسه بأن اصطفاهم لحضرة قدسه\n وشغلهم بذكره وأُنسه\n لم يركنوا إلى شيء سواه\n ولم يلتجئوا إلاَّ إلى حماه\n فلا جرم أنه يحفظهم برعايته\n ويكلؤهم بسابق عنايته\n فظواهرهم قائمة بآداب العبودية\n وبواطنهم مستغرقة في شهود عظمة الربوبية\n فلمَّا قاموا بخدمة الرحمن\n حال بينهم وبين كيد الشيطان\n وقال لهم: ربكم الذي يُزجي لكم فلك الفكرة في بحر الوحدة لتبتغوا الوصول إلى حضرة الأحدية\n إنه كان بكم رحيمًا\n\nثم إذا غلب عليكم بحر الحقيقة\n وغرقتم في تيار الذات\n غاب عنكم كل ما سواه\n وطلبتم منه الرجوع إلى بر الشريعة\n فلما نجاكم إلى البر أعرضتم عن شهود السِّوى\n وجحدتم وجوده\n لكن القلوب بيد الرحمن\n يُقلبها كيف شاء فلا يأمن العارف من المكر\n ولو بلغ ما بلغ\n ولذلك قال: أفأمنتم أن يخسف بكم جانب البر فتغرقون في الحس\n وتشتغلون بعبادة الحس\n أو يُرسل عليكم حاصباً: وارداً قَهَّارِيًّا\n يُخرجكم عن حد الاعتدال\n أم أمنتم أن يُعيدكم في بحر الحقيقة\n تارة أخرى\n بعد الرجوع للبقاء\n فيرسل عليكم واردًا قهاريًا يُخرجكم عن حد الاعتدال\n ويحطكم عن ذروة الكمال\n ثم لا تجدوا لكم علينا به تبيعًا\n والله تعالى أعلم\n ثمَّ ذكر كرامة بني آدم وتفضيلهم رداً لقول الشيطان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:55",
      "similarity": 0.48433213361243305
    },
    {
      "verse": "71:25",
      "similarity": 0.06280877487850343
    },
    {
      "verse": "26:66",
      "similarity": 0.06109084414262283
    },
    {
      "verse": "37:82",
      "similarity": 0.06109084414262283
    },
    {
      "verse": "26:120",
      "similarity": 0.05459365672523312
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017069.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017069.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:69.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}