{
  "chapter": "الإسراء",
  "text": "واستفزز من استطعت منهم بصوتك واجلب عليهم بخيلك ورجلك وشاركهم فى الامول والاولد وعدهم وما يعدهم الشيطن الا غرورا",
  "translations": [
    {
      "translation": "Stir up any of them you can with your voice and rally against them your cavalry and your infantry and share with them in their children and their wealth and make them promises! The promise of Shaytan is nothing but delusion.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mislead any of them you may with your voice, attack them with your cavalry and soldiers on foot, share their wealth and children with them, and make promises to them.\" -- But the promises of Satan are nothing but deceit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tempt with your call all whom you wish. Muster against them all your forces - your cavalry and your foot soldiers; share with them riches and offspring, and seduce them with rosy promises - and Satan's promise is nothing but a deception -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Draw anyone of them you can into sin by your voice and by your cavalry and infantry, share their property and children with them and make promises to them. Your promises are all lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And mislead those whom you can among them with your voice, and raise an army against them with your cavalry and infantry, and be their partner in wealth and children, and give them promises”; and Satan does not promise them except with deception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fool them gradually, those whom you can among them with your voice, Ajlib upon them with your cavalry and your infantry, share with them wealth and children, and make promises to them.\" But Shaytan promises them nothing but deceit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beguile whomsoever of them you can with your voice, and collect against them your forces riding and on foot, and share with them in wealth and children, and hold out promises to them; and the Shaitan makes not promises to them but to deceive:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And startle whomsoever of them thou canst with thy voice; and rally against them thy horsemen and thy foot, and share with them in their wealth and their children, and promise them!' But Satan promises them naught, except delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And excite any of them whom thou canst with thy voice, and urge thy horse and foot against them, and be a partner in their wealth and children, and promise them. Satan promiseth them only to deceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go ahead and entice whomsoever of them you can, with your voice, and mount assaults against them with your cavalry and infantry and be their partner in wealth and offspring, and make promises to them, Satan promises nothing but delusion,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unsettle thou whomsoever of them thou canst with thy voice, and summon against them thine horse and thine foot, and share with them riches- and children, and promise unto them; and the Satan promiseth not but to delude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Instigate whomever of them you can with your voice; and rally against them your cavalry and your infantry, and share with them in wealth and children, and make promises to them!’ But Satan promises them nothing but delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lead to destruction those whom thou canst among them, with thy (seductive) voice; make assaults on them with thy cavalry and thy infantry; mutually share with them wealth and children; and make promises to them.\" But Satan promises them nothing but deceit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Istafziz [literally means: befool them gradually] those whom you can among them with your voice (i.e. songs, music, and any other call for Allah's disobedience), make assaults on them with your cavalry and your infantry, mutually share with them wealth and children (by tempting them to earn money by illegal ways usury, etc., or by committing illegal sexual intercourse, etc.), and make promises to them.\" But Satan promises them nothing but deceit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rouse with your voice whoever you are able from among them. Rally against them your cavalry and those on foot. Share their wealth and children with them, and promise them' But satan promises them nothing except delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And entice whomever of them you can with your voice, and rally against them your cavalry and your infantry, and share with them in wealth and children, and make promises to them.” But Satan promises them nothing but delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And incite [to senselessness] whoever you can among them with your voice and assault them with your horses and foot soldiers and become a partner in their wealth and their children and promise them.\" But Satan does not promise them except delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:64] And tempt, dupe, whomever of them you can with your voice, by your calling them with songs and pipes and with every invitation to [acts of] disobedience; and rally, incite, against them your cavalry and your infantry, namely, those who ride and walk in acts of disobedience, and share with them in wealth, that is illicit, such as usury and extortion, and children, from [acts of] adultery, and make promises to them’, to the effect that there will not be any resurrection or requital. And Satan promises them, thereby, nothing but delusion, falsehood.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And excite any of them) make slip any of them (whom thou canst with your voice) with your call; and it is also said that this means: with your wind instruments, singing and all other abominable ways, (and urge) and gather; and it is also said this means: seek against them the help of (your horse) the horses of idolaters (and foot) the foot soldiers of the idolaters (against them, and be a partner in their wealth) unlawful wealth (and children) illegitimate children, (and promise them) that there is no Paradise or hell. (Satan promiseth them only to deceive) he promise them nothing except falsehood.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱسْتَفْزِزْ مَنِ ٱسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وَأَجْلِبْ عَلَيْهِم بِخَيْلِكَ وَرَجِلِكَ } استَفزِرْ بمعنى اسْتَخفْ، واستَجهلْ\n والصَوتُ: الغِناءُ وشِبْهُهُ\n وَخَيلهُ: كُلُّ دَابةٍ سَارتْ فِي مَعصيةِ الله تعالى\n { وَشَارِكْهُمْ فِي ٱلأَمْوَالِ وَٱلأَوْلادِ } [والأَمَوالُ]: كُلُّ مالٍ أُصيبَ مِن حَرَامٍ أَو مِنْ رِبا أَو غَيرِ ذَلكَ\n والأَولادُ: أَولادُ الزِّنا\n ويقالُ: الرَّجِلُ جَمعُ رَاجلٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And strike [the unbelievers] with your voice and threaten them with your horses and your men} - this means to humiliate them and to ignore them.\n\n\nAnd sound: singing and its resemblance.\n\n\nAnd his steeds: every creature that has committed a sin against Allah Most High.\n\n\nAnd share with them in wealth and children. [And wealth]: all money that is obtained from forbidden means or from interest or otherwise.\n\n\nAnd the children: the children of adultery.\n The man is a gathering of men.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعت جزاءك وجزاء من تبعك منهم { ٱسْتَفْزِزْ } أيها المطرود الملعون\n ي: حرِّك\n وزلزل عن موضع ثبوتهم وقرارهم على جادة التوحيد { مَنِ ٱسْتَطَعْتَ مِنْهُمْ } وتمكنت على إضلالهم عن طريق الحق { بِصَوْتِكَ } أي: بمجرد أن تصوت عليهم\n فينحرفوا من غاية ضعفهم في الإيمان { وَ } إن لم تقدر\n ولم تظفر عليهم بمجرد صوت لرسوخهم وتمكنهم في الجملة { أَجْلِبْ } أي: سِح وصوّت { عَلَيْهِم بِخَيْلِكَ } أي: بركبان أعوانك وجنودك { وَرَجِلِكَ } أي: بمشاتهم ورجالهم\n وبالجملة: تمم\n وأوفر جميع حيلك ومكرك مهما أمكنك حتى تستفزهم وتضعفهم من مقر الإيمان والعرفان\n\n\n{ وَ } إن شئت اتحادهم وإخاءهم { شَارِكْهُمْ فِي } جميع { ٱلأَمْوَالِ } أي: علّمهم السرقةَ الغضب وقطعَ الطريق والربا والحيلَ المشهورة المعروفة في هذا الزمن\n بالحيل الشرعية التي وضعها المتفقهة المتفسقة\n خذلهم الله من تلقاء نفوسهم الخبيثة الدنية { وَ } شاركهم أيضاً في { ٱلأَوْلادِ } أي: علمهم طريق الإباحةة والاستباحة وتحليل المحرمات المؤدية\n إلى تخليط الأنساب وامتزاج المياه كما ابتدعها أهل التلبيس والتدليس من المتشيخة الذين هم من جنودك\n أهلكهم الله وقهر عليهم\n { وَ } إن شئت { عِدْهُمْ } بالمواعيد الكاذبة التي مالت إليها نفوسهم واقضتت شهواتهم من ترك التكاليف والأعمال الشاقة من الفرائض والسنن والآداب والنوافل المقربة نحو الحق\n والإنكار على النشأة الآخرة\n وما يترتب عليها من الأمور المسئولة عنها\n المؤاخذة عليه والجنة والنار { وَ } معلوم أن { مَا يَعِدُهُمُ ٱلشَّيْطَانُ } المغوي المضل { إِلاَّ غُرُوراً } [الإسراء: 64] أي: تزييناً وتحسيناً للباطل بصورة الحق وادعاء الحقية والحقيقة لهم\n ليغريهم بها\n ويضلهم عن طريق الحق\n\n\nوبالجملة: افعل بهم أيها الحريص على إضلالهم ما شئت من المكر والحيل والخداع\n وهم إن كانوا من زمرة أرباب الاطمئنان الإيقان\n المقررين في مقر التوحيد والعرفان\n الموفقين عليه من عندنا\n لا يتبعونك ولا يقبلون منك وساوسك وهذياناتك\n وليس لك عليهم سلطان أصلاً\n\nوإن كانوا من المطبوعين المختومين من عندنا\n المجبولين على الضلال والغواية\n فيتبعوك ويقتفوا أثرك\n فلحقهم ما لحق بك\n وهم من جنودك وأتباعك\n وبالجملة:\n[النور: 40]\n\n\nثم قال سبحانه: { إِنَّ } خُلَّص { عِبَادِي } أضافهم سبحانه إلى نفسه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واستفزز } استخفف\n أو اخدع { مَن استطعتَ منهم } أن تستفز { بصوتك } بدعائك إلى الفساد\n { وأَجْلِبْ عليهم } أي: صِحْ عليهم\n من الجلبة\n وهي: الصياح\n { بخَيْلكَ ورَجِلكَ } أي: بأعوانك من راكب وراجل\n قيل: هو مجاز\n أي: افعل بهم جهدك\n وقيل: إن له من الشياطين خيلاً ورجالاً\n وقيل: المراد: بيان الراكبين في طلب المعاصي\n والماشين إليها بأرجلهم\n { وشارِكْهمْ في الأموال } بحملهم على كسبها وجمعها من الحرام\n والتصرف فيها على ما لا ينبغي\n كإنفاقها في المعاصي\n { والأولادِ } بالحث على التوصل إلى الولد بالسبب الحرام\n كالزنى وشبهه من فساد الأنكحة\n وكتسمية الولد عبد شمس وعبد الحارث وعبد العُزّى\n وقال في الإحياء: قال يونس بن زيد: بلغنا أنه يُولد مع أبناء الإنس من أبناء الجن\n ثم ينشأون معهم\n\nقال ابن عطية: وما أدخله النّقَّاشُ من وطء الجن\n وأنه يحبل المرأة من الإنس\n فضعيف كله\n هـ\n قال في الحاشية: وضَعْفُهُ ظاهر\n والآية مشيرة لرده لأنها إنما أثبتت المشاركة في الولد\n لا في الإيلاء\n فإنه لم يرد\n ولو قيل به لكان ذريعة لفساد كبير\n ولكان شبهة يُدْرَأُ بها الحد\n ولا قائل بذلك\n وانظر الثعالبي الجزائري فقد ذكر حكاية في المشاركة في الوطء عمن اتفق له ذلك\n فالله أعلم\n وأما عكس ذلك إيلاء الإنسي الجنية\n فأمر لا يحيله العقل\n وقد جاء الخبر به في أمر بلقيس\n قاله المحشي الفاسي\n { وعِدْهُمْ } بأن لا بعث ولا حساب\n أو المواعد الباطلة كشفاعة الآلهة\n والاتّكال على كرامة الآباء\n وتأخير التوبة\n وطول الأمل\n { وما يعدُهم الشيطانُ إِلا غرورًا } وباطلاً\n والغرور: تزيين الخطأ بما يُوهم أنه صواب\n قاله البيضاوي\n الإشارة: ينبغي لك أيها الإنسان أن تكون مضادًا للشيطان\n فإذا امتنع من الخضوع لآدم فاخضع أنت لأولاد آدم بالتواضع واللين\n وإذا كان هو مجتهدًا في إغواء بني آدم بما يقدر عليه\n فاجتهد أنت في نصحهم وإرشادهم\n وتعليمهم ووعظهم وتذكيرهم\n بقدر ما يمكنك\n واستعمل السير إليهم بخيلك ورجلك\n حتى تنقذهم من غروره وكيده\n وإذا كان هو يدلهم على الشرك الجلي والخفي\n في أموالهم وأولادهم\n فدُلَّهم أنت على التوحيد\n والإخلاص\n في اعتقادهم وأعمالهم وأموالهم\n وإذا كان يعدهم بالمواعد الكاذبة\n فعدهم أنت بالمواعد الصادقة كحسن الظن بالله\n إن صحبه العمل بما يرضيه\n فإن فعلت هذا كنت من عباد الله الذين ليس له عليهم سلطان\n كما أشار إليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:59",
      "similarity": 0.5246557232260851
    },
    {
      "verse": "17:103",
      "similarity": 0.39836083067957095
    },
    {
      "verse": "17:76",
      "similarity": 0.3898980949484749
    },
    {
      "verse": "49:2",
      "similarity": 0.23311571202763992
    },
    {
      "verse": "31:19",
      "similarity": 0.18873800211296432
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/17:64.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/17:64.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/17:64.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}