{
  "chapter": "الإسراء",
  "text": "ربكم الذى يزجى لكم الفلك فى البحر لتبتغوا۟ من فضله انه كان بكم رحيما",
  "translations": [
    {
      "translation": "Your Lord is He who propels the ships on the sea for you so that you may seek His bounty. He is indeed",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is your Lord who drives your ships across the seas that you may seek of His bounty. He is verily kind to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He Who steers your vessels across the seas that you may seek of His Bounty. He is ever Merciful towards you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord who causes the ships to sail on the sea so that you may seek His bounty is certainly All-merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He Who sails the ship upon the seas for you, so that you may seek His munificence; indeed He is Most Merciful upon you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He Who drives the ship for you through the sea, in order that you may seek of His bounty. Truly, He is ever Most Merciful towards you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He Who speeds the ships for you in the sea that you may seek of His grace; surely He is ever Merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord it is who drives for you the ships on the sea that you may seek His bounty; surely He is All-compassionate towards you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O mankind), your Lord is He Who driveth for you the ship upon the sea that ye may seek of His bounty. Lo! He was ever Merciful toward you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He who causes the ships to move onward for you across the sea, so that you may go in quest of His bounty: He is most merciful towards you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He who speedeth for you the ship in the sea that ye may seek His grace; verily He it unto you ever Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He who drives for you the ships in the sea that you may seek of His bounty. Indeed, He is most merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He That maketh the Ship go smoothly for you through the sea, in order that ye may seek of his Bounty. For he is unto you most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He Who drives the ship for you through the sea, in order that you may seek of His Bounty. Truly! He is Ever Most Merciful towards you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is your Lord who drives your ships at sea so that you may seek His bounty. He is indeed the Most Merciful towards you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is He who propels for you the ships at sea, that you may seek of His bounty. He is towards you Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is your Lord who drives the ship for you through the sea that you may seek of His bounty. Indeed, He is ever, to you, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:66] Your Lord is He Who drives for you the ships upon the sea that you may seek of His bounty, exalted be He, through [engaging in] commerce. Truly He is ever Merciful towards you, by disposing these [ships] for you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((0 mankind), your Lord is He Who driveth for you the ship upon the sea that you may seek of His bounty) so that you seek of His provision; and it is also said this means: so that you seek of his knowledge. (Lo! He was ever Merciful towards you) by deferring your punishment; it is also said that this means: He is ever merciful towards whoever repents amongst you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يحفظم سبحانه، ولا يعذبكم أيها المؤمنون المخلصون عما يؤذيكم ويقصد مقتكم: { رَّبُّكُمُ ٱلَّذِي يُزْجِي } يُسري ويُجري { لَكُمُ ٱلْفُلْكَ } الجاريةَ { فِي ٱلْبَحْرِ } بتيسيره وتسهيله عنايةً منه إيااكم { لِتَبْتَغُواْ } وتطلبوا { مِن فَضْلِهِ } ما يوسع لكم طريق المعاش من أنواع التجارات والأرباح، واستخراج الجواهر منها، وغير ذلك { إِنَّهُ } سبحانه من كمال جوده وسعة رحمته { كَانَ بِكُمْ رَحِيماً } [الإسراء: 66] مشفقاً عطوفاً، سيما بعد اتكالكم عليه سبحانه على وجه الأرض\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر ما يحث على التعلق به، والتوكل عليه في جميع الأحوال الدينية والدنيوية، فقال: { ربكم الذي يُزجي } يجري { لكم الفلك } ويسيرها { في البحر لتبتغوا من فضله } بالتجارة والربح، وجَلْبِ أنواع الأمتعة التي لا تكون عندكم، { إِنه كان بكم رحيمًا } في تسخيرها لكم حيث هيأ لكم ما تحتاجون إليه في سيرها، وسهل عليكم ما يعسر من أسباب معاشكم ومعادكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:88",
      "similarity": 0.5997708892501409
    },
    {
      "verse": "45:12",
      "similarity": 0.30473026341185394
    },
    {
      "verse": "24:43",
      "similarity": 0.2801706602085335
    },
    {
      "verse": "31:31",
      "similarity": 0.24151411201006973
    },
    {
      "verse": "30:46",
      "similarity": 0.22691458210266735
    }
  ]
}