{
  "chapter": "الإسراء",
  "text": "واذا مسكم الضر فى البحر ضل من تدعون الا اياه فلما نجىكم الى البر اعرضتم وكان الانسن كفورا",
  "translations": [
    {
      "translation": "When harm occurs to you at sea, those you call on vanish - except for Him alone! But when He delivers you to dry land, you turn away. Man truly is ungrateful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a calamity befalls you on the sea, all those you invoke fail you except Him. But when He brings you safely to the shore, you turn away, for man is most ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a calamity befalls you on the sea, all those whom you invoke forsake you except Him. But when He delivers you safely to the shore you turn away from Him, for man is indeed most thankless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are afflicted by hardships in the middle of the sea, it would be an error to call anyone other than Him for help. When God saves you from such difficulties, you turn away from Him. The human being has always been ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when calamity strikes you upon the sea, all those whom you worship are lost, except Him; then when He rescues you towards land, you turn away; and man is extremely ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm touches you upon the sea, those that you call upon vanish from you except Him. But when He brings you safe to land, you turn away. And man is ever ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when distress afflicts you in the sea, away go those whom you call on except He; but when He brings you safe to the land, you turn aside; and man is ever ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when affliction visits you upon the sea, then there go astray those on whom you call except Him; and when He delivers you to land, you turn away; man is ever unthankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm toucheth you upon the sea, all unto whom ye cry (for succour) fail save Him (alone), but when He bringeth you safe to land, ye turn away, for man was ever thankless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When danger threatens you at sea, you call upon Him, and forget all others you are wont to invoke. But when He brings you safe to land, you turn away from Him. Man is ever ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there toucheth you a distress on the sea, those whom ye call upon fall away except Him alone, then when He delivereth you on the land ye turn away: and man is ever ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When distress befalls you at sea, those whom you invoke besides Him are forsaken. But when He delivers you to land, you are disregardful [of Him]. Man is very ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When distress seizes you at sea, those that ye call upon - besides Himself - leave you in the lurch! but when He brings you back safe to land, ye turn away (from Him). Most ungrateful is man!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when harm touches you upon the sea, those that you call upon besides Him vanish from you except Him (Allah Alone). But when He brings you safely to land, you turn away (from Him). And man is ever ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When misfortune befalls you at sea, all except He of those to whom you supplicate forsake you; yet when He delivers you safely to the land, you turn away. The human is unthankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When harm afflicts you at sea, those you pray to vanish, except for Him. But when He saves you to land, you turn away. The human being is ever thankless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when adversity touches you at sea, lost are [all] those you invoke except for Him. But when He delivers you to the land, you turn away [from Him]. And ever is man ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:67] And when distress, difficulty, befalls you at sea, [such as] fear of drowning, those whom you [are wont to] invoke are no longer present, [those whom] you [are wont to] worship of gods [are no longer present], and so you do not call on them — except Him, exalted be He, for on Him alone you do call, because you are suffering a distress which only He can remove. But when He delivers you, from drowning and brings you, to land, you are rejective, of [God’s] Oneness, for man is ever ungrateful, [ever] denying [God’s] graces.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when harm) hardship and tribulation (toucheth you upon the sea, all unto whom ye cry (for succour) fail) you leave the idols which you worship, and you do not ask them to save you, (save Him (alone)) you only ask Allah to save you, (but when He bringeth you safe to land, ye turn away) from thanking Him and declaring His divine Oneness, (for man) the disbelieving man (was ever thankless) He denies the bounties of Allah. 306\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مما ارتكز في نفوسهم ورسخ في قلوبكم\n أنكم { إِذَا مَسَّكُمُ ٱلْضُّرُّ فِي ٱلْبَحْرِ } بأن عرض لمركبكم ما يوجب كسرها وغرقها\n وصرتم فيها حيارى سكارى\n بحيث { ضَلَّ } وغاب عنكم { مَن تَدْعُونَ } وتستغيثون منه لو كنتم في البر\n وما معكم من الأمتعة والبضاعات { إِلاَّ } استعانتكم واستغاثتكم { إِيَّاهُ } سبحانه\n فإنه بذاته لا يغيب عنكم\n ولا يفارقكم\n إذ هو أقرب إليكم من حبل وريدكم { فَلَمَّا نَجَّاكُمْ } وخلّصكم سبحانه من تلك المضائق الهائلة { إِلَى ٱلْبَرِّ أَعْرَضْتُمْ } عنه سبحانه\n وصرتم متعلقين بما معكم من الأمتة والأعراض { وَكَانَ ٱلإِنْسَانُ } في أصل فطرته خُلق { كَفُوراً } [الإسراء: 67] لأنعم الله\n[المعارج: 19-20] نحو الحق\nكفوراً\n[المعارج: 21] معرضاً عنه منكراًً له\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِذا مسَّكم الضرُّ في البحر } يعني: خوف الغرق، { ضَلَّ } غاب عنكم { من تَدْعُون }من تعبدون من الآلهة\n أو: من تستغيثون به في حوادثكم، { إِلا إِيَّاه } وحده، فإنكم حينئذ لا يخطرُ ببالكم سواه، ولا تدعون، لكشفه، إلا إياه، فكيف تعبدون غيره، وأنتم لا تجدون في تلك الشدة إلا إياه؟ { فلما نجَّاكم } من الغرق { إِلى البر أعرضتم } عن التوحيد، أو عن شكر النعمة، { وكان الإِنسانُ كفورًا } بالنعم، جحودًا لها، إلا القليل، وهو كالتعليل للإعراض",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:24",
      "similarity": 0.3753950752167993
    },
    {
      "verse": "2:224",
      "similarity": 0.35649428305892356
    },
    {
      "verse": "27:63",
      "similarity": 0.3464792689601927
    },
    {
      "verse": "6:63",
      "similarity": 0.3453772960934848
    },
    {
      "verse": "30:41",
      "similarity": 0.3380916479722862
    }
  ]
}