{
  "chapter": "الإسراء",
  "text": "قال ارءيتك هذا الذى كرمت على لئن اخرتن الى يوم القيمة لاحتنكن ذريته الا قليلا",
  "translations": [
    {
      "translation": "He said, 'Do You see this creature You have honoured over me? If You reprieve me till the Day of Rising, I will be the master of his descendants except for a very few.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And) said: \"Look! This is what you have honoured above me! If You defer (my term) till the Day of Resurrection, I will bring his progeny into complete subjugation, barring a few.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He then continued: \"Look! This is he whom You have exalted above me! If you will grant me respite till the Day of Resurrection I shall uproot the whole of his progeny except only a few.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He continued, \"Remember, this one whom you have honored more than me I shall bring him and most of his offspring under my sway if you will give me respite until the Day of Judgment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Behold this* – the one whom You have honoured above me – if You give me respite till the Day of Resurrection, I will surely crush his descendants, except a few.” (* Prophet Adam.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"See this one whom You have honored above me, if You give me respite to the Day of Resurrection, I will surely, seize and mislead his offspring, all but a few!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Tell me, is this he whom Thou hast honored above me? If Thou shouldst respite me to the day of resurrection, I will most certainly cause his progeny to perish except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'What thinkest Thou? This whom Thou hast honoured above me -- if Thou deferrest me to the Day of Resurrection I shall assuredly master his seed, save a few.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Seest Thou this (creature) whom Thou hast honoured above me, if Thou give me grace until the Day of Resurrection I verily will seize his seed, save but a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and [further] said, \"Do you see this being whom You have exalted above me? If You reprieve me until the Day of Resurrection, I will bring all but a few of his descendents under my sway.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "lblis said; bethinkest Thou: This one whom Thou hast honoured above me- if Thou deferrest me till the Day of Judgment, shall surely seize his progeny save a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, ‘Do You see this one whom You have honoured above me? If You respite me until the Day of Resurrection, I will surely lay my yoke on his progeny, [all] except a few.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Seest Thou? this is the one whom Thou hast honoured above me! If Thou wilt but respite me to the Day of Judgment, I will surely bring his descendants under my sway - all but a few!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblis (Satan)] said: \"See? This one whom You have honoured above me, if You give me respite (keep me alive) to the Day of Resurrection, I will surely seize and mislead his offspring (by sending them astray) all but a few!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do You think' he said: 'This whom You have honored above me, if You defer me until the Day of Resurrection, I will root out all but a few of his seed (by misleading them)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Do You see this one whom You have honored more than me? If You reprieve me until the Day of Resurrection, I will bring his descendants under my sway, except for a few.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Iblees] said, \"Do You see this one whom You have honored above me? If You delay me until the Day of Resurrection, I will surely destroy his descendants, except for a few.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:62] Said he, ‘Do You see — in other words, inform me: this one whom You have honoured, [whom] You have preferred, above me?, by commanding that prostration should be made before him, when ‘I am better than him. You created me from fire, while him You created from clay’ [Q. 7:12]. If (la-in: the lām is for oaths) You defer me to the Day of Resurrection I shall verily eradicate his seed, by leading them astray, [all] save a few’, of them, of those whom You have given [divine] protection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة { قال أرأيتك } بدل اشتمال من جملة { أأسجد لمن خلقت طيناً } باعتبار ما تشتمل عليْه من احتقار آدم وتغليط الإرادة من تفضيله . فقد أعيد إنكار التفضيل بقوله : { أرأيتك } المفيد الإنكار . وعلل الإنكار بإضمار المكر لذريته ، ولذلك فصلت جملة { قال أرأيتك } عن جملة { قال أأسجد } كما وقع في قوله تعالى : { فوسوس إليه الشيطان قال يا آدم هل أدلك على شجرة الخلد } \\[ طه : 120 \\].و { أرأيتك } تركيب يفتتح بها الكلام الذي يراد تحقيقه والاهتمام به . ومعناه : أخبرني عما رأيت ، وهو مركب من همزة استفهام ، و ( رأى ) التي بمعنى علم وتاء المخاطب المفرد المرفوع ، ثم يزاد على ضمير الخطاب كافُ خطاب تشبه ضمير الخطاب المنصوب بحسب المخاطب واحداً أو متعدداً . يقال : أرأيتك وأرأيتكم كما تقدم في قوله تعالى : { قل أرأيتكم إن أتاكم عذاب الله أو أتتكم الساعة } في سورة \\[ الأنعام : 40 \\]. وهذه الكاف عند البصريين تأكيد لمعنى الخطاب الذي تفيده تاء الخطاب التي في محل رفع ، وهو يشبه التوكيد اللفظي . وقال الفراء : الكاف ضمير نصب ، والتركيب : أرأيتَ نفسك . وهذا أقرب للاستعمال ، ويسوغه أن أفعال الظن والعلم قد تنصب على المفعولية ما هو ضميرُ فاعلها نحو قول طرفةفما لي أراني وابنَ عمي مالكاً ... مَتى أدْنُ منه ينأ عني ويبَعَدأي أرى نفسي .واسم الإشارة مستعمل في التحقير ، كقوله تعالى : { أهذا الذي يذكر آلهتكم } \\[ الأنبياء : 36 \\]. والمعنى أخبرني عن نيتك أهذا الذي كرمته عليّ بلا وجه .وجملة { لئن أخرتن إلى يوم القيامة } الخ مستأنفة استئنافاً ابتدائياً ، وهي جملة قَسَمية ، واللام موطئة للقسم المحذوف مع الشرط ، والخبرُ مستعمل في الدعاء فهو في معنى قوله : { قال رب فأنظرني إلى يوم يبعثون } \\[ ص : 79 \\].وهذا الكلام صدر من إبليس إعراباً عما في ضميره وإنما شرط التأخير إلى يوم القيامة ليعم بإغوائه جميع أجيال ذرية آدم فلا يكون جيل آمنا من إغوائه .وصدر ذلك من إبليس عن وجدان ألقي في نفسه صادف مراد الله منه فإن الله لما خلقه قدر له أن يكون عنصر إغواء إلى يوم القيامة وأنه يُغوي كثيراً من البشر ويَسلَم منه قليل منهم .وإنما اقتصر على إغواء ذرية آدم ولم يذكر إغواءَ آدم وهو أولى بالذكر إذ آدم هو أصل عداوة الشيطان الناشئة عن الحسد من تفضيله عليه إما لأن هذا الكلام قاله بعد أن أعوَى آدم وأخرج من الجنة فقد شفَى غليله منه وبقيت العداوة مسترسلة في ذرية آدم ، قال تعالى : { إن الشيطان لكم عدو } \\[ فاطر : 6 \\].والاحتناك : وضع الراكب اللجامَ في حَنَك الفرس ليركَبه ويَسيّره ، فهو هنا تمثيل لجلب ذرية آدم إلى مراده من الإفساد والإغواء بتسيير الفَرس على حب ما يريد راكبه .\n\n",
      "translations": [
        {
          "translation": "(He said: Seet Thou this (creature) whom Thou hast honoured above me) by means of this prostration, (if Thou give me grace) if you reprieve me (until the Day of Resurrection I verily will seize) I will cause to slip, overpower and dominate (his seed, save but a few) who are protected from me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لأَحْتَنِكَنَّ ذُرِّيَّتَهُ إِلاَّ قَلِيلاً } معناهُ لاَسْتَمِيلَنهُم\n والاحْتِنَاكُ: معناه الغَلبةُ والقَهرُ والاستِيلاءُ\n والقَليلُ: هُم المَعْصُومُونَ\n\n",
      "translations": [
        {
          "translation": " And His saying, {I will surely make you a successor on the earth} [Qur'an 38:26], its meaning is that He will not destroy them.\n\n\nAnd the subjugation: it means the dominance and the coercion and the taking by force.\n\n\nAnd the few: they are the protected ones.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والله وبحق عظمتك وجلالك { لَئِنْ أَخَّرْتَنِ } وأبقيتني فيما بينهم { إِلَىٰ يَوْمِ ٱلْقِيَامَةِ } المعدة لتنفيذ الأعمال وعرضها على جنابك { لأَحْتَنِكَنَّ ذُرِّيَّتَهُ } أي: أضلنهم وأغوينهم بالإغواء والإغواء إلى حيث أمحونَّ أسماءهم عن دفتر المؤمنين\n فكيف عن العارفين المكاشفين المشاهدين\n لأن تركيبهم وبنيتهم هذا مقتضى أنواع الفسادات وأصناف العصيان والضلالاات\n ولي فيهم مداخل كثيرة أوسوسهم وأغريهم إلى حيث أضلهم عن منهج الرشاد ومسلك السداد { إِلاَّ قَلِيلاً } [الإسراء: 62] منهم فإنهم ثابتون على ما جُبلوا لأجله لا أقدر على إغوائهم\n لكونهم مؤيدين من عندك\n موفقين بتوفيقك\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { هذا }: مفعول \" أرأيت \" ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:172",
      "similarity": 0.06027681637961377
    },
    {
      "verse": "6:133",
      "similarity": 0.05588747467542246
    },
    {
      "verse": "99:7",
      "similarity": 0.05319411966217361
    },
    {
      "verse": "10:83",
      "similarity": 0.052177691224921795
    },
    {
      "verse": "99:8",
      "similarity": 0.05197469489741233
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}