{
  "chapter": "الإسراء",
  "text": "ومن اليل فتهجد به نافلة لك عسى ان يبعثك ربك مقاما محمودا",
  "translations": [
    {
      "translation": "And stay awake for prayer during part of the night as a supererogatory action for yourself. It may well be that your Lord will raise you to a Praiseworthy Station.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say a supererogatory prayer at the hour of the first watch: Your Lord may raise you to a most exalted station.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rise from sleep during the night as well- this is an additional Prayer for you. Possibly your Lord will raise you to an honoured position.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say your special (tahajjud) prayer during some part of the night as an additional (obligatory) prayer for you alone so that perhaps your Lord will raise you to a highly praiseworthy position.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And forego sleep* in some part of the night – an increase for you**; it is likely your Lord will set you on a place where everyone will praise you***. (* For worship. ** Obligatory only upon the Holy Prophet. *** On the Day of Resurrection.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in some parts of the night (also) offer the Salah with it as an additional prayer for you. It may be that your Lord will raise you to Maqam Mahmud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And during a part of the night, pray Tahajjud beyond what is incumbent on you; maybe your Lord will raise you to a position of great glory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the night, keep vigil a part of it, as a work of supererogation for thee; it may be that thy Lord will raise thee up to a laudable station.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some part of the night awake for it, a largess for thee. It may be that thy Lord will raise thee to a praised estate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And during the night wake up and pray, as an additional prayer: it may well be that your Lord will raise you to a station of praise and glory.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the night--keep the vigil therein, as an act of supererogation for thee; belike thy Lord will raise thee up in a station praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep vigil for a part of the night, as a supererogatory [devotion] for you. It may be that your Lord will raise you to a praiseworthy station.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And pray in the small watches of the morning: (it would be) an additional prayer (or spiritual profit) for thee: soon will thy Lord raise thee to a Station of Praise and Glory!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in some parts of the night (also) offer the Salat (prayer) with it (i.e. recite the Quran in the prayer), as an additional prayer (Tahajjud optional prayer Nawafil) for you (O Muhammad SAW). It may be that your Lord will raise you to Maqaman Mahmuda (a station of praise and glory, i.e. the highest degree in Paradise!).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the night there is a voluntary deed for you to keep vigil in part it. Perhaps your Lord will raise you to a praiseworthy station.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep vigil with it during parts of the night, as an extra prayer. Perhaps your Lord will raise you to a laudable position.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from [part of] the night, pray with it as additional [worship] for you; it is expected that your Lord will resurrect you to a praised station.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:79] And for a part of the night, keep vigil, perform prayer, therewith, with the Qur’ān, as a supererogatory [devotion] for you, as an extra obligation for you to the exclusion of your community, or [it means] as extra merit [for you] on top of the [other] obligatory prayers. It may be that your Lord will raise you to, establish you, in the Hereafter, in, a praiseworthy station, one for which the first and last [of mankind] will praise you — and this is the station of intercession [which will take place] during [the passing of] the Final Judgement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And some part of the night awake for it) to recite the Qur'an and to pray after sleeping a little, (a largess for thee) a merit for you; it is also said that this means: you alone are enjoined to do so. (It may be) and the expression 'may be' when used in connection with Allah means: it is a requisite (that thy Lord will raise thee to a praised estate) the station of intercession whereof you will be praised by the people of old and the people of new.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمِنَ ٱلْلَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَّكَ } قال زيد بن علي عليهما السلام التَّهجّدُ: القَيامُ بَعدَ النَّومِ والهُجودُ: النَّومَ أيضاً\n\n\n\n\nوقوله تعالى: { عَسَىٰ أَن يَبْعَثَكَ رَبُّكَ مَقَاماً مَّحْمُوداً } فالمَقامُ المَحمودُ: الشَّفاعةُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah {And from the night, so pray with it an extra prayer for you} Zaid bin Ali, may Allah be pleased with them both, said: \"Tahajud is standing after sleep and Hudud is sleep as well.\"\n\n\nAnd His saying, \"Your Lord may raise you to a praised station\" - the praised station is intercession.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ومن الليل فتهجد به } أي: خصّص بعض الليل بالتهجد { نافلة لك } زيادة على ما فرض خاصة بك\n لكونه علامة مقام النفس\n فيجب تخصيصه بزيادة الطاعة لزيادة احتياج هذا المقام إلى الصلاة بالنسبة إلى سائر المقامات فيقتدي بك السالكون من أمّتك في تطويع نفوسهم ويقوى تمكنك في مقام الاستقامة\n كما قال: \" أفلا أكون عبداً شكوراً \"\n { عسى أن يبعثك ربّك مقاماً محموداً } أي: في مقام يجب على الكل حمده وهو مقام ختم الولاية بظهور المهدي\n فإن خاتم النبوّة في مقام محمود من وجه هو جهة كونه خاتم النبوة غير محمود من وجه هو جهة ختم الولاية\n فهو من هذا الوجه في مقام الحامدية فإذا تم ختم الولاية يكون في مقام محمود من كل وجه\n { وقل ربّ أدخلني } حضرة الوحدة في عين الجمع { مدخل صدق } مدخلاً حسناً مرضياً به بلا آفة زيغ البصر بالالتفات إلى الغير ولا الطغيان بظهور الأنائية ولا شوب الاثنينية { وأخرجني } إلى الكثرة عند الرجوع إلى التفصيل بالوجود الموهوب الحقاني { مخرج صدق } مخرجاً حسناً مرضياً به من غير آفة التلوين بالميل إلى النفس وصفاته ولا الضلال بعد الهدى بالانحراف عن جادّة الاستقامة والزيغ عن سنن العدالة إلى الجور كالفتنة الداودية { واجْعَل لي من لدنك سلطاناً نصيراً } حجة ناصرة بالتثبيت والتمكين بأن أكون بك في الأشياء في حال البقاء بعد الفناء لا بنفسي كما قال عليه الصلاة والسلام:\n \" لا تكلني إلى نفسي طرفة عين \" \n\n أو عزّاً وقوة قهرية بك\n أقوي بها دينك وأظهره على الأديان كلها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لتكون { نَافِلَةً } زائدة { لَّكَ } على فرائضك مزيدةً لقربك وكرامتك { عَسَىٰ أَن يَبْعَثَكَ } ويقيمك { رَبُّكَ } بسعيك واجتهادك في تهجدك { مَقَاماً مَّحْمُوداً } [الإسراء: 79] أي: مقاماً من مقامات القرب ودرجات الوصال مسمىً بالمقام المحمود\n لأن كل من وصل إليه يُحمد له\n إذ لا مقام أرفع منه وأعلى منه وأعلى رتبة ومكانة\n\nوبعدما وصلت أيها السالك الناسك إليها لم يبقَ لك درجة الاستكمال والاسترشاد\n بل صرت كاملاً رشيداً وإن اُلهمت وأذنت من عنده سبحانه صرتَ مرشداً مكملاً لأهل النقصان\n شفيعاً لهم عند الله بإذنه\n لتنقذَهم من لوازم الإمكان المفضي إلى دركات النيران\n وتوصلَهم إلى فضاء الجنان بتوفيق الله إياك وإياهم\n\n\n{ وَ } بعد وصولك لسيعك وجهدك وأنواع تهجدك\n وإقامتك في خلال الليالي بتوفيق الله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { نافلةً لك } أي: فريضة زائدة لك على الصلوات الخمس\n أو فريضة زائدة لك لاختصاص وجوبها بك\n أو نافلة زائدة لك على الفرائض غير واجبة\n وكأنه\n لما أمر بالفرائض\n أمر بعدها بالنوافل\n وتطوعه - عليه الصلاة والسلام - لزيادة الدرجات\n لا لجبر خلل أو تكفير ذنب لأنه مغفور له ما تقدم وما تأخر\n و \" من \": للتبعيض\n والضمير في \" به \": للقرآن\n والتهجد: السهر\n وهو: ترك الهجود\n أي: النوم\n فالتفعل هنا للإزالة كالتأثم والتحرج\n لإزالة الإثم والحرج\n ثم ذكر ثوابه في حقه - عليه الصلاة والسلام - فقال: { عسى أنْ يبعثك ربك مقامًا محمودًا } عندك وعند جميع الناس\n وهي: الشفاعة العظمى\n وفيه تهوين لمشقة قيام الليل\n رَوى أبو هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال:\n \" المَقَام المحمُود هُوَ المَقَامُ الذي أَشْفَعُ فِيهِ لأمَّتِي \" \nوقال ابن عباس رضي الله عنه: مقامًا محمودًا يحمده فيه الأولون والآخرون\n ويشرف فيه على جميع الخلائق\n يسأل فيُعطى\n ويشفع فيُشَفَّع\n وعن حذيفة: يُجْمع الناس في صعيد واحد\n فلا تتكلم فيه نفس إلا بإذنه\n فأول مدعو محمدٌ صلى الله عليه وسلم\n فيقول:\n \" لبيك وسعديك\n والشر ليس إليك\n والمَهدي من هديت\n وعبدك بين يديك\n وبك وإليك\n لا ملجأ ولا منجا منك إلا إليك\n تباركت وتعاليت\n سبحانك رب البيت \" \nثم يأذن له في الشفاعة\n والله تعالى أعلم\n وقال ابن العربي المعافري في أحكامه: واخْتُلِفَ في وجه كون قيام الليل سببًا للمقام المحمود على قولين\n فقيل: إن البارئ تعالى يجعل ما يشاء من فضله سببًا لفضله\n من غير معرفة منا بوجه الحكمة\n\nوقيل: إن قيام الليل فيه الخلوة به تعالى\n والمناجاة معه دون الناس\n فيعطي الخلوة به والمناجاة في القيامة\n فيكون مقامًا محمودًا\n ويتفاضل فيه الخلق بحسب درجاتهم\n وأجلُّهم فيه درجةً: نبينا محمد صلى الله عليه وسلم\n فيعطى من المحامد ما لم يُعط قبل\n ويُشَفَّع فيَشْفَع\n هـ\n قال شيخ شيوخنا سيدي عبد الرحمن الفاسي: وقد يقال: إن ذلك مرتب على قوله: { أقم الصلاة\n\n\n } الآية\n ولا يخص بقيام الليل\n والصلاةُ\n مطلقًا مفاتحةٌ للدخول على الله ومناجاةٌ له\n ولذلك جاء في حديث الشفاعة افتتاحه بأن \" يخر ساجدًا حامدًا\n فيؤذن حينئذ بالشفاعة \"\n ومن تواضع رفعه الله\n هـ\n  الإشارة: قوم اعتنوا بإقامة صلاة الجوارح\n وهم: الصالحون الأبرار\n وقوم اعتنوا بإقامة صلاة القلوب\n التي هي الصلاة الدائمة\n وهم العارفون الكبار\n وقوم اعتنوا بسهر الليل في الركوع والسجود\n وهم العباد والزهاد والصالحون\n أولو الجد والاجتهاد\n وقوم اعتنوا بسهره في فكرة العيان والشهود\n وهم المقربون عند الملك الودود\n الأولون يُوفون أجرهم على التمام بالحور والولدان\n والآخرون يُكشف لهم الحجاب ويتمتعون بالنظر على الدوام\n الأولون محبون\n والآخرون محبوبون\n الأولون يشفعون في أقاربهم ومن تعلق بهم\n والآخرون قد يشفع واحد منهم في أهل عصره\n وما ذلك على الله بعزيز\n ولما أمره بالقيام بوظائف العبودية أمره بالتعلق في أموره عليها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:1",
      "similarity": 0.37225402862863094
    },
    {
      "verse": "21:72",
      "similarity": 0.3451813504161088
    },
    {
      "verse": "2:246",
      "similarity": 0.06598787872278684
    },
    {
      "verse": "9:18",
      "similarity": 0.05058461575634336
    },
    {
      "verse": "4:99",
      "similarity": 0.05022609239127949
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017079.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017079.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:79.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}