{
  "chapter": "الإسراء",
  "text": "اقم الصلوة لدلوك الشمس الى غسق اليل وقرءان الفجر ان قرءان الفجر كان مشهودا",
  "translations": [
    {
      "translation": "Establish salat from the time the sun declines until the darkening of the night, and also the recitation at dawn. The dawn recitation is certainly witnessed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe the service of prayer from the sun's declining from the meridian to the darkening of the night, and the recitation at dawn. Indeed the Recitation at dawn is palpably evident.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish Prayer from the declining of the sun to the darkness of the night; and hold fast to the recitation of the Qur'an at dawn, for the recitation of the Qur'an at dawn is witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say your prayer when the sun declines until the darkness of night and also at dawn. Dawn is certainly witnessed (by the angels of the night and day).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Keep the prayer established, from the declining of the sun until darkness of the night, and the Qur’an at dawn; indeed the angels witness the reading of the Qur’an at dawn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perform the Salah from midday till the darkness of the night, and recite the Qur'an in the early dawn. Verily, the recitation of the Qur'an in the early dawn is ever witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Keep up prayer from the declining of the sun till the darkness of the night and the morning recitation; surely the morning recitation is witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perform the prayer at the sinking of the sun to the darkening of the night and the recital of dawn; surely the recital of dawn is witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish worship at the going down of the sun until the dark of night, and (the recital of) the Qur'an at dawn. Lo! (the recital of) the Qur'an at dawn is ever witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say your prayers from the decline of the sun, until nightfall; and at dawn -- the recitation at dawn is indeed witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish thou the prayer from the declination of the sun to the darkening of the night, and the Recitation at the dawn; verily the Recitation at the dawn is ever borne witness to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maintain the prayer [during the period] from the sun’s decline till the darkness of the night, and [observe particularly] the dawn recital. Indeed the dawn recital is attended [by angels].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish regular prayers - at the sun's decline till the darkness of the night, and the morning prayer and reading: for the prayer and reading in the morning carry their testimony.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perform As-Salat (Iqamat-as-Salat) from mid-day till the darkness of the night (i.e. the Zuhr, 'Asr, Maghrib, and 'Isha' prayers), and recite the Quran in the early dawn (i.e. the morning prayer). Verily, the recitation of the Quran in the early dawn is ever witnessed (attended by the angels in charge of mankind of the day and the night).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish the prayer at the decline of the sun till the darkening of the night and the Koran recital at dawn. Surely, the Koran recital at dawn is witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perform the prayer at the decline of the sun, until the darkness of the night; and the Quran at dawn. The Quran at dawn is witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish prayer at the decline of the sun [from its meridian] until the darkness of the night and [also] the Qur'an of dawn. Indeed, the recitation of dawn is ever witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:78] Establish prayer from the sun’s decline, that is, from after midday, until the dark of night, [until] its darkness has fallen, in other words, [perform prayers] at noon, in the afternoon, at sunset and at night, and the recital [of the Qur’ān] at dawn, the morning prayer. Verily the dawn recital is ever witnessed, it is witnessed by the angels of the night and the angels of the day.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Establish worship) perform the prayer, Muhammad, (at the going down of the sun) after noon: the prayers of Zuhr and 'Asr (until the dark of night) and after the advent of the night: the prayers of Maghrib and 'Isha', (and (the recital of) the Qur'an at dawn) the prayer of the morning. (Lo! (the recital of) the Qur'an at dawn) the prayer of the morning (is ever witnessed) is witnessed by the angels of the night and the angels of the day.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَقِمِ ٱلصَّلاَةَ لِدُلُوكِ ٱلشَّمْسِ } مَعْنَاهُ غُرُوبُها\n وقال: زَوالُهَا { غَسَقِ ٱلَّيلِ } حِينَ غَرَبتْ الشَّمسُ\n وقَالَ: العَشاءُ الآخرُ\n وقالَ: صَلاةُ العَصرِ\n\n\n\n\nوقوله تعالى: { وَقُرْآنَ ٱلْفَجْرِ إِنَّ قُرْآنَ ٱلْفَجْرِ كَانَ مَشْهُوداً } قالَ زيدُ بن علي عليهما السلام\n فقرآن الفَجرِ: مَا يُقرأ بهِ صَلاَة الفَجرِ\n ومشهودٌ: تَحضُرُهُ مَلائِكةُ الليلِ ومَلائكةُ النَّهارِ\n فإِذَا انصرفوا صَعدتْ مَلائكةُ الليلِ، وبَقيتْ مَلائكةُ النَّهارِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Establish prayer at the decline of the sun} [means] its setting.\n He said: \"Her { departure } is the { twilight of night } when the sun sets.\"\n\n\nAnd he said, \"The last supper.\"\n\n\nAnd he said: \"The prayer of `Asr.\"\n\n\nAnd the saying of the Most High: {And the Qur'an at dawn. Indeed, the Qur'an at dawn is witnessed} Zayd ibn Ali said, peace be upon them both.\n\n\nThe Quran of Fajr: What is recited during the prayer of Fajr\n\n\nAnd it is witnessed: the angels of night and the angels of day bear witness to it.\n\n\n{When they have gone}, the angels of night ascend, and the angels of day remain.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَقِمِ ٱلصَّلاَةَ } وأدم التوجه { لِدُلُوكِ ٱلشَّمْسِ } أي: حين زوالها من الاستواء { إِلَىٰ غَسَقِ ٱلَّيلِ } أي: ظلمته بغروبها إلى حيث لم يبقَ من بقية آثار ضوئها شيء أصلاً\n فيسع في المحدود المذكور: الظهر والعصر والمغرب والعشاء على ما عينه الشرع لكل منها وقتاً معيناً { وَ } طوِّل { قُرْآنَ } صلاة { ٱلْفَجْرِ } وأطِلِ القيام فيها مع القراءة { إِنَّ قُرْآنَ ٱلْفَجْرِ } الذي هو وقت الانكشاف والانجلاء الصوري\n المنبئ عن الانكشاف المعنوي والانجلاء الحقيقي\n الذي هو عبارةُ عن إشراق نور الوجود واضمحلال الأظلال والعكوس المشعرة بالكثرة والغيرية\n\n\nلذلك { كَانَ } قراءة القرآن المبين لسرائر الوحدة الذاتية\n وكيفية سريانها على صفائح المكونات فيه { مَشْهُوداً } [الإسراء: 78] لخواص عباد الله من الملائكة والثقلين\n بل لجميع الحيوانات من الوحوش والطيور\n إذ الكل في وقت الفجر متوجهون نحو الحق\n مسبحون مهللون حالاً ومقالاً\n\n\n{ وَ } إن شئت ازيداد القرب والثواب اسهر واستيقظ قطعةً { مِنَ ٱلْلَّيْلِ } واترك النوم فيها طلباً لمرضاة الله { فَتَهَجَّدْ بِهِ } أي: صلِّ فيها صلاة التهجد يتطويل القراءة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الدلوك: الميل\n واشتقاقه من الدَّلْك لأن من نظر إليها حينئذ يدلك عينه\n واللام للتأقيت بمعنى: عند\n و { قرآن }: عطف على { الصلاة } \n أو منصوب بفعل مضمر\n أي: اقرأ قرآن الفجر\n أو على الإغراء\n يقول الحقّ جلّ جلاله: { أقم الصلاةَ لدلُوكِ } أي: عند زوال { الشمس } \n وهو إشارة إلى إقامة الصلوات الخمس\n فدلوك الشمس: زوالها وهو إشارة إلى الظهر والعصر\n وغسق الليل: ظلمته\n وهو إشارة إلى المغرب والعشاء\n { وقرآنَ الفجر } صلاة الصبح\n وإنما عبَّر عن صلاة الصبح بقرآن الفجر لأن القرآن يُقرأ فيها أكثر من غيرها لأنها تُصلى بسورتين طويلتين\n ثم مدحها بقوله: { إِنَّ قرآن الفجر كان مشهودًا } تشهده ملائكةُ الليل وملائكة النهار\n أو: يشهده الجم الغفير من المصلين\n أو فيه شواهد القدرة من تبدل الظلمة بالضياء\n والنوم\n الذي هو آخو الموت\n بالانتباه\n ثم أمر بقيام الليل فقال: { ومن الليل } أي: بعض الليل { فتهجدْ به } أي: اترك الهجود\n الذي هو النوم فيه\n للصلاة بالقرآن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:25",
      "similarity": 0.2978129313820358
    },
    {
      "verse": "38:57",
      "similarity": 0.29494008728848076
    },
    {
      "verse": "113:3",
      "similarity": 0.18779187371795408
    },
    {
      "verse": "89:1",
      "similarity": 0.06741265465519541
    },
    {
      "verse": "80:42",
      "similarity": 0.06696272440223863
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/17:78.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/17:78.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/17:78.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}