{
  "chapter": "الإسراء",
  "text": "ولقد كرمنا بنى ءادم وحملنهم فى البر والبحر ورزقنهم من الطيبت وفضلنهم على كثير ممن خلقنا تفضيلا",
  "translations": [
    {
      "translation": "We have honoured the sons of Adam and conveyed them on land and sea and provided them with good things and favoured them greatly over many We have created.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have honoured the children of Adam, and carried them over land and sea, provided them with good things for their sustenance, and exalted them over many of Our creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We honoured the progeny of Adam, and bore them across land and sea and provided them with good things for their sustenance, and exalted them above many of Our creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have honored the children of Adam, carried them on the land and the sea, given them pure sustenance and exalted them above most of My creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have honoured the Descendants of Adam and transported them over land and sea, and gave them good things as sustenance, and made them better than most of Our creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have honored the Children of Adam, and We have carried them on land and sea, and have provided them with At-Tayyibat, and have preferred them above many of those whom We have created with a marked preferment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely We have honored the children of Adam, and We carry them in the land and the sea, and We have given them of the good things, and We have made them to excel by an appropriate excellence over most of those whom We have created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have honoured the Children of Adam and carried them on land and sea, and provided them with good things, and preferred them greatly over many of those We created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily we have honoured the Children of Adam. We carry them on the land and the sea, and have made provision of good things for them, and have preferred them above many of those whom We created with a marked preferment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have honoured the children of Adam, and have borne them on the land and the sea, given them for sustenance things which are good and pure; and exalted them above many of Our creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have honoured the Children of Adam: and We have borne them on the land and the sea, and We have provided them with clean things, and We have preferred them over many of them whom We have created with a preferment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have honoured the Children of Adam, and carried them over land and sea, and provided them with all the good things, and preferred them with a complete preference over many of those We have created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have honoured the sons of Adam; provided them with transport on land and sea; given them for sustenance things good and pure; and conferred on them special favours, above a great part of our creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have honoured the Children of Adam, and We have carried them on land and sea, and have provided them with At-Taiyibat (lawful good things), and have preferred them above many of those whom We have created with a marked preference.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have honored the children of Adam and carried them on both land and sea. We have provided them with good things and greatly preferred them above much of Our creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have honored the Children of Adam, and carried them on land and sea, and provided them with good things, and greatly favored them over many of those We created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:70] And verily We have honoured, We have preferred, the Children of Adam, [above other creation], by [giving them] knowledge, speech and [their being] a creation of even proportions amongst other things, including their [means of] purification after death, and carried them over land, on animal-back, and sea, in ships, and provided them with good things and We have preferred them above many of those whom We created, such as livestock and wild animals, with a marked preferment (the min [of mimman, ‘of those whom’] has the sense of mā, ‘of what’, or something close to it, and includes the angels, the purpose being to give preference to the [angelic] genus; there is no requirement to give [explicit] preference to the individuals [of this category of being], since they [angels] are superior to mankind, excepting the prophets).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily We have honoured the children of Adam) by giving them hands and feet. (We carry them on the land) on the backs of beasts (and the sea) aboard ships, (and have made provision of good things for them) We made their provision better and finer than the provision of beasts, (and have preferred them above many of those whom We created) of animals (with a marked preferment) in forms, feet and hands.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَفَضَّلْنَاهُمْ عَلَىٰ كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلاً } قال: الإِمام زيد بن علي عليهما السلامُ: معى التفضيلُ ها هنا أنهُ لَيسَ مِن دَابةٍ إِلاَّ تَأكلُ بفَمِها، إِلاَّ بَني آدم فإنهُ يَأكلُ بيَدهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولقد كرّمنا بني آدم } بالنطق والتمييز والعقل والمعرفة { وحملناهم في البرّ والبحر } أي: يسرنا لهم أسباب المعاش والمعاد بالسير في طلبها فيهما وتحصيلها { ورزقناهم من الطيبات } أي: المركبات التي لم ترزق غيرهم من المخلوقات { وفضلناهم على كثير ممن خلقنا } أي: ما عدا الذوات المقدّسة من الملأ الأعلى، وأما أفضلية بعض الناس كالأنبياء على الملائكة المقرّبين فليست من جهة كونهم بني آدم فإنهم من تلك الحيثية لا يتجاوزون مقام العقل بل من جهة السرّ المودع فيهم المشار إليه بقوله:\n\n[البقرة، الآية: 30] وهو ما أعدّ لذلك البعض من المعرفة الإلهية التامة بواسطة الجمعية التي فيه، أي: مقام الوحدة، وحينئذ ليس هو بهذا الاعتبار من بني آدم كما قيل:\n\nبل هو عين المكرّم المعروف كما قيل:\n\nوقد فني ابن آدم في هذا المقام وما بقي منه شيء وإلا فما للتراب وربّ الأرباب، أو { ولقد كرّمنا بني آدم } بالتقريب ومعرفة التوحيد وحملناهم في بر عالم الأجساد وبحر عالم الأرواح بتسييره فيهما لتركيبه منهما وإرقائه عنهما في طلب الكمال ورزقناهم من طيبات العلوم والمعارف، { وفضلناهم } على الجم الغفير { ممن خلقنا } ، أي: جميع المخلوقات، على أن تكون من للبيان والمبالغة في تعظيمه بوصف المفضل عليهم بالكثرة وتنكير الوصف وتقديمه على الموصوف أي كثير، وأي كثير وهو جميع مخلوقاتنا لدلالة من على العموم { تفضيلاً } تاماً بيّناً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على سبيل الإنعام والامتنان: { وَلَقَدْ كَرَّمْنَا } وفضلنا { بَنِي ءَادَمَ } بأنواع الكرامة والتفضيل على سائر المخلوقات من حسن الصورة والسيرة واعتدال المزاج، واستواء القامة، والعقل المفاض المتشعب من العقل الكل الذي هو حضرة العلم الحضوري الإلهي، وكذا بالقدرة والإدارة، وسائر الصفات المترتبة على الصفات الذاتية الإلهية يشعر بخلافته ونيابته { وَ } مع ذلك { حَمَلْنَاهُمْ فِي ٱلْبَرِّ } بركوب النجائب من الخيل والبغال والبعير وغير ذلك، { وَ } في { ٱلْبَحْرِ } بركوب الجواري والسفن { وَرَزَقْنَاهُمْ مِّنَ ٱلطَّيِّبَاتِ } أي: الأطايب التي يكسبونها بأيديهم على مقتضى إقدارنا إياهم، وإعدادنا أسباب مكاسبهم معهم، وأبحنا لهم ما تستلذ به نفوسهم وتشتهي قلوبهم على وفق ما نطق به رسلهم وكتبهم\n\n\nو { وَ } بالجملة { فَضَّلْنَاهُمْ عَلَىٰ كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلاً } [الإسراء: 70] والقليل المستثنى هم الملائكة المقربون المهيمون المستغرقون بمطالعة جمال الله وجلاله، وإن كان الوالهون الهائمون من الإنسان في ولاء الله ومحبته، المكاشفون بسر الخلافة والنيابة التي أخبر بها الحق، الواصلون إلى مرتبة الفناء بالموت الأرادي، أفضل منهم أيضاً، وأرفع رتبة ومكانة\n\n\n\n\nوإنما كرمناهم وفضلناهم بما فضلناهم؛ لحكمةٍ ومصلحة تقتضيها ذاتنا، وهي أنَّ نريد أن نطالع ذاتنا المتصفة لجميع أوصاف الكمال ونعوت الجمال والجلال في مظهر تام كامل لمراتبنا وخلافتنا، وكرّمناه لأجل هذه الحكمة العزيزة، فمن لم يبلغ منهم إلى هذه المرتبة العلية والدرجة السنية بسلوكه الذي أرشدناه وعلمناه بإرسال الرسل وإنزال الكتب فه ونازلً كل التنازل عن درجة الاعتبار، ساقطُ عن رتبة ذوي الألباب والأبصار\n\n\n\n\nبل أولئك البعداء الضالون عن منهج الرشاد كالأنعام بلا شعور إلى ما جبلوا لأجله، بل أضل سبيلاً منها وأسوأ حالاً ومآلاً،\n\n[النور: 40]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولقد كرَّمنا بني آدم } قاطبة، برهم وفاجرهم، أي: كرمناهم بالصورة الحسنة، والقامة المعتدلة، والتمييز بالعقل، والإفهام بالكلام، والإشارة والخط، والتهدي إلى أسباب المعاش والمعاد، والتسلط على ما في الأرض، والتمتع به، والتمكن من الصناعات، وغير ذلك مما لا يكاد يُحيط به نطاق العبارة\n ومن جملته: ما ذكره ابن عباس رضي الله عنه من أن كل حيوان يتناول طعامه بفيه، إلا الإنسان يرفعه إليه بيده، وأما القرد فيده بمنزلة رجله لأنه يطأ بها القاذورات فسقطت حرمتها\n { وحملناهم } أي: بني آدم، { في البر والبحر } على الدواب والسفن فيمشون محمولين في البر والبحر\n يقال: حملته حملاً: إذا جعلت له ما يركب\n { ورزقناهم من الطيبات } من فنون النعم، وضروب المستلذات ممَّا يحصل بصُنعهم وبغير صنعهم، { وفضلناهم } بالعلوم والإدراكات، مما رَكَّبْنَا فيهم { على كثير ممن خلقنا } وهم: من عدا الملائكة - عليهم السلام -\n { تفضيلاً } عظيمًا، فحق عليهم أن يشكروا هذه النعم ولا يكفروها، ويستعملوا قواهم في تحصيل العقائد الحَقِّيَّةِ، ويرفضوا ما هم عليه من الشرك، الذي لا يقبله أحد ممن له أدنى تمييز، فضلاً عمن فُضّل على من عدا الملأ الأعلى، والمستثنى جنس الملائكة، أو الخواص منهم، ولا يلزم من عدم تفضيل الجنس عدم تفضيل جنس بني آدم على الملائكة، عدم تفضيل بعض أجزائه كالأنبياء والرسل، فإنهم أفضل من خواص الملائكة، وخواص الملائكة - كالمقربين مثلاً - أفضل من خواص بني آدم، كالأولياء، والأولياء أفضل من عوام الملائكة\n والله تعالى أعلم\n الإشارة: قد كرَّم الله هذا الآدمي، وشرفه على خلقه بخصائص جعلها فيه، منها: أنه جعله نسخة من الوجود، فيه ما في الوجود، وزيادة، قد انطوت فيه العوالم بأسرها، من عرشها إلى فرشها، وإلى هذا المعنى أشار ابن البنا، في مباحثه، حيث قال:\n\nوقال آخر:\n\nومنها: أنه جعله خليفة في ملكه، وجعل الوجود بأسره خادمًا له، ومنتفعًا به، الأرض تُقله، والسماء تُظله، والجهات تكتنفه، والحيوانات تخدمه، والملائكة تستغفر له، إلى غير ذلك مما لا يعلمه الخلق\n قال تعالى:\n\n[الجاثية: 13]\n ومنها: أن جعل ذاته مشتملة على الضدين: النور والظلمة، الكثافة واللطافة، الروحانية والبشرية، الحس والمعنى، القدرة والحكمة، العبودية وأسرار الربوبية، إلى غير ذلك\n\n\nولذلك خصه بحمل الأمانة\n ومنها: أنه جعله قلب الوجود، هو المنظور إليه من هذا العالم، وهو المقصود الأعظم من إيجاد هذا الكون، فهو المنعَّم دون غيره، إن أطاع الله، ألا ترى قوله تعالى:\n\n[الزُّمَر: 75]، فنعيم الجنان خاص بهذا الإنسان، أو: من التحق به من مؤمني الجان\n وقال الورتجبي: كرامة الله تعالى لبني آدم سابقة على كون الخلق جميعًا لأنها من صفاته، واختياره، ومشيئته الأولية\n أوجد الخلق برحمته، وخلق آدم وذريته بكرامته، الخلق كلهم في حيزِ الرحمة، وآدم وذريته في حيز الكرامة\n الرحمة للعموم، والكرامة للخصوص\n خلق الكلَّ لآدم وذريته، وخلق آدم وذريته لنفسه، ولذلك قال:\n\n[طه: 41]، جعل آدم خليفته، وجعل ذريته خلفاء أبيهم، الملائكة والجن في خدمتهم، والأمر والنهي والخطاب معهم، والكتاب أُنزل إليهم، والجنة والنار والسماوات والأرض والشمس والقمر والنجوم، وجميع الآيات، خُلِقَ لهم\n والخلق كلهم طُفيل لهم، ألا ترى الله يقول لحبيبه صلى الله عليه وسلم:\n\n \" لولاك ما خلقت الكون \" \n\n؟ ولهم كرامة الظاهر، وهي: تسوية خلقهم، وظرافة صورهم، وحسن نظرتهم، وجمال وجوههم، حيث خلق فيها السمع والأبصار والألسنة، واستواء القامة، وحسن المشي، والبطش، وإسماع الكلام، والتكلم باللسان، والنظر بالبصر، وجميع ذلك ميراث فطرة آدم، التي صدرت من حسن اصطناع صورته\n الذي قال:\n\n[ص: 75]، فنور وجوههم من معادن نور الصفة، وأنوار الصفات نوَّرت آدم وذريته، فتكون نورًا من حيث الصفات والهيئات، والحسن والجمال، متصفون متخلقون بالصفات الأزلية، لذلك قال عليه الصلاة والسلام:\n\n \" خلَقَ آدَم على صُورَتِهِ \" \n\n، من حيث التخلق لا من حيث التشبيه\n انظر تمامه\n والحاصل أنه فضلهم بالخلْق والخلُق، وذلك يجمع محاسن الصورة الظاهرة والباطنة\n هـ\n قاله المحشي الفاسي\n ثم ذكر محل ظهور كرامة بني آدم وهو يوم القيامة\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "80:16",
      "similarity": 0.42407872464190555
    },
    {
      "verse": "45:16",
      "similarity": 0.3526793087538967
    },
    {
      "verse": "27:63",
      "similarity": 0.33481794281195953
    },
    {
      "verse": "6:97",
      "similarity": 0.3249982636871742
    },
    {
      "verse": "30:41",
      "similarity": 0.31283354824685083
    }
  ]
}