{
  "chapter": "الإسراء",
  "text": "اذا لاذقنك ضعف الحيوة وضعف الممات ثم لا تجد لك علينا نصيرا",
  "translations": [
    {
      "translation": "Then We would have let you taste a double punishment in life and a double punishment in death. You would not have found any helper against Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We would have made you taste a double anguish of life and a double anguish of death, and then you would not have been able to find a helper against Us for yourself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whereupon We would have made you taste double (the chastisement) in the world and double (the chastisement) after death, and then you would have found none to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had you done so, We would certainly have made you face double punishment in this life and after your death and you would have found none to help you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it were*, We would then have made you taste a double life and a double death – you would then not find any supporter against Us. (* Which is impossible.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We would have made you taste a double portion in this life and a double portion after death. And then you would have found none to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We would certainly have made you to taste a double (punishment) in this life and a double (punishment) after death, then you would not have found any helper against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then would We have let thee taste the double of life and the double of death; and then thou wouldst have found none to help thee against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then had we made thee taste a double (punishment) of living and a double (punishment) of dying, then hadst thou found no helper against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case, We should have inflicted a double punishment in this life, and a double punishment after death. Then you would have found no one to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We would have surely made thee taste the double of the tornment of the life and the double of the torment of death, and then thou wouldst not find against Us a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We would have surely made you taste a double [punishment] in this life and a double [punishment] after death, and then you would have not found for yourself any helper against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We should have made thee taste an equal portion (of punishment) in this life, and an equal portion in death: and moreover thou wouldst have found none to help thee against Us!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case, We would have made you taste a double portion (of punishment) in this life and a double portion (of punishment) after death. And then you would have found none to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We would have let you taste the double of life and death; and you would have found none to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We would have made you taste double in life, and double at death; then you would have found for yourself no helper against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then [if you had], We would have made you taste double [punishment in] life and double [after] death. Then you would not find for yourself against Us a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:75] Then, had you inclined, We would have surely made you taste a double, chastisement, in life and a double, chastisement, upon death, in other words, twice the chastisement that any other person would receive in this world and the Hereafter. Then you would not have found for yourself any helper against Us, [anyone] to shield [you] from it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة { إذا لأذقناك ضعف الحياة } جزاءٌ لجملة { لقد كدت تركن }. والمعنى : لو تركن إليهم لأذقناك ضعف الحياة وضعف الممات . ولِما في ( إذن ) من معنى الجزاء استغني عن ربط الجملة بحرف التفريع . والمعنى : لقد كدت تركن فلأذقناك .والضعف بكسر الضاد : مماثل مقدار شيءٍ ذِي مقدار ، فهو لا يكون إلا مبيناً بجنسه لفظاً أو تقديراً مثل قوله تعالى : { من يأت منكن بفاحشة مبينة يضاعف لها العذاب ضعفين } \\[ النور : 30 \\] ، أي ضعفي ما أعد لتلك الفاحشة . ولما كان كذلك ساغ إطلاقه دون بيان اعتماداً على بيان السياق كما هنا ، فإن ذكر الإذاقة في مقام التحذير ينبىء بأنها إذاقة عذاب موصوف بأنه ضِعف .ثم إن الضعف أطلق هنا على القوي الشديد لعدم حمل الضعف على حقيقته إذ ليس ثَمّ عِلم بمقدار العذاب يراد تضعيفه كقوله : { فآتهم عذاباً ضعفاً من النار وتقدم ذلك } في سورة \\[ الأعراف : 38 \\].وإضافة الضعف إلى الحياة وإلى الممات على معنى ( في ) ، فإن تقدير معنى ( في ) بَيْنَ المتضايفين لا يختص بإضافة ما يضاف إلى الأوقات . فالتقدير : لأذقناك ضعفاً في الحياة وضعفاً في الممات ، فضعف عذاب الحياة هو تراكم المصائب والأرزاء في مدة الحياة ، أي العمر بزوال ما كان يناله من بهجة وسرور بتمام دعوته وانتظام أمته ، ذلك أن يتمكن منه أعداؤه ، وعذاب الممات أن يموت مكموداً مستذلاً بين كفار يرون أنهم قد فازوا عليه بعد أن أشرفوا على السقوط أمامه .ويشبه أن يكون قوله : { وضعف الممات } في استمرار ضعف الحياة ، فيكون المعنى : لأذقناك ضعف الحياة حتى المماتتِ .فليس المراد من ضعف الممات عذاب الآخرة لأن النبي صلى الله عليه وسلم لو ركن إليهم شيئاً قليلاً لكان ذلك عن اجتهاد واجتلاباً لمصلحة الدين في نظره ، فلا يكون على الاجتهاد عقاب في الآخرة إذ العقاب الأخروي لا يكون إلا على مخالفة في التكليف ، وقد سوغ الله لنبيئه الاجتهاد وجعل للمخطىء في اجتهاده أجراً كما قرر في تفسير قوله تعالى :{ لولا كتاب من الله سبق لمسكم فيما أخذتم عذاب عظيم } في سورة \\[ الأنفال : 68 \\].وأما مصائب الدنيا وأرزاؤها فهي مسببة على أسباب من الأغلاط والأخطاء فلا يؤثر في التفادي منها حسن النية إن كان صاحبها قد أخطأ وجه الصواب ، فتدبر في هذه المعاني تدبر ذوي الألباب ، ولهذا خولف التعبير المعتاد استعماله لعذاب الآخرة . وعبر هنا بـ { ضعف الحياة وضعف الممات }.وجملة { ثم لا تجد لك علينا نصيراً } معطوفة على جملة { لأذقناك }.وموقعها تحقيق عدم الخلاص من تلك الإذاقة . و ( ثُم ) للترتيب الرتبي لأن عدم الخلاص من العذاب أهم من إذاقته ، فرتبته في الأهمية أرقى . والنصير : الناصر المخلص من الغلبة أو الذي يثأر للمغلوب ، أي لا تجد لنفسك من ينتصر لك فيصدنا عن إلحاق ذلك بك أو يثأر لك منا .\n\n",
      "translations": [
        {
          "translation": "(Then) if you had granted to them what they requested (had We made thee taste a double (punishment) of living) the chastisement of this worldly life (and a double (punishment) of dying) the chastisement of the Hereafter, (then hadst thou found no helper against Us) you would not find anyone to save you from Us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ضِعْفَ ٱلْحَيَاةِ } أي عَذابين\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the life of this world is but} two punishments.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إذاً لأذقناك } أي: لو قاربت فتنتهم وكدت توافقهم لأذقناك عذاباً مضاعفاً في الحياة وعذاباً مضاعفاً في الممات\n فإنّ شدّة العذاب بحسب علوّ المرتبة وقوة الاستعداد إذ النقصان الموجب للعذاب يقابل الكمال الموجب للذة\n فكلما كان الاستعداد أتمّ والإدراك أقوى\n كانت المرتبة في الكمال والسعادة واللذة أقوى فكذا ما يقابله من النقص والشقاوة أبعد وأسفل والألم أشدّ\n { أقِم الصَّلاة لدلوك الشمس } اعلم أنّ الصلاة على خمسة أقسام: صلاة المواصلة والمناغاة في مقام الخفاء\n وصلاة الشهود في مقام الروح\n وصلاة المناجاة في مقام السرّ\n وصلاة الحضور في مقام القلب\n وصلاة المطاوعة والانقياد في مقام النفس\n فدلوك الشمس هو علامة زوال شمس الوحدة عن الاستواء على وجود العبد بالفناء المحض\n فإنه لا صلاة في حال الاستواء إذ الصلاة عمل يستدعي وجوداً\n وفي هذه الحالة لا وجود للعبد حتى يصلي كما ذكر في تأويل قوله تعالى:\n[الحجر\n الآية: 99]\n ألا ترى الشارع عليه السلام كيف نهى عن الصلاة وقت الاستواء\n فأما عند الزوال\n إذا حدث ظل وجود العبد سواء عند الاحتجاب بالخلق حالة الفرق قبل الجمع أو عند البقاء حالة الفرق بعد الجمع\n فالصلاة واجبة { إلى غسق } ليل النفس { وقرآن } فجر القلب\n فأول الصلوات وألطفها صلاة المواصلة والمناغاة وأفضلها وأشرفها صلاة الشهود للروح المشار إليها بصلاة العصر كما فسرت الصلاة الوسطى\n أي: الفضلى في قوله تعالى:\n[البقرة\n الآية: 238] والصلاة الوسطى بها\n وأوحاها وأخفها صلاة السرّ بالمناجاة أول وقت الاحتجاب بظهور القلب لسرعة انقضاء وقتها ولهذا استحب التخفف في صلاة المغرب في القراءة وغيرها لكونها علامة لها\n وأزجر الصلاة للشيطان\n وأوفرها تنويراً لباطن الإنسان صلاة الحضور للقلب المومئ إليها بقرآن الفجر\n فإنها في وقت تجليات أنوار الصفات ونزول المكاشفات ولهذا استحب التكثر في جماعة صلاة الصبح وأكد استحباب الجماعة فيها خاصة\n وتطويل القراءة\n وقال تعالى: { إن قرآن الفجر كان مشهوداً } أي: محضوراً بحضور ملائكة الليل والنهار إشارة إلى نزول صفات القلب وأنوارها وذهاب صفات النفس وزوالها\n وأشدّها تثبيتاً للنفس وتطويعاً لها صلاة النفس للطمأنينة والثبات\n ولهذا سنّ فيما جعل آية لها من صلاة العشاء السكوت بعدها حتى النوم إلا بذكر الله\n وحيث أمكن للشيطان سبيل إلى الوسوسة استحب\n فيما جعل علامة لها الجهر كصلاة النفس والقلب والسرّ للزجر ولا مدخل له في مقام الروح والخفاء فأمر بالإخفات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِذاً } أي: حين إنجاحكم سُؤْلهم ومأمولهم { لأذَقْنَاكَ } في نشأتك هذه { ضِعْفَ ٱلْحَيَاةِ } أي: ضعف عذاب من جاء بمثله في النشأة الأولى { وَضِعْفَ ٱلْمَمَاتِ } أي: ضعف عذاب من جاء بمثله في النشأة الأخرى\n يعني: نعذبك في الدنيا والآخرة بعضف عذاب من جاء به من سائر الناس\n لأن جزاء الأبرار لو أتوا بالمعاصي والآثام ضعف جزاء الأشراء\n بل أكثر\n إذ لا يتوقع منهم الانصراف عن منهج الرشاد أصلاً\n ولو انصرفوا أُخذوا بضعف من يتوقع منهم الانحراف والانصراف { ثُمَّ } بعد أخذنا إياك انتقامنا منك { لاَ تَجِدُ لَكَ عَلَيْنَا نَصِيراً } [الإسراء: 75] أي: لا تجد ظهيراً لك نصيراً يظهر علينا بنصرتك\n ويطالبنا بإنقاذك عن عذابنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِذًا لأذقناك ضِعْفَ الحياة وضَعْف الممات } \n هبوط الأكابر على قدر صعودهم\n هـ\n { إِذًا } أي: لو قاربت أن تركن إليهم أدنى ركون { لأذقناك ضِعف } عذاب { الحياة }  { وضِعْفَ } عذاب { الممات } \n أي: مِثْلِيْ ما يُعَذِّبُ غيرك في الدنيا والآخرة لأن خطأ الخطير أخطر\n\nوكأن أصل الكلام: عذابًا ضعفًا في الحياة\n وعذابًا ضعفًا في الممات\n أي: مضاعفًا\n ثم حذف الموصوف\n وأقيمت الصفة مقامه\n ثم أضيفت إضافة موصوفها\n وقيل: الضعف من أسماء العذاب\n وقيل: المراد بضعف الحياة: عذاب الآخرة لأن حياته دائمة\n وبضعف الممات: عذاب القبر\n { ثم لا تجدُ لك علينا نصيرًا } يدفع عنك العذاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:57",
      "similarity": 0.4419538012548699
    },
    {
      "verse": "72:24",
      "similarity": 0.37276821579674174
    },
    {
      "verse": "87:13",
      "similarity": 0.3637133485976132
    },
    {
      "verse": "9:116",
      "similarity": 0.35502621623663666
    },
    {
      "verse": "26:81",
      "similarity": 0.3499899744478128
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017075.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017075.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}