{
  "chapter": "الإسراء",
  "text": "يوم ندعوا۟ كل اناسۭ باممهم فمن اوتى كتبه بيمينه فاو۟لئك يقرءون كتبهم ولا يظلمون فتيلا",
  "translations": [
    {
      "translation": "On the Day We summon every people with their records, those who are given their Book in their right hand will read their Book and they will not be wronged by even the smallest speck.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We shall summon all men with their leaders, whosoever is given his record in his right hand will be able to read his account, and none will be wronged the breadth of a thread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then think of the Day We shall summon every community with its leader. Those who are given their Record in their right hand shall read the Record of their deeds and shall not be wronged a whit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We call every nation with their leaders, those whose record of deeds are given to their right hands will read the book and the least wrong will not be done to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We shall summon every group along with its leader; so whoever is given his register in his right hand – these will read their accounts and their rights will not be suppressed even a thread. (* They will be given the full reward.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) the Day when We shall call together all human beings with their (respective) Imam (i.e. the Book of deeds). So whosoever is given his record in his right hand, such will read their records, and they will not be dealt with unjustly in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) the day when We will call every people with their Imam; then whoever is given his book in his right hand, these shall read their book; and they shall not be dealt with a whit unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We shall call all men with their record, and whoso is given his book in his right hand -- those shall read their book, and they shall not be wronged a single date-thread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We shall summon all men with their record, whoso is given his book in his right hand - such will read their book and they will not be wronged a shred.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day will surely come when We shall summon every people with their leader. Then those who are given their records in their right hands will read their records [eagerly] and shall not in the least be wronged:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the Day whereon We shall call all man kind with their record: then whosoever will be vouchsafed his book in his right hand, those shall read their book, and they shall not be wronged a whit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We shall summon every group of people along with their imam, then whoever is given his book in his right hand—they will read it, and they will not be wronged so much as a single date-thread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day We shall call together all human beings with their (respective) Imams: those who are given their record in their right hand will read it (with pleasure), and they will not be dealt with unjustly in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) the Day when We shall call together all human beings with their (respective) Imam [their Prophets, or their records of good and bad deeds, or their Holy Books like the Quran, the Taurat (Torah), the Injeel (Gospel), etc.]. So whosoever is given his record in his right hand, such will read their records, and they will not be dealt with unjustly in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We call all the people with their record, whosoever is given his book in his right hand shall read their book, and they shall not be wronged by as much as a single datefiber.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We call every people with their leader. Whoever is given his record in his right hand—these will read their record, and they will not be wronged one bit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Mention, O Muhammad], the Day We will call forth every people with their record [of deeds]. Then whoever is given his record in his right hand - those will read their records, and injustice will not be done to them, [even] as much as a thread [inside the date seed].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:71] Mention, the day when We shall summon all men with their leader, their prophet, and it will be said, ‘O community of so-and-so’; or [it bi-imāmihim means] ‘with the record of their deeds’, in which case it will be said, ‘O one of good [deeds], O one of evil [deeds]!’: this is [on] the Day of Resurrection. And whoever, from among them, is given his book in his right hand, these being the fortunate, those possessors of understanding in this world — those will read their book, and they will not be wronged, they will [not] be diminished of their deeds, [so much as] a single date-thread.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day) the Day of Judgement (when We shall summon all men with their record) with their prophet; and it is also said that this means: with their register; and it is also said that this means: with their callers to guidance and error, (whoso is given his book in his right hand such will read their book) their good deeds (and they will not be wronged a shred) their good deeds will not be diminished nor will their evil deeds be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَوْمَ نَدْعُواْ كُلَّ أُنَاسٍ [بِإِمَامِهِمْ] } معناهُ بِنَبيهِم وقال: بأعمَالِهِم\n وقالَ: بِكَتَابِهم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"On the day when We will call every people with their leader,\" means with their prophet, and He said: \"With their deeds.\"\n And he said: \"With their book\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يوم ندعو } إلى آخره، أي: نحضر { كل } طائفة من الأمم مع شاهدهم الذي يحضرهم ويتوجهون إليه من الكمال ويعرفونه سواء كان في صورة نبيّ آمنوا به كما ذكر في تفسير قوله:\n\n[النساء، الآية: 41] أو إمام اقتدوا به أو دين أو كتاب أو ما شئت على أن تكون الباء بمعنى مع أو ننسبهم إلى إمامهم وندعوهم باسمه لكونه هو الغالب عليهم وعلى أمرهم المستعلي محبتهم إياه على سائر محباتهم { فمن أوتي كتابه بيمينه } أي: من جهة العقل الذي هو أقوى جانبيه وبعث في صورة السعداء { فأولئك يقرؤون كتابهم } دون غيرهم لاستعدادهم للقراءة والفهم لأن الذي أوتي كتابه بشماله، أي: من جهة النفس التي هي أضعف جانبيه لا يقدر على قراءة كتابه وإن كان مقروؤًا لذهاب عقله وفرط حيرته { ولا يظلمون } أي: لا ينقصون من صور أعمالهم وكمالاتهم وأخلاقهم شيئاً قليلاً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل للمكرمين المفضلين على سائر المخلوقات: { يَوْمَ نَدْعُواْ } نحشر { كُلَّ أُنَاسٍ } منهم\n لنسألهم\n ونطلب عنهم ما اكتسبوا\n وحصَّلوا من المعارف والحقائق والأعمال المقربة إلينا باقتدائهم { بِإِمَامِهِمْ } الذي نرسل إليهم\n وننزل ع ليه من الرسل والكتب\n لإرشادهم وإهدائهم مع أنا كتبنا منهم خيرهم وشرهم اللذَّين جاء كل منهم بهما في صحيفةٍ\n ونعطيهم اليوم صحائف أعمالهم { فَمَنْ أُوتِيَ كِتَابَهُ } منهم { بِيَمِينِهِ } فهو دليل خيرية أعماله وطيب أحواله { فَأُوْلَـٰئِكَ } المقبولون { يَقْرَؤونَ كِتَابَهُمْ } فرحين بما فيها مسرورين\n فيجازون على مقتضى ما كُتب بل أضعافها وآلافها\n عنايةً منَّا وفضلاً { وَ } هم { لاَ يُظْلَمُونَ } ولا ينقصون من أجور أعمالهم { فَتِيلاً } [الإسراء: 71] مقدار ما في ظهر النواة من الخط الأسود أو بين الأصابع من الوسخ المفتول\n\n\n{ وَ } من أوتي كتابه بشماله فهو علامة شرّية أعماله\n ورخامة حاله ومآله\n فأولئك الأشقياء المردودون ينظرون إلى كتابهم\n فيجدون ما فيها من أنواع المعاصي والآثام\n فيغمضون عيونهم عن قراءتها آيسين محزونين\n فيجازون على مقتضى ما كتب مثلاً بمثل عدلاً منه سبحانه\n إذ { مَن كَانَ فِي هَـٰذِهِ } النشأة { أَعْمَىٰ } عن مطالعة آثار الأوصاف الذاتية الإلهية\n وملاحظة عجائب صنعه وغرائب حكمته وبدائع تجلياته وتطوراته لحظة فلحظة { فَهُوَ فِي } النشأة { ٱلآخِرَةِ } أيضاً { أَعْمَىٰ } إذ النشأة الأولى مزرعات الخيرات\n والأخرى وقت حصاده\n فمن لم يزرع فيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:49",
      "similarity": 0.8682357950886925
    },
    {
      "verse": "4:77",
      "similarity": 0.6662115275666285
    },
    {
      "verse": "84:7",
      "similarity": 0.10409875758260187
    },
    {
      "verse": "39:27",
      "similarity": 0.08802910783405542
    },
    {
      "verse": "35:42",
      "similarity": 0.08787251793302392
    }
  ]
}