{
  "chapter": "الإسراء",
  "text": "وان كادوا۟ ليفتنونك عن الذى اوحينا اليك لتفترى علينا غيره واذا لاتخذوك خليلا",
  "translations": [
    {
      "translation": "They had almost led you away from what has been revealed to you, that you may invent things about Us besides those revealed, when they would have taken you as friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), they had all but tempted you away from what We have revealed to you that you may invent something else in Our Name. Had you done so, they would have taken you as their trusted friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Such blind ones) try to confuse what We have revealed to you so that they may falsely ascribe to Us something other than the true revelation and thus establish friendship with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it was close that they were about to mislead you somewhat from the divine revelation We sent to you, for you to attribute something else* to Us; and if it were**, they would have accepted you as a friend. (* Other than the divine revelation. ** Which is impossible.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, they were about to tempt you away from that which We have revealed to you, to fabricate something other than it against Us, and then they would certainly have taken you as an intimate friend!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely they had purposed to turn you away from that which We have revealed to you, that you should forge against Us other than that, and then they would certainly have taken you for a friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed they were near to seducing thee from that We revealed to thee, that thou mightest forge against Us another, and then they would surely have taken thee as a friend;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they indeed strove hard to beguile thee (Muhammad) away from that wherewith We have inspired thee, that thou shouldst invent other than it against Us; and then would they have accepted thee as a friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They indeed sought to entice you away from what We revealed to you, hoping that you might invent something else in Our name; and then they would have accepted you as a close friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily they had well-nigh tempted thee away from that which We have revealed unto thee, that thou shouldst fabricate regarding something else; and then surely they would have taken thee as a friend!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were about to beguile you from what Allah has revealed to you so that you may fabricate something other than that against Us, whereat they would have befriended you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their purpose was to tempt thee away from that which We had revealed unto thee, to substitute in our name something quite different; (in that case), behold! they would certainly have made thee (their) friend!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, they were about to tempt you away from that which We have revealed (the Quran) unto you (O Muhammad SAW), to fabricate something other than it against Us, and then they would certainly have taken you a friend!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they were near to seducing you from that We revealed to you, so that you might forge against Us another, and then they would surely have taken you as a friend;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They almost lured you away from what We have revealed to you, so that you would invent something else in Our name. In that case, they would have taken you for a friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, they were about to tempt you away from that which We revealed to you in order to [make] you invent about Us something else; and then they would have taken you as a friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:73]   The following was revealed regarding the [tribe of] Thaqīf, for they had asked him [the Prophet] (s) to declare their valley inviolable and implored him [to grant them this request]: And indeed (wa-in, [the particle in is] softened) they were about to, they nearly did, beguile you away from that which We revealed to you, so that you might invent against Us [something] other than that; and then, had you done that, they would have taken you as a friend.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they indeed strove hard) they almost succeeded (to beguile thee (Muhammad) away) to drive you away and make you slip (from that wherewith We have inspired thee) regarding the breaking of their idols, (that thou shouldst invent) that you should say (other than it against Us) other than what We commanded you to do: breaking their idols; (and then would they have accepted thee as a friend) because of following them. This verse was revealed about Thaqif.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإن كادوا ليفتنونك } الخ، هو من باب التلوينات التي تحدث لأرباب القلوب بظهور النفس ولأرباب الشهود والفناء بوجود القلب، فإنه عليه السلام لفرط شغفه وحرصه على إيمانهم بوجود القلب كاد يميل إليهم في بعض مقترحاتهم ويرضى ببعض ما هو خلاف شريعته، ويضيف إلى الله ما ليس منه طلباً للمناسبة التي كان يتوقع أن تحدث بينه وبينهم بذلك فيحبوه كما قال: { وإذاً لاتّخذوك خليلاً } عسى أن يقبلوا قوله ويهتدوا به\n واستمالة وتطييباً لقلوبهم عسى أن يلينوا وينزلوا عن شدّة إنكارهم فيرّق حجابهم وتتنوّر قلوبهم، فشدد وأقيم من عند الله، ولهذا قالت عائشة رضي الله عنها: \" كان خلقه القرآن \" تعني أنه عليه الصلاة والسلام كلما ظهرت نفسه وهمّت بما ليس بفضيلة نبّه من عند الله وثبت بتنزيل آية تقوّمه وتردّه إلى الاستقامة حتى بلغ مقام التمكين، وهذا وأمثاله من قوله تعالى:\n\n[الأنفال، الآية: 67]، وقوله:\n\n[التوبة، الآية: 43]، وقوله:\n\n[الأحزاب، الآية: 37]، وقوله:\n\n[عبس، الآية: 1] يدل على أنه كان أكثر سلوكه في الله بعد الوصول في زمان النبوة وزمان الوحي\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه مخاطباً لحيبيه على وجه التنبيه والتأديب بعدما ظهر عليه مخايل الميل والركون عن الحق بمخادعة أهل الكفر والنفاق: { وَإِن كَادُواْ } أي: أنهم؛ أي: الكفرة قاربوا { لَيَفْتِنُونَكَ } يا أكمل الرسل، ويوقعونك في الفتنة الشديدة يالميل والصرف { عَنِ ٱلَّذِي أَوْحَيْنَآ إِلَيْكَ } وأنزلنا في كتباك من الأوامر والنواهي والأحكام المتعلقة بتهذيب الظاهر والباطن، ويرغبونك { لِتفْتَرِيَ عَلَيْنَا غَيْرَهُ } أي: غير ما أوحينا إليك { وَإِذاً } أي: حين افترائك وانتسابك إلينا غير ما أوحينا إليك من الأمور التي تشتهيها نفوسهم وترتضيها قلوبهم { لاَّتَّخَذُوكَ خَلِيلاً } [الإسراء: 73] وآمنوا بك بواسطة انتسابك هذا\n\n\nنزلت في ثقيف حين قالوا: لا نؤمن بك حتى تخصنا بخصالٍ نفتخر ونباهي على سائر العرب، لا نضن ولا نُحشر ولا نُجبي في صلواتنا، وكّل رِباً لنا فهو لنا، وكل رِباً علينا فهو موضوع عنَّا، وأن تمتعنا باللات سنة، وأن تحرم وادينا كما حرمت مكة، فإن قالت العرب: لم فعلت معهم هذا؟ فقل: إن الله أمرني وأوصاني بها، وانتظر أن تنزل آية فيها، فإن فعلتَ بنا هذه نؤمن بك ونصدقك ونتخذك خليلاً، فتردد صلى الله عليه وسلم وقرب أن يميل ويركن لشدة ميله إلى إيمانهم واتِّباعهم، فجاء جبريل عليه السلام فمنعه عن هذا الرأي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وإن }: مخففة من الثقيلة في الموضعين، واسمها: ضمير الشأن، واللام هي الفارقة بينها وبين النافية، أي: إن الشأن قاربوا أن يفتنوك\n و { سُنَّة }: مفعول مطلق، أي: سنَّ الله ذلك سنة\n يقول الحقّ جلّ جلاله: { وإِن كادُوا } أي: كفار العرب، { ليَفتنونُك عن الذي أوحينا إِليك } من أمرنا ونهينا، ووعدنا ووعيدنا، { لتفتريَ علينا غيره } لتقول ما لم أقل لك، مما اقترحوا عليك\n نزلت في ثقيف، إذ قالوا للنَّبي صلى الله عليه وسلم: لا نَدْخُلُ في أَمْركَ حتى تُعْطِينَا خِصَالاً نَفْتَخِرُ بها على العَرَبِ: لا نُعشَّرُ، وَلا نُحشَّرُ، وَلاَ نَحْنِي في صَلاَتِنَا، وكُلُّ رِبًا لنَا فهُو لنَا، وكلُّ رِبًا عَلَيْنَا فهو مَوْضُوعٌ، وأنْ تُمَتِّعنا باللات سَنَةً، وأن تُحَرِّمَ وَادِيَنا كما حرمت مكة، فإذا قالت العَرَبُ: لِمَ فَعَلْتَ؟ فقُل: الله أَمَرَنِي بذلك\n فأبى عليهم رسولُ الله صلى الله عليه وسلم، وخيب سعيهم\n فالآية، على هذا، مدنية\n وقيل: في قريش، قالوا للنبي صلى الله عليه وسلم: لا نُمكنك من استلام الحجر، حتى تلمّ بآلهتنا، وتمسّها بيدك\n وقيل: قالوا: اقبل بعض أمرنا، نقبل بعض أمرك، والآية، حينئذ، مكية كجميع السورة\n  { وإِذًا لاتخذوكَ خليلاً } أي: لو فعلت ما أرادوا منك لصرت لهم وليًا وحبيبًا، ولخرجت من ولايتي، { ولولا أن ثبتناك } على ما أنت عليه من الحق بعصمتنا لك، { لقد كِدتَ تركنُ إليهم شيئًا قليلاً } من الركون، الذي هو أدنى ميل، أي: لولا أن عصمناك، لقاربت أن تميل إليهم لقوة خدعهم، وشدة احتيالهم\n لكن عصمتنا منعتك من المقاربة\n وهو صريح في أنه - عليه الصلاة والسلام - ما هَمَّ بإجابتهم، مع قوة الداعي إليها، ولا قارب ذلك\n وهو دليل على أن العصمة بتوفيق الله وحفظه، قاله البيضاوي\n وفيه رد على ابن عطية، حيث قال: قيل: إنه هَمَّ بموافقتهم، لكن كان ذلك خطرة، والصواب: عدم ذلك لأن التثبيت والعصمة مانعٌ من ذلك\n وقد أجاد القشيري في ذلك، ونصه: ضربنا عليكَ سرادقات العصمة، وآويناكَ في كنف الرعاية، وحفظناك عن خطر اتباع هواك، فالزَّلَلُ منك محال، والافتراءُ في نعتك غير موهوم، ولو جَنَحْتَ لحظةً إلى جانب الخلاف لَتَضَاعَفَتْ عليكَ شدائدُ البلاء لكمالِ قَدْرِك وعُلُوِّ شأنك فإنَّ كل مَنْ هو أعلى درجةً فَذَنْبُه - لو حصل - أشدُّ تأثيرًا\n { ولولا أن ثبتناك\n\n\n } الآية: لو وكلناك ونَفسَكَ، ورفعنا عنك ظِلَّ العصمة، لقاربت الإلمام بشيء مما لا يجوز من مخالفة أمرنا، ولكِنَّا أفردناك بالحفظ، بما لا تتقاصر عنكَ آثاره، ولا تَغْرُبُ عن ساحتك أنواره\n { إِذًا لأذقناك ضِعْفَ الحياة وضَعْف الممات } ، هبوط الأكابر على قدر صعودهم\n هـ",
      "translations": []
    }
  ]
}