{
  "chapter": "الإسراء",
  "text": "ان احسنتم احسنتم لانفسكم وان اساتم فلها فاذا جاء وعد الءاخرة ليسـوا۟ وجوهكم وليدخلوا۟ المسجد كما دخلوه اول مرة وليتبروا۟ ما علوا۟ تتبيرا",
  "translations": [
    {
      "translation": "If you do good, you do it to yourselves. If you do evil, you do it to your detriment. When the next promised time arrived, it was so that they could injure you and enter the Temple as they had entered it the first time, and in order to completely destroy what they had conquered.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do good, you will do so for your own good; if you do ill, you will do it for your own loss.\" So, when the time of the second prediction comes, (We shall rouse another people) to shame you, and enter the Temple as they had done the first time, and to destroy what they conquered utterly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever you did good, it was to your own advantage; and whenever you committed evil, it was to your own disadvantage. So, when the time of the fulfilment of the second promise arrived, (We raised other enemies that would) disfigure your faces and enter the Temple (of Jerusalem) as they had entered the first time, and destroy whatever they could lay their hands on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We told you), \"If you do good, it will be for your own benefit, but if you do bad, it will be against your souls. When the prophecy of your second transgression will come to pass, sadness will cover your faces. They (your enemies) will enter the mosque as they did the first time to bring about utter destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do good deeds, you will for your own good – and if you commit evil, it is for yourself; therefore when the second of those promises came – so the enemy maim your faces, and enter the mosque as they had entered it the first time, and destroy until they ruin all they could capture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And We said): \"If you do good, you do good for your own selves, and if you do evil (you do it) against yourselves.\" Then, when the second promise came to pass, (We permitted your enemies) to disgrace your faces and to enter the Masjid as they had entered it before, and to destroy with utter destruction all that fell in their hands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do good, you will do good for your own souls, and if you do evil, it shall be for them. So when the second promise came (We raised another people) that they may bring you to grief and that they may enter the mosque as they entered it the first time, and that they might destroy whatever they gained ascendancy over with utter destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do good, it is your own souls you do good to, and if you do evil it is to them likewise.' Then, when the promise of the second came to pass, We sent against you Our servants to discountenance you, and to enter the Temple, as they entered it the first time, and to destroy utterly that which they ascended to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): If ye do good, ye do good for your own souls, and if ye do evil, it is for them (in like manner). So, when the time for the second (of the judgments) came (We roused against you others of Our slaves) to ravage you, and to enter the Temple even as they entered it the first time, and to lay waste all that they conquered with an utter wasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We said], \"If you persevere in doing good, you will be doing good to yourselves; but if you do evil, it will go against you.\" When the time of the second warning came, [We roused against you others] to disgrace you utterly and to enter the place of worship as they had entered it before, utterly destroying all that they laid their hands on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye will do well ye will do well for yourselves, and if ye will do evil it will be against the same. Then when the promise of the second came, We raised up a people that they may disgrace your faces and may enter the Mosque even as they entered it the first time, and that they may destroy with utter destruction whatsoever may fall under their power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[saying,] ‘If you do good, you will do good to your [own] souls, and if you do evil, it will be [evil] for them.’ So when the occasion for the other [prophecy] comes, they will make your faces wretched, and enter the Temple just as they entered it the first time, and destroy utterly whatever they come upon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye did well, ye did well for yourselves; if ye did evil, (ye did it) against yourselves. So when the second of the warnings came to pass, (We permitted your enemies) to disfigure your faces, and to enter your Temple as they had entered it before, and to visit with destruction all that fell into their power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And We said): \"If you do good, you do good for your ownselves, and if you do evil (you do it) against yourselves.\" Then, when the second promise came to pass, (We permitted your enemies) to make your faces sorrowful and to enter the mosque (of Jerusalem) as they had entered it before, and to destroy with utter destruction all that fell in their hands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We said): 'If you do good, it shall be for your own souls; but if you do evil it is likewise' And when the second promise came (We sent them against you), to sadden your faces and to enter the Mosque as they entered it the first time, they utterly destroyed whatever they came across.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you work righteousness, you work righteousness for yourselves; and if you commit evil, you do so against yourselves. Then, when the second promise comes true, they will make your faces filled with sorrow, and enter the Temple as they entered it the first time, and utterly destroy all that falls into their power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And said], \"If you do good, you do good for yourselves; and if you do evil, [you do it] to yourselves.\" Then when the final promise came, [We sent your enemies] to sadden your faces and to enter the temple in Jerusalem, as they entered it the first time, and to destroy what they had taken over with [total] destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:7] And We said: ‘If you are virtuous, through [acts of] obedience, you are being virtuous to your own souls, since the reward thereof is for them [your souls]; and if you do evil, by way of [working] corruption, it is for them’, your evildoing. So when the time, the occasion, for the other [prophecy] comes, We will raise them forth, that they might ravage you, make you grieve through [their] slaying and taking captive [of you], a grief that will be manifest on your faces, and that they might enter the Temple, the Holy House [of Jerusalem], and destroy it, just as they entered it, and destroyed it, the first time, and that they might destroy, lay waste, all that they conquered, [all that] they gained ascendancy over, utterly, with an utter wasting. They indeed wrought corruption a second time when they slew [the prophet] John. Thus Nebuchadnezzar was roused against them, and so he slew thousands of them and took their children captive and destroyed the Holy House [of Jerusalem].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { إن أحسنتم أحسنتم لأنفسكم وإن أسأتم فلها } من جملة المقضي في الكتاب مما خوطب به بنو إسرائيل ، وهو حكاية لما في الإصحاح التاسع والعشرين من كتاب أرميا «وصلُّوا لأجلها إلى الرب لأنه بسلامها يكون لكم سلام» . وفي الإصحاح الحادي والثلاثين «يقول الرب أزرعُ بيت إسرائيل وبيتَ يَهوذا ويكون كما سهرِتُ عليهم للاقتلاع والهدم والقَرض والإهلاك ، كذلك أسْهَر عليهم للبناء والغرس في تلك الأيام لا يقولون : الآباء أكلوا حِصْرِماً وأسنان الأبناء ضَرِستْ بل كل واحد يموت بذنبه كل إنسان يأكل الحِصْرِم تَضرِس أسنانُه» .ومعنى { إن أحسنتم أحسنتم لأنفسكم } أننا نرد لكم الكرة لأجل التوبة وتجدد الجيل وقد أصبحتم في حالة نعمة ، فإن أحسنتم كان جزاؤكم حسناً وإن أسأتم أسأتم لأنفسكم ، فكما أهلكنا مَن قبلكم بذنوبهم فقد أحسنا إليكم بتوبتكم فاحذروا الإساءة كيلا تصيروا إلى مصير مَن قبلكم .وإعادة فعل { أحسنتم } تنويه فلم يقل : إن أحسنتم فلأنفسكم . وذلك مثل قول الأحوص:فإذا تَزول تزول عن مُتخمّط...تُخشى بوادِره على الأقرانِ ... قال أبو الفتح ابن جني في شرح بيت الأحوص في الحماسة : إنما جاز أن يقول ( فإذا تَزولُ تزول ) لِما اتصل بالفعل الثاني من حرف الجر المفادة منه الفائدة . ومثله قول الله تعالى : { هؤلاء الذين أغوينا أغويناهم كم غوينا } \\[ القصص : 63 \\] ، ولو قال : هؤلاء الذين أغوينا أغويناهم لم يفد القول شيئاً كقولك : الذي ضربتهُ ضربتُه . وقد كان أبو علي امتنع في هذه الآية مما أخذناه ( في الأصل أجزناه ) غير أن الأمر فيها عندي على ما عرفتُك ا ه .والظاهر أن امتناع أبي علي من ذلك في هذه الآية أنه يرى جَواز أن تكون أغويناهم تأكيداً لأغوينا وقوله : كما غوينا استئنافاً بيانياً ، لأن اسم الموصول مسند إلى مبتدأ وهو اسم الإشارة فتم الكلام بذلك ، بخلاف بيت الأحوص ومثال ابن جني : الذي ضربته ضربتهُ ، فيرجع امتناع أبي علي إلى أن ما أخذه ابن جني غير متعين في الآية تعيُّنَه في بيت الأحوص .وأسلوب إعادة الفعل عند إرادة تعلق شيء به أسلوب عربي فصيح يقصد به الاهتمام بذلك الفعل . وقد تكرر في القرآن ، قال تعالى : { وإذا بطشتم بطشتم جبارين } \\[ الشعراء : 130 \\] وقال : { وإذا مروا باللغو مروا كراما } \\[ الفرقان : 72 \\].وقوله : { إن أحسنتم أحسنتم لأنفسكم } جاء على طريقة التجريد بأن جعلت نفس المحسن كذات يحسن لها . فاللام لتعدية فعل { أحسنتم } ، يقال : أحسنت لفلان .وكذلك قوله : { وإن أسأتم فلها }. فقوله : { فلها } متعلق بفعل محذوف بعد فاء الجواب ، تقديره : أسأتم لها . وليس المجرور بظرف مستقر خبراً عن مبتدأ محذوف يدل عليه فعل { أسأتم } لأنه لو كان كذلك لقال فعَلَيها ، كقوله في سورة \\[ فصلت : 46 \\] { من عمل صالحاً فلنفسه ومن أساء فعليها }ووجه المخالفة بين أسلوب الآيتين أن آية فصلت ليس فيها تجريد ، إذ التقدير فيها : فعمله لنفسه وإساءته عليه ، فلما كان المقدر اسماً كان المجرور بعده مستقراً غير حرف تعدية ، فجرى على ما يقتضيه الإخبار من كون الشيء المخبَر عنه نافعاً فيخبر عنه بمجرور باللام ، أو ضاراً يخبر عنه بمجرور ب ( إلى ) ، وأما آية الإسراء ففعل أحسنتم وأسأتم الواقعان في الجوابين مقتضيان التجريد فجاءا على أصل تعديتهما باللام لا لقصد نفع ولا ضر .تفريع على قوله : { وإن أسأتم فلها } \\[ الإسراء : 7 \\] ، إذ تقدير الكلام فإذا أسأتم وجاء وعدُ المرة الآخرة .وقد حصل بهذا التفريع إيجاز بديع قضاءً لِحَقّ التقسيم الأول في قوله : { فإذا جاء وعد أولاهما } \\[ الإسراء : 5 \\] ، ولِحَقّ إفادة ترتب مجيء وعد الآخرة على الإساءة ، ولو عطف بالواو كما هو مقتضى ظاهر التقسيم إلى مرتين فاتت إفادة الترتب والتفرع .و { الآخرة } صفة لمحذوف دل عليه قوله : { مرتين } ، أي وعد المرة الآخرة .وهذا الكلام من بقية ما قضي في الكتاب بدليل تفريعه بالفاء .والآخرة ضد الأولى .ولاماتُ «ليسوؤوا ، وليدخلوا ، وليتبروا» للتعليل ، وليست للأمر لاتفاق القراءات المشهورة على كسر اللامين الثاني والثالث ، ولو كانا لامَيْ أمرٍ لكانَا ساكنين بعد واو العطف ، فيتعين أن اللام الأول لام أمر لا لام جر . والتقدير فإذا جاء وعد الآخرة بعثنا عباداً لنا ليسوؤا وجوهكم الخ .وقرأ نافع ، وابن كثير ، وأبو عمرو ، وحفص ، وأبو جعفر ، ويعقوب { ليسوؤا } بضمير الجمع مثل أخواته الأفعاللِ الأربعة . والضمائر راجعة إلى محذوف دلّ عليه لام التعليل في قوله : { ليسوؤا } إذ هو متعلق بما دل عليه قوله في { وعد أولاهما بعثنا عليكم عباداً لنا } \\[ الإسراء : 5 \\] ، فالتقدير : فإذا جاء وعد الآخرة بعثنا عليكم عباداً لنا ليسوؤوا وجوهكم . وليست عائدة إلى قوله : عبادا لنا } المصرح به في قوله : { فإذا جاء وعد أولاهما بعثنا عليكم عباداً لنا أولى بأس شديد } \\[ الإسراء : 5 \\] ، لأن الذين أساؤوا ودخلوا المسجد هذه المرة أمة غير الذين جاسوا خلال الديار حسب شهادة التاريخ وأقوال المفسرين كما سيأتي .وقرأ ابن عامر ، وحمزة ، وأبو بكر عن عاصم ، وخلف { ليسوءَ } بالإفراد والضمير لله تعالى . وقرأ الكسائي { لنَسوء } بنون العظمة . وتوجيهُ هاتين القراءتين من جهة موافقة رسم المصحف أن الهمزة المفتوحة بعد الواو قد ترسم بصورة ألف ، ، فالرسم يسمح بقراءة واو الجماعة على أن يكون الألف ألف الفرق وبقراءتي الإفراد على أن الألف علامة الهمزة .وضميرا «ليسوءوا وليدخلوا» عائدان إلى { عباداً لنا } \\[ الإسراء : 5 \\] باعتبار لفظه لا باعتبار ما صدق المعاد ، على نحو قولهم : عندي درهم ونصفه ، أي نصف صاحب اسم درهم ، وذلك تعويل على القرينة لاقتضاء السياق بُعد الزمن بين المرتين : فكان هذا الإضمار من الإيجاز .وضمير { كما دخلوه } عائد إلى العباد المذكور في ذكر المرة الأولى بقرينة اقتضاء المعنى مراجع الضمائر كقوله تعالى : { وأثاروا الأرض وعمروها أكثر مما عمروها } \\[ الروم : 9 \\] ، وقول عباس بن مرداس:عُدنا ولولا نحن أحدق جمعهم...بالمسلمين وأحرزوا ما جَمّعوا ... فالسياق دال على معاد ( أحرزوا ) ومعاد ( جَمّعوا ).وسَوْء الوجوه : جَعْل المساءة عليها ، أي تسليط أسباب المساءة والكآبة عليكم حتى تبدو على وجوهكم لأن ما يخالج الإنسان من غم وحزن ، أو فرح ومسرة يظهر أثره على الوجه دون غيره من الجسد ، كقول الأعشى:وأقدِمْ إذا ما أعين الناس تَفْرق...أراد إذا ما تفرق الناس وتظهر علامات الفرق في أعينهم .ودخول المسجد دخول غزو بقرينة التشبيه في قوله : { كما دخلوه أول مرة } المراد منه قوله : { فجاسوا خلال الديار } \\[ الإسراء : 5 \\].والتتبِير : الإهلاك والإفساد .و { ما علوا } موصول هو مفعول «يتبروا» ، وعائد الصلة محذوف لأنه متصل منصوب ، والتقدير : ما علوه ، والعلو علو مجازي وهو الاستيلاء والغلب .\n\n",
      "translations": [
        {
          "translation": "((Saying): If ye do good) if you confess Allah's Oneness, (ye do good for your own souls) the reward for that is Paradise, (and If ye do evil) and if you associate partners with Allah, (it is for them (in like manner)) the punishment for that is upon them. They remained in comfort, merriness, abundance of men and numbers, and triumph over the enemy for 220 years until Allah roused against them Titus. (So, when the time for the second (of the judgements) came) the second of the two punishment or the second of the two corruptions ((We roused against you others of Our slaves) to ravage you) by killing you and taking you as captives, i.e. Titus the son of Espianos the Roman, (and to enter the Temple) Jerusalem (even as they entered it the first time) even as Nebuchadnezzar and his host entered it the first time, (and to lay waste all that they conquered with an utter wasting).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلِيُتَبِّرُواْ } معناهُ لِيُدَمَّروا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And let them destroy\" - its meaning is that they should destroy themselves.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n  { إن أحسنتم } بتحصيل الكمالات الخلقية والآراء العقلية { أحسنتم لأنفسكم وإن أسأتم } باكتساب الرذائل والهيئات البدنية { فلها فإذا جاء وعد } المرة { الآخرة } بالفناء في التوحيد بعثنا عليكم عباداً من الأنوار القدسية والتجليات الجلالية والسبحات القهرية من الصفات الإلهية وجنود سلطان العظمة والكبرياء { ليسوؤوا وجوهكم } أي: وجوداتكم بالفناء في التوحيد\n فيغلب عليكم كآبة فقدان الكمالات بقهرها وسلبها { وليدخلوا } مسجد القلب { كما دخلوه أول مرة } ووصل أثرها عليكم من العلوم والفضائل { وليتبروا ما علوا } بالظهور بكماله وفضيلته والإعجاب برؤية زينته وبهجته { تتبيراً } بالإفناء بصفات الله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنْ أَحْسَنْتُمْ } لبني نوعكم خالصاً لوجه الله\n وآمنتم لتزكية نفوسكم { أَحْسَنْتُمْ لأَنْفُسِكُمْ } إذ فوائد الإيمان والإحسان عائدةٌ إليكم { وَإِنْ أَسَأْتُمْ } لهؤلاء\n وكفرتم بالله وبرسوله { فَلَهَا } أي: وبال إساءتكم عليها\n إذ الله في ذاته غنيٌّ عن إحسان المحسن\n وإساءة المسيء { فَإِذَا جَآءَ وَعْدُ ٱلآخِرَةِ } أي: وقت انتقام الجريمة الأخيرة\n بعثنا عليكم أيضاً عباداً لنا أولي بأس شديد\n وبسطة قوية\n وبطش شديد: طيطوس الرومي\n\n\nوقيل: ملك الفرس اسمه: جودرز\n وقيل: حردوس\n وإنما بعثناهم عليكم { لِيَسُوءُواْ وُجُوهَكُمْ } ليسوءوا معكم\n بحيث ظهرت آثار إساءتهم من وجوهكم { وَلِيَدْخُلُواْ ٱلْمَسْجِدَ } وخربوه { كَمَا دَخَلُوهُ } وخربوه { أَوَّلَ مَرَّةٍ } من استيلاء بختَنصّر\n وأحرقوا الكتب\n كما أحرقوا { وَلِيُتَبِّرُواْ } وليهلكوا { مَا عَلَوْاْ } وقدروا عليه وغلبا { تَتْبِيراً } [الإسراء: 7] هلاكاً كليّاً\n بحيث لا ينجو منهم أحد\n\n\nقيل: دخل صاحب الجيش\n فذبح قرابينهم\n فوجد فيه دماً يغلي\n فسألهم عنه: فالوا: دم قربان لم يُقبل منا\n فقال: ما هو إلاَّ كذب\n فقتل ألوفاً منهم عليه\n ثمَّ قال: إن لم تُصْدِقُوني\n ولم تبينوا لي دم مَنْ هو هذا\n ما تركت منك أحداً؟ فلما اضطروا قالوا: إنه دم يحيى النبي عليه السلام قتلناه ظلماً\n فقال: لمثل هذا ينتقم الله منكم؟! ثمَّ قال ملتفتاً إلى الدم: يا يحيى\n قد علم ربي وربك ما أصاب قومك من أجلك\n فأسكن من الغلي قبل ألاَّ أُبقي أحداً منهم\n فسكن\n ولم يقتل بعد هذا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى لهم: { إِنْ أحسنتم } بفعل الطاعة والعمل الصالح\n { أَحْسَنْتُمْ لأنفسكم } لأن ثوابه لها\n { وإِن أسأتم فلها } فإنَّ وبالها عليها\n وذكر باللام للازدواج\n { فإِذا جاء وعدُ الآخرة } أي: وعد عقوبة المرة الأخيرة\n بأن أفسدوا في المرة الآخرة\n بعثنا عليكم عبادًا لنا آخرين\n أُولي بأس شديد { ليَسُؤوا وجوهكم } \n يجعلوها تظهر فيها آثار السوء والشر\n كالكآبة والحزن\n كقوله:\n[المُلك: 27] { وليدخلوا المسجد } بيت المقدس { كما دخلوه أول مرة وليُتبروا } وليُهلكوا { ما عَلوا } عليه { تتبيرًا } إهلاكًا\n أو مدة علوهم\n قال البيضاوي: وذلك بأن الله سلَّط عليهم الفرس مرة أخرى\n فغزاهم ملكُ بابِل\n اسمه \" حَرْدُون \" \n وقيل: \" حَرْدوس \" \n قيل: دخل صاحب الجيش مَذبح قرابينهم\n فوجد دمًا يغلي\n فسأل عنه\n فقالوا: دم قربان لم يُقبل منا\n\nفقال: ما صدقتموني\n فقتل عليه ألوفًا منهم\n فلم يهدأَ الدم\n ثم قال: إن لم تصدقوني ما تركت منكم أحدًا\n فقالوا: دم يحيى\n فقال: لِمثل هذا ينتقم منكم ربكم\n ثم قال: يا يحيى\n قد علم ربي وربك ما أصاب قومك\n فاهدأ بإذن الله\n قبل ألاَّ أُبقي منهم أحدًا\n فهدأ\n هـ\n وقال السهيلي في كتاب \" التعريف والإعلام \": المبعوث في المرة الأولى هم أهل بابل\n وكان إذ ذاك عليهم \" بختنصر \" \n حين كذّبوا أرمياء وجرحوه وحبَسوه\n وأما في المرة الأخيرة: فقد اختلف فيمن كان المبعوث عليهم\n وأن ذلك كان بسبب قتل يحيى بن زكريا\n فقيل: بختنصر\n وهذا لا يصح لأن قتل يحيى كان بعد رفع عيسى\n وبختنصر كان قبل عيسى بزمان طويل\n هـ\n وقول الجلال السيوطي: وقد أفسدوا في الأُولى بقتل زكريا\n فبعث عليهم جالوت وجنوده\n ولا يصح لأنه يقتضي أن داود تأخر عن زكريا\n وهو باطل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:39",
      "similarity": 0.7614919496966127
    },
    {
      "verse": "7:139",
      "similarity": 0.7517156303291042
    },
    {
      "verse": "71:28",
      "similarity": 0.7408802545445626
    },
    {
      "verse": "17:4",
      "similarity": 0.18138791770927146
    },
    {
      "verse": "18:48",
      "similarity": 0.1783474911140163
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}