{
  "chapter": "الإسراء",
  "text": "وان كادوا۟ ليستفزونك من الارض ليخرجوك منها واذا لا يلبثون خلفك الا قليلا",
  "translations": [
    {
      "translation": "They were very near to scaring you from the land with the object of expelling you from it. But had they done so they would only have remained there a short time after you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had nearly expelled you from the land and driven you away from it. But then, they too would have stayed but a little after you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were bent upon uprooting you from this land and driving you away from it. But were they to succeed, they would not be able to remain after you more than a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They try to annoy you so that they can expel you from the land. Had they been successful, no one would have been left behind except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed it was close that they frighten you in the land for them to oust you from it – and if it were, they would not have stayed after you, but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, they were about to frighten you so much as to drive you out from the land. But in that case, they would not have stayed (therein) after you, except for a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely they purposed to unsettle you from the land that they might expel you from it, and in that case they will not tarry behind you but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed they were near to startling thee from the land, to expel thee from it, and then they would have tarried after thee only a little --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they indeed wished to scare thee from the land that they might drive thee forth from thence, and then they would have stayed (there) but a little after thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed they came near to unsettling you, so that they might expel you from the land, but in that case they themselves would not have stayed on for very long after you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily they had well-nigh unsettled thee from the land that they might drive thee forth from thence. And in that case they would not have tarried after thee but a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were about to hound you out of the land, to expel you from it, but then they would not have stayed after you but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their purpose was to scare thee off the land, in order to expel thee; but in that case they would not have stayed (therein) after thee, except for a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Verily, they were about to frighten you so much as to drive you out from the land. But in that case they would not have stayed (therein) after you, except for a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They very nearly provoked you to drive you out of the land, but they would have only lingered for a little while after you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They almost provoked you, to expel you from the land. In that case, they would not have lasted after you, except briefly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, they were about to drive you from the land to evict you therefrom. And then [when they do], they will not remain [there] after you, except for a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:76] When the Jews said to him, ‘If you are a prophet, then make your way to Syria, for it is the land of prophets’, the following was revealed: And indeed (wa-in, [the particle in is] softened) they were about to provoke you out of the land, the land of Medina, to expel you from it, but then, had they expelled you, they would not have remained after you, in it, except a little [while], after which they would have been destroyed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "307 (And they indeed wished to scare thee from the land) the land of Medina (that they might drive thee forth from thence) to Historic Syria, (and then) if they succeeded in driving you away from Medina (they would have stayed (there) but a little after thee) before We destroy them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِن كَادُواْ لَيَسْتَفِزُّونَكَ مِنَ ٱلأَرْضِ } معناه يستَخِفّونَكَ لِيَخرُجُوكَ من المدينةِ\n وأرادَ بهم اليَهودَ، لأَنَّهم قَالوا للنبي صلّى الله عليهِ وآله وسلّمَ: ما هذه البَلدة بِبلادِ الأَنبياءِ عليهم الصَّلاةُ والسّلامُ، وإِنّما بِلاَدُهم الشَّامُ؛ فإنْ كُنتَ نبياً فاخْرجْ إِليهَا، حَسداً منهم\n\n\n\n\nوقوله تعالى: { وَإِذاً لاَّ يَلْبَثُونَ خِلافَكَ } معناه بَعدكَ\n ويقالُ خِلافُكَ وخَلفُكَ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And if they had intended to come out, they would have made preparations for it} [means that] they wanted to exit in order to get you out [of the city].\n\n\nAnd the Jews wanted to harm the Prophet (peace and blessings of Allah be upon him) because they said to him: \"This city is not the land of the Prophets. Their land is Syria. If you are a Prophet, then go to Syria.\" Out of envy for them.\n\nAnd His saying, {And then they will not remain after you} [means] after you.\n\n\nThis is said to mean \"your successor and your predecessor.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن كَادُواْ لَيَسْتَفِزُّونَكَ } أي: وإن قاربوا؛ ليحركونك ويضطرونك بالنقل والجلاء { مِنَ ٱلأَرْضِ } التي استقررتَ وتمكنتَ فيها؛ يعني: مكة { لِيُخْرِجوكَ مِنْهَا } معللين بأن الأنبياء والرسل إنما بعثوا في أرض الشام وأرض المقدسة، خصوصاً أجدادك إبراهيم وإسماعيل وإسحاق ويعقوب وأولادهم وأسباطهم\n صلوات الله عليهم كلهم\n بُعثوا فيها، فلك أن تخرج إليها حتى نؤمن لك ونصدق برسالتك، وما ذلك إلا حليةُ وخديعةُ معك؛ ليخرجوك من مكة حتى تبقى رئاستهم معهم { وَ } لا تغتم يا أكمل الرسل ولا تحزن بالخروج منها، فإنك لو خرجت منها { إِذاً لاَّ يَلْبَثُونَ خِلافَكَ إِلاَّ } زماناً { قَلِيلاً } [الإسراء: 76] وقد جرى الأم على مقتضى وعد الله سبحانه، فإنهم بعدما هاجر صلى الله عليه وسلم ببدرٍ بعد مدةٍ يسيرةٍ\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِن كادوا } أي: كاد أهل مكة { لَيَسْتفزُّونك } ليزعجونك بعداوتهم ومكرهم { من الأرض } التي أنت فيها\n وهي: أرض مكة، { ليُخرِجوك منها وإِذًا لا يلبثون خِلافَكَ إِلاَّ قليلاً } إلا زمنًا قليلاً\n وقد كان كذلك، فإنهم أُهلكوا ببدر بعد هجرته صلى الله عليه وسلم، وقيل: نزلت في اليهود فإنهم حَسَدوا مقام النبي صلى الله عليه وسلم بالمدينة، فقالوا: الشام مقام الأنبياء، فإن كنت نبيًا فالحَقْ بها حتى نؤمن بك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:103",
      "similarity": 0.7880903061113699
    },
    {
      "verse": "17:64",
      "similarity": 0.38989809494847494
    },
    {
      "verse": "23:114",
      "similarity": 0.20616148091162437
    },
    {
      "verse": "17:52",
      "similarity": 0.1863780394252696
    },
    {
      "verse": "18:26",
      "similarity": 0.1462643074489641
    }
  ]
}