{
  "chapter": "الإسراء",
  "text": "اذا لاذقنك ضعف الحيوة وضعف الممات ثم لا تجد لك علينا نصيرا",
  "translations": [
    {
      "translation": "Then We would have let you taste a double punishment in life and a double punishment in death. You would not have found any helper against Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We would have made you taste a double anguish of life and a double anguish of death, and then you would not have been able to find a helper against Us for yourself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whereupon We would have made you taste double (the chastisement) in the world and double (the chastisement) after death, and then you would have found none to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had you done so, We would certainly have made you face double punishment in this life and after your death and you would have found none to help you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it were*, We would then have made you taste a double life and a double death – you would then not find any supporter against Us. (* Which is impossible.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We would have made you taste a double portion in this life and a double portion after death. And then you would have found none to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We would certainly have made you to taste a double (punishment) in this life and a double (punishment) after death, then you would not have found any helper against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then would We have let thee taste the double of life and the double of death; and then thou wouldst have found none to help thee against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then had we made thee taste a double (punishment) of living and a double (punishment) of dying, then hadst thou found no helper against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case, We should have inflicted a double punishment in this life, and a double punishment after death. Then you would have found no one to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We would have surely made thee taste the double of the tornment of the life and the double of the torment of death, and then thou wouldst not find against Us a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We would have surely made you taste a double [punishment] in this life and a double [punishment] after death, and then you would have not found for yourself any helper against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case We should have made thee taste an equal portion (of punishment) in this life, and an equal portion in death: and moreover thou wouldst have found none to help thee against Us!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that case, We would have made you taste a double portion (of punishment) in this life and a double portion (of punishment) after death. And then you would have found none to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We would have let you taste the double of life and death; and you would have found none to help you against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We would have made you taste double in life, and double at death; then you would have found for yourself no helper against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then [if you had], We would have made you taste double [punishment in] life and double [after] death. Then you would not find for yourself against Us a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:75] Then, had you inclined, We would have surely made you taste a double, chastisement, in life and a double, chastisement, upon death, in other words, twice the chastisement that any other person would receive in this world and the Hereafter. Then you would not have found for yourself any helper against Us, [anyone] to shield [you] from it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then) if you had granted to them what they requested (had We made thee taste a double (punishment) of living) the chastisement of this worldly life (and a double (punishment) of dying) the chastisement of the Hereafter, (then hadst thou found no helper against Us) you would not find anyone to save you from Us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ضِعْفَ ٱلْحَيَاةِ } أي عَذابين\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the life of this world is but} two punishments.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إذاً لأذقناك } أي: لو قاربت فتنتهم وكدت توافقهم لأذقناك عذاباً مضاعفاً في الحياة وعذاباً مضاعفاً في الممات، فإنّ شدّة العذاب بحسب علوّ المرتبة وقوة الاستعداد إذ النقصان الموجب للعذاب يقابل الكمال الموجب للذة\n فكلما كان الاستعداد أتمّ والإدراك أقوى، كانت المرتبة في الكمال والسعادة واللذة أقوى فكذا ما يقابله من النقص والشقاوة أبعد وأسفل والألم أشدّ\n { أقِم الصَّلاة لدلوك الشمس } اعلم أنّ الصلاة على خمسة أقسام: صلاة المواصلة والمناغاة في مقام الخفاء، وصلاة الشهود في مقام الروح، وصلاة المناجاة في مقام السرّ، وصلاة الحضور في مقام القلب، وصلاة المطاوعة والانقياد في مقام النفس\n فدلوك الشمس هو علامة زوال شمس الوحدة عن الاستواء على وجود العبد بالفناء المحض، فإنه لا صلاة في حال الاستواء إذ الصلاة عمل يستدعي وجوداً، وفي هذه الحالة لا وجود للعبد حتى يصلي كما ذكر في تأويل قوله تعالى:\n\n[الحجر، الآية: 99]\n ألا ترى الشارع عليه السلام كيف نهى عن الصلاة وقت الاستواء، فأما عند الزوال، إذا حدث ظل وجود العبد سواء عند الاحتجاب بالخلق حالة الفرق قبل الجمع أو عند البقاء حالة الفرق بعد الجمع، فالصلاة واجبة { إلى غسق } ليل النفس { وقرآن } فجر القلب، فأول الصلوات وألطفها صلاة المواصلة والمناغاة وأفضلها وأشرفها صلاة الشهود للروح المشار إليها بصلاة العصر كما فسرت الصلاة الوسطى، أي: الفضلى في قوله تعالى:\n",
      "translations": [
        {
          "translation": "\n\n{Then we will make you taste} meaning: if you approach them and agree with them, we will make you taste a double punishment in life and a double punishment in death.,\n\nThe intensity of the punishment is in proportion to the height of the rank and the strength of the preparation, as the deficiency that leads to punishment is matched by the perfection that leads to pleasure.\n\n\nAs the preparation became more complete and the understanding stronger,, {The rank in perfection, happiness and pleasure is the strongest, and likewise what it faces of deficiency, poverty and pain is the furthest and lowest, and the pain is the strongest.}\n\n\n{Perform the prayer at the decline of the sun}\n\nKnow that the prayer has five parts: the prayer of continuity and the prayer of seeking refuge in the place of concealment.,\n\nThe prayer of the witnesses in the position of the soul,\n\nThe prayer of supplication in the position of privacy,\n\nThe presence prayer is in the position of the heart.,\n\nThe prayer of voluntary submission and leadership in the station of the self.\n\n\nThe setting of the sun is a sign of the sun's decline from its position at noon in the presence of the slave in the open air.,\n\nThere is no prayer in the state of istiwā', since prayer is an action that requires the existence of something.,\n\nAnd in this case there is no obligation for the slave to pray as mentioned in the interpretation of the verse {as he ought to pray}.\n The stone\n\nThe stone is a hard, natural material that has been used by humans for thousands of years. Stones can be used for building, as a medium for sculpting, or as a decoration.,\n\nAnd He is the one who created the stars for you, so that you might find your way in the darkness of the night and in the daytime. Indeed, He is the all-seeing, all-knowing.\n\n\nDo you not see how the street is deserted during the time of prayer?,\n\nAs for the end of the world,, If the shadow of the slave's existence occurs either when he is absent from the created beings in a state of separation before gathering, or when he is present with them in a state of separation after gathering.,\n\nThe prayer is obligatory {until dawn} for the night of the soul {and the Quran} at the break of the heart.,\n\nThe first and most excellent of prayers is the continuous prayer, which is the prayer of those who are present and attentive. The best and most noble of these prayers is the prayer of the witnesses, which is the prayer of those who have been called to testify to the truth.,\n\n\"So which of the favors of your Lord would you deny?\" (Quran, 55:13)",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِذاً } أي: حين إنجاحكم سُؤْلهم ومأمولهم { لأذَقْنَاكَ } في نشأتك هذه { ضِعْفَ ٱلْحَيَاةِ } أي: ضعف عذاب من جاء بمثله في النشأة الأولى { وَضِعْفَ ٱلْمَمَاتِ } أي: ضعف عذاب من جاء بمثله في النشأة الأخرى؛ يعني: نعذبك في الدنيا والآخرة بعضف عذاب من جاء به من سائر الناس؛ لأن جزاء الأبرار لو أتوا بالمعاصي والآثام ضعف جزاء الأشراء، بل أكثر؛ إذ لا يتوقع منهم الانصراف عن منهج الرشاد أصلاً، ولو انصرفوا أُخذوا بضعف من يتوقع منهم الانحراف والانصراف { ثُمَّ } بعد أخذنا إياك انتقامنا منك { لاَ تَجِدُ لَكَ عَلَيْنَا نَصِيراً } [الإسراء: 75] أي: لا تجد ظهيراً لك نصيراً يظهر علينا بنصرتك، ويطالبنا بإنقاذك عن عذابنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِذًا } أي: لو قاربت أن تركن إليهم أدنى ركون { لأذقناك ضِعف } عذاب { الحياة }  { وضِعْفَ } عذاب { الممات } ، أي: مِثْلِيْ ما يُعَذِّبُ غيرك في الدنيا والآخرة لأن خطأ الخطير أخطر\n\n\nوكأن أصل الكلام: عذابًا ضعفًا في الحياة، وعذابًا ضعفًا في الممات، أي: مضاعفًا، ثم حذف الموصوف، وأقيمت الصفة مقامه، ثم أضيفت إضافة موصوفها\n وقيل: الضعف من أسماء العذاب\n وقيل: المراد بضعف الحياة: عذاب الآخرة لأن حياته دائمة، وبضعف الممات: عذاب القبر\n { ثم لا تجدُ لك علينا نصيرًا } يدفع عنك العذاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:57",
      "similarity": 0.4419538012548699
    },
    {
      "verse": "72:24",
      "similarity": 0.37276821579674174
    },
    {
      "verse": "87:13",
      "similarity": 0.3637133485976132
    },
    {
      "verse": "9:116",
      "similarity": 0.35502621623663666
    },
    {
      "verse": "26:81",
      "similarity": 0.3499899744478128
    }
  ]
}