{
  "chapter": "الإسراء",
  "text": "سنة من قد ارسلنا قبلك من رسلنا ولا تجد لسنتنا تحويلا",
  "translations": [
    {
      "translation": "That was the pattern with those We sent before you as Our Messengers. You will not find any changing of Our pattern.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This has been Our way with the apostles whom We sent before you. You will not find any variation in Our line of action.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This has been Our Way with the Messengers whom We sent before you. You will find no change in Our Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was Our tradition with Our Messengers who lived before you, and you will find no change in Our tradition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The tradition of the Noble Messengers We sent before you – and you will not find Our rules changing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Sunnah with which We sent Our Messengers before you and you will not find any alteration in Our Sunnah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is Our) course with regard to those of Our apostles whom We sent before you, and you shall not find a change in Our course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the wont of those We sent before thee of Our Messengers; thou wilt find no change to Our wont.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Such was Our) method in the case of those whom We sent before thee (to mankind), and thou wilt not find for Our method aught of power to change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such was Our way with the messengers We sent before you, and you will find no change in Our ways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was Our dispensation with those whom We sent before thee of Our apostles, and thou wilt not find in this Our dispensation a change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A precedent concerning those We have sent before you from among Our apostles, and you will not find any change in Our precedent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This was Our) way with the messengers We sent before thee: thou wilt find no change in Our ways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This was Our) Sunnah (rule or way) with the Messengers We sent before you (O Muhammad SAW), and you will not find any alteration in Our Sunnah (rule or way, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such was Our way with those whom We sent before you. You shall find no change in Our way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The tradition of the messengers We sent before you—you will find no change in Our rules.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[That is Our] established way for those We had sent before you of Our messengers; and you will not find in Our way any alteration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:77] [That is] the way in the case of those whom We have sent from among Our messengers before you, that is to say, [that is] Our way [of dealing] with them [their enemies], destroying those who expel them [Our messengers]. And as regards Our [established] way you will not find any change, any alternative [manner].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Such was Our) method in the case of those whom We sent before you (to mankind)) We destroyed them once their messengers departed from amongst them, (and thou wilt not find for Our method) Our punishment (aught of power to change) it does not alter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوليس إخراجك يا أكمل الرسل عن مكة، وهلاكهم بعد خروجك منها ببدع منا مستحدث، بل من سنتنا القديمة وعادتنا المستمرة إهلاكُ الأمم الذين أَخرجوا نبيهم المبعوث إليهم من بين أظهرهم عتواً وعناداً بل صار ذلك: { سُنَّةَ مَن قَدْ أَرْسَلْنَا قَبْلَكَ مِن رُّسُلِنَا } المبعوثين إلى الأمم الما ضية؛ أ ي: من سنتنا الموضوعة فيهم بالنسبة إلى أقوامهم، فكذلك حالك مع هؤلاء المعاندين المكذبين { وَ } بعدما استمر منا هذه السُّنة السَّنية { لاَ تَجِدُ } أنت وغيرك أيضاً { لِسُنَّتِنَا } المنبعثة من كمال حكمتنا { تَحْوِيلاً } [الإسراء: 77] أي: تغييراً وتبديلاً؛ إذ لنا فيها حِكمُ ومصالحُ مخفيةُ استأثرنا بها لا اطلاع لك عليها، وإنما عليك التوجه والتقرب في جميع أوقاتك وحالاتك سيما في الأوقات المكتوبة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فوقع ذلك في قلبه صلى الله عليه وسلم، فخرج مرحلة، فَنَزَلت، فرَجَعَ صلى الله عليه وسلم، ثم قتل منهم بني قريظة، وأجلى بني النضير بقليل، { سُنَّة مَن قد أرسلنا قَبلك من رُسلنا } أي: عادته تعالى: أن يُهلك من أُخْرِجَتْ رسلهم من بين أظهرهم، فقد سنَّ ذلك في خلقه، وأضافها إلى الرسل لأنها سُنت لأجلهم\n { ولا تجد لسُنَّتنا تحويلاً } أي: تغييرًا وتبديلاً\n الإشارة: من شأن العارف الكامل أن يأخذ بالعزائم، ويأمر بما يقتل النفوس، ويوصل إلى حضرة القدوس، وهو كل ما يثقل على النفوس، فإن أتاه من يفتنه ويرده إلى الهوى، حفظته العناية، واكتنفته الرعاية، فيقال له: وإن كادوا ليفتنونك عن الذي أوحينا إليك وحي إلهام، لتفتري علينا غيره، فتأمر بالنزول إلى الرخص والتأويلات وإذًا لاتخذوك خليلاً\n ولولا أن ثبتناك بالحفظ والرعاية، لقد كدت تركنُ إليهم شيئًا قليلاً، وهي: خواطر تخطر ولا تثبت\n إذًا لأذقناك ضعف الحياة، وهو: الذل والحرص والطمع\n وضعف الممات، وهو: السقوط عن مقام المقربين، أهل الرَّوح والريحان\n وإن كادوا ليستفزونك من أرض العبودية، ليخرجوك منها إلى إظهار الحرية من العز والجاه، وإذًا لا يلبثون خلافك ممن اتبعك إلا قليلاً لأن من رجع إلى مباشرة الدنيا والحس قلَّ مدده، فيقل انتفاعه، فلا يتبعه إلا القليل\n هذه سُنة الله في أوليائه، ولن تجد لسنة الله تحويلاً\n ثمَّ أمر بمراسم الشريعة التي هي عنوان العناية\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:26",
      "similarity": 0.6038463759325675
    },
    {
      "verse": "48:23",
      "similarity": 0.5929032778203981
    },
    {
      "verse": "33:62",
      "similarity": 0.578452233858877
    },
    {
      "verse": "15:13",
      "similarity": 0.576985326660951
    },
    {
      "verse": "35:43",
      "similarity": 0.49234941481971906
    }
  ]
}