{
  "chapter": "الإسراء",
  "text": "قل لئن اجتمعت الانس والجن على ان ياتوا۟ بمثل هذا القرءان لا ياتون بمثله ولو كان بعضهم لبعض ظهيرا",
  "translations": [
    {
      "translation": "Say: 'If both men and jinn banded together to produce the like of this Qur'an, they could never produce anything like it, even if they backed each other up.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Surely if men and jinns get together to produce the like of this (Qur'an), they will not be able to produce the like of it, however they might assist one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Surely, if mankind and jinn were to get together to produce the like of this Qur'an, they will never be able to produce the like of it, howsoever they might help one another.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If all human beings and jinn were to come together to bring the equivalent of this Quran, they could not do so, even if they all were to help each other.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “If all mankind and jinns agree to bring an equivalent to the Qur’an, they will not be able to bring its equal – even if they were to help each other.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If mankind and the Jinn were together to produce the like of this Qur'an, they could not produce the like thereof, even if they helped one another.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If men and jinn should combine together to bring the like of this Quran, they could not bring the like of it, though some of them were aiders of others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If men and jinn banded together to produce the like of this Koran, they would never produce its like, not though they backed one another.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Verily, though mankind and the jinn should assemble to produce the like of this Qur'an, they could not produce the like thereof though they were helpers one of another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If all men and jinn gathered together to produce the like of this Quran, they could not produce one like it, however much they helped one another.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: if the mankind and the jinn leagued together that they might produce the like of this Qur'an, they could nor produce the like thereof, though one to the other were a backer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Should all humans and jinn rally to bring the like of this Quran, they will not bring its like, even if they assisted one another.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If the whole of mankind and Jinns were to gather together to produce the like of this Qur'an, they could not produce the like thereof, even if they backed up each other with help and support.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If the mankind and the jinns were together to produce the like of this Quran, they could not produce the like thereof, even if they helped one another.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If mankind and jinn combined together to produce the like of this Koran, they would never be able to produce one like it, not even if they were to help one another'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If mankind and jinn came together to produce the like of this Quran, they could never produce the like of it, even if they backed up one another.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If mankind and the jinn gathered in order to produce the like of this Qur'an, they could not produce the like of it, even if they were to each other assistants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:88] Say: ‘Verily, should mankind and jinn come together to produce the like of this Qur’ān, [the like thereof] in terms of clarity and rhetorical excellence, they could not produce the like thereof, even if they backed one another’, [even if one was] an assistant [of the other]. This [verse] was revealed as a refutation of their statement: ‘If we wish we can speak the like of this’ [Q. 8:31].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to the people of Mecca: (Verily, though mankind and the jinn should assemble to produce the like of this Qur'an) conveying therein commands and prohibitions, promises and threats, abrogating and abrogated verses, clear and ambiguous verses and the events of the past and of the future, (they could not produce the like thereof though they were helpers one of another).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قل لئن اجتمعت الإنس والجنّ على أن يأتوا بمثل هذا القرآن لا يأتون بمثله } لكون الاستعداد الكامل الحامل له مخصوصاً بك وأنت قطب العالم يرشح إليهم ما يطفح منك فلا يمكنهم الإتيان بمثله ولا يطيقون حمله، ولهذا المعنى أبى أكثرهم { إلا كفوراً } واقترحوا الآيات الجسمانية المناسبة لاستعدادهم وإدراكهم كتفجير العيون من الأرض وجنّة النخيل والأعناب وإسقاط السماء عليهم كسفاً والرقي فيها والإتيان بالملائكة وسائر الممتنعات المتخيلة وأجيبوا بقوله:  { قل لو كان في الأرض ملائكة يمشون مطمئنين } أي: ما أمكن نزول الملائكة مع كونهم نفوساً مجرّدة على الهيئة الملكية في الأرض، بل لو نزلت لم ينزلوا إلا متجسدين، كما قال:\n\n[الأنعام، الآية: 9] وإلا لم يمكنكم إدراكهم فبقيتم على إنكاركم، وإذا كانوا مجسدين ما صدّقتم كونهم ملائكة فشأنكم الإنكار على الحالين بل على أيّ حال كان كإنكار الخفاش ضوء الشمس\n { ومن يهد الله } بمقتضى العناية الأزلية في الفطرة الأولى بنوره { فهو المهتد } خاصة دون غيره { ومن يضلل } بمنع ذلك النور عنه { فلن تجد لهم } أنصاراً يهدونه { من دونه } أو يحفظونه من قهره { ونحشرهم يوم القيامة على وجوههم } أي: ناكسي الرؤوس لانجذابهم إلى الجهة السفلية أو على وجوداتهم وذواتهم التي كانوا عليها في الدنيا كقوله: \" كما تعيشون تموتون، وكما تموتون تبعثون \" إذ الوجه يعبر به عن الذات الموجودة مع جميع عوارضها ولوازمها أي على الحالة الأولى من غير زيادة ونقصان { عمياً } عن الهدى، كما كانوا في الحياة الأولى { وبكماً } عن قول الحق، لعدم إدراكهم المعنى المراد بالنطق إذ ليسوا ذوي قلوب يفهم بها ويفقه، فكيف التعبير عما لم يفهم { وصمّاً } عن سماع المعقول، لعدم الفهم أيضاً، فلا يؤثر فيهم موجب الهداية لا من جهة الفهم من الله تعالى بالإلهام ولا من طريق السمع من كلام الناس ولا من طريق البصر بالاعتبار { كلما خبت زدناهم سعيراً } كقوله:\n",
      "translations": [
        {
          "translation": "\n{ Say, \"If all humanity and the jinn gathered in order to produce the like of this Qur'an, they could not produce the like of it, even if they were to each other assistants.\" } This is because the complete, perfect, and enduring knowledge that it contains is from You. You are the originator of the world, and from You emanate all things. So they are unable to produce something like it, nor can they even equal it.,\nAnd for this reason, most of them refused {except as a lie}. And they suggested the appropriate physical verses to prepare and realize them as the explosion of eyes from the ground, the heaven of the palm tree and the grapes, and the fall of the sky on them like a thick fog, and the rain in it, and the coming of the angels and other imaginary things. And they answered with his saying: {Say, if there were on the earth angels, walking in peace}. That is, the angels could not descend with them being mere spiritual beings on the royal status on earth.,\n\nBut if I had come down, they would not have come down except in a state of submission.,\n\nHe said:\n\n\nThe livestock, {And if you are not able to} recognize them, {then you will remain upon your disbelief}.,\n{And if they had been corporeal, you would not have believed that they were angels. So your disbelief in them now is like your disbelief in the { bats } when they are in the light of the sun.}\n\n Whoever God {guides} with the necessary care in the first {light} of His guidance, {he is the guided one}, specifically without anyone else. Whoever {leads astray} by preventing that {light} from reaching him, {you will not find} for him any supporters who could {guide} him {outside of Him}, or who could protect him from His {wrath}. We will gather them on the Day of Resurrection, {on their faces}, either: their noses being dragged along the ground because of their attraction to the lower {direction}, or {on their faces} and {bodies}, those {faces and bodies} with which they lived in this world, as in His saying: \"As you live, so will you die.\",\nAnd just as you die, you are resurrected \"for the face expresses the self with all its accompaniments and belongings, in the first instance without increase or decrease {blindly} from guidance.,\n\nAs they were in the first life, { and by the same token } according to the Truth's saying., They are unaware of the meaning of what they are saying because they do not have hearts that understand with.,\n\nHow can one express that which is incomprehensible, except by hearing the rational?,\n\nThis phrase also means \"lack of understanding.\",\n\nThis does not affect them, the guidance from Allah, neither in terms of understanding from Allah by inspiration, nor through hearing the speech of people, nor through seeing with the eyes {whenever we turn them away, they only return more defiantly}. As He says:",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما قال بعض المعاندين من الكفار الطاعنين في القرآن لو شئنا لقلنا مثل هذا القرآن الذي جئت به يا محمد، ونسبتَه إلى الله افتراء، نَزَل: { قُل } لهم يا أكمل الرسل في جوابهم مقسماً مؤكداً: والله { لَّئِنِ ٱجْتَمَعَتِ ٱلإِنْسُ وَٱلْجِنُّ } واتفقوا معارضين { عَلَىٰ أَن يَأْتُواْ بِمِثْلِ هَـٰذَا ٱلْقُرْآنِ } الجامع لأحوال النشأتين، الواقع في أعلى مراتب البلاغة والفصاحة لما حصل لهم الإيتان بمثله وهم فرادى، بل { لاَ يَأْتُونَ بِمِثْلِهِ } في الجامعية والبلاغية، واتساق اللفظ والمعنى، ومتانة النظم والفحوى { وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيراً } [الإسراء: 88] أي: ولو كا نوا متظاهرين متعاضدين في إتيانه، لم يتأت أيضاً منهم الإتيان، لكونه خارجاً عن طوق البشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو منقطعًا، أي: لو شئنا لذهبنا بالقرآن، لكن رحمة من ربك تمسكه من الذهاب، و { لا يأتون }: جواب القسم الدال عليه اللام الموطئة، وسد مسد جواب الشرط\n ولولا اللام لكان جوابًا للشرط، ولم يُجزَمْ لكون الشرط ماضيًا، كقول زهير:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:17",
      "similarity": 0.430189135397231
    },
    {
      "verse": "69:44",
      "similarity": 0.37380631173065276
    },
    {
      "verse": "39:27",
      "similarity": 0.3671240232313419
    },
    {
      "verse": "30:58",
      "similarity": 0.31558865859071755
    },
    {
      "verse": "28:48",
      "similarity": 0.31274431868035474
    }
  ]
}