{
  "chapter": "الإسراء",
  "text": "وقل رب ادخلنى مدخل صدق واخرجنى مخرج صدق واجعل لى من لدنك سلطنا نصيرا",
  "translations": [
    {
      "translation": "Say: 'My Lord, make my entry sincere and make my leaving sincere and grant me supporting authority direct from Your Presence.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And pray: \"O my Lord, let my entry be with honour, and let my exit be with honour, and grant me power from You which would help (sustain) me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And pray: \"My Lord! Cause me to enter wherever it be, with Truth, and cause me to exit, wherever it be, with Truth, and support me with authority from Yourself.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"Lord, make me enter through a path that will lead to the Truth and come out of an exit that will take me to the Truth. Give me helpful authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And pray, “My Lord! Admit me with the truth and take me out with the truth*, and give me from Yourself a helpful dominance**.” (* Wherever I come or go ** Through spread of Islam.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"My Lord! Let my entry be good, and (likewise) my exit be good. And grant me from You a helping authority,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: My Lord! make me to enter a goodly entering, and cause me to go forth a goodly going forth, and grant me from near Thee power to assist (me).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: 'My Lord, lead me in with a just ingoing, and lead me out with a just outgoing; grant me authority from Thee, to help me.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: My Lord! Cause me to come in with a firm incoming and to go out with a firm outgoing. And give me from Thy presence a sustaining Power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Lord, grant me an honourable entrance and an honourable exit, and sustain me with Your power.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say thou: O my Lord! cause me to enter a rightful entrance and cause me to go forth with a rightful outgoing, and appoint for me from before Thee an authority helpful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, ‘My Lord! ‘Admit me with a worthy entrance, and bring me out with a worthy departure, and render me a favourable authority from Yourself.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O my Lord! Let my entry be by the Gate of Truth and Honour, and likewise my exit by the Gate of Truth and Honour; and grant me from Thy Presence an authority to aid (me).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say (O Muhammad SAW): My Lord! Let my entry (to the city of Al-Madinah) be good, and likewise my exit (from the city of Makkah) be good. And grant me from You an authority to help me (or a firm sign or a proof).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Lord, grant me an entrance of sincerity and an exit of sincerity, and give me from Yours a victorious power'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, “My Lord, lead me in through an entry of truth, and lead me out through an exit of truth, and grant me from You a supporting power.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, \"My Lord, cause me to enter a sound entrance and to exit a sound exit and grant me from Yourself a supporting authority.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:80] And say: ‘My Lord, make me enter, Medina, with a veritable entrance, an entrance that is satisfying, one in which I do not see what I dislike, and bring me out, of Mecca, with a veritable departure, a departure such that my heart will not [care to] turn back to look at it [yearningly]. And grant me from Yourself a favourable authority’, [grant me] strength with which You render me victorious over Your enemies.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And say: My Lord!) my Lord! (Cause me to come in with a firm incoming) he says: cause me to come to Medina with a firm incoming, he said this when he was leaving Medina (and to go out) of Medina (with a firm outgoing) after staying there and cause me to enter Mecca; it is also said that this means: cause me to come in the grave with a firm incoming, and cause me to come out of the grave on the Day of Judgement with a firm outgoing. (And give me from Your presence) from You (a sustaining Power) a help that is free of abasement or rejection.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ } معناه بالرّسالةِ والنُبوةِ\n وقالَ: في الإِسلامِ\n وقالَ: فِي جَميعِ مَا أرسلتَني من أَمرِكَ\n وأَخرِجْني كَذِلكَ\n\n\n\n\nوقوله تعالى: { وَٱجْعَل لِّي مِن لَّدُنْكَ سُلْطَاناً نَّصِيراً } معناهُ حُجةٌ ثَابتَةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Enter me into the city of truth, and bring me out of the city of falsehood\" - this refers to His message and His Prophethood.\n\n\nAnd he said: \"In Islam...\"\n And he said, \"In all that you have sent me from your command.\"\n\n\nAnd make me come out like that.\n\n\nAnd His saying, \"Make me a ruler from Your side, a helper,\" is a clear proof.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتيسيره على ما وصلت من المقامات العلية والمراتب السنية { قُل } مناجياً إلى ربك ملتجئاً نحوه طالبَ التمكن والتقرر في المقام الذي وصلت إليه بتوفيقه وتأييده: { رَّبِّ } يا من رباني بأنواع اللطف والكرم { أَدْخِلْنِي } بفضلك وجودك { مُدْخَلَ صِدْقٍ } ومنزلَ قرارٍ\n وهو مقر التوحيد المسقط لأنواع الإضافات والكثرات\n وخلدني فيه لا تذبذبٍ وتلوينٍ { وَأَخْرِجْنِي } عن مقتضيات أنانيتي وهويتي إلى فضاء الفناء الموصل إلى شرف البقاء واللقاء { مُخْرَجَ صِدْقٍ } بلا تلعثمٍ ونزلزلٍ { وَٱجْعَل لِّي } حين معارضة أنانيتي معي واستيلاء أمَّارتي عليَّ { مِن لَّدُنْكَ سُلْطَاناً } أي: برهاناً قاطعاً وكشفاً صريحاً وشهوداً تاماً\n ليكون { نَّصِيراً } [الإسراء: 80] لمن ينصرني على أعدائي\n ويخلصني من أيديهم حين هجومهم عليَّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وقل } يا محمد: { ربِّ أَدْخلني } في الأمور كلها { مُدْخلَ صدقٍ } بأن أدخل فيها بك لا بنفسي\n { وأَخرجني } منها { مُخرجَ صدقٍ } كذلك\n مصحوبًا بالفهم عنك\n والإذن منك في إدخالي وإخراجي\n وقيل: أدخلني قبري مدخل صدق راضيًا مرضيًا\n وأخرجني منه عند البعث مخرج صدق\n أي: إخراجًا مرضيًا مُلقى بالكرامة\n فيكون تلقينًا للدعاء بما وعده من البعث\n المقرون بالإقامة للمقام المحمود\n التي لا كرامة فوقها\n وقيل: المراد: إدخال المدينة\n والإخراج من مكة\n وقيل: إدخاله - عليه الصلاة والسلام - مكة ظاهرًا عليها\n وإخراجه منها آمنًا من المشركين\n وقيل: إدخاله الغار\n وإخراجه منه سالمًا\n وقيل: إدخاله فيما حمله من أعباء الرسالة\n وإخراجه منه مؤديًا حقه\n وقيل: إدخاله في كل ما يلائمه من مكان أو أمر\n وإخراجه منه بالحفظ والرعاية\n بحيث يدخل بالله ويخرج بالله\n وهو الراجح كما قدمناه\n { واجعل لي من لدنك } أي: من مستبْطَن أمورك\n { سُلطانًا نصيرًا } أي حجة ظاهرة\n تنصرني على من يخالفني ويعاديني\n أو: عزًا ناصرًا للإسلام\n مظهرًا له على الكفر\n فأجيبتْ دعوته - عليه الصلاة والسلام - بقوله:\n[المائدة: 56]\n\n[التّوبَة: 33]\n\n[النُّور: 55] الآية\n وبقوله:\n[الصَّافات: 171\n 172] الآية\n وذلك حين يظهر الحق\n ويزهق الباطل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:67",
      "similarity": 0.5908478478084841
    },
    {
      "verse": "18:65",
      "similarity": 0.5769279374169061
    },
    {
      "verse": "27:6",
      "similarity": 0.5765168821558808
    },
    {
      "verse": "11:1",
      "similarity": 0.501048529473849
    },
    {
      "verse": "4:75",
      "similarity": 0.48509725684230776
    }
  ]
}