{
  "chapter": "الإسراء",
  "text": "ولئن شئنا لنذهبن بالذى اوحينا اليك ثم لا تجد لك به علينا وكيلا",
  "translations": [
    {
      "translation": "If We wished We could take away what We have revealed to you and then you would not find any to guard you from Us -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We pleased We could take away what We have revealed to you. Then you will not find any one to plead for it with Us,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We willed, We could take away what We have revealed to you, then you would find none to help you in recovering it from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We wanted, We could have removed the Spirit through whom We sent you revelation. Then you would not have found anyone to intercede with Us for you\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We willed We could have taken away the revelations which We have sent to you – you would then not find anyone who could advocate for you before Us for this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We willed, We could surely take away that which We have revealed to you. Then you would find no protector for you against Us in that respect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We please, We should certainly take away that which We have revealed to you, then you would not find for it any protector against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We willed, We could take away that We have revealed to thee, then thou wouldst find none thereover to guard thee against Us,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We willed We could withdraw that which We have revealed unto thee, then wouldst thou find no guardian for thee against Us in respect thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We pleased, We would certainly take away that which We have revealed to you, then you would find no guardian for you against Us,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We listed, We could surely take away that which We have revealed unto thee: then thou wilt not find in respect thereof against us as trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We wish, We would take away what We have revealed to you. Then you would not find for yourself any defender against Us,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If it were Our Will, We could take away that which We have sent thee by inspiration: then wouldst thou find none to plead thy affair in that matter as against Us,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We willed We could surely take away that which We have revealed to you by inspiration (i.e. this Quran). Then you would find no protector for you against Us in that respect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We pleased We could take away that which We have revealed to you then you should find none to guard you against Us,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We willed, We could take away what We revealed to you. Then you will find for yourself no protecting guardian against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We willed, We could surely do away with that which We revealed to you. Then you would not find for yourself concerning it an advocate against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:86] And if (la-in, the lām is for oaths) We willed We could take away what We have revealed to you, in other words, [take away] the Qur’ān, by erasing it from the hearts [of men] and from the written copies. Then you would not find in respect thereof any guardian for yourself against Us;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if We willed We could withdraw that which We have revealed unto thee) We could keep away that with which We have sent Gabriel to inspire you, (then wouldst thou find no guardian) and it is said that this means: no helper (for thee against Us in respect thereof).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لحككناه من المصاحف ومحوناه من الصدور والخواطر { ثُمَّ } بعد إذهابنا ومحونا { لاَ تَجِدُ لَكَ بِهِ عَلَيْنَا وَكِيلاً } [الإسراء: 86] أي: لا تجد ظهيراً مُعيناً لك يطالبنا بمجيئه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال ابن جزي: هذه الآية متصلة المعنى بقوله: { وما أُوتيتم من العلم إلا قليلاً } أي: في قدرتنا أن نذهب بالذي أوحينا إليك، فلا يبقى عندكم شيء من العلم\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:62",
      "similarity": 0.3838778530824255
    },
    {
      "verse": "64:13",
      "similarity": 0.3801275934253835
    },
    {
      "verse": "6:102",
      "similarity": 0.3717936412871601
    },
    {
      "verse": "4:133",
      "similarity": 0.37044718900234513
    },
    {
      "verse": "17:54",
      "similarity": 0.37038580289418505
    }
  ]
}