{
  "chapter": "الإسراء",
  "text": "ويسـلونك عن الروح قل الروح من امر ربى وما اوتيتم من العلم الا قليلا",
  "translations": [
    {
      "translation": "They will ask you about the Ruh. Say: 'The Ruh is my Lord's concern. You have only been given a little knowledge.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about revelation. Say, revelation is by the command of your Lord, and that you have been given but little knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about \"the spirit\". Say: \"The spirit descends by the command of my Lord, but you have been given only a little knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Spirit. Say, \"The Spirit comes by the command of my Lord. You have been given very little knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning the soul; proclaim “The soul is an entity by the command of my Lord, and you have not received knowledge except a little.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you concerning the Ruh (the spirit). Say: \"The Ruh (the spirit) is one of the things, the knowledge of which is only with my Lord. And of knowledge, you (mankind) have been given only a little.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you about the soul. Say: The soul is one of the commands of my Lord, and you are not given aught of knowledge but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee concerning the Spirit. Say: 'The Spirit is of the bidding of my Lord. You have been given of knowledge nothing except a little.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are asking thee concerning the Spirit. Say: The Spirit is by command of my Lord, and of knowledge ye have been vouchsafed but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question you about the Spirit. Say, \"The Spirit is at my Lord's command, and you have been granted but little knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask thee regarding the spirit, Say thou: the spirit is by the command of my Lord, and ye have not been vouchsafed of knowledge save a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question you concerning the Spirit. Say, ‘The Spirit is of the command of my Lord, and you have not been given of the knowledge except a few [of you].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee concerning the Spirit (of inspiration). Say: \"The Spirit (cometh) by command of my Lord: of knowledge it is only a little that is communicated to you, (O men!)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you (O Muhammad SAW) concerning the Ruh (the Spirit); Say: \"The Ruh (the Spirit): it is one of the things, the knowledge of which is only with my Lord. And of knowledge, you (mankind) have been given only a little.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question you about the spirit. Say: 'The spirit is from the command of my Lord. Except for a little knowledge you have been given nothing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you about the Spirit. Say, “The Spirit belongs to the domain of my Lord; and you were given only little knowledge.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you, [O Muhammad], about the soul. Say, \"The soul is of the affair of my Lord. And mankind have not been given of knowledge except a little.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:85] And they will question you, that is, the Jews, concerning the Spirit, from which the body receives life. Say, to them: ‘The Spirit is of the command of my Lord, that is, [it belongs to] His knowledge, about which you know not. And of knowledge you have not been given except a little’, relative to His knowledge, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقْعُ هذه الآية بين الآي التي معها يقتضي نظمُه أن مرجع ضمير { يسألونك } هو مرجع الضمائر المتقدمة ، فالسائلون عن الروح هم قريش . وقد روى الترمذي عن ابن عباس قال : قالت قريش ليهود أعطونا شيئاً نسأل هذا الرجل عنه ، فقالوا : سَلوه عن الروح ، قال : فسألوه عن الروح ، فأنزل الله تعالى : { ويسألونك عن الروح } الآية .وظاهر هذا أنهم سألوه عن الروح خاصة وأن الآية نزلت بسبب سؤالهم . وحينئذٍ فلا إشكال في إفراد هذا السؤال في هذه الآية على هذه الرواية . وبذلك يكون موقع هذه الآية بين الآيات التي قبلها والتي بعدها مسبباً على نزولها بين نزول تلك الآيات .واعلم أنه كان بين قريش وبين أهل يثرب صلات كثيرة من صهر وتجارة وصحبة . وكان لكل يثربي صاحب بمكة ينزل عنده إذا قدم الآخر بلده ، كما كان بين أمية بن خلف وسَعْد بن معاذ . وقصتهما مذكورة في حديث غزوة بدر من { صحيح البخاري}.روى ابن إسحاق أن قريشاً بعثوا النضر بن الحارث ، وعقبة بن أبي مُعيط إلى أحبار اليهود بيثرب يسألانهم عن أمر النبي صلى الله عليه وسلم فقال اليهود لهما : سلوه عن ثلاثة . وذكروا لهم أهل الكهف وذا القرنين وعن الروح كما سيأتي في سورة الكهف ، فسألتْه قريش عنها فأجاب عن أهل الكهف وعن ذي القرنين بما في سورة الكهف ، وأجاب عن الروح بما في هذه السورة .وهذه الرواية تثير إشكالاً في وجه فصل جواب سؤال الروح عن المسألتين الأخريين بذكر جواب مسألة الروح في سورة الإسراء وهي متقدمة في النزول على سورة الكهف .ويدفع الإشكال أنه يجوز أن يكون السؤال عن الروح وقع منفرداً أول مرة ثم جمع مع المسألتين الأخريين ثاني مرة .ويجوز أن تكون آية سؤال الروح مما ألحق بسورة الإسراء كما سنبينه في سورة الكهف . والجمهور على أن الجميع نزل بمكة ، قال الطبري عن عطاء بن يسار : نزل قوله : { وما أوتيتم من العلم قليلاً } بمكة .وأما ما روي في «صحيح البخاري» عن ابن مسعود أنه قال : «بينما أنا مع النبي في حرث بالمدينة إذ مر اليهود فقال بعضهم لبعض سلوه عن الروح ، فسألوه عن الروح فأمسك النبي صلى الله عليه وسلم فلم يردّ عليهم شيئاً ، فعلمتُ أنه يوحى إليه ، فقمت مقامي ، فلما نزل الوحي قال : { ويسألونك عن الروح } الآية . فالجمع بينه وبين حديث ابن عباس المتقدم : أن اليهود لما سألوا النبي صلى الله عليه وسلم قد ظن النبي أنهم أقرب من قريش إلى فهم معنى الروح فانتظر أن ينزل عليه الوحي بما يجيبهم به أبين مما أجاب به قريشاً ، فكرر الله تعالى إنزال الآية التي نزلت بمكة أو أمره أن يتلوها عليهم ليعلم أنهم وقريشاً سواء في العجز عن إدراك هذه الحقيقة أو أن الجواب لا يتغير .هذا ، والذي يترجح عندي : أن فيما ذكره أهلُ السير تخليطاً ، وأن قريشاً استقوا من اليهود شيئاً ومن النصارى شيئاً فقد كانت لقريش مخالطة مع نصارى الشام في رحلتهم الصيفية إلى الشام ، لأن قصة أهل الكهف لم تكن من أمور بني إسرائيل وإنما هي من شؤون النصارى ، بناءً على أن أهل الكهف كانوا نصارى كما سيأتي في سورة الكهف ، وكذلك قصة ذي القرنين إن كان المراد به الإسكندر المقدوني يظهر أنها مما عني به النصارى لارتباط فتوحاته بتاريخ بلاد الروم ، فتعين أن اليهود ما لَقنوا قريشاً إلا السؤال عن الروح . وبهذا يتضح السبب في إفراد السؤال عن الروح في هذه السورة وذكر القصتين الأخريين في سورة الكهف . على أنه يجوز أن يتكرر السؤال في مناسبات وذلك شأن الذين معارفهم محدودة فهم يلقونها في كل مجلس .وسُؤالهم عن الروح معناه أنهم سألوا عن بيان ماهية ما يعبر عنه في اللغة العربية بالروح والتي يعرف كل أحد بوجه الإجمال أنها حالّة فيه .والروح : يطلق على الموجود الخفي المنتشر في سائر الجسد الإنساني الذي دلت عليه آثاره من الإدراك والتفكير ، وهو الذي يتقوم في الجسد الإنساني حين يكون جنيناً بعد أن يمضي على نزول النطفة في الرحم مائة وعشرون يوماً . وهذا الإطلاق هو الذي في قوله تعالى : { فإذا سويته ونفخت فيه من روحي } \\[ ص : 72 \\]. وهذا يسمى أيضاً بالنفس كقوله : { يا أيتها النفس المطمئنة } \\[ الفجر : 27 \\].ويطلق الروح على الكائن الشريف المكون بأمر إلهي بدون سبب اعتيادي ومنه قوله تعالى : { وكذلك أوحينا إليك روحاً من أمرنا } \\[ الشورى : 52 \\] وقوله : { وروح منه } \\[ النساء : 171 \\].ويطلق لفظ ( الروح ) على المَلك الذي ينزل بالوحي على الرسل . وهو جبريل عليه السلام ومنه قوله : { نزل به الروح الأمين على قلبك } \\[ الشعراء : 193 \\].واختلف المفسرون في الروح المسؤول عنه المذكور هنا ما هو من هذه الثلاثة . فالجمهور قالوا : المسؤول عنه هو الروح بالمعنى الأول ، قالوا لأنه الأمر المشكل الذي لم تتضح حقيقته ، وأما الروح بالمعنيين الآخرين فيشبه أن يكون السؤال عنه سؤالاً عن معنى مصطلح قرآني . وقد ثبت أن اليهود سألوا عن الروح بالمعنى الأول لأنه هو الوارد في أول كتابهم وهو سفر التكوين من التوراة لقوله في الإصحاح الأول وروح الله يرف على وجه المياه . وليس الروح بالمعنيين الآخرين بوارد في كتبهم .وعن قتادة والحسن : أنهم سألوا عن جبريل ، والأصح القول الأول . وفي { الروض الأنف } أن النبي صلى الله عليه وسلم أجابهم مرة ، فقال لهم : هو جبريل عليه السلام . وقد أوضحناه في سورة الكهف .وإنما سألوا عن حقيقة الروح وبيان ماهيتها ، فإنها قد شغلت الفلاسفة وحكماء المتشرعين ، لظهور أن في الجسد الحي شيئاً زائداً على الجسم ، به يكون الإنسان مدركاً وبزواله يصير الجسم مسلوبَ الإرادة والإدراك ، فعلم بالضرورة أن في الجسم شيئاً زائداً على الأعضاء الظاهرة والباطنة غير مشاهد إذ قد ظهر بالتشريح أن جسم الميت لم يفقد شيئاً من الأعضاء الباطنة التي كانت له في حال الحياة .وإذ قد كانت عقول الناس قاصرة عن فهم حقيقة الروح وكيفية اتصالها بالبدن وكيفية انتزاعها منه وفي مصيرها بعد ذلك الانتزاع ، أجيبوا بأن الروح من أمر الله ، أي أنه كائن عظيم من الكائنات المشرفة عند الله ولكنه مما استأثر الله بعلمه . فلفظ { أمر } يحتمل أن يكون مرادف الشيء . فالمعنى : الروح بعض الأشياء العظيمة التي هي لله ، فإضافة { أمر } إلى اسم الجلالة على معنى لام الاختصاص ، أي أمر اختص بالله اختصاص علممٍ .و ( من ) للتبعيض ، فيكون هذا الإطلاق كقوله : { وكذلك أوحينا إليك روحاً من أمرنا } \\[ الشورى : 52 \\]. ويحتمل أن يكون الأمر أمرَ التكوين ، فإما أن يراد نفس المصدر وتكون ( من ) ابتدائية كما في قوله : { إنما قولنا لشيء إذا أردناه أن نقول له كن فيكون } \\[ النحل : 40 \\] ، أي الروح يصدر عن أمر الله بتكوينه؛ أو يراد بالمصدر معنى المفعول مثل الخلق و ( من ) تبعيضية ، أي الروح بعض مأمورات الله فيكون المرادُ بالروح جبريلَ عليه السلام ، أي الروح من المخلوقات الذين يأمرهم الله بتبليغ الوحي ، وعلى كلا الوجهين لم تكن الآية جواباً عن سؤالهم .وروى ابن العربي في الأحكام عن ابن وهب عن مالك أنه قال : لم يأته في ذلك جواب ا ه . أي أن قوله : قل الروح من أمر ربي } ليس جواباً ببيان ما سألوا عنه ولكنه صرف عن استعلامه وإعلام لهم بأن هذا من العلم الذي لم يؤتوه . والاحتمالات كلها مرادة ، وهي كلمة جامعة . وفيها رمز إلى تعريف الروح تعريفاً بالجنس وهو رسم .وجملة { وما أوتيتم من العلم إلا قليلاً } يجوز أن تكون مما أمَر الله رسولَه أن يقوله للسائلين فيكون الخطاب لقريش أو لليهود الذين لقنوهم ، ويجوز أن يكون تذييلاً أو اعتراضاً فيكون الخطاب لكل من يصلح للخطاب ، والمخاطبون متفاوتون في القليل المستثنى من المؤْتَى من العلم . وأن يكون خطاباً للمسلمين .والمراد بالعلم هنا المعلوم ، أي ما شأنه أن يعلم أو من معلومات الله . ووصفه بالقليل بالنسبة إلى ما من شأنه أن يعلم من الموجودات والحقائق .وفي «جامع الترمذي» قالوا ( أي اليهود ) : «أوتينا علماً كثيراً التوراةَ ومن أوتي التوراة فقد أوتي خيراً كثيراً ، فأنزلت : { قل لو كان البحر مداداً لكلمات ربي لنفد البحر قبل أن تنفد كلمات ربي } الآية \\[ الكهف : 109 \\].وأوضح من هذا ما رواه الطبري عن عطاء بن يسار قال : نزلت بمكة وما أوتيتم من العلم إلا قليلاً } ، فلما هاجر رسول الله صلى الله عليه وسلم إلى المدينة أتاه أحبار يهود فقالوا : يا محمد ألم يبلغنا أنك تقول : { وما أوتيتم من العلم إلا قليلاً } ، أفعنيتنا أم قومَك؟ قال : كُلاّ قد عنيت .قالوا : فإنك تتلو أنا أوتينا التوراة وفيها تبيان كل شيء . فقال رسول الله : هي في علم الله قليل ، وقد آتاكم ما إن عملتم به انتفعتم . فأنزل الله { ولو أن ما في الأرض من شجرة أقلام والبحر يمده من بعده سبعة أبحر ما نفدت كلمات الله إن الله عزيز حكيم } \\[ لقمان : 27 \\].هذا ، والذين حاولوا تقريب شرح ماهية الروح من الفلاسفة والمتشرعين بواسطة القول الشارح لم يأتوا إلا برسوم ناقصة مأخوذة فيها الأجناس البعيدة والخواص التقريبية غير المنضبطة وتحكيم الآثار التي بعضها حقيقي وبعضها خيالي ، وكلها متفاوتة في القرب من شرح خاصاته وأماراته بحسب تفاوت تصوراتهم لماهيته المبنيات على تفاوت قوى مداركهم وكلها لا تعدو أن تكون رسوماً خيالية وشعرية معبرة عن آثار الروح في الإنسان .وإذا قد جرى ذكر الروح في هذه الآية وصُرف السائلون عن مرادهم لغرض صحيح اقتضاه حالهم وحال زمانهم ومكانهم ، فما علينا أن نتعرض لمحاولة تعرف حقيقة الروح بوجه الإجمال فقد تهيأ لأهل العلم من وسائل المعرفة ما تغيرت به الحالة التي اقتضت صرف السائلين في هذه الآية بعض التغير ، وقد تتوفر تغيرات في المستقبل تزيد أهل العلم استعداداً لتجلي بعض ماهية الروح ، فلذلك لا نجاري الذين قالوا : إن حقيقة الروح يجب الإمساك عن بيانها لأن النبي أمسك عنها فلا ينبغي الخوض في شأن الروح بأكثر من كونها موجودة . فقد رأى جمهور العلماء من المتكلمين والفقهاء منهم أبو بكر بن العربي في العواصم } ، والنووي في «شرح مسلم» : أن هذه الآية لا تصد العلماء عن البحث عن الروح لأنها نزلت لطائفة معينة من اليهود ولم يقصد بها المسلمون . فقال جمهور المتكلمين : إنها من الجواهر المجردة ، وهو غير بعيد عن قول بعضهم : هي من الأجسام اللطيفة والأرواح حادثة عند المتكلمين من المسلمين وهو قول أرسطاليس . وقال قدماء الفلاسفة : هي قديمة . وذلك قريب من مرادهم في القول بقدم العالم . ومعنى كونها حادثة أنها مخلوقة لله تعالى . فقيل : الأرواح مخلوقة قبل خلق الأبدان التي تنفخ فيها ، وهو الأصح الجاري على ظواهر كلام النبي صلى الله عليه وسلم فهي موجودة من الأزل كوجود الملائكة والشياطين ، وقيل : تخلق عند إرادة إيجاد الحياة في البدن الذي توضع فيه واتفقوا على أن الأرواح باقية بعد فناء أجسادها وأنها تحضر يوم الحساب .\n\n",
      "translations": [
        {
          "translation": "(They will ask thee) Muhammad (concerning the Spirit) it was the people of Mecca-Abu Jahl and his host- who asked. (Say: The Spirit is by command of my Lord) the Spirit is of the marvels of my Lord; it is also said that this means: it is the restricted knowledge of my Lord, (and of knowledge) which is with Allah (ye have been vouchsafed) you have been given (but little).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَسْأَلُونَكَ عَنِ ٱلرُّوحِ قُلِ ٱلرُّوحُ مِنْ أَمْرِ رَبِّي } معناه من عِلمِ رَبّي، فإِنكُم لا تَعلمُونَهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And they ask you about the spirit. Say: The spirit is from the matter of my Lord} Its meaning is from the knowledge of my Lord, for you do not know it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويسئلونك عن الروح قل الروح من أمر ربي } أي: ليس من عالم الخلق حتى يمكن تعريفه للظاهرين البدنيين الذين لا يتجاوز إدراكهم عن الحسّ والمحسوس بالتشبيه ببعض ما شعروا به من التوصيف بل من عالم الأمر\n أي: الإبداع الذي هو عالم الذوات المجرّدة عن الهيولى والجواهر المقدّسة عن الشكل واللون والجهة والأين\n فلا يمكنكم إدراكه أيها المحجوبون بالكون لقصور إدراككم وعلمكم عنه { وما أوتيتم من العلم إلا قليلاً } هو علم المحسوسات وذلك شيء نزر حقير بالنسبة إلى علم الله تعالى والراسخين في العلم\n { ولئن شئنا لنذهبنَّ بالذي أوحينا إليك } بالطمس في محل الفناء أو الحجب بعد الكشف بالتلوين { ثم لا تجد لك به علينا وكيلاً } يتوكل علينا بردّه { إلاَّ } مجرّد رحمة عظيمة خاصة بك من فرط عنايتنا وهي أعلى مراتب الرحمة الرحيمية المتكفلة من عند الله تعالى بإفاضة الكمال التام عليه\n أي: لو تجلينا بذاتنا لما وجدت الوحي ولا ذاتك إلا إذا تجلينا بصفة الرحمة واسمنا الرحيم فتوجد وتجد الوحي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تأييداً لحبيبه صلى الله عليه وسلم وتعليماً: { وَيَسْأَلُونَكَ } يا أكمل الرسل\n فوق النصارى واليهود وجميع أهل الزيغ والضلال { عَنِ ٱلرُّوحِ } المتعلق بالأجساد المحيي لها ومحركها بالإدارة والاختيار\n وإذا انفصل وافترق عنها مات\n ولم يتحرك وانقطع الشعور والإدراك عنها\n أي: يسألونك عن لِميَّه وكيفية تعلقه وارتباطه بالأجسام\n وكيفية انفصاله عنها { قُلِ ٱلرُّوحُ } نفسه\n وكيفية تعلقه بالأجسام وكيفية انفصاله عنها كلها صادرةٌ ناشئةُ { مِنْ أَمْرِ رَبِّي } أي: مما حصل بأمره الدالّ على تكوين المكونات\n وهو قول: \" كن \" الدال على سرعة نفوذ قضائه\n\n\nوأما كمية المقضي وكيفية حصوله وانفصالهن فأمرٌ استأثر الله به في غيبه\n ولم يُطلع أحداً عليه لذلك قا ل: { وَمَآ أُوتِيتُم } يا بني آدم { مِّنَ ٱلْعِلْمِ } المتعلق بالورح { إِلاَّ قَلِيلاً } [الإسراء: 85] وهو أنيته وتحققه دون لميته وحقيقته\n لأن اطلاع الإنسان على الأشياء إنما هو بقدر قابليته واستعداده\n وليس في وسعه وطاقته أن يعلم حقيقة الخردلة وكيفية حصولها وتكونها\n فكيف حقيقة الروح\n وكيفية تعلقها في البدن\n\n\nغاية ما في الباب أن المكاشفين من أرباب الأذواق ينكشفون في البدن\n ويتفطنون منها أن ظهور الأشياء وحياتها ومنبع نشأتها ونمائها إنما هي تلك السراية\n هذا نهاية ما يمكن التكلم والتفوه عنه\n وأما الاطلاع على كنهها\n فأمرٌ لا يسعه مقدرة البشر\n\n\nثم قال سبحانه: { وَلَئِن شِئْنَا لَنَذْهَبَنَّ بِٱلَّذِي أَوْحَيْنَا إِلَيْكَ } أي: والله إن شئنا وأردنا إذاهب القرآن المرشد لقاطبة الأنام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ويسألونك عن الروح } أي: عن حقيقة الروح، الذي هو مدبر البدن الإنساني، ومبدأ حياته. رُوي أن اليهود قالوا لقريش: سلوه عن أصحاب الكهف، وعن ذي القرنين، وعن الروح، فإن أجاب عنها كلها أو سكت فليس بنبي، وإن أجاب عن بعض وسكت عن بعض فهو نبي. فبيَّن لهم القصتين وأبهم أمر الروح، وهو مبهم في التوراة، فقال: { قل الروح من أمر ربي } ، أظهر في مقام الإضمار إظهارًا لكمال الاعتناء بشرفه، أي: هو من جنس ما استأثر الله بعلمه من الأسرار الخفية، التي لا يكاد يحوم حولها عقولُ البشر. { وما أُوتيتم من العلم إِلا قليلاً } لا يمكن تعلقه بأمثال هذه الأسرار. رُوِيَ أنه صلى الله عليه وسلم لما قال لهم ذلك، قالوا: نحن مختصون بهذا الخطاب، قال عليه الصلاة والسلام: \" بل نحن وأنتم \". فقالوا: ما أعجب شأنك، ساعة تقول:\n[البَقَرَة: 269]، وتارة تقول هذا، فنزلت:\n[الكهف: 109] الآية.\n[لقمان: 27] الآية. وهذا من ركاكة عقولهم فإن من الحكمة الإنسانية أن يعلم من الخير ما تسعه الطاقة البشرية، بل ما نيط به المعاش والمعاد، وذلك بالإضافة إلى ما لا نهاية له من متعلقات علمه سبحانه، قليل ينال به خير: كثير في نفسه. وقال ابن حجر: أخرج الطبراني عن ابن عباس أنهم قالوا: أخبرنا عن الروح، وكيف تُعذب الروح في الجسد، وإنما الروح من الله؟. هـ. قلت: يُجاب بأنها لما برزت لعالم الشهادة لحقتها العبودية، وأحاطت به القهرية. وقال القشيري: أرادوا أن يُغالطُوه فيما به يجيب، فأمَرَه أن ينطق بأمرٍ يُفْصِحُ عن أقسامِ الروح، لأنَّ ما يُطْلَقُ عليه لفظ \" الروح \" يدخل تحت قوله: { قل الروح من أمر ربي } ، ثم قال: وفي الجملة: الروح مخلوقة، والحق أجرى العادة بأن يخلق الحياة للعبد، ما دام الروح في جسده، والروح لطيفة تَقرب للكثافة في طهارتها ولطافتها. وهي مخلوقة قبل الأجساد بألوفٍ من السنين. وقيل: إن أدركها التكليف، كان للروح صفاء التسبيح، ضياء المواصلة، ويُمن التعريف بالحق. هـ. وقيل: المراد بالروح خلق عظيم روحاني من أعظم الملائكة، وقيل جبريل عليه السلام، وقيل: القرآن. ومعنى { من أمر ربي } من وحيه وكلامه، لا من كلام البشر. والله تعالى أعلم بمراده. الإشارة: قد أكثر الناسُ الكلام في شأن الروح، فرأى بعضهم أن الإمساك عنها أولى لأن الرسول - عليه الصلاة والسلام - لم يجب عنها. وبيَّن الحق تعالى أنها من أمر الله وسر من أسراره. ورأى بعضهم أن النهي لم يرد عن الخوض فيها صريحًا، فتكلم على قدر فهمه.\nفقال بعضهم: حقيقة الروح: جسم لطيف مشتبك بالبدن اشتباك الماء بالعود الأرطب، وقال صاحب الرموز في فتح الكنوز على حديث:\n \" من عرف نفسه فقد عرف ربّه \" \nقد ظهر لي من سر هذا الحديث ما يجب كشفه ويستحسن وصفه، وهو: أن الله، سبحانه، وضع هذا الروح في هذه الجثة الجثمانية، لطيفة لاهوتية، في كثيفة ناسوتية، دالة على وحدانيته تعالى وربانيته، ووجه الاستدلال من عشرة أوجه: الأول: أن هذا الهيكل الإنساني لَمَّا كان مفتقرًا إلى محرك ومدبر، وهذا الروح هو الذي يدبره ويحركه، علمنا أن هذا العالم لا بد له من محرك ومدبر. الثاني: لَمَّا كان مدبر الجسد واحدًا علمنا أن مدبر هذا العالم واحد لا شريك له في تدبيره وتقديره. قال تعالى\n[الأنبياء: 22]، الثالث: لَمَّا كان لا يتحرك هذا الجسم إلا بتحريك الروح وإرادته علمنا أنه لا يتحرك بخير أو شر إلا بتحريك الله وقدرته وإرادته. الرابع: لَمَّا كان لا يتحرك في الجسد شيء إلا بعلم الروح وشعورها، لا يخفي على الروح من حركة الجسد شيء، علمنا أنه تعالى لا يعزب عنه مثقال ذرة في الأرض ولا في السماء. الخامس: لَمَّا كان هذا الجسد لم يكن فيه شيء أقرب إلى الروح من شيء علمنا أنه تعالى قريب إلى كل شيء، ليس شيء أقرب إليه من شيء، ولا شيء أبعد إليه من شيء، لا بمعنى قرب المسافة لأنه منزه عن ذلك. السادس: لَمَّا كان الروح موجودًا قبل الجسد، ويكون موجودًا بعد عدمه علمنا أنه تعالى موجود قبل خلقه، ويكون موجودًا بعد عدمهم، ما زال، ولا يزال، وتقدس عن الزوال. السابع: لَمَّا كان الروح في الجسد لا تعرف له كيفية علمنا أنه تعالى مقدس عن الكيفية. الثامن: لَمَّا كان الروح في الجسد لا تعرف له كيفية ولا أينية، بل الروح موجود في سائر الجسد، ما خلا منه شيء في الجسد. كذلك الحق سبحانه موجود في كل مكان، وتنزه عن المكان والزمان التاسع: لَمَّا كان الروح في الجسد لا يحس ولا يجس ولا يُمس، علمنا أنه تعالى منزه عن الحس والجس والمس. العاشر: لَمَّا كان الروح في الجسد لا يُدرك بالبصر، ولا يمثل بالصور، علمنا أنه تعالى لا تُدركه الأبصار، ولا يمثل بالصور والآثار، ولا يشبه بالشموس والأقمار،\n[الشورى: 11]. هـ. وحديث:\n \" من عرف نفسه... \" \nالخ، قال النووي: غير ثابت، وقال السمعاني: هو من كلام يحيى بن معاذ الرازي. والله تعالى أعلم.  وسئل أبو سعيد الخراز عن الروح، أمخلوقة هي؟ قال: نعم. ولولا ذلك لما أقرت بالربوبية حتى قالت: \" بلى \".\nقلت: لما انفصلت عن الأصل كستها أردية العبودية، فأقرت بالربوبية. وقال الورتجبي: الروح: شعاع الحقيقة، يختلف آثارها في الأجساد. قال: ومن خاصيتها أنها تميل إلى كل حسن ومستحسن، وكل صوت طيب، وكل رائحة طيبة لحسن جوهرها وروح وجودها، ظاهرها غيب الله، وباطنها سر الله، مصورة بصورة آدم. فإذا أراد الله خلق آدمي أحضر روحه، فصور صورته بصورة الروح فلذلك قال عليه الصلاة والسلام إشارة وإبهامًا:\n \" خلق الله آدم على صورته \" \nهـ. قلت: يعني: أن إظهار الروح من بحر الجبروت، في التجلي الأول، كان على صورة آدم، ثم خلق آدم على صورة الروح الأعظم، وهو التجلي الأول من بحر المعاني، فكانت أول التجليات من ذات الرحمن، فقال في حديث آخر:\n \" إن الله خلق آدم على صورة الرحمن \" \nوالله تعالى أعلم. وقيل: الصوت الطيب روحاني، ولتشاكله مع الروح، صار يهيج الروح ويحثها للرجوع لأصلها، إذا كان صاحبها له ذوق سليم، يسمع من صوت طيب كريم. سمع أبو يزيد نغمة، فقال: أجد النغم نداء منه تعالى. وقيل: إن الروح لم تدخل في جسد آدم إلا بالسماع، فصارت لا تخرج من سجنه إلا بالسماع. والله تعالى أعلم. ثمَّ بين قوله { وَمَآ أُوتِيتُم مِّنَ ٱلْعِلْمِ إِلاَّ قَلِيلاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "97:4",
      "similarity": 0.4825479245964684
    },
    {
      "verse": "26:193",
      "similarity": 0.4770084750981243
    },
    {
      "verse": "16:2",
      "similarity": 0.45155389783946837
    },
    {
      "verse": "56:89",
      "similarity": 0.43726185245936916
    },
    {
      "verse": "56:14",
      "similarity": 0.3838169610356772
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017085.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017085.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:85.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}