{
  "chapter": "الإسراء",
  "text": "ولقد صرفنا للناس فى هذا القرءان من كل مثل فابى اكثر الناس الا كفورا",
  "translations": [
    {
      "translation": "We have variegated throughout this Qur'an all kinds of examples for people, but most people spurn anything but kufr.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have given examples of every kind to men in this Qur'an in various ways, and even then most men disdain everything but unbelief,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have explained things for people in this Qur'an in diverse ways to make them understand the Message, yet most people obstinately persist in unbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have mentioned in this Quran all kinds of examples for the human being, but most human beings turn away in disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have illustrated all kinds of examples in the Qur’an for mankind – so most men did not accept, except to be ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have fully explained to mankind, in this Qur'an, every kind of similitude, but most of mankind refuse (the truth and accept nothing) but disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have explained for men in this Quran every kind of similitude, but most men do not consent to aught but denying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed turned about for men in this Koran every manner of similitude; yet most men refuse all but unbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We have displayed for mankind in this Qur'an all kind of similitudes, but most of mankind refuse aught save disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this Quran, We have set out all kinds of examples for people, yet most of them persist in denying the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have variously propounded for mankind in this Qur'an every kind of similitude, yet most men have refused everything except infidelity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have certainly interspersed this Quran with every [kind of] parable for the people, but most people are only intent on ingratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have explained to man, in this Qur'an, every kind of similitude: yet the greater part of men refuse (to receive it) except with ingratitude!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have fully explained to mankind, in this Quran, every kind of similitude, but most mankind refuse (the truth and accept nothing) but disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have set forth for mankind in this Koran every kind of parable, yet most people refuse all except disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have displayed for mankind in this Quran every kind of similitude, but most people insist on denying the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly diversified for the people in this Qur'an from every [kind] of example, but most of the people refused [anything] except disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:89]   And verily We have dispensed, explained, for people in this Qur’ān every [kind of] similitude (min kulli mathalin, [this] is an adjectival qualification of an omitted clause, in other words, [‘We have dispensed] a similitude from every kind of similitude’), that they might be admonished; but most people, that is, the people of Mecca, insist on disbelieving, on denying the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We have displayed for mankind) We have exposited for the people of Mecca (in this Qur'an all kinds or similitudes) parables of all sorts, such as threats and promises, (but most of mankind refuse aught save disbelief) they refused to submit and remained firm in their disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ صَرَّفْنَا لِلنَّاسِ } يعني وَجّهنَا وبيّنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الله { لَقَدْ صَرَّفْنَا } وكررنا { لِلنَّاسِ فِي } حق { هَـٰذَا ٱلْقُرْآنِ } المعجز لفظاً ومعنىً { مِن كُلِّ مَثَلٍ } موضحٍ لهم إعجازه، وخروجه عن معرض معارضة البشر، وارتفاع شأنه عن القدح والطعن فيه { فَأَبَىٰ أَكْثَرُ ٱلنَّاسِ } وامتنعوا عن قبوله، ولم يتفطنوا لإعجازه، ولم يزيدوا في حقه مع ظهور الدلائل والشواهد المكررة { إِلاَّ كُفُوراً } [الإسراء: 89] جحوداً وإنكاراً بدل القبول واليقين بحقيته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nو { إلا كفورًا }: استثناء مفرغ منصوب بأَبَى لأنه في معنى النفي، أي: ما رضي أكثرهم إلا الكفر به\n يقول الحقّ جلّ جلاله: { ولئنْ شئنا لنَذْهَبَنَّ بالذي أوْحَينا إِليك } أي: بالقرآن الذي هو منبع العلوم التي أُوتيتموها، ومقتبس الأنوار، فلا يبقى عندكم من العلم إلا قليلاً\n والمراد بالإذهاب: المحو من المصاحف والصدور\n وعن ابن مسعود رضي الله عنه: أول ما تفقدون من دينكم: الأمانة، وآخر ما تفقدون الصلاة، وليصلين قوم ولا دين لهم\n وإن هذا القرآن تصبحون يومًا وما فيكم منه شيء\n فقال رجل: كيف ذلك، وقد أثبتناه في قلوبنا، ودونّاه في مصاحفنا، وعلمناه أبناءنا، وأبناؤنا يعلمه أبناءهم؟! فقال: يسري عليه، ليلاً، فيُصبح الناس منه فقراء، ترفع المصاحف، وينزع ما في القلوب\n { ثم } إن رفعناه { لا تجدُ لك به } أي: القرآن { علينا وكيلاً } أي: من يتوكل علينا استرداده مسطورًا محفوظًا، { إلا رحمةً من ربك } فإنها إن تأتك لعلها تسترده، أو: لكن رحمة من ربك أمسكته فلم يذهب\n { إِنَّ فضله كان عليك كبيرًا } ، كإرْسالك للناس كافة وإنزال الكتاب عليك، وإنعامه في حفظك، وغير ذلك مما لا يحصى\n ثم نوّه بقدر الكتاب الذي أنزله فقال: { قل لئن اجتمعت الإِنسُ والجِنُّ } ، واتفقوا { على أن يأتوا بمثْلِ هذا القرآنِ } المنعوت بما لا تدركه العقول من النعوت الجليلة في البلاغة، وحسن النظم، وكمال المعنى، { لا يأتون بِمثله } أبدًا لما تضمنه من العلوم الإلهية، والبراهين الواضحة، والمعاني العجيبة، التي لم يكن لأحد بها علم، ثم جاءت فيه على الكمال، ولذلك عجزوا عن معارضته\n وقال أكثر الناس: إنما عجزوا عنه لفصاحته، وبراعته، وحسن نظمه\n ووجوه إعجازه كثيرة\n وإنما خص الثقلين بالذكر، لأن المنكر كونه من عند الله منهما، لا لأنَّ غيرهما قادر على المعارضة\n وإنما أظهر في محل الإضمار، ولم يقل: لا يأتون به لئلا يتوهم أن له مثلاً معينًا، وإيذانًا بأن المراد نفي الإتيان بمثَلٍ مَّا، أي: لا يأتون بكلام مماثل له فيما ذكر من الصفات البديعة، وفيهم العرب العاربة، أرباب البراعة والبيان\n\n\nفلا يقدرون على الإتيان بمثله { ولو كان بعضُهم لبعضٍ ظهيرًا } أي: ولو تظاهروا وتعاونوا على الإتيان بمثله ما قدروا\n وهو عطف على مقدر، أي: لا يأتون بمثله لو لم يكن بعضهم ظهيرًا لبعض، ولو كان\n\n\n الخ\n ومحله النصب على الحالية، أي: لا يأتون بمثله على كل حال مفروض، ولو على هذه الحالة\n ثم قال تعالى: { ولقد صَرَّفنا } أي: كررنا ورددنا على أنحاء مختلفة، توجب زيادة تقرير وبيان، ووكادة رسوخ واطمئنان، { للناس في هذا القرآن } المنعوت بما ذكر من النعوت الفاضلة، { من كل مَثَلٍ } من كل معنى بديع، هو، في الحسن والغرابة واستجلاب الأنفس، كالمثل ليتلقوه بالقبول، أو بيَّنَّا لهم كل شيء محتاجون إليه من العلوم النافعة، والبراهين القاطعة، والحجج الواضحة\n وهذا يدل على أن إعجاز القرآن هو بما فيه من المعاني والعلوم، { فَأَبَى أكثرُ الناس إِلا كُفورًا } إلا جحودًا وامتناعًا من قبوله\n وفيه من المبالغة ما ليس في نفي مطلق الإيمان لأن فيه دلالة على أنهم لم يرضوا بخصلة سوى الكفور والجحود، وأنهم بالغوا في عدم الرضا حتى بلغوا مرتبة الإباء\n وبالله التوفيق\n الإشارة: كما وقع التخويف بإذهاب خصوصية النبوة والرسالة، يقع التخويف بإذهاب خصوصية الولاية والمعرفة العيانية، فإن القلوب بيد الله، يُقلبها كيف يشاء\n والخصوصية أمانة مودعة في القلوب، فإذا شاء رفعها رفَعها، ولذلك كان العارف لا يزول اضطراره\n وما زالت الأكابر يخافون من السلب بعد العطاء، ويشدون أيديهم على الأدب لأن سوء الأدب هو سبب رفع الخصوصية، والعياذ بالله\n قال القشيري: سُنَّةُ الحقِّ مع خيار خواصه أن يُدِيم هم شهود افتقارهم إليه ليكونوا في جميع الأحوال مُنْقادين بجريانِ حُكْمِه، ثم قال: والمرادُ والمقصودُ: إدامة تَفَرُّدِ سِرِّ حبيبه به، دونَ غيره\n هـ\n وأما سلب الأولياء بعضهم لبعض فلا يكون في خصوصية المعرفة بعد التمكين، إذ لا مانع لما أعطى الكريم، وإنما يكون في خصوصية التصريف وسر الأسماء، إذا كان أحدهما متمكنًا فيه، وقابل من لم يتمكن، قد ينجذب إلى القوى بإذن الله، وقد يُزال منه إذا طغى به\n والله تعالى أعلم\n ثمَّ أظهر الحق تعالى جمودهم وعتوهم\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:50",
      "similarity": 0.8922044183706722
    },
    {
      "verse": "20:56",
      "similarity": 0.6899582503849828
    },
    {
      "verse": "17:99",
      "similarity": 0.5576008349076679
    },
    {
      "verse": "18:54",
      "similarity": 0.5360815368100466
    },
    {
      "verse": "15:31",
      "similarity": 0.47575250320617407
    }
  ]
}