{
  "chapter": "الإسراء",
  "text": "واذا انعمنا على الانسن اعرض ونـا بجانبه واذا مسه الشر كان يـوسا",
  "translations": [
    {
      "translation": "When We bless man, he turns away and draws aside. When evil touches him, he despairs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We are gracious to man he turns away and moves aside; yet when evil befalls him he begins to despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever We bestow favours upon man, he arrogantly turns away and draws aside; and whenever evil visits him, he is in utter despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We do favors to the human being, he disregards it and turns away from it. When evil afflicts him, he becomes despairing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We bestow favours upon man, he turns away and goes far away towards himself; and when evil touches him he despairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We bestow Our grace on man, he turns away and becomes arrogant. And when evil touches him, he is in great despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We bestow favor on man, he turns aside and behaves proudly, and when evil afflicts him, he is despairing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We bless man, he turns away, and withdraws aside; but when evil visits him, he is in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We make life pleasant unto man, he turneth away and is averse; and when ill toucheth him he is in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We bestow a favour upon a person, he turns his back and draws aside; and when evil afflicts him he gives himself up to despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We show favour unto he turneth away and withdraweth on his side; and when evil toucheth him he is ever despairing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We bless man, he is disregardful and turns aside; but when an ill befalls him, he is despondent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when We bestow Our favours on man, he turns away and becomes remote on his side (instead of coming to Us), and when evil seizes him he gives himself up to despair!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We bestow Our Grace on man (the disbeliever), he turns away and becomes arrogant, far away from the Right Path. And when evil touches him he is in great despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when We bestow favors upon mankind he turns his back and withdraws to one side. But when evil befalls him, he despairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We bless the human being, he turns away and distances himself. But when adversity touches him, he is in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We bestow favor upon the disbeliever, he turns away and distances himself; and when evil touches him, he is ever despairing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:83] And when We are gracious to man, the disbelieving [man], he is disregardful, of giving thanks, and turns aside, turning his face away in arrogance; but when an ill, such as poverty or hardship, befalls him, he is in despair, despondent of God’s mercy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We make life pleasant unto man) i.e. the disbeliever, when We bestow upon him abundant wealth and a comfortable life, (he turneth away) from giving thanks or making supplications to Allah (and is averse) stirs away from faith; (and when ill) hardship and poverty (toucheth him he is in despair) from Allah's mercy. This verse was revealed about 'Utbah Ibn Rabi'ah. 308\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَنَأَى بِجَانِبِهِ } معناهُ تَباعدَ بِجَانِبِه وقُربهِ\n\n\n\n\nوقوله تعالى: { وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ يَئُوساً } [أي] قَنُوطاً شَديدَ اليَأسِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We are nearer to him than his jugular vein\" [Qaf 50:16], means that We are closer to him than his own self.\n\n\nAnd when evil touches him, he is despairing.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n  { وإذا أنعمنا على الإنسان } بنعمة ظاهرة { أعرض } لوقوفه مع النفس والبدن وكون القوى البدنية متناهية لا تتدبر الأمور الغير المتناهية الممكنة الوقوع من سبب النعمة وردّها عند عدمها وسائر الغير ولا يرى إلا العاجل\n وتكبر لاستعلاء نفسه على القلب وظهوره بأنائيته وتفرعنه فنأى\n أي: بعد عن الحق في جانب النفس وطوى جنبه معرضاً وكذا في جانب الشرّ إذا مسّه يئس لاحتجابه عن القادر وقدرته ولو نظر بعين البصيرة شاهد قدرة الله تعالى في كلتا الحالتين وتيقن في الحالة الأولى أن الشكر رباط النعم\n وفي الثانية أن الصبر دفّاع النقم\n فشكر وصبر وعلم أن المنعم قدر فلم يعرض عند النعمة بطراً وأشراً خائفاً زوالها\n غير غافل عن المنعم\n ولم ييأس عند النقمة جزعاً وضجراً راجياً كشفها\n مراعياً لجانب المبلي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وكيفية ارتباطه بالحق في النشأة الأولى والأخرى فقال: { وَإِذَآ أَنْعَمْنَا } وأعطينا من كمال فضلنا وجودنا { عَلَى ٱلإنْسَانِ } المجبولين على الكفران والنسيان ووسَّعنا له طرق معاشه { أَعْرَضَ } عنا\n وانصرف عن شكرنا وعن الالتجاء والارتجاء بنا عناداً واستكباراً { وَ } صار من إفراط عتوّه إلى حيث { نَأَى } وتباعد { بِجَانِبِهِ } أي: طوى كشحه ولوى عطفه عنا\n كأنه مستغنٍ في ذاته\n مستقلُ في أمره\n بحيث لا يخطر بباله احتياجه إلينا\n ولهذا تجبر واستعلى\n وبالغ في الجدال والمراء إلى أن قال:\n\n[النازعات: 24]\n\n\n{ وَإِذَا مَسَّهُ ٱلشَّرُّ } وأزعجه البلاء\n وهجم عليه الشدة والعناء\n وترادفت عليه الوقائع والمصيبات { كَانَ } من قلبة تصبره وضعف يقينه وتدبره { يَئُوساً } [الإسراء: 83] عن رَوح الله\n شديد القنوط عن سعة لطفه ورحمته\n والطرفان\n أي: إفراط الاستغناء والاستكبار\n وتفريط اليأس والقنوط\n كلامهما مذمومان محظوران عقلاً وشرعاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وإٍذا أنعمنا على الإِنسان }: بالصحة والعافية والنعمة\n { أعرضَ } عن ذكرنا\n فضلاً عن القيام بالشكر\n { ونَأى } أي: تباعد { بجانبه } لوى عطفه وبعد بنفسه\n فالنأي بالجانب: أن يلوي عن الشيء عِطفَه ويوليه عُرض وجهه\n فهو تأكيد للإعراض\n أو عبارة عن التكبر لأنه من ديدن المستكبرين\n { وإِذا مسَّه الشرُّ } من فقر\n أو مرض\n أو نازلة من النوازل\n { كان يؤوسًا } شديد اليأس من روحنا وفرجنا\n وفي إسناد المسِّ إلى الشر\n بعد إسناد الإنعام إلى ضمير الجلالة إيذان بأن الخير مراد بالذات\n والشر ليس كذلك\n وهذا الوصف المذكور هنا هو وصف للإنسان باعتبار بعض أفراده ممن هو على هذا الوصف\n ولا ينافيه قوله تعالى:\n[فُصّلَت: 51]\n ونظائره فإن ذلك في نوع آخر من جنس الإنسان\n وقيل: أريد به الوليد بن المغيرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:51",
      "similarity": 0.8949795719594374
    },
    {
      "verse": "6:26",
      "similarity": 0.7105530366256855
    },
    {
      "verse": "29:23",
      "similarity": 0.2764507375201996
    },
    {
      "verse": "11:9",
      "similarity": 0.26704868919153973
    },
    {
      "verse": "12:110",
      "similarity": 0.25171817598546026
    }
  ]
}