{
  "chapter": "الإسراء",
  "text": "عسى ربكم ان يرحمكم وان عدتم عدنا وجعلنا جهنم للكفرين حصيرا",
  "translations": [
    {
      "translation": "It may well be that your Lord will have mercy on you. But if you revert to what you did, We also will revert. We have made Hell a prison for the kafirun.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord may haply be merciful to you. But if you repeat it, We shall do the same. We have constituted Hell as prison for unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord may well show Mercy to you, but if you revert to your evil behaviour, We shall revert to chastising you. We have made Hell a prison for those who are thankless of Allah's bounties.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps your Lord will have mercy on you. If you return to disobedience We will also punish you again. We have made hell a prison for the disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is likely that your Lord may have mercy on you; and if you repeat the mischief, We will repeat the punishment; and We have made hell a prison for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that your Lord may show mercy unto you, but if you return (to sins), We shall return (to Our punishment). And We have made Hell a prison for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that your Lord will have mercy on you, and if you again return (to disobedience) We too will return (to punishment), and We have made hell a prison for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perchance your Lord will have mercy upon you; but if you return, We shall return; and We have made Gehenna a prison for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that your Lord will have mercy on you, but if ye repeat (the crime) We shall repeat (the punishment), and We have appointed hell a dungeon for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Your Lord may yet have mercy on you, but if you do the same again, so shall We: We have made Hell a prison for those who deny the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Belike your Lord may yet have mercy on you; and if ye still revert, We will revert. And We have appointed Hell for the infidels a prison.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maybe your Lord will have mercy on you, but if you revert, We [too] will revert, and We have made hell a prison for the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that your Lord may (yet) show Mercy unto you; but if ye revert (to your sins), We shall revert (to Our punishments): And we have made Hell a prison for those who reject (all Faith).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And We said in the Taurat (Torah)]: \"It may be that your Lord may show mercy unto you, but if you return (to sins), We shall return (to Our Punishment). And We have made Hell a prison for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps Allah will have mercy on you. But if you return, We will return. We have made Gehenna (Hell) a prison for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps your Lord will have mercy on you. But if you revert, We will revert. We have made Hell a prison for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Then Allah said], \"It is expected, [if you repent], that your Lord will have mercy upon you. But if you return [to sin], We will return [to punishment]. And We have made Hell, for the disbelievers, a prison-bed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:8] And We said in the Scripture: It may be that your Lord will have mercy upon you, after the second time, if you were to repent; but if you revert, to [working] corruption, We [too] will revert, to punishment. And assuredly they did revert by denying the Prophet (s), and so he was given power over them, through the slaying of the [Banū] Qurayza, the expulsion of the [Banū] Nadīr and the exacting of the jizya-tax from them; and We have made Hell a dungeon for the disbelievers, a place of detention and a prison [for them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It may be that your Lord will have mercy on you) after that, (but if ye repeat (the crime) We shall repeat (the punishment)) it is also said that this means: if you return to doing good, We will return to bestowing mercy on you, (and We have appointed hell a dungeon) a prison and jail (for the disbelievers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلْنَا جَهَنَّمَ لِلْكَافِرِينَ حَصِيراً } معناهُ مَحْبِسٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {And We have made Hell a prison for the disbelievers} its meaning is constriction.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { عسى ربكم أن يرحمكم } بعد القهر بالفناء والمحو بتجليات الصفات بالإحياء ويبعثكم بالبقاء بعد الفناء، ويثيبكم بما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n { وإن عدتم } بالتلوين في مقام الفناء بالظهور بأنائيتكم { عدنا } بالقهر والإفناء كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { عَسَىٰ رَبُّكُمْ } يا بني إسرائيل { أَن يَرْحَمَكُمْ } بعد المرة الثانية، إن تبتم عن معاصيكم وجرائمكم { وَإِنْ عُدتُّمْ } إليها ثالثاً { عُدْنَا } إلى الانتقام والعذاب ثالثاً، وهكذا رابعاً وخامساً، وقد عادوا في النوبة الثالثة بتكذيب سيدنا محمد صلى الله عليه وسلم، وقصدوا قتله، فأعاد الله عليهم الخزي، بأن سلط المسلمين عليهم، فقتلوهم وأسروهم، وضربوا الجزية على باقيهم، وصاروا مهانين أذلاء صاغرين إلى قيام الساعة، هذا في النشأة الأولى { وَ } في النشأة الأخرى { جَعَلْنَا جَهَنَّمَ } البعد والخذلان، والطرد والحرمان { لِلْكَافِرِينَ حَصِيراً } [الإسراء: 8] محبساً ومضيفاً لا ينجون منها أبد الآباد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى لبني إسرائيل: { عسى ربُكم أن يرحَمكم } بعد المرة الأخرى ويجبر كسركم، { وإِن عُدتُم عُدْنَا } إلى عقوبتكم، وقد عادوا بتكذيب نبينا محمد صلى الله عليه وسلم، وقصد قتله، فعاد إليهم بتسليطه عليهم، فقتل من بني قريظة سبعمائة في يوم واحد، وسبى ذراريهم، وباعهم في الأسواق، وأجلى بني النضير، وضرب الجزية على الباقين\n هذا في الدنيا، { وجعلنا جهنم للكافرين } منهم ومن غيرهم { حصيرًا } محبسًا، لا يقدرون على الخروج منها، أبدَ الآباد\n وقيل: بساطًا كبسط الحصير، كقوله:\n\n[الأعرَاف: 41]\n والله تعالى أعلم\n الإشارة: قد قضى الحقُّ جلّ جلاله ما كان وما يكون في سابق علمه، فما من نفَس تُبديه إلا وله قدر فيك يُمضيه\n فالواجب على العبد أن يكون ابن وقته، إذا أصبح نظر ما يفعل الله به\n فأسرار القدر قد استأثر الله بعلمها، وأبهم على عباده أمرَها، فلو ظهرت لبطل سر التكليف\n ولذلك لما سُئل عنه سيدنا علي - كرم الله وجهه - قال للسائل: بحر عميق لا تطيقه، فأعاد عليه السؤال، فقال: طريق مظلم لا تسلكه لأنه لا يفهم سر القضاء والقدر، إلا من دخل مقام الفناء والبقاء، وفرَّق بين القدرة والحكمة، وبين العبودية والربوبية، فإذا تحقق العارف بالوحدة، عِلَمَ أنَّ الحق تعالى أظهر من خلقه مظاهر أَعدهم للإكرام، وأظهر خلقًا أعدهم للانتقام، وأبهم الأمر عليهم، ثم خلق فيهم كسبًا واختيارًا فيما يظهر لهم، وكلفهم لتقوم الحجة عليهم، وتظهر صورة العدل فيهم\n { ولا يظلم ربك أحدًا }\n فالقدرة تُبرز ما سبق في الأزل، والحكمة تستر أسرار القدر\n لكن جعل للسعادة علامات كالتوفيق والهداية للإيمان، وللشقاوة علامات كالخذلان والكفران\n نعوذ بالله من سوء القضاء وحرمان الرضا\n آمين\n ومن علامة السعادة التمسك بما جاء به القرآن العظيم\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:39",
      "similarity": 0.4783589716657545
    },
    {
      "verse": "4:90",
      "similarity": 0.45405428124250435
    },
    {
      "verse": "9:5",
      "similarity": 0.2873646742933188
    },
    {
      "verse": "60:7",
      "similarity": 0.24741979432744837
    },
    {
      "verse": "47:22",
      "similarity": 0.23181508674654996
    }
  ]
}