{
  "chapter": "الإسراء",
  "text": "ويسـلونك عن الروح قل الروح من امر ربى وما اوتيتم من العلم الا قليلا",
  "translations": [
    {
      "translation": "They will ask you about the Ruh. Say: 'The Ruh is my Lord's concern. You have only been given a little knowledge.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about revelation. Say, revelation is by the command of your Lord, and that you have been given but little knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about \"the spirit\". Say: \"The spirit descends by the command of my Lord, but you have been given only a little knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Spirit. Say, \"The Spirit comes by the command of my Lord. You have been given very little knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning the soul; proclaim “The soul is an entity by the command of my Lord, and you have not received knowledge except a little.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you concerning the Ruh (the spirit). Say: \"The Ruh (the spirit) is one of the things, the knowledge of which is only with my Lord. And of knowledge, you (mankind) have been given only a little.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you about the soul. Say: The soul is one of the commands of my Lord, and you are not given aught of knowledge but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee concerning the Spirit. Say: 'The Spirit is of the bidding of my Lord. You have been given of knowledge nothing except a little.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are asking thee concerning the Spirit. Say: The Spirit is by command of my Lord, and of knowledge ye have been vouchsafed but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question you about the Spirit. Say, \"The Spirit is at my Lord's command, and you have been granted but little knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask thee regarding the spirit, Say thou: the spirit is by the command of my Lord, and ye have not been vouchsafed of knowledge save a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question you concerning the Spirit. Say, ‘The Spirit is of the command of my Lord, and you have not been given of the knowledge except a few [of you].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee concerning the Spirit (of inspiration). Say: \"The Spirit (cometh) by command of my Lord: of knowledge it is only a little that is communicated to you, (O men!)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you (O Muhammad SAW) concerning the Ruh (the Spirit); Say: \"The Ruh (the Spirit): it is one of the things, the knowledge of which is only with my Lord. And of knowledge, you (mankind) have been given only a little.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question you about the spirit. Say: 'The spirit is from the command of my Lord. Except for a little knowledge you have been given nothing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you about the Spirit. Say, “The Spirit belongs to the domain of my Lord; and you were given only little knowledge.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you, [O Muhammad], about the soul. Say, \"The soul is of the affair of my Lord. And mankind have not been given of knowledge except a little.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:85] And they will question you, that is, the Jews, concerning the Spirit, from which the body receives life. Say, to them: ‘The Spirit is of the command of my Lord, that is, [it belongs to] His knowledge, about which you know not. And of knowledge you have not been given except a little’, relative to His knowledge, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They will ask thee) Muhammad (concerning the Spirit) it was the people of Mecca-Abu Jahl and his host- who asked. (Say: The Spirit is by command of my Lord) the Spirit is of the marvels of my Lord; it is also said that this means: it is the restricted knowledge of my Lord, (and of knowledge) which is with Allah (ye have been vouchsafed) you have been given (but little).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَسْأَلُونَكَ عَنِ ٱلرُّوحِ قُلِ ٱلرُّوحُ مِنْ أَمْرِ رَبِّي } معناه من عِلمِ رَبّي، فإِنكُم لا تَعلمُونَهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And they ask you about the spirit. Say: The spirit is from the matter of my Lord} Its meaning is from the knowledge of my Lord, for you do not know it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويسئلونك عن الروح قل الروح من أمر ربي } أي: ليس من عالم الخلق حتى يمكن تعريفه للظاهرين البدنيين الذين لا يتجاوز إدراكهم عن الحسّ والمحسوس بالتشبيه ببعض ما شعروا به من التوصيف بل من عالم الأمر\n أي: الإبداع الذي هو عالم الذوات المجرّدة عن الهيولى والجواهر المقدّسة عن الشكل واللون والجهة والأين\n فلا يمكنكم إدراكه أيها المحجوبون بالكون لقصور إدراككم وعلمكم عنه { وما أوتيتم من العلم إلا قليلاً } هو علم المحسوسات وذلك شيء نزر حقير بالنسبة إلى علم الله تعالى والراسخين في العلم\n { ولئن شئنا لنذهبنَّ بالذي أوحينا إليك } بالطمس في محل الفناء أو الحجب بعد الكشف بالتلوين { ثم لا تجد لك به علينا وكيلاً } يتوكل علينا بردّه { إلاَّ } مجرّد رحمة عظيمة خاصة بك من فرط عنايتنا وهي أعلى مراتب الرحمة الرحيمية المتكفلة من عند الله تعالى بإفاضة الكمال التام عليه\n أي: لو تجلينا بذاتنا لما وجدت الوحي ولا ذاتك إلا إذا تجلينا بصفة الرحمة واسمنا الرحيم فتوجد وتجد الوحي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تأييداً لحبيبه صلى الله عليه وسلم وتعليماً: { وَيَسْأَلُونَكَ } يا أكمل الرسل\n فوق النصارى واليهود وجميع أهل الزيغ والضلال { عَنِ ٱلرُّوحِ } المتعلق بالأجساد المحيي لها ومحركها بالإدارة والاختيار\n وإذا انفصل وافترق عنها مات\n ولم يتحرك وانقطع الشعور والإدراك عنها\n أي: يسألونك عن لِميَّه وكيفية تعلقه وارتباطه بالأجسام\n وكيفية انفصاله عنها { قُلِ ٱلرُّوحُ } نفسه\n وكيفية تعلقه بالأجسام وكيفية انفصاله عنها كلها صادرةٌ ناشئةُ { مِنْ أَمْرِ رَبِّي } أي: مما حصل بأمره الدالّ على تكوين المكونات\n وهو قول: \" كن \" الدال على سرعة نفوذ قضائه\n\n\nوأما كمية المقضي وكيفية حصوله وانفصالهن فأمرٌ استأثر الله به في غيبه\n ولم يُطلع أحداً عليه لذلك قا ل: { وَمَآ أُوتِيتُم } يا بني آدم { مِّنَ ٱلْعِلْمِ } المتعلق بالورح { إِلاَّ قَلِيلاً } [الإسراء: 85] وهو أنيته وتحققه دون لميته وحقيقته\n لأن اطلاع الإنسان على الأشياء إنما هو بقدر قابليته واستعداده\n وليس في وسعه وطاقته أن يعلم حقيقة الخردلة وكيفية حصولها وتكونها\n فكيف حقيقة الروح\n وكيفية تعلقها في البدن\n\n\nغاية ما في الباب أن المكاشفين من أرباب الأذواق ينكشفون في البدن\n ويتفطنون منها أن ظهور الأشياء وحياتها ومنبع نشأتها ونمائها إنما هي تلك السراية\n هذا نهاية ما يمكن التكلم والتفوه عنه\n وأما الاطلاع على كنهها\n فأمرٌ لا يسعه مقدرة البشر\n\n\nثم قال سبحانه: { وَلَئِن شِئْنَا لَنَذْهَبَنَّ بِٱلَّذِي أَوْحَيْنَا إِلَيْكَ } أي: والله إن شئنا وأردنا إذاهب القرآن المرشد لقاطبة الأنام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ويسألونك عن الروح } أي: عن حقيقة الروح، الذي هو مدبر البدن الإنساني، ومبدأ حياته. رُوي أن اليهود قالوا لقريش: سلوه عن أصحاب الكهف، وعن ذي القرنين، وعن الروح، فإن أجاب عنها كلها أو سكت فليس بنبي، وإن أجاب عن بعض وسكت عن بعض فهو نبي. فبيَّن لهم القصتين وأبهم أمر الروح، وهو مبهم في التوراة، فقال: { قل الروح من أمر ربي } ، أظهر في مقام الإضمار إظهارًا لكمال الاعتناء بشرفه، أي: هو من جنس ما استأثر الله بعلمه من الأسرار الخفية، التي لا يكاد يحوم حولها عقولُ البشر. { وما أُوتيتم من العلم إِلا قليلاً } لا يمكن تعلقه بأمثال هذه الأسرار. رُوِيَ أنه صلى الله عليه وسلم لما قال لهم ذلك، قالوا: نحن مختصون بهذا الخطاب، قال عليه الصلاة والسلام: \" بل نحن وأنتم \". فقالوا: ما أعجب شأنك، ساعة تقول:\n[البَقَرَة: 269]، وتارة تقول هذا، فنزلت:\n[الكهف: 109] الآية.\n[لقمان: 27] الآية. وهذا من ركاكة عقولهم فإن من الحكمة الإنسانية أن يعلم من الخير ما تسعه الطاقة البشرية، بل ما نيط به المعاش والمعاد، وذلك بالإضافة إلى ما لا نهاية له من متعلقات علمه سبحانه، قليل ينال به خير: كثير في نفسه. وقال ابن حجر: أخرج الطبراني عن ابن عباس أنهم قالوا: أخبرنا عن الروح، وكيف تُعذب الروح في الجسد، وإنما الروح من الله؟. هـ. قلت: يُجاب بأنها لما برزت لعالم الشهادة لحقتها العبودية، وأحاطت به القهرية. وقال القشيري: أرادوا أن يُغالطُوه فيما به يجيب، فأمَرَه أن ينطق بأمرٍ يُفْصِحُ عن أقسامِ الروح، لأنَّ ما يُطْلَقُ عليه لفظ \" الروح \" يدخل تحت قوله: { قل الروح من أمر ربي } ، ثم قال: وفي الجملة: الروح مخلوقة، والحق أجرى العادة بأن يخلق الحياة للعبد، ما دام الروح في جسده، والروح لطيفة تَقرب للكثافة في طهارتها ولطافتها. وهي مخلوقة قبل الأجساد بألوفٍ من السنين. وقيل: إن أدركها التكليف، كان للروح صفاء التسبيح، ضياء المواصلة، ويُمن التعريف بالحق. هـ. وقيل: المراد بالروح خلق عظيم روحاني من أعظم الملائكة، وقيل جبريل عليه السلام، وقيل: القرآن. ومعنى { من أمر ربي } من وحيه وكلامه، لا من كلام البشر. والله تعالى أعلم بمراده. الإشارة: قد أكثر الناسُ الكلام في شأن الروح، فرأى بعضهم أن الإمساك عنها أولى لأن الرسول - عليه الصلاة والسلام - لم يجب عنها. وبيَّن الحق تعالى أنها من أمر الله وسر من أسراره. ورأى بعضهم أن النهي لم يرد عن الخوض فيها صريحًا، فتكلم على قدر فهمه.\nفقال بعضهم: حقيقة الروح: جسم لطيف مشتبك بالبدن اشتباك الماء بالعود الأرطب، وقال صاحب الرموز في فتح الكنوز على حديث:\n \" من عرف نفسه فقد عرف ربّه \" \nقد ظهر لي من سر هذا الحديث ما يجب كشفه ويستحسن وصفه، وهو: أن الله، سبحانه، وضع هذا الروح في هذه الجثة الجثمانية، لطيفة لاهوتية، في كثيفة ناسوتية، دالة على وحدانيته تعالى وربانيته، ووجه الاستدلال من عشرة أوجه: الأول: أن هذا الهيكل الإنساني لَمَّا كان مفتقرًا إلى محرك ومدبر، وهذا الروح هو الذي يدبره ويحركه، علمنا أن هذا العالم لا بد له من محرك ومدبر. الثاني: لَمَّا كان مدبر الجسد واحدًا علمنا أن مدبر هذا العالم واحد لا شريك له في تدبيره وتقديره. قال تعالى\n[الأنبياء: 22]، الثالث: لَمَّا كان لا يتحرك هذا الجسم إلا بتحريك الروح وإرادته علمنا أنه لا يتحرك بخير أو شر إلا بتحريك الله وقدرته وإرادته. الرابع: لَمَّا كان لا يتحرك في الجسد شيء إلا بعلم الروح وشعورها، لا يخفي على الروح من حركة الجسد شيء، علمنا أنه تعالى لا يعزب عنه مثقال ذرة في الأرض ولا في السماء. الخامس: لَمَّا كان هذا الجسد لم يكن فيه شيء أقرب إلى الروح من شيء علمنا أنه تعالى قريب إلى كل شيء، ليس شيء أقرب إليه من شيء، ولا شيء أبعد إليه من شيء، لا بمعنى قرب المسافة لأنه منزه عن ذلك. السادس: لَمَّا كان الروح موجودًا قبل الجسد، ويكون موجودًا بعد عدمه علمنا أنه تعالى موجود قبل خلقه، ويكون موجودًا بعد عدمهم، ما زال، ولا يزال، وتقدس عن الزوال. السابع: لَمَّا كان الروح في الجسد لا تعرف له كيفية علمنا أنه تعالى مقدس عن الكيفية. الثامن: لَمَّا كان الروح في الجسد لا تعرف له كيفية ولا أينية، بل الروح موجود في سائر الجسد، ما خلا منه شيء في الجسد. كذلك الحق سبحانه موجود في كل مكان، وتنزه عن المكان والزمان التاسع: لَمَّا كان الروح في الجسد لا يحس ولا يجس ولا يُمس، علمنا أنه تعالى منزه عن الحس والجس والمس. العاشر: لَمَّا كان الروح في الجسد لا يُدرك بالبصر، ولا يمثل بالصور، علمنا أنه تعالى لا تُدركه الأبصار، ولا يمثل بالصور والآثار، ولا يشبه بالشموس والأقمار،\n[الشورى: 11]. هـ. وحديث:\n \" من عرف نفسه... \" \nالخ، قال النووي: غير ثابت، وقال السمعاني: هو من كلام يحيى بن معاذ الرازي. والله تعالى أعلم.  وسئل أبو سعيد الخراز عن الروح، أمخلوقة هي؟ قال: نعم. ولولا ذلك لما أقرت بالربوبية حتى قالت: \" بلى \".\nقلت: لما انفصلت عن الأصل كستها أردية العبودية، فأقرت بالربوبية. وقال الورتجبي: الروح: شعاع الحقيقة، يختلف آثارها في الأجساد. قال: ومن خاصيتها أنها تميل إلى كل حسن ومستحسن، وكل صوت طيب، وكل رائحة طيبة لحسن جوهرها وروح وجودها، ظاهرها غيب الله، وباطنها سر الله، مصورة بصورة آدم. فإذا أراد الله خلق آدمي أحضر روحه، فصور صورته بصورة الروح فلذلك قال عليه الصلاة والسلام إشارة وإبهامًا:\n \" خلق الله آدم على صورته \" \nهـ. قلت: يعني: أن إظهار الروح من بحر الجبروت، في التجلي الأول، كان على صورة آدم، ثم خلق آدم على صورة الروح الأعظم، وهو التجلي الأول من بحر المعاني، فكانت أول التجليات من ذات الرحمن، فقال في حديث آخر:\n \" إن الله خلق آدم على صورة الرحمن \" \nوالله تعالى أعلم. وقيل: الصوت الطيب روحاني، ولتشاكله مع الروح، صار يهيج الروح ويحثها للرجوع لأصلها، إذا كان صاحبها له ذوق سليم، يسمع من صوت طيب كريم. سمع أبو يزيد نغمة، فقال: أجد النغم نداء منه تعالى. وقيل: إن الروح لم تدخل في جسد آدم إلا بالسماع، فصارت لا تخرج من سجنه إلا بالسماع. والله تعالى أعلم. ثمَّ بين قوله { وَمَآ أُوتِيتُم مِّنَ ٱلْعِلْمِ إِلاَّ قَلِيلاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "97:4",
      "similarity": 0.4825479245964684
    },
    {
      "verse": "26:193",
      "similarity": 0.4770084750981243
    },
    {
      "verse": "16:2",
      "similarity": 0.45155389783946837
    },
    {
      "verse": "56:89",
      "similarity": 0.43726185245936916
    },
    {
      "verse": "56:14",
      "similarity": 0.3838169610356772
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/17:85.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/17:85.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/17:85.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}