{
  "chapter": "الإسراء",
  "text": "ذلك جزاؤهم بانهم كفروا۟ بـايتنا وقالوا۟ اءذا كنا عظما ورفتا اءنا لمبعوثون خلقا جديدا",
  "translations": [
    {
      "translation": "That is their repayment for rejecting Our Signs and saying, 'What, when we are bones and crumbled dust, will we then be raised up as a new creation?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This will be their retribution for having denied Our signs and said: \"Once we are turned to bones and bits, can we be raised as a new creation?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That will be their recompense because they disbelieved in Our Signs and said: \"What, when we shall be reduced to bones and particles (of dust), shall we be raised again as a new creation?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This will be the recompense for their disbelief of Our revelations and for their saying, \"Shall we be brought to life again after becoming bones and dust?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is their reward because they disbelieved in Our signs and said, “When we are bones and decomposed, will we really be created again and raised up again?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their recompense, because they denied Our Ayat and said: \"When we are bones and fragments, shall we really be raised up as a new creation\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is their retribution because they disbelieved in Our communications and said What! when we shall have become bones and decayed particles, shall we then indeed be raised up into a new creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their recompense because they disbelieved in Our signs and said, 'What, when we are bones and broken bits, shall we really be raised up again in a new creation?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their reward because they disbelieved Our revelations and said: When we are bones and fragments shall we, forsooth, be raised up as a new creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their recompense, because they rejected Our signs and asked, \"When we are reduced to bones and dust, shall we indeed be raised up as a new creation?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This shall be their meed because they disbelieved in Our signs and said when we have become bones and fragments, shall we in sooth be raised up a new creation!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their requital because they defied Our signs and said, ‘What, when we have become bones and dust, shall we really be raised in a new creation?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their recompense, because they rejected Our signs, and said, \"When we are reduced to bones and broken dust, should we really be raised up (to be) a new Creation?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their recompense, because they denied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and said: \"When we are bones and fragments, shall we really be raised up as a new creation?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That will be their recompense because they disbelieved Our verses and said: 'When we are turned to bones and broken bits, shall we really be raised up once more as a new creation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is their repayment for having blasphemed against Our revelations, and having said, “Shall we, when we have become bones and fragments, be resurrected as a new creation?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their recompense because they disbelieved in Our verses and said, \"When we are bones and crumbled particles, will we [truly] be resurrected [in] a new creation?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:98] That is their requital because they disbelieved Our signs and said, in denial of the Resurrection: ‘What, when   we are bones and fragments, shall we really be raised in a new creation?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) chastisement (is their reward) their lot (because they disbelieved Our revelations) Muhammad (pbuh) and the Qur'an (and said) and the disbelievers of Mecca said: (When we are) rotten (bones and) scattered (fragments shall we, forsooth, be raised up) revived (as a new creation?) the spirit is renewed in us? This can never happen!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } الذي سمعت من العذاب { جَزَآؤُهُم } أي: جزاء المنكرين الكافرين\n وإنما عذبناهم بها { بِأَنَّهُمْ } أي: بسبب أنهم { كَفَرُواْ بِآيَاتِنَا } الدالّة على الحشر الجسماني { وَقَالُواْ } منكرين مستبعدين: { أَءِذَا كُنَّا عِظَاماً وَ } صرنا { رُفَاتاً } أي: هباءً وغباراً { أَءِنَّا لَمَبْعُوثُونَ خَلْقاً } أي: مخلوقاً موجوداً { جَدِيداً } [الإسراء: 98] مثل المخلوق الأول؟! كلا وحاشا\n\n\n{ أَ } ينكرون الحشر وإعادة المعدوم بعينه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n كما يُفصح عنه قوله: { ذلك } أي ذلك العذاب { جزاؤهم بأنهم } بسبب أنهم { كفروا بآياتنا } العقلية والنقلية\n الدالة على وقوع الإعادة دلالة واضحة\n { وقالوا } منكرين البعث أشد الإنكار: { أئذا كُنَّا عظامًا ورُفاتًا أَئِنا لمبعوثون خَلقًا جديدًا } أي: أنوجدُ خلقًا جديدًا بعد أن صِرنا ترابًا؟ و \" خلقًا \": إما مصدر مؤكد من غير لفظه\n أي: لمبعوثون مبعثًا جديدًا\n أو حال\n أي: مخلوقين مستأنفين\n الإشارة: من يهده الله إلى صريح المعرفة وسر الخصوصية فهو المهتد إليها\n يهديه أولاً إلى صحبة أهلها\n فإذا تربى وتهذب أشرقت عليه أنوارها\n ومن يُضلله عنها\n فلا ينظر ولا يهتدي إلى صحبة أهلها\n فيُحشر يوم القيامة محجوبًا عن الله\n كما عاش محجوبًا\n يموت المرء على ما عاش عليه\n ويُبعث على ما مات عليه\n لا يُبصر أسرار الذات في مظاهر النعيم\n ولا ينطق بالمكالمة مع الرحمن الرحيم\n ولا يسمع مكالمة الحق مع المقربين وذلك بسبب إنكاره لأهل التربية في زمانه\n وقال: لا يمكن أن يبعث الله من يحيي الأرواح الميتة بالجهل بالمعرفة الكاملة\n وفيه إنكار لعموم القدرة الأزلية\n وتحجير على الحق\n والله تعالى أعلم\n ثمَّ ذكر دلائل عموم قدرته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:49",
      "similarity": 0.9876476425149459
    },
    {
      "verse": "32:10",
      "similarity": 0.28733512349861307
    },
    {
      "verse": "14:19",
      "similarity": 0.2733976929715942
    },
    {
      "verse": "35:16",
      "similarity": 0.27170831329841577
    },
    {
      "verse": "72:3",
      "similarity": 0.2543650024512599
    }
  ]
}