{
  "chapter": "الإسراء",
  "text": "ان هذا القرءان يهدى للتى هى اقوم ويبشر المؤمنين الذين يعملون الصلحت ان لهم اجرا كبيرا",
  "translations": [
    {
      "translation": "This Qur'an guides to the most upright Way and gives good news to the muminun who do right actions that they will have a large reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily this Qur'an directs you to the path that is straight, and gives happy tidings to those who believe and do the right: For them is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily this Qur'an guides to the Way that is the Straight most. To those who believe in it, and do righteous works, it gives the good news that a great reward awaits them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran shows the way to that which is the most upright and gives to the righteous believers the glad news of a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed this Qur’an guides to the most Straight Path, and gives glad tidings to the believers who do good deeds, that for them is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this Qur'an guides to that which is most just and right and gives good news to those who believe, those who do righteous deeds, that they will have a great reward (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely this Quran guides to that which is most upright and gives good news to the believers who do good that they shall have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely this Koran guides to the way that is straightest and gives good tidings to the believers who do deeds of righteousness, that theirs shall be a great wage,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! this Qur'an guideth unto that which is straightest, and giveth tidings unto the believers who do good works that theirs will be a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, this Quran guides to the most upright way and gives good news to the believers who do good deeds, so that they will have a great reward\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily this Qur'an guideth unto that path which its sraightest and beareth glad tidings to the believers who work righteous deeds that for them shall be a hire great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed this Quran guides to what is most upright, and gives the good news to the faithful who do righteous deeds that there is a great reward for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily this Qur'an doth guide to that which is most right (or stable), and giveth the Glad Tidings to the Believers who work deeds of righteousness, that they shall have a magnificent reward;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this Quran guides to that which is most just and right and gives glad tidings to the believers (in the Oneness of Allah and His Messenger, Muhammad SAW, etc.). who work deeds of righteousness, that they shall have a great reward (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Koran guides to the straightest way. It gives glad tidings of a great wage to the believers who do good deeds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Quran guides to what is most upright; and it gives good news to the believers who do good deeds, that they will have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, this Qur'an guides to that which is most suitable and gives good tidings to the believers who do righteous deeds that they will have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:9] Truly this Qur’ān guides to that, to that way, which is straightest, most upright and correct, and gives tidings to the believers who perform righteous deeds that there is a great reward for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! this Qur'an guideth) leads (unto that which is straightest) unto that which is more correct: the testimony that there is no god except Allah; it is also said that this means: unto that which is more plain, (and giveth tidings unto the believers) who are sincere in their faith (who do good works) solely between themselves and their Lord (that theirs will be a great reward) an abundant reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ هذا القرآن يهدي للتي هي أقوم } أي: يبين أحوال الفرق الثلاث من السابقين وأصحاب اليمين وأصحاب الشمال يهدي إلى طريقة التوحيد التي هي أقوم الطرق للسابقين { ويبشّر المؤمنين } من أصحاب اليمين الذين آمنوا تقليداً جازماً أو تحقيقاً علمياً وداوموا على أعمال التزكية والتحلية الصالحة لأن يتوصل بها إلى الكمال { أن لهم أجراً كبيراً } من نعيم جنات الأفعال والصفات في عوالم الملك والملكوت والجبروت\n { وأنّ الذين لا يؤمنون } من أصحاب الشمال { بالآخرة } لكونهم بدنيين محجوبين عن عالم النور",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأوضحُ السبل وأبينُه إلى التوحيد المنجي عن ظلمات النشأتين { وَيُبَشِّرُ } أيضاً { ٱلْمُؤْمِنِينَ ٱلَّذِينَ يَعْمَلُونَ ٱلصَّالِحَاتِ } المأمورة منه\n المقربة إلى التوحيد { أَنَّ لَهُمْ أَجْراً كَبِيراً } [الإسراء: 9] هو الفوزُ بشرف اللقاء\n والتحقق عند سدرة المنتهى\n\n\n{ و } يخبر القرآن آيضاَ { أَنَّ ٱلَّذِينَ لاَ يُؤْمِنُونَ بِٱلآخِرَةِ } ولم يقصدوا ما فيها من الحساب والعقاب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" وأنَّ الذين \": إما عطف على \" أن \" الأولى\n أو على \" ويُبشر \" بإضمار يخبر\n يقول الحقّ جلّ جلاله: { إِنَّ هذا القرآن يَهدي للتي } للطريق التي { هي أقومُ } الطرق وأعدلها\n { ويُبشِّرُ المؤمنين الذين يعملون } الأعمال { الصالحاتِ أنَّ لهم أجرًا كبيرًا } وهو: الخلود في النعيم المقيم\n وزيادة النظر إلى وجهه الكريم\n { و } يخبر { أنَّ الذين لا يُؤمنون بالآخرة أعتدنا } أي: أعددنا { لهم عذابًا أليمًا } \n أو: ويُبشر المؤمنين ببشارتين: ثوابهم\n وعقاب أعدائهم\n الإشارة: لا شك أن القرآن يهدي إلى طريق الحق إما إلى طريق تُوصل إلى نِعم جنانه\n أو إلى طريق تُوصل إلى شهوده ودوام رضوانه\n فالأولى طريق الشرائع والأحكام\n والثانية طريق الحقائق والإلهام\n لكن لا يدرك هذا من القرآن إلا من صفت مرآة قلبه بالمجاهدة والذكر الدائم\n ولذلك أمر شيوخُ التربية المريد بالاشتغال بالذكر المجرد\n حتى يُشرق قلبه بأنوار المعارف\n ويرجع من الفناء إلى البقاء\n ثم بعد ذلك يُمر بالتلاوة\n ليذوق حلاوة القرآن\n ويتمتع بأنواره وأسراره\n وقد أنكر بعضُ من لا معرفة له بطريق التربية على الفقراء هذا الأمر - أعني: ترك التلاوة في بدايتهم - محتجًا بهذه الآية\n ولا دليل فيها عليهم\n لأن كون القرآن يهدي للتي هي أقوم يعني: التمسك والتدبر في معانيه\n دليل فيها عليهم لأن كون القرآن يهدي للتي هي أقوم يعني: التمسك والتدبر في معانيه\n ولا يصح ذلك على الكمال إلا بعد تصفية القلوب\n كما هو مجرب\n ولا ينكر هذا إلا من لا ذوق له في علوم القوم\n وربما يُذكر وجود التربية من أصلها\n ويسد البابَ في وجوه الناس\n ولا حول ولا قوة إلا بالله\n فإذا اتصل العبد بأهل هذا الطريق ثم تأخر الفتح عنه فلا يقنط",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:11",
      "similarity": 0.5359165957416777
    },
    {
      "verse": "35:7",
      "similarity": 0.5267301521199713
    },
    {
      "verse": "5:9",
      "similarity": 0.42916315256484056
    },
    {
      "verse": "33:47",
      "similarity": 0.40432876960858705
    },
    {
      "verse": "27:2",
      "similarity": 0.3849674891964922
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/017009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/017009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/17:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}