{
  "chapter": "الإسراء",
  "text": "او يكون لك بيت من زخرف او ترقى فى السماء ولن نؤمن لرقيك حتى تنزل علينا كتبا نقرؤه قل سبحان ربى هل كنت الا بشرا رسولا",
  "translations": [
    {
      "translation": "or possess a house built out of gleaming gold; or ascend up into heaven - and even then we will not believe in your ascent unless you bring us down a book to read!' Say: 'Glory be to my Lord! Am I anything but a human messenger?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, you come to possess a house of gold; or ascend to the skies, though we shall not believe in your having ascended till you bring down a book for us which we could read.\" Say: \"Glory to my Lord. I am only man and a messenger.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or that there come to be for you a house of gold, or that you ascend to the sky - though we shall not believe in your ascension (to the sky) - until you bring down a book for us that we can read.\" Say to them, (O Muhammad): \"Holy is my Lord! Am I anything else than a human being, who bears a Message (from Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or (show us) that you have a well adorned house of your own, or climb into the sky. We shall never believe that you have climbed into the sky until you bring us a book that we can read.\" Say, \"All glory belongs to my Lord. Am I more than a mortal Messenger?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Or you have a house of gold, or you ascend up into heaven; and even then we shall not believe in your ascent unless you send down a book upon us, which we may read”; say (O dear Prophet Mohammed – peace and blessings be upon him), “Purity is to my Lord – who am I except a human, sent by Allah?” (* These can be done, only when Allah commands.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or you have a house of Zukhruf, or you ascend up into the sky, and even then we will put no faith in your ascension until you bring down for us a Book that we would read.\" Say: \"Glorified be my Lord! Am I anything but a man, sent as a Messenger\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or you should have a house of gold, or you should ascend into heaven, and we will not believe in your ascending until you bring down to us a book which we may read. Say: Glory be to my Lord; am I aught but a mortal apostle?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or till thou possessest a house of gold ornament, or till thou goest up into heaven; and we will not believe thy going up till thou bringest down on us a book that we may read. Say: 'Glory be to my Lord. Am I aught but a mortal, a Messenger?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or thou have a house of gold; or thou ascend up into heaven, and even then we will put no faith in thine ascension till thou bring down for us a book that we can read. Say (O Muhammad): My Lord be Glorified! Am I aught save a mortal messenger?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or you have a house made of gold; or you ascend to heaven; and we will not believe in your ascension until you send down to us a Book that we can read.\" Tell them, \"Holy is my Lord. I am but a human being sent as a messenger.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or there be for thee a house of gold or thou mountest to the heaven, and we will by no means believe in thy mounting even until thou causest a book to be sent down to us, which we may read. Say thou: hallowed be my Lord! I am naught but a human being sent as an apostle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or until you have a house of gold, or you ascend into the sky. And we will not believe your ascension until you bring down for us a book that we may read.’ Say, ‘Immaculate is my Lord! Am I anything but a human apostle?!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or thou have a house adorned with gold, or thou mount a ladder right into the skies. No, we shall not even believe in thy mounting until thou send down to us a book that we could read.\" Say: \"Glory to my Lord! Am I aught but a man,- a messenger?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or you have a house of adornable materials (like silver and pure gold, etc.), or you ascend up into the sky, and even then we will put no faith in your ascension until you bring down for us a Book that we would read.\" Say (O Muhammad SAW): \"Glorified (and Exalted) be my Lord (Allah) above all that evil they (polytheists) associate with Him! Am I anything but a man, sent as a Messenger?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or, until you possess an ornate house of gold, or ascend into the heavens; and we will not believe in your ascension until you have brought down for us a book which we can read' Say: 'Exaltations to my Lord! Am I anything except a human Messenger'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or you possess a house of gold. Or you ascend into the sky. Even then, we will not believe in your ascension, unless you bring down for us a book that we can read.” Say, “Glory be to my Lord. Am I anything but a human messenger?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or you have a house of gold or you ascend into the sky. And [even then], we will not believe in your ascension until you bring down to us a book we may read.\" Say, \"Exalted is my Lord! Was I ever but a human messenger?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[17:93] or until you [come to] have a house adorned with gold, or ascend into the heaven, upon a ladder, and [even then] we will not believe your ascension, if you were to ascend into it, until you bring down for us, therefrom, a book, in which is [confirmed] your truthfulness, that we may read’. Say, to them: ‘Glory be to my Lord — this is a statement of amazement — Am I anything but a human, a messenger [from God]?’, in other words, [I am] like all [other] messengers, for they never brought [any] signs except by God’s leave.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or thou have a house of gold) and silver; (or thou ascend up into heaven) and bring with you the angel to 309 testify that you are Allah's messenger to us, (and even then we will put no faith in thine ascension) to heaven (till thou bring down for us a book) from Allah to us (that we can read) in which we find that you are Allah's messenger to us. (Say) to them, Muhammad: (My Lord be glorified!) I exonerate my Lord from having a son or partner, (Am I naught save a mortal messenger?) he says: I am only a human messenger, like all previous messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ يَكُونَ لَكَ بَيْتٌ مِّن زُخْرُفٍ } يعني مَنْ ذَهبَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Or shall have a house of luxury,\" means whoever goes forth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوْ يَكُونَ لَكَ بَيْتٌ } متخذ { مِّن زُخْرُفٍ } أي: ذهبٍ وفضةٍ مكللةٍ بجواهز نفيسةٍ { أَوْ تَرْقَىٰ } وتصعد على رؤوس الأشهاد { فِي ٱلسَّمَآءِ } بلا أسبابٍ ووسائلَ { وَ } بعد صعودك وعروجك { لَن نُّؤْمِنَ لِرُقِيِّكَ } أي: لن نؤمن لك ونصدق بمجرد رقيك وعروجك { حَتَّى تُنَزِّلَ عَلَيْنَا كِتَاباً } أي: مكتوباً من عند ربك مشتملاً على أسامينا ودعوتك إيانا إلى الإيمان وتصديقنا بك { نَّقْرَؤُهُ } بين أظهرنا ونؤمن بك بأجمعنا { قُلْ } لهم يا أكمل الرسل بعدما سمعت منهم هذه المقترحات التي ليس في وسعك وطاقتك متعجباً متنزهاً مستبعداً: { سُبْحَانَ رَبِّي } وتعالى من أن يشارَك في قدرته فإن أمثال هذه المقترحات، إنما تصدر منه سبحانه وتعالى أصالةً، أو في خلقه وإظهاره في بعض عباده إن تعلق إرادته، ولم يخلق فيّ بل { هَلْ كُنتُ } أي ما كنتُ { إِلاَّ بَشَراً } ضعيفاً كسائر الناس، غية الأمر أني بوحي الله وإلهامه عليّ صرت { رَّسُولاً } [الإسراء: 93] كسائر الرسل، وقد كانوا أيضاً إلا ما يسّر الله لي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:27",
      "similarity": 0.6539918220358236
    },
    {
      "verse": "38:10",
      "similarity": 0.5897280200830979
    },
    {
      "verse": "43:35",
      "similarity": 0.5067080506446034
    },
    {
      "verse": "6:112",
      "similarity": 0.44892481894243813
    },
    {
      "verse": "10:24",
      "similarity": 0.27610337587668593
    }
  ]
}