{
  "chapter": "الكهف",
  "text": "واذ اعتزلتموهم وما يعبدون الا الله فاوا۟ الى الكهف ينشر لكم ربكم من رحمته ويهيئ لكم من امركم مرفقا",
  "translations": [
    {
      "translation": "When you have separated yourselves from them and everything they worship except Allah, take refuge in the cave and your Lord will unfold His mercy to you and open the way to the best for you in your situation.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And they said to each other:) \"Now that you have withdrawn from them and what they worship beside God, it is better to take refuge in the cave. Your Lord may bestow of His mercy on you, and facilitate your affair.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now that you have dissociated yourselves from them and from whatever they worship beside Allah, go and seek refuge in the Cave. Your Lord will extend His mercy to you and will provide for you the means for the disposal of your affairs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They were told), \"Now that you have abandoned them and what they worship instead of God, seek refuge in the cave. God will, certainly, grant you mercy and provide you with help to safely get out of this trouble.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And when you have disassociated yourself from them and all what they worship besides Allah – so take refuge in the Cave – your Lord will spread His mercy for you and arrange ease for you in your affairs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The young men said to one another:) \"And when you withdraw from them, and that which they worship, except Allah, then seek refuge in the cave; your Lord will open a way for you from His mercy and will make easy for you your affair.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you forsake them and what they worship save Allah, betake yourselves for refuge to the cave; your Lord will extend to you largely of His mercy and provide for you a profitable course in your affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when you have gone apart from them and that they serve, excepting God, take refuge in the Cave, and your Lord will unfold to you of His mercy, and will furnish -- you with a gentle issue of your affair.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye withdraw from them and that which they worship except Allah, then seek refuge in the Cave; your Lord will spread for you of His mercy and will prepare for you a pillow in your plight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now that you have withdrawn from them and from all that they worship instead of God, take refuge in that cave; your Lord will extend His mercy to you and will make fitting provision for you in your situation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now when ye have withdrawn from them and that which they worship, except God, betake yourselves to the cave; your Lord will unfold for you some of His mercy, and will prepare for you of your affair an easy arrangement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you have dissociated yourselves from them and from what they worship except Allah, then take refuge in the Cave. Your Lord will unfold His mercy for you, and He will help you on to ease in your affair.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye turn away from them and the things they worship other than Allah, betake yourselves to the Cave: Your Lord will shower His mercies on you and disposes of your affair towards comfort and ease.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The young men said to one another): \"And when you withdraw from them, and that which they worship, except Allah, then seek refuge in the Cave, your Lord will open a way for you from His Mercy and will make easy for you your affair (i.e. will give you what you will need of provision, dwelling, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you depart from them and from what they worship, other than Allah, seek refuge in the Cave. Allah will extend His Mercy to you and will furnish you with a gentle issue of your affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Now that you have withdrawn from them, and from what they worship besides God, take shelter in the cave. And your Lord will unfold His mercy for you, and will set your affair towards ease.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The youths said to one another], \"And when you have withdrawn from them and that which they worship other than Allah, retreat to the cave. Your Lord will spread out for you of His mercy and will prepare for you from your affair facility.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:16] And when you withdraw from them and from that which they worship except God, then take refuge in the Cave. Your Lord will reveal for you something of His mercy and prepare for you in your affair some comfort’ (read mirfaqan or marfiqan), that is to say, something for you to find comfort in, in the way of lunch or supper.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when ye withdraw from them) and when you leave them and their religion (and that which they worship) of idols beside Allah, therefore worship none (except Allah, then seek refuge in the Cave) enter this Cave; (your Lord will spread for you) He will bestow upon you (of His mercy) of His blessings (and will prepare for you a pillow in your plight) He will prepare for you that which will be kind towards you tomorrow. All this was said by the group of youth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيُهَيِّئْ لَكُمْ مِّنْ أَمْرِكُمْ مِّرْفَقاً } [معناه] ما ارتُفِقَ بهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He will make your affairs {easeful} to you\" [means] that which is in accordance with what is easy for you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ وإذ اعْتَزلتموهم } أي: فارقتم نفوسكم وقواها بالتجرّد { وما يعبدون إلاَّ الله } من مراداتها وأهوائها { فأووا إلى الكهف } إلى البدن لاستعمال الآلات البدنية في الاستكمال بالعلوم والأعمال، وانخزلوا فيه منكسرين، مرتاضين، كأنهم ميتون بترك الحركات النفسانية والنزوات البهيمية والسطوات السبعية، أي: موتوا إرادياً { ينشر لكم ربكم من رحمته } حياة حقيقية بالعلم والمعرفة { ويهيئ لكم من أمركم مرفقاً } كما لا ينتفع به بظهور الفضائل وطلوع أنوار التجليات، فتلتذون بالمشاهدات وتتمتعون بالكمالات كما قال تعالى:\n[الأنعام، الآية: 122]، وقال عليه السلام في أبي بكر رضي الله عنه:\n \" من أراد أن ينظر ميتاً يمشي على وجه الأرض فلينظر أبا بكر \" \n، أي: ميتاً عن نفسه يمشي بالله. أو وإذ اعتزلتم قومكم ومعبوداتهم غيّر الله من مطالبهم المختلفة، ومقاصدهم المتشتتة، وأهوائهم المتفننة، وأصنامهم المتخذة، فأووا إلى كهوف أبدانكم وامتنعوا عن فضول الحركات والخروج في أثر الشهوات، واعكفوا على الرياضات،\n[الكهف، الآية: 16] زيادة كمال وتقوية ونصرة بالأمداد الملكوتية، والتأييدات القدسية، فيغلبكم عليهم ويهيئ لكم ديناً وطريقاً ينتفع به، وقبولاً يهتدي بكم الخلائق ناجين. وفي المأوى إلى الكهف عند مفارقتهم سر آخر يفهم من دخول المهدي في الغار إذ أُخرج ونزل عيسى والله أعلم. وفي نشر الرحمة وتهيئة المرفق من أمرهم عند الأوي إلى الكهف إشارة إلى أنّ الرحمة الكامنة في استعدادهم إنما تنتشر بالتعلق البدني والكمال بتهيئاته.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n قال بعض الفتية لبعضهم: قد وجب علينا الآن الاعتزال منهم { إِذِ ٱعْتَزَلْتُمُوهُمْ } وهجرتموهم { وَمَا يَعْبُدُونَ } أي: معبوداتهم من الأصنام والأوثان التي يعتقدونها آلهةً شركاءَ مع الله يعبدونها كعبادته { إِلاَّ ٱللَّهَ } الواحد الأحد الحق الحقيق بالعبادة\n وأخلصتم العبادة له سبحانه بلا خوفٍ منه ودهشةٍ\n كان أولى وأليقَ بحالكم\n\n\nوبالجملة: اتفقوا على الاعتزال واختيار الغربة والفرار من بينهم\n فاعتزلوهم منهم وخرجوا من أظهرهم { فَأْوُوا } وانصرفوا { إِلَى ٱلْكَهْفِ } المعهود\n ملتجئين إلى ربكم من خوف عدوكم\n متوكلين عليه في رزقكم ومعاشكم { يَنْشُرْ لَكُمْ رَبُّكُم } سبحانه ويبسط عليكم { مِّن } سعة { رَّحْمَتِهِ } وجوده ما تعيشون وتبقون بسبب أن تعلق مشيئته بإبقائكم { وَ } بعدما التجأتم إلى الله\n وتوكلتم عليه\n مفوضين أمروكم كلها إليه { وَيُهَيِّئْ لَكُمْ } ويسهل عليكم { مِّنْ أَمْرِكُمْ } الذي اخترتم لرضا الله ورعاية جنابه { مِّرْفَقاً } [الكهف: 16] أي: ما ترفقون وتنتفعون به من اللذات الروحانية يدل ما فوّتم لأنفسكم من اللذات الجسمانية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { ما يعبدون }: موصول\n عطف على الضمير المنصوب\n أو مصدرية\n أي: وإذ اعتزلتموهم ومَعْبُودِيهِمْ إلا الله\n أو عبادتهم إلا عبادة الله\n وعلى التقديرين: فالاستثناء متصل على تقدير أنهم كانوا مشركين يعبدون الله والأصنام\n ومنقطع على تقدير تمحضهم بعبادة الأوثان\n ويجوز أن تكون { ما } نافية على أنه إخبار من الله - تعالى - عن الفتية بالتوحيد\n معترض بين \" إذ \" وجوابه العامل فيها\n يقول الحقّ جلّ جلاله: { نحن نقصُّ عليك نبأَهم } \n والنبأ: الخبر الذي له شأن وخطر\n قصصًا ملتبسًا { بالحق }: بالصدق الذي لا يطرقه كذب ولا ريبة\n وخبرهم\n حسبما ذكر محمد بن إسحاق: أنه قد مرج أهل الإنجيل\n وظهرت فيهم الخطايا\n وطغت ملوكهم\n فعبدوا الأصنام وذبحوا للطواغيت\n وكان مَنْ بَالَغَ في ذلك وعتا عتوًا كبيرًا: \" دقيانوس \" فإنه غلا فيه غلوًا كبيرًا\n فجاس خلال الديار والبلاد بالعبث والفساد\n وقتل من خالفه ممن تمسك بدين المسيح\n وكان يتتبع الناس فيُخيرهم بين القتل وبين عبادة الأوثان\n فمن رغب في الحياة الدنيا الدنية: تبعه وصنع ما يصنع\n ومن آثر عليها الحياة الأبدية: قتله وقطع آرابه\n وعلّقها بسور المدينة وأبوابها\n فلما رأى الفتيةُ ذلك\n وكانوا عظماء مدينتهم\n وكانوا بني الملوك\n قاموا فتضرعوا إلى الله تعالى\n واشتغلوا بالصلاة والدعاء\n فبينما هم كذلك إذ دخل عليهم أعوان الجبار\n فأحضروهم بين يديه\n فقال لهم ما قال\n فخيَّرهم بين القتل وبين عبادة الأوثان\n فقالوا: إن لنا إلهًا ملأ السماواتِ والأرض عظمةً وجبروتًا\n لن ندعو من دونه أحدًا\n ولن نُقر بما تدعونا إليه أبدًا\n فاقض ما أنت قاض\n فأمر بنزع ما عليهم من الثياب الفاخرة\n وأخرجهم من عنده\n زاد في رواية: وضمنهم أهلهم\n وخرج إلى مدينة نينوى لبعض شأنه\n وأمهلهم إلى رجوعه ليتأملوا في أمرهم\n وإلاَّ فعل بهم ما فعل بسائر المسلمين\n  فأجمعت الفتيةُ على الفرار والالتجاء إلى الكهف الحصين\n فأخذ كلٍّ منهم من بيت أبيه شيئًا\n فتصدقوا ببعضه\n وتزودوا بالباقي\n فأَوَوْا إلى الكهف\n وفي رواية: أنهم مروا بكلب فتبعهم\n على ما يأتي في شأنه\n فجعلوا يُصَلُّون في ذلك الكهف آناء الليل وأطراف النهار\n ويبتهلون إلى الله - سبحانه - بالأنين والجُؤَار\n ففوضوا أمر نفقتهم إلى \" يمليخا \" \n فكان إذا أصبح يضع عنه ثيابه الحسان\n ويلبس ثياب المساكين\n ويدخل المدينة ويشتري ما يهمهم\n ويتحسس ما فيها من الأخبار\n ويعود إلى أصحابه\n فلبثوا على ذلك إلى أن قَدِم الجبارُ المدينةَ فطلبهم\n وأحضر آباءهم\n فاعتذروا بأنهم عَصَوْهم ونهبوا أموالهم\n وبذروها في الأسواق\n وفروا إلى الجبل\n\nفلما رأى \" يمليخا \" ما رأى من الشر رجع إلى أصحابه وهو يبكي\n ومعه قليل من الزاد\n فأخبرهم بما شهد من الهول\n ففزعوا إلى الله - عزّ وجلّ - وخروا له سُجدًا\n ثم رفعوا رؤوسهم وجلسوا يتحدثون في أمرهم\n فبينما هم كذلك إذ ضرب الله على آذانهم فناموا\n ونفقتُهم عند رؤوسهم\n فخرج \" دقيانوس \" في طلبهم بخيله ورَجله\n فوجدهم قد دخلوا الكهف\n فأمر بإخراجهم فلم يُطق أحدٌ منهم أن يَدخله\n فلما ضاق بهم ذرعًا\n قال قائل منهم: أليس لو كنتَ قدرتَ عليهم قتلتهم؟ قال: بلى\n قال: فابْنِ عليهم باب الكهف وَدَعْهم يموتوا جُوعًا وعَطَشًا\n ففعل فكان شأنهم ما قص الله تعالى\n إذ قال:  { إِنهم فتيةٌ } \n استئناف بياني\n كأن سائلاً سأل عن حالهم\n فقال: إنهم فتية شبان كاملون في الفتوة { آمنوا بربهم } \n فيه التفات إلى ذكر الربوبية التي اقتضت تربيتهم وحفظهم\n { وزدناهم هُدىً } بأن ثبَّتناهم على ما كانوا عليه\n وأظهرنا لهم من مكنونات محاسننا ما آثروا به الفناء على البقاء\n وفيه التفات إلى التكلم لزيادة الاعتناء بشأنهم\n { وربطنا على قلوبهم } أي: قويناهم\n حتى اقتحموا مضايق الصبر على هجر الأهل والأوطان\n والنعيم والإخوان\n واجترأوا على الصدع بالحق من غير خوف ولا حذر\n والرد على دقيانوس الجبار { إِذْ قاموا } أي: انتصبوا لإظهار شعار الدين\n قال مجاهد: خرجوا من المدينة فاجتمعوا على غير ميعاد\n فقال أكبرهم: إني لأجد في نفسي شيئًا\n إن ربي هو رب السماوات والأرض\n فقالوا: نحن أيضًا كذلك\n فقاموا جميعًا { فقالوا ربُنا ربُّ السماواتِ والأرضِ } \n وعزموا على التصميم بذلك\n وقيل: قاموا بين يدي الجبار من غير مبالاة به\n حين عاتبهم على ترك عبادة الأصنام\n فحينئذ يكون ما سيأتي من قوله تعالى: { هؤلاء\n\n\n } الخ: منقطعًا صادرًا عنهم\n بعد خروجهم من عنده\n ثم قالوا: { لن ندعوَ من دونه إِلهًا } \n لا استقلالاً ولا اشتراكًا\n ولم يقولوا: ربًا للتصميم على الرد على المخالفين\n حيث كانوا يُسمون أصنامهم آلهة\n وللإشعار بأن مدار العبودية على وصف الألوهية\n { لقد قُلنا إِذًا شَطَطًا }: قولاً ذا شطط\n وهو الجور والتعدي\n أي: لقد جُرنا وأفرطنا في الكفر\n وقلنا قولاً خارجًا عن حد المعقول\n إنْ دعونا إلهًا غير الله جَزْمًا\n { هؤلاء قومُنَا } قد { اتخذوا من دونه آلهةً } \n فيه معنى الإنكار\n { لولا }: هلا { يأتونَ عليهم }: على ألوهيتهم { بسلطان بَيِّن }: بحجة ظاهرة\n { فمن أظلمُ } أي: لا أحد أظلم { ممن افترى على الله كذبًا } بنسبة الشريك إليه فإنه أظلم من كل ظالم\n\n{ وإذ اعتزلتموهم } أي: فارقتموهم { و } فارقتم { ما يعبدون إِلا الله فَأْووا إِلى الكهف }: فالتجئوا إليه\n والمعنى: وإذا اعتزلتموهم اعتزالاً اعتقاديًا فاعتزلوهم اعتزالاً جسمانيًا\n { ينشرْ لكم ربٌُّكم }: يبسط لكم ويوسع عليكم { من رحمته } في الدارين\n { ويهيئْ لكم من أمركم } الذي أنتم بصدده من الفرار بالدين\n { مِرْفَقًا }: ما ترتفقون به\n أي: تنتفعون\n وجزمهم بذلك لنصوع يقينهم\n وقوة وثوقهم بفضل الله\n والله تعالى أعلم\n الإشارة: قد وصف الله - تعالى - أهلَ الكهف بخمسة أوصاف هي من شعار الصوفية الإيمان\n الذي هو الأساس\n وزيادة الاهتداء بتربية الإيقان إلى الوصول إلى صريح العرفان\n وربط القلب في حضرة الرب\n والقيام في إظهار الحق أو لداعي الوجد\n والصدع بالحق من غير مبالاة بأحد من الخلق\n وقال الورتجبي في قوله تعالى: { وزدناهم هُدىً }: أي: زدناهم نورًا من جمالي\n فاهتدوا به طرق معارف ذاتي وصفاتي\n وذلك النور لهم على مزيد الوضوح إلى الأبد لأن نوري لا نهاية له\n وقال عند قوله: { إِذ قاموا }: قد استدل بهذه الآية بعضُ المشايخ على حركة الواجدين في وقت السماع والذكر لأن القلوب إذا كانت مربوطة بالملكوت ومحل القدس حرَّكها أنواعُ الأذكار وما يَرِد عليها من فنون السماع\n والأصل قوله: { وربطنا على قلوبهم إِذ قاموا } \n نعم هذا المعنى إذا كان القيام قيامًا بالصورة\n أي: الحسية في القيام الحسي\n وإذا كان القيام من جهة الحفظ والرعاية\n والربط من جهة النقل من محل التلوين إلى محل التمكين\n فالاستدلال بها في السكون في الوجد أحسن\n إذا كان الربط بمعنى التسكين والقيام بمعنى الاستقامة\n هـ\n قلت: الحاصل: أنا إذا حملنا القيام على الحسي ففيه دليل لأهل البداية على القيام في الذكر والسماع\n وإذا حملناه على القيام المعنوي\n وهو النهوض في الشيء\n أو الاستقامة عليه كان فيه دلالة لأهل النهاية على السكون وعدم التحرك\n وكأنه يشير إلى قضية الجنيد في بدايته ونهايته\n والله تعالى أعلم\n وقال ابن لب: قد اشتهر الخلاف بين العلماء في القيام لذكر الله - تعالى - وقد أباحته الصوفية\n وفعلته ودامت عليه\n واستفادوه من كتاب الله تعالى من قوله - عزّ وجلّ - في أصحاب الكهف: { إِذ قاموا فقالوا ربُّنا ربُّ السماوات والأرض } \n وإن كانت الآية لها محامل أخرى سوى هذا\n هـ\n قلت: وقوله تعالى:\n[آل عمران: 191]: صريح في الجواز\n وقال في القوت: وقد روينا أنه صلى الله عليه وسلم مرَّ برجل يظهر التأوه والوجد\n فقال مَنْ كان معه: أتراه يا رسولَ الله مُرائيًا؟ فقال:\n \" لا\n بل أوّاه منيب \" \n\n وقال لآخر: أظهر صوته بالآية:\n \" أِسْمِع الله عزَّ وجّل ولا تُسَمِّع \" \n\n فأنكر عليه بما شهد فيه\n ولم ينكر على أبي موسى قوله: لو علمتُ أنك تَسمع لحبَّرته لك تحبيرًا لأنه ذو نية في الخير وحسن قصد به\n ولذا كل من كان له حسن قصد\n ونية خير\n في إظهار عمل\n فليس من السمعة والرياء في شيء لتجرده من الآفة الدنيوية\n وهي الطمع والمدح\n هـ\n ثمَّ ذكر حالهم في الكهف فقال: { وَتَرَى ٱلشَّمْسَ إِذَا طَلَعَت تَّزَاوَرُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:10",
      "similarity": 0.6372394871101821
    },
    {
      "verse": "4:69",
      "similarity": 0.3741036407564081
    },
    {
      "verse": "18:11",
      "similarity": 0.3084705940730471
    },
    {
      "verse": "18:9",
      "similarity": 0.24066954360342896
    },
    {
      "verse": "18:25",
      "similarity": 0.2328485179080778
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/18:16.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/18:16.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/18:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}