{
  "chapter": "الكهف",
  "text": "هؤلاء قومنا اتخذوا۟ من دونه ءالهة لولا ياتون عليهم بسلطنۭ بين فمن اظلم ممن افترى على الله كذبا",
  "translations": [
    {
      "translation": "These people of ours have taken gods apart from Him. Why do they not produce a clear authority concerning them? Who could do greater wrong than someone who invents a lie against Allah?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for these our people here, they have taken to other gods apart from Him. Then why do they not bring a clear authority for them? Who is more wicked than he who fabricates a lie against God?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then they conferred among themselves and said): \"These men, our own people, have taken others as gods beside Him: why do they not bring any clear evidence that they indeed are gods? Who can be more unjust than he who foists a lie on Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our people have considered other things equal to God. Why cannot they present clear proof in support of their claim. Who is more unjust than one who invents falsehood against God?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“These – the people of ours – have set up Gods besides Allah; why do they not bring a clear proof regarding them? And who is more unjust than one who fabricates a lie against Allah?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken for worship gods other than Him. Why do they not bring for them a clear authority And who does more wrong than he who invents a lie against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken gods besides Him; why do they not produce any clear authority in their support? Who is then more unjust than he who forges a lie against Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken to them other gods, apart from Him. Ah, if only they would bring some clear authority regarding them! But who does greater evil than he who forges against God a lie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These, our people, have chosen (other) gods beside Him though they bring no clear warrant (vouchsafed) to them. And who doth greater wrong than he who inventeth a lie concerning Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These people of ours have taken deities other than Him. Why do they not produce clear evidence about them? Who is more wicked than the man who invents a falsehood against God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These, our people, have taken for themselves gods beside Him - wherefore bring they not for them an authority manifest? --and who doth greater wrong than he who fabricateth against God a lie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These—our people—have taken gods besides Him. Why do they not bring any clear authority touching them? So who is a greater wrongdoer than he who fabricates a lie against Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken for worship gods other than Him: why do they not bring forward an authority clear (and convincing) for what they do? Who doth more wrong than such as invent a falsehood against Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken for worship aliha (gods) other than Him (Allah). Why do they not bring for them a clear authority? And who does more wrong than he who invents a lie against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These, our nation have taken to themselves gods, other than Allah. Why do they not bring some clear authority regarding them! Who does greater evil than he who forges a lie against Allah'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“These people, our people, have taken to themselves gods other than Him. Why do they not bring a clear proof concerning them? Who, then, does greater wrong than he who invents lies and attributes them to God?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These, our people, have taken besides Him deities. Why do they not bring for [worship of] them a clear authority? And who is more unjust than one who invents about Allah a lie?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:15] These (hā’ūlā’ is the subject [of the sentence]) our people (qawmunā is an explicative supplement [to the subject]) have taken gods besides Him. Why [if what they claim is true] do they not bring some clear warrant, some manifest argument, regarding them? regarding worship of these [idols]. And who does greater wrong — in other words, no one does greater wrong — than he who invents a lie against God?, by   ascribing partners to Him, exalted be He. Some among the youths said to the others:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These, our people, have chosen (other) gods) they have worshipped idols (beside Him though they bring no clear warrant) a clear proof ((vouchsafed) to them) that Allah commanded them to worship them. (And who doth greater wrong than he who inventeth a lie concerning Allah) that He has a partner?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { هؤلاء قومنا } إشارة إلى النفس الأمارة وقواها\n لأن لكل قوم إلهاً تعبده وهو مطلوبها ومرادها\n والنفس تعبد الهوى كقوله:\n[الجاثية\n الآية: 23]\n أو إلى أهل زمان كل من خرج منهم داعياً إلى الله\n إذ كل من عكف على شيء يهواه فقد عبده\n { لولا يأتون عليهم } أي: على عبادتهم وإلهيتهم وتأثيرهم ووجودهم { بسلطان بيّن } أي: حجة بيّنة دليل على فساد التقليد وتبكيت بأن إقامة الحجة على إلهية غير الله وتأثيره ووجوده محال\n كما قال:\n[النجم\n الآية: 23] أي: اسماء بلا مسميات لكونها ليست بشيء",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قالوا على وجه التعريض والتسفيه: { هَـٰؤُلاۤءِ } الضالون عن منهج الرشاد ومسلك السداد { قَوْمُنَا ٱتَّخَذُواْ } من غوايتهم وضلالهم { مِن دُونِهِ } سبجانه { آلِهَةً } باطلةً أي: أصناماً وأوثاناً يعبدونها لعبادة الله { لَّوْلاَ } أي: هلا { يَأْتُونَ عَلَيْهِم بِسُلْطَانٍ بَيِّنٍ } أي: بحجةٍ واضحةٍ وبيّنةٍ لائحةٍ ومعجزةٍ باهرةٍ\n صادرةٍ من قِبلهم دالةٍ على لياقتهم الألوهية والربوبية\n فإن لم يأتوا فهم حينئذ مفترون على الله بإثبات الشريك له { فَمَنْ أَظْلَمُ } وأطغى وأضل { مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ } الواحد الأحد\n المستقل بالألوهية بإثبات الشريك له\n سيما أمثال هذه التماثيل العاطلة { كَذِباً } [الكهف: 15] مخالفاً للواقع\n بلا مستند عقلي أو نقلي\n بل ظلماً وزوراً\n\n\n{ َوَ } بعدما جرى بينهم وبين دقيانوس ما جرى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { هؤلاء }: مبتدأ\n وفي اسم الإشارة تحقير لهم\n و { قومنا }: عَطْفُ بيانٍ له\n و { اتخذوا }: خبر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:144",
      "similarity": 0.5331016670663276
    },
    {
      "verse": "3:94",
      "similarity": 0.4764097548477766
    },
    {
      "verse": "22:71",
      "similarity": 0.4745418639034955
    },
    {
      "verse": "44:19",
      "similarity": 0.4632472044487819
    },
    {
      "verse": "37:156",
      "similarity": 0.4476034957447962
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/18:15.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/18:15.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}