{
  "chapter": "الكهف",
  "text": "وتحسبهم ايقاظا وهم رقود ونقلبهم ذات اليمين وذات الشمال وكلبهم بسط ذراعيه بالوصيد لو اطلعت عليهم لوليت منهم فرارا ولملئت منهم رعبا",
  "translations": [
    {
      "translation": "You may have thought that they were awake, yet they were asleep. We made them turn right and left, while their dog lay with his forelegs stretched across the threshold. If you had looked at them you would have surely turned away and fled with horror at the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On seeing them you would fancy them to be awake though they were asleep; and We caused them to turn their sides to their right and to their left, and their dog sat stretching out its forelegs on the threshold of the Cave. Had you looked upon them you would have certainly fled away from them, their sight filling you with terror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One would think them (the youths) awake while, in fact, they were sleeping. We turned their bodies from right to left and their dog stretched its front legs on the ground. Had one looked them over, he would have run away from them in terror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you may think they are awake, whereas they are asleep; and We turn them over to the right and the left – and their dog is on the threshold of the cave, with its paws outstretched; O listener, were you to look at them closely, you would turn back running away from them, and be filled with their dread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you would have thought them awake, whereas they were asleep. And We turned them on their right and on their left sides, and their dog stretching forth his two forelegs at the Wasid. Had you happened upon them, you would certainly have turned back from them in flight, and would certainly have been filled with awe of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you might think them awake while they were asleep and We turned them about to the right and to the left, while their dog (lay) outstretching its paws at the entrance; if you looked at them you would certainly turn back from them in flight, and you would certainly be filled with awe because of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wouldst have thought them awake, as they lay sleeping, while We turned them now to the right, now to the left,' and their dog 'stretching its paws on the threshold. Hadst thou observed them surely thou wouldst have turned thy back on them in flight, and been filled with terror of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wouldst have deemed them waking though they were asleep, and We caused them to turn over to the right and the left, and their dog stretching out his paws on the threshold. If thou hadst observed them closely thou hadst assuredly turned away from them in flight, and hadst been filled with awe of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You would have thought they were awake, though they lay asleep. We turned them over, to the right and the left, while their dog lay at the cave's entrance with legs outstretched. Had you looked down and seen them, you would have surely turned your back and fled in terror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wouldst have deemed them awakes whereas they were asleep and We turned them over on the right side and on the left side, while their dog stretched forth his two forelegs on the threshold. If thou hadst observed them, thou wouldst have surely turned away from them in fright, and wouldst have surely been filled with awe of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will suppose them to be awake, although they are asleep. We turn them to the right and to the left, and their dog [lies] stretching its forelegs at the threshold. If you come upon them, you will surely turn to flee from them, and you will surely be filled with a terror of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wouldst have deemed them awake, whilst they were asleep, and We turned them on their right and on their left sides: their dog stretching forth his two fore-legs on the threshold: if thou hadst come up on to them, thou wouldst have certainly turned back from them in flight, and wouldst certainly have been filled with terror of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you would have thought them awake, while they were asleep. And We turned them on their right and on their left sides, and their dog stretching forth his two forelegs at the entrance [of the Cave or in the space near to the entrance of the Cave (as a guard at the gate)]. Had you looked at them, you would certainly have turned back from them in flight, and would certainly have been filled with awe of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You might have thought them awake, though they were sleeping. We turned them about to the right and to the left, while their dog stretched its paws at the entrance. Had you seen them you would surely have become filled with terror and turned your back on them in flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You would think them awake, although they were asleep. And We turned them over to the right, and to the left, with their dog stretching its paws across the threshold. Had you looked at them, you would have turned away from them in flight, and been filled with fear of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you would think them awake, while they were asleep. And We turned them to the right and to the left, while their dog stretched his forelegs at the entrance. If you had looked at them, you would have turned from them in flight and been filled by them with terror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:18] And you would have supposed them — had you seen them — awake, that is, conscious, because their eyes were open (ayqāz, ‘awake’, is the plural of yaqiz), though they were asleep (ruqūd is the plural of rāqid). And We caused them to turn over to the right and to the left, lest the earth consume their flesh, and their dog [lay] stretching its forelegs, his paws, on the threshold, at the opening of the cave: whenever they turned over it would turn over just like them, both during sleep and consciousness. If you had observed them you would have turned away from them in flight and you would have been filled (read la-mulli’ta or lamuli’ta) with awe because of them (read ru‘ban or ru‘uban, ‘awe’): [it was] through this awe that God protected them from anyone entering upon them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thou wouldst have deemed them) Muhammad (waking) not sleeping (though they were asleep, and we caused them to turn over to the right and the left) once each year so that the earth does not eat away their flesh, (and their dog) Qatmir (stretching out his paws on the threshold) at the entrance of the Cave. (If thou hadst observed them closely) in that state (thou hadst assuredly turned away from them in flight, and hadst been filled with awe of them) and you would have been sacred of them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَنُقَلِّبُهُمْ ذَاتَ ٱليَمِينِ وَذَاتَ ٱلشِّمَالِ } معناهُ أيمانُهم وشَمائِلُهم\n\n\n\n\nوقوله تعالى: { وَكَلْبُهُمْ بَاسِطٌ ذِرَاعَيْهِ بِٱلوَصِيدِ } الوَصِيدُ: الفِناءُ والوَصيد: البَابُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وتحسبهم أيقاظاً } يا مخاطب لانفتاح أعينهم وإحساساتهم وحركاتهم الإرادية الحيوانية { وهم رقود } بالحقيقة في سنة الغفلة تراهم ينظرون إليك وهم لا يبصرون { ونقلّبهم ذات اليمين وذات الشمال } أي: نصرفهم إلى جهة الخير وطلب الفضيلة تارة، وإلى جهة الشر ومقتضى الطبيعة أخرى { وكلبهم } أي: نفسهم { باسطٌ ذراعيه } أي: ناشرة قوتيها الغضبية والشهوانية { بالوصيد } أي: بفناء البدن، ولم يقل: وكلبهم هاجع لأنها لم ترقد بل بسطت القوتين في فناء البدن ملازمة له لا تبرح عنه، والذراع الأيمن هو الغضب لأنه أقوى وأشرف وأقبل لدواعي القلب في تأديبه، والأيسر هو الشهوة لضعفها وخستها { لو اطّلعت عليهم } أي: على حقائقهم المجردة وأحوالهم السنية وما أودع الله فيهم من النورية والسنا، وما ألبسهم من العز و البهاء { لوليت منهم } فارّاً لعدم اعتقادك بالنفوس المجردة وأحوالها وعدم استعدادك لقبول كمالهم، أو لوليت منهم للفرار عنهم وعن معاملاتهم لميلك إلى اللذات الحسيّة والأور الطبيعية { ولملئت منهم رعباً } من أحوالهم ورياضاتهم، أو لو اطلعت عليهم بعد الوصول إلى الكمال وعلى أسرارهم ومقاماتهم في الوحدة لأعرضت عنهم وفررت من أحوالهم وملئت منهم رعباً لما ألبسهم الله من عظمته وكبريائه\n وأين الحدث من القدم، وأنى يسع الوجود العدم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَ } من كمال لطف الله إياهم ورأفته لو رأيتهم أيها الرائي ي مضاجعهم ومراقدهم { تَحْسَبُهُمْ أَيْقَاظاً } متيقظين؛ لانفتاح عيونهم، وورودهم أنفاسهم، وعدم نتنهم وانفاسخهم { وَهُمْ رُقُودٌ وَنُقَلِّبُهُمْ } عنايةً منَّا إياهم وقت احتياجهم إلى التقلب { ذَاتَ ٱليَمِينِ وَذَاتَ ٱلشِّمَالِ } كي لا تؤثر الأرض بأضلاعهم وجوانبهم { وَكَلْبُهُمْ } هو كلبُ مرُّوا عليه حين إواائهم إلى الغار معتزلين، فلحقهم فطردوه، فأنطقه الله فقال: أنا أحب أولياء الله وأحباءه دعوني أقتفِ أثركم فدعوه فتبعهم\n\n\n\n\nوقيل: كلب راعٍ مضوا عليه فأطعمهم وحكوا عليه حالهم، فتبعهم وتبعه كلبه، وقراءة من قرأ: (وكالبهم) يؤيد هذا\n\n\n\n\n{ بَاسِطٌ ذِرَاعَيْهِ بِٱلوَصِيدِ } أي: في الباب أو الغتبة أو الفناء { لَوِ ٱطَّلَعْتَ عَلَيْهِمْ } أيها الرائي ورأيت هيئة رقودهم في ذلك الغار المهيب { لَوَلَّيْتَ } أي: استدبرت ورجعت قَهْقَرى هرباً وهولاً { مِنْهُمْ فِرَاراً } أي: من هيبتهم { وَلَمُلِئْتَ } وأملأ صدرك { مِنْهُمْ رُعْباً } [الكهف: 18] خوفاً من رقودهم منفتحة العيون عظيمة الأجسام في غارٍ مُهيبٍ في خلال جبال عوالٍ بعيدةٍ عن العمران\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وجملة: { وهم في فجوة }: حال، و { ذراعيه }: مفعول \" باسط \" لأنه حكاية حال، أي: يبسط، و { فرارًا }: مصدر لأنه عبارة عن معنى التولية، أو حال، أي: لوليت فارًا، و { رُعْبًا }: مفعول ثان لملئت، أو تمييز\n يقول الحقّ جلّ جلاله: في بيان حالهم بعدما أووا إلى الكهف: { وترى الشمسَ إِذا طلعت تزَاورُ } أي: تنتحي وتميل { عن كهفهم } الذي أووا إليه، والخطاب للرسول صلى الله عليه وسلم، أو لكل أحد ممن يصلح للخطاب\n وليس المراد الإخبار بوقوع الرؤية تحقيقًا، بل الإنباء بكون الكهف بحيث لو رأيته ترى الشمس إذا طلعت تميل عن كهفهم { ذاتَ اليمين } أي: جهة ذات يمين الكهف، عند الداخل إلى قعره، { وإِذا غَرَبَت } أي: وتراها إذا غربت { تَقْرِضُهم } أي: تقطعهم وتتعدى عنهم { ذاتَ الشمال } أي: جهته وجانبه الذي يلي المشرق\n وكان ذلك بتصريف الله تعالى على منهاج خرق العادة كرامة لهم\n وقيل: كان باب الكهف شماليًا يستقبل بنات نعش، { وهم في فجوةٍ منه }: في موضع واسع منه، وذلك موقع لإصابة الشمس، ومع ذلك يُنحيها الله عنهم\n { ذلك من آيات الله } أي: ما صنع الله بهم من ميل الشمس عنهم عند طلوعها وغروبها، من آيات الله العجيبة الدالة على كمال علمه وقدرته، وفضيلة التوحيد وكرامة أهله عنده سبحانه\n قال بعضهم: هذا قبل سد دقيانوس باب الكهف، قلت: كان قبل السد وبعد هدم السد لأنه هُدم بعدُ، فما قام أهل الكهف حتى وجدوه مهدومًا\n وظاهر الآية يُرجح من قال: إنه من باب خرق العادة\n { مَن يَهدِ الله فهو المهتدِ } الذي أصاب الفلاح\n والمراد: إما الثناء عليهم، والشهادة بإصابة المطلوب، والإخبار بتحقيق ما أمَّلُوه من نشر الرحمة وتهيئة المرافق، أو التنبيه على أن أمثال هذه الآية كثيرة، ولكن المنتفع بها هو مَنْ وفقه الله وهداه للاستبصار بها، { ومن يُضلل } أي: يخلق فيه الضلال بصرف اختياره إليه، { فلن تجد له } ، ولو بالغت في التتبع والاستقصاء، { وليًّا }: ناصرًا { مُرشدًا } ، يهديه إلى ما ذكر من الفلاح\n والجملة معترضة بين أجزاء القصة\n ثم قال: { وتحسبُهُم } بالفتح والكسر، أي: تظنهم { أيقاظًا } ، لانفتاح أعينهم، أو لكثرة تقلبهم، وهو جمع \" يقظ \" بظم القاف وكسرها، { وهم رقود } أي: نيام، { ونُقلِّبهم } في رقودهم { ذاتَ اليمين } أي: جهة تلي أيمانهم، { وذات الشمال } أي: جهة تلي شمائلهم لكي لا تأكل الأرضُ ما يليها من أبدانهم\n قال ابن عباس رضي الله عنه: لو لم يتقلبوا لأكلتهم الأرض\n\n\nقيل: كانوا يتقلبون مرتين في السنة\n وقيل: مرة يوم عاشوراء\n وقيل: في تسع سنين\n { وكلبهم باسطٌ ذراعيه } ، حكاية حال ماضية أي: يبسط ذراعيه، وهو من المرفق إلى رأس الأصابع\n { بالوصيد } أي: بموضع من الكهف، وقيل: بالفِناء من الكهف، وقيل: العَتَبة\n وهذا الكلب، قيل: هو كلبٌ مَروا به فتبعهم، فطردوه مرارًا، فلم يرجع، فأنطقه الله، فقال: يا أولياء الله لا تخشوا إصابتي فإني أُحب أحباء الله، فناموا حتى أحرُسَكم\n وقيل: هو كلبُ راعٍ مروا به فتبعهم على دينهم، ومر معه كلبه، ويؤيده قراءة: وَكَالِبُهُمْ أي: وصاحب كلبهم، وقيل: هو كلب صيد لهم أو زرع، واختُلف في لونه قيل أحمر، وقيل: أصفر، وقيل: أصهب\n { لو اطّلعتَ عليهم } أي: لو عاينتهم وشاهدتهم\n والاطلاع: الإشراف على الشيء بالمعاينة والمشاهدة، { لولَّيت منهم فرارًا }: هربًا بما شاهدت منهم، { ولمُلئتَ منهم رُعْبًا } ، أي: خوفًا يملأ الصدور برُعبه، لِمَا ألبسهم الله من الرهبة، أو لعظم أجرامهم وانفتاح أعينهم، وكانت منفتحة كالمستيقظ الذي يريد أن يتكلم\n وعن معاوية: أنه غزا الروم فمرّ بالكهف، فقال: لو كُشف لنا عن هؤلاء فنظرنا إليهم، فقال ابن عباس رضي الله عنه: ليس لك ذلك قد منع الله تعالى مَنْ هو خير منك، حيث قال: { لو اطلعت عليهم\n\n\n } الآية، فلم يسمع، وقال: ما أنتهي حتى أعْلَم علمهم، فبعث ناسًا، وقال: اذهبوا فانظروا، ففعلوا، فلما دخلوا بعث الله ريحًا فأحرقتهم\n هـ\n الإشارة: للصوفية - رضي الله عنهم - تشبه قويّ بأهل الكهف، في الانقطاع إلى الله، والتجرد عن كل ما سواه، والانحياش إلى الله، والفرار من كل ما يشغل عن الله، والتماس الرحمة الخاصة من الله، وطلب التهيئة لكل رشد وصواب، ولهذا المعنى ختم الشيخ القطب ابن مشيش تصليته المشهورة بما دَعَوْا به، حين أووا إلى كهف الإيواء تَشَبُّهًا بهم في مطلق الانقطاع والفرار من مواطن الحس\n ولذلك لَمَّا تشبهوا بهم حفظهم الله - أي: الصوفية - ممن رام أذاهم، وغيّبهم عن حس أنفسهم، وأشهدهم عجائب لطفه وقدرته، ومن تمام التشبه بهم: أنك قلَّ أن تجد فرقة تُسافر منهم إلا ويتبعهم كلب يكون معهم، حتى شهدتُ ذلك في جُل أسفارنا مع الفقراء تحقيقًا لكمال التشبيه\n والله تعالى أعلم\n ثم ذكر بعثهم بعد نومهم\n",
      "translations": []
    }
  ]
}