{
  "chapter": "الكهف",
  "text": "افحسب الذين كفروا۟ ان يتخذوا۟ عبادى من دونى اولياء انا اعتدنا جهنم للكفرين نزلا",
  "translations": [
    {
      "translation": "Do the unbelievers think they can make My own creatures their protectors against Me? We have prepared Hell for the hospitality of infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the unbelievers, then, believe that they can take any of My creatures as their guardians beside Me? Verily We have prepared Hell to welcome the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the unbelievers think they can make My servants as their guardians instead of Me? We have prepared hell as a dwelling place for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the disbelievers assume that they will be able to choose My bondmen as supporters other than Me? Indeed We have prepared hell to welcome the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do then those who disbelieved think that they can take My servants as Awliya' [protectors] besides Me Verily, We have prepared Hell as an entertainment for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! do then those who disbelieve think that they can take My servants to be guardians besides Me? Surely We have prepared hell for the entertainment of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do the unbelievers reckon that they may take My servants as friends, apart from Me? We have prepared Gehenna for the unbelievers' hospitality.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the disbelievers reckon that they can choose My bondmen as protecting friends beside Me? Lo! We have prepared hell as a welcome for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who deny the truth, think that they can make My servants patrons instead of Me? We have reserved Hell as a lodging for those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deem then those who disbelieve that they may take My bondmen, instead of Me, as patrons! Verily We have gotten ready the Hell for the infidels as an entertainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the faithless suppose that they have taken My servants for guardians in My stead? Indeed, We have prepared hell for the hospitality of the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the Unbelievers think that they can take My servants as protectors besides Me? Verily We have prepared Hell for the Unbelievers for (their) entertainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do then those who disbelieve think that they can take My slaves [i.e., the angels, Allah's Messengers, 'Iesa (Jesus), son of Maryam (Mary), etc.] as Auliya' (lords, gods, protectors, etc.) besides Me? Verily, We have prepared Hell as an entertainment for the disbelievers (in the Oneness of Allah Islamic Monotheism).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the unbelievers think that they can take My worshipers as guides other than Me? We have prepared Gehenna to be the hospitality of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do those who disbelieve think that they can take My servants for masters instead of Me? We have prepared Hell for the hospitality of the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do those who disbelieve think that they can take My servants instead of Me as allies? Indeed, We have prepared Hell for the disbelievers as a lodging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:102] Do the disbelievers reckon that they can take My servants, namely, My angels, [as well as] Jesus and Ezra, as patrons, as lords, beside Me? (awliyā’a, ‘as patrons’, constitutes the second [direct] object of [the verb] yattakhidhū, ‘that they can take’; the second direct object of [the verb] hasiba, ‘reckon’, has been omitted). The meaning is: do they suppose that the mentioned ‘taking [as patrons]’ will not incur My wrath and that I will not punish them for this? No! Truly We have prepared Hell for the disbelievers, these [the ones mentioned above] and others, as [a place of] hospitality, in other words, it has been prepared for them just as a house is prepared for a guest.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Do the disbelievers) in Muhammad (pbuh) and in the Qur'an (reckon that they can choose My bondmen) can worship My servants (as protecting friends beside Me?) think that they can choose my servants as deities beside Me; thinking that they will help them in this life and in the Hereafter? It is also said that this means: is it enough that the disbelievers choose to worship My servants as deities? (Lo! We have prepared hell as a welcome for the disbelievers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على سبيل التقريع والتوبيخ للكفرة المشركين المتخذين آلهة سوى الله من مصنوعاته ومخلوقاته: { أَفَحَسِبَ } وظن القوم { ٱلَّذِينَ كَفَرُوۤاْ } وأشركوا بسبب { أَن يَتَّخِذُواْ عِبَادِي مِن دُونِيۤ } مثل عزير وعيسى وجميع الأوثان والأصنام { أَوْلِيَآءَ } آلهة يعبدونهم كعبادتي أنا لا نأخذهم ولا ننتقم منهم في يوم الجزاء؟! كلا وحاشا\n\n\n\n\nوكيف لا نأخذهم { إِنَّآ } من كمال قهرنا وغضبنا على من أشرك بنا غيرناَ، وأثبت إلهاً سوانا { أَعْتَدْنَا } وهيأنا { جَهَنَّمَ } البعد والخذلان الممتلة بنيران الحرمان { لِلْكَافِرِينَ } المعرضين عن مقتضيات آياتنا وكتبنا ورسلنا { نُزُلاً } [الكهف: 102] أي: منزلاً معداً ينزلون فيها يوم الجزاء نزول المؤمنين في جنة الوصال ومقر الآمال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أن يتخذوا }: سد مسد المفعولين، أو حذف الثاني، أي: أَحَسِبُوا اتخاذهم نافعَهم و { نزلاً }: حال من جهنم\n يقول الحقّ جلّ جلاله: منكرًا على الكفار المتقدمين: { أفَحَسِبَ الذين كفروا } حين أعرضوا عن ذكري، وكانت أعينهم في غطاء عن رؤية دلائل توحيدي، { أن يتخذوا عبادي } كالملائكة والمسيح وعزير، أو الشياطين لأنهم عباد، { من دُونِي أولياءَ } أي: معبودين من دوني، يُوالونهِم بالعبادة، أن ذلك ينفعهم، أو: ألا نعذبهم على ذلك، بل نعذبهم على ذلك، { إِنا أَعتدنا } يَسَّرنا وهيأنا { جهنمَ للكافرين نُزُلاً } أي: شيئًا يتمتعون به أول ورودهم القيامة\n والنزُل: ما يقدم للنزيل أي: الضيف، وعدل عن الإضمار ذمًا لهم على كفرهم، وإشعارًا بأن ذلك الإعتاد بسبب كفرهم، وعبَّر بالإعْتادِ تهكمًا بهم، وتخطئة لهم، حيث كان اتخاذهم أولياء من قبيل العتاد، وإعداد الزاد ليوم المعاد، فكأنه قيل: إنا أعتدنا لهم، مكان ما أعدوا لأنفسهم من العدة والذُّخْرِ،، جهنم عدة لهم\n وفي ذكر النُزل: إيماء إلى أن لهم وراء جهنم من العذاب ما هو أنموذج له، وتستحقر دونه، وقيل: النزل: موضع النزول، أي: أعتدناها لهم منزلاً يقيمون فيه\n والله تعالى أعلم\n الإشارة: ما أحببتَ شيئًا إلا وكنتَ له عبدًا، وهو لا يُحب أن تكون لغيره عبدًا، فأَفْرد قلبك لله، وأَخْرِج منه كلَّ ما سواه، فحينئذ تكونُ عبدًا لله، حرًا مما سواه، فكل ما سوى الله باطلٌ، وظل آفل، فكن إبراهيميًا، حيث قال:\n",
      "translations": []
    }
  ]
}