{
  "chapter": "الكهف",
  "text": "ثم بعثنهم لنعلم اى الحزبين احصى لما لبثوا۟ امدا",
  "translations": [
    {
      "translation": "Then roused them to ascertain which of the two groups could account for the period they had stayed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and then roused them so that We might see which of the two parties could best tell the length of their stay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We roused them to find out which of the party had the correct account of the duration of their sleep in the cave.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then awakened them to see which of the two groups more accurately tells the period they had stayed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We raised them up, that We might test which of the two parties was best at calculating the time period they tarried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We raised them up that We might know which of the two parties was best able to compute the time for which they remained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Afterwards. We raised them up again, that We might know which of the two parties would better calculate the while they had tarried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And afterward We raised them up that We might know which of the two parties would best calculate the time that they had tarried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We woke them up again so that We might see which of the two groups would better calculate the time they had stayed there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter We raised them up that We might know which of the two parties was best at reckoning the time that they had tarried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We aroused them that We might know which of the two groups better reckoned the period they had stayed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We roused them, in order to test which of the two parties was best at calculating the term of years they had tarried!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We raised them up (from their sleep), that We might test which of the two parties was best at calculating the time period that they had tarried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and thereafter We revived them to find out which of the two parties could best calculate the length of their stay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We awakened them to know which of the two groups could better calculate the length of their stay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We awakened them that We might show which of the two factions was most precise in calculating what [extent] they had remained in time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:12] Then We aroused them, We awakened them, that We might know, a knowledge of direct vision, which of the two parties, the two groups in disagreement over the length of their stay [in the cave], was better in calculating (ahsā is [of the pattern] of af‘al, meaning ‘more precise’]) what they had tarried (li-mā labithū is semantically connected to the following) in [terms of the] length of time (amadan, [in the accusative] denotes purpose).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And afterward We raised them up) We woke them up just as We sent them to sleep (that We might know) We might see (which of the two parties) the believers or the disbelievers (would best calculate the time) the duration (that they had tarried) in the Cave.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَحْصَىٰ لِمَا لَبِثُواْ أَمَداً } يعني غَايةً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ثم بعثناهم } أي: نبهناهم عن نوم الغفلة بقيامهم عن مرقد البدن ومعرفتهم بالله وبنفوسهم المجرّدة { لنعلم } أي: ليظهر علمنا في مظاهرهم أو مظاهر غيرهم من سائر الناس { أيّ الحزبين } المختلفين في مدة لبثهم وضبط غايته الذين يعينون المدة أم يكلون علمه إلى الله، فإن الناس مختلفون في زمان الغيبة\n يقول بعضهم: يخرج أحدهم على رأس كل ألف سنة وهو يوم عند الله، لقوله:\n\n[الحج، الآية: 47]\n ويقول بعضهم: على رأس كل سبعمائة عام أو على رأس كل مائة، وهو بعض يوم، كما قالوا:\n\n[الكهف، الآية: 19]\n والمحققون المصيبون هم الذين يكلون علمه إلى الله كالذين قالوا:\n\n[الكهف، الآية: 19] ولهذا لم يعين رسول الله صلى الله عليه وسلم وقت ظهور المهديّ عليه السلام، وقال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ بَعَثْنَاهُمْ } وأيقظناهم من منامهم بعثَ الموتى للحشر { لِنَعْلَمَ } أي: نجرّب ونميّز { أَيُّ الحِزْبَيْنِ } المختلفين بعدما اختلفوا في مدة لبثهم { أَحْصَىٰ }  أي: أضبط وأحفظ { لِمَا لَبِثُواْ } من المدة { أَمَداً } [الكهف: 12] يعني: أيهم أحفظ ضبطاً لمدة رقودهم في الكهف، فكلا الفريقين\n\n\nأي: اليهود والنصارى\n لا يعلمان مدة لبثهم حقااً مطاباً للواقع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { لِما لبثوا }: حال منه، أو مفعول \" أحصى \" ، واللام زائدة، و { ما }: موصولة، و { أمدًا }: تمييز، وقيل: { أحصى }: اسم تفضيل، من الإحصاء بحذف الزوائد، و { أمدًا }: منصوب بفعل دل عليه أحصى، أي: يحصى كقوله:\n\nلأن اسم التفضيل لا ينصب المفعول به، إجماعًا، ويجوز أن يكون تمييزًا بعد اسم التفضيل\n يقول الحقّ جلّ جلاله: { أم حَسِبْتَ } أي: ظننت يا محمد، والمراد: حسبان أمته { أنَّ أصحابَ الكهف } ، وهو الغار الواسع في الجبل\n واختُلف في موضعه فقيل: بقرب فلسطين، وقيل: بالأندلس بمقربة من لوشة في جهة غرناطة\n وذكر ابن عطية أنه دخل كهفهم، وفيه موتى، ومعهم كلبهم، وعليهم مسجد، وقريب منه بناء يقال له الرَّقِيم، قد بقي موضع جدرانه، وفي تلك الجهة آثار يقال لها: مدينة \" دقيوس \" ، والله أعلم\n وقال ابن جزي: ومما يُبعد ذلك ما رُوي أن معاوية مرَّ عليهم، وأراد الدخول إليهم ولم يدخل، هيبةً، ومعاوية لم يدخل الأندلس قط، وأيضًأ: فإن الموتى في لَوْشة يراهم الناس، ولا يدرك أحد الرعب الذي ذكر الله في أهل الكهف\n هـ\n والمشهور: أن الرقيم هو اللوح المكتوب فيه أسماؤهم وأنسابهم، وكان جُعِل ذلك الكتاب في خزانة الملك، وهو لوح من رصاص أو حجر، أمر بكتب أسمائهم فيه لما شكا قومُهم فقْدَهم\n وقيل: اسم كلبهم\n أي: أظننت أنهم { كانوا } في قصتهم { من } بين { آياتنا عَجَبًا } أي: كانوا عجبًا دون باقي آياتنا، ليس الأمر كذلك\n والمعنى: أن قصتهم، وإن كانت خارقة للعادة، ليست بعجيبة، بالنسبة إلى سائر الآيات التي من تعاجيبها ما ذكر من خلق الله تعالى على الأرض، من الأجناس والأنواع الفائتة الحصر من مادة واحدة، بل هي عندها كالنزر الحقير\n وقال القشيري: أزال موضع الأعجوبة من أوصافهم، بما أضاف إلى نفسه بقوله: { من آياتنا } ، وقَلْبُ العادةِ مِنْ قِبَلِ اللهِ غيرُ مُسْتَنْكَرٍ ولا مُبْتَدَعٍ\n هـ\n ثم ذكر أول قصتهم، فقال: { إِذْ أوى الفتيةُ }: جمع فتى، وهو الشاب الكامل، أي: اذكر حين التجأ الفتية إلى الكهف، هاربين بدينهم، خائفين على إيمانهم من كفار قومهم، ورأسهم \" دقيانوس \" ، على ما يأتي في قصتهم\n\n\n{ فقالوا } حين دخلوا الغار: { ربَّنا آتنا من لدُنك } من مستبطن أمورك وخزائن رحمتك الخاصة المكنونة عن أعين العادات، { رحمةً } خاصة تستوجب الرفق والأمن من الأعداء، { وَهَيِّئ }: أصلح { لنا من أمرنا } الذي نحن عليه من مفارقة الكفار ومهاجرتهم، { رَشَدًا }: هداية نصير بها راشدين مهتدين، أو: اجعل أمرنا كله رشدًا وصوابًا، كقولك: لقيت منك أسدًا، فتكون من باب التجريد، أو: إصابة للطريق الموصل إلى المطلوب، وأصل التهيئة: إحداث هيئة الشيء\n { فَضَرَبْنَا على آذانهم } أي: أَنَمْنَاهُمْ، شبَّه الإنامة الثقيلة المانعة من وصول الأصوات إلى الآذان بضرب الحجاب عليها، وتخصيص الآذان بالذكر مع اشتراك سائر المشاعر لها في الحَجْب عن الشعور عند النوم لأنها تحتاج إلى الحجب أكثر، إذ هي الطريقة للتيقظ غالبًا\n والفاء في { فضربنا }: مثلها في قوله:\n\n[الأنبياء: 90]، بعد قوله: { إِذ نادى } ، فإنَّ الضرب المذكور، وما ترتب عليه من التقليب ذات اليمين وذات الشمال، والبعث، وغير ذلك، إيتاءُ رحمةٍ لَدُنِّيَّةٍ خفيةٍ عن أبصار المستمسكين بالأسباب العادية استجابة لدعوتهم، أي: فاستجبنا لهم وأَنَمْناهم، { في الكهف سنينَ عددًا } أي: ذوات عدد، أو تُعَدُّ عددًا، أو معدودة، ووصْف السنين بذلك: إمَّا للتكثير، وهو الأنسب بكمال القدرة، أو التقليل، وهو الأليق بمقام إنكار كون القصة عجبًا من سائر الآيات العجيبة فإن مدة لبثهم كبعض يوم عنده تعالى\n { ثم بعثناهم } أيقظناهم من تلك النومة الشبيهة بالموت، { لنعْلَمَ } علم مشاهدة، أي: ليتعلق علمنا تعلقًا حاليًّا كتعلُّقه أولاً تعلقًا استقباليًّا، { أيُّ الحزبين }: الفريقين المختلفين في مدة لبثهم المذكور في قوله: { قالوا لبثنا يومًا\n\n\n } الخ، { أحْصَى } أي: أضبط { لِما لَبِثُوا }: للبثهم، { أمدًا } أي: غاية، فيظهر بذلك عجزهم، ويُفوضوا ذلك إلى العليم الخبير، ويتعرفوا حالهم وما صنع الله بهم، من حفظ أبدانهم وأديانهم، فيزدادوا يقينًا بكمال قدرته وعلمه، وليتيقنوا به أمر البعث، ويكون ذلك لطفًا بمؤمني زمانهم، وآية بينة لكفارهم، وعبرةً لمن يأتي بعدهم، فهذه حِكَمُ إيقاظهم بعد نومهم، والله عليم حكيم\n الإشارة: عادته تعالى فيمن انقطع إليه بكليته، وآوى إلى كهف رعايته، وآيس من رفق مخلوقاته، أن يكلأه بعين عنايته، ويرعاه بحفظ رعايته، ويُغَيِّبَ سمع قلبه عن صوت الأكدار، ويصون عين بصيرته عن رؤية الأغيار، حين انحاشوا إلى حِمى رحمته المانع، وتظللوا تحت ظل رشده الواسع\n وبالله التوفيق\n ثمَّ تمم قصتهم فقال: { نَحْنُ نَقُصُّ عَلَيْكَ نبَأَهُم\n\n\n }\n",
      "translations": []
    }
  ]
}