{
  "chapter": "الكهف",
  "text": "اذ اوى الفتية الى الكهف فقالوا۟ ربنا ءاتنا من لدنك رحمة وهيئ لنا من امرنا رشدا",
  "translations": [
    {
      "translation": "When the young men took refuge in the cave and said, 'Our Lord, give us mercy directly from You and open the way for us to right guidance in our situation.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those young men took shelter in the cave, and prayed: \"O Lord, grant us Your favour and dispose our affair aright,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those youths sought refuge in the Cave and said: \"Our Lord! Grant us mercy from Yourself and provide for us rectitude in our affairs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the youth sought refuge in the cave they prayed \"Lord, grant us mercy and help us to get out of this trouble in a righteous way\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the young men took refuge in the Cave – then said, “Our Lord! Give us mercy from Yourself, and arrange guidance for us in our affair.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the young men fled for refuge to Al-Kahf. They said: \"Our Lord! Bestow on us mercy from Yourself, and facilitate for us our affair in the right way!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the youths sought refuge in the cave, they said: Our Lord! grant us mercy from Thee, and provide for us a right course in our affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the youths took refuge in the Cave saying, 'Our lord, give us mercy from Thee, and furnish us with rectitude in our affair.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the young men fled for refuge to the Cave and said: Our Lord! Give us mercy from Thy presence, and shape for us right conduct in our plight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the young men sought refuge in the cave, they said, \"Our Lord, grant us Your special mercy and give us right guidance in our affair.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time the youths betook themselves to the cave, then said: our Lord! vouchsafe unto us mercy from before Thee, and prepare for us in our affair a right course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the youths took refuge in the Cave, they said, ‘Our Lord! Grant us a mercy from Yourself, and help us on to rectitude in our affair.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, the youths betook themselves to the Cave: they said, \"Our Lord! bestow on us Mercy from Thyself, and dispose of our affair for us in the right way!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when the young men fled for refuge (from their disbelieving folk) to the Cave, they said: \"Our Lord! Bestow on us mercy from Yourself, and facilitate for us our affair in the right way!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the youths sought refuge in the Cave, they said: 'Lord give us from Your Mercy and furnish us with rectitude in our affair'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the youths took shelter in the cave, they said, “Our Lord, give us mercy from Yourself, and bless our affair with guidance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Mention] when the youths retreated to the cave and said, \"Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:10] Mention, when the youths took refuge in the Cave (fitya, ‘youths’, is the plural of fatā, and denotes a mature young man) fearing for their faith from their disbelieving people, they said, ‘Our Lord! Give us mercy from Yourself and remedy for us our affair through rectitude’, [through Your] guidance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When the young men fled for refuge to the Cave) when a group of youth entered the Cave (and said) when they entered the cave: (Our Lord!) our Lord! (Give us mercy from Thy presence) i.e. make us hold firmly to your religion (and shape for us right conduct in our plight) make for us a way out.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إذ أوى الفتْيَة إلى الكهف } أي: كهف البدن بالتعلق به { فقالوا } بلسان الحال { ربنا آتنا من لدُنك } أي: من خزائن رحمتك التي هي أسماؤك الحسنى { رحمة } كما لا يناسب استعدادنا ويقتضيه { وهيئ لنا من أمرنا } الذي نحن فيه من مفارقة العالم العلوي والهبوط إلى العالم السفلي للاستكمال { رشداً } استقامة إليك في سلوك طريقك والتوجه إلى جنابك، أي: طلبوا بالاتصاف البدني والتعلق بآلات الكمال وأسبابه الكمال العلمي والعملي",
      "translations": [
        {
          "translation": "\n\n{When the youths went to the cave} i.e. the body's cave in relation to it {they said} in the present tense {Our Lord, grant us from Your presence} i.e. from the storehouses of Your mercy which are Your Most Beautiful Names {mercy} as befits our preparation and requires {and make for us from our affair} that which we are in of separation from the upper world and descending into the lower world to complete {right guidance} in our conduct of following Your path and turning to Your Lord.,\n\nThey asked for a physical description and mentioned the perfection of the body and the perfection of the instruments and the scientific and practical causes of perfection.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل قصة أصحاب الكهف وقت { إِذْ أَوَى } أي: التجأ ورجع { ٱلْفِتْيَةُ } الخمسة أو السبعة أو الثمانية من أشراف الروم ورؤسائهم، دعاهم ملكهم دقيانوس إلى الشرك، وهم موحّدون في أفسهم، فأبَوا وهربوا منه { إِلَى ٱلْكَهْفِ } ملتجئين { فَقَالُواْ } مناجين مستغيثين من الله: { رَبَّنَآ } يا من ربَّانا بأنواع اللطف الكرم وفقّنا بشرف توحيدك وتقديسك { آتِنَا } بفظلك وجودك { مِن لَّدُنكَ } لا بسبب أعمالنا ومتقضياتها { رَحْمَةً } تنجينا عن يد عدونا وعذابه، وعن وبال ما دعانا إليه من الكفر والعصيان { وَهَيِّىءْ لَنَا } أسباب معاشنا حين كنا فارّين من العدو وملتجئين إليك، مستعيذين بكنفك وجورك ووفق علينا { مِنْ أَمْرِنَا } الذي نعمل لمرضاتك ولوجهك الكريم { رَشَداً } [الكهف: 10] أي: هدايةً توصلنا إلى زلال توحيدك آمنين فائزين بلا خوفٍ وخطرٍ، فاستجبنا لهم مناجاتهم وأعطيناهم حاجاتههم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أم }: منقطعة مقدرة ببل، التي هي للانتقال من حديث إلى حديث، لا للإبطال، والهمزة: للاستفهام عند الجمهور، وبمعنى \" بل \" ، فقط، عند غيرهم، و { عجبًا }: خبر كان، و { من آياتنا }: حال منه، و { إذ أوى }: ظرف لعجبًا، لا لحَسِبَْتَ، أو مفعول اذكر، أي: اذكر هذا الوقت العجيب، وهو حين التجأ الفتية إلى الكهف، و { لنا } و { مِنْ أمرنا }: يتعلق بـ { هيئ } ، و { أيّ الحزبين }: معلق لنعلم عن المفعولين لما فيه من معنى الاستفهام، وهو مبتدأ، و \" أحصى \": خبره، وهو فعل ماضٍ، و { أمدًا }: مفعوله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:16",
      "similarity": 0.6372394871101822
    },
    {
      "verse": "18:11",
      "similarity": 0.3738818828143593
    },
    {
      "verse": "18:9",
      "similarity": 0.2786740829282818
    },
    {
      "verse": "18:25",
      "similarity": 0.2683968663528948
    },
    {
      "verse": "18:65",
      "similarity": 0.1828443644821003
    }
  ]
}