{
  "chapter": "الكهف",
  "text": "او۟لئك الذين كفروا۟ بـايت ربهم ولقائه فحبطت اعملهم فلا نقيم لهم يوم القيمة وزنا",
  "translations": [
    {
      "translation": "Those are the people who reject their Lord's Signs and the meeting with Him. Their actions will come to nothing and, on the Day of Rising, We will not assign them any weight.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who reject the signs of their Lord, and the meeting with Him. So their good deeds will be fruitless, and on the Day of Judgement We shall not appoint any weighing for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones who refused to believe in the revelations of their Lord and that they are bound to meet Him. Hence, all their deeds have come to naught, and We shall assign no weight to them on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have rejected the revelations of their Lord and their meeting with Him. Thus, their deeds will be made devoid of all virtue and will be of no value on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people who disbelieved in the signs of their Lord and in the meeting with Him, therefore all their deeds are in vain –We shall therefore not establish any weighing for them on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who deny the Ayat of their Lord and the meeting with Him. So their works are in vain, and on the Day of Resurrection, We shall assign no weight for them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who disbelieve in the communications of their Lord and His meeting, so their deeds become null, and therefore We will not set up a balance for them on the day of resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they that disbelieve in the signs of their Lord and the encounter with Him; their works have failed, and on the Day of Resurrection We shall not assign to them any weight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who disbelieve in the revelations of their Lord and in the meeting with Him. Therefor their works are vain, and on the Day of Resurrection We assign no weight to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who deny their Lord's signs and the meeting with Him.\" So their works are in vain, and We shall give them no weight on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who disbelieve in the signs of their Lord and in the meeting with Him; so of non-effect will be made their works, and We shall not allow them on the Day of Judgment any weight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who deny the signs of their Lord and encounter with Him. So their works have failed. On the Day of Resurrection We will not give them any weight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who deny the Signs of their Lord and the fact of their having to meet Him (in the Hereafter): vain will be their works, nor shall We, on the Day of Judgment, give them any weight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who deny the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of their Lord and the Meeting with Him (in the Hereafter). So their works are in vain, and on the Day of Resurrection, We shall not give them any weight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who disbelieve the verses of their Lord and deny that they will ever meet Him their deeds have failed. On the Day of Resurrection, We shall not give any weight to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who rejected the communications of their Lord, and the encounter with Him. So their works are in vain. And on the Day of Resurrection, We will consider them of no weight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones who disbelieve in the verses of their Lord and in [their] meeting Him, so their deeds have become worthless; and We will not assign to them on the Day of Resurrection any importance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:105] Those are they who disbelieve in the signs of their Lord, in the proofs of His Oneness, [proofs] such as the Qur’ān and otherwise, and the encounter with Him’, that is, and [who disbelieve] in resurrection, reckoning, reward and punishment. So their works have failed, they are invalid, and on the Day of Resurrection We shall not assign any weight to them, in other words, We shall not accord them any value.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those are they who disbelieve in the revelations of their Lord) they disbelieve in Muhammad (pbuh) and in the Qur'an, (and in the meeting with Him) i.e. in resurrection after death. (Therefore their works) their good works (are vain) are thwarted, (and on the Day of Resurrection We assign no weight to them) to their 324 works; it is also said that this means: not an atom weight of their works will be weighed on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلَـٰئِكَ } البعداء الأشقياء المجبولون على الكفر والشقاق هم { ٱلَّذِينَ كَفَرُواْ } وكذبوا { بِآيَاتِ رَبِّهِمْ } الدالة على توحيده وتصديق رسله وكتبه { وَلِقَائِهِ } الموعود لعباده عند إنجلاء جميعهم وارتفاع أستارهم { فَحَبِطَتْ } أي: ضاعت واضمحلت وضلت في النشأة الأخرى { أَعْمَالُهُمْ } التي جاءوا بها في النشأة الأولى، ولطلب النفع والربح { فَلاَ نُقِيمُ } ونضيع { لَهُمْ يَوْمَ ٱلْقِيَامَةِ } المعدة لجزاء الأعمال وتنقيدها { وَزْناً } [الكهف: 105] مقداراً يُنتفع ويُعتد بها؛ لانحباطها وسقوطها عن درجة الاعتبار لدى الملك الجبار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والمختار: العموم في كل من عمل عملاً فاسدًا، يظن أنه صحيح من الكفرة، بدليل قوله: { أولئك الذين كفروا بآيات ربهم }: بدلائل التوحيد، عقلاً ونقلاً، { ولقائه }: البعث وما يتبعه من أمور الآخرة، { فحَبِطَتْ } لذلك { أعمالُهم } المعهودة حبوطًا كليًا، { فلا نُقيم لهم } أي: لأولئك الموصوفين بحبوط الأعمال، { يومَ القيامة وزنًا } أي: فنُهينُهم، ولا نجعل لهم مقدارًا واعتبارًا لأن مدار التكريم: الأعمالُ الصالحة، وقد حبطت بالمرة قال صلى الله عليه وسلم:\n\n \" يُؤتى بالرَّجُل السَّمِين العَظِيم يَوْمَ القِيَامَةِ، فلاَ يَزنُ جَنَاحَ بَعُوضَةٍ \" \n\nاقْرَأوا إن شِئْتُمْ: { فلا نُقِيمُ لَهُمْ يَوْمَ القِيَامَةِ وَزْنًا }\n أو: لا نضع لأجل وزن أعمالهم ميزانًا لأن الكفر أحبطها\n أو: لا نقيم لهم وزنًا نافعًا\n قال أبو سعيد الخدري رضي الله عنه: يأتي أناسٌ بأعمالهم يوم القيامة، هي عندهم في العِظَم كجبال تهامة، فإذا وزنوها لا تزن شيئًا، فذلك قوله: { فلا نقيم لهم يوم القيامة وزنًا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:147",
      "similarity": 0.6327526628498515
    },
    {
      "verse": "3:22",
      "similarity": 0.6118077475588276
    },
    {
      "verse": "6:88",
      "similarity": 0.5927541667067772
    },
    {
      "verse": "47:9",
      "similarity": 0.5744306147479287
    },
    {
      "verse": "39:65",
      "similarity": 0.5299121824824226
    }
  ]
}