{
  "chapter": "الكهف",
  "text": "وترى الشمس اذا طلعت تزور عن كهفهم ذات اليمين واذا غربت تقرضهم ذات الشمال وهم فى فجوة منه ذلك من ءايت الله من يهد الله فهو المهتد ومن يضلل فلن تجد له وليا مرشدا",
  "translations": [
    {
      "translation": "You would have seen the sun, when it rose, inclining away from their cave towards the right, and, when it set, leaving them behind on the left, while they were lying in an open part of it. That was one of Allah's Signs. Whoever Allah guides is truly guided. But if He misguides someone, you will find no protector for them to guide them rightly.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may well have seen when the sun came up it moved away to the right of the cave, and when it went down it turned away to the left, and they stayed in its open space. This was among the signs of God. Whoever is guided by God follows the right path; and whosoever goes astray will not find a guide to show him the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had you seen them in the Cave it would have appeared to you that when the sun rose, it moved away from their Cave to the right; and when it set, it turned away from them to the left, while they remained in a spacious hollow in the Cave. This is one of the Signs of Allah. Whomsoever Allah guides, he alone is led aright; and whomsoever Allah lets go astray, you will find for him no guardian to direct him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No sunlight could reach them during their sleep in the cave. One could see the rising sun decline to the right of their cave and the setting sun move its way to the left whilst they were sleeping in an opening of the cave. This is one of the miracles of God. Whomever God guides receives the right guidance and you will never find a guardian or guide for those whom He causes to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him) you will see the sun that when it rises it shifts away to the right of their cave, and when it sets it shifts away to their left, and they are in the open ground of that cave; this is from among the signs of Allah; whomever Allah guides – only he is therefore guided; and whomever He sends astray – you will never find for him a friend who guides.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you might have seen the sun, when it rose, declining to the right from their cave, and when it set, turning away from them to the left, while they lay in the midst of the cave. That is from the Ayat of Allah. He whom Allah guides, he is the rightly-guided; but he whom He sends astray, for him you will find no guardian to lead him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you might see the sun when it rose, decline from their cave towards the right hand, and when it set, leave them behind on the left while they were in a wide space thereof. This is of the signs of Allah; whomsoever Allah guides, he is the rightly guided one, and whomsoever He causes to err, you shall not find for him any friend to lead (him) aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou mightest have seen the sun, when it rose, inclining from their Cave towards the right, and, when it set, passing them by on the left, while they were in a broad fissure of the Cave. That was one of God's signs; whomsoever God guides, he is rightly guided, and whomsoever He leads astray, thou wilt not find for him a protector to direct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou mightest have seen the sun when it rose move away from their cave to the right, and when it set go past them on the left, and they were in the cleft thereof. That was (one) of the portents of Allah. He whom Allah guideth, he indeed is led aright, and he whom He sendeth astray, for him thou wilt not find a guiding friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sun could be observed to incline away from their cave on the right, as it rose, and to turn away from them on the left, when it set, while they lay in the wide space inside the cave. This is one of the signs of God. He whom God guides is rightly guided; but for him whom He lets go astray, you will find no helper or guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou Woudst behold the sun when it riseth veering away from their cave on the right, and when it setteth, passing them by on the left, while they were in the spacious part thereof: that is of the signs of Allah. Whomsoever Allah guideth, he indeed is the guided; and whomsoever He sendeth astray, for him thou wilt never find a directing friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may see the sun, when it rises, slanting toward the right of their cave, and, when it sets, cut across them towards the left, and they are in a cavern within it. That is one of Allah’s signs. Whomever Allah guides is rightly guided, and whomever He leads astray, you will never find for him any guardian or guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wouldst have seen the sun, when it rose, declining to the right from their Cave, and when it set, turning away from them to the left, while they lay in the open space in the midst of the Cave. Such are among the Signs of Allah: He whom Allah, guides is rightly guided; but he whom Allah leaves to stray,- for him wilt thou find no protector to lead him to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you might have seen the sun, when it rose, declining to the right from their Cave, and when it set, turning away from them to the left, while they lay in the midst of the Cave. That is (one) of the Ayat (proofs, evidences, signs) of Allah. He whom Allah guides, is rightly guided; but he whom He sends astray, for him you will find no Wali (guiding friend) to lead him (to the right Path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You might have seen the rising sun incline towards the right of their Cave, and, as it set go past them on the left, while they stayed within an open space in the Cave. That was one of the signs of Allah. He whom Allah guides is rightly guided; but he whom He leads astray you shall not find for him a guardian to guide him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You would have seen the sun, when it rose, veering away from their cave towards the right, and when it sets, moving away from them to the left, as they lay in the midst of the cave. That was one of God’s wonders. He whom God guides is truly guided; but he whom He misguides, for him you will find no directing friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [had you been present], you would see the sun when it rose, inclining away from their cave on the right, and when it set, passing away from them on the left, while they were [laying] within an open space thereof. That was from the signs of Allah. He whom Allah guides is the [rightly] guided, but he whom He leaves astray - never will you find for him a protecting guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:17] And you might have seen the sun, when it rose, inclining (read tazzāwaru or tazāwaru) away from their Cave towards the right, side of it, and, when it set, go past them on the left, avoid them and pass over them, so that it does not fall on them at all, while they were in a cavern therein, in an ample space inside the Cave where the coolness and the gentle breeze of the winds reached them. That, which is mentioned, was [one] of God’s signs, [one of] the proofs of His power. Whomever God guides, he indeed is rightly guided, and whomever He leads astray, you will not find for him a guiding friend.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thou mightest have seen the sun when it rose move away) decline (from their cave to the right) the right of the Cave, (and when it set go past them on the left) the left of the Cave, (and they were in the cleft thereof) on a side of the Cave; it is also said that this means: they were in a space which was reached by the light of day. (That) which I have mentioned of their story (was (one) of the portents of Allah) of the marvels of Allah. (He whom Allah guideth) to His religion, (he indeed is led aright) to his religion, (and he whom He sendeth astray, for him thou wilt not find a guiding friend) who might lead him to the guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَّقْرِضُهُمْ ذَاتَ ٱلشِّمَالِ } معناه تَقْطَعُهُم وتُجَاوِزَهُم\n\n\n\n\nوقوله تعالى: { وَهُمْ فِي فَجْوَةٍ مِّنْهُ } معناهُ فِي نَاحيةٍ مِن الكَهفِ\n وقال: هو المَكانُ المُتَطاطِئ\n ويقالُ: فِي مُتسعٍ\n والجَمعُ فَجَواتٌ وفِجاءٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Turn to them with your right side\" [Qur'an 30:22], means to turn away from them and to ignore them.\n\n\nAnd His words, {And they are in a state of suspense from it}, mean that they are in a part of the cave.\n He said: \"This is the place of intersection.\"\n It is said: In a {multitude}\n\nIt is said: In a multitude.\n\n\nAnd the {jam'} (collecting together) is {fajawatun} (plural of {faj'}) (syllables), and {fija'un} (plural of {faja'a}) (vowels).",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وترى الشمس } أي: شمس الروح { إذا طلعت } أي: ترقت بالتجرّد عن غواشي الجسم وظهرت من أفقه تميل بهم من جهة البدن وميله ومحبته إلى جهة اليمين أي: جانب عالم القدس وطريق أعمال البرّ من الخيرات والفضائل والحسنات والطاعات\n وسيرة الأبرار، فإن الأبرار هم أصحاب اليمين\n { وإذا غربت } أي: هوت في الجسم واحتجبت به، واختفت في ظلماته وغواشيه، وخمد نورها، تقطعهم وتفارقهم كائنين في جهة الشمال، أي: جانب النفس وطريق أعمال السوء فينهمكون في المعاصي والسيئات والشرور والرذائل\n وسيرة الفجار الذين هم أصحاب الشمال { وهم في فجوة منه } أي: في مجال متسع من بدنهم هو مقام النفس والطبيعة، فإن فيه متفسحاً لا يصيبهم فيه نور الروح\n واعلم أن الوجه الذي يلي الروح من القلب موضع منور بنور الروح يسمى العقل وهو الباعث على الخير والمطرق لإلهام الملك والوجه الذي يلي النفس منه مظلم بظلمة صفاتها يسمى الصدر وهو محل وسوسة الشيطان كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال رفق الله إياهم، ورأفته معهم أيها الرائي { تَرَى ٱلشَّمْسَ إِذَا طَلَعَت } من مشرقها في مدة الصيف حين ازدياد حرارتها { تَّزَاوَرُ } أي: تنقلب وتميل { عَن كَهْفِهِمْ ذَاتَ ٱلْيَمِينِ } أي: جانب يمين الغار؛ لئلا تؤذيهم بشعاعها وحرارتها { وَإِذَا غَرَبَت } أي: زالت ومالت عن الاستواء نحو المغرب { تَّقْرِضُهُمْ } أي: تقطعهم وتنصرف عنهم { ذَاتَ ٱلشِّمَالِ } أي: جانب يسار الغار؛ لحفظهم عن حرِّها { وَهُمْ فِي فَجْوَةٍ مِّنْهُ } أي: والحال أنهم في متسع الغر ووسطه لا في زواياه؛ بحيث لو لم يكن رعاية الله وحفظه إياهم، وصرف شعاع الشمس عنهم لكانت منتشعشعة عليهم إلى وقت الغروب { ذٰلِكَ } أي: نشر الرحمة وتهيئة الرفق والرأفة وصرف أذى الشمس، وكذا جميع المؤذيات عنهم { مِنْ آيَاتِ ٱللَّهِ } الدالة على قبوله سبحانه إياهم ورضاه عنهم كونهم مهتدين إلى توحيده، موفقين من عنده، مبتغين لرضاه، متوكلين عليه في جميع الأمور، راضين بقضائه في كل الأحوال، مخلصين له في جميع الأعمال\n\n\n\n\n{ مَن يَهْدِ ٱللَّهُ } وأراد هدايته في سابق علمه وقضائه، ومضى عليهم حكمه { فَهُوَ ٱلْمُهْتَدِ } الموفق على الهداية والفوز بالفلاح المقصور عليها، وإن لم يصدر ولم يسبق من الأعمال الصالحة { وَمَن يُضْلِلْ } الله وتعلق مشيئته بضلاله في سابق قضائه، فهو الضال المقصور على الضلالة وإن صدرت عنه الأعمال الصالحة، لا يتبدل ضلالها أصلاً، وبعدما أراد سبحانه ضلاله { فَلَن تَجِدَ لَهُ وَلِيّاً } يولي أمره بالشفاعة لينقذه من الضلال الفطري ويخرجه عن الوبال الجبلي { مُّرْشِداً } [الكهف: 17] يهديه ويرشده إلى طريق الرشاد ومنهج السداد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { تزاور } أصله: تتزاور، فأُدغمت التاء في الزاي\n وقرأ الكوفيون بحذفها، وابن عامر ويعقوب: \" تَزَوَّرُ \" كتَمرد، كلها من الزَّوْر بمعنى الميل\n و { ذات اليمين }: ظرف بمعنى الجهة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:10",
      "similarity": 0.1794081658065031
    },
    {
      "verse": "18:11",
      "similarity": 0.15970634503991796
    },
    {
      "verse": "58:2",
      "similarity": 0.1580075642946229
    },
    {
      "verse": "25:72",
      "similarity": 0.15697675906418168
    },
    {
      "verse": "102:2",
      "similarity": 0.15629992144028368
    }
  ]
}