{
  "chapter": "الكهف",
  "text": "قل لو كان البحر مدادا لكلمت ربى لنفد البحر قبل ان تنفد كلمت ربى ولو جئنا بمثله مددا",
  "translations": [
    {
      "translation": "Say: 'If all the sea was ink to write down the Words of my Lord, it would run out long before the Words of",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If the ocean turned to ink for writing down the colloquy of my Lord, the ocean itself would be exhausted ere the words (and wonders) of my Lord come to end, even if we brought another like it for replenishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If the sea were to become ink to record the Words of my Lord, indeed the sea would be all used up before the Words of my Lord are exhausted, and it would be the same even if We were to bring an equal amount of ink.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"Had the seas been used as ink to write down the words of my Lord, they would have all been consumed before the words of my Lord could have been recorded, even though replenished with a like quantity of ink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “If the sea became ink for the Words of my Lord, the sea would indeed be used up and the Words of my Lord would never – even if we bring another like it for help.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If the sea were ink for the Words of my Lord, surely, the sea would be exhausted before the Words of my Lord would be finished, even if We brought like it for its aid.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If the sea were ink for the words of my Lord, the sea would surely be consumed before the words of my Lord are exhausted, though We were to bring the like of that (sea) to add\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say:. 'If the sea were ink for the Words of my Lord, the sea would be spent before the Words of my Lord are spent, though We brought replenishment the like of it.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Though the sea became ink for the Words of my Lord, verily the sea would be used up before the words of my Lord were exhausted, even though We brought the like thereof to help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, \"If the ocean became ink for writing the words of my Lord, surely the ocean would be exhausted before the words of my Lord came to an end -- even if We were to add another ocean to it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: were the sea to become ink for the words of my Lord, the sea would surely exhaust ere the words of my Lord exhausted, even though We brought onot her like thereof for support.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘If the sea were ink for the words of my Lord, the sea would be spent before the words of my Lord are finished, though We replenish it with another like it.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If the ocean were ink (wherewith to write out) the words of my Lord, sooner would the ocean be exhausted than would the words of my Lord, even if we added another ocean like it, for its aid.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to mankind). \"If the sea were ink for (writing) the Words of my Lord, surely, the sea would be exhausted before the Words of my Lord would be finished, even if we brought (another sea) like it for its aid.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If the sea were ink for the Words of my Lord, the sea would surely be spent before the Words of my Lord are spent, even if We brought its like for replenishment'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If the ocean were ink for the words of my Lord, the ocean would run out, before the words of my Lord run out,” even if We were to bring the like of it in addition to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If the sea were ink for [writing] the words of my Lord, the sea would be exhausted before the words of my Lord were exhausted, even if We brought the like of it as a supplement.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:109] Say: ‘If the sea, in other words, [if] its waters, were ink (midād is what one writes with) for the Words of my Lord, [Words] that testify to His laws and His marvels, such that these [Words] are written with it, the sea would be spent, in recording them, before the Words of my Lord were spent (read as tanfada or yanfada) even though We brought the like of it, namely, [the like of] the sea, as replenishment’, in order to add it to the other [sea], it would [also] be spent, while they [God’s Words] would not be exhausted (madadan, ‘as replenishment’, in the accusative because it is a specification).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to the Jews: (Though the sea became ink for the Words of my Lord) for the knowledge of my Lord, (verily the sea would be used up before the Words of my Lord were exhausted) it is also said that 'the Words of my Lord' means: the disposition of my Lord, (even though We brought the like thereof to help) as an addition.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأمر سبحانه حبيبه بقوله: { قُل } لهم يا أكمل الرسل كلاماً يُسقط شبهتهم إن أنصفوا\n نحن لا ندعي أن من أوتي الحكمة فقد أوتي بجميع معلومات الله وعلومه\n وكيف ندَّعي هذا وهو ممتنع محالُ في غاية الامتناع والاستحالة\n إذ { لَّوْ كَانَ ٱلْبَحْرُ } أي: جنس البحر\n وهو جميع كرة الأرض { مِدَاداً } أي: ماء يُمدُّ به القلم للرقم والكتابة { لِّكَلِمَاتِ رَبِّي } أي: لثبتها وكتبها { لَنَفِدَ ٱلْبَحْرُ } وانتهى ألبتة\n لتناهيه وكونه محدداً { قَبْلَ أَن تَنفَدَ كَلِمَاتُ رَبِّي } لكونها غير متناهية { وَلَوْ جِئْنَا بِمِثْلِهِ } غير محدودةٍ بحدٍ معين\n وكيف لا تنفذ وتتناهى { وَ } أي: بمثل جنس البحر بل بأضعاف أمثاله وآلافها { مَدَداً } [الكهف: 109] إذ لا مناسبة بين المتناهي وغير المتناهي\n وإن فرض أضعافا وآلافاً\n\n{ قُلْ } يا أكمل الرسل بعدما بلغت لهم كلمات الله الغير المحصورة كلاماً خيالياً عن وصمة التفوق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { قل لو كان البحرُ } أي: جنس البحر { مِدَادًا } \n وهو ما تمد به الدواة من الحِبْر\n { لِكلماتِ ربي } وهي ما يقوله سبحانه لأهل الجنة\n من اللطف والإكرام\n مما لا تكيفُه الأوهام\n ولا تحيط به الأفكار\n فلو كانت البحار مدادًا والأشجار أقلامًا لنفدت\n ولم يبق منها شيء\n { قبل أن تنفد كلماتُ ربّي } لأن البحار متناهية\n وكلمات الله غير متناهية\n ثم أكّده بقوله: { ولو جئنا بمثله مدَدًا } أي: لنفد البحر من غير نفاد كلماته تعالى\n هذا لو لم يجيء بمثله مددًا\n بل ولو جئنا بمثله { مددًا } عونًا وزيادة لأن ما دخل عالم التكوين كله متناهٍ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:54",
      "similarity": 0.8175877036868292
    },
    {
      "verse": "16:96",
      "similarity": 0.7208607970105452
    },
    {
      "verse": "31:27",
      "similarity": 0.6403961341928562
    },
    {
      "verse": "26:132",
      "similarity": 0.18049493292422975
    },
    {
      "verse": "84:3",
      "similarity": 0.18021303690947083
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/18:109.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/18:109.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/18:109.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}