{
  "chapter": "الكهف",
  "text": "الحمد لله الذى انزل على عبده الكتب ولم يجعل له عوجا",
  "translations": [
    {
      "translation": "Praise belongs to Allah Who has sent down the Book to His slave and has put no crookedness in it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALL PRAISE BE to God who has revealed to His votary the Book which is free of all obliquity,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah Who has revealed to His servant the Book devoid of all crookedness;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God. He has sent the Book to His servant and has made it a flawless guide (for human beings)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is to Allah Who sent down the Book upon His bondman, and has not kept any deviation in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is due to Allah, Who has sent down to His servant the Book, and has not placed therein any crookedness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(All) praise is due to Allah, Who revealed the Book to His servant and did not make in it any crookedness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise belongs to God who has sent down upon His servant the Book and has not assigned unto it any crookedness;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah Who hath revealed the Scripture unto His slave, and hath not placed therein any crookedness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God who has sent down to His servant -- the Book, which is free from any ambiguity\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise unto Allah who hath sent down unto His bondman the Book, and hath not placed therein any crookedness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise belongs to Allah, who has sent down the Book to His servant and did not let any crookedness be in it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, Who hath sent to His Servant the Book, and hath allowed therein no Crookedness:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the praises and thanks be to Allah, Who has sent down to His slave (Muhammad SAW) the Book (the Quran), and has not placed therein any crookedness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise belongs to Allah who has sent down the Book to His worshiper (Prophet Muhammad) and has not made any crookedness in it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God, who revealed the Book to His servant, and allowed in it no distortion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[All] praise is [due] to Allah, who has sent down upon His Servant the Book and has not made therein any deviance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:1] Praise — which is the attribution [to a person] of that which is beautiful — is established [as something that], belongs to God [alone], exalted be He. Now, is the intention here to point this out for the purpose of believing in it, or to praise [God] thereby, or both? All are possibilities, the most profitable of which is [to understand] the third [as being the intention behind this statement]; Who has revealed to His servant, Muhammad (s), the Book, the Qur’ān, and has not allowed for it, that is, [He has not allowed that there be] in it, any crookedness, [any] variance or contradiction (the [last] sentence [wa-lam yaj‘al lahu ‘iwajan] is a circumstantial qualifier referring to al-kitāb, ‘the Book’);\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his own narration on the authority of Ibn 'Abbas that he said regarding the meaning of Allah's words (Praise be to Allah): '(Praise be to Allah) He says: gratitude is Allah's and divinity is His (Who hath revealed the Scripture) who has sent Gabriel with the Qur'an (unto His slave) Muhammad (pbuh) (and hath not placed therein any crookedness) He did not reveal it as different from the Torah, the Gospel or other Scriptures, as far as divine Oneness and the attributes and description of Muhammad (pbuh) are concerned. This verse was revealed about the Jews when they claimed that the Qur'an was different from all previous Scriptures,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الحمد لله الذي أنزل على عبده الكتاب } أثنى الله تعالى بلسان التفصيل على نفسه باعتبار الجمع من حيث كونه منعوتاً بإنزال الكتاب وهو إدراج معنى الجمع في صورة التفصيل فهو الحامد والمحمود تفصيلاً وجمعاً، فالحمد إظهار الكمالات الإلهية والصفات الجمالية والجلالية على الذات المحمدية باعتبار العروج بعد تخصيصه إياه بنفسه في العناية الأزلية المشار إليه بالإضافة في قوله: عبده، وذلك جعل عينه في الأزل قابلة للكمال المطلق من فيضه وإيداع كتاب الجمع فيه بالقوة التي هي الاستعداد الكامل وإنزال الكتاب عليه إبراز تلك الحقائق عن ممكن الجمع الوحداني على ذلك المظهر الإنساني فهما متعاكسان باعتبار النزول والعروج والإنزال في الحقيقة حمد الله تعالى لنبيه إذ المعاني الكامنة في أغيب الغيب ما لم ينزل على قلبه فلم يمكنه حمد الله حق حمده فما لم يحمده الله لم يحمد الله بل حمده حمده كما قال: لا أحصي ثناء عليك أنت كما أثنيت على نفسك، حمد أولاً في عين الجمع نفسه باعتبار التفصيل ثم عكس فقال: الحمد لله\n { ولم يجعل له } أي: لعبده { عوجاً } أي: زيغاً وميلاً إلى الغير كما قال:\n\n[النجم، الآية: 17] أي: لم ير الغير في شهوده",
      "translations": [
        {
          "translation": "\n\nPraise be to God, who has revealed to His servant the Book { }. Allah has exalted Himself above all things by His detailed knowledge of Himself, for He is the One who has sent down the Book. He is the One who is praised and glorified in both a detailed and comprehensive way.,\n\nPraise be to Allah for revealing His divine attributes and beautiful qualities to the Muhammadan reality, in terms of its ascent after He has dedicated Himself to it in eternal care, as mentioned in His saying: \"His servant.\",\n\nAnd that is what makes His eye in eternity able to perceive the absolute perfection of His grace and deposit the Book of Gathering in it with the power that is the complete preparation, and the descent of the book upon it reveals those truths about the possibility of the unified gathering onto that human form. They are opposed to each other in terms of descent, ascent and descent in reality, all praise be to Allah for His Prophet. For the hidden meanings in the unseen are not revealed to his heart, so he is unable to praise Allah as He deserves. Whoever does not praise Allah, Allah will not praise him, but will praise Him, as He said: \"I do not tire of praising You, as You have praised Yourself.\",\n\nPraise be to God, first and foremost, in the eyes of the community, for His detailed providence, and then in reverse, for His saying: \"Praise be to God.\"\n\n\nAnd He has not made for His servant any hardship, meaning: any crookedness or inclination towards others, as He says:\n The Star\n\nThe star is a symbol of hope and guidance. In many cultures, it is seen as a representation of the divine., {He has not seen the Unseen}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلْحَمْدُ } المشتمل المتضمن على عموم الاثنينية والتوصيف بالأوصاف الجميلة حقيقٌ لائقٌ { لِلَّهِ } أي: للذات المستجمع لجميع مراتب الكمال، المستحق لجميع المحامد استحقاقاً ذاتياً ووصفياً؛ لأنه { ٱلَّذِي أَنْزَلَ عَلَىٰ عَبْدِهِ } المستجمع لجميع مرابت الكمال، المستظل بظلّ الألوهية، المستحق لرتبة الخلافة والنيابة عنه سبحاه بالأصالة؛ يعني: محمداً صلى الله عليه وسلم\n\n\n\n\n{ ٱلْكِتَابَ } الجامع لجميع أوصاف الكمال إجمالاً وتفصيلاً، المشتمل لعموم الأحكام المتعلقة لها، المترتبة عليها في النشأة الأولى والأخرى، مع كونه محتوياً على ما في الكتب السالفة من الأوامر والنواهي، مع زياداتٍ خلت عنها تلك الكتب من الرموز والإشارات المتعلقة بالتوحيد الذاتي المسقطِ لعرق الإضافات والكثرات مطلقاً { وَ } بيَّن لهم فيه طريق التوحيد الذاتي على الوجه الأبلغ الأقوم؛ بحيث { لَمْ يَجْعَل لَّهُ عِوَجَا } [الكهف: 1] وانحرافاً في تبيينه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:45",
      "similarity": 0.7268651381923812
    },
    {
      "verse": "11:19",
      "similarity": 0.7268651381923812
    },
    {
      "verse": "14:3",
      "similarity": 0.6564553228604465
    },
    {
      "verse": "39:28",
      "similarity": 0.6497250914899295
    },
    {
      "verse": "3:99",
      "similarity": 0.6418640775549282
    }
  ]
}