{
  "chapter": "الكهف",
  "text": "قل انما انا۠ بشر مثلكم يوحى الى انما الهكم اله وحد فمن كان يرجوا۟ لقاء ربه فليعمل عملا صلحا ولا يشرك بعبادة ربه احدۢا",
  "translations": [
    {
      "translation": "Say: \"I am only a man like you, but it has been communicated to me that your Lord is one and single God, and that whosoever hopes to meet his Lord should do what is right, and not associate any one in the worship of his Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): \"I am no more than a human being like you; one to whom revelation is made: 'Your Lord is the One and Only God.' Hence, whoever looks forward to meet his Lord, let him do righteous works, and let him associate none with the worship of his Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am only a mortal like you but I have received revelation that there is only one Lord. Whoever desires to meet his Lord should strive righteously and should worship no one besides Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Physically I am a human* like you – my Lord sends divine revelations to me – that your God is only One God; so whoever expects to the meet his Lord must perform good deeds and not ascribe anyone as a partner in the worship of his Lord.” (* Human but not equal to you, in fact the greatest in spiritual status.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am only a man like you. It has been revealed to me that your God is One God. So whoever hopes for the meeting with his Lord, let him work righteousness and associate none as a partner in the worship of his Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am only a mortal like you; it is revealed to me that your god is one Allah, therefore whoever hopes to meet his Lord, he should do good deeds, and not join any one in the service of his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am only a mortal the like of you; it is revealed to me that your God is One God. So let him, who hopes for the encounter with his Lord, work righteousness, and not associate with his Lord's service anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am only a mortal like you. My Lord inspireth in me that your Allah is only One Allah. And whoever hopeth for the meeting with his Lord, let him do righteous work, and make none sharer of the worship due unto his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am only a human being like yourselves. It is revealed to me that your God is One God. So let him who hopes to meet his Lord do good deeds and let him associate no one else in the worship of his Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: I am but a human being like yourselves; revealed unto me is that your God is One God. Whosoever then hopeth for the meeting with his Lord, let him work righteous work, and let him not associate in the worship of his Lord anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I am just a human being like you. It has been revealed to me that your God is the One God. So whoever expects to encounter his Lord—let him act righteously, and not associate anyone with the worship of his Lord.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am but a man like yourselves, (but) the inspiration has come to me, that your Allah is one Allah: whoever expects to meet his Lord, let him work righteousness, and, in the worship of his Lord, admit no one as partner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"I am only a man like you. It has been inspired to me that your Ilah (God) is One Ilah (God i.e. Allah). So whoever hopes for the Meeting with his Lord, let him work righteousness and associate none as a partner in the worship of his Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am only a human like you, revealed to me is that your God is One God. Let him who hopes for the encounter with his Lord do good work, and not associate anyone with the worship of his Lord'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am only a human being like you, being inspired that your god is One God. Whoever hopes to meet his Lord, let him work righteousness, and never associate anyone with the service of his Lord.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am only a man like you, to whom has been revealed that your god is one God. So whoever would hope for the meeting with his Lord - let him do righteous work and not associate in the worship of his Lord anyone.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:110] Say: ‘I am only a human being, a son of Adam, like you; it has been revealed to me that your God is only One God (annamā, the anna assimilated with the mā retains [its function of referring to] the verbal noun), in other words, the Oneness of the Divine is [what is being] revealed to me. So whoever hopes to encounter his Lord, through the Resurrection and the Requital, let him do righteous work and not associate with the worship of his Lord, that is to say, [let him not commit idolatry] in [performing] it by feigning [faith] before, anyone’. Meccan, except for verses 58 and 71, which are Medinese; it consists of 98, or 99, verses and was revealed after [sūrat] Fātir.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) O Muhammad: (I am only a mortal like you) I am a human being like you. (My Lord inspireth in me) through Gabriel (that your God is only One God) and He has no son or partner. (And whoever hopeth for the meeting with his Lord) whoever fears resurrection after death, (let him do righteous work) sincerely, and secretly between him and his Lord, (and make none sharer of the worship due unto his Lord) he should not show off or associate in the worship of his Lord anything or anyone; it is also said that this means: he should not associate in his obedience of his Lord anything or anyone. This verse was revealed about Jundub Ibn Zuhayr al-'Amiri'. And of the surah in which Mary is mentioned, which is all Meccan and contains 98 verses, 962 words and 3,302 letters: Surah 19: Mary (Maryam) And of the surah in which Mary is mentioned, which is all Meccan and contains 98 verses, 962 words and 3,302 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَمَن كَانَ يَرْجُواْ لِقَآءَ رَبِّهِ } معناه ثَوابُ رَبِّهِ\n\n\n\n\nوقوله تعالى: { وَلاَ يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدَاً } معناه رَبٌّ!\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل بعدما بلغت لهم كلمات الله الغير المحصورة كلاماً خيالياً عن وصمة التفوق، والتفضل المفضي للرعونة ناشئاً عن محض الحكمة والفطنة: { إِنَّمَآ أَنَاْ بَشَرٌ مِّثْلُكُمْ } قابل للعلوم الإدراكات على مقتضى البشرية، لا فرق بيني وبينكم بحسب الفطرة، غاية في الأمر أنه { يُوحَىٰ إِلَيَّ } ويُفاض إفاضة علمٍ و عين حقٍ { أَنَّمَآ إِلَـٰهُكُمْ } ومعبودكم ومُظهركم { إِلَـٰهٌ وَاحِدٌ } أحدٌ صمد فرد وتر، ليس له شريكُ ولا نظيرُ ولا وزيرُ، بل هو مستقلُ في الوجود والإيجاد والإظهار، يفعل ما يشاء ويحكم ما يريد استقلالاً إرادةً واختياراً، وإنما امتيازي عنكم بهذا\n\n\n\n\n{ فَمَن كَانَ } منكم { يَرْجُواْ } رجاءَ مؤملٍ بصيرٍ { لِقَآءَ رَبِّهِ } مكاشفةً ومشاهدةً { فَلْيَعْمَلْ عَمَلاً صَالِحاً } قالعاً لأصل أنانيته وهويته، قامعاً لمقتضيات أوصاف بشريته وبهيميته، مزيلاً لذمائم أخلاقه وأطواره { وَ } مع ذلك { لاَ يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدَاً } [الكهف: 110] من خلقه، أي: لا يقصد من عمله وعبادته الرياءَ والسمعةَ والعُجبَ والنخوة\n\n\n\n\nقال رسول الله صلى الله عليه وسلم:\n\n \" \" أَخوْفَُ مَا أَخَافُ عَلَيْكُمْ الشِّركُ الأَصْغَرُ \"\n \n\n \n\n قالوا: وما الشرك الأصغر؟\n \n\n \n\n قال: \" الرِّيَاءُ \"\n \n\n \n\nوقال تبارك وتعالى: \" أنا أغْنى الشُّركاء عن الشِّركِ، فَمَنْ عَمِل عَمَلاً أَشْرَكَ فِيْهِ غَيْرِيْ فَأنَا مِنْهُ بَرِيءٌ وَهُوَ الَّذِيْ عَمِلَهُ لأَجْلِهِ \"\n\n\n\n\nوبالجملة: يعمل على وجهٍ يسقط الكثرة والاثنينية لا على وجهٍ يؤيدها ويكثرها، بل العامل العارف لا يطلب لعلمه الجزاء أيضاً، بل إنما يعلم امتثالاً لأمره سبحانه وطلباً لمرضاته، ولا يخطر بباله شيء وساه\n\n\n\n\nجعلنا الله ممن تحقق بمقام التوحيد، وأمَّنه عن توهم الرياء والتقليد، وحفظه من كل شيطان مريد\n\n\n\n\nخاتمسة السورة\n\n\n\nعليك أيها الموحد القاصد للتحقق في مقام التمكن من التوحيد\n قرَّرَك الله في مقعد صدقك ويقينك، وثبتك في مقر تثبيتك وتمكينك\n أن تحفظ أعمالك التي جئت بها متفرقاً الوصولَ إلى محل القبول عن مداخل الرياء والسمعة والعجب وأنواع الرعونات؛إذ هي كلها شباكُ الشيطان وعقاله، يقيد بها خواص عباد الله، ويلهيهم بها عما هم عليه من الرضا والتسليم، ويوقعهم في قتنةٍ عظيمةٍ ومعصيةٍ كبيرةٍ مستلزمةٍ للشرك بالله، العياذ به من غوائل الشيطان وتسويلاته ويخلصها لمحض وجهه الكريم\n\n\nفعليك أن تلازم العزلة، وتداوم الخلوة حتى لا يلحقكمن الخلطة أمثال هذه الأمراض العضال، وأيضاً لك أن تجلي خاطرك وتصفي ضميرك عن هواجسك المتعلقة بأمور معاشك بين بني نوعك، فإن أكثر عروض هذه الأمراض إما يحصل من الأماني واللذات الوهمية من الجاه والثروة والتفوق على الأقران وغير ذلك\n\n\n\n\nوإن شئت أن يسهل عليك الأمر فاشغل جوارحك لكسب ضرورات معاشك في بعض الأحيا، واقنع بأقل المعيشة وسدّ الرمق، واحذر عن فضول العيش، فإن أكثر فحول الرجال قد استرق بفضول الأماني والآمال\n\n\n\n\nوبالجملة: نعم القرين العزلة، والفرار عن تغريرات الدنيا الغدارة المكارة، والخمول في زوايا الكهوف والأغوار عن اختلاط أصحاب الخسار والبوار\n\n\n\n\nوِفقنا بفضلك وجودكَ بما تحب منا وترضى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل } لهم: { إِنما أنا بشرٌ مثلكم } يتناهى كلامي، وينقضي أجلي، وإنما خُصصت عنكم بالوحي والرسالة { يُوحى إِليَّ } من تلك الكلمات: { أنما إِلهكم إِله واحد } لا شريك له في الخلق، ولا في سائر أحكام الألوهية، { فمن كان يرجو لقاء ربه }: يتوقعه وينتظره، أو يخافه، فالرجاء: توقع وصول الخير في المستقبل، فمن جعل الرجاء على بابه، فالمعنى: يرجو حسن لقاء ربه وأن يلقاه لقاء رضى وقبول\n\n\nومن حمله على معنى الخوف، فالمعنى: يخاف سوء لقائه\n قال القشيري: حَمْلُه على ظاهره أَوْلى لأن المؤمنين قاطبةً يرجون لقاءَ الله، فالعارفون بالله يرجون لقاءه والنظر إليه والمؤمنون يرجون لقاءه وكرامته بالنعيم المقيم\n هـ\n بالمعنى\n والتعبير بالمضارع في { يرجو } للدلالة على أن اللائق بحال المؤمنين: الاستمرار والاستدامة على رجاء اللقاء، أي: فمن استمر على رجاء لقاء كرامة الله ورضوانه { فليعملْ } لتحصيل تلك الطلبة العزيزة { عملاً صالحًا } ، وهو الذي توفرت شروط صحته وقبوله، ومدارها على الإتقان ظاهرًا، والإخلاص باطنًا\n وقال سهل: العمل الصالح: المقيد بالسُنَّة، وقيل: هو اعتقاد جواز الرؤية وانتظار وقتها\n { ولا يُشرك بعبادةِ ربه أحدًا } إشراكًا جليًا، كما فعل الذين ضلَّ سعيهم في الحياة الدنيا حيث كفروا بآيات ربهم ولقائه، أو إشراكًا خفيًا، كما يفعله أهل الرياء، ومن يطلب به عوضًا أو ثناءً حسنًا\n قال شهر بنُ حَوشب: جاء رجل إلى عبادة بن الصامت، فقال: أرأيت رجلاً يُصلي يبتغي وجه الله، ويحب أن يُحمد عليه، ويتصدق يبتغي وجه الله ويُحب أن يُحمد عليه، ويحج كذلك؟ قال عبادة: ليس له شيء، إن الله تعالى يقول:\n\n \" أنا خيرُ شريك، فمن كان له شريك فهو له \" \n\nورُوي أن جُنْدبَ بْنَ زُهَيْرٍ قَال لِرَسُولِ الله صلى الله عليه وسلم: إِنِّي لأعْمَلُ العَمَلَ للهِ تَعَالى، فإذا اطُّلِعَ عَلَيْهِ سرَّني، فقال له عليه الصلاة والسلام:\n\n \" لَكَ أَجْرَان: أجْرُ السِّرِّ، وأَجْرُ العَلاَنِيَةِ \" \n\nوذلك إذا قصد أن يُقْتَدَى به، وكان مُخْلصًا في عمله\n وعنه صلى الله عليه وسلم أنه قال:\n\n \" اتقوا الشرك الأصغر، قالوا: وما الشرك الأصغر؟ قال: الرياء \"\n \n\nوقال صلى الله عليه وسلم - لما نزلت هذه الآية -:\n\n \" إن أخوف ما أخاف على أمتي الشرك الخفي، وإياكم وشرك السرائر، فإنَّ الشرك أخفى في أمتي من دبيب النمل على الصفا في الليلة الظلماء، فشق ذلك على القوم، فقال النبي صلى الله عليه وسلم: \" ألا أدلكم على ما يذهب الله عنكم صغير الشرك وكبيره؟ قالوا: بلى، قال: قولوا: \" اللهم إني أعوذ بك أن أشرك بك وأنا أعلم، وأستغفرك من كل ما لا أعلم \"\n \n\nوعنه صلى الله عليه وسلم أنه قال:\n\n \" مَنْ قَرَأ آخرَ سورة الكَهف - يعني: { إن الذين آمنوا } إلى آخره - كَانَتْ لَهُ نُورًا من قَرْنِهِ إلى قَدَمِهِ، وَمَنْ قَرَأَهَا كُلَّها كانَتْ له نُورًا من الأرْضِ إلى السَّمَاءِ \" \n\nوعنه صلى الله عليه وسلم:\n\n\n\n \" مَنْ قَرَأَ عِنْدَ مَضْجِعِهِ: { قل إنما أنا بشر مثلكم } الخ، كَانَ لَهُ مِنْ مَضْجَعِهِ نُورًا يَتَلألأ إلى مَكّةَ، حَشْوُ ذلِكَ النُّور مَلائِكَةٌ يُصَلُون حَتَّى يَقُومَ، وإنْ كَانَ بِمَكَةَ كانَ لَهُ نُورًا إلى البيتِ المَعْمُور \" \n\nقلت: ومما جُرِّب أن من قرأ هذه الآية، { إن الذين آمنوا } الخ، ونوى أن يقوم في أي ساعة شاء، فإن الله تعالى يُوقظه بقدرته\n وانظر الثعلبي\n  الإشارة: إن الذين آمنوا إيمان الخصوص، وعملوا عمل الخصوص - وهو العمل الذي يقرب إلى الحضرة - كانت لهم جنة المعارف نُزلاً، خالدين فيها لا يبغون عنها حولاً لأنَّ من تمكن من المعرفة لا يُعزل عنها، بفضل الله وكرمه، كما قال القائل:\n\nثم يترقون في معاريج التوحيد، وأسرار التفريد، أبدًا سرمدًا، لا نهاية لأن ترقيتهم بكلمة القدرة الأزلية، وهي كلمة التكوين، التي لا تنفد { قل لو كان البحر مدادًا لكلمات ربي\n\n\n } الآية\n هذا مع كون وصف البشرية لا يزول عنهم، فلا يلزم من ثبوت الخصوصية عدم وصف البشرية\n قل: إنما أنا بشر مثلكم يُوحى إليّ وحي إلهام، ويلقى في رُوعي أنما إلهكم إله واحد، لا ثاني له في ذاته ولا في أفعاله، فمن كان يرجو لقاء ربه في الدنيا لقاء الشهود والعيان، ولقاء الوصول إلى صريح العرفان فليعمل عملاً صالحًا، الذي لا حظ فيه للنفس عاجلاً ولا آجلاً، ولا يشرك بعبادة ربه أحدًا، فلا يقصد بعبادته إلا تعظيم الربوبية، والقيام بوظائف العبودية، والله تعالى أعلم، وصلى الله على سيدنا محمد وآله وسلم تسليمًا، ولا حول ولا قوة إلا بالله العلي العظيم\n\n",
      "translations": []
    }
  ]
}