{
  "chapter": "الكهف",
  "text": "وربطنا على قلوبهم اذ قاموا۟ فقالوا۟ ربنا رب السموت والارض لن ندعوا۟ من دونه الها لقد قلنا اذا شططا",
  "translations": [
    {
      "translation": "We fortified their hearts when they stood up and said, 'Our Lord is the Lord of the heavens and the earth and We will not call on any god apart from Him. We would in that case have uttered an abomination.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strengthened their hearts when they stood up and said: \"Our Lord is the Lord of the heavens and the earth. We shall invoke no god beside Him, for we shall have uttered a blasphemy then.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and strengthened their hearts when they stood up and proclaimed: \"Our Lord is the Lord of the heavens and the earth. We shall call upon no other god beside Him; (for if we did so), we shall be uttering a blasphemy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We strengthened their hearts when they stood up against the idols and said, \"Our Lord is the Lord of the heavens and the earth. We shall never worship anyone other than Him lest we commit blasphemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made their hearts steadfast when they stood up and said, “Our Lord is the Lord of the heavens and the earth – we shall not worship any other deity except Him – if it were, we have then said something excessive.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made their hearts firm and strong when they stood up and said: \"Our Lord is the Lord of the heavens and the earth, never shall we call upon any god other than Him; if we did, we should indeed have uttered an enormity in disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We strengthened their hearts with patience, when they stood up and said: Our Lord is the Lord of the heavens and the earth; we will by no means call upon any god besides Him, for then indeed we should have said an extravagant thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We strengthened their hearts, when they stood up and said, 'Our Lord is the Lord of the heavens and earth; we will not call upon any god, apart from Him, or then we had spoken outrage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made firm their hearts when they stood forth and said: Our Lord is the Lord of the heavens and the earth. We cry unto no Allah beside Him, for then should we utter an enormity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We strengthened their hearts, when they rose up and declared, \"Our Lord is the Lord of the heavens and the earth. Never shall we call upon any deity other than Him: for that would be an outrageous thing to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We braced their hearts when they stood forth and said: our Lord is the Lord of the heavens and the earth; never we shall call upon a god beside him; for then we shall be saying an abomination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and fortified their hearts, when they stood up and said, ‘Our Lord is the Lord of the heavens and the earth. We will never invoke any god besides Him, for then we shall certainly have said an atrocious lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave strength to their hearts: Behold, they stood up and said: \"Our Lord is the Lord of the heavens and of the earth: never shall we call upon any god other than Him: if we did, we should indeed have uttered an enormity!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made their hearts firm and strong (with the light of Faith in Allah and bestowed upon them patience to bear the separation of their kith and kin and dwellings, etc.) when they stood up and said: \"Our Lord is the Lord of the heavens and the earth, never shall we call upon any ilah (god) other than Him; if we did, we should indeed have uttered an enormity in disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We strengthened their hearts when they stood up and said: 'Our Lord is the Lord of the heavens and the earth. We will call on no other god except Him; (for if we did), we would have spoken outrageously (in disbelief),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We strengthened their hearts, when they stood up and said, “Our Lord is the Lord of the heavens and the earth; we will not call on any god besides Him, for then we would have spoken an outrage.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made firm their hearts when they stood up and said, \"Our Lord is the Lord of the heavens and the earth. Never will we invoke besides Him any deity. We would have certainly spoken, then, an excessive transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:14] And We strengthened their hearts, to [enable them to] speak the truth, when they stood up, before their king, who had commanded them to prostrate to idols, and said, ‘Our Lord is the Lord of the heavens and the earth. We will not call on any god besides Him, that is, other than Him, for then we shall certainly have uttered an outrage, in other words, [we shall have spoken] a statement that contains shatat, meaning one of extreme disbelief, were we, hypothetically, to call on any god other than God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "313 (And We made firm their hearts) We preserved their hearts with faith; it is also said that: We inspired them to hold fast to patience (when they stood forth) when they left the disbelieving emperor Decius (Duqyanus) (and said: Our Lord is the Lord of the heavens and the earth. We cry unto) we worship (no god beside Him, for then should we utter an enormity) for then we would be telling lies and falsehood about Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَرَبَطْنَا عَلَىٰ قُلُوبِهِمْ } معناه أَلْهمنَاهُم الصَّبرَ\n\n\n\n\nوقوله تعالى: { لَّقَدْ قُلْنَا إِذاً شَطَطاً } معناهُ جَورٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {And We have placed restraints on their hearts} means that We have made them patient.\n And His saying - exalted be He - {We have said then firmly} - its meaning is injustice.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وربطنا على قلوبهم } قويناها بالصبر على المجاهدة\n وشجعناهم على محاربة الشيطان ومخالفة النفس\n وهجر المألوفات الجسمانية\n واللذات الحسيّة\n والقيام بكلمة التوحيد\n ونفي إلهية الهوى\n وترك عبادة صنم الجسم بين يدي جبّار النفس الأمّارة من غير مبالاة بها حين عاتبتهم على ترك عبادة إله الهوى وصنم البدن\n وأوعدتهم بالفقر والهلاك\n إذ النفس داعية إلى عبادته وموافقته\n وتهيئة أسباب حظوظه مخيفة للقلب من الخوف والموت\n أو جسرناهم على القيام بكلمة التوحيد\n وإظهار الدين القويم والدعوة إلى الحق عند كل جبّار هو دقيانوس وقته كنمروذ وفرعون وأبي جهل وأضرابهم ممن دان بدينهم واستولى عليه النفس الأمّارة فعبد الهوى\n أو ادّعى لطغيانه\n وتمرد أنائيته وعدوانه الربوبية من غير مبالاة عند معاتبته إياهم على ترك عبادة الصنم المجعول كما هو عادة بعضهم أو صنم نفسه\n كما قال فرعون اللعين:\n[القصص\n الآية: 38] و\n[النازعات\n الآية: 24]",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } ثبتناهم في الهداية والتوحيد بأن { رَبَطْنَا عَلَىٰ قُلُوبِهِمْ } محبة الإيمان والعرفان\n واذكر يا أكمل الرسل وقت { إِذْ قَامُواْ } بين يدي دقيانوس الظالم الطاغي حين دعاهم إلى الشرك والكفر على رءوس الملأ\n وبعدما سمعةا منه دعوته { فَقَالُواْ } بلا مبالاةٍ له ولسطوته وشوكته: { رَبُّنَا } الذي أظهَرَنا من كتم العدم\n وأوجَدَنا في فضاء الوجود { رَبُّ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: هو رب العلويات والسفليات الغيب والشهادة والظاهر والباطن\n أوجد الكل بوحدته واستقلاله في التصرف والاستيلاء بلا مشاركةٍ مشيرٍ ومظاهرةِ ظهيرٍ\n هو مستحق للألوهية والربوبية { لَن نَّدْعُوَاْ } ونعبد { مِن دُونِهِ إِلـٰهاً } باطلاً\n ذ لا مستحق لعبادة إلا هو\n والله لئن دعوتنا إلهاً سواه { لَّقَدْ قُلْنَا إِذاً شَطَطاً } [الكهف: 14] أي: قولاً ذا بعدٍ عن الحق والتحقيق بمراحل\n وصرنا حينئذٍ مغمورين في الشرك والكفر وأنواع الضلال والطغيان\n عصمنا الله منها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إذ قاموا }: ظرف لربطنا\n { وشططًا }: صفة لمحذوف\n أي: قولاً شططًا\n أي: ذا شطط\n وُصِف به للمبالغة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:4",
      "similarity": 0.6580045501246738
    },
    {
      "verse": "38:22",
      "similarity": 0.5212679269454484
    },
    {
      "verse": "3:200",
      "similarity": 0.47791764916130813
    },
    {
      "verse": "8:60",
      "similarity": 0.3798325027884515
    },
    {
      "verse": "28:10",
      "similarity": 0.3599226287342152
    }
  ]
}