{
  "chapter": "الكهف",
  "text": "واذ اعتزلتموهم وما يعبدون الا الله فاوا۟ الى الكهف ينشر لكم ربكم من رحمته ويهيئ لكم من امركم مرفقا",
  "translations": [
    {
      "translation": "When you have separated yourselves from them and everything they worship except Allah, take refuge in the cave and your Lord will unfold His mercy to you and open the way to the best for you in your situation.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And they said to each other:) \"Now that you have withdrawn from them and what they worship beside God, it is better to take refuge in the cave. Your Lord may bestow of His mercy on you, and facilitate your affair.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now that you have dissociated yourselves from them and from whatever they worship beside Allah, go and seek refuge in the Cave. Your Lord will extend His mercy to you and will provide for you the means for the disposal of your affairs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They were told), \"Now that you have abandoned them and what they worship instead of God, seek refuge in the cave. God will, certainly, grant you mercy and provide you with help to safely get out of this trouble.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And when you have disassociated yourself from them and all what they worship besides Allah – so take refuge in the Cave – your Lord will spread His mercy for you and arrange ease for you in your affairs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The young men said to one another:) \"And when you withdraw from them, and that which they worship, except Allah, then seek refuge in the cave; your Lord will open a way for you from His mercy and will make easy for you your affair.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you forsake them and what they worship save Allah, betake yourselves for refuge to the cave; your Lord will extend to you largely of His mercy and provide for you a profitable course in your affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when you have gone apart from them and that they serve, excepting God, take refuge in the Cave, and your Lord will unfold to you of His mercy, and will furnish -- you with a gentle issue of your affair.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye withdraw from them and that which they worship except Allah, then seek refuge in the Cave; your Lord will spread for you of His mercy and will prepare for you a pillow in your plight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now that you have withdrawn from them and from all that they worship instead of God, take refuge in that cave; your Lord will extend His mercy to you and will make fitting provision for you in your situation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now when ye have withdrawn from them and that which they worship, except God, betake yourselves to the cave; your Lord will unfold for you some of His mercy, and will prepare for you of your affair an easy arrangement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you have dissociated yourselves from them and from what they worship except Allah, then take refuge in the Cave. Your Lord will unfold His mercy for you, and He will help you on to ease in your affair.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye turn away from them and the things they worship other than Allah, betake yourselves to the Cave: Your Lord will shower His mercies on you and disposes of your affair towards comfort and ease.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The young men said to one another): \"And when you withdraw from them, and that which they worship, except Allah, then seek refuge in the Cave, your Lord will open a way for you from His Mercy and will make easy for you your affair (i.e. will give you what you will need of provision, dwelling, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you depart from them and from what they worship, other than Allah, seek refuge in the Cave. Allah will extend His Mercy to you and will furnish you with a gentle issue of your affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Now that you have withdrawn from them, and from what they worship besides God, take shelter in the cave. And your Lord will unfold His mercy for you, and will set your affair towards ease.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The youths said to one another], \"And when you have withdrawn from them and that which they worship other than Allah, retreat to the cave. Your Lord will spread out for you of His mercy and will prepare for you from your affair facility.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:16] And when you withdraw from them and from that which they worship except God, then take refuge in the Cave. Your Lord will reveal for you something of His mercy and prepare for you in your affair some comfort’ (read mirfaqan or marfiqan), that is to say, something for you to find comfort in, in the way of lunch or supper.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when ye withdraw from them) and when you leave them and their religion (and that which they worship) of idols beside Allah, therefore worship none (except Allah, then seek refuge in the Cave) enter this Cave; (your Lord will spread for you) He will bestow upon you (of His mercy) of His blessings (and will prepare for you a pillow in your plight) He will prepare for you that which will be kind towards you tomorrow. All this was said by the group of youth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيُهَيِّئْ لَكُمْ مِّنْ أَمْرِكُمْ مِّرْفَقاً } [معناه] ما ارتُفِقَ بهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He will make your affairs {easeful} to you\" [means] that which is in accordance with what is easy for you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذ اعْتَزلتموهم } أي: فارقتم نفوسكم وقواها بالتجرّد { وما يعبدون إلاَّ الله } من مراداتها وأهوائها { فأووا إلى الكهف } إلى البدن لاستعمال الآلات البدنية في الاستكمال بالعلوم والأعمال، وانخزلوا فيه منكسرين، مرتاضين، كأنهم ميتون بترك الحركات النفسانية والنزوات البهيمية والسطوات السبعية، أي: موتوا إرادياً { ينشر لكم ربكم من رحمته } حياة حقيقية بالعلم والمعرفة { ويهيئ لكم من أمركم مرفقاً } كما لا ينتفع به بظهور الفضائل وطلوع أنوار التجليات، فتلتذون بالمشاهدات وتتمتعون بالكمالات كما قال تعالى:\n\n[الأنعام، الآية: 122]، وقال عليه السلام في أبي بكر رضي الله عنه:\n\n \" من أراد أن ينظر ميتاً يمشي على وجه الأرض فلينظر أبا بكر \" \n\n، أي: ميتاً عن نفسه يمشي بالله\n أو وإذ اعتزلتم قومكم ومعبوداتهم غيّر الله من مطالبهم المختلفة، ومقاصدهم المتشتتة، وأهوائهم المتفننة، وأصنامهم المتخذة، فأووا إلى كهوف أبدانكم وامتنعوا عن فضول الحركات والخروج في أثر الشهوات، واعكفوا على الرياضات،\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n قال بعض الفتية لبعضهم: قد وجب علينا الآن الاعتزال منهم { إِذِ ٱعْتَزَلْتُمُوهُمْ } وهجرتموهم { وَمَا يَعْبُدُونَ } أي: معبوداتهم من الأصنام والأوثان التي يعتقدونها آلهةً شركاءَ مع الله يعبدونها كعبادته { إِلاَّ ٱللَّهَ } الواحد الأحد الحق الحقيق بالعبادة\n وأخلصتم العبادة له سبحانه بلا خوفٍ منه ودهشةٍ\n كان أولى وأليقَ بحالكم\n\n\nوبالجملة: اتفقوا على الاعتزال واختيار الغربة والفرار من بينهم\n فاعتزلوهم منهم وخرجوا من أظهرهم { فَأْوُوا } وانصرفوا { إِلَى ٱلْكَهْفِ } المعهود\n ملتجئين إلى ربكم من خوف عدوكم\n متوكلين عليه في رزقكم ومعاشكم { يَنْشُرْ لَكُمْ رَبُّكُم } سبحانه ويبسط عليكم { مِّن } سعة { رَّحْمَتِهِ } وجوده ما تعيشون وتبقون بسبب أن تعلق مشيئته بإبقائكم { وَ } بعدما التجأتم إلى الله\n وتوكلتم عليه\n مفوضين أمروكم كلها إليه { وَيُهَيِّئْ لَكُمْ } ويسهل عليكم { مِّنْ أَمْرِكُمْ } الذي اخترتم لرضا الله ورعاية جنابه { مِّرْفَقاً } [الكهف: 16] أي: ما ترفقون وتنتفعون به من اللذات الروحانية يدل ما فوّتم لأنفسكم من اللذات الجسمانية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وإذ اعتزلتموهم } أي: فارقتموهم { و } فارقتم { ما يعبدون إِلا الله فَأْووا إِلى الكهف }: فالتجئوا إليه، والمعنى: وإذا اعتزلتموهم اعتزالاً اعتقاديًا فاعتزلوهم اعتزالاً جسمانيًا، { ينشرْ لكم ربٌُّكم }: يبسط لكم ويوسع عليكم { من رحمته } في الدارين، { ويهيئْ لكم من أمركم } الذي أنتم بصدده من الفرار بالدين، { مِرْفَقًا }: ما ترتفقون به، أي: تنتفعون، وجزمهم بذلك لنصوع يقينهم، وقوة وثوقهم بفضل الله\n والله تعالى أعلم\n الإشارة: قد وصف الله - تعالى - أهلَ الكهف بخمسة أوصاف هي من شعار الصوفية الإيمان، الذي هو الأساس، وزيادة الاهتداء بتربية الإيقان إلى الوصول إلى صريح العرفان، وربط القلب في حضرة الرب، والقيام في إظهار الحق أو لداعي الوجد، والصدع بالحق من غير مبالاة بأحد من الخلق\n وقال الورتجبي في قوله تعالى: { وزدناهم هُدىً }: أي: زدناهم نورًا من جمالي، فاهتدوا به طرق معارف ذاتي وصفاتي، وذلك النور لهم على مزيد الوضوح إلى الأبد لأن نوري لا نهاية له\n وقال عند قوله: { إِذ قاموا }: قد استدل بهذه الآية بعضُ المشايخ على حركة الواجدين في وقت السماع والذكر لأن القلوب إذا كانت مربوطة بالملكوت ومحل القدس حرَّكها أنواعُ الأذكار وما يَرِد عليها من فنون السماع\n والأصل قوله: { وربطنا على قلوبهم إِذ قاموا } ، نعم هذا المعنى إذا كان القيام قيامًا بالصورة، أي: الحسية في القيام الحسي، وإذا كان القيام من جهة الحفظ والرعاية، والربط من جهة النقل من محل التلوين إلى محل التمكين، فالاستدلال بها في السكون في الوجد أحسن، إذا كان الربط بمعنى التسكين والقيام بمعنى الاستقامة\n هـ\n قلت: الحاصل: أنا إذا حملنا القيام على الحسي ففيه دليل لأهل البداية على القيام في الذكر والسماع\n وإذا حملناه على القيام المعنوي، وهو النهوض في الشيء، أو الاستقامة عليه كان فيه دلالة لأهل النهاية على السكون وعدم التحرك، وكأنه يشير إلى قضية الجنيد في بدايته ونهايته\n والله تعالى أعلم\n وقال ابن لب: قد اشتهر الخلاف بين العلماء في القيام لذكر الله - تعالى - وقد أباحته الصوفية، وفعلته ودامت عليه، واستفادوه من كتاب الله تعالى من قوله - عزّ وجلّ - في أصحاب الكهف: { إِذ قاموا فقالوا ربُّنا ربُّ السماوات والأرض } ، وإن كانت الآية لها محامل أخرى سوى هذا\n هـ\n قلت: وقوله تعالى:\n\n[آل عمران: 191]: صريح في الجواز\n وقال في القوت: وقد روينا أنه صلى الله عليه وسلم مرَّ برجل يظهر التأوه والوجد، فقال مَنْ كان معه: أتراه يا رسولَ الله مُرائيًا؟ فقال:\n\n \" لا، بل أوّاه منيب \" \n\n، وقال لآخر: أظهر صوته بالآية:\n\n \" أِسْمِع الله عزَّ وجّل ولا تُسَمِّع \" \n\n، فأنكر عليه بما شهد فيه، ولم ينكر على أبي موسى قوله: لو علمتُ أنك تَسمع لحبَّرته لك تحبيرًا لأنه ذو نية في الخير وحسن قصد به، ولذا كل من كان له حسن قصد، ونية خير، في إظهار عمل، فليس من السمعة والرياء في شيء لتجرده من الآفة الدنيوية، وهي الطمع والمدح\n هـ\n ثمَّ ذكر حالهم في الكهف فقال: { وَتَرَى ٱلشَّمْسَ إِذَا طَلَعَت تَّزَاوَرُ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:10",
      "similarity": 0.6372394871101821
    },
    {
      "verse": "4:69",
      "similarity": 0.3741036407564081
    },
    {
      "verse": "18:11",
      "similarity": 0.3084705940730471
    },
    {
      "verse": "18:9",
      "similarity": 0.24066954360342896
    },
    {
      "verse": "18:25",
      "similarity": 0.2328485179080778
    }
  ]
}