{
  "chapter": "الكهف",
  "text": "الذين ضل سعيهم فى الحيوة الدنيا وهم يحسبون انهم يحسنون صنعا",
  "translations": [
    {
      "translation": "Theirs whose effort is misspent in pursuit of the pleasures of the world, even though they think they are doing good things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be those whose effort went astray in the life of the world and who believe nevertheless that they are doing good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be those who labor a great deal in this life but without guidance, yet think that they are doing a great many good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Of those whose efforts are lost in (pursuit of) the life of this world, and they think that they are doing good deeds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose efforts have been wasted in this life while they thought that they were acquiring good by their deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(These are) they whose labor is lost in this world's life and they think that they are well versed in skill of the work of hands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose striving goes astray in the present life, while they think that they are working good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose effort goeth astray in the life of the world, and yet they reckon that they do good work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whose efforts have been wasted in the life of the world while they thought they were doing good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whose effort is wasted in the life of the world, and they deem that they are doing well in performance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose efforts are misguided in the life of the world, while they suppose they are doing good.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose efforts have been wasted in this life, while they thought that they were acquiring good by their works?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose efforts have been wasted in this life while they thought that they were acquiring good by their deeds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are) those whose striving in this world go astray, while they think that what they are doing are good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Those whose efforts in this world are misguided, while they assume that they are doing well.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They are] those whose effort is lost in worldly life, while they think that they are doing well in work.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:104]   Those whose effort goes astray in the life of this world, [those] whose deeds are invalid, while they reckon, they think, that they are doing good work, [good] deeds for which they will be rewarded.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those whose effort goeth astray) those whose works are thwarted (in the life of the world) these are the Kharijites; and it is also said that this refers to anchorites, (and yet they reckon that they do good work) and yet think that they are doing righteous works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُحْسِنُونَ صُنْعاً } يعني عَملاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم: { ٱلَّذِينَ ضَلَّ } أي: بطل وضاع { سَعْيُهُمْ } الذين سعوا { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } بإتيان الأعمال الصالحة والإنفاق، وبناء بقاع الخير وغير ذلك، كالرهابنة والقسيسين، وكذا عموم أهل العجب والرياء من أي: أمةٍ كانت { وَهُمْ } في النشأة الأولى { يَحْسَبُونَ } ويظنون { أَنَّهُمْ يُحْسِنُونَ صُنْعاً } [الكهف: 104] ينفعهم عند الله، ويتوقعون المثوبة العظمى والدرجة العليا لأجلها، مع أنهم خاسرون خسراناً مبيناً؛ لفقدهم ما هو مبني الأعمال ومناط العبادات، وهو الإيمان بتوحيد الله والتصديقُ بكتبه ورسله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}