{
  "chapter": "الكهف",
  "text": "هؤلاء قومنا اتخذوا۟ من دونه ءالهة لولا ياتون عليهم بسلطنۭ بين فمن اظلم ممن افترى على الله كذبا",
  "translations": [
    {
      "translation": "As for these our people here, they have taken to other gods apart from Him. Then why do they not bring a clear authority for them? Who is more wicked than he who fabricates a lie against God?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then they conferred among themselves and said): \"These men, our own people, have taken others as gods beside Him: why do they not bring any clear evidence that they indeed are gods? Who can be more unjust than he who foists a lie on Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our people have considered other things equal to God. Why cannot they present clear proof in support of their claim. Who is more unjust than one who invents falsehood against God?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“These – the people of ours – have set up Gods besides Allah; why do they not bring a clear proof regarding them? And who is more unjust than one who fabricates a lie against Allah?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken for worship gods other than Him. Why do they not bring for them a clear authority And who does more wrong than he who invents a lie against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken gods besides Him; why do they not produce any clear authority in their support? Who is then more unjust than he who forges a lie against Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken to them other gods, apart from Him. Ah, if only they would bring some clear authority regarding them! But who does greater evil than he who forges against God a lie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These, our people, have chosen (other) gods beside Him though they bring no clear warrant (vouchsafed) to them. And who doth greater wrong than he who inventeth a lie concerning Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These people of ours have taken deities other than Him. Why do they not produce clear evidence about them? Who is more wicked than the man who invents a falsehood against God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These, our people, have taken for themselves gods beside Him - wherefore bring they not for them an authority manifest? --and who doth greater wrong than he who fabricateth against God a lie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These—our people—have taken gods besides Him. Why do they not bring any clear authority touching them? So who is a greater wrongdoer than he who fabricates a lie against Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken for worship gods other than Him: why do they not bring forward an authority clear (and convincing) for what they do? Who doth more wrong than such as invent a falsehood against Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These our people have taken for worship aliha (gods) other than Him (Allah). Why do they not bring for them a clear authority? And who does more wrong than he who invents a lie against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These, our nation have taken to themselves gods, other than Allah. Why do they not bring some clear authority regarding them! Who does greater evil than he who forges a lie against Allah'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“These people, our people, have taken to themselves gods other than Him. Why do they not bring a clear proof concerning them? Who, then, does greater wrong than he who invents lies and attributes them to God?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These, our people, have taken besides Him deities. Why do they not bring for [worship of] them a clear authority? And who is more unjust than one who invents about Allah a lie?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:15] These (hā’ūlā’ is the subject [of the sentence]) our people (qawmunā is an explicative supplement [to the subject]) have taken gods besides Him. Why [if what they claim is true] do they not bring some clear warrant, some manifest argument, regarding them? regarding worship of these [idols]. And who does greater wrong — in other words, no one does greater wrong — than he who invents a lie against God?, by   ascribing partners to Him, exalted be He. Some among the youths said to the others:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These, our people, have chosen (other) gods) they have worshipped idols (beside Him though they bring no clear warrant) a clear proof ((vouchsafed) to them) that Allah commanded them to worship them. (And who doth greater wrong than he who inventeth a lie concerning Allah) that He has a partner?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { هؤلاء قومنا } إشارة إلى النفس الأمارة وقواها، لأن لكل قوم إلهاً تعبده وهو مطلوبها ومرادها، والنفس تعبد الهوى كقوله:\n\n[الجاثية، الآية: 23]، أو إلى أهل زمان كل من خرج منهم داعياً إلى الله، إذ كل من عكف على شيء يهواه فقد عبده\n { لولا يأتون عليهم } أي: على عبادتهم وإلهيتهم وتأثيرهم ووجودهم { بسلطان بيّن } أي: حجة بيّنة دليل على فساد التقليد وتبكيت بأن إقامة الحجة على إلهية غير الله وتأثيره ووجوده محال، كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قالوا على وجه التعريض والتسفيه: { هَـٰؤُلاۤءِ } الضالون عن منهج الرشاد ومسلك السداد { قَوْمُنَا ٱتَّخَذُواْ } من غوايتهم وضلالهم { مِن دُونِهِ } سبجانه { آلِهَةً } باطلةً أي: أصناماً وأوثاناً يعبدونها لعبادة الله { لَّوْلاَ } أي: هلا { يَأْتُونَ عَلَيْهِم بِسُلْطَانٍ بَيِّنٍ } أي: بحجةٍ واضحةٍ وبيّنةٍ لائحةٍ ومعجزةٍ باهرةٍ، صادرةٍ من قِبلهم دالةٍ على لياقتهم الألوهية والربوبية، فإن لم يأتوا فهم حينئذ مفترون على الله بإثبات الشريك له { فَمَنْ أَظْلَمُ } وأطغى وأضل { مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ } الواحد الأحد، المستقل بالألوهية بإثبات الشريك له، سيما أمثال هذه التماثيل العاطلة { كَذِباً } [الكهف: 15] مخالفاً للواقع، بلا مستند عقلي أو نقلي، بل ظلماً وزوراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { هؤلاء }: مبتدأ، وفي اسم الإشارة تحقير لهم، و { قومنا }: عَطْفُ بيانٍ له\n و { اتخذوا }: خبر، و { ما يعبدون }: موصول، عطف على الضمير المنصوب، أو مصدرية، أي: وإذ اعتزلتموهم ومَعْبُودِيهِمْ إلا الله، أو عبادتهم إلا عبادة الله، وعلى التقديرين: فالاستثناء متصل على تقدير أنهم كانوا مشركين يعبدون الله والأصنام\n ومنقطع على تقدير تمحضهم بعبادة الأوثان، ويجوز أن تكون { ما } نافية على أنه إخبار من الله - تعالى - عن الفتية بالتوحيد، معترض بين \" إذ \" وجوابه العامل فيها\n يقول الحقّ جلّ جلاله: { نحن نقصُّ عليك نبأَهم } ، والنبأ: الخبر الذي له شأن وخطر، قصصًا ملتبسًا { بالحق }: بالصدق الذي لا يطرقه كذب ولا ريبة\n وخبرهم، حسبما ذكر محمد بن إسحاق: أنه قد مرج أهل الإنجيل، وظهرت فيهم الخطايا، وطغت ملوكهم، فعبدوا الأصنام وذبحوا للطواغيت، وكان مَنْ بَالَغَ في ذلك وعتا عتوًا كبيرًا: \" دقيانوس \" فإنه غلا فيه غلوًا كبيرًا، فجاس خلال الديار والبلاد بالعبث والفساد، وقتل من خالفه ممن تمسك بدين المسيح، وكان يتتبع الناس فيُخيرهم بين القتل وبين عبادة الأوثان، فمن رغب في الحياة الدنيا الدنية: تبعه وصنع ما يصنع، ومن آثر عليها الحياة الأبدية: قتله وقطع آرابه، وعلّقها بسور المدينة وأبوابها\n فلما رأى الفتيةُ ذلك، وكانوا عظماء مدينتهم، وكانوا بني الملوك، قاموا فتضرعوا إلى الله تعالى، واشتغلوا بالصلاة والدعاء، فبينما هم كذلك إذ دخل عليهم أعوان الجبار، فأحضروهم بين يديه، فقال لهم ما قال، فخيَّرهم بين القتل وبين عبادة الأوثان، فقالوا: إن لنا إلهًا ملأ السماواتِ والأرض عظمةً وجبروتًا، لن ندعو من دونه أحدًا، ولن نُقر بما تدعونا إليه أبدًا، فاقض ما أنت قاض، فأمر بنزع ما عليهم من الثياب الفاخرة، وأخرجهم من عنده\n زاد في رواية: وضمنهم أهلهم، وخرج إلى مدينة نينوى لبعض شأنه، وأمهلهم إلى رجوعه ليتأملوا في أمرهم، وإلاَّ فعل بهم ما فعل بسائر المسلمين\n  فأجمعت الفتيةُ على الفرار والالتجاء إلى الكهف الحصين، فأخذ كلٍّ منهم من بيت أبيه شيئًا، فتصدقوا ببعضه، وتزودوا بالباقي، فأَوَوْا إلى الكهف\n وفي رواية: أنهم مروا بكلب فتبعهم، على ما يأتي في شأنه، فجعلوا يُصَلُّون في ذلك الكهف آناء الليل وأطراف النهار، ويبتهلون إلى الله - سبحانه - بالأنين والجُؤَار، ففوضوا أمر نفقتهم إلى \" يمليخا \" ، فكان إذا أصبح يضع عنه ثيابه الحسان، ويلبس ثياب المساكين، ويدخل المدينة ويشتري ما يهمهم، ويتحسس ما فيها من الأخبار، ويعود إلى أصحابه، فلبثوا على ذلك إلى أن قَدِم الجبارُ المدينةَ فطلبهم، وأحضر آباءهم، فاعتذروا بأنهم عَصَوْهم ونهبوا أموالهم، وبذروها في الأسواق، وفروا إلى الجبل\n\n\nفلما رأى \" يمليخا \" ما رأى من الشر رجع إلى أصحابه وهو يبكي، ومعه قليل من الزاد، فأخبرهم بما شهد من الهول، ففزعوا إلى الله - عزّ وجلّ - وخروا له سُجدًا، ثم رفعوا رؤوسهم وجلسوا يتحدثون في أمرهم، فبينما هم كذلك إذ ضرب الله على آذانهم فناموا، ونفقتُهم عند رؤوسهم\n فخرج \" دقيانوس \" في طلبهم بخيله ورَجله، فوجدهم قد دخلوا الكهف، فأمر بإخراجهم فلم يُطق أحدٌ منهم أن يَدخله، فلما ضاق بهم ذرعًا، قال قائل منهم: أليس لو كنتَ قدرتَ عليهم قتلتهم؟ قال: بلى\n قال: فابْنِ عليهم باب الكهف وَدَعْهم يموتوا جُوعًا وعَطَشًا، ففعل فكان شأنهم ما قص الله تعالى، إذ قال:  { إِنهم فتيةٌ } ، استئناف بياني، كأن سائلاً سأل عن حالهم، فقال: إنهم فتية شبان كاملون في الفتوة { آمنوا بربهم } ، فيه التفات إلى ذكر الربوبية التي اقتضت تربيتهم وحفظهم، { وزدناهم هُدىً } بأن ثبَّتناهم على ما كانوا عليه، وأظهرنا لهم من مكنونات محاسننا ما آثروا به الفناء على البقاء\n وفيه التفات إلى التكلم لزيادة الاعتناء بشأنهم، { وربطنا على قلوبهم } أي: قويناهم، حتى اقتحموا مضايق الصبر على هجر الأهل والأوطان، والنعيم والإخوان، واجترأوا على الصدع بالحق من غير خوف ولا حذر، والرد على دقيانوس الجبار { إِذْ قاموا } أي: انتصبوا لإظهار شعار الدين، قال مجاهد: خرجوا من المدينة فاجتمعوا على غير ميعاد\n فقال أكبرهم: إني لأجد في نفسي شيئًا، إن ربي هو رب السماوات والأرض، فقالوا: نحن أيضًا كذلك، فقاموا جميعًا { فقالوا ربُنا ربُّ السماواتِ والأرضِ } ، وعزموا على التصميم بذلك\n وقيل: قاموا بين يدي الجبار من غير مبالاة به، حين عاتبهم على ترك عبادة الأصنام، فحينئذ يكون ما سيأتي من قوله تعالى: { هؤلاء\n\n\n } الخ: منقطعًا صادرًا عنهم، بعد خروجهم من عنده\n ثم قالوا: { لن ندعوَ من دونه إِلهًا } ، لا استقلالاً ولا اشتراكًا، ولم يقولوا: ربًا للتصميم على الرد على المخالفين، حيث كانوا يُسمون أصنامهم آلهة، وللإشعار بأن مدار العبودية على وصف الألوهية\n { لقد قُلنا إِذًا شَطَطًا }: قولاً ذا شطط، وهو الجور والتعدي، أي: لقد جُرنا وأفرطنا في الكفر، وقلنا قولاً خارجًا عن حد المعقول، إنْ دعونا إلهًا غير الله جَزْمًا\n { هؤلاء قومُنَا } قد { اتخذوا من دونه آلهةً } ، فيه معنى الإنكار، { لولا }: هلا { يأتونَ عليهم }: على ألوهيتهم { بسلطان بَيِّن }: بحجة ظاهرة، { فمن أظلمُ } أي: لا أحد أظلم { ممن افترى على الله كذبًا } بنسبة الشريك إليه فإنه أظلم من كل ظالم\n\n",
      "translations": []
    }
  ]
}