{
  "chapter": "الكهف",
  "text": "سيقولون ثلثة رابعهم كلبهم ويقولون خمسة سادسهم كلبهم رجمۢا بالغيب ويقولون سبعة وثامنهم كلبهم قل ربى اعلم بعدتهم ما يعلمهم الا قليل فلا تمار فيهم الا مراء ظهرا ولا تستفت فيهم منهم احدا",
  "translations": [
    {
      "translation": "They will say, 'There were three of them, their dog being the fourth.' They will say, 'There were five of them, their dog being the sixth,' guessing at the Unseen. And they will say, 'There were seven of them, their dog being the eighth.' Say: 'My Lord knows best their number. Those who know about them are very few.' So do not enter into any argument concerning them, except in relation to what is clearly known. And do not seek the opinion of any of them regarding them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some will say: \"They were three, and their dog was the fourth;\" and some will also say: \"They were five and their dog was the sixth,\" -- guessing in the dark. And some will even say: \"They were seven, and their dog the eighth.\" Say: \"My Lord alone knows best their number; none but only a few know of them.\" So do not argue about it with them but lightly, and do not enquire about them from any one of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some will say concerning them: \"They were three and their dog, the fourth\"; and some will say: \"They were five, and their dog, the sixth\" -- all this being merely guesswork; and still others will say: \"They were seven, and their dog, the eighth.\" Say: \"My Lord knows their number best. Only a few know their correct number. So do not dispute concerning their number, but stick to what is evident, and do not question anyone about them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(With regard to the number of the youths) some say, \"There were three and the dog was the fourth one,\" Others say, \"There were five and the dog was the sixth one.\" In reality, they are just feeling around in the dark. Still some of them say, \"There were seven and the dog was the eighth one.\" (Muhammad), say, \"My Lord has the best knowledge of their number. You know very little about it.\" Do not insist on arguing with them, but merely tell them the story as it has been revealed to you and do not ask anyone about them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the people will now say, “They are three, their dog is the fourth”; and some will say, “They are five, their dog is the sixth” – just blind guesses; and some will say, “They are seven, and their dog is the eighth”; proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “My Lord well knows their number – no one knows them except a few”; therefore do not debate concerning them except what has occurred, and do not ask any of the People of the Book(s) anything concerning them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say they were three, the dog being the fourth among them; and they say they were five, the dog being the sixth, guessing at the unseen; and they say they were seven, and the dog being the eighth. Say: \"My Lord knows best their number; none knows them but a few.\" So debate not except with the clear proof. And consult not any of them (about the people of the Cave).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some) say: (They are) three, the fourth of them being their dog; and (others) say: Five, the sixth of them being their dog, making conjectures at what is unknown; and (others yet) say: Seven, and the eighth of them is their dog. Say: My Lord best knows their number, none knows them but a few; therefore contend not in the matter of them but with an outward contention, and do not question concerning them any of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will say, 'Three; and 'their dog was the fourth of them.' They will say, 'Five; and their dog was the sixth of them, guessing at the Unseen. They will say, 'Seven; and their dog was the eighth of them.' Say: 'My Lord knows very well their number, and none knows them, except a few.' So do not dispute with them, except in outward disputation, and ask not any of them for a pronouncement on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some) will say: They were three, their dog the fourth, and (some) say: Five, their dog the sixth, guessing at random; and (some) say: Seven, and their dog the eighth. Say (O Muhammad): My Lord is Best Aware of their number. None knoweth them save a few. So contend not concerning them except with an outward contending, and ask not any of them to pronounce concerning them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some will say, \"They were three, the fourth was their dog,\" and others will say, \"They were five, the sixth was their dog,\" guessing at random. And yet others say, \"They were seven, the eighth was their dog.\" Say, \"My Lord knows best their number.\" Only a few know anything about them. Therefore, do not enter into controversies over them, nor seek information about them from any of them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anon they will say: they were three the fourth of them their dog. And they will say: they were five, the sixth of them their dog- -guessing at the unknown --and they willl say: they were seven, the eighth of them their dog. Say thou: my Lord is the Best Knower of their number; there knew them only a few; so debate thou not regarding them except an cut ward debating, and ask not regarding them anyone of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘[They are] three; their dog is the fourth of them,’ and say, ‘[They are] five, their dog is the sixth of them,’ taking a shot at the invisible. They will say, ‘[They are] seven, their dog is the eighth of them.’ Say, ‘My Lord knows best their number, and none knows them except a few.’ So do not dispute concerning them, except for a seeming dispute, and do not question about them any of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some) say they were three, the dog being the fourth among them; (others) say they were five, the dog being the sixth,- doubtfully guessing at the unknown; (yet others) say they were seven, the dog being the eighth. Say thou: \"My Lord knoweth best their number; It is but few that know their (real case).\" Enter not, therefore, into controversies concerning them, except on a matter that is clear, nor consult any of them about (the affair of) the Sleepers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some) say they were three, the dog being the fourth among them; (others) say they were five, the dog being the sixth, guessing at the unseen; (yet others) say they were seven, the dog being the eighth. Say (O Muhammad SAW): \"My Lord knows best their number; none knows them but a few.\" So debate not (about their number, etc.) except with the clear proof (which We have revealed to you). And consult not any of them (people of the Scripture, Jews and Christians) about (the affair of) the people of the Cave.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some will say: 'They were three; their dog was the fourth' Others, guessing at the Unseen, will say: 'They were five and their dog was the sixth' And yet others: 'Seven; their dog was the eighth' Say: 'My Lord knows best their number. Except for a few none know their number' Therefore, do not dispute with them except in outward disputation, and do not ask any of them concerning them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “Three, and their fourth being their dog.” And they will say, “Five, and their sixth being their dog,” guessing at the unknown. And they will say, “Seven, and their eighth being their dog.” Say, “My Lord knows best their number.” None knows them except a few. So do not argue concerning them except with an obvious argument, and do not consult any of them about them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say there were three, the fourth of them being their dog; and they will say there were five, the sixth of them being their dog - guessing at the unseen; and they will say there were seven, and the eighth of them was their dog. Say, [O Muhammad], \"My Lord is most knowing of their number. None knows them except a few. So do not argue about them except with an obvious argument and do not inquire about them among [the speculators] from anyone.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:22] They will say, that is, [some of] those disputing the number of the youths [of the cave] at the time of the Prophet (s), in other words, some of these will say that they [the youths] were: ‘Three; their dog the fourth of them’; and they, some [others] among them, will say, ‘Five; their dog the sixth of them’ — both of these sayings were those of the Christians of Najrān — guessing at random, in other words, out of supposition, not having been present with them [at the time], and this [statement ‘guessing at random’] refers back to both sayings, and is in the accusative because it is an object denoting reason, in other words, [they said this] for the reason that they were [merely] supposing it. And they, that is, the believers, will say, ‘Seven; and their dog the eighth of them’ (the sentence is [part of] the subject clause, the predicate of which is the adjectival qualification of sab‘a, ‘seven’ [namely, thāminuhum, ‘the eighth of them’] with the additional wāw [wathāminuhum], which is said to be for emphasis, or an indication that the adjective is [semantically] attached to that which it is qualifying). The qualification of the first two sayings as being ‘random’, but not the third, is proof that [the latter] is the satisfactory and correct [number]. Say: ‘My Lord knows best their number, and none knows them except a few’: Ibn ‘Abbās said, ‘I am [one] of these “few” [described]’, and he mentioned that they were seven. So do not contend concerning them except with an outward manner [of contention], [except] with that which has been revealed to you, and do not question concerning them, do not ask for opinions [from], any of them, [from] the People of the Scripture, the Jews. The people of Mecca asked him [the Prophet] about the story of the People of the Cave, and so he said to them, ‘I will tell you about it tomorrow’, but without adding [the words], ‘If God wills’ (inshā’a’ Llāhu) and so the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Some) will say) the Christians of Najran, al-Sayyid and his followers who were Nestorians, will say: (They were three) they were three young men in the Cave, (their dog) Qatmir (the fourth, and (some) say) al- 'Aqib and his followers who were Jacobite Christians will say: (Five) they were five young men, (their dog the sixth, guessing at random) without having definite knowledge; (and (some) say) the followers of al-Malik who were Melkites: (Seven) they were seven young men, (and their dog the eighth. Say) to them, Muhammad: (My Lord is best aware of their number. None knoweth them save a few) among the believers. Ibn 'Abbas, may Allah be pleased with him and with his father, said: \"I am among those few: they were eight young men, and the dog\". (So contend not concerning them) so do not argue with them concerning the number of the sleepers of the Cave (except with an outward contending) unless you recite the Qur'an to them outwardly, (and ask not any of them to pronounce concerning them) do not ask any one of them about their number; enough is what Allah has clarified to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ تُمَارِ فِيهِمْ إِلاَّ مِرَآءً ظَاهِراً } معناه إلاّ أن تُحدِّثَهم بهِ حديثاً\n\n\n\n\nوقوله تعالى: { رَجْماً بِٱلْغَيْبِ } معناه ظَنٌّ\n\n",
      "translations": [
        {
          "translation": "\nAnd his saying - {But do not argue with them} - means except that you should inform them with a story.\n\n\nAnd His saying, \"a stoning in the unseen,\" means a conjecture.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { سيقولون } أي: الظاهريون من أهل الكتاب والمسلمين الذين لا علم لهم بالحقائق\n وقوله: { رجماً بالغيب } أي: رمياً بالذي غاب عنهم\n يعني: ظنّاً خالياً عن اليقين بعد قولهم: { ثلاثة رابعهم كلبهم } و { خمسة سادسهم كلبهم } وتوسيط الواو الدالة على أن الصفة مجامعة للموصوف ولا تفارقه\n وأنه لا عدد وراءه بين قوله: { ويقولون سبعة } وبين { وثامنهم كلبهم }\n وقوله: { ما يعلمهم إلا قليل } بعده\n يدل على أنّ العدد هو سبعة لا غير\n فالقليل هم المحققون القائلون به وإن أوّلناهم بالقوى الروحانية فهم العاقلتان: النظرية والعملية\n والفكر والوهم\n والتخيل والذكر\n والحسّ المشترك المسمى بنطاسيا\n والكلب النفس والشمس والروح على كلا التأويلين\n ولهذا روي عن أمير المؤمنين عليه السلام أنه قال: \" إنهم كانوا سبعة\n ثلاثة عن يمين الملك وثلاثة عن يساره\n والسابع هو الراعي صاحب الكلب \" \n فإن صحت الرواية فالملك هو دقيانوس النفس الأمّارة\n والثلاثة الذين كانوا عن يمينه يستشيرهم هم العاقلتان والفكر\n والثلاثة الذين كانوا عن يساره يستوزرهم هم التخيل والوهم والذكر\n والراعي هو بنطاسيا صاحب أغنام الحواس\n والذين قالوا هم ثلاثة ارادوا القلب والعاقلتين\n والذين قالوا خمسة زادوا عليهم الفكر والوهم وتركوا المدرك للصور والذكر لعدم تصرفهما وكون كل منهما كالخزانة\n وعلى هذا التأويل فالاطلاع للفئة المحققين من الحضرة الإلهية على بقاء النفس بعد خراب البدن\n والتنازع\n هو التجاذب والتغالب الواقع بين القوى في الاستيلاء على البدن الذي يبعثون فيه وهو البنيان المأمور ببنائه والآمرون هم الغالبون الذين قالوا: { لَنَتَّخِذَنَّ عَلَيْهِمْ مَّسْجِداً } [الكهف\n الآية: 21] يسجد\n أي: ينقاد فيه جميع القوى الحيوانية و الطبيعية والنفسانية والمأمورون هم المغلوبون الفاعلون في البدن المبعوث فيه والله أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ثم بين ما هو أولى وأحق فقال: { سَيَقُولُونَ ثَلاثَةٌ رَّابِعُهُمْ } أي: مصيرهم أربعة { كَلْبُهُمْ وَيَقُولُونَ خَمْسَةٌ سَادِسُهُمْ } اي: مصيرهم ستةً { كَلْبُهُمْ } كلا القولين\n الأول قول اليهود\n والثاني قول النصارى صدر عنهم { رَجْماً } ورمياً { بِٱلْغَيْبِ } إذ لا مستند لهم من التواريخ وقول الرسل { وَيَقُولُونَ } هم { سَبْعَةٌ وَثَامِنُهُمْ } أي: مصيِّرهم ثمايةً { كَلْبُهُمْ } والواو وإن كان مقحماً\n أفاد توكيد لصوق الصفة بالموصوف وشدة اتصاله به\n ليدل على صدقه ومطابقته\n ومثله في القرآن كثير\n منه قوله تعالى:\n[الحجر: 4] وغير ذلك\n وهي مثل الواو في قولهم: جاءني زيدُ \n ومعه ثوبُ\n\n\nهذا قول المؤمنين أخذوا من رسول الله\n وهو من جبريل\n وجبرائيل من الله سبحانه\n فإن شكوا فيه أيضاً ونسبوه إلى الرّمي والتخمين { قُلاً } لهم يا أكمل الرسل: { رَّبِّي أَعْلَمُ بِعِدَّتِهِم } إذ لا يعزب عن علمه شيءُ من أحوالهم من أول أمرهم إلى أخره\n لأن علمه بمعلوماته حضوريُ\n لا يغيب عنه أصلاً وهم { مَّا يَعْلَمُهُمْ } من أحوالهم { إِلاَّ قَلِيلٌ } بالأخبار والتواريخ\n وأكثرها غير مطابق للواقع\n ولما كان قولهم وعلمهم راجعاً إلى الرجم والرمي بلا مستند { فَلاَ تُمَارِ } ولا تجادل يا أكمل الرسل { فِيهِمْ } أي: في حق الفتية { إِلاَّ مِرَآءً ظَاهِراً } أي: جدالاً خفيفاً مقتصراً على ما أوحينا إليك\n لا متعمقاً غليظاً بأن تُجهلهم وتُسفههم\n وتضحك من قولهم\n وتنسبه إلى الخرافة الخرق\n\n{ وَ } أيضاً { لاَ تَسْتَفْتِ } ولا تسأل { فِيهِمْ } أي: في حق الفتية وأمرهم { مِّنْهُمْ } أي: من أهل الكتاب { أَحَداً } [الكهف: 22] يعني: لا ستفتِ أحداً منهم عن قصتهم وشأنهم بعدما ظهر عليك أمرهم بالوحي\n لأن استفتاءك بعد الوحي\n إما سؤالُ تعنتٍ وامتحانٍ\n فهو لا يليق بمرتبة الرسالة والنبوة\n بعدي عن مكارم الأخلاق ومحاسن الشيم اللازمة لمرتبة النبوة\n وإما سؤال استعلام واسترشاد\n فهم قاصرون عاجزون عنهها\n مع أنه لا معنى للسؤال بعد الوحي\n\n\n{ وَ } لما أمره اليهود لقريش أن يسألوا رسول الله صلى الله عليه وسلم سؤال تعنتٍ وامتحانٍ عن الروح وذي القرنين وأصحاب الكهف\n فسألوا\n فقال رسول الله صلى الله عليه وسلم:\n \" ائتُوني غَداً أُخْبِركُمْ عَنْهَا \"\n \n \nقاله بلا استنثاءٍ وتعليقِ بمشيئتةِ\n أي: لم يقل: إن شاء الله\n فانسد عليه باب الوةحي بضعة عشر يوماً\n فشق عليه صلى الله عليه وسلم الأمر\n وكذَّبته قريش وتحزّن حزناً شديداًن فنهاه سبحانته نهياً مؤكداً\n وأدّبه تأديباً بليغاً\n لئلا يترك الاستثناء في الأمور أصلاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "58:7",
      "similarity": 0.5572059548186231
    },
    {
      "verse": "4:12",
      "similarity": 0.4057892480533826
    },
    {
      "verse": "5:4",
      "similarity": 0.28362807861610007
    },
    {
      "verse": "4:11",
      "similarity": 0.2730346814101726
    },
    {
      "verse": "24:7",
      "similarity": 0.20324930814415473
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/018022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/018022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}