{
  "chapter": "الكهف",
  "text": "واتل ما اوحى اليك من كتاب ربك لا مبدل لكلمته ولن تجد من دونه ملتحدا",
  "translations": [
    {
      "translation": "Recite what has been revealed to you of your Lord's Book. No one can change His Words. You will never find any safe haven apart from Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what has been revealed to you of the Book of your Lord. There is no one who can change the word of God; and you will not find refuge except in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), recite to them from the Book of your Lord what has been revealed to you for none may change His words; (and were you to make any change in His words) you will find no refuge from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read whatever is revealed to you from the Book of your Lord. No one can change His words and you can never find any refuge other than Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite the Book of your Lord which has been divinely revealed to you; there is none who can change His Words; and you will never find a refuge besides Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite what has been revealed to you (O Muhammad) of your Lord's Book. None can change His Words, and none will you find as refuge other than Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite what has been revealed to you of the Book of your Lord, there is none who can alter His words; and you shall not find any refuge besides Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what has been revealed to thee of the Book of thy Lord; no man can change His words. Apart from Him, thou wilt find no refuge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite that which hath been revealed unto thee of the Scripture of thy Lord. There is none who can change His words, and thou wilt find no refuge beside Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim what has been revealed to you from your Lord's Book. None can change His words. You shall find no refuge besides Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rehearse thou that which hath been revealed unto thee of the Book of thy Lord; and none may alter His Words, and never wilt thou find beside Him a covert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what has been revealed to you from the Book of your Lord. Nothing can change His words, and you will never find any refuge besides Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite (and teach) what has been revealed to thee of the Book of thy Lord: none can change His Words, and none wilt thou find as a refuge other than Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite what has been revealed to you (O Muhammad SAW) of the Book (the Quran) of your Lord (i.e. recite it, understand and follow its teachings and act on its orders and preach it to men). None can change His Words, and none will you find as a refuge other than Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite what is revealed to you in the Book of your Lord. No one can change His Words. You shall find no refuge other than Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite what was revealed to you from the Book of your Lord. There is no changing His words, and you will find no refuge except in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite, [O Muhammad], what has been revealed to you of the Book of your Lord. There is no changer of His words, and never will you find in other than Him a refuge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:27] And recite that which has been revealed to you of the Book of your Lord. There is none who can change His words. And you will not find, besides Him, any refuge.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And recite that which hath been revealed unto thee of the Scripture of thy Lord) He says: recite to them the Qur'an, neither increasing nor decreasing anything from it. (There is none who can change His words, and thou wilt find no refuge beside Him) beside Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَن تَجِدَ مِن دُونِهِ مُلْتَحَداً } معناه مَلجأٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {There is none equal to Him} means that He is the ultimate refuge.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والكتاب هو العقل الفرقاني وعلى التقديرين { لا مبدّل لكلماته } التي هي أصول الدين من التوحيد والعدل وأنواعهما { ولن تجد من دونه ملتحداً } تميل إليه لامتناع وجود ذلك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إذ كان مفاتيحُ المغيبات ومقاليدُ العلوم والإدراكات، وكذا جميعُ ما في العالم من المحسوسات والمشاهدات كلُّها مستندةُ إليه سبحانه، ناشئةُ من عنده { ٱتْلُ } يا أكمل الرسل على من تبعك من المؤمين { مَآ أُوْحِيَ إِلَيْكَ مِن كِتَابِ رَبِّكَ } على الوجه الذي أُنزل إليك بلا تبديلٍ وتحريفٍ؛ إذ { لاَ مُبَدِّلَ لِكَلِمَاتِهِ } ولا متصرف في كلامه سواه، ولا تسمع قول المشركين:\n\n[يونس: 15] إذ لا يسع لأحدٍ أن يبدله ويحرفه { وَ } إن همتَ إلى تبديله وتحريفه من تلقاء نفسك { لَن تَجِدَ مِن دُونِهِ } سبحانه { مُلْتَحَداً } [الكهف: 27] ملجاً تلتجئ إليه نزول عذاب الله، وحلول أخذه وانتقامه على تبديلك وتغييرك كلامه\n\n\n\n\nثم لما طلب صناديد قريش من روسل الله صلى الله عليه وسلم إبعاد فقراء المؤمنين وطردهم عن مجلسه، مثل أبن آم مكتوم وأبي ذر وفقراء أصحابه؛ لرثاثة حالهم وشمول الفاقة عليهم حتى يصاحبوه صلى الله عليه وسلم ويجالسوا معهم، فهمّ رسول الله صلى الله عليه وسلم على إنجاج ما أرادوا واقترحوا، وأمر بالفقراء ألا يحضروا معهم في مجلسه، ردّ الله سبحانه على رسوله رداً بليغاً، ونهاه عنه نهياً شديداً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { واتلُ ما أُوحي إليك من كتاب ربك } أي: أسرده على ما نزل، ولا تسمع لقولهم\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:22",
      "similarity": 0.6698272332130937
    },
    {
      "verse": "7:180",
      "similarity": 0.6680780198336587
    },
    {
      "verse": "41:40",
      "similarity": 0.6381666627896475
    },
    {
      "verse": "22:25",
      "similarity": 0.4696516033328035
    },
    {
      "verse": "16:103",
      "similarity": 0.38352875438675144
    }
  ]
}