{
  "chapter": "الكهف",
  "text": "قيما لينذر باسا شديدا من لدنه ويبشر المؤمنين الذين يعملون الصلحت ان لهم اجرا حسنا",
  "translations": [
    {
      "translation": "It is straight, to warn of violent force direct from Him, and to give the good news to the muminun, those who do right actions, that for them there is an excellent reward,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Immutable, so that it may warn of a severe punishment from Him; and give happy tidings to those who believe and do the right that there is a better reward (of Paradise) for them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "an unerringly Straight Book, meant to warn of a stern punishment from Allah, and to proclaim, to those who believe and work righteous deeds, the tiding that theirs shall be a good reward\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that he could warn them of His stern retribution, give the glad news of the best and everlasting reward to the righteously striving believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A just Book, to warn of Allah’s severe punishment, and to give glad tidings to the believers who do good deeds, that for them is an excellent reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He has made it) straight to give warning of a severe punishment from Him, and to give good news to the believers, who do righteous deeds, that they shall have a fair reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rightly directing, that he might give warning of severe punishment from Him and give good news to the believers who do good that they shall have a goodly reward,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "right, to warn of great violence from Him, and to give good tidings unto the believers, who do righteous deeds, that theirs shall be a goodly wage\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(But hath made it) straight, to give warning of stern punishment from Him, and to bring unto the believers who do good works the news that theirs will be a fair reward,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and which rightly directs, to give warning of stern punishment from Him, and to proclaim to the believers who do righteous deeds that they shall have an excellent recompense,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Straightforward, that it may warn of a severe violence from before Him, and bring glad tidings to the believers who work righteous works that theirs shall be a goodly hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[a Book] upright, to warn of a severe punishment from Him, and to give good news to the faithful who do righteous deeds, that there shall be for them a good reward,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He hath made it) Straight (and Clear) in order that He may warn (the godless) of a terrible Punishment from Him, and that He may give Glad Tidings to the Believers who work righteous deeds, that they shall have a goodly Reward,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He has made it) Straight to give warning (to the disbelievers) of a severe punishment from Him, and to give glad tidings to the believers (in the Oneness of Allah Islamic Monotheism), who work righteous deeds, that they shall have a fair reward (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "unswerving. To warn of great violence from Him, and to give good tidings to the believers who do good deeds that theirs shall be a goodly wage\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Valuable—to warn of severe punishment from Himself; and to deliver good news to the believers who do righteous deeds, that they will have an excellent reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He has made it] straight, to warn of severe punishment from Him and to give good tidings to the believers who do righteous deeds that they will have a good reward\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:2] [a Book] upright, (qayyiman is a second circumstantial qualifier for [added] emphasis) to warn of, to make, by this Book, the disbelievers fear, severe chastisement from Him, from God, and to bring to the believers who perform righteous deeds the good tidings that theirs will be a fair reward,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((But hath made it) straight) and it is also said that this means: custodian over all other Scriptures, (to give warning) so that Muhammad (pbuh) gives warning by means of the Qur'an (of stern punishment from Him, and to bring) and so that Muhammad brings the Qur'an (unto the) sincere (believers who do good works) between them and their Lord (the news that theirs will be a fair reward) they will have a fair reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال حدّثنا علي بن أحمد\n قالَ حدّثنا عطاءُ بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قوله تعالى: { مِّن لَّدُنْهُ } من عِندَهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\n{He} said: {We} were told by {Ali ibn Ahmad}\n\n\nHe said, \"It was narrated to us by `Ata' ibn al-Sa'ib from Abu Khalid from Zayd ibn `Ali, may Allah be pleased with them, in his saying regarding Allah's statement, {From Him} from His side.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قيماً } أي: جعله قيماً\n يعني: مستقيماً كما أمر بقوله:\n[هود\n الآية: 112]\n والمعنى: جعله موحداً فانياً فيه غير محتجب في شهوده بالغير ولا بنفسه لكونها غير أيضاً ممكناً مستقيماً حال البقاء\n كما قال:\n[فصلت\n الآية: 30]\n أو جعله قيماً بأمر العباد وهدايتهم إذ التكميل يترتب على الكمال لأنه عليه الصلاة والسلام لما فرغ من تقويم نفسه وتزكيتها أقيمت نفوس أمته مقام نفسه فأمر بتقويمها وتزكيتها ولهذا المعنى سمى إبراهيم صلوات الله عليه أمة\n وهذه القيمية أي القيام بهداية الناس داخلة في الاستقامة المأمور هو بها في الحقيقة { لينذر } متعلق بعامل قيماً أي: جعله قيماً بأمر العباد { لينذر بأساً شديداً } وحذف المفعول الأول للتعميم لأن أحداً لا يخلو من بأس مؤمناً كان أو كافراً\n كما قال تعالى:\n \" أنذر الصدّيقين بأني غيور\n وبشّر المذنبين بأني غفور \" \nإذ البأس عبارة عن قهره ولذلك عظمه بالتنكير\n أي: بأساً يليق بعظمته وعزّته ووصفه بالشدّة وخصصه بقوله: { من لدنه } والقهر قسمان: قهر محض ظاهره وباطنه قهر كالمختص بالمحجوبين بالشرك\n وقسم ظاهره قهر وباطنه لطف\n وكذا اللطف كما قال أمير المؤمنين علي عليه السلام: سبحان من اشتدّت نقمته على أعدائه في سعة نعمته\n واتسعت رحمته لأوليائه في شدّة نقمته\n ومن القسم الثاني القهر المخصوص بالموحدين من أهل الفناء أطلق الإنذار للكل تنبيهاً ثم فصل اللطف والقهر مقيدين بحسب الصفات والاستحقاقات فقال: { ويبشّر المؤمنين } أي: الموحدين لكونهم في مقابلة المشركين الذين قلوا: اتخذ الله ولداً\n { الذين يعملون الصالحات } أي: الباقيات من الخيرات والفضائل لأن الأجر الحسن هو من جنة الآثار والأفعال التي تستحق بالأعمال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل جعله { قَيِّماً } مستقيماً معتدلاً بين طرفي الإفراط والتفريط المذمومين عقلاً وشرعاً\n وإنما أنزله إلى عبده وحبيبه صلى الله عليه وسلم { لِّيُنْذِرَ } بإنذاراته الكافرين الذين كفروا بالله وجحدوا في توحيده\n وعملوا السيئات المبعدة عن طريق النجاة { بَأْساً شَدِيداً } وعذاباً أليماً عظيماً صادراً { مِّن لَّدُنْهُ } أي: من عند الله العزيز المنتقم بطشاً لهم وانتقاماً منهم { وَيُبَشِّرَ } أيضاً بتبشراته { ٱلْمُؤْمِنِينَ } الموحدين { ٱلَّذِينَ يَعْمَلُونَ ٱلصَّالِحَاتِ } المقربة لهم إلى مرتبة التوحيد الصادرة عنهم على مقتضى يقينهم وعرفانهم { أَنَّ لَهُمْ } أي: أن لهم { أَجْراً حَسَناً } [الكهف: 2] هو التحقق بشرف اللقاء والفوز بمطالعة جمال الله والاستغراق بملاحظة وجهه الكريم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قَيّمًا }: حال من الكتاب\n والعامل فيه: \" أنزل \" \n ومنعه الزمخشري للفصل بين الحال وذي الحال\n واختار أن العامل فيه مضمر\n تقديره: جعله قيّمًا\n و \" لينذر \": يتعلق بأنزل\n أو بقيّمًا\n والفاعل: ضمير الكتاب\n أو النبي صلى الله عليه وسلم\n و \" بأسًا \": مفعول ثان\n وحذف الأول\n أي: لينذر الناس بأسًا\n كما حذف الثاني من قوله: { ويُنذر الذين قالوا\n\n\n } الخ لدلالة هذا عليه\n و { مِن عِلْم }: مبتدأ مجرور بحرف زائد\n أو فاعل بالمجرور لاعتماده على النفي\n و \" كلمة \": تمييز\n يقول الحقّ جلّ جلاله: { الحمدُ لله } أي: الثناء الجميل حاصل لله\n والمراد: الإعلام بذلك للإيمان به\n أو الثناء على نفسه\n أو هما معًا\n ثم ذكر وجه استحقاقه له\n فقال: { الذي أَنزل على عبده الكتابَ } أي: الكتاب الكامل المعروف بذلك من بين سائر الكتب\n الحقيق باختصاص اسم الكتاب\n وهو جميع القرآن\n رتَّب استحقاق الحمد على إنزاله تنبيهًا على أنه أعظم نعمائه\n وذلك لأنه الهادي إلى ما فيه كمال العباد\n والداعي إلى ما به ينتظم صلاح المعاش والمعاد\n  وفي التعبير عن الرسول صلى الله عليه وسلم بالعبد\n مضافًا إلى ضمير الجلالة تنبيه على بلوغه صلى الله عليه وسلم إلى معاريج العبادة وكمال العبودية أقصى غاية الكمال\n حيث كان فانيًا عن حظوظه\n قائمًا بحقوقه\n خالصًا في عبوديته لربه\n { ولم يجعلْ له } أي: للكتاب { عِوَجًا } شيئًا من العوج\n باختلافٍ في اللفظ\n وتناقض في المعنى\n وانحراف في الدعوة\n قال القشيري: صانه عن التناقض والتعارض\n فهو كتابٌ عزيزٌ من ربِّ عزيز\n ينزل على عَبْدٍ عزيز\n قَيّمًا: مستقيمًا متناهيًا في الاستقامة\n معتدلاً لا إفراط فيه ولا تفريط\n فهو تأكيد لما دل عليه نفي العوج\n مع إفادته كون ذلك من صفاته الذاتية\n حسبما تُنبئ عنه الصيغة\n أو قَيّمًا بالمصالح الدينية والدنيوية للعباد\n على ما ينبئ عنه ما بعده من الإنذار والتبشير\n فيكون وصفًا له بالتكميل\n بعد وصفه بالكمال\n أو: قَيّمًا على ما قبله من الكتب السماوية\n وشاهدًا بصحتها ومهيمنًا عليها\n { ليُنذر }: ليُخوّف اللهُ تعالى به\n أو الكتاب\n والأول أوْلى لتناسب المعطوفين بعده\n أي: أنزل الكتاب لينذر بما فيه الذين كفروا { بأسًا }: عذابًا { شديداً من لدنه } أي: صادرًا من عنده\n نازلاً من قِبَله\n في مقابلة كفرهم وتكذيبهم\n { ويُبشِّر } بالتشديد والتخفيف\n { المؤمنين }: المصدقين به\n { الذين يعملون } أي: العُمال { الصالحاتِ } التي تَنْبَثُّ في تضاعيفه { أنَّ لهم } أي: بأن لهم في مقابلة إيمانهم وأعمالهم { أجرًا حسنًا } \n هو الجنة وما فيها من المثوبات الحسنى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:67",
      "similarity": 0.6541693626818473
    },
    {
      "verse": "27:6",
      "similarity": 0.548991710776042
    },
    {
      "verse": "18:65",
      "similarity": 0.5469554238088938
    },
    {
      "verse": "4:40",
      "similarity": 0.48330354024595557
    },
    {
      "verse": "11:1",
      "similarity": 0.47820487601512923
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/18:2.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/18:2.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/18:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}