{
  "chapter": "الكهف",
  "text": "واصبر نفسك مع الذين يدعون ربهم بالغدوة والعشى يريدون وجهه ولا تعد عيناك عنهم تريد زينة الحيوة الدنيا ولا تطع من اغفلنا قلبه عن ذكرنا واتبع هوىه وكان امره فرطا",
  "translations": [
    {
      "translation": "Restrain yourself patiently with those who call on their Lord morning and evening, desiring His face. Do not turn your eyes from them, desiring the attractions of this world. And do not obey someone whose heart We have made neglectful of Our remembrance and who follows his own whims and desires and whose life has transgressed all bounds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Persevere with those who call on their Lord morning and evening, seeking His magnificence. Do not turn your eyes away from them, seeking the splendours of this world, and do not follow him whose heart We have made oblivious to Our remembrance, who follows his own lust and exceeds the bound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Keep yourself content with those who call upon their Lord, morning and evening, seeking His pleasure, and do not let your eyes pass beyond them. Do you seek the pomp and glitter of the world? Do not follow him whose heart We have caused to be heedless of Our remembrance, and who follows his desires, and whose attitude is of excess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient with those who worship their Lord in the mornings and evenings to seek His pleasure. Do not overlook them to seek the worldly pleasures. Do not obey those whom We have caused to neglect Us and instead follow their own desires beyond all limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And restrain yourself along with those who pray to their Lord morning and evening, seeking His pleasure; and may not your sight fall on anything besides them; would you desire the adornment of the life of this world? And do not follow him whose heart We have made neglectful of Our remembrance – the one who has followed his own desires and his matter has crossed the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep yourself (O Muhammad) patiently with those who call on their Lord morning and afternoon, seeking His Face; and let not your eyes overlook them, desiring the pomp and glitter of the life of the world; and obey not him whose heart We have made heedless of Our remembrance, and who follows his own lusts, and whose affair has been lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And withhold yourself with those who call on their Lord morning and evening desiring His goodwill, and let not your eyes pass from them, desiring the beauties of this world's life; and do not follow him whose heart We have made unmindful to Our remembrance, and he follows his low desires and his case is one in which due bounds are exceeded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And restrain thyself with those who call upon their Lord at morning and evening, desiring His countenance, and let not thine eyes turn away from them, desiring the adornment of the present life; and obey not him whose heart We have made neglectful of Our remembrance so that he follows his own lust, and his affair has become all excess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Restrain thyself along with those who cry unto their Lord at morn and evening, seeking His Countenance; and let not thine eyes overlook them, desiring the pomp of the life of the world; and obey not him whose heart We have made heedless of Our remembrance, who followeth his own lust and whose case hath been abandoned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Keep yourself attached to those who call on their Lord, morning and evening, seeking His pleasure; and do not let your eyes turn away from them, desiring the attraction of worldly life; and do not obey one whose heart We have made heedless of Our remembrance, one who pursues his own whims and becomes dissolute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And endure thy self in the company of those who call upon their Lord in the morning and evening seeking His and let not thine eyes countenance rove from them seeking the adornment of the life of this world, and obey thou not him whose heart We have made to neglect Our remembrance, and who followeth his lust, and whose affair is exceeding the bound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Content yourself with the company of those who supplicate their Lord morning and evening, desiring His Face, and do not lose sight of them, desiring the glitter of the life of this world. And do not obey him whose heart We have made oblivious to Our remembrance, and who follows his own desires, and whose conduct is [mere] profligacy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep thy soul content with those who call on their Lord morning and evening, seeking His Face; and let not thine eyes pass beyond them, seeking the pomp and glitter of this Life; no obey any whose heart We have permitted to neglect the remembrance of Us, one who follows his own desires, whose case has gone beyond all bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep yourself (O Muhammad SAW) patiently with those who call on their Lord (i.e. your companions who remember their Lord with glorification, praising in prayers, etc., and other righteous deeds, etc.) morning and afternoon, seeking His Face, and let not your eyes overlook them, desiring the pomp and glitter of the life of the world; and obey not him whose heart We have made heedless of Our Remembrance, one who follows his own lusts and whose affair (deeds) has been lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient with those who call to their Lord in the morning and evening, desiring His Face. And do not turn your eyes away from them desiring the good things of this life, nor obey he whose heart We have made neglectful of Our remembrance; so that he follows his own lust, and his affair has become excessive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And content yourself with those who pray to their Lord morning and evening, desiring His Presence. And do not turn your eyes away from them, desiring the glitter of this world. And do not obey him whose heart We have made heedless of Our remembrance—so he follows his own desires—and his priorities are confused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep yourself patient [by being] with those who call upon their Lord in the morning and the evening, seeking His countenance. And let not your eyes pass beyond them, desiring adornments of the worldly life, and do not obey one whose heart We have made heedless of Our remembrance and who follows his desire and whose affair is ever [in] neglect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:28] And restrain yourself, detain [yourself], along with those who call upon their Lord at morning and evening, desiring, through their worship, His Countenance, exalted be He, and not any of the transient things of this world — and these are the poor; and do not let your eyes overlook, turn away [from], them — these [the eyes] are being used to refer to the person [addressed] — desiring the glitter of the life of this world. And do not obey him whose heart We have made oblivious to Our remembrance, that is, [to] the Qur’ān — this was ‘Uyayna b. Hisn and his companions — and who follows his own whim, by attributing partners [to God], and whose conduct is [mere] prodigality, excess.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "315 (Restrain thyself along with those who cry unto their Lord) who worship their Lord (at morn and evening) the reference here is to Salman al-Farisi and his fellow believers, (seeking His Countenance) by worshipping Him they seek only Allah's Countenance and good pleasure; (and let not your eyes overlook them, desiring the pomp of the life of the world) the embellishment of this worldly life; (and obey not him whose heart We have made heedless of Our remembrance) of Our divine Oneness, (who followeth his own lust) by worshipping the idols (and whose case) and whose words (hath been abandoned) at a loss. This verse was revealed about 'Uyaynah Ibn Hisn al-Fazari.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَدْعُونَ رَبَّهُم بِٱلْغَدَاةِ وَٱلْعَشِيِّ } يريدُ بِهِ الصَّلاةَ المكتوبةَ وقال: قِراءةُ القُرآنِ\n\n\n\n\nوقوله تعالى: { وَلاَ تَعْدُ عَيْنَاكَ عَنْهُمْ } معناه لا تُجَاوِزنَ\n\n\n\n\nوقوله تعالى: { وَكَانَ أَمْرُهُ فُرُطاً } يعني سَرفاً وقالَ: نَدمٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd his saying, {They call on their Lord in the morning and the evening}, he wants the written prayer and said: Reading the Quran.\n\nAnd his saying, {And do not let your eye wander from them} means do not exceed them.\n\n\nAnd His affair was ever {in excess}, and He said: \"Regret is in vain.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { واصبر نفسك } أمر بالصبر مع الله وأهله وعدم الالتفات إلى غيره وهذا الصبر هو من باب الاستقامة والتمكين لا يكون إلا بالله { مع الذين يدعون ربّهم بالغداة والعشيّ } أي: دائماً هم الموحدون من الفقراء المجرّدين الذين لا يطلبون غير الله ولا حاجة لهم في الدنيا والآخرة، ولا وقوف مع الأفعال والصفات { يريدون وجهه } أي: ذاته فحسب، يدعونه ولا يحتجبون عنه بغيره وقت ظهورها غداة الفناء ووقت احتجابها بهم عند البقاء، فالصبر معهم هو الصبر مع الله، ومجاوزة العين عنهم المنهي عنها هو الالتفات إلى الغير",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفقال سبحانه مؤدباً له مقرعاً: { وَٱصْبِرْ نَفْسَكَ } أي: إن التمس قرشيُ من إبعاد الفقراء، وبالغوا في طردهم وذبّهم عن صحيتك، لا تُجبهم ولا تُنجح مطلوبهم، بل اصبر ووطّن نفسك المائلة إلى غنائهم وصفاء زيّهم ولباسهم { مَعَ } الفقراء { ٱلَّذِينَ } شأنهم أنهم { يَدْعُونَ } ويعيدون { رَبَّهُم بِٱلْغَدَاةِ وَٱلْعَشِيِّ } أي: طرفي النهار وما بينهما { يُرِيدُونَ وَجْهَهُ } ويتوجهون نحوه مخلصين بلا ميلٍ منهم إلى الهوى ومزخرفات الدنيا مع غاية فقرهم وفاقتهم { وَلاَ تَعْدُ } أي: لا تملِ ولا تُصرف { عَيْنَاكَ عَنْهُمْ } لرثاثة حالهم وخلقِ ثيابهم إلى الأغنياء وزّيهم البهيّ حال كونك { تُرِيدُ } وتقصد { زِينَةَ ٱلْحَيَاةِ ٱلدُّنْيَا } بالالتفات إليهم، والميل إلى مصاحبتهم ومجالستهم، والركون إلى جاههم وثروتهم { وَلاَ تُطِعْ } ولا تنفق معهم في طرد الفقراء بمجرد ميلك إيمانك أولئك الأغنياء البعداء عن روح الله ورحمته، ولا تلتفت التفاتَ متحننٍ متشوقٍ إلى { مَنْ أَغْفَلْنَا قَلْبَهُ } وختمنا عليه بالإعراض { عَن ذِكْرِنَا } ختماً لا يرتفع عنه أصلاً { وَ } لذا صار من العتو والعناد إلى أن { ٱتَّبَعَ هَوَاهُ } واتخذه إلهاً، واجتنب عن مولاه وبنذه وراءة { وَكَانَ أَمْرُهُ } في الاتباع والاتخاذ { فُرُطاً } [الكهف: 28] ميلاً وتقدماً نحو الباطل، وإعراضاً عن الحق ونبذاً له وراءه ظهرياً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ولا تعد }: نهي مجزوم بحذف الواو، و { عيناك }: فاعل، و { تريد }: حال من الكاف، أو من فاعل { تَعْدُ }\n يقول الحقّ جلّ جلاله: { واصبرْ نفسك } أي: احبسها { مع الذين يدعون ربهم } أي: يعبدونه { بالغداةِ والعَشِيِّ } ، قيل: الصلوات الخمس، فالغداة: الصبح، والعَشِيِّ: الظهر وما بعده، وقيل: الصبح والعصر، قلت: والأظهر أنها الصلاة التي كانوا يُصلونها قبل فرض الصلاة، وهي ركعتان بالغداة والعشي\n قال ابن عطية: ويدخل في الآية مَنْ يدعو في غير صلاة، ومن يجمع لمذاكرة علم، وقد رَوى عبد الله بن عمر عن النبي صلى الله عليه وسلم أنه قال:\n\n \" لَذِكْرُ اللهِ بالغَدَاةِ والعَشِيِّ أَفْضَلُ مِنْ حَطْمِ السُّيُوف فِي سَبيل اللهِ، ومِنْ إعْطَاءِ المَال سحا \" \n\nوقيل: { يدعون ربهم } في جميع الأوقات، وفي طرفَيْ النهار، والمراد بهم فقراء المؤمنين كعمار وصهيب وخباب وبلال، رُوي أن رؤساء الكفرة من قريش قالوا لرسول الله صلى الله عليه وسلم: لو أبعدت هؤلاء عن نفسك لجالسناك وصحبناك، وقالوا: إن ريح جِبَابِهم تؤذينا، فنزلت الآية\n رُوي أنه صلى الله عليه وسلم لما نزلت خرج إليهم وجلس بينهم، وقال:\n\n \" الحمدُ لله الذي جَعَلَ في أمتي مَنْ أُمرْتُ أنْ أصبرْ نَفْسِي معه \" \n\nوقيل: نزلت في بيان أهل الصُّفَّة، وكانوا نحو سبعمائة، فتكون الآية مدنية\n ثم وصفهم بالإخلاص، فقال: { يُريدون وجهه } أي: معرفة ذاته، لا جنة ولا نجاة من نار، { ولا تَعْدُ عيناك عنهم } أي: لا تجاوزهم بنظرك إلى غيرهم، من عداه: إذا جاوزه، وفي الوجيز: ولا تصرف بصرك عنهم إلى غيرهم من ذوي الهيئات والزينة، { تُريد زينةَ الحياةِ الدنيا } أي: تطلب مجالسة الأشراف والأغنياء وأصحاب الدنيا\n { ولا تُطِعْ } في تنحية الفقراء عن مجلسك { مَن أغفلنا قلبَه عن ذِكْرِنا } أي: جعلناه غافلاً عن الذكر وعن الاستعداد له، كأولئك الذين يدعونك إلى طرد الفقراء عن مجلسك، فإنهم غافلون عن ذكرنا، على خلاف ما عليه المؤمنون من الدعاء في مجامع الأوقات، وفيه تنبيه على أن الباعث على ذلك الدعاء غفلة قلبية عن جناب الله - سبحانه - حتى خفي عليه أن الشرف إنما هو بتحلية القلب بالفضائل، لا بتحلية الجسد بالملابس والمآكل\n { واتَّبَعَ هواه }: ما تهواه نفسه، { وكان أمره فُُرطًا }: ضياعًا وهلاكًا، وهو من التفريط والتضييع، أو من الإفراط والإسراف، فإن الغفلة عن ذكر الله - تعالى - تُؤدي إلى اتباع الهوى المؤدي إلى التجاوز والتباعد عن الحق والصواب\n والله تعالى أعلم\n الإشارة: في الآية حثٌّ على صحبة الفقراء والمُكْث معهم، وفي صحبتهم أسرار كبيرة ومواهب غزيرة، إذ بصحبتهم يَكتسبُ الفقير آداب الطريق، وبصحبتهم يقع التهذيب والتأديب، حتى يتأهل لحضرة التقريب، وبصحبتهم تدوم حياة الطريق، ويصل العبد إلى معالم التحقيق، وفي ذلك يقول الشيخ أبو مدين رضي الله عنه:\n\n\n\nإلى آخر كلامه\n وقوله تعالى: { واصبر نفسك } قال القشيري: لم يقل: واصبر قلبك لأن قلبه كان مع الحق تعالى، فأمره بصحبة الفقراء جَهْرًا بجهر، واستخلص قلبه لنفسه سِرًا بِسرٍّ\n هـ\n قال الورتجبي: اصبر نفسك مع هؤلاء الفقراء، العاشقين لجمالي، المشتاقين إلى جلالي، الذين هم في جميع الأوقات يسألون متى لقاء وجهي الكريم، ويريدون أن يطيروا بجناح المحبة إلى عالم وَصْلي، حتى يكونوا مُتسلين بصحبتك عن مقام الوصال، وفي رؤيتهم لك رؤية ذلك الجمال\n هـ\n  وقوله تعالى: { يريدون وجهه } ، بيَّن أن دعاءهم وسؤالهم إنما هو رؤيته ولقاؤه، شوقًا إليه ومحبة فيه، من غير تعلق بغيره، أو شُغل بسواه، بل همتهم الله لا غيره، وإِلاَّ لَمَا صدق قصر إرادتهم عليه\n قال في الإحياء: من يعمل اتقاء من النار خوفًا، أو رغبة في الجنة رجاء، فهو من جملة النيات الصحيحة لأنه ميل إلى الموعود في الآخرة، وإن كان نازلاً بالإضافة إلى قصد طاعة الله وتعظيمه لذاته ولجلاله، لا لأمرٍ سواه\n ثم قال: وقول رويم: الإخلاص: ألا يريد صاحبه عليه عوضًا في الدارين، هو إشارة لإخلاص الصدِّيقين، وهو الإخلاص المطلق، وغيره إخلاص بالإضافة إلى حظوظ العاجلة\n هـ\n من الحاشية\n ثمَّ أمر بالصدع بالحق\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:45",
      "similarity": 0.39880954902687976
    },
    {
      "verse": "40:46",
      "similarity": 0.38904989769564347
    },
    {
      "verse": "6:52",
      "similarity": 0.37148463267796344
    },
    {
      "verse": "39:56",
      "similarity": 0.349280257673519
    },
    {
      "verse": "6:38",
      "similarity": 0.33077107674338846
    }
  ]
}