{
  "chapter": "الكهف",
  "text": "وقل الحق من ربكم فمن شاء فليؤمن ومن شاء فليكفر انا اعتدنا للظلمين نارا احاط بهم سرادقها وان يستغيثوا۟ يغاثوا۟ بماء كالمهل يشوى الوجوه بئس الشراب وساءت مرتفقا",
  "translations": [
    {
      "translation": "Say: 'It is the truth from your Lord; so let whoever wishes have iman and whoever wishes be kafir.' We have prepared for the wrongdoers a Fire whose billowing walls of smoke will hem them in. If they call for help, they will be helped with water like seething molten brass, frying their faces. What a noxious drink! What an evil repose!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The truth is from your Lord: So believe if you like, or do not believe if you will.\" We have prepared for the sinners a fire which will envelope them in its tent. If they ask for water they will be helped to liquid like molten brass that would scald their mouths. How evil the drink, and evil the resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And proclaim: \"This is the Truth from your Lord. Now let him who will, believe; and let him who will, disbelieve. We have prepared a Fire for the wrong-doers whose billowing folds encompass them. If they ask for water, they will be served with a drink like dregs of oil that will scald their faces. How dreadful a drink, and how evil an abode!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say,\" Truth comes from your Lord. Let people have faith or disbelieve as they chose.\" For the unjust We have prepared a fire which will engulf them with its (flames). Whenever they cry for help they will be answered with water as hot as molted brass which will scald their faces. How terrible is such a drink and such a resting place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And proclaim, “The Truth is from your Lord”; so whoever wills may accept faith, and whoever wills may disbelieve – We have indeed prepared for the disbelievers a fire the walls of which will surround them; if they plead for water, their plea will be answered with water like molten metal which shall scald their faces; what an evil drink it is; and what an evil destination is hell!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"The truth is from your Lord.\" Then whosoever wills, let him believe; and whosoever wills, let him disbelieve. Verily, We have prepared for the wrongdoers, a Fire whose walls will be surrounding them. And if they ask for drink, they will be granted water like Al-Muhl, that will scald their faces. Terrible is the drink, and an evil Murtafaq!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: The truth is from your Lord, so let him who please believe, and let him who please disbelieve; surely We have prepared for the iniquitous a fire, the curtains of which shall encompass them about; and if they cry for water, they shall be given water like molten brass which will scald their faces; evil the drink and ill the resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'The truth is from your Lord; so let whosoever will believe, and let whosoever will disbelieve.' Surely We have prepared for the evildoers a fire, whose pavilion encompasses them; if they call for succour, they will be succoured with water like molten copper, that shall scald their faces -- how evil a potion, and how evil a resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: (It is) the truth from the Lord of you (all). Then whosoever will, let him believe, and whosoever will, let him disbelieve. Lo! We have prepared for disbelievers Fire. Its tent encloseth them. If they ask for showers, they will be showered with water like to molten lead which burneth the faces. Calamitous the drink and ill the resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"This is the truth from your Lord. Let him who will, believe in it, and him who will, deny it.\" For the wrongdoers We have prepared a Fire which will cover them like a canopy, and if they beg for water, they will be given water as hot as molten lead, which will scald their faces: how dreadful a drink, and how evil a resting place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say thou: the truth is from your Lord; let him therefore who will, believe, and let him who will, disbelieve. Verily We have gotten ready for the wrong-doers a Fire the awnings whereof shall encompass them; and if they cry for relief they shall be relieved with water like the dregs of oil scalding their faces. 111 the drink, and vile the resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, ‘[This is] the truth from your Lord: let anyone who wishes believe it, and let anyone who wishes disbelieve it.’ Indeed, We have prepared for the wrongdoers a Fire whose curtains will surround them [on all sides]. If they cry out for help, they will be helped with a water like molten copper, which will scald their faces. What an evil drink, and how ill a resting place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"The truth is from your Lord\": Let him who will believe, and let him who will, reject (it): for the wrong-doers We have prepared a Fire whose (smoke and flames), like the walls and roof of a tent, will hem them in: if they implore relief they will be granted water like melted brass, that will scald their faces, how dreadful the drink! How uncomfortable a couch to recline on!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say: \"The truth is from your Lord.\" Then whosoever wills, let him believe, and whosoever wills, let him disbelieve. Verily, We have prepared for the Zalimun (polytheists and wrong-doers, etc.), a Fire whose walls will be surrounding them (disbelievers in the Oneness of Allah). And if they ask for help (relief, water, etc.) they will be granted water like boiling oil, that will scald their faces. Terrible the drink, and an evil Murtafaqa (dwelling, resting place, etc.)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'This is the truth from your Lord. Let whosoever will, believe, and whosoever will, disbelieve it' For the harmdoers, We have prepared a Fire, the pavilion of which encompasses them. When they cry out for relief, they shall be showered with water as hot as molten copper, which will scald their faces; how evil a drink, and how evil a restingplace!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, “The truth is from your Lord. Whoever wills—let him believe. And whoever wills—let him disbelieve”. We have prepared for the unjust a Fire, whose curtains will hem them in. And when they cry for relief, they will be relieved with water like molten brass, which scalds the faces. What a miserable drink, and what a terrible place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say, \"The truth is from your Lord, so whoever wills - let him believe; and whoever wills - let him disbelieve.\" Indeed, We have prepared for the wrongdoers a fire whose walls will surround them. And if they call for relief, they will be relieved with water like murky oil, which scalds [their] faces. Wretched is the drink, and evil is the resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:29] And say, to him and to his companions that this Qur’ān is, ‘The truth [that comes] from your Lord; so whoever will, let him believe, and whoever will, let him disbelieve’ — this is [meant as] a threat to them. Indeed We have prepared for the wrongdoers, that is, the disbelievers, a Fire, and they will be surrounded by its pavilion, [by] that which encloses [the Fire itself]. If they cry out for help, they will be succoured with water like molten copper, like thick [burning] oil, which scalds faces, because of [the intensity of] its heat, if it is brought near them. What an evil drink, that is, and how ill, is the Fire [as], a resting-place! (murtafaqan is a specification derived from the agent of the verb, in other words, vile is the person choosing to rest thereon; and this is in contrast to what He will say next about Paradise: How fair a resting-place [below, verse 31]. For, indeed, what resting-place can there be in the Fire?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to 'Uyaynah: ((It is) the Truth) there is no deity except Allah (from the Lord of you (all). Then whosoever will, let him believe, and whosoever will, let him disbelieve) this is a threat from Allah; it is also said that this means: for whomever Allah wants faith, he will believe; and for whomever He does not want faith, he will not believe. (Lo! We have prepared for disbelievers) for 'Uyaynah and his host (Fire. Its tent encloseth them) the extent of the Fire surrounds them. (If they ask for showers) if they ask for water to drink, (they will be showered with water like molten lead) like boiling oil or hot liquid silver (which burneth the faces. Calamitous the drink and ill the resting place!) evil is their dwelling; He says: evil is the abode of their companions: the satans and the disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عْتَدْنَا [لِلظَّالِمِينَ] } معناه مِن العُدَّةِ\n\n\n\n\nوقوله تعالى: { أَحَاطَ بِهِمْ سُرَادِقُهَا } قالَ الإِمامُ زيد بن علي عليهما السَّلامُ: السُّرادِقُ: حُجرةٌ تَطيفُ بالفُسْطَاطِ\n وهي سُرادقُ مِن نَارٍ\n ويقال: لَها أَربعةُ جُدُرٍ كِثافٍ، كُلُّ جدارٍ مَسيرةُ أربعينَ سَنةً\n\n\n\n\nوقوله تعالى: { يُغَاثُواْ بِمَآءٍ كَٱلْمُهْلِ } وهو الذِي قَدْ انتهَى حَرُّهُ\n ويقال كدُرْدِي الزَيتِ سَواداً\n والمُهْلُ: كُلُّ شَيْءٍ أَذَبْتَهُ مِنْ نُحاسٍ أَو رَصاصٍ\n\n\n\n\nوقوله تعالى: { وَسَآءَتْ مُرْتَفَقاً } معناه مُتَّكأٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We have {[for the wrongdoers]}\": meaning from the [punishment].\n\n\nAnd the saying of Allah, {He has encompassed them with His knowledge}, Imam Zaid ibn Ali said: \"The Suraadiqu is a stone that revolves around the Fuṣṭaṭ.\"\n\n\nThis is a piece of firewood.\n It is said that it has four dense walls, each wall a journey of forty years.\n\n\nAnd His saying - exalted be He - {they will be refreshed with water like molten copper} - meaning that their thirst will be quenched.\n\n\nThe oil is said to be black.\n\nAnd {the} molten [metal]: every [thing] you cooled it from [the] copper or [the] lead.\n\n\nAnd His saying, {And the two who are unjustly in close association with each other} - its meaning is reclining.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّا أعتدنا للظالمين } أي: المشركين المحجوبين عن الحق لقوله:\n[لقمان\n الآية: 13] { ناراً } عظيمة { أحاط بهم سرادقها } من مراتب الأكوان كالطباع العنصرية والصور النوعية المادية المحيطة بالأشخاص الهيولانية { بماء كالمهل } من جنس الغساق والغسلين\n أي: المياه المتعفنة التي تسيل من أبدان أهل النار مسودة فيها دسومات يغاثون بها أو غسالاتهم القذرة أو من جنس الغصص والهموم المحرقة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقُلِ } على سبيل المثال الإرشاد والتبليغ بلا مراعاةٍ ومداهنةٍ { ٱلْحَقُّ } الصريحُ الصحيحُ الثابتُ ما نزل ونشأ { مِن رَّبِّكُمْ } الذي أنشأكم وأظهركم من كتم العدم وأصلح حالَكم بإرسال الرسل وإنزال الكتب\n وبلّغْ ما أوحي إليك بلا تبديلٍ وتغييرٍ\n إذ ما عليك إلا البلاغ والتبليغ { فَمَن شَآءَ } منهم الفوز والفلاح { فَلْيُؤْمِن } بالله وكتب ورسله على مقتضى ما بلغَّتَ { وَمَن شَآءَ } منهم الوبالَ والنكالَ في الداري { فَلْيَكْفُرْ } فاعلم أنه سبحانه لا يبالي بكفرهم وإيانهم\n إذ هو منزهُ عن إيمان عباده وكفرهم\n\n\nثم قال سبحانه على سبيل التهديد والتنبيه: { إِنَّا } من مقام علدنا وقهرنا من أعرض عنا من عبادنا وانصرف عن مقتضى أوامرنا ونواهينا { أَعْتَدْنَا } وهيأنا سبيما { لِلظَّالِمِينَ } الخارجين عن مقتضيات أحكامنا { نَاراً } ذاتتَ التهابٍ واشتعالٍ إلى حيث { أَحَاطَ } أي: احتوى واشتمل { بِهِمْ سُرَادِقُهَا } أي: لهبُها التي هي كالفسطاط في الإحاطة والشمول\n والفسطاطُ: المتخذُ من الشعر { وَإِن يَسْتَغِيثُواْ } من شدة العطش ونهاية حرقة الكبد والزفرة { يُغَاثُواْ } ويُجابوا { بِمَآءٍ } في اللون { كَٱلْمُهْلِ } وهو الحديدُ المذابُ\n وفي الحرارة إلى حيث { يَشْوِي ٱلْوجُوهَ } ويحرقها وقتَ تقريبه إلى الفم للشرب\n\n\nوبالجملة: { بِئْسَ ٱلشَّرَابُ } شرابُ المهل { وَسَآءَتْ } جهنم وأوديتها المملوءة بنيران الحرمان والخذلان { مُرْتَفَقاً } [الكهف: 29] منزلاً ومسكناً\n تسكنون فيها أبداً مخلداً\n\n\nثم اتبع سبحانه الوعيد بالوعد على مقتضى سنته المستمرة\n فقال: { إِنَّ ٱلَّذِينَ آمَنُواْ } بوحدة ذاتنا وكمال أوصافنا وأسمائنا\n وبإرسالنا الرسل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { الحق }: خبر، أي: هذا الذي أُوحي إليَّ الحقُّ. يقول الحقّ جلّ جلاله: { وقل }: يا محمد لأولئك الغافلين المتبعين أهواءهم، أو: لمن جاءك من الناس: هذا الذي جئتكم به من عند ربي هو { الحقُّ من ربكم } أي: من جهة ربكم، لا من جهتي، حتى يتصور فيه التبديل، أو يمكن التردد في اتباعه. { فمَن شاء فليؤمن ومَن شاء فليكفرْ } ، وهو تهديد، أي: فمن شاء أن يؤمن فليؤمن كسائر المؤمنين، ولا يتعلل بما لا يكاد يصلح للتعليل، ومن شاء أن يكفر فليفعل، وفيه مع التهديد الاستغناء عن متابعتهم، وعدم المبالاة بهم وبإيمانهم. ثم أوعدهم على الكفر، فقال: { إِنا أعْتَدْنا للظالمين } أي: هيأنا للكافرين بالحق، بعد ما جاء من الله سبحانه، والتعبير عنهم بالظالمين للتنبيه على أن اختيارهم الكفر ظلمٌ وتجاوزٌ عن الحد، ووضعٌ للشيء في غير محله، أي: هيأنا لهم { نارًا } عظيمة { أحاط بهم } أي: محيطُ بهم { سُرادِقُها } أي: سورها المحيط بها، والتعبير بالماضي لتحقق وقوعه، والسرادق: ما يحيط بالشيء، كالجدار ونحوه. قيل: هو حائط من نار، وقيل: دخانها. { وإِن يستغيثوا } من العطش { يُغَاثوا بماء كالمهل }: كَمُذَاب الحديد والرصاص في الحرارة. وقيل: كرديء الزيت في اللون، { يشوي الوجوه } إذا قُدم ليشرب بحرارته. عن النبي صلى الله عليه وسلم أنه قال:\n \" هو كَعَكِرِ الزَّيْتِ، فَإِذَا قُرّبَ مِن الكافر سَقَطَتْ فَرْوَةُ وَجْهِهِ فِيهِ، فإذَا شَرِبَهُ تقَطَّعَت أَمْعَاؤُه \" \n{ بئسَ الشرابُ } ذلك، { وساءت } النار { مُرتفقًا }: مُتَّكًا، وأصل الارتفاق: نصب المِرفق تحت الخد ليتكئ عليه، وأنى ذلك في النار، وإنما هو بمقابلة قوله في المؤمنين: { وحسنت مرتفقًا }. الإشارة: ينبغي للواعظ، أو المُذكر، أو العالم، ألا يحرص على الناس، بل يستغني بالله في أموره كلها، وإنما يُبين الحق من الباطل، ويقول: هذا الحق من ربكم، فمن شاء فليؤمن ومن يشاء فليكفر. هذا إذا كان لعامة الناس، وأما إن كان لخاصتهم كأهل الرئاسة والجاه، فاختلف فيه فقال بعضهم: يسلك هذا المنهاج يُبين الحق ولا يبالي، محتجًا بالآية، قال: نحن أمة محمدية، قال تعالى له: { وقل الحق من ربكم... } الآية، وقال بعضهم: ينبغي أن يلين لهم القول لقوله تعالى:\n[طه: 44]، وهو الأليق بطريق السياسة، فمن أعرض عن الوعظ، وبقي على ظلمه، فالآية تجر ذيلها عليه. والله تعالى أعلم. ثم ذكر ضدهم فقال: { إِنَّ ٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:16",
      "similarity": 0.34426576747107823
    },
    {
      "verse": "8:9",
      "similarity": 0.16514715183049608
    },
    {
      "verse": "46:17",
      "similarity": 0.1636567606490654
    },
    {
      "verse": "70:8",
      "similarity": 0.15883703792732845
    },
    {
      "verse": "86:17",
      "similarity": 0.1579395881827101
    }
  ]
}