{
  "chapter": "الكهف",
  "text": "ولبثوا۟ فى كهفهم ثلث ما۟ئة سنين وازدادوا۟ تسعا",
  "translations": [
    {
      "translation": "They stayed in their Cave for three hundred years and added nine.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is said) they stayed in the cave three hundred years and nine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They remained in the Cave for three hundred years; and others added nine more years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They, in fact, stayed in the cave for three hundred plus nine further years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they stayed in their Cave for three hundred years* and nine more*. (* 300 according to the Solar calendar and 309 according to the Lunar calendar.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they stayed in their cave three hundred years, adding nine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they remained in their cave three hundred years and (some) add (another) nine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they tarried in the Cave three hundred years, and to that they added nine more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (it is said) they tarried in their Cave three hundred years and add nine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Some say], \"They stayed in their cave three hundred years,\" and to that some have added another nine years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they tarried in their cave three hundred years and added nine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They remained in the Cave for three hundred years, and added nine more [to that number].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they stayed in their Cave three hundred years, and (some) add nine (more)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they stayed in their Cave three hundred (solar) years, and add nine (for lunar years).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they stayed in the Cave three hundred years and to that they added nine more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they stayed in their cave for three hundred years, adding nine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they remained in their cave for three hundred years and exceeded by nine.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:25] And they tarried in the Cave three hundred (read [with tanwīn] thalāthami’atin) years (sinīn is an explicative supplement to thalāthami’atin, ‘three hundred’): these three hundred years in the case of the People of the Cave were solar years; but for [the number of] lunar ones, the Arabs add nine years thereto, and this is mentioned in His saying: and add nine, that is, nine years; in other words three hundred solar years, while three hundred and nine lunar ones.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (it is said) they tarried in their Cave three hundred years and add nine) before Allah made them wake up.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولبثوا في كهفهم ثلثمائة سنين } من التي تبتنى على دور القمر فتكون كل سنة شهراً ومجموعها خمسة وعشرون سنة، وذلك وقت انتباههم وتيقظهم { وازْدَادُوا تِسْعاً } هي مدة الحمل\n وروعيت في الآية نكتة، هي أنه: لم يقل ثلثمائة سنة وتسعاً، أو ثلثمائة وتسع سنين، لاستعمال السنة في العرف وقت نزول الوحي في دورة شمسية لا قمرية، فأجمل العدد ثم بيّنه بقوله: سنين، فاحتمل أن يكون المميز غيرها كالشهر مثلاً، ثم بين أنّ المدة سنين مبهمة غير معينة، إذ لو قيل: ثلثمائة شهر سنين، فأبدل سنين من مجموع العدد، كانت العبارة صحيحة والمراد سنين كذا عدداً، أي: خمسة وعشرين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n اختلفوا أيضاً في مدة لبثهم في الغار راقدين نائمين قال بعضهم: { لَبِثُواْ فِي كَهْفِهِمْ ثَلاثَ مِاْئَةٍ سِنِينَ } بالسنة الشمسية على ما هو المشهور { وَ } بعضهم { ٱزْدَادُواْ } عليها { تِسْعاً } [الكهف: 25] من تلك السنة أيضاً\n وإن كان المراد بالسنة فيه الأولى شمسية والثانية قمرية\n كان كلا القولين واحداً\n لأن التفاوت بينهما في كل مائة عام سنة ثلاث سنين\n فيكون الزايدة في ثلاثمائة: تسع سنين قمرية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:11",
      "similarity": 0.49105888282321714
    },
    {
      "verse": "74:30",
      "similarity": 0.4051091584996193
    },
    {
      "verse": "37:147",
      "similarity": 0.3818996896696623
    },
    {
      "verse": "17:101",
      "similarity": 0.37042533889538254
    },
    {
      "verse": "27:48",
      "similarity": 0.28263299593545466
    }
  ]
}