{
  "chapter": "الكهف",
  "text": "وكذلك اعثرنا عليهم ليعلموا۟ ان وعد الله حق وان الساعة لا ريب فيها اذ يتنزعون بينهم امرهم فقالوا۟ ابنوا۟ عليهم بنينا ربهم اعلم بهم قال الذين غلبوا۟ على امرهم لنتخذن عليهم مسجدا",
  "translations": [
    {
      "translation": "Accordingly We made them chance upon them unexpectedly so they might know that Allah's promise is true and that there is no doubt about the Hour. When they were arguing among themselves about the matter, they said, 'Wall up their cave, their Lord knows best about them.' But those who got the better of the argument concerning them said, 'We will build a place of worship over them.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We inform the people about them that they may know the promise of God is true, and there is no doubt that the Hour will come. As they were arguing among themselves as to what should be done with them, (some) said: \"Erect a monument over them. Their Lord is best cognisant of them.\" Those who prevailed, said: \"We shall build a place of worship over their (sepulchre).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We make their case known to the people of the city so that they might know that Allah's promise is true, and that there is absolutely no doubt that the Hour will come to pass. But instead of giving thought to this, they disputed with one another concerning the People of the Cave, some saying: \"Build a wall over them. Their Lord alone knows best about them.\" But those who prevailed over their affairs said: \"We shall build a place of worship over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We caused their story to become public so that people would know that God's promise was true and that there is no doubt about the coming of the Day of Judgment. They started to argue with each other about the matter (Resurrection) and some of them said, \"Let us establish a building at the youths' sleeping place (to hide them). Their Lord knew best their intentions about them. The majority prevailed in their suggestion of the establishment of a mosque in that place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how We made them known for people to know that the promise of Allah is true and that there is no doubt concerning the Last Day; when the people began disputing among themselves regarding them, they said, “Construct a building over their cave”; their Lord well knows them; those who dominated in this matter said, “We promise we will build a mosque over them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We made their case known, that they might know that the promise of Allah is true, and that there can be no doubt about the Hour. (Remember) when they (the people) disputed among themselves about their case, they said: \"Construct a building over them; their Lord knows best about them,\" (then) those who won their point said: \"We verily, shall build a place of worship over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus did We make (men) to get knowledge of them that they might know that Allah's promise is true and that as for the hour there is no doubt about it. When they disputed among themselves about their affair and said: Erect an edifice over them-- their Lord best knows them. Those who prevailed in their affair said: We will certainly raise a masjid over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even so We made them stumble upon them, that they might know that God's promise is true, and that the Hour -- there is no doubt of it. When they were contending among themselves of their affair then they said, 'Build over them a building; their Lord knows of them very well.' Said those who prevailed over their affair, 'We will raise over them a place of worship.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in like manner We disclosed them (to the people of the city) that they might know that the promise of Allah is true, and that, as for the Hour, there is no doubt concerning it. When (the people of the city) disputed of their case among themselves, they said: Build over them a building; their Lord knoweth best concerning them. Those who won their point said: We verily shall build a place of worship over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We disclosed things to them so that they might know that God's promise was true and there was no doubt about the Hour [Judgement Day]. The people argued about them among themselves. They said, \"Build a monument over them. Their Lord knows best concerning them.\" Those who prevailed in their affair said, \"Let us surely build a place of worship over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And likewise We caused their affair to be lit upon that they might know that the promise of Allah is true, and that the Hour- there is no doubt thereof, Recall what time they were disputing among themselves regarding their affair, and then they said: build over them a building--their Lord is the Best Knower about them-then those who prevailed in their affair said: surely we will raise over them a place of worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it was that We let them come upon them, that they might know that Allah’s promise is true, and that there is no doubt in the Hour. As they disputed among themselves about their matter, they said, ‘Build a building over them. Their Lord knows them best.’ Those who had the say in their matter said, ‘We will set up a place of worship over them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We make their case known to the people, that they might know that the promise of Allah is true, and that there can be no doubt about the Hour of Judgment. Behold, they dispute among themselves as to their affair. (Some) said, \"Construct a building over them\": Their Lord knows best about them: those who prevailed over their affair said, \"Let us surely build a place of worship over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We made their case known to the people, that they might know that the Promise of Allah is true, and that there can be no doubt about the Hour. (Remember) when they (the people of the city) disputed among themselves about their case, they said: \"Construct a building over them, their Lord knows best about them,\" (then) those who won their point said (most probably the disbelievers): \"We verily shall build a place of worship over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so We made them (the unbelievers) stumble upon them, so that they might know that the promise of Allah is true and that there is no doubt about theHour. They argued among themselves over their affair, then (the unbelievers) said: 'Build a building over them (their remains). Their Lord knows best who they were. 'But those who prevailed over the matter said; 'We will build around them a Mosque'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it was, that We caused them to be discovered, that they would know that the promise of God is true, and that of the Hour there is no doubt. As they were disputing their case among themselves, they said, “Build over them a building.” Their Lord knows best about them. Those who prevailed over their case said, “We will set up over them a place of worship.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly, We caused them to be found that they [who found them] would know that the promise of Allah is truth and that of the Hour there is no doubt. [That was] when they disputed among themselves about their affair and [then] said, \"Construct over them a structure. Their Lord is most knowing about them.\" Said those who prevailed in the matter, \"We will surely take [for ourselves] over them a masjid.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:21] And so, just as We aroused them, it was that We disclosed them, [to] their people and the believers, that they, that is, their people, might know that God’s promise, of resurrection, is true: by virtue of the fact that One Who has the power to make them sleep for [such] a long period of time, or sustain them in that state without nourishment, also has the power to resurrect the dead; and that, as for the Hour, there is no doubt, no uncertainty, concerning it. Behold (idh adverbially qualifies a‘tharnā, ‘We disclosed’) they were disputing, that is, the believers and the disbelievers, among themselves their affair, the affair of the youths, with regard to building something around them [as a monument]; so they, the disbelievers, said, ‘Build over them, that is, around them, a building, to cover them up; their Lord knows them best.’ Those who prevailed   regarding their affair, the affair of the youths, namely, the believers, ‘We will verily set up over them, around them, a place of worship’, for prayers to be performed therein. And this indeed took place at the entrance of the cave.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And in like manner We disclosed them (to the people of the city)) the city of Ephesus, the believers among 314 them and the disbelievers, and their king of the time was a believer called Yustafad, the king Decius had died long before that (that they might know) both the believers and disbelievers (that the promise of Allah) resurrection after death (is true) takes place, (and that, as for the Hour, there is no doubt concerning it. When (the people of the city) disputed of their case among themselves) when their words differed among themselves, (they said) i.e. the disbelievers said: (Build over them a building) a church because they are followers of our religion; (their Lord knoweth best concerning them. Those who won their point said) those whose argument did not prevail, i.e. the believers: (We verily shall build a place of worship over them) because they are followers of our religion; their difference being about this point.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَذٰلِكَ أَعْثَرْنَا عَلَيْهِمْ } معناهُ أطلَعنا وأظهرَنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وكذلك أعثرنا عليهم } أي: مثل ذلك البعث والإنامة أطلعنا على حالهم المستعدّين القابلين لهديهم ومعرفة حقائقهم { ليعلموا } بصحبتهم وهدايتهم { أنّ وعد الله } بالبعث والجزاء { حق وأنّ الساعة لا ريب فيها إذ يتنازعون بينهم أمرهم } أي: حين يتنازع المستعدون الطالبون بينهم أمرهم في المعاد، فمنهم من يقول: إن البعث مخصوص بالأرواح المجردة دون الأجساد، ومنهم من يقول: إنه بالأرواح والأجساد معاً، فعلموا بالاطلاع عليهم ومعرفتهم أنه بالأرواح والأجساد وأن المعاد الجسماني حق، { فقالوا ابنوا عليهم بنياناً } أي: فلما توفوا قالوا ذلك كالخانقاهات والمشاهد والمزارات المبنية على الكمل، المقربين من الأنبياء والأولياء كإبراهيم ومحمد وعلى سائر الأنبياء والأولياء عليهم الصلاة والسلام\n { ربّهم أعلم بهم } من كلام أتباعهم من أممهم والمقتدين بهم، أي: هم أجلّ وأعظم شأناً من أن يعرفهم غيرهم، الموحدون الهالكون في الله، المتحققون به، فهو أعلم بهم كما قال تعالى:\n\n \" أوليائي تحت قبائي، لا يعرفهم غيري \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كما أنمناهم نوماً طويلاً شبيهاً بالموت، ورحمناهم بتقلبٍ من جانبٍ إلى جانبٍ وحفظناهم من حر الشمس وأنواع المؤذيات، وبعثناهم من نومهم بعث الموتى للحشر؛ ليزدادوا بصيرة وثقة على الله { كَذٰلِكَ أَعْثَرْنَا } وأطعلنا { عَلَيْهِمْ } وعلى من شاهد حالهم، وشهد قصتهم من المؤمنين { لِيَعْلَمُوۤاْ } ويتيقنوا { أَنَّ وَعْدَ ٱللَّهِ } القادر المقتدر بالقدرة التامة الكاملة لكل ما أراد وشاء { حَقٌّ } ثابتُ لائقُ له أن يُنجزه بلا خلفه { وَ } يتيقنوا خصوصاً { أَنَّ ٱلسَّاعَةَ } الموعودة التي وعدها الحق بألسنة جميع أنبيائه ورسله آتيهُ { لاَ رَيْبَ فِيهَا } وارتفع نزاع الناس فيها، ببعث هؤلاء بعد ثلاثمائة وتسع سنين\n\n\n\n\nاذكر يا أكمل الرسل وقت { إِذْ يَتَنَازَعُونَ بَيْنَهُمْ أَمْرَهُمْ } المتعلق بدينهم في المحشر والمعاد الجسماني؛ إذ القادر على حفظهم ورعايتهم في المدة المذكورة، وبعثِهم بعدها قادرُ على إحياء عموم الموتى من قبورهم وإعادة الروح إلى أجسامهم؛ إذ أمثال هذا سهلُ يسيرُ في جنب قدرة الله وإرادته، وبعدما بعثناهم من مراقدهم وأطلعنا الناس عليهم، فمضوا وتكلموا معهم، وحكوا ما حكوا، وأخبر القوم بمدة رقودهم، واستودعوا مع القوم ورجعوا إلى المراقد فماتوا وانقرضوا، فاختلف الناس في أمرهم، فقال المسلمون: هم منا لأنا موحدون، وقال الكافرون: بل هم منا لكونهم أولاد الكفار\n\n\n\n\nوبالجلمة: { فَقَالُواْ ٱبْنُواْ عَلَيْهِمْ بُنْيَاناً } قال المسلمون: نحن نبني عليهم مسجداً، وقال الكافكرون نحن نبني عليهم كنسيةً، وكلا الفريقين ليسوا عالمين بكفرهم وإيامنهم، بل { رَّبُّهُمْ } الذي رثاهم بأنواع التربية ورحمهم بأنواع الرحمة { أَعْلَمُ بِهِمْ } وبحالهم فأمرُهم موكولُ إلى الله مفوض إليه، ثم لما تمادى النزاع بينهم وتطاول جدالهم { قَالَ ٱلَّذِينَ غَلَبُواْ عَلَىٰ أَمْرِهِمْ } بالقدرة الحجة، وهم الموحدون المسلمون { لَنَتَّخِذَنَّ } ونبنين { عَلَيْهِمْ مَّسْجِداً } [الكهف: 21] نتوجه فيه لله، ونتبرك بهم ونجعله محل الحاجات وقضاء المناجاة، فاتخذوه وجعلوه مرجعاً يرجع إليه الأقاصي والأداني\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذ يتنازعون }: ظرف لقوله: { أعثرنا } ، لا ليعلموا، أي: أعثرنا هم عليهم حين يتنازعون بينهم\n\n\n الخ، و { رجمًا }: حال، أي: راجمين بالغيب، أو مفعول مُطلق، أي: يرجمون رجمًا\n يقول الحقّ جلّ جلاله: { وكذلك } أي: وكما أنمناهم وبعثناهم لازدياد يقينهم { أعْثَرْنا عليهم }: أطلعنا الناس عليهم { ليَعْلموا } أي: ليعلم القوم الذين كانوا في ذلك الوقت { أنَّ وعد الله } أي: وعده بالبعث والثواب والعقاب { حقٌّ } صادق لا خُلْف فيه، أو: ثابت لا مرد له لأن نومهم وانتباههم كحال من يموت ثم يُبعث، { وأنَّ الساعة } أي: القيامة، التي هي عبارة عن وقت بعث الخلائق جميعًا للحساب والجزاء، { لا ريبَ فيها }: لا شك في قيامها، فإنَّ مَنْ شاهد أنه جلّ وعلا تَوفَّى نفوسهم وأمسكها ثلاثمائة سنة وأكثر، حافظًا لأبدانها من التحلل والفساد، ثم أرسلها كما كانت، لا يبقى معه ريب، ولا يختلجه شك، في أن وعده تعالى حق، وأنه يبعث مَنْ في القبور، ويجازيهم بأعمالهم\n وكان ذلك الإعثار { إِذْ يتنازعون }: حين كانوا يتنازعون { بينهم أمْرَهُم } ، في أمر البعث مختلفين فيه ففرقة أقرّت، وفرقة جَحَدّتْ، وقائل يقول: تُبعث الأرواح فقط، وآخر يقول: تُبعث جميعُ الأجسام بالأرواح، قيل: كان ملك المدينة حينئذ رجلاً صالحًا، ملَكها ثمانيًا وعشرين سنة، ثم اختلف أهلُ مملكته في البعث كما تقدم، فدخل الملِكُ بيته وغلق الباب، ولبس مسحًا وجلس على رماد، وسأل ربه أن يظهر الحق، فألقى الله - عزّ وجلّ - في نفس رجل من ذلك البلد الذي فيه الكهف، أن يهدم بنيان فم الكهف، فهدم ما سدَّ به \" دقيانوس \" بابَ الكهفِ ليتخذه حظيرة لغنمه، فعند ذلك بعثهم الله - تعالى - فجرى بينهم من التقاول ما جرى\n رُوِيَ أنَّ المبعوث لمَّا دخل المدينة ليشتري الطعام، أخرج دراهمه، وكانت على ضرب دقيانوس، فاتهموه أنه وجد كنزاً، فذهبوا به إلى الملك، فقص عليه القصة، فقال بعضهم: إن آباءنا أخبرونا أن فتية فروا بدينهم من دقيانوس، فلعلهم هؤلاء، فانطلق الملكُ وأهلُ المدينة من مسلم وكافر، فدخلوا عليهم وكلموهم، ثم قالت الفتية للملك: نُودعك الله ونعيذك به من الإنس والجن، ثم رجعوا إلى مضاجعهم، فماتوا، فألقى المَلِكُ عليهم ثيابه، وجعل لكل منهم تابوتًا من ذهب، فرآهم في المنام كارهين للذهب، فجعلها من الساج، وبنى على باب الكهف مسجدًا\n وقيل: لما انتهوا إلى الكهف قال لهم الفتى: مكانَكَم حتى أدخل أولاً لئلا يفزعوا، فدخل، فَعُمِّي عليهم المدخل، فبنوا ثَمَّةَ مسجدًا\n وقيل: المتنازَع فيه: أمر الفتية قبل بعثهم، أي: أعثرنا عليهم حين يتذاكرون بينهم أمرهم، وما جرى بينهم وبين دقيانوس من الأحوال والأهوال، ويتلقون ذلك من الأساطير وأفواه الرجال\n\n\nوعلى التقديرين: فالفاء في قوله: { فقالوا ابنُوا } فصيحة، أي: أعثرنا عليهم فرأوا ما رأوا، ثم ماتوا، فقال بعضهم: { ابنوا عليهم }: على باب كهفهم { بُنيانًا } لئلا يتطرق إليهم الناس، ففعلوا ذلك ضنًا بمقامهم ومحافظة عليهم\n ثم قالوا: { ربهم أعلمُ بهم } ، كأنهم لما عجزوا عن إدراك حقيقة حالهم من حيث النسبة، ومن حيث العدد، ومن حيث بُعد اللبث في الكهف، قالوا ذلك تفويضًا إلى علام الغيوب\n أو: يكون من كلامه سبحانه ردًا لقول الخائضين في حديثهم من أولئك المتنازعين، { قال الذين غلبوا على أمرهم } ، وهو الملك والمسلمون، وكانوا غالبين في ذلك الوقت: { لنَتَّخِذَنَّ عليهم مسجدًا } ، فذكر في القصة أنه جعل على باب الكهف مسجدًا يصلي فيه\n ثم وقع الخوض في عهد نبينا - عليه الصلاة والسلام - بين نصارى نجران حين قدموا المدينة، فجرى بينهم ذكر أهل الكهف وبين المسلمين في عددهم، كما قال تعالى: { سيقولون ثلاثةٌ رابعُهُم كلبهم } ، وهو قول اليعقوبية من النصارى، وكبيرهم السيد، وقيل: قالته اليهود، { ويقولون خمسة سادِسُهم كلبهُم } ، هو قول النسطورية منهم، وكبيرهم العاقب، { رجمًا بالغيب }: رميًا بالخبر من غير اطلاع على حقيقة الأمر، أو ظنًا بالغيب من غير تحقيق، { ويقولون سبعة وثامنهمْ كلبهم } ، وهو ما يقوله المسلمون بطريق التلقي من هذا الوحي، وعدم نظمه في سلك الرجم بالغيب، وتغيير سبكه بزيادة الواو المفيدة لزيادةِ تأكيد النسبة فيما بين طرفيها، يَقضي بصحته\n  قال تعالى: { قل } يا محمد تحقيقًا للحق، وردًا على الأولين: { ربي أعلم بعدَّتهم } أي: ربي أقوى علمًا بعدتهم، { ما يعلمهم } أي: ما يعلم عددهم { إِلا قليلٌ } من الناس، قد وفقهم الله تعالى للاطلاع عليهم بالدلائل أو بالإلهام\n قال ابن عباس رضي الله عنه: \" أنا من ذلك القليل \" ، قال: حين وقعت الواو انقطعت العدة، وأيضًا حين سكت عنه تعالى ولم يقل: رجمًا بالغيب، علم أنه حق\n وعن علي - كرم الله وجهه -: أنهم سبعة، أسماؤهم: يمليخا، وهو الذي ذهب بورقهم، ومكسيلمينيا، وهو أكبرهم والمتكلم عنهم، ومشلينا، وفي رواية الطبري: ومجْسَيْسِيا بدله، وهؤلاء أصحاب يمين الملك، وكان عن يساره: مرنوش ودبرنوش وجشاذنوس، وكان يستشير هؤلاء الستة في أمره، و السابع: الراعي الذي تبعهم حين هربوا من دقيانوس، واسمه: كفشططيوش\n وذكر ابن عطية عن الطبري غير هؤلاء، وكلهم عجميون، قال: والسندُ في معرفتهم واهٍ\n والله تعالى أعلم\n الإشارة: عادة الحق تعالى في أوليائه أن يُخْفِيهم أولاً عن أعين الناس، رحمةً بهم إذ لو أظهرهم في البدايات لفتنوهم وردوهم إلى ما كانوا عليه، حتى إذا تخلصوا من البقايا، وتمكنوا من معرفة الحق وشهوده، أعثر عليهم من أراد سعادته ووصوله إلى حضرته ليعلموا أن وعد الله بإبقاء العدد الذين يحفظ الله بهم نظام العالم في كل زمان حق، وأنّ خراب العالم بانقراضهم، وقيام الساعة لا ريب فيه\n وفي الآية تنبيه على ذم الخوض بما لا علم للعبد به، ومدح من رد العلم إلى الله في كل شيء\n والله تعالى أعلم\n ثمَّ نهى نبنه عن المجادلة بعد وضوح الحق\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:107",
      "similarity": 0.7808497085181731
    },
    {
      "verse": "45:32",
      "similarity": 0.15436647907439693
    },
    {
      "verse": "20:62",
      "similarity": 0.14466366383942694
    },
    {
      "verse": "4:59",
      "similarity": 0.14199806413066796
    },
    {
      "verse": "7:27",
      "similarity": 0.1393857669896639
    }
  ]
}