{
  "chapter": "الكهف",
  "text": "الا ان يشاء الله واذكر ربك اذا نسيت وقل عسى ان يهدين ربى لاقرب من هذا رشدا",
  "translations": [
    {
      "translation": "Without adding 'If Allah wills.' Remember your Lord when you forget, and say, 'Hopefully my Lord will guide me to something closer to right guidance than this.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without (adding), \"if God may please;\" and think of your Lord in ease you forget, and say: \"Perhaps my Lord will show me a nearer way to rectitude.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "unless Allah should will it. And should you forget (and make such a statement), remember your Lord and say: \"I expect my Lord to guide me to what is nearer to rectitude than this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "without adding, \"if God wills.\" Recall your Lord if you forget to do something. Say, \"I hope that my Lord will provide me better guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except “If Allah wills”; and remember your Lord when you forget, and say, “It is likely that my Lord will guide me to a more accurate way of virtue than this.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except (with the saying), \"If Allah wills!\" And remember your Lord when you forget and say: \"It may be that my Lord guides me to a nearer way of truth than this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless Allah pleases; and remember your Lord when you forget and say: Maybe my Lord will guide me to a nearer course to the right than this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but only, 'If God will'; and mention thy Lord, when thou forgettest, and say, 'It may be that my Lord will guide me unto something nearer to rectitude than this.')\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except if Allah will. And remember thy Lord when thou forgettest, and say: It may be that my Lord guideth me unto a nearer way of truth than this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "without [adding], \"if God so wills.\" Remember your Lord whenever you might forget and say, \"I trust my Lord will guide me to that which is even nearer to the right path than this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except with this reservation that Allah so will. And remember thy Lord when thou forgettest; and say thou belike my Lord will guide me to something nearer than this to right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "without [adding], ‘God willing.’ And when you forget, remember your Lord, and say, ‘Maybe my Lord will guide me to [something] more akin to rectitude than this.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without adding, \"So please Allah!\" and call thy Lord to mind when thou forgettest, and say, \"I hope that my Lord will guide me ever closer (even) than this to the right road.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except (with the saying), \"If Allah will!\" And remember your Lord when you forget and say: \"It may be that my Lord guides me unto a nearer way of truth than this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "unless (you add) 'if Allah wills' And remember your Lord when you forget and say: 'It may be that my Lord will guide me to something nearer to rectitude than this'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without saying, “If God wills.” And remember your Lord if you forget, and say, “Perhaps my Lord will guide me to nearer than this in integrity.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except [when adding], \"If Allah wills.\" And remember your Lord when you forget [it] and say, \"Perhaps my Lord will guide me to what is nearer than this to right conduct.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:24] without [adding], ‘If God will’, in other words, unless [firmly] adhering to the will of God, exalted be He, by saying, ‘If God will’ (inshā’a’Llāh). And remember your Lord, that is, [remember] His will, making [things] conditional on it, if you forget, to make [things] conditional on it: mentioning it after forgetting [it] is the equal [in validity] to mentioning it at the time of the statement — as al-Hasan [al-Basrī] and others have said — as long as the person is still in the [same] place [in which he made the statement]. And say, ‘May be my Lord will guide me to [something] closer [in time] than this, [closer] than the story of the People of the Cave, as an indication of [the truth of] my prophethood, by way of guidance, and God indeed did so.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Except if Allah will) unless you second it by saying: if Allah will. (And remember thy Lord) without exception (when thou forgettest) even if it is after a while, (and say: It may be that my Lord guideth me) and lead me (unto a nearer way of truth than this) a more correct and certain way than this. This verse was revealed about the Prophet (pbuh) for he said to the idolaters of Mecca when they asked him about the spirit: \"tomorrow, I will answer you\", and he forgot to say \"if Allah wills\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱذْكُر رَّبَّكَ إِذَا نَسِيتَ } معناه عَصيتَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd remember your Lord when you forget Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فتكون فاعلاً به وبمشيئته { واذْكر ربّك } بالرجوع إليه والحضور { إذا نسيت } بالغفلة عند ظهور النفس والتلوين بظهور صفاتها { وقل عسى أن يهدين ربي لأقرب من هذا } أي: من الذكر عند التلوين وإسناد الفعل إلى صفاته بالتمكين والشهود الذاتي المخلص عن حجب الصفات { رشداً } استقامة\n وهو التمكين في الشهود الذاتي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ أَن يَشَآءَ ٱللَّهُ } أي: إلا أن تذكرَ وتجيءَ بالاستثناء بعد عزمك بقولك\n إن شاء الله\n { وَٱذْكُر رَّبَّكَ } يا أكمل الرسل { إِذَا نَسِيتَ } ذكر الاستثناء والتعليق على مشيئة الله في خلال الأمور حين القصد والعزيمة والقول بالإصدار\n بعدما تذكرتَ نسيانَك تلافياً لما فُوّتَ وتداركاً لما تركتَ\n ولو بعد حينٍ بل سنةٍ\n وقل: إن شاء الله متذكراً الأمر الذي تركت التعليق فيه قضاءً لِما فات\n\n\n{ وَقُلْ } بعدما كشفنا عليك جواب سؤالهم هذا شكراً له\n وابتهاجاً عليه\n وطلباً للمزيد منه سبحانه: { عَسَىٰ أَن يَهْدِيَنِ رَبِّي } وأرجوا من فضله وجوده أن يرشدني ويدلني { لأَقْرَبَ مِنْ هَـٰذَا رَشَداً } [الكهف: 24] أي: لأمرٍ هو أقربُ دلالةٍ من أمر أصحاب الكهف وقصتهم إلى الهداية والرشاد\n وأوضحُ إيصالاً إلى مسلك الصواب والسداد\n تأديباً لنبوتي وتشييداً لرسالتي\n وهو قد هداه وأرشده بأعظمَ من ذلك: كالإخبار عن بعض الغيوب\n وقصص الأنبياء المتباعد عهدهم وزمانهم\n وأمارات الساعة وأشراطها\n وإنزال القرآن المشتمل على الرطب واليابس الحادثة في العالمين\n الجارية في النشأتين\n\n{ وَ } ما اختلف أهل الكتاب في عدد الفتية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إلا أن يشاء }: استثناء مفرغ من النهي\n أي: لا تقولن في حال من الأحوال\n إلا حال ملابسةٍ بمشيئته تعالى على الوجه المعتاد\n وهو أن تقول: إن شاء الله\n أو: في وقت من الأوقات\n إلا وقت إن شاء الله\n يقول الحقّ جلّ جلاله: { فلا تُمَارِ } أي: لا تجادل { فيهم } في شأن أهل الكهف { إِلا مِراءً ظاهرًا } قدر ما تعرض له الوحي من وصفهم\n من غير زيادة عليه\n مع تفويض العلم إلى الله\n فلا تُصرح بجهلهم\n ولا تفضح خطأهم\n فإنه يُخل بمكارم الأخلاق\n { ولا تَسْتَفْتِ فيهم }: في شأنهم { منهم } من الخائضين { أحدًا } فإن فيما أوحي إليك لمندوحة عن ذلك\n مع أنهم لا علم لهم بذلك\n { ولا تقولنّ لشيء } أي: لأجل شيء تعزم عليه: { إِني فاعلٌ ذلك } الشيء { غدًا }: فيما يستقبل من الزمان مطلقًا\n فيصدق بالغد وما بعده لأنه نزل حين قالت اليهود لقريش: سلوه عن الروح\n وعن أصحاب الكهف\n وعن ذي القرنين\n فسألوه صلى الله عليه وسلم فقال:\n \" غدًا أخبركم \" \n\n ولم يستثن\n فأبطأ عليه الوحي\n حتى شقَّ عليه\n وكذبته قريشٌ\n ثم نزلت السورة بعد أربعة عشر يومًا\n أو قريبًا منها\n على ما ذكره أهل السِّيَر\n أي: لا تَقُلْ إني فاعل شيئًا في حال من الأحوال إلا متلبسًا بمشيئته على الوجه المعتاد\n وهو أن تقول: إن شاء الله\n أو في وقت من الأوقات\n إن شاء الله أن تقوله\n بمعنى: أن يأذن لك فيه\n فإن النسيان بمشيئته تعالى\n { واذكر ربكَ } بقولك: إلا أن يشاء الله مستدركًا له\n { إِذا نسيتَ }: إذا فرط منك نسيان ثم ذكرته\n وعن عبد الله بن عباس رضي الله عنه: ولو بعد سنة ما لم يحنث\n ولذلك جوَّز تأخير الاستثناء\n وعامة الفقهاء على خلافه\n إذ لو صح ذلك لما تقرر طلاق ولا عتاق\n ولم يعلم صدق ولا كذب\n وقال القرطبي: هذا في تدارك الترك والتخلص من الإثم\n وأما الاستثناء المغير للحكم فلا يكون إلا متصلاً به\n ويجوز أن يكون المعنى: واذكر ربك بالتسبيح والاستغفار إذا نسيت الاستثناء مبالغة في الحث عليه\n أو: اذكر ربك إذا اعتراك نسيان لتستدرك ما فات\n وحُمل على أداء الصلاة المنسية عند ذكرها\n وسيأتي في الإشارة بقية الكلام عليها\n  { وقل عسى أن يَهْديَنِ ربي }: يوفقني { لأقربَ من هذا } أي: لنبأ أقرب وأظهر من نبأ أصحاب الكهف\n من الآيات والدلائل الدالة على نبوتي\n { رَشَدًا } أي: إرشادًا للناس ودلالة على ذلك\n وقد فعل عزّ وجلّ ذلك حيث آتاه من البينات ما هو أعظم وأبين لقصص الأنبياء\n المتباعدة أيامهم\n والإخبار بالغيوب والحوادث النازلة في الأعمار المستقبلة إلى قيام الساعة\n\nأو: لأقرب رشدًا وأدنى خيرًا من المَنْسِي\n أي: عسى أن يدلني على ما هو أصلح لي من الذي نسيته إذ يجوز أن يكون نسيانه خيرًا له من ذكره إذ فيه إظهار قهريته تعالى\n وغناه عن خلقه\n وعدم مبالاته بإدبار من أدبر وإقبال من أقبل\n أو: الطريق الأقرب من هذا الذي هدى إليه أهل الكهف رشدًا وصوابًا\n وقد فعل ذلك حيث هداه إلى الدين القيِّم الذي أظهره على الأديان كلها\n ولو كره المشركون\n { ولَبِثُوا في كهفهم } أحياءً\n مضروبًا على آذانهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:38",
      "similarity": 0.510178482734444
    },
    {
      "verse": "2:186",
      "similarity": 0.4927307634222814
    },
    {
      "verse": "72:21",
      "similarity": 0.48419356695982474
    },
    {
      "verse": "72:2",
      "similarity": 0.4829290539852695
    },
    {
      "verse": "18:66",
      "similarity": 0.47833753325707684
    }
  ]
}