{
  "chapter": "الكهف",
  "text": "انهم ان يظهروا۟ عليكم يرجموكم او يعيدوكم فى ملتهم ولن تفلحوا۟ اذا ابدا",
  "translations": [
    {
      "translation": "for if they find out about you they will stone you or make you revert to their religion and then you will never have success.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they come to know of you they will stone you to death, or force you to go back to their creed; then you will never succeed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For if they should come upon us, they will stone us to death or force us to revert to their faith whereafter we shall never prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they would certainly stone us to death or force us to follow their religion. Then we shall never be able to have everlasting happiness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Indeed if they come to know about you, they will stone you or turn you back to their religion – and if so, you will never prosper.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For, if they come to know of you, they will stone you or turn you back to their religion; and in that case you will never be successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For surely if they prevail against you they would stone you to death or force you back to their religion, and then you will never succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they should get knowledge of you they will stone you, or restore you to their creed, then you will not prosper ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For they, if they should come to know of you, will stone you or turn you back to their religion; then ye will never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for if they find you out, they will stone you to death, or force you back into their faith. In that case you would never prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily they, if they come to know of you, would stone you or make you revert to their faith, and lo! then ye will never fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed should they prevail over you, they will [either] stone you [to death], or force you back into their creed, and then you will never be saved. ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For if they should come upon you, they would stone you or force you to return to their cult, and in that case ye would never attain prosperity.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For if they come to know of you, they will stone you (to death or abuse and harm you) or turn you back to their religion, and in that case you will never be successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For, if they appear in front of you, they will stone you to death or restore you to their religion. Then you will never prosper'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“If they discover you, they will stone you, or force you back into their religion; then you will never be saved.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, if they come to know of you, they will stone you or return you to their religion. And never would you succeed, then - ever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:20] For indeed if they should come to know of you, they will [either] stone you, kill you by stoning, or make you return to their creed, and then, if you do return to their creed, you will never prosper’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For they, if they) the Magians (should come to know of you, will stone you) kill you (or turn you back to their religion) Zoroastrianism; (then ye will never prosper) you will never escape from Allah's punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنهم إن يظهروا } أي: يغلبوا { عليكم يرجموكم } بحجارة الأهواء والدواعي من الغضب والشهوة وطلب اللذة فيقتلوكم بمنعكم عن كمالكم { أو يعيدوكم في ملّتهم } باستيلاء الوهم وغلبة الشيطان والإمالة إلى الهوى وعبادة الأوثان وعلى التأويل الأول ظهور العوام، واستيلاء المقلدة والحشوية المحجوبين، وأهل الباطل المطبوعين، ورجمهم أهل الحق، ودعوتهم إياهم إلى ملّتهم ظاهر كما كان في زمان رسول الله صلى الله عليه وسلم\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّهُمْ } بعد اطلاعهم وشعورهم بحالكم { إِن يَظْهَرُواْ } ويغلبوا { عَلَيْكُمْ يَرْجُمُوكُمْ } أو يقتلوكم بضرب الأحجار { أَوْ يُعِيدُوكُمْ } ويرجعوكم مرتدين { فِي مِلَّتِهِمْ } التي كنتم عليها قبل انكاشفكم بالتوحيد { وَلَن تُفْلِحُوۤاْ } أو تفوزوا بالفلاح والصلاح { إِذاً } أي: حين عودكم وارتدادكم إليها { أَبَداً } [الكهف: 20] أي: لا يرجى فلا حكم بعد ذلك أصلاً\n\n\n\n\nثم لما أرسلوا واحداً منهم إلى البلدة فدخل على السوق، ودار حوق الطباخين واختار طبيخةً زكيةً، وأخرج الدرهم؛ ليشتري الطعام، وكان عليه اسم دقيانوس، فاتهموه بأنه وجد كنزاً، فذهبوا به إلى الملك، وكان الملك نصرانياً موحّداً، فقصّ عليه القصة عن آخرها، فقال بعض الحضّار: إن آباءنا قد أخبرونا أن فتيةً فروا بدينهم من دقيانوس فلعلهم هؤلاء، فانطلق الملك وجميع أهل المدينة مؤمنهم وكفارهم، فأبصروهم وتكلموا معهم، ثم قال الفتية نستودعك الله، ونعيذك من شر الجن والإنس، ثم رجعوا إلى مضاجعهم فماتوا، فدفنهم الملك، وبنى عليهم مسجداً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم علل النهي بقوله: { إِنهم إِن يَظْهَرُوا عليكم }: يطلعوا عليكم، أو يظفروا بكم، والضمير: للأهل المقدر في \" أيها \" ، أي: إنَّ أهل المدينة إن يظفروا بكم { يَرجُموكم } إن ثبتم على ما أنتم عليه، { أو يُعيدوكم في مِلَّتهمْ } أي: يصيروكم إليها ويدخلوكم فيها كرهًا، كقوله تعالى:\n\n[إبراهيم: 13]، وقيل: كانوا على ملتهم ثم خالفوهم للحق\n { ولن تُفلحوا إِذًا } إن دخلتم فيها، ولو بالكره والجبر، { أبدًا } ، لا في الدنيا ولا في الآخرة، وفيه من التشديد والتحذير ما لا يخفى\n الإشارة: وكذلك بعثنا مَنْ توجه إلينا من نوم الغفلة والجهالة ليتساءلوا بينهم ليتعرفوا ما أنعم الله به عليهم من اليقظة والنجاة من البطالة، فإذا انتبهوا من نوم الغفلة، استصغروا أيام البطالة لأن أيام الغفلة قليلة أمدادها، وإن كثرت آمادها، وفي الحِكَم: \" رب عمر اتسعت آماده، وقَلَّْتْ أمداده \" ، بخلاف زمان اليقظة، فإنه كثيرة أمداده، وإن قلّتْ آماده، فهو طويل معنىً، وإن قلَّ حسًا، ولذلك قال في الحِكَم أيضًا: \" ورب عمر قليلةٌ آماده، كثيرةٌ أمداده \"\n\n\nوقال أيضًا: \" من بورك له في عمره: أدرك في يسيرٍ من الزمان مِنْ مِنَن الله تعالى ما لا يدخل تحت دوائر العبارة ولا تلحقه الإشارة \"\n فإن توقفوا على قوت أشباحهم التمسوا أطيبه وأزكاه وأحله، فإنَّ أكل الحلال يُنور القلوب وينشط الأعضاء للطاعة، وتلطفوا في أخذه من غير مزاحمة ولا حرص ولا تعب، فإنْ أطلعهم الله على سره المكنون من أسرار ذاته بالغوا في إخفائه، حتى لا يُشْعروا به أحدًا من خلقه، غير من هو أهلٌ له لأنهم، إن أظهروه لغيرهم، رجموهم أو أعادوهم إلى ملتهم، بأن يقهروهم إلى الرجوع عن طريق القوم، ولن يفلحوا إذًا أبدًا\n وبالله التوفيق\n ثمَّ ذكر اطلاع قوم أهل الكهف عليهم\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:34",
      "similarity": 0.43766982839683877
    },
    {
      "verse": "38:77",
      "similarity": 0.43766982839683877
    },
    {
      "verse": "14:13",
      "similarity": 0.43582270571223275
    },
    {
      "verse": "81:25",
      "similarity": 0.42759077394347694
    },
    {
      "verse": "15:17",
      "similarity": 0.3976604362170244
    }
  ]
}