{
  "chapter": "الكهف",
  "text": "او۟لئك لهم جنت عدن تجرى من تحتهم الانهر يحلون فيها من اساور من ذهب ويلبسون ثيابا خضرا من سندس واستبرق متكـين فيها على الارائك نعم الثواب وحسنت مرتفقا",
  "translations": [
    {
      "translation": "They will have Gardens of Eden with rivers flowing under them. They will be adorned in them with bracelets made of gold and wear green garments made of the finest silk and rich brocade, reclining there on couches under canopies. What an excellent reward! What a wonderful repose!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be gardens of Eden for them, with rivers flowing by, where they will be decked in bracelets of gold, with silken robes of green and of brocades to wear, reclining on couches. How excellent the guerdon, and excellent the resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall dwell in the Gardens of Eternity, beneath which streams flow. There they will be adorned with bracelets of gold, will be arrayed in green garments of silk and rich brocade, and will recline on raised couches. How excellent is their reward, and how nice their resting-place!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be admitted to the gardens of Eden wherein streams flow. They will rest on soft couches, decked with bracelets of gold and clothed in green silk garments and shining brocade. How blissful is such a reward and resting place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them are everlasting Gardens of Eden, beneath which rivers flow – in it they will be given bracelets of gold to adorn, and shall wear green clothes made of fine silk and gold embroidery, reclining upon thrones in it; what an excellent reward; and what an excellent abode is Paradise!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These! For them will be Jannatu `Adn; wherein rivers flow beneath them; therein they will be adorned with bracelets of gold, and they will wear green garments of Sundus and Istabraq. They will be Muttaki'in therein on Ara'ik. How good is the reward, and what an excellent Murtafaq!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These it is for whom are gardens of perpetuity beneath which rivers flow, ornaments shall be given to them therein of bracelets of gold, and they shall wear green robes of fine silk and thick silk brocade interwoven with gold, reclining therein on raised couches; excellent the recompense and goodly the resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those -- theirs shall be Gardens of Eden, underneath which rivers flow; therein they shall be adorned with bracelets of gold, and they shall be robed in green garments of silk and brocade, therein reclining upon couches -- O, how excellent a reward! And O, how fair a resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for such, theirs will be Gardens of Eden, wherein rivers flow beneath them; therein they will be given armlets of gold and will wear green robes of finest silk and gold embroidery, reclining upon throne therein. Blest the reward, and fair the resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they shall dwell in the Gardens of eternity where rivers flow at their feet. Reclining upon raised couches, they will be adorned with bracelets of gold, and will wear green robes of fine silk and heavy brocade. An excellent reward and an excellent resting place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These! for them are Gardens Everlasting whereunder rivers flow; bedecked they shall be therein with bracelets of gold, and wear they shall green robes of satin and brocade, reclining therein on the couches; excellent the reward, and goodly the resting-place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For such there will be the gardens of Eden with streams running in them. They will be adorned therein with bracelets of gold and wear green garments of silk and brocade, reclining therein on couches. How excellent a reward, and how good a resting place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them will be Gardens of Eternity; beneath them rivers will flow; they will be adorned therein with bracelets of gold, and they will wear green garments of fine silk and heavy brocade: They will recline therein on raised thrones. How good the recompense! How beautiful a couch to recline on!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These! For them will be 'Adn (Eden) Paradise (everlasting Gardens); wherein rivers flow underneath them, therein they will be adorned with bracelets of gold, and they will wear green garments of fine and thick silk. They will recline therein on raised thrones. How good is the reward, and what an excellent Murtafaqa (dwelling, resting place, etc.)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those, they shall live in the Gardens of Eden, underneath which rivers flow. They shall be adorned with bracelets of gold and arrayed in green garments of silk, and brocade, reclining therein on couches; how excellent is their reward and how fine is their resting place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will have the Gardens of Eden, beneath which rivers flow. Reclining on comfortable furnishings, they will be adorned with bracelets of gold, and will wear green garments of silk and brocade. What a wonderful reward, and what an excellent resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those will have gardens of perpetual residence; beneath them rivers will flow. They will be adorned therein with bracelets of gold and will wear green garments of fine silk and brocade, reclining therein on adorned couches. Excellent is the reward, and good is the resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:31] Those, for them there shall be Gardens of Eden, as a [place of] residence, underneath which rivers flow; therein they shall be adorned with bracelets of gold (min asāwir: it is said that min here is either extra or partitive; it [asāwir] is the plural of aswira — similar [in pattern] to ahmira [for himār] — which is the plural of siwār) and they shall wear green garments of fine silk (sundus) and [heavy] silk brocade (istabraq is that [silk] which is coarse: [God says] in the verse of [sūrat] al-Rahmān [Q. 55:54], lined with [heavy] silk brocade); reclining therein on couches (arā’ik is the plural of arīka, which is a bed inside a [curtained] canopy, and is also a tent adorned with garments and curtains for a bride). How excellent a reward, a requital, is Paradise, and how fair a resting-place!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for such, theirs will be Gardens of Eden) the compartment of the All-Merciful, (wherein rivers) rivers of wine, water, honey and milk (flow beneath them) i.e. beneath their trees and habitations; (therein) in Paradise (they will be given armlets of gold and will wear green robes of finest silk and gold embroidery, reclining upon) sitting in Paradise on (thrones therein) on canopies. (Blest the reward) in Paradise, (and fair the resting place!) He says: fair is the abode: the abode of their companions: the prophets and righteous.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مُّتَّكِئِينَ فِيهَا عَلَى ٱلأَرَآئِكِ } قالَ الإِمامُ زيد بن علي عليهما السَّلامُ: هي السُّررُ فِي الحِجَالِ\n واحدُها أريكَةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {those reclining on it will recline on it} Imam Zayd bin Ali said: This is the couch in Paradise.\n\n\nOne of them is a reed flute.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n إذ به يستحق ارتفاع الدرجة والرتبة { جنات عدن } من الجنان الثلاث { يحلون فيها من أساور من ذهب } أي: يزينون فيها بأنواع الحليّ هي من حقائق التوحيد الذاتي ومعاني التجليات العينية الأحدية\n إذ الذهبيات من الحليّ هي العينيات والفضيات هي الصفاتيات النورانيات كقوله:\n[الإنسان\n الآية: 21]\n { ويلبسون ثياباً خضراً } يتّصفون بصفات بهيجة\n حسنة\n نضرة\n موجبة للسرور { من سندس } الأحوال والمواهب لكونها ألطف { وإسْتَبْرق } الأخلاق والمكاسب لكونها أكثف { متكئين فيها على } أرائك الأسماء الإلهية التي هي مبادئ أفعاله لاتصافهم بأوصافه وكون الصفة مع الذات هي الاسم المستند هو عليه في جنة الصفات والأفعال { نِعم الثواب وحسنت مرتفقاً } في مقابلة:",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلَـٰئِكَ } السعداء المحسنون المخلصون { لَهُمْ } في النشأة الأخرى { جَنَّاتُ عَدْنٍ } أي: متنزهاتُ إقامةٍ وخلودٍ من مراتب العلم والعين والحق\n ومع ذلك { تَجْرِي مِن تَحْتِهِمُ ٱلأَنْهَارُ } أي: أنهار المعارف والحقائق\n متجددةً بتجددات التجليات الإلهية والنّفَسات الرحمانية المترشحة من رشاشات بحر الذات الأزلية الأبدية\n ومع ذلك { يُحَلَّوْنَ } ويزينون { فِيهَا مِنْ أَسَاوِرَ } وخلاخل متخذةٍ { مِن ذَهَبٍ } جزاء ما هذَّبوا أخلاقهم وجوارحه بمقتضى الأوامر الإلهية في النشأة الأولى { وَيَلْبَسُونَ } فيها { ثِيَاباً خُضْراً } مصنوعةً { مِّن سُنْدُسٍ } وهو ما رقَّ من الديباج { وَإِسْتَبْرَقٍ } هو ما غلظ منه جزاء ما يتصفون في النشأة الأولى بزي التقوى ولباس الصلاح\n\n\nومن كمال تنعمهم وترفههم يكونون { مُّتَّكِئِينَ فِيهَا عَلَى ٱلأَرَآئِكِ } والسررِ\n متمكنين عليها جزاء ما حملوا من المتاعب والمشاق في مواظبة الطاعات وملازمة العبادات\n وبالجملة: { نِعْمَ ٱلثَّوَابُ } والجزاء جزاءُ أهل الجنة وثوابهم { وَحَسُنَتْ } المتنزهات الثلاثة { مُرْتَفَقاً } [الكهف: 31] يرتفقون وينتفعون فيها أهل الكشف والشهود\n بما لا عينُ رأت ولا أذنُ سمعت ولا خطرَ على قلب بشر\n\n\nثم أمر سبحانه حبيبه صلى الله عليه وسلم بضرب المثل لتوضيح حال المؤمن والكافر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أولئك }: استئناف لبيان الأجر\n أو: خبر \" إن \" \n وما بينهما اعتراض\n أو خبر بعد خبر\n و { من أساور }: ابتدائية\n و { من ذهب }: بيانية\n و { أساور }: جمع أسورة\n أو أسوار جمع سوار\n فهو جمع الجمع\n يقول الحقّ جلّ جلاله: { إِن الذين آمنوا } أي: اختاروا الإيمان\n من قوله: { فمن شاء فليؤمن } \n وكأنه في المعنى عطف على قوله: { أعتدنا للظالمين } \n أي: والذين آمنوا هيأنا لهم كذا وكذا\n ولعل تغيير سبكه: للإيذان بكمال تنافي مآلَيْ الفريقين\n أي: إن الذين آمنوا بالحق الذي أُوحي إليك { وعَمِلُوا } الأعمال { الصالحات } \n حسبما بيَّن فيما أوحي إليك\n { إِنا لا نُضِيعُ أجرَ من أحسن عملاً } \n وأتقنه على ما تقتضيه الشريعة\n { أولئك } المنعوتون بهذه النعوت الجليلة { لهم جناتُ عدن تجري } من تحت قصورهم { الأنهار } من ماء ولبن وخمر وعسل\n { يُحلَّون فيها من أساورَ من ذهب }  أي: كل واحد يُحلَّى بسوارين من ذهب\n وكانت الأساور عند العرب من زينة الملوك\n { ويَلْبَسُون ثيابًا خُضْرًا } \n وخصت الخضرة بثيابهم لأنها أحسن الألوان وأكثرها طراوة\n وتلك الثياب { من سُنْدُسٍ وإِستبرقٍ } \n السندس: ما رقَّ من الديباج\n والإستبرق: ما غلظ منه\n جمع النوعين للدلالة على أن فيها ما تشتهي الأنفس وتلذ الأعين\n { متكئين فيها على الأرائك } جمع أريكة\n وهو السرير في الحجَال\n أي: متكئين على الأسرة المُزينة بالستور الرفيعة\n كحال العرائس المتنعمين\n { نِعْمَ الثوابُ } ذلك\n { وحَسُنَتْ مُرتفقًا }: متَّكأ\n والآية عامة وإن نزلت في خصوص الصحابة رضي الله عنهم\n وأماتنا على منهاجهم\n آمين\n الإشارة: إن الذين آمنوا إيمان الخصوص\n وعملوا الأعمال التي تقرب إلى حضرة القدوس وهي تحملُ ما يثقل على النفوس\n أولئك لهم جنات المعارف\n تجري من تحت قلوبهم أنهار العلوم والمواهب\n يُحلَّون فيها بمقامات اليقين\n ويلبسون ثياب العز والنصر والتمكين\n متكئين على سرر الهنا والسرور\n قد انقضت عنهم أيام المحن والشرور\n جعلنا الله فيهم بمنّه وكرمه\n ثمَّ ضرب مثلاً لمن اغتر بدنياه ولمن زهد فيها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "76:21",
      "similarity": 0.6602208100435659
    },
    {
      "verse": "44:53",
      "similarity": 0.5560488350169545
    },
    {
      "verse": "35:33",
      "similarity": 0.3014325774908748
    },
    {
      "verse": "36:56",
      "similarity": 0.2956494143194867
    },
    {
      "verse": "22:23",
      "similarity": 0.26507119775606375
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/018031.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/018031.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:31.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}