{
  "chapter": "الكهف",
  "text": "كلتا الجنتين ءاتت اكلها ولم تظلم منه شيـا وفجرنا خللهما نهرا",
  "translations": [
    {
      "translation": "Each of the gardens yielded its fruit and did not withhold the least; and We made a stream flow in between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both the vineyards yielded abundant produce without failure and We caused a stream to flow in their midst\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and a stream flowing through the middle of the gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both the gardens gave yields and gave no shortfall in it – and We made a river to flow between the two.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each of those two gardens brought forth its produce, and failed not in the least therein, and We caused a river to gush forth in the midst of both.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both these gardens yielded their fruits, and failed not aught thereof, and We caused a river to gush forth in their midst,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "each of the two gardens yielded its produce and failed naught in any wise; and We caused to gush amidst them a river.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each of the gardens gave its fruit and withheld naught thereof. And We caused a river to gush forth therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "each garden produced its fruit and did not fail to yield its best; We even caused a river to gush forth in the midst of them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each of the two gardens brought forth its produce and stinted not aught thereof; and We caused to gush forth in the midst of the twain a river.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both gardens yielded their produce without stinting anything of it. And We had set a stream gushing through them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each of those gardens brought forth its produce, and failed not in the least therein: in the midst of them We caused a river to flow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each of those two gardens brought forth its produce, and failed not in the least therein, and We caused a river to gush forth in the midst of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each of the two gardens yielded its produce and did not fail in the least and We made a river to gush through them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both gardens produced their harvest in full, and suffered no loss. And We made a river flow through them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each of the two gardens produced its fruit and did not fall short thereof in anything. And We caused to gush forth within them a river.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:33] Each of the two gardens (kiltā, ‘each [of the two]’ is a singular [noun] that indicates a dual [number]; and [the entire clause] is the subject) yielded (ātat is the predicate thereof) its produce, its fruit, without stinting, diminishing, anything thereof. And We caused a stream to gush forth therein, to run through them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Each of the gardens gave its fruit) every year (and withheld naught thereof. And We caused a river to gush forth therein) in their middle.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَمْ تَظْلِم مِّنْهُ شَيْئاً } معناهُ لَمْ تَنقُصْ مِنهُ\n\n\n\n\nوقوله تعالى: { وَفَجَّرْنَا خِلالَهُمَا نَهَراً } معناهُ وسَطَهُمَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كِلْتَا ٱلْجَنَّتَيْنِ } كملتا إلى أن { آتَتْ } وأثمرت كل منهما { أُكُلَهَا } ثمرتها كاملةً وافرةً في كل سنةٍ { وَلَمْ تَظْلِم مِّنْهُ شَيْئاً } أي: لم تنقص ثمرتها وحاصلهما من كل منهما شيئاً من النقصان كما هو المعهود في سائر البساتين، فإن ثمرها يتوفر في عامٍ وينقص في أخرى { وَ } مع ذلك { فَجَّرْنَا } وأجرينا { خِلالَهُمَا } أي: أوساط الجنتين { نَهَراً } [الكهف: 33] سقيهما\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { كلتا الجنتين آتت أُكُلَها }: ثمرها وبلغ مبلغًا صالحًا للأكل، { ولم تَظْلِم منه شيئًا } أي: لم تنقص من أكلها شيئًا في كل سنة، بخلاف سائر البساتين، فإن الثمار غالبًا تكثر في عام وتقل في عام، { وفجَّرْنا خِلالهما }: فيما بين كل من الجنتين { نَهَرًا } على حدةٍ، وقرئ بالسكون\n\n\nوالنهر: الماء الكثير، وكان لكل بستان نهر ليدوم شربها ويدوم بهاؤها\n  ولعل تأخير تفجير النهر عن ذكر إيتاء الأكل، مع أن الترتيب الخارجي العكس للإيذان باستقلال كل من إيتاء الأكل وتفجير النهر في تكميل محاسن الجنتين، كما في قصة البقرة ونحوها، ولو عكس لأوهم أن المجموع خصلة واحدة بعضها مرتب على بعض",
      "translations": []
    }
  ]
}