{
  "chapter": "الكهف",
  "text": "ولولا اذ دخلت جنتك قلت ما شاء الله لا قوة الا بالله ان ترن انا۠ اقل منك مالا وولدا",
  "translations": [
    {
      "translation": "Why, when you entered your garden, did you not say, \"It is as Allah wills, there is no strength but in Allah\"? Though you see me with less wealth and children than you possess,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you entered your garden, why did you not say: 'As God may please;' for no one has power except given by God? Though you see me poorer in wealth and children than you,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you entered your vineyard, why did you not say: 'Whatever Allah wills shall come to pass, for there is no power save with Allah!' If you find me less than yourself in wealth and children\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When entering your garden, you should have said, \"This is what God willed; All Power belongs to Him. Even if you consider me inferior to yourself in wealth and offspring,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And why was it not that you would have said when you entered your garden, ‘Whatever Allah wills – we do not have any strength except with the help of Allah’ – if you had observed me lesser than you in wealth and children.”?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was better for you to say, when you entered your garden: `That which Allah wills! There is no power but with Allah!' If you see me less than you in wealth, and children,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wherefore did you not say when you entered your garden: It is as Allah has pleased, there is no power save in Allah? If you consider me to be inferior to you in wealth and children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, when thou wentest into thy garden, didst thou not say, \"As God will; there is no power except in God\"? If thou seest me, that I am less than thou in wealth and children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only, when thou enteredst thy garden, thou hadst said: That which Allah willeth (will come to pass)! There is no strength save in Allah! Though thou seest me as less than thee in wealth and children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you entered your garden, why did you not say, \"That which God wills [will surely come to pass], there is no power save with God?\" Although you see I have less wealth and offspring than you,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore saidst thou not, when thou enteredest thy garden: whatsoever Allah may will! there is no power save in Allah! If thou beholdest I am inferior to thee in substance and offspring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did you not say, when you entered your garden, ‘‘[This is] as Allah has willed! There is no power except by Allah!’’ If you see that I have lesser wealth than you and children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why didst thou not, as thou wentest into thy garden, say: 'Allah's will (be done)! There is no power but with Allah!' If thou dost see me less than thee in wealth and sons,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was better for you to say, when you entered your garden: 'That which Allah wills (will come to pass)! There is no power but with Allah '. If you see me less than you in wealth, and children.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you entered your garden why did you not say: \"If Allah wills; there is no power except by Allah.\" Though you see me lesser than yourself in wealth and children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you entered your garden, why did you not say, “As God wills; there is no power except through God”? Although you see me inferior to you in wealth and children.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why did you, when you entered your garden, not say, 'What Allah willed [has occurred]; there is no power except in Allah '? Although you see me less than you in wealth and children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:39] And if only when you entered your garden, you had said, upon admiring it, ‘This is “What God has willed. There is no power except in God”. In a hadīth [it is stated that]: ‘Whoever is given something good in the way of family or wealth and upon receiving it says, “What God wills [comes to pass]; there is no power except in God” (mā shā’a’Llāh lā quwwata illā bi’Llāh), he will never experience any ill therefrom’. If you see me (anā is a pronoun separating two direct objects) as less than you in wealth and children,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If only, when thou enteredst thy garden, thou hadst said: That which Allah willeth (will come to pass)!) this is from Allah and not from me. (There is no strength save in Allah!) this is only through Allah's power, not through my own power. (Though thou seest me as less than you in wealth and children) and servants in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْلاۤ } أي: هلا وقت { إِذْ دَخَلْتَ } أيها المدبر العاقل { جَنَّتَكَ } التي افتخرت بها { قُلْتَ } بدل قولك: { مَآ أَظُنُّ أَن تَبِيدَ هَـٰذِهِ أَبَداً } [الكهف: 35] { مَا شَآءَ ٱللَّهُ } أي: ما شاء وأراد دوامها تتأبد وما لم يشأ لم تتأبد؛ إذ { لاَ قُوَّةَ } ولا قدرة للتأبيد والتخريب { إِلاَّ بِٱللَّهِ } أصالةً وحقيقةً، وأنت أيها الكافر المسرف المنكر { إِن تَرَنِ أَنَاْ أَقَلَّ مِنكَ مَالاً وَوَلَداً } [الكهف: 39] فعيرتني وعرضت عليّ أولادَك وزخارفَك بطراً وبوحاً، مع أني أكثر منك إيماناً وعرفاناً وثقةً على الله واتكالاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولولا إِذْ دخلتَ جنتك }: بستانك، { قلتَ ما شاء الله } أي: هلاَّ قُلتَ عند دخولها: { ما شاء الله } أي: الأمر ما شاء الله، أو ما شاء الله يكون، والمراد: تحضيضه على الاعتراف بأنها وما فيها بمشيئة الله تعالى، إن شاء أبقاها، وإن شاء أخفاها، { لا قوة إِلا بالله } أي: لا قوة لي على عمارتها وتدبير أمرها إلا بمعونة الله وإقداره\n قال النبي صلى الله عليه وسلم:\n\n \" مَنْ رَأَى شَيْئًا فأعْجَبه فَقَالَ: مَا شَاءَ اللهُ لا قُوَّةَ إِلاَّ بالله، لَمْ يضُرّهُ شَيءٌ \" \n\nوقال لأبي هريرة:\n\n \" أَلاَ أَدُلُك عَلى كَلِمَةٍ مِن كُنُوزِ الْجَنَّة؟ قَال بَلَى يا رسُول الله، قال: لاَ قوةَ إلاَّ بالله، إن قالها العبد قال اللهُ عَزّ وجلّ: أسْلم عبدي واسْتَسْلم \" \n\nوقال لعبْدِ اللهِ بْنَ قَيْسٍ:\n\n \" ألاَ أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الجَنَِّةِ؟ قال: بَلَى، يا رَسُولَ اللهِ، قَالَ: \" لاَ حَوْلَ ولا قُوَّةَ إِلاَّ بالله \"\n \n",
      "translations": []
    }
  ]
}