{
  "chapter": "الكهف",
  "text": "وما اظن الساعة قائمة ولئن رددت الى ربى لاجدن خيرا منها منقلبا",
  "translations": [
    {
      "translation": "I do not think the Hour will ever come. But if I should be sent back to my Lord, I will definitely get something better in return.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can I think that the Hour (of Doom) will come, And even if I am brought back to my Lord, I will surely find a better place there than this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do I believe that the Hour of Resurrection will ever come to pass. And even if I am returned to my Lord, I shall find a better place than this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor do I think that there will be a Day of Judgment. Even if I shall be brought before my Lord, I certainly deserve to have a better place than this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I do not think that the Last Day will ever be established – and even if I return to my Lord I will surely find a haven better than this garden.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not think the Hour will ever come, and if indeed I am brought back to my Lord, I surely, shall find better than this when I return to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not think the hour will come, and even if I am returned to my Lord I will most certainly find a returning place better than this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not think that the Hour is coming; and if I am indeed returned to my Lord, I shall surely find a better resort than this.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I think not that the Hour will ever come, and if indeed I am brought back unto my Lord I surely shall find better than this as a resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and I do not believe that the Hour will ever come. Even if I am returned to my Lord, I shall surely find a better place than this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor I imagine that the Hour is going to happen; and if am brought back to my Lord, surely I will find something better than this as a retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and I do not think that the Hour will ever set in. And even if I am returned to my Lord I will surely find a resort better than this.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do I deem that the Hour (of Judgment) will (ever) come: Even if I am brought back to my Lord, I shall surely find (there) something better in exchange.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I think not the Hour will ever come, and if indeed I am brought back to my Lord, (on the Day of Resurrection), I surely shall find better than this when I return to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do I think that the Hour will come. Even if I returned to my Lord, I should surely find a better place than this'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I do not think the Hour is coming. And even if I am returned to my Lord, I will find something better than this in return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not think the Hour will occur. And even if I should be brought back to my Lord, I will surely find better than this as a return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:36] Moreover, I do not think that the Hour will ever come; and [even] if I am indeed returned to my Lord, in the Hereafter, according to your claim, I shall surely find better than this as a resort’, as a [place of] return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(I think not that the Hour will ever come) will ever take place, (and if indeed I am brought back unto my Lord) as you claim (I surely shall find better than this) garden (as a resort) as a returning place.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً { مَآ أَظُنُّ } وأعتقد { ٱلسَّاعَةَ } الموعودة التي أخبر بها أصحاب الدعاوي من الأنبياء والرسل { قَائِمَةً } آتيةٌ البتة بلا تردد وشك حتى تنهدم وتنعدم هذه بانعدام العالم وانقراضها { وَلَئِن رُّدِدتُّ } هبني أن فرضتُ وقدّرتُ قيام الساعة وانقضاء النشأة الدنياوية على ما زعموا وبُعثتُ من قبري على الوجه الذي ادعو وَرُددتُ { إِلَىٰ رَبِّي } للحساب والجزاء وعرض الأعمال وتنقيدها { لأَجِدَنَّ } ألبتة جنةً في العقبى { خَيْراً مِّنْهَا } أي: من هذه الديناوية فآخذُها { مُنْقَلَباً } [الكهف: 36] أي: مرجعاً ومنزلاً كما أخذتُ هذه في الدنيا\n وإنما يقول ذلك على سبيل الاستهزاء والاستخفاف\n يعني: إني حقيق حريُ بتلك المرتبة في الدنيا والآخرة\n إن فُرض وجودها\n فأنا حري بذلك فيها أيضاً\n\n\nثم لما تمادى في المباهاة والمفاخرة\n وتطاول كلامه في الغفلة والغرور والإنكار على الله وكمال قدرته وقوته\n وسرعة نفوذ قضائه وحكمه المبرم متى تعلق إرادته { قَالَ لَهُ صَاحِبُهُ } المؤمن { وَهُوَ يُحَاوِرُهُ } على سبيل العظة والتذكير وأنواع التسفيه والتعبير: { أَكَفَرْتَ } وأنكرتَ أيها المفسد الطاغي { بِٱلَّذِي خَلَقَكَ } أي: قدّر أولاً مادتك { مِن تُرَابٍ } خسيسٍ مزدولٍ إلى أن صرتَ بكثرة التبدلات والتغييرات نطفةٌ مهينةٌ { ثُمَّ } قدّرها ثانياً { مِن نُّطْفَةٍ } دنيئةٍ يستحقرها بل يستخبثها جميع الطباع { ثُمَّ سَوَّاكَ } منها وعد لك شخصاً سوياً سالماً وربَّاك بأنواع اللطف والكرم إلى أن صرتَ { رَجُلاً } [الكهف: 37] رشيداً عاقلاً بالغاً كافلاً للأمور والوقائع\n كافياً لإحداث الغرائب والبدائع\n وافياً في جميع المضارّ والمنافع\n\n\nثم كلفك بالإيمان والمعرفة والإتيان بالأعمال الصالحة والإذعان بالنشأة الأخرى\n وما يترتب عليها من العرض والحساب والسؤال والجزاء وجميع المتعقدات الأخروية\n فاستنكرتَ واستكبرت إلى أن كفرتَ عناداً ومكابرةً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فدخله { وهو ظالمٌ لنفسه } ضارُّ لها بعُجْبه وكفره، { قال } حين دخوله: { ما أظنُ أن تَبِيدَ هذه } الجنة، أي: تفنى { أبدًا } لطول أمده وتمادي غفلته، وإنكارًا لفناء الدنيا وقيام الساعة، ولذلك قال: { وما أظنُّ الساعة قائمةً } أي: كائنة فيما سيأتي، { ولئن رُدِدتُ إِلى ربي } بالبعث عند قيامها، كما تقول، { لأجدنَّ } حينئذ { خيرًا منها }: من الجنتين { مُنقلبًا } أي: مرجعًا وعاقبة، أي: كما أعطاني هذا في الدنيا سيعطيني أفضل منه في الآخرة، ومدار هذا الطمع واليمين الفاجرة: اعتقاد أنه تعالى إنما أولاه ما أولاه في الدنيا لاستحقاقه لذاتِهِ، وكرامته عليه، ولم يَدْرِ أن ذلك استدراج",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:14",
      "similarity": 0.36148963835822784
    },
    {
      "verse": "37:87",
      "similarity": 0.34275999941521695
    },
    {
      "verse": "45:32",
      "similarity": 0.3310672776389813
    },
    {
      "verse": "41:50",
      "similarity": 0.3276148476413031
    },
    {
      "verse": "2:46",
      "similarity": 0.3111725275456017
    }
  ]
}