{
  "chapter": "الكهف",
  "text": "قال له صاحبه وهو يحاوره اكفرت بالذى خلقك من تراب ثم من نطفة ثم سوىك رجلا",
  "translations": [
    {
      "translation": "His companion, with whom he was debating, said to him, 'Do you then disbelieve in Him who created you from dust, then from a drop of sperm, and then formed you as a man?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disputing with him, his companion said: \"Do you disbelieve in Him who created you from dust, then a drop of semen, then formed you into a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While conversing with him his neighbour exclaimed: \"Do you deny Him Who created you out of dust, then out of a drop of sperm, and then fashioned you into a complete man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His friend said to him, \"How can you disbelieve in the One who turned clay into sperm out of which He created you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion debating with him answered, “What! You disbelieve in Him Who has created you from dust, then from a drop of liquid, and then created you as a complete man?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion said to him during his discussion: \"Do you disbelieve in Him Who created you out of dust, then out of Nutfah, then fashioned you into a man\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion said to him while disputing with him: Do you disbelieve in Him Who created you from dust, then from a small seed, then He made you a perfect man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said his fellow, as he was conversing with him, 'What, disbelievest thou in Him who created thee of dust, then of a sperm-drop, then shaped thee as a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His comrade, when he (thus) spake with him, exclaimed: Disbelievest thou in Him Who created thee of dust, then of a drop (of seed), and then fashioned thee a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion replied, in the course of their discussion, \"Do you deny Him who created you from dust, from a small drop of fluid, then formed you into a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His fellow said unto him, while he spake with him: hast thou disbelieved in Him Who created thee of dust, then of a sperm, and formed thee a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion said to him, as he conversed with him: ‘Do you disbelieve in Him who created you from dust, then from a drop of [seminal] fluid, then fashioned you as a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion said to him, in the course of the argument with him: \"Dost thou deny Him Who created thee out of dust, then out of a sperm-drop, then fashioned thee into a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion said to him, during the talk with him: \"Do you disbelieve in Him Who created you out of dust (i.e. your father Adam), then out of Nutfah (mixed semen drops of male and female discharge), then fashioned you into a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion said, during his conversation with him: 'What, do you disbelieve in Him who created you from dust, then from a spermdrop, and then fashioned you into a man!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His friend said to him, as he conversed with him, “Are you being ungrateful to Him who created you from dust, then from a sperm-drop, then evolved you into a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion said to him while he was conversing with him, \"Have you disbelieved in He who created you from dust and then from a sperm-drop and then proportioned you [as] a man?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:37] His companion said to him, as he conversed with him, responding to him: ‘Do you disbelieve in Him Who created you of dust — as Adam was created of it — then of a drop of fluid, [of] semen, then fashioned you, made you upright and gave you the form of, a man?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And his comrade) the believer, (while he disputed with him) such that he may renounce his disbelief, (exclaimed: Disbelievest thou in Him Who created thee of dust) He created you from Adam and Adam is from dust, (then of a drop (of seed)) of your father, (and then fashioned you a man) of an upright stature?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُوَ يُحَاوِرُهُ } معناه يُكَلمُهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما تمادى في المباهاة والمفاخرة، وتطاول كلامه في الغفلة والغرور والإنكار على الله وكمال قدرته وقوته، وسرعة نفوذ قضائه وحكمه المبرم متى تعلق إرادته { قَالَ لَهُ صَاحِبُهُ } المؤمن { وَهُوَ يُحَاوِرُهُ } على سبيل العظة والتذكير وأنواع التسفيه والتعبير: { أَكَفَرْتَ } وأنكرتَ أيها المفسد الطاغي { بِٱلَّذِي خَلَقَكَ } أي: قدّر أولاً مادتك { مِن تُرَابٍ } خسيسٍ مزدولٍ إلى أن صرتَ بكثرة التبدلات والتغييرات نطفةٌ مهينةٌ { ثُمَّ } قدّرها ثانياً { مِن نُّطْفَةٍ } دنيئةٍ يستحقرها بل يستخبثها جميع الطباع { ثُمَّ سَوَّاكَ } منها وعد لك شخصاً سوياً سالماً وربَّاك بأنواع اللطف والكرم إلى أن صرتَ { رَجُلاً } [الكهف: 37] رشيداً عاقلاً بالغاً كافلاً للأمور والوقائع، كافياً لإحداث الغرائب والبدائع، وافياً في جميع المضارّ والمنافع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال له صاحبه } أخوه المسلم { وهو يُحاوره أكفرتَ بالذي خلقك } أي: أصلك { من ترابٍ } ، فإن خلق آدم عليه السلام من تراب متضمن لخلق أولاده منه إذ لم تكن فطرته مقصورة على نفسه، بل كانت أنموذجًا منطويًا على فطرة سائر أفراد الجنس، انطواءً مجانسًا مُستتْبعًا لجريان آثارها على الكل، فكان خلْقُه عليه السلام من تراب خلقًا للكل منه، { ثم من نطفة } هي مادتك القريبة، { ثم سَوَّاك رجلاً } أي: عدلك وكملك إنسانًا ذكرًا، أو صيرك رجلاً، وفي التعبير بالموصول مع صلته: تلويح بدليل البعث الذي نطق به قوله تعالى:\n\n[الحَجّ: 5]\n قال البيضاوي: جعل كفره بالبعث كفرًا بالله لأنه منشأ الشك في كمال قدرة الله، ولذلك رتَّب الإنكار على خلقه إياه من التراب، فإن مَنْ قدر على إبداء خلقه منه قدر أن يعيده منه\n هـ\n ثم قال أخوه المسلم: { لَكِنَّا } أصله: لكن أنا، وقُرئ به، فحُذفت الهمزة، فالتقت النونان فوقع الإدغام، { هو الله ربِّي } ، \" هو \": ضمير الشأن، مبتدأ، خبره: \" هو الله ربي \" ، وتلك الجملة: خبر \" أنا \" ، والعائد منها: الضمير، وقرئ بإثبات \" أنا \" في الوصل والوقف، وفي الوقف خاصة، ومدار الاستدراك قوله تعالى: { أكفرت } ، كأنه قال: أنت كافر، لكني مؤمن موحد، { ولا أُشركُ بربي أحدًا } ، وفيه تنبيه على أن كفره كان بالإشراك\n\n\nقاله أبو السعود\n قال شيخ شيوخنا سيدي عبد الرحمن الفاسي: والذي يظهر من قوله: { ولولا إذ دخلت\n\n\n } الآية، ومن قوله: { يا ليتني لم أشرك\n\n\n } الآية، أنه إشراك بالله في عدم صرف المشيئة إليه، ودعوى الاستقلال بنفسه دونه، وقد قال وهب بن منبه: قرأت في تسعين كتابًا من كتب الله أن من وَكل إلى نفسه شيئًا من المشيئة فقد كفر، ثم شكه في البعث تكذيب بوعد الله، وهو كفر صراح\n هـ",
      "translations": []
    }
  ]
}