{
  "chapter": "الكهف",
  "text": "وعرضوا۟ على ربك صفا لقد جئتمونا كما خلقنكم اول مرةۭ بل زعمتم الن نجعل لكم موعدا",
  "translations": [
    {
      "translation": "they will be paraded before your Lord in ranks: 'You have come to Us just as We created you at first. Yes indeed! Even though you claimed that We would not fix a time with you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be arraigned before their Lord row on row, (and He will say): \"Well, you have come to Us as We had first created you, even though you imagined We had fixed no time for this meeting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall be brought before your Lord, all lined up, and shall be told: \"Now, indeed, you have come before Us in the manner We created you in the first instance, although you thought that We shall not appoint a tryst (with Us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will all be lined up in the presence of your Lord who will tell them, \"Despite your belief that there would never be a Day of Judgment, all of you are brought in Our presence just as though We had created you for the first time. You believed that our promise could never come true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And everyone shall be presented before your Lord in rows; “Indeed you have come to Us exactly as We had created you for the first time – in fact you thought that We shall never appoint a promised time for you!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will be set before your Lord, aligned. (He will say:) \"Now indeed, you have come to Us as We created you the first time. Nay, but you thought that We had appointed no meeting for you (with Us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall be brought before your Lord, standing in ranks: Now certainly you have come to Us as We created you at first. Nay, you thought that We had not appointed to you a time of the fulfillment of the promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they shall be presented before their Lord in ranks -- 'You have come to Us, as We created you upon the first time; nay, you asserted We should not appoint for you a tryst.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they are set before thy Lord in ranks (and it is said unto them): Now verily have ye come unto Us as We created you at the first. But ye thought that We had set no tryst for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be ranged before your Lord, standing in rows and He will say to them, \"Now you have come to Us as We created you at first. But you supposed that We would not appoint the time for the fulfillment of Our promise to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall be sent before thy lord in ranks! now are ye come to Us even as We had created you the first time; aye ye fancied that We had appointed for you no tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be presented before your Lord in ranks: ‘Certainly you have come to Us just as We created you the first time. But you maintained that We shall not appoint a tryst for you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will be marshalled before thy Lord in ranks, (with the announcement), \"Now have ye come to Us (bare) as We created you first: aye, ye thought We shall not fulfil the appointment made to you to meet (Us)!\":\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will be set before your Lord in (lines as) rows, (and Allah will say): \"Now indeed, you have come to Us as We created you the first time. Nay, but you thought that We had appointed no meeting for you (with Us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they shall be presented in ranks before your Lord (who will say to them:) 'You have returned to Us as We created you the first time. No, you claimed We would not appoint a meeting for you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be presented before your Lord in a row. “You have come to Us as We created you the first time. Although you claimed We would not set a meeting for you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will be presented before your Lord in rows, [and He will say], \"You have certainly come to Us just as We created you the first time. But you claimed that We would never make for you an appointment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:48] And they shall be presented before your Lord in ranks (saffan is a circumstantial qualifier) in other words, ranged so that every community is in a row [on its own], and it shall be said to them: ‘Verily you have come to Us just as We created you the first time, that is to say, individually, barefoot, naked and uncircumcised; and it shall be said to the deniers of the Resurrection: rather you claimed that (a [of allan] is an, softened in place of the hardened one, in other words [it is to be understood as] annahu) We would not appoint for you a tryst’, for resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they are set before thy Lord) they were led before your Lord (in ranks) all together, and Allah says to them: (Now verily have ye come unto Us as We created you at the first) without wealth or children. (But you thought) you said in the life of the world (that We had set no tryst for you) that We had set no appointed term for the Resurrection.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وعرضوا على ربّك } عند البعث { صفّاً } أي: مصطفين مترتبين في المواقف لا يحجب بعضهم بعضاً\n كل في رتبته { لقد جئتمونا } أي: قلنا لهم ذلك اليوم: لقد جئتمونا حفاة عراة\n غرلاً فرادى\n أي: { كما خلقناكم أول مرّة بل زعمتم } بإنكاركم البعث { ألّن نجعل لكم موعداً } وقتاً لإنجاز ما وعدتم على ألسنة الأنبياء من البعث والنشور\n { ووضع الكتاب } أي: كتاب القالب المطابق لما في نفوسهم من هيئات الأعمال الراسخة فيهم { فترى المجرمين مشفقين مما فيه } لعثورهم به على ما نسوا { ويقولون يا ويلتنا } يدعون الهلكة التي هلكوا بها من أثر العقيدة الفاسدة والأعمال السيئة { ما لهذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها } لكون آثار حركاتهم وأعمالهم كلها باقية في نفوسهم صغيرة كانت أو كبيرة\n ثابتة في ألواح النفوس الفلكية أيضاً\n مضبوطة فيها\n تظهر عليهم على التفصيل في نشأتهم الثانية لا محيص لهم عنها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما جمعوا واجتمعوا في المحشر جميعاً { عُرِضُواْ عَلَىٰ رَبِّكَ } يا أكمل الرسل عرضَ العسكر على السلطان الصوري { صَفَّاً } صافين مصفَّفين على الاستواء\n بحيث لا يحجب أحدٌ أحداً\n بل كل واحد في مرأى منه سبحانه بلا سترةٍ وحجابٍ\n ثم يقال لهم من قِبل الحق على سبيل الاستيلاء والسطوة\n وإظهار الهيبة والسلطنة القاهرة الغالبة: { لَّقَدْ جِئْتُمُونَا } اليوم حفاةً عراةً { كَمَا خَلَقْنَاكُمْ أَوَّلَ مَرَّةٍ } كذلك\n أي: في بدء وجودكم وظهوركم { بَلْ } كنتم { زَعَمْتُمْ } وظننتم فيما مضى من شدة بطركم وغفلتكم { أَلَّن نَّجْعَلَ لَكُمْ مَّوْعِداً } [الكهف: 48] أي: لن نقدر على أنجاز ما وعدناكم بألسنة رسلنا من البعث والحشر والعرض والجزاء\n بل كذَّبتم الرسلَ وأنكرتم الوعدَ والموعودَ جميعاً\n فالآن ظهر الحق الذي كنتم تمترون فيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { صفًّا }: حال\n أي: مصْطفين\n  يقول الحقّ جلّ جلاله: { و } اذكر { يوم نُسيِّرُ الجبالَ } أي: حين نقلعها من أماكنها ونسيرها في الجو\n على هيئتها\n كما ينبئ عنه قوله تعالى:\n[النمل: 88] أو: نسير أجزاءها بعد أن نجعلها هباء منثورًا\n والمراد من ذكره: تحذير الغافلين مما فيه من الأهوال\n وقرئ: \" تُسَيَّر \" بالبناء للمفعول جريًا على سَنَن الكبرياء\n وإيذانًا بالاستغناء عن الإسناد إلى الفاعل لظهور تعينه\n ثم قال: { وترى الأرضَ } أي: جميع جوانبها\n والخطاب للرسول صلى الله عليه وسلم\n أو لكل من يسمع\n { بارزةً }: ظاهرة\n ليس عليها جبل ولا غيره\n بل تكون\n[طه: 106\n 107]\n { وحشرناهم }: جمعناهم إلى الموقف من كل حدب\n مؤمنين وكافرين\n { فلم نُغادرْ } أي: لم نترك { منهم أحدًا }\n { وعُرِضُوا على ربك } \n شبهت حالتهم بحال جُنْدٍ عُرِضَ على السلطان\n ليأمر فيهم بما يأمر\n وفي الالتفات إلى الغيبة\n وبناء الفعل للمفعول\n مع التعرض لعنوان الربوبية\n والإضافة إلى ضميره - عليه الصلاة والسلام - من تربية المهابة\n والجري على سَنَن الكبراء\n وإظهار اللطف به صلى الله عليه وسلم - ما لا يخفى\n قاله أبو السعود\n { صَفًّا } أي: مصْطَفِّينَ غير متفرقين ولا مختلطين\n كل أمة صَفٌّ\n وفي الحديث الصحيح:\n \" يَجْمَعُ اللهُ الأولين والآخرين في صَعِيدٍ واحِد\n صفوفًا\n يُسْمِعُهُمُ الدَّاعِيِ وَيَنْفُذُهُم البَصَرُ\n\n\n \" \nالحديث بطوله\n وفي حديث آخر:\n \" أهل الجنة\n يوم القيامة\n مائة وعشرون صفًا\n أنتم منها ثمانون صفًا \"\n \nيقال لهم - أي: للكفرة منهم: { لقد جئتمونا كما خلقناكم أولَ مرة } \n وتركتم ما خولناكم وما أعطيناكم من الأموال وراء ظهوركم\n أو: حفاة عراة غُرْلاً\n كما في الحديث\n وهذه المخاطبة\n بهذا التقريع\n إنما هي للكفار المنكرين للبعث\n وأما المؤمنون المُقِرون بالبعث فلا تتوجه إليهم هذه المخاطبة\n ويدل عليه ما بعده من قوله: { بل زعمتم أن لن نجعل لكم موعدًا } أي: زعمتم في الدنيا أنه\n أي: الأمر والشأن\n لن نجعل لكم وقتًا يَتَنَجَّزُ فيه ما وعدته من البعث وما يتبعه\n\nوهو إضراب وانتقال من كلام\n إلى كلام\n كلاهما للتوبيخ والتقريع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:22",
      "similarity": 0.5183700981124802
    },
    {
      "verse": "37:165",
      "similarity": 0.5051776716451146
    },
    {
      "verse": "37:1",
      "similarity": 0.5043594368794676
    },
    {
      "verse": "24:41",
      "similarity": 0.410380542474607
    },
    {
      "verse": "78:38",
      "similarity": 0.4094007165195502
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/18:48.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/18:48.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:48.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}