{
  "chapter": "الكهف",
  "text": "المال والبنون زينة الحيوة الدنيا والبقيت الصلحت خير عند ربك ثوابا وخير املا",
  "translations": [
    {
      "translation": "Wealth and sons are the embellishment of the life of this world. But, in your Lord's sight, right actions which are lasting bring a better reward and are a better basis for hope.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are only the gloss of this world, but good deeds that abide are better with your Lord for recompense, and better for expectation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are an adornment of the life of the world. But the deeds of lasting righteousness are the best in the sight of your Lord in reward, and far better a source of hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children and property are the ornaments of the worldly life, but for deeds which continually produce virtue one can obtain better rewards from God and have greater hope in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and sons are ornaments of the life of this world; and good deeds that last – their reward is better before your Lord, and are better in respect of hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are the adornment of the life of this world. But the good righteous deeds that last, are better with your Lord for reward and better for hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are an adornment of the life of this world; and the ever-abiding, the good works, are better with your Lord in reward and better in expectation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and sons are the adornment of the present world; but the abiding things, the deeds of righteousness, are better with God in reward, and better in hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are an ornament of the life of the world. But the good deeds which endure are better in thy Lord's sight for reward, and better in respect of hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are an ornament of the life of this world. But deeds of lasting merit are better rewarded by your Lord and a far better source of hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Substance and sons are the adornment of the life of the World, and the righteous works that last are excellent with thy Lord in respect of reward, and excellent in respect of hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are an adornment of the life of the world, but lasting righteous deeds are better with your Lord in reward and better in hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and sons are allurements of the life of this world: But the things that endure, good deeds, are best in the sight of thy Lord, as rewards, and best as (the foundation for) hopes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are the adornment of the life of this world. But the good righteous deeds (five compulsory prayers, deeds of Allah's obedience, good and nice talk, remembrance of Allah with glorification, praises and thanks, etc.), that last, are better with your Lord for rewards and better in respect of hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are the ornament of this present life. But the things that last and good deeds, are better with your Lord in reward and hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are the adornments of the present life. But the things that last, the virtuous deeds, are better with your Lord for reward, and better for hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:46] Wealth and children are an adornment of the life of this world, [adornment] with which one arrays oneself therein. But the enduring things, the righteous deeds — and these are: ‘Glory be to God’ (subhāna’Llāh), ‘Praise be to God’ (al-hāmdu li’Llāh), ‘There is no god but God (lā ilāha illā’Llāh), ‘God is Great’ (Allāhu akbar); some add [the following] ‘There is no power or strength except in God’ (lā hawla wa-lā quwwata illā bi’Llāh) — [these] are better with your Lord for reward and better in [respect of] hope, in other words, [they are better] in terms of what a person hopes for and desires from God, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentions the comfort that the life of this world contains, saying: (Wealth and children are an ornament of life of the world) but they do not last just as dry twigs do not. (But the good deeds which endure) the five daily prayers; it is also said that the reference here is to: that which is lasting in reward. Good deeds include the saying of: \"Glory be to Allah, praise be to Allah, there is no deity save Allah and Allah is the greatest\", (are better in thy Lord's sight for reward) for recompense, (and better about hope) the prayer is the best work by means of which the servants can be helpful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلْبَاقِيَاتُ ٱلصَّالِحَاتُ } قال: هي الصَّلواتُ الخَمسُ\n وقال: سُبحانَ الله والحَمدُ لله ولاَ إِله إِلاَّ الله والله أَكبرُ\n وَلاَ حَولَ وَلاَ قُوةَ إِلاَّ بالله\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومتى سمعتَ وعلمتَ حال حياة الدنيا ومآل أمرها وعاقبتها، وانكشفتَ بعدم ثباتها وقرارها فمعظم ما يتفرع عليها: { ٱلْمَالُ وَٱلْبَنُونَ } إذ هما { زِينَةُ ٱلْحَيَاةِ ٱلدُّنْيَا } الفانية عارضان عليها، ومتى لم يكن للمعروض دوامُ وبقاءُ، فللعارض بالطريق الأولى { وَٱلْبَاقِيَاتُ } التي تبقى معك في أولادك وأخراك { ٱلصَّالِحَاتُ } المقربةُ إلى الله المقبولةُ عنده، المترتبةُ عليها النجاةُ من العذاب والنيلُ إلى الفوز بالفلاح { خَيْرٌ عِندَ رَبِّكَ ثَوَاباً } أي: أجراً وجزاءٌ حسناً من اللذات الروحانية المودعة لأرباب القبول { وَخَيْرٌ أَمَلاً } [الكهف: 46] أي: عاقبةًً ومآلاً؛ إذ يُنال بها المعارف والحقائق والمكاشفات والمشاهدات المودعة لأرباب العناية وأصحاب القلوب من الراجين المؤملين شرف لقاء الله والفوز بمطالعة وجهه الكريم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { المالُ والبنونَ زينةُ الحياةِ الدنيا } أي: مما تذروه رياح الأقدار، ويلحقه الفناء والبوار، ويدخل في الزينة: الجاهُ، وجميعُ ما فيه للنفس حظ فإنه يفنى ويبيد، ثم ذكر ما لا يفنى فقال: { والباقياتُ الصالحاتُ } وهي أعمال الخير بأسرها، أو: الصلوات الخمس، أو: \" سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر \" ، زاد بعضهم: \" ولا حول ولا قوة إلا بالله العلي العظيم \"\n قال عليه الصلاة والسلام:\n\n \" هي من كنز الجنة، وصفايا الكلام، وهن الباقيات الصالحات، يأتين يوم القيامة مقدمات ومعقبات \"\n \n\nأو: الهمات العالية والنيات الصالحة إذ بها ترفع الأعمال وتُقبل\n أو: كل ما أريد به وجه الله، وسميت باقيةً: لبقاء ثوابها عند فناء كل ما تطمح إليه النفس من حظوظ الدنيا وزينتها الفانية\n قال في الإحياء: كل ما تذروه رياح الموت فهو زهرة الحياة الدنيا، كالمال والجاه مما ينقضي على القرب، وكل ما لا يقطعه الموت فهو الباقيات الصالحات، كالعلم والحرية لبقائهما كمالاً فيه، ووسيلة إلى القرب من الله تعالى، أما الحرية من الشهوات فتقطع عن غير الله، وتجرده عن سواه، وأما العلم الحقيقي فيفرده بالله ويجمعه عليه\n هـ\n وهي، أي: الباقيات الصالحات { خيرٌ عند ربك } أي: في الآخرة { ثوابًا } أي: عائدة تعود على صاحبها، بخلاف ما شأنه الفناء من المال والبنين فإنه يفنى ويبيد\n وهذا كقوله تعالى:\n\n[النحل: 96]\n وقوله: { عند ربك }: بيان لما يظهر فيه خيريتها، لا لأفضليتها من المال والبنين مع مشاركتها لها في الخيرية إذ لا مشاركة لهما في الخيرية في الآخرة\n ثم قال تعالى: { وخيرٌ أملاً } أي: ما يُؤمله الإنسان ويرجوه عند الله تعالى حيث ينال صاحبها في الآخرة كل ما كان يُؤمله في الدنيا، وأما ما مرّ من المال والبنين فليس لصاحبه فيه أمل يناله\n وتكرير \" خير \" للإشعار باختلاف حيثيتي الخيرية والمبالغة فيه\n\n\nالإشارة: قد تقدم، مرارًا، التحذير من الوقوف مع بهجة الدنيا وزخارفها الغرارة لسرعة ذهابها وانقراضها\n\n\n \" رَوى أبو هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: يا أبا هريرة تريد أن أريك الدنيا؟ قلت: نعم، فأخذ بيدي، وانطلق، حتى وقف بي على مزبلة، رؤوس الآدميين ملقاة، وبقايا عظام نخرة، وخِرَق بالية قد تمزقت وتلوثت بنجاسات الآدميين، فقال: يا أبا هريرة هذه رؤوس الآدميين التي تراها، كانت مثل رؤوسكم، مملوءة من الحرص والاجتهاد على جمع الدنيا، وكانوا يرجون من طول الأعمار ما ترجون، وكانوا يَجِدُّون في جمع المال وعمارة الدنيا كما تَجِدُّون، فاليوم قد تعرّت عظامهم، وتلاشت أجسامهم كما ترى، وهذه الخرق كانت أثوابهم التي كانوا يتزينون بها، وقت التجمل ووقت الرعونة والتزين، فاليوم قد ألقتها الرياح في النجاسات، وهذه عظام دوابهم التي كانوا يطوفون أقطار الأرض على ظهورها، وهذه النجاسات كانت أطعمتهم اللذيذة التي كانوا يحتالون في تحصيلها، وينهبها بعضُهم من بعض، قد ألقوها عنهم بهذه الفضيحة التي لا يقربها أحد من نتنها، فهذه جملة أحوال الدنيا كما تُشاهد وترى، فمن أراد أن يبكي على الدنيا فليبك، فإنها موضع البكاء \" \n\nقال أبو هريرة رضي الله عنه: فبكى جماعة الحاضرين \"\n ثمَّ ذكر ما يكون بعد فناء الدنيا\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:3",
      "similarity": 0.7657757855598658
    },
    {
      "verse": "19:76",
      "similarity": 0.2687766938025913
    },
    {
      "verse": "28:60",
      "similarity": 0.23821394136216012
    },
    {
      "verse": "42:36",
      "similarity": 0.18941632447887796
    },
    {
      "verse": "4:134",
      "similarity": 0.15195738788527646
    }
  ]
}