{
  "chapter": "الكهف",
  "text": "ووضع الكتب فترى المجرمين مشفقين مما فيه ويقولون يويلتنا مال هذا الكتب لا يغادر صغيرة ولا كبيرة الا احصىها ووجدوا۟ ما عملوا۟ حاضرا ولا يظلم ربك احدا",
  "translations": [
    {
      "translation": "The Book will be set in place and you will see the evildoers fearful of what is in it. They will say, 'Alas for us! What is this Book which does not pass over any action, small or great, without recording it?' They will find there everything they did and your Lord will not wrong anyone at all.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ledger (of their deeds) would be placed before them. Then you will see the sinners terrified at its contents, and say: \"Alas, what a written revelation this, which has not left unaccounted the smallest or the greatest thing!\" They will find in it whatsoever they had done. Your Lord does not wrong any one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then the Record of their deeds shall be placed before them and you will see the guilty full of fear for what it contains, and will say: \"Woe to us! What a Record this is! It leaves nothing, big or small, but encompasses it.\" They will find their deeds confronting them. Your Lord wrongs no one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the record of every one's deeds is placed before him, you will see the criminals terrified from what the record contains. They will say, \"Woe to us! What kind of record is this that has missed nothing small or great?\" They will find whatever they have done right before their very eyes. Your Lord is not unjust to any one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book shall be placed – and you will see the guilty dreading what is written in it and saying, “Woe to us – what sort of a Book is this that it has not left out any small sin nor a great one, which it has not included!” And they found all that they did confronting them; and your Lord does not wrong any one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book will be produced, and you will see the criminals, fearful of that which is therein. They will say: \"Woe to us! What sort of Book is this that leaves neither a small thing nor a large thing, but has recorded it with numbers!\" And they will find all that they did, present, and your Lord treats no one with injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book shall be placed, then you will see the guilty fearing from what is in it, and they will say: Ah! woe to us! what a book is this! it does not omit a small one nor a great one, but numbers them (all); and what they had done they shall find present (there); and your Lord does not deal unjustly with anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book shall be set in place; and thou wilt see the sinners fearful at what is in it, and saying, 'Alas for us! How is it with this Book, that it leaves nothing behind, small or great, but it has numbered it?' And they shall find all they wrought present, and thy Lord shall not wrong anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book is placed, and thou seest the guilty fearful of that which is therein, and they say: What kind of a Book is this that leaveth not a small thing nor a great thing but hath counted it! And they find all that they did confronting them, and thy Lord wrongeth no-one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Book [of deeds] will be placed before them and you will see the guilty apprehensive about its contents. They will say, \"Woe to us! What a record this is! It does not leave any deed, small or large, unaccounted for!\" They will find everything they ever did laid in front of them: your Lord will not be unjust to anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book shall be placed, and thou wilt see the culprits alarmed at that which is therein, and they will say: Ah! woe unto us! what aileth this book that it leaveth not any sin small or great but it hath computed it! And they shall find all that they had wrought present; and thy Lord wrongeth not any one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Book will be set up. Then you will see the guilty apprehensive of what is in it. They will say, ‘Woe to us! What a book is this! It omits nothing, big or small, without enumerating it.’ They will find present whatever they had done, and your Lord does not wrong anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book (of Deeds) will be placed (before you); and thou wilt see the sinful in great terror because of what is (recorded) therein; they will say, \"Ah! woe to us! what a Book is this! It leaves out nothing small or great, but takes account thereof!\" They will find all that they did, placed before them: And not one will thy Lord treat with injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book (one's Record) will be placed (in the right hand for a believer in the Oneness of Allah, and in the left hand for a disbeliever in the Oneness of Allah), and you will see the Mujrimun (criminals, polytheists, sinners, etc.), fearful of that which is (recorded) therein. They will say: \"Woe to us! What sort of Book is this that leaves neither a small thing nor a big thing, but has recorded it with numbers!\" And they will find all that they did, placed before them, and your Lord treats no one with injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Book shall be set in place, and you will see the sinners fearful of what is in it' They shall say: 'Woe to us! How is it, this book omits nothing small or great, all are counted' And they shall find what they did is present, and Your Lord will wrong no one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the book will be placed, and you will see the sinners fearful of its contents. And they will say, “Woe to us! What is with this book that leaves nothing, small or big, but it has enumerated it?” They will find everything they had done present. Your Lord does not wrong anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the record [of deeds] will be placed [open], and you will see the criminals fearful of that within it, and they will say, \"Oh, woe to us! What is this book that leaves nothing small or great except that it has enumerated it?\" And they will find what they did present [before them]. And your Lord does injustice to no one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:49] And the Book shall be set in place, the Book of every man — in his right hand, if [he is from] among the believers, and in his left hand, if [he is from] among the disbelievers. And you will see the guilty, the disbelievers, apprehensive, fearful, of what is in it, and they will say, when they observe the evil deeds [recorded] in it: ‘O (yā is for exclamation) woe to us!, [O this is] our destruction! (this [form waylatanā] is a verbal noun, but in this form it cannot be [conjugated as] a verb) What is it with this Book that it leaves out neither small nor great, from among our sins, but [instead it] has counted it?’, enumerated it and fixed it [in the record] — they are stupefied by it in this respect. And they shall find all that they did present, fixed [in writing] in their [individual] Book. And your Lord does not wrong anyone, He does not punish him [if he is] without guilt, nor does He diminish [anything of] the reward of a believer.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the Book is placed) on people's right and left hands; the scrolls fell on people's hands like snow flakes, (and thou seest the guilty) the idolaters and the hypocrites (fearful of that which is therein) in the Book, (and they say: What Kind of a book is this that leaveth not a small thing) of our deeds (nor a great thing) it is said that the small thing is a smile and the great thing is laughter (but has counted it) except that it is preserved and written down! (And they find all that they did) of good or evil (confronting them) written down, (and thy Lord wrongeth no one) He does not decrease the good deeds of anyone nor increase the evil deeds of anyone; it is also said that this means: He does not diminish the good deeds of the believer nor leave the evil deeds of the unbeliever.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وهذا معنى قوله: { ووجدوا ما عملوا حاضراً ولا يظلم ربّك أحدً } مرّ معنى سجود الملائكة وإباء إبليس",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما عُرضوا صافين على الوجه المذكور { وُضِعَ ٱلْكِتَابُ } المشتمل على تفاصيل أعمالهم وجميع أحوالهم وأطوارهم\n من بدء فطرتهم إلى انقراضهم من النشأة الاولى والمعدَّة لكسب الزاد للنشأة الأخرى بين يدي الله على رءوس الملأ { فَتَرَى } أيها الرائي { ٱلْمُجْرِمِينَ } حينئذ { مُشْفِقِينَ } خائفين مرعوبين { مِمَّا فِيهِ } أي: في الكتاب قبل القراءة عليهم { وَ } بعدما قُرئ عليهم\n وسمعوا جميعَ ما صدر عنهم كائنةً مكتوبةً فيه على التفصيل بلا فوت شيءٍ { وَيَقُولُونَ } متحسرين متمنين الموت\n مناجين في نفوسهم\n منادين: { يٰوَيْلَتَنَا } وهلكتنا أدركينا فهذا وقت حلولك ونزولك { مَالِ هَـٰذَا ٱلْكِتَابِ }  العجيب الشأن الجامع لجميع فضائحنا وقبائحنا\n بحيث { لاَ يُغَادِرُ } ولا يترك فضيحة { صَغِيرَةً وَلاَ كَبِيرَةً إِلاَّ أَحْصَاهَا } فصَّلها وعدَّدها بلا فوتِ خصلةٍ منها\n\nروي عن ابن عباس رضي الله عنهما: الصغيرة: التبسم\n والكبيرة: القهقهة\n\n\n{ وَ } بالجملة: { وَجَدُواْ مَا عَمِلُواْ } من الخير والشر والذميمة والحميدة { حَاضِراً } ثابتاً مكتوباً بلا نقصانٍ منها ولا زيادةٍ عليها\n وكيف لا يكون كذلك\n إذ { وَلاَ يَظْلِمُ رَبُّكَ } يا أكمل الرسل { أَحَداً } [الكهف: 49] من عباده لا بالزيادة ولا بالنقصان ولو قدر نقير\n\n\nثم لما كان منشأ جميع الشرور والغرور\n وأنواع الفتن والغفلات\n وأصناف الشكوك والكفر والضلالات إبليسَ\n عليه اللعنة\n كرر سبحانه قصة استكباره واستنكاره مراراً تذكيراً للمتعظين وتنبيهاً على الغافلين المغرورين\n ليكونوا على ذُكْرٍ منه\n بضمٍ فسكون\n أي: تذكُّرٍ وتفكرٍ\n من غوائله وتسويلاته\n ليتمكن لهم الحذرُ عن وساوس أعوانه وأنصاره التي هي جنود الأوهام والخيالات الباطلة والأماني الكاذبة الناشئة من صولة الأمَارة المستولية على القوى الروحانية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ووضع الكتاب } أي: كتاب كل أحد\n إما في يمينه أو شماله\n وهو عطف على: { عُرِضوا } \n داخلٌ تحت الأمور الهائلة التي أريد بذكرها تذكير وقتها\n وأورد فيه ما أورد في أمثاله من صيغة الماضي لتحقق وقوعه\n وإيثار الإفراد للاكتفاء بالجنس\n والمراد: صحائف أعمال العباد\n ووضعها إما في أيدي أصحابها يمينًا وشمالاً\n أو في الميزان\n { فترى المجرمين } قاطبة\n المنكرون للبعث وغيرهم\n { مشفقين }: خائفين { مما فيه } من الجرائم والذنوب\n { ويقولون } \n عند وقوفهم على ما في تضاعيفه نقيرًا أو قطميرًا: { يا ويلتنا } أي: ينادون بتهلكتهم التي هُلكوها من بين التهلكات\n ومستدعين لها ليهلكوا\n ولا يرون تلك الأهوال\n أي: يا ويلتنا احضري فهذا أوان حضورك\n يقولون: { ما لهذا الكتاب لا يُغادرُ }: لا يترك { صغيرةً ولا كبيرةً } من ذنوبنا { إلا أحصاها } أي: حواها وضبطها\n وجملة { لا يغادر }: حال محققة لِمَا في الاستفهام من التعجب\n أو استئنافية مبنية على سؤال مقدر\n كأنه قيل: ما شأنه حتى يتعجب منه؟ فقال: لا يغادر سيئة صغيرة ولا كبيرة إلاّ أحصاها\n { ووجدوا ما عملوا } في الدنيا من السيئات\n أو جزاء ما عملوا { حاضرًا }: مسطورًا عتيدًا\n { ولا يظلم ربُّك أحدًا } \n فيكتب ما لم يعمل من السيئات\n أو يزيد في عقابه المستحق له\n والله تعالى أعلم\n الإشارة: ويوم نُسير جبال الحس\n أو الوهم\n عن بساط المعاني\n وترى أرض العظمة بارزة ظاهرة لا تخفى على أحد\n إلا على أَكْمَهَ لا يُبصر القمر في حال كماله\n وحشرناهم إلى الحضرة القدسية\n فلم نغادر منهم\n أي: ممن ذهب عنه الحس والوهم\n أحدًا\n وعُرضوا على ربك لشهود أنوار جماله وجلاله\n صفًا\n للقيام بين يديه\n فيقول لهم: لقد جئتمونا من باب التجريد\n كما خلقناكم أول مرة\n مُطَهَّرِينَ من الدنس الحسي\n غائبين عن العلائق والعوائق\n وكنتم تزعمون أن هذا اللقاء لا يكون في الدنيا\n وإنما موعده الجنة\n ومن مات عن شهود حسه\n وعن حظوظه\n حصل له الشهود واللقاء قبل الموت الحسي\n ووضع الكتاب في حق أهل الحجاب\n فترى المجرمين من أهل الذنوب مشفقين مما فيه\n ووجود العبد: ذَنْبٌ لا يقاس به ذنب\n فَنَصْبُ الموازين\n ومناقشةُ الحسابِ إنما هو لأهل الحجاب\n وأما العارفون الفانون عن أنفسهم\n الباقون بربهم\n لم يبق لهم ما يُحاسبون عليه إذ لا يشهدون لهم فعلاً\n ولا يرون لأحد قوة ولا حولا\n والله تعالى أعلم\n ولمّا كان سبب العذاب ووجود الحجاب هو التكبر على رب الأرباب\n ذكر وبالَهُ بإثر الحشر والحساب\n أو تقول: لمَّا ذكر قصة الرجلين ذكر قُبح صنيع من افتخر بنفسه\n وأنه شبيه بإبليس\n وكل من افتخر واستنكف عن الانتظام في سلك فقراء المؤمنين كان داخلاً في حزبه\n وقال الواحدي ثم الله تعالى نبيه أن يذكر لهؤلاء المتكبرين عن مجالسة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:47",
      "similarity": 0.622012210987567
    },
    {
      "verse": "78:29",
      "similarity": 0.18263082516302392
    },
    {
      "verse": "70:27",
      "similarity": 0.17925927804269423
    },
    {
      "verse": "14:34",
      "similarity": 0.17849829119249977
    },
    {
      "verse": "52:26",
      "similarity": 0.17710106053387764
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/18:49.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/18:49.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}