{
  "chapter": "الكهف",
  "text": "واحيط بثمره فاصبح يقلب كفيه على ما انفق فيها وهى خاوية على عروشها ويقول يليتنى لم اشرك بربى احدا",
  "translations": [
    {
      "translation": "The fruits of his labour were completely destroyed and he woke up wringing his hands in grief, rueing everything that he had spent on it. It was a ruin with all its trellises fallen in. He said, 'Oh, if only I had not associated anyone with my Lord!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his vines were overtaken (with disaster), and he began to wring his hands (at the loss) of what he had spent on them, for the vines had fallen upon their trellises; and he said: \"Would to God that I had not associated any one with my Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eventually all his produce was destroyed and he began to wring his hands in sorrow at the loss of what he had spent on it, and on seeing it fallen down upon its trellises, saying: \"Would I had not associated anyone with my Lord in His Divinity.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Sure enough the rich person's) fruits were all destroyed and he began to wring his hands in grief for all that he had invested in his garden. He found his garden tumbled to its trellises and said, \"Would that I had not considered anything equal to my Lord\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his fruits were surrounded – he therefore remained helplessly wringing his hands upon all that he had spent on it – and it lay fallen on its canopy – and he says, “If only I had not ascribed any partner to my Lord!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his fruits were encircled (with ruin). And began Yuqallibu his hands over what he had spent upon it, while it was all destroyed on its trellises, and he could only say: \"Would that I had ascribed no partners to my Lord!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his wealth was destroyed; so he began to wring his hands for what he had spent on it, while it lay, having fallen down upon its roofs, and he said: Ah me! would that I had not associated anyone with my Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his fruit was all encompassed, and in the morning he was wringing his hands for that he had expended upon it, and it was fallen down upon its trellises, and he was saying, 'Would I had not associated with my Lord any one!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his fruit was beset (with destruction). Then began he to wring his hands for all that he had spent upon it, when (now) it was all ruined on its trellises, and to say: Would that I had ascribed no partner to my Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it was, and all his fruit was destroyed. The vines had all fallen down on their trellises, and their owner wrung his hands, bewailing all that he had spent on his garden. He said, \"Would that I had not associated anyone with my Lord!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his property was encompassed; and lo! he was wringing the palms of his hands over that which he had expended thereon, while itlay fallen down on its trellises, and saying: Oh, would that had not associated with my Lord anyone:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ruin closed in on his produce, and he began to wring his hands for what he had spent on it, as it lay fallen on its trellises. He was saying, ‘I wish I had not ascribed any partner to my Lord.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his fruits (and enjoyment) were encompassed (with ruin), and he remained twisting and turning his hands over what he had spent on his property, which had (now) tumbled to pieces to its very foundations, and he could only say, \"Woe is me! Would I had never ascribed partners to my Lord and Cherisher!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his fruits were encircled (with ruin). And he remained clapping his hands with sorrow over what he had spent upon it, while it was all destroyed on its trellises, he could only say: \"Would I had ascribed no partners to my Lord!\" [Tafsir Ibn Kathir]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all his fruit were destroyed, and in the morning he wrung his hands with grief at all he had spent on it, for it had collapsed upon its trellises, and he said: 'Would that I had not associated anyone with my Lord'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ruin closed in on his crops, and so he began wringing his hands over what he had invested in it, as it lays fallen upon its trellises. And he was saying, “I wish I never associated anyone with my Lord.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his fruits were encompassed [by ruin], so he began to turn his hands about [in dismay] over what he had spent on it, while it had collapsed upon its trellises, and said, \"Oh, I wish I had not associated with my Lord anyone.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:42] And his fruit was beset, through the curbing measures mentioned above, [it was beset] together with his garden by destruction and were thus ruined, and so he began to wring his hands, out of regret and anguish, because of what he had spent on it, on the cultivation of his garden, as it lay fallen, [having] collapsed, on its trellises, those supporting the vines, so that [first] these collapsed and then the vine-grapes collapsed [after them], saying, ‘O (yā is for exclamation) I wish I had not ascribed any partner to my Lord!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And his fruit was beset (with destruction)) his garden was destroyed; or, according to another reading: his wealth was destroyed. (Then began he to wring his hands) out of regret (for all that he had spent upon it) upon the garden; it is also said that this means: upon all the fruits it contained, (when (now) it was all ruined on its trellises, and to say) on the Day of Judgement: (Would that I had ascribed no partner to my Lord!) would that I had ascribed no idols to my Lord!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَصْبَحَ يُقَلِّبُ كَفَّيْهِ عَلَى مَآ أَنْفَقَ } معناهُ أَصبحَ نادماً\n\n\n\n\nوقوله تعالى: { وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا } يعني خَالية خَراب وعُروشُها، بِيوتُها وأَبنيتُها\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {But he has become regretful} [means] that he became remorseful.\n\n\nAnd His saying, {And it is empty of [any] defects upon its [outer] edges}, means that it is free of corruption and its edges, its homes and its children.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفأعطى سبحانه المؤمن ما أمِله وأراده تفضلاً عليه وامتناناً له: { وَ } أرسل على بستان الكافر صواعقَ نازلةً من السماء كثيرة إلى حيث { أُحِيطَ بِثَمَرِهِ } وعمّت الإهلاك والاستئصال جميع ما فيها من الثمار\n فلم يبقَ الانتفاع بها أصلاً\n وذهب ماؤها وبهاؤها واضحملت نضارتها وصفاؤها { فَأَصْبَحَ } الكافر { يُقَلِّبُ كَفَّيْهِ } ظهراً لبطن تلهفاً وتأسفاً { عَلَى مَآ أَنْفَقَ فِيهَا } أي: في تعميرها وإنشائها من الأموال والعظام { وَهِيَ } أي: لجنة { خَاوِيَةٌ } ساقطةُ { عَلَىٰ عُرُوشِهَا } أي: عروشها على الأرض والكروم عليها محرقةُ جميعها { وَيَقُولُ } الكافر حينئذ بعدما أفاق عن سكر الغرور والغفلة\n وتفطن على منشأ الصدمة والصولة الإلهية نادماً متحسراً: { يٰلَيْتَنِي لَمْ أُشْرِكْ بِرَبِّي أَحَداً } [الكهف: 42] تعنتاً واستكباراً حتى لا يلحق عليّ ما لحقني من الوبال والنكال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأُحِيطَ بثَمَرِه } أي: هلكت أشجاره المثمرة، وأمواله المعهودة، وأصله: من إحاطة العدو، وهو عطف على مُقدر، كأنه قيل: فوقع بعض ما وقع من المحذور، وأهلكت أمواله، رُوي أن الله تعالى أرسل عليها نارًا فأحرقتها وغار ماؤها\n { فأصبح يُقلَّب كفَّيه } ظهرًا لبطن، أو يضرب يديه واحدة على أخرى، يصفق بهما، وهو كناية عن الندم، كأنه قال: فأصبح يندم { على ما أنفق فيها } أي: في عمارتها من الأموال\n وجعل تخصيص الندم بها دون ما هلك الآن من الجنة لأنه إنما يكون على الأفعال الاختيارية\n انظر أبا السعود\n { وهي } أي: الجنة { خاويةً }: ساقطة { على عُرُوشها } أي: دعائمها المصنوعة للكروم، فسقطت العروش أولاً ثم سقطت الكروم عليها\n وتخصيص حالها بالذكر، دون الزرع والنخل، إِمَّا لأنها العمدة وهما من متمماتها، وإِمَّا لأن ذكر هلاكها مُغْن عن ذكر هلاك الباقي لأنها حيث هلكت، وهي مشتدة بعروشها فهلاك ما عداها أولى، وإِمَا لأن الإنفاق في عمارتها أكثر\n { ويقولُ } أي: يقلب وهو يقول: { يا ليتني لم أشركْ بربي أحدًا } ، كأنه تذكر موعظة أخيه، وعَلِمَ أنه إنما أُتِيَ من قِبَلِ شِرْكِهِ، فتمنى أنْ لم يكن مشركًا فلم يصبه ما أصابه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:52",
      "similarity": 0.5328801216337189
    },
    {
      "verse": "33:66",
      "similarity": 0.2556592200413189
    },
    {
      "verse": "36:26",
      "similarity": 0.24155428577430746
    },
    {
      "verse": "69:27",
      "similarity": 0.2392558941546338
    },
    {
      "verse": "89:24",
      "similarity": 0.23779536267603557
    }
  ]
}