{
  "chapter": "الكهف",
  "text": "وعرضوا۟ على ربك صفا لقد جئتمونا كما خلقنكم اول مرةۭ بل زعمتم الن نجعل لكم موعدا",
  "translations": [
    {
      "translation": "they will be paraded before your Lord in ranks: 'You have come to Us just as We created you at first. Yes indeed! Even though you claimed that We would not fix a time with you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be arraigned before their Lord row on row, (and He will say): \"Well, you have come to Us as We had first created you, even though you imagined We had fixed no time for this meeting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall be brought before your Lord, all lined up, and shall be told: \"Now, indeed, you have come before Us in the manner We created you in the first instance, although you thought that We shall not appoint a tryst (with Us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will all be lined up in the presence of your Lord who will tell them, \"Despite your belief that there would never be a Day of Judgment, all of you are brought in Our presence just as though We had created you for the first time. You believed that our promise could never come true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And everyone shall be presented before your Lord in rows; “Indeed you have come to Us exactly as We had created you for the first time – in fact you thought that We shall never appoint a promised time for you!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will be set before your Lord, aligned. (He will say:) \"Now indeed, you have come to Us as We created you the first time. Nay, but you thought that We had appointed no meeting for you (with Us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall be brought before your Lord, standing in ranks: Now certainly you have come to Us as We created you at first. Nay, you thought that We had not appointed to you a time of the fulfillment of the promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they shall be presented before their Lord in ranks -- 'You have come to Us, as We created you upon the first time; nay, you asserted We should not appoint for you a tryst.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they are set before thy Lord in ranks (and it is said unto them): Now verily have ye come unto Us as We created you at the first. But ye thought that We had set no tryst for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be ranged before your Lord, standing in rows and He will say to them, \"Now you have come to Us as We created you at first. But you supposed that We would not appoint the time for the fulfillment of Our promise to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall be sent before thy lord in ranks! now are ye come to Us even as We had created you the first time; aye ye fancied that We had appointed for you no tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be presented before your Lord in ranks: ‘Certainly you have come to Us just as We created you the first time. But you maintained that We shall not appoint a tryst for you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will be marshalled before thy Lord in ranks, (with the announcement), \"Now have ye come to Us (bare) as We created you first: aye, ye thought We shall not fulfil the appointment made to you to meet (Us)!\":\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will be set before your Lord in (lines as) rows, (and Allah will say): \"Now indeed, you have come to Us as We created you the first time. Nay, but you thought that We had appointed no meeting for you (with Us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they shall be presented in ranks before your Lord (who will say to them:) 'You have returned to Us as We created you the first time. No, you claimed We would not appoint a meeting for you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be presented before your Lord in a row. “You have come to Us as We created you the first time. Although you claimed We would not set a meeting for you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will be presented before your Lord in rows, [and He will say], \"You have certainly come to Us just as We created you the first time. But you claimed that We would never make for you an appointment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:48] And they shall be presented before your Lord in ranks (saffan is a circumstantial qualifier) in other words, ranged so that every community is in a row [on its own], and it shall be said to them: ‘Verily you have come to Us just as We created you the first time, that is to say, individually, barefoot, naked and uncircumcised; and it shall be said to the deniers of the Resurrection: rather you claimed that (a [of allan] is an, softened in place of the hardened one, in other words [it is to be understood as] annahu) We would not appoint for you a tryst’, for resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they are set before thy Lord) they were led before your Lord (in ranks) all together, and Allah says to them: (Now verily have ye come unto Us as We created you at the first) without wealth or children. (But you thought) you said in the life of the world (that We had set no tryst for you) that We had set no appointed term for the Resurrection.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما جمعوا واجتمعوا في المحشر جميعاً { عُرِضُواْ عَلَىٰ رَبِّكَ } يا أكمل الرسل عرضَ العسكر على السلطان الصوري { صَفَّاً } صافين مصفَّفين على الاستواء؛ بحيث لا يحجب أحدٌ أحداً، بل كل واحد في مرأى منه سبحانه بلا سترةٍ وحجابٍ، ثم يقال لهم من قِبل الحق على سبيل الاستيلاء والسطوة، وإظهار الهيبة والسلطنة القاهرة الغالبة: { لَّقَدْ جِئْتُمُونَا } اليوم حفاةً عراةً { كَمَا خَلَقْنَاكُمْ أَوَّلَ مَرَّةٍ } كذلك؛ أي: في بدء وجودكم وظهوركم { بَلْ } كنتم { زَعَمْتُمْ } وظننتم فيما مضى من شدة بطركم وغفلتكم { أَلَّن نَّجْعَلَ لَكُمْ مَّوْعِداً } [الكهف: 48] أي: لن نقدر على أنجاز ما وعدناكم بألسنة رسلنا من البعث والحشر والعرض والجزاء، بل كذَّبتم الرسلَ وأنكرتم الوعدَ والموعودَ جميعاً، فالآن ظهر الحق الذي كنتم تمترون فيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وعُرِضُوا على ربك } ، شبهت حالتهم بحال جُنْدٍ عُرِضَ على السلطان، ليأمر فيهم بما يأمر\n وفي الالتفات إلى الغيبة، وبناء الفعل للمفعول، مع التعرض لعنوان الربوبية، والإضافة إلى ضميره - عليه الصلاة والسلام - من تربية المهابة، والجري على سَنَن الكبراء، وإظهار اللطف به صلى الله عليه وسلم - ما لا يخفى\n قاله أبو السعود\n { صَفًّا } أي: مصْطَفِّينَ غير متفرقين ولا مختلطين، كل أمة صَفٌّ، وفي الحديث الصحيح:\n\n \" يَجْمَعُ اللهُ الأولين والآخرين في صَعِيدٍ واحِد، صفوفًا، يُسْمِعُهُمُ الدَّاعِيِ وَيَنْفُذُهُم البَصَرُ\n\n\n \" \n\nالحديث بطوله\n وفي حديث آخر:\n\n \" أهل الجنة، يوم القيامة، مائة وعشرون صفًا، أنتم منها ثمانون صفًا \"\n \n\nيقال لهم - أي: للكفرة منهم: { لقد جئتمونا كما خلقناكم أولَ مرة } ، وتركتم ما خولناكم وما أعطيناكم من الأموال وراء ظهوركم\n أو: حفاة عراة غُرْلاً، كما في الحديث\n وهذه المخاطبة، بهذا التقريع، إنما هي للكفار المنكرين للبعث، وأما المؤمنون المُقِرون بالبعث فلا تتوجه إليهم هذه المخاطبة، ويدل عليه ما بعده من قوله: { بل زعمتم أن لن نجعل لكم موعدًا } أي: زعمتم في الدنيا أنه، أي: الأمر والشأن، لن نجعل لكم وقتًا يَتَنَجَّزُ فيه ما وعدته من البعث وما يتبعه\n\n\nوهو إضراب وانتقال من كلام، إلى كلام، كلاهما للتوبيخ والتقريع\n { ووضع الكتاب } أي: كتاب كل أحد، إما في يمينه أو شماله، وهو عطف على: { عُرِضوا } ، داخلٌ تحت الأمور الهائلة التي أريد بذكرها تذكير وقتها، وأورد فيه ما أورد في أمثاله من صيغة الماضي لتحقق وقوعه، وإيثار الإفراد للاكتفاء بالجنس، والمراد: صحائف أعمال العباد\n ووضعها إما في أيدي أصحابها يمينًا وشمالاً، أو في الميزان",
      "translations": []
    }
  ]
}