{
  "chapter": "الكهف",
  "text": "ويوم نسير الجبال وترى الارض بارزة وحشرنهم فلم نغادر منهم احدا",
  "translations": [
    {
      "translation": "The day We shall move the mountains, and you see the earth an open plain, We shall gather them together, leaving none behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear in mind the Day when We shall set the mountains in motion and you will find the earth void and bare. On that Day We shall muster all men together, leaving none of them behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We will cause the mountains to travel around and the earth to turn into a levelled plain, We will also bring all human beings together. No one will be left behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day when We move the hills and you see the earth flattened plain, and We shall raise all of them together – so not leaving out any one of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day We shall cause the mountains to pass away, and you will see the earth as a levelled plain, and We shall gather them so that We will leave not one of them behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day on which We will cause the mountains to pass away and you will see the earth a levelled plain and We will gather them and leave not any one of them behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day We shall set the mountains in motion, and thou seest the earth coming forth, and We muster them so that We leave not so much as one of them behind;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (bethink you of) the Day when we remove the hills and ye see the earth emerging, and We gather them together so as to leave not one of them behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day We shall make the mountains move and you will see the earth laid bare, and We shall gather all mankind together and shall not leave any one of them behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beware a Day whereon we will make the mountains to pass, and thou wilt see the earth away plain, and We shall gather them, and We shall leave of them not one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We shall set the mountains moving and you will see the earth in full view, We shall muster them, and We will not leave out anyone of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One Day We shall remove the mountains, and thou wilt see the earth as a level stretch, and We shall gather them, all together, nor shall We leave out any one of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day We shall cause the mountains to pass away (like clouds of dust), and you will see the earth as a levelled plain, and we shall gather them all together so as to leave not one of them behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when We shall set the mountains in motion and you shall see the earth a leveled plain; when We gather them together, and would not leave even one behind,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We set the mountains in motion; and you see the earth emerging; and We gather them together, and leave none of them behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [warn of] the Day when We will remove the mountains and you will see the earth prominent, and We will gather them and not leave behind from them anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:47] And, mention, the day when the mountains shall be set in motion — they shall be removed from the face of the earth and become ‘[as] scattered dust’ [Q. 56:6] (a variant reading [for tusayyaru’l-jibālu] has nusayyiru’l-jibāla, ‘We shall set the mountains in motion’) and you will see the earth exposed, manifest [in full view], with no mountain or anything else on top of it. And We shall gather them, believers and disbelievers, such that We will not leave out anyone of them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (bethink you of) the Day when We remove the hills) from the face of the earth (and ye see the earth emerging) from beneath mountains, (and We gather them) for the Resurrection (together so as to leave not one of them behind).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَرَى ٱلأَرْضَ بَارِزَةً } يعني ظاهرةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أذكر يا أكمل الرسل للناسين عهودَ الله ومواثيقَه { يَوْمَ نُسَيِّرُ ٱلْجِبَالَ } وتحركها بالقدرة الكاملة والسطوة الهائلة، ونفتت أجزاءها، وتحلل تراكيبها، ونشتتها إلى أن صارت دكّاً { وَتَرَى } أيها الرائي { ٱلأَرْضَ } المملوءة بالجبال الرواسي الحاجبة عما وراءها { بَارِزَةً } ظاهرةً ملساءَ مسوى لا ارتفاعَ لبعض أجزائها على بعضٍ، مظهرةً لما فيها من الأجساد المدفونة { وَ } بعد ظهورهم منها، وبروز الأجداث والأجساد عليها { حَشَرْنَاهُمْ } وجمعناهم بأجمعهم حفاةً عراةً إلى الموقف والموعد المعدّ للعرض والجزاء { فَلَمْ نُغَادِرْ } ولم نترك { مِنْهُمْ أَحَداً } [الكهف: 47] لا نسوقه إلى المحشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ويوم }: معمول لمحذوف، أي: واذكر، أو عطف على قوله: \" عند ربك \" ، أي: والباقيات الصالحات خير عند ربك ويوم القيامة، و { حشرناهم }: عطف على { نُسيّر } للدلالة على تحقق الحشر المتفرع على البعث الذي ينكره المشركون، وعليه يدور أمر الجزاء، وكذا الكلام فيما عطف عليه، منفيًا وموجبًا، وقيل: هو للدلالة على أن حشرهم قبل التسيير والبروز ليعاينوا تلك الأهوال، كأنه قيل: وحشرناهم قبل ذلك\n و { نغادر }: نترك، يقال: غادره وأغدره: إذا تركه، ومنه: الغدير لما يتركه السيل في الأرض من الماء، و { صفًّا }: حال، أي: مصْطفين\n  يقول الحقّ جلّ جلاله: { و } اذكر { يوم نُسيِّرُ الجبالَ } أي: حين نقلعها من أماكنها ونسيرها في الجو، على هيئتها، كما ينبئ عنه قوله تعالى:\n\n[النمل: 88] أو: نسير أجزاءها بعد أن نجعلها هباء منثورًا، والمراد من ذكره: تحذير الغافلين مما فيه من الأهوال، وقرئ: \" تُسَيَّر \" بالبناء للمفعول جريًا على سَنَن الكبرياء، وإيذانًا بالاستغناء عن الإسناد إلى الفاعل لظهور تعينه، ثم قال: { وترى الأرضَ } أي: جميع جوانبها، والخطاب للرسول صلى الله عليه وسلم، أو لكل من يسمع، { بارزةً }: ظاهرة، ليس عليها جبل ولا غيره\n بل تكون\n\n[طه: 106، 107]\n { وحشرناهم }: جمعناهم إلى الموقف من كل حدب، مؤمنين وكافرين، { فلم نُغادرْ } أي: لم نترك { منهم أحدًا }",
      "translations": []
    }
  ]
}