{
  "chapter": "الكهف",
  "text": "واضرب لهم مثل الحيوة الدنيا كماء انزلنه من السماء فاختلط به نبات الارض فاصبح هشيما تذروه الريح وكان الله على كل شىء مقتدرا",
  "translations": [
    {
      "translation": "Make a metaphor for them of the life of this world. It is like water which We send down from the sky and the plants of the earth combine with it but then become dry chaff scattered by the winds. Allah has absolute power over everything.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Present to them the example of the life of this world so like the water We send down from the skies that mingles with the earth to nourish its vegetation, which then on the morrow turns to stubble and is blown away by the wind. God has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), propound to them the parable of the present life: it is like the vegetation of the earth which flourished luxuriantly when it mingled with the water that We sent down from the sky, but after that the same vegetation turned into stubble which the winds blew about. Allah alone has the power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"The worldly life resembles the (seasonal) plants that blossom by the help of the water which God sends from the sky. After a short time all of them fade away and the winds scatter them (and turns them into dust). God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And relate to them the example of the life of this world – like water which We sent down from the sky, therefore vegetation of the earth grew forth in abundance with it to become dry hay which the winds scatter; and Allah is the Controller of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention the parable of the worldly life: it is like the water which We send down from the sky, and the vegetation of the earth mingles with it, and becomes fresh and green. But (later) it becomes dry and broken pieces, which the winds scatter. And Allah is able to do everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And set forth to them parable of the life of this world: like water which We send down from the cloud so the herbage of the earth becomes tangled on account of it, then it becomes dry broken into pieces which the winds scatter; and Allah is the holder of power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strike for them the similitude of the present life: it is as water that We send down out of heaven, and the plants of the earth mingle with it; and in the morning it is straw the winds scatter; and God is omnipotent over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And coin for them the similitude of the life of the world as water which We send down from the sky, and the vegetation of the earth mingleth with it and then becometh dry twigs that the winds scatter. Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give them an example about worldly life. It is like the vegetation of the earth that thrives when watered by the rain, which We send down from the sky, and then it all becomes stubble which the wind blows away. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And propound thou unto them the similitude of the life of the World. It is as water which We send down from the heaven, then there mingleth therewith the vegetation of the earth, and lo! it becometh dry stubble which the winds scatter and Allah is over everything potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Draw for them the parable of the life of this world: [It is] like the water We send down from the sky. Then the earth’s vegetation mingles with it. Then it becomes chaff, scattered by the wind. And Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Set forth to them the similitude of the life of this world: It is like the rain which we send down from the skies: the earth's vegetation absorbs it, but soon it becomes dry stubble, which the winds do scatter: it is (only) Allah who prevails over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put forward to them the example of the life of this world, it is like the water (rain) which We send down from the sky, and the vegetation of the earth mingles with it, and becomes fresh and green. But (later) it becomes dry and broken pieces, which the winds scatter. And Allah is Able to do everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give to them a parable about this present life. It is like water We have sent down from the sky with which the plants of the earth mingle, and in the morning it is straw the wind scatters. Allah is Powerful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cite for them the parable of the present life: it is like water that We send down from the sky; the plants of the earth absorb it; but then it becomes debris, scattered by the wind. God has absolute power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And present to them the example of the life of this world, [its being] like rain which We send down from the sky, and the vegetation of the earth mingles with it and [then] it becomes dry remnants, scattered by the winds. And Allah is ever, over all things, Perfect in Ability.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:45] And strike, draw, for them, your people, the similitude of the life of this world (mathala’l-hayāti’l-dunyā constitutes the first direct object) as water (ka-mā’in, the second direct object) which We send down out from the heaven, and the vegetation of the earth mingles with it, [the vegetation] multiplies by the sending down of the water; or it is that the water mixes with the vegetation such that it is nourished and flourishes; and it then becomes, the vegetation becomes, chaff, dried up, its [various] parts [broken up] in fragments, scattered, strewn and dispersed, by the winds, which then blow it away. The import is: [the life of] this world is likened to flourishing vegetation which then becomes dry, is broken up and scattered by the winds (a variant reading [for riyāh, ‘winds’] has rīh). And God is Omnipotent, Powerful, over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "317 (And coin for them) explain to the people of Mecca (the similitude of the life of the world) in its permanence and evanescence (as water) as rain (which We send down from the sky, and the vegetation of the earth mingleth with it) the water mixes with the vegetation of the earth (and then becometh dry twigs that the winds scatter) such that nothing remains of it. Likewise, the life of this world will vanish and nothing of its adornment will remain. (Allah is Able to do all things) He is Able to make the life of this world vanish and the Hereafter subsist.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَصْبَحَ هَشِيماً تَذْرُوهُ ٱلرِّياحُ } معناه يَابسٌ مُتفتِتٌ تُطيرهُ الرِّياحُ وتُفرقَهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"So he became a thing despised, to be cast off by the winds,\" means that he became worthless, to be blown away by the winds and scattered.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱضْرِبْ لَهُم } أي: اذكر يا أكمل الرسل للمائلين إلى الدنيا ومزخرفاتها ومستلذاتها الفانية الغير قارة\n المستتبعة لأنواع الآثام والعصيان\n المستلزمة لغضب الله وسخطه ومثّل لهم { مَّثَلَ ٱلْحَيَاةِ ٱلدُّنْيَا } وانقضائها وفنائها سريعاً { كَمَآءٍ } أي: مثله مثل ماء { أَنْزَلْنَاهُ مِنَ } جانب { ٱلسَّمَاءِ } إظهاراً لكمال قدرتنا وعجائب صنعتنا وبدائع حكمتنا { فَٱخْتَلَطَ بِهِ } أي: تكاثف وغلظ بسببه { نَبَاتُ ٱلأَرْضِ } وصار في كمال الطراوة والنضارة والحسن والبهاء إلى حيث يعجب منها أبصار أولي الألباب والاعتبار\n ثم يبس من حر الشمس وبرد الهواء { فَأَصْبَحَ هَشِيماً } مهشوماً متفرق الأوراق متفتتَ الأجزاء إلى حيث { تَذْرُوهُ } أي: تثيره وتطيره { ٱلرِّياحُ } كيف يشاء { وَكَانَ ٱللَّهُ } القادر المقتدر بالقدرة الكاملة التامة { عَلَىٰ كُلِّ شَيْءٍ } من قدوراته ومراداته { مُّقْتَدِراً } [الكهف: 43] كاملاً\n بحيث لا تنتهي قدرته لدى المراد\n بل له التصرف فيه على ما شاء الله لا حول ولا قوة إلا بالله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كماءٍ }: خبر عن مضمر\n أي: هي كماء\n ويجوز أن يكون مفعولاً ثانيًا لاضْربْ\n على أنه بمعنى \" صيِّر \"\n يقول الحقّ جلّ جلاله: { واضربْ لهم مَثَل الحياة الدنيا } أي: واذكر لهم ما يشبهها في زهرتها ونضارتها\n وسرعة انقراضها وفنائها لئلا يطمئنوا إليها ويغفُلوا عن الآخرة\n هي { كماءٍ أنزلناه من السماء } وهو المطر\n { فاختلط به } أي: بسببه { نباتُ الأرض } بحيث التف وخالط بعضُه بعضًا من كثرته وتكاثفه\n ثم مرت مدة قليلة { فأصبح هشيمًا } أي: مهشومًا مكسورًا\n { تذروه الرياحُ } أي: تُفرقه وتطيره\n كأن لم يَغْنَ بالأمس\n { وكان الله على كل شيء مقتدرًا }: قادرًا\n ومن جملة الأشياء: الإفناء والإنشاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:1",
      "similarity": 0.5441956485377091
    },
    {
      "verse": "54:31",
      "similarity": 0.41488232766063543
    },
    {
      "verse": "10:24",
      "similarity": 0.20787050595729994
    },
    {
      "verse": "9:102",
      "similarity": 0.2070569163367166
    },
    {
      "verse": "2:220",
      "similarity": 0.19385483142804008
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/018045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/018045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}