{
  "chapter": "الكهف",
  "text": "وربك الغفور ذو الرحمة لو يؤاخذهم بما كسبوا۟ لعجل لهم العذاب بل لهم موعد لن يجدوا۟ من دونه موئلا",
  "translations": [
    {
      "translation": "But your Lord is forgiving, full of benevolence. If He had pleased to punish them for their doings He would have punished them immediately. But a term is fixed for them from which they will find no escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is All-Forgiving, full of mercy. Had He wished to take them to task for their doings, He would have hastened in sending His scourge upon them. But He has set for them a time-limit which they cannot evade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is All-forgiving and All-merciful. Had He wanted to punish them for their sins, He would have been prompt to torment them. For their punishment there is an appointed time, after which there will be no way for them to escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is the Oft Forgiver, the Merciful; if He seized them for their deeds, He would soon send the punishment upon them; but for them is an appointed time from which they will not find any refuge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is Most Forgiving, Owner of mercy. Were He to call them to account for what they have earned, then surely, He would have hastened their punishment. But they have their appointed time, beyond which they will find no escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is Forgiving, the Lord of Mercy; were He to punish them for what they earn, He would certainly have hastened the chastisement for them; but for them there is an appointed time from which they shall not find a refuge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But thy Lord is the All-forgiving, full of mercy. If He should take them to task for that they have earned, He would hasten for them the chastisement; but they have a tryst, from which they will find no escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord is the Forgiver, Full of Mercy. If He took them to task (now) for what they earn, He would hasten on the doom for them; but theirs is an appointed term from which they will find no escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is the Forgiving One, the possessor of mercy. If He had to take them to task for the wrongs they have done, He would have hastened their punishment. They have an appointed time beyond which there will be no escape for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord is the Forgiver, Owner of mercy. Were He to call them to account for that which they have earned; He would have hastened for them torment; but for them is a tryst beside which they cannot find a place to betake themselves to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is the All-forgiving dispenser of mercy. Were He to take them to task because of what they have committed, He would have surely hastened their punishment. But they have a tryst, [when] they will not find a refuge besides Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But your Lord is Most forgiving, full of Mercy. If He were to call them (at once) to account for what they have earned, then surely He would have hastened their punishment: but they have their appointed time, beyond which they will find no refuge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is Most Forgiving, Owner of Mercy. Were He to call them to account for what they have earned, then surely, He would have hastened their punishment. But they have their appointed time, beyond which they will find no escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is Forgiving, Owner of Mercy. Had it been His will to take them to task for what they earned, He would have hastened their punishment; but they have an appointed hour from which they will never escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is the Forgiver, Possessor of Mercy. Were He to call them to account for what they have earned, He would have hastened the punishment for them. But they have an appointment from which they will find no escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is the Forgiving, full of mercy. If He were to impose blame upon them for what they earned, He would have hastened for them the punishment. Rather, for them is an appointment from which they will never find an escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:58] And your Lord is the Forgiver, Full of Mercy. Were He to take them to task, in this world, for what they have earned, He would have hastened for them the chastisement, therein; but they have a tryst, which is the Day of Resurrection, from which they will not find any escape, any refuge.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thy Lord is the Forgiver, Full of Mercy) in that He defers His chastisement. (If He took them to task (now) for what they earn) for their idolatry, (He would hasten on the doom for them) in this worldly life; (but theirs is an appointed term) for their destruction (from which) from Allah's chastisement (they will find no escape) they will find no refuge. 319\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَّن يَجِدُواْ مِن دُونِهِ مَوْئِلاً } يعني مَلجأً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوتكذيبهم الرسل والكتب، وإصرارُهم على الكفر والشرك، وإن كان يستدعي نزول العذاب عليهم فجأةً لاستخفافهم بنزوهل إلا أنه يمهلهم { وَرَبُّكَ ٱلْغَفُورُ } المبالغ في ستر ذنوب عباده وعيوبهم؛ لأنه { ذُو ٱلرَّحْمَةِ } الوسعة والحكمة الكاملة لعلهم يتنبهوا بقبح صنيعهم، ويتأملوا في وخامة عواقبهم، فانصرفوا عما هم عليه نادمين؛ إذ { لَوْ يُؤَاخِذُهُم بِمَا كَسَبُواْ لَعَجَّلَ لَهُمُ ٱلْعَذَابَ } على الفور، لكنْ أمهلهم بمقتضى رحمته وحكمته زماناً لا دواماً رجاء أن يتوبوا، ويرجعوا حوه تائبين آيبين { بَل لَّهُم } أي: بل لهلاكهم { مَّوْعِدٌ } لا نفع فيه التلافي والتوبة، وهو يوم الحشر والجزء، وقيل: يوم بدر { لَّن يَجِدُواْ مِن دُونِهِ مَوْئِلاً } [الكهف: 58] منجيّ ومَخْلصاً بل يُعذبون ويُهلكون فيه حتماً، بحيث لا يسع لهم التقدم والتأخر أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وربُّك الغفور }: البليغ المغفرة { ذو الرحمة } الموصوف بها، { لو يُؤاخذهم بما كسبوا } من المعاصي، التي من جملتها: ما حكي عنهم من مجادلتهم بالباطل، وإعراضهم عن آيات ربهم، وعدم مبالاتهم بما اجترحوا من الموبقات، { لعجَّلَ لهم العذابَ } قبل يوم القيامة لاستجلاب أعمالهم لذلك، والمراد: إمهال قريش، مع إفراطهم في عداوة رسول الله صلى الله عليه وسلم، { بل لهم موعدٌ } وهو يوم القيامة، أو يوم بدر، والمعطوف عليه ببل: محذوف، أي: لكنهم ليسوا بمؤاخذين، { بل لهم موعدٌ لن يجدوا من دونه موئلاً } أي: ملجأ يلتجئون إليه، أو مَنْجىً ينجون به، يقال: وأَلَ: أي: نجا، ووأل إليه: أي: التجأ إليه",
      "translations": []
    }
  ]
}