{
  "chapter": "الكهف",
  "text": "ما لهم به من علم ولا لءابائهم كبرت كلمة تخرج من افوههم ان يقولون الا كذبا",
  "translations": [
    {
      "translation": "They have no knowledge of this, neither they nor their fathers. It is a monstrous utterance which has issued from their mouths. What they say is nothing but a lie.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no knowledge of this, as their fathers did not have. How terrible are the words they utter! They speak nothing but lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a thing about which they have no knowledge, neither they nor their ancestors. Dreadful is the word that comes out of their mouths. What they utter is merely a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither they nor their fathers had any knowledge of such utterance (that God has begotten a son). Whatever they say about (this matter) is vicious blasphemy and plain lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not have any knowledge of it – nor did their forefathers; profound is the word that comes out of their mouths; they only speak a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No knowledge have they of such a thing, nor had their fathers. Mighty is the word that comes out of their mouths. They utter nothing but a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no knowledge of it, nor had their fathers; a grievous word it is that comes out of their mouths; they speak nothing but a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they have no knowledge of it, they nor their fathers; a monstrous word it is, issuing out of their mouths; they say nothing but a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(A thing) whereof they have no knowledge, nor (had) their fathers, Dreadful is the word that cometh out of their mouths. They speak naught but a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no knowledge of this, nor did their forefathers have any either. What they say is monstrous: they are merely uttering falsehoods!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No knowledge thereof have they, nor had their fathers. Odious is the word that cometh out of their mouths; they say not but a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not have any knowledge of that, nor did their fathers. Monstrous is the utterance that comes out of their mouths, and they say nothing but a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No knowledge have they of such a thing, nor had their fathers. It is a grievous thing that issues from their mouths as a saying what they say is nothing but falsehood!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No knowledge have they of such a thing, nor had their fathers. Mighty is the word that comes out of their mouths [i.e. He begot (took) sons and daughters]. They utter nothing but a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": ". Surely, of this they have no knowledge, neither they nor their fathers; it is a monstrous word that comes from their mouths, they say nothing but a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no knowledge of this, nor did their forefathers. Grave is the word that comes out of their mouths. They say nothing but a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no knowledge of it, nor had their fathers. Grave is the word that comes out of their mouths; they speak not except a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:5] They do not have, in this, in this saying, any knowledge, nor did their fathers, before them, who [also] used to say this. Dreadful, grave, is the word that comes out of their mouths (kalimatan, ‘word’, is for specification and it explains the unidentified [feminine] person [of the verb, kaburat, ‘dreadful’]; and that which is the object of censure has been omitted, and that is their above-mentioned saying [that God has taken a son]). They speak nothing, thereby, but, an utterance of, lies.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "312 ((A thing) whereof they have no knowledge) they have no proof or argument for what they claim, (nor (had) their fathers) nor did their fathers have any knowledge. (Dreadful is the word) dreadful is the word of idolatry (that cometh out of their mouths) that is uttered by their mouth. (They speak naught but a lie) about Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فلم يكن ثم سوّاه شيء غيره فضلاً عن الشبيه والولد كما قال أحدهم:  هذا الوجود وإن تكثّر ظاهراً وحياتكم ما فيه إلا أنتم { إن يقولون إلاّ كذباً } لتطابق الدليل العقلي والوجدان الذوقي الشهوديّ على إحالته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nمع أنه { مَّا لَهُمْ بِهِ } بالله باتخاذه ولداً { مِنْ عِلْمٍ } يقينٍ أو ظنٍ متعلقٍ به وبمعناه\n وبما يترتب عليه من النقص المنافي لوجوب الوجود\n إذ اتخاذه إنما هو للإخلاف والمظاهرة والتزيين\n وكلاهما محالان على الله لا يليقان بجنابه\n تعالى عما يقول الظالمون علواً كبيراً { وَلاَ لآبَائِهِمْ } يعني: وإن ادعوا في إثبات الولد لله تقليد الآباء والأسلاف\n فليس لهم أيضاً علمُ بنقصه وعدم لياقته بجناب الحق المنزل المقدس في ذاته عن أمارات النقصان وعلامات الإمكان\n\n\nوبالجملة: { كَبُرَتْ } أي: جلَّت وعظُمت في الكفر وسوء الأدب مع الله { كَلِمَةً } أي: مقالتهم هذه مع أنها { تَخْرُجُ مِنْ أَفْوَاهِهِمْ } هفوةً بلا علم وتأملٍ\n بل { إِن يَقُولُونَ } أي: ما يقولون ويقصدون بقولهم هذا { إِلاَّ كَذِباً } [الكهف: 5] وافتراء يفترونه على الله\n وينسبونه إلى كتابهم ظلماً وزوراً\n\nوبعدما كان حالهم في الافتراء والمراء على هذا المنوال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما لهم به من عِلْمٍ } أي: ما لهم باتخاذه الولد شيء من علم أصلاً لضلالهم وإضلالهم\n { ولا لآبائهم } الذين قلدوهم\n فتاهوا جميعًا في تيه الجهالة والضلالة\n أو: ما لهم علم بما قالوا\n أصواب أم خطأ\n بل إنما قالوه رميًا بقولٍ عن عمى وجهالة\n من غير فكر ولا روية\n كقوله تعالى:\n[الأنعَام: 100]\n أو: ما لهم علم بحقيقة ما قالوا\n وبعِظَم رتبته في الشناعة\n كقوله تعالى:\n[مريَم: 88-90]\n وهو الأنسب لقوله: { كَبُرتْ كلمةٌ } أي: عظمت مقالتهم هذه في الكفر والافتراء لما فيها من نسبته سبحانه إلى ما لا يكاد يليق بجناب كبريائه لما فيه من التشبيه والتشريك\n وإيهام احتياجه تعالى إلى ولد يُعينه ويخلفه\n فما أقبحها مقالة { تخرج من أفواههم } أي: يتفوهون بها من غير حقيقة ولا تحقيق لمعناها\n { إن يقولون إِلا كذبًا }: ما يقولون في ذلك إلا قولاً كذبًا\n لا يكاد يدخل فيه إمكان الصدق أصلاً\n الإشارة: من كملت عبوديته لله\n وصار حُرًّا مما سواه\n بحيث تحرر من رق الأكوان\n وأفضى إلى مقام الشهود والعيان\n أنزل الله على قلبه علم التحقيق\n وسلك به منهاج أهل التوفيق\n منهاجًا قيمًا\n لا إفراط فيه ولا تفريط\n محفوظًا في باطنه من الزيغ والإلحاد\n وفي ظاهره من الفساد والعناد\n قد تولى الله أمره وأخذه عنه\n فهو على بينة من ربه فيما يأخذ ويذر\n فإن أَذِنَ له في التذكير وقع في مسامع الخلق عبارتُه\n وجليت إليهم إشارته\n فبَشَّر وأنذر\n ورغّب وحذّر\n يُبشر أهل التوحيد والتنزيه بنعيم الجنان\n وبالنظر إلى وجه الرحمن\n ويُنذر أهل الشرك بعذاب النيران\n وبالذل والهوان\n نعوذ بالله من موارد الفتن\n ولما كانت قريش تتفوه بشيء من هذه الكلمات التي شنع الله على من تفوه بها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:15",
      "similarity": 0.4867667005843241
    },
    {
      "verse": "36:65",
      "similarity": 0.4672394174796711
    },
    {
      "verse": "13:14",
      "similarity": 0.3979106165435955
    },
    {
      "verse": "14:9",
      "similarity": 0.36952064535727963
    },
    {
      "verse": "3:167",
      "similarity": 0.34911034061673457
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/18:5.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/18:5.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}