{
  "chapter": "الكهف",
  "text": "ما اشهدتهم خلق السموت والارض ولا خلق انفسهم وما كنت متخذ المضلين عضدا",
  "translations": [
    {
      "translation": "I did not make them witnesses of the creation of the heavens and the earth nor of their own creation. I would not take as assistants those who lead astray!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not call them to witness the creation of the heavens and the earth, nor their own creation. I would not take as helpers those who lead (men) astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not call them to witness the creation of the heavens and the earth, nor in their own creation. I do not seek the aid of those who lead people astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not call (the unjust) to witness the creation of the heavens and earth nor to witness their own creation nor did I want to be helped by those who lead people astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither did I make them witness the creations of the heavens and the earth, nor witness their own creation; nor does it befit My Majesty to choose misleaders as aides.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not witness the creation of the heavens and the earth nor their own creation, nor did I take those who mislead as `Adudan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not make them witnesses of the creation of the heavens and the earth, nor of the creation of their own souls; nor could I take those who lead (others) astray for aiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I made them not witnesses of the creation of the heavens and earth, neither of the creation of themselves; I would not ever take those who lead others astray to be My supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I made them not to witness the creation of the heavens and the earth, nor their own creation; nor choose I misleaders for (My) helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not call them to witness at the creation of the heavens and the earth, nor at their own creation; I do not take as My helpers those who lead others astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I Made them not present at the creation of the heavens and the earth nor at the creation of themselves; nor was I one to take the seducers as supporters;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not make them witness to the creation of the heavens and the earth, nor to their own creation, nor do I take those who mislead others as assistants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I called them not to witness the creation of the heavens and the earth, nor (even) their own creation: nor is it for helpers such as Me to take as lead (men) astray!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I (Allah) made them (Iblis and his offspring) not to witness (nor took their help in) the creation of the heavens and the earth and not (even) their own creation, nor was I (Allah) to take the misleaders as helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither did I make them witnesses at the creation of the heavens and the earth, nor at their own creation. I would never take those who lead others astray to be My supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not call them to witness the creation of the heavens and the earth, nor their own creation; and I do not take the misleaders for assistants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not make them witness to the creation of the heavens and the earth or to the creation of themselves, and I would not have taken the misguiders as assistants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:51] I did not make them a witness, that is, Iblīs and his offspring, to the creation of the heavens and the earth, nor to their own creation, that is to say, I did not make any of them present at the [moment of the] creation of the other. Nor do I take misleaders, devils, as [My] support, as assistants in [the process of] creation, so why do you obey them?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(I made them not) i.e. the angels and the satans (to witness the creation of the heavens and the earth) when I created them, (nor their own creation) when I created them; it is also said that this means: I did not seek the help of angels and satans to create the heavens and the earth or to create them; (nor choose I 318 misleaders) the disbelievers, the Jews, Christians and idol worshippers (for (My) helpers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا كُنتُ مُتَّخِذَ ٱلْمُضِلِّينَ عَضُداً } يعني أنصاراً وأعواناً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"I have not taken the misguided as allies\" means supporters and helpers.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفكيف تتخذون أيها الحمقى المسرفون إبليسَ وذريتَه أولياءَ من دوني مع أني { مَّآ أَشْهَدتُّهُمْ } وأحضرتهم إبليسَ وجنودَه { خَلْقَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: وقت خلقهما وإيجادهام\n ليُعاونوا ويظاهروا عليّ حتى تتخذونهمه أولياء غيري\n شركاءَ معي في استحقاق العبادة { وَلاَ خَلْقَ أَنْفُسِهِمْ } أيضاً\n أي: لا أحضرُ بعضهم عند خلق بعضٍ منهم\n\n\n{ وَ } بالجملة: أنا أستقل بالخلق والإيجاد بل في الوجود أيضاً\n لذلك { مَا كُنتُ } في خلق الأشياء وإيجادها محتاجاً إلى المعين والظهير أصلاً\n فيكف { مُتَّخِذَ ٱلْمُضِلِّينَ }  الضالين عن ساحة عزِّ الحضور { عَضُداً } [الكهف: 51] أعواناً وأنصاراً أعتَضِدُ وأنتصرُ بهم حتى تشاركونهم بي في استحقاق العبادة والإطاعة والانقياد بل ترجّحونهم عليّ بالولاية والمحبة\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما أشهدتُهم } أي: ما أحضرت إبليس وذريته\n أو: جميع الكفار { خلْقَ السماواتِ والأرضِ } \n حيث خلقتهما قبل خلقهم\n { ولا خلقَ أنفسهم }: ولا أشهدت بعضهم خلق بعض: كقوله:\n[النِّساء: 29]\n قاله البيضاوي\n قلت: الظاهر إبقاء الأنفس على ظاهرها\n أي: ما أحضرتهم خلق أنفسهم\n أي: ما كانوا حاضرين حين خلقت أنفسهم\n بل هم مُحْدَثُونَ في غاية العجز والجهل\n فكيف تتخذونهم أولياء من دوني؟ وفي الآية رد على المنجِّمين الذين يخوضون في أسرار غيب السماوات بالتخمين\n وعلى الطبائعيين من الأطباء ومن سواهم\n من كل متخوض في هذه الأشياء\n وعلى الكُهَّان وكل من يتطلع على الغيب بطريق الحدس\n والمصدقين لهم\n انظر ابن عطية\n قال تعالى: { وما كنت مُتَّخِذَ المضلِّينِ } من الشياطين { عَضُدًا } أي: أعوانًا في شأن الخلق\n أو في شأن من شؤوني\n حتى تتخذوهم أولياء وتُشركوهم في عبادتي\n وكان الأصل أن يقول: وما كنت متخذهم\n فوقع المظهر موقع الضمير ذمًا لهم\n وتسجيلاًً عليهم بالإضلال\n وتأكيدًا لما سبق من إنكار اتخاذهم أولياء\n وفيه تهكم بهم وإيذان بكمال ركاكة عقولهم وسخافة آرائهم حيث لا يفهمون هذا الأمر الجلي الذي لا يكاد يشتبه على أبلدِ الصبيان\n فيحتاجون إلى التصريح به\n\nانظر أبا السعود\n الإشارة: في الآية تنفيرٌ من الاستكبار والترفع على عباد الله تشبهًا بإبليس\n وحثٌ على التواضع والخضوع لله في خلقه وتجلياته كيفما كانت\n وفيها أيضًا الحض على إفراد الوجهة والمحبة لله\n والتبري من كل ما سواه مما يشغل عن الله\n وفيها أيضًا: النهي عن التطلع إلى ما لم يَرِدْ به من أسرار القدر نصٌ صريح في كتاب الله ولا في سنة رسول الله من أسرار القدر\n وفيها أيضًا: النهي عن الاستعانة بأعداء الله في شأن كان\n وبالله التوفيق\n ثمَّ ذكر وبال من اتخذ ولياً غير الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:35",
      "similarity": 0.8063192224011652
    },
    {
      "verse": "6:73",
      "similarity": 0.052787302006883606
    },
    {
      "verse": "45:22",
      "similarity": 0.05178909111406542
    },
    {
      "verse": "25:2",
      "similarity": 0.051005384035152194
    },
    {
      "verse": "85:9",
      "similarity": 0.04890434875124775
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/018051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/018051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}