{
  "chapter": "الكهف",
  "text": "ويوم يقول نادوا۟ شركاءى الذين زعمتم فدعوهم فلم يستجيبوا۟ لهم وجعلنا بينهم موبقا",
  "translations": [
    {
      "translation": "On the Day He says, 'Call My partner-gods, those for whom you made such claims,' they will call on them but they will not respond to them. We will place between them an unbridgeable gulf.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day He will say: \"Call those you had called My compeers,\" they will call them, but will get no response, and We shall place a gulf between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will such people do on the Day when the Lord will say: \"Now call upon all those whom you believed to be My partners?\" Thereupon they will call upon them, but they will not respond to their call; and We shall make them a common pit of doom,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when God asks the idolators to seek help from their idols, they will call their idols for help. But the idols will not answer them; We shall separate the two parties from each other by a destructive gulf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day when He will proclaim, “Call those partners of Mine whom you had assumed” – so they will call out to them – they will not answer them, and We shall create a field of destruction between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day He will say: \"Call those (so-called) partners of Mine whom you claimed.\" Then they will cry unto them, but they will not answer them, and We shall put Mawbiq between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when He shall say: Call on those whom you considered to be My associates. So they shall call on them, but they shall not answer them, and We will cause a separation between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day He shall say, 'Call on My associates whom you asserted'; and then they shall call on them, but they will not answer them, and We shall set a gulf between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (be mindful of) the Day when He will say: Call those partners of Mine whom ye pretended. Then they will cry unto them, but they will not hear their prayer, and We shall set a gulf of doom between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day He will say to them, \"Call on those whom you thought to be My partners.\" And they will call on them, but their prayer will not be heard; and We shall place a barrier [of enmity] between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beware a Day whereon He will say: cry unto my associates say cry unto whom ye fancied. So they will call unto them, and they will answer them not, and We shall place between them a partition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day He will say [to the polytheists], ‘Call those whom you maintained to be My partners,’ they will call them, but they will not respond to them, for We shall set an abyss between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One Day He will say, \"Call on those whom ye thought to be My partners,\" and they will call on them, but they will not listen to them; and We shall make for them a place of common perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day He will say:\"Call those (so-called) partners of Mine whom you pretended.\" Then they will cry unto them, but they will not answer them, and We shall put Maubiqa (a barrier, or enmity, or destruction, or a valley in Hell) between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day He will say: 'Call on those whom you claimed to be My associates' They will invoke them, but they will receive no answer, for We shall place a gulf between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He will say, “Call on My partners whom you have claimed.” They will call on them, but they will not answer them. And We will place between them a barrier.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [warn of] the Day when He will say, \"Call 'My partners' whom you claimed,\" and they will invoke them, but they will not respond to them. And We will put between them [a valley of] destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:52] And the day (yawma is in the accusative because it is governed by [the implicit] udhkur, ‘mention’) when He will say (yaqūl, or [it may be] read as naqūl, ‘We will say’), ‘Call those partners of Mine, [those] graven images, as you used to claim’, let them intercede for you in the way you used to claim; and then they will call them, but they will not respond to their call, they will not answer them, and We shall set between them, between the graven images and those who worship them, a gulf of doom — a valley from among the valleys of Hell, in which they shall all be destroyed (the term [mawbiq] derives from [the verb] wabaqa meaning halaka, ‘he was destroyed’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (be mindful of) the Day) which is the Day of Judgement (when He will say) to idol worshippers: (Call those partners of Mine) i.e. your deities (whom ye pretended) whom you worshipped and claimed they were My partners so that they defend you against my chastisement. (Then they will cry unto them, but they will not hear their prayer) they did not respond to them, (and We shall set a gulf of doom between them) We shall set a valley of fire between the worshippers and those who were worshipped; it is also said that this means: We set destruction between them in the Hereafter instead of the love and affection which was between them in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلْنَا بَيْنَهُم مَّوْبِقاً } معناه مَهلكٌ والمَّوبقُ: المَوعدُ\n قال الإِمامُ زيد بن علي عليهما السَّلامُ: المَّوبقُ: وادٍ بينَ أَهلِ الضّلالةِ وأَهلِ الإِيمَانِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - Exalted is He: {And We have appointed a barrier between them} its meaning is a destroyer, and al-Mawbiq: the appointment.\n The Imam Zaid ibn Ali said, Peace be upon him: {The Mawbq} is a valley between the people of error and the people of faith.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل { يَوْمَ يَقُولُ } الله سبحانه على سبيل التعبير والتقريع للكفار والمشركين: { نَادُواْ } أيها المنهمكون في الغيّ والضلال { شُرَكَآئِيَ ٱلَّذِينَ زَعَمْتُمْ } أنهم شفعاؤكم اليوم\n وعبدتم لهم مثل عبادتي بل أحسن منها حتى ينقذوكم من عذابي\n ويشفعوا لكم عندي { فَدَعَوْهُمْ } صارخين مستغيثين { فَلَمْ يَسْتَجِيبُواْ لَهُمْ } ولم يجيبوا استغاثتهم\n لأنهم حينئذٍ مشغولون بحالهم\n مأخوذون بوبالهم ونكالهم\n لذلك لا يلتفتون إليهم { وَ } مع ذلك { جَعَلْنَا بَيْنَهُم } أي: بين العابدين والمعبودين { مَّوْبِقاً } [الكهف: 52] مهلكاً عظيماً ووادياً غائراً عميقاً من أودية جهنم مملوءة بالنار\n بحيث لا يمكن تواصلهم أصلاً\n\n\n{ وَرَأَى ٱلْمُجْرِمُونَ ٱلنَّارَ } بعدما عُرضوا أو حُوسبوا\n وسِيقوا نحو جهنم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { موبقًا }: اسم مكان\n أو مصدر\n من: وَبَقَ وبوقًا\n كوثب وثوبًا\n ووَبِقَ وبَقًا\n كفرح فرحًا\n يقول الحقّ جلّ جلاله: { و } اذكر { يومَ يقولُ } الحق تعالى للكفار توبيخًا وتعجيزًا لهم: { نادُوا شركائِيَ الذين زعمتم } أنهم شفعاؤكم ليشفعوا لكم\n والمراد بهم كل ما عُبد من دون الله\n أو إبليس وذريته\n { فَدَعَوْهم } أي: نادوهم للإغاثة\n { فلم يستجيبوا لهم }: فلم يُغيثوهم\n { وجعلنا بينهم } أي: بين الداعين والمدعوين { مَّوبقًا } أي: مهلكًا يهلكون فيه جميعًا\n وهو النار\n وقيل: العداوة\n وهي نوع من الهلاك\n لقول عمر رضي الله عنه: \" لا يكن حُبك كَلَفًا\n ولا بُغْضك تلفًا \"\n وقيل: المراد بالبيْن: الوصل\n أي: وجعلنا وصلهم في الدنيا هلاكًا في الآخرة\n كقوله:\n[الأنعَام: 94]\n وقيل: المراد بالشركاء: الملائكة\n وعُزير\n وعيسى - عليهم السلام -\n ويراد حينئذ بالموبق: البرزخ البعيد\n أي: وجعلنا بينهم وبين من عبدوهم برزخًا بعيدًا لأنهم في قعر جهنم\n وهم في أعلى عليين\n { ورأى المجرمون النارَ } \n وضع المُظْهَرَ موضع المُضْمَرِ تصريحًا بإجرامهم\n وذمًا لهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:34",
      "similarity": 0.8363834885494879
    },
    {
      "verse": "28:62",
      "similarity": 0.24095274916566867
    },
    {
      "verse": "28:74",
      "similarity": 0.24095274916566867
    },
    {
      "verse": "34:22",
      "similarity": 0.18936947058984605
    },
    {
      "verse": "6:22",
      "similarity": 0.1859292734808222
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/18:52.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/18:52.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/18:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}