{
  "chapter": "الكهف",
  "text": "ومن اظلم ممن ذكر بـايت ربه فاعرض عنها ونسى ما قدمت يداه انا جعلنا على قلوبهم اكنة ان يفقهوه وفى ءاذانهم وقرا وان تدعهم الى الهدى فلن يهتدوا۟ اذا ابدا",
  "translations": [
    {
      "translation": "Who is more unjust than he who, on being reminded of his Lord's revelations, turns away from them, and forgets the evil deeds he had committed in the past. Verily We have placed a covering on their hearts so that they do not understand, and a deafness in their ears so that however you may call them to guidance they will never be guided aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more wicked than the man who, when he is reminded by the revelations of his Lord, turns away from them and forgets (the consequence of) the deeds wrought by his own hands? We have laid veils over their hearts lest they understand the message of the Qur'an, and We have caused heaviness in their ears. Call them as you may to the Right Path, they will not be ever guided aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who are more unjust than those who are reminded of the revelations of their Lord but have disregarded them and have forgotten their deeds? We have veiled their hearts and sealed their ears so that they cannot understand. Even if you call them to the right path, they will never accept guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who, when reminded of the signs of his Lord, turns away from them and forgets what his hands have sent forward? We have put covers on their hearts so as not to understand the Qur’an, and deafness in their ears; and even if you call them to guidance, they will never attain the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who is reminded of the Ayat (signs) of his Lord, but turns away from them, forgetting what his hands have sent forth. Truly, We have set over their hearts Akinnah, lest they should understand this (the Qur'an), and in their ears, deafness. And if you call them to guidance, even then they will never be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who is reminded of the communications of his Lord, then he turns away from them and forgets what his two hands have sent before? Surely We have placed veils over their hearts lest they should understand it and a heaviness in their ears; and if you call them to the guidance, they will not ever follow the right course in that case.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who, being reminded of the signs of his Lord, turns away from them and forgets what his hands have forwarded? Surely We have laid veils on their hearts lest they understand it, and in their ears heaviness; and though thou callest them to the guidance, yet they will not be guided ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who doth greater wrong than he who hath been reminded of the revelations of his Lord, yet turneth away from them and forgetteth what his hands send forward (to the Judgment)? Lo! on their hearts We have placed coverings so that they understand not, and in their ears a deafness. And though thou call them to the guidance, in that case they can never be led aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more wicked than he who has been reminded of the revelations of his Lord, then turns away from them and forgets what his own hands have done? We have cast veils over their hearts lest they understand Our words, and made them hard of hearing. Call them as you may to the right path, they shall never be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who doth greater wrong than he who is admonished with the signs of His Lord yet turneth away from them and forgetteth that which his hands have sent forth? Verily We have set up veils over lest they should understand it, and in their ears a heaviness; and if thou callest them to the guidance, lo! they will not let themselves be guided ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is a greater wrongdoer than he who is reminded of the signs of his Lord, whereat he disregards them and forgets what his hands have sent ahead? Indeed We have cast veils on their hearts lest they should understand it, and a deafness into their ears; and if you invite them to guidance they will never [let themselves] be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who doth more wrong than one who is reminded of the Signs of his Lord, but turns away from them, forgetting the (deeds) which his hands have sent forth? Verily We have set veils over their hearts lest they should understand this, and over their ears, deafness, if thou callest them to guidance, even then will they never accept guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who is reminded of the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of his Lord, but turns away from them forgetting what (deeds) his hands have sent forth. Truly, We have set veils over their hearts lest they should understand this (the Quran), and in their ears, deafness. And if you (O Muhammad SAW) call them to guidance, even then they will never be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is greater in evil than he who, when reminded of the verses of his Lord, turns away from them and forgets what his hands have sent before him? We have placed veils over their hearts lest they should understand it, and there is heaviness in their ears. Even if you call them to guidance, they will never be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than he, who, when reminded of his Lord’s revelations, turns away from them, and forgets what his hands have put forward? We have placed coverings over their hearts, lest they understand it, and heaviness in their ears. And if you call them to guidance, they will not be guided, ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who is reminded of the verses of his Lord but turns away from them and forgets what his hands have put forth? Indeed, We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And if you invite them to guidance - they will never be guided, then - ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:57] And who does greater wrong than he who has been reminded of the signs of his Lord, yet turns away from them and forgets what his hands have sent ahead?, what he has committed in the way of disbelief and acts of disobedience. Indeed on their hearts We have cast veils, coverings, lest they should understand it, that is, lest they should comprehend the Qur’ān, in other words, and so [as a result] they do not comprehend it; and in their ears a deafness, a heaviness, and so they do not hear it; and though you call them to guidance, they will not be guided in that case, that is, given the casting [of veils] mentioned, ever.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And who doth greater wrong) none is more wrong (than he who hath been reminded of the revelations of his Lord) he who has been admonished with the revelations of his Lord, (yet turneth away from them) in denial (and forgetteth what his hands send forward) and forgets the sins committed by his hands? (Lo! on their hearts We have placed coverings so that they understand not) the Truth and guidance, (and in their ears a deafness) so that they hear not the Truth and guidance. (And though thou) Muhammad (call them to the guidance) to Allah's divine Oneness, (in that case they can never be led aright) they will not believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ أَظْلَمُ } على الله وأسوأ أرباباً لنسبته إليه سبحانه { مِمَّن ذُكِّرَ بِآيَٰتِ رَبِّهِ } ليتعظ بها ويصلح بسببها { فَأَعْرَضَ عَنْهَا } وانصرف من سماعها، فكيف عن قبولها امتثالها استنكاراً واستكباراً { وَنَسِيَ مَا قَدَّمَتْ } أي: كسبت واقترفت { يَدَاهُ } من الجرائم والآثام وأنواع الكفر والشرك والطغيان، ولو اتعظوا به وعملوا بمقتضاها لذهبت سيئاتهم وتضاعفت حسناتهمه، وكيف يتذكرون بها ولا يمكنهم التذكر { إِنَّا } بمقتضى قهرنا وسُخْطِنا عليهم { جَعَلْنَا } أي: طبعنا وختمنا { عَلَىٰ قُلُوبِهِمْ } التي هي وعاء التذّكر والقبول { أَكِنَّةً } حُجباً غليظةٌ كثيفةً مانعةً { أَن يَفْقَهُوهُ } أي: القرآن ويفهموا معانية ومقاصده، فكيف بغوامض رُموزه وإشاراته { وَ } ختمنا أيضاً { فِي ءَاذَانِهِمْ وَقْراً } صمماً بمنعهم عن الاستماع والإصغاء إليه، فيكف عن فهمه والعمل به\n\n\n{ وَ } من غلظ غشاوتهم، وشدة قساوتهم وصممهم { إِن تَدْعُهُمْ } يا أكمل الرسل { إِلَىٰ ٱلْهُدَىٰ } وترشدهم إلى الفلاح والفوز بالنجاح { فَلَنْ يَهْتَدُوۤاْ } ويفوزوا { إِذاً } أي: حين ختم قولبهم ووقر صماخهم { أَبَداً } [الكهف: 57] في أي حالٍ من الأحوال؛ إذ لا يُعارض فعلنا ولا يُبدَّل قولنا إلا بأمرنا وتوفيقنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومَن أظلمُ ممّن ذُكِّرَ بآياتِ ربه } وهو القرآن العظيم، { فأعْرَضَ عنها } فلم يتدبرها ولم يؤمن بها، أي: لا أحد أظلم منه لأنه أظلم من كل ظالم حيث ضم إلى المجادلة التكذيب والإعراضَ، { ونَسِيَ ما قدمت يداه } من الكفر والمعاصي، ولم يتفكر في عاقبتها، { إِنا جعلنا على قلوبهم أكِنَّةً }: أغطية كثيرة تمنعهم من التدبر في الآيات، وهو تعليل لإعراضهم ونسيانهم بأنهم مطبوع على قلوبهم، فعل ذلك بهم كراهة { أن يفقهوه } ، أو: منعناهم أن يقفوا على كنهه\n { و } جعلنا { في آذانهم وَقْرًا } أي: ثِقلاً يمنعهم من استماعه، { وإِن تَدْعُهُمْ إِلى الهدى فلن يهتدوا إِذًا أبدًا } أي: فلن يكون منهم اهتداء الْبتةَ مدة التكليف للطبع المتقدم على قلوبهم، وهذا في قوم مخصوصين سبق لهم الشقاء\n و \" إذًا \": حرف جزاء وجواب، وهو، هنا، عن سؤال من النبي صلى الله عليه وسلم المدلول عليه بكمال عنايته بإسلامهم، كأنه قال صلى الله عليه وسلم:\n\n \" ما لي لا أدعوهم \" \n\n؟ فقال: إن تدعهم\n\n\n الخ\n وجمع الضمير الراجع إلى الموصول في هذه المواضع الخمسة باعتبار معناه، كما أن إفراده في المواطن الخمسة المتقدمة باعتبار اللفظ",
      "translations": []
    }
  ]
}