{
  "chapter": "الكهف",
  "text": "ولقد صرفنا فى هذا القرءان للناس من كل مثل وكان الانسن اكثر شىء جدلا",
  "translations": [
    {
      "translation": "We have explained in various ways all things to men in this Qur'an; but of all things man is most contentious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely We have explained matters to people in the Qur'an in diverse ways, using all manner of parables. But man is exceedingly contentious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have given various examples in this Quran for people to learn a lesson, but the human being is the most contentious creature.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have indeed illustrated all kinds of examples for mankind in this Qur’an; and man is the most quarrelsome of all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have given every kind of example in this Qur'an for mankind. But, man is ever more quarrelsome than anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have explained in this Quran every kind of example, and man is most of all given to contention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed turned about for men in this Koran every manner of similitude; man is the most disputatious of things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We have displayed for mankind in this Qur'an all manner of similitudes, but man is more than anything contentious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have explained in various ways in this Quran, for the benefit of mankind, all kinds of examples, but man is most contentious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have variously propounded in this Qur'an for mankind every kind of similitude; and man is of all things the most disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have certainly interspersed this Quran with every kind of parable for the people. But man is the most disputatious of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have explained in detail in this Qur'an, for the benefit of mankind, every kind of similitude: but man is, in most things, contentious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have put forth every kind of example in this Quran, for mankind. But, man is ever more quarrelsome than anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have set forth for people in this Koran all manner of parables; the human is the most disputatious of things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have elaborated in this Quran for the people every kind of example, but the human being is a most argumentative being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly diversified in this Qur'an for the people from every [kind of] example; but man has ever been, most of anything, [prone to] dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:54] And verily We have dispensed, We have explained, for mankind in this Qur’ān [an example] of every kind of similitude (min kulli mathalin is an adjective qualifying an omitted clause, in other words, ‘[We have dispensed therein] a similitude from every kind of similitude), that they may be admonished. But man is most disputatious, [he is] most contentious in matters of falsehood (jadalan is a specification derived from [al-insān, ‘man’] the subject of kāna) in other words, the meaning is that the disputatiousness of man is what can be found in him most.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We have displayed) We have explained (for mankind) for the people of Mecca (in this Qur'an all manner of similitudes) all forms of threats and promises in order that they take heed and, hence, believe, (but man) Ubayy Ibn Khalaf al-Jumahi (is more than anything contentious) in respect to falsehood; it is also said that this means: no one is more contentious than man.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف يجدون مصرفاً سواها، ومن أين يتأتى لهم الانصراف اليوم؛ إذْ هم فوَّتوا على أنفسهم المصرف، وسبب الانصراف في النشأة الأولى مع أنا { لَقَدْ صَرَّفْنَا } وكررنا { فِي هَـٰذَا ٱلْقُرْآنِ } المرشد إلى الهداية، الصارفِ عن الضلالة والغواية { لِلنَّاسِ } المنهمكين في الغفلة والنسيان { مِن كُلِّ مَثَلٍ } أي: من كل شيءٍ مثلاً موضحاً ينبههم إلى الهدى، ويجنبهم عن الغفلة والهوى، فلم ينتبهوا ولم يتفطنوا بل قابلوا الباطلَ بالحق وجادلوا { وَكَانَ ٱلإِنْسَانُ } المجبول على النسيان والكفران { أَكْثَرَ شَيْءٍ جَدَلاً } [الكهف: 54] أي: جداله ومكابرته أكثر من جدال سائر المخلوقات، وأن رشده وإيمانه أكثر أيضً منها أيضاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { جَدَلاً }: تمييز، و { ربك }: مبتدأ و { الغفور }: خبره، و { ذو الرحمة }: خبر بعد خبر، وقيل: الخبر: { لو يؤاخذهم } ، و { الغفور ذو الرحمة }: صفتان للمبتدأ، وإيراد المغفرة على جهة المبالغة دون الرحمة للتنبيه على كثرة الذنوب، وأيضًا: المغفرة ترك المؤاخذة، وهي غير متناهية، والرحمة فعل، وهو متناهي، وتقديم الوصف الأول لأن التخلية قبل التحلية، و المُهْلَك بضم الميم وفتح اللام: اسم مصدر، من أهلك، فالمصدر، على هذا، مضاف للمفعول لأن الفعل متعد، وقرئ بفتح الميم، من هلك، فالمصدر، على هذا، مضاف للفاعل\n يقول الحقّ جلّ جلاله: { ولقد صرَّفنا } أي: كررنا وأوردنا على وجوهٍ كثيرة من النظر العجيب، { في هذا القرآنِ للناس } لمصلحتهم ومنفعتهم، { من كل مَثَلٍ } من كل خبر يحتاجون إليه، أو: من كل مثل مضروب يعتبرون به، ومن جملته ما مر من مثل الرجلين، ومثل الحياة الدنيا\n أو: من كل نوع من أنواع المعاني البديعة الداعية إلى الإيمان، التي هي، في الغرابة والحسن واستجلاب القلوب، كالمثل المضروب، ليتلقوه بالقبول، فلم يفعلوا\n { وكان الإنسانُ } بحسب جِبلَّته { أكثرَ شيءٍ جدلاً } أي: أكثر الأشياء، التي يتأتى منها الجدل، جدلاً، وهو هنا شدة الخصومة بالباطل، والمعنى: أن جدله أكثر من جدل كل مجادل، وفيها ذم الجدل\n وسببها: مجادلة النضر بن الحارث كما قيل، وهي عامة",
      "translations": []
    }
  ]
}