{
  "chapter": "الكهف",
  "text": "واذ قلنا للملئكة اسجدوا۟ لءادم فسجدوا۟ الا ابليس كان من الجن ففسق عن امر ربه افتتخذونه وذريته اولياء من دونى وهم لكم عدوۢ بئس للظلمين بدلا",
  "translations": [
    {
      "translation": "When We said to the angels, 'Prostrate yourselves to Adam,' they prostrated with the exception of Iblis. He was one of the jinn and wantonly deviated from his Lord's command. Do you take him and his offspring as protectors apart from Me when they are your enemy? How evil is the exchange the wrongdoers make!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We said to the angels: \"Bow before Adam in adoration,\" they all bowed but Iblis. He was one of the jinni and rebelled against his Lord's command. And yet you take him and his offspring as your friends instead of Me, even though they are your enemies. How sad a substitute for the evil-doers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when We said to the angels: \"Prostrate yourselves before Adam\"; all of them fell prostrate, except Iblis. He was of the jinn and so disobeyed the command of his Lord. Will you, then, take him and his progeny as your guardians rather than Me although they are your open enemies? What an evil substitute are these wrong-doers taking!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We told the angels to prostrate before Adam they all obeyed except Iblis. He was a jinn and he sinned against the command of his Lord. Why do you (people) obey him and his offspring instead of Me, even though they are your enemies? How terrible will be the recompense that the wrong doers will receive!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when We commanded the angels that, “Prostrate before Adam” – so they all prostrated, except Iblis; he was of the jinn, he therefore rebelled against his Lord’s command; “What! You choose him and his offspring as your friends instead of Me, whereas they are your enemies?” And what an evil alternative did the unjust get.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We said to the angels: \"Prostrate yourselves unto Adam.\" So they prostrated themselves, except Iblis. He was one of the Jinn; he disobeyed the command of his Lord. Will you then take him and his offspring as protectors and helpers rather than Me while they are enemies to you What an evil is the exchange for the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We said to the angels: Make obeisance to Adam; they made obeisance but Iblis (did it not). He was of the jinn, so he transgressed the commandment of his Lord. What! would you then take him and his offspring for friends rather than Me, and they are your enemies? Evil is (this) change for the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We said to the angels, 'Bow yourselves to Adam'; so they bowed themselves, save Iblis; he was one of the jinn, and committed ungodliness against his Lord's command. What, and do you take him and his seed to be your friends, apart from Me, and they an enemy to you? How evil is that exchange for the evildoers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We said unto the angels: Fall prostrate before Adam, and they fell prostrate, all save Iblis. He was of the jinn, so he rebelled against his Lord's command. Will ye choose him and his seed for your protecting friends instead of Me, when they are an enemy unto you? Calamitous is the exchange for evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We said to the angels, \"Prostrate yourselves before Adam,\" all prostrated themselves except Satan. He was one of the jinn and he disobeyed his Lord's command. Do you then take him and his offspring as protectors instead of Me, despite their enmity towards you? This is an evil exchange for the wrongdoers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time we said unto the angels: prostrate yourselves before Adam, and they prostrated themselves, but Iblis did not; he was of the genii; so he trespassed the commandment of his Lord. Would ye then take him and his progeny as patrons instead of Me, whereas they are unto you an enemy III is for the wrong-doers an exchange!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We said to the angels, ‘Prostrate before Adam,’ they prostrated, but not Iblis. He was one of the jinn, so he transgressed against his Lord’s command. Will you then take him and his offspring for guardians in My stead, though they are your enemies? How evil a substitute for the wrongdoers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! We said to the angels, \"Bow down to Adam\": They bowed down except Iblis. He was one of the Jinns, and he broke the Command of his Lord. Will ye then take him and his progeny as protectors rather than Me? And they are enemies to you! Evil would be the exchange for the wrong-doers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We said to the angels; \"Prostrate to Adam.\" So they prostrated except Iblis (Satan). He was one of the jinns; he disobeyed the Command of his Lord. Will you then take him (Iblis) and his offspring as protectors and helpers rather than Me while they are enemies to you? What an evil is the exchange for the Zalimun (polytheists, and wrong-doers, etc).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We said to the angels: 'Prostrate yourselves before Adam' all prostrated themselves except iblis, who was one of the jinn, disobedient to the command of his Lord. Would you then take him and his descendants to be your guardians, other than Me, when they are your clear enemy? How evil is the exchange for the harmdoers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said to the angels, “Bow down to Adam.” So they bowed down, except for Satan. He was of the jinn, and he defied the command of his Lord. Will you take him and his offspring as lords instead of Me, when they are an enemy to you? Evil is the exchange for the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except for Iblees. He was of the jinn and departed from the command of his Lord. Then will you take him and his descendants as allies other than Me while they are enemies to you? Wretched it is for the wrongdoers as an exchange.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:50] And when (idh is dependent because it is governed by [an implicit] udhkur, ‘mention [when]’) We said to the angels, ‘Prostrate before Adam’, a prostration involving a bow, not placing one’s forehead down [to the ground], as a greeting to him; and so they prostrated, [all] except Iblīs. He was [one] of the jinn — some say that these [creatures] are a species of angels, in which case the exceptive clause [illā Iblīs, ‘except Iblīs’] is a continuous one; but it is also said to be discontinuous, since Iblīs is [considered] the progenitor of [all] the jinn, having offspring who are mentioned alongside him further below; angels, on the other hand, do not have offspring; and he transgressed against his Lord’s command, that is to say, he rebelled against obedience to Him by refraining from [performing] the prostration. Will you then take him and his offspring — this address is to Adam and his progeny (the [final pronominal suffix] hā’ in both words refers to Iblīs) for your patrons instead of Me, obeying them, when they are an enemy to you?, in other words, [when they are your] enemies (wa-hum lakum ‘aduwwun is a circumstantial qualifier). How evil for the evildoers is that substitute!, of Iblīs and his offspring, in obeying them instead of obeying God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remember) when We said unto the angels) who were on the earth: (Fall prostrate before Adam) a prostration of greeting, (and they fell prostrate, all save Iblis) their leader. (He was of the jinn) of the tribe of the jinn, (so he rebelled against his Lord's command) he disobeyed his Lord and refused to prostrate to Adam. (Will ye choose him) will you worship him (and his seed for your protecting friends) as lords (instead of Me) instead of Allah, (when they are an enemy unto you) whose enmity is quite manifest? (Calamitous is the exchange) in worship; it is also said that this means: evil is that which they exchanged: they exchanged the worship of Allah with the worship of Satan; and it is also said: they exchanged the protecting friendship of Allah with the protecting friendship of Satan (for evil-doers) for idolaters!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَفَسَقَ عَنْ أَمْرِ رَبِّهِ } معناهُ خَرجَ عَنهُ\n\n",
      "translations": [
        {
          "translation": " And His saying, {So he broke away from the command of his Lord} means he left it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وقوله: { وكان من الجنّ } كلام مستأنف\n كأن قائلاً قال: ما بال إبليس لم يسجد؟ قال: كان من الجنّ\n أي: من القوى البدنية المختفية بالمواد\n فلذلك { فسق عن أمر ربّه } أي: لاحتجابه بالمادة ولواحقها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفقال: { وَإِذْ قُلْنَا لِلْمَلاۤئِكَةِ } أي: اذكر لهم وقت قولنا للملائكة المعترضين لنا على اصطفائنا آدم للخلافة والنيابة بعد إفحامنا\n والزامنا إياهم بما ألزمناهم { ٱسْجُدُواْ } أي: تواضعوا وتذللوا على وجه الخضوع والانكسار { لأَدَمََ } النائبِ المستخلف عنا بعدما ظهر عنكم\n وعليكم فضلُه وشرفُه واستحقاقُه لأمر الخلافة { فَسَجَدُوۤاْ } بعدما سمعوا متذليين امتثالاً للأمر الوجوبي { إِلاَّ إِبْلِيسَ } منهم أبى\n ولم يسجد له معللاً بأنواع العلل والجدالات الباطلة الناشئة من خباثة فطرته على ماسمعت غير مرةٍ\n\n\nوإنما امتننع\n لأنه { كَانَ مِنَ ٱلْجِنِّ } في أصل خِلقته\n فلحق بالملائكة لحكمةٍ ومصلحةٍ { فَفَسَقَ عَنْ أَمْرِ رَبِّهِ } على مقتضى خِلقته الأصلية { أَفَتَتَّخِذُونَهُ } أيها المغرورون بتغريره\n والمأملون إلى تلبيسه وتزويره بعدما صدرتْ عنه هذه العداوة الظاهرة { وَذُرِّيَّتَهُ } المختلطة معكم المرتكزة في نفوسكم\n وقواكم اللاتي هي أعدى أعدائكم { أَوْلِيَآءَ مِن دُونِي } بحيث نفوضون أموركم إليها\n ليوالوها لكم { وَهُمْ } أصلهم وفرعهم { لَكُمْ عَدُوٌّ } قديمُ مستمرُ { بِئْسَ } الشيطان وذريته\n وولايتهما { لِلظَّالِمِينَ } الخارجين عن مقتضى أوامرنا ونواهينا { بَدَلاً } [الكهف: 50] عنَّا وعن ولايتنا إياهم\n\n\nوعن يحيى بن معاذ رضي الله عنه: لا يكون من أولياء الله\n ولا يبلغ مقام الولاية مَنْ نَظَرَ إلى شيءٍ دونه واعتمد على سواه\n ولم يميز بين معاديه ومواليه\n ولم يعلم حال إقباله من حال إدباره\n انتهى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إلا إبليس }: استثناء منقطع\n إذا قلنا: إن إبليس لم يكن من الملائكة\n وإذا قلنا: إنه منهم يكون متصلاً\n ويكون معنى \" كان \" صار\n أي: إلا إبليس صار من الجن لمَّا امتنع من السجود\n أو بأن الملائكة كان منهم قوم يقال لهم الجن\n وهم الذين خُلقوا من النار\n وجملة { كان من الجن }: استئنافية سيقت مساق التعليل\n كأنه قيل: ما له لم يسجد؟ فقيل: كان أَصْلُهُ جنِّيًا\n يقول الحقّ جلّ جلاله: { و } اذكر { إِذْ قلنا للملائكةِ } أي: وقت قوْلنا لهم: { اسجدوا لآدمَ } سجود تحية وتكريم\n { فسجدوا } جميعًا امتثالاً للأمر\n { إِلا إِبليسَ } أبى واستكبر لأنه { كان من الجنِّ } \n وكان رئيسهم في الأرض\n فلما أفسدوا أرسل الله عليهم جندًا من الملائكة\n فغزوهم\n فهربوا في أقطار الأرض\n وأُخذ إبليس أسيرًا\n فعرجوا به إلى السماء\n فأسلم وتعبد في أقطار السماوات\n فلما أُمرت الملائكة بالسجود امتنع ونزع لأصله\n { ففسقَ } أي: خرج { عن أمر ربه } أي: عن طاعته\n أو صار فاسقًا كافرًا بسبب أمر الله تعالى إذ لولا ذلك لَمَا أبى\n والتعرض لوصف الربوبية المنافية للفسق لبيان كمال قُبح ما فعله\n  قال تعالى: { أفتتخذونه وذريَّتَه } أي: أولاده\n أو أتباعه\n وهم الشياطين\n جُعلوا ذريةً مجازًا\n وقال قتادة: إنهم يتوالدون كما يتوالد بنو آدم\n وقيل: يُدْخِل ذنَبه في دبره فيبيض فتنفلق البيضة عن جماعة من الشياطين\n والهمزة للإنكار والتعجب\n والفاء للتعقيب\n أي: أَعقبَ عِلْمكُم بصدور تلك القبائح منه\n تتخذونه وذريته { أولياءَ } أحبار { من دوني } فتستبدلونهم\n وتطيعونهم بدل طاعتي\n والحال أنهم\n أي: إبليس وذريته { لكم عدو } أي: أعداء\n وأُفرد تشبيهًا له بالمصدر\n كالقبول والولوع\n { بئس للظالمين }: الواضعين للشيء في غير محله\n { بدلاً } استبدلوه من الله تعالى\n وهو إبليس وذريته\n وفي الالتفات إلى الغيبة\n مع وضع الظاهر موضع الضمير\n من الإيذان بكمال السخط\n والإشارة إلى أن ما فعلوه ظلم قبيح\n ما لا يخفى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:11",
      "similarity": 0.5972002348891533
    },
    {
      "verse": "17:61",
      "similarity": 0.5921367002755974
    },
    {
      "verse": "20:116",
      "similarity": 0.5906574766056181
    },
    {
      "verse": "2:34",
      "similarity": 0.5843592551857804
    },
    {
      "verse": "15:32",
      "similarity": 0.5204743754745227
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/018050.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/018050.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:50.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}