{
  "chapter": "الكهف",
  "text": "وما منع الناس ان يؤمنوا۟ اذ جاءهم الهدى ويستغفروا۟ ربهم الا ان تاتيهم سنة الاولين او ياتيهم العذاب قبلا",
  "translations": [
    {
      "translation": "When guidance came to the people nothing prevented them from having iman and asking for forgiveness from their Lord but the fact that the pattern of previous peoples did not happen to them or that the punishment did not appear before their eyes.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is nothing to prevent men from believing when the guidance has come to them, and asking for their Lord's forgiveness, unless they want the example of earlier people visited upon them, or the punishment to appear right before their eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is it that prevented mankind from believing when the guidance came to them, and from asking forgiveness of their Lord, except that they would like to be treated as the nations of yore, or that they would like to see the scourge come upon them face to face?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What prevents people from having faith when guidance comes to them or from asking for forgiveness from their Lord before they face the kind of torment that the ancient people experienced or a new form of torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what prevented men from accepting faith when guidance came to them, and from asking forgiveness from their Lord except that the tradition of the former nations come upon them or that they confront various kinds of punishments?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing prevents men from believing, while the guidance has come to them, and from asking forgiveness of their Lord, except that the ways of the ancients be repeated with them, or the torment be brought to them face to face.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing prevents men from believing when the guidance comes to them, and from asking forgiveness of their Lord, except that what happened to the ancients should overtake them, or that the chastisement should come face to face with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught prevented men from believing when the guidance came unto them, and seeking their Lord's forgiveness, but that the wont of the ancients should come upon them, or that the chastisement should come upon them face to face.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught hindereth mankind from believing when the guidance cometh unto them, and from asking forgiveness of their Lord unless (it be that they wish) that the judgment of the men of old should come upon them or (that) they should be confronted with the Doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing prevents people from believing when they are given guidance or from asking forgiveness of their Lord, but the fact that the fate of the previous peoples should befall them or to have the punishment come upon them face to face.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught preventeth mankind from believing when the guidance hath come unto them, and from asking foregiveness of their Lord, but that there may come unto them the dispensation of the ancients, or that the torment may come Unto them face to face.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing has kept these people from believing and pleading to their Lord for forgiveness when guidance came to them, except [their demand] that the precedent of the ancients come to pass for them, or that the punishment come to them, face to face.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is there to keep back men from believing, now that Guidance has come to them, nor from praying for forgiveness from their Lord, but that (they ask that) the ways of the ancients be repeated with them, or the Wrath be brought to them face to face?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing prevents men from believing, now when the guidance (the Quran) has come to them, and from asking Forgiveness of their Lord, except that the ways of the ancients be repeated with them (i.e. their destruction decreed by Allah), or the torment be brought to them face to face?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing prevented people from believing and seeking the forgiveness of their Lord when guidance came to them, unless they are waiting for the fate of the ancients to overtake them, or that the punishment should come upon them face to face.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What prevented people from accepting faith, when guidance has come to them, and from seeking their Lord’s forgiveness? Unless they are waiting for the precedent of the ancients to befall them, or to have the punishment come upon them face to face.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing has prevented the people from believing when guidance came to them and from asking forgiveness of their Lord except that there [must] befall them the [accustomed] precedent of the former peoples or that the punishment should come [directly] before them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:55] And nothing prevented people, that is, the disbelievers of Mecca, from believing (an yu’minū is [after alnāsa, ‘people’] constitutes the second direct object clause) when the guidance, the Qur’ān, came to them, and from asking forgiveness of their Lord, without that there should come upon them the precedent of the ancients (sunnatu’l-awwalīn constitutes the subject of the verb) that is to say, Our precedent of dealing with them, which is the destruction decreed for them, or that the chastisement should come upon them before their very eyes, in front of them and for them to see — which was their being killed on the day of Badr (a variant reading [for qibalan] has qubulan, which [in the accusative] is the plural of qabīlin, meaning, ‘of various kinds’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And naught hindereth mankind) the people of Mecca, those who sponsored the army that fought against Muslims at Badr (from believing) in Muhammad (pbuh), and in the Qur'an (when the guidance) Muhammad (pbuh) and the Qur'an (cometh unto them, and from asking for forgiveness of their Lord) repent of disbelief and accept faith, (unless (it be that they wish) that the judgement of the men of old should come upon them) unless the destruction of the people of old should seize them (or (that) they should be confronted) on the Day of Badr (with the Doom) with the sword.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ يَأْتِيَهُمُ ٱلْعَذَابُ قُبُلاً } معناه مُقابَلَةٌ\n وقُبُلاً يعني أَولاً\n وقبلةٌ معناه مُعاينةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, { the punishment will come to them } means that it will come to them in turn.\n\n\nAnd {qubulan} means {awalan}.\n\n\nA \"waqbah\" is a preview or a previewing.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَمَا مَنَعَ ٱلنَّاسَ } عن الإيمان وصَرَفهُم { أَن يُؤْمِنُوۤاْ } أي: يوقنوا ويصدّقوا { إِذْ جَآءَهُمُ ٱلْهُدَىٰ } أي: النبيُ الهادي المؤيدُ بالكتاب المعجز المرشد { وَ } صرفهم أيضاً أن { يَسْتَغْفِرُواْ } ويتوبوا عن ظهر القلب عقيبَ كل معصيةٍ\n نادمين عنها بلا إصرارٍ وإدمان\n ليسقط عنهم الأخذ والانتقام { رَبَّهُمْ إِلاَّ أَن تَأْتِيَهُمْ } ويحيط بهم { سُنَّةُ ٱلأَوَّلِينَ } من الإهلاك والاستئصال بغتةً { أَوْ يَأْتِيَهُمُ ٱلْعَذَابُ قُبُلاً } [اكهف: 55] أي: أنواعاً وأصنافاً منه\n مترادفةً متواليةً كالكسف والخسف والمسخ وغير ذلك\n فيهلكهم على سبيل التدريج\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما منع الناسَ } أي: أهل مكة الذين حكيت أباطيلهم\n من { أن يؤمنوا } بالله تعالى\n ويتركوا ما هم فيه من الإشراك\n { إِذْ جاءهُم الهُدَى } أي: حين جاءهم القرآن الهادي إلى الإيمان\n بسبب ما فيه من فنون العلوم وأنواع الإعجاز\n فيؤمنوا\n { ويستغفروا ربهم } عما فرط منهم من أنواع الذنوب\n التي من جملتها: مجادلتهم للحق بالباطل\n { إِلا أن تأتيهم سُنَّةُ الأولين } أي: ما منعهم إلا إتيان سنة الأولين\n وهو نزول العذاب المستأصل أو انتظاره\n فيكون على حذف مضاف\n أي: انتظار سنة الأولين\n وهو الهلاك\n قال ابن جزي: معناها أن المانع للناس من الإيمان والاستغفار هو القضاء عليهم بأن تأتيهم سُنَّة الأمم المتقدمة\n وهي الإهلاك في الدنيا\n أو يأتيهم العذاب أي: عذاب الآخرة\n هـ\n قلت: والظاهر أن معنى الآية: ما منعهم من الإيمان إلا انتظار آية يرونها عيانًا\n كعادة الأمم الماضية\n فيهلكوا كما هي سُنَّة الله في خلقه\n أو: عذاب ينزل بهم جهرًا\n وهو معنى قوله: { أو يأتيهم العذابُ قُبُلاً } أي: مقابلة وعيانًا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:94",
      "similarity": 0.557677639202984
    },
    {
      "verse": "15:13",
      "similarity": 0.5319040751979847
    },
    {
      "verse": "4:26",
      "similarity": 0.5269358742748252
    },
    {
      "verse": "17:77",
      "similarity": 0.4700712813764028
    },
    {
      "verse": "70:21",
      "similarity": 0.46034906015004673
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/018055.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/018055.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}