{
  "chapter": "الكهف",
  "text": "وتلك القرى اهلكنهم لما ظلموا۟ وجعلنا لمهلكهم موعدا",
  "translations": [
    {
      "translation": "As for these habitations, We destroyed them only when they transgressed; even so We had fixed a time for their annihilation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the townships afflicted with scourge are before your eyes. When they committed wrong, We destroyed them. For the destruction of each We had set a definite term.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We only destroyed the inhabitants of certain towns when they had committed injustice and did not repent before Our deadline.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And these towns – We destroyed them when they committed injustice, and We had set an appointed time for their destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And these towns, We destroyed them when they did wrong. And We appointed a fixed time for their destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) these towns, We destroyed them when they acted unjustly, and We have appointed a time for their destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those cities, We destroyed them when they did evil, and appointed for their destruction a tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (all) those townships! We destroyed them when they did wrong, and We appointed a fixed time for their destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We destroyed these communities when they went on doing wrong, and We appointed a time for their destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And these cities! We destroyed them when they did wrong, and We had appointed for their destruction a tryst.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the towns that We destroyed when they were wrongdoers, and We appointed a tryst for their destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such were the populations we destroyed when they committed iniquities; but we fixed an appointed time for their destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And these towns (population, 'Ad, Thamud, etc.) We destroyed when they did wrong. And We appointed a fixed time for their destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those villages! When they became evil We destroyed them and appointed a meeting for their destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And these towns—We destroyed them when they committed injustices, and We set for their destruction an appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those cities - We destroyed them when they wronged, and We made for their destruction an appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:59] And those towns, that is to say, the inhabitants of those [towns], such as ‘Ād and Thamūd, as well as others, We destroyed them when they did evil, [when] they disbelieved, and We appointed for their destruction (a variant reading [for mahlikihim] has muhlakihim) a tryst.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (all) those townships!) And all the people of the townships of old (We destroyed them when they did wrong) when they disbelieved, (and We appointed a fixed time for their destruction).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَتِلْكَ ٱلْقُرَىٰ } التي في مرآك أطلالهم، وآثار منازلهم ومزارعهم { أَهْلَكْنَاهُمْ لَمَّا ظَلَمُواْ } أي: حين خرجوا عن مقتضى حدودنا وأوامرنا ونواهينا المنزلة في كتبنا لرسلنا وكذبوهم وأنكروا عليهم { وَ } من سنتنا القديمة أنَّا متى أردنا إهلاك قريةٍ من المستوجبين للمقت والهلاك { جَعَلْنَا لِمَهْلِكِهِم } أي: هلاكهم وإهلاكهم { مَّوْعِداً } [الكهف: 59] وقتاً معيناً حين وصلوا إليها هلكوا حتماً مقضياً؛ إذ لا مردّ لقضائنا المبرم، ولا معقّب لحكمنا المحكم\n\n\n\n\n{ وَ } اذكر يا أكمل الرسل قصة موسى الكليم عليه السلام وإعجباه لنفسه حين خطب على المنبر بعد هلاك القبط، ودخوله ملك مصر خطبةً عجيبةً بليغةً إلى حيث رقّت القلوب وذرفت العيون، فقيل له، هل في الأرض أعلم منك؟\n\n\n\nقال: لا\n\n\n\n\nفعتب عليه سبحانه لإعجابه، فقال سبحانه: \" إن لنا في مجمع البحرين عبداً هو أعلم منك \"\n\n\n\n\nفقال موسى عليه السلام: دلني عليه يا ربي؛ لأخدمه وأتعلم منه، وأستفيد من فتوحات أنفاسه الشريفة\n\n\n\n\nفقال له سبحانه: \" خذ حوتاً مملوحاً يكون زاداً لك واطلبه، فحيث فقدت الحوت فهو ثمة \" فأخذ ومضى على الوجه المأمور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وتلك القرى } أي: قرى عاد وثمود وأضرابها، أي: وأهل تلك القرى { أهلكناهم } بالعذاب { لمَّا ظلموا } أي: وقت ظلمهم، كما فعلت قريش بما حكى عنهم، { وجعلنا لمهلكهم } أي: عَيَّنَّا لهلاكهم { موعدًا } أي: وقتًا مُعَينًا، لا محيدَ لهم عن ذلك، فلتعتبر قريش بذلك ولا تغتر\n والله تعالى أعلم\n الإشارة: قد صرّف الله في كتابه العزيز كل ما يحتاج إليه العباد، من علم الظاهر والباطن، لكن خوض القلوب فيما لا يعني، وكثرة مجادلتها بالباطل، صرفتها عن فهم أسرار الكتاب واستخراج غوامضه\n\n\nفمن صفت مرآة قلبه أدرك ذلك منه\n وتصفيتها بصحبة أهل الصفاء، وهم العارفون بالله، ولا تخلو الأرض منهم حتى يأتي أمر الله، وما منع الناس من الإيمان بهم وتصديقهم إلا انتظارهم ظهور كرامتهم، ونزول العذاب على من آذاهم، وهو جهل بطريق الولاية لأنهم رحمة للعباد، أرسلهم الحق تعالى في كل زمان، يُذكِّرون الناس بالتحذير والتبشير، وبملاطفة الوعظ والتذكير، فاتخذهم الناس وما ذكروا به هزوًا ولعبًا، حيث حادوا عن تذكيرهم، ونفروا عن صحبتهم، فلا أحد أظلم ممن ذُكِّر بالله وبآياته فأعرض واستكبر ونسي ما قدمت يداه من المعاصي والأوزار، سَبَبُ ذلك: جَعْلُ الأكنة على القلوب، وسَفْحُ رَانِ المعاصي والذنوب، فلا يفقهون وعظًا ولا تذكيرًا، ولا يستمعون تحذيرًا ولا تبشيرًا، وإن تدعهم إلى الهدى والرجوع عن طريق الردى، فلن يهتدوا إذًا أبدًا لِمَا سبق لهم في سابق القضاء، فلولا مغفرته العامة، ورحمته التامة، لعجل لهم العذاب، لكن له وقت معلوم، وأجل محتوم، لا محيد عنه إذا جاء، ولا ملجأ منه ولا منجا\n نسأل الله العصمة بمنِّه وكرمه\n\n",
      "translations": []
    }
  ]
}