{
  "chapter": "الكهف",
  "text": "قال ذلك ما كنا نبغ فارتدا على ءاثارهما قصصا",
  "translations": [
    {
      "translation": "He said, 'That is the very thing that we were looking for!' So, following their footsteps, they retraced their route.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"But that is exactly what we were seeking.\" So they retraced their steps.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"That is what we were looking for.\" So the two turned back, retracing their footsteps,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"That is exactly what we are seeking. They followed their own foot prints back (to the rock).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moosa, “This is exactly what we wanted”; so they came back retracing their steps.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Musa] said: \"That is what we have been seeking.\" So they went back retracing their footsteps.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: This is what we sought for; so they returned retracing their footsteps.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'This is what we were seeking!' And so they returned upon their tracks, retracing them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: This is that which we have been seeking. So they retraced their steps again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"That is just what we were looking for.\" So they went back the way they had come,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said: that is that which we have been seeking. So they turned back upon their footsteps, retracing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘That is what we were after!’ So they returned, retracing their footsteps.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"That was what we were seeking after:\" So they went back on their footsteps, following (the path they had come).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Musa (Moses)] said: \"That is what we have been seeking.\" So they went back retracing their footsteps.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is what we have been seeking' said he, and they retraced their footsteps\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “This is what we were seeking.” And so they turned back retracing their steps.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Moses] said, \"That is what we were seeking.\" So they returned, following their footprints.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:64] Said he, Moses, ‘That, namely, our losing the fish, is what we have been seeking!’, what we have been after, for it is a sign for us of the presence of the one whom we seek. So they turned back, retracing their footsteps, until they reached the rock.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Moses said: (This is that which we have been seeking) as an indication from Allah to Khidr (they retraced their steps again) they went back, following their own footsteps.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱرْتَدَّا عَلَىٰ آثَارِهِمَا قَصَصاً } معناه يَقُصَّانُ الأَثرَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { قصصًا }: مصدر، أي: يقصان قصصًا\n يقول الحقّ جلّ جلاله: ثم إن موسى ويوشع - عليهما السلام - حملا حوتًا مشويًا وخُبزًا، وسارا يلتمسان الخضر، { فلما بلغا مَجْمَعَ بينهما } بين البحرين، أو مجمع وصل بعضهما ببعض، وجدا صخرة هناك، وعندها عين الحياة، لا يصيب ذلك الماءُ شيئًا إلا حَيِيَ بإذن الله، وكانا وَصَلاَ إليها ليلاً، فناما، فلما أصاب السمكة رَوْحُ الماء وبردُه اضطرب في المِكْتَلِ، ودخل البحر، وقد كانا أَكَلاَ منه، وكان ذلك بعد استيقاظ يوشع، وقيل: توضأ عليه السلام من تلك العين، فانتضح الماء على الحوت، فحيى ودخل البحر، فاستيقظ موسى، وذهبا، و { نَسِيَا حوتَهما } أي: نسيا تفقد أمره وما يكون منه، أو نسي يوشع أن يعلمه، وموسى عليه السلام أن يأمر فيه بشيء، { فاتخذ } الحوت { سبيله } أي: طريقه { في البحر سَرَبًا } مسلكًا كالطّاق، قيل: أمسك الله جرية الماء على الحوت فجمد، حتى صار كالطاق في الماء معجزة لموسى أو الخضر - عليهما السلام -\n فلما جاوزا مجمع البحرين، الذي جُعل موعدًا للملاقاة، وسارا بقية ليلتهما ويومهما إلى الظهر، وجد موسى عليه السلام حَرَّ الجوع، فـ { قال لفتاه آتنا غداءنا } أي: ما نتغدى به، وهو الحوت، كما يُنبئ عنه الجواب، { لقد لَقِينا من سفرنا هذا نصبًا }: تعبًا وإعياء\n قيل: لم يَنْصَبْ موسى ولم يَجُعْ قبل ذلك، ويدل عليه الإتيان بالإشارة، وجملة { لقد لقينا }: تعليل للأمر بإيتاء الغذاء، إما باعتبار أن النَّصَب إنما يعتري بسبب الضعف الناشئ عن الجوع، وإمَّا باعتبار ما في أثناء التغذي من استراحة مَّا\n { قال } فتاه عليه السلام: { أرأيت إذ أوينا إِلى الصخرة } أي: التجأنا إليها ونِمنا عندها، { فإني نسيتُ الحوت } أي: أخبرني ما دهاني حتى لم أذكر لك أمر الحوت، فإني نسيتُ أن أذكر لك أمره، ومراده بالاستفهام تعجيب موسى عليه السلام مما اعتراه من النسيان، مع كون ما شاهده من العظائم التي لا تكاد تنسى، { وما أنسانيهُ إِلا الشيطانُ } بوسوسته الشاغلة له عن ذلك، { أن أذكره } ، ونسبته للشيطان هضمًا لنفسه، واستعمال الأدب في نسبة النقائص إلى الشيطان، وإن كان الكل من عند الله\n\n\nوهذه الحالة، وإن كانت غريبة لا يعهد نسيانها، لكنه قد تعَوَدَّ بمشاهدة أمثالها من الخوارق مع موسى عليه السلام، وأَلِفَهَا قبل اهتمامه بالمحافظة عليها، أو لاستغراقه وانجذاب سره إلى جناب القدس، حتى غاب عن الإخبار بها\n { قلت }: والظاهر أن نسيانه كان أمرًا إلهياً قهريًا بلا سبب، وحكمتُه ما لقي من النصب لتعظُم حلاوة العلم الذي يأخذه عن الخضر عليه السلام، فإن المُساق بعد التعب ألذ من المساق بغير تعب، ولذلك: \" حفت الجنة بالمكاره \"\n ثم قال: { واتخذ } الحوتُ { سبيلَه في البحر عَجَبًا } ، فيه حذف، أي فحيى الحوت، واضطرب، ووقع في البحر، واتخذ سبيله فيه سبيلاً عجبًا، أو اتخاذًا عجبًا يُتعجب منه، وهو كون مسلكه كالطاق، { قال } موسى عليه السلام: { ذلك ما كنا نبغ } أي: ذلك الذي ذكرت من أمر الحوت هو الذي كُنا نطلبه لكونه أمارة للفوز بالمرام، { فارتدَّا } أي: رجعا { على } طريقهما الذي جاءا منه، يَقُصَّان\n يتبعان { آثارِهما قَصَصًا } ، حتى أتيا الصخرة { فوجدا عبدًا من عبادنا } ، التنكير للتفخيم والإضافة للتعظيم، وهو الخضر عليه السلام عند الجمهور، واسمه: بَلْيَا بن مَلْكَان يُعْصوا، والخضر لقب له لأنه جلس على فروةٍ بيضاء فاهتزّت تحته خضراء، كما في حديث أبي هريرة - عنه - صلى الله عليه وسلم\n وقال مجاهد: سمي خضرًا لأنه كان إذا صلى خضر ما حوله، ثم قال: وهو ابن عابر بن شالِخ بن أرفخشد بن سام بن نوح، وكان أبوه ملكًا\n هـ\n وفي الحديث أن النبي صلى الله عليه وسلم ذكر قصة الخضر، فقال:\n\n \" كان ابن ملك من الملوك، فأراد أبوه أن يستخلفه من بعده، فأبى وهرب، ولحق بجزائر البحر، فلم يقدر عليه \" \n\nقيل إنه شرب من عين الحياة فمُتع بطول الحياة\n رُوِيَ أن موسى عليه السلام حين انتهى إلى الصخرة رأى الخضر عليه السلام على طنْفَسَةٍ - أي: بساط - على وجه الماء، فسلم عليه\n وعنه - عليه الصلاة والسلام - أنه قال:\n\n \" انتهى موسى إلى الخضر، وهو نائم مُسَجى عليه ثوب، فسلَّمَ عليه فاستوى جالسًا، وقال: عليك السلام يا نبي بني إسرائيل، فقال موسى: من أخبرك أني نبي بني إسرائيل؟ قال: الذي أدراكَ بي، ودلك عليَّ \" \n",
      "translations": []
    }
  ]
}