{
  "chapter": "الكهف",
  "text": "فلما بلغا مجمع بينهما نسيا حوتهما فاتخذ سبيله فى البحر سربا",
  "translations": [
    {
      "translation": "When they reached the confluence they forgot the fish (they had brought as food) which swiftly made its way into the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they reached the point where the two rivers meet, they forgot their fish, and it took its way into the sea, as if through a tunnel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they reached the junction of the two seas they found out that they had forgotten all about the fish (which they had carried for food). The fish found its way into the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they reached the place where the two seas meet, they forgot about their fish, and it took its way into the sea, making a tunnel. (The dead fish came alive and went into the water.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they reached the junction of the two seas, they forgot their fish, and it took its way through the sea as in a tunnel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they had reached the junction of the two (rivers) they forgot their fish, and it took its way into the sea, going away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they reached their meeting, they forgot their fish, and it took its way into the sea, burrowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they reached the point where the two met, they forgot their fish, and it took its way into the waters, being free.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when at last they came to the land where the two seas met, they forgot their fish and it swiftly made its way into the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the twain reached the confluence of the two, they forgot their fish, and it took its way into the sea freely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they reached the confluence between them, they forgot their fish, which found its way into the sea, sneaking away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they reached the Junction, they forgot (about) their Fish, which took its course through the sea (straight) as in a tunnel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they reached the junction of the two seas, they forgot their fish, and it took its way through the sea as in a tunnel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they came to the point where the two met, they forgot their fish, which made its way burrowing into the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they reached the junction between them, they forgot about their fish. It found its way into the river, slipping away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they reached the junction between them, they forgot their fish, and it took its course into the sea, slipping away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:61] So when they reached a juncture between the two, between the two seas, they forgot their fish — Joshua forgot his luggage [leaving it behind] at the moment of departure, and Moses forgot to remind him — and so it, the fish, made its way into the sea, that is, it formed it — through God’s forming it — by burrowing, that is, like [through] a burrow, which is a passage that is long and enclosed; this was [so] because God, exalted be He, held back the flow of the water [preventing it] from [engulfing] the fish and it [the water] withdrew from around it [the fish] and remained thus like a cleft without closing, and what was beneath it [the cleft] stood still.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they reached the point where the two met) between the two seas, (they forgot their fish) they forgot the matter of their fish, (and it took its way into the waters, being free).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱتَّخَذَ سَبِيلَهُ فِي ٱلْبَحْرِ سَرَباً } يعني مَسلَكاً وَمذْهباً\n\n\n\n\nوقوله تعالى: { فَلَمَّا بَلَغَا مَجْمَعَ بَيْنِهِمَا } قال: هو أَفرِيقيا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا بَلَغَا مَجْمَعَ بَيْنِهِمَا } أي: بين البحرين { نَسِيَا } عند المجمع { حُوتَهُمَا } يعني: نسي موسى التفقد والاستخبار من يوشع عنه، ونسي يوشع أن يذكر لموسى ما رأى من أمر الحوت وحياته ووقوعه في الماء\n\n\n\n\nوذلك أنه عزم يوشع التوضؤ عند المجمع، وكان على شاطئ البحر صخرةُ، فتمكن يوشع عليها ليتوضأ، فانتضح الماء على مكتله، فترشح على الحوت، فوثب من المكتل، ورمى نفسه في البحر { فَٱتَّخَذَ سَبِيلَهُ فِي ٱلْبَحْرِ سَرَباً } [الكهف: 61] أي: صار الماء كالطاق يسري الحوت تحته بسهولةٍ، فتعجب يوشع من حياته ووثبته في الماء وسلوكه، فارتحلا متجاوزين من البحر تلك الليلة والغد إلى الظهر فنسي يوشع ذكرَ ما رأى لموسى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { بينهما }: ظرف مضاف إليه اتساعًا، أو بمعنى الوصل، و { سَرَبًا }: مفعول ثان لاتخذ، و { إذ أوينا }: متعلق بمحذوف، أي: أخبرني ما دهاني حين أويتُ إلى الصخرة حتى لم أخبرك بأمر الحوت، فإني نسيتُ أن أذكر لك أمره",
      "translations": []
    }
  ]
}