{
  "chapter": "الكهف",
  "text": "فوجدا عبدا من عبادنا ءاتينه رحمة من عندنا وعلمنه من لدنا علما",
  "translations": [
    {
      "translation": "They found a slave of Ours whom We had granted mercy from Us and whom We had also given knowledge direct from Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they found one of Our votaries, whom We had blessed and given knowledge from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there they found one of Our servants upon whom We had bestowed Our mercy, and to whom We had imparted a special knowledge from Ourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they met one of Our servants who had received blessings and knowledge from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they found a bondman* from amongst Our (chosen) bondmen, to whom We had given mercy from Us, and had bestowed the inspired knowledge from Ourselves. (* Hazrat Khidr – peace be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they found one of Our servants, on whom We had bestowed mercy from Us, and whom We had taught knowledge from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they found one from among Our servants whom We had granted mercy from Us and whom We had taught knowledge from Ourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they found one of Our servants unto whom We had given mercy from Us, and We had taught him knowledge proceeding from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then found they one of Our slaves, unto whom We had given mercy from Us, and had taught him knowledge from Our presence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they found one of Our servants to whom We had granted Our mercy and had given a knowledge from Ourself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the twain found a bondman from Our bondmen, him We had vouchsafed a mercy from before Us, and him We had taught from Our presence a knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[There] they found one of Our servants whom We had granted a mercy from Ourselves, and taught him a knowledge from Our own.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they found one of Our servants, on whom We had bestowed Mercy from Ourselves and whom We had taught knowledge from Our own Presence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they found one of Our slaves, unto whom We had bestowed mercy from Us, and whom We had taught knowledge from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and found one of Our worshipers to whom We had given from Our Mercy, and to whom We had taught knowledge of Ours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they came upon a servant of Ours, whom We had blessed with mercy from Us, and had taught him knowledge from Our Own.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they found a servant from among Our servants to whom we had given mercy from us and had taught him from Us a [certain] knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:65] So [there] they found one of Our servants, namely, al-Khidr, to whom We had given mercy from Us — according to one opinion this [mercy] was prophethood; according to another it was authority, and this [latter] is the opinion of the majority of scholars — and We had taught him knowledge from Us (‘ilman is the second direct object), in other words, some knowledge of unseen things; al-Bukhārī reports the [following] hadīth: ‘Moses was delivering a sermon among the Children of Israel and was asked, “Who is the most knowledgeable of people?”, to which he [Moses] said, “Myself”. God then reproached him for not having attributed [his] knowledge as [coming] from Him. God then revealed to him the following: “Truly, there is a servant of Mine at the juncture of the two seas; he is more knowledgeable than you”. Moses then asked, “My Lord, how do I reach him?” He [God] said, ‘Take a fish with you and place it in a basket and [the place] where you lose the fish will be [the place] where he is.” He [Moses] took a fish and placed it in a basket and departed together with his lad Joshua son of Nun until they reached the rock. [There] they placed their heads back and fell asleep. The fish began to move about in the basket, until it escaped from it and fell into the sea, and it made its way into the sea in an amazing manner. God then held back the flow of the water [preventing it] from [engulfing] the fish, forming a kind of arch over it. When he awoke, his companion [Joshua] forgot to inform him of [what had happened to] the fish, and so they journeyed on for the remainder of that day and night until on the morning [of the second day] Moses said to his lad, ‘Bring us our breakfast’, to where he says, and it made its way into the sea in an amazing manner’. He [Bukhārī] said, ‘For   the fish, it [the way into the sea] was [by] ‘burrowing’ (saraban), and for Moses and his lad it [this way] was ‘amazing’ (‘ajaban) …’ [and so on] to the end [of Bukhārī’s report].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then found they) at the rock (one of Our slaves) i.e. Khidr, (unto whom We had given mercy from Us) He says: We favoured him with prophethood, (and had taught him knowledge from Our presence) the knowledge of future events.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وهو عبد من عباد الله مخصوص بمزية عناية ورحمة { آتيناه رحمة من عندنا } أي: كمالاً معنوياً بالتجرّد عن المواد والتقدّس عن الجهات\n والنورية المحضة التي هي آثار القرب والعندية { وعلمناه من لدنا علماً } من المعارف القدسية والحقائق الكلية اللدنية بلا واسطة تعليم بشريّ\n وقوله: { هل أتبعك } هو ظهور إرادة السلوك والترقي إلى الكمال { إنك لن تستطيع معي صبراً } لكونك غير مطلع على الأمور الغيبية والحقائق المعنوية لعدم تجرّدك واحتجابك بالبدن وغواشيه\n فلا تطيق مرافقتي\n وهذا معنى قوله: { وكيف تصبر على ما لم تحط به خبراً قال ستجدني إن شاء الله صابراً } لقوّة استعدادي وثباتي على الطلب { ولا أعصي لك أمراً } لتوجهي نحوك وقبولي أمرك\n لصفائي وصدق إرادتي\n والمقاولات كلها بلسان الحال\n { فإن اتّبعتني } في سلوك طريق الكمال { فلا تسألني عن شيء } أي: عليك بالاقتداء والمتابعة في السير بالأعمال والرياضات والأخلاق والمجاهدات\n ولا تطلب الحقائق والمعاني { حتى } يأتي وقته\n فـ { أحدث لك منه } أي: من ذلك العلم { ذكراً } وأخبرك بالحقائق الغيبية عند تجرّدك بالمعاملات القالبية والقلبية { فانطلقا حتى إذا ركبا } في سفينة البدن البالغ إلى حدّ الرياضة الصالح للعبودية إلى العالم القدسي في بحر الهيولى للسير إلى الله { خرقها } أي: نقصها بالرياضة وتقليل الطعام وأضعف احكامها وأوقع الخلل في نظامها وأوهنها { قال أخرقتها لتغرق أهلها } أي: أكسرتها لتغرق القوى الحيوانية والنباتية التي فيها في بحر الهيولى فتهلك { لقد جئت شيئاً إمراً } وهذا الإنكار عبارة عن ظهور النفس بصفاتها وميل القلب إليها\n والتضجر عن حرمان الحظوظ في الرياضة\n وعدم القناعة بالحقوق\n { قال ألم أقل إنك لن تستطيع معي صبراً } تنبيه روحي وتحريض قدسي على أن العزيمة في السلوك يجب أن تكون أقوى من ذلك { قال لا تؤاخذني بما نسيت } إلى آخره\n اعتذاره في مقام النفس اللوّامة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لأنه { مِّنْ } خُلَّص { عِبَادِنَآ } وخيارهم\n لأنا من وفور جودنا وإنعامنا عليه { آتَيْنَاهُ } أعطيناه { رَحْمَةً } كشفاً وشهوداً تاماً موهوباً له { مِّنْ عِندِنَا } تفضلاً بلا عملٍ له في مقابلتها يقتضي ذلك { وَ } مع ذلك { عَلَّمْنَاهُ مِن لَّدُنَّا } بلا وسائل الكسب والتعلم والطب والاستفادة\n بل بمجرد توفيقنا وفضلنا إياه امتناناً له وإحساناً عليه { عِلْماً } [الكهف: 65] متعلقاً بالغيوب\n\n حيث أخبر بما وقع ويقع وسيقع\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n حتى أتيا الصخرة { فوجدا عبدًا من عبادنا } \n التنكير للتفخيم والإضافة للتعظيم\n وهو الخضر عليه السلام عند الجمهور\n واسمه: بَلْيَا بن مَلْكَان يُعْصوا\n والخضر لقب له لأنه جلس على فروةٍ بيضاء فاهتزّت تحته خضراء\n كما في حديث أبي هريرة - عنه - صلى الله عليه وسلم\n وقال مجاهد: سمي خضرًا لأنه كان إذا صلى خضر ما حوله\n ثم قال: وهو ابن عابر بن شالِخ بن أرفخشد بن سام بن نوح\n وكان أبوه ملكًا\n هـ\n وفي الحديث أن النبي صلى الله عليه وسلم ذكر قصة الخضر\n فقال:\n \" كان ابن ملك من الملوك\n فأراد أبوه أن يستخلفه من بعده\n فأبى وهرب\n ولحق بجزائر البحر\n فلم يقدر عليه \" \nقيل إنه شرب من عين الحياة فمُتع بطول الحياة\n رُوِيَ أن موسى عليه السلام حين انتهى إلى الصخرة رأى الخضر عليه السلام على طنْفَسَةٍ - أي: بساط - على وجه الماء\n فسلم عليه\n وعنه - عليه الصلاة والسلام - أنه قال:\n \" انتهى موسى إلى الخضر\n وهو نائم مُسَجى عليه ثوب\n فسلَّمَ عليه فاستوى جالسًا\n وقال: عليك السلام يا نبي بني إسرائيل\n فقال موسى: من أخبرك أني نبي بني إسرائيل؟ قال: الذي أدراكَ بي\n ودلك عليَّ \" \nقال تعالى في حق الخضر: { آتيناه رحمةً من عندنا } \n هي الوحي والنبوة\n كما يُشعر به تنكير الرحمة\n وإضافتها إلى جناب الكبرياء\n وقيل: هي سر الخصوصية\n وهي الولاية\n { وعلَّمناه من لَّدُنَّا عِلْمًا } خاصًا\n لا يكتنه كُنْهه\n ولا يُقدر قدره\n وهو علم الغيوب\n أو أسرار الحقيقة\n أو علم الذات والصفات\n علمًا حقيقيًا\n فالخضر عليه السلام قيل: إنه نبي بدليل قوله فيما يأتي: { وما فعلته عن أمري } \n وقيل: وَلِيٌّ\n واخْتلف: هل مات\n أو هو حي؟ وجمهور الأولياء: أنه حي\n وقد لقيه كثيرٌ من الصلحاء والأولياء\n حتى تواتر عنهم حياته\n\nوالله تعالى أعلم\n  الإشارة: إنما صار الحوت دليلاً لسيدنا موسى عليه السلام بعد موته وخروجه عن إلفه\n ثم حيى حياة خصوصية لَمَّا أنفق عليه من عين الحياة\n كذلك العارف لا يكون دالاً على الله\n وإمامًا يقتدى به حتى يموت عن شهود حسه\n ويخرق عوائد نفسه\n ويفنى عن بشريته\n ويبقى بربه\n حينئذ تحيا روحه بشهود عظمة ربه\n ويصير إمامًا ودليلاً موصلاً إليه\n ويَظهر منه خرق العوائد\n كما ظهر من الحوت\n حيث أمسك عن الماء الجرية فصار كالطَّاق\n وذلك اقتدار\n وإلى ذلك تشير أحوال الخضر\n فكان الحوت مظهرًا لحاله في تلك القصة\n قاله في الحاشية بمعناه\n وقال قبل ذلك في قوله: واتخذ سبيله في البحر عَجَبًا: أي اتخذ الحوتُ\n وجوِّزَ كونُ فاعلِ اتخذ: موسى\n أي: اتخذ موسى سبيل الحوت في البحر عجبًا وخرقَ عادةٍ بأن مشى على الماء في طريق الحوت\n حتى وجد الخضر على كبد البحر\n ثم قال: وعلى الجملة: فالقضية تشير من جهة الخضر: للاقتدار وإسقاط الأسباب\n ومن جهة موسى: لإثبات الأسباب حكمة\n وحالة الاقتدار أشرف\n وصاحب الحكمة أكمل ونفعه عام\n بخلاف الآخر\n فإن نفعه خاص\n هـ\n وقوله تعالى: { وعلّمناه من لدُنَّا علمًا } \n العلم اللدني: هو الذي يفيض على القلب من غير اكتساب ولا تعلم\n قال عليه الصلاة والسلام:\n \" من عَمِلَ بِمَا عَلِمَ أَوْرَثَهُ اللهُ علمَ مَا لَمْ يَعْلَمْ \" \nوذلك بعد تطهير القلب من النقائص والرذائل\n وتفرغه من العلائق والشواغل\n فإذا كمل تطهير القلب\n وانجذب إلى حضرة الرب\n فاضت عليه العلوم اللدنية\n والأسرار الربانية\n منها ما تفهمها العقول وتدخل تحت دائرة النقول\n ومنها ما لا تفهمها العقول ولا تحيط بها النقول\n بل تُسلم لأربابها\n من غير أن يقتدى بهم في أمرها\n ومنها ما تفيض عليهم في جانب علم الغيوب كمواقع القدر وحدوث الكائنات المستقبلة\n ومنها ما تفيض عليهم في علوم الشرائع وأسرار الأحكام\n ومنها في أسرار الحروف وخواص الأشياء\n إلى غير ذلك من علوم الله تعالى\n وبالله التوفيق\n ثمَّ تمَّم قصتهما بعد التقائهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:67",
      "similarity": 0.7314001310291093
    },
    {
      "verse": "27:6",
      "similarity": 0.7022537847058195
    },
    {
      "verse": "11:1",
      "similarity": 0.5859271898895966
    },
    {
      "verse": "17:80",
      "similarity": 0.5769279374169063
    },
    {
      "verse": "18:2",
      "similarity": 0.546955423808894
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/018065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/018065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}