{
  "chapter": "الكهف",
  "text": "قال ارءيت اذ اوينا الى الصخرة فانى نسيت الحوت وما انسىنيه الا الشيطن ان اذكره واتخذ سبيله فى البحر عجبا",
  "translations": [
    {
      "translation": "He said, 'Do you see what has happened? When we went to find shelter at the rock, I forgot the fish. No one made me forget to remember it except Shaytan. It found its way into the sea in an amazing way.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"You see, I forgot the fish on the rock where we had stopped. Only Satan made me forget to mention this; but the wonder is the fish escaped to the sea.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The servant said: \"Did you see what happened? When we betook ourselves to the rock to take rest, I forgot the fish - and it is only Satan who caused me to forget to mention it to you - so that it made its way into the sea in a strange manner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion replied, \"Do you remember the rock on which we took rest? Satan made me forget to mention to you the story of the fish and how it miraculously made its way into the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Just imagine – when we had taken shelter near the rock, so indeed I forgot the fish; and none but Satan caused me to forget to mention it; and the fish took its way into the sea – its amazing!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Do you remember when we betook ourselves to the rock I indeed forgot the fish; none but Shaytan made me forget to remember it. It took its course into the sea in a strange (way)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Did you see when we took refuge on the rock then I forgot the fish, and nothing made me forget to speak of it but the Shaitan, and it took its way into the river; what a wonder!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'What thinkest thou? When we took refuge in the rock, then I forgot the fish-and it was Satan himself that made me forget it so that I should not remember it -- and so it took its way into the sea in a manner marvellous.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Didst thou see, when we took refuge on the rock, and I forgot the fish - and none but Satan caused me to forget to mention it - it took its way into the waters by a marvel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"Did you see when we were resting by the rock, that I forgot the fish? Satan made me forget it, so I did not mention it. It made its way to the sea in a miraculous way!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: lookest thou! when we betook ourselves to the rock, then forgot the fish; and naught but the Satan made me forget to mention it, and it took its way into the sea--a marvel!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Did you see?! When we took shelter at the rock, indeed I forgot about the fish—and none but Satan made me forget to mention it!—and it made its way into the sea in an amazing manner!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: \"Sawest thou (what happened) when we betook ourselves to the rock? I did indeed forget (about) the Fish: none but Satan made me forget to tell (you) about it: it took its course through the sea in a marvellous way!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said:\"Do you remember when we betook ourselves to the rock? I indeed forgot the fish, none but Shaitan (Satan) made me forget to remember it. It took its course into the sea in a strange (way)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'What do you think, I forgot the fish when we were resting on the rock. None but satan made me forget to mention this it made its way into the sea in a marvelous fashion'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Do you remember when we rested by the rock? I forgot about the fish. It was only the devil who made me forget it. And so it found its way to the river, amazingly.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Did you see when we retired to the rock? Indeed, I forgot [there] the fish. And none made me forget it except Satan - that I should mention it. And it took its course into the sea amazingly\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:63] He said, ‘Do you see? — in other words, remember, when we sheltered at the rock, in that location, indeed I forgot the fish — and none but Satan made me forget (al-shaytān, ‘Satan’, substitutes for the [suffixed pronoun] hā’ [of ansānī-hu]) to mention it (an adhkurahu, an inclusive substitution, in other words [it should be understood as] ansānī dhikrahu, ‘he [Satan] made me forget the mentioning of it’) — and it, the fish, made its way into the sea in an amazing manner’ (‘ajaban constitutes the second direct object), that is to say, Moses and his lad were amazed by it, because of what has already been explained concerning it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Joshua said: (Didst thou see) Moses, (when we took refuge on the rock, and I forgot the fish) the matter of the fish (and none but Satan caused me to forget to mention it) to you, (it took its way into the waters by a marvel) it was dry land.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إذ أوينا }: متعلق بمحذوف\n أي: أخبرني ما دهاني حين أويتُ إلى الصخرة حتى لم أخبرك بأمر الحوت\n فإني نسيتُ أن أذكر لك أمره\n و { أن أذكره }: بدل من الهاء في { أنسانيه } بدل اشتمال للمبالغة\n و { عجبًا }: مفعول ثان لاتخذ\n وقيل: إن الكلام قد تم عند قوله: { في البحر } \n ثم ابتدأ التعجب فقال: { عجبًا } أي: أَعْجَبُ عَجَبًا\n وهو بعيد\n قاله ابن جزي\n قلت: وهذا البعيد هو الذي ارتكب الهبطي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:9",
      "similarity": 0.5615651292353036
    },
    {
      "verse": "18:61",
      "similarity": 0.42436766807385057
    },
    {
      "verse": "31:16",
      "similarity": 0.382803356195937
    },
    {
      "verse": "68:48",
      "similarity": 0.36383811359432594
    },
    {
      "verse": "7:163",
      "similarity": 0.3262665392699102
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/18:63.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/18:63.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}