{
  "chapter": "الكهف",
  "text": "قال له موسى هل اتبعك على ان تعلمن مما علمت رشدا",
  "translations": [
    {
      "translation": "Musa said to him, 'May I follow you on condition that you teach me some of the right guidance you have been taught?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him: \"May I attend upon you that you may instruct me in the knowledge you have been taught of the right way?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him: \"May l follow you that you may teach me something of the wisdom which you have been taught?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses asked him, \"Can I follow you so that you would teach me the guidance that you have received?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moosa said to him, “May I stay with you upon the condition that you will teach me the righteousness that you have been taught?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said to him: \"May I follow you so that you teach me something of that knowledge which you have been taught (by Allah)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said to him: Shall I follow you on condition that you should teach me right knowledge of what you have been taught?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him, 'Shall I follow thee so that thou teachest me, of what thou hast been taught, right judgment.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said unto him: May I follow thee, to the end that thou mayst teach me right conduct of that which thou hast been taught?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him, \"May I follow you, so that you may guide me by what you have been taught?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said unto him: shall I follow thee that thou mayest teach me of that which thou hast been taught a directive knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him, ‘May I follow you for the purpose that you teach me some of the probity you have been taught?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him: \"May I follow thee, on the footing that thou teach me something of the (Higher) Truth which thou hast been taught?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa (Moses) said to him (Khidr) \"May I follow you so that you teach me something of that knowledge (guidance and true path) which you have been taught (by Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him: 'May I follow you so that you can teach me of that you have learned of righteousness'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him, “May I follow you, so that you may teach me some of the guidance you were taught?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him, \"May I follow you on [the condition] that you teach me from what you have been taught of sound judgement?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:66] Moses said to him, ‘May I follow you for the purpose that you teach me of what you have been taught [in the way] of probity?’, namely, [something] of right conduct through which I might be rightly-guided (a variant reading [for rashadan] has rushdan, ‘probity’); he asked him this because to increase [one’s] knowledge is [something which is] always sought.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Moses said unto him: May I follow thee) may I keep your company, (to the end that thou mayst teach me right conduct of that which thou hast been taught) that you may teach me guidance and that which is right?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفلما وصلا إليه وتشرّفا بشرف صحبته { قَالَ لَهُ مُوسَىٰ } على سبيل الاستفادة والاسترشاد وحسن الأدب { هَلْ أَتَّبِعُكَ } أيها المؤيد الكامل المتحقق بمراتب اليقين بتمامها الواصلُ إلى بحر الوحدة الخائضُ في لججها { عَلَىٰ أَن تُعَلِّمَنِ } وتفيدني { مِمَّا عُلِّمْتَ } من سرائر المغيبات سوابقها ولواحقها { رُشْداً } [الكهف: 66] بالتوراة؛ أي: أرشدتني مقدار استعدادي وقدُر قابليتي\n\n\n\n\nقال: يا موسى كفى بالتوراة علماً، وببني إسرائيل شغلاً\n\n\n\n\nقال موسى في جوابه: إن الله أمرني بالاستفادة والاسترشاد منك فلا تمنعني؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { رُشْدًا }: مفعول ثاني لعلمت، أو: علة لأتبعك، أو: مصدر بإضمار فعله، أو: حال من كاف { أتبعك } ، أو: على إسقاط الخافض، أي: من الرشد، وفيه لغتان: ضم الراء وسكون الشين، وفتحهما، وهو: إصابة الخير، و { خُبْرًا }: تمييز محول عن الفاعل، أي: لم يحط به خبرك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:38",
      "similarity": 0.7464157797878954
    },
    {
      "verse": "72:21",
      "similarity": 0.6797308150099513
    },
    {
      "verse": "21:51",
      "similarity": 0.6689616903727758
    },
    {
      "verse": "11:97",
      "similarity": 0.6267370133040131
    },
    {
      "verse": "72:2",
      "similarity": 0.6037201205686286
    }
  ]
}