{
  "chapter": "الكهف",
  "text": "واذ قال موسى لفتىه لا ابرح حتى ابلغ مجمع البحرين او امضى حقبا",
  "translations": [
    {
      "translation": "Remember when Musa said to his servant, 'I will not give up until I reach the meeting-place of the two seas, even if I must press on for many years.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his servant (Joshua): \"I will not give up till I reach the confluence of two oceans, or I will journey on and on.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And recount to them the story of Moses) when Moses said to his servant: \"I will journey on until I reach the point where the two rivers meet, though I may march on for ages.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Consider) when Moses said to his young companion, \"I shall continue travelling until I reach the junction of the two seas or have travelled for many years\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when Moosa said to his assistant, “I will not give up until I reach the place where the two seas meet or until I have progressed for ages.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa said to his boy-servant: \"I will not give up until I reach the junction of the two seas or a Huqub passes.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa said to his servant: I will not cease until I reach the junction of the two rivers or I will go on for years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses said to his page, 'I will not give up until I reach the meeting of the two seas, though I go on for many years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses said unto his servant: I will not give up until I reach the point where the two rivers meet, though I march on for ages.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall how Moses said to his servant, \"I shall not give up until I reach the place where both seas meet, even if it takes me years!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Musa said unto his page: I shall not cease until I reach the confluence of the two seas, or I shall go on for ages.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his lad, ‘I will go on [journeying] until I have reached the confluence of the two seas, or have spent a long time [travelling].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, Moses said to his attendant, \"I will not give up until I reach the junction of the two seas or (until) I spend years and years in travel.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa (Moses) said to his boy-servant: \"I will not give up (travelling) until I reach the junction of the two seas or (until) I spend years and years in travelling.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his (assisting) youth: 'I will not give up until I reach the point where the two seas meet even though I should go on for many years'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall when Moses said to his servant, “I will not give up until I reach the junction of the two rivers, even if it takes me years.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when Moses said to his servant, \"I will not cease [traveling] until I reach the junction of the two seas or continue for a long period.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:60] And, mention, when Moses, son of Amram (‘Imrān), said to his lad, Joshua son of Nun (Yūsha‘ bin Nūn),   who used to follow him around, serve him and acquire knowledge from him, ‘I will not give up, I will not stop journeying, until I have reached the juncture of the two seas — the point where the Byzantine sea and the Persian sea meet, beyond the east, — though I march on for ages’, for a very long time before reaching it, if it be far.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the story of Moses with Khidr. It so happened that it came to Moses's mind that there is no servant on the face of the earth who is more knowledgeable than him. And so Allah said to Moses: \"I have a servant on earth who is more obedient to Me and more knowledgeable than you, and this servant is Khidr\". Moses said: \"0 Lord! Guide me to him\". He said: \"Take with you salted fish and walk along the sea shores until you find a rock in which there is the fountain of life. Sprinkle some of the water on the fish until it comes back to life. There you will meet Khidr\". Allah said: (And when Moses said unto his servant) his servant was Shajardah Joshua ben Nun, an Israelite nobleman. He was his servant in the sense that he kept his company and served him: (I will not give up until I reach the point where the two rivers meet) where sea water meets with river water, i.e. where the Persian Gulf and the Mediterranean Sea meet, (though I march on for ages) or I will continue going on for years.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَتَّىٰ أَبْلُغَ مَجْمَعَ ٱلْبَحْرَيْنِ } قال الإِمامُ زيد بن علي عليهما السَّلامُ: وهو بَحرُ فَارس وبَحر الرّوم\n وقالَ الخِضرُ واليَاسُ هما بَحران فِي العِلمِ\n\n\n\n\nوقوله تعالى: { أَوْ أَمْضِيَ حُقُباً } معناه دهرٌ وجَمعهُما أَحقابٌ\n والحِقَبُ: السّنونُ\n واحدُها حِقْبَةٌ\n وقال: حَولاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Until he reaches the two seas,\" Imam Zayd ibn Ali said, \"This is the Sea of Fars and the Roman Sea.\"\n\n\n{The Khidr and the Yass} are two oceans of knowledge.\n\n\nAnd His saying, \"Or a long period of time,\" means time and their both a period of time.\n\n\nAnd the Hejabs: the years\n\n\nThis is one of the corners.\n He said: \"Around\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذ قال موسى لفتاه } ظاهره على ما ذكر في القصص ولا سبيل إلى إنكار المعجزات\n وأما باطنه فأن يقال: وإذ قال موسى القلب لفتى النفس وقت التعلق بالبدن: { لا أبرح } أي: لا أنفك عن السير والمسافرة\n أو لا أزال أسير { حتى أبلغ مجمع البحرين } أي: ملتقى العالمين: عالم الروح وعالم الجسم\n وهما العذب والأجاج في صورة الإنسانية ومقام القلب { أو أمضي حقباً } أي: أسير مدة طويلة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وكان خادمه { لاۤ أَبْرَحُ } أي: لا أقعد ولا أستريح من السفر { حَتَّىٰ أَبْلُغَ مَجْمَعَ ٱلْبَحْرَيْنِ } ملتقى بحر فارس والروم\n وأجد عنده من دلني الله عليه { أَوْ أَمْضِيَ } وأسير { حُقُباً } [الكهف: 6] زماناً طويلاً ومدةً مديدةً إن لم أجده هناك حتى أجده وأستفيد منه\n فرمى الحوت المشوي المملوح في مكتلٍ\n وحمله يوشع فذهبا\n وأوصى موسى لفتاه متى فقدت الحوت أخبرني\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "ولمَّا ذكر الحق جلّ جلاله قصة أهل الكهف، وكان وقع فيها عتاب للرسول - عليه الصلاة والسلام - حيث لم يستثن بتأخير الوحي، وبقوله: { ولا تقولن لشيء... } الخ، ذكر هنا قصة موسى مع الخضر - عليهما السلام - وكان سَبَبُها عتابَ الحق لموسى عليه السلام حيث لم يردَّ العلم إليه، حين قال له القائل: هل تعلم أحدًا أعلم منك؟ فقال: لا، فذكر الحق تعالى قصتهما تسليةً لنبينا عليه الصلاة والسلام بمشاركة العتاب. قلت: { لا أبرح }: ناقصة، وخبرها: محذوف: اعتمادًا على قرينة الحال إذ كان ذلك عن التوجه إلى السفر، أي: لا أبرح أسير في سفري هذا، ويجوز أن تكون تامة، من زال يزول، أي: لا أفارق ما أنا بصدده حتى أبلغ... الخ. يقول الحقّ جلّ جلاله: { و } اذكر { إذ قال موسى لفتاه } يوشع بن نون بن إفراثيم بن يوسف عليه السلام، وكان ابن أخته، سُمي فتاه إذ كان يخدمه ويتبعه ويتعلم منه العلم. والفتى في لغة العرب: الشاب، ولمَّا كانت الخدمة أكثر ما تكون من الفتيان، قيل للخادم: فتى، ويقال للتلميذ: فتى، وإن كان شيخًا، إذا كان في خدمة شيخه، فقال موسى عليه السلام: { لا أبرحُ }: لا أزال أسير في طلب هذا الرجل، يعني: الخضر عليه السلام، { حتى أبلغَ مَجْمَعَ البحرين } ، وهو ملتقى بحر فارس والروم مما يلي المشرق، وهذا مذهب الأكثر. وقال ابن جزي: مجمع البحرين: عند \" طنجة \" حيث يتجمع البحر المحيط والبحر الخارج منه، وهو بحر الأندلس. قلت: وهو قول كعب بن محمد القرضي. { أو أَمْضِيَ حُقُبًا } أي: زمنًا طويلاً أتيقن معه فوات الطلب. والحقب: الدهر، أو ثمانون سنة، أو سبعون. وسبب هذا السفر: أن موسى عليه السلام لما ظهر على مصر، بعد هلاك القبط، أمره الله تعالى أن يُذّكر قومه هذه النعمة، فقام فيهم خطيبًا بخطبة بليغة، رقَّت بها القلوب، وذرفت منها العيون، فقالوا له: من أعلم الناس؟ فقال: أنا. وفي رواية: هل تعلم أحدًا أعلم منك؟ فقال: لا. فعَتَب الله عليه إذ لم يَرُدَّ العلم إليه عزّ وجلّ، فأوحى الله إليه:\n \" أعلم منك عبدٌ لي بمجمع البحرين، وهو الخضر \" \n، وكان قبل موسى عليه السلام، وكان في مُقَدَّمَةِ ذي القرنين، فبقي إلى زمن موسى عليه السلام، وسيأتي ذكر التعريف به في محله، إن شاء الله. وقال ابن عباس رضي الله عنه: إن موسى عليه السلام سأل ربه: أيُّ عبادك أحب إليك؟ قال: الذي يذكرني ولا ينساني، قال: فأي عبادك أقضى؟ قال: الذي يقضي بالحق ولا يتبع الهوى، قال: فأي عبادك أعلم؟ قال: الذي يستقي علم الناس إلى علمه، عسى أن يصيب كلمةً تدله على هدى، أو ترده عن ردى، قال: يا رب إن كان في عبادك من هو أعلم مني فدلني عليه؟ قال: أعلم منك الخضر، قال: أين أطلبه؟ قال: على ساحل البحر عند الصخرة.\nقال: يا رب، كيف لي به؟ قال: خُذ حُوتًا في مِكْتَلٍ، فحيثما فقدتَه فهو هناك، فأخذ حُوتًا مشويًا، فجعله في مِكْتَلٍ، فقال لفتاه: إذا فقدتَّ الحوت فأخبرني، وذهبا يمشيان إلى أن اتصلا بالخضر، على ما يأتي تمامه، إن شاء الله تعالى. وحديث الخطبة هو الذي في صحيح البخاري وغيره. والله تعالى أعلم أيُّ ذلك كان. الإشارة: قصة سيدنا موسى مع الخضر - عليهما السلام - هي السبب في ظهور التمييز بين أهل الظاهر وأهل الباطن، فأهل الظاهر قائمون بإصلاح الظواهر، وأهل الباطن قائمون بتحقيق البواطن. أهل الظاهر مغترفون من بحر الشرائع، وأهل الباطن مغترفون من بحر الحقائق. قيل: هو المراد بمجمع البحرين، حيث اجتمع سيدنا موسى، الذي هو بحر الشرائع، والخضر عليه السلام، الذي هو بحر الحقائق، ولا يُفهم أن سيدنا موسى عليه السلام خال من بحر الحقائق، بل كان جامعًا كاملاً، وإنما أراد الحق تعالى أن يُنزله إلى كمال الشرف، بالتواضع في طلب زيادة العلم تأديبًا له وتربية، حيث ادعى القوة في نسبته العلم إلى نفسه، وفي الحِكَم: \" منعك أن تدعي ما ليس لك مما للمخلوقين، أَفَيُبيح لك أن تدعي وصفه وهو رب العالمين! \". وهذه عادة الله تعالى مع خواصِّ أحبائه، إذا أظهروا شيئًا من القوة، أو خرجوا عن حد العبودية، ولو أنملة، أدبهم بأصغر منهم علمًا وحالاً عناية بهم، وتشريفًا لهم لئلا يقفوا دون ذروة الكمال، كقضية الشاذلي مع المرأة التي قالت له: تَمُنُّ على ربك بجوع ثمانين يومًا، وأنا لي تسعة أشهر ما ذقت شيئًا. وكقضية الجنيد والسَّرِي في جماعة من الصوفية، حيث تكلموا في المحبة، وفاض كل واحد على قدر اتساع بحره فيها، فقامت امرأة بالباب، عليها جُبة صوف، فردت على كل واحد ما قال، حيث أظهروا قوة علمهم، فأدبهم بامرأة. ويؤخذ من طلب موسى الخضر - عليهما السلام - والسفر إليه: الترغيب في العلم، ولا سيما علم الباطن، فطلبه أمر مؤكد. قال الغزالي رضي الله عنه: هو فرض عين إذ لا يخلو أحد من عيب إو إصرار على ذنب، إلا الأنبياء - عليهم السلام - وقد قال الشاذلي رضي الله عنه: من لم يغلغل في علمنا هذا مات مُصرًا على الكبائر وهو لا يشعر. وبالله التوفيق. ثمَّ ذكر بقية القصة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:23",
      "similarity": 0.589649960440591
    },
    {
      "verse": "20:91",
      "similarity": 0.4254573139584524
    },
    {
      "verse": "12:80",
      "similarity": 0.3614698098224589
    },
    {
      "verse": "43:8",
      "similarity": 0.2628020755525442
    },
    {
      "verse": "8:38",
      "similarity": 0.2507511166185013
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/18:60.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/18:60.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:60.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}