{
  "chapter": "الكهف",
  "text": "قال انك لن تستطيع معى صبرا",
  "translations": [
    {
      "translation": "He said, 'You will not be able to bear with me.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"You will not be able to bear with me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answered: \"You will surely not be able to bear with me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"You will not be able to have patience with me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “You will never be able to patiently stay with me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Verily, you will not be able to have patience with me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Surely you cannot have patience with me\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'Assuredly thou wilt not be able to bear with me patiently.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Lo! thou canst not bear with me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"You will not be able to bear with me patiently.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: verily thou wilt not be able to have with me patience;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Indeed you cannot have patience with me!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The other) said: \"Verily thou wilt not be able to have patience with me!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Khidr) said: \"Verily! You will not be able to have patience with me!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not bear patiently with me' He replied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “You will not be able to endure with me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Indeed, with me you will never be able to have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:67] Said he, ‘Truly you will not be able to bear with me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Moses: (Lo! thou canst not bear with me) for you may see me doing something that you will not be able to bear. 320\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما ألحَ موسى { قَالَ إِنَّكَ } يا موسى بكمالك في العلوم الظاهرية المتعقلة بوضوح القواعد الدينية، ونصب المعالم الشرعية، وانتصاف الظالم من المظلوم، وانتقامه لأجله إلى غير ذلك من الأمورم السياسية { لَن تَسْتَطِيعَ } وتقدر { مَعِيَ صَبْراً } [الكهف: 67] بل لا بدَّ لك متى اطلعت على ما يخالف الشريعة والوضع المخصوص الذي جئت به من عند ربك، ونزلتْ التوراةُ على مقتضاه، فعليك أن تمنعه أو تعترض عليه على مقتضى نبوتك ورسالتك على سبيل الوجوب، والذي أنا عليه من العلوم المتعلقة بالسرائر والغيوب قد يخالف أصلك وقواعدك فلن تستطيع حينئذٍ معي صبراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { لا أعصي }: عُطِفَ على: { صابرًا }\n يقول الحقّ جلّ جلاله: ولما اتصل موسى بالخضر - عليهما السلام - استأذنه في صحبته ليتعلم منه، ملاطفة وأدباً وتواضعاً، وكذلك ينبغي لمن يريد التعلم من المشايخ: أن يتأدب ويتواضع معهم\n { قال له موسى هل أتبعك على أن تُعلّمَنِ مما علِّمت رُشدًا } أي: مما علمك الله من العلم الذي يدل على الرشد وإصابة الصواب، لعلي أرشد به في ديني\n ولا ينافي كونه نبيًا ذا شريعة أن يتعلم من غيره من أسرار العلوم الخفية إذ لا نهاية لعلمه تعالى، وقد قال له تعالى فيما تقدم: أعلم الناس من يبتغي علم غيره إلى علمه\n رُوي أنهما لما التقيا جلسا يتحدثان، فجاءت خُطافة أو عصفور فنقر في البحر نقرة أو نقرتين، فقال الخضر: يا موسى خطر ببالك أنك أعلم أهل الأرض؟ ما علمك وعلمي وعلم الأولين والآخرين في جنب علم الله إلا أقل من الماء الذي حمله هذا العصفور\n ولَمَّا سأله صُحْبَتَهُ { قال } له: { إِنك لن تستطيع معيَ صبرًا } لأنك رسول مكلف بحفظ ظواهر الشرائع، وأنا أطلعني الله تعالى على أمور خفية، لا تتمالك أن تصبر عنها لمخالفة ظاهرها للشريعة\n وفي صحيح البخاري:\n\n \" قال له الخضر: يا موسى، إني على علم من علم الله عَلَّمَنِيهِ، لا تعلمه أنت، وأنتَ على علمٍ من علم الله علَّمكَه الله، لا أعلمه \" \n\nثم علّل عدم صبره بقوله: { وكيف تصبرُ على ما لم تُحط به خُبْرًا }؟ لأني أتولى أموراً خفية لا خُبر لك بها، وصاحب الشريعة لا يُسلم لصاحب الحقيقة العارية من الشريعة، { قال } له موسى عليه السلام: { ستجدني إِن شاء الله صابرًا } معك، غير مُعترض عليك\n وتوسيط الاستثناء بين مفعولي الوجدان لكمال الاعتناء بالتيمن، ولئلا يتوهم تعلقه بالصبر، { ولا أعصي لك أمرًا } ، هو داخل في الاستثناء، أي: ستجدني إن شاء الله صابرًا وغير عاص\n وقال القشيري: وَعَدَ من نفسه شيئين: الصبر، وألاَّ يعصيه فيما يأمره به\n فأما الصبر فَقَرنَه بالمشيئة، حتى وجده صابرًا، فلم يقبضْ على يدي الخضر فيما كان منه من الفعل\n والثاني قال: { ولا أعصي لك أمراً } ، فأطلق ولم يستثن، فعصى، حيث قال له الخضر: { فلا تسألني عن شيء } ، فكان يسأله، فبالاستثناء لم يخالف، وبالإطلاق خالف\n هـ\n قال شيخ شيوخنا سيدي عبد الرحمن الفاسي: وفيه نظر للحديث الصحيح:\n\n\n\n \" يرحم الله موسى، لو صبر\n\n\n \" \n\nمع أن قوله: \" ولا أعصي\n\n\n \" الخ، غير خارج عن الاستثناء، كما تقدم، وإن احتمل خروجه، والظاهر: أن الاستثناء، كالدعاء، إنما ينفع إذا صادف القدر، وهو هنا لم يصادف، مع أنه هنا عارضه علم الخضر بكونه لم يصبر من قوله: { لن تستطيع معي صبرًا } ، وقد أراد الله نفوذ علم الخضر\n هـ\n وقال ابن البنا: أن العهد إنما هو على قدر الاستطاعة، وإن الوفاء بالملتزم إنما يكون فيما لا يخالف الشرع، فلا طاعة لمخلوق في معصية الخالق لأن موسى عليه السلام لم يلتزم إلا ذلك\n ولمّا رأى ما هو محرم تكلم\n\n\n فافهم\n هـ\n ثم شرط عليه التسليم لِمَا يرى، فقال: { فإِن اتبعتني فلا تسالني عن شيء } تشاهده من أفعالي، فهمْتَه أم لا، أي: لا تفاتحني بالسؤال عن حكمته، فضلاً عن مناقشته واعتراضه، { حتى أُحْدِثَ لك منه ذكرًا } حتى أبتدي بيانه لك وحكمته، وفيه إيذان بأن ما يصدر منه له حكمة خفية، وعاقبة صالحة\n وهذا من أدب المتعلم مع العالم، والتابع مع المتبوع، أنه لا يعترض على شيخه بل يسأل مُسترشدًا بملاطفةٍ وأدب، وهذا في العلم الظاهر\n وسيأتي في الإشارة ما يتعلق بعلم الباطن\n الإشارة: قد أخذ الصوفية - رضي الله عنهم - آداب المريد مع الشيخ من قضية الخضر مع موسى - عليهما السلام - فطريقتهم مبنية على السكوت والتسليم، حتى لو قال لشيخه: لِمَ؟ لَمْ يفلح أبدًا، سواء رأى من شيخه منكرًا أو غيره، ولعله اختبار له في صدقه، أو اطلع على باطن الأمر فيه، فأحوالهم خضرية، فالمريد الصادق يُسلم لشيخه في كل ما يرى، ويمتثل أمره في كل شيء، فَهِم وجه الشريعة فيه أم لا، هذا في علم الباطن، وأما علم الظاهر فمبني على البحث والتفتيش، مع ملاطفة وتعظيم\n قال الورتجبي: امتحن الحق تعالى موسى عليه السلام بصحبة الخضر لاستقامة الطريقة ولتقويم السنة في متابعة المشايخ، ويكون أسوة للمريدين والقاصدين في خدمتهم أشياخ الطريقة\n هـ\n قال القشيري في قوله: { فلا تسالن عن شيء }: قال: ليس للمريد أن يقول لشيخه: لِمَ، ولا للمتعلم أن يقول لأستاذه، ولا للعامي أن يقول للمفتي فيما يفتي ويحكم: لِمَ\n هـ\n وقال ابن البنا في تفسيره: يُؤخذ من هذه القصة: ترك الاعتراض على أولياء الله إذا ظهر منهم شيء مخالف للظاهر لأنهم فيه على دليل غير ظاهر لغيرهم، اللهم إلا أن يدعوك إلى اتباعه، فلا تتبعه إلا عن دليل، ويُسلم له في حاله، ولا تعترض عليه، ولا يمنعك ذلك من طلب العلم والتعلم منه، وإن كنت لا تعمل بعمله لأنه لا يجب عليك تقليده إلا عن دليل، فلا تعمل مثل عمله، وأنت ترى أنه مخالف لك في ظنك، ولا علم لك بحقيقة باطن الأمر، فلا تقفُ ما ليس لك به علم\n\n\nوالله الموفق والمرشد\n هـ\n قلت: ما ذكره إنما هو في حق من لم يدخل تحت تربيته، فإنما هو طالب علم أو تبرك، وأما من التزم صحبته على طريق التربية فلا يتأخر عن امتثال ما أمره به، كيفما كان، نعم، إن لم ينبغ التوقف والتأني في الاقتداء به\n وقال في القوت في قوله: { فلا تسألن عن شيء }: الشيء في هذا الموضع وصف مخصوص من وصف الربوبية من العلم، الذي علمه الخضر عليه السلام من لدنه، لا يصلح أن يسأل عنه، من معنى صفات التوحيد ونعوت الوحدانية، لا يوكل إلى العقول، بل يخص به المراد المحمول\n هـ\n قال المحشي الفاسي: وهو - أي: المحمول - ما يرشَقْ فيهم من وصف الحق وقدرته، فيتصرفون، وهم في الحقيقة مُصرِّفُون، وهؤلاء هم أهل القبضة، الذين علَّمهم سِرَّ الحقيقة، فلهم قدرة لنفوذ شعاعها فيهم، فتتكوّن لهم الأشياء، وتنفعل لحملهم سر الحقيقة وظهورها لهم وفيهم، وهم كما قال: مرادون محمولون، فما يجري عليهم: قدر { وما رميت… } الآية\n هـ\n ثمَّ ذكر ما رآه من الخوارق\n",
      "translations": []
    }
  ]
}