{
  "chapter": "الكهف",
  "text": "فانطلقا حتى اذا ركبا فى السفينة خرقها قال اخرقتها لتغرق اهلها لقد جئت شيـا امرا",
  "translations": [
    {
      "translation": "They continued until they boarded a boat and he scuppered it. Then Musa said, 'Did you scupper it so that its owners would be drowned? This is truly a dreadful thing that you have done!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they set out till they (came to the quay) and went on board a ship in which he made a hole, (and Moses said:) \"You have made a hole in the boat to drown its passengers? You have done a strange thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the two went forth until, when they embarked on the boat, he made a hole in it, whereupon Moses exclaimed: \"Have you made a hole in it so as to drown the people in the boat? You have certainly done an awful thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They started their journey and some time latter they embarked in a boat in which he made a hole. Moses asked him, \"Did you make the hole to drown the people on board? This is certainly very strange\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they both set out; until when they had boarded the boat, the chosen bondman ruptured the boat; said Moosa, “Did you make a hole in the boat in order to drown its passengers? You have indeed done an evil thing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they both proceeded, till, when they boarded the boat, he (Khidr) damaged it. Musa said: \"Have you damaged it wherein its people will drown Verily, you have committed a thing Imr.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they went (their way) until when they embarked in the boat he made a hole in it. (Musa) said: Have you made a hole in it to drown its inmates? Certainly you have done a grievous thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they departed; until, when they embarked upon the ship, he made a hole in it. He said, 'What, hast thou made a hole in it so as to drown its passengers? Thou hast indeed done a grievous thing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they twain set out till, when they were in the ship, he made a hole therein. (Moses) said: Hast thou made a hole therein to drown the folk thereof? Thou verily hast done a dreadful thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they set out, but, when they got into a boat, the man made a hole in it. Moses exclaimed, \"Have you made a hole in the boat to drown the people in it? You have indeed done a dreadful thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the twain journeyed until when they embarked in a boat, he scuttled it. Musa said: hast thou scuttled it that thou mayest drown the people thereof? Assuredly thou hast committed a thing grievous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they went on and when they boarded the boat, he made a hole in it. He said, ‘Did you make a hole in it to drown its people? You have certainly done a monstrous thing!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they both proceeded: until, when they were in the boat, he scuttled it. Said Moses: \"Hast thou scuttled it in order to drown those in it? Truly a strange thing hast thou done!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they both proceeded, till, when they embarked the ship, he (Khidr) scuttled it. Musa (Moses) said: \"Have you scuttled it in order to drown its people? Verily, you have committed a thing \"Imra\" (a Munkar - evil, bad, dreadful thing).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they departed. When they boarded a ship, he bored a hole in it. 'What, have you made a hole in it' he said, 'is it to drown its passengers? You have done a dreadful thing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they set out. Until, when they had boarded the boat, he holed it. He said, “Did you hole it, to drown its passengers? You have done something awful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they set out, until when they had embarked on the ship, al-Khidh r tore it open. [Moses] said, \"Have you torn it open to drown its people? You have certainly done a grave thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:71] So they set off, making their way on foot along the coast of the sea, until, when they embarked on the ship, which was carrying them, he, al-Khidr, made a hole in it, by destroying a plank or two on the starboard side with an axe after they had sailed into deep waters. Said he, Moses, to him, ‘Did you make a hole in it to drown its people? (li-tughriqa ahlahā, ‘for you to drown its people’; a variant reading has li-yaghraqa ahluhā, ‘so that its people might drown’). You have certainly done a dreadful thing’, that is, a grave and reprehensible thing — it is reported that the water did not [actually] penetrate it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So the twain set out) so both Khidr and Moses (pbut) set out (till, when they were in the ship) to cross over, (he made a hole therein) Khidr made a hole in the ship. ((Moses) said) to him: (Hast thou made a hole therein to drown the folk thereof? Thou verily hast done a dreadful thing) towards the people of the ship.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ضمَّن ركوب السفينة معنى الدخول فيها\n فعداه بفي\n وقد تركه على أصله في قوله:\n[النّحل: 8]\n يقول الحقّ جلّ جلاله: { فانطلقا } أي: موسى والخضر\n وسكت عن الخادم لكونه تبعًا\n وقيل: إن يوشع لم يصحبهما\n بل رجع\n فصارا يمشيان على ساحل البحر\n فمرت بهم سفينة\n فكلموهم أن يحملوهم\n فعرفوا الخضر\n فحملوهم بغير نَوْل\n فلما لَجَّجُوا البَحْرَ أخذ الخضرُ فأسًا فخرق السفينة\n فقلع لوحًا أو لوحين مما يلي الماء\n فحشاها موسى بثوبه\n و { قال أخرقتها لتُغرق أهلَها } أو: ليَغرَق أهلُها\n { لقد جئتَ } أي: أتيتَ وفعلت\n { شيئًا إِمْرًا } أي: عظيمًا هائلاً\n يقال: أَمِر الأمرُ: عظم\n { قال } الخضر: { ألم أقل إِنك لن تستطيع معي صبرًا } تذكيرًا لما قاله له من قبلُ\n وإنكارًا لِعدم الوفاء بالعهد\n { قال } موسى عليه السلام: { لا تُؤاخذني بما نسيتُ } أي: بنسياني\n أو بالذي نسيته\n وهو وصيته بأن لا يسأله عن حكمة ما صدر عنه من الأفعال الخفية الأسباب قبل بيانه\n أراد: نسي وصيته\n ولا مؤاخذة على الناسي\n وفي الحديث:\n \" كانت الأولى مِن مُوسى نسيانًا \" \nأو: أراد بالنسيان الترك\n أي: لا تُؤاخذني بما تركت من وصيتك أول مرة\n { ولا تُرهقني } أي: لا تُغْشِنِي ولا تُحَمِّلْنِي { من أمري } \n وهو اتباعك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:15",
      "similarity": 0.5456640090484313
    },
    {
      "verse": "6:100",
      "similarity": 0.5019148799413735
    },
    {
      "verse": "17:37",
      "similarity": 0.3862930819529003
    },
    {
      "verse": "18:79",
      "similarity": 0.20229909602240165
    },
    {
      "verse": "2:239",
      "similarity": 0.14280955395433026
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/18:71.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/18:71.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}