{
  "chapter": "الكهف",
  "text": "فانطلقا حتى اذا اتيا اهل قرية استطعما اهلها فابوا۟ ان يضيفوهما فوجدا فيها جدارا يريد ان ينقض فاقامه قال لو شئت لتخذت عليه اجرا",
  "translations": [
    {
      "translation": "So they went on until they reached the inhabitants of a town. They asked them for food but they refused them hospitality. They found there a wall about to fall down and he built it up. Musa said, 'If you had wanted, you could have taken a wage for doing that.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The two went on till they came upon some villagers, and asked the people for food, but they refused to entertain them. There they found a wall that was crumbling, which he repaired. Moses remarked: \"You could have demanded wages for it if you liked.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the two went forth until when they came to a town, they asked its people for food, but they refused to play host to them. They found in that town a wall that was on the verge of tumbling down, and he buttressed it, whereupon Moses said: \"If you had wished, you could have received payment for it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They continued on their journey again until they reached a town. They asked the people there for food, but no one accepted them as their guests. They found there a wall of a house which was on the verge of tumbling to the ground. The companion of Moses repaired that wall. Moses said, \"You should have received some money for your labor.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they both set out again; until they came to the people of a dwelling – they asked its people for food – they refused to invite them – then in the village they both found a wall about to collapse, and the chosen bondman straightened it; said Moosa, “If you wished, you could have taken some wages for it!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they both proceeded till when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found therein a wall about to collapse and he set it up straight. (Musa) said: \"If you had wished, surely you could have taken wages for it!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they went on until when they came to the people of a town, they asked them for food, but they refused to entertain them as guests. Then they found in it a wall which was on the point of falling, so he put it into a right state. (Musa) said: If you had pleased, you might certainly have taken a recompense for it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they departed; until, when they reached the people of a city, they asked the people for food, but they refused to receive them hospitably. There they found a wall about to tumble down, and so he set it up. He said, 'If thou hadst wished, thou couldst have taken a wage for that.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they twain journeyed on till, when they came unto the folk of a certain township, they asked its folk for food, but they refused to make them guests. And they found therein a wall upon the point of falling into ruin, and he repaired it. (Moses) said: If thou hadst wished, thou couldst have taken payment for it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they went on until they came to a town. They asked its people for food, but were refused hospitality. They found a wall in the town which was about to fall down. His companion buttressed it and Moses said, \"Had you wished, you could have demanded payment for your labours.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the twain journeyed until when they came unto the people of a city, they begged food from the people thereof, but they refused to entertain the twain. Then they found therein a wall, about to fall down, and he set it upright. Musa said: hadst thou willed, thou mightest have taken therefor a hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they went on until they came to the people of a town. They asked its people for food, but they refused to extend them any hospitality. There they found a wall which was about to collapse, so he erected it. He said, ‘Had you wished, you could have taken a wage for it.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they proceeded: until, when they came to the inhabitants of a town, they asked them for food, but they refused them hospitality. They found there a wall on the point of falling down, but he set it up straight. (Moses) said: \"If thou hadst wished, surely thou couldst have exacted some recompense for it!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they both proceeded, till, when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found therein a wall about to collapse and he (Khidr) set it up straight. [Musa (Moses)] said: If you had wished, surely, you could have taken wages for it!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they departed and thereafter they came to the inhabitants of a village. They asked its inhabitants for some food, but they declined to host them. There, they found a wall about to fall down whereupon his companion restored it. He (Moses) said: 'Had you wished, you could have taken payment for that'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they set out. Until, when they reached the people of a town, they asked them for food, but they refused to offer them hospitality. There they found a wall about to collapse, and he repaired it. He said, “If you wanted, you could have obtained a payment for it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they set out, until when they came to the people of a town, they asked its people for food, but they refused to offer them hospitality. And they found therein a wall about to collapse, so al-Khidh r restored it. [Moses] said, \"If you wished, you could have taken for it a payment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:77] So they set off, until, when they came to the folk of a [certain] town, namely, Antioch (Antākya), they asked its folk for food, they asked them for food by way of hospitality, but they refused to extend them any hospitality. They then found in it a wall, one hundred cubits high, about to collapse, that is, it was close to falling down because of its tilt; so he, al-Khidr, straightened it, with his [own] hands. He, Moses, said, to him, ‘Had you wished, you could have taken (a variant reading [for la-ttakhadhta] has la-takhidhta) a wage for it’, some [sort of] payment, since they did not extend us any hospitality despite our need for food.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So they twain journeyed on till, when they came unto the folk of a certain township) Antioch, (they asked its folk for food) they asked its inhabitants for bread, (but they refused to make them guests) they refused to give them food. (And they found therein a wall upon the point of falling into ruin, and he repaired it) Khidr repaired it. ((Moses) said: If thou hadst wished) Khidr, (thou couldst have taken payment for it) in the form of bread that we could eat.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَبَوْاْ أَن يُضَيِّفُوهُمَا } معناه أَن يُنزلُوهما مَنزِلَ الأَضيافِ\n\n\n\n\nوقوله تعالى: { يُرِيدُ أَن يَنقَضَّ } معناهُ أَن يَسقُطَ قال الإِمامُ زيد بن علي عليهما السَّلامُ: ولَيسَ للجِدارِ إِرادةٌ، وإِنَّما هو حَائطٌ مواتٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱنطَلَقَا } بعدما تقاولا في أمر العلوم ما تقاولا { حَتَّىٰ إِذَآ أَتَيَآ أَهْلَ قَرْيَةٍ } هي أنطاكية أو أيلة { ٱسْتَطْعَمَآ أَهْلَهَا } من شدة جوعهما واحتياجهما إلى الطعام { فَأَبَوْاْ } وامتنعوا { أَن يُضَيِّفُوهُمَا } يميلوهما إلى نيل الطعام ونوله { فَوَجَدَا فِيهَا جِدَاراً يُرِيدُ } أي: يميل ويشرف { أَن يَنقَضَّ } أي: يسقط وينهدم { فَأَقَامَهُ } الخضر وعدَّله وسواه بالعمود وأسقطه وأحكم بنيانه جديداً\n\n\n\n\nثم لما رأى موسى منه أمراً مستغربباً مستبعداً، وهو أنهما على جناح السفر، لوم يكن لهما شغلُ وغرضُ متعلقُ بتعمير الجدار وإقامته { قَالَ } على سبيل التعرض بأنه فضول: { لَوْ شِئْتَ لَتَّخَذْتَ عَلَيْهِ أَجْراً } [الكهف: 77] وأخذت جعلاً واكتسبت التقوت والزاد بعدما أبوا عن الضيافة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}