{
  "chapter": "الكهف",
  "text": "اما السفينة فكانت لمسكين يعملون فى البحر فاردت ان اعيبها وكان وراءهم ملك ياخذ كل سفينة غصبا",
  "translations": [
    {
      "translation": "As for the boat, it belonged to some poor people who worked on the sea. I wanted to damage it because a king was coming behind them, commandeering every boat.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That boat belonged to poor people who used to toil on the sea. I damaged it because there was a king after them who used to seize every ship by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boat it belonged to some poor people who worked on the river, and I desired to damage it for beyond them lay the dominion of a king who was wont to seize every boat by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The boat belonged to some destitute people who were using it as a means of their living in the sea. The king had imposed a certain amount of tax on every undamaged boat. I damaged it so that they would not have to pay the tax.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“In respect of the boat – it belonged to the poor people who worked on the river, so I wished to flaw it – and behind them was a king who would capture every sound ship.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boat, it belonged to poor people working in the sea. So I wished to make a defective damage in it, as there was a king behind them who seized every boat by force.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boat, it belonged to (some) poor men who worked on the river and I wished that I should damage it, and there was behind them a king who seized every boat by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the ship, it belonged to certain poor men, who toiled upon the sea; and I desired to damage it, for behind them there was a king who was seizing every ship by brutal force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the ship, it belonged to poor people working on the river, and I wished to mar it, for there was a king behind them who is taking every ship by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The boat belonged to some poor people who made their living from the sea. I wanted to damage it because there was a king coming behind them who was seizing every boat by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boat, it belonged to poor men working in the sea, so I intended to damage it, for there was before them a prince taking every boat by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boat, it belonged to some poor people who work on the sea. I wanted to make it defective, for behind them was a king seizing every ship usurpingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boat, it belonged to certain men in dire want: they plied on the water: I but wished to render it unserviceable, for there was after them a certain king who seized on every boat by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the ship, it belonged to Masakin (poor people) working in the sea. So I wished to make a defective damage in it, as there was a king after them who seized every ship by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the ship, it belonged to poor people working on the sea. I rendered it imperfect because behind them there was a king who was taking every ship by brutal force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boat, it belonged to paupers working at sea. I wanted to damage it because there was a king coming after them seizing every boat by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the ship, it belonged to poor people working at sea. So I intended to cause defect in it as there was after them a king who seized every [good] ship by force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:79] As for the ship, it belonged to poor people, ten [in number], who earned a living on the sea, with it, leasing it [to others], as a way of gaining [a living]; and I wanted to make it defective, for behind them, whenever they returned — or [meaning] before them now — was a king, a disbeliever, seizing every ship, that was usable, by force (ghasban, is in the accusative as a verbal noun containing an explanation of the nature of such ‘seizure’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for the ship) in which I made a hole, (it belonged to poor people working on the river) transporting people across the river, (and I wished to mar it) I wished to damage it, (for there was a king) called Jalandi (behind them) ahead of them (who is taking every ship by force) and this is why I damaged it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَانَ وَرَآءَهُم مَّلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ غَصْباً } يعني كان أَمامَهُم\n قالَ الإِمامُ زيد بن علي عليهما السّلامُ: كَان المَلكُ يأخذ كُلَّ سَفينةٍ صَالحةٍ غَصباً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And there was a king behind them who would take every ship by force,\" means that there was a king in front of them.\n\n\nThe Imam Zaid bin Ali said: \"The king used to take every sound ship by force.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أما السفينة فكانت لمساكين } في بحر الهيولى\n أي: القوى البدنية من الحواس الظاهرة والقوى الطبيعية النباتية\n وإنما سماها مساكين لدوام سكونها وملازمتها لتراب البدن وضعفها عن ممانعة القلب في السلوك والاستيلاء عليه كسائر القوى الحيوانية\n وحكي أنهم كانوا عشرة إخوة خمسة منهم زمنى وخمسة يعملون في البحر\n وذلك إشارة إلى الحواس الظاهرة والباطنة { فأردت أن أعيبها } بالرياضة لئلا يأخذها ملك النفس الأمّارة غصباً وهو الملك الذي كان وراءهم أي: قدّامهم { يأخذ كل سفينة غصباً } بالاستيلاء عليها واستعمالها في أهوائه ومطالبه { وأما الغلام فكان أبواه } اللذان هما الروح والطبيعة الجسمانية { مؤمنين } مقرين بالتوحيد لانقيادهما في سلك طاعة الله وامتثالهما لأمر الله وإذعانهما لما أراد الله منهما { فخشينا أن يرهقهما } أي: يغشيهما { طغياناً } عليهما بظهوره بالأنائية عند شهود الروح { وكفراً } لنعمتهما بعقوقه وسوء صنيعه أو كفراً بالحجاب فيفسد عليهما أمرهما ودينهما ويبطل عبوديتهما لله { فأردنا أن يبدلهما ربهما خيراً منه زكاة } كما بدّلهما بالنفس المطمئنة التي هي خير منه زكاة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم فصلها فقال: { أَمَّا ٱلسَّفِينَةُ } التي خرقتُها بإلهام الله إياي\n وإلقائه على قلبي { فَكَانَتْ } هي { لِمَسَاكِينَ } ضعفاء َ لا مكسبَ لهم سواها { يَعْمَلُونَ فِي ٱلْبَحْرِ } بها ويعيشون من نولها { فَأَرَدتُّ أَنْ أَعِيبَهَا } أي: أجعلها ذاتَ عيب { وَكَانَ وَرَآءَهُم مَّلِكٌ } ظالمَ سيئ عليهم\n وهو { يَأْخُذُ كُلَّ سَفِينَةٍ } صحيحةٍ غير معيبةٍ { غَصْباً } [الكهف: 79] ظلماً وزوراً بلا فديةٍ\n فجعلتها ذاتَ عيبٍ حتى تبقى لهم\n وذلك بإذنٍ من الله عنايةً منه سبحاه لضعفاءعباده ورعاية لحالهم ومصلحتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { غَصْبًا }: مصدر نوعي ليأخذ\n يقول الحقّ جلّ جلاله: { قال } الخضر عليه السلام: { هذا فراقُ بيني وبينك } فلا تصحبني بعد هذا\n { سأنبئُك بتأويل ما لم تستطع عليه صبرًا } أي: سأخبرك بالخبر الباطن\n فيما لم تستطع عليه صبرًا لكونه منكرًا في الظاهر\n فالتأويل: رجوع الشيء إلى مآله\n والمراد هنا: المآل والعاقبة\n وهو خلاص السفينة من اليد العادية\n وخلاص أَبَوَيْ الغلام من شره\n مع الفوز بالبدل الأحسن\n واستخراج اليتيمين للكنز\n وفي جعل صلة الموصول عدم استطاعته\n ولم يقل: \" بتأويل ما رأيت \" نوعُ تعريضٍ به\n وعناية عليه السلام\n ثم جعل يفسر له\n فقال: { أما السفينة } التي خرقتُها\n { فكانت لمساكين }: ضُعفاء\n لا يقدرون على مدافعة الظلمة\n فسماهم مساكين لذلهم وضعفهم\n ومنه قوله صلى الله عليه وسلم:\n \" اللهُمَّ أَحْيِنِي مِسْكِينًا\n وأمتْنِي مِسْكِينًا\n واحْشُرْنِي في زُمرةِ المَسَاكِينِ \" \nفلم يُرد مسكنة الفقر\n وإنما أراد التواضع والخضوع\n أي: احشرني مخبتًا متواضعًا\n غير جبار ولا متكبر\n وقيل: كانت السفينة لعشرة إخوة: خمسة زَمْنَى\n وخمسة { يعملون في البحر }\n وإسناد العمل إلى الكل\n حينئذ\n بطريق التغليب\n ولأن عمل الوكيل بمنزلة الموكل\n { فأردت أن أعيبها }: أجعلها ذات عيب\n { وكان ورائهم ملكٌ } أي: أمامهم\n وقرئ به\n أو خلفهم\n وكان رجوعهم عليه لا محالة\n وكان اسمه: \" جلندي بن كركر \" وقيل: \" هُدَدُ بن بُدَد \" \n قال ابن عطية: وهذا كله غير ثابت\n يعني: تسمية الملك\n { يأخذُ كلَّ سفينة } صالحة\n وقرئ به\n { غَصْبًا } من أصحابها\n وكان حق النظم أن يتأخر بيانُ إرادةِ التعيُّبِ عن خوف الغصب\n فيقول: فكانت لمساكين\n وكان ورائهم ملك يأخذ كل سفينة صالحة\n فأردت أن أعيبها لأن إرادة التعيب مُسَبَّبٌ عن خوف الغصب\n وإنما قدّم للاعتناء بشأنها إذ هي المحتاجة إلى التأويل\n ولأن في التأخير فصلاً بين السفينة وضميرها\n مع توهم رجوعه إلى الأقرب قال البيضاوي: ومبني ذلك - أي: التعيب وخوف الغصب - على أنه متى تعارض ضرران يجب حمل أهونهما بدفع أعظمهما\n وهو أصل ممهد\n غير أن الشرائع في تفاصيله مختلفة\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:15",
      "similarity": 0.23742967734026124
    },
    {
      "verse": "18:71",
      "similarity": 0.20229909602240156
    },
    {
      "verse": "84:10",
      "similarity": 0.04119568476932474
    },
    {
      "verse": "7:20",
      "similarity": 0.028856564347192176
    },
    {
      "verse": "45:10",
      "similarity": 0.028817575144977754
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/018079.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/018079.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/18:79.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}