{
  "chapter": "الكهف",
  "text": "انا جعلنا ما على الارض زينة لها لنبلوهم ايهم احسن عملا",
  "translations": [
    {
      "translation": "We made everything on the earth adornment for it so that We could test them to see whose actions are the best.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made whatever exists on the earth its adornment to test and try them (and) know who acts better;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have made all that is on the earth an embellishment for it in order to test people as to who of them is better in conduct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have caused earthly things to seem attractive so that We can see who will excel in good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed placed all that is on the earth as its adornment in order that We may test them, who among them has the best deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, we have made that which is on earth an adornment for it, in order that We may test which of them are best in deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have made whatever is on the earth an embellishment for it, so that We may try them (as to) which of them is best in works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed all that is on the earth for an adornment for it, and that We may try which of them is fairest in works;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have placed all that is on the earth as an ornament thereof that We may try them: which of them is best in conduct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have adorned the earth with attractive things, so that We may test mankind as to which one is best in conduct,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We have made whatsoever is on the earth as an adornment thereof, that We may prove them - which of them is best in work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have made whatever is on the earth an adornment for it that We may test them [to see] which of them is best in conduct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which is on earth we have made but as a glittering show for the earth, in order that We may test them - as to which of them are best in conduct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! We have made that which is on earth as an adornment for it, in order that We may test them (mankind) as to which of them are best in deeds. [i.e. those who do good deeds in the most perfect manner, that means to do them (deeds) totally for Allah's sake and in accordance to the legal ways of the Prophet SAW].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed all that is on the earth an adornment for it, in order that We try which of them is finest in works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made what is upon the earth an ornament for it, to test them as to which of them is best in conduct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have made that which is on the earth adornment for it that We may test them [as to] which of them is best in deed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:7]   Truly We have made all that is on the earth, in the way of animals, plants, trees, rivers and so on, as an adornment for it, that We may try them, that We may test mankind observing thereby, which of them is best in conduct, therein, that is, [to see which of them] is the most abstemious of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We have placed all that is in the earth) of male and female (as an ornament thereof) as an embellishment for the earth (that we may try them) that We may test them: (which of them is best in conduct) which of them is more sincere in works. It is also said that this means: We have made all that which is on earth of plants, trees, beasts, and comfort an ornament for the earth so that We test them which of them is more unattached to, and shunning of, this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nفلما لم يؤمنوا بالقرآن استشعر ببقية من نفسه وتوجس بنقصان حاله فعلاه الوجد وعزم على قهر النفس بالكلية طلباً للغاية وكان ذلك من فرط شفقته عليهم وكمال أدبه مع الله حيث أحال عدم إيمانهم على ضعف حاله لا على عدم استعدادهم ولذلك سلاّه بقوله: { إنّا جعلنا } أي: لا تحزن عليهم فإنه لا عليك أن يهلكوا جميعاً\n إنّا نخرج جميع الأسباب من العدم إلى الوجود للابتلاء ثم نفنيها ولا حيف ولا نقص\n أو إنّا جعلنا ما على أرض البدن من النفس ولذاتها وشهواتها وقوى صفاتها وإدراكاتها ودواعيها { زينة } لها ليظهر أيهم أقهر لها وأعصى لهواها في رضاي وأقدر على مخالفتها لموافقتي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّا جَعَلْنَا مَا عَلَى ٱلأَرْضِ } من الأصول الثلاثة التي هي الحيوان والنبات والمعدن\n وما يتفرع عليها من أنواع اللذات والشهوات الجسمية الوهمية { زِينَةً لَّهَا } أو زخرفةً عليها { لِنَبْلُوَهُمْ } ونختبرهم أي: أرباب التكاليف والتدابير\n المجبولين على فطرة المعرفة والتوحيد { أَيُّهُم أَحْسَنُ عَمَلاً } [الكهف: 7] وأتم رشداً وعقلاً في الإعراض عنها\n وعدم الالتفات إليها والاجتناب عن لذاتها الوهمية التي هي على التقضي والانصرام\n وشهواتها المورثة لأنواع الحزن والآلام وأمانيها\n المستلزمة لأصناف الجرائم والآثام\n مع أن الضروري منها كِنّ حجْرة\n ولبْس خِرقةٍ\n وسدّ جوعة\n وباقيها حطام ليس لها دوام\n مورثة لآثام وآلام\n\n\n{ وَ } متى علمت أن ما في الأرض ليس إلا زينةً وزخرفة ستفْنى وتفوت عن قريبٍ\n فاعلم يقيناً { إِنَّا } بشدة حولنا وقوتنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { إِنا جعلنا ما على الأرض } من الأشجار والأزهار والثمار\n وما اشتملت عليه من المعادن\n وأنواع الملابس والمطاعم\n والمراكب والمناكح\n { زينةً لها } أي: مبهجة لها\n يستمتع بها الناظرون\n وينتفعون بها مأكلاً وملبسًا\n ونظرًا واعتبارًا\n حتى إن الحيّات والعقارب من حيث تذكيرها بعذاب الآخرة\n من قبيل المنافع\n بل كل حادث داخل تحت الزينة من حيثُ دلالته على الصانع\n وكذلك الأزواج والأولاد\n بل هم من أعظم زينتها\n داخلون تحت الابتلاء\n جعلنا ذلك { لنبلوهم }: لنختبرهم\n حتى يظهر ذلك للعيان\n { أيُّهم أحسنُ عملاً } \n أيهم أزهد فيها\n وأقبلهم على الله بالعمل الصالح إذ لا عمل أحسن من الزهد في الدنيا إذ هو سبب للتفرغ لأنواع العبادة\n بدنية وقلبية\n قال أبو السعود: وحسن العمل: الزهد فيها\n وعدم الاكتراث بها\n والقناعة باليسير منها\n وصرفها على ما ينبغي\n والتأمل في شأنها\n وجعلها ذريعة إلى معرفة خالقها\n والتمتع بها حسبما أذن الشرع\n وأداء حقوقها\n والشكر على نعمها\n لا جعْلها وسيلة إلى الشهوات\n والأغراض الفاسدة\n كما يفعله الكفرة وأهل الأهواء\n\n\n انظر بقية كلامه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:30",
      "similarity": 0.5974772338671743
    },
    {
      "verse": "44:33",
      "similarity": 0.5809816325205617
    },
    {
      "verse": "37:106",
      "similarity": 0.5624265527094899
    },
    {
      "verse": "67:2",
      "similarity": 0.5590436371104794
    },
    {
      "verse": "86:9",
      "similarity": 0.461763361256881
    }
  ]
}