{
  "chapter": "الكهف",
  "text": "قال ان سالتك عن شىءۭ بعدها فلا تصحبنى قد بلغت من لدنى عذرا",
  "translations": [
    {
      "translation": "Moses said: \"If I ask you any thing again then do not keep me with you. You have my apology.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"Keep me no more in your company if I question you concerning anything after this. You will then be fully justified.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"If I ask you such questions again, abandon me; you will have enough reason to do so.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moosa, “If I ask you anything after this, do not stay with me; indeed your condition from me is fulfilled.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"If I ask you anything after this, keep me not in your company, you have received an excuse from me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: If I ask you about anything after this, keep me not in your company; indeed you shall have (then) found an excuse in my case.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'If I question thee on anything after this, then keep me company no more; thou hast already experienced excuse sufficient on my part.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: If I ask thee after this concerning aught, keep not company with me. Thou hast received an excuse from me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses replied, \"If I ever ask you about anything after this, do not let me accompany you. I will have given you sufficient excuse.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said: if I ask thee regarding aught after this, company not with me; surely there hath reached to thee from my side an excuse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘If I question you about anything after this, do not keep me in your company. You already have enough excuse on my part.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: \"If ever I ask thee about anything after this, keep me not in thy company: then wouldst thou have received (full) excuse from my side.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Musa (Moses)] said: \"If I ask you anything after this, keep me not in your company, you have received an excuse from me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Moses) said: 'If I question you again do not let me be your companion; you already have enough excuse'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “If I ask you about anything after this, then do not keep company with me. You have received excuses from me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Moses] said, \"If I should ask you about anything after this, then do not keep me as a companion. You have obtained from me an excuse.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:76] And for this reason, he said, ‘If I ask you about anything after this, after this instance, then do not keep me in your company, do not allow me to follow you, for truly you [will] have found from me (read ladunnī or ladunī), on my part, [sufficient enough] excuse’, for you to part company with me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Moses) said: If I ask thee) Khidr (after this) after killing this soul (concerning aught, keep not company with me. Thou hast received an excuse from me) you have an excuse to part company with me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما رأى منه موسى ما رأى من الغيظ والحرارة: { قَالَ } معتذراً مستحيياً: لا تحرمني عن صحبتك مما صدر عني من نقض العهد وسوء الأدب، ولا تردني يا سيدي { إِن سَأَلْتُكَ عَن شَيْءٍ بَعْدَهَا فَلاَ تُصَٰحِبْنِي } ولا تجعلني رفيقك وصاحبك؛ لأنك { قَدْ بَلَغْتَ مِن لَّدُنِّي } ومن قِبلي وأجلي { عُذْراً } [الكهف: 76] فلا أعتذر لك بعد هذا، بل أفارقك إن وقع مني ما يشوشك\n\n\n\n\nعن رسول الله صلى الله عليه وسلم قال:\n\n \" رَحِمَ اللهُ أَخِيْ مُوْسَى اسْتَحَى فَقَال ذَلِكَ، لَوْ لَبِثَ مَعَ صَاحِبِهِ لأَبْصَرَ أَعْجَبَ الأَعَاجِيْبِ \"\n \n\n \n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}