{
  "chapter": "الكهف",
  "text": "فانطلقا حتى اذا لقيا غلما فقتله قال اقتلت نفسا زكيةۢ بغير نفس لقد جئت شيـا نكرا",
  "translations": [
    {
      "translation": "So they went on until they met a youngster whom he killed. Musa said, 'Have you killed a boy who has done no wrong, without it being in retaliation for someone else? This is truly an appalling thing that you have done!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The two went on till they came to a boy, whom he killed. Moses exclaimed: \"You have killed an innocent soul who had taken no life. You have done a most abominable thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the two went forth until they met a lad whom he slew, whereupon Moses exclaimed: \"What! Have you slain an innocent person without his having slain anyone? Surely you have done a horrible thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They continued on their journey until they met a young boy whom he killed. Moses said, \"How could you murder an innocent soul? This is certainly a horrible act\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they set out again; until when they met a boy, the chosen bondman slew him – Moosa said, “Did you slay an innocent soul not in retribution for another? You have indeed done an extremely evil thing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they both proceeded till they met a boy, and he (Khidr) killed him. Musa said: \"Have you killed an innocent person without Nafs Verily, you have committed a thing Nukr!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they went on until, when they met a boy, he slew him. (Musa) said: Have you slain an innocent person otherwise than for manslaughter? Certainly you have done an evil thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they departed; until, when they met a lad, he slew him. He said, 'What, hast thou slain a soul innocent, and that not to retaliate for a soul slain? Thou hast indeed done a horrible thing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they twain journeyed on till, when they met a lad, he slew him. (Moses) said: What! Hast thou slain an innocent soul who hath slain no man? Verily thou hast done a horrid thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they travelled on. Then they met a young boy and the man killed him. Moses said, \"Have you slain an innocent person without his having slain anyone? Indeed, you have done a terrible thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the twain journeyed until when they met a boy, and he killed him. Musa said: hast thou slain a person innocent not in return for a Person Assuredly thou hast committed a thing formidable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they went on until they came upon a boy, whereat he slew him. He said, ‘Did you slay an innocent soul, without [his having slain] anyone? You have certainly done a dire thing!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they proceeded: until, when they met a young man, he slew him. Moses said: \"Hast thou slain an innocent person who had slain none? Truly a foul (unheard of) thing hast thou done!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they both proceeded, till they met a boy, he (Khidr) killed him. Musa (Moses) said: \"Have you killed an innocent person who had killed none? Verily, you have committed a thing \"Nukra\" (a great Munkar - prohibited, evil, dreadful thing)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and so they departed. Thereafter they met a boy and he killed him. He (Moses) exclaimed: 'What, have you killed a pure soul and it was not done (in retaliation) for a soul you have done a terrible thing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they set out. Until, when they encountered a boy, he killed him. He said, “Did you kill a pure soul, who killed no one? You have done something terrible.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they set out, until when they met a boy, al-Khidh r killed him. [Moses] said, \"Have you killed a pure soul for other than [having killed] a soul? You have certainly done a deplorable thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:74] So they set off, after leaving the ship, making their way on foot, until, when they met a boy, who had not yet reached puberty, playing with [other] boys, among whom his face was the fairest — and he, al-Khidr, slew him, by slitting his throat with a knife while he lay down, or by tearing his head off with his hand, or by smashing his head against a wall, all of which are [different] opinions (the coordinating fā’ [of fa-qatalahu, ‘and he slew him’] is used here because [it indicates that] the slaying took place after the encounter; the response to idhā, ‘when’ is [the following statement, qāla …]) — he, Moses, said, to him: ‘Have you slain an innocent soul, that is, a pure one that had not reached the age of [legal] responsibility (a variant reading [for zākiya] has zakiyya), [one slain] not in retaliation for another soul?, in other words, one that has not slain any soul. Verily you have committed an dreadful thing’ (read nukran or nukuran), that is to say, an abomination.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So the twain journeyed on till, when they met a lad) between two townships, (he slew him) Khidr killed him. ((Moses) said: What! Hast thou) Khidr (slain an innocent soul who hath slain no man? Verily thou hast done a horrid thing) you have committed a horrendous, evil act.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَّقَدْ جِئْتَ شَيْئاً نُّكْراً } معناه دَواهِي عُظمى\n\n\n\n\nوقوله تعالى: { زَكِيَّةً بِغَيْرِ نَفْسٍ } معناه مُطهّرةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"You have come with something great [i.e., a great act of disbelief].\" This means that you are extremely wicked.\n\n\nThe phrase \"zakiyyah an bi-ghayr nafs\" means \"purification without self.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فانطلقا حتى إذا لقيا غلاماً } هو النفس التي تظهر بصفاتها فتحجب القلب فتكون أمّارة بالسوء\n وقتله بإماتة الغضب والشهوة وسائر الصفات { أقتلت نفساً زكية } اعتراض لتحنن القلب على النفس و { ألم أقل لك } تذكير وتعبير روحي و { إن سألتك عن شيء } إلى آخره\n اعتذار وإقرار بالذنب واعتراف\n وكلها من التلوينات عند كون النفس لوّامة\n { فانْطَلقا حتى إذا أتيا أهل قرية } هم القوى البدنية\n واستطعامهما منهم هو طلب الغذاء الروحاني منهم\n أي: بواسطتهم كانتزاع المعاني الكلية من مدركاتها الجزئية وإنما أبوا أن يضيفوهما وإن أطعموهما قبل ذلك لأن غذاءهما حينئذ كان من فوقهم من الأنوار القدسية والتجليات الجمالية والجلالية والمعارف الإلهية والمعاني الغيبية لا من تحت أرجلهم كما كان قبل خرق السفينة\n وقتل الغلام بالرياضة والقوى والحواس مانعة من ذلك لا ممدة\n بل لا تتهيأ إلا بعد نعاسهم وهدوّهم كما قال موسى لأهله: امكثوا\n والجدار الذي { يريد أن ينقض } هو النفس المطمئنة وإنما عبر عنها بالجدار لأنها حدثت بعد قتل النفس الأمّارة وموتها بالرياضة\n فصارت كالجماد غير متحركة بنفسها وإرادتها\n ولشدة ضعفها كادت تهلك\n فعبر عن حالها بإرادة الانقضاض\n وإقامته إياها تعديلها بالكمالات الخلقية و الفضائل الجميلة بنور القوة النطقية حتى قامت الفضائل مقام صفاتها من الرذائل\n وقول موسى عليه السلام: { لو شئت لتخذت عليه أجراً } تلوين قلبي لا نفسي\n وهو طلب الأجر والثواب باكتساب الفضائل واستعمال الرياضة\n ولهذا أجابه بقوله:  { هذا فراق بيني وبينك } أي: هذا هو مفارقة مقامي ومقامك ومباينتهما والفرق بين حالي وحالك\n فإن عمارة النفس بالرياضة والتخلق بالأخلاق الحميدة ليست لتوقع الثواب والأجر وإلا فليست فضائل ولا كمالات لأن الفضيلة هي التخلق بالأخلاق الإلهية بحيث تصدر عن صاحبها الأفعال المقصودة لذاتها لا لغرض\n وما كان لغرض فهو حجاب ورذيلة لا فضيلة والمقصود هو طرح الحجاب وانكشاف غطاء صفات النفس\n والبروز إلى عالم النور لتلقي المعاني الغيبية بل الاتصاف بالصفات الإلهية بل التحقق بالله بعد الفناء فيه لا الثواب كما زعمت { سأُنَبِّئك بتأويل ما لم تستطع عليه صبراً } أي: لما اطمأنت النفس واستقرّت القوى أمكنك قبول المعاني وتلقي الغيب الذي نهيتك عن السؤال عنه حتى أحدث لك منه ذكراً فسأذكر لك وأنبئك بتأويل هذه الأمور إذا استعددت لقبول المعاني والمعارف",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فانطلقا } أي: فقبل عذره فخرجا من السفينة فانطلقا { حتى إذا لقيا غلامًا فقتله } قيل: كان يلعب مع الغلمان ففتَلَ عنقه\n وقيل: ضرب رأسه بحجر\n وقيل: ذبحه\n والأول أصح لوروده في الصحيح\n رُوي أن اسم الغلام \" جيسور \" بالجيم\n وقيل: بالحاء المهملة\n فإِن قلت: لِمَ قال { خرقها } بغير فاءٍ\n وقال: { فقتله } بالفاء؟ فالجواب: أن \" خَرَقَها \": جواب الشرط\n و { قتله }: من جملة الشرط\n معطوفًا عليه\n والجزاء هو قوله: { قال أقتلت } \n فإن قلت: لِمَ خولف بينهما؟ فالجواب: أن خرق السفينة لم يتعقب الركوب\n وقد تعقب القتل لِقاء الغلام\n هـ\n وأصله للزمخشري\n وقال البيضاوي: ولعل تغيير النظم بأن جعل خرقها جزاء\n واعتراض موسى عليه السلام مستأنفًا في الأولى\n وفي الثانية { فقتله } من جملة الشرط\n واعتراضه جزاء لأن القتل أقبح\n والاعتراض عليه أدخل\n فكان جديرًا بأن يجعل عمدة الكلام\n ولذلك وصله بقوله: { لقد جئت شيئًا نُكرًا } أي: منكرًا\n هـ\n وناقشه أبو السعود بما يطول ذكره\n { قال } موسى عليه السلام في اعتراضه: { أقتلتَ نفسًا زكية }: طاهرة من الذنوب\n وقرئ بغير ألف مبالغةً\n { بغير نَفْسٍ } أي: بغير قتلِ نفسٍ محرمةٍ\n فيكون قصاصًا\n وتخصيص نفي هذا القبيح بالذكر من بين سائر القبيحات من الكفر بعد الإيمان\n والزنا بعد إحصان لأنه أقرب إلى الوقوع نظرًا لحال الغلام\n\n{ لقد جئتَ شيئًا نُكْرًا } أي: مُنكرًا\n قيل: أنكرُ من الأول\n إذ لا يمكن تداركه\n كما يمكن تدارك الأول بالسد ونحوه\n وقيل: \" الإمْر \" أعظم لأن قتل نفس واحدة أهون من إغراق أهل السفينة\n { قال } له الخضرُ عليه السلام: { ألم أقل لك إِنك لن تستطيعَ معي صبرًا } \n زاد \" لك \" لزيادة تأكيد المكافحة بالعتاب على رفض الوصية وقلة التثبت والصبر\n لما تكرر منه الإنكار\n ولم يَرْعَوِ بالتذكير\n حتى زاد في النكير في المرة الثانية بذكر المنكر\n { قال } موسى عليه السلام: { إِنْ سألتك عن شيء بعدها } بعد هذه المرة { فلا تُصاحبني } إن سألتُ صُحبتَكَ\n وقرأ يعقوب: \" فلا تصحبني \" رباعيًا\n أي: لا تجعلني صاحبًا لك\n { قد بلغتَ من لدُنِّي عُذْرًا } أي: قد أعذرتَ ووجدت مِنْ قِبَلِي عذرًا في مفارقتي\n حيث خالفتك ثلاث مرات\n وعن النبي صلى الله عليه وسلم:\n \" يرحم الله أَخِي مُوسَى\n استحيا\n فقال ذلك\n لو لَبِثَ مَعَ صَاحِبِهِ لأبْصرَ أَعْجَبَ الأعَاجِيب \" \nوفي البخاري:\n \" وددنا لو صبر موسى\n حتى يقص الله علينا من أمرهما \"\n \n{ فانطلقا حتى إِذا أتيا أهل قريةٍ } \n هي أنطاكية\n وقيل: أَيْلة\n وقيل الأبُلة\n وهي أبعد أرض الله من السماء\n وقيل: برقة\n وقال أبو هريرة وغيره: هي بالأندلس\n ويُذكر أنها الجزيرة الخضراء\n قلت: وهي التي تسمى اليوم طريفة\n وأصلها بالظاء المشالة\n وذلك على قول إن مجمع البحرين عند طنجة وسبتة\n وعن النبي صلى الله عليه وسلم:\n \" كانوا أهل قرية لِئامًا \" \nوقال قتادة: شر القرى التي لا يُضاف فيها الضيف\n ولا يعرف لابن السبيل حقه\n ثم وصف القرية بقوله: { استطعما أهلها } أي: طلبا منهم طعامًا\n ولم يقل: استطعماهم\n على أن يكون صفة لأهل لزيادة تشنيعهم على سوء صنيعهم\n فإن الإباء من الضيافة\n مع كونهم أهلها قاطنين بها\n أشنع وأقبح\n رُوي أنهما طافا بالقرية يطلبان الطعام\n فلم يطعموهما\n واستضافاهم { فأَبَوا أن يُضيفوهما } بالتشديد\n وقرئ بالتخفيف\n يقال: ضافه: إذا كان له ضيفًا\n أضافه وضيّفه: أنزله ضيفًا\n وأصل الإضافة: الميل\n من: ضاف السهمُ عن الغرض: مال\n ونظيره: زاره\n من الازْوِرَار\n أي: الميل\n فبينما هما يمشيان\n { فوجدا فيها جدارًا } \n قال وهب: كان طوله مائة ذراع\n { يُريد أن ينقضَّ } أي: يسقط\n استعار الإرادة للمشارفة للدلالة على المبالغة في ذلك\n والانقضاض: الإسراع في السقوط\n وهو انفعال\n من القض\n يقال: قضضته فانقض\n ومنه: انقضاض الطير والكوكب لسقوطه بسرعة\n وقرئ: أن ينقاض\n من انقاضت السنُّ: إذا سقطت طولاً\n { فأقامه } قيل: مسحه بيده فقام\n وقيل: نقضه وبناه\n وهو بعيد\n { قال } له موسى: { لو شئتَ لاتخذتَ عليه أجرًا } نتعشى به\n وهو تحريض له على أخذ الجُعل\n أو تعريض بأنه فُضول\n وكأنه لَمَّا رأى الحِرمَان ومساس الحاجة كان اشتغاله بذلك في ذلك الوقت مما لا يعني\n فلم يتمالك الصبر عليه\n\nقال ابن التين: إن الثالثة كانت نسيانًا لأنه يبعد الإنكار لأمر مشروع\n وهو الإحسان لمن أساء\n هـ\n وفيه نظر فقد قال القشيري في تفسير الآية: لم يقل موسى: إنك ألْمَمْتَ بمحظور\n ولكن قال: لو شئتَ\n أي: فإن لم تأخذ بسببك فهلا أخذت بسببنا\n فكان أخْذُ الأجر خيرًا من الترك\n ولئن وَجَبَ حقُّهم فَلِمَ أخللت بحقنا؟ ويقال: إنَّ سَفَرَه ذلك كان سفرَ تأديب\n فَرُدَّ إلى تَحَمُّلِ المشقة\n وإلاَّ فهو نسي\n حيث سقى لبنات شعيب\n وكان ما أصابه من التعب والجوع أكثر\n ولكنه كان في ذلك الوقت محمولاً\n وفي هذا الوقت مُتَحَمِّلا\n هـ\n قلت: لأن الحق تعالى أراد تأديبه فلم يحمل عنه\n فكان سالكًا محضًا\n وفي وقت السقي: كان مجذوبًا محمولاً عنه\n ثم قال القشيري: وكما أن موسى كان يُحب صحبة الخضر لما له فيه من غرض استزادةٍ من العلم\n كان الخضر يحب ترك صحبته إيثارًا للخلوة بالله عنه\n هـ\n قاله في الحاشية الفاسية\n الإشارة: يُؤخذ من خرق السفينة أن المريد لا تفيض عليه العلوم اللدنية والأسرار الربانية حتى يخرق عوائد نفسه\n ويعيب سفينة وجوده\n بتخريب ظاهره\n حتى لا يقبله أحد\n ولا يُقبل عليه أحد\n فبذلك يخلو بقلبه ويستقيم على ذكر ربه\n وأما ما دام ظاهره متزينًا بلباس العوائد\n فلا يطمع في ورود المواهب والفوائد\n ويُؤخذ من قتل الغلام: أنه لا بد من قتل الهوى\n وكل ما فيه حظ للنفس والشيطان والطريق في ذلك أن تنظر ما يثقل على النفس فتُحمله لها\n وما يخف عليها فتحجزها عنه\n حتى لا يثقل عليها شيء من الحق\n ويؤخذ من إقامة الجدار رسم الشرائع قيامًا بآداب العبودية\n وصونًا لكنز أسرار الربوبية\n ويؤخذُ منه أيضًا: الإحسان لمن أساء إليه\n فإن أهل القرية أساؤوا بترك ضيافة الخضر\n فقابلهم بالإحسان حيث أقام جدارهم\n والله تعالى أعلم\n ثمَّ ذكر افتراقهما وبان الحكمة في تلك الخوارق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:19",
      "similarity": 0.5268553407528228
    },
    {
      "verse": "37:101",
      "similarity": 0.4397459876039212
    },
    {
      "verse": "19:20",
      "similarity": 0.41831400859801793
    },
    {
      "verse": "77:29",
      "similarity": 0.3527156720291911
    },
    {
      "verse": "18:80",
      "similarity": 0.3215317167802604
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/18:74.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/18:74.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/18:74.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}