{
  "chapter": "الكهف",
  "text": "قال لا تؤاخذنى بما نسيت ولا ترهقنى من امرى عسرا",
  "translations": [
    {
      "translation": "(Moses) said: \"Do not hold me for having forgotten, and do not reprove me and make my task difficult.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"Do not take me to task at my forgetfulness, and do not be hard on me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"Please, forgive my forgetfulness. Do not oblige me with what is difficult for me to endure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moosa, “Do not apprehend me upon my forgetting, and do not impose difficulty on me in my task.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Call me not to account for what I forgot, and be not hard upon me for my affair (with you).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Blame me not for what I forgot, and do not constrain me to a difficult thing in my affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Do not take me to task that I forgot, neither constrain me to do a thing too difficult.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: Be not wroth with me that I forgot, and be not hard upon me for my fault.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Do not take me to task for what I have forgotten, and do not be hard on me on account of what I have done!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said: take me not to task for that forget, and impose not in my affair hardship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Do not take me to task for my forgetting, and do not be hard upon me.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"Rebuke me not for forgetting, nor grieve me by raising difficulties in my case.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Musa (Moses)] said: \"Call me not to account for what I forgot, and be not hard upon me for my affair (with you).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: 'Do not blame me for what I forgot, nor press me to do something which is too difficult'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Do not rebuke me for forgetting, and do not make my course difficult for me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Moses] said, \"Do not blame me for what I forgot and do not cover me in my matter with difficulty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:73] He said, ‘Do not take me to task on account of that which I forgot, that is, [on account of the fact that] I was not mindful of submitting to you [in the matter] and of refraining from showing disapproval of your actions, and do not exhaust me, [do not] charge me, in this affair of mine with difficulty’, [with] hardship   during my companionship of you, in other words, treat me throughout it with forgiveness and indulgence.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Moses) said: Be not wroth with me that I forgot) your advice, (and be not hard upon me for my fault) do not tax me severely for my fault.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْراً } معناه لا تُغْشِني\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } موسى معتذراً متذكراً لعهده: { لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ } أي: بنسياني وغفلتي عن وصيتك وعهدي معك { وَلاَ تُرْهِقْنِي } أي: لا تغشني ولا تحجبني { مِنْ أَمْرِي } الذي بعثني على متابعتك، وهو الاطلاع على سرائر الأمور ومغيباتها { عُسْراً } [الكهف: 73] أي: لا تحجبني عن مطلوبي بالمؤاخذة على النسيان عسراً يلحجئني إلى ترك متابعتك، فيفوت غرضي ومطلوبي منك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تُرهقني } أي: لا تُغْشِنِي ولا تُحَمِّلْنِي { من أمري } ، وهو اتباعك، { عُسرًا } أي: لا تعَسِّرْ عليّ في متابعتك، بل يسرها عليّ بالإغضاء والمسامحة",
      "translations": []
    }
  ]
}