{
  "chapter": "الكهف",
  "text": "قال فان اتبعتنى فلا تسـلنى عن شىء حتى احدث لك منه ذكرا",
  "translations": [
    {
      "translation": "If you must follow me,\" he said, \"do not ask me any thing until I speak of it to you myself.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Well, if you follow me, do not ask me concerning anything until I myself mention it to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said to Moses, \"If you will follow me, do not ask me about anything until I tell you the story about it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Therefore if you stay with me, do not ask me about anything until I myself mention it to you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Then, if you follow me, ask me not about anything till I myself mention of it to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: If you would follow me, then do not question me about any thing until I myself speak to you about it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'Then if thou followest me, question me not on anything until I myself introduce the mention of it to thee.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Well, if thou go with me, ask me not concerning aught till I myself make mention of it unto thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Well then, if you would follow me, do not ask me about anything till I speak of it to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: then if thou wilt follow me ask me not of anything until begin thereof some mention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘If you follow me, do not question me concerning anything until I myself first mention it for you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The other said: \"If then thou wouldst follow me, ask me no questions about anything until I myself speak to thee concerning it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Khidr) said: \"Then, if you follow me, ask me not about anything till I myself mention it to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'If you follow me, you must not question me about anything till I myself speak to you concerning it'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “If you follow me, do not ask me about anything, until I myself make mention of it to you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Then if you follow me, do not ask me about anything until I make to you about it mention.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:70] He said, ‘If you follow me then do not question me (lā tas’alnī, a variant reading has lā tas’alannī) concerning anything, that you might find objectionable in what I do, according to your [limited] knowledge, and be patient, until I [myself] make mention of it to you’, in other words, [until] I mention it to you with [an explication of] the reason for it. Moses accepted his precondition bearing in mind the respect which a student should exercise in the presence of a teacher.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Khidr said: (Well, if thou go with me) if you keep my company, Moses, (ask me not concerning aught) about what I do (till I myself mention of it unto you) until I proceed to explain it to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما اضطره موسى إلى القبول { قَالَ } له الخضر على سبيل التوصية والتوطئة: { فَإِنِ ٱتَّبَعْتَنِي } بعدما بالغت { فَلاَ تَسْأَلْني } أي: فعليك ألاَّ تفاتحني بالسؤال { عَن شَيءٍ } انكرتَه مني، ووجدتَه مخالفاً لظاهر الشرع { حَتَّىٰ أُحْدِثَ } وأبيِّن { لَكَ مِنْهُ ذِكْراً } [الكهف: 70] بياناً واضحاً كاشفاً عن إشكالك ودغدغتك بلا سبق سؤالٍ منك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}