{
  "chapter": "الكهف",
  "text": "واما من ءامن وعمل صلحا فله جزاء الحسنى وسنقول له من امرنا يسرا",
  "translations": [
    {
      "translation": "But as for him who has iman and acts rightly, he will receive the best of rewards and we will issue a command, making things easy for him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who believes and does the right will have an excellent reward, and we shall make things easy for him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who believes and acts righteously, his will be a goodly reward and we shall enjoin upon him only mild commands.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good, they will receive virtuous rewards and We will tell them to do only what they can.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And regarding one who believed and did good deeds – so his reward is goodness; and we shall soon give him an easy command.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who believes and works righteousness, he shall have the best reward, and we shall speak unto him mild words.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for him who believes and does good, he shall have goodly reward, and We will speak to him an easy word of Our command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who believes, and does righteousness, he shall receive as recompense the reward most fair, and we shall speak to him, of our command, easiness.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who believeth and doeth right, good will be his reward, and We shall speak unto him a mild command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but whoever believes and does good works shall have a good reward and We shall facilitate his matter by Our command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for him who believeth and worketh righteously, unto him shall be a goodly hire, and anon we shall speak unto him of our affair something easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who has faith and acts righteously, he shall have the best reward, and we will assign him easy tasks under our command.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever believes, and works righteousness,- he shall have a goodly reward, and easy will be his task as We order it by our Command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who believes (in Allah's Oneness) and works righteousness, he shall have the best reward, (Paradise), and we (Dhul-Qarnain) shall speak unto him mild words (as instructions).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for he who believes and does good works he shall receive a fine reward in recompense and we shall speak to him with a mild command'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“But as for him who believes and acts righteously, he will have the finest reward, and We will speak to him of Our command with ease.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for one who believes and does righteousness, he will have a reward of Paradise, and we will speak to him from our command with ease.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:88]   But as for him who believes and acts righteously, he shall have the fairest reward, namely, Paradise (the annexation construction [jazā’u l-husnā, ‘the fairest reward’] is explicative; a variant reading has jazā’an alhusnā, ‘[he shall have] as a requital that which is fairest’; al-Farrā’ said that this accusative [reading of jazā’an] is [intended] as an explanation [of the nature of the requital] by way of attribution [to ‘that which is fairest’]; and we shall speak to him mildly in our command’, that is to say, we shall command him with what he will find easy [to bear].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But as for him who believeth) in Allah (and doeth right) sincerely to Allah, (good will be his reward) Paradise will be his reward in the Hereafter, (and We shall speak unto him a mild command) we shall speak to him in a kind manner.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَمَّا مَنْ آمَنَ } منهم { وَعَمِلَ } على مقتضى الإيمان عملاً { صَالِحاً } فنصلح حالهم، ونراعيه في الدنيا { فَلَهُ } في يوم الجزاء عند واهب العطايا { جَزَآءً ٱلْحُسْنَىٰ } والمثوبة العظمى والدرجة العليا والجزاء الأوفى { وَسَنَقُولُ لَهُ مِنْ أَمْرِنَا } الذي أمرنا بالتخير في أمر أولئك الهالكين في تيه الغواية { يُسْراً } [الكهف: 88] سهلاً معتدلاً بين إفراط القتل والاستئصال، وتفريط الإبقاء على الكفر والضلال مداهنةً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأما مَنْ آمن } بموجب دعوته { وعَمِلَ } عملاً { صالحًا } حسبما يقتضيه الإيمان { فله } في الدارين { جزاء الحُسنى } ، أي: المثوبة الحسنى، أو الفعلة الحسنى جزاء، على قراءة النصب، على أنه مصدر مؤكد للجملة، قُدِّم عليه المبتدأ اعتناءً، أو حال، أو تمييز\n { وسنقول له من أمرنا } أي: مما نأمر به { يُسْرًا }: سهلاً ميسرًا، غير شاق عليه\n والله تعالى أعلم\n الإشارة: ذو القرنين لَمَّا أقبل بكليته على مولاه، ودعا إلى الله، ونصح لله، مكّنه الله تعالى من الأرض، ويسر له أموره، حتى قطع مشارقها ومغاربها، وكذلك من انقطع إلى الله، ورفع همته إلى مولاه، وأرشد الخلق إلى الله، تكون همته قاطعة، يقول للشيء كن فيكون، بقدرة الله وقدره\n وسخر له الكون بأسره، يكون عند أمره ونهيه \" أنت مع الأكوان ما لم تشهد المكون، فإذا شهدته كانت الأكوان معك \" ، يقول الله تعالى، في بعض كلامه:\n\n \" يا عبدي كن لي كما أريد، أكن لك كما تريد \"\n \n\nقال القشيري: ذو القرنين مكَّن له في الأرض جهرًا، فكانت تُطوى له إذا قطع أحوازها، وسُهل له أن يندرج في مشارقها ومغاربها، ويحظر أقطارها ومناكبها، ومن كان في محل الإعانة من الأولياء فالحق سبحانه يُمكنه في المملكة، ليحصل عند همته ما أراد من حصول طعام أو شراب، أو غيره من قطع مسافة، أو استتار عن أبصار، وتصديق مأمول، وتحقيق سؤال، وإجابة دعاء، وكشف بلاء، وفوق ذلك تمكينه من تحقيق همه له في أمره، ثم فوق ذلك في التمكين في أن يُحضِر بهمتهم قومًا بما شاؤوا، ويمنع قومًا عما شاؤوا، فلهم من الحق تحقيق أمل، إذا تصرفوا في المملكة بإرادات في سوانح وحادثات، وفوق هذا التمكين في المملكة إيصال قوم إلى منازل ومحالُ، فالله يحقق فيهم همتهم\n هـ\n قلت: وفوق ذلك كله تمكينهم من شهود ذاته، في كل وقت وحين، حتى لو طلبوا الحجاب لم يُجابوا، ولو كُلفوا أن يروا غيره لم يستطيعوا، وهؤلاء هم الذين لهم التمكين في الإيصال إلى منازل السائرين ومحالُ الواصلين\n والله تعالى أعلم\n ثمَّ ذكر سير ذي القرنين إلى جهة المشرق\n",
      "translations": []
    }
  ]
}