{
  "chapter": "الكهف",
  "text": "وانا لجعلون ما عليها صعيدا جرزا",
  "translations": [
    {
      "translation": "We will certainly make everything on it a barren wasteland.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For We shall certainly turn it to barren dust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the ultimate, We shall reduce all that is on the earth to a barren plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let it be known that We will turn all things on earth into dust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We shall one day make all that is on it a barren plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, We shall make all that is on it bare, dry soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely We will make what is on it bare ground without herbage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We shall surely make all that is on it barren dust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! We shall make all that is thereon a barren mound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but We shall reduce all this to barren waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We are going to make whatsoever is thereon a soil bare.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We will turn whatever is on it into a barren plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily what is on earth we shall make but as dust and dry soil (without growth or herbage).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily! We shall make all that is on it (the earth) a bare dry soil (without any vegetation or trees, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will surely reduce all that is on it to barren dust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will turn what is on it into barren waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We will make that which is upon it [into] a barren ground.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:8] And indeed We shall turn all that is therein into barren shreds, that produce no plants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! We shall make) change (all that is therein) of ornament into (a barren mound) a smooth dust with no vegetation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { صَعِيداً جُرُزاً } الصَّعِيدُ: وُجهُ الأَرضِ\n والجُرزُ: البَلقعُ\n ويقالُ الغَليظُ الذِي لاَ يُنبِتُ شيئاً، والجَمعُ أَجرازٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {a dry land, an abyss} - the dry land: the face of the earth.\n\n\nAnd the juglans: the belqaa'\n\n\nThe thick one that doesn't bear anything is called {al-ghalīzu}, and the plural is {ajrāz}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وإنّا لجاعلون } بتجلينا وتجلي صفاتنا { ما عليها } من صفاتها هامدة كأرض ملساء لا نبات فيها أي: نفنيها وصفاتها بالموت الحقيقي أو بالموت الطبيعي ولا نبالي، بل { أم حسبت أن أصحاب الكهف والرقيم كانوا من آياتنا عجباً } أي: إذا شاهدت هذا الإنشاء والإفناء فليس حال أصحاب الكهف آية عجيبة من آياتنا بل هذه أعجب\n واعلم أن أصحاب الكهف هم السبعة الكمل القائمون بأمر الحق دائماً الذين يقوم بهم العالم ولا يخلو عنهم الزمان على عدد الكواكب السبعة السيّارة وطبقها فكما سخرها الله تعالى في تدبير نظام عالم الصورة كما أشار إليه بقوله:\n\n[النازعات، الآيات: 4-5] على بعض التفاسير وكل نظام عالم المعنى وتكميل نظام الصورة إلى سبعة أنفس من السابقين كل ينتسب بحسب الوجود الصوري إلى واحد منهم، والقطب هو المنتسب إلى الشمس والكهف هو باطن البدن والرقيم ظاهره الذي انتقش بصور الحواس والأعضاء إن فسر باللوح الذي رقمت فيه أسماؤهم والعالم الجسماني إن جعل اسم الوادي الذي فيه الجبل والكهف والنفس الحيوانية إن جعل اسم الكلب والعالم العلوي إن جعل اسم قريتهم على اختلاف الأقوال في التفاسير ومنهم الأنبياء السبعة المشهورون المبعوثون بحسب القرون والأدوار، وإن كان كل نبيّ منهم على ذكر وهم: آدم وإدريس ونوح وإبراهيم وموسى وعيسى ومحمد عليهم الصلاة والسلام لأنه السابع المخصوص بمعجزة انشقاق القمر، أي: انفلاقه عنه لظهوره في دورة ختم النبوة وكمل به الدين الإلهي كما أشار إليه بقوله صلى الله عليه وسلم:\n\n \" إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض \" \n\nإذ المتأخر بالزمان والظهور أي: الوجود الحسيّ هو الحائز لصفات الكلّ وكمالاتهم كالإنسان بالنسبة إلى سائر الحيوانات، ولهذا قال صلى الله عليه وسلم:\n\n \" كأنّ بنيان النبوّة قد تمّ وبقي منه موضع لبنة واحدة، فكنت أنا تلك اللبنة \" \n\nوقد اتفق الحكماء المتألهة من قدماء الفرس أن مراتب العقول والأرواح على مذهبهم في التنازل تتضاعف إشراقاتها، فكل من تأخر في الرتبة كان حظه من إشراقات الحق وأنواره وسبحات أشعة وجهه وإشراقات أنوار الوسائط أوفر وأزيد فكذا في الزمان فهو الجامع الحاصر لصفات الكل وكمالاتهم الحاوي لخواصهم ومعانيهم مع كماله الخاص به اللازم للهيئة الاجتماعية، كما قال صلى الله عليه وسلم:\n\n\n\n \" بعثت لأتمم مكارم الأخلاق \" \n\nومن هذا ظهر تقدّمه عليهم بالشرف والفضيلة ومن جهة أن إبراهيم عليه السلام كان مظهر التوحيد الأعظمي الذاتي، وكان هو الوسط في الترتيب الزماني بمنزلة الشمس في الرتبة كان قطب النبوة، ولزمهم كلهم اتباعه وإن لم يظهر في المتقدمين عليه بالزمان كارتباط الكواكب الستة في سيرها بها، ولكن كالقمر، فمتبعه بالحقيقة محمد صلى الله عليه وسلم\n واعلم أن الأرواح في عالمها مراتب متعينة، وصفوف مترتبة واستعدادات متفاوتة متهيئة في الأزل بمحض العناية الأولى والفيض الأقدس فأهل الصف الأول هم السابقون المفردون المقرّبون المحبوبون المخصوصون بفضل عنايته وسابقة كرامته المتعارفون بنوره المتحابون فيه، والباقون يتباينون في الدرجات وبحسب تقاربها وتباعدها، يتعارفون ويتناكرون، فما تعارف منها ائتلف وما تناكر منها اختلف إلى آخر الصفوف، فلها مراكز ثابتة، وأصول راسخة في العالم العلوي وعند التعلق بالأبدان يتفاوت درجات كمالاتها وغاية سعاداتها بحسب ما لها من الاستعداد الأول المخصوص بكل منها من مباديها في الأزل كما قال عليه الصلاة والسلام:\n\n \" الناس معادن كمعادن الذهب والفضة \" \n\n، حتى انتهت الدرجات في العلوّ إلى الفناء في التوحيد الذاتي، فبهذا الاعتبار يكون محمد عليه السلام عين آدم بل عين السبعة وكذا باعتبار كونه جامعاً لصفاتهم كما قيل إنه سأله أبو يزيد رحمة الله عليه: أنت من السبعة؟ فقال صلى الله عليه وسلم:\n\n \" أنا السبعة \" \n\nوباعتبار علوّ مرتبته ومكانته، وسبقه في القدم وارتفاع درجة كماله وفضيلته، كان أقدمهم وأولهم وأفضلهم كما قال:\n\n \" أول ما خلق الله نوري وكنت نبيّاً وآدم بين الماء والطين \" \n\nفهو متقدم عليهم بالرتبة والعلية والشرف والفضيلة، متأخر عنهم بالزمان وهو عينهم باعتبار السر والوحدة الذاتية، فالحاصل أن اختلافهم وتباينهم روحاً وقلباً ونفساً لا ينافي اتحادهم في الحقيقة وكذا افتراقهم بالأزمنة لا ينافي معيتهم في الأزل والأبد وعين الجمع كما قال:\n\n[البقرة: 253] مع قوله:\n\n[البقرة، الآية: 136]\n ويجوز أن يكون المراد بأصحاب الكهف روحانيات الإنسان التي تبقى بعد خراب البدن\n وقول من قال: ثَلاَثَة، إشارة إلى الروح والعقل والقلب\n والكلب هي النفس الملازمة لباب الكهف\n ومن قال: خَمْسَة إشارة إلى الروح والقلب والعقل النظري والعقل العمليّ والقوة القدسية للأنبياء التي هي الفكر لغيرهم\n ومن قال: سَبْعَة فتلك الخمسة مع السرّ والخفاء والله أعلم\n\n",
      "translations": [
        {
          "translation": " We will make Our signs clear to them and Our attributes {which are} not {subject to} interpretation among {their} attributes. {It is} like level land where no plant grows: We wear it out with true death or natural death, and we are not concerned.,\n{ } Yes, did you think that the people of the cave and al-Raqim were from our signs? That is, if you see this creation and perfection, the state of the people of the cave is not a strange sign from our signs, but rather this is more amazing.\n\n\nAnd know that the people of the Cave are the seven complete ones who are always upright in the cause of truth, whom the world follows and from whom time does not deviate, the number of the seven stars and planets in the sky. Just as Allah has made them subject to His command in the ordering of the world of images, as He has alluded to in His saying:\n\n\nThe outcries, {The verses: 4-5] On some interpretations and all systems of world meaning and completion of the system of images to seven souls of the previous each joins according to the existence of the image to one of them},\n\nAnd the North Star is the star that is closest to the sun, and the cave is the bottom of the body, and the backbone is the visible part that protrudes from the bones and the members, if he explains the tablet on which he inscribed their names, and the world of the body, if he made the name of the valley in which the mountain and the cave and the animal soul, if he made the name of the dog and the upper world, if he made the name of their village according to the different opinions in the interpretations, and among them the seven well-known Prophets sent according to centuries and roles.,\nAnd every prophet from them is mentioned, and they are: Adam, and Idris, and Noah, and Abraham, and Moses, and Jesus, and Muhammad - upon them be prayers and peace - because he is the seventh specifically chosen for the miracle of the splitting of the moon.,\n\nThis refers to his (the Prophet's) separation from this world at the end of his Prophethood, and the completion of the religion with him, as he (peace and blessings of Allaah be upon him) indicated in his saying: \"Prophethood will remain among you as long as Allaah wills it to be, then Allaah will raise it up if He wills. Then there will be a Khilaafah (caliphate) on the Prophetic model (i.e., based on Prophethood), and it will remain as long as Allaah wills it to be, then Allaah will raise it up if He wills. Then there will be a biting kingship (i.e., rule by force), and it will remain as long as Allaah wills it to be, then Allaah will raise it up if He wills. Then there will be a tyrannical kingship (i.e., rule by force), and it will remain as long as Allaah wills it to be, then Allaah will raise it up if He wills. Then there will be a Khilaafah on the Prophetic model.\n \"The time has turned as it was the day God created the heavens and the earth.\"\n\n\nThe latecomer in time and appearance, that is, the sentient being, is the possessor of all the qualities and perfections of humanity in relation to other animals.,\n\nAnd for this reason, the Prophet Muhammad (peace be upon him) said:\n It is as if the structure of prophecy is complete, and all that remains is the foundation for one more building., I was that milk jug.\n The wise men of the ancients of Persia agreed that the ranks of minds and souls according to their doctrine of emanation are multiplied by their enlightenments.,\n\nEach person who lagged behind in their rank was deprived of the radiance and light of truth, and the splendor of God's countenance. The light of the heavenly bodies was lessened and diminished for them. In the same way, time is the encompassing reality of all things, containing their properties and meanings, along with the perfection that is necessary for the functioning of society., As the Prophet Muhammad said:\n\n\nI was sent to complete the ethics {of the Prophet}.\n\n\nThis is why Abraham was shown to be superior to them in honor and virtue. Abraham was the embodiment of the greatest selfless devotion to God.,\n\nAnd he was the middle one in the temporal order, like the sun in its position, he was the pole of prophecy.,\nAnd for them all to follow it, even if it does not appear in the advanced {ones} in time, the connection of the six planets in their orbit.,\n\nBut like the moon,,\n\nThen followed by the truth Muhammad ﷺ\n \n\nAnd know that the souls in their world are in fixed ranks.,\n\nA group of people arranged in rows and prepared in different ways, ready at the first opportunity and with the holy effusion of the first class, are the soloists, the beloved, the special ones, favored by their care and noble antiquity, known for their light and love for each other.,\n\nAnd the different levels of the Baqoon vary according to their proximity and distance from each other., They get to know each other and argue.,\n\nDo not agree with each other and do not differ from each other until the end of the rows., It has permanent centers.,\n\nThere are different degrees of perfection and happiness in the world, depending on the creature's preparedness from its very beginning, as the Prophet (peace and blessings be upon him) said:\n \"People are like gold and silver minerals.\"\n\n\nThe {Qur'an} is the sacred book of Islam. It is the word of God, revealed to the Prophet Muhammad. Muslims believe that the Qur'an is the final revelation of God's will and that it contains the eternal truths of the faith.,\n\n{Until the degrees in the high places came to an end in the self-unification.},\n\nWith this in mind, Muhammad (peace be upon him) is not Adam's eye, but the eye of the Seven. And similarly, because he is the one who gathers their qualities, as it is said that Abu Yazid (may Allah have mercy on him) asked him: \"Are you one of the Seven?\" The Prophet (peace and blessings of Allaah be upon him) said:\n\n\nI am the seven.\n\n\nAnd considering its high rank and position,\n\nAnd he was preceded in excellence and in the perfection of his virtue.,\n\nHe was the oldest and first of them, and the best of them, as he said:\n\n\n\"The first thing God created was light, and I was a prophet, and Adam was between water and clay.\"\n\n\nHe is superior to them in rank, status, honor, and virtue.,\n\nThey are behind him in time, and he is their eye in terms of secrecy and self-unity.,\n\nThe result is that their differences and diversity in spirit, heart and soul does not negate their unity in truth, and likewise their separation in time does not negate their support for one another in eternity. The eye of the collective is as he said:\n\n\nWith His saying, { } \"\n\n\nThe Cow\n\nArabic:\n\nالبقرة,\n\n{So do not be faint-hearted or discouraged, for you will surely triumph if you are truly faithful.}\n\n\n{The people of the cave} are the human souls who remain after the destruction of the body.\n\n\nAnd whoever says, \"There are three [gods]\",,\n\nThis refers to the soul, mind, and heart.\n The dog is the soul necessary for the door of the cave.\n\n\nAnd whoever says that there are five signs of the soul, the heart, the intellect, the active intellect, and the spiritual power of the prophets which is thought for others,\n\n\nAnd whoever says that there are seven of them, those are the five with the secret and the hidden, and Allah knows best.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } متى علمت أن ما في الأرض ليس إلا زينةً وزخرفة ستفْنى وتفوت عن قريبٍ، فاعلم يقيناً { إِنَّا } بشدة حولنا وقوتنا، وكمال قدرتنا وسطوتنا { لَجَاعِلُونَ } أي: مصيّرون مبدّلون جميع { مَا عَلَيْهَا } من الذخائر والزخارف { صَعِيداً } تراباً مرتفعة أملسَ { جُرُزاً } [الكهف: 8] خاليةً منقطعةً من النبات بحيث لا تنبت أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِنا لجاعلون ما عليها } عند تناهي الدنيا { صعيدًا جُرُزًا } أي: ترابًا يابسًا، لا نبات فيه، بعدما كان يَتَعجب من بهجته النظارُ، ويتشرف بمشاهدته الأبصار، فلا يغتر بما يذهب ويفنى إلا من لا عقل له، فلا تستغرب إدبارهم، إذ لا عقل لهم\n ويحتمل أن يكون تسليةً للنبي صلى الله عليه وسلم من حيث إنه أرشده إلى شهود تدبير الحق، فيسلو، بذلك عن إعراضهم لغيبته في المصور المدبر عن الصور، وعن الزينة في المُزَيِّن فالكون مظهر الصفات ومرآتها، ويغيب في الذات - التي هي معدنها - بإفناء الظاهر، وإفناء الأفعال، كما نبّه عليه بقوله: { وإِنا لجاعلون\n\n\n } الخ\n الإشارة: الخصوصية - من حيث هي - لها بداية ونهاية، فمن شأن أهل بدايتها: الحرص على الخير لهم ولعباد الله، فيتمنون أن الناس كلهم خصوص أو صالحون، فإذا رأوا الناس أعرضوا عنها تأسفوا عليهم، وإذا أقبلوا عليهم فرحوا من أجلهم، زيادة في الهداية لعباد الله، فإذا تمكنوا منها ورسخت أقدامهم فيها، وحصل لهم الفناء الأكبر، لم يحرصوا على شيء، ولم يتأسفوا من فوات شيء، لهم ولغيرهم\n\n\nوقد يتوجه العتاب لهم على الحرص في بدايتهم تكميلاً لهم، وترقية إلى المقام الأكمل\n وقوله تعالى: { إنا جعلنا ما على الأرض\n\n\n } الخ، هو حكمة تخلف الناس عن الخصوصية، حتى يتميز الطالب لها من المعرض عنها، فمن أقبل على زينة الدنيا وزهرتها، فاتته الخصوصية، وبقي من عوام الناس، ومن أعرض عنها وعن بهجتها، وتوجه بقلبه إلى الله، كان من المخصوصين بها، المقربين عند الله\n وهذا هو أحسن الأعمال التي اختبر الله به عباده بقوله: { لنبلوهم أيهم أحسن عملاً } ، وفي الحديث:\n\n \" الدنيا مال مَنْ لاَ مَالَ لَه، لَهَا يَجْمَعُ مَنْ لاَ عَقْلَ لَه\n وعليها يُعَادِي مَنْ لاَ عِلْمَ عِنْدَه \" \n\nوفي الزهد والترغيب أحاديث كثيرة مفردة بالتأليف، وبالله التوفيق\n ثمَّ شرع في قصة أهل الكهف المقصودة بالذات\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:27",
      "similarity": 0.7520914701537663
    },
    {
      "verse": "74:17",
      "similarity": 0.2656430473302625
    },
    {
      "verse": "72:17",
      "similarity": 0.2614519642956133
    },
    {
      "verse": "35:10",
      "similarity": 0.20271464861667998
    },
    {
      "verse": "6:125",
      "similarity": 0.1767273484521243
    }
  ]
}