{
  "chapter": "الكهف",
  "text": "واما الجدار فكان لغلمين يتيمين فى المدينة وكان تحته كنز لهما وكان ابوهما صلحا فاراد ربك ان يبلغا اشدهما ويستخرجا كنزهما رحمة من ربك وما فعلته عن امرى ذلك تاويل ما لم تسطع عليه صبرا",
  "translations": [
    {
      "translation": "As for the wall, it belonged to two young orphans in the town and there was a treasure underneath it, belonging to them. Their father was one of the righteous and your Lord wanted them to come of age and then to unearth their treasure as a mercy from your Lord. I did not do it of my own volition. That is the explanation of the things about which you were not able to restrain yourself.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for that wall, it belonged to two orphan boys of the city, and their treasure was buried under it. Their father was an upright man. So your Lord willed that on reaching the age of maturity they should dig out their treasure as a favour from their Lord. So, I did not do that of my own accord. This is the explanation of things you could not bear with patience.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the wall, it belonged to two orphan boys in the city, and under it there was a treasure that belonged to them. Their father was a righteous man and your Lord intended that they should come of age and then bring forth their treasure as a mercy from your Lord; I did not do this of my own bidding. This is the true meaning of things with which you could not keep your patience.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The tumbling wall belonged to two orphans in the town whose father was a righteous person. Underneath the wall there was a treasure that belonged to them. Your Lord wanted the orphans to find the treasure through the mercy of your Lord when they mature. I did not repair the wall out of my own desire. These were the explanations of my deeds about which you could not remain patient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And in respect of the wall – it belonged to two orphan boys of the city, and beneath it was their treasure, and their father was a virtuous man; therefore your Lord willed that they should reach their maturity and remove their treasure; by the mercy of your Lord; and I have not done this at my own command; this is the interpretation of the matters you could not patiently bear.” (* Hazrat Khidr was given the knowledge of the hidden – as in all three explanations he gave).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the wall, it belonged to two orphan boys in the town; and there was under it a treasure belonging to them; and their father was a righteous man, and your Lord intended that they should attain their age of full strength and take out their treasure as a mercy from your Lord. And I did them not of my own accord. That is the interpretation of those (things) over which you could not be patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure belonging to them, and their father was a righteous man; so your Lord desired that they should attain their maturity and take out their treasure, a mercy from your Lord, and I did not do it of my own accord. This is the significance of that with which you could not have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the wall, it belonged to two orphan lads in the city, and under it was a treasure belonging to them. Their father was a righteous man; and thy Lord desired that they should come of age and then bring forth their treasure as a mercy from thy Lord. I did it not of my own bidding. This is the interpretation of that thou couldst not bear patiently.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure belonging to them, and their father had been righteous, and thy Lord intended that they should come to their full strength and should bring forth their treasure as a mercy from their Lord; and I did it not upon my own command. Such is the interpretation of that wherewith thou couldst not bear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wall belonged to two young orphans in the town whose father had been a righteous man, and a treasure of theirs lay underneath it. So your Lord wanted them to come of age and then to dig up their treasure as a mercy from Him. I did not do [it] of my own accord. That is the explanation of the things about which you were not able to restrain yourself.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the wall, it belonged to two orphan boys in the town and underneath it was a treasure belonging to them and their father had been righteous. So thy Lord intended that the twain should attain their maturity and bring forth for themselves their treasure as a mercy from thy Lord. And I did it not of mine own command; that is the interpretation of that wherewith thou wast not able to have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the wall, it belonged to two boy orphans in the city. Under it there was a treasure belonging to them. Their father had been a righteous man. So your Lord desired that they should come of age and take out their treasure—as a mercy from your Lord. I did not do that out of my own accord. This is the interpretation of that over which you could not maintain patience.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the wall, it belonged to two youths, orphans, in the Town; there was, beneath it, a buried treasure, to which they were entitled: their father had been a righteous man: So thy Lord desired that they should attain their age of full strength and get out their treasure - a mercy (and favour) from thy Lord. I did it not of my own accord. Such is the interpretation of (those things) over which thou wast unable to hold patience.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the wall, it belonged to two orphan boys in the town; and there was under it a treasure belonging to them; and their father was a righteous man, and your Lord intended that they should attain their age of full strength and take out their treasure as a mercy from your Lord. And I did it not of my own accord. That is the interpretation of those (things) over which you could not hold patience.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the wall, it belonged to two orphan boys in the city. Beneath it was (buried) a treasure which belonged to them. Their father had been a righteous person and your Lord willed that when they reach manhood to bring out their treasure as a mercy from your Lord. What I did was not done by my own command. That is the interpretation of what you could not bear with patience'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the wall, it belonged to two orphaned boys in the town. Beneath it was a treasure that belonged to them. Their father was a righteous man. Your Lord wanted them to reach their maturity, and then extract their treasure—as a mercy from your Lord. I did not do it of my own accord. This is the interpretation of what you were unable to endure.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure for them, and their father had been righteous. So your Lord intended that they reach maturity and extract their treasure, as a mercy from your Lord. And I did it not of my own accord. That is the interpretation of that about which you could not have patience.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:82] And as for the wall, it belonged to two orphan boys [who lived] in the city, and beneath it there was a treasure, a buried trove of gold and silver, belonging to them. Their father had been a righteous man, and so because of his righteousness they were protected both in [terms of] their souls and their possessions, and your Lord desired that they should come of age, that is, [He desired for them] the attainment of maturity, and extract their treasure as a mercy from your Lord (rahmatan min rabbik is a direct object denoting reason, operated by [the verb] arāda, ‘He desired’). And I did not do it, namely, what has been mentioned of [his] making a hole in the ship, the slaying of the boy and the repair of the wall, of my own accord, that is, [out of] my own choosing; nay, it was because of a command in the form of an inspiration from God. This is the interpretation of that over which you could not maintain patience’ (one may say istā‘a or istatā‘a to mean ‘he had the capacity for [something]’; in this instance and the previous one both forms [of the verb] have been used. Moreover, there is a variety of expression in the use of fa-aradtu, ‘I desired’, fa-aradnā, ‘We desired’, and fa-arāda rabbuk, ‘Your Lord desired’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And as for the wall) which I repaired, (it belonged to two orphan boys) called Asram and Suraym (in the city) of Antioch, (and there was beneath it a treasure belonging to them) it was a tablet of gold containing knowledge and wisdom and written on it: \"In the name of Allah, the Beneficent, the Merciful. I am really amazed regarding a person who believes in death: how could he ever be happy; and amazed at a person who believes in the evanescence of this worldly life and the fluctuation of its people: how he can find tranquillity in it; there is no deity except Allah and Muhammad is the Messenger of Allah (pbuh)\" (and their father had been righteous) he was a trustworthy man called Kashih, (and your Lord intended that they should come to their full strength) that they should reach the age of puberty (and should bring forth their treasure) i.e. their golden tablet (as a mercy from their Lord) as a blessing from your Lord; it is also said that this means: as an inspiration from your Lord; (and I did it not upon my own command) I did not do it from my own initiative. (Such is the interpretation of that wherewith thou couldst not bear).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَانَ تَحْتَهُ كَنزٌ لَّهُمَا } يعني عِلمٌ\n وقال مَالٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His statement, \"And beneath them is a treasure for them both\" [Quran 38:44], means knowledge.\n {And he said:} \"It is {nothing}.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأما الجدار فكان لغلامين يتيمين في المدينة } أي: العاقلتين النظرية والعملية المنقطعتين عن أبيهما الذي هو روح القدس لاحتجابهما عنه بالغواشي البدنية أو القلب الذي مات أو قتل قبل الكمال باستيلاء النفس في مدينة البدن { وكان تحته كنز لهما } أي: كنز المعرفة التي لا تحصل إلا بهما في مقام القلب لإمكان اجتماع جميع الكليات والجزئيات فيه بالفعل وقت الكمال وهو حال بلوغ الأشد واستخراج ذلك الكنز\n وقال بعض أهل الظاهر من المفسرين: كان الكنز صحفاً فيها علم { وكان أبوهما } على كلا التأويلين { صالحاً } وقيل: كان أباً أعلى لهما حفظهما الله له\n فعلى هذا لا يكون إلا روح القدس\n قصة ذي القرنين مشهورة وكان رومياً قريب العهد والتطبيق\n إن ذا القرنين في هذا الوجود هو القلب الذي ملك قرنيه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَمَّا ٱلْجِدَارُ } الذي أردتُ إقامته\n وقصدتُ تعميره بإلهام الله ووحيه { فَكَانَ لِغُلاَمَيْنِ يَتِيمَيْنِ فِي ٱلْمَدِينَةِ } ولم يبلغا الحلم { وَكَانَ تَحْتَهُ كَنزٌ لَّهُمَا } مدفونُ مخزونُ من ذهبٍ وفضةٍ { وَكَانَ أَبُوهُمَا } رجلاً { صَالِحاً } موحداً مسلماً\n متوجهاً نحو الحق دائماً { فَأَرَادَ رَبُّكَ } يا مسى من كمال لطفه وعطفه لليتيمين ورعايةً للأب الصالح { أَن يَبْلُغَآ أَشُدَّهُمَا } ويدخلا رشدهما ويخرجا عن اليتم\n إذ لا ُتمَ بعد البلوغ\n ويصيرا ذوي رأيٍ رزين وفكرٍ بيّنٍ { وَ } بعد ذلك { يَسْتَخْرِجَا كَنزَهُمَا } وإنما أمرني الله سبحانه بإقامة الجدار وإحكام المخزن { رَحْمَةً } وعطفاً { مِّن رَّبِّكَ } يا موسى شاملةً إياهما تتميماً لتربيتههما وتقويتهما\n\n\n{ وَ } بالجملة: { مَا فَعَلْتُهُ } وأنكرتَ عليه واعترضتَ وتعرضتَ عليه ليس صادراً { عَنْ أَمْرِي } ورأي نائشاً عن تدبر عقلي وفكري\n بل مما ألهمني الله به وهاني عليه وأمرني بفعله\n فأنا مأمورُ والمأمور معذورُ { ذَلِكَ } المذكور على التفصيل { تَأْوِيلُ مَا لَمْ تَسْطِـع } ولم تُطِقْ { عَّلَيْهِ صَبْراً } [الكهف: 82] حتى ظهر لك سره\n\n\nومما جرى بينهما - صلوات الله وسلامه على نبينا وعليهما - يتفطن العارف اللبيب والطالب الأريب الأديب أن شرطَ الاستفادة والاسترشاد\n ومناطَ الاستكمال وطلب الرشاد\n هو أن يميت المريد المسترشد نفسَه عند المرشد الكامل المكمّل بالمت الإرادي\n بحيث لا يتصدى إلى معارضه ومقابلته\n وإن جزم أنّ قعلَ المرشد خارجُ عن مقتضى العقل الشرع على زعمه\n بل حمل فعله على المحمل الأصوب\n وسكتَ عن الجدال والمقابلة\n إذ بعدما فوض أمره كله إلى مرشده واتخذه وكيلاً وأخذه ضميناً وكفيلاً\n فقد فنيَ فيه وبقي ببقائه\n فلم يبقَ له التصرف أصلاً بمقتضيات قواه وجوارحه ومداركه ومشاعره\n\n\nهب لنا ربنا من لدنك رحمةً تنجينا عن تسويلات نفوسنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكان تحته كنزٌ لهما } من فضة وذهب\n كما في الحديث\n والذم على كنزهما إنما هو لمن لم يؤد زكاته\n مع أن هذه شريعة أخرى\n قال ابن عباس: كان لوحًا من ذهب\n مكتوب فيه: عجبت لمن يؤمن بالقدر كيف يحزن؟ وعجبت لمن يؤمن بالرزق كيف يتعب؟ وعجبت لمن يؤمن بالموت كيف يفرح؟ وعجبت لمن يؤمن بالحساب كيف يغفل؟ وعجبت لمن يعرف الدنيا وتقلبها بأهلها كيف يطمئن إليها؟ لا إله إلا الله\n محمد رسول الله\n وقيل: كانت صحفًا فيها علم مدفون\n { وكان أبوهما صالحًا } \n فيه تنبيه على أن سَعْيَهُ في ذلك كان لصلاح أبيهما\n وفيه دليل على أن الله تعالى يحفظ أولياءه في ذريتهم\n قيل: كان بينهما وبين الأب الذي حُفظا به سبعة أجداد\n قال محمد بن المنكدر: إن الله تعالى ليحفظ بالرجل الصالح ولده وولد ولده\n ومَسربته التي هو فيها\n والدويرات التي حولها\n فلا يزالون في حفظ الله وستره\n وكان سعيد بن المسيب يقول لولده: إني لأزيد في صلاتي من أجلك\n رجاء أن أُحْفَظَ فيك\n ويتلو هذه الآية\n وفي الحديث:\n \" ما أحسن أحدٌ الخلافة في ماله إلا أحسن الله الخلافة في تركته \" \nويؤخذ من الآية: القيام بحق أولاد الصالحين إذ قام الخضر عليه السلام بذلك\n { فأراد ربك } أي: مالكك ومُدبر أمرك\n وفي إضافة الرب إلى ضمير موسى عليه السلام\n دون ضميرهما\n تنبيه له عليه السلام على تحتم كمال الانقياد\n والاستسلام لإرادته سبحانه\n وَوُجوب الاحتراز عن المناقشة فيما برز من القدرة في الأمور المذكورة وغيرها\n أراد { أن يبلغا أشُدَّهما }: حُلُمَهُمَا وكمالَ رأيِهِمَا\n { ويستخرجا كنزهما } من تحت الجدار\n ولولا أني أقمته لانقض\n وخرج الكنز من تحته\n قبل اقتدارهما على حفظ المال وتنميته\n وضاع بالكلية { رحمةً من ربك } مصدر في موضع الحال\n أي: يستخرجا كنزهما مَرْحُومَيْنِ به من الله تعالى\n\nأو: يتعلق بمضمر\n أي: فعلت ما فعلت من الأمور التي شاهدتها\n { رحمة من ربك } بمن فُعل له أو به\n وقد استعمل الخضر عليه السلام غاية الأدب في هذه المخاطبة فنسب ما كان عيبًا لنفسه\n وما كان ممتزجًا له ولله تعالى فإن القتل بلا سبب ظاهرهُ عيبٌ\n وإبداله بخير منه خير\n فأتى بضمير المشاركة\n وما كان كمالاً محضًا\n وهو إقامة الجدار\n نسبه لله تعالى\n ثم قال: { وما فعلته } أي: ما رَأَيْتَ من الخوارق { عن أمري } أي: عن رأيي واجتهادي\n بل بوحي إلهي مَلَكي\n أو إلهامي\n على اختلافٍ في نبوته أو ولايته\n { ذلك } أي: ما تقدم ذكره من التأويلات\n { تأويلُ } أي: مآل وعاقبة { ما لم تَسْطِع عليه صبرًا } أي: تفسير ما لم تستطع عليه صبرًا\n فحذف التاء تخفيفًا\n وهو فذلكة لِمَا تقدم\n وفي جعل الصلة غير ما مرَّ تكرير للتنكير عليه وتشديد للعتاب\n قيل: كل ما أنكر سيدنا موسى عليه السلام على الخضر قد جرى له مثله\n ففي هذه الأمثلة حجة عليه\n وذلك أنه لما أنكر خرق السفينة\n نودي: يا موسى أين كان تدبيرك هذا وأنت مطروح في اليم؟ فلما أنكر قتل الغلام وقيل له: أين إنكارك من وكْزك القبطي وقضائك عليه؟ فلما أنكر إقامة الجدار\n نودي: أين هذا من رفعك الحجر لبنات شعيب دون أجر؟ والله تعالى أعلم\n رُوِيَ أنه قال له: لو صبرتَ لأتيتُ بك على ألفي عجيبة\n كلها مما رأيت\n ولما أراد موسى عليه السلام أن يفارقه\n قال له: أوصني\n قال: لا تطلب العلم لتحدث به\n واطلبه لتعمل به\n هـ\n وفي رواية: قال له: اجعل همتك في معادك\n ولا تخض فيما لا يعنيك\n ولا تأمن الخوفَ\n ولا تيأس الأمْن\n وتدبر الأمور في علانيتك\n ولا تذر الإحسان في قدرتك\n فقال له: زدني يا ولي الله\n فقال: يا موسى إياك واللجاجة\n ولا تمش في غير حاجة\n ولا تضحك\n من غير عَجَب\n ولا تُعير أحدًا بخطيئة بعد الندم\n وابك على خطيئَتك يا ابن عمران\n وإياك والإعجاب بنفسك\n والتفريط فيما بقي من عمرك\n فقال له موسى: قد أبلغت في الوصية\n أتم الله عليك نعمته\n وغمرك في رحمته\n وكلأك من عدوه\n فقال الخضر: آمين\n فأوصني أنت يا نبي الله\n فقال له موسى: إياك والغضب إلا في الله\n ولا ترضى عن أحد إلا في الله\n ولا تحب لدنيا ولا تبغض لدنيا\n فإنك تخرج من الإيمان وتدخل في الكفر\n فقال له الخضر: قد أبلغت في الوصية يا ابن عمران\n أعانك الله على طاعته\n وأراك السرور في أمرك\n وحببك إلى خلقه\n وأوسع عليك من فضله\n قال موسى: آمين\n\nتنبيه: قد تقدم أن الجمهور على حياة الخضر عليه السلام\n وسبب تعميره أنه كان على مقدمة ذي القرنين\n فلما دخل الظلمات أصاب الخضر عين الحياة\n فنزل فاغتسل منها\n وشرب من مائها\n فأخطأ ذو القرنين الطريق\n فعاد\n فلم يصادفها\n قالوا: وإلياس أيضًا في الحياة\n يلتقيان في كل سنة بالموسم\n واحتج من قال بموت الخضر بقوله - عليه الصلاة والسلام-\n كما في الصحيح\n بعد صلاة العشاء:\n \" أَرَأَيْتَكُمْ لَيْلَتَكُمْ هَذِهِ\n فَإِنَّه عَلَى رأسِ مِائَةِ سَنَةِ\n لا يَبْقَى ممَنْ هُوَ اليَوْمَ عَلَى ظَهْرِ الأَرْضِ أَحَدًا \" \n\n ويجاب بأن الخضر عليه السلام كان في ذلك الوقت في السحاب\n أو يخصص الحديث به كما يخص بإبليس ومن عَمَّر من غيره\n والله تعالى أعلم\n الإشارة: الاعتراض على المشايخ موجب للبُعد عنهم\n والبُعد عنهم موجب للبُعد عن الله\n فلا وصول إلى الله إلا بالوصول إليهم مع التعظيم والاحترام \" سبحان من لم يجعل الدليل على أوليائه إلا من حيث الدليل عليه\n ولم يصل إليهم إلا من أراد أن يوصله إليه \" كما في الحِكَم\n فالواجب على المريد\n إذا كان بين يدي الشيخ\n السكوت والتسليم والاحترام والتعظيم\n إلا أن يأمره بالكلام\n فيتكلم بآداب ووقار وخفض صوت\n فإذا رأى منه شيئًا يخالف ظاهر الشريعة فليسلم له\n ويطلب تأويله\n فإن الشريعة واسعة\n لها ظاهر وباطن\n فلعله اطلع على ما لم يفهمه المريد\n وكذلك الفُقراء لا ينكر عليهم إلا ما كان محرّمًا مجمعًا على تحريمه\n ولا تأويل فيه\n كالزنا بالمعينة أو اللواط\n وأما ما اختلف فيه\n ولو خارج المذهب\n فلا ينكر عليه\n وكذلك ما فيه تأويل\n هذا إن صحت عدالته\n فقد قالوا: إن صحت عدالة المرء فليترك وما فعل\n وتأمل قضية شيخ شيوخنا سيدي عبد الرحمن المجذوب في مسألة الثور الذي أمر الفقراء بذبحه\n فلما ذبحوه تبين أنه كان صدقة عليه\n وكذلك غيره من أرباب الأحوال\n يُلتمس لهم أحسن المخارج\n فإن أحوالهم خضرية\n وما رأينا أحدًا أولع بالإنكار فأفلح أبدًا\n وبالله التوفيق\n ثم ذكر قصة ذي القرنين الذي وقع السؤال عنه مع الروح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:97",
      "similarity": 0.48244814213470266
    },
    {
      "verse": "59:14",
      "similarity": 0.3823100716751834
    },
    {
      "verse": "26:58",
      "similarity": 0.32857465768708094
    },
    {
      "verse": "25:8",
      "similarity": 0.3141051662178601
    },
    {
      "verse": "11:12",
      "similarity": 0.2683273928205491
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/18:82.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/18:82.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/18:82.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}