{
  "chapter": "الكهف",
  "text": "وانا لجعلون ما عليها صعيدا جرزا",
  "translations": [
    {
      "translation": "We will certainly make everything on it a barren wasteland.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For We shall certainly turn it to barren dust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the ultimate, We shall reduce all that is on the earth to a barren plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let it be known that We will turn all things on earth into dust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We shall one day make all that is on it a barren plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, We shall make all that is on it bare, dry soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely We will make what is on it bare ground without herbage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We shall surely make all that is on it barren dust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! We shall make all that is thereon a barren mound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but We shall reduce all this to barren waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We are going to make whatsoever is thereon a soil bare.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We will turn whatever is on it into a barren plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily what is on earth we shall make but as dust and dry soil (without growth or herbage).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily! We shall make all that is on it (the earth) a bare dry soil (without any vegetation or trees, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will surely reduce all that is on it to barren dust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will turn what is on it into barren waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We will make that which is upon it [into] a barren ground.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:8] And indeed We shall turn all that is therein into barren shreds, that produce no plants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! We shall make) change (all that is therein) of ornament into (a barren mound) a smooth dust with no vegetation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { صَعِيداً جُرُزاً } الصَّعِيدُ: وُجهُ الأَرضِ\n والجُرزُ: البَلقعُ\n ويقالُ الغَليظُ الذِي لاَ يُنبِتُ شيئاً، والجَمعُ أَجرازٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {a dry land, an abyss} - the dry land: the face of the earth.\n\n\nAnd the juglans: the belqaa'\n\n\nThe thick one that doesn't bear anything is called {al-ghalīzu}, and the plural is {ajrāz}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وإنّا لجاعلون } بتجلينا وتجلي صفاتنا { ما عليها } من صفاتها هامدة كأرض ملساء لا نبات فيها أي: نفنيها وصفاتها بالموت الحقيقي أو بالموت الطبيعي ولا نبالي، بل { أم حسبت أن أصحاب الكهف والرقيم كانوا من آياتنا عجباً } أي: إذا شاهدت هذا الإنشاء والإفناء فليس حال أصحاب الكهف آية عجيبة من آياتنا بل هذه أعجب\n واعلم أن أصحاب الكهف هم السبعة الكمل القائمون بأمر الحق دائماً الذين يقوم بهم العالم ولا يخلو عنهم الزمان على عدد الكواكب السبعة السيّارة وطبقها فكما سخرها الله تعالى في تدبير نظام عالم الصورة كما أشار إليه بقوله:\n\n[النازعات، الآيات: 4-5] على بعض التفاسير وكل نظام عالم المعنى وتكميل نظام الصورة إلى سبعة أنفس من السابقين كل ينتسب بحسب الوجود الصوري إلى واحد منهم، والقطب هو المنتسب إلى الشمس والكهف هو باطن البدن والرقيم ظاهره الذي انتقش بصور الحواس والأعضاء إن فسر باللوح الذي رقمت فيه أسماؤهم والعالم الجسماني إن جعل اسم الوادي الذي فيه الجبل والكهف والنفس الحيوانية إن جعل اسم الكلب والعالم العلوي إن جعل اسم قريتهم على اختلاف الأقوال في التفاسير ومنهم الأنبياء السبعة المشهورون المبعوثون بحسب القرون والأدوار، وإن كان كل نبيّ منهم على ذكر وهم: آدم وإدريس ونوح وإبراهيم وموسى وعيسى ومحمد عليهم الصلاة والسلام لأنه السابع المخصوص بمعجزة انشقاق القمر، أي: انفلاقه عنه لظهوره في دورة ختم النبوة وكمل به الدين الإلهي كما أشار إليه بقوله صلى الله عليه وسلم:\n\n \" إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض \" \n\nإذ المتأخر بالزمان والظهور أي: الوجود الحسيّ هو الحائز لصفات الكلّ وكمالاتهم كالإنسان بالنسبة إلى سائر الحيوانات، ولهذا قال صلى الله عليه وسلم:\n\n \" كأنّ بنيان النبوّة قد تمّ وبقي منه موضع لبنة واحدة، فكنت أنا تلك اللبنة \" \n\nوقد اتفق الحكماء المتألهة من قدماء الفرس أن مراتب العقول والأرواح على مذهبهم في التنازل تتضاعف إشراقاتها، فكل من تأخر في الرتبة كان حظه من إشراقات الحق وأنواره وسبحات أشعة وجهه وإشراقات أنوار الوسائط أوفر وأزيد فكذا في الزمان فهو الجامع الحاصر لصفات الكل وكمالاتهم الحاوي لخواصهم ومعانيهم مع كماله الخاص به اللازم للهيئة الاجتماعية، كما قال صلى الله عليه وسلم:\n\n\n\n \" بعثت لأتمم مكارم الأخلاق \" \n\nومن هذا ظهر تقدّمه عليهم بالشرف والفضيلة ومن جهة أن إبراهيم عليه السلام كان مظهر التوحيد الأعظمي الذاتي، وكان هو الوسط في الترتيب الزماني بمنزلة الشمس في الرتبة كان قطب النبوة، ولزمهم كلهم اتباعه وإن لم يظهر في المتقدمين عليه بالزمان كارتباط الكواكب الستة في سيرها بها، ولكن كالقمر، فمتبعه بالحقيقة محمد صلى الله عليه وسلم\n واعلم أن الأرواح في عالمها مراتب متعينة، وصفوف مترتبة واستعدادات متفاوتة متهيئة في الأزل بمحض العناية الأولى والفيض الأقدس فأهل الصف الأول هم السابقون المفردون المقرّبون المحبوبون المخصوصون بفضل عنايته وسابقة كرامته المتعارفون بنوره المتحابون فيه، والباقون يتباينون في الدرجات وبحسب تقاربها وتباعدها، يتعارفون ويتناكرون، فما تعارف منها ائتلف وما تناكر منها اختلف إلى آخر الصفوف، فلها مراكز ثابتة، وأصول راسخة في العالم العلوي وعند التعلق بالأبدان يتفاوت درجات كمالاتها وغاية سعاداتها بحسب ما لها من الاستعداد الأول المخصوص بكل منها من مباديها في الأزل كما قال عليه الصلاة والسلام:\n\n \" الناس معادن كمعادن الذهب والفضة \" \n\n، حتى انتهت الدرجات في العلوّ إلى الفناء في التوحيد الذاتي، فبهذا الاعتبار يكون محمد عليه السلام عين آدم بل عين السبعة وكذا باعتبار كونه جامعاً لصفاتهم كما قيل إنه سأله أبو يزيد رحمة الله عليه: أنت من السبعة؟ فقال صلى الله عليه وسلم:\n\n \" أنا السبعة \" \n\nوباعتبار علوّ مرتبته ومكانته، وسبقه في القدم وارتفاع درجة كماله وفضيلته، كان أقدمهم وأولهم وأفضلهم كما قال:\n\n \" أول ما خلق الله نوري وكنت نبيّاً وآدم بين الماء والطين \" \n\nفهو متقدم عليهم بالرتبة والعلية والشرف والفضيلة، متأخر عنهم بالزمان وهو عينهم باعتبار السر والوحدة الذاتية، فالحاصل أن اختلافهم وتباينهم روحاً وقلباً ونفساً لا ينافي اتحادهم في الحقيقة وكذا افتراقهم بالأزمنة لا ينافي معيتهم في الأزل والأبد وعين الجمع كما قال:\n\n[البقرة: 253] مع قوله:\n\n[البقرة، الآية: 136]\n ويجوز أن يكون المراد بأصحاب الكهف روحانيات الإنسان التي تبقى بعد خراب البدن\n وقول من قال: ثَلاَثَة، إشارة إلى الروح والعقل والقلب\n والكلب هي النفس الملازمة لباب الكهف\n ومن قال: خَمْسَة إشارة إلى الروح والقلب والعقل النظري والعقل العمليّ والقوة القدسية للأنبياء التي هي الفكر لغيرهم\n ومن قال: سَبْعَة فتلك الخمسة مع السرّ والخفاء والله أعلم\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } متى علمت أن ما في الأرض ليس إلا زينةً وزخرفة ستفْنى وتفوت عن قريبٍ، فاعلم يقيناً { إِنَّا } بشدة حولنا وقوتنا، وكمال قدرتنا وسطوتنا { لَجَاعِلُونَ } أي: مصيّرون مبدّلون جميع { مَا عَلَيْهَا } من الذخائر والزخارف { صَعِيداً } تراباً مرتفعة أملسَ { جُرُزاً } [الكهف: 8] خاليةً منقطعةً من النبات بحيث لا تنبت أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِنا لجاعلون ما عليها } عند تناهي الدنيا { صعيدًا جُرُزًا } أي: ترابًا يابسًا، لا نبات فيه، بعدما كان يَتَعجب من بهجته النظارُ، ويتشرف بمشاهدته الأبصار، فلا يغتر بما يذهب ويفنى إلا من لا عقل له، فلا تستغرب إدبارهم، إذ لا عقل لهم\n ويحتمل أن يكون تسليةً للنبي صلى الله عليه وسلم من حيث إنه أرشده إلى شهود تدبير الحق، فيسلو، بذلك عن إعراضهم لغيبته في المصور المدبر عن الصور، وعن الزينة في المُزَيِّن فالكون مظهر الصفات ومرآتها، ويغيب في الذات - التي هي معدنها - بإفناء الظاهر، وإفناء الأفعال، كما نبّه عليه بقوله: { وإِنا لجاعلون\n\n\n } الخ\n الإشارة: الخصوصية - من حيث هي - لها بداية ونهاية، فمن شأن أهل بدايتها: الحرص على الخير لهم ولعباد الله، فيتمنون أن الناس كلهم خصوص أو صالحون، فإذا رأوا الناس أعرضوا عنها تأسفوا عليهم، وإذا أقبلوا عليهم فرحوا من أجلهم، زيادة في الهداية لعباد الله، فإذا تمكنوا منها ورسخت أقدامهم فيها، وحصل لهم الفناء الأكبر، لم يحرصوا على شيء، ولم يتأسفوا من فوات شيء، لهم ولغيرهم\n\n\nوقد يتوجه العتاب لهم على الحرص في بدايتهم تكميلاً لهم، وترقية إلى المقام الأكمل\n وقوله تعالى: { إنا جعلنا ما على الأرض\n\n\n } الخ، هو حكمة تخلف الناس عن الخصوصية، حتى يتميز الطالب لها من المعرض عنها، فمن أقبل على زينة الدنيا وزهرتها، فاتته الخصوصية، وبقي من عوام الناس، ومن أعرض عنها وعن بهجتها، وتوجه بقلبه إلى الله، كان من المخصوصين بها، المقربين عند الله\n وهذا هو أحسن الأعمال التي اختبر الله به عباده بقوله: { لنبلوهم أيهم أحسن عملاً } ، وفي الحديث:\n\n \" الدنيا مال مَنْ لاَ مَالَ لَه، لَهَا يَجْمَعُ مَنْ لاَ عَقْلَ لَه\n وعليها يُعَادِي مَنْ لاَ عِلْمَ عِنْدَه \" \n\nوفي الزهد والترغيب أحاديث كثيرة مفردة بالتأليف، وبالله التوفيق\n ثمَّ شرع في قصة أهل الكهف المقصودة بالذات\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:27",
      "similarity": 0.7520914701537663
    },
    {
      "verse": "74:17",
      "similarity": 0.2656430473302625
    },
    {
      "verse": "72:17",
      "similarity": 0.2614519642956133
    },
    {
      "verse": "35:10",
      "similarity": 0.20271464861667998
    },
    {
      "verse": "6:125",
      "similarity": 0.1767273484521243
    }
  ]
}