{
  "chapter": "الكهف",
  "text": "واما الغلم فكان ابواه مؤمنين فخشينا ان يرهقهما طغينا وكفرا",
  "translations": [
    {
      "translation": "As for the boy, his parents were muminun and we feared that he would darken their days with excessive insolence and kufr.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boy, his parents were believers, but we feared that he would harass them with defiance and disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the lad, his parents were people of faith, and we feared lest he should plague them with transgression and disbelief,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The young boy had very faithful parents. We were afraid that out of love for him they would lose their faith in God and commit rebellion\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And in respect of the boy – his parents were Muslims and we feared that he may incite them to rebellion and disbelief.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the boy, his parents were believers, and we feared he would oppress them by rebellion and disbelief.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the boy, his parents were believers and we feared lest he should make disobedience and ingratitude to come upon them:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the lad, his parents were believers; and we were afraid he would impose on them insolence and unbelief;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the lad, his parents were believers and we feared lest he should oppress them by rebellion and disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the youth, his parents were believers and we feared that he would trouble them by rebellion and denial of truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the boy, his parents were believers, and we apprehended that he might impose upon the twain exorbitance and infidelity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boy, his parents were faithful [persons], and We feared he would overwhelm them with rebellion and unfaith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the youth, his parents were people of Faith, and we feared that he would grieve them by obstinate rebellion and ingratitude (to Allah and man).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the boy, his parents were believers, and we feared lest he should oppress them by rebellion and disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boy, his parents are believers, and we were afraid lest he should impose on them with his insolence and disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the boy, his parents were believers, and we feared he would overwhelm them with oppression and disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the boy, his parents were believers, and we feared that he would overburden them by transgression and disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:80] And as for the boy, his parents were believers and We feared lest he should overwhelm them with insolence and disbelief — for he is as [described] by the hadīth of Muslim, ‘He was [incorrigibly] disposed to disbelief,   and had he lived [longer] this [disposition of his] would have oppressed them, because of their love for him, they would have followed him in such [a path of disbelief]’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And as for the lad) whom I killed, (his parents were believers) and of the greatest people of that township (and We feared lest he should oppress them) and your Lord Knew that he will overburden them (by rebellion and disbelief) by means of his rebellion and disobedience, and by lying in oath and so He killed him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَخَشِينَآ } أي فَعَلِمنا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {So fear not} - that is, so know that We are with you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَمَّا ٱلْغُلاَمُ } الذي قتلته على الفور\n فهو غلامُ قد جبله الله على الكفر والعصيان وأنواع الشرك والطغيان { فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ } موحدين مسلمين { فَخَشِينَآ } عليهما من سوء فعاله وقبح حاله { أَن يُرْهِقَهُمَا } ويغشيهما ويغطيهما { طُغْيَاناً وَكُفْراً } [الكهف: 80] من غاية حبهما له وتحننهما إياه { فَأَرَدْنَآ } وأحببنا بقتله وهلاكه { أَن يُبْدِلَهُمَا } أي: يرقهما ويهب لهما { رَبُّهُمَا } الذي ربَّاهما بنعمة التوحيد والإيمان وكرامة العصمة والعفاف ولداً { خَيْراً مِّنْهُ زَكَـاةً } أي: طهارةً مطهرةً عن خبائث الكفر والآثام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأما الغلامُ } الذي قتلتُه { فكان أبواه مؤمنين } وقد طُبع هو كافرًا\n وإنما لم يصرح بكفره لعدم الحاجة إليه لظهوره من قوله: { فخشينا أن يُرهقهما }: فخفنا أن يغشى الوالدَيْنِ المؤمنَيْنِ { طغيانًا } عليهما { وكفرًا } بنعمتهما لعقوقه وسوء صنيعه\n فَيُلْحِقُهُمَا شرًا\n أو لشدة محبتهما له فيحملهما على طاعته\n أو يقرن بإيمانهما طغيانه وكفره\n فيجتمع في بيت واحد مؤمنان وطاغ كافر\n فلعله يميلهما إلى رأيه فيرتدا\n\nوإنما خشي الخضر عليه السلام منه ذلك لأن الله سبحانه أعلمه بحاله وأطلعه على عاقبة أمره\n وقرئ: \" فخاف ربك \" \n أي: كره سبحانه كراهية من خاف سوء عاقبة الأمر\n ويجوز أن تكون القراءة المشهورة من قول الله سبحانه على الحكاية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:6",
      "similarity": 0.44166462963095765
    },
    {
      "verse": "74:17",
      "similarity": 0.4140326183540307
    },
    {
      "verse": "18:73",
      "similarity": 0.4129539459328061
    },
    {
      "verse": "70:44",
      "similarity": 0.4128284436503626
    },
    {
      "verse": "68:43",
      "similarity": 0.3991716990573535
    }
  ]
}