{
  "chapter": "الكهف",
  "text": "حتى اذا بلغ مطلع الشمس وجدها تطلع على قوم لم نجعل لهم من دونها سترا",
  "translations": [
    {
      "translation": "until he reached the rising of the sun and found it rising on a people to whom We had not given any shelter from it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till he reached the point of the rising sun, and saw it rise over a people for whom We had provided no shelter against it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until he reached the limit where the sun rises and he found it rising on a people whom We had provided no shelter from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to the East where he found the sun rising upon a people whom We had exposed to its rays.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the extent that when he reached the rising-place of the sun, he found it rising upon a nation for which We had not kept any shelter from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he came to the rising place of the sun, he found it rising on a people for whom We (Allah) had provided no shelter against the sun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when he reached the land of the rising of the sun, he found it rising on a people to whom We had given no shelter from It;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until, when he reached the rising of the sun, he found it rising upon a people for whom We had not appointed any veil to shade them from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when he reached the rising-place of the sun, he found it rising on a people for whom We had appointed no shelter therefrom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until he came to the rising-place of the sun, where he found it rising on a people for whom We had provided no shelter from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when he reached the rising place of the sun, he perceived it rising upon a nation for whom against it We had not set a veil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he reached the place where the sun rises, he found it rising on a people for whom We had not provided any shield against it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he came to the rising of the sun, he found it rising on a people for whom We had provided no covering protection against the sun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he came to the rising place of the sun, he found it rising on a people for whom We (Allah) had provided no shelter against the sun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until he reached the rising of the sun, he found it rising upon a nation for whom We provided no veil against it to shade them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he reached the rising of the sun, he found it rising on a people for whom We had provided no shelter from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he came to the rising of the sun, he found it rising on a people for whom We had not made against it any shield.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:90] until, when he reached the rising of the sun, the place where it rises, he found it rising on a folk, namely, Negroes (zanj), for whom We had not provided against it, that is, [against] the sun, any [form of] cover, in the way of clothing or roofing, as their land could not support any structures; they had underground tunnels into which they would disappear at the rising of the sun and out of which they would emerge when it was at its highest point [in the sky].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Till, when he reached the rising place of the sun, he found it rising on a people for whom We had appointed no helper therefrom) these people had no shelter to protect them from the sun, they had no mountains, trees or clothes. They were naked creatures who were blind to the Truth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وسار { حَتَّىٰ إِذَا بَلَغَ مَطْلِعَ ٱلشَّمْسِاً } ومضع شروقه وإضاءته على العالم { وَجَدَهَا تَطْلُعُ } وتضيء أولاً { عَلَىٰ قَوْمٍ لَّمْ نَجْعَل لَّهُمْ مِّن دُونِهَا سِتْر } [الكهف: 90] يعني: لم نجعل لهم حائلاً كثيفاً وحجاباً غليظاً\n ليكون ستراً لهم من حرّ الشمس وقت طلوعها لا من الجبل ولا من الحجر والشجرة وغيرها\n بل كلهم عزلُ عراةُ لا لباس لهم أصلاً\n وهم يحفرون الأرض\n ويتخذون سراديب وأخاديد يدل الأبنية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مَطْلِعَ } فيه لغتان: الكسر والفتح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:45",
      "similarity": 0.7086579017402528
    },
    {
      "verse": "41:22",
      "similarity": 0.6842813715174082
    },
    {
      "verse": "50:39",
      "similarity": 0.2656672033292486
    },
    {
      "verse": "97:5",
      "similarity": 0.2140893732010008
    },
    {
      "verse": "37:54",
      "similarity": 0.20654577445275943
    }
  ]
}