{
  "chapter": "الكهف",
  "text": "حتى اذا بلغ بين السدين وجد من دونهما قوما لا يكادون يفقهون قولا",
  "translations": [
    {
      "translation": "until he arrived between the two mountains where he found a people scarcely able to understand speech.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till he reached a place between two mountains, and found this side of it a people who understood but little of what was spoken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until when he reached a place between the two mountains, he found beside the mountains a people who scarcely understood anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "after this to the middle of two mountains where he found a people who could hardly understand a single word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he came between two mountains, he found before them a nation that did not appear to understand any speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he reached between two mountains, he found before them a people who scarcely understood a word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when he reached (a place) between the two mountains, he found on that side of them a people who could hardly understand a word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until, when he reached between the two barriers, he found this side of them a people scarcely able to understand speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when he came between the two mountains, he found upon their hither side a folk that scarce could understand a saying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until he came between two mountains. He found beside them a people who could scarcely understand a word [of his language].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when he arrived between the two mountains, he found beside them a people who well-nigh understood not a word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he reached [the place] between the two barriers, he found between them a people who could hardly understand a word [of his language].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he reached (a tract) between two mountains, he found, beneath them, a people who scarcely understood a word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he reached between two mountains, he found, before (near) them (those two mountains), a people who scarcely understood a word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when he reached between the two barriers he found on one side of them a nation who could barely understand speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he reached the point separating the two barriers, he found beside them a people who could barely understand what is said.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when he reached [a pass] between two mountains, he found beside them a people who could hardly understand [his] speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:93] until, when he reached between the two barriers (read al-saddayn or al-suddayn here and [likewise] further below [at verse 94, saddan or suddan]) — [these were] two mountains [lying] in the remote regions beyond the land of the Turks; Alexander sealed the breach between the two, as will be described [below] — he found on this side of them, that is, in front of them, a folk that could scarcely comprehend speech, in other words, they could only understand it after much agonising (a variant reading [for yafqahūna, ‘comprehend’] has yufqihūna, ‘be understood’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Till, when he came between the two mountains, he found upon their hither side) between the two mountains (a folk that scarce could understand a saying) from other people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَيْنَ السَّدَّيْنِ } قال الإِمام زيد بن علي عليهما السَّلامُ: هو سُدٌّ إِذا كَان مَخلوقاً، وإنْ كَان مَعمولاً مِن فِعلِ بني آدم فهو سَدٌّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ حَتَّىٰ إِذَا بَلَغَ بَيْنَ السَّدَّيْنِ } أي: بين الجبلين اللذين سدَّ بينهما إسكندر بسدٍ منيعٍ، وهما جبلا يأجوج ومأجوج { وَجَدَ مِن دُونِهِمَا } أي: عندهما { قَوْماً } أعجمياً { لاَّ يَكَادُونَ يَفْقَهُونَ } ويفهمون { قَوْلاً } [الكهف: 93] لغةً من اللغات المتداولة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { بين السدين }: مفعول، لا ظرف لأنه يستعمل متصرفًا\n يقول الحقّ جلّ جلاله: { ثم أتْبَعَ } ذو القرنين { سببًا }: طريقًا ثالثًا بين المشرق والمغرب، سالكًا من الجنوب إلى الشمال، { حتى إذا بلغ بين السدين }: بين الجبلين، اللذين سُدَّ ما بينهما، وهو منقطع أرض الترك، مما يلي المشرق، لا جبال أرمينية وأذربيجان، كما توهم، وفيه لغتان: الضم والفتح، وقيل: ما كان من فعل الله فهو مضموم، وما كان من عمل الخلق فهو مفتوح\n { وجد من دونهما } أي: من ورائهما: مما يلي بر الترك، { قومًا }: أمة من الناس { لا يكادون يفقهون }: يفهمون { قولاً } لغرابة لغتهم، وقلة فطنتهم، وقرئ بالضم رباعيًا، أي: لا يُفصحون بكلامهم، واختلف فيهم، قيل: هم جيل من الترك قال السدي: الترك سُرْبة من يأجوج ومأجوج، خرجت، فضرب ذو القرنين السد، فبقيت خارجة\n قلت: ولعلهم طلبوا منه ذلك، حين اعتزلوا قومهم، ثم قال: فجميع الترك منهم\n وعن قتادة: أنهم، - أي: يأجوج ومأجوج - اثنتان وعشرون قبيلة، سد ذو القرنين على إحدى وعشرين، وبقيت واحدة، فسُموا الترك لأنهم تُرِكُوا خارجين\n قال أهل التاريخ: أولاد نوح عليه السلام ثلاثة: سام وحام ويافث، فسام أَبو العرب والعجم والروم، وحام أبو الحبشة والزنج والنوبة، ويافث أبو الترك والخرز والصقالبة ويأجوج ومأجوج\n هـ\n وقُرِئ بالهمز فيهما لأنه من أجيج النار، أي: ضوؤها وشررها، شُبهوا به في كثرتهم وشدتهم، وهو غير منصرف للعجمة والعلَمية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:70",
      "similarity": 0.7261468770908227
    },
    {
      "verse": "36:9",
      "similarity": 0.6680666527367047
    },
    {
      "verse": "4:9",
      "similarity": 0.5989394215772093
    },
    {
      "verse": "20:28",
      "similarity": 0.2608412228901509
    },
    {
      "verse": "18:94",
      "similarity": 0.24942573864853743
    }
  ]
}