{
  "chapter": "الكهف",
  "text": "قال هذا رحمة من ربى فاذا جاء وعد ربى جعله دكاء وكان وعد ربى حقا",
  "translations": [
    {
      "translation": "This is the benevolence of my Lord,\" he said; \"but when the promise of my Lord comes to pass, He will reduce it to a mound of dust; and the promise of my Lord is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Dhu al-Qarnayn said: \"This is a mercy from my Lord: but when the time of my Lord's promise shall come, He will level the rampart with the ground. My Lord's promise always comes true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Dhu l-Qarnayn said, \"This barrier is a blessing from my Lord but when His promise comes to pass He will level it to the ground; His promise always comes true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “This is the mercy of my Lord; then when the promise of my Lord arrives, He will blow it to bits; and my Lord’s promise is true.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"This is a mercy from my Lord, but when the promise of my Lord comes, He shall Dakka' it down to the ground. And the promise of my Lord is ever true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: This is a mercy from my Lord, but when the promise of my Lord comes to pass He will make it level with the ground, and the promise of my Lord is ever true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'This is a mercy from my Lord. But when the promise of my Lord comes to pass, He will make it into powder; and my Lord's promise is ever true.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: This is a mercy from my Lord; but when the promise of my Lord cometh to pass, He will lay it low, for the promise of my Lord is true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and he said, \"This is a mercy from my Lord. But when the promise of my Lord comes to pass, He will level it to dust. My Lord's promise is ever true!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: this is a mercy from my Lord; then when the promise of my Lord cometh, He shall make it powder, and the promise of my Lord is ever true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘This is a mercy from my Lord. But when the promise of my Lord is fulfilled, He will level it; and my Lord’s promise is true.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"This is a mercy from my Lord: But when the promise of my Lord comes to pass, He will make it into dust; and the promise of my Lord is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Dhul-Qarnain) said: \"This is a mercy from my Lord, but when the Promise of my Lord comes, He shall level it down to the ground. And the Promise of my Lord is ever true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'This is a mercy from my Lord. But when my Lord's promise is come, He will make it dust. The promise of my Lord is true'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “This is a mercy from my Lord. But when the promise of my Lord comes true, He will turn it into rubble, and the promise of my Lord is always true.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Dhul-Qarnayn] said, \"This is a mercy from my Lord; but when the promise of my Lord comes, He will make it level, and ever is the promise of my Lord true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:98] Said he, Dhū’l-Qarnayn, ‘This, namely, the barrier, the ability to make it, is a mercy from my Lord, a grace [from Him], because it prevents them from coming forth. But when the promise of my Lord comes to pass, [the promise] of their coming forth, which will be near [the time of] the Resurrection, He will level it, pulverised and flattened, for my Lord’s promise, of their coming forth and [of] other things, is [always] true’, it will be. God, exalted be He says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: This) wall (is a mercy from my Lord) to you; (but when the promise of my Lord cometh to pass) and Gog and Magog break free, (He will lay it low) He will break it, (for the promise of my Lord) that they will break free (is true) and this will surely take place.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جَعَلَهُ دَكَّآءَ } يعني مَدكُوكاً مُلزقاً بالأَرضِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفلما تم السد واستوى { قَالَ } ذو القرنين مسترجعاً إلى الله شاكراً لأنعمه: { هَـٰذَا } أي: إتمام هذه السد على الوجه الأسَدّ الأحكام { رَحْمَةٌ } نازلةُ عليّ { مِّن رَّبِّي } إذ لولا توفيقه وتمكينه لما صدر عني بقوتي أمثال هذا { فَإِذَا جَآءَ وَعْدُ رَبِّي } وقرُب قيام الساعة، وظهر أماراتها وأشراطها\n\n\n\n\nومن جملة أماراتها: خروج يأجوج ومأجوج { جَعَلَهُ } سبحانه هذا السد السديد الرفيع { دَكَّآءَ } أي: مدكوكاً مسوى مفتتاً أجزاؤه؛ بحيث لم يبقَ له ارتفاع أصلاً، وهم حينئذ يخرجون على الناس { وَكَانَ وَعْدُ رَبِّي } بقيام الساعة واستواء الأ { ض، وكونها دكاً بحيث لا عِوجَ لها ولا أمتاً { حَقّاً } [الكهف: 98] ثابتاً محققاً لا شبهة فيهز\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } ذو القرنين، لمن عنده من أهل تلك الديار وغيرهم: { هذا } أي: السد، أو تمكينه منه، { رحمةً } عظيمة { من ربي } على كافة العباد، لا سيما على مجاوريه، وفيه إيذان بأنه ليس من قبيل الآثار الحاصلة بمباشرة الخلق، بل هو إحسان إلهي محض، وإن ظهر بمباشرتي\n والتعرض لوصف الربوبية لتربية معنى الرحمة\n { فإذا جاء وعدُ ربي }: وقت وعده بخروج يأجوج ومأجوج، أو بقيام الساعة بأن شارف قيامُها، { جعله } أي: السد المذكور، مع متانته ورصانته، { دكّاءَ }: مدكوكًا مبسوطًا مستويًا بالأرض، وفيه بيان عظمة قدرته تعالى، بعد بيان سعة رحمته، { وكان وعد ربي حقًا }: كائنًا لا محالة\n رُوِيَ عنه صلى الله عليه وسلم أنه قال:\n\n \" إِنَّ يأجُوجَ ومأجُوجَ يَحْفِرُون السد، حَتَّى إِذَا كَادُوا يَرَوْنَ شُعَاعَ الشَّمْسِ، قَالَ الَّذِي عَلَيْهِمُ: ارْجِعُوا فَسَتَحْفِرونه غَدًا، فيُعِيدُهُ اللهُ كأشَدّ مَا كَانَ، حَتَّى إِذَا بَلَغتْ مُدَّتُهُمْ، حَفَرُوا، حَتَّى إِذَا كَادُوا يَرَوْنَ شُعَاعَ الشَّمْسِ، قَالَ الذِي عَلَيْهم: ارْجِعُوا فَسَتَحْفِرُونَهُ غَدًا إِنْ شَاءَ الله، فَيَعُودُونَ إِلَيْه، وهُوَ على هَيْئَتِهِ كما تَرَكُوهُ، فَيَحْفِرُونَهُ فيخْرُجُونَ عَلَى النَّاس \" \n\nوسيأتي في الأنبياء تمام قصة خروجهم، إن شاء الله، وهذا آخر كلام ذي القرنين",
      "translations": []
    }
  ]
}