{
  "chapter": "الكهف",
  "text": "قالوا۟ يذا القرنين ان ياجوج وماجوج مفسدون فى الارض فهل نجعل لك خرجا على ان تجعل بيننا وبينهم سدا",
  "translations": [
    {
      "translation": "They said, 'Dhu'l-Qarnayn! Yajuj and Majuj are causing corruption in the land. Can we, therefore, pay tribute to you in return for your constructing a barrier between us and them?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'O Dhu'l-Qarnain, Gog and Magog are oppressing the land. May we pay you some tribute so that you could build a rampart between us and them?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Dhu al-Qarnayn, Gog and Magog are spreading corruption in this land. So shall we pay you taxes on the understanding that you will set up a barrier between us and them?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Dhu 'l-Qarnayn, Gog and Magog are ravaging this land. Would you establish a barrier between us and them if we pay you a certain tax?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Zul-Qarnain – indeed Yajuj and Majuj* are spreading chaos in the land – so shall we assign for you a consideration upon the condition that you set up a wall between us and them?” (* Gog and Magog.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Dhul-Qarnayn! Verily, Ya'juj and Ma'juj are doing great mischief in the land. Shall we then pay you a tribute in order that you might erect a barrier between us and them\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Zulqarnain! surely Gog and Magog make mischief in the land. Shall we then pay you a tribute on condition that you should raise a barrier between us and them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'O Dhool Karnain, behold, Gog and Magog are doing corruption in the earth; so shall we assign to thee a tribute, against thy setting up a barrier between us and between them?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Dhu'l-Qarneyn! Lo! Gog and Magog are spoiling the land. So may we pay thee tribute on condition that thou set a barrier between us and them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O Dhu'l-Qarnayn! Gog and Magog are causing corruption in the land, so may we pay you tribute on condition that you set a barrier between us and them?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`They said: O Zul-Qarnain verily Yajuj and Majuj are working corruption in the land; shall we then pay thee tribute on condition that thou place between us and them a barrier!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O Dhul Qarnayn! Indeed Gog and Magog are causing disaster in this land. Shall we pay you a tribute on condition that you build a barrier between them and us?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Zul-qarnain! the Gog and Magog (People) do great mischief on earth: shall we then render thee tribute in order that thou mightest erect a barrier between us and them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Dhul-Qarnain! Verily! Ya'juj and Ma'juj (Gog and Magog) are doing great mischief in the land. Shall we then pay you a tribute in order that you might erect a barrier between us and them?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ThulKarnain' they said, 'Look, Gog and Magog are corrupting the earth. Build for us a barrier between us and them, and we will pay you a tribute'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Zul-Qarnain, the Gog and Magog are spreading chaos in the land. Can we pay you, to build between us and them a wall?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O Dhul-Qarnayn, indeed Gog and Magog are [great] corrupters in the land. So may we assign for you an expenditure that you might make between us and them a barrier?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:94] They said, ‘O Dhū’l-Qarnayn, truly Gog and Magog (read Ya’jūj wa-Ma’jūj or Yājūj wa-Mājūj: these two are non-Arabic names of two tribes and are therefore indeclinable) are causing corruption in the land, plundering and oppressing [us] when they come forth to attack us. So shall we pay you a tribute, some [form of] payment (a variant reading [for kharjan] is kharājan), on condition that you build between us and them a barrier?, an obstruction, so that they will not be able to reach us.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said) to the interpreter: (0 Dhu'l-Qarnayn! Lo! Gog and Magog are spoiling the land) they are destroying our land, they eat our dates, loot our crops and kill our offspring; it is also said that this means: they devour people, for Gog and Magog were two men from the descendent of the children of Yapheth; it is also said that they were called Gog and Magog due to their sheer number. (So may we pay thee tribute) a reward; and it is also said that this means a wage, according to a different reading, (on condition that thou set a barrier between us and them?)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } بلسان الواسطة والترجمان: { يٰذَا ٱلْقَرْنَيْنِ } نحن أناس ضعفاء مظلومون نحتاج إلى إعانتك\n لتنقذنا من يد الظلمة { إِنَّ يَأْجُوجَ وَمَأْجُوجَ } عَلَمَان للقبيلتين من الترك هما { مُفْسِدُونَ فِي ٱلأَرْضِ } أي: في أرضنا هذه بأنواع الفسادات\n\n\nقيل: كانوا يخرجون في الربيع فلا يتركون أخضر ربطاً إلا أكلوه\n ولا يباساً إلا حملوه\n وقيل: كانوا يأكلون الناس أيضاً\n\n\n{ فَهَلْ نَجْعَلُ لَكَ خَرْجاً } جُعلاً نوزع بيننا فيبلغ مبلغاً وافياً { عَلَىٰ أَن تَجْعَلَ } بسطوتك وسلطتك { بَيْنَنَا وَبَيْنَهُمْ سَدّاً } [الكهف: 94] منيعاً لا يمكنهم الخروج علينا فنأمن شرهم بجاهك\n\n\n{ قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيْرٌ } أي: ما جعلني وخصني ربي بفضله وجوده مكيناً من المال والملك خير مما تجمعوت بتوزيعكم وتخريجكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقالوا له: { إِن يأجوج ومأجوج } \n قد تقدم أنهم من أولاد يافث\n وما يقال: إنهم من نطفة احتلام آدم لم يصح\n واختلف في صفاتهم\n فقيل: في غاية صغر الجثة وقصر القامة\n لا يزيد قدمهم على شبر\n وقيل: في نهاية عِظم الجسم وطول القامة\n تبلغ قدودهم نحو مائة وعشرين ذراعًا\n وفيهم من عرضه كذلك\n\n \" قال عبد الله بن مسعود: سألتُ النبي صلى الله عليه وسلم عن يأجوج ومأجوج\n فقال:هم أمم\n كل أمة أربع مائة ألف\n لا يموت الرجل منهم حتى ينظر إلى ألف ذَكَر من صلبه\n كلهم قد حمل السلاح\n قيل: يا رسول الله صفهم لنا\n قال: هم ثلاثة أصناف: صنف منهم أمثال الأرز - وهو شجر بالشام طول الشجرة عشرون ومائة ذراع - وصنف عرضه وطوله سواء\n عشرون ومائة ذراع\n وصنف يفرش أذنه ويلتحف بالأخرى\n لا يمرون بفيل ولا وحش ولا خنزير إلا أكلوه\n ومن مات منهم أكلوه\n مُقَدَّمَتُهُمْ بالشام\n وسَاقَتُهُمْ بخراسان\n يشربون أنهار المشرق\n وبحيرة طبرية \"\n \nفقالوا له: { إِنَّ يأجوج ومأجوج مفسدون في الأرض } أي: في أرضنا\n بالقتل\n والتخريب\n وإتلاف الزرع\n قيل: كانوا يخرجون أيام الربيع\n فلا يتركون أخضر إلا أكلوه\n ولا يابسًا إلا احتملوه\n وكانوا يأكلون الناس أيضًا\n\n{ فهل نجعلُ لك خَرْجًا } أي: جُعْلاً من أموالنا { على أن تجعلَ بيننا وبينهم سدًّا } بالفتح وبالضم\n أي: حاجزًا يمنعهم منا؟ { قال ما مكَّني } - بالفك وبالإدغام - أي: ما مكنني { فيه ربي } \n وجعلني في مكينًا قادرًا من الملك والمال وسائر الأسباب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:96",
      "similarity": 0.5581103550612326
    },
    {
      "verse": "33:70",
      "similarity": 0.27064794023513566
    },
    {
      "verse": "36:9",
      "similarity": 0.26397279169387927
    },
    {
      "verse": "4:9",
      "similarity": 0.2494809175134894
    },
    {
      "verse": "18:93",
      "similarity": 0.24942573864853737
    }
  ]
}