{
  "chapter": "الكهف",
  "text": "ءاتونى زبر الحديد حتى اذا ساوى بين الصدفين قال انفخوا۟ حتى اذا جعله نارا قال ءاتونى افرغ عليه قطرا",
  "translations": [
    {
      "translation": "Bring me ingots of iron!' Then, when he had made it level between the two high mountain-sides, he said, 'Blow!' and when he had made it a red hot fire, he said, 'Bring me molten brass to pour over it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me ingots of iron,\" (which they did) until the space between two mountain sides was filled up. \"Blow your bellows,\" he said; (and they blew) until it was red hot. \"Bring me molten brass,\" he said, \"that I may pour over it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me ingots of iron.\" Then after he had filled up the space between the two mountain-sides, he said: \"(Light a fire) and ply bellows.\" When he had made it (red like) fire, he said: \"Bring me molten copper which I may pour on it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me blocks of iron to fill up the passage between the two mountains.\" He told them to ply their bellows until the iron became hot as fire. Then he told them to pour on it molten brass.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Give me sheets of iron”; until when he had raised the wall equal to the edge of the two mountains, he said, “Blow”; to the extent that he made it ablaze – he said, “Bring me molten copper to pour upon it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give me Zubar of iron;\" then, when he had filled up the gap between the two mountain-cliffs, he said: \"Blow;\" then when he had made them (red as) fire, he said: \"Bring me Qitran to pour over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me blocks of iron; until when he had filled up the space between the two mountain sides, he said: Blow, until when he had made it (as) fire, he said: Bring me molten brass which I may pour over it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me ingots of iron!' Until, when he had made all level between the two cliffs, he said, 'Blow!' Until, when he had made it a fire, he said, 'Bring me, that I may pour molten brass on it.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give me pieces of iron - till, when he had levelled up (the gap) between the cliffs, he said: Blow! - till, when he had made it a fire, he said: Bring me molten copper to pour thereon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "bring me blocks of iron.\" Then, when he had filled the gap between the mountain sides [he said], \"Now blow on the fire with your bellows.\" When the iron blocks were red with heat, he said, \"Bring me molten brass to pour on them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me lumps of iron. Then when he had evened Up between the two mountain-sides, he said: blow! Then when he had made it fire, he said: bring me and I shall pour thereon molten cOpper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me pieces of iron!’ When he had levelled up between the flanks, he said, ‘Blow!’ When he had turned it into fire, he said, ‘Bring me molten copper to pour over it.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me blocks of iron.\" At length, when he had filled up the space between the two steep mountain-sides, He said, \"Blow (with your bellows)\" Then, when he had made it (red) as fire, he said: \"Bring me, that I may pour over it, molten lead.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give me pieces (blocks) of iron,\" then, when he had filled up the gap between the two mountain-cliffs, he said: \"Blow,\" till when he had made it (red as) fire, he said: \"Bring me molten copper to pour over it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me ingots of iron' After he had leveled between the two cliffs, he said: 'Blow' And when he made it a fire, he said: 'Bring me molten copper so that I may pour over it'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Bring me blocks of iron.” So that, when he had leveled up between the two cliffs, he said, “Blow.” And having turned it into a fire, he said, “Bring me tar to pour over it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring me sheets of iron\" - until, when he had leveled [them] between the two mountain walls, he said, \"Blow [with bellows],\" until when he had made it [like] fire, he said, \"Bring me, that I may pour over it molten copper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:96] Bring me ingots of iron!’, namely, pieces thereof, as large as the [blocks of] stone to be used in the construction; he used these [ingots] in his construction, placing between them firewood and coal. Until,   when he had levelled up [the gap] between the two flanks (read al-sudufayn, or al-sadafayn or al-sudfayn, meaning, the two flanks of the two mountains) he set up bellows and [lit a] fire around this [construction] — he said, ‘Blow!’, and they blew, until, when he had made it, namely, the iron, a fire, that is, like a fire, he said, ‘Bring me molten copper to pour over it’ (the two verbs [ātūnī, ‘bring me’, and ufrigh, ‘pour’] are in contention over this [direct object, qitran, ‘molten copper’]; it [this direct object] has been omitted before the first [verb] because it is being governed by the second [verb]). Thus he poured the molten copper over the hot iron so that it penetrated between the [individual] ingots, making a [solid] single whole.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "323 (Give me pieces of iron till, when he had levelled up (the gap) between the cliffs, he said: Blow!) and so they blew into the Fire (till, when he had made it a fire) He says: when the iron became as hot as the Fire and thus melted, (he said: Bring me molten copper to pour thereon) to pour on the wall.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { آتُونِي زُبَرَ ٱلْحَدِيدِ } معناه قِطعُ الحَدِيد\n\n\n\n\nوقوله تعالى: { حَتَّىٰ إِذَا سَاوَىٰ بَيْنَ ٱلصَّدَفَيْنِ } يعني بين الجَبلينِ ويقال: الصُدُفَينِ\n\n\n\n\nوقوله تعالى: { أُفْرِغْ عَلَيْهِ قِطْراً } معناه صبُ عليهِ صفراً\n ويقال حَديدٌ ذَائبٌ\n ويقال هو الرَّصاصُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Bring me the iron} [means] cut the iron.\n\n\nAnd His saying, {Until, when he came between the two mountains}, [means] between the two mountains, and it is said: [the] two mountains.\n\n\nAnd His saying, \"Pour out upon him an overflowing measure,\" means bestow upon him complete and utter nothingness.\n\n\nAnd it is said that iron is a wolf.\n\n\nHe is the bullet.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأمرهم بارتفاعهم هكذا { حَتَّىٰ إِذَا سَاوَىٰ بَيْنَ ٱلصَّدَفَيْنِ } أي: بين جانبي الجبلين حتى امتلأ بين الجبلين\n وصار ما بينهما مساوياً للطرفين في الرفعة\n ثم أمرهم بوضع المنافع العظام من كلا طرفي السد\n\nثم { قَالَ } لهم: { ٱنفُخُواْ } فنفخوا { حَتَّىٰ إِذَا جَعَلَهُ نَاراً } أي: جعل المنفوخ فيه مثل النار في اللون الحرارة\n فاحترق الحطب والفحم\n واتصل بالزُبَر المحماة وبقيت فُرَجُ صغارُ إلى حيث لم تصل إلى الملاسة والاستواء { قَالَ آتُونِيۤ } نحاساً مذاباً { أُفْرِغْ } وأصب { عَلَيْهِ قِطْراً } [الكهف: 96] حتى يصير ملساءً مسوى لا فُرجَ لها\n ولا يرى أوصالها أصلاً فصَبّ فاستوى فصار أملس كأنه لا فُرجَ فيه أصلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وذلك قوله تعالى: { حتى إذا ساوى بين الصَّدَفَينِ } \n وقرئ بضمهما\n أي: ما زال يبني شيئًا فشيئًا حتى إذا جعل ما بين ناصيتي الجبلين من البنيان مساويًا لهما في السُّمْك\n قيل: كان ارتفاعه: مائتي ذراع\n وعرضه: خمسون ذراعًا\n وقرئ { سوَّى } بالتشديد\n من التسوية\n فلما سوّى بين الجبلين بالبناء\n { قال } للعَمَلة: { انفخوا } النيران في الحديد المبني\n ففعلوا { حتى إذا جعله } أي: المنفوخ فيه { نارًا } أي: كالنار في الحرارة والهيئة\n وإسناد الجعل إلى ذي القرنين\n مع أنه من فعل العملة للتنبيه على أنه العمدة في ذلك\n وهم بمنزلة الآلة\n { قال } للذين يتولون أمر النحاس من الإذابة وغيرها: { آتُوني أُفرغ عليه قِطْرًا } أي: آتوني نحاسًا مُذابًا أُفرغه عليه\n وإسناد الإفراغ إلى نفسه\n لِمَا تقدم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:157",
      "similarity": 0.5006369469684429
    },
    {
      "verse": "6:46",
      "similarity": 0.45124180707540174
    },
    {
      "verse": "33:14",
      "similarity": 0.3261279885639549
    },
    {
      "verse": "94:7",
      "similarity": 0.2972508167155965
    },
    {
      "verse": "55:31",
      "similarity": 0.2897765549734441
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/18:96.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/18:96.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/18:96.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}