{
  "chapter": "الكهف",
  "text": "وتركنا بعضهم يومئذ يموج فى بعض ونفخ فى الصور فجمعنهم جمعا",
  "translations": [
    {
      "translation": "We will abandon them, that Day, to pound against each other in surging waves and the Trumpet will be blown and We will gather them all together.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall leave them on that day surging like waves pressing one against the other, and the trumpet blast will be sounded, when We shall gather them all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that Day We shall let some of them surge like waves against others, and the Trumpet shall be blown. Then We shall gather them all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the barrier is demolished, We will leave human beings in chaos. We will leave them like the waves of the sea striking against each other. Then the trumpet will be sounded and We will bring them all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that day We shall release them in groups surging like waves one after another, and the Trumpet will be blown – so We shall gather them all together. (* Gog and Magog will come out during the time of Eisa (Jesus – when he comes back to earth) and cause great destruction in the land.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that Day, We shall leave some of them to surge like waves on one another; and the Trumpet will be blown, and We shall collect them (the creatures) all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that day We will leave a part of them in conflict with another part, and the trumpet will be blown, so We will gather them all together;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon that day We shall leave them surging on one another, and the Trumpet shall he blown, and We shall gather them together,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that day we shall let some of them surge against others, and the Trumpet will be blown. Then We shall gather them together in one gathering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, We shall let them surge against each other like waves and then the Trumpet will be blown and We shall gather them all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall leave them on that day surging one against anot her and the trumpet shall be blown, and then We shall assemble them together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That day We shall let them surge over one another, the Trumpet will be blown, and We shall gather them all,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day We shall leave them to surge like waves on one another: the trumpet will be blown, and We shall collect them all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that Day [i.e. the Day Ya'juj and Ma'juj (Gog and Magog) will come out], We shall leave them to surge like waves on one another, and the Trumpet will be blown, and We shall collect them all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, We will let them surge on one another, and the Horn shall be blown, and We will gather them all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, We will leave them surging upon one another. And the Trumpet will be blown, and We will gather them together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will leave them that day surging over each other, and [then] the Horn will be blown, and We will assemble them in [one] assembly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:99] And on that day, the day of their coming forth, We shall let some of them surge against others, mixing with one another, on account of their multitude, and the Trumpet, namely, the Horn signalling the Resurrection, shall be blown and We shall gather them, namely, creatures, in one place, on the Day of Resurrection, a [single] gathering.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And on that day) the day when Gog and Magog break free; and it is also said: the day of return from Byzantium in that they were not able to defeat it, (We shall let some of them surge against others, and the Trumpet will be blown. Then We shall gather them together in one gathering).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَتَرَكْنَا بَعْضَهُمْ يَوْمَئِذٍ يَمُوجُ فِي بَعْضٍ } اي: وبعدما جعلنا الأرض مبسوطة مدكوكة بمقتضى قهرنا وجلالنا، وجعلنا السد السديد الرفعيت المنيع مسوى، أخرجنا يأجوج ومأجوج بإقدارنا إياهم بالخروج، وتركنا بعض الناس يموج ويزدحم ويدخل من صولتهم واستيلائهم بعضاً مضطربين ومضطرين، { وَ } هم في ذلك الاضراب والتشتت من استيلاْ أولئك الظلمة القهارين القتّالين { وَنُفِخَ فِي ٱلصُّورِ } للحشر إلى المحشر وقامت الطامة الكبرى { فَجَمَعْنَاهُمْ } حينئذ؛ أي: جميع الخلائق للعرض والحساب { جَمْعاً } [الكهف: 99] مجتمعين في المحشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { وتركنا بعضهم يومئذ }: يوم مجيء الوعد، ويخرجون، { يموجُ في بعض } يزدحمون في البلاد، أو: يموج بعض الخلق في بعض، فيضطربون ويختلطون إنسهم وجنهم، حيارى من شدة الهول",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:20",
      "similarity": 0.5101776509576279
    },
    {
      "verse": "69:13",
      "similarity": 0.49466107270560944
    },
    {
      "verse": "6:73",
      "similarity": 0.4495731626793761
    },
    {
      "verse": "11:43",
      "similarity": 0.44309870582856586
    },
    {
      "verse": "11:42",
      "similarity": 0.4315539805369187
    }
  ]
}