{
  "chapter": "الكهف",
  "text": "كذلك وقد احطنا بما لديه خبرا",
  "translations": [
    {
      "translation": "Our knowledge encompasses all that happened to him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was so, for We were fully informed about him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus was the state of those people, and We encompassed in knowledge all concerning Dhu al- Qarnayn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This indeed was true. We knew all that he did there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it is; and Our knowledge encompasses all that he possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So (it was)! And We knew all about him (Dhul-Qarnayn).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so! and We had a full knowledge of what he had.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So; and We encompassed in knowledge what was with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So (it was). And We knew all concerning him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus indeed it was. We had full knowledge of him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus it was. And surely We have encompassed all that was with him, in knowledge\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it was, and We were fully aware of whatever [means] he possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He left them) as they were: We completely understood what was before him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So (it was)! And We knew all about him (Dhul-Qarnain).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We encompassed in knowledge what was with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so it was. We had full knowledge of what he had.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus. And We had encompassed [all] that he had in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:91] So [it was], in other words, the situation was as We have stated; and We encompassed whatever pertained to him, that is, what Dhū’l-Qarnayn possessed in the way of machinery, men and otherwise, in knowledge.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So (it was)) just as he reached the West, so did he reach the East. (And We knew all concerning him) We knew what he had of information and exposition.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مع كثر عددهم ومركهم وخداعهم { قَدْ أَحَطْنَا بِمَا لَدَيْهِ خُبْراً } [الكهف: 91] يعني: أعلمنا إسكندرَ ومن عنده من الجند والخدمة علماً بجال أعدائهم، فقاتلوا معهم وغلبوا عليهم، فوضع عليهم أيضاً شعائر الإسلام مثل ما وضع لأهل المغرب { ثُمَّ أَتْبَعَ سَبَباً } [الكهف: 92] ثالثاً، وسار على العرض بين المشرق والمغرب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { كذلك }: أي: أمر ذي القرنين كما وصفنا، في رفعة المحل وبسط الملك، أو أمره فيهم كأمره في أهل مغرب الشمس، من التخيير والاختيار، أو وجد قومًا عند مطلع الشمس كذلك، وحكم فيهم، بحكم أولئك\n أو: { لم نجعل لهم } سترًا مثل ستركم من اللباس والأكنان والجبال\n قال الحسن: كانت أرضهم لا جبل فيها ولا شجر، ولا تحمل البناء، فإذا طلعت الشمس هربوا إلى البحر\n هـ\n قال تعالى: { وقد أحطْنا بما لديه } من الأسباب والعُدَد، وما صدر عنه وما لاقاه { خُبْرًا }: علمًا تعلق بظواهره، وخفايا أمره، يعني: أن ذلك بلغ من الكثرة بحيث لا يحيط به إلا علم اللطيف الخبير\n\n\nالإشارة: كان ذو القرنين في الظاهر يلتمس مطلع الشمس الحسية، وفي الباطن يلتمس مطلع الشمس المعنوية، وهي شمس القلوب، التي تكشف أستار الغيوب، ثم أتبع سبَبًا يُوصل إلى شمس العيان، فوجدها تطلع على قلوب أهل العرفان، لم يجعل لهم من دونها سِتْرًا على الدوام، لما أتحفهم به من غاية الوصال والإكرام، حتى قال قائلهم: لو حجب عني الحق تعالى طرفة عين ما أعددت نفسي من المسلمين، وكذلك رسول الله صلى الله عليه وسلم، أو يقول: وجدها تطلع على أهل التجريد، الخائضين في بحار التوحيد، وأسرار التفريد، وفيهم قال المجذوب رضي الله عنه:\n\nقد تجرّدوا من لباس الزينة والافتخار، ولبسوا لباس المسكنة والافتقار، فعوضهم الله تعالى في قلوبهم لباس الغنى والعز والاقتدار، صبروا قليلاً، واستراحوا زمنًا طويلاً، تذللوا قليلاً، وعزّوا عزًا طويلاً، جعلنا الله منهم بمنِّه وكرمه\n ثمَّ أخذ ذو القرنين من الجنوب إلى الشمال\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:68",
      "similarity": 0.5841472080353772
    },
    {
      "verse": "50:35",
      "similarity": 0.5371874904255683
    },
    {
      "verse": "72:28",
      "similarity": 0.5268269278930585
    },
    {
      "verse": "50:29",
      "similarity": 0.5040574140068603
    },
    {
      "verse": "43:4",
      "similarity": 0.49345260228432225
    }
  ]
}