{
  "chapter": "الكهف",
  "text": "قال ما مكنى فيه ربى خير فاعينونى بقوة اجعل بينكم وبينهم ردما",
  "translations": [
    {
      "translation": "He said, 'The power my Lord has granted me is better than that. Just give me a strong helping hand and I will build a solid barrier between you and them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"The ability my Lord has given me is better. So help me with your manual labour; I will build a wall between you and them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answered: \"Whatever my Lord has granted me is good enough. But help me with your labour and I will erect a rampart between you and them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"The power that my Lord has granted me is better (than your tax). Help me with your man-power and I shall construct a barrier between you and Gog and Magog.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “That which my Lord has given me control over is better, therefore help me with strength – I shall set up a barrier between you and them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"That in which my Lord had established me is better. So help me with strength, I will erect between you and them a barrier.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: That in which my Lord has established me is better, therefore you only help me with workers, I will make a fortified barrier between you and them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'That wherein my Lord has established me is better; so aid me forcefully, and I will set up a rampart between you and between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: That wherein my Lord hath established me is better (than your tribute). Do but help me with strength (of men), I will set between you and them a bank.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"What My Lord has given me is better [than any tribute]. Help me with a force of labourers and I will erect a barrier between you and them:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: better is that where in my Lord hath established me; so help me with might, and I shall place between you and them a rampart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘What my Lord has furnished me is better. Yet help me with some strength, and I will make a bulwark between you and them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"(The power) in which my Lord has established me is better (than tribute): Help me therefore with strength (and labour): I will erect a strong barrier between you and them:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"That (wealth, authority and power) in which my Lord had established me is better (than your tribute). So help me with strength (of men), I will erect between you and them a barrier.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'That which my Lord has given me is better, therefore help me with all your power, and I will build a barrier between you and between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “What my Lord has empowered me with is better. But assist me with strength, and I will build between you and them a dam.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"That in which my Lord has established me is better [than what you offer], but assist me with strength; I will make between you and them a dam.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:95] He said, ‘That, wealth and so on, wherewith my Lord has empowered me (makkannī, a variant reading has makkananī) is better, than the tribute that you offer me, and so I have no need for it. I shall build for you the barrier without [demanding] a fee; so help me with strength, in that which I [will] demand from you, and I will build between you and them a rampart, a fortified barricade.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: That wherein my Lord hath established me) the dominion that my Lord has given me is (better) than your reward or wage. (Do but help me with strength) they said: \"which strength do you want from us\" and he said: \"the strength of blacksmiths\", (I will set between you and them a bank) a barrier.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قال ما مكنّي فيه ربي } من المعاني الكلية والجزئية الحاصلة بالتجربة والسير في المشرق والمغرب { خير فأعينوني بقوة } أي: عمل وطاعة { أجعل بينكم وبينهم ردماً } هو الحكمة العملية والقانون الشرعي\n { آتوني زُبُرَ الحديد } من الصور العملية وأوضاع الأعمال { حتى إذا ساوى بين الصدفين } بالتعديل والتقدير { قال } للقوى الحيوانية { انْفخوا } في هذه الصور نفخ المعاني الجزئية والهيئات النفسانية من فضائل الأخلاق { حتى إذا جعله ناراً } أي: علماً برأسه من جملة العلوم يحتوي على بيان كيفية الأعمال { قال آتوني أفرغ عليه قطراً } النية والقصد الذي يتوسط بين العلم والعمل\n فيتحد به روح العلم وجسد العمل كالروح الحيواني المتوسط بين الروح الإنساني والبدن\n فحصل سدّ\n أي: قاعدة وبنيان من زبر الأعمال ونفخ العلوم والأخلاق وقطر العزائم والنيات\n واطمأنت به النفس وتدبرت فآمنت",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا حاجة إلى أموالكم بل إلى إعانتكم وسعيكم أُجراء { فَأَعِينُونِي } في وضع هذا السد { بِقُوَّةٍ } أي: عملةٍ وصنَّاع يأخذون مني أجرتهم ويعلمون { أَجْعَلْ } بفضل الله وسعة جوده إن تعلق به مشيئته { بَيْنَكُمْ وَبَيْنَهُمْ رَدْماً } [الكهف: 95] حاجزاً حصيناً منعياً وثيقاً\n بحيث لا يقبل التخريب إلى انقراض الدنيا\n\n\n{ آتُونِي } وأحضروا عندي أولاً { زُبَرَ ٱلْحَدِيدِ } أي: قطعها الكبيرة\n فَأتَوا بها فأمرهم بحفر الأرض إلى أن وصل الماء\n فوضع الأساس من الصخر النحاس المذاب حتى وصل وجه الأرض\n ثم أمرهم بتنضيد قطع الحديد بأن وضعوا بين كلا قطعتي الحديد فحماً وحطباً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { خيرٌ } من جُعْلِكم\n فلا حاجة لي به\n { فأَعينوني بقوة } الأبدان وعمل الأيدي\n كصُنَّاع يحسنون البناء والعمل\n وبآلاتٍ لا بد منها في البناء\n { أجعلْ بينكم وبينهم رَدْمًا } أي: حاجزًا حصينًا\n وبرزخًا مكينًا\n وهو أكبر من السد وأوثق\n يقال: ثوب مُردم إذا كان ذا رقاع فوق رقاع\n وهذا إسعاف لهم فوق ما يرجون\n { آتُوني زُبَرَ الحديد }: جمع زبرة\n وهي القطعة الكبيرة\n وهذا لا ينافي رد خراجهم لأن المأمور الإيتاء بالثمن أو المناولة\n كما ينبئ عنه قراءة: \" ائتوني \" بوصل الهمزة\n أي: جيئوني بزبر الحديد\n على حذف الباء\n ولأن إيتاء الآلة من قبيل الإعانة بالقوة\n دون الخراج على العمل\n قال القشيري: استعان بهم في الذي احتاج إليه منهم\n ولم يأخذ منهم عُمالة لما رأى أن من الواجب عليه حق الحماية على حسب المُكنة\n هـ\n ولعل تخصيص الأمر بالإتيان بها دون سائر الآلات من الفحم والحَطب وغيرهما لأن الحاجة إليها أمسُّ لأنها الركن في السد\n ووجودها أعز\n قيل: حفر الأساس حتى بلغ الماء\n وجعل الأساس من الصخر والنحاس المذاب\n والبنيان من زبر الحديد\n وجعل بيْنهما الفحم والحطب\n حتى سد ما بين الجبلين إلى أعلاهما\n وكان بينهما مائة فرسخ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:153",
      "similarity": 0.13839476603075268
    },
    {
      "verse": "21:112",
      "similarity": 0.13699840281407463
    },
    {
      "verse": "1:5",
      "similarity": 0.13672624250591414
    },
    {
      "verse": "107:7",
      "similarity": 0.1355461381748953
    },
    {
      "verse": "7:128",
      "similarity": 0.1354002885809254
    }
  ]
}