{
  "chapter": "الكهف",
  "text": "ام حسبت ان اصحب الكهف والرقيم كانوا۟ من ءايتنا عجبا",
  "translations": [
    {
      "translation": "Do you think the men of the cave and Ar-Raqim were so strange among Our signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that the people of the Cave and the Inscription were one of Our wondrous signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not think that the story of the Companions of the Cave and the Inscription was one of Our marvelous miracles?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you know that the People of the Cave and People close to the Woods, were Our exceptional signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that the people of Al-Kahf and Ar-Raqim were a wonder among Our signs\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do you think that the Fellows of the Cave and the Inscription were of Our wonderful signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or dost thou think the Men of the Cave and Er-Rakeem were among Our signs a wonder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or deemest thou that the People of the Cave and the Inscription are a wonder among Our portents?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that the Men of the Cave and the Inscription were one of Our wondrous signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deemest thou that the people of the cave and the inscription were of Our signs a wonder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you suppose that the Companions of the Cave and the Inscription were among Our wonderful signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or dost thou reflect that the Companions of the Cave and of the Inscription were wonders among Our Sign?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that the people of the Cave and the Inscription (the news or the names of the people of the Cave) were a wonder among Our Signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do you think the companions of the Cave and the tomb stone were a wonder among Our signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you know that the People of the Cave and the Inscription were of Our wondrous signs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have you thought that the companions of the cave and the inscription were, among Our signs, a wonder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[18:9] Or did you think, did you suppose, that the Companions of the Cave, the cavern in the mountain, and the Inscription, the tablet wherein their names and lineages had been inscribed — the Prophet (s) had been asked about their tale — were, with regard to their tale, a [unique] marvel from among, the entirety [of], Our signs? (‘ajaban, ‘a marvel’ is the predicate of [the defective verb] kāna [sc. kānū], the preceding [min āyātinā, ‘from among Our signs’] being a circumstantial qualifier). In other words, [did you suppose] that they were a marvel exclusively from among all [Our] other signs, or that they were the most marvellous among them? Not so.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or deemest thou) Muhammad (that the People of the Cave and the Inscription) whereof the names of these youth and their story were inscribed; it is also said that the inscription refers to the valley where this cave was; and it is also said that it refers to a city (are a wonder among Our portents) such as the sun, the moon, the sky, the earth, the stars, the oceans and even that which is more wonderous than this?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَمْ حَسِبْتَ أَنَّ أَصْحَابَ ٱلْكَهْفِ وَٱلرَّقِيمِ } الرَّقيمُ: الوادي\n وقال: القَريةُ\n وقال: اللّوحُ المَكتوبُ فيهِ أَسماءُ أَصحابِ أهلِ الكهفِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأعَجِبْتَ واستبعدت عن كمال قوتنا وقدرتنا بجعل ما على الأرض صعيداً جرزاً؟ { أَمْ حَسِبْتَ } وشككت { أَنَّ أَصْحَابَ ٱلْكَهْفِ } أي: قصتهم وشأنهم\n والكهف هو: الغار الواسع في الجبل\n { وَٱلرَّقِيمِ } هو اسم الجبل الذي فيه الغار، أو اسم الوادي الذي فيه، أو اسم قريتهم، أو كلبهم، أو لوحُ رصاصي أو حجريُ، رُقِمَ أو رُقِمت فيه أسماؤهم وجُعل على باب الكهف، أو أصحابُ الرقيم قومُ آخرون على اختلاف الأقوال والروايات\n\n\n\n\nوبالجملة: { كَانُواْ مِنْ آيَاتِنَا } الدالة على كمال قوتنا وقدرتنا { عَجَباً } [الكهف: 9] أي: آيةً يتعجب منها الناس، ويستبعدون وقوعها مع أنه لا شك في وقوعها؛ إذ بلغت من التواتر حداً لا يتوهم فيها الكذب قطعاً؛ إذ أمثال هذا في جنب قدرتنا الكاملة وقوتنا الشاملة سهلُ يسير\n\n\n\n\nولو رفعتَ أيها المعتبر المتأمل الإلْفَ والعادة عن البين، وطرحتَ تكرر المشاهدة والمؤانسة عن العين، لكان ظهور كل ذرةٍ من ذرائر العالم في التعجب والاستعباد وكمال الغرابة البداعة مثل هذا، بل أغرب وأعجب من هذا، فلك أن تراجع وجدانك وتتأمل أمرك وشأنك حتى تجد في نفسك عجائب وغرائب يدهش منها عقلك وينحسر رأيك وفهمك ويكلّ إدراكك، وبالجملة: استغرقتَ في بحر الحيرة والدهشة من نفسك فكيف من غيرك\n\n\n\n\nأذقنا بلطفك حلاوة مطالعة مبدعاتك ومشاهدة مخترعاتك بنظر العبرة والحضور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}