{
  "chapter": "مريم",
  "text": "واذكر فى الكتب مريم اذ انتبذت من اهلها مكانا شرقيا",
  "translations": [
    {
      "translation": "Mention Maryam in the Book, how she withdrew from her people to an eastern place,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Commemorate Mary in the Book. When she withdrew from her family to a place in the East\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), recite in the Book the account of Mary, when she withdrew from her people to a place towards the east;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), mention in the Book (the Quran) the story of Mary how she left her family and started living in a solitary place to the East\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Maryam in the Book; when she went away from her family to a place towards east.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book, Maryam, when she withdrew in seclusion from her family to place facing east.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention Marium in the Book when she drew aside from her family to an eastern place;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book Mary when she withdrew from her people to an eastern place,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make mention of Mary in the Scripture, when she had withdrawn from her people to a chamber looking East,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recount in the Book how Mary withdrew from her people to an eastern place\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention thou in the Book Maryam, what time the retired from her people to a place eastward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book Mary, when she withdrew from her family to an easterly place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Relate in the Book (the story of) Mary, when she withdrew from her family to a place in the East.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book (the Quran, O Muhammad SAW, the story of) Maryam (Mary), when she withdrew in seclusion from her family to a place facing east.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book, Mary, how she withdrew from her people to an eastern place and she took a veil apart from them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Scripture Mary, when she withdrew from her people to an eastern location.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention, [O Muhammad], in the Book [the story of] Mary, when she withdrew from her family to a place toward the east.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:16] And mention in the Book, [in] the Qur’ān, Mary, that is, [mention] her tale, when she withdrew from her family to an easterly place, that is, [when] she secluded herself in a place on the east side of [her] home.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And make mention) Muhammad (of Mary) of the event of Mary (in the Scripture) in the Qur'an, (when she had withdrawn from her people to a chamber looking East) east of their house,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذِ ٱنتَبَذَتْ مِنْ أَهْلِهَا مَكَاناً شَرْقِياً } يعني اعتزلَتْ إِلى مَكانٍ ممّا يَلي الشَّرقَ، وهو عِندَ العَربِ خَيرٌ مِن الغَربي\n والقَصى: المَكانُ البَعيدُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱذْكُرْ } يا أكمل الرسل { فِي ٱلْكِتَابِ } أي: القرآن المنزل إليك سيد النساء { مَرْيَمَ } أي: قصتها، وحالتها العجيبة الشأن التي هي أغرب وأعجب من قصة زكريا، واذكر وقت { إِذِ ٱنتَبَذَتْ } أي: اعتزلت وتباعدت { مِنْ أَهْلِهَا } حين حاضت وطهرت وأرادت الاغتسال على مقتضى طهارتها الفطرية ونجابتها الجبلية، فاختارت للخلوة والتستر { مَكَاناً شَرْقِياً } [مريم: 16] أي: في مشرق بيت المقدس، ومع كونه مكاناً بعيداً خالياً عن الناس\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذ انتبذت }: بدل اشتمال من مريم، على أن المراد بها نبؤها، فإن الظرف مشتمل على ما فيها، وقيل: بدل الكل، على أن المراد بالظرف ما وقع فيه\n وقيل: \" إذ \" ظرف لنبأ المقدر، أي: اذكر نبأ مريم حين انتبذت لأن الذكر لا يتعلق بالأعيان، لكن لا على أن يكون المأمور به ذكر نبأها عند انتباذها فقط، بل كل ما عطف عليه وحكي بعده بطريق الاستثناء داخل في حيز الظرف متمم للنبأ\n و { مكانًا }: مفعول بانتبذت، باعتبار ما فيه من معنى الإتيان، أي: اعتزلت وأتَتْ مكانًا شرقيًا، أو ظرف له، أي: اعتزلت في مكان شرقي",
      "translations": []
    }
  ]
}