{
  "chapter": "مريم",
  "text": "وسلم عليه يوم ولد ويوم يموت ويوم يبعث حيا",
  "translations": [
    {
      "translation": "Peace be upon him the day he was born, and the day he dies, and the day he is raised up again alive.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So peace on him the day he was born, the day he will die, and the day that he will be raised from the dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Peace be upon him the day he was born, and the day he will die, and the day he will be raised up alive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was born and died in peace and will be brought back to life again in peace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And peace is upon him the day he was born, and the day he will taste death, and the day he will be raised alive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Salam (peace) be on him the day he was born, and the day he dies, and the day he will be raised up to life (again)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And peace on him on the day he was born, and on the day he dies, and on the day he is raised to life\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Peace be upon him, the day he was born, and the day he dies, and the day he is raised up alive!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Peace on him the day he was born, and the day he dieth and the day he shall be raised alive!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Peace be on him on the day of his birth, and on the day of his death, and peace will be on him on the day he is raised up to life again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Peace be unto him the day he was born and the day he dieth and the day he will be raised up alive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Peace be to him, the day he was born, and the day he dies, and the day he is raised alive!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Peace on him the day he was born, the day that he dies, and the day that he will be raised up to life (again)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Peace on him the day he was born the day that he dies and the day that he will be raised up to life (again)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Peace be upon him on the day he was born and the day he dies, and on him the day when he is raised up alive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And peace be upon him the day he was born, and the day he dies, and the Day he is raised alive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And peace be upon him the day he was born and the day he dies and the day he is raised alive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:15] ‘And peace, from Us, be upon him, the day he was born, and the day he dies, and the day he shall be raised alive!’, that is, [on] those fearful days in which he sees what he will never have seen before — in these he will be given security [from fear].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Peace on him) safety, forgiveness and bliss from Us to John (the day be was born, and the day he dieth and the day he shall be raised alive) from his grave!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لسلامته عن جميع الآثام وطهارته عن جميع الخبائث والمعاصي { سَلاَمٌ عَلَيْهِ } أي: تحيةُ وتكريمُ وحفظُ وتسليمُ نازلُ عليه على الدوام { يَوْمَ وُلِدَ } نحفظه من الشيطان { وَيَوْمَ يَمُوتُ } نحفظه من زوال الإيمان { وَيَوْمَ يُبْعَثُ حَياً } [مريم: 15] نصونه عن الخيبة والخسران ولحوق الحسرة والخذلان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وسلامٌ عليه } أي: سلامة من الله تعالى عليه، { يوم وُلِدَ } من أن يناله الشيطان بما ينال بني آدم، { ويومَ يموتُ } من عذاب القبر، { ويوم يُبعث حيَّا } من هول القيامة وعذاب النار\n رُوِيَ أن يحيى وعيسى - عليهما السلام - التقيا، فقال له يحيى: استغفر لي، فأنت خير مني، فقال له عيسى: أنت خير مني، أنا سلمت على نفسي وأنت سلم الله عليك\n\n\nالإشارة: أخذ الكتاب بالقوة - وهو الجد والاجتهاد في قراءته - هو أن يكون متجردًا لتلاوته، منصرف الهمة إليه عن غيره، فلا يصدق على العبد أن يأخذ كتاب ربه بقوة، حتى يكون هكذا عند تلاوته\n قال الورتجبي: { خُذ الكتابَ بقوة } أي: خذ كتابنا بنا لا بك، والكتاب كلام الحق الأزلي، أي: خذ الكتاب الأزلي بالقوة الأزلية\n هـ\n ومعناه أن يكون التالي فانيًا عن نفسه، متكلمًا بربه، ويسمعه من ربه، فهذا حال المقربين\n والله تعالى أعلم\n ثمَّ ذكر قصة مريم عليها السلام\n",
      "translations": []
    }
  ]
}