{
  "chapter": "مريم",
  "text": "واذكر فى الكتب مريم اذ انتبذت من اهلها مكانا شرقيا",
  "translations": [
    {
      "translation": "Mention Maryam in the Book, how she withdrew from her people to an eastern place,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Commemorate Mary in the Book. When she withdrew from her family to a place in the East\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), recite in the Book the account of Mary, when she withdrew from her people to a place towards the east;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), mention in the Book (the Quran) the story of Mary how she left her family and started living in a solitary place to the East\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Maryam in the Book; when she went away from her family to a place towards east.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book, Maryam, when she withdrew in seclusion from her family to place facing east.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention Marium in the Book when she drew aside from her family to an eastern place;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book Mary when she withdrew from her people to an eastern place,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make mention of Mary in the Scripture, when she had withdrawn from her people to a chamber looking East,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recount in the Book how Mary withdrew from her people to an eastern place\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention thou in the Book Maryam, what time the retired from her people to a place eastward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book Mary, when she withdrew from her family to an easterly place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Relate in the Book (the story of) Mary, when she withdrew from her family to a place in the East.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book (the Quran, O Muhammad SAW, the story of) Maryam (Mary), when she withdrew in seclusion from her family to a place facing east.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book, Mary, how she withdrew from her people to an eastern place and she took a veil apart from them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Scripture Mary, when she withdrew from her people to an eastern location.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention, [O Muhammad], in the Book [the story of] Mary, when she withdrew from her family to a place toward the east.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:16] And mention in the Book, [in] the Qur’ān, Mary, that is, [mention] her tale, when she withdrew from her family to an easterly place, that is, [when] she secluded herself in a place on the east side of [her] home.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَاذْكُرْ فِي الْكِتَابِ مَرْيَمَ إِذِ انْتَبَذَتْ مِنْ أَهْلِهَا مَكَانًا شَرْقِيًّا (16) جملة { واذكر في الكتاب مريم } عطف على جملة { ذِكْرُ رحمتتِ ربِّكَ } \\[ مريم : 2 \\] عطف القصة على القصة فلا يراعى حُسن اتّحاد الجملتين في الخبرية والإنشائية ، على أن ذلك الاتحاد ليس بملتزم . على أنك علمت أن الأحسن أن يكون قوله { ذكر رحمة ربك عبده زكريا } مصدراً وقع بدلاً من فعله .والمراد بالذكر : التّلاوة ، أي اتل خبر مريم الذي نقصّه عليك .وفي افتتاح القصة بهذا زيادة اهتمام بها وتشويق للسامع أن يتعرفها ويتدبرها .والكتاب : القرآن ، لأنّ هذه القصة من جملة القرآن . وقد اختصت هذه السورة بزيادة كلمة { في الكتاب } بعد كلمة { واذكر }. وفائدة ذلك التنبيه إلى أن ذكر من أمر بذكرهم كائن بآيات القرآن وليس مجرد ذكر فضله في كلام آخر من قول النبي صلى الله عليه وسلم كقوله : \" لو لبثت ما لبث يوسف في السجن لأجبت الداعي \"ولم يأت مثل هذه الجملة في سورة أخرى لأنه قد حصل علم المراد في هذه السورة فعلم أنه المراد في بقية الآيات التي جاء فيها لفظ { اذكر }. ولعل سورة مريم هي أول سورة أتى فيها لفظ { واذكرْ } في قصص الأنبياء فإنها السورة الرابعة والأربعون في عدد نزول السور .و { إذ ظرف متعلق باذكر } باعتبار تضمنه معنى القصة والخبر ، وليس متعلقاً به في ظاهر معناه لعدم صحة المعنى .ويجوز أن يكون ( إذ ) مجرد اسم زمان غير ظرف ويجعل بدلاً من ( مريم ) ، أي اذكر زمن انتباذها مكاناً شرقياً . وقد تقدم مثله في قوله { ذكر رحمة ربك عبده زكريا إذ نادى ربه } \\[ مريم : 2 ، 3 \\].والانتباذ : الانفراد والاعتزال ، لأن النبذ : الإبعاد والطرح ، فالانتباذ في الأصل افتعال مطاوع نبذه ، ثم أطلق على الفعل الحاصل بدون سبق فاعل له .وانتصب { مكاناً } على أنه مفعول { انتبذت } لتضمنه معنى حلت . ويجوز نصبه على الظرفية لما فيه من الإبهام . والمعنى : ابتعدت عن أهلها في مكان شرقي .ونُكر المكان إبهاماً له لعدم تعلُّق الغرض بتعيين نوعه إذ لا يفيد كمالاً في المقصود من القصة . وأما التصدّي لوصفه بأنه شرقي فللتنبيه على أصل اتخاذ النصارى الشرقَ قبلة لصلواتهم إذ كان حمل مريم بعيسى في مكان من جهة مشرق الشمس . كما قال ابن عباس : «إني لأعلم خلققِ الله لأي شيء اتّخذت النصارى الشرقَ قبلة لقوله تعالى : { مكاناً شرقِيّاً } » ، أي أن ذلك الاستقبال ليس بأمر من الله تعالى . فذكر كون المكان شرقياً نكتة بديعة من تاريخ الشرائع مع ما فيه من مؤاخاة الفواصل .\n\n",
      "translations": [
        {
          "translation": "(And make mention) Muhammad (of Mary) of the event of Mary (in the Scripture) in the Qur'an, (when she had withdrawn from her people to a chamber looking East) east of their house,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذِ ٱنتَبَذَتْ مِنْ أَهْلِهَا مَكَاناً شَرْقِياً } يعني اعتزلَتْ إِلى مَكانٍ ممّا يَلي الشَّرقَ، وهو عِندَ العَربِ خَيرٌ مِن الغَربي\n والقَصى: المَكانُ البَعيدُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when she {abandoned her family and traveled to a faraway place}, this meant that she left for a place east of her family's home, which was considered better by the Arabs than the west.\n\n\nAnd the highest: the most distant place.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ واذكر في الكتاب مريم إذ انتبذت من أهلها مكاناً شرقيّاً } المكان الشرقي هو مكان العالم القدسي لاتصالها بروح القدس عند تجرّدها وانتباذها عن ممكن الطبيعة ومقرّ النفس وأهلها القوى النفسانية والطبيعية\n والحجاب الذي اتخذته من دونهم هو حظيرة القدس الممنوع من أهل عالم النفس بحجاب الصدر الذي هو غاية مبلغ علم القوى المادية ومدى سيرها\n وما لم تترق إلى العالم القدسي بالتجرد لم يمكن إرسال روح القدس إليها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n واذكر وقت { إِذِ ٱنتَبَذَتْ } أي: اعتزلت وتباعدت { مِنْ أَهْلِهَا } حين حاضت وطهرت وأرادت الاغتسال على مقتضى طهارتها الفطرية ونجابتها الجبلية\n فاختارت للخلوة والتستر { مَكَاناً شَرْقِياً } [مريم: 16] أي: في مشرق بيت المقدس\n ومع كونه مكاناً بعيداً خالياً عن الناس\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذ انتبذت }: بدل اشتمال من مريم\n على أن المراد بها نبؤها\n فإن الظرف مشتمل على ما فيها\n وقيل: بدل الكل\n على أن المراد بالظرف ما وقع فيه\n وقيل: \" إذ \" ظرف لنبأ المقدر\n أي: اذكر نبأ مريم حين انتبذت لأن الذكر لا يتعلق بالأعيان\n لكن لا على أن يكون المأمور به ذكر نبأها عند انتباذها فقط\n بل كل ما عطف عليه وحكي بعده بطريق الاستثناء داخل في حيز الظرف متمم للنبأ\n و { مكانًا }: مفعول بانتبذت\n باعتبار ما فيه من معنى الإتيان\n أي: اعتزلت وأتَتْ مكانًا شرقيًا\n أو ظرف له\n أي: اعتزلت في مكان شرقي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:100",
      "similarity": 0.4874857104889566
    },
    {
      "verse": "26:60",
      "similarity": 0.4496571953464822
    },
    {
      "verse": "37:5",
      "similarity": 0.44862341177430043
    },
    {
      "verse": "2:101",
      "similarity": 0.4170176948902083
    },
    {
      "verse": "8:58",
      "similarity": 0.40436256058699177
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}