{
  "chapter": "مريم",
  "text": "وحنانا من لدنا وزكوة وكان تقيا",
  "translations": [
    {
      "translation": "and tenderness and purity from Us - he had taqwa -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And compassion from Us, and goodness. So he was devout,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We also endowed him with tenderness and purity, and he was exceedingly pious\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave him compassion and purity. He was a pious human being,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And compassion from Ourselves, and chastity; and he was extremely pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Hananan from Us, and Zakatan, and he was pious,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And tenderness from Us and purity, and he was one who guarded (against evil),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and a tenderness from Us, and purity; and he was godfearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And compassion from Our presence, and purity; and he was devout,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and tenderness [of heart] and purity. He was pious,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And tenderness from Our presence and purity, and he was God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and a compassion and purity from Us. He was Godwary\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And piety (for all creatures) as from Us, and purity: He was devout,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (made him) sympathetic to men as a mercy (or a grant) from Us, and pure from sins [i.e. Yahya (John)] and he was righteous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and tenderness from Us and purity, and he was cautious;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And tenderness from Us, and innocence. He was devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And affection from Us and purity, and he was fearing of Allah\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:13] and compassion, a mercy for mankind, from Us, from Our presence, and purity, a charity for them, and he was God-fearing — it is related that he never committed a sin, nor contemplated [committing] one;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And compassion from Our presence) and We gave him compassion from Our presence towards his parents, (and purity) as an act of charity to them; it is also said that this means: We gave righteousness with regard to his religion; (and he was devout) he was obedient to his Lord,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَحَنَاناً مِّن لَّدُنَّا } معناه رَحمةٌ, وقال: بَراءةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إنما آتيناه وأعطيناه في حال صغره فهم التوراة { حَنَاناً } ترحماً وتعطفاً ناشئاً { مِّن لَّدُنَّا } تكريماً له ولأبيه { وَ } لهذا أيضاً أعطيناه { زَكَاةً } طهارةً عن الخبائث والآثام كلها { وَ } لذلك { كَانَ } مدة حياته من أوان صباه إلى موته { تَقِيّاً } [مريم: 13] حَذِراً عن المناهي والمنكرات، خائفاً عن المعاصي والمحظورات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { من لدنا }: متعلق بمحذوف، صفة له مؤكدة لما أفاده التنوين من الفخامة الذاتية، أي: وآتيناه الحكم وتحنُّنًا عظيمًا واقعًا من جنابنا، أو شفقة في قلبه ورحمة على أبويه وغيرهما\n قال ابن عباس: ما أدري ما حنانًا إلا أن يكون تعطف رحمة الله على عباده\n ومنه قولهم: \" حَنَانَيْكَ \" ، مثل سعديْك، وأصله: من حنين الناقة على ولدها، و { برًّا }: عطف على { تقيًّا }\n يقول الحقّ جلّ جلاله: { يا يحيى } أي: قلنا يا يحيى، وهذا استئناف طُوي قبله جمل كثيرة، مما يدل على ولادته ونشأته، حتى أوحي إليه، ثم قال له: { يا يحيى خُذِ الكتابَ } أي: التوراة، وقيل: كتاب خُص به، فدلت الآية على رسالته\n وفي تفسير ابن عرفة: أن يحيى رسول كعيسى\n هـ\n وقوله: { بقوةٍ } أي: بجد واجتهاد، وقيل: بالعمل به، { وآتيناه الحُكم صبيًا } ، قال ابن عباس: الحكم هنا النبوة، استنبأهُ وهو ابن ثلاث سنين، قلت: كون الصبي نبيًا جائز عقلاً، واقع عند الجمهور، وأما بعثه رسولاً فجائز عقلاً، وظاهر كلام الفخر هنا أنه واقع، وأن يحيى وعيسى بُعثا صغيرين\n وقال ابن مرزوق في شرح البخاري ما نصه: الأعم: بعث الأنبياء بعد الأربعين لأنه بلوغ الأشد، وقيل: أرسل يحيى وعيسى - عليهما السلام - صبيين\n وقال ابن العربي: يجوز، ولم يقع\n وقول عيسى عليه السلام: إني عبد الله إخبار عما وجب في المستقبل، لا عما حصل\n واستُشْكِلَ جواز بعث الصبي بأنه تكليف، وشرطُه: البلوغُ، إن كانت الشرائع فيه سواء\n انظر المحشي الفاسي\n قلت: والذي يظهر أن يحيى وعيسى - عليهما السلام - تنبئا صغيرين، وأرسلا بعد البلوغ\n والله تعالى أعلم\n وقيل: الحكم: الحكمة وفهم التوراة والفقه في الدين\n رُوي أنه دعاه الصبيان إلى اللعب، فقال: ما لِلَعِبٍ خُلقت\n { و } آتيناه { حنانًا } أي: تحنُّنًا عظيمًا { من لَدُنَّا }: من جناب قدسنا، أو تحننًا من الناس عليه\n قال عوف: الحنان المحبّب، { وزكاة }: طهارة من العيوب والذنوب، أو صدقة تصدقنا به على أبويه، أو: وفّقناه للتصدق على الناس",
      "translations": []
    }
  ]
}