{
  "chapter": "مريم",
  "text": "قالت انى اعوذ بالرحمن منك ان كنت تقيا",
  "translations": [
    {
      "translation": "I seek refuge in the Merciful from you, if you fear Him,\" she said.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mary exclaimed: \"I surely take refuge from you with the Most Compassionate Lord, if you are at all God-fearing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mary said, \"Would that the Beneficent God would protect me from you. Leave me alone if you are a God fearing person\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “I seek the refuge of the Most Gracious from you – if you fear God.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"Verily, I seek refuge with the Most Gracious (Allah) from you, if you do fear Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: Surely I fly for refuge from you to the Beneficent Allah, if you are one guarding (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, 'I take refuge in the All-merciful from thee!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: Lo! I seek refuge in the Beneficent One from thee, if thou art Allah-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she saw him, she said, \"I seek refuge in the compassionate God from you; [do not come near] if you fear the Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: verily seek refuge with the Compassionate from thee if thou art God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, ‘I seek the protection of the All-beneficent from you, should you be Godwary!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"I seek refuge from thee to (Allah) Most Gracious: (come not near) if thou dost fear Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"Verily! I seek refuge with the Most Beneficent (Allah) from you, if you do fear Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And when she saw him) she said: 'I take refuge in the Merciful from you! If you are fearful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “I take refuge from you in the Most Merciful, should you be righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"Indeed, I seek refuge in the Most Merciful from you, [so leave me], if you should be fearing of Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:18] She said, ‘Lo! I seek refuge in the Compassionate One from you! If you fear God’, and leave me alone on account of my invocation of refuge in God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(She said) Mary said: (Lo! I seek refuge in the Beneficent One from thee, if thou art God-fearing [taqiyya]) if you are obedient to the All-Merciful; it is also said that Taqiyy was the name of an evil man and she thought that he was that man, which explains why she sought refuge in Allah from him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِن كُنتَ تَقِيّاً } معناه مُؤمنٌ مُطيعٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وجواب { إن كنت }: محذوف، أي: إن كنت تقيًا فإني عائذة بالرحمن منك",
      "translations": []
    }
  ]
}