{
  "chapter": "مريم",
  "text": "كهيعص",
  "translations": [
    {
      "translation": "Kaf HaYa 'Ayn Sad",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "KAF HA YA 'AIN SAD.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf. Ha'. Ya'. Ayn. Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf. Ha. Ya. Ain. Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf-Ha-Ya-A’in-Sad. (* Alphabets of the Arabic language – Allah and to whomever He reveals know their precise meanings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf Ha Ya `Ain Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf Ha Ya Ain Suad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf Ha Ya Ain Sad\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf. Ha. Ya. A'in. Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf Ha Ya 'Ayn Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf- Ha-Ya-'Ain-Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf, Ha, Ya, ‘Ayn, Suad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf. Ha. Ya. 'Ain. Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf- Ha-Ya-'Ain-Sad. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "KaafHaYa'aeenSaad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf, Ha, Ya, Ayn, Saad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kaf, Ha, Ya, 'Ayn, Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:1] Kāf hā yā ‘ayn sād: God knows best what He means by these [letters].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of (Kaf. Ha. Ya. Ain. Sad): '(Kaf. Ha. Ya. 'Ayn. Sad.) this is an expression of praise with which Allah praised Himself. He says: Kaf means He is Sufficient (Kafi), Ha means He is the guiding One (Hadi), 'Ayn means He is Possessor of knowledge ('Alim), and Sad means He is Possessor of Truth (Sadiq); it is also said that Kaf means He is Sufficient unto His servants, Ha means He guides His servants, Ya means His hand is above His creation, and 'Ayn means He knows the affairs of His servants, and Sad means He is true in His promise. It is also said that Kaf is from the Generous (Karim), Ha is from the One who guides (Hadi), Ya is from Clement (Halim), 'Ayn from the One who possesses knowledge ('Alim), and Sad from the Truthful (Sadiq), or from the Veracious (Sudduq). It is also said that (Kaf. Ha. Ya. Ain. Sad) is an oath by means of which Allah swore.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد الواسطي عن الإِمام زيد بن علي عليهما السلام في قولهِ تعالى: { كۤهيعۤصۤ } الكافُ من كريمٍ، والهاءُ من هادٍ، والياءُ من حكيمٍ ويقالُ مِن يُجيرُ وَلا يُجار عليه، والعينُ من عليمٍ، والصَّادُ من صادقٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كۤهيعۤصۤ } [مريم: 1] يا كافي مهام جميع الأنام، وهاديهم إلى دار السلام بيد القدرة العلية الصادرة عنك نيابةً عنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقيل: هي مختصرة من أسماء الله تعالى، فالكاف من كافٍ، والهاء من هادٍ، والياء من يمين، والعين من عليم أو عزيز، والصاد من صادق\n قاله الهروي عن ابن جبير\n قال أبو الهيثم: جعل الياء من يمين، من قولك: يَمَن الله الإنسانَ يَيْمنُهُ يمنًا فهو ميْمون\n هـ\n ولذا ورد الدعاء بها، فقد رُوي عن عليّ - كرم الله وجهه - أنه كان يقول: يا كهيعص أعوذ بك من الذنوب التي تُوجب النقم، وأعوذ بك من الذنوب التي تغير النعم، وأعوذ بك من الذنوب التي تهتِك العِصَم، وأعوذ بك من الذنوب التي تحبس غيث السماء، وأعوذ بك من الذنوب التي تُديل الأعداء، انصرنا على من ظلمنا\n كان يقدم هذه الكلمات بين يدي كل شدة\n فيحتمل أن يكون توسل بالأسماء المختصرة من هذه الحروف، أو تكون الجملة، عنده، اسمًا واحدًا من أسماء الله تعالى، وقيل: هو اسم الله الأعظم\n ويحتمل أن يشير بهذه الرموز إلى معاملته تعالى مع أحبائه، فالكاف كفايته لهم، والهاء هدايته إياهم إلى طريق الوصول إلى حضرته، والياء يُمنه وبركته عليهم وعلى من تعلق بهم، والعين عنايته بهم في سابق علمه، والصاد صدقه فيما وعدهم به من الإتحاف والإكرام\n والله تعالى أعلم\n وقيل: هي مختصرة من أسماء الرسول - عليه الصلاة والسلام - أي: يا كافي، يا هادي، يا ميمون، يا عين العيون، أنت صادق مصدق\n وعن ماضي بن سلطان تلميذ أبي الحسن الشاذلي - رضي الله عنهما -: [أنه رأى في منامه أنه اختلف مع بعض الفقهاء في تفسير قوله: كهيعص\n حم\n عسق، فقلت: هي أسرار بين الله تعالى وبين رسوله صلى الله عليه وسلم، وكأنه قال: \" كاف \" أنت كهف الوجود، الذي يؤم إليه كلُّ موجود، \" ها \" هبنا لك الملك، وهيأنا لك الملكوت، \" يَعَ \" يا عين العيون، \" ص \" صفات الله { مَن يُطع الرسولَ فقد أطاع الله } ، \" حاء \" حببناك، \" ميم \" ملَّكناك، \" عين \" علمناك، \" سين \" ساررناك، \" قاف \" قربناك\n فنازعوني في ذلك ولم يقبلوه، فقلت: نسير إلى النبي صلى الله عليه وسلم ليفصل بيننا، فسرنا إليه، فلقينا رسول الله صلى الله عليه وسلم، فقال لنا:\n\n \" الذي قال محمد بن سلطان هو الحق \" \n",
      "translations": []
    }
  ]
}