{
  "chapter": "مريم",
  "text": "فاتخذت من دونهم حجابا فارسلنا اليها روحنا فتمثل لها بشرا سويا",
  "translations": [
    {
      "translation": "and veiled herself from them. Then We sent Our Ruh to her and it took on for her the form of a handsome, well-built man.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And took cover from them, We sent a spirit of Ours to her who appeared before her in the concrete form of a man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and drew a curtain, screening herself from people whereupon We sent to her Our spirit and he appeared to her as a well-shaped man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "out of her people's sight. We sent Our Spirit to her, who stood before her in the shape of a well formed human being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So there she screened herself from them; We therefore sent Our Spirit towards her – he appeared before her in the form of a healthy man. (Angel Jibreel – peace be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She placed a screen before them; then We sent to her Our Ruh, and he appeared before her in the form of a man in all respects.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she took a veil (to screen herself) from them; then We sent to her Our spirit, and there appeared to her a well-made man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and she took a veil apart from them; then We sent unto her Our Spirit that presented himself to her a man without fault.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had chosen seclusion from them. Then We sent unto her Our Spirit and it assumed for her the likeness of a perfect man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and kept herself in seclusion from them. We sent her Our angel, who presented himself to her as a full-grown human being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then she took beside them a curtain; then We sent unto her Our Spirit, and he took unto her the form of a human being sound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did she seclude herself from them, whereupon We sent to her Our Spirit and he became incarnate for her as a well-proportioned human.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She placed a screen (to screen herself) from them; then We sent her our angel, and he appeared before her as a man in all respects.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She placed a screen (to screen herself) from them; then We sent to her Our Ruh [angel Jibrael (Gabriel)], and he appeared before her in the form of a man in all respects.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent to her Our Spirit (Gabriel) in the resemblance of a perfect human.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She screened herself away from them, and We sent to her Our spirit, and He appeared to her as an immaculate human.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she took, in seclusion from them, a screen. Then We sent to her Our Angel, and he represented himself to her as a well-proportioned man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:17] Thus she veiled herself from them, she draped herself in a veil to conceal herself while she washed her hair [from lice], or [washed] her clothes, or cleansed herself from her menses; whereupon We sent to her Our Spirit, Gabriel, and he assumed before her, after she donned her clothes, the likeness of a well-proportioned human, perfect in physical form.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And had chosen seclusion from them) so that she purifies herself after the end of her menses. (Then We sent unto her Our Spirit) Our Messenger Gabriel when she had finished purifying herself (and it assumed for her the likeness of a perfect man).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n كما أخبر عنه تعالى في قوله: { فأرسلنا إليها روحنا } وإنما تمثل لها بشراً سويّ الخلق\n حسن الصورة\n لتتأثر نفسها به وتستأنس فتتحرّك على مقتضى الجبلة ويسري الأثر من الخيال في الطبيعة فتتحرك شهوتها\n فتنزل كما يقع في المنام من الاحتلام وتنقذف نطفتها في الرحم فيتخلق منه الولد\n وقد مرّ أن الوحي قريب من المنامات الصادقة لهذه القوة البدنية وتعطلها عن أفعالها عنده كما في النوم\n فكل ما يرى في الخيال من الأحوال الواردة على النفس الناطقة المسماة في اصطلاحنا: قلباً\n والاتصالات التي لها بالأرواح القدسية يسري في النفس الحيوانية والطبيعية وينفعل منه البدن\n وإنما أمكن تولد الولد من نطفة واحدة لأنه ثبت في العلوم الطبيعية أن منيّ الذكر في تكوّن الولد بمنزلة الأنفحة في الجبن\n ومنيّ الأنثى بمنزلة اللبن أي: العقد من منيّ الذكر\n والانعقاد من منّي الأنثى لا على معنى أنّ منيّ الذكر ينفرد بالقوة العاقدة ومنيّ الأنثى بالقوة المنعقدة\n بل على معنى أنّ القوة العاقدة في منيّ الذكر أقوى والمنعقدة في منيّ الأنثى أقوى وإلا لم يمكن أن يتحدا شيئاً واحداً\n ولم ينعقد منيّ الذكر حتى يصير جزء من الولد\n فعلى هذا إذا كان مزاج الأنثى قوياً ذكورياً كما تكون أمزجة النساء الشريفة النفس\n القوية القوى\n وكان مزاج كبدها حارّاً كان المنيّ المنفصل عن كليتها اليمنى أحرّ كثيراً من الذي ينفصل عن كليتها اليسرى\n فإذا اجتمعا في الرحم وكان مزاج الرحم قوياً في الإمساك والجذب\n قام المنفصل من الكلية اليمنى مقام الذكر في شدّة قوة العقد والمنفصل من الكلية اليسرى مقام منيّ الأنثى في قوة الانعقاد فيتخلق الولد\n هذا وخصوصاً إذا كانت النفس متأيدة بروح القدس\n متقوية\n يسري أثر اتصالها به إلى الطبيعة والبدن ويغير المزاج ويمدّ جميع القوى في أفعالها بالمدد الروحاني فيصير أقدر على أفعالها بما لا ينضبط بالقياس والله أعلم\n { ولنجعله آية للناس } دالة على البعث والنشور { ورحمة منا } عليهم بتكميلهم به بالشرائع والحكم والمعارف وهدايتهم بسبب فعلنا ذلك فهو صورة الرحمة الإلهية المعنوية { وكان أمراً مقضيّاً } في اللوح\n مقدراً في الأزل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱتَّخَذَتْ } وسدلت لكمال الاحتياط والانحفاظ { مِن دُونِهِم حِجَاباً } يسترها\n ويحفظها عن أعين الناس إن وصلوا بغتة\n لم لم تجردت عن لباسها واشتغلت\n لأن تغتسل { فَأَرْسَلْنَآ إِلَيْهَآ رُوحَنَا } أي: حامل روحنا وهو جبرائيل عليه السلام إظهاراً لقدرتنا وحكمتنا\n وإنفاذاً لحُكمنا الذي حكمنا به في سابق علمنا { فَتَمَثَّلَ لَهَا } جبرائيل عليه السلام { بَشَراً سَوِيّاً } [مريم: 17] صحيحاً صبيحاً أمردَ قططاً مجعدَ الشعر لئلا تستوحض\n ومع ذلك استوحشت وارتهبت رهبةً شديدةً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { بَشرًا }: حال",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "83:15",
      "similarity": 0.7109281209066266
    },
    {
      "verse": "38:32",
      "similarity": 0.660732368124733
    },
    {
      "verse": "42:51",
      "similarity": 0.6372742936904647
    },
    {
      "verse": "41:5",
      "similarity": 0.4708173366775433
    },
    {
      "verse": "7:46",
      "similarity": 0.44764237640605153
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/19:17.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/19:17.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}