{
  "chapter": "مريم",
  "text": "فكلى واشربى وقرى عينا فاما ترين من البشر احدا فقولى انى نذرت للرحمن صوما فلن اكلم اليوم انسيا",
  "translations": [
    {
      "translation": "Eat and drink and delight your eyes. If you should see anyone at all, just say, \"I have made a vow of abstinence to the All-Merciful and today I will not speak to any human being.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat and drink, and be at peace. If you see any man, tell him: 'I have verily vowed a fast to Ar-Rahman and cannot speak to any one this day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat and drink and cool your eyes; and if you see any person say to him: 'Verily I have vowed a fast to the Most Compassionate Lord, and so I shall not speak to anyone today.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat, drink, and rejoice. Should you see a person going by, tell him that on this day you have promised the Beneficent God to fast and never talk to any human being.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore eat and drink and appease your eyes; so if you meet any person then say, ‘I have pledged a fast (of silence) to the Most Gracious – I will therefore not speak to any person today.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat and drink and rejoice. And if you see any human being, say: `Verily, I have vowed a fast for the Most Gracious so I shall not speak to any human being today.,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat and drink and refresh the eye. Then if you see any mortal, say: Surely I have vowed a fast to the Beneficent Allah, so I shall not speak to any man today.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat therefore, and drink, and be comforted; and if thou shouldst see any mortal, say, \"I have vowed to the All-merciful a fast, and today I will not speak to any man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat and drink and be consoled. And if thou meetest any mortal, say: Lo! I have vowed a fast unto the Beneficent, and may not speak this day to any mortal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat and drink and rejoice. And if you see any human being say, 'I have vowed a fast [of silence] to the Gracious God, and will not speak with any human being today.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat and drink thou, and cool thine eyes; and if thou beholdest the human beings anyone, say: verily I have vowed to the Compassionate a fast, so I shall not speak today to any human being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat, drink, and be comforted. Then if you see any human, say, ‘‘Indeed I have vowed a fast to the All-beneficent, so I will not speak to any human today.’’ ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat and drink and cool (thine) eye. And if thou dost see any man, say, 'I have vowed a fast to (Allah) Most Gracious, and this day will I enter into not talk with any human being'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat and drink and be glad, and if you see any human being, say: 'Verily! I have vowed a fast unto the Most Beneficent (Allah) so I shall not speak to any human being this day. \n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore eat and drink and rejoice with your eyes. If you meet any human say to him: \"I have vowed a fast to the Merciful and will not speak with anyone today.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So eat, and drink, and be consoled. And if you see any human, say, ‘I have vowed a fast to the Most Gracious, so I will not speak to any human today.'“\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat and drink and be contented. And if you see from among humanity anyone, say, 'Indeed, I have vowed to the Most Merciful abstention, so I will not speak today to [any] man.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:26] So eat, of the dates, and drink, from the rivulet, and [let] your eye be comforted, by the child (‘aynan, ‘[your] eye’, a specification derived from the subject of the verb, in other words [what is meant is] li-taqarra ‘aynuki bihi, ‘that your eye may be comforted by him’) that is, let it [your eye] be at peace and not covet any other than him; and if (immā: the nūn of the conditional particle in is here assimilated with the extra mā) you [happen to] see (tarayinna: the third consonantal root [the yā’] and the second [the hamza] have been omitted, with the [fatha] vowel therein transferred to the [first consonant] the letter rā’, and a kasra vowel applied to the yā’ of the [feminine] person, because of two unvowelled consonants coming together) any human being, and should he ask you about your child, then say, “I have vowed to the Compassionate One a fast, that is to say, an abstention from speaking of his affair and from [speaking to] any other humans — which is indicated by [the following statement]), so I will not speak to any human today”’, that is, after   [saying] this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So eat) the date (and drink) from the stream (and be consoled) by the birth of Jesus (pbuh). (And if thou meetest any mortal) and if you meet any human being, after today (say: Lo! I have vowed a fast unto the Beneficent, and may not speak this day to any mortal) and then be silent until Jesus speaks after you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنِّي نَذَرْتُ لِلرَّحْمَـٰنِ صَوْماً } معناه صَمتٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Indeed, I have pledged to the Most Merciful fasting} [means] silence.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَكُلِي } يا أمي من النخلة { وَٱشْرَبِي } من النهر { وَقَرِّي عَيْناً } أي: نوّري عينك بولدك وطيبي نفسك به { فَإِمَّا تَرَيِنَّ } أي: إن رأتي { مِنَ ٱلبَشَرِ أَحَداً } يسألك عن حالك وولدك { فَقُولِيۤ } في جوابه\n يعني: أشيري إليه: { إِنِّي نَذَرْتُ لِلرَّحْمَـٰنِ صَوْماً } أي: صمتاً عن التكلم { فَلَنْ أُكَلِّمَ ٱلْيَوْمَ إِنسِيّاً } [مريم: 26] أي: إنساناً\n\n\nوالحكمة في إلهام ولادتها وشاع بين الأنام قصتُها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قالت: { فلن أُكلِّمَ اليوم إِنسيًّا } أي: بعد أن أخبرتكم بنذري\n وإنما أكلم الملائكة أو أناجي ربي\n وقيل: أُمرت بأن تُخبر عن نذرها بالإشارة\n قال الفراء: العرب تُسمى كل ما وصل إلى الإنسان كلامًا\n ما لم يُؤكّد بالمصدر\n فإذا أُكد لم يكن إلا حقيقة الكلام\n هـ\n وإنما أُمرت بذلك ونذرته لكراهة مجادلة السفهاء ومقاولتهم\n وللاكتفاء بكلام عيسى عليه السلام فإنه نص قاطع في قطع الطعن\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:183",
      "similarity": 0.42189614087832106
    },
    {
      "verse": "23:93",
      "similarity": 0.36790356730642676
    },
    {
      "verse": "7:115",
      "similarity": 0.3243462807259349
    },
    {
      "verse": "40:77",
      "similarity": 0.3218017260925108
    },
    {
      "verse": "20:65",
      "similarity": 0.3181648849037278
    }
  ]
}