{
  "chapter": "مريم",
  "text": "فحملته فانتبذت به مكانا قصيا",
  "translations": [
    {
      "translation": "So she conceived him and withdrew with him to a distant place.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she conceived him she went away to a distant place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then she conceived him and withdrew with him to a far-off place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She conceived the child and retreated with him to a distant and solitary place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she conceived him, and she went away with him to a far place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she conceived him, and she withdrew with him to a remote place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she conceived him; then withdrew herself with him to a remote place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she conceived him, and withdrew with him to a distant place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she conceived him, and she withdrew with him to a far place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she conceived him and withdrew with him to a distant place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "hen she conceived him, and she retired with him to a place far-off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus she conceived him, then withdrew with him to a distant place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she conceived him, and she retired with him to a remote place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she conceived him, and she withdrew with him to a far place (i.e. Bethlehem valley about 4-6 miles from Jerusalem).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon she carried him, and retired to a far off place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she carried him, and secluded herself with him in a remote place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she conceived him, and she withdrew with him to a remote place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:22] Thus she conceived him and then withdrew, retreated, with him to a distant place, far from her family.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And she, conceived him) she bore him for nine months; and it is also said: her pregnancy lasted one day, (and she withdrew with him) i.e. to deliver him (to a place) far away from people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nواتصال روح عيسى بالنطفة إنما يكون بعد حصول النطفة في الرحم واستقرارها فيه ريثما تمتزج وتتحد وتقبل مزاجاً صالحاً لقبول الروح { فانتبذت به } أي: معه { مكاناً قصيّاً } أي: بعيداً من المكان الأول الشرقي لأنها وقعت به في المكان الغربي الذي هو عالم الطبيعة والأفق الجسماني، ولهذا قال: { فأجاءها المخاض إلى جذع النخلة } نخلة النفس { فنادها من تحتها } أي: ناداها جبريل من الجهة السفلية بالنسبة إلى مقامها من القلب، أي: من عالم الطبيعة الذي كان حزنها من جهته وهو الحمل الذي هو سبب تشوّرها وافتضاحها { ألاّ تحزني قد جعل ربّك تحتك سرياً } أي: جدولاً من غرائب العلم الطبيعي وعلم توحيد الأفعال الذي خصك الله بها واصطفاك كما رأيت من تولد الجنين من نطفتك وحدها\n { وهزي إليك بجذع } نخلة نفسك التي بسقت في سماء الروح باتصالك بروح القدس، واخضرّت بالحياة الحقيقية بعد يبسها بالرياضة وجفافها بالحرمان عن ماء الهوى وحياته، وأثمرت المعارف والمعاني، أي: حركيها بالفكر { تُسَاقِط عليك } من ثمرات المعارف والحقائق { رطباً جنياً فكلي } أي: من فوقك رطب الحقائق والمعارف الإلهية وعلم تجليات الصفات والمواهب والأحوال { واشربي } من تحتك ماء العلم الطبيعي وبدائع الصنع وغرائب الأفعال الإلهية وعلم التوكل وتجليات الأفعال والأخلاق والمكاسب، كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سمعت ما سمعت نفخ جبرائيل عليه السلام في درعها، فوصل أثرها إلى جوفها فحبلت: { فَحَمَلَتْهُ } أي: صارت حاملةً بعيسى فجأةً وكبر في بطنها في الساعة، وبعدما ظهر عليها من أمارات الطَّلق ما ظهر { فَٱنْتَبَذَتْ } واعتزلت وتباعدت منفردةً { بِهِ مَكَاناً قَصِيّاً } [مريم: 22] بعيداً عن العمران استحياءً من أهلها، ومن لوم الناس إياها وتعييرهم عليها بولادتها بلا زوج\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { رُطبًا }: تمييز، فيمن أثبت التاءين، أو حذف إحداهما، ومفعول به، فيمن قرأ بتاء واحدة مع كسر القاف\n يقول الحقّ جلّ جلاله: { فحملَتْهُ } بأن نفخ جبريل في درعها، فدخلت النفخة في جوفها\n قيل: إن جبريل عليه السلام رفع درعها فنفخ في جيبه، وقيل: نفخ عن بُعد، فوصل الريح إليها فحملت في الحال، وقيل: إن النفخة كانت في فيها، وكانت مدة حملها سبعة أشهر، وقيل: ثمانية\n ولم يعش ولد من ثمانية\n وفي ابن عطية: تظاهرت الروايات أنها ولدت لثمانية أشهر، ولذلك لا يعيش ابن ثمانية أشهر حفظًا لخاصية عيسى، فتكون معجزة له\n هـ\n وقيل: تسعة أشهر\n وقيل: ثلاث ساعات، حملته في ساعة، وصُور في ساعة، ووضعته في ساعة حين زالت الشمس\n وقيل: ساعة، ما هو إلا أن حملت فوضعت، وسنها حينئذ ثلاث عشرة سنة، وقيل: عشر سنين، وقد حاضت حيضتين\n { فانتبذت به } أي: فاعتزلت ملتبسة به حين أحست بقرب وضعها، { مكانًا قَصيًّا }: بعيدًا من أهلها وراء الجبل، وقيل: أقصى الدار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:20",
      "similarity": 0.6540198642656003
    },
    {
      "verse": "28:20",
      "similarity": 0.5390916579843777
    },
    {
      "verse": "17:1",
      "similarity": 0.5151472961022711
    },
    {
      "verse": "8:42",
      "similarity": 0.5009109886823372
    },
    {
      "verse": "2:100",
      "similarity": 0.36746651973640887
    }
  ]
}