{
  "chapter": "مريم",
  "text": "قالت انى يكون لى غلم ولم يمسسنى بشر ولم اك بغيا",
  "translations": [
    {
      "translation": "She said, 'How can I have a boy when no man has touched me and I am not an unchaste woman?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can I have a son,\" she said, \"when no man has touched me, nor am I sinful?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mary said: \"How can a boy be born to me when no man has even touched me, nor have I ever been unchaste?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"How can I have a son when no mortal has touched me nor am I an unchaste woman\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “How can I bear a son? No man has ever touched me, nor am I of poor conduct!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"How can I have a son when no man has touched me, nor am I Baghiyya\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: When shall I have a boy and no mortal has yet touched me, nor have I been unchaste?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, 'How shall I have a son whom no mortal has touched, neither have I been unchaste?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: How can I have a son when no mortal hath touched me, neither have I been unchaste?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"How can I have a son when no man has touched me; and neither have I been unchaste?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: in what wise shall there be a boy unto me, whereas not a human being hath touched me, nor have I been a harlot?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, ‘How shall I have a child seeing that no human being has ever touched me, nor have I been unchaste?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"How shall I have a son, seeing that no man has touched me, and I am not unchaste?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"How can I have a son, when no man has touched me, nor am I unchaste?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall I bear a son' she answered, 'when I am not touched by a human and not unchaste'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “How can I have a son, when no man has touched me, and I was never unchaste?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"How can I have a boy while no man has touched me and I have not been unchaste?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:20] She said, ‘How shall I have a boy when no human being has [ever] touched me, by way of conjugality, neither have I been unchaste?’, [neither have I been] a fornicator.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(She said) Mary said to Gabriel (pbuh): (How can I have a son when no mortal hath touched me) when no husband has come near me, (neither have I been unchaste) neither have I been an adulteress!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { بَغِيًّا } أصله: بغوي، على وزن فعول، فأدغمت الواو - بعد قلبها ياء - في الياء، وكسرت الغين للياء، و { لنجعله }: متعلق بمحذوف، أي: ولنجعله آية فعلنا ذلك، أو معطوف على محذوف، أي: لنُبين لهم كمال قدرتنا ولنجعله\n\n\n الخ\n أو على جملة: { هو عليّ هين } لأنها في معنى العلة، أي: كذلك قال ربك لقدرتنا على ذلك ولنجعله\n\n\n الخ\n يقول الحقّ جلّ جلاله: { واذكرْ } يا محمد { في الكتابِ }: القرآن، والمراد هذه السورة الكريمة لأنها هي التي صُدرت بذكر زكريا، واستتبعت بذكر قصة مريم لما بينهما من الاشتباك\n أي: اذكر في الكتاب نبأ { مريم إِذ انتبذتْ } حين اعتزلت { من أهلها } وأتت { مكانًا شرقيًا } من بيت المقدس، أو من دارها لتتخلى فيه للعبادة، ولذلك اتخذت النصارى المشرق قبلة\n وقيل: قعدت في مشربة لتغتسل من الحيْض، محتجبة بشيء يسترها، وذلك قوله تعالى: { فاتخذتْ من دونهم حجابًا } ، وكان موضعها المسجد، فإذا حاضت تحولت إلى بيت خالتها، وإذا طهرت عادت إلى المسجد\n فبينما هي تغتسل من الحيض، متحجبةً دونهم، أتاها جبريل عليه السلام في صورة آدمي، شاب أمرد، وضيء الوجه\n قال تعالى: { فأرسلنا إِليها رُوحنا }: جبريل عليه السلام، عبَّر عنه بذلك توفية للمقام حقه\n وقرئ بفتح الراء لكونه سببًا لِمَا فيه روح العباد، يعني اتباعه والاهتداء به، الذي هو عدة المقربين في قوله:\n\n[الواقِعَة: 88، 89]\n { فتمثَّل لها بشرًا سويًّا }: سَويّ الخَلق، كامل البنية، لم يفقد من حِسان نعوت الآدمية شيئًا، وقيل: تمثل لها في صورة شاب تِرْبٍ لها، اسمه يوسف، مِنْ خدَم بيت المقدس، وإنما تمثل لها في تلك الصورة الجميلة لتستأنس به، وتتلقى منه ما يلقى إليها من كلامه تعالى إذ لو ظهر لها على صورة الملَكية، لنفرت منه ولم تستطع مقاومته\n وأما ما قيل من أن ذلك لتَهيج شهوتُها، فتنحدر نطفتها إلى رحمها، فغلط فاحش، ينحو إلى مذهب الفلاسفة، ولعلها نزعة مسروقة من مطالعة كتبهم، يُكذبه قوله تعالى: { قالت إِني أعوذ بالرحمن منك إِن كنت تقيًا } ، فإنه شاهد عدل بأنه لم يخطر ببالها ميل إليه، فضلاً عن ما ذكر من الحالة المترتبة على أقصى مراتب الميل والشهوة\n\n\nنعم يمكن أن يكون ظهر على ذلك الحُسن الفائق والجمال اللائق لابتلائها واختبار عِفّتها، ولقد ظهر منها من الورع والعفاف ما لا غاية وراءه\n وذِكْرُ عنوان الرحمانية للمبالغة في العِيَاذ به تعالى، واستجلاب آثر الرحمة الخاصة، التي هي العصمة مما دهمها\n قاله أبو السعود\n وقولها: { إِن كنتَ تَقيًّا } أي: تتقي الله فتُبَالى بالاستعاذة به\n { قال إِنما أنا رسولُ ربك } أي: لستُ ممن يتوقع منه ما توهمت من الشر، وإنما أنا رسول من استعذت برحمانيته { لأهَبَ لك غُلامًا } أي: لأكون سببًا في هبة الغلام، أو: ليهب لك ربُك غُلامًا - في قراءة الياء -\n والتعرض لعنوان الربوبية مع الإضافة إلى ضميرها لتشريفها وتسليتها، والإشعار بعلية الحكم فإن هبة الغلام لها من أحكام تربيتها\n وقوله: { زكيًّا } أي: طاهرًا من العيوب صالحًا، أو تزكو أحواله وتنمو في الخير، من سن الطفولية إلى الكبر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:101",
      "similarity": 0.5860092637822222
    },
    {
      "verse": "19:19",
      "similarity": 0.518720847752859
    },
    {
      "verse": "3:40",
      "similarity": 0.49507198265296287
    },
    {
      "verse": "3:47",
      "similarity": 0.4902266134160631
    },
    {
      "verse": "18:74",
      "similarity": 0.41831400859801793
    }
  ]
}