{
  "chapter": "مريم",
  "text": "فاشارت اليه قالوا۟ كيف نكلم من كان فى المهد صبيا",
  "translations": [
    {
      "translation": "She pointed towards him. They said, 'How can a baby in the cradle speak?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But she pointed towards him. \"How can we talk to one,\" they said, \"who is only an infant in the cradle?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Mary pointed to the child. They exclaimed: \"How can we speak to one who is in the cradle, a mere child?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She pointed to the baby (and referred them to him for their answer). They said, \"How can we talk to a baby in the cradle?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon she pointed towards the child; they said, “How can we speak to an infant who is in the cradle?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then she pointed to him. They said: \"How can we talk to one who is a child in the cradle\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But she pointed to him. They said: How should we speak to one who was a child in the cradle?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mary pointed to the child then; but they said, 'How shall we speak to one who is still in the cradle, a little child?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then she pointed to him. They said: How can we talk to one who is in the cradle, a young boy?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She pointed to the child. They said, \"How shall we talk to someone who is a child in the cradle?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then she Pointed to him. They said: how shall we speak to one who is in the cradle, a child?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereat she pointed to him. They said, ‘How can we speak to one who is yet a baby in the cradle?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But she pointed to the babe. They said: \"How can we talk to one who is a child in the cradle?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then she pointed to him. They said: \"How can we talk to one who is a child in the cradle?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she pointed to him (Prophet Jesus). But they replied: 'How can we speak with a baby in the cradle'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she pointed to him. They said, “How can we speak to an infant in the crib?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So she pointed to him. They said, \"How can we speak to one who is in the cradle a child?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:29] Thereat she pointed, them, to him, intimating [to them that they], ‘talk to him’. They said, ‘How can we talk to one who is, who happens to be, in the cradle, [still] a little child?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then she pointed to him) she pointed to Jesus (pbuh) that they should speak to him. (They said: How can we tale to one who is in the cradle, a young boy) forty days old?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَن كَانَ فِي ٱلْمَهْدِ صَبِيّاً } يعني صارَ فِي المَهدِ\n وقال المَهدُ: حِجرُهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تمادى تعييرهم وتشنيعهم { فَأَشَارَتْ إِلَيْهِ } أي: إلى ولدها، بأن قل لهم في جوابهم ما يفحمون به ويسكتون، بل يتيهون ويتحيرون، ولما رأوا إشاراتها إليه وتفويضها الجواب نحوه { قَالُواْ } على سبيل الاستهزاء: { كَيْفَ نُكَلِّمُ مَن كَانَ فِي ٱلْمَهْدِ صَبِيّاً } [مريم: 29] رضيعاً ولم يُعهد من مثله التكلم، أنت قد خجلتِ واستحييتِ تدفعينَنَا بهذا الرضيع، مع أنه معصومُ لا ذنب له\n\n\n\n\nولما رأى عيسى اشتداد اللائمين على أمه بالتقرح والتشنيع، واضطرار أمه واضطرابها من لومهم، أخذ في الجواب بإلهام الله إياه؛ حيث { قَالَ } مفصحاً معرباً على وجه الفصاحة والبلاغة، ومشتملاً على الحكمة البالغة: لا تعيروا أيها الجاهلون عن أمري وعلو شأني في أمي الكاملة المتناهية في العصمة والعفة، ولا ترموها بما لا يليق بعلو شأنها وجلالة قدرها { إِنِّي عَبْدُ ٱللَّهِ } الحكيم المتقن في أفعاله، المستقل في حكمه وآثاره، خصني بالنبوة الرسالة، بأنواع الكرامات والمعجزات، وأبدعني من محض جوده من روحه، وأرسلني إلى عباده للهداية والإرشاد إلى توحيده؛ لذلك { آتَانِيَ ٱلْكِتَابَ } أي: الإنجيل النازل من عنده علي؛ لترويج رسالتي وإرشادي وتتميم تكميلي { وَجَعَلَنِي نَبِيّاً } [مريم: 30] كسائر الأنبياء، { وَجَعَلَنِي مُبَارَكاً } نفّاعاً كثيرَ الخير والبركة لأهل الصلاح من البرية { أَيْنَ مَا كُنتُ } وحيثما توطنتُ وجلستُ معهم يَصِل خيري إليهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأشارتْ إِليه } أي: إلى عيسى أن كلموه، ولم تكلمهم وفاء بنذرها، وإشارتها إليه من باب الإدلال، رجوعًا لقوله لها: { وقرّي عينًا } ، ولا تقر عينها إلا بالوفاء بما وعُدت به، من العناية بأمرها والكفاية لشأنها، وذلك يقتضي انفرادها بالله وغناها به، فتدل بالإشارة\n وكان ذلك طوعَ يدها، وتذكّر قضية جريج\n قاله في الحاشية\n { قالوا } منكرين لجوابها: { كيف نُكلم من كان في المهد صبيًّا } ، ولم يُعهد فيما سلف صبي يكلمه عاقل\n و { كان } هنا: تامة\n و { صبيًّا }: حال\n وقيل: زائدة، أي: من هو في المهد\n { قال } عيسى عليه السلام: { إِني عبد الله } ، أنطقه الله تعالى بذلك تحقيقًا للحق، وردًا على من يزعم ربوبيته\n قيل كان المستنطق لعيسى زكريا - عليهما السلام - وعن السدي: لما أشارت إليه، غضبوا، وقالوا: لَسُخْرِيَتُها بنا أشدُّ علينا مما فعلت\n رُوي أنه عليه السلام كان يرضع، فلما سمع ذلك ترك الرضاع واقبل عليهم بوجهه، واتكأ على يساره، وأشار بسبابته، فقال ما قال\n وقيل: كلمهم بذلك، ثم لم يتكلم حتى بلغ مبلغًا يتكلم فيه الصبيان",
      "translations": []
    }
  ]
}