{
  "chapter": "مريم",
  "text": "ياخت هرون ما كان ابوك امرا سوء وما كانت امك بغيا",
  "translations": [
    {
      "translation": "O sister of Aaron, your father was not a wicked person, nor your mother sinful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Aaron! Your father was not an evil man, nor was your mother an unchaste woman.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron's sister, your father was not a bad man nor was your mother unchaste\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O sister of Haroon, neither was your father an evil man nor was your mother of poor conduct!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Harun! Your father was not a man who used to commit adultery, nor your mother was an unchaste woman.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Haroun! your father was not a bad man, nor, was your mother an unchaste woman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sister of Aaron, thy father was not a wicked man, nor was thy mother a woman unchaste.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Aaron! Thy father was not a wicked man nor was thy mother a harlot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sister of Aaron, your father was not an evil man, nor was your mother an unchaste woman!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Harun: thy father was not a man of evil, nor was thy mother a harlot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Aaron[’s lineage]! Your father was not an evil man, nor was your mother unchaste.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Aaron! Thy father was not a man of evil, nor thy mother a woman unchaste!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister (i.e. the like) of Harun (Aaron) [not the brother of Musa (Moses), but he was another pious man at the time of Maryam (Mary)]! Your father was not a man who used to commit adultery, nor your mother was an unchaste woman.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Aaron, your father was never an evil man, nor was your mother unchaste'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Aaron, your father was not an evil man, and your mother was not a whore.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sister of Aaron, your father was not a man of evil, nor was your mother unchaste.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:28] O sister of Aaron — he was a righteous man, in other words [what is meant is], O you who are like him in [terms of] chastity — your father was not a wicked man, that is, a fornicator, nor was your mother unchaste’, that is, a fornicatress: so how is it that you have this child?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Oh sister of Aaron!) you who resembles Aaron in worship-Aaron was a righteous man, one of the best among people-; and it is also said that Aaron was an evil man and so they compared her to him; and it is also said that Aaron was her half brother from her father side. (Your father was not a wicked man) your father was not an adulterer (nor was your mother a harlot) nor was your mother a whore.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأُخْتَ هَارُونَ } هو رجلُ صالحُ نسبوها إليه تهكماً، وقيل: هي من أولاد هارون أخي موسى، نسبوها إليه وإن تطاولت المدة بينهما { مَا كَانَ أَبُوكِ ٱمْرَأَ سَوْءٍ } منسوبٍ إلى الفواحش والزنا والخروج عن حدود الله { وَمَا كَانَتْ أُمُّكِ بَغِيّاً } [مريم: 28] زانيةً فاجرةً بل هما من أصلح القوم وأزكاهما عن الفواحش والفسوق، فكيف أنت ومن أين اكتسبت هذا؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما كان أبوك } عمران { امْرأَ سَوْءٍ وما كانت أُمك بغيًا } ، فمن أين لك هذا الولد من غير زوج؟\n هذا تقرير لكون ما جاءت به فريًا منكرًا، أو تنبيه على أن ارتكاب الفواحش من أولاد الصالحين أفحش الفواحش",
      "translations": []
    }
  ]
}