{
  "chapter": "مريم",
  "text": "فنادىها من تحتها الا تحزنى قد جعل ربك تحتك سريا",
  "translations": [
    {
      "translation": "A voice called out to her from under her, 'Do not grieve! Your Lord has placed a small stream at your feet.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then (a voice) called to her from below: \"Grieve not; your Lord has made a rivulet gush forth right below you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon the angel below her cried out: \"Grieve not, for your Lord has caused a stream of water to flow beneath you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then she heard the baby saying, \"Do not be sad. Your Lord has caused a stream to run at your feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The angel) Therefore called her from below her, “Do not grieve – your Lord has made a river flow below you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he cried unto her from below her, saying: \"Grieve not: your Lord has provided a Sariy under you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then (the child) called out to her from beneath her: Grieve not, surely your Lord has made a stream to flow beneath you;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the one that was below her called to her, 'Nay, do not sorrow; see, thy Lord has set below thee a rivulet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then (one) cried unto her from below her, saying: Grieve not! Thy Lord hath placed a rivulet beneath thee,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But a voice called out to her from below, \"Do not despair. Your Lord has provided a brook that runs at your feet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then one cried unto her from underneath her, that grieve not, thy Lord hath placed underneath thou a rivulet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon he called her from below her [saying,] ‘Do not grieve! Your Lord has made a spring to flow at your feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (a voice) cried to her from beneath the (palm-tree): \"Grieve not! for thy Lord hath provided a rivulet beneath thee;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then [the babe 'Iesa (Jesus) or Jibrael (Gabriel)] cried unto her from below her, saying: \"Grieve not! Your Lord has provided a water stream under you;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He called from below to her: 'Do not sorrow, look, your Lord has provided a rivulet below you,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereupon he called her from beneath her: “Do not worry; your Lord has placed a stream beneath you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he called her from below her, \"Do not grieve; your Lord has provided beneath you a stream.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:24] Then he called her from below her, namely, Gabriel — for he was lower than her, ‘Do not grieve. Your Lord has made below you a rivulet, a river of water, which had dried up.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then (one) cried unto her from below her) i.e. Gabriel, (saying: Grieve not) Mary over the birth of Jesus! (Thy Lord hath placed a rivulet beneath thee) a prophet beneath you; it is also said that this means: Jesus cried unto her from beneath her: grieve not your Lord has placed a stream beneath you,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيّاً } يعني نهراً صغيراً، وسَرياً بالنبطيةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما وضعت حملها واشتد الألم عليها { فَنَادَاهَا } أي: نادى الوليدُ أمه { مِن تَحْتِهَآ } بإلهام الله إياه وتنشيطاً: { أَلاَّ تَحْزَنِي } يا أمي، ولا يشتد عليك الأ/ر بواسطة ولادتي وظهوري بلا أبٍ، واعلمي { قَدْ جَعَلَ رَبُّكِ تَحْتَكِ } ولداً { سَرِيّاً } [مريم: 24] سيداً مطيعاً نقياً سجياً سخياً ذا إرهاصاتٍ وكراماتٍ، من جملتها: إنه ظهر لك من تحت رجلك نهراً جارياً لدفع عطشك وتطهير الفضلات عن بدنك وثيابك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { فناداها } أي: جبريل عليه السلام { مِنْ تحتِها } ، قيل: إنه كان يقبل الولد من تحتها، أي: من مكان أسفل منها، وقيل: من تحت النخلة، وقيل: ناداها عيسى عليه السلام، ويرجحه قراءة من قرأ بفتح الميم، أي: فخاطبها الذي تحتها: { أن لا تحزني } ،أو: بألا تحزني، على أنَّ \" أنْ \" مفسرة، أو مصدرية، حذف عنها الجار\n\n\n{ قد جعل ربك تحتكِ } أي: بمكان أسفل منك { سَرِيًا } أي: نهرًا صغيرًا، حسبما رُوي مرفوعًا\n قال ابن عباس رضي الله عنهما: إن جبريل عليه السلام ضرب برجله الأرض، فظهرت عين ماء عذب، فجرى جدولاً\n وقيل: فعله عيسى، أي: ضرب برجله فجرى، وقيل: كان هناك نهر يابس - أجرى الله تعالى فيه الماء -، كما فعل مثله بالنخلة، فإنها كانت يابسة لا رأس لها، فأخرج لها رأسًا وخُوصًا وتمرًا\n وقيل: كان هناك نهرُ ماء\n والأول أظهر لأنه الموافق لبيان إظهار الخوارق، والمتبادر من النظم الكريم\n وقيل: { سريًا } أي: سيدًا نبيلاً رفيعَ الشأن جليلاً، وهو عيسى عليه السلام، والتنوين حينئذ للتفخيم\n والجملة تعليل لانتفاء الحزن المفهوم من النهي\n والتعرض لعنوان الربوبية مع الإضافة إلى ضميرها لتشريفها وتأكيد التعليل وتكميل التسلية\n ثم قال: { وهُزّي إِليك } أي: حركي النخلة إليك، أي: جاذبة لها إلى جهتك\n فهَزُّ الشيء: تحريكه إلى الجهات المتقابلة تحريكًا عنيفًا، والمراد هنا ما كان بطريق الجذب والدفع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:4",
      "similarity": 0.7378061833920219
    },
    {
      "verse": "44:23",
      "similarity": 0.7215341151728345
    },
    {
      "verse": "26:52",
      "similarity": 0.7015149484650243
    },
    {
      "verse": "17:1",
      "similarity": 0.3732140416066593
    },
    {
      "verse": "20:77",
      "similarity": 0.2998285167599358
    }
  ]
}