{
  "chapter": "مريم",
  "text": "وجعلنى مباركا اين ما كنت واوصنى بالصلوة والزكوة ما دمت حيا",
  "translations": [
    {
      "translation": "He has made me blessed wherever I am and directed me to do salat and give zakat as long as I live,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And blessed me wherever I may be, and enjoined on me worship and zakat for as long as I live,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and has blessed me wherever I might be and has enjoined upon me Prayer and Zakah (purifying alms) as long as I live;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has blessed me no matter where I dwell, commanded me to worship Him and pay the religious tax for as long as I live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And He has made me blessed wherever I be; and ordained upon me prayer and charity, as long as I live.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has made me blessed wherever I be, and has enjoined on me [Awsani] Salah and Zakah, as long as I live.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has made me blessed wherever I may be, and He has enjoined on me prayer and poor-rate so long as I live;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed He has made me, wherever I may be; and He has enjoined me to pray, and to give the alms, so long as I live,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hath made me blessed wheresoever I may be, and hath enjoined upon me prayer and almsgiving so long as I remain alive,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has made me blessed wherever I may be, and has enjoined upon me prayer and almsgiving throughout my life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath made me blest wheresoever I may be, and enjoined on me the prayer and the poor-rate as long as I am alive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has made me blessed, wherever I may be, and He has enjoined me to [maintain] the prayer and to [pay] the zakat as long as I live,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He hath made me blessed wheresoever I be, and hath enjoined on me Prayer and Charity as long as I live;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has made me blessed wheresoever I be, and has enjoined on me Salat (prayer), and Zakat, as long as I live.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He made me to be blessed wherever I am, and He has charged me with prayer and charity for as long as I shall live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has made me blessed wherever I may be; and has enjoined on me prayer and charity, so long as I live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has made me blessed wherever I am and has enjoined upon me prayer and zakah as long as I remain alive\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:31] And He has made me blessed wherever I may be, that is, [He has made me] of great benefit to mankind — [this is] a foretelling of what had been preordained for him — and He has enjoined upon me prayer and alms-giving, He has commanded me to [do] both of these, as long as I remain alive;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And hath made me blessed) and has made me a teacher of goodness (wheresoever I may be) or stay, (and hath enjoined upon me prayer) and enjoined upon me the perfection of the prayer (and alms giving) acts of charity (so long as I remain alive) as long as I live,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلَنِي مُبَارَكاً } يعني هادِياً مهدِيّاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And make me blessed,\" means a guide, a guiding light.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من كمال تربية الله وتزكيته إياي { أَوْصَانِي } وأمرني { بِٱلصَّلاَةِ } والميلِ التام والتوجه نحوه بالجوارح والأركان { وَٱلزَّكَاةِ } أي: التخلية والتطهير عن جميع الرذائل والخبائث المتعلقة بالنفوس البشرية\n المنغمسة بالعلائق الدنيوية\n المبعدة عن صفاء الوحدة الذاتية { مَا دُمْتُ حَيّاً } [مريم: 31] بروح الله الذي أبدعني منه خالصاً صافياً عن جميع الكدورات\n وأوصاني بما أوصاني من عنايةٍ منه لأكون باقياً على صفائي\n وطهارة لاهوتي بلا كدرٍ من خبائث الناسوت\n\n{ وَ } جعلني أيضاً { بَرّاً } أي: باراً محسناً { بِوَٰلِدَتِي } ممتثلاً بأمرها\n قائماً بخدمتها\n خافضاً جناح الذل من الرحمة إياها\n والحمد لولي الحمد الذي ربَّاني سيعداً على الطهارة الصلاح وأنواع الكرامة والفلاح والتذلل والتواضع مع عموم عباده { وَلَمْ يَجْعَلْنِي جَبَّاراً } متكبراً متجبيراً على الناس { شَقِيّاً } [مريم: 32] بعيداً عن روح الله مستجلياً لعذابه\n\n\n{ وَ } متى سلمني الله\n وطهرني عن جميع ما يعوقني عن مقتضى صرافة الوحدة الذاتية الإلهية المعبرة عنها بروح الله صار { ٱلسَّلاَمُ عَلَيَّ } أي: سلام الله وحفظه { يَوْمَ وُلِدْتُّ } عن أمرٍ يحفظني من مسِّ الشيطان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال في كلامه: { آتاني الكتابَ }: الإنجيل: { وجعلني } مع ذلك { نبيًّا وجعلني مباركًا }: نفَّاعًا للناس، معلمًا للخير { أينما كنتُ } أي: حيثما كنت، { وأوصاني بالصلاة }: أمرني بها أمرًا مؤكدًا، { والزكاة } زكاة الأموال، أو بتطهير النفس من الرذائل { ما دمت حيًا } في الدنيا\n\n\n{ و } جعلني { برًّا بوالدتي } فهو عطف على { مباركًا }\n وقرئ بالكسر، على أنه مصدرٌ وُصف به مبالغةً، وعبّر بالفعل الماضي في الأفعال الثلاثة إما باعتبار ما سبق في القضاء المحتوم، أو بجعل ما سَيَقَع واقعًا لتحققه\n ثم قال: { ولم يجعلني جبارًا شقيًّا } عند الله تعالى، بل متواضعًا لينًا، سعيدًا مقربًا، فكان يقول: سلوني، فإن قلبي لين، وإني في نفسي صغير، لما أعطاه الله من التواضع\n ثم قال: { والسلام عليَّ يوم ولدتُ ويوم أموتُ ويوم أُبعث حيًّا } ، كما تقدم على يحيى\n وفيه تعريض بمن خالفه، فإن إثبات جنس السلام لنفسه تعريض بإثبات ضده لأضداده، كما في قوله تعالى:\n\n[طه: 47] فإنه تعريض بأن العذاب على من كذّب وتولى\n فهذا آخر كلام عيسى عليه السلام، وهو أحد من تكلم في المهد، وقد تقدم ذكرهم في سورة يوسف نظمًا ونثرًا\n وكلهم معروفون، غير أن ماشطة ابنة فرعون لم تشتهر حكايتها\n وسأذكرها كما ذكرها الثعلبي\n قال: قال ابن عباس: لما أسري بالنبي صلى الله عليه وسلم مرت به ريح طيبة فقال: يا جبريل ما هذه الرائحة؟ قال: رائحة ماشطةِ بنتِ فرعون، كانت تمشطها، فوقع المشط من يدها، فقالت: بسم الله، فقالت ابنته: أبى؟ فقالت: لا، بل ربي وربك ورب أبيك\n فقالت: أُخبر بذلك أبي؟ قالت: نعم، فأخبرته فدعاها، وقال: من ربك؟ قالت: ربي وربك في السماء، فأمر فرعون ببقرة - أي: آنية عظيمة من نحاس - فَأُحْمِيَتْ، ودعاها بولدها، فقالت: إن لي إليك لحاجةً، قال: وما حاجتك؟ قالت: تجمع عظامي وعظامَ ولدي فتدفنها جميعًا، قال: وذلك لك علينا من الحقّ، سأفعل ذلك لك، فأمر بأولادها واحدًا واحدًا، حتى إذا كان آخر ولدها، وكان صبيًا مرضَعًا، قال: اصبري يا أمه\n\n\n فألقاها في البقرة مع ولدها\n هـ\n الإشارة: يؤخذ من الآية أمور صوفية، منها: أن الإنسان يُباح له أن يستتر في الأمور التي تهتك عرضه، ويهرب إلى مكان يُصان فيه عرضه، إلا أن يكون في مقام الرياضة والمجاهدة، فإنه يتعاطى ما تموت به نفسه، ومنها: أنه لا بأس أن يلجأ الإنسان إلى ما يخفف آلامه ويسهل شدته، ولا ينافي توكله\n ومنها: أن لا بأس أن يتمنى الموت إذا خاف ذهاب دينه أو عرضه، أو فتنة تحول بينه وبين قلبه\n ويُؤخذ أيضًا من الآية: أن فزع القلب عند الصدمة الأولى لا ينافي الصبر والرضا لأنه من طبع البشر، وإنما ينافيه تماديه على الجزع\n ومنها: أن تحريك الأسباب الشرعية لا ينافي التوكل، لقوله تعالى: { وهُزي إليك }\n لكن إذا كانت خفيفة مصحوبة بإقامة الدين، غير معتمد عليها بقلبه، فإن كان متجردًا فلا يرجع إليها حتى يكمل يقينه، ويتمكن في معرفة الحق تعالى\n\n\nوقد كانت في بدايتها تأتي إليها الأرزاق بغير سبب كما في سورة آل عمران، وفي نهايتها قال لها: { وهُزي إليك }\n قال الشيخ أبو العباس المرسي رضي الله عنه: كانت في بدايتها متعرفًا إليها بخرق العادات وسقوط الأسباب، فلما تكمل يقينها رجعت إلى الأسباب، والحالة الثانية أتم من الحالة الأولى، وأما من قال: إن حبها أولاً كان لله وحده، فلما ولدت انقسم حبها، فهو تأويل لا يرضى ولا ينبغي أن يلتفت إليه، لأنها صدّيقة، والصدّيق والصدّيقة لا ينتقلان من حالة إلا إلى أكمل منها\n ومنها: أن الإنسان لا بأس أن يوجب على نفسه عبادة، إذا كان يتحصن بها من الناس، أو من نفسه، كالصوم أو الصمت أو غيرهما، مما يحجزه عن العوام، أو عن الانتصار للنفس\n وقوله تعالى: { والسلام عليّ يوم وُلدتُ\n\n\n } الآية: قال الورتجبي: سلام يحيى سلام تخصيص الربوبية على العبودية\n ثم قال: وسلام عيسى من عين الجمع، سلام فيه مزية ظهور الربوبية في معدن العبودية\n وأرفع المقامين سلام الحق على سيد المرسلين كفاحًا في وصاله وكشف جماله، ولو سَلّم عليه بلسانه كان بلسان الحدث، ولا يبلغ رتبة سلامه بوصف قِدَمه\n هـ\n ثمَّ شرع في الردِّ على النصارى وعلى من أشرك من غيرهُ\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:23",
      "similarity": 0.6004808453472321
    },
    {
      "verse": "11:107",
      "similarity": 0.5133141059119237
    },
    {
      "verse": "5:117",
      "similarity": 0.4556878727774413
    },
    {
      "verse": "13:35",
      "similarity": 0.4209341518545963
    },
    {
      "verse": "5:24",
      "similarity": 0.34133253102098443
    }
  ]
}