{
  "chapter": "مريم",
  "text": "وانذرهم يوم الحسرة اذ قضى الامر وهم فى غفلة وهم لا يؤمنون",
  "translations": [
    {
      "translation": "Warn them of that day of pining when all matters will have been settled, though they would still be unaware and unbelieving (of the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), warn those who are steeped in heedlessness and are obstinately rejecting the truth that the Day shall come when things will be finally decided and they shall be left with utter remorse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn them of the woeful day when the final decree will be issued; they are neglectful and faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the Day of Regret when the matter will have been decided; and they are in neglect, and they do not accept faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the Day of grief and regrets, when the case has been decided, while (now) they are in a state of carelessness, and they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the day of intense regret, when the matter shall have been decided; and they are (now) in negligence and they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn thou them of the day of anguish, when the matter shall be determined, and they yet heedless and unbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the Day of anguish when the case hath been decided. Now they are in a state of carelessness, and they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn them of [the coming of] the Day of Remorse, when everything will have been decided, while they are heedless and do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn thou them of thy Day of Sighing when the affair shall have been decreed while yet they are in negligence and are not believing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn them of the Day of Regret, when the matter will be decided, while they are [yet] heedless and do not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But warn them of the Day of Distress, when the matter will be determined: for (behold,) they are negligent and they do not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them (O Muhammad SAW) of the Day of grief and regrets, when the case has been decided, while (now) they are in a state of carelessness, and they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn them of that Day of Anguish, when the matter is determined whilst heedlessly they disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them of the Day of Regret, when the matter will be concluded. Yet they are heedless, and they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn them, [O Muhammad], of the Day of Regret, when the matter will be concluded; and [yet], they are in [a state of] heedlessness, and they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:39] And warn them, threaten, O Muhammad (s), the disbelievers of Mecca, of the Day of Regret, namely, the Day of Resurrection, on which the sinner will regret not having been virtuous in [the life of] this world, when the matter will be decided, for them thereupon, that they be chastised, while they, in this world, are [yet] heedless, of it, and do not believe, in it [the Day of Resurrection].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And warn them) Muhammad (of the Day of anguish) of the Day of regret (when the case hath been decided) when the reckoning is over and the people of Paradise enter Paradise and the people of hell enter hell and Death is slain. (Now they are in a state of carelessness) in a state of ignorance and blindness 329 concerning it, (and they believe not) in Muhammad (pbuh) in the Qur'an or in resurrection after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ قُضِيَ ٱلأَمْرُ وَهُمْ فِي غَفْلَةٍ } يعني أهلَ الدّنيا فِي غَفلةٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَنْذِرْهُمْ } يا أكمل الرسل مَن عندك لهم { يَوْمَ ٱلْحَسْرَةِ } المعدة للجزاء؛ بحيث لا يكون فيها التلاقي والتدارك على مفات سوى الحسرة والندامة الغير المفيدة { إِذْ قُضِيَ ٱلأَمْرُ } ونزلَ العذاب ومضى زمان امتثال المأمور { وَ } الحال أنه { هُمْ فِي غَفْلَةٍ } وغرورٍ عن مضيه { وَهُمْ لاَ يُؤْمِنُونَ } [مريم: 39] ولا يصدقون بإتيان هذا اليوم الموعود على ألسنة الرسل والكتب، وكيف لا يصدقون هذا اليوم أولئك الكاذبون المكذبون المستغرقون في بحر الغفلة والضلال التائهون في تيه الغرور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنذرهم يوم الحسرة } يوم يتحسر الناس قاطبة، أما المسيء فعلى إساءته، وأما المحسن فعلى قلة إحسانه، { إِذ قُضيَ الأمر } أي: فرغ من يوم الحساب، وتميز الفريقان، إلى الجنة وإلى النار\n رُوِيَ أن النبي صلى الله عليه وسلم سُئل عن ذلك، فقال:\n\n \" حين يجاء بالموت على صورة كبش أملح، فيُذبح، والفريقان ينظرون، فينادى يا أهل الجنة خلود فلا موت، ويا أهل النار خلود فلا موت، فيزداد أهل الجنة فرحًا إلى فرحهم، وأهل النار غمًا إلى غمهم، ثم قرأ صلى الله عليه وسلم: { وأنذرهم يوم الحسرة إِذْ قُضي الأمر وهم في غفلة } ، وأشار بيده إلى الدنيا \" \n\nقال مقاتل: لولا ما قضى الله من تعميرهم فيها، وخلودهم لماتوا حسرة حين رأوا ذلك\n { وهم } في هذا اليوم { في غفلة } عما يراد بهم في الآخرة، { وهم لا يُؤمنون } بهذا لاغترارهم ببهجة الدنيا، فلا بد أن تنهد دعائمها، وتمحى بهجتها، ويفنى كل ما عليها، قال تعالى: { إِنا نحن نرث الأرضَ ومَنْ عليها } لا ينبغي لأحد غيرنا أن يكون له عليها وعليكم ملك ولا تصرف، أو: إنا نحن نتوفى الأرض ومن عليها، بالإفناء والإهلاك، توفي الوارث لإرثه، { وإِلينا يُرجعون } يُردون إلى الجزاء، لا إلى غيرنا، استقلالاً أو اشتراكًا\n والله تعالى أعلم\n  الإشارة: ينبغي للعبد المعتني بشأن نفسه أن يحصِّن عقائده بالدلائل القاطعة، والبراهين الساطعة، على وفاق أهل السُنَّة، ثم يجتهد في صحبة أهل العرفان، أهل الذوق والوجدان، حتى يُطلعوه على مقام الإحسان، مقام أهل الشهود والعيان\n\n\nفإذا فرط في هذا، لحقه الندم والحسرة، في يوم لا ينفع فيه ذلك\n فكل من تخلف عن مقام الذوق والوجدان فهو ظالم لنفسه باخس لها، يلحقه شيء من الخسران، ولا بد أنْ تبقى فيه بقية من الضلال، حيث فرط عن اللحوق بطريق الرجال، قال تعالى: { لكن الظالمون اليوم في ضلال مبين }\n { وأنذرهم يوم الحسرة } أي: يوم يرفع المقربون ويسقط المدعون\n فأهل الذوق والوجدان حصل لهم اللقاء في هذه الدار، ثم استمر لهم في دار القرار\n رُوي أن الشيخ أبا الحسن الشاذلي رضي الله عنه قال يومًا بين يدي أستاذه: اللهم اغفر لي يوم لقائك\n فقال له شيخه - القطب ابن مشيش - رضي الله عنهما: هو أقرب إليك من ليلك ونهارك، ولكن الظلم أوجب الضلال، وسبقُ القضاء حَكَمَ بالزوال عن درجة الأُنْس ومنازل الوصال، وللظالم يومٌ لا يرتاب فيه ولا يخاتل، والسابق قد وصل في الحال، \" أسمع بهم وأبصر يوم يأتوننا لكن الظالمون اليوم في ضلال مبين \"\n هـ\n كلامه رضي الله عنه\n ثم استتبع بذكر قصص الانبياء تتمة للرد على أهل الشرك\n",
      "translations": []
    }
  ]
}