{
  "chapter": "مريم",
  "text": "اسمع بهم وابصر يوم ياتوننا لكن الظلمون اليوم فى ضلل مبين",
  "translations": [
    {
      "translation": "How clear will be their hearing, how perfect their sight, on the Day they come to Us; whereas today the wrongdoers are clearly misguided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How keenly would they hear and see when they come before Us then, even though today the evil-doers are lost in palpable error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How well shall they hear and how well shall they see on the Day they come to Us! But today the evil-doers are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), how clearly they will hear and see on the day when they will be brought into Our presence. Today the wrong doers are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Much will they listen and much will they see, on the Day when they come to Us, but today the unjust are in open error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How clearly will they see and hear, the Day when they will appear before Us! But the wrongdoers today are in plain error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How clearly shall they hear and how clearly shall they see on the day when they come to Us; but the unjust this day are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How well they will hear and see on the day they come to Us! But the evildoers even today are in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See and hear them on the Day they come unto Us! yet the evil-doers are to-day in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How sharp of hearing, how sharp of sight they will be when they come to Us. But today, these evil-doers are obviously lost in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How wondrous in their hearing and their sight will they be the Day they come unto Us! But to-day the wrong doers are in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How well they will hear and how well they will see on the day when they come to Us! But today the wrongdoers are in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How plainly will they see and hear, the Day that they will appear before Us! but the unjust today are in error manifest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How clearly will they (polytheists and disbelievers in the Oneness of Allah) see and hear, the Day when they will appear before Us! But the Zalimun (polytheists and wrong-doers) today are in plain error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How well they will hear and see on the Day when they come before Us! The evildoers are today in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Listen to them and watch for them the Day they come to Us. But the wrongdoers today are completely lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How [clearly] they will hear and see the Day they come to Us, but the wrongdoers today are in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:38] How hearing they are and seeing, they are (these two constructions [are used to] express ‘amazement’, meaning, ‘how well they [will] hear and how well they [will] see’) on the Day when they come to Us, in the Hereafter. Yet the evildoers (an example of a proper noun [‘evildoers’] replacing a third person pronominalisation) today, that is, in this world, are in manifest error, that is, [error] that is evident therein, having been deaf [unable] to listen to the truth and blind [unable] to see it. In other words, [the meaning is]: O you, the one being addressed, marvel at how [well] they will [be able to] hear and see in the Hereafter after they had been deaf and blind in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(See and hear them) how well they will see and hear (on the Day they come unto Us) this is the Day of Judgement, that Jesus is not Allah, His son or partner! (Yet the evil-doers) the idolaters (are today) in this worldly life (in error manifest) in manifest disbelief because of saying that Jesus is Allah, His son or His partner.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَسْمِعْ } أيها السميمع { بِهِمْ } أي: بأنينهم وحنينهم { وَأَبْصِرْ } أيها المبصر بأغلالهم وسلاسلهم { يَوْمَ يَأْتُونَنَا } للعرض والحساب مضطرين مسحوبين { لَـٰكِنِ ٱلظَّالِمُونَ } الخارجون عن مقتضى أوامرنا ونواهينا { ٱلْيَوْمَ } الذي في النشأة الأولى { فِي ضَلاَلٍ مُّبِينٍ } [مريم: 38] وجهلٍ عظيم عن أهوال يوم القيامة وأفزاعه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أسمِعْ بهم وأبصرْ } أي: ما أسمعهم وما أبصرهم، تعجب من حدة سمعهم وإبصارهم يومئذ\n والمعنى: أن أسماعهم وأبصارهم { يوم يأتوننا } للحساب والجزاء جدير أن يُتعجب منها، بعد أن كانوا في الدنيا صمًا عميًا\n أو: ما أسمعهم وأطوعهم لما أبصروا من الهدى، ولكن لا ينفعهم يومئذ مع ضلالهم عنه اليوم، فقد سمعوا وأبصروا، حين لم ينفعهم ذلك\n قال الكلبي: لا أحد يوم القيامة أسمع منهم ولا أبصر، حين يقول الله لعيسى:\n\n[المَائدة: 116]\n هـ\n ويحتمل أن يكون أمر تهديد لا تعجب، أي: أسمعهم وأبصرهم مواعيد ذلك اليوم، وما يحيق بهم فيه، فالجار والمجرور، على الأول، في موضع رفع، وعلى الثاني: نصب\n { لكن الظالمون اليومَ } أي: في الدنيا، { في ضلال مبين } أي: لا يدرك غايته، حيث غفلوا عن الاستماع والنظر بالكلية\n ووضع الظالمين موضع الضمير للإيذان بأنهم في ذلك ظلمون لأنفسهم حيث تركوا النظر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:76",
      "similarity": 0.45348492248473177
    },
    {
      "verse": "56:85",
      "similarity": 0.45111139984282356
    },
    {
      "verse": "7:61",
      "similarity": 0.38938370764383606
    },
    {
      "verse": "10:44",
      "similarity": 0.38331328352146193
    },
    {
      "verse": "7:198",
      "similarity": 0.35964160759206315
    }
  ]
}