{
  "chapter": "مريم",
  "text": "فاختلف الاحزاب منۢ بينهم فويل للذين كفروا۟ من مشهد يوم عظيم",
  "translations": [
    {
      "translation": "The parties differed among themselves. Woe to those who are kafir when they are present on a terrible Day!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet the sectarians differed among themselves. Alas for the unbelievers when they see the Terrible Day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But different parties began to dispute with one another. A dreadful woe awaits on that great Day for those that reject the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The followers of Jesus) turned themselves into quarrelling sects. The disbelievers shall face a woeful condition on the great Day (of Judgment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then groups among them differed; so ruin is for the disbelievers from the witnessing of a Great Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the sects differed, so woe unto the disbelievers from the meeting of a great Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But parties from among them disagreed with each other, so woe to those who disbelieve, because of presence on a great day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the parties have fallen into variance among themselves; then woe to those who disbelieve for the scene of a dreadful day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sects among them differ: but woe unto the disbelievers from the meeting of an awful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet different groups differed among themselves. How awful it will be for those who have rejected the truth when a dreadful Day arrives!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the sects have differed among themselves; so woe to those who disbelieve in the witness of a Day Mighty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the factions differed among themselves. So woe to the faithless at the scene of a tremendous day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the sects differ among themselves: and woe to the unbelievers because of the (coming) Judgment of a Momentous Day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the sects differed [i.e. the Christians about 'Iesa (Jesus)], so woe unto the disbelievers [those who gave false witness by saying that 'Iesa (Jesus) is the son of Allah] from the meeting of a great Day (i.e. the Day of Resurrection, when they will be thrown in the blazing Fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the parties have fallen into variance among themselves, then woe to those who disbelieve for the scene of a Dreadful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the various factions differed among themselves. So woe to those who disbelieve from the scene of a tremendous Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the factions differed [concerning Jesus] from among them, so woe to those who disbelieved - from the scene of a tremendous Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:37] But the factions differed among themselves, that is to say, the Christians, [they differed] regarding Jesus: was he the son of God? A god alongside Him? Or [was he] the third of three [gods]? So woe — [meaning] severe punishment [will be meted out] — to those who disbelieve, [those who disbelieve] in the way mentioned and in other ways, at the scene of an awful Day, that is to say, [woe to them] when they are present at the Day of Resurrection and [witnessing] its terrors.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The sects) the disbelievers (among them differ) some saying He is Allah, some he is the son of Allah and some Allah's partner: (but woe) a river in Gehenna containing puss and blood; it is also said that this means: severe chastisement (unto the disbelievers) who became different sects regarding Jesus (from the meeting of an awful Day) from the chastisement of the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بالطريق الأبين الأوضح { فَٱخْتَلَفَ ٱلأَحْزَابُ } أي: فِرق النصارى واليهود في شأنه وشأنه أمه اختلافاً ناشئاً { مِن بَيْنِهِمْ } بلا سيدٍ شرعيٍ وعقليٍ، فأفرط النصارى باتخاذه إلهاً وابناً له، وفرّط اليهود بنسبته وأمه إلى ما لا يليق بشأنهما\n\n\n\n\nوبالجملة: فاستحق كلا الفريقين بأشد العذاب وأسوأ العقاب { فَوَيْلٌ } عظيمُ وعذابُ شديدُ أليمُ { لِّلَّذِينَ كَفَرُواْ } أي: ستروا ما هو الحق في شأنه، وعدلوا عنه إلى الباطل بلا حجةٍ وبرهانٍ { مِن مَّشْهَدِ يَوْمٍ عَظِيمٍ } [مريم: 37] أي: من شهود يوم القيامة وظهوره، وهم يُسحبون فيه على وجوههم نحو النار، ويُكبون عليها صاغرين مضطرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { فاختلف الأحزابُ من بينهم } ، الفاء لترتيب ما بعدها على ما قبلها، تنبيهًا على سوء صنيعهم، بجعلهم ما يُوجب الاتفاق منشأ للاختلاف، فإن ما حكى من مقالات عيسى عليه السلام، مع كونها نصوصًا قاطعة في كونه عبده تعالى ورسوله، قد اختلفت اليهود والنصارى بالتفريط والإفراط، وفرّق النصارى، فقالت النسطورية: هو ابن الله، وقالت اليعقوبية: هو الله هبط إلى الأرض ثم صعد إلى السماء، وقالت المِلْكَانية: هو ثالث ثلاثة\n { فويلٌ للذين كفروا } وهم: المختلفون فيه بأنواع الضلالات\n\n\nوأظهر الموصول في موضع الإضمار إيذانًا بكفرهم جميعًا، وإشعارًا بِعِلِّيَّةِ الحكم، { من مَشْهَدِ يوم عظيم } أي: ويل لهم من شهود يوم عظيم الهول والحساب والجزاء، وهو يوم القيامة، أو: من وقت شهوده أو مكانه، أو من شهادة اليوم عليهم، وهو أن تشهد عليهم الملائكة والأنبياء - عليهم السلام - وألسنتُهم وأيديهم وأرجلهم، بالكفر والفسوق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:65",
      "similarity": 0.8400398983435913
    },
    {
      "verse": "40:30",
      "similarity": 0.6074130225466393
    },
    {
      "verse": "5:56",
      "similarity": 0.539692982532517
    },
    {
      "verse": "33:22",
      "similarity": 0.4969473049996695
    },
    {
      "verse": "11:17",
      "similarity": 0.4363206126743923
    }
  ]
}