{
  "chapter": "مريم",
  "text": "وان الله ربى وربكم فاعبدوه هذا صرط مستقيم",
  "translations": [
    {
      "translation": "'Allah is my Lord and your Lord so worship Him. This is a straight path.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Jesus only said:) \"Surely God is my Lord and your Lord, so worship Him. This is the straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Jesus had said): \"Indeed Allah is my Lord and your Lord, so serve Him alone. This is the Straight Way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Baby Jesus said), \"Worship God who is my Lord as well as yours. This is the straight path\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said Eisa, “Indeed Allah is my Lord and your Lord – therefore worship Him; this is the Straight Path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[`Isa said]: \"And verily, Allah is my Lord and your Lord. So worship Him. That is the straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely Allah is my Lord and your Lord, therefore serve Him; this is the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God is my Lord, and your Lord; So serve you Him. This is a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! Allah is my Lord and your Lord. So serve Him. That is the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is my Lord and your Lord, so worship Him alone. That is the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily Allah is my Lord and your Lord; so worship Him; this is a way straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And Jesus said,] ‘Indeed Allah is my Lord and your Lord. So worship Him. This is a straight path.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah is my Lord and your Lord: Him therefore serve ye: this is a Way that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "['Iesa (Jesus) said]: \"And verily Allah is my Lord and your Lord. So worship Him (Alone). That is the Straight Path. (Allah's Religion of Islamic Monotheism which He did ordain for all of His Prophets).\" [Tafsir At-Tabari]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah is my Lord and your Lord therefore worship Him. That is the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“God is my Lord and your Lord, so worship Him. That is a straight path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Jesus said], \"And indeed, Allah is my Lord and your Lord, so worship Him. That is a straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:36] And indeed God is my Lord and your Lord. So worship Him (read [the introductory particle] as anna, with an implicit [preceding] udhkur, ‘mention’; or read [it] as inna, with an implicit [preceding] qul, ‘say’, [a reading] indicated by [the fact that God says elsewhere] ‘I only said to them that which You commanded me: “Worship God, my Lord and your Lord” ’ [Q. 5:117]). This, that has been mentioned, is a straight path, a route leading to Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When Jesus brought the Message to his people, he said: I am the servant of Allah and His messiah, (And lo! Allah is my Lord) my Creator and Provider (and your Lord) your Creator and Provider. (So serve Him) profess His divine Oneness. (That) the monotheism with which I am enjoining you (is the right path) an established religion with which Allah is pleased, i.e. Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفقال: { إِنَّ ٱللَّهَ } الذي أوجدني وأبدعني بلا أبٍ هو { رَبِّي } الذي ربَّاني وأمي بأنواع الكرامة، وأظهرني من كتم العدم بمقتضى قدرته { وَ } هو سبحانه { رَبُّكُمْ } أيضاً أوجدكم وأظهركم مثلي إيجاداً إبداعياً { فَٱعْبُدُوهُ } ووحّدوه ولا تشركوا معه شيئاً من المخلوقات، وتوجهوا نحوه بالتذلل التام والانكسار؛ إذ هو المستحق للعبادة لا معبود سواه، ولا إله إلا هو { هَـٰذَا } الذي بينت لكم { صِرَاطٌ مُّسْتَقِيمٌ } [مريم: 36] وطريقُ واضحُ سويُ موصلُ إلى معرفة الحق وتوحيده، فاتبعوه إن كنتم مؤمنين موقنين بتوحيده\n\n\n\n\nوبعدما نبههم عيسى\n صلوات الرحمن عليه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وإن الله }: عطف على قوله: { إني عبد الله } فيمن كسر، وعلى حذف اللام فيمن فتح، أي: ولأن الله ربي وربكم\n وقال الواحدي وأبو محمد مكي: عطف على قوله: { بالصلاة } أي: أوصاني بالصلاة وبأن الله\n\n\n الخ: وقال المحلي: بالفتح، بتقدير اذكر، وبالكسر بتقدير \" قل \"\n و { قول الحق }: مصدر مؤكد لقال، فيمن نصب، وخبر عن مضمر، فيمن رفع، أي: هو، أو هذا\n و { إذا قضى }: بدل من { يوم الحسرة } ، أو ظرف للحسرة\n و { هم في غفلة وهم لا يؤمنون }: جملتان حاليتان من الضمير المستقر في الظرف في قوله: { في ضلال مبين } أي: مستقرين في الضلال وهم في تينك الحالتين\n يقول الحقّ جلّ جلاله: { ذلك } المنعوت بتلك النعوت الجليلة، والأوصاف الحميدة هو { عيسى ابنُ مريم } ، لا ما يصفه النصارى به من وصف الألوهية، فهو تكذيب لهم على الوجه الأبلغ والمنهاج البرهاني، حيث جعله موصوفًا بأضداد ما يصفونه به\n وأتى بإشارة البعيد للدلالة على علو رُتبته وبُعد منزلته، وامتيازه بتلك المناقب الحميدة عن غيره، ونزوله منزلة المشاهد المحسوس\n هذا { قولُ الحق } ، أو قال عيسى { قولَ الحق } الذي لا ريب فيه، وأنه عبد الله ورسوله، { الذي فيه يمترون } أي: يشكون أو يتنازعون، فيقول اليهود: ساحر كذاب، ويقول النصارى: إله، أو ابن الله\n { ما كان لله أن يتخذ من ولد } أي: ما صح، أو ما استقام له أن يتخذ ولدًا، { سبحانه } وتعالى عما يقولون علوًا كبيرًا، فهو تنزيه عما بهتوه، ونطقوا به من البهتان، وكيف يصح أن يتخذ الله ولدًا، وهو يحتاج إلى أسباب ومعالجة، وأمره تعالى أسرع من لحظ العيون، { إِذا قضى أمرًا فإِنما يقول له كن فيكون }\n ثم قال لهم عيسى عليه السلام: { وإنَّ الله ربي وربكم فاعبدوه } ، فهو من تمام ما نطق به في المهد، وما بينهما اعتراض، للمبادرة للرد على من غلط فيه، أي: فإني عبد، وإن الله ربي وربكم فاعبدوه وحده ولا تُشركوا معه غيره، { هذا } الذي ذكرت لكم الذي ذكرت لكم من التوحيد { صراط مستقيم } لا يضل سالكه ولا يزيغ متبعه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:51",
      "similarity": 1.0
    },
    {
      "verse": "43:64",
      "similarity": 1.0
    },
    {
      "verse": "36:61",
      "similarity": 0.9416869671346223
    },
    {
      "verse": "15:41",
      "similarity": 0.8654123494259738
    },
    {
      "verse": "36:4",
      "similarity": 0.8136500897022709
    }
  ]
}