{
  "chapter": "مريم",
  "text": "ما كان لله ان يتخذ من ولد سبحنه اذا قضى امرا فانما يقول له كن فيكون",
  "translations": [
    {
      "translation": "It is not fitting for Allah to have a son. Glory be to Him! When He decides on something, He just says to it, 'Be!' and it is.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not behove God to have a son. Too immaculate is He! When He decrees a thing He has only to say: \"Be\", and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not befit Allah to take for Himself a son. Glory be to Him! When He decrees a thing He only says: \"Be\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is too Exalted to have a son. When He decides to bring some thing into existence He needs only command it to exist and it comes into existence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not befit Allah to appoint someone as His son – Purity is to Him! When He ordains a matter, He just commands it, “Be” – and it thereupon happens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It befits not (the majesty of) Allah that He should beget a son. Glorified be He. When He decrees a thing, He only says to it: \"Be!\" -- and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It beseems not Allah that He should take to Himself a son, glory to be Him; when He has decreed a matter He only says to it \"Be,\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for God to take a son unto Him. Glory be to Him! When He decrees a thing, He but says to it 'Be,' and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It befitteth not (the Majesty of) Allah that He should take unto Himself a son. Glory be to Him! When He decreeth a thing, He saith unto it only: Be! and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it does not befit the majesty of God that He should beget a son. Glory be to Him! He is far above that: when He decrees something, He says only, \"Be!\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is not one to take to Himself a son. Hallowed be He! whensoever He decreeth an affair he only Saith to it: be, and it becometh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for Allah to take a son. Immaculate is He! When He decides on a matter, He just says to it, ‘Be!’ and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not befitting to (the majesty of) Allah that He should beget a son. Glory be to Him! when He determines a matter, He only says to it, \"Be\", and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It befits not (the Majesty of) Allah that He should beget a son [this refers to the slander of Christians against Allah, by saying that 'Iesa (Jesus) is the son of Allah]. Glorified (and Exalted be He above all that they associate with Him). When He decrees a thing, He only says to it, \"Be!\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for Allah to take a son! Exaltations to Him! When He decrees a thing He only says: 'Be' and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for God to have a child—glory be to Him. To have anything done, He says to it, “Be,” and it becomes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not [befitting] for Allah to take a son; exalted is He! When He decrees an affair, He only says to it, \"Be,\" and it is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:35] It is not [befitting] for God to take to Himself a son. Glory be to Him — in affirmation of His being transcendent above [doing] such a thing. When He decrees a thing, that is, [when] He will for it to happen, He only says to it, ‘Be!’, and it is (read fa-yakūnu because of an implied [pronoun] huwa [sc. fa-huwa yakūnu]; or read fa-yakūna because of an implied an [sc. an yakūna]). An example of this is His creating Jesus without [his having had] a father.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It befitteth not (the Majesty of) Allah that He should take unto Himself a son Glory be to Him!) Allah absolves Himself from taking a son or partner. (When He decreeth a thing) when He wants to create a son without a father, (He saith unto it only: Be! and it is) a son without a father, just like Jesus.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { مَا كَانَ للَّهِ } أي: ما صحَّ وجاز بعلو شأنه سبحانه { أَن يَتَّخِذَ مِن وَلَدٍ سُبْحَانَهُ } أي: هو منزهُ في ذاته عن الأهل والولد\n لأنه لا يليق بذاته المعاونةُ والاستظهارُ بهما تعالى عن ذلك\n بل من حكمه وشأنه أنه { إِذَا قَضَىٰ } وأراد { أَمْراً } من الأمور الكائنة في عالم الأمر { فَإِنَّمَا يَقُولُ لَهُ } حين تعلق إرادته بتكوينه: { كُن } بلا ترتيبٍ في السمع بتقديم الكاف على النون\n\n\nإذ كلامه القائم بنفسه سبحانه نفسيُ ذاتيُ لا يُتوهم فيه الحروفُ والأصوات ومقاطعها\n ليتصور الترتيب بالتقدم والتأخر كما يُتوهم في الألفاظ الصادرة عنا\n بل يخلق سبحانه بقدرته الكاملة في لساننا لفظاً معجزاً لا من جنس ألفاظنا ليسع لنا التعبير عن كلامه وقتَ إرادة نفودِ قضائه\n وهو لفظه: \" كن \" وعن حصول المقضي بلفظ: { فَيَكُونُ } [مريم: 35] أيضاً بلا تراخٍ وتعقيبٍ يُفهم من الفاء\n ومَن كان شأنُه هذامن أين يكون له حاجة إلى الأهل والولد وإحبالُ المرأة ووقاعها؟! تعالى عما يقولون علواً كبيراً\n\n\nبل هو سبحانه واحدُ أحدُ فردُ صمدُ لم يتخذ صاحبةً ولا ولداً هذا\n أي: من قوله: { ذٰلِكَ عِيسَى ٱبْنُ مَرْيَمَ } [مريم: 34] إلى هنا كلامُ وقع في البين\n\nثم قال سبحانه حكايةً عن عيسى\n ومن جملة ما أوحى إليه: { وَ } بعدما بالغ عيسى في بيان طهارته وعصمة أمه\n وتكلم في غير أوان التكلم بكلام عجيبٍ غريبٍ\n عَلِم بنور النبوة ونجابةٍ الفطرة أن بعضهم قد يقولون في شأنه وشأن أمه ويتخذونه إلهاً\n أورد كلاماً نافياً لظنونهم وجهالاتهم دافعاً لغلوهم واتخاذهم\n\n\nفقال: { إِنَّ ٱللَّهَ } الذي أوجدني وأبدعني بلا أبٍ هو { رَبِّي } الذي ربَّاني وأمي بأنواع الكرامة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما كان لله أن يتخذ من ولد } أي: ما صح\n أو ما استقام له أن يتخذ ولدًا\n { سبحانه } وتعالى عما يقولون علوًا كبيرًا\n فهو تنزيه عما بهتوه\n ونطقوا به من البهتان\n وكيف يصح أن يتخذ الله ولدًا\n وهو يحتاج إلى أسباب ومعالجة\n وأمره تعالى أسرع من لحظ العيون\n { إِذا قضى أمرًا فإِنما يقول له كن فيكون }\n ثم قال لهم عيسى عليه السلام: { وإنَّ الله ربي وربكم فاعبدوه } \n فهو من تمام ما نطق به في المهد\n وما بينهما اعتراض\n للمبادرة للرد على من غلط فيه\n أي: فإني عبد\n وإن الله ربي وربكم فاعبدوه وحده ولا تُشركوا معه غيره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:68",
      "similarity": 0.5517644637097627
    },
    {
      "verse": "21:26",
      "similarity": 0.46494147693178806
    },
    {
      "verse": "3:47",
      "similarity": 0.4594281433872139
    },
    {
      "verse": "19:88",
      "similarity": 0.4414671530572193
    },
    {
      "verse": "18:4",
      "similarity": 0.4197709333651273
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/19:35.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/19:35.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}