{
  "chapter": "مريم",
  "text": "قال انى عبد الله ءاتىنى الكتب وجعلنى نبيا",
  "translations": [
    {
      "translation": "I am a servant of God,\" he answered. \"He has given me a Book and made me a prophet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The child cried out: \"Verily I am Allah's servant. He has granted me the Book and has made me a Prophet\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"I am the servant of God. He has given me the Book and has appointed me to be a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The child proclaimed, “I am Allah’s bondman; He has given me the Book and made me a Herald of the Hidden (a Prophet).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Verily, I am a servant of Allah, He has given me the Scripture and made me a Prophet;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Surely I am a servant of Allah; He has given me the Book and made me a prophet;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Lo, I am God's servant; God has given me the Book, and made me a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He spake: Lo! I am the slave of Allah. He hath given me the Scripture and hath appointed me a Prophet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[But] he said, \"I am God's servant. He has given me the Book and made me a prophet;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He Said: verily I am a bondman of Allah; He hath vouchsafed me the Book and made me a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Indeed I am a servant of Allah! He has given me the Book and made me a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I am indeed a servant of Allah: He hath given me revelation and made me a prophet;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He ['Iesa (Jesus)] said: Verily! I am a slave of Allah, He has given me the Scripture and made me a Prophet;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (the baby) said: 'I am the worshiper of Allah. Allah has given me the Book and made me a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I am the servant of God. He has given me the Scripture, and made me a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Jesus] said, \"Indeed, I am the servant of Allah. He has given me the Scripture and made me a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:30] He said, ‘Lo! I am God’s servant. He has given me the Scripture, namely, the Gospel, and made me a prophet.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Jesus then spoke to them, (He spake: Lo! I am the slave of Allah. He hath given me the Scripture) He taught me the Torah and the Gospel while still in my mother's womb (and hath appointed me a Prophet) after my mother delivered me, 328\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}