{
  "chapter": "مريم",
  "text": "فلما اعتزلهم وما يعبدون من دون الله وهبنا له اسحق ويعقوب وكلا جعلنا نبيا",
  "translations": [
    {
      "translation": "When he had separated himself from them, and what they worshipped besides Allah, We gave him Ishaq and Ya'qub, making each of them a Prophet.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, when he left them and the (idols) they worshipped, We bestowed on him Isaac and Jacob, and made each of them a prophet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Abraham dissociated himself from his people and the deities they worshipped instead of Allah, and We bestowed upon him Isaac and Jacob and made each of them a Prophet;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When (Abraham) rejected his people and what they worshipped instead of God, We gave him Isaac and Jacob and made both of them Prophets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he had separated from them and what they worshipped other than Allah, We bestowed him Ishaq and Yaqub; and We made each of them a Herald of the Hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he had turned away from them and from those whom they worshipped besides Allah, We gave him Ishaq and Ya`qub, and each one of them We made a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he withdrew from them and what they worshipped besides Allah, We gave to him Ishaq and Yaqoub, and each one of them We made a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when he went apart from them and that they were serving, apart from God, We gave him Isaac and Jacob, and each We made a Prophet;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when he had withdrawn from them and that which they were worshipping beside Allah, We gave him Isaac and Jacob. Each of them We made a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he had separated himself from them and from what they worshipped besides God, We bestowed on him Isaac and Jacob, and We made each of them a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he had renounced them and that which they worshipped beside Allah, We best owed on him Ishaq and Yaqub and each one We made a prophet!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he had left them and what they worshipped besides Allah, We gave him Isaac and Jacob, and each We made a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he had turned away from them and from those whom they worshipped besides Allah, We bestowed on him Isaac and Jacob, and each one of them We made a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he had turned away from them and from those whom they worshipped besides Allah, We gave him Ishaque (Isaac) and Ya'qub (Jacob), and each one of them We made a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he turned away from them and those they worshipped, other than Allah, We gave him Isaac and Jacob. Each of them We made a Prophet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he withdrew from them, and from what they worship besides God, We granted him Isaac and Jacob. And each We made a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he had left them and those they worshipped other than Allah, We gave him Isaac and Jacob, and each [of them] We made a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:49] And so after he had shunned them and that which they worshipped besides God, by having set off to the Holy Land, We gave him, two sons for him to find solace in, Isaac and Jacob, and each, of the two, We made a prophet.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "330 (So, when he had withdrawn from them) when he left them (and that which they were worshipping beside Allah) of idols. (We gave him Isaac) the cheerful (and Jacob) the son of his son. (Each of them) Abraham, Isaac and Jacob (We made a prophet) We favoured them with prophethood and Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا ٱعْتَزَلَهُمْ } وبَعُدَ عنهم، واختار الغربةَ والفرارَ من بينهم { وَ } تركَ عبادة { مَا يَعْبُدُونَ مِن دُونِ ٱللَّهِ } من الأوثان والأصنام { وَهَبْنَا لَهُ } من مقام جودنا وفضلنا { إِسْحَاقَ وَيَعْقُوبَ } ليؤانس بهم، ويدفع كربة الغربة بصحبتهما { وَ } لنجابة طينتهما وكرامة فطرتهما { كُلاًّ } منهما { جَعَلْنَا نَبِيّاً } [مريم: 49] مثل أبيهما مهبطاً للوحي والإلهام مثله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وكُلاًّ }: مفعول أول لجعلنا، و { عَلِيًّا }: حال من اللسان\n يقول الحقّ جلّ جلاله: { فلما اعتزلهم } أي: اعتزل إبراهيمُ قومَه { وما يعبدون من دون الله } بأن خرج من \" كوثى \" بأرض العراق، مهاجرًا إلى الشام واستقر بها، { وهبنا له إسحاق } ولده { ويعقوبَ } حفيده، بعد أن وهب له إسماعيل من أمَته هاجر، التي وُهبت لزوجه سارة، ثم وهبتها له، فوُلد له منها إسماعيل، ولما حملت هاجر بإسماعيل غارت منها سارة، فخرج بها مع ولدها إسماعيل حتى أنزلهما مكة، فكان سبب عمارتها\n ثم حملت سارة بإسحاق، ثم نشأ عنه يعقوب، وإنما خصهما بالذكر لأنهما كانا معه في بلده، وإسحاق كان متصِلاً به يسعى معه في مآربه، فكانت النعمة بهما أعظم\n ولعل ترتيب هبتهما على اعتزاله ها هنا لبيان كمال عِظم النعمة التي أعطاها الله تعالى إياهُ، في مقابلة من اعتزلهم من الأهل والأقارب، فإنهما شجرة الأنبياء، لهما أولاد وأحفاد، لكل واحد منهم شأن خطير وعدد كثير\n { وكُلاًّ جعلنا نبيًّا } أي: وكل واحد منهما أو منهم جعلناه نبيًا ورسولاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:27",
      "similarity": 0.6624048060791581
    },
    {
      "verse": "38:45",
      "similarity": 0.5435914999690681
    },
    {
      "verse": "44:21",
      "similarity": 0.49388460766180925
    },
    {
      "verse": "26:212",
      "similarity": 0.48622006074495067
    },
    {
      "verse": "12:38",
      "similarity": 0.43670195089283353
    }
  ]
}