{
  "chapter": "مريم",
  "text": "اذ قال لابيه يابت لم تعبد ما لا يسمع ولا يبصر ولا يغنى عنك شيـا",
  "translations": [
    {
      "translation": "Remember, when he said to his father: \"O my father, why do you worship that which can neither hear nor see nor even profit you the least?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remind people) when he said to his father: \"Father! Why do you worship that which neither sees nor hears, and which can be of no avail to you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who asked his father, \"Father, why do you worship something that can neither hear nor see nor help you at all?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father,* “O my father – why do you worship one which neither hears nor sees, and cannot benefit you in any way?” (* His uncle Azar.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father: \"O my father! Why do you worship that which hears not, sees not and cannot avail you in anything\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father; O my father! why do you worship what neither hears nor sees, nor does it avail you in the least:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father, 'Father, why worshippest thou that which neither hears nor sees, nor avails thee anything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said unto his father: O my father! Why worshippest thou that which heareth not nor seeth, nor can in aught avail thee?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said to his father, \"Why do you worship something that can neither hear nor see nor benefit you in any way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time he said unto his father:, O my father! wherefore worshippest thou that which heareth not and seeth not, nor availeth thee at all?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father, ‘Father! Why do you worship that which neither hears nor sees, and is of no avail to you in any way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, he said to his father: \"O my father! why worship that which heareth not and seeth not, and can profit thee nothing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father: \"O my father! Why do you worship that which hears not, sees not and cannot avail you in anything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said to his father: 'O father, why worship that which can neither see nor hear, nor helps you in anything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said to his father, “O my father, why do you worship what can neither hear, nor see, nor benefit you in any way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Mention] when he said to his father, \"O my father, why do you worship that which does not hear and does not see and will not benefit you at all?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:42] When he said to his father, Āzar, ‘O my father! (the [final] tā’ here [of abati] has replaced the [possessive] yā’ of [genitive] annexation [sc. of yā abī]; the two, however, are never used together) — he [Abraham’s father] used to worship idols. Why do you worship that which neither hears nor sees, and is of no avail to you, suffices you [not], in any way? whether in [terms of] benefit or harm.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When he said unto his father) Azar: (0 my father! Why worshippest thou) beside Allah (that which heareth not) when called upon (nor seeth) when you worship it, (nor can in aught avail thee) from Allah's chastisement?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لم تعبد ما لا يسمع ولا يبصر } مما سوى الله من الأكوان التي تطلبها وتنسب التأثير إليها { ولا يغني عنك شيئاً } في الحقيقة لعدم تأثيره\n { قد جاءني من العلم } أي: التوحيد الذاتي { سلام عليك } أي: جرّد الله ذاتك عن المواد التي احتجبت بها { سأستغفر لك ربّي } سأطلب منه ستر ذاتك بنوره ومحو غشاوات صفاتك بصفاته، ودناءة هيئات نفسك بأفعاله إن أمكن { إنه كان مخلصاً } بالكسر، أي مجرّداً ذاته وعلمه في السلوك لوجه الله لم يلتفت إلى ما سواه من وجهة حتى صفاته تعالى، بل نفاها عن ذاته، وهو { مَا زَاغَ ٱلْبَصَرُ وَمَا طَغَىٰ } بقوله:\n\n[الأعراف، الآية:143]\n ومخلصاً بالفتح، أي: أخلصه الله عن أنانيته وأفنى البقية منه فخلص من الطغيان المذكور بالتجلي الذاتي التام، واستقام بتمكين الله إياه كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر أوان انكشافه وإيقاظه من منام الغفلة التي هي عبادة الأوثان والأصنام وقت: { إِذْ قَالَ لأَبِيهِ } مستنكراً عليه متعجباً من أمره، منادياً له رجاء أن يتفطن وتنبه بما تنبه به هو: { يٰأَبَتِ لِمَ تَعْبُدُ } وتطيع { مَا لاَ يَسْمَعُ } أي: شيئاً لا يقدر على السمع { وَلاَ يُبْصِرُ } أي: لا يقدر على الإبصار، والمعبودُ لا بدَّ أن يَرى ويَسمع أحوال عباده وحاجاتهم ومناجاتهم، { وَ } إذا لم يسمع ولم يبصر { لاَ يُغْنِي } ويدفع { عَنكَ شَيْئاً } [مريم: 42] من مكروهات ولا يعينك، فلا يصلح إذاً للألوهية والربوبية، فلِمَ عبدت وأطعتَ له مع أنه نحتَّه بيدك وأظهرتَ أنت هيكله وشكله، والعجب منك كل العجب أنه مصنوعك أخذته إلهاً صانعاً معبوداً مستحقاً للعبادة، مع أنك من ذوي الرشل والعلم، وهو جمادُ لا شعور له أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِذْ قال لأبيه } آزر، متلطفًا في الدعوة مستميلاً له: { يا أبتِ } ، التاء بدل من ياء الإضافة، أي: يا أبي، { لِمَ تعبدُ ما لا يسمع } ثناءك عليه حين تعبده، ولا جُؤَارك إليه حين تدعوه، { ولا يُبْصِرُ } خضوعك وخشوعك بين يديه، أو: لا يسمع ولا يبصر شيئًا من المسموعات والمبصرات، فيدخل في ذلك ما ذكر دخولاً أوليًا، { ولا يُغْنِي عنك شيئًا } أي: لا يقدر أن ينفعك بشيء في طلب نفع أو دفع ضرر\n انظر لقد سلك عليه السلام في دعوته وموعظته أحسن منهاج وأقوم سبيل، واحتج عليه بأبدع احتجاج، بحسن أدب، وخلق جميل، لكن وقع ذلك لسائرٍ ركب متن المكابرة والعناد، وانتكب بالكلية عن محجة الصواب والرشاد، أي: فإنَّ من كان بهذه النقائص يأبى مَن له عقل التمييز من الركون إليه، فضلاً عن عبادته التي هي أقصى غاية التعظيم، فإنها لا تحِقُ إلا لمن له الاستغناء التام والإنعام العام، الخالق الرازق، المحيي المميت، المثيب المعاقب، والشيء لو كان مميزًا سميعًا بصيرًا قادرًا على النفع والضر، لكنه ممكن، لاستنكف العقل السليم عن عبادته، فما ظنك بجماد مصنوع من حجر أو شجر، ليس له من أوصاف الأحياء عين ولا أثر\n ثم دعاء إلى اتباعه لأنه على المنهاج القويم، مُصدّرًا للدعوة بما مرَّ من الاستعطاف والاستمالة، حيث قال: { يا أبتِ إِني قد جاءني من العلم ما لم يأتِكَ } ، لم يَسِمْ أباه بالجهل المفرط، وإن كان في أقصاه، ولا نفسه بالعلم الفائق، وإن كان في أعلاه، بل أبرز نفسه في صورة رفيق له، أعرفَ بأحوال ما سلكاه من الطريق، فاستماله برفق، حيث قال: { فاتّبِعْنِي أَهدِكَ صراطًا سوِيًّا } أي: مستقيمًا موصلاً إلى أسمى المطالب، منجيًا من الضلال المؤدي إلى مهاوي الردى والمعاطب\n\n",
      "translations": []
    }
  ]
}