{
  "chapter": "مريم",
  "text": "واعتزلكم وما تدعون من دون الله وادعوا۟ ربى عسى الا اكون بدعاء ربى شقيا",
  "translations": [
    {
      "translation": "I will separate myself from you and all you call upon besides Allah and I will call upon my Lord. It may well be that, in calling on my Lord, I will not be disappointed.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will leave you and those you invoke apart from God, and pray to my Lord. Haply in praying to my Lord I will not be deprived.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall withdraw from you and all that you call upon beside Allah. I shall only call upon my Lord. I trust the prayer to my Lord will not go unanswered.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall stay away from you and what you worship instead of God. I worship my Lord and hope that my prayers will not be ignored.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I shall remain separated from you and all that you worship other than Allah and shall worship my Lord; possibly, by worshipping my Lord, I will not be amongst the unfortunate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I shall turn away from you and from those whom you invoke besides Allah. And I shall call upon my Lord, and I certainly hope that I shall not be unblessed in my invocation to my Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I will withdraw from you and what you call on besides Allah, and I will call upon my Lord; may be I shall not remain unblessed in calling upon my Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now I will go apart from you and that you call upon, apart from God; I will call upon my Lord, and haply I shall not be, in calling upon my Lord, unprosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall withdraw from you and that unto which ye pray beside Allah, and I shall pray unto my Lord. It may be that, in prayer unto my Lord, I shall not be unblest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will separate myself from you and from whatever you call upon besides God, and I will pray only to my Lord. It may well be that, in calling on my Lord, I will not be disappointed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I renounce you and that unto which ye call beside Allah; and I shall call unto my Lord; belike in calling unto my Lord I shall not be unblest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I dissociate myself from you and whatever you invoke besides Allah. I will supplicate my Lord. Hopefully, I will not be disappointed in supplicating my Lord.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I will turn away from you (all) and from those whom ye invoke besides Allah: I will call on my Lord: perhaps, by my prayer to my Lord, I shall be not unblest.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I shall turn away from you and from those whom you invoke besides Allah. And I shall call on my Lord; and I hope that I shall not be unblest in my invocation to my Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now I will go away from you and that you call upon, other than Allah. I will call on my Lord. Perhaps I shall not be unblessed in calling my Lord'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I will withdraw from you, and from what you pray to instead of God. And I will pray to my Lord, and I hope I will not be disappointed in my prayer to my Lord.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I will leave you and those you invoke other than Allah and will invoke my Lord. I expect that I will not be in invocation to my Lord unhappy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:48] And I shall shun you and that which you call upon, [that which] you worship, besides God. I will supplicate, I will worship, my Lord — hopefully in calling upon, in worshipping, my Lord I shall not be wretched’, as you have become wretched by your worship of idols.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(I shall withdraw from you) I will leave you (and that unto which ye pray beside Allah) of idols, (and I shall pray unto my Lord) I shall worship my Lord. (It may be that) 'may be' in connection with Allah denotes a requisite, (in prayer unto my Lord) in worship of my Lord, (I shall not be unblest) I shall not be rejected.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولم ينفع لك تذكيري ووعظي { أَعْتَزِلُكُمْ } وأترككم على حالكم { وَ } أترك أيضاً { مَا تَدْعُونَ } وتعبدون { مِن دُونِ ٱللَّهِ } وأتبرأ عنهم { وَأَدْعُو رَبِّي } الذي ربَّاني بفضله بالإيمان\n وأوصلني إلى قضاء التوحيد والعرفان\n وأعبد إياه وأطبعه في جميع أوقاتي وحالاتي { عَسَىۤ أَلاَّ أَكُونَ بِدُعَآءِ رَبِّي } والتوجه نحو والتحنن إليه { شَقِيّاً } [مريم: 48] خائباً خاسراً عن رحمته\n ذا شقاوةٍ جالبةٍ لسخط الله وغضبه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأعتزلُكم } أي: أتباعد عنك وعن قومك\n { وما تَدْعُونَ من دونِ الله } بالمهاجرة بديني\n حيث لم تؤثر فيكم نصائحي\n { وأدعو ربي }: أعبده وحده\n أو أدعوه بطلب المغفرة لك - أي قبل النهي - أو: أدعوه بطلب الولد\n كقوله:\n[الصَّافات: 100]\n { عسى ألا أكون بدعاءِ ربي شقيًّا } أي: عسى ألا أشقى بعبادته\n أو: لا أخيب في طلبه\n كما شقيتم أنتم في عبادة آلهتكم وخبتم\n ففيه تعريض بهم\n وفي تصدير الكلام بعسى من إظهار التواضع وحسن الأدب\n والتنبيه على أن الإجابة من طريق الفضل والكرم\n لا من طريق الوجوب\n وأن العبرة بالخاتمة والسعادة\n وفي ذلك من الغيوب المختصة بالعليم الخبير ما لا يخفى\n\nالإشارة: انظر كيف رفض آزرُ مَن رغب عن آلهته\n وإن كان أقرب الناس إليه\n فكيف بك أيها المؤمن ألاَّ ترفض من يرغب عن إلهك ويعبد معه غيره\n أو يجحد نبيه ورسوله\n بل الواجب عليك أن ترفض كل ما يشغلك عنه\n غيرةً منك على محبوبك\n وإذا نظرت بعين الحقيقة لم تجد الغيرة إلا على الحق\n إذ ليس في الوجود إلا الحق\n وكل ما سواه باطل على التحقيق\n فمن اعتزل كل ما سوى الله\n وأفرد وجهته إلى مولاه\n لم يَشْق في مَطلبه ومسْعاه\n بل يطلعه الله على أسرار ذاته\n وأنوار صفاته\n حتى لا يرى في الوجود إلا الواحد الأحد الفرد الصمد\n وبالله التوفيق\n ثمَّ ذكر نتيجة الانفراد عمن يصد عن الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:21",
      "similarity": 0.5830483346053492
    },
    {
      "verse": "26:212",
      "similarity": 0.5756767515705584
    },
    {
      "verse": "20:2",
      "similarity": 0.49386775338077593
    },
    {
      "verse": "91:12",
      "similarity": 0.48988667911758127
    },
    {
      "verse": "87:11",
      "similarity": 0.472256718729657
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/19:48.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/19:48.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/19:48.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}