{
  "chapter": "مريم",
  "text": "قال رب انى وهن العظم منى واشتعل الراس شيبا ولم اكنۢ بدعائك رب شقيا",
  "translations": [
    {
      "translation": "and said, 'My Lord, my bones have lost their strength and my head is crowned with white, but in calling on You, My Lord, I have never been disappointed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said: \"O my Lord, my bones decay, my head is white and hoary, yet in calling You, O Lord, I have never been deprived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Lord! My bones have grown feeble and my head is glistening with age; yet, never have my prayers to You, my Lord, been unfruitful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and said, \"My Lord, my bones have become feeble and my hair has turned white with age. Yet I have never been deprived in receiving from You the answer to my prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He submitted, “O my Lord – my bones have become weak and old age shines forth from my head, and O my Lord, I have never been disappointed in my prayer to you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord! Indeed my bones have grown feeble, and gray hair has Ashta`al on my head, and I have never been unblessed in my invocation to You, O my Lord!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! surely my bones are weakened and my head flares with hoariness, and, my Lord! I have never been unsuccessful in my prayer to Thee:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying, 'O my Lord, behold the bones within me are feeble and my head is all aflame with hoariness. And in calling on Thee, my Lord, I have never been hitherto unprosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: My Lord! Lo! the bones of me wax feeble and my head is shining with grey hair, and I have never been unblest in prayer to Thee, my Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, my bones have weakened and my head has turned hoary with age, but never, Lord, have I been disappointed in my prayer to you:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my Lord! verily the bones of me have waxen feeble, and the head is glistening with hoariness, and have not yet been in my prayer to thee, my Lord, unblest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! Indeed my bones have become feeble, and my head has turned white with age, yet never have I, my Lord, been disappointed in supplicating You!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praying: \"O my Lord! infirm indeed are my bones, and the hair of my head doth glisten with grey: but never am I unblest, O my Lord, in my prayer to Thee!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: \"My Lord! Indeed my bones have grown feeble, and grey hair has spread on my head, And I have never been unblest in my invocation to You, O my Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying: 'O my Lord, my bones are enfeebled, and my head glows silver with age. Yet, never Lord, have I been unblessed in prayer to You.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, my bones have become feeble, and my hair is aflame with gray, and never, Lord, have I been disappointed in my prayer to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, indeed my bones have weakened, and my head has filled with white, and never have I been in my supplication to You, my Lord, unhappy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:4] He said, ‘My Lord, truly the bones, all [the bones], within me have become feeble, weak, and my head is alight with grey hair (shayban, a specification derived from the subject of the verb in other words, hoariness has spread throughout his hairs just as a spark of fire spreads through firewood) and I wish to supplicate to you, and I have never been in my supplications to You, my Lord, unsuccessful, that is, [I have never been] disappointed, in the past, so do not disappoint me in what follows.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Saying: My Lord!) my Lord! (Lo! the bones of me wax feeble) my body has become weak (and my head is shining with grey hair, and I have never been unblest in prayer to You, my Lord) he said: my prayers were never rejected by You, my Lord.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَمْ أَكُنْ بِدُعَآئِكَ رَبِّ شَقِيّاً } معناه أجبتَني حين دعوتُكَ ولم تخيبني\n\n",
      "translations": [
        {
          "translation": "\n\n\"I was not ungrateful to your Lord when I prayed to you, and you answered me.\" This means that you responded to me when I called on you, and you did not disappoint me.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nفنادى زكريا عليه السلام ربّه ليهب له وليّاً يقوم مقامه في أمر الدين\n وتوسل إليه بأمرين\n واعتذر إليه معتلاً بأمرين\n توسل بالضعف والشيخوخة والوهن والعجز عن القيام بأمر الدين في قوله: { وَهن العظم مني واشتعل الرأس شيباً } فأجابه باسمه الكافي فكفاه ضعفه وأعطاه القوّة وأيده بالولد ثم بعنايته به قديماً بقوله: { ولم أكن بدعائك ربِّ شقيّاً } فأجابه باسمه الهادي وهداه إلى مطلوبه بالبشارة والوعد\n لأن العناية المقتضية للسعادة المستلزمة لسلب الشقاوة\n كما أشار إليها\n يلازمها عبارة عن علمه تعالى في الأزل بعين في العدم وتقتضي باستعدادها سعادة تناسبها وهو عين إرادته تعالى ذلك الكمال لها عند وجودها فلا بد من هداية لها إليه\n والهداية إنما تتم بالتوفيق\n وهو ترتيب الأسباب الموافقة لذلك المطلوب المؤدّية إليه\n ولم يجدها موافقة ووجد خلافها فخاف واعتذر إليه بالخوف من الموالي لعدم صلاحيتهم لذلك\n فأجابه باسمه الواقي\n فوقاه شرّهم\n وبامتناع وجود الولي من نسله لعدم الأسباب بقوله: { وكانت امرأتي عاقراً } فأجابه باسمه العليم لأنه علم عدم الأسباب الذي تعلل به محتجاً بها عن المسبب وعلم وجوده مع عدمها وما علمه لا بدّ من كونه\n كما قالت الملائكة لامرأة إبراهيم عليه السلام:\nولما بشره بالولد\n وهداه إلى مقتضى العلم\n تعجب منه لضراوته في عالم الأسباب بالحكمة وكرر التعلل بعدم الأسباب بقوله: { أنى يكون لي غلام } الخ\n لأنه كان يطلب ولداً حقيقياً يلي أمره ويحذو حذوه ويسلك طريقه في القيام بأمر الدين وإن لم يكن من نسله لعدم أهلية مواليه لذلك\n فكرر البشارة وهداه إلى سهولة ذلك في قدرته\n فالتمس علامة تدل عليه\n فهداه إليها وأنجز وعده باسمه الصادق فرحمه بهبة يحيى له\n فاقتضت الأحوال الأربعة مع حال الوعد والبشارة إجابته بالرحمة عليه بالأسماء الخمسة\n فعلى هذا يكون كـ إشارة إلى الكافي الذي اقتضاه حال ضعفه وشيخوخته وعجزه و هـ إشارة إلى الهادي الذي اقتضاه عنايته به وإرادة مطلوبه له و ي إشارة إلى الواقي الذي اقتضاه حال خوفه من الموالي و ع إشارة إلى العالم الذي اقتضاه إظهاره لعدم الأسباب و ص إشارة إلى الصادق الذي اقتضاه الوعد\n ومجموع الأسماء الخمسة هو: الرحيم بهبة الولد\n وإفاضة مطلوبه في هذه الأحوال\n فذكر هذه الحروف وتعدادها إشارة إلى أن ظهور هذه الصفات التي حصل بها هذه الأسماء هو ظهور رحمة عبده زكريا وقت ندائه وذكرها ذكر تلك الرحمة التي هي وجود يحيى عليه السلام\n ولهذا قال ابن عباس رضي الله عنهما: كـ عبارة عن الكافي و هـ عن الهادي و ي عن الواقي و ع عن العالم و ص عن الصادق والله أعلم\n\nوالتطبيق أن يقال: نادى زكريا الروح في مقام استعداد العقل الهيولاني نداء خفيّاً\n واشتكى ضعفه\n وتوسل بعنايته\n واشتكى خوف موالي القوى النفسانية وعقر امرأة النفس بولد القلب { فهبْ لي من لدنك وليّاً يرثني ويرث من آل يعقوب } العقل الفعّال { واجعله ربّ رضياً } موصوفاً بالكمالات المرضية { نُبَشّرك بغلام } القلب { اسمه يحيى } لحياته أبداً { ربّ اجعل لي آية } أتوصل بها إليه { آيتك ألا تُكَلم } ناس الحواس بالشواغل الحسيّة والمخالطة بالأمور الطبيعية { فأوحى إليهم أن سبّحوا } أي كونوا على عبادتكم المخصوصة بكل واحد منكم بالرياضة وترك الفضول دائماً\n { يا يحيى } القلب { خذ } كتاب العلم\n المسمى بالعقل الفرقاني { وآتيناه الحكم } أي: الحكمة { صبيّاً } قريب العهد بالولادة المعنوية { وحناناً من لدنا } أي: رحمة بكمال تجليات الصفات { وزكاة } أي: تقدّساً وطهارة بالتجرّد { وكان تقيّاً } مجتنباً صفات النفس { وبرّاً بوالديه } الروح والنفس { وسلام عليه } أي: تنزّه وتقدّس عن ملابسة المواد { يوم وُلِدَ ويوم يموت } بالفناء في الوحدة { ويوم يُبْعث } بالبقاء بعد الفناء { حيّاً } بالله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأشرفت على الانهدام والانصرام { وَٱشْتَعَلَ ٱلرَّأْسُ شَيْباً } أي: اشتعل شبيب رأسي\n وذهب سواده\n وانقلب إلى البياض المشعر بالانقضاء والزوال\n مثل ابيضاض النباتات وقت الخريف { وَلَمْ أَكُنْ بِدُعَآئِكَ } أي: لم أكن في كل حالٍ بدعائي إياك { رَبِّ شَقِيّاً } [مريم: 4] خائباً خاسراً مردوداً\n بل عودتني بفضلك وجودك بالإجابة والإنجاح\n وهذا الدعاء وإن كان أبعدَ بحسب العادة من الإجابة إلاَّ أنه بالنسبة إلى قدرتك وجودك أقرب\n ويجنب حولك وقوتك أسهلُ وأيسرُ\n سيما ألهمتني به ووفقتني على إظهاره\n\n\n{ وَإِنِّي } يا ربّ { خِفْتُ ٱلْمَوَالِيَ } أي: ن أبناء أعمامي الذين يترصدون الولاية والحبورة { مِن وَرَآءِى } وبعد انقراضي وانقضائي أن يغيروها ويضيعوها\n ويحرفوا مَعَالم الدين وشعائر الإسلام بين المسلمين\n إذ لا يرجى منهم الرشد والصلاح\n والخير والفلاح\n وأنت أعلم بحالهم مني يا رب\n وليس لي ولد صالح يخلفني بعدي\n ولم يبقَ لي قوة الاستيلاد لهرمي وضعفي { وَكَانَتِ ٱمْرَأَتِي عَاقِراً } عقيماً أصلياً لم تلد قط\n فلا مرجع لي في أمري سوى بدائع صنعتك\n وغرائب قدرتك { فَهَبْ لِي } بمقتضى فضلك وجودك { مِن لَّدُنْكَ } لا على طريق العادة ومقتضى الأسباب الصوري ولداً { وَلِيّاً } [مريم: 5] يولي أمر دين بني أمتي\n\n\nبحيث: { يَرِثُنِي } عني نبوتي وحبورتي وولايتي\n وجيمع ما أنزلت عليّ خاصةً من مقتضيات إحسانك إليّ وإنعامك عليَّ { وَيَرِثُ } أيضاً { مِنْ آلِ يَعْقُوبَ } ما بقي منهم من شعائر الدين ومعالم الهدى واليقين\n قيل: كان زكريا أخا يعقوب بن إسحاق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واشتعل الرأسُ شيبًا } أي: ابيضَّ شَمَطًا\n شبه عليه السلام الشيب من جهة البياض والإنارة بشواظ النار\n وانتشاره في الشعر وفُشوِّه فيه وأخذه منه كل مأخذ باشتعالها\n ثم أخرجه مخرج الاستعارة\n ثم أسند الاشتعال إلى محل الشعر ومنبته وهو الرأس\n وأخرجه مخرج التمييز\n ففيه من فنون البلاغة وكمال الجزالة ما لا يخفى\n حيث كان الأصل: واشتعل شيب رأسي\n فأسند الاشتعال إلى الرأس لإفادة شموله لكلها\n فإن وِزَانَهُ: اشتعل بيته نارًا بالنسبة إلى اشتعلت النار في بيته\n ولزيادة تقريره بالإجمال أولاً\n والتفصيل ثانيًا\n ولمزيد تفخيمه بالتكثير من جهة التنكير\n ثم قال: { ولم أكن بدعائك ربِّ شقيًّا } أي: لم أكن بدعائي إياك خائبًا في وقت من أوقات هذا العمر الطويل\n بل كنت كلما دعوتك استجبتَ لي\n توسل إلى الله بسابق حسن عوائده فيه\n لعله يشفع له ذلك بمثله\n إثر تمهيد ما يستدعي ويستجلب الرأفة من كبر السن وضعف الحال\n\nوالتعرض في الموضعين لوصف الربوبية لتحريك سلسلة الإجابة بالمبالغة في التضرع\n ولذلك قيل: من أراد أن يُستجاب له فليدعُ الله بما يناسبه من أسمائه وصفاته\n ثم قال: { وإِني خفتُ الموالي } أي: الأقارب\n وهم: بنو عمه\n وكانوا أشرار بني إسرائيل\n فخاف ألا يحسنوا خلافته في أمته\n فسأل الله تعالى ولدًا صالحًا يأمنه على أمته\n وقوله: { من ورائي }: متعلق بمحذوف\n أي: جور الموالي\n أو مما في الموالي من معنى الولاية\n أي: خفت أن يلوا الأمر من ورائي\n { وكانت امرأتي عاقرًا }: لا تلد من حين شبابها\n { فهبْ لي من لدنك } أي: أعطني من محض فضلك الواسع\n وقدرتك الباهرة\n بطريق الاختراع\n لا بواسطة الأسباب العادية لأن التعبير بِلَدُنّ يدل على شدة الاتصال والالتصاق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "73:17",
      "similarity": 0.3353501273496883
    },
    {
      "verse": "30:54",
      "similarity": 0.32877800135959323
    },
    {
      "verse": "3:139",
      "similarity": 0.1417885580774234
    },
    {
      "verse": "8:18",
      "similarity": 0.14043865561699556
    },
    {
      "verse": "4:104",
      "similarity": 0.13937322732206195
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}