{
  "chapter": "مريم",
  "text": "اذ قال لابيه يابت لم تعبد ما لا يسمع ولا يبصر ولا يغنى عنك شيـا",
  "translations": [
    {
      "translation": "Remember when he said to his father, 'Father, why do you worship what can neither hear nor see and is not of any use to you at all?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, when he said to his father: \"O my father, why do you worship that which can neither hear nor see nor even profit you the least?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remind people) when he said to his father: \"Father! Why do you worship that which neither sees nor hears, and which can be of no avail to you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who asked his father, \"Father, why do you worship something that can neither hear nor see nor help you at all?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father,* “O my father – why do you worship one which neither hears nor sees, and cannot benefit you in any way?” (* His uncle Azar.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father: \"O my father! Why do you worship that which hears not, sees not and cannot avail you in anything\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father; O my father! why do you worship what neither hears nor sees, nor does it avail you in the least:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father, 'Father, why worshippest thou that which neither hears nor sees, nor avails thee anything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said unto his father: O my father! Why worshippest thou that which heareth not nor seeth, nor can in aught avail thee?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said to his father, \"Why do you worship something that can neither hear nor see nor benefit you in any way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time he said unto his father:, O my father! wherefore worshippest thou that which heareth not and seeth not, nor availeth thee at all?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father, ‘Father! Why do you worship that which neither hears nor sees, and is of no avail to you in any way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, he said to his father: \"O my father! why worship that which heareth not and seeth not, and can profit thee nothing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father: \"O my father! Why do you worship that which hears not, sees not and cannot avail you in anything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said to his father: 'O father, why worship that which can neither see nor hear, nor helps you in anything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said to his father, “O my father, why do you worship what can neither hear, nor see, nor benefit you in any way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Mention] when he said to his father, \"O my father, why do you worship that which does not hear and does not see and will not benefit you at all?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:42] When he said to his father, Āzar, ‘O my father! (the [final] tā’ here [of abati] has replaced the [possessive] yā’ of [genitive] annexation [sc. of yā abī]; the two, however, are never used together) — he [Abraham’s father] used to worship idols. Why do you worship that which neither hears nor sees, and is of no avail to you, suffices you [not], in any way? whether in [terms of] benefit or harm.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِذْ قَالَ لِأَبِيهِ يَا أَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِي عَنْكَ شَيْئًا (42)وقوله : إذ قال لأبيه الخ بدل اشتمال من ( إبراهيم ). و ( إذ ) اسم زمان مجرد عن الظرفية لأن ( إذ ) ظرف متصرف على التحقيق . والمعنى : اذكر إبراهيم زمان قوله لأبيه فإن ذلك الوقت أجدر أوقات إبراهيم بأن يذكر .وأبو إبراهيم هو ( آزار ) تقدم ذكره في سورة الأنعام .وافتتح إبراهيم خطابه أباه بندائه مع أن الحضرة مغنية عن النداء قصداً لإحضار سمعه وذهنه لتلقي ما سيلقيه إليه .قال الجد الوزير رحمه الله فيما أملاه عليّ ذات ليلة من عام 1318 ه فقال :علم إبراهيم أن في طبع أهل الجهالة تحقيرهم للصغير كيفما بلغ حاله في الحذق وبخاصة الآباء مع أبنائهم ، فتوجه إلى أبيه بخطابه بوصف الأبوة إيماء إلى أنه مخلص له النصيحة ، وألقى إليه حجّة فساد عبادته في صورة الاستفهام عن سبب عبادته وعمله المخطىء ، منبّهاً على خطئه عندما يتأمل في عمله ، فإنه إن سمع ذلك وحاول بيان سبب عبادة أصنامه لم يجد لنفسه مقالاً ففطِن بخطل رأيه وسفاهة حلمه ، فإنه لو عبد حيّاً مميزاً لكانت له شبهة ما . وابتدأ بالحجة الراجعة إلى الحِسّ إذ قال له : لم تعبد ما لا يسمع ولا يبصر فذلك حجة محسوسة ، ثم أتبعها بقوله : ولا يغني عنك شيئاً ، ثم انتقل إلى دفع ما يخالج عقل أبيه من النفور عن تلقي الإرشاد من ابنه بقوله : { يا أبت إني قد جاءني من العلم ما لم يأتك فاتبعني أهدك صراطاً سوياً } \\[ مريم : 43 \\] ، فلما قضى حق ذلك انتقل إلى تنبيهه على أن ما هو فيه أثر من وساوس الشيطان ، ثم ألقى إليه حجة لائقة بالمتصلبين في الضلال بقوله : { يا أبت إني أخاف أن يمسك عذاب من الرحمان فتكون للشيطان وليا } \\[ مريم : 45 \\] ، أي إن الله أبلغ إليك الوعيد على لساني ، فإن كنتَ لا تجزم بذلك فافرض وقوعه فإنّ أصنامك لم تتوعدك على أن تفارق عبادتها . وهذا كما في الشعر المنسوب إلى علي رضي الله عنه :زعم المنجّم والطّبيب كلاهمالا تحشر الأجسام قلت : إليكماإن صحّ قولكما فلست بخاسرأو صح قولي فالخسار عليكماقال : وفي النداء بقوله : { يا أبت } أربع مرات تكريرٌ اقتضاه مقام استنزاله إلى قبول الموعظة لأنها مقام إطناب . ونَظَّرَ ذلك بتكرير لقمان قوله : { يا بني } \\[ لقمان : 13 16 \\] ثلاث مرات ، قال : بخلاف قول نوح لابنه : { يا بني اركب معنا } \\[ هود : 42 \\] مرة واحدة دون تكرير لأنّ ضيق المقام يقتضي الإيجاز وهذا من طرق الإعجاز» . انتهى كلامه بما يقارب لفظه .وأقول : الوجه ما بني عليه من أن الاستفهام مستعمل في حقيقته ، كما أشار إليه صاحب «الكشاف» ، ومكنى به عن نفي العلّة المسؤول عنها بقوله : { لم تعبد ، فهو كناية عن التعجيز عن إبداء المسؤول عنه ، فهو من التورية في معنيين يحتملهما الاستفهام .وأبت : أصله أبي ، حذفوا ياء المتكلم وعوضوا عنها تاء تعويضاً على غير قياس ، وهو خاص بلفظ الأب والأم في النداء خاصة ، ولعله صيغة باقية من العربية القديمة . ورأى سيبويه أن التاء تصير في الوقف هاء ، وخالفه الفراء فقال : ببقائها في الوقف . والتاء مكسورة في الغالب لأنها عوض عن الياء والياء بنت الكسرة ولما كسروها فتحوا الياء وبذلك قرأ الجمهور . وقرأ ابن عامر ، وأبو جعفر : ( يأبتَ ) بفتح التاء دون ألف بعدها ، بنَاء على أنهم يقولون ( يا أبتَا ) بألف بعد التاء لأن ياء المتكلم إذا نودي يجوز فتحها وإشباع فتحتها فقرأه على اعتبار حذف الألف تخفيفاً وبقاء الفتحة .\n\n",
      "translations": [
        {
          "translation": "(When he said unto his father) Azar: (0 my father! Why worshippest thou) beside Allah (that which heareth not) when called upon (nor seeth) when you worship it, (nor can in aught avail thee) from Allah's chastisement?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر أوان انكشافه وإيقاظه من منام الغفلة التي هي عبادة الأوثان والأصنام وقت: { إِذْ قَالَ لأَبِيهِ } مستنكراً عليه متعجباً من أمره\n منادياً له رجاء أن يتفطن وتنبه بما تنبه به هو: { يٰأَبَتِ لِمَ تَعْبُدُ } وتطيع { مَا لاَ يَسْمَعُ } أي: شيئاً لا يقدر على السمع { وَلاَ يُبْصِرُ } أي: لا يقدر على الإبصار\n والمعبودُ لا بدَّ أن يَرى ويَسمع أحوال عباده وحاجاتهم ومناجاتهم\n { وَ } إذا لم يسمع ولم يبصر { لاَ يُغْنِي } ويدفع { عَنكَ شَيْئاً } [مريم: 42] من مكروهات ولا يعينك\n فلا يصلح إذاً للألوهية والربوبية\n فلِمَ عبدت وأطعتَ له مع أنه نحتَّه بيدك وأظهرتَ أنت هيكله وشكله\n والعجب منك كل العجب أنه مصنوعك أخذته إلهاً صانعاً معبوداً مستحقاً للعبادة\n مع أنك من ذوي الرشل والعلم\n وهو جمادُ لا شعور له أصلاً\n\n\n{ يٰأَبَتِ إِنِّي } وإنت كنت ابنك أصغر منك لكن { قَدْ جَآءَنِي } ونزل عليّ { مِنَ ٱلْعِلْمِ } ومن قِبل الحق مع صغر سني { مَا لَمْ يَأْتِكَ } مع كبرك\n لأن الفضل بيد الله ويمقتضى إرادته يؤتيه من يشاء { فَٱتَّبِعْنِيۤ } أي: اتبع ما أنزل عليّ من قِبل ربي من خلوص الاعتقاد { أَهْدِكَ } بتوفيق الله وإرشاده { صِرَاطاً سَوِيّاً } [مريم: 43] موصلاً إلى المعبود بالحق وتوحيده\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِذْ قال لأبيه } آزر\n متلطفًا في الدعوة مستميلاً له: { يا أبتِ } \n التاء بدل من ياء الإضافة\n أي: يا أبي\n { لِمَ تعبدُ ما لا يسمع } ثناءك عليه حين تعبده\n ولا جُؤَارك إليه حين تدعوه\n { ولا يُبْصِرُ } خضوعك وخشوعك بين يديه\n أو: لا يسمع ولا يبصر شيئًا من المسموعات والمبصرات\n فيدخل في ذلك ما ذكر دخولاً أوليًا\n { ولا يُغْنِي عنك شيئًا } أي: لا يقدر أن ينفعك بشيء في طلب نفع أو دفع ضرر\n انظر لقد سلك عليه السلام في دعوته وموعظته أحسن منهاج وأقوم سبيل\n واحتج عليه بأبدع احتجاج\n بحسن أدب\n وخلق جميل\n لكن وقع ذلك لسائرٍ ركب متن المكابرة والعناد\n وانتكب بالكلية عن محجة الصواب والرشاد\n أي: فإنَّ من كان بهذه النقائص يأبى مَن له عقل التمييز من الركون إليه\n فضلاً عن عبادته التي هي أقصى غاية التعظيم\n فإنها لا تحِقُ إلا لمن له الاستغناء التام والإنعام العام\n الخالق الرازق\n المحيي المميت\n المثيب المعاقب\n والشيء لو كان مميزًا سميعًا بصيرًا قادرًا على النفع والضر\n لكنه ممكن\n لاستنكف العقل السليم عن عبادته\n فما ظنك بجماد مصنوع من حجر أو شجر\n ليس له من أوصاف الأحياء عين ولا أثر\n ثم دعاء إلى اتباعه لأنه على المنهاج القويم\n مُصدّرًا للدعوة بما مرَّ من الاستعطاف والاستمالة\n حيث قال: { يا أبتِ إِني قد جاءني من العلم ما لم يأتِكَ } \n لم يَسِمْ أباه بالجهل المفرط\n وإن كان في أقصاه\n ولا نفسه بالعلم الفائق\n وإن كان في أعلاه\n بل أبرز نفسه في صورة رفيق له\n أعرفَ بأحوال ما سلكاه من الطريق\n فاستماله برفق\n حيث قال: { فاتّبِعْنِي أَهدِكَ صراطًا سوِيًّا } أي: مستقيمًا موصلاً إلى أسمى المطالب\n منجيًا من الضلال المؤدي إلى مهاوي الردى والمعاطب\n\nثم ثبّطه عما كان عليه من عبادة الأصنام\n فقال: { يا أبتِ لا تعبدِ الشيطانَ } \n فإن عبادتك للأصنام عبادة له\n إذ هو الذي يُسولُها لك ويغريك عليها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:70",
      "similarity": 0.5049793328861575
    },
    {
      "verse": "44:41",
      "similarity": 0.4412740440153126
    },
    {
      "verse": "69:28",
      "similarity": 0.4019996690634333
    },
    {
      "verse": "26:207",
      "similarity": 0.384805994655322
    },
    {
      "verse": "96:7",
      "similarity": 0.38174132829273766
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}