{
  "chapter": "مريم",
  "text": "قال رب انى وهن العظم منى واشتعل الراس شيبا ولم اكنۢ بدعائك رب شقيا",
  "translations": [
    {
      "translation": "And said: \"O my Lord, my bones decay, my head is white and hoary, yet in calling You, O Lord, I have never been deprived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Lord! My bones have grown feeble and my head is glistening with age; yet, never have my prayers to You, my Lord, been unfruitful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and said, \"My Lord, my bones have become feeble and my hair has turned white with age. Yet I have never been deprived in receiving from You the answer to my prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He submitted, “O my Lord – my bones have become weak and old age shines forth from my head, and O my Lord, I have never been disappointed in my prayer to you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord! Indeed my bones have grown feeble, and gray hair has Ashta`al on my head, and I have never been unblessed in my invocation to You, O my Lord!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! surely my bones are weakened and my head flares with hoariness, and, my Lord! I have never been unsuccessful in my prayer to Thee:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying, 'O my Lord, behold the bones within me are feeble and my head is all aflame with hoariness. And in calling on Thee, my Lord, I have never been hitherto unprosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: My Lord! Lo! the bones of me wax feeble and my head is shining with grey hair, and I have never been unblest in prayer to Thee, my Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, my bones have weakened and my head has turned hoary with age, but never, Lord, have I been disappointed in my prayer to you:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my Lord! verily the bones of me have waxen feeble, and the head is glistening with hoariness, and have not yet been in my prayer to thee, my Lord, unblest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! Indeed my bones have become feeble, and my head has turned white with age, yet never have I, my Lord, been disappointed in supplicating You!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praying: \"O my Lord! infirm indeed are my bones, and the hair of my head doth glisten with grey: but never am I unblest, O my Lord, in my prayer to Thee!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: \"My Lord! Indeed my bones have grown feeble, and grey hair has spread on my head, And I have never been unblest in my invocation to You, O my Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying: 'O my Lord, my bones are enfeebled, and my head glows silver with age. Yet, never Lord, have I been unblessed in prayer to You.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, my bones have become feeble, and my hair is aflame with gray, and never, Lord, have I been disappointed in my prayer to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"My Lord, indeed my bones have weakened, and my head has filled with white, and never have I been in my supplication to You, my Lord, unhappy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:4] He said, ‘My Lord, truly the bones, all [the bones], within me have become feeble, weak, and my head is alight with grey hair (shayban, a specification derived from the subject of the verb in other words, hoariness has spread throughout his hairs just as a spark of fire spreads through firewood) and I wish to supplicate to you, and I have never been in my supplications to You, my Lord, unsuccessful, that is, [I have never been] disappointed, in the past, so do not disappoint me in what follows.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Saying: My Lord!) my Lord! (Lo! the bones of me wax feeble) my body has become weak (and my head is shining with grey hair, and I have never been unblest in prayer to You, my Lord) he said: my prayers were never rejected by You, my Lord.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَمْ أَكُنْ بِدُعَآئِكَ رَبِّ شَقِيّاً } معناه أجبتَني حين دعوتُكَ ولم تخيبني\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nفنادى زكريا عليه السلام ربّه ليهب له وليّاً يقوم مقامه في أمر الدين، وتوسل إليه بأمرين، واعتذر إليه معتلاً بأمرين، توسل بالضعف والشيخوخة والوهن والعجز عن القيام بأمر الدين في قوله: { وَهن العظم مني واشتعل الرأس شيباً } فأجابه باسمه الكافي فكفاه ضعفه وأعطاه القوّة وأيده بالولد ثم بعنايته به قديماً بقوله: { ولم أكن بدعائك ربِّ شقيّاً } فأجابه باسمه الهادي وهداه إلى مطلوبه بالبشارة والوعد، لأن العناية المقتضية للسعادة المستلزمة لسلب الشقاوة، كما أشار إليها، يلازمها عبارة عن علمه تعالى في الأزل بعين في العدم وتقتضي باستعدادها سعادة تناسبها وهو عين إرادته تعالى ذلك الكمال لها عند وجودها فلا بد من هداية لها إليه، والهداية إنما تتم بالتوفيق، وهو ترتيب الأسباب الموافقة لذلك المطلوب المؤدّية إليه، ولم يجدها موافقة ووجد خلافها فخاف واعتذر إليه بالخوف من الموالي لعدم صلاحيتهم لذلك، فأجابه باسمه الواقي، فوقاه شرّهم، وبامتناع وجود الولي من نسله لعدم الأسباب بقوله: { وكانت امرأتي عاقراً } فأجابه باسمه العليم لأنه علم عدم الأسباب الذي تعلل به محتجاً بها عن المسبب وعلم وجوده مع عدمها وما علمه لا بدّ من كونه، كما قالت الملائكة لامرأة إبراهيم عليه السلام:\n\nولما بشره بالولد، وهداه إلى مقتضى العلم، تعجب منه لضراوته في عالم الأسباب بالحكمة وكرر التعلل بعدم الأسباب بقوله: { أنى يكون لي غلام } الخ، لأنه كان يطلب ولداً حقيقياً يلي أمره ويحذو حذوه ويسلك طريقه في القيام بأمر الدين وإن لم يكن من نسله لعدم أهلية مواليه لذلك، فكرر البشارة وهداه إلى سهولة ذلك في قدرته، فالتمس علامة تدل عليه، فهداه إليها وأنجز وعده باسمه الصادق فرحمه بهبة يحيى له\n فاقتضت الأحوال الأربعة مع حال الوعد والبشارة إجابته بالرحمة عليه بالأسماء الخمسة\n فعلى هذا يكون كـ إشارة إلى الكافي الذي اقتضاه حال ضعفه وشيخوخته وعجزه و هـ إشارة إلى الهادي الذي اقتضاه عنايته به وإرادة مطلوبه له و ي إشارة إلى الواقي الذي اقتضاه حال خوفه من الموالي و ع إشارة إلى العالم الذي اقتضاه إظهاره لعدم الأسباب و ص إشارة إلى الصادق الذي اقتضاه الوعد\n ومجموع الأسماء الخمسة هو: الرحيم بهبة الولد، وإفاضة مطلوبه في هذه الأحوال\n فذكر هذه الحروف وتعدادها إشارة إلى أن ظهور هذه الصفات التي حصل بها هذه الأسماء هو ظهور رحمة عبده زكريا وقت ندائه وذكرها ذكر تلك الرحمة التي هي وجود يحيى عليه السلام\n ولهذا قال ابن عباس رضي الله عنهما: كـ عبارة عن الكافي و هـ عن الهادي و ي عن الواقي و ع عن العالم و ص عن الصادق والله أعلم\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nحيث { قَالَ } مشتكياً إلى الله باثاً شكواه عنده سبحانه: { رَبِّ } يا من ربَّاني بأنواع اللطف والكرم { إِنَّي } من غاية ضعفي، ونهاية هزالي ونحولي { وَهَنَ ٱلْعَظْمُ مِنِّي } أي: ضعفت دعائم جسمي وقوائم بدني، وأشرفت على الانهدام والانصرام { وَٱشْتَعَلَ ٱلرَّأْسُ شَيْباً } أي: اشتعل شبيب رأسي، وذهب سواده، وانقلب إلى البياض المشعر بالانقضاء والزوال، مثل ابيضاض النباتات وقت الخريف { وَلَمْ أَكُنْ بِدُعَآئِكَ } أي: لم أكن في كل حالٍ بدعائي إياك { رَبِّ شَقِيّاً } [مريم: 4] خائباً خاسراً مردوداً، بل عودتني بفضلك وجودك بالإجابة والإنجاح، وهذا الدعاء وإن كان أبعدَ بحسب العادة من الإجابة إلاَّ أنه بالنسبة إلى قدرتك وجودك أقرب، ويجنب حولك وقوتك أسهلُ وأيسرُ، سيما ألهمتني به ووفقتني على إظهاره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } في دعائه: { ربِّ إِني وَهَنَ العظمُ مني } أي: ضعف بدني وذهبت قوتي\n وإسناد الوهن إلى العَظْم لأنه عماد البدن ودعامة الجسد، فإذا أصابه الضعف والرخاوة أصاب كله، وإفراده للقصد إلى الجنس المنبئ عن شمول الوهن إلى كل فرد من أفراده\n ووهن بدنه عليه السلام: لكبر سنه، قيل: كان ابن سبعين، أو خمسًا وسبعين، وقيل: مائة، وقيل: أكثر\n { واشتعل الرأسُ شيبًا } أي: ابيضَّ شَمَطًا\n شبه عليه السلام الشيب من جهة البياض والإنارة بشواظ النار، وانتشاره في الشعر وفُشوِّه فيه وأخذه منه كل مأخذ باشتعالها، ثم أخرجه مخرج الاستعارة، ثم أسند الاشتعال إلى محل الشعر ومنبته وهو الرأس، وأخرجه مخرج التمييز، ففيه من فنون البلاغة وكمال الجزالة ما لا يخفى، حيث كان الأصل: واشتعل شيب رأسي، فأسند الاشتعال إلى الرأس لإفادة شموله لكلها، فإن وِزَانَهُ: اشتعل بيته نارًا بالنسبة إلى اشتعلت النار في بيته، ولزيادة تقريره بالإجمال أولاً، والتفصيل ثانيًا، ولمزيد تفخيمه بالتكثير من جهة التنكير\n ثم قال: { ولم أكن بدعائك ربِّ شقيًّا } أي: لم أكن بدعائي إياك خائبًا في وقت من أوقات هذا العمر الطويل، بل كنت كلما دعوتك استجبتَ لي\n توسل إلى الله بسابق حسن عوائده فيه، لعله يشفع له ذلك بمثله، إثر تمهيد ما يستدعي ويستجلب الرأفة من كبر السن وضعف الحال\n\n\nوالتعرض في الموضعين لوصف الربوبية لتحريك سلسلة الإجابة بالمبالغة في التضرع، ولذلك قيل: من أراد أن يُستجاب له فليدعُ الله بما يناسبه من أسمائه وصفاته\n ثم قال: { وإِني خفتُ الموالي } أي: الأقارب، وهم: بنو عمه، وكانوا أشرار بني إسرائيل، فخاف ألا يحسنوا خلافته في أمته، فسأل الله تعالى ولدًا صالحًا يأمنه على أمته",
      "translations": []
    }
  ]
}