{
  "chapter": "مريم",
  "text": "يابت انى اخاف ان يمسك عذاب من الرحمن فتكون للشيطن وليا",
  "translations": [
    {
      "translation": "Father, I am afraid that a punishment from the All-Merciful will afflict you, and turn you into a comrade of Shaytan.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father, I fear lest a punishment from Ar-Rahman should befall you, and you should become a friend of the Devil.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, I fear that a punishment from the Most Compassionate Lord might strike you and you may end up as one of Satan's companions?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, I am afraid that the Beneficent God's torment will strike you and you will become a friend of satan.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my father, I fear that a punishment from the Most Gracious may reach you, so you would become a companion of the devil.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! Verily, I fear lest a torment from the Most Gracious should overtake you, so that you become a companion of Shaytan.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! surely I fear that a punishment from the Beneficent Allah should afflict you so that you should be a friend of the Shaitan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, I fear that some chastisement from the All-merciful will smite thee, so that thou becomest a friend to Satan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! Lo! I fear lest a punishment from the Beneficent overtake thee so that thou become a comrade of the devil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, indeed I fear lest a punishment from the Gracious One afflict you, and you become a friend of Satan.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My father! verily I fear that there may touch thee a torment from the Compassionate so that thou become to the Satan a companin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father! I am indeed afraid that a punishment from the All-beneficent will befall you, and you will become Satan’s accomplice.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! I fear lest a Penalty afflict thee from (Allah) Most Gracious, so that thou become to Satan a friend.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! Verily! I fear lest a torment from the Most Beneficent (Allah) overtake you, so that you become a companion of Shaitan (Satan) (in the Hell-fire).\" [Tafsir Al-Qurtubi]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, I fear that the punishment of the Merciful will fall upon you and you will become a guide of satan'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father, I fear that a punishment from the Most Gracious will afflict you, and you become an ally of the devil.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father, indeed I fear that there will touch you a punishment from the Most Merciful so you would be to Satan a companion [in Hellfire].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:45] O my father! I do fear lest a chastisement from the Compassionate One should befall you, if you do not repent, and then you become an ally of Satan, an assistant and a comrade [of his] in the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَبَتِ إِنِّي أَخَافُ أَنْ يَمَسَّكَ عَذَابٌ مِنَ الرَّحْمَنِ فَتَكُونَ لِلشَّيْطَانِ وَلِيًّا (45)لا جرم أنه لما قرر له أن عبادته الأصنام اتّباع لأمر الشيطان عصيّ الرحمان انتقل إلى توقع حرمانه من رحمة الله بأن يحلّ به عذاب من الله ، فحذره من عاقبة أن يصير من أولياء الشيطان الذين لا يختلف البشر في مذمتهم وسوء عاقبتهم ، ولكنهم يندمجون فيهم عن ضلال بمآل حالهم .وللإشارة إلى أن أصل حلول العذاب بمن يحلّ به هو الحرمان من الرحمة في تلك الحالة؛ عبر عن الجلالة بوصف الرحمان للإشارة إلى أن حلول العذاب ممن شأنُه أن يرحم إنما يكون لفظاعة جرمه إلى حد أن يحرمه من رحمته مَن شأنه سعة الرحمة .والولي : الصاحب والتابع ومن حالهما حال واحدة وأمرهما جميع؛ فكني بالولاية عن المقارنة في المصير .والتعبير بالخوف الدال على الظن دون القطع تأدب مع الله تعالى بأن لا يُثبت أمراً فيما هو من تصرف الله ، وإبْقاء للرجاء في نفس أبيه لينظر في التخلّص من ذلك العذاب بالإقلاع عن عبادة الأوثان .ومعنى : { فتكون للشيطان وليا فتكون في اتباع الشيطان في العذاب . وتقدّم الكلام على يا أبت قريباً .\n\n",
      "translations": [
        {
          "translation": "(0 my father! Lo! I fear) I know (lest a punishment from the Beneficent overtake thee) if you do not believe in Him (so that thou become a comrade of the devil) a companion of the devil in hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنِّيۤ أَخَافُ أَن يَمَسَّكَ عَذَابٌ مِّنَ ٱلرَّحْمَـٰنِ } معناه أعلمُ ذَلكَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"I fear that a punishment from the Most Merciful will touch you\" - I know that.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَبَتِ إِنِّيۤ } من غاية إشفاقي وعطفي { أَخَافُ } عليك { أَن يَمَسَّكَ } وينزل { عَذَابٌ مِّنَ ٱلرَّحْمَـٰنِ } المنتقم لأهل الضلال والطغيان بدل الثواب والغفران { فَتَكُونَ } حينئذٍ بشاوتك وطغيانك { لِلشَّيْطَانِ وَلِيّاً } [مريم: 45] صديقاً\n وللرحمن عدواً ببغيك وعصيانك له ومتابعتك لعدوه\n\n\nثم لما تمادى مكالمة إبراهيم مع أبيه\n ومحاورته على سبيل النصح والتذكير { قَالَ } أبوه مقرعاً عليه مهدداً له مضلللاً إياه: { أَرَاغِبٌ أَنتَ } أي: مُعرضُ بريءُ { عَنْ آلِهَتِي } ومعبوداتي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { من الرحمن }: صفة لعذاب\n أي: عذاب واقع من الرحمن\n وإظهار { الرحمن } للإشعار بأن وصف الرحمانية لا يدفع حلول العذاب\n كما في قوله تعالى:\n[الانفطار: 6]\n { فتكون للشيطان وليًّا } أي: فإذا قرنت معه في العذاب تكون قرينًا له في اللعن المخلد\n فهذه موعظة الخليل لأبيه\n وقد استعمل معه الأدب من خمسة أوجه:  الأول: ندائه: بيا أبت\n ولم يقل يا آزر\n أو يا أبي\n الثاني: قوله { ما لا يسمع\n\n\n } الخ\n ولم يقل: لِمَ تعبد الخشب والحجر\n الثالث: قوله: { إني قد جاءني من العلم ما لم يأتك } \n ولم يقل له: أنك جاهل ضال\n الرابع: قوله: { إني أخاف } \n حيث عبَّر له بالخوف ولم يجزم له بالعذاب\n الخامس: في قوله: { أن يمسك } \n حيث عبَّر بالمس ولم يُعبر باللحوق أو النزول\n والله تعالى أعلم\n الإشارة: قد جمع الحق تبارك وتعالى لخليله مقام الصدّيقة والنبوة مع الرسالة والخلة\n وقدَّم الصديقية لتقدمها في الوجود في حال الترقي\n فالصديقية تلي مرتبة النبوة\n كما تقدم في سورة النساء\n فالصدّيق عند الصوفية هو الذي يَعْظُمْ صدقه وتصديقه\n فيصدِّق بوجود الحق وبمواعده\n حتى يكون ذلك نصب عينيه\n من غير تردد ولا تلجلج\n ولا توقف على آية ولا دليل\n ثم يبذل مهجته وماله في مرضاة مولاه\n كما فعل الخليل\n حيث قدم بدنه للنيران وطعامه للضيفان وولده للقربان\n وكما فعل الصدِّيق\n حيث واسى النبي صلى الله عليه وسلم بنفسه في الغار\n وخرج عن ماله خمس مرار\n وكما فعل الغزالي حيث قدم نفسه للخِرَابِ\n حين اتصل بالشيخ وخرج عن ماله وجاهه في طلب مولاه\n ولذلك قال الشيخ أبو الحسن الشاذلي رضي الله عنه: في حقه: \" إنا لنشهد له بالصدِّيقية العظمى \" \n وناهيك بمن شهد له الشاذلي بالصدِّيقية\n\nومن أوصاف الصدّيق أنه لا يتعجب من شيء من خوارق العادة\n مما تبرزه القدرة الأزلية\n ولا يتعاظم شيئًا ولا يستغربه\n ولذلك وصف الحق تعالى مريم بالصديقية دون سارة\n حيث تعجبت\n وقالت:\n[هُود: 72] وأما مريم فإنما سألت عن وجه ذلك\n هل يكون بنكاح أم لا\n والله تعالى أعلم\n وفي الآية إشارة إلى حسن الملاطفة في الوعظ والتذكير\n لا سيما لمن كان معظمًا كالوالدين\n أو كبيرًا في نفسه\n فينبغي لمن يذكره أن يأخذه بملاطفة وسياسة\n فيقر له المقام الذي أقامه الله تعالى فيه\n ثم يُذكره بما يناسبه في ذلك المقام\n ويشوقه إلى مقام أحسن منه\n وأما إن أنكر له مقامه من أول مرة\n فإنه يفرّ عنه ولم يستمع إلى وعظه\n كما هو مجرب\n وبالله التوفيق\n ثمَّ ذكر جواب أبيه له",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:175",
      "similarity": 0.5828334879028289
    },
    {
      "verse": "19:44",
      "similarity": 0.4560863259407188
    },
    {
      "verse": "7:201",
      "similarity": 0.4385296120636916
    },
    {
      "verse": "26:156",
      "similarity": 0.38062458702696783
    },
    {
      "verse": "6:49",
      "similarity": 0.3766861958922918
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}