{
  "chapter": "مريم",
  "text": "يابت لا تعبد الشيطن ان الشيطن كان للرحمن عصيا",
  "translations": [
    {
      "translation": "Father, do not worship Shaytan. Shaytan was disobedient to the All-Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why do you worship Satan, O father? Verily Satan was disobedient to Ar-Rahman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, do not serve Satan, for Satan has indeed been a persistent rebel against the Most Compassionate Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, do not worship satan; he has disobeyed the Beneficent God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my father, do not be a bondman of the devil; indeed the devil is disobedient towards the Most Gracious.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! Worship not Shaytan. Verily, Shaytan has been a rebel against the Most Gracious.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! serve not the Shaitan, surely the Shaitan is disobedient to the Beneficent Allah:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, serve not Satan; surely Satan is a rebel against the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! Serve not the devil. Lo! the devil is a rebel unto the Beneficent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father! Do not worship Satan -- for, truly, Satan is a rebel against the Most Gracious One!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My father! worship not the satan; hath been Unto the Compassionate a rebel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father! Do not worship Satan. Indeed Satan is disobedient to the All-beneficent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! serve not Satan: for Satan is a rebel against (Allah) Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! Worship not Shaitan (Satan). Verily! Shaitan (Satan) has been a rebel against the Most Beneficent (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, do not worship satan; for satan has rebelled against the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father, do not worship the devil. The devil is disobedient to the Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father, do not worship Satan. Indeed Satan has ever been, to the Most Merciful, disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:44] O my father! Do not worship Satan, by obeying him through [your] worship of idols. Truly Satan is disobedient ([the intensive form‘asiyyan] means ‘one given to disobedience’) to the Compassionate One.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my father! Serve not the devil) do not obey the devil concerning the worship of idols. (Lo! the devil is a rebel unto the Beneficent) the devil is a disbeliever in Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَبَتِ لاَ تَعْبُدِ ٱلشَّيْطَانَ } بعباده هذه التامثيل الباطلة والهياكل العاطلة، إذ ما هو إلا بإغوائه وتضليله؛ لأنه عدو لك ولأبناء عداوةً قديمةً مستمرةً { إِنَّ ٱلشَّيْطَانَ } المغوي المضل عن طريق الحق { كَانَ } من الأزل إلى الأبد { لِلرَّحْمَـٰنِ } المفيض لأصناف الخيرات والسعادات سيما الإيمان والعرفان المنجي عن الحرمان والخذلان عند لقاء الحنان المنان { عَصِيّاً } [مريم:44] عصى هو وانتظر لعصيان غيره وسعى بإضلاله وتسويلاته ليضل أهل الحق عن طريقه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nثم ثبّطه عما كان عليه من عبادة الأصنام، فقال: { يا أبتِ لا تعبدِ الشيطانَ } ، فإن عبادتك للأصنام عبادة له، إذ هو الذي يُسولُها لك ويغريك عليها، ثم علل نهيه فقال: { إِن الشيطان كان للرحمن عَصِيًّا } ، فهو تعليل لموجب النهي، وتأكيد له ببيان أنه مستعصٍ على ربك، الذي أنعم عليك بفنون النعم، وسينتقم منه فكيف تعبده؟\n والإظهار في موضع الإضمار لزيادة التقرير، والاقتصارُ على ذكر عصيانه بترك السجود من بين سائر جناياته لأنه ملاكها، أو لأنه نتيجة معاداته لآدم وذريته، فتذكيره به داع لأبيه إلى الاحتراز عن موالاته وطاعته\n والتعرض لعنوان الرحمانية لإظهار كمال شناعة عصيانه\n  وقوله: { يا أبتِ إِني أخاف أن يمسّك عذابٌ من الرحمن } تحذير من سوء عاقبة ما كان عليه من عبادة الشيطان، وهو اقترانه معه في الهوان الفظيع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:21",
      "similarity": 0.6113756476060895
    },
    {
      "verse": "20:93",
      "similarity": 0.5670590306187901
    },
    {
      "verse": "14:36",
      "similarity": 0.5402876138407644
    },
    {
      "verse": "6:15",
      "similarity": 0.520298877561241
    },
    {
      "verse": "39:13",
      "similarity": 0.520298877561241
    }
  ]
}