{
  "chapter": "مريم",
  "text": "انا نحن نرث الارض ومن عليها والينا يرجعون",
  "translations": [
    {
      "translation": "It is We who will inherit the earth and all those on it. They will be returned to Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We shall inherit the earth and whosoever is on it, and to Us they will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ultimately, We shall inherit the earth and whatever is on it; to Us shall they be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are the heirs of the earth and those living in it will all return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We shall inherit the earth and all that is on it, and only towards Us will they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We will inherit the earth and whatsoever is thereon. And to Us they all shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We inherit the earth and all those who are on it, and to Us they shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We shall inherit the earth and all that are upon it, and unto Us they shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We, only We, inherit the earth and all who are thereon, and unto Us they are returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We who will inherit the earth and all who dwell upon it: they shall all return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We shall inherit the earth and whatsoever is thereon: and Unto Us they shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We shall inherit the earth and whoever there is on it, and to Us they shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We Who will inherit the earth, and all beings thereon: to Us will they all be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! We will inherit the earth and whatsoever is thereon. And to Us they all shall be returned,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For We shall inherit the earth and all that are on it. To Us, they shall return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We who will inherit the earth and everyone on it, and to Us they will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, it is We who will inherit the earth and whoever is on it, and to Us they will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:40] Indeed We (innā nahnu, [a repetition of the first person] for emphasis), shall inherit the earth and all who are on it, of rational beings and others, by destroying them, and to Us they shall be returned, thereon [on the Day of Resurrection] for requital.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We inherit the earth and all who are thereon,) We possess the earth; it is also said that this means: We cause to die whoever is in the earth and give them life again (and unto Us they are returned) on the Day of Judgement such that I reward them for their deeds: a good deed for a good deed and an evil deed for an evil deed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّا } من مقام قهرنا وجلالنا { نَحْنُ } بانفرادنا ووحدتنا { نَرِثُ ٱلأَرْضَ وَمَنْ عَلَيْهَا } بعد انقهارها واضمحلال أجزائها وتشتيت أركانها بمقتضى القدرة الغالبة؛ بحيث صار كل من عليها فانٍ، ولم يبقَ سوى وجهنا الكريم وصفاتنا القديمة، فانقلبت تجلياتنا المتشعشعة المتجددة من هذا النمط البديع إلى نمطٍ أبدعَ منه وأكملَ؛ إذ نحن في كل يومٍ وآنٍ شأنٍ، ولا يشغلنا شأنٌ عن شأنٍ\n\n\n\n\n{ وَ } كيف لا نرث من على الأرض الوجودَ وفضاءَ الشهودِ؛ إذ الكل { إِلَيْنَا يُرْجَعُونَ } [مريم: 40] رجوع الظل إلى ذي الظل، والأمواج إلى البحر، والأضواء والأظلال إلى شمس الذات، وبعد رجوع الكل إلينا نُودِي من وراء سرادقات عزنا وجلالنا:\n\n؟! وأجيب أيضاً منها؛ إذ لا يجب الوجود لسوانا:\n\n[غافر: 16] للأظلال والأغيار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:10",
      "similarity": 0.782055210174358
    },
    {
      "verse": "44:28",
      "similarity": 0.6920028481163415
    },
    {
      "verse": "15:23",
      "similarity": 0.683669621459041
    },
    {
      "verse": "43:72",
      "similarity": 0.6833932550755837
    },
    {
      "verse": "26:85",
      "similarity": 0.6629955690240974
    }
  ]
}