{
  "chapter": "مريم",
  "text": "يابت انى قد جاءنى من العلم ما لم ياتك فاتبعنى اهدك صرطا سويا",
  "translations": [
    {
      "translation": "Father, knowledge which never reached you has come to me, so follow me and I will guide you to the right path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father, to me has come such knowledge as never came to you. So follow me that I may show you the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, a knowledge that has not reached you has come to me. So follow me that I may guide you to a Straight Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, I have received the knowledge which has not been given to you. Follow me; I shall guide you to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my father, indeed a knowledge has come to me which did not come to you – therefore follow me, I will show you the Straight Path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! Verily, there has come to me the knowledge of that which came not unto you. So follow me, I will guide you to the straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! truly the knowledge has come to me which has not come to you, therefore follow me, I will guide you on a right path:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, there has come to me knowledge such as came not to thee; so follow me, and I will guide thee on a level path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! Lo! there hath come unto me of knowledge that which came not unto thee. So follow me, and I will lead thee on a right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, I have been given some knowledge which has not come to you, so follow me: I shall guide you along a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O My father! verily there hath come to me of the knowledge which hath not come unto thee; so follow me, and I shall guide thee to a path even.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father! Indeed a knowledge has already come to me, which has not come to you. So follow me that I may guide you to a right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! to me hath come knowledge which hath not reached thee: so follow me: I will guide thee to a way that is even and straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father! Verily! There has come to me of knowledge that which came not unto you. So follow me. I will guide you to a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Father, knowledge has come to me which has not come you, therefore, follow me. I will guide you to a Level Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father, there has come to me knowledge that never came to you. So follow me, and I will guide you along a straight way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my father, indeed there has come to me of knowledge that which has not come to you, so follow me; I will guide you to an even path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:43] O my father! Indeed there has come to me of knowledge that which has not come to you. So follow me that I may guide you to a path, a route, that is right, [that is] straight.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 my father! Lo! there hath come unto me) from Allah (of knowledge) of exposition (that which came not unto thee) that whoever worships other than Allah will torment him with the Fire. (So follow me) regarding Allah's religion, (and I will lead thee on a right path) I will guide you to a just path and erect path that Allah is pleased with which is Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "1:6",
      "similarity": 0.5234567667461841
    },
    {
      "verse": "37:118",
      "similarity": 0.5223005618722947
    },
    {
      "verse": "4:68",
      "similarity": 0.5168511852873846
    },
    {
      "verse": "24:46",
      "similarity": 0.5005436391307185
    },
    {
      "verse": "36:4",
      "similarity": 0.4583295605738611
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}