{
  "chapter": "مريم",
  "text": "فخلف منۢ بعدهم خلف اضاعوا۟ الصلوة واتبعوا۟ الشهوت فسوف يلقون غيا",
  "translations": [
    {
      "translation": "An evil generation succeeded them who neglected the salat and followed their appetites. They will plunge into the Valley of Evil -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they are succeeded by a generation who neglect their devotional obligations and follow only earthly pleasures; but they will reach the wrong road and meet destruction,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were succeeded by a people who neglected the Prayers and pursued their lusts. They shall presently meet with their doom,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were succeeded by a generation who neglected their prayers and followed their worldly desires. They will certainly be lost,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And after them came the unworthy successors who squandered prayer and pursued their own desires, so they will soon encounter the forest of Gai in hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, there has succeeded them a posterity who have lost the Salah and have followed lusts. So they will meet Ghaiy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there came after them an evil generation, who neglected prayers and followed and sensual desires, so they win meet perdition,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there succeeded after them a succession who wasted the prayer, and followed lusts; so they shall encounter error\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now there hath succeeded them a later generation whom have ruined worship and have followed lusts. But they will meet deception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But then they were succeeded by generations who neglected their prayers and were driven by their own desires. They will assuredly meet with destruction,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there succeeded to them a posterity who neglected the prayers and followed lusts; so presently they shall meet with perdition. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they were succeeded by an evil posterity who neglected the prayer, and followed [their base] appetites. So they will soon encounter [the reward of] perversity,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But after them there followed a posterity who missed prayers and followed after lusts soon, then, will they face Destruction,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, there has succeeded them a posterity who have given up As-Salat (the prayers) [i.e. made their Salat (prayers) to be lost, either by not offering them or by not offering them perfectly or by not offering them in their proper fixed times, etc.] and have followed lusts. So they will be thrown in Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the generation that succeeded them wasted their prayers and followed their desires, so they shall encounter error\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they were succeeded by generations who lost the prayers and followed their appetites. They will meet perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there came after them successors who neglected prayer and pursued desires; so they are going to meet evil -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:59] But there succeeded after them a posterity who neglected the prayer, by abandoning [performance of] it, [a posterity] such as the Jews and the Christians, and followed [their] lusts, in the way of acts of disobedience. So they shall [soon] encounter Ghayy — a valley in Hell — that is, they shall fall into it;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَخَلَفَ مِنْ بَعْدِهِمْ خَلْفٌ أَضَاعُوا الصَّلَاةَ وَاتَّبَعُوا الشَّهَوَاتِ فَسَوْفَ يَلْقَوْنَ غَيًّا (59) فرع على الثناء عليهم اعتبارٌ وتنديد بطائفة من ذرياتهم لم يقتدوا بصالح أسلافهم وهم المعني بالخَلْف .والخلْف بسكون اللام عقب السُوء ، و بفتح اللام عقب الخير . وتقدم عند قوله تعالى : { فخلف من بعدهم خلف ورثوا الكتاب } في سورة الأعراف ( 169 ).وهو هنا يشمل جميع الأمم التي ضلّت لأنها راجعة في النّسب إلى إدريس جدّ نوح إذ هم من ذرية نوح ومن يرجع أيضاً إلى إبراهيم ، فمنهم من يدلي إليه من نسل إسماعيل وهم العرب . ومنهم من يدلي إليْه من نسل يعقوب وهم بنو إسرائيل .ولفظ من بعدهم } يشمل طبقات وقروناً كثيرة ، ليس قيداً لأنّ الخلف لا يكون إلاّ من بعد أصله وإنّما ذُكر لاستحضار ذهاب الصالحين .والإضاعة : مجاز في التفريط بتشبيهه بإهمال العَرْض النفيس ، فرطوا في عبادة الله واتبعوا شهواتهم فلم يخالفوا ما تميل إليه أنفسهم ممّا هو فساد . وتقدم قوله تعالى : { إنا لا نضيع أجر من أحسن عملاً } في سورة الكهف ( 30 ).والصلاة : عبادة الله وحده . وهذان وصفان جامعان لأصناف الكفر والفسوق ، فالشرك إضاعة للصلاة لأنّه انصراف عن الخضوع لله تعالى ، فالمشركون أضاعوا الصلاة تماماً ، قال تعالى : { قالوا لم نك من المصلّين } \\[ المدثر : 43 \\]. والشرك : اتباع للشّهوات ، لأنّ المشركين اتّبعوا عبادة الأصنام لمجرد الشهوة من غير دليل ، وهؤلاء هم المقصود هنا ، وغير المشركين كاليهود والنصارى فَرطوا في صلوات واتبعوا شهوات ابتدعوها ، ويشمل ذلك كله اسم الغيّ .والغيّ : الضلال ، ويطلق على الشرّ ، كما أطلق ضده وهو الرشَد على الخير في قوله تعالى : { أشر أريد بمن في الأرض أم أراد بهم ربهم رشداً } \\[ الجنّ : 10 \\] وقوله { قل إني لا أملك لكم ضراً ولا رشداً } \\[ الجنّ : 21 \\]. فيجوز أن يكون المعنى فسوف يلقون جزاء غيّهم ، كقوله تعالى : { ومن يفعل ذلك يلق أثاماً } \\[ الفرقان : 68 \\] أي جزاء الآثام. وتقدم الغيّ في قوله تعالى : { وإخوانهم يمدونهم في الغي وقوله { وإن يروا سبيل الغي يتخذوه سبيلاً } كلاهما في سورة الأعراف ( 202و 146 ).\n\n",
      "translations": [
        {
          "translation": "(Now there hath succeeded them a later) evil (generation who have ruined worship) they abstained from the performance of the prayer (and have followed lusts) they occupied themselves with the pleasures of this worldly life and indulged in marrying half sisters from their fathers' side. The reference here is to the Jews. (But they will meet deception) a valley in Gehenna.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَسَوْفَ يَلْقَونَ غَيّاً } هو وادٍ فِي جَهنمَ مِن قَيحٍ يُقذَفُ فِيه الذينَ يَتّبعون الشَّهواتِ\n\n",
      "translations": [
        {
          "translation": " And His saying, {Then they will be driven to a severe torture}, is a valley in Hell of pus in which those who follow lusts are driven.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ولذلك الاحتجاب بصفات النفس عن مقام القلب لزم اتباع الشهوات { فسوف يلقون غيّاً } شرّاً وضلالاً إذ كلما أمعنوا في اتباعها ازداد حجابهم فازداد ضلالهم وارتكبت الذنوب على الذنوب\n فازداد تورّطهم فيها\n كما قال عليه الصلاة والسلام:\n \" الذنب بعد الذنب عقوبة للذنب الأول \"\n ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَخَلَفَ مِن بَعْدِهِمْ } واستعقبهم { خَلْفٌ } سوءٌ\n بالسكن\n لا خلَف جيد صدق بالحركة\n قد { أَضَاعُواْ } وأبطلوا { ٱلصَّلَٰوةَ } المقربة نحو الحق مع أنها من أقوى أسباب الإيمان { وَٱتَّبَعُواْ ٱلشَّهَوَٰتِ } النفسانية المبعدة عنه الجالبة لأنواع العذاب النكال\n وأباحوها لنفوسهم وأصروا على إباحتها { فَسَوْفَ يَلْقَونَ } في النشأة الأولى { غَيّاً } [مريم: 59] شراً وخسراناً أو عذاباً ونيراناً يترتب على شهواتهم ولذاتهم الفانية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:115",
      "similarity": 0.47516390745253767
    },
    {
      "verse": "18:30",
      "similarity": 0.4749275950691137
    },
    {
      "verse": "7:170",
      "similarity": 0.4721134542999906
    },
    {
      "verse": "3:171",
      "similarity": 0.4607358305124619
    },
    {
      "verse": "16:57",
      "similarity": 0.3910938754286991
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019059.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019059.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:59.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}