{
  "chapter": "مريم",
  "text": "وانى خفت المولى من وراءى وكانت امراتى عاقرا فهب لى من لدنك وليا",
  "translations": [
    {
      "translation": "I fear my relatives when I am gone and my wife is barren, so give me an heir from You",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But I fear my relatives after me; and my wife is barren. So grant me a successor as a favour from You\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I fear evil from my kinsmen after I am gone; and my wife is barren, so grant me an heir out of Your special grace,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am afraid of what my kinsmen will do after (my death) and my wife is barren. Lord, grant me a son\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I fear my relatives after me and my wife is barren therefore bestow upon me from Yourself one who will take up my work.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, I fear Mawali after me, and my wife is barren. So give me from Yourself an heir.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely I fear my cousins after me, and my wife is barren, therefore grant me from Thyself an heir,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now I fear my kinsfolk after I am gone; and my wife is barren. So give me, from Thee, a kinsman\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! I fear my kinsfolk after me, since my wife is barren. Oh, give me from Thy presence a successor\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "now I fear my kinsmen when I am gone. [I have no hope of their continuing my mission] for my wife is barren, so grant me a successor from Yourself,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily I fear my kindred after me, and my wife hath been barren; so bestow on me from before Thee an heir.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed I fear my kinsmen, after me, and my wife is barren. So grant me from Yourself an heir\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now I fear (what) my relatives (and colleagues) (will do) after me: but my wife is barren: so give me an heir as from Thyself,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Verily! I fear my relatives after me, since my wife is barren. So give me from Yourself an heir,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, I fear my kinsmen who will succeed me, for my wife is barren. Grant me a kinsman\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I fear for my dependents after me, and my wife is barren. So grant me, from Yourself, an heir.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, I fear the successors after me, and my wife has been barren, so give me from Yourself an heir\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:5] And truly I fear my kinsfolk, namely, those who will succeed me [as closest after me] in kinship, such as [my] paternal cousins, after me, that is, after my death, [I fear] for the religion, lest they forsake it, as You have witnessed in the case of the Children of Israel, in the way that they changed [their] religion, and my wife is barren, she does not conceive. So grant me from Yourself a successor, a son,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! I fear my kinsfolk) i.e. the inheritors (after me) i.e. there is no one after me to inherit my office and position, (since my wife) Hannah the sister of the mother of Mary the daughter of Amran ('Imran) the son of Matthan (Mathan) (is barren) and gives birth to no children. (Oh, give me from Thy presence) from You (a successor) a son,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنِّي خِفْتُ ٱلْمَوَالِيَ مِن وَرَآءِى } المَوالي: العُصبةُ من بني العمِ\n وقال: الكَلالةُ\n ومن ورائي: معناهُ قُدامى وبين يَدي\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنِّي } يا ربّ { خِفْتُ ٱلْمَوَالِيَ } أي: ن أبناء أعمامي الذين يترصدون الولاية والحبورة { مِن وَرَآءِى } وبعد انقراضي وانقضائي أن يغيروها ويضيعوها، ويحرفوا مَعَالم الدين وشعائر الإسلام بين المسلمين؛ إذ لا يرجى منهم الرشد والصلاح، والخير والفلاح، وأنت أعلم بحالهم مني يا رب، وليس لي ولد صالح يخلفني بعدي، ولم يبقَ لي قوة الاستيلاد لهرمي وضعفي { وَكَانَتِ ٱمْرَأَتِي عَاقِراً } عقيماً أصلياً لم تلد قط، فلا مرجع لي في أمري سوى بدائع صنعتك، وغرائب قدرتك { فَهَبْ لِي } بمقتضى فضلك وجودك { مِن لَّدُنْكَ } لا على طريق العادة ومقتضى الأسباب الصوري ولداً { وَلِيّاً } [مريم: 5] يولي أمر دين بني أمتي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { من ورائي }: متعلق بمحذوف، أي: جور الموالي، أو مما في الموالي من معنى الولاية، أي: خفت أن يلوا الأمر من ورائي، { وكانت امرأتي عاقرًا }: لا تلد من حين شبابها، { فهبْ لي من لدنك } أي: أعطني من محض فضلك الواسع، وقدرتك الباهرة، بطريق الاختراع، لا بواسطة الأسباب العادية لأن التعبير بِلَدُنّ يدل على شدة الاتصال والالتصاق، { وليًّا }: ولدًا من صُلبي، يلي الأمر من بعدي\n والفاء: لترتيب ما بعدها على ما قبلها، فإن ما ذكره عليه السلام من كبر السن وعقر المرأة موجب لانقطاع رجائه عن الولد بتوسط الأسباب، فاستوهبه على الوجه الخارق للعادة، ولا يقدح في ذلك أن يكون هنالك داعٍ آخر إلى الإقبال على الدعاء المذكور، من مشاهدته للخوارق الظاهرة عند مريم، كما يعرب عنه قوله تعالى:\n\n[آل عِمرَان: 38]\n وعدم ذكره هنا اكتفاء بما تقدم، فإن الاكتفاء بما ذكر في موطن عما ترك في موطن آخر من النكتة التنزيلية\n وقوله: { يرثني }: صفة لوليًّا، وقرئ بالجزم هو وما عطف عليه جوابًا للدعاء، أي: يرثني من حيث العلم والدين والنبوة، فإن الأنبياء - عليهم السلام - لا يورثون من جهة المال\n قال صلى الله عليه وسلم:\n\n \" نحن مَعاشر الأنبيَاءِ لا نُورَثُ \" \n\nوقيل: يرثني في الحبورة، وكان عليه السلام حَبْرًا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:40",
      "similarity": 0.5003945637341592
    },
    {
      "verse": "11:65",
      "similarity": 0.4797803358198365
    },
    {
      "verse": "54:29",
      "similarity": 0.4599793333720732
    },
    {
      "verse": "19:8",
      "similarity": 0.43527910144207527
    },
    {
      "verse": "26:157",
      "similarity": 0.4202697980723316
    }
  ]
}