{
  "chapter": "مريم",
  "text": "واذكر فى الكتب ادريس انه كان صديقا نبيا",
  "translations": [
    {
      "translation": "Mention Idris in the Book. He was a true man and a Prophet.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Commemorate Enoch in the Book. He was a truthful person and a prophet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite in the Book the account of Idris. He was a man of truth, a Prophet;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mention in the Book (the Quran) the story of Idris (Enoch); he was a truthful Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Idrees in the Book; he was indeed very truthful, a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book, Idris. Verily, he was a man of truth, (and) a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention Idris in the Book; surely he was a truthful man, a prophet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book Idris; he was a true man, a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make mention in the Scripture of Idris. Lo! he was a saint, a prophet;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell also of Idris in the Book. He was a man of truth and a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention thou in the book ldris, verily he was a man of truth, a prophet. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book Idrees. Indeed, he was a truthful one and a prophet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also mention in the Book the case of Idris: He was a man of truth (and sincerity), (and) a prophet:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book (the Quran) Idris (Enoch). Verily! He was a man of truth, (and) a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book, Idris; he too was of the truth and a Prophet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Scripture Enoch. He was a man of truth, a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mention in the Book, Idrees. Indeed, he was a man of truth and a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:56] And mention in the Book Idrīs, who was Noah’s great-grandfather. Indeed he was a truthful one, a prophet.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And make mention in the Scripture of Idris) of the event of Idris. (Lo! he was a saint) he believed in his faith, (a prophet) informing on behalf of Allah;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱذْكُرْ } يا أكمل الرسل { فِي ٱلْكِتَابِ } أيضاً { إِدْرِيسَ } صاحب دراسة التوحيد والعرفان، وقالع أهوية النفس وأمانيها بشدائد الرياضات والمجاهدات في مسالك التصديق والإيقان { إِنَّهُ } من كمال رشده وحكمته { كَانَ صِدِّيقاً } مبالغاً في التصديق والتحقيق { نَّبِيَّاً } [مريم: 56] مبعوثاً إلى الناس كسائر الأنبياء للهداية والتكميل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { واذكر في الكتاب إِدريس } وهو سبط شيث، وجَدّ أبي نوح، فإنه نوح بن لامك بن متوشلخ بن أخنوخ، وهو إدريس عليه السلام، واشتقاقه من الدرس لكثرة دراسته لما أوحي إليه، وكثرة ذكره لله تعالى\n رُوِيَ أنه كان خياطًا فكان لا يدخله الإبرة ولا يخرجها إلا بذكر الله\n ورُوي أنه جاء إليه الشيطان يفتنه بفستق، فقال له: هل يقدر ربك أن يجعل الدنيا في هذه الفُسْتقة؟ فقال له عليه السلام: الله قادر على أن يدخل الدنيا كلها في سم هذه الإبرة، ونخس عينه، ذكره السنوسي في شرح مقرأه\n قال ابن وهب: إنه دعا قومه إلى لا إله إلا الله، فامتنعوا فهلكوا\n وفي حديث أبي ذر: أنه رسول، وجمع بينه وبين حديث الشفاعة، وقولهم لنوح: إنك أول رسول، بأن تكون رسالته لقومه خاصة، كهود وصالح، وكذا آدم وشيث، فإنه أرسل لبنيه لتعليم الشرائع والإيمان، ولم يكونوا كفارًا، وخلفه في ذلك شيث، قال المحشي الفاسي: والأظهر عندي في نوح أنه أول رسول من أهل العزم، لا مطلقًا\n قال ابن عطية: والأشهر أن إدريس عليه السلام لم يرسل، وإنما هو نبي فقط، وذهب إلى ذلك ابن بطال، ليسلم من المعارضة، وهي مدفوعة بما ذكرنا\n هـ\n فالمشهور أن إدريس رسول إلى قومه\n رُوي أنه تعالى أنزل عليه ثلاثين صحيفة، وأنه أول من خط بالقلم، ونظر في علم النجوم والحساب، وخاط الثياب\n قيل: وهو أول نبي بُعث إلى أهل الأرض\n قال تعالى في وصفه: { إِنه كان صدِّيقًا نبيًّا }: خبران لكان، والثاني مخصص للأول إذ ليس كل صديق نبي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:85",
      "similarity": 0.8150467185006681
    },
    {
      "verse": "19:41",
      "similarity": 0.08351563030672358
    },
    {
      "verse": "19:54",
      "similarity": 0.07341032697975751
    },
    {
      "verse": "19:51",
      "similarity": 0.05677528409867678
    },
    {
      "verse": "2:91",
      "similarity": 0.05071348333556904
    }
  ]
}