{
  "chapter": "مريم",
  "text": "وكان يامر اهله بالصلوة والزكوة وكان عند ربه مرضيا",
  "translations": [
    {
      "translation": "He used to command his people to do salat and give zakat and he was pleasing to his Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He enjoined on his household worship and zakat, and he was obedient to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He enjoined his household to observe Prayer and to give Zakah (purifying alms); and his Lord was well pleased with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He would order his people to worship God and pay the religious tax. His Lord was pleased with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He used to command his people to offer prayer and give charity, and was liked by his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he would enjoin on his family and his people the Salah and the Zakah, and his Lord was pleased with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he enjoined on his family prayer and almsgiving, and was one in whom his Lord was well pleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He bade his people to pray and to give the alms, and he was pleasing to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He enjoined upon his people worship and almsgiving, and was acceptable in the sight of his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He exhorted his people to prayer and almsgiving, and his Lord was pleased with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he was wont to command his household to the Prayer and the poor-rate, and he was with his Lord an approved one. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He used to bid his family to [maintain] the prayer and to [pay] the zakat, and was pleasing to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He used to enjoin on his people Prayer and Charity, and he was most acceptable in the sight of his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he used to enjoin on his family and his people As-Salat (the prayers) and the Zakat, and his Lord was pleased with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he ordered his people to pray and to give charity and his Lord was pleased with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he used to enjoin on his people prayer and charity, and he was pleasing to his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he used to enjoin on his people prayer and zakah and was to his Lord pleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:55] He used to enjoin upon his kinsfolk, that is, his people, prayer and the [payment of] alms, and he was pleasing to his Lord (mardiyyan, ‘pleasing’, is actually marduwwun, but both wāw letters have been changed to two yā’ letters, while the kasra vowel [has also been changed to] a damma vowel).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He enjoined upon his people worship) he enjoined upon his people perfection of the prayer (and alms giving) by giving the poor-due and alms, (and was acceptable in the sight of his Lord) he was righteous.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من خصائله الحميدة أنه { كَانَ يَأْمُرُ أَهْلَهُ } أولاً؛ لأنهم أولى بالإرشاد والتكميل وأحق من غيرهم { بِٱلصَّـلاَةِ } التي هي التوجه نحو الحق بجميع الجوارح والأركان، والتقرب نحوه عن ظهر القلب ومحض الجنان { وَٱلزَّكَـاةِ } التي هي تصفية النية وتخلية الطوية عن الميل إلى مزخرفات الدنيا وحطامها الزائلة، { وَكَانَ } من كمال تنزهه عن العلائق والعوائق العائقة عن التوجه الخالص نحو الحق { عِندَ رَبِّهِ } الذي ربَّاه على كمال الرضا والتسليم { مَرْضِيّاً } [مريم: 55] لوفائه الوعد، واستقامته فيه، وصبره على ما جرى عليه من البلوى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكان عند ربه مَرْضِيًّا } لاتصافه بالنعوت الجليلة التي من جملتها ما ذكر من الخصال الحميدة\n والله تعالى أعلم\n الإشارة: قد وصف الحق - جل جلاله - نبيه إسماعيل بثلاث خصال، بها كان عند ربه مرضيًا، فمن اتصف بها كان مرضيًا مقربًا: الوفاء بالوعد، والصدق في الحديث لأنه مستلزم له، وأمر الناس بالخير\n أما الوفاء بالعهد فهو من شيم الأبرار، قد مدح الله تعالى أهله، ورغَّب فيه وأمر به، قال تعالى:\n\n[البَقَرَة: 177]\n وقال تعالى:\n\n[النّحل: 91]، فإخلاف الوعد من علامة النفاق، قال صلى الله عليه وسلم:\n\n \" آية المنافق ثلاث: إذا حدّث كذب، وإذا وعد أخلف، وإذا ائتمن خان \" \n",
      "translations": []
    }
  ]
}