{
  "chapter": "مريم",
  "text": "او۟لئك الذين انعم الله عليهم من النبين من ذرية ءادم وممن حملنا مع نوح ومن ذرية ابرهيم واسرءيل وممن هدينا واجتبينا اذا تتلى عليهم ءايت الرحمن خروا۟ سجدا وبكيا",
  "translations": [
    {
      "translation": "Those are some of the Prophets Allah has blessed, from the descendants of Adam and from those We carried with Nuh, and from the descendants of Ibrahim and Isra'il and from those We guided and chose. When the Signs of the All-Merciful were recited to them they fell on their faces, weeping, in prostration.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are (some of) those who were favoured by God among the prophets of the progeny of Adam, and of those We bore in the ark with Noah, and the offspring of Abraham and Israel, and of those We guided and We chose, for they bowed weeping in adoration when the revelations of Ar-Rahman were recited to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the Prophets upon whom Allah bestowed His favour from the seed of Adam, and from the seed of those whom We carried (in the Ark) with Noah, and from the seed of Abraham and Israel. They were those whom We guided and chose (for an exalted position). They were such that when the words of the Most Compassionate Lord were recited to them, they fell down in prostration, weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These were the Prophets from the offspring of Adam, from those who embarked with Noah and from the offspring of Abraham and Israel. God guided them and chose them for His favor. Whenever they would hear the revelations of the Beneficent God they would bow down in prostration with tears.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is these upon whom Allah has bestowed favour among the Prophets, from the descendants of Adam; and from those whom We boarded along with Nooh; and from the descendants of Ibrahim and Israel; and from those whom We guided and chose; when the verses of the Most Gracious were recited to them, they fell down, prostrating and weeping. (* Command of Prostration # 5.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those were they unto whom Allah bestowed His grace from among the Prophets, of the offspring of Adam, and of those whom We carried (in the ship) with Nuh, and of the offspring of Ibrahim and Israel, and from among those whom We guided and chose. When the Ayat of the Most Gracious were recited unto them, they fell down prostrate and weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they on whom Allah bestowed favors, from among the prophets of the seed of Adam, and of those whom We carried with Nuh, and of the seed of Ibrahim and Israel, and of those whom We guided and chose; when the communications of the Beneficent Allah were recited to them, they fell down making obeisance and weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they whom God has blessed among the Prophets of the seed of Adam, and of those We bore with Noah, and of the seed of Abraham and Israel, and of those We guided and chose. When the signs of the All-merciful were recited to them, they fell down prostrate, weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they unto whom Allah showed favour from among the prophets, of the seed of Adam and of those whom We carried (in the ship) with Noah, and of the seed of Abraham and Israel, and from among those whom We guided and chose. When the revelations of the Beneficent were recited unto them, they fell down, adoring and weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the ones whom God has favoured: the prophets from among the descendants of Adam and of those whom We carried in the Ark with Noah; the descendants of Abraham, of Israel, and of those whom We have guided and chosen. For when the revelations of the Merciful were recited to them, they fell down, prostrating themselves and weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they whom Allah hath favoured, from among the prophets, of the progeny of Adam and of them whom We bare with Nuh, and of the progeny of Ibrahim and Isra'il, and of those whom We have guided and chosen; whenever the revelations of the Compassionate were rehearsed unto them, they fell down prostrating themselves and weeping. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones whom Allah has blessed from among the prophets of Adam’s progeny, and from [the progeny of] those We carried with Noah, and from among the progeny of Abraham and Israel, and from among those that We guided and chose. When the signs of the All-beneficent were recited to them, they would fall down weeping in prostration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those were some of the prophets on whom Allah did bestow His Grace,- of the posterity of Adam, and of those who We carried (in the Ark) with Noah, and of the posterity of Abraham and Israel of those whom We guided and chose. Whenever the Signs of (Allah) Most Gracious were rehearsed to them, they would fall down in prostrate adoration and in tears.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those were they unto whom Allah bestowed His Grace from among the Prophets, of the offspring of Adam, and of those whom We carried (in the ship) with Nuh (Noah), and of the offspring of Ibrahim (Abraham) and Israel and from among those whom We guided and chose. When the Verses of the Most Beneficent (Allah) were recited unto them, they fell down prostrating and weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are whom Allah has blessed among the Prophets from among the seed of Adam and of those whom We bore with Noah; the descendants ofAbraham, of Israel, and of those whom We have guided and chose. For when the verses of the Merciful were recited to them, they fell down prostrate, weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are some of the prophets God has blessed, from the descendants of Adam, and from those We carried with Noah, and from the descendants of Abraham and Israel, and from those We guided and selected. Whenever the revelations of the Most Gracious are recited to them, they would fall down, prostrating and weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those were the ones upon whom Allah bestowed favor from among the prophets of the descendants of Adam and of those We carried [in the ship] with Noah, and of the descendants of Abraham and Israel, and of those whom We guided and chose. When the verses of the Most Merciful were recited to them, they fell in prostration and weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:58] Those (ūlā’ika is the subject) to whom God has been gracious (alladhīna an‘ama’Llāhu ‘alayhim is an adjectival qualification of it [of the subject]) from among the prophets (mina’l-nabīyyīna, an explication of it [of the subject] functioning like an adjectival qualification in terms of import. That which follows it [mina’lnabīyyīna, ‘from among the prophets’] up to [where] the conditional sentence begins, constitutes an adjectival qualification of al-nabīyyīna, ‘the prophets’; and so His saying … ) of the seed of Adam, namely, Idrīs, and of those whom We carried with Noah, in the Ark, namely, Abraham — [who is the] son of his [Noah’s] son Shem (Sām) — and of the seed of Abraham, namely, Ishmael, Isaac and Jacob, and, of the seed of, Israel — who is Jacob — namely, Moses, Aaron, Zachariah, John and Jesus, and from among those whom We guided and chose, that is to say, from among their number (the predicate of ūlā’ika, ‘those’, is [the following, idhā tutlā …]) when the signs of the Compassionate One were recited to them, they would fall down prostrating and weeping (these [sujjadan and bukīyyan] constitute the plural [forms] of sājid, ‘prostrate’, and bākin, ‘weeping’ [respectively]) in other words [what is meant is]: be [you] like them (bukiyyun is originally [formed from] bakūyyin, but the wāw is changed into a yā’ and the damma vowel into a kasra).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These are they) those whom I mentioned: Abraham, Ishmael, Isaac, Jacob, Moses, Aaron, Jesus, Idris and all the prophets (unto whom Allah showed favour from among the prophets) Allah favoured them with prophethood, the message and Islam, (of the seed of Adam and of those whom We carried (in the ship) with Noah) the offspring of Noah, (and of the seed of Abraham) Ishmael and Isaac (and Israel) and of the offspring of Jacob: Joseph and his brothers, (and from among those whom We guided) those whom We favoured with faith (and chose) for Islam and the emulation of the Prophet (pbuh) i.e. 'Abdullah Ibn Salam 331 and his followers. (When the revelations of the Beneficent) expositing the commands and prohibitions (were recited unto them, they fell down, adoring and weeping) they prostrate themselves and weep out of fear of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَبُكِيّاً } جمعُ بَاكٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"I am grieving,\" is in the plural form of grief.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فشاهدوا المتكلم موصوفاً بالصفة التي تجلى بها في الآية فـ { خرّوا سُجداً } فنوا في ذلك الاسم الذي تجلى به عند ظهوره بتلك الصفة الكاشفة عنها تلك الآية\n وبكوا اشتياقاً إلى مشاهدته بسائر الصفات المشتمل عليه الرحمن أو الله وهو بكاء القلب إن لم يكن مستلزماً لبقاء النفس من خوف البعد\n كما قال الشاعر:\nأضاعوا صلاة الحضور لكونهم في مقام النفس\n والحضور إنما يكون بالقلب\n ولا صلاة إلا به",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُولَـٰئِكَ } المذكورون من زكريا إلى إدريس كلهم أنبياء الله\n وأُمناؤه في أرضه\n لأنهم { ٱلَّذِينَ أَنْعَمَ ٱللَّهُ عَلَيْهِم } بأنواع النعم الظاهرة والباطنة\n واصطفاهم من بين البرية للهداية والتكميل\n وهم { مِّنَ ٱلنَّبِيِّيْنَ } المنتشئين { مِن ذُرِّيَّةِ ءَادَمَ وَمِمَّنْ حَمَلْنَا مَعَ نُوحٍ } في السفينة حين ظهر الطوفان على وجه الأرض { وَ } بعضهم { مِن ذُرِّيَّةِ إِبْرَاهِيمَ وَ } ابنه يعقوب الملقب من عند الله { إِسْرَائِيلَ وَ } وكلٌ منهم { مِمَّنْ هَدَيْنَا } إلى توحيدنا { وَٱجْتَبَيْنَآ } من بين البرايا للتكميل والتشريع\n ووضع الأحكام بين الأنام كلهم من كمال يقينهم وعرفانهم وتمكنهم في مقر التوحيد { إِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُ ٱلرَّحْمَـٰنِ } ودلائل توحيده وتجريده { خَرُّواْ } خرورَ تواضعٍ ورهبةٍ { سُجَّداً } متذللين واضعين جباههم على ترابِ المذلة والهوان\n راجعين من سعة رحمته على مقتضى لطفه وجماله { وَبُكِيّاً } [مريم: 58] باكين خائفين من خشية الله بمقتضى قهره وجلاله\n فإن المؤمن لا بدَّ أن يكون في جميع حالاته بين الخوف والرجاء\n\nثما لما ظهر على الأرض التي هي محل الشرور والفتن وأنواع الفسادات ما ظهر من أنواع المكروهات والمنكرات\n وهم عند ظهورها واشتهارها بذلوا جهدهم في تنفيذ الأحكام الشرعية المنزلة على مقتضى زمان كلٍ منهم\n فكلموا وأرشدوا مقدار جهدهم وطاقتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { أولئك }: مبتدأ، و { الذين }: خبره، أو { الذين }: صفته، و { إذا تتلى }: خبره. والإشارة إلى المذكورين في السورة، وما فيه من معنى البُعد للإشعار بعلو رتبتهم وبُعد منزلتهم في الفضل، و { من النبيين }: بيان للموصول، و { من ذرية }: بدل منه بإعادة الجار، و { سُجدًا وبُكيًّا }: حالان من الواو، و { بكيًّا }: جمع باك، كمساجد وسجود، وأصله: بكوى، فاجتمع الواو والياء، وسُبق إحداهما بالسكون، فقلبت الواو ياء، وأدغمت في الياء، وحركت الكاف بالكسر المجانس للياء. يقول الحقّ جلّ جلاله: { أولئك } المذكورون في السورة الكريمة هم { الذين أنعم الله عليهم } بفنون النعم الدينية والدنيوية، { من النبيين من ذرية آدم } ، وهو إدريس عليه السلام ونوح، { وممن حملنا مع نوحٍ } أي: ومن ذرية من حملناهم في السفينة، وهو إبراهيم لأنه من ذرية سام بن نوح، { ومن ذرية إبراهيم } ، وهم إسماعيل وإسحاق ويعقوب، وقوله: { وإِسرائيلَ } أي: ومن ذرية إسرائيل، وهو يعقوب، وكان منهم موسى وهارون وزكريا ويحيى وعيسى، وفيه دليل على أن أولاد البنات من الذرية. { وممن هدينا } أي: ومن جملة من هديناهم إلى الحق واجتبيناهم إلى النبوة من غير هؤلاء. { إِذا تُتلى عليهم آياتُ الرحمن خَرُّوا سُجدًا وبُكيًّا } ، هذا استئناف لبيان خشيتهم من الله تعالى وإخباتهم له، مع ما لهم من علو الرتبة وسمو الطبقة في شرف النسب، وكمال النفس والزلفى من الله عزّ وجلّ، أي: إذا تتلى عليهم، آيات الرحمن، إما عند نزولها عليهم، أو بسماعها من غيرهم، لحديث:\n \" أحب أن أسمعه من غيري \" \nثم بكى صلى الله عليه وسلم عند قوله تعالى:\n[النِّساء: 41] فكان الأنبياء عليهم السلام مثله، إذا تتلى عليهم آيات الرحمن خروا ساجدين وباكين. عن النبي صلى الله عليه وسلم قال:\n \" اتْلُوا القُرْآنَ وابْكُوا، فَإِنْ لمْ تَبْكُوا فَتَباكَوْا \" \nوعن عمر رضي الله عنه أنه قرأ سورة مريم، فسجد فيها، فقال: هذا السجود، فأين البكاء؟ قال بعضهم: ينبغي أن يدعو الساجد في سجوده بما يليق بآيتها، فهاهنا يقول: اللهم اجعلني من عبادك المنعم عليهم، المهديين الساجدين لك، الباكين عند تلاوة آياتك. وفي الإسراء يقول: اللهم اجعلني من الخاضعين لوجهك، المسبحين بحمدك، وأعوذ بك أن أكون من المستكبرين عن أمرك، وهكذا. والذي ورد في الخبر: يقول: \" سَجَدَ وَجْهِي للذي خَلَقَه وصوَّره، وشقَّ سمعَه وَبَصَرَه، بحوله وقُوته، اللهم اكتب لي بها أجرًا، وضع عني بها وزرًا، واجعلها لي عندك ذخرًا، وتقبلها مني كما تقبلتها من عبدك داود عليه السلام \". والله تعالى أعلم. الإشارة: قد أثنى الله تعالى على هؤلاء السادات المُنعَم عليهم بكونهم إذا سمعوا كلام الحبيب خضعوا ورقَّت قلوبهم، وهو أول درجة المحبة، وفوقه الفرح بكلام الحبيب من مكان قريب، وفوقه الفرح بشهود المتكلم، وهنا ينقطع البكاء لدخول صاحب هذا المقام جنة المعارف، وليس في الجنة بكاء.\nوأيضًا: من شأن القلب في أول أمره الرطوبة، يتأثر بالواردات والأحوال، فإذا استمر عليها اشتد وصلُب بحيث لا يؤثر فيه شيء من الواردات الإلهية. وفي هذا المعنى قال أبو بكر رضي الله عنه، حين رأى قومًا يبكون عند سماع القرآن: كذلك كنا ثم قست القلوب، فعبَّر عن تمكنه بالقسوة، تواضعًا واستتارًا، وإنما أثنى على هؤلاء السادات بهذه الخصلة لأنها سُلّم لما فوقها. والله تعالى أعلم. ثمَّ ذكر أضدادهم فقال: { فَخَلَفَ مِن بَعْدِهِمْ خَلْفٌ أَضَاعُواْ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:29",
      "similarity": 0.4208323653157701
    },
    {
      "verse": "17:109",
      "similarity": 0.38906484007197184
    },
    {
      "verse": "12:16",
      "similarity": 0.3798817575375696
    },
    {
      "verse": "53:60",
      "similarity": 0.37202093445610984
    },
    {
      "verse": "53:43",
      "similarity": 0.37180661014367405
    }
  ]
}