{
  "chapter": "مريم",
  "text": "ووهبنا لهم من رحمتنا وجعلنا لهم لسان صدق عليا",
  "translations": [
    {
      "translation": "And bestowed on them some of Our blessings, and gave them high renown.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We bestowed on them Our mercy, and granted them a truly lofty renown.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We granted them Our blessing and high renown.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them Our mercy, and assigned for them a true and high repute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them of Our mercy, and We granted them Sidqin `Aliyyan on the tongues.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted to them of Our mercy, and We left (behind them) a truthful mention of eminence for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We gave them of Our mercy, and We appointed unto them a tongue of truthfulness, sublime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we gave them of Our mercy, and assigned to them a high and true renown.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We granted them Our mercy and bestowed on them true and high renown.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on them of Our mercy, and We made for them a renown lofty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them out of Our mercy, and conferred on them a worthy and lofty repute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed of Our Mercy on them, and We granted them lofty honour on the tongue of truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them of Our Mercy (a good provision in plenty), and We granted them honour on the tongues (of all the nations, i.e. everybody remembers them with a good praise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We gave them of Our Mercy and We appointed to them a truthful, highly sincere tongue,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them freely of Our mercy, and gave them a noble reputation of truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave them of Our mercy, and we made for them a reputation of high honor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:50] And We gave them, all three [of them], out of Our mercy, wealth and offspring, and We assigned for them a worthy repute [one] that is lofty, sublime, namely, [We assigned] fair praise [of them] among all the members of the [Abrahamic] religions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We gave them of Our mercy) We gave him of Our bounty a righteous son and a lawful property, (and assigned to them a high and true renown) We favoured them with being praised by others.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَوَهَبْنَا لَهْم } أي: لإبراهيم وولديه { مِّن } سعة { رَّحْمَتِنَا } ووفور جودنا الأموالَ والأولادَ والجاهَ والثروةَ، إلى أن صاروا مرجع الأنم وحاكمهم في الأحكام إلى يوم القيامة { وَجَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ } أي: جعلنا ثناءهم ومدحهم العائد إليهم عن ألسنة البرايا ثناءَ صدقٍ و تحقيقٍ، لا خطابة تحننٍ كثناء سائر الملوك والجبابرة، لذلك صار ثناؤهم { عَلِيّاً } [مريم: 50] مظهراً لعلو رتبتهم وشأنهم إلى نقراض النشأة الأولى، كل ذلك ببركة دعاء إبراهيم عليه السلام، وإجابة الحق له؛ حيث قال في مناجاته مع ربه:\n\n[الشعراء: 84]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ووهبنا لهم من رحمتنا } هي النبوة، وذكرها بعد ذكر جعلهم أنبياء للإيذان بأنها من باب الرحمة والفضل\n وقيل: الرحمة: المال والأولاد، وما بسط لهم من سعة الرزق، وقيل: إنزال الكتاب، والأظهر أنها عامة لكل خير ديني ودنيوي\n { وجعلنا لهم لسانَ صدقٍ عليًّا }: رفيعًا في أهل الأديان، فكل أهل دين يتلونهم، ويثنُون عليهم، ويفتخرون بهم استجابة لدعوته بقوله:\n\n[الشُّعَرَاء: 84]\n والمراد باللسان: ما يوجد به الكلام في لسان العرب ولغتهم، وإضافته إلى الصدق، ووصفه بالعلو للدلالة على أنهم أحقاء لما يثنون عليهم، وأن محامدهم لا تخفى على تباعد الأعصار، وتبدل الدول، وتحول الملل والنحل\n والله تعالى أعلم\n الإشارة: كل من اعتزل عن الخلق وانفرد بالملك الحق، طلبًا في الوصول إلى مشاهدة الحق، لا بد أن تفيض عليه المواهب القدسية والأسرار الوهبية والعلوم اللدنية، وهي نتائج فكرة القلوب الصافية، وفي الحكم: \" ما نفع القلب شيءٌ مثل عزلة يدخل بها ميدان فكرة \"\n قال الجنيد رضي الله عنه: أشرف المجالس وأعلاها الجلوس مع الفكرة في ميدان التوحيد\n وقال الشيخ أبو الحسن الشاذلي رضي الله عنه: ثمار العزلة: الظفر بمواهب المنة، وهي أربعة: كشف الغِطاء، وتنزل الرحمة، وتحقق المحبة، ولسان الصدق في الكلمة، قال الله تعالى: { فلما اعتزلهم وما يعبدون من دون الله وهبنا له } الآية\n وقال بعض الحكماء: من خالط الناس داراهم، ومن داراهم راءاهم، ومن راءاهم وقع فيما وقعوا، فهلك كما هلكوا\n وقال بعض الصوفية: قلت لبعض الأبدال المنقطعين إلى الله: كيف الطريق إلى التحقيق؟ قال: لا تنظر إلى الخلق، فإن النظر إليهم ظلمة، قلت: لا بد لي، قال: لا تسمع كلامهم، فإن كلامهم قسوة، قلت: لا بد لي، قال: لا تعاملهم، فإن معاملتهم خسران ووحشة، قلت: أنا بين أظهرهم، لا بد لي من معاملتهم، قال: لا تسكن إليهم، فإن السكون إليهم هلكة، قلت: هذا لعله يكون، قال: يا هذا أتنظر إلى اللاعبين، وتسمع كلام الجاهلين، وتعامل البطالين، وتسكن إلى الهلكى، وتريد أن تجد حلاوة الطاعة وقلبك مع الله؟! هيهات\n\n\n\n\n هذا لا يكون أبدًا، ثم غاب عني\n وقال القشيري رضي الله عنه: فأرباب المجاهدات، إذا أرادوا صون قلوبهم عن الخواطر الردية لم ينظروا إلى المستحسنات - أي: من الدنيا -\n قال: وهذا أصل كبير لهم في المجاهدات في أحوال الرياضة\n هـ\n وقال في \" القوت \": ولا يكون المريد صادقًا حتى يجد في الخلوة من الحلاوة والنشاط والقوة ما لا يجده في العلانية، وحتى يكون أُنسه في الوحدة، وروحه في الخلوة، وأحسن أعماله في السر\n هـ\n قلت: العزلة عن الخلق والفرار منهم شرط في بداية المريد، فإذا تمكن من الشهود، وأَنس قلبه بالملك الودود، واتصل بحلاوة المعاني، ينبغي له أن يختلط بالخلق ويربي فكرته لأنهم حينئذ يزيدون في معرفته ويتسع بهم لأنه يراهم حينئذ أنوارًا من تجليات الحق، ونوارًا يرعى فيهم، فيجتني حلاوة الشهود، وفي ذلك يقول شيخ شيوخنا المجذوب:\n\nوفي مقطعات الششتري:\n\nوبالله التوفيق\n ثمَّ ذكر قصة موسى عليه السلام\n",
      "translations": []
    }
  ]
}