{
  "chapter": "مريم",
  "text": "ووهبنا له من رحمتنا اخاه هرون نبيا",
  "translations": [
    {
      "translation": "We endowed him with Our mercy, making his brother Harun a Prophet.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bestowed on him his brother Aaron, a prophet, through Our benevolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and out of Our mercy We appointed his brother Aaron, a Prophet (that he may assist him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Out of Our mercy We gave him his brother Aaron who himself was a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with Our mercy We bestowed upon him his brother Haroon, a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted him his brother Harun, (also) a Prophet, out of Our mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave to him out of Our mercy his brother Haroun a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him his brother Aaron, of Our mercy, a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed upon him of Our mercy his brother Aaron, a prophet (likewise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We gave him as his helper, out of Our mercy, his brother Aaron, having made him a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on him, out of Our mercy, his brother Harun, a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him out of Our mercy his brother Aaron, a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, out of Our Mercy, We gave him his brother Aaron, (also) a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed on him his brother Harun (Aaron), (also) a Prophet, out of Our Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From Our Mercy We gave him, his brother Aaron, a Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted him, out of Our mercy, his brother Aaron, a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave him out of Our mercy his brother Aaron as a prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:53] And We gave him out of Our mercy, Our grace, his brother Aaron (Hārūn, either a substitution [for akhāhu, ‘his brother’], or an explicative supplement [thereof]), [likewise] a prophet (nabiyyan, a circumstantial qualifier, constituting the import of the ‘gift’ [to Moses], which was in response to his [Moses’s] request that He [God] send forth his brother with him; he [Aaron] was older in years than him).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We bestowed upon him of Our mercy) from Our blessing (his brother Aaron, a prophet (likewise)) a helping assistant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَوَهَبْنَا لَهُ مِن } كمال { رَّحْمَتِنَآ } وفضلنا إياه تأييداً له وتعضيداً { أَخَاهُ هَارُونَ } ليؤيده ويقويه في تنفيذ أحكام النبوة والرسالة { نَبِيّاً } [مريم: 53] ليكون أيضاً على عزيمةٍ صادقةٍ وقصدٍ خالصٍ في إجراء الأحكام الإلهية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { هارون }: عطف بيان\n يقول الحقّ جلّ جلاله: { واذكر في الكتاب موسى } ، قدَّم ذكره على ذكر إسماعيل لئلا ينفصل عن ذكر يعقوب لأنه من نسله، { إِنه كان مُخْلِصًا }: موحدًا، أخلص عبادته من الشرك والرياء، وأسلم وجهه لله تعالى، وأخلص نفسه عما سواه\n وقرئ بالفتح، على أن الله تعالى أخلصه من الدنس\n قال القشيري أي: خلصًا لله، لم يكن لغيره بوجهٍ\n ثم قال: ولم يُغْضِ في اللهِ على شيءٍ\n هـ\n { وكان رسولاً نبيًّا } أرسله الله تعالى إلى الخلق فأنبأهم عنه، ولذلك قدَّم رسولاً مع كونه أخص وأعلى، { وناديناه من جانب الطور الأيمن } ، الطور: جبل بين مصر ومدين، أي: ناديناه من ناحيته اليمنى، وهي التي تلي يمين موسى عليه السلام، فكانت الشجرة في جانب الجبل عن يمين موسى، أو من أيمن، أي: من جانبه الميمون، ومعنى ندائه منه: أنه سمع الكلام من تلك الناحية، { وقربناه نجيًّا } أي: مناجيًا لنا نُكلمه بلا واسطة، فالتقريب: تقريبُ تكرمة وتشريف، مَثَّلَ حاله عليه السلام بحال من قرّبه الملك لمناجاته واصطفاه لمصاحبته\n وقيل: { نجيًا } من النجو، وهو العلو والارتفاع، أي: رفعناه من سماء إلى سماء، حتى سمع صريف القلم يكتب له في الألواح\n { ووهبنا له من رحمتنا } أي: من أجل رحمتنا ورأفتنا به، أو من بعض رحمتنا { أخاه هارون } ، أي: وهبنا له مؤازرة أخيه ومعاضدته، إجابةً لدعوته:\n\n[طه: 29، 30] لا نفسه لأنه كان أكبر منه، وُجد قبله، حَال كونه { نبيًّا }: رسولاً مُشْركًا معه في الرسالة\n والله تعالى أعلم\n الإشارة: كما وصف الحق تعالى خليله بالصديقية وصف كليمه بالإخلاص، وكلاهما شرط في حصول سر الخصوصية، سواء كانت خصوصية النبوة أو الولاية، فمن لا تصديق عنده لا سير له، ومن لا إخلاص له لا وصول له\n وحقيقة الإخلاص: إخراج الخلق من معاملة الحق، وهي ثلاث طبقات سفلى، ووسطى، وعليا\n فالسفلى: أن يفعل العبادة لله تعالى، طالبًا لعوض دنيوي، كسعة الأرزاق، وحفظ الأموال والبدن، فهذا إخلاص العوام، وإنما كان إخلاصًا لأنهم لم يلاحظوا مخلوقًا في عملهم\n والوسطى: أن يعبد الله مخلصًا، طالبًا لعوض أخروي، كالحور والقصور\n والعليا: أن يفعل العبادة قيامًا برسم العبودية، وأدبًا مع عظمة الربوبية، غير ملتفت لجنة ولا نار، ولا دنيا ولا آخرة، مع تعظيم نعيم الجنان، لأنه محل اتصال الرؤية كما قال ابن الفارض رضي الله عنه:\n",
      "translations": []
    }
  ]
}