{
  "chapter": "مريم",
  "text": "فوربك لنحشرنهم والشيطين ثم لنحضرنهم حول جهنم جثيا",
  "translations": [
    {
      "translation": "By your Lord, We will collect them and the shaytans together. Then We will assemble them around Hell on their knees.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By your Lord, We shall gather them and the devils together, then bring them crawling on their knees around Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By your Lord, We will surely muster them and the devils together. Then We will surely bring them all, on their knees, around Hell,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By your Lord, We will bring them back to life with satan and gather them around hell in large groups.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by your Lord, We shall assemble them and the devils – all of them – and bring them around hell, fallen on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by your Lord, surely We shall gather them together, and (also) the Shayatin, then We shall bring them round Hell, Jithyya.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by your Lord! We will most certainly gather them together and the Shaitans, then shall We certainly cause them to be present round hell on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, by thy Lord, We shall surely muster them, and the Satans, then We shall parade them about Gehenna hobbling on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, by thy Lord, verily We shall assemble them and the devils, then We shall bring them, crouching, around hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By your Lord, We shall most surely gather them and the devils too; and bring them close to hell on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By thy Lord, then, We shall surely gather them and the satans; thereafter We shall surely bring them round Hell, kneeling. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By your Lord, We will surely gather them with the devils; then We will surely bring them up around hell [scrambling] on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, by thy Lord, without doubt, We shall gather them together, and (also) the Evil Ones (with them); then shall We bring them forth on their knees round about Hell;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by your Lord, surely, We shall gather them together, and (also) the Shayatin (devils) (with them), then We shall bring them round Hell on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By your Lord, We will gather them and the satans, and We shall parade them hobbling on their knees in Gehenna:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By your Lord, We will round them up, and the devils, then We will bring them around Hell, on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by your Lord, We will surely gather them and the devils; then We will bring them to be present around Hell upon their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:68]   For by your Lord, We will surely gather them, namely, the deniers of the Resurrection, and the devils, that is to say, We shall gather every one of them with his devil [bound together] in a chain; then We shall bring them around Hell, [around] the outside of it, crouching, on their knees ([jithiyyan is] the plural of jāthin, and is originally [formed as] jathawuwwin or jathawiyyun [deriving] from [the verb] jathā, [imperfect tense] yajthu or yajthī, two [variant] forms).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And, by your Lord) Allah swore by Himself, (verily We shall assemble them and the devils, then We shall bring them, crouching, around hell) in the middle of hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَوْلَ جَهَنَّمَ جِثِيّاً } جمعُ جَاثٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allaah: {Around Hell will they be dragged} [refers to] those who are dragged [to Hell].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n[الإنسان، الآية: 1] لأن الوجود العيني في الأزل قبل الخلق كلا وجود لانطماسه في عين الجمع { لنحشرنهم والشياطين } أي: لنحشرنّ المحجوبين المنكرين للبعث مع الشياطين الذين أغووهم وأضلوهم عن الحق لأنّ نفوس المحجوبين تناسب في الكدورة والبعد عن النور نفوس الشياطين، فبالضرورة يحشرون معهم خصوصاً إذا اتبعوهم في الاعتقاد { ثم لنحضرنهم حول جهنم } الطبيعة في العالم السفلي لاحتجابهم بالغواشي الهيولانية والغواسق الظلمانية في الهياكل السجنية مقرنين في الأصفاد، سرابيلهم من قطران { جثياً } لاعوجاج هياكلهم بسبب عوج نفوسهم فلا يستطيعون قياماً { ثم لننزعنّ من كل شيعة } أي: لنخصَّن من كل فرقة من هو أشدّ عتياً على الرحمن بعذاب أشدّ على ما علمنا من حاله، فنحن أعلم به منه، فنصليه بعذاب هو أولى به\n { وإنّ منكم إلاّ واردها } أي: لا بدّ لكل أحد عند البعث والنشور أن يرد عالم الطبيعة لكونها مجاز عالم القدس { كان على ربّك حتماً مقضيا } أي: حكماً جزماً، مقطوعاً به\n ومن بعث بردّ روحه إلى الجسد لا يمكنه الجواز على الصراط إلا بالجواز على جهنم، لأن المؤمن لما جاء أطفأ نوره لهبها فلم يشعر بها\n كما روي أنها تقول: جز يا مؤمن فإن نورك أطفأ لهبي\n ولو سألته بعد دخول الجنة: كيف كان حالك في النار؟ لقال: ما أحسست بها\n كما سئل الصادق عليه السلام: أتردونها أنتم أيضاً؟ فقال: جزناها وهي خامدة\n وعن ابن عباس: يردونها كأنها أهالة\n وعن جابر بن عبد الله أنه سأل رسول الله صلى الله عليه وسلم عن ذلك فقال:\n\n \" إذا دخل أهل الجنة الجنة قال بعضهم لبعض: أليس وعدنا ربنا أن نرد النار؟ فيقال لهم: وردتموها وهي خامدة \" \n\nوعنه رحمه الله أنه سئل عن هذه الآية فقال: سمعت رسول الله صلى الله عليه وسلم يقول:\n\n \" الورود الدخول لا يبقى برّ ولا فاجر إلا دخلها فتكون على المؤمنين برداً وسلاماً كما كانت على إبراهيم عليه السلام حتى أنّ للنار ضجيجاً من بردها \" \n\nوأما قوله:\n\n[الأنبياء، الآية:101] فالمراد عن عذابها\n { ثم ننجي الذين اتّقوا } لتجردهم بالجواز على الصراط الذي هو سلوك طريق العدالة إلى التوحيد كالبرق { ونذر الظالمين } الذين نقصوا نور استعدادهم في الظلمات أو وضعوه غير موضعه { فيها جثياً } لا حراك بهم لتوردهم في المواد الظلمانية كما قال عليه السلام:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَوَرَبِّكَ } الذي هو أعظم الأسماء الإلهية وأشملها وبعزته وجلاله { لَنَحْشُرَنَّهُمْ } أولئك الضالين { وَٱلشَّيَاطِينَ } المضلين لهم معهم\n منخرطين في سلسلتهم { ثُمَّ لَنُحْضِرَنَّهُمْ } مقيدين مغلولين { حَوْلَ جَهَنَّمَ جِثِيّاً } [مريم: 68] باركين على الركب\n قائمين على أطراف الأصابع بلا تمكنٍ لهم واطمئنانٍ مثل الجاني الخائف عند الحاكم القاهر القادر على أنواع الانتقام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n واللام في { لَسَوْفَ } ليست للتأكيد، فإنه مُنْكِرٌ، وكيف يحقق ما ينكر، وإنما كلامه حكاية لكلام النبي صلى الله عليه وسلم، كأنه الذي قال: والله إن الإنسان إذا مات لسوف يُخرج حيًّا، فأنكر الكافر ذلك وحكى قوله، فنُزلت الآية على ذلك، قاله الجرجاني: و { الشياطين }: عطف على ضمير المنصوب، أو مفعول معه\n و { جثيًّا }: حال من ضمير { لنحضرنهم } البارز، أي: لنحضرنهم جاثين، جمع جاث، من جثى إذا قعد على ركبتيه، وأصله: \" جثوو \" بواوين، فاستثقل اجتماعهما بعد ضمتين، فكسرت الثاء تخفيفًا، وانقلبت الواو الأولى ياء لانكسار ما قبلها، فاجتمعت واو وياء، وسبقت إحداهما بسكون، فقُلبت الواو ياء، وأدغمت الأولى في الثانية، ومن قرأ بكسر الجيم: فعلى الإتْبَاعِ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:72",
      "similarity": 0.7874086819273204
    },
    {
      "verse": "45:28",
      "similarity": 0.7861009687331596
    },
    {
      "verse": "8:24",
      "similarity": 0.20409231984907947
    },
    {
      "verse": "37:127",
      "similarity": 0.15742782475146683
    },
    {
      "verse": "37:57",
      "similarity": 0.15612397616543022
    }
  ]
}