{
  "chapter": "مريم",
  "text": "وما نتنزل الا بامر ربك له ما بين ايدينا وما خلفنا وما بين ذلك وما كان ربك نسيا",
  "translations": [
    {
      "translation": "'We only descend at your Lord's command. Everything in front of us, and everything behind us, and everything in between belongs to Him. Your Lord does not forget.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not come down,\" (will the angels say) \"but only by your Lord's command.\" To Him belongs whatever lies before us and behind us, and the space in between. Your Lord does not ever forget:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The angels will say): \"(O Muhammad!) We descend not except by the command of your Lord. To Him belongs all that is before us and all that is behind us, and all that is in between. Your Lord is not forgetful in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), we (the angels) do not come to you without being commanded by your Lord to do so. To Him belongs all that is before us, behind us, and in between. Your Lord is not forgetful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Said Angel Jibreel to Prophet Mohammed – peace and blessings be upon them) “And we angels do not come down except by the command of your Lord; to Him only belongs all that is ahead of us and all that is behind us and all that is between them; and your Lord is not forgetful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we descend not except by the command of your Lord. To Him belongs what is before us and what is behind us, and what is between those two; and your Lord is never forgetful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we do not descend but by the command of your Lord; to Him belongs whatever is before us and whatever is behind us and whatever is between these, and your Lord is not forgetful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We come not down, save at the commandment of thy Lord. To Him belongs all that is before us, and all that is behind us, and all between that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We (angels) come not down save by commandment of thy Lord. Unto Him belongeth all that is before us and all that is behind us and all that is between those two, and thy Lord was never forgetful -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never descend except at your Lord's command. What is before us and behind us and all that lies between belong to Him. Your Lord is not forgetful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we descend not except by the command of thy Lord: his is whatsoever is before us and whatsoever is behind us and whatsoever is in-between; and thy Lord is not a forgetter *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[O Gabriel, tell the Prophet,] ‘We do not descend except by the command of your Lord. To Him belongs whatever is before us and whatever is behind us and whatever is in between that, and your Lord does not forget\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The angels say:) \"We descend not but by command of thy Lord: to Him belongeth what is before us and what is behind us, and what is between: and thy Lord never doth forget,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we (angels) descend not except by the Command of your Lord (O Muhammad SAW). To Him belongs what is before us and what is behind us, and what is between those two, and your Lord is never forgetful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Gabriel said:) 'We do not descend except at the command of your Lord. To Him belongs all that is before us and all that is behind us, and all that lies between. Your Lord does not forget.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“We do not descend except by the command of your Lord. His is what is before us, and what is behind us, and what is between them. Your Lord is never forgetful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Gabriel said], \"And we [angels] descend not except by the order of your Lord. To Him belongs that before us and that behind us and what is in between. And never is your Lord forgetful -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:64] When the Revelation did not come for a number of days, the Prophet (s) said to Gabriel, ‘What prevents you from visiting us more often than you do?’ and so the following was revealed: And We do not descend except by the commandment of your Lord. To Him belongs all that is before us, namely, ahead of us, of the affairs of the Hereafter, and all that is behind us, of the affairs of this world, and all that is between those [two], namely, all that takes place from this [point in] time until the coming of the Hour, in other words, to Him belongs knowledge of all of those things. And your Lord is never forgetful, meaning that He is never neglectful of you [even] when the Revelation is postponed from [being sent to] you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We (angels) come not down) from heaven (save by commandment of thy Lord) Muhammad. Gabriel said this when Allah withheld the revelation from him for a while after being asked by the Quraysh about the spirit, the two-horned (Dhu'l-Qarnayn) and the people of the Cave. (Unto Him belongeth all that is before us) of the matter of the Hereafter (and all that is behind us) of the matter of this worldly life (and all that is between those two) between the two blowings of the Trumpet, (and thy Lord was never forgetful) your Lord has not forgotten you since He first sent you the Revelation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذٰلِكَ } قالَ الإِمامُ زيد بن علي عليهما السلام: ما بين أيدينا: الآخرةُ\n وما خَلفنا: الدُّنيا\n وما بين ذلك النفختان\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - { whatever is between our hands and whatever is behind us }. Imam Zayd ibn `Ali, peace be upon them both, said: \"Whatever is between our hands\": the Hereafter.\n\n\nAnd we left the world behind.\n\n\nAnd between those two breaths",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n قال جبريل عليه السلام في جوابه: نحن معاشر الملائكة { مَا نَتَنَزَّلُ } ونوحي إلى أحدٍ { إِلاَّ بِأَمْرِ رَبِّكَ } وإنزاله وإرساله\n إذ التصرف { لَهُ مَا بَيْنَ أَيْدِينَا } أي: عندنا وفي علننا { وَمَا خَلْفَنَا } أي: في سرنا واستعدادنا\n وما غاب عنا وخفي علينا { وَمَا بَيْنَ ذٰلِكَ } الطرفين المذكورينن\n وبالجملة: مستوعبُ بنا\n محيطُ لجميع أحوالنا بلا فوت شيءٍ وغيبته عنه\n بل الكل حاضرُ عنده { وَ } حينئذٍ { مَا كَانَ رَبُّكَ } تعالى شأنه { نَسِيّاً } [مريم: 64] حتى يُنسب إبطاء الوحي إلى نسيانه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وجه المناسبة لما قبله - والله أعلم -: أن الحق جلّ جلاله لما سرد قصص الأنبياء وما نشأ بعدهم\n وكان جبريل هو صاحب وحيهم الذي ينزل به عليهم\n ذكر هنا أن نزوله ليس باختياره\n فقال: { وما نتنزل\n\n\n } الخ\n يقول الحقّ جلّ جلاله: حاكيًا لقول جبريل عليه السلام: { وما نتنزَّلُ } عليك يا محمد { إِلا بأمرِ ربك } \n وذلك حين أبطأ الوحي عنه صلى الله عليه وسلم\n لما سئل عن أصحاب الكهف وذي القرنين والروح\n فلم يدر كيف يجيب\n ورجا أن يوحى إليه فيه\n فأبطأ عليه أربعين يومًا\n قاله عكرمة\n وقال مجاهد: ثنتي عشرة ليلة\n أو خمس عشرة\n فشقَّ على النبي صلى الله عليه وسلم مشقة شديدة\n وقال:\n \" يا جبريل قد اشتقت إليك\n فقال جبريل: إني كنت أَشْوَق\n ولكني عبد مأمور\n إذا بُعثتُ نزلت\n وإذا حُبست احتَبَستُ\n فأنزل الله هذه الآية وسورة الضحى \" \n\n والتنزل: النزول على مَهَل\n وقد يُطلق على مطلق النزول\n والمعنى: وما نتنزل وقتًا غِبّ وقتٍ إلا بأمر الله تعالى\n على ما تقتضيه حكمته\n وقيل: هو إخبار عن أهل الجنة أنهم يقولون عند دخولها مخاطبين بعضهم لبعض بطريق التبجح والابتهاج\n أي: ما نتنزل هذه الجنان إلا بأمر الله تعالى ولطفه\n وهو مالك الأمور كلها\n سالفها ومُتَرَقَّبُهَا وحاضرها\n فما وجدناه وما نجده هو من لطفه وفضله\n هـ\n قلت: ولا يخفى حينئذ مناسبته\n ثم قال: { له ما بين أيدينا وما خَلْفَنا وما بين ذلك } أي: وما نحن فيه من الأماكن والأزمنة\n فلا ننتقل من مكان إلى مكان\n ولا ننزل في زمان دون زمان\n إلا بأمره ومشيئته\n وعن مقاتل: { له ما بين أيدينا } من أمر الدنيا? { وما خلفنا } من أمر الآخرة\n { وما بين ذلك } مما بين النفختين\n وهو أربعين سنة\n أو ما بين أيدينا بعد الموت\n وما خلفنا قبل أن يخلقنا\n وما بين ذلك مدة حياتنا\n أي: له علم ذلك كله? { وما كان ربك نَسِيًّا }: تاركًا لك ومهملاً شأنك\n أو: ذَاهِلاً عنك حتى ينسى أمر الوحي إليك لأنه مُحال\n يعني: أن عدم نزول جبريل لم يكن إلا لعدم الأمر به لحكمة بالغة فيه\n ولم يكن تركه تعالى لك إهمالاً وتوديعًا\n كما زعمت الكفرة\n وفي إعادة اسم الرب المضاف إلى ضميره صلى الله عليه وسلم من تشريفه والإشعار بعلية الحكم ما لا يخفى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:126",
      "similarity": 0.5645710163665113
    },
    {
      "verse": "20:52",
      "similarity": 0.5240842818837326
    },
    {
      "verse": "22:76",
      "similarity": 0.5015761467484856
    },
    {
      "verse": "59:19",
      "similarity": 0.4878635114002076
    },
    {
      "verse": "87:6",
      "similarity": 0.486306731126131
    }
  ]
}