{
  "chapter": "مريم",
  "text": "رب السموت والارض وما بينهما فاعبده واصطبر لعبدته هل تعلم له سميا",
  "translations": [
    {
      "translation": "He is Lord of the heavens and the earth and everything in between them, so worship Him and persevere in His worship. Do you know of any other with His Name?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth and all that lies between them. Therefore worship Him, and be constant in His worship. Do you know any namesake of His?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Lord of the heavens and the earth and all that is in between. Serve Him, then, and be constant in serving Him. Do you know anyone that might be His compeer?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Lord of the heavens and the earth and all that is between them. Worship Him and be steadfast in your worship of Him; none is equal to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth and all that is between them – therefore worship Him and be firm in His worship; do you know any other of the same name as His?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth, and all that is between them, so worship Him and abide patiently in His worship. Do you know of any who is similar to Him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord of the heavens and the earth and what is between them, so serve Him and be patient in His service. Do you know any one equal to Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy Lord is never forgetful, Lord He of the heavens and earth and all that is between them. So serve Him, and be thou patient in His service; knowest thou any that can be named with His Name?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth and all that is between them! Therefor, worship thou Him and be thou steadfast in His service. Knowest thou one that can be named along with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Lord of the heavens and of the earth and of all that is between the two. So worship Him alone and be steadfast in His worship. Do you know of anyone equal to Him in His attributes?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth and that which is betwixt the twain; so Him worship thou, and endure patiently in His worship; knowest thou any as his compeer? *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—the Lord of the heavens and the earth and whatever is between them. So worship Him and be steadfast in His worship. Do you know anyone who could be His namesake?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and of the earth, and of all that is between them; so worship Him, and be constant and patient in His worship: knowest thou of any who is worthy of the same Name as He?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth, and all that is between them, so worship Him (Alone) and be constant and patient in His worship. Do you know of any who is similar to Him? (of course none is similar or coequal or comparable to Him, and He has none as partner with Him). [There is nothing like unto Him and He is the All-Hearer, the All-Seer].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth and all that is between them, so worship Him, be patient in His worship. Do you know any that can be named with His Name'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth and what is between them. So worship Him, and persevere in His service. Do you know of anyone equal to Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth and whatever is between them - so worship Him and have patience for His worship. Do you know of any similarity to Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:65] He is, the Lord, the Owner, of the heavens and the earth and all that is between them. So worship Him and be steadfast in His worship, in other words, [continue to] perform it patiently. Do you know [of] anyone who could be His namesake? , [anyone] named with that [same title]? No!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lord) Creator (of the heavens and the earth and all that is between them) of created beings and marvels, i.e. Allah. (Therefore, worship thou Him) obey Him (and be thou steadfast in His service) be patient in His worship. (Knowest thou one that can be named along with Him) do you know anyone else whose name is Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يتصور نسيانه\n إذ هو { رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ وَمَا بَيْنَهُمَا } لا يعزب ويغيب عن علمه شيء منها لمحةً\n وإذ تحققتَ ما تلنا عليك يا أكمل الرسل وتأملتَ في معناه حق التأمل والتدبر { فَٱعْبُدْهُ } راجياً منه العناية على العبادة وجزاء الخير { وَٱصْطَبِرْ لِعِبَادَتِهِ } وتحمل لمتاعبها\n واثبت عليها\n ولا تستعجل بوحي ما قصدتَ وأحببتَ نزوله\n ولا تقنط أيضاً\n إذ الكل بيده مرهونُ بوقتٍ\n ولا تضطرب من استهزاء الكفرة وسخريتهم\n وكيف اضطربت { هَلْ تَعْلَمُ } وتسمع { لَهُ سَمِيّاً } [مريم: 65] مثلاً مسمىً بالأله المستحق للتوجه والعبودية لإنجاح المطلوب سواه حتى ترجع إليه\n فلكَ العبادة والاصطبار وترك الاضطراب والاستعجال\n وتفويض جميع الأمور إلى الكبير المتعال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { ربُّ السماوات والأرض وما بينهما } بيان لاستحالة النسيان عليه تعالى فإن من بيده ملكوت السماوات والأرض وما بينهما كيف يتصور أن يحوم حول ساحته الغفلة والنسيان\n والفاء في قوله: { فاعبُده واصطَبِرْ لعبادته } لترتيب ما بعدها على ما قبلها\n من كونه تعالى رب السماوات والأرض وما بينهما\n\nأو من كونه تعالى غير تارك له عليه السلام\n أو غير ناسٍ لأعمال العاملين\n والمعنى على الأول: فحين عرفته تعالى بما ذكر من الربوبية الكاملة فاعبده\n أو حين عرفته تعالى لا ينساك\n أو: ينسى أعمال العاملين فأقبل على عبادته واصطبر على مشاقها\n ولا تحزن بإبطاء الوحي وهزْءِ الكفرة\n فإنه يراقبك ويلطف بك في الدنيا والآخرة\n { هل تعلم له سَمِيًّا } أي: شبيهًا ونظيرًا\n أو هل تعلم أحدًا تسمى بهذا الاسم غير الله العالي\n والتسمية تقتضي التسوية بين المتشابهين\n ولا مثل له\n لا موجودًا ولا موهومًا\n مع أن المشركين مع غلوهم في المكابرة لم يسموا الصنم بالجلالة أصلاً\n ولم يتجاسر أحد أن يسمي بهذا الاسم\n ولو تجاسر أحدٌ لهلك\n وقيل: إن أحدًا من الجبابرة أراد أن يسمي ولده بهذا الاسم\n فخف به وبتلك البلدة\n ذكره القشيري في التحبير\n والله تعالى أعلم\n الإشارة: ما قاله جبريل عليه السلام من كونه لا ينزل إلا بأمر ربه ليس خاصًا به بل كل أحد لا حركة له ولا سكون إلا بالله وبمشيئته\n فلا يصدر عن أحد من عبيده قول ولا فعل\n ولا حركة ولا سكون\n إلا وقد سبق في علمه وقضائه كيف يكون\n فلا انتقال ولا نزول إلا بقدر سابق وتحريك لاحق \" ما من نفَس تبديه إلا وله قدر فيك يمضيه \"\n وقال الشاعر:\nفراحة الإنسان أن يكون ابن وقته\n كل وقت ينظر ما يفعل الله به\n فبهذا ينجو من التعب\n ويتحقق له الأدب\n وبالله التوفيق\n ثم ردَّ على من أنكر البعث",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:7",
      "similarity": 0.5117169101015825
    },
    {
      "verse": "26:203",
      "similarity": 0.39822613375263227
    },
    {
      "verse": "26:39",
      "similarity": 0.39082498700096385
    },
    {
      "verse": "34:17",
      "similarity": 0.38895620588737434
    },
    {
      "verse": "16:42",
      "similarity": 0.3575506088875191
    }
  ]
}