{
  "chapter": "مريم",
  "text": "تلك الجنة التى نورث من عبادنا من كان تقيا",
  "translations": [
    {
      "translation": "That is the Garden which We will bequeath to those of Our slaves who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Paradise those of Our creatures will inherit who take heed and fear the displeasure of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Paradise which We shall cause those of Our servants who have been God-fearing to inherit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the gardens which We will give to Our God-fearing servants as their inherited property.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the Paradise that We will bequeath to those among Our bondmen who remain pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Paradise which We shall give as an inheritance to those of Our servants who had Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the garden which We cause those of Our servants to inherit who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Paradise which We shall give as an inheritance to those of Our servants who are godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Garden which We cause the devout among Our bondmen to inherit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the Garden which We will grant to those of Our servants who have been God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Garden which We shall cause those of Our bondmen to inherit who have been God-fearing. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the paradise We will give as inheritance to those of Our servants who are Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Garden which We give as an inheritance to those of Our servants who guard against Evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Paradise which We shall give as an inheritance to those of Our slaves who have been Al-Muttaqun (pious and righteous persons - See V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the Paradise which We shall give the cautious worshipers to inherit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Paradise which We will give as inheritance to those of Our servants who are devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Paradise, which We give as inheritance to those of Our servants who were fearing of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:63] That is the Paradise which We shall give as inheritance, [which] We shall grant and [in which] We shall lodge, those of Our servants who are God-fearing, through [their] obedience of Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such is the Garden which We cause the devout among Our bondmen) those who ward off disbelief and idolatry; and it is also said that this means: the one who obeys his Lord (to inherit) to dwell in.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { تلك الجنة } المطلقة التي تقع على واحدة منها { التي نورث من عبادنا من كان تقيّاً } مطلقاً بحسب تقواه، فإن اتقى الرذائل والمعاصي نورثه جنة النفس أي جنة الآثار، وإن اتقى أفعاله بالتوكل فله جنة القلب وحضور تجليات الأفعال، وإن اتقى صفاته في مقام القلب فله جنة الصفات، وإن اتقى ذاته ووجوده بالفناء في الله فله جنة الذات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تِلْكَ ٱلْجَنَّةُ } الموصوفة الموعودة { ٱلَّتِي نُورِثُ } أي: نوطن ونمكن { مِنْ عِبَادِنَا } فيها { مَن كَانَ } منهم { تَقِيّاً } [مريم: 63] متصفاً بالتقوى حَذِراً عن الهوى خائفاً\n\n\n\n\n{ وَ } بعدما أبطأ الوحي على رسول الله حي سأله المشركون من قصة أصحاب الكهف وأمر الروح وقصة ذي القرنين، فوعد لهم الجواب ولم يستثنِ، وانقطع الوحي خمسة عشر يوماً\n وقيل: أربعين\n حتى عيّروه واستهزءوا معه؛ حيث قالوا: ودّعه ربه وقلاه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { تلك الجنة }: مبتدأ وخبر، جيء بهذه الجملة لتعظيم شأن الجنة وتعيين أهلها، وما في اسم الإشارة من معنى البُعد للإيذان ببُعد منزلتها وعلو رتبتها، أي: تلك الجنة التي وُصفت بتلك الأوصاف العظيمة هي { التي نُورث } أي: نورثها { مِنْ عبادنا من كان تقيًّا } لله بطاعته واجتناب معاصيه، أي: نُديمها عليهم بتقواهم، ونمتعهم بها، كما يبقى عند الوارث مال مورثه يتمتع به، والوراثة أقوى ما يستعمل في التملك والاستحقاق من الألفاظ من حيث إنها لا يعقبها فسخ ولا استرجاع ولا إبطال\n وقيل: يرث المتقون من الجنة المساكن التي كانت لأهل النار، لو آمنوا وأطاعوا، زيادة في كرامتهم\n والله تعالى أعلم\n الإشارة: قوله تعالى: { فخلف من بعدهم خلف\n\n\n } الآية تنسحب على من كان أسلافه صالحين، فتنكب عن طريقهم، فضيّع الدين، وتكبر على ضعفاء المسلمين، واتبع الحظوظ والشهوات، وتعاطى الأمور العلويات، فإن ضم إلى ذلك الافتخار بأسلافه، أو بالجاه والمال، كان أغرق في الغي والضلال، يصدق عليه قول القائل:\n\nإلا من تاب ورجع إلى ما كان عليه أسلافه، من العلم النافع والعمل الصالح، والتواضع للصالح والطالح، فيرافقهم في جنة الزخارف أو المعارف، التي وعد الرحمن عباده المخصوصين بالغيب، ثم صارت عندهم شهادة، إنه كان وعده مأتيًا، لا يسمعون فيها لغوًا لأن الحضرة مقدسة عن اللغو، { إلا سلامًا } لسلامة صدورهم، ولهم رزقهم فيها من العلوم والأسرار والمواهب، في كل ساعة وحين، لا يرث هذه الجنة إلا من اتقى ما سوى الله، وانقطع بكليته إلى مولاه\n وبالله التوفيق  ولما أبطأ الوحي عن النبي صلى الله عليه وسلم قال:\n\n \" يا جبريل ما يَمنعُكَ أن تزورنَا أكثرَ مما تَزورنا؟ \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:72",
      "similarity": 0.852514905475137
    },
    {
      "verse": "23:10",
      "similarity": 0.7962815897653375
    },
    {
      "verse": "26:85",
      "similarity": 0.7594714437620816
    },
    {
      "verse": "44:28",
      "similarity": 0.7090108360774259
    },
    {
      "verse": "15:23",
      "similarity": 0.6656983058418164
    }
  ]
}