{
  "chapter": "مريم",
  "text": "ثم لننزعن من كل شيعة ايهم اشد على الرحمن عتيا",
  "translations": [
    {
      "translation": "We shall pull out of every section those who were most perversely rebellious against Ar-Rahman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and then We will draw aside from each party those who were most rebellious against the Most Compassionate Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will separate from every group those who were strongly rebellious against the Beneficent God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall then pick out from every group the one who was most arrogant towards the Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then indeed We shall drag out from every sect all those who were worst in obstinate rebellion against the Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will most certainly draw forth from every sect of them him who is most exorbitantly rebellious against the Beneficent Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall pluck forth from every party whichever of them was the most hardened in disdain of the All-merciful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall pluck out from every sect whichever of them was most stubborn in rebellion to the Beneficent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall carry off from every group those who were most stubborn in their opposition to the Gracious One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter, We shall surely draw aside, from each sect, whichever of them against the Compassionate were most in excess. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then from every group We shall draw whichever of them was more defiant towards the All-beneficent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then shall We certainly drag out from every sect all those who were worst in obstinate rebellion against (Allah) Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then indeed We shall drag out from every sect all those who were worst in obstinate rebellion against the Most Beneficent (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from every party We will pluck out whichever of them was the most hardened in disdain of the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, out of every sect, We will snatch those most defiant to the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will surely extract from every sect those of them who were worst against the Most Merciful in insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:69] Then We shall pluck out from every party, every sect, whichever of them was most hardened in disdain, in insolence, of the Compassionate One.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We shall pluck out) We shall bring out (from every sect) from the adherents of each religion (whichever of them was most stern in rebellion to the Beneficent) which of them was most daring vis-a-vis the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعد حشرهم وإحضارهم على النار { لَنَنزِعَنَّ } أي: ننتخبن ونخرجن { مِن كُلِّ شِيعَةٍ } أي: فرقةٍ شاعت منهم موجبات العذاب والنكال { أَيُّهُمْ أَشَدُّ عَلَى ٱلرَّحْمَـٰنِ } المفيض لهم أنواعَ الخيرات والبركات { عِتِيّاً } [مريم: 69] جراءةً على العصيان له وعلى ترك أوامره وارتكاب نواهيه، ليطرح أولاً على مقر النار، ثم الأمثل فالأمثل إلى انطراح الكل فيها على تفاوت طبقاتهم ودرجاتهم في موجباتها قوةً وضعفاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أَيُّهُم }: مبني على الضم عند سيبويه، لأنه موصول، فحقه البناء كسائر الموصولات، لكنه أعرب في بعض التراكيب للزوم الإضافة، فإذا حذف صَدْرُ صِلَتِهِ زاد نقصُه فقوي شبه الحرف فيه، وهو منصوب المحل بلننزعن، وقرئ منصوبًا على الإعراب، ومرفوعًا عند الخليل وغيره بالابتداء، وخبره: { أشد } ، والجملة محكية، والتقدير: لننزعن من كل شيعة الذين يُقال لهم أيهم أشد\n\n\n الخ\n وقال يونس: علق عنها الفعل وارتفعت بالابتداء، و { عتيًّا } و { صليًّا } أصلهما: عتوى وصلوى، من عتى وصلى، بالكسر والفتح، فاعلاً بما تقدم\n يقول الحقّ جلّ جلاله: { ويقول الإِنسانُ } أي: جنس الإنسان، والمراد الكفرة، وإسناد القول إلى الكل لوجود القول فيما بينهم، وإن لم يقله الجميع، كما يقال: بنو فلان قتلوا فلانًا، وإنما القاتل واحد، وقيل: القائل: أُبيُّ بن خَلَف، فإنه أخذ عظامًا بالية، ففتتها، وقال: يزعم محمد أنا نُبعث بعد ما نموت ونصير إلى هذا الحال، فنزلت\n أي: يقول بطريق الإنكار والاستبعاد: { أئذا ما متُّ لسوف أُخرج حيًّا } أي: أأبعث من الأرض بعد ما مِتُّ وأُخرج حيًا؟ قال تعالى: { أولا يَذكُرُ الإِنسانُ } ، من الذِّكر الذي يُراد به التفكر، ولذلك قُرئ بالتشديد من التذكير\n والإظهارُ في موضع الإضمار لزيادة التقرير والإشعار بأن الإنسانية من دواعي التفكر فيما جرى عليها من شؤون التكوين، فإذا ترك التفكر التحق بالبهائم، فهلاّ يذكر أصله! وهو { أنا خلقناه من قبلُ } أي: من قبل الحالة التي فيها، وهي حالة حياته، { ولم يكُ شيئًا } أي: والحال أنه لم يك شيئًا أصلاً، وحيث خلقناه وهو في تلك الحال فلأن نبعث الجمع بتفرقاته أولى وأظهر لأن الإعادة أسهل من البدء\n قال تعالى: { فوربّك لنحشرنهم } أي: لنجمعنهم بالسّوق إلى المحشر بعدما أخرجتهم من الأرض\n\n\nوإقسامه سبحانه بربوبيته مضافة إلى ضميره - عليه الصلاة والسلام - لتحقيق الأمر، والإشعار بِعِلِّيَّتِهِ، وتفخيم شأنه، ورفع منزلته صلى الله عليه وسلم، وفيه إثبات البعث بالطريق البرهاني على أبلغ وجه وآكده، كأنه أمر واضح غني عن التصريح به، وإنما المحتاج إلى البيان ما بعد ذلك من الأهوال، أي: حيث ذكر الحشر وما بعده\n ولم يصرح بنفس البعث لتحقق وضوحه، وإنما قال: { فوربّك لنحشرنهم } أي: نجمعهم { والشياطينَ } المغوين لهم، إلى المحشر، وقيل: إن الكفرة يُحشرون مع قرنائهم من الشياطين التي كانت تغويهم، كل منهم مع شيطانه في سلسلة، { ثم لنحضِرَنَّهم حول جهنم جثيًّا }: باركين على ركَبِهم لما يدهمُهم من هول المطلع، والجثو: جلسة الذليل الخائف\n والآية كما ترى، صريحة في الكفرة، فهم الذين يُساقون من الموقف إلى شاطئ جهنم، جُثاة إهانة بهم، أو لعجزهم عن القيام لما اعتراهم من شدة الخوف\n وأما قوله تعالى:\n\n[الجَاثيَة: 28] فهي عامة للناس في حال الموقف قبل التواصل إلى الثواب والعقاب، فإن أهل الموقف جاثون على الرُّكب، كما هو المعتاد في مقام التفاؤل والخصام، قلت: ولعل هذا فيمن يُناقش الحساب، وأما غيرهم فيلقى عليهم سحابة كنفه، ثم يقررهم بذنوبهم ويسترهم، كما في الحديث\n { ثم لنَنْزِعَنَّ من كل شيعةٍ } أي: من كل أمة تشيعت دينًا من الأديان، { أيُهم أشدُّ على الرحمن عِتيًّا } أي: من كان منهم أعصى وأعتى، فيطرحهم فيها\n قال ابن عباس: أي: أيهم أشد جرأة، وقال مجاهد: فجورًا وكذبًا، وقال مقاتل: علوًا، أو غلوًا في الكفر، أو كبرًا، وقال الكلبي: قائدهم ورأسهم، أي: فيبدأ بالأكابر فالأكابر بالعذاب، ثم الذي يليهم جرمًا\n وفي ذكر الأشدية تنبيه على أنه تعالى يعفو عن بعض أهل العصيان من غير الكفرة، إذا قلنا بعموم الآية، وأما إذا خصصناها بالكفرة، فالأشدية باعتبار التقديم للعذاب",
      "translations": []
    }
  ]
}