{
  "chapter": "مريم",
  "text": "الا من تاب وءامن وعمل صلحا فاو۟لئك يدخلون الجنة ولا يظلمون شيـا",
  "translations": [
    {
      "translation": "except for those who make tawba and have iman and act rightly. They will enter the Garden and they will not be wronged in any way:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and come to believe and do the right. These will enter Paradise and will not be wronged the least\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who repent and believe and act righteously. Such shall enter Paradise and shall not be wronged at all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but those among them who repent and become righteously striving believers will be admitted to the gardens without experiencing any injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repented and accepted faith and did good deeds – so these will enter heaven, and they will not be deprived* in the least. (* Of their due reward.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and believe, and work righteousness. Such will enter Paradise and they will not be wronged in aught.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except such as repent and believe and do good, these shall enter the garden, and they shall not be dealt with unjustly in any way:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save him who repents, and believes, and does a righteous deed; those -- they shall enter Paradise, and they shall not be wronged anything;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save him who shall repent and believe and do right. Such will enter the Garden, and they will not be wronged in aught -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except for those who repent and believe and do good deeds. These will enter Heaven, and they will not be wronged in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Excepting those who may repent and believe and work righteously; these shall enter the Garden and shall not be wronged at all *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "barring those who repent, believe, and act righteously. Such will enter paradise, and they will not be wronged in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and believe, and work righteousness: for these will enter the Garden and will not be wronged in the least,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and believe (in the Oneness of Allah and His Messenger Muhammad SAW), and work righteousness. Such will enter Paradise and they will not be wronged in aught.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except he who repents and believes and does good works; those shall be admitted to Paradise and shall not be wronged in any way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent, and believe, and act righteously. These will enter Paradise, and will not be wronged in the least.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent, believe and do righteousness; for those will enter Paradise and will not be wronged at all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:60] whereas those who repent and believe and act righteously — such shall enter Paradise and shall not be   wronged, they shall [not] be diminished, in any way, in their reward;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Save him who shall repent) of the Jews (and believe) in Muhammad (pbuh) and in the Qur'an (and do right) sincerely in secret between themselves and their Lord. (Such will enter the Garden and they will not be wronged in aught) their good works will not be diminished and their evil works will not be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إلاّ من تاب } عن الذنب الأول فرجع إلى مقام القلب { وآمن } باليقين { وعَمِل صالحاً } باكتساب الفضيلة { فأولئك يدخلون الجنة } المطلقة بحسب استحقاقهم ودرجتهم في الإيمان والعمل { ولا يظلمون } أي: لا ينقصون مما اقتضاه حالهم ومقامهم { شيئاً }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ مَن تَابَ } ورجع عنها نادماً ولم يرجع إليها أصلاً { وَآمَنَ } أي: صدق جرمتها { وَ } بعد التوبة والرجوع { عَمِلَ صَالِحاً } ليصلح ما أفسد بمتابعة الهوى { فَأُوْلَـٰئِكَ } التائبون الآيبون النادمون عما صدر عنهم من متابعة الهوى بإغواء الشيطان وإغرائه { يَدْخُلُونَ ٱلْجَنَّةَ } لسائر المؤمنين المطيعين { وَلاَ يُظْلَمُونَ شَيْئاً } [مريم: 60] أي: لا يُنقصون شيئاً من درجات المؤمنين الغير العاصين\n إذن كانت توبتهم على وجه الإخلاص والندامة الكاملة\n بل لهم كسائر عباد الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:71",
      "similarity": 0.642108343720529
    },
    {
      "verse": "2:160",
      "similarity": 0.5957264926791652
    },
    {
      "verse": "20:82",
      "similarity": 0.5812317517010058
    },
    {
      "verse": "5:39",
      "similarity": 0.5597430431174493
    },
    {
      "verse": "3:89",
      "similarity": 0.5456515132949148
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019060.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019060.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:60.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}