{
  "chapter": "مريم",
  "text": "ويزيد الله الذين اهتدوا۟ هدى والبقيت الصلحت خير عند ربك ثوابا وخير مردا",
  "translations": [
    {
      "translation": "Allah augments those who are guided by giving them greater guidance. In your Lord's sight, right actions which are lasting are better both in reward and end result.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gives greater guidance to those who are guided; and good deeds that endure are better with your Lord for reward, and better for consequence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the contrary), Allah increases in guidance those who follow the Right Way. Lasting acts of righteousness are better in the sight of your Lord as reward and conducive to a better end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God further enlightens those who seek guidance. To those who do charitable deeds which produce continuing benefits, your Lord will give a better reward and a better place in Paradise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah will increase the guidance for those who have received guidance; and good deeds that remain have the best reward before your Lord, and the best outcome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah increases in guidance those who walk aright. And the righteous good deeds that last are better with your Lord for reward and better for resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah increases in guidance those who go aright; and ever-abiding good works are with your Lord best in recompense and best in yielding fruit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God shall increase those who were guided in guidance; and the abiding things, the deeds of righteousness, are better with thy Lord in reward, and better in return\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah increaseth in right guidance those who walk aright, and the good deeds which endure are better in thy Lord's sight for reward, and better for resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God increases His guidance to those who follow guidance; and lasting good works are better in the sight of your Lord and are most rewarding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah increaseth in guidance those who let themselves be guided, and the righteous works that last are excellent with thy Lord in respect of reward and excellent in respect of return. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah enhances in guidance those who are [rightly] guided, and lasting righteous deeds are better with your Lord in reward, and better at the return [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah doth advance in guidance those who seek guidance: and the things that endure, Good Deeds, are best in the sight of thy Lord, as rewards, and best in respect of (their) eventual return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah increases in guidance those who walk aright [true believers in the Oneness of Allah who fear Allah much (abstain from all kinds of sins and evil deeds which He has forbidden), and love Allah much (perform all kinds of good deeds which He has ordained)]. And the righteous good deeds that last, are better with your Lord, for reward and better for resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will increase those who were guided in guidance and things that abide. Good deeds are better in reward with your Lord, and, better in return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God increases in guidance those who accept guidance. And the things that endure—the righteous deeds—have the best reward with your Lord, and the best outcome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah increases those who were guided, in guidance, and the enduring good deeds are better to your Lord for reward and better for recourse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:76] And God increases in guidance those who found [right] guidance, through faith, [increasing them] by way of the signs He reveals to them; and the enduring things, the righteous deeds — namely, obedience [the reward of] which endures for that person — are better in your Lord’s sight in [terms of] reward, and better in [terms of the] return, that is, as something which will be repaid and returned to him [the believer], in contrast to the deeds of the disbelievers. The [use of the qualification] khayr, ‘better’, here is meant to counter [the use of the same in] their statement, ‘Which of the two parties is better in station?’ [above, Q. 19:73].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ مَرَدًّا (76) وجملة { ويزيد الله الذين اهتدوا هدى } معطوفة على جملة { من كان في الضلالة فليمدد له الرحمان مدّاً } لما تضمنه ذلك من الإمهال المفضي إلى الاستمرار في الضلال ، والاستمرار : الزيادة . فالمعنى على الاحتباك ، أي فليمدد له الرحمان مداً فيزدَدْ ضلالاً ، ويمدّ للذين اهتدوا فيزدادوا هدىً .وجملة { والباقيات الصالحات خير } عطف على جملة { ويزيد الله الذين اهتدوا هدى }. وهو ارتقاء من بشارتهم بالنجاة إلى بشارتهم برفع الدرجات ، أي الباقيات الصالحات خير من السلامة من العذاب التي اقتضاها قوله تعالى : { فسيعلمون من هو شرّ مكاناً وأضعفُ جنداً } ، أي فسيظهر أن ما كان فيه الكفرة من النعمة والعزّة هو أقلّ مما كان عليه المسلمون من الشظف والضعف باعتبار المآلين ، إذ كان مآل الكفرة العذاب ومَآل المؤمنين السلامة من العذاب وبعدُ فللمؤمنين الثواب .والباقيات الصالحات : صفتان لمحذوف معلوم من المقام ، أي الأعمال الباقي نعيمها وخيرها ، والصالحات لأصحابها هي خير عند الله من نعمة النجاة من العذاب . وقد تقدّم وجه تقديم الباقيات على الصالحات عند الكلام على نظيره في أثناء سورة الكهف .والمردّ ، المرجع . والمراد به عاقبة الأمر .\n\n",
      "translations": [
        {
          "translation": "333 (Allah increaseth in right guidance) by faith (those who walk aright) upon the legal prescriptions; it is also said that this means: Allah increases in right guidance through the abrogating verses those who walk aright by the abrogated verses, (and the good deeds) the five daily prayers (which endure are better in your Lord's sight for reward) the best things for which Allah gives reward are the five daily prayers, (and better for resort) the best return in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويزيد الله الذين اهتدوا هدى } أي: كما يمد أهل الضلالة في ضلالتهم بالخذلان مدّاً يزداد فيه ضلالهم واحتجابهم كلما أمعنوا في جهلهم ورذائلهم كذلك يزيد الله المهتدين بالتوفيق كلما عملوا بما علموا استعدوا لقبول علم آخر فورثوه كما قال عليه السلام:\n \" من عمل بما علم أورثه الله علم ما لم يعلم \" \nفيزيدهم عند العمل بمقتضى العلم اليقيني عين اليقين\n وعند العمل بمقتضاه حق اليقين { والباقيات الصالحات } من العلوم والفضائل { خير عند ربك ثواباً } لأدائها إلى التجليات الوصفية والجنات القلبية { وخير مردّاً } بالرجوع إلى الذات الأحدية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَيَزِيدُ ٱللَّهُ ٱلَّذِينَ ٱهْتَدَواْ هُدًى وَٱلْبَاقِيَاتُ ٱلصَّالِحَاتُ خَيْرٌ عِندَ رَبِّكَ ثَوَاباً وَخَيْرٌ مَّرَدّاً } بعدما صار مَالُ الكفار وبالاً عليهم ومنالُهم نكالاً لهم { } الهادي لعباده المؤمنين { } إلى زلال عرفانه وتوحيده { } هدايةً ورشاداً باقياً أزلاً وأبداً بدل ما نقص عنهم من حطام الدنيا الفانية ومتاعها الزائلة الذاهبة { } المقربة إلى الله\n المستتبعة لأنواع الفضل والثواب { } يا أكمل الرسل { } عائدةً وفائدةً { } [مريم: 76] أي: منقلباً ومآباً\n لأن مآل الأموال والجاه والثروة إلى الحسرة والخسران ومآل العبادات إلى الجنة والغفران",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر فريق أهل الإيمان فقال: { ويزيدُ اللهُ الذينَ اهتدوا هُدَىً } أي: كما يمد لأهل الضلالة زيادة في ضلالهم\n كذلك يزاد في هداية أهل الهداية ثوابًا على طاعتهم لأن كلا يجزى بوصفه\n فلا تزال الهداية تنمو في قلوبهم حتى يردوا موارد الكرم\n أمَّا في الدنيا فبكشف الحجاب وانقشاع السحاب حتى يشاهدوا رب الأرباب\n فما كانوا يؤمنون به غيبًا صار عيانًا\n وأمَّا في الآخرة فبنعيم الحور والقصور\n ورؤية الحليم الغفور\n\nفقد بيَّن الحق تعالى حال المهتدين إثر بيان حال الضالين\n وأن إمهال الكافر وتمتيعه بالحظوظ ليس لفضله\n وإن منع المؤمن من تلك الحظوظ ليس لنقصه\n بل قوم عجلت لهم طيباتهم في الحياة الدنيا الفانية\n وقوم ادخرت لهم طيباتهم للحياة الباقية\n قال تعالى: { والباقياتُ الصالحاتُ } كأنواع الطاعات\n { خيرٌ عند ربك } لبقاء فوائدها ودوام عوائدها\n\n\n وقد تقدم تفسيرها\n والتعرض لعنوان الربوبية والإضافة إلى ضميره صلى الله عليه وسلم لتشريفه\n أي: فهي أفضل { ثوابًا } أي: عائدة مما يتمتع به الكفرة من النعم الفانية\n التي يفتخرون بها لأن مآلها الحسرة السرمدية والعذاب الأليم\n ومآل الباقيات الصالحات النعيم المقيم في دار الدوام\n كما أشير إليه بقوله: { وخيرٌ مَرَدًّا } أي: مرجعًا وعاقبة\n وتكرير الخير لمزيد الاعتناء بشأن الخيرية وتأكيد لها في التفضيل\n مع أن ما للكفرة بمعزل من أن يكون له خيرية في العاقبة\n ففيه نوع تهكم بهم\n والله تعالى أعلم\n الإشارة: اعلم أن الحق - جلّ جلاله - يرزق العبد على قدر نيته\n ويمده على قدر همته\n فمن كانت همته في الحظوظ العاجلة والشهوات الفانية\n أمده الله فيها\n ومتعه بها ما شاء\n على حسب القسمة\n ثم أعقبه الندم والحسرة\n ومن كانت همته الآخرة\n أمده سبحانه في الأعمال التي تُوصله إلى نعيمها\n كصلاة وصيام وصدقة وتدريس علم\n وأذاقه من حلاوتها ما يُهون عليه مرارتها\n ثم أعقبه النعيم الدائم من القصور والحور\n وأنواع الطيبات\n مما تشتهيه الأنفس وتلذ الأعين\n ومن كانت همته الله - أي: الوصول إلى حضرته دون شيء سواه - أمده الله في الأعمال التي توصله إليه\n وهي أعمال القلوب من التخلية والتحلية\n كالتخلية من الرزائل والتحلية بالفضائل\n وكقطع المقامات بأنواع المجاهدات\n ورأس ذلك أن يُوصله إلى شيخ كامل جامع بين الحقيقة والشريعة\n بين الجذب والسلوك\n قد سلك الطريق على شيخ كامل\n فإذا وصله إليه وكشف له عن سر خصوصيته فليستبشر بحصول المطلب وبلوغ الأمل\n وبالله التوفيق\n ثمَّ ذكر بعض من مدَّ له في الضلاله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "87:17",
      "similarity": 0.5191271114157106
    },
    {
      "verse": "2:103",
      "similarity": 0.5030346042376943
    },
    {
      "verse": "11:86",
      "similarity": 0.46566293143368115
    },
    {
      "verse": "42:36",
      "similarity": 0.4649903657872181
    },
    {
      "verse": "69:8",
      "similarity": 0.44819025934524426
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019076.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019076.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:76.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}