{
  "chapter": "مريم",
  "text": "واذا تتلى عليهم ءايتنا بينت قال الذين كفروا۟ للذين ءامنوا۟ اى الفريقين خير مقاما واحسن نديا",
  "translations": [
    {
      "translation": "When Our Clear Signs are recited to them, those who are kafir say to those who have iman, 'Which of the two parties has the better position and the more illustrious gathering?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our lucid revelations are read out to them, the infidels say to those who believe: \"Which of the two groups is better in standing, and whose company is more excellent?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear revelations are recited to those who deny the Truth they are wont to say to those who have faith: \"Which of the two groups has a better status and whose assemblies are grander?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our revelations are recited to them, the unbelievers say to the faithful ones, \"Which of us is more prosperous?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear verses are recited to them, the disbelievers say to the Muslims, “Which group has a better home, and a better alliance?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear Ayat are recited to them, those who disbelieve say to those who believe: \"Which of the two groups has the best dwellings and the finest Nadiyyan\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear communications are recited to them, those who disbelieve say to those who believe: Which of the two parties is best in abiding and best in assembly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our signs are recited to them as clear signs, the unbelievers say to the believers, 'Which of the two parties is better in station, fairer in assembly?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear revelations are recited unto them, those who disbelieve say unto those who believe: Which of the two parties (yours or ours) is better in position, and more imposing as an army?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear revelations are recited to them, those who deny the truth say to the faithful, \"Which of the two sides is better in respect of position and makes a more impressive assembly?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our manifest revelations are rehearsed unto them, those who disbelieve say unto those who believe: which of the two portions is better in station and goodlier in company? *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our manifest signs are recited to them, the faithless say to the faithful, ‘Which of the two groups is superior in station and better with respect to company?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Clear Signs are rehearsed to them, the Unbelievers say to those who believe, \"Which of the two sides is best in point of position? Which makes the best show in council?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Verses are recited to them, those who disbelieve (the rich and strong among the pagans of Quraish who live a life of luxury) say to those who believe (the weak, poor companions of Prophet Muhammad SAW who have a hard life): \"Which of the two groups (i.e. believers and disbelievers) is best in (point of) position and as regards station (place of council for consultation).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear verses are recited to them the unbelievers say to the believers: 'Which of the two parties has a better position or company'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear revelations are recited to them, those who disbelieve say to those who believe, “Which of the two parties is better in position, and superior in influence?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to them as clear evidences, those who disbelieve say to those who believe, \"Which of [our] two parties is best in position and best in association?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:73] And when Our manifest, evident (bayyinātin, ‘manifest’, is a circumstantial qualifier) signs, in the Qur’ān, are recited to them, namely, [to] the believers and the disbelievers, those who disbelieve say to those who believe, ‘Which of the two parties — us or you — is better in station, in lodging and abode (read as maqāman, it is [derived] from [the first form] qāma, ‘he stood’; read as muqāman, it is [derived] from the [fourth form] aqāma, ‘he took up residence’) and more excellent in assembly?’ (nadiyyan, meaning the place in which a folk assemble and converse). They [the disbelievers] mean ‘we [are the better of the two parties]’, and so we will fare better than you. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِذَا تُتْلَى عَلَيْهِمْ آَيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آَمَنُوا أَيُّ الْفَرِيقَيْنِ خَيْرٌ مَقَامًا وَأَحْسَنُ نَدِيًّا (73) عطف على قوله { ويقول الإنسان أإذا ما مت لسوف أخرج حياً } \\[ مريم : 66 \\] وهذا صنف آخر من غرور المشركين بالدنيا وإناطتهم دلالة على السعادة بأحوال طيب العيش في الدنيا فكان المشركون يتشففون على المؤمنين ويرون أنفسهم أسعد منهم .والتّلاوة : القراءة . وقد تقدمت عند قوله تعالى : { واتبعوا ما تتلو الشياطين على مُلك سليمان } في البقرة ( 102 ) ، وقوله : { وإذا تليت عليهم آياته زادتهم إيماناً } في أول الأنفال ( 2 ). كان النبي يقرأ على المشركين القرآن فيسمعون آيات النعي عليهم وإنذارهم بسوء المصير ، وآيات البشارة للمؤمنين بحسن العاقبة ، فكان المشركون يكذّبون بذلك ويقولون : لو كان للمؤمنين خير لعُجل لهم ، فنحن في نعمة وأهل سيادة ، وأتباع محمّد من عامة الناس ، وكيف يفوقوننا بل كيف يستوون معنا ، ولو كنا عند الله كما يقول محمد لمنّ على المؤمنين برفاهية العيش فإنّهم في حالة ضنك ولا يساووننا فلو أقصاهم محمد عن مجلسه لاتّبعناه ، قال تعالى : { ولا تطرد الذين يدعون ربّهم بالغداة والعشي يريدون وجهه ما عليك من حسابهم من شيء وما من حسابك عليهم من شيء فتطردهم فتكون من الظالمين وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء منّ الله عليهم من بيننا أليس الله بأعلم بالشاكرين } \\[ الأنعام : 52 ، 53 \\] ، وقال تعالى : { وقال الذين كفروا للذين آمنوا لو كان خيراً ما سبقونا إليه } \\[ الأحقاف : 11 \\]. فلأجل كون المشركين كانوا يقيسون هذا القياس الفاسد ويغالطون به جعل قولهم به معلّقاً بزمان تلاوة آيات القرآن عليهم . فالمراد بالآيات البيّنات : آيات القرآن ، ومعنى كونها بيّنات : أنّها واضحات الحجّة عليهم ومفعمة بالأدلّة المقنعة .واللاّم في قوله { للّذين آمنوا } يجوز كونها للتّعليل ، أي قالوا لأجل الذين آمنوا ، أي من أجل شأنهم ، فيكون هذا قول المشركين فيما بينهم . ويجوز كونها متعلقة بفعل { قَالَ } لتعديته إلى متعلّقه ، فيكون قولهم خطاباً منهم للمؤمنين .والاستفهام في قولهم { أيُّ الفريقين } تقريريّ .وقرأ من عدا ابن كثير { مَقاماً } بفتح الميم على أنه اسم مكان مِن قام ، أطلق مجازاً على الحظ والرفعة ، كما في قوله تعالى : { ولمن خاف مقام ربّه جنتان } \\[ الرحمن : 46 \\] ، فهو مأخوذ من القيام المستعمل مجازاً في الظهور والمقدرة .وقرأه ابن كثير بضم الميم من أقام بالمكان ، وهو مستعمل في الكون في الدنيا . والمعنى : خيرٌ حياةً .\n\n",
      "translations": [
        {
          "translation": "(And when Our clear revelations) expositing the commands and prohibitions (are recited unto them) are recited to al-Nadr and his host (those who disbelieve) in Muhammad (pbuh) in the Qur'an and the resurrection; the reference here is to al-Nadr and his host, (say Unto those who believe) in Muhammad (pbuh) and in the Qur'an, i.e. Abu Bakr and his fellow believers: (Which of the two parties) the adherents of which religion, among us and you, (is better in position, and more imposing as an army?)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَحْسَنُ نَدِيّاً } معناه مَجلسٌ\n والنَّدى والنَّادي واحدٌ\n والجمعُ أنديةٌ\n والمَقامُ: المَساكنُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And the best of company is} means a gathering.\n\n\nThe term \"nadi\" refers to a specific type of Arabic poetry meter.\n\n\nAnd the gathering is a club.\n\n\nAnd the Maqam: the places of residence",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم من كمال غيّهم وضلالهم ونهاية غفلتهم وقسوتهم { إِذَا تُتْلَىٰ عَلَيْهِمْ } في نشأة الاختيار { آيَاتُنَا } الدالةُ على تحيدنا وكمالِ قدرتنا على الإنعام والانتقام مع كونها { بَيِّنَٰتٍ } واضحاتٍ في الإعجاز بلا ريبٍ وترددٍ { قَالَ ٱلَّذِينَ كَفَرُواْ } بعدما عجزوا عن معارضتها وأفحموا على المقابلة معها\n متشبثين بما عندهم من المال و الجاه والثروة والرئاسة\n مفتخرين بها قائلين على سبيل التهكم { لِلَّذِينَ آمَنُوۤاْ أَيُّ ٱلْفَرِيقَيْنِ } أي: أنحن الأغنياء المتلذذون بأنواع اللذات المتمكنون بجميع المرادات والشهوات\n أم أنتم أيها الفقراء الضعفاء المحتاجون بما تقتاتون في يومكم هذا؟! { خَيْرٌ مَّقَاماً } أي: مرتبةً ومكاناً عند الله { وَأَحْسَنُ نَدِيّاً } [مريم: 73] مجلساً ومنزلاً عنده\n ولولا أنا أفضل وأخير منكم عند الله\n لما أعطانا ما أعطانا ولما منع عنكم ما منع\n\n\nثم لما افتخروا وتفضلوا على المؤمنين بما عندهم من حطام الدنيا وزخرفتها\n ردَّ عليهم وهدَّدهم على الوجه الأبلغ الأتم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:109",
      "similarity": 0.4056971814592723
    },
    {
      "verse": "46:7",
      "similarity": 0.401827272968475
    },
    {
      "verse": "40:32",
      "similarity": 0.39933600458350677
    },
    {
      "verse": "96:17",
      "similarity": 0.3916749606086671
    },
    {
      "verse": "28:53",
      "similarity": 0.3753218725812179
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019073.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019073.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:73.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}