{
  "chapter": "مريم",
  "text": "وان منكم الا واردها كان على ربك حتما مقضيا",
  "translations": [
    {
      "translation": "There is not one of you who will not come to it. That is the final decision of your Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one among you who will not reach it. Your Lord has made this incumbent on Himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of you but shall pass by Hell. This is a decree which your Lord will fulfil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the inevitable decree of your Lord that every one of you will be taken to hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none among you who shall not pass over hell; this is an obligatory affair, binding upon your Lord. (Allah will make everyone pass over the back of hell – on a thin bridge.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of you but will pass over it (Hell); this is with your Lord, a decree which must be accomplished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not one of you but shall come to it; this is an unavoidable decree of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not one of you there is, but he shall go down to it; that for thy Lord is a thing decreed, determined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of you but shall approach it. That is a fixed ordinance of thy Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there is not one of you but shall pass through it: a decree from your Lord which must be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not one of you but shall pass over it: it is for thy Lord an ordinance decreed. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none of you but will come to it: a [matter that is a] decided certainty with your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not one of you but will pass over it: this is, with thy Lord, a Decree which must be accomplished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of you but will pass over it (Hell); this is with your Lord; a Decree which must be accomplished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of you who shall not go down to it: such is a thing decreed, determined by your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of you but will go down to it. This has been an unavoidable decree of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none of you except he will come to it. This is upon your Lord an inevitability decreed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:71] There is not one of you but shall come to it, that is, [but] shall enter Hell. That is an inevitability [already] decreed by your Lord, [something which] He made inevitable and [which] He decreed; He will not waive it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا (71) لمّا ذكر انتزاع الذين هم أولى بالنّار من بقية طوائف الكفر عطف عليه أنّ جميع طوائف الشرك يدخلون النار ، دفعاً لتوهم أنّ انتزاع من هو أشد على الرحمان عتياً هو قصارى ما ينال تلك الطوائف من العذاب؛ بأن يحسبوا أنّ كبراءهم يكونون فداء لهم من النّار أو نحو ذلك ، أي وذلك الانتزاع لا يصرف بقية الشيع عن النّار فإن الله أوجب على جميعهم النّار .وهذه الجملة معترضة بين جملة { فوربك لنحشرنهم } \\[ مريم : 68 \\] الخ وجملة { وإذا تتلى عليهم آياتنا بينات قال الذين كفروا } \\[ مريم : 73 \\] الخ . . .فالخطاب في { وإن منكم } التفات عن الغيبة في قوله { لنحشرنّهم ولنحضرنّهم } \\[ مريم : 68 \\] ؛ عدل عن الغيبة إلى الخطاب ارتقاء في المواجهة بالتهديد حتى لا يبقى مجال للالتباس المراد من ضمير الغيبة فإن ضمير الخطاب أعرَف من ضمير الغيبة . ومقتضى الظاهر أن يقال : وإن منهم إلا واردها . وعن ابن عبّاس أنّه كان يقرأ { وإن منهم . وكذلك قرأ عِكرمة وجماعة .فالمعنى : وما منكم أحد ممن نُزع من كلّ شيعة وغيرِه إلاّ واردُ جهنّم حتماً قضاه الله فلا مبدل لكلماته ، أي فلا تحسبوا أن تنفعكم شفاعتهم أو تمنعكم عزّة شِيعكم ، أو تُلقون التبعة على سادتكم وعظماء أهل ضلالكم ، أو يكونون فداء عنكم من النّار . وهذا نظير قوله تعالى : { إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين وإن جهنم لموعدهم أجمعين } \\[ الحجر : 42 ، 43 \\] ، أي الغاوين وغيرهم .وحرف ( إنْ ) للنفي .والورود : حقيقته الوصول إلى الماء للاستقاء . ويطلق على الوصول مطلقاً مجازاً شائعاً ، وأما إطلاق الورود على الدخول فلا يُعرف إلا أن يكون مجازاً غير مشهور فلا بد له من قرينة .وجملة { ثمّ ننجي الذين اتّقوا } زيادة في الارتقاء بالوعيد بأنّهم خالدون في العذاب ، فليس ورودهم النّار بموقّت بأجل .و { ثمّ } للترتيب الرتبي تنويهاً بإنجاء الذين اتّقوا وتشويهاً بحال الذين يبقون في جهنم جُثيّاً . فالمعنى : وعلاوة على ذلك ننجي الذين اتّقوا من ورود جهنم . وليس المعنى : ثمّ ينجي المتقين من بينهم بل المعنى أنهم نَجَوْا من الورود إلى النّار . وذكر إنجاء المتقين : أي المؤمنين ، إدماج ببشارة المؤمنين في أثناء وعيد المشركين .وجملة { ونذر الظالمين فيها جثياً } عطف على جملة { وإن منكم إلاّ واردها }. والظالمون : المشركون .والتعبير بالّذين ظلموا إظهار في مقام الإضمار . والأصل : ونذركم أيها الظالمون .ونذر : نترك ، وهو مضارع ليس له ماض من لفظه ، أمات العرب ماضي ( نذر ) استغناء عنه بماضي ( ترك ) ، كما تقدّم عند قوله تعالى : { ثم ذرهم في خوضهم يلعبون } في سورة الأنعام ( 91 ).فليس الخطاب في قوله وإن منكم إلاّ واردها } لجميع النّاس مؤمنهم وكافِرِهم على معنى ابتداء كلام؛ بحيث يقتضي أن المؤمنين يردون النّار مع الكافرين ثم يُنْجوَن من عذابها ، لأنّ هذا معنى ثقيل ينبو عنه السياق ، إذ لا مناسبة بينه وبين سياق الآيات السابقة ، ولأنّ فضل الله على المؤمنين بالجنّة وتشريفهم بالمنازل الرفيعة ينافي أن يسوقهم مع المشركين مَساقاً واحداً ، كيف وقد صُدّر الكلام بقوله{ فوربك لنحشرنهم والشياطين } \\[ مريم : 68 \\] وقال تعالى : { يوم نحشر المتقين إلى الرحمان وفداً ونسوق المجرمين إلى جهنم ورداً } \\[ مريم : 85 ، 86 \\] ، وهو صريح في اختلاف حشر الفريقين .فموقع هذه الآية هنا كموقع قوله تعالى : { وإن جهنم لموعدهم أجمعين } \\[ الحجر : 43 \\] عقب قوله { إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين } \\[ الحجر : 42 \\]. فلا يتوهم أن جهنّم موعد عباد الله المخلصين مع تقدّم ذكره لأنّه ينبو عنه مقام الثناء .وهذه الآية مثار إشكال ومحطّ قيل وقال؛ واتفق جميع المفسرين على أن المتّقين لا تنالهم نار جهنّم ، واختلفوا في محل الآية فمنهم من جعل ضمير { منكُم } لجميع المخاطبين بالقرآن ، ورووه عن بعض السلف فصدمَهم فساد المعنى ومنافاة حكمة الله والأدلّة الدالة على سلامة المؤمنين يومئذ من لقاء أدنى عذاب ، فسلكوا مسالك من التّأويل ، فمنهم من تأوّل الورود بالمرور المجرد دون أن يمس المؤمنين أذى ، وهذا بُعد عن الاستعمال ، فإن الورود إنما يراد به حصول ما هو مودع في المَورد لأنّ أصله من وُرود الحوض . وفي آي القرآن ما جاء إلاّ لمعنى المصير إلى النّار كقوله تعالى : { إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون لو كان هؤلاء آلهة ما وردوها } \\[ الأنبياء : 98 ، 99 \\] وقوله { يقدم قومه يوم القيامة فأوردهم النار وبئس الورد المورود } \\[ هود : 98 \\] وقوله { ونسوق المجرمين إلى جهنم وِرداً } \\[ مريم : 86 \\]. على أن إيراد المؤمنين إلى النّار لا جدوى له فيكون عبثاً ، ولا اعتداد بما ذكره له الفخر ممّا سمّاه فوائد .ومنهم من تأوّل ورود جهنّم بمرورالصراط ، وهو جسر على جهنّم ، فساقوا الأخبار المروية في مرور الناس على الصراط متفاوتين في سُرعة الاجتياز . وهذا أقل بُعداً من الذي قبله .وروى الطبري وابن كثير في هذين المحملين أحاديث لا تخرج عن مرتبة الضعف مما رواه أحمد في «مسنده» والحكيمُ التّرمذي في «نوادر الأصول» . وأصح ما في الباب ما رواه أبو عيسى الترمذي قال : «يرد النّاس النّار ثمّ يصدرون عنها بأعمالهم» الحديث في مرور الصراط .ومن النّاس من لفق تعضيداً لذلك بالحديث الصحيح : أنه «لا يموت لمسلم ثلاثة من الولد فيلج النّار إلاّ تَحلة القسم» فتأول تحلة القسم بأنها ما في هذه الآية من قوله تعالى : { وإن منكم إلاَّ واردها } وهذا محمل باطل ، إذ ليس في هذه الآية قسم يتحلل ، وإنّما معنى الحديث : إن من استحق عذاباً من المؤمنين لأجل معاص فإذا كان قد مات له ثلاثة من الولد كانوا كفارة له فلا يلج النّار إلاّ ولوجاً قليلاً يشبه ما يفعل لأجل تحلة القسم ، أي التحلل منه . وذلك أن المقسم على شيء إذا صعب عليه بر قسمه أخذ بأقل ما يتحقق فيه ما حلف عليه ، فقوله «تحلة القسم» تمثيل .ويروى عن بعض السلف روايات أنّهم تخوفوا من ظاهر هذه الآية ، من ذلك ما نقل عن عبد الله بن رواحة ، وعن الحسن البصري ، وهو من الوقوف في موقف الخوف من شيء محتمل .وذكر فعل { نَذَرُ } هنا دون غيره للإشعار بالتحقير ، أي نتركهم في النار لا نعبأ بهم ، لأن في فعل الترك معنى الإهمال .والحتم : أصله مصدر حتمه إذ جعله لازماً ، وهو هنا بمعنى المفعول ، أي محتوماً على الكافرين ، والمقضي : المحكوم به . وجُثِيّ تقدم .وقرأ الجمهور\n\n",
      "translations": [
        {
          "translation": "(There is not one of you but shall approach it) there is not a single one of you, to the exclusion of prophets and messengers, save that he will enter it, i.e. hell. (That is a fixed ordinance of your Lord) it is a decree that must necessarily take place.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِن مِّنكُمْ إِلاَّ وَارِدُهَا } الورودُ: الدُّخولُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, \"There is not one of you but will come to it\" - the coming is the entrance.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَ } اعلموا { إِن مِّنكُمْ } أي: ما منكم أيها المتلذذون بزخرفة الدنيا { إِلاَّ وَارِدُهَا } أي: ورادُ النار وواقعُها\n ذاق كلُ منكم من عذابها مقدارَ ما يتلذذ من الدنيا\n\nأمَّا المؤمنون المطيعون المتقون الذين يقنعون في الدنيا بسدِّ جوعةٍ ولبسِ خشنٍ وكنٍ ضروري\n فيمرون عليها وهي خادمةً عبرة لهم منها وشكراً لنعمه النجاة عنها\n\n\nوأمَّا المؤمنون العاصون التائبون\n فيذوقون من عذابها مقدار تلذذهم بالمعاصي\n ثم يخرجون على مقتضى عدله سبحانه\n\n\nوأمَّا أصحاب الكبائر من المؤمنين الخارجين من الدنيا عليها بلا توبةٍ\n وعموم الكفرة والمشركين\n فه الواردون المقصرون على الورود فيها إلا أن المؤمنين تلحقهم الشفاعة\n\n\nوأمَّا الكفرة لهم الخالدون المخلدون لا نجاة لهم منها أصلاً\n\n\nولا تتردوا أيها السامعون ولا تشكّوا في المذكور\n إذ { كَانَ } ورودكم وعرض النار عليكم من جملة الأحكام المبرمة الإلهية التي وجب { عَلَىٰ رَبِّكَ } يا أكمل الرسل وجوباً { حَتْماً مَّقْضِيّاً } [مريم: 71] محققاً بلا شبهةٍ و تخلفٍ اوجبها سبحانه على نفسه لِحِكَمٍ ومصالحَ خص سبحانه في سترها ولم يفش على أحدٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِن منكم إِلا وارِدُها } \n فيه التفات لإظهار مزيد الاعتناء\n وقرئ: \" وإن منهم \"\n ويحتمل أن يكون الخطاب لجميع الخلق\n أي: وإن منكم أيها الناس { إلا واردها } أي: واصلها وحاضرها\n يمرُ بها المؤمنون وهي خامدة\n وتنهار بغيرهم\n وعن جابر أنه صلى الله عليه وسلم سُئل عن ذلك فقال:\n \" إِذَا دَخَلَ أَهْلَ الجَنَّة قَالَ بَعْضُهُمْ لِبَعْضٍ: أَليْسَ قَدْ وعدنَا ربُّنا أَنْ نَرِدَ النَّارَ؟ فَيُقالُ لَهُمْ: قَدْ وَرَدْتُمُوهَا وَهِيَ خَامِدَةٌ \" \nوأما قوله تعالى: { أُولَئِكَ عَنْهَا مُبْعَدُونَ } فالمراد به الإبعاد عن عذابها\n وقيل: ورودها: الجواز على الصراط بالمرور عليها\n وعن ابن مسعود: الضمير في { واردها } للقيامة\n وحينئذ فلا يعارض:\n[الأنبياء: 102]\n ولا ما جاء فيمن يدخل الجنة بغير حساب\n ولا مرور على الصراط\n فضلاً عن الدخول فيها\n على أنه اختلف في الورود\n فقيل: الدخول وتكون بردًا وسلامًا على المؤمن\n\nوقيل: المرور كما تقدم\n وقيل: الإشراف عليها والاطّلاع\n قال القشيري: كلٌّ يَرِدُ النارَ\n ولكن لا ضيْرَ منها ولا إحساس لأحدٍ إلا بمقدار ما عليه من السيئات\n والزلل\n فأشدُّهم فيها انهماكًا: أشدهم فيها بالنار اشتعالاً واحتراقًا\n وأما بريء الساحة\n نقي الجانب بعيد الذنوب\n فكما في الخبر: \" إن النار عند مرورهم ربوة كربوة اللَّبَن - أي: جامدة كجمود اللبن حين يسخن - فيدخلونها ولا يحسون بها\n فإذا عبروها قالوا: أليس قد وعدنا جهنم على الطريق؟ فيقال لهم: عبرتم وما شعرتم \"\n هـ\n { كان على ربك حتمًا مقضيًّا } أي: كان وُرودهم إياها أمرًا محتومًا أوجبه الله تعالى على ذاته\n وقضى أنه لا بد من وقوعه\n وقيل: أقسم عليه\n ويشهد له: \" إلا تحلة القسم \"\n { ثم نُنَجِّي الذين اتقوا } الكفرَ والمعاصي\n بأن تكون النار عليهم بردًا وسلامًا\n على تفسير الورود بالدخول\n وعن جابر أنه قال: سمعت النبي صلى الله عليه وسلم يقول:\n \" الوُرودُ الدُّخولُ\n لا يَبْقَى بَرٌّ ولا فَاجِرٌ إِلاَّ دخَلَهَا\n فَتَكُونُ عَلَى المُؤْمِنِينَ بَرْدًا وسَلاَمًا\n كَمَا كَانَتْ عَلَى إِبْرَاهِيم\n حَتَّى إنَّ لِلنَّارِ ضَجِيجًا مِنْ بَرْدِهِمْ \" \nوإن فسرنا الورود بالمرور\n فنجاتهم بالمرور عليها والسلامة من الوقوع فيها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:99",
      "similarity": 0.17658220010671088
    },
    {
      "verse": "11:98",
      "similarity": 0.17253246059238966
    },
    {
      "verse": "19:86",
      "similarity": 0.16645625975639974
    },
    {
      "verse": "21:98",
      "similarity": 0.15256324397113752
    },
    {
      "verse": "55:37",
      "similarity": 0.14490565966108765
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019071.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019071.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}