{
  "chapter": "مريم",
  "text": "ثم ننجى الذين اتقوا۟ ونذر الظلمين فيها جثيا",
  "translations": [
    {
      "translation": "Then We will rescue those who had taqwa and We will leave the wrongdoers in it on their knees.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall deliver those who took heed for themselves, and leave the evil-doers kneeling there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall deliver those that feared Allah and leave the wrong-doers there on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will save the pious ones from the hell fire and leave the unjust people therein in crowded groups.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall then rescue the pious – and leave the unjust in it, fallen on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall save those who had Taqwa. And We shall leave the wrongdoers in it, Jithiyya.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will deliver those who guarded (against evil), and We will leave the unjust therein on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall deliver those that were godfearing; and the evildoers We shall leave there, hobbling on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall rescue those who kept from evil, and leave the evil-doers crouching there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall save those who feared God, but the wrongdoers shall be left there on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall deliver those who have feared, and shall have the wrong-doers therein kneeling. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will deliver those who are Godwary, and leave the wrongdoers in it, fallen on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We shall save those who guarded against evil, and We shall leave the wrong-doers therein, (humbled) to their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We shall save those who use to fear Allah and were dutiful to Him. And We shall leave the Zalimun (polytheists and wrongdoers, etc.) therein (humbled) to their knees (in Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We will save those who were cautious of Us, but the harmdoers shall be left there hobbling on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will rescue those who were devout, and leave the wrongdoers in it, on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will save those who feared Allah and leave the wrongdoers within it, on their knees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:72] Then We will deliver (read nunajjī or nunjī) those who were wary, of [committing] idolatry or disbelief, [We will deliver them] from it, and leave those who did wrong, by way of idolatry and disbelief, crouching therein, on their knees.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We shall rescue those who kept from evil) those who ward off disbelief, idolatry and indecency, (and leave the evil-doers) the idolaters (crouching) all gathered for eternity (there) in hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } ثم الورود والوصول { نُنَجِّي } ونخلص { ٱلَّذِينَ ٱتَّقَواْ } عن محارمنا في النشأة الأولى اتقاءً من سخطنا وطلباً لمرضاتنا { وَّنَذَرُ ٱلظَّالِمِينَ } الخارجين عن مقتضى أوامرنا ونواهينا خالدين { فِيهَا جِثِيّاً } [مريم: 72] لا يمكنهم الخروج والتجاوز عنها أصلاً، بل صاروا مزدحمين فيها مضيَّقين معذَّبين بأنواع العذاب أبد الآباد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nوإن فسرنا الورود بالمرور، فنجاتهم بالمرور عليها والسلامة من الوقوع فيها، { ونذَرُ الظالمين فيها جِثيًّا }: باركين على ركبهم، قال ابن زيد: الجثي شر الجلوس، لا يجلس الرجل جاثيًا إلا عند كرب ينزل به\n هـ\n الإشارة: من أراد كرامة الآخرة فَلْيُرَبِّ يقينه فيها، حتى تكون نصب عينيه، فإنه يرد على الله كريمًا\n ومن أراد السلامة من أهوالها فليخفف من أوساخها وأشغالها، ويلازم طاعة الله واتباع الرسول صلى الله عليه وسلم\n ومن أراد سرعة المرور على الصراط، فليلزم اليوم اتباع الصراطِ المستقيم، فبقدر ما يستقيم عليها تستقيم أقدامه على الصراط، وبقدر ما يزل عنها يزلُّ عن الصراط\n قال في الإحياء، لما تكلم على العدل في الكيل والوزن، قال بعد كلامه: وكل مكلف فهو صاحب موازين في أفعاله وأقواله وخطراته، فالويل له إن عدل عن العدل، ومال عن الاستقامة، ولولا تعذُّر هذا واستحالته لما ورد قوله تعالى: { وإن منكم إلا واردها\n\n\n } الآية، فلا ينفك عبدٌ ليس معصومًا عن الميل عن الاستقامة، إلا أن درجات الميل تتفاوت تفاوتًا عظيمًا، فبذلك تتفاوت مدة إقامتهم في النار إلى أوان الخلاص، حتى لا يبقى بعضُهم إلا بقدر تحلة القسم، ويبقى بعضهم ألفًا وألوف سنين، نسأل الله تعالى أن يقربنا من الاستقامة والعدل، فإن الاستداد على متن الصراط المستقيم من غير ميل عنه غير مطموع فيه فإنه أدق من الشعرة، وأحدّ من السيف، ولولاه لكان المستقيم عليه لا يقدر على جواز الصراط الممدود على متن النار، الذي من صفته أنه أدق من الشعر، وأحدّ من السيف، وبقدر الاستقامة على الصراط المستقيم يخِف مرور العبد يوم القيامة على الصراط\n\n\nهـ\n وقال الترمذي الحكيم: يجوز الأولياء والصديقون وهم لا يشعرون بالنار، قال الله تعالى:\n\n[الأنبياء: 101]، وإنما بَعُدوا عنها لأن النور احتملهم واحتوشهم، فهم يمضون في النار، حتى إذا خرجوا منها قال بعضهم لبعض: أليس قد وُعدنا النار، فذكر ما تقدم\n ثم قال: فأما ضجة النار فمن بردهم، وذلك أن الرحمة باردة تطفئ غضب الرب، فبالرحمة نالوا النور، حتى أشرق في قلوبهم وصدورهم، فكان نوره في قلوبهم، والرحمة مظلة عليهم، فخمدت النار من بردهم عندما لقُوهَا، فضجت من أجل أنها خلقت منتقمة، فخافت أن تضعف عن الانتقام\n ولذلك رُوي أنها تقول: \" جُزْ يا مؤمن فقد أطفأ نورُك لهبي \"\n هـ\n وقال الورتجبي: إذا كان جمال الحق مصحوبهم، فلا بأس بالوقوف في النيران، فإن هناك أهل الجنان\n\n\n\n\n هـ\n وقال جعفر الصادق: لولا مقاربة النفوس ما دخل أحد النار، فلما فارقتهم نفوسهم أوردهم النار بأجمعهم، فمَنْ كان أشد إعراضًا عن خبث النفس كان أسرع نجاة من النار، ألا ترى الله يقول: { ثم نُنجي الذين اتقوا }\n هـ\n قلت: وقد تقدم أن من لا حساب عليهم - وهم المقربون - يمرون على الصراط ولا يحسون به، وهم الذين يمرون عليه كالطير أو كالبرق، جعلنا الله منهم بمنِّه وكرمه، وبجاه خير الخلق مولانا محمد نبيه وحبه، آمين\n ثمَّ ذكر أحوال من سقط في جهنم ويبقى فيها جثياً\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:28",
      "similarity": 0.8797998911439108
    },
    {
      "verse": "19:68",
      "similarity": 0.7874086819273205
    },
    {
      "verse": "75:21",
      "similarity": 0.11550354066393585
    },
    {
      "verse": "74:11",
      "similarity": 0.1101488692751885
    },
    {
      "verse": "2:278",
      "similarity": 0.10707317583816707
    }
  ]
}