{
  "chapter": "مريم",
  "text": "ونسوق المجرمين الى جهنم وردا",
  "translations": [
    {
      "translation": "But We will drive the evildoers to Hell, like cattle to a watering hole.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And drive the wicked into Hell like cattle driven to water,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We shall drive the guilty ones to Hell as a thirsty herd.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the criminals will be driven and thrown into hell,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And drive the guilty towards hell, thirsty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall drive the criminals to Hell, in a thirsty state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will drive the guilty to hell thirsty\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and drive the evildoers into Gehenna herding,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And drive the guilty unto hell, a weary herd,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We shall drive the sinful like a thirsty herd into Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And shall drive the culprits to Hell as a herd. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and drive the guilty as a thirsty herd towards hell,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall drive the sinners to Hell, like thirsty cattle driven down to water,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall drive the Mujrimun (polytheists, sinners, criminals, disbelievers in the Oneness of Allah, etc.) to Hell, in a thirsty state (like a thirsty herd driven down to water),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and drive the evildoers as herds, into Gehenna\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And herd the sinners into hell, like animals to water.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And will drive the criminals to Hell in thirst\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:86] and drive the guilty, [guilty] on account of their disbelief, into Hell, a thirsty herd (wirdan, the [accusative] plural of wārid, meaning ‘one who is thirsty and on foot).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And drive the guilty) the idolaters (unto hell, a weary herd) in a state of thirst,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَنَسُوقُ ٱلْمُجْرِمِينَ إِلَىٰ جَهَنَّمَ وِرْداً } معناهُ عُطَاشَى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ونسوق المجرمين } لأعمالهم الخبيثة { إلى جهنم } الطبيعة { ورداً } كأنهم إبل عطاش فيوردهم النار { لا يملكون الشفاعة إلا من اتخذ عند الرحمن عهداً } هذا العهد هو ما عاهد الله أهل الإيمان من الوفاء بالعهد السابق بالتوبة والإنابة إليه في الصفاء الثاني بعد الصفاء الأول، وذلك الانسلاخ عن حجب صفات النفس والاتصاف بصفات الرحمن والاتصال بعالم القدس الذي هو حضرة الصفات ولهذا ذكر اسم الرحمن المعطي لأصول النِعَم وجلائلها المشتمل على سائر الصفات اللطيفة، أي: لا يملك أحد أن يشفع له بالأمداد الملكوتية والأنوار القدسية إلا من استعدّ لقبول الرحمة الرحمانية واتصل بالجناب الإلهي بالعهد الحقيقي\n وعن ابن مسعود أن النبي صلى الله عليه وسلم قال لأصحابه ذات يوم:\n\n \" أيعجز أحدكم أن يتخذ عند كل صباح ومساء اللهمّ فاطر السموات والأرض، عالم الغيب والشهادة، أني أعهد إليك أني أشهد أن لا إله إلا أنت، وحدك لا شريك لك، وأنّ محمداً عبدك ورسولك، وأنك إن تكلني إلى نفسي تقرّبني من الشرّ وتباعدني من الخير، وإني لا أثق إلا برحمتك، فاجعل لي عهداً تؤتنيه يوم القيامة، إنك لا تخلف الميعاد \"\n \n\n{ إن كل من في السموات والأرض إلا آتي الرحمن عبداً } لكونهم في حيز الإمكان ومكمن العدم لا وجود لهم ولا كمال إلا به، أفاض باسم الرحمن وجوداتهم وكمالاتهم، فهم أنفسهم ليسوا شيئاً، فلو لم يعبدوه حق عبادته باستعدادات أعيانهم في العدم لما وجدوا، ولو لم يعبدوه بعد الوجوه بالقيام بحقوق نعمه التي أنعمها عليهم لما كملوا، فهم مربوبون، مجبورون وفي طيّ قهره وملكته مقهورون\n\n\n{ لقد أحصاهم } في الأزل بإفادة أعيانهم واستعداداتهم الأزلية من فيضه الأقدس وتعيينها بعلمه { وعدّهم عدّاً } فماهياتهم وحقائقهم إنما هي صور معلومات ظهرت في العدم بمحض عالميته وبرزت إلى الوجود بفيض رحمانيته، فكيف تماثله وتناسبه\n { وكلهم آتيه يوم القيامة } الصغرى منفرداً مجرداً عن الأسباب والأعوان كما كان في النشأة الأولى ويوم القيامة الوسطى { فرداً } من العلائق البدنية مجرداً عن الصفات النفسانية والقوى الطبيعية\n وأما في القيامة الكبرى فكل من عليها فان، ويبقى وجه ربّك ذو الجلال والإكرام\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَنَسُوقُ ٱلْمُجْرِمِينَ } يومئذ سَوق البهائم المجرمة الجانية إلى السجن والحبس بالقهر والغضب التام { إِلَىٰ جَهَنَّمَ } التي هي أسوأ الأماكن وأظلمها وأعمقها { وِرْداً } [مريم: 86] ورود البهائم إلى المجلس والأغوار بزجرٍ تامٍ من الضرب المؤلم والتصويب وغيرهما\n\n\n\n\nوهم في تلك الحالة حيارى مضطربين، لا تنفعهم أعمالهم ولا معبوداتهم الباطلة، ولا يشفعون لهم ولا ينقذونهم من النار كما زعموا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ونَسُوقُ المجرمين } كما تُساق البهائم { إِلى جهنم وِرْدًا }: عطاشًا، فإن من يرد الماء لا يرده إلا للعطش، أو كالدواب التي ترد الماء، أي: يوم نحشر الفريقين نفعل ما نفعل مما لا يفي به نطاق العبارة، لما يقع فيه من الدواهي الطامة، أو الكرائم العامة، أو: اذكر يوم نحشر الفريقين، على طريق الترغيب والترهيب",
      "translations": []
    }
  ]
}