{
  "chapter": "مريم",
  "text": "فلا تعجل عليهم انما نعد لهم عدا",
  "translations": [
    {
      "translation": "So do not try to hasten their punishment. We are simply counting out the number of their days.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, do not be hasty with them. We are counting their number (of days).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, do not hasten (in seeking a scourge against them). We are counting their days.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), exercise patience; We have given them respite only for an appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not be impatient for them (O dear Prophet Mohammed – peace and blessings be upon him); We are only completing their number.* (* The number of days left for them or their evil deeds.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So make no haste against them; We only count out to them a (limited) number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore be not in haste against them, We only number out to them a number (of days).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So hasten thou not against them; We are only numbering for them a number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So make no haste against them (O Muhammad). We do but number unto them a sum (of days).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So take no hasty action against them; their days are numbered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So hasten thou not against them; We are only counting against them a counting. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not make haste against them; indeed We are counting for them, a counting [down].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So make no haste against them, for We but count out to them a (limited) number (of days).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So make no haste against them; We only count out to them a (limited) number (of the days of the life of this world and delay their term so that they may increase in evil and sins).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, do not hasten (things) against them, for We count out to them a number,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not hurry against them. We are counting for them a countdown.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be not impatient over them. We only count out to them a [limited] number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:84] So do not make haste against them, to demand [that they receive] chastisement. Indeed We are only counting for them, the days and the nights, or [their] every breath, carefully, until the time [arrives] for their chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So make no haste against them (0 Muhammad)) do not hasten chastisement upon them. (We do but number unto them a sum) one breath after another.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلاَ تَعْجَلْ عَلَيْهِمْ } يا أكمل الرسل بعدما علمتَ حالهم بإهلاكنا إياهم وانتقامنا عنهم\n ولا تيأس من إمهالنا وتأخيرنا إهلاكهم أن نهمل عن أخذهم وانتقامهم\n بل { إِنَّمَا نَعُدُّ لَهُمْ } بإمهالنا إياهم أياهم آجالهم وأوقاتها { عَدّاً } [مريم: 84] متى وصل وقتها أخذناهم واستأصلناهم\n بحيث أمِنت أنت ومن معك من المؤمنين من شرورهم وفسادهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { فلا تعجل عليهم } بأن يهلكوا حسبما تقتضي جناياتهم ويبيدوا عن آخرهم، وتطهرُ الأرض من فسادهم، { إِنما نعدّ لهم عَدًّا } أي: لا تستعجل بهلاكهم، فإنه لم يبق لهم إلا أيام وأنفاس قلائل نعدها عدًا، ثم نأخذهم أخذًا\n والله تعالى أعلم\n\n\nالإشارة: كل من اتخذ شيئًا يتعزز به من دون الله وطاعته انقلب عليه ذُلاً وهوانًا، ولذلك قيل: \" من تعزز بمخلوق مات عزه \"\n فإن أردت عزًا لا يفنى فلا تتعزز بعز يفنى، وهو التعزز بالمال أو الجاه، أو غير ذلك مما يفنى، وسيأتي عند قوله:\n\n[فاطر: 10]\n\n\n[المنَافِقون: 8] زيادة بيان\n وكما أرسل الحق تعالى الشياطين على الكافرين تزعجهم إلى المعاصي أرسل الملائكة والواردات الإلهية إلى المؤمنين تنهضهم إلى طاعة الله، وتزعجهم إلى السير لمعرفة الله\n فالملائكة تحرك العبد إلى الطاعة، والواردات تزعجه إلى الحضرة، تخرجه عن عوائده وتدمغ له مِن علائقه، وعوائقه، حتى ينفرد لحضرة الحق: وفي الحكم: \" الوارد يأتي من حضرة قهار، لأجل ذلك لا يصادمه شيء إلا دمغه { بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق }\n وقال أيضًا: \" متى وردت الواردات الإلهية عليك هدمت العوائد لديك \" إن الملوك إذا دخلوا قرية أفسدوها \"\n وقال القشيري على قوله: { تؤزهم أزًّا }: أي: تزعجهم إزعاجًا، فخاطر الشيطان يكون بإزعاج وظلمة، وخاطر الحقِّ يكون بَروْحٍ وسكون، وهذه إحدى الفوارق بينهما\n هـ\n قلت: ومن الفوارق أيضًا: أن خاطر الحق لا يأمر إلا بالخير مع برودة وانشراح في القلب وسكون وأناة\n\n\n وفي الحديث:\n\n \" العجلة من الشيطان، والآناة من الرحمن \" \n\nهـ\n بخلاف خاطر الشيطان فإنه لا يأمر إلا بالشر، وقد يأمر بالخير إذا كان يجرُّ به إلى الشر، وعلامته أن يكون فيه ظلمة ودَخن وعجلة وبطش، وقد استوفى الكلام عليهم في النصيحة الكافية\n وبالله التوفيق\n ثمَّ ذكر قال فريق الإيمان وفريق الضلال\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:204",
      "similarity": 0.6182645007201543
    },
    {
      "verse": "37:176",
      "similarity": 0.6182645007201543
    },
    {
      "verse": "2:203",
      "similarity": 0.5685668665112353
    },
    {
      "verse": "20:83",
      "similarity": 0.5527657657522256
    },
    {
      "verse": "21:37",
      "similarity": 0.51910038691865
    }
  ]
}