{
  "chapter": "مريم",
  "text": "لا يملكون الشفعة الا من اتخذ عند الرحمن عهدا",
  "translations": [
    {
      "translation": "They have no right of intercession. None do but those who have a contract with the All-Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None will have power to intercede for them except one who obtains a promise from Ar-Rahman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day none will have the power to intercede for them except those who received a sanction from the Most Compassionate Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "no one will be able to intercede for the others except those whom the Beneficent God has given authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People do not own the right to intercede, except those* who have made a covenant with the Most Gracious. (* The Holy Prophets and virtuous people will be given the permission to intercede. Prophet Mohammed – peace and blessings be upon him – will be the first to intercede.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None shall have the power of intercession, but such a one as has received permission (or promise) from the Most Gracious (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall not control intercession, save he who has made a covenant with the Beneficent Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "having no power of intercession, save those who have taken with the All-merciful covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have no power of intercession, save him who hath made a covenant with his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one will have power to intercede, except for those who have permission from the Lord of Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall not own intercession, excepting those who have taken of the Compassionate a covenant. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "no one will have the power to intercede [with Allah], except for him who has taken a covenant with the All-beneficent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None shall have the power of intercession, but such a one as has received permission (or promise) from (Allah) Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None shall have the power of intercession, but such a one as has received permission (or promise) from the Most Beneficent (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who have no power of intercession, except those who have taken a covenant with the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have no power of intercession, except for someone who has an agreement with the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None will have [power of] intercession except he who had taken from the Most Merciful a covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:87] They, namely, mankind, will not have the power to intercede, save him who has made a covenant with the Compassionate One, [the covenant being] the profession of lā ilāha illā’Llāh wa-lā hawla wa-lā quwwata illā bi’Llāh, ‘there is no god but God, and there is no power or strength except in God’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَا يَمْلِكُونَ الشَّفَاعَةَ إِلَّا مَنِ اتَّخَذَ عِنْدَ الرَّحْمَنِ عَهْدًا (87)ومعنى { لا يملكون } لا يستطيعون ، فإنّ المِلك يطلق على المقدرة والاستطاعة . وقد تقدّم عند قوله تعالى : { قل أتعبدون من دون الله ما لا يملك لكم ضراً ولا نفعاً } في سورة العقود ( 76 ).\n\n",
      "translations": [
        {
          "translation": "(They will have no power of intercession) the angels will not intercede for anyone, (save him who hath made a covenant with his Lord) through the attestation of \"there is no deity except Allah\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ مَنِ ٱتَّخَذَ عِندَ ٱلرَّحْمَـٰنِ عَهْداً } معناهُ قَولُ لاَ إِلهَ إِلاَّ الله\n\n",
      "translations": [
        {
          "translation": "\n\nThe saying of the Most Merciful: {Except for those who made a covenant with the Most Merciful}, meaning that there is no god but Allah.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ هم { لاَّ يَمْلِكُونَ ٱلشَّفَاعَةَ } لأنفهسم ليخففوا العذاب عنهم متى أرادوا\n بل لا شفاعة لهم { إِلاَّ مَنِ ٱتَّخَذَ } وحصل له { عِندَ ٱلرَّحْمَـٰنِ } أي: من عنده { عَهْداً } [مريم: 87] إذناً بالشفاعة لمن أراد سبحانه إنقاذه بشفاع ذلك الشفيع كشفاعة بعض الأنبياء لعصاة أممهم\n وإن أذن لهم الرحمن المستعان\n\n\n{ وَ } كيف يحصل لهؤلاء الهالكين النجاة من نيران الحرمان\n والخلاص من سعير الخذلان والخسران\n مع جرمهم الذي هو أعظم الجرائم عند الله وأفحشها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { لا يملكون الشفاعة }: استئناف مبين لما فيه من الأمور الدالة على هوله\n وضمير الواو: إما لجميع العباد المدلول عليهم بذكر الفريقين لانحصارهم فيها\n أو إلى المتقين فقط\n أو إلى المجرمين\n و { مَن اتخذ }: منصوب على الاستثناء\n أو بدل من الواو\n أي: لا يملك العباد أن يشفعوا لغيرهم إلا من استعد له بالتحلي بالإيمان والتقوى\n ففيه ترغيب للعباد في تحصيل الإيمان والتقوى\n المؤدي إلى نيل هذه الرتبة العليا\n أو لا يملك المتقون الشفاعة إلا شفاعة من اتخذ العهد بالإسلام والعمل الصالح\n أو لا يملك المجرمون أن يشفع لهم إلا من كان منهم مسلمًا\n فيشفع في مثله\n فَمَن\n على هذا الثالث\n بدل من الواو فقط\n والأول أحسن لعمومه\n قال ابن مسعود رضي الله عنه: سمعت النبي صلى الله عليه وسلم يقول:\n \" أما يَعْجزُ أَحدكُمْ أَنْ يتَّخِذَ كُلَّ صَبَاحٍ وَمَساءٍ عَهدًا عِند اللهِ\n يَقُولُ كُلَّ صَبَاحٍ ومَساءٍ: اللهُمَّ فَاطِرَ السماوَاتِ والأرْض\n عَالِمَ الغَيْبِ والشَّهَادةِ\n إنِّي أَعْهَدُ إِلَيْكَ في هذهِ الحياةَ الدنيا\n بأَنِي أشْهَدُ أنْ لاَ إِلهَ إِلاَّ أنتَ\n وَحْدكَ لا شَرِيكَ لَكَ\n وأَنَّ مُحَمَّدًا عَبْدُكَ ورَسُولُكَ\n فلا تكلني إلى نفسي\n فإِنَكَ إنْ تَكلْنِي إلى نَفسْي تُقَرِّبْنِي مِنَ الشرِّ وتُبَاعِدْنِي مِنَ الخَيْرِ\n وإنّي لاَ أَثِقُ إلاَّ بِرَحْمَتِكَ\n فاجَْعلْ لِي عِنْدَكَ عَهْدًا تُوفِّينِيه يَوْمَ القِيامَةِ\n إنَّكَ لا تُخْلفُ المِيعادَ\n فإذا قالَ ذَلِكَ طُبعَ عَلَيْهِ طابَع ووُضِعَ تَحْتَ العَرْشِ\n فَإذَا كَانَ يَوْمُ القِيَامَةِ نَادَىَ مُنَادٍ: أَيْنَ الذِينَ لَهُمْ عِنْدَ اللهِ عَهْدٌ فَيَدْخُلُونَ الجنَّة \" \n \nهـ\n الإشارة: ورود العباد على الله يوم القيامة يكون على قدر ورودهم إليه اليوم في الدنيا\n فبقدر التوجه إليه اليوم تعظم كرامة وروده في الآخرة\n فمن ورد على الله تعالى من باب الطاعة الظاهرة حملته صور الطاعات إلى الآخرة\n ومن ورد من باب الطاعات القلبية حملته الأنوار إلى الفراديس العالية\n ومن ورد من باب الطاعات السرية - كالفكرة والنظرة في مقام المشاهدة - حمله الحق إلى الحضرة القدسية\n فيكون في مقعد صدق عند مليك مقتدر\n قال شيخ شيوخنا\n سيدي عبد الرحمن العارف في قوله تعالى: { وفدًا }: قيل: ركبانًا على نجائب طاعتهم\n وهم مختلفون\n فمن راكب على صور الطاعات\n ومن راكب على نجائب الهمم\n ومن راكب على نجائب الأنوار\n ومن محمول يحمله الحق في عقباه\n كما يحمله اليوم في دنياه\n وليس محمول الحق كمحمول الخلق\n هـ\n وقوله تعالى: { لا يملكون الشفاعة\n\n\n } الآية\n اعلم أن العهد الذي تكون به الشفاعة يوم القيامة هو الطاعة وتربية اليقين والمعرفة\n فتقع الشفاعة لأهل الطاعات على قدر طاعتهم وإخلاصهم\n وتقع لأهل اليقين على قدر يقينهم\n وهم أعظم من أهل المقام الأول\n وتقع لأهل المعرفة على قدر عرفانهم\n وهم أعظم من القسمين\n حتى إن منهم من يشفع في أهل عصره كلهم\n وقد سَمِعْتُ من شيخنا الفقيه\n شيخ الجماعة سيدي التاودي بن سودة\n أن بعض الأولياء قال عند موته: يا رب شفعني في أهل زماني\n فقال له الحق تعالى - من جهة الهاتف -: لم يبلغ قدرك هذا\n فقال: يا رب إن كان ذلك من جهة عملي واجتهادي فَلَعَمْرِي إنه لم يبلغ ذلك\n وإن كان من جهة كرمك وجودك فوعزتك وجلالك لهو أعظم من هذا\n فقال له: إني شفعتك في أهل عصرك\n هـ\n بالمعنى\n فمن رجع إلى كرم الله وجوده\n ودخل من هذا الباب\n وجد الإجابة أقرب إليه من كل شيء\n وبالله التوفيق\n ثمَّ كرر الرد على أهل الشرك والضلال وشنع عليهم:",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:100",
      "similarity": 0.6101635029151379
    },
    {
      "verse": "43:86",
      "similarity": 0.5799477977326465
    },
    {
      "verse": "30:13",
      "similarity": 0.5544983898346372
    },
    {
      "verse": "39:44",
      "similarity": 0.5468600699782062
    },
    {
      "verse": "39:43",
      "similarity": 0.5334855007489175
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019087.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019087.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:87.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}