{
  "chapter": "مريم",
  "text": "قال كذلك قال ربك هو على هين وقد خلقتك من قبل ولم تك شيـا",
  "translations": [
    {
      "translation": "(The angel) answered: \"Thus will it be. Your Lord said: 'This is easy for Me; for when I brought you into being you were nothing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answered: \"So shall it be.\" Your Lord says: \"It is easy for Me,\" and then added: \"For beyond doubt, I created you earlier when you were nothing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The angel) said, \"This is true, but your Lord says, 'For Me it is easy; I created you when you did not exist\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (the angel) said, “So it is; your Lord says, ‘This is easy for Me – in fact I created you before this, at a time when you did not exist.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Thus your Lord says: `It is easy for Me. Certainly I have created you before, when you had been nothing!\"') [19:8-9]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: So shall it be, your Lord says: It is easy to Me, and indeed I created you before, when you were nothing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'So it shall be; thy Lord says, \"Easy is that for Me, seeing that I created thee aforetime, when thou wast nothing.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: So (it will be). Thy Lord saith: It is easy for Me, even as I created thee before, when thou wast naught.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"It will be so! Your Lord says, 'It is easy for Me for I created you when you were nothing before.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: even so! Thy Lord saith: it is unto Me easy, whereas surely I created thee afore when thou wast not aught.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘So shall it be. Your Lord has said, ‘‘It is simple for Me.’’ Certainly I created you before when you were nothing.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"So (it will be) thy Lord saith, 'that is easy for Me: I did indeed create thee before, when thou hadst been nothing!'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"So (it will be). Your Lord says; It is easy for Me. Certainly I have created you before, when you had been nothing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'It shall be so; your Lord says: \"It is easy for Me, indeed, I created you before time when you were not a thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “It will be so, your Lord says, ‘it is easy for me, and I created you before, when you were nothing.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[An angel] said, \"Thus [it will be]; your Lord says, 'It is easy for Me, for I created you before, while you were nothing.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:9] He said, ‘It, the matter [in question], of creating a boy from both of you, shall be so! Your Lord says, “It is easy for Me, namely, to restore your sexual potency and tear open your wife’s womb [in preparation] for conception, for I certainly created you before when you were nothing”’, [you were nothing] before your created form became manifest. As God wished to manifest this great power, He inspired him [the form of] the question, in order for him to receive the response that will indicate it [this power]. And when his soul yearned for the prompt arrival of that whereof he had been given good tidings:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Gabriel said to him: (So (it will be)) just as I have told you. (Thy Lord saith: It is easy for Me) i.e. his creation is easy for Me, (even as I created thee) Zachariah (before) before John, (when thou wast naught).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } سبحانه: يا زكريا لا تستبعد من قدرتنا أمثال هذا بل { كَذٰلِكَ } أي: مثل ذلك قدّرنا لك أبناً بأن تكون باقياً على كبرك وهرمك، وزوجتك أيضاً على هرمها وعقرها، نخرج ونوجد منكما الولد إظهاراً لقدرتنا الكاملة وأمثال هذا وإن كان عسر عادةً، علينا يسيرُ وفي جانب قدرتنا سهلُ يا زكريا\n\n\n\n\nكذلك { قَالَ رَبُّكَ } اسمع قوله: { هُوَ عَلَيَّ هَيِّنٌ } أي: إخراج الولد منك ومن زوجتك عليّ سهلُ يسيرُ وفي جنب حولي وقوتي حقيرُ { وَ } كيف لا يكون سهلاً إني { قَدْ خَلَقْتُكَ } وقدَّرت وجودك فيما مضى من العدم { مِن قَبْلُ وَلَمْ تَكُ شَيْئاً } [مريم: 9] ولا مسبوقاً بشيءٍ، بل أوجدتك إيجاداً إبداعياً، وأظهرتك من كتم العدم إظهاراً إختراعياً بلا سبق مادةٍ ومدةٍ وسببٍ وعادةٍ، وهذا هينُ بالنسبة إلى ذاك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال كذلك }: خبر، أي: الأمر كذلك، فيوقف عليه، ثم يقول: { قال ربك } ، أو مصدر لقال الثانية، أي: مثل ذاك القول قال ربك",
      "translations": []
    }
  ]
}