{
  "chapter": "مريم",
  "text": "ان الذين ءامنوا۟ وعملوا۟ الصلحت سيجعل لهم الرحمن ودا",
  "translations": [
    {
      "translation": "As for those who have iman and do right actions, the All-Merciful will bestow His love on them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Ar-Rahman will show love for those who believe and do the right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the Most Compassionate Lord will soon create enduring love for those who believe and do righteous works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the righteously striving believers God will grant love.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who believed and did good deeds – the Most Gracious will appoint love for them. (In the hearts of other believers.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe and work deeds of righteousness, the Most Gracious will bestow love for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who believe and do good deeds for them will Allah bring about love.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who believe and do deeds of righteousness -- unto them the All-merciful shall assign love.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who believe and do good works, the Beneficent will appoint for them love.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord of Mercy will bestow affection upon those who believe and perform righteous deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who believe and do righteOUs works--anon the Compassionate shall appoint for them affection. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who have faith and do righteous deeds—the All-beneficent will endear them [to His creation].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On those who believe and work deeds of righteousness, will (Allah) Most Gracious bestow love.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe [in the Oneness of Allah and in His Messenger (Muhammad SAW)] and work deeds of righteousness, the Most Beneficent (Allah) will bestow love for them (in the hearts of the believers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do righteous deeds, the Merciful will assign for them love.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do righteous deeds, the Most Merciful will give them love.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have believed and done righteous deeds - the Most Merciful will appoint for them affection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:96] Truly those who believe and perform righteous deeds — for them the Compassionate One shall appoint love, between them, so that they have mutual love and affection, and God, exalted be He, will love them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) between them and their Lord, (the Beneficent will appoint for them love) Allah will love them and make people love them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَيَجْعَلُ لَهُمُ ٱلرَّحْمَـٰنُ وُدّاً } معناه مَحبةٌ فِي صِدورِ المؤمنين\n\n",
      "translations": [
        {
          "translation": " The Most Merciful will place affection in the hearts of the believers.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ الذين آمنوا } الإيمان الحقيقي العلمي أو العيني { وعملوا الصالحات } من الأعمال المزكية المصفية المعدّة لقبول تجليات الصفات بالتجرد عن ملابس صفاتهم { سيجعل لهم الرحمن ودّاً } كما قال:\n \" لا يزال العبد يتقرّب إليّ بالنوافل حتى أحبه\n فإذا أحببته كنت سمعه الذي يسمع به\n وبصره الذي يبصر به\n ويده التي يبطش بها \" \nوفي الحقيقة هذا الودّ أثر ونتيجة العناية الأولى المستفادة من قوله:\n[المائدة\n الآية:54]\n فإذا أحبه قبل الظهور في مكمن الغيب بمحبة الاجتباء ألزمه حبّه الله عند البروز وحرّكه إلى الوفاء بالعهد السابق فتجدّد ذلك العهد بالعقد اللاحق الذي هو العهد مع الله بالوفاء بذلك في متابعة الحبيب المطلق كما قال:\n[آل عمران\n الآية: 31]\n وإن صحت المتابعة في الأعمال والأحوال أحبه الله بمحبة الاصطفاء فوق المحبة التي هي ثمرة المحبة الأولى لكون الأولى عينية كامنة ولكونها كمالية وبارزة وقعت محبته في قلوب الخلق وظهر له القبول عند أهل الإيمان الفطري\n وعن رسول الله صلى الله عليه وسلم:\n \" إذا أحبّ الله عبداً يقول الله تعالى: يا جبريل قد أحببت فلاناً فأحبه\n فيحبه جبريل\n ثم ينادي في أهل السماء: أن الله تعالى قد أحبّ فلاناً فأحبوه\n فيحبه أهل السماء\n ثم يضع له المحبة في الأرض \" \nوعن قتادة: ما أقبل عبد إلى الله إلا أقبل الله بقلوب العباد إليه\n وهذا معنى قوله: { سيجعل لهم الرحمن وداً } والله أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأطاعوا لرسله والمؤيَّدين من عنده وامتثلوا بجميع ما جاءوا به من الأوامر والنواهي المبيَّنة في الكتب الإلهية المنزَّلة عليهم { وَ } مع ذلك { عَمِلُواْ ٱلصَّالِحَاتِ } من النوافل المقربة إلى الله طلباً لرضاه وابتغاءً لوجهه { سَيَجْعَلُ } ويحدِث { لَهُمُ ٱلرَّحْمَـٰنُ } المتكفل لجزائهم وإثابتهم بمقتضى سعة رحمته وجوده ووفور لطفه { وُدّاً } [مريم: 96] ومحبةً في قلوب جميع المؤمنين حتى يحبوهم\n ويتحننوا نحوهم\n بلا سبق الوسائل والأسباب العادية الموجبة لمودة البعض للبعض من الإنعام والإحسان وأنواع العطية والإكرام\n مع محبة عموهم عباد الله للبدلاء المنسلخين عن مقتضيات لوازم البشرية\n\n\nثم قال سبحانه امتناناً على حبيبه\n وإشارةً إلى عظم رتبة القرآن الجامع لجميع المعارف والأحكام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: لما استحقر الكفرةُ أحوالَ المؤمنين حتى قالوا: { أينا خير مقامًا وأحسن نديًّا } ، أخبر الله تعالى المؤمنين وبشرهم أنهم سيعزهم ويلقى مودتهم في قلوب عباده. يقول الحقّ جلّ جلاله: { إِنَّ الذين آمنوا وعملوا الصالحات سيجعلُ لهم الرحمن } في قلوب الناس مودة وعطفًا، حتى يحبهم كل من سمع بهم، فيحبهم ويحببهم إلى عباده من أهل السماوات والأرض، أي: سيحدث لهم في القلوب مودةً من غير تعرض لأسبابها، سوى ما لهم من الإيمان والعمل الصالح، أو { وُدًّا } فيما بينهم، فيتحابون ويتواددون ويحبهم الله. قال القشيري: يجعل في قلوبهم ودًّا لله، وهو نتيجة أعمالهم الخالصة، وفي الخبر: \" لا يزال العبد يتقرب إليَّ بالنوافل حتى يحبني وأحبه \". والتعرض لعنوان الرحمانية لِمَا أنَّ الموعود من آثارها، وأن مودتهم رحمة بهم وبمن أحبهم. وعن النبي صلى الله عليه وسلم قال لعليّ رضي الله عنه:\n \" قل اللهُمَّ اجْعَلْ لِي عِنْدكَ عَهْدًا، واجعل لِي في صُدُورِ المؤمِنِينَ مَوَدَّةً \" \nفنزلت الآية. وفي حديث البخاري وغيره:\n \" إِذا أحَبَّ اللهُ عبدًا قال لجبْريل: إني أُحبُ فُلانًا فأَحِبَّهُ، فَيُحِبُّهُ جَبْرِيلُ، ثُمَّ يُنَادي في أَهْلِ السَّماءِ إنَّ اللهَ قَدْ أحَبَّ فُلانًا فأَحبُّوهُ، فَيُحبُّهُ أهْلُ السَّمَاءِ، ثُمَّ يَضع لَهُ المحبة فِي الأرْض \". \nوقال قتادة: { سيجعل لهم الرحمن ودًا } قال: أي والله ودًا في قلوب أهل الإيمان. وإن هرم بن حيان يقول: ما أقبل عبدٌ بقلبه على الله إلا أقبل الله بقلوب أهل الإيمان إليه، حتى يرزقه مودتهم ورحمتهم. قلت: ولفظ الحديث:\n \" ما أقْبَلَ عبدٌ بقلْبهِ إلى اللهِ عزّ وجلّ إلا جَعلَ الله قلوبَ المؤمنينَ تَفِدُ إليه بالودِّ والرحمَةِ، وكان الله إليه بكل خيرٍ أسرَعَ \" \nنقله في الترغيب. وفي حديث آخر:\n \" يُعطى المؤمنُ ودًّا في صدور الأبرار، ومهابة في صدور الفجار \" \nفَتَوَدُّد الناس للعبد دليل على قبوله عند مولاه. أنتم شهداء الله في أرضه. وفي بعض الأثر: \" لا يموت العبد الصالح حتى يملأ مسامعه مما يُحب، ولا يموت الفاجر حتى يملأ مسامعه مما يكره \". بالمعنى. وأتى الحقّ جلّ جلاله بالسين لأن السورة مكية، وكانوا إذ ذلك ممقوتين عند الكفرة، فوعدهم ذلك، ثم أنجزه لهم حين جاء الإسلام، فعَزوا وانتصروا، وتعشقت إليهم قلوب الخلق من كل جانب، كما هو مسطر في تواريخهم. وقيل: الموعود في القيامة، حين تعرض حسناتهم على رؤوس الأشهاد كأنها أنوار الشمس الضاحية، ولعل إفراد هذا بالوعد من بين ما لهم من الكرامات السنية لأن الكفرة سيقع بينهم يومئذ تقاطع وتباغض وتضاد. والله تعالى أعلم. الإشارة: سُنَّة الله تعالى في أوليائه، في حال بدايتهم، أن يُسلط عليهم الخلق، وينزل عليهم الخمول والذل بين عباده، حتى يمقتهم أقرب الناس إليهم، رحمة بهم واعتناء بقلوبهم لئلا تسكن إلى غيره.\nقال الشيخ أبو الحسن الشاذلي رضي الله عنه: اللهم إن القوم قد حكمت عليهم بالذل حتى عزوا... الخ. فإذا تطهروا من البقايا وكملت فيهم المزايا، وتمكنوا من معرفة الحق، أعزهم وألقى مودتهم في قلوب عباده، هذا دأبه معهم في الغالب، وقد يحكم على بعضهم بالخمول حتى يلقاه على ذلك، ولا يكون ذلك نقصًا في حقه بل كمالاً، وهم شهداء الملكوت، لم يأخذوا من أجرهم شيئًا. والله تعالى أعلم. ولما ختم السورة الكريمة أمر نبيه عليه الصلاة والسلام بتبليغها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:14",
      "similarity": 0.6925966296488862
    },
    {
      "verse": "11:90",
      "similarity": 0.6174180460190265
    },
    {
      "verse": "60:7",
      "similarity": 0.5057307413479839
    },
    {
      "verse": "30:21",
      "similarity": 0.41155329278968994
    },
    {
      "verse": "3:69",
      "similarity": 0.39663765567359427
    }
  ]
}