{
  "chapter": "مريم",
  "text": "ان كل من فى السموت والارض الا ءاتى الرحمن عبدا",
  "translations": [
    {
      "translation": "There is no one in the heavens and earth who will not come to the All-Merciful as a slave.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no one in the heavens and the earth but comes before Ar-Rahman in all obedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no one in the heavens and the earth but he shall come to the Most Compassionate Lord as His servant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth will return to the Beneficent God as His submissive servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All those who are in the heavens and the earth will come to the Most Gracious as His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none in the heavens and the earth but comes unto the Most Gracious as a slave.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no one in the heavens and the earth but will come to the Beneficent Allah as a servant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None is there in the heavens and earth but he comes to the All-merciful as a servant;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none in the heavens and the earth but cometh unto the Beneficent as a slave.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there is none in the heavens or on the earth but shall return to the Merciful in utter submission,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None there is in the heavens and the earth but must come unto the Compassionate as a bondman. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none in the heavens and the earth but he comes to the All-beneficent as a servant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not one of the beings in the heavens and the earth but must come to (Allah) Most Gracious as a servant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none in the heavens and the earth but comes unto the Most Beneficent (Allah) as a slave.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none in the heavens and earth except he comes to the Merciful as a worshiper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none in the heavens and the earth but will come to the Most Merciful as a servant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no one in the heavens and earth but that he comes to the Most Merciful as a servant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:93] There is none in the heavens and the earth but he comes to the Compassionate One as a servant, servile, submissive, on the Day of Resurrection, including [individuals such as] Ezra and Jesus.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There is none in the heavens and the earth but cometh unto the Beneficent as a slave) acknowledging his servitude to the All-Merciful and obedient to Him except, that is, the disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { إِن كُلُّ مَن فِي ٱلسَّمَٰوَٰتِ } من الملائكة المهيمين المستغرقين بمطالعة جمال الله، المستوحشين من سطوة جلاله { وَٱلأَرْضِ } أي: مَن في عالم الطبيعة المتوجهة نحو مبدعها طوعاً { إِلاَّ آتِي ٱلرَّحْمَـٰنِ } المهّدِ الممد لهم أضلال أسمائه الحسنى وأوصافه العظمى، والمفيضِ عليهم من رشحات بحر وجوده، بمقتضى فضله وجوده { عَبْداً } [مريم: 93] متذللاً مقهوراً تحت تصرفه، مصروفاً حسب قدرته وإرادته، محاطاً تحت حيطة حضرة علمه ولوح قضائه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}