{
  "chapter": "مريم",
  "text": "ان دعوا۟ للرحمن ولدا",
  "translations": [
    {
      "translation": "at their ascription of a son to the All-Merciful!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For they have attributed a son to Ar-Rahman,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "at their ascribing a son to the Most Compassionate Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to ascribe a son to the Beneficent God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Due to their ascribing of an offspring to the Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they ascribe a son to the Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they ascribe a son to the Beneficent Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they have attributed to the All-merciful a son;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That ye ascribe unto the Beneficent a son,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "because they ascribe a son to the Gracious One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they should ascribe unto the Compassionate a son. *Chapter: 19\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they should ascribe a son to the All-beneficent!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they should invoke a son for (Allah) Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they ascribe a son (or offspring or children) to the Most Beneficent (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "because they have ascribed a son to the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because they attribute a son to the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they attribute to the Most Merciful a son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:91] that they have ascribed a son to the Compassionate One. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That ye ascribe unto the Beneficent a son) Ezra,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكل ذلك من خوف سطوة صفاته الجلالية، ومقتضيات أسمائه القهرية، المنبعثة من الغيرة الإلهية، الناشئة منه سبحانه بواسطة { أَن دَعَوْا } وأثبتوا { لِلرَّحْمَـٰنِ } المقدس المبرئ في ذاته عن لوازم الحدوث والإمكان { وَلَداً } [مريم: 91]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أن دعوا }: على حذف اللام، أي: لأن دعوا، وفيه احتمالات أُخر\n يقول الحقّ جلّ جلاله: { وقالوا اتخذ الرحمنُ ولدًا } هذه المقالة صدرت من اليهود والنصارى، ومن يزعم من العرب أن الملائكة بنات الله، لعن الله جميعهم، فسبحان الله وتعالى عن ذلك علوًا كبيرًا، فحكى جنايتهم إثر جناية عَبَدهَ الأصنام، وعطف القصة على القصة لاشتراكهم في الضلالة، قال تعالى في شأنهم: { لقد جئتم شيئًا إِدًّا } أي: فعلتم أمرًا منكرًا شديدًا، لا يقادر قدره، فهو رد لمقالتهم الباطلة، وتهويل لأمرها بطريق الالتفات المنبئ عن كمال السخط وشدة الغضب، المفصح عن غاية التشنيع والتقبيح، وتسجيل عليهم بغاية الوقاحة والجهل\n و { جاء } يستعمل بمعنى فعل، فيتعدى تعديته، والإد - بكسر الهمزة وفتحها، وقُرئ بهما في الشاذ -: العظيم المنكر، الإدُّ: الشدة، قيل: الأدُّ: في كلام العرب: أعظم الدواهي\n  ثم وصفه وبيّن هوله فقال: { تكادُ السماواتُ يتفطّرنَ منه }: يتشققن مرة بعد أخرى، من عظم ذلك الأمر وشدة هوله، وهو أبلغ من \" ينفطرن \" كما قرئ به، { وتنشقُّ الأرضُ } أي: وتكاد تنشق وتذهب، { وتخرُّ الجبالُ } أي: تسقط وتنهدم { هَدًّا } بحيث لا يبقى لها أثر\n والمعنى: أن هول تلك الكلمة الشنعاء وعظمها، بحيث لو تصورت بصورة محسوسة، لم يُطق سمعها تلك الأجرام العظام، ولتفتتت من شدة قبحها، أو: إن فظاعتها واستجلاب الغضب والسخط بها بحيث لولا حلمه تعالى، لخر العالم وتبددت قوائمه، غضبًا على من تفوه بها\n قال محمد بن كعب: كاد أعداء الله أن يقيموا علينا الساعة، يعني: لأن ما ذكر أوصاف الساعة\n وذلك { أن دَعَوا للرحمنِ ولدًا } أي: تكاد تنفطر السماوات وتنشق الأرض، وتنهدم الجبال لأجل أن دعوا، أي: نسبوا أو سموا للرحمن ولدًا، { وما ينبغي للرحمنِ أن يتخِذَ ولدًا } أي: قالوا اتخذ الرحمن ولدًا، أو دعوا له ولدًا، والحال أنه مما لا يليق به تعالى اتخاذ الولد لاستحالته عليه تعالى\n ووضع الرحمن موضع الضمير للإشعار بعلية الحكم لأن كل ما سواه تعالى منعَّم عليه برحمته، أو نعمة من أثر الرحمة، فكيف يتصور أن يجانس من هو مبدأ النعم ومولى أصولها وفروعها، حتى يتَوهم أن يتخذه ولدًا، وقد صرح به قوله عزّ قائلاً: { إِن كل من في السماوات والأرض } أي: ما منهم من أحد من الملائكة أو الثقلين { إِلا آتي الرحمنِ عبدًا } مملوكًا لله في الحال بالانقياد وقهرية العبودية\n { لقد أحصاهم } أي: حصرهم وأحاط بهم، بحيث لا يخرج أحد من حيطة علمه، وقبضة قدرته وقهريته، ما وجد منهم وما سيوجد، وما يقدر وجوده لو وجد، كل ذلك في علمه وقضائه وقدره وتدبيره، لا خروج لشيء عنه، وفي ذلك تصوير لقيام ربوبيته على كل شيء، وأنه عالم بكل شيء جملة وتفصيلاً، { وكلهم آتيه يومَ القيامةِ فردًا } أي: وكل واحد منهم يأتي يوم القيامة فردًا من الأموال والأنصار والأتباع، متفردًا بعمله، فإذا كان شأنه تعالى وشأنهم كذلك فأنى يتوهم احتمال أن يتخذ شيئًا منهم ولدًا؟!\n\n\nوفي الحديث القدسي:\n\n \" قال الله تعالى: كذَّبني عبدي، ولم يكن له ذلك، وشَتمني عبدي ولم يكن له ذلك، أما تكذيبُهُ إيايَ فأن يقولَ: من يُعيدُنا كما بَدأنا؟ وأما شَتمُه إياي فأن يقول: اتخذ الله ولدًا، وأنا الأحدُ الصمدُ، لم أَلِد ولم أُولدَ، ولم يكن لي كُفوًا أحد \" \n\nوهو في البخاري\n وفي صيغة اسم الفاعل في قوله: { آتيه } من الدلالة على إتيانهم كذلك ألبتة ما ليس في صيغة المضارع لو قيل يأتيه\n والله تعالى أعلم\n الإشارة: إذا علمت أيها المؤمن أن الحق جلّ جلاله يغضب هذا الغضب الكلي على من أشرك مع الله، أو اعتقد فيه ما ليس هو عليه من التنزيه وكمال الكمال، فينبغي لك أن تخلص مَشربَ توحيدك من الشرك الجلي والخفي، علمًا وعقدًا وحالاً وذوقًا، حتى لا يبقى في قلبك محبة لشيء من الأشياء ولا خوف من شيء، ولا تعلق بشيء، ولا ركون لشيء، إلا لمولاك، وحينئذ يصفى مشرب توحيدك، وتكون عبدًا لله خالصًا حرًا مما سواه، ومهما بقي فيك شيء من محبة الهوى نقص توحيدك بقدره، ولم تصل إليه ما دمت تميل إلى شيء سواه\n وفي ذلك يقول الششتري رضي الله عنه:\n\nفكن عبدًا لله حقيقة، وانخرط في سلك قوله: { إِن كل من في السماوات والأرض إِلا آتي الرحمن عبدًا }\n فحينئذ تكون حرًا مما سواه، وَيملكك الوجود بأسره، يكون عند أمرك ونهيك\n وفي ذلك يقول القائل:\n\nوإذا فتحت عين القدرة وعين الحكمة وضعت كل شيء في محله، فتتنزه بعين القدرة في رياض الملكوت وبحار الجبروت، وتتنزه بعين الحكمة في بهجة الملك وأسرار الحكمة\n فعين القدرة تقول: كل من في السماوات والأرض عبد مملوك تحت قهرية ذاته، فاعرف الضدين، وأنزل كل واحد في محله، تكنْ عارفًا بالله، فإن أردت أن تعرفه بضد واحد بقيت جاهلاً به\n فالحكمة تثبت العبودية صورة صونًا لكنز الربوبية، والقدرة تغيبك عنها بشهود أسرار الربوبية، وفي الحكم: \" سبحان من ستر سر الخصوصية بظهور وصف البشرية، وظهر بعظمة الربوبية في إظهار العبودية \"\n فالعبودية لازمة من حيث العبد، والغيبة عنها واجبة من حيث الرب، فإثبات العبودية، حكمةً، فرق، والغيبة عنها في شهود أنوار الربوبية: جمع، فالعارف مجموع في فرقه، مفروق في جمعه\n ولما ذكر قبائح الكفرة أتبعه بذكر محاسن المؤمنين\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:88",
      "similarity": 0.7246338011794491
    },
    {
      "verse": "90:3",
      "similarity": 0.6891699259686325
    },
    {
      "verse": "112:3",
      "similarity": 0.6446435598602668
    },
    {
      "verse": "37:152",
      "similarity": 0.6266917766059877
    },
    {
      "verse": "19:92",
      "similarity": 0.6200306550337308
    }
  ]
}