{
  "chapter": "مريم",
  "text": "وكم اهلكنا قبلهم من قرن هل تحس منهم من احد او تسمع لهم ركزۢا",
  "translations": [
    {
      "translation": "How many generations We have destroyed before them! Do you see a trace of any one of them or hear even a whisper of them?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We laid low before them. Do you see any sign of them, or hear the least whisper of them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How numerous are the peoples that We destroyed before them! Do you now perceive any one of them, or hear even their whisper?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations living before them did We destroy? Do you find anyone of them around or do you even hear any word from them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a generation We did destroy before them; do you see any one of them or hear their faintest sound?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation before them have We destroyed! Can you find a single one of them or hear even a whisper of them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation have We destroyed before them! Do you see any one of them or hear a sound of them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation We destroyed before them! Dost thou perceive so much as one of them, or hear of them a whisper?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation before them have We destroyed! Canst thou (Muhammad) see a single man of them, or hear from them the slightest sound?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations We have destroyed before them! Can you find a single one of them alive now, or hear so much as a whisper from them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation have We destroyed before them! Perceivest thou of them anyone or hear of them a whisper? *Chapter: 20\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation We have destroyed before them! Can you descry any one of them, or hear from them so much as a murmur?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how many (countless) generations before them have We destroyed? Canst thou find a single one of them (now) or hear (so much as) a whisper of them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation before them have We destroyed! Can you (O Muhammad SAW) find a single one of them or hear even a whisper of them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed before them! Do you sense even one of them, or hear a whisper from them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation have We destroyed before them? Can you feel a single one of them, or hear from them the slightest whisper?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many have We destroyed before them of generations? Do you perceive of them anyone or hear from them a sound?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[19:98] And how many — in other words, many — a generation, namely, [how many] a community from among the communities of the past, We have destroyed before them, for their denial of [Our] messengers. Can you see, [can] you find, [so much as] one of them, or hear from them [so much as] the faintest sound? No, indeed! So, just as We destroyed those [folk], We shall destroy these [Meccans]. Meccan, except for verses 130 and 131, which are Medinese; it consists of 135, 140 or 142 verses, revealed after [sūrat] Maryam.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And how many a generation) many a bygone nation (before them) before your own people, Muhammad, (have We destroyed! Canst thou (Muhammad) see a single man of them) after having destroyed them, (or hear from them the slightest sound) after being annihilated and turned into ruins?' And of the surah in which Ta-Ha is mentioned, which is all Meccan and consists of 132 verses, 1,301 words and 5,242 letters: Surah 20: Ta-Ha And of the surah in which Ta-Ha is mentioned, which is all Meccan and consists of 132 verses, 1,301 words and 5,242 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ تَسْمَعُ لَهُمْ رِكْزاً } معناه صَوتٌ خَفيفٌ\n\n",
      "translations": [
        {
          "translation": "\n\nOr you hear a faint sound from them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { كَمْ أَهْلَكْنَا قَبْلَهُمْ مِّن قَرْنٍ } أي: أهلكنا كثيراً من أقوامٍ مضوا\n كانوا متمادين أمثلهم في الغي والضلال\n مصرين على المراء والجدال\n\n\nتأمل والتفت يا أكمل الرسل وتشعر { هَلْ تُحِسُّ } أي: وتشعر { مِنْهُمْ } من المهلكين { مِّنْ أَحَدٍ } نجا\n وبقي سالماً من قبضة وسطوة قهرنا وغضبنا { أَوْ تَسْمَعُ لَهُمْ رِكْزاً } [مريم: 98] صوتاً خفياً يُسمع من قبورهم ومدافنهم\n بل صاروا كأن لم يكونوا أصلاً\n وما ذلك وأمثاله علينا بعزيز\n\n\nرب اختم عواقب أمورنا بالخير والحسنى\n\n\nخاتمة السورة\n\nعليك أيها السالك المتدبر المتأمل في الأسماء الحسنى الإلهية\n والمستكشفُ عن رموز صفاته الثبوتية والسببية والجمالية والجلالية\n واللطفية والقهرية\n وجميع الأوصاف المتقابلة والمتماثلة الإلهية\n أن تتعمق وتتأمل في معنى اسم الرحمن الذي كرره سبحانه في هذه السورة مراراً كثيرةً\n وتدبَّر فيه كي تصل وتستكشف إلى أن مبدأ جميع ما ظهر وبطن\n وكان ويكون\n وإنما هو هذا الاسم المشير إلى سعة رحمة الحق\n ووفور جوده وفضله على مظاهره ومصنوعاته\n إذ به استوى سبحانه على عروش جميع الكوائن والفواسد\n وبه ظهر ما ظهر من كتم العدم\n\n\nوبالجملة: ما من موجودٍ محققٍ محسوسٍ أو مقدرٍ مخطورٍ\n إلا وهو في حيطة هذا الاسم وتحت تربيته وتصرفه\n بحيث لو انقطع إمداده عن العالم طرفةً لم يبقَ للعالم ظهور ووجود أصلاً\n\n\nومتى تحققتَ بهذا الاسم العظيم\n ويقنت شموله وإحاطته لجميع المظاهر شمول عطفٍ ولطفٍ\n فزتَ بحقيقة قوله سبحانه: { إِن كُلُّ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ إِلاَّ آتِي ٱلرَّحْمَـٰنِ عَبْداً } [مريم: 93]\n\n\nجعلنا ممن تحقق بمعاني أسمائه الحسنى\n واستكشف عن سرائر صفاته الأسنى\n بفضله وطَوله\n وسعة رحمته وجوده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكم أهلكنا قَبْلَهم من قَرنٍ } أي: كثيرًا من القرون الماضية أهلكنا قبل هؤلاء المعاندين\n فهو وعد لرسول الله صلى الله عليه وسلم بالنصر على الكفرة ووعيد لهم بالهلاك\n وحث له صلى الله عليه وسلم على الإنذار\n أي: دُم على إنذارك لهم\n فسيهلكون كما أهلكنا من قبلهم من القرون\n { هل تُحِسُّ منهم أحدٍ } أي: هل تشعر بأحد منهم\n وترى له من باقية { أو تَسْمَعُ لهم رِكْزًا } أي: صوتًا خفيًا\n هيهات قد انقطع دابرهم وهدأت أصواتهم\n وخربت قصورهم وديارهم\n وكذلك نفعل بغيرهم\n والمعنى: أهلكناهم بالكلية\n واستأصلناهم بحيث لا يُرى منهم أحد\n ولا يسمع لهم صوت خفي ولا جلي\n وجملة: { هل تحس }: استئناف مقرر لمضمون ما قبله\n وأصل الرِّكز: الخفاء\n ومنه: رَكَزَ الرمحَ إذا غيب طَرفه في الأرض\n والرِّكاز: المال المدفون المخفي\n والله تعالى أعلم\n الإشارة: ما أنزل الله القرآن وسهله على عباده إلا ليقع به الوعظ والتذكير\n فأمر اللهُ رسوله في حياته بالبشارة والإنذار به\n وبقي الأمر لخلفائه\n فالواجب على العلماء والأولياء أن يتصدوا للوعظ والتذكير\n ولا يكفي عنه تعليم رسوم الشريعة\n فإن الوعظ إنما هو التخويف والتبشير\n كما قال تعالى: { لتُبشر به المتقين وتُنذر به قومًا لُدًّا }\n لكن لا يتصدى للوعظ إلا من له نور يمشي به في الناس\n فيسبقه نورُ قلبه إلى القلوب المستمعة\n فيقع كلامهم في قلوب السامعين\n قال في الحكم: \" تسبق أنوارُ الحكماء أقوالَهم\n فحيثما صار التنوير وصل التعبير \"\n هذا النور هو نور المعرفة الذي هي مقام الفناء\n ويشترط فيه أيضًا: أن يكن مأذونًا له في الكلام من شيخ كامل\n أو وحي إلهامي حقيقي\n فحينئذ يقع كلامه في مسامع الخلق\n وفي الحكم: \" من أُذن له في التعبير حسنت في مسامع الخلق عبارته\n وجُليت إليهم إشارته \"\n وقال أيضًا: \" ربما برزت الحقائق مكسوفة الأنوار\n إذا لم يؤذن لك فيها بالإظهار \"\n وفي أمثال هؤلاء المتصدين للوعظ والتذكير ورد الخبر القدسي:\n \" إنَّ أودَّ الأوِدَّاءِ إليّ من يُحببني إلى عبادي\n ويُحبب عبادي إليّ\n ويمشون في الأرض بالنصيحة \" \n\n\n جعلنا الله من خواصهم بمنِّه وكرمه آمين\n وصلَّى اللهُ على سيدنا محمد وآله وصحبه\n وسلَّم تسليمًا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:102",
      "similarity": 0.22102024311872703
    },
    {
      "verse": "3:52",
      "similarity": 0.2055564950206454
    },
    {
      "verse": "12:87",
      "similarity": 0.20129057301305192
    },
    {
      "verse": "21:12",
      "similarity": 0.18333309298013212
    },
    {
      "verse": "3:152",
      "similarity": 0.16709298480509607
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/019098.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/019098.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/19:98.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}