{
  "chapter": "الفاتحة",
  "text": "بسم الله الرحمن الرحيم",
  "translations": [
    {
      "translation": "In the name of Allah, All-Merciful, Most Merciful",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, most benevolent, ever-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Merciful, the Compassionate\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the Beneficent, the Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah - beginning with the name of - the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Beneficent, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of God, the Merciful, the Compassionate\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Beneficent, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "﻿In the name of God, the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Compassionate, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the All-beneficent, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, Most Gracious, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the Most Beneficent, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the Merciful, the Most Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of God, the Gracious, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Entirely Merciful, the Especially Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[1:1] In the Name of God, the Compassionate, the Merciful:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "In the name of Allah, the Beneficent, the Merciful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحَدَّثنا أبو جعفر\n قال: حَدَّثنا علي بن أحمد\n قال: حدَّثَنا عَطاءُ بنِ السَّائب\n قال: حدَّثَنا أبو خالد عمرو بن خالد الواسطي عن زيد بن علي عليهما السلام\n أنه سُئل عن فاتحةِ الكتابِ فقال: { بِسمِ ٱلله } هو تعظيمٌ لله { الرَّحْمٰنِ } بما خَلَقَ من الأرضِ في الأرضِ، والسَّماءِ في السَّماءِ",
      "translations": [
        {
          "translation": "\n\nAbu Jafar told us {something}\n\n\nHe said: \"Ali ibn Ahmad told us...\"\n\n\n{Ata' ibn al-Sa'ib} told us:\n He said: Abu Khalid Omar bin Khalid al-Wasiti narrated to us from Zaid bin Ali, may peace be upon them both.\n He was asked about the opening of the book and said: {In the name of God} is a glorification of God {The Merciful} for what He created of the earth on earth, and the heaven in heaven.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nاسم الشيء ما يعرف به، فأسماء الله تعالى هي الصور النوعية التي تدلّ بخصائصها وهوياتها على صفات الله وذاته، وبوجودها على وجهه، وبتعينها على وحدته، إذ هي ظواهره التي بها يعرف\n و { الله } اسم للذات الإلهية من حيث هي هي على الإطلاق، لا باعتبار اتصافها بالصفات، ولا باعتبار لا اتصافها\n و { الرحمن } هو المفيض للوجود والكمال على الكل بحسب ما تقتضي الحكمة وتحتمل القوابل على وجه البداية\n و { الرحيم } هو المفيض للكمال المعنويّ المخصوص بالنوع الإنساني بحسب النهاية، ولهذا قيل: \" يا رحمن الدنيا والآخرة \" ، ورحيم الآخرة\n فمعناه بالصورة الإنسانية الكاملة الجامعة الرحمة العامّة والخاصة، التي هي مظهر الذات الإلهي والحق الأعظمي مع جميع الصفات ابدأ واقرأ، وهي الاسم الأعظم وإلى هذا المعنى أشار النبي صلى الله عليه وسلم بقوله:\n\n \" أوتيت جوامع الكلم، وبعثت لأتمم مكارم الأخلاق \" \n\n، إذ الكلمات حقائق الموجودات وأعيانها\n كما سمي عيسى عليه السلام كلمة من الله، ومكارم الأخلاق حالاتها وخواصها التي هي مصادر أفعالها جميعها محصورة في الكون الجامع الإنساني\n وههنا لطيفة وهي أن الأنبياء عليهم السلام وضعوا حروف التهجي بإزاء مراتب الموجودات\n وقد وجدت في كلام عيسى عليه الصلاة والسلام وأمير المؤمنين علي عليه السلام وبعض الصحابة ما يشير إلى ذلك\n ولهذا قيل: ظهرت الموجودات من باء بسم الله إذ هي الحرف الذي يلي الألف الموضوعة بإزاء ذات الله\n فهي إشارة إلى العقل الأول الذي هو أول ما خلق الله المخاطب بقوله تعالى:\n\n \" ما خلقت خلقاً أحب إليّ ولا أكرم عليّ منك، بك أعطي، وبك آخذ، وبك أثيب، وبك أعاقب\n\n\n \" \n\nالحديث\n والحروف الملفوظة لهذه الكلمة ثمانية عشر، والمكتوبة تسعة عشر\n وإذا انفصلت الكلمات انفصلت الحروف إلى اثنين وعشرين، فالثمانية عشر إشارة إلى العوالم المعبر عنها بثمانية عشر ألف عالم، إذ الألف هو العدد التام المشتمل على باقي مراتب الأعداد فهو أمّ المراتب الذي لا عدد فوقه، فعبر بها عن أمّهات العوالم التي هي عالم الجبروت، وعالم الملكوت، والعرش، والكرسي، والسموات السبع، والعناصر الأربعة، والمواليد الثلاثة التي ينفصل كل واحد منها إلى جزئياته\n والتسعة عشر إشارة إليها مع العالم الإنساني، فإنه وإن كان داخلاً في عالم الحيوان إلا أنه باعتبار شرفه وجامعيته للكل وحصره للوجود عالم آخر له شأن وجنس برأسه له برهان، كجبريل من بين الملائكة في قوله تعالى:\n\n[البقرة، الآية: 98]\n والألفات الثلاثة المحتجبة التي هي تتمة الاثنين والعشرين عند الانفصال إشارة إلى العالم الإلهيّ الحقّ، باعتبار الذات، والصفات، والأفعال\n فهي ثلاثة عوالم عند التفصيل، وعالم واحد عند التحقيق، والثلاثة المكتوبة إشارة إلى ظهور تلك العوالم على المظهر الأعظميّ الإنسانيّ ولاحتجاب العالم الإلهي\n\n",
      "translations": [
        {
          "translation": "\n\nThe name of a thing is what it is known as.,\n\nThe Names of Allah are the essential qualities that point to His attributes and Essence.,\n\nAnd because she was on his face,\n\nAnd you set it apart from its unity., {They are the} phenomena by which he is known.\n\n\nAnd {Allah} is the name of the divine essence, insofar as it is absolutely self-sufficient.,\n\nThis does not mean that it is identical with the attributes.,\n\nAnd not by any means of reckoning or evaluation\n\n\nAnd {Al-Rahman} is the One who brings existence and perfection to all according to what is required by wisdom and can be borne by the opposites at the beginning.\n\nAnd {al-Rahim} is the dispenser of the completion of the special human spiritual nature according to the end.,\n\nAnd for this reason it is said: \"O Most Merciful of the world and the hereafter.\", The Merciful of the Last.\n This means the complete and comprehensive university of humanity and mercy, public and private.,\n\n{Which is the appearance of the divine Self and the greatest Truth, with all the attributes.},\n\nAnd this is the greatest name, and to this meaning the Prophet (ﷺ) alluded with his saying:\n I got the universities of all words,\n\nI was sent to complete the noble character {of man}\n\n\nThe {Nahda} was a period of intense intellectual and cultural revival in the Arab world that took place during the late 19th and early 20th centuries. It was characterized by a strong sense of national identity and a rejection of Ottoman rule and Western influence. The Nahda also witnessed the rise of Arab nationalism and the birth of the modern Arab state., Words are the reality of things and their essences.\n\n\nAs is named, 'Isa (Jesus) - peace be upon him - a Word from Allah., {And the good character traits and their conditions and properties which are the sources of their actions are all contained in the comprehensive human universe.}\n\n\nAnd here's the beauty of it: the prophets, peace be upon them, have placed the letters of the alphabet in accordance with the hierarchy of the beings.\n\n\nI found in the speech of Jesus and in the speech of Ali ibn Abi Talib and in the speech of some of the companions indications of that.\n\n\nAnd this is why it is said that the existence of things became manifest from the letter Bā’ (ب) of the opening phrase Bismillāh (بسم الله, \"In the name of God\"), since it is the letter that follows the Arabic letter Alif (ا), which represents the divine essence of God.\n\n\nThis is a reference to the first mind, which is the first thing that Allah created, as He says in the Qur'an:\n\n\nI have not created any creature more beloved to me than you, nor have I honored anyone over you.,\n\nI give you,\n\nWith you, I take,\n\nAnd with you, O beloved!,\n\nWith you, I am always on the lookout.\n\n\n\"Classical Arabic is the language of the Qur'an and the Hadith, and is used throughout the Muslim world. It is also the language of Arab culture and literature.\n\n\nThe hadith is a saying or story of the Prophet Muhammad.\n\n\nAnd the letters of this word are eighteen.,\n\nThe written word is eighteen.\n\n\nAnd if the words are separated, the letters are separated into two and twenty.,\n{The Eighteen Signs} refer to the eighteen thousand worlds which they indicate.,\n\nThe number one is the whole number that includes all the other numbers in the sequence, making it the mother of all numbers that have no number above them., He spoke about the mothers of the worlds, who is the world of the Jabrut.,\n\nAnd the world of the kingdom.,\n\nAnd the Throne.,\n\nAnd the chair.,\n\nAnd the seven heavens,\n\nAnd the four elements.,\n\nAnd the three births that each one of them is divided into its parts.\n\n\nAnd the nineteen references to it in the human world.,\n\nEven though he is within the world of animals, he is considered to be honorable and intelligent because of his nobility and wisdom. He is also the only one who has the ability to conceive of and experience an afterlife, making him unique among all creatures.,\n\n\"Gabriel, among the angels, in the words of God Almighty: '\"\n\n\nThe Cow\n\nArabic:\n\nالبقرة, {And whoever is an enemy to Allah and His angels and His messengers and Gabriel and Michael - then indeed, Allah is an enemy to the disbelievers.}\n\nAnd whoever is an enemy to Allah and His angels and His messengers and Gabriel and Michael - then indeed, Allah is an enemy to the disbelievers.\n\n\nAnd the three veiled [letters] which are the continuation of the [letter] alif at the [letter] nūn's point of disconnection are a reference to the divine reality.,\n\nThe self is that which is considered to be the essential core of a person's identity. It is often thought of as the part of a person that remains constant throughout their life, despite the changes they may experience in their thoughts, feelings, and behavior.,\n\nThe attributes of God are perfect and free from all imperfection. He is the First and the Last, the Most High and the Most Near. He is the All-Knowing and the All-Wise. Nothing happens except by His will, and His will is always for the good.,\n\nAnd the verbs\n\n\nThere are three worlds according to the details.,\n\nOne world at realization.,\n\nAnd the three {written} refer to the appearance of those worlds on the greatest human aspect, and the response of the divine world.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بِسمِ ٱلله } المعبر بها عن الذات الأحدية، باعتبار تنزيلها عن تلك المرتبة؛ إذ لا يمكن التعبير عنها باعتبار تلك المرتبة أصلاً، وباعتبار شمولها وإحاطتها جميع الأسماء والصفات الإلهية المستندة إليها المظاهر كلها المعبر عنها عند أرباب المكاشفة بالأعيان الثابتة، وفي لسان الشرع باللوح المحفوظ والكتاب المبين { الرَّحْمٰنِ } المعبر بها عن الذات الأحدية باعتبار تجلياتها على صفحات الأكوان وتطوراتها في ملابس الوجودب والإمكان، وتنزيلها عن المرتبة الأحدية إلى مراتب العددية، وتعيناتها بالتشخيصات العلمية والعينية وانصباغها بالصبغ الكيانية { الرَّحِيـمِ } [الفاتحة: 1] المعبر بها عن الذات الأحدية باعتبار توحيدها بعد تكثيرها، وجمعها بعد تفريقها، وطيِّها بعد نشرها، ورفعها بعد خفضها، وتجريدها بعد تقييدها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الحمد } مبتدأ، و { الله } خبر، وأصله النصب، وقرئ به، والأصل: أحمد الله حمداً، وإنما عدل عنه إلى الرفع ليدل على عموم الحمد وثباته، دون تجدده وحدوثه، وفيه تعليم اللفظ مع تعريض الاستغناء\n أي: الحمد لله وإن لم تحمدوه\n ولو قال أحمد الله لما أفاد هذا المعنى، وهو من المصادر التي تُنْصَب بأفعال مضمرة لا تكاد تذكر معها\n والتعريف للجنس أي: للحقيقة من حيث هي، من غير قيد شيوعها، ومعناه: الإشارة إلى ما يَعْرِفه كل أحد أن الحمد ما هو\n أو للاستغراق إذ الحمد في الحقيقة كُلُّه لله إذ ما من خير إلا وهو مُولِيهِ بواسطة وبغير واسطة\n كما قال:\n\n[النّحل: 53]، وقيل: للعهد، والمعهودُ حمدُه تعالى نَفْسَه في أزله\n وقُرِئ { الحمد لله } بإتباع الدال للام، وبالعكس، تنزيلاً لهما من حيث إنهما يستعملان معاً منزلة كلمة واحدة\n ومعناه في اللغة: الثناءُ بالجميل على قصد التعظيم والتبجيل، وفي العُرف: فعل يُنبئ عن تعظيم المُنعم بسبب كونه منعماً\n والشكر في اللغة: فعل يُشعر بتعظيم المنعم، فهو مرادف للحمد العرفي، وفي العرف: صرفُ العبد جميعَ ما أنعم الله عليه من السمع والبصر إلى ما خُلِقَ لأجله وأعطاه إياه\n وانظر شرحنا الكبير للفاتحة في النَّسَبِ التي بيناها نظماً ونثراً\n و { الله } اسم مُرْتَجَلٌ جامد، والألف واللام فيه لازمة لا للتعريف، قال الواحدي: اسم تفرِّد به الباري - سبحانه - يجري في وصفه مجرى الأسماء الأعلام، لا يُعرف له اشتقاق، وقال الأقْلِيشي: إن هذا الاسم مهما لم يكن مشتقّاً كان دليلاً على عين الذات، دون أن يُنظر فيها إلى صفة من الصفات، وليس باسمٍ مشتق من صفة، كالعالِم والحق والخالق والرازق، فالألف واللام على هذا في الله من نفس الكلمة، كالزاي من زيد، وذهب إلى هذا جماعة، واختاره الغزالي، وقال: كل ما قيل في اشتقاقه فهو تعسُّف\n وقيل: مشتق من التَّأَلُّهِ وهو التعبد، وقيل: من الوَلَهَان، وهو الحيرة؟ لتحيُّر العقول في شأنه\n وقيل: أصله: الإلهُ، ثم حذفت الهمزة ونقلت حركتها إلى اللام، ثم وقع الإدغام وفُخمت للتعظيم، إلا إذا كان قبلها كسر\n و { رب } نعت { لله } ، وهو في الأصل: مصدر بمعنى التربية، وهو تبليغ الشيء إلى كماله شيئاً فشيئاً، ثم وُصف به للمبالغة كالصوم والعدل\n وقيل: هو وصفٌ من رَبِّه يَرُبُّهُ، وأصله: رَبَبَ ثم أُدغم، سُمي به المالكُ لأنه يحفظ ما يملكه ويربيه، ولا يطلق على غيره تعالى إلا بقيد كقوله تعالى:\n\n[يُوسُف: 50]\n قال ابن جُزَيّ: ومعانيه أربعة: الإله والسيد والمالك والمصلح، وكلها تصلح في رب العالمين، إلا أن الأرجح في معناه، الإله لاختصاصه بالله تعالى\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "1:3",
      "similarity": 0.6381871363768141
    },
    {
      "verse": "55:1",
      "similarity": 0.6381871363768141
    },
    {
      "verse": "3:129",
      "similarity": 0.4727163749127502
    },
    {
      "verse": "41:2",
      "similarity": 0.4567443143035663
    },
    {
      "verse": "19:93",
      "similarity": 0.4442106516551423
    }
  ]
}