{
  "chapter": "الفاتحة",
  "text": "ملك يوم الدين",
  "translations": [
    {
      "translation": "the King of the Day of Judgement.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "King of the Day of Judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Master of the Day of Recompense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Master of the Day of Judgment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Owner of the Day of Recompense\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Owner of the Day of Recompense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Master of the Day of Doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Judgment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the Day of Judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sovereign of the Day of Requital.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Only Owner (and the Only Ruling Judge) of the Day of Recompense (i.e. the Day of Resurrection)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Owner of the Day of Recompense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sovereign of the Day of Recompense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[1:4] Master of the Day of Judgement: that is, [the day of] requite, the Day of Resurrection. The reason for the specific mention [of the Day of Judgement] is that the mastery of none shall appear on that Day except that of God, may He be exalted, as is indicated by [God’s words] ‘Whose is the Kingdom today?’ ‘God’s’ [Q. 40:16] (if one reads it mālik [as opposed to malik], then this signifies that He has possession of the entire affair on the Day of Resurrection, or else that He is ever described by this [expression], in the same way as [He is described as] ‘Forgiver of sin’ (ghāfir al-dhanb). Thus, one can validly take it as an adjective of a definite noun).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإتباع الأوصاف الثلاثة المتقدمة بهذا ليس لمجرد سرد صفات من صفاته تعالى ، بل هو مما أثارته الأوصاف المتقدمة ، فإنه لما وصف تعالى بأنه رب العالمين الرحمن الرحيم وكان ذلك مفيداً لما قدمناه من التنبيه على كمال رفقه تعالى بالمربوبين في سائر أكوانهم ، ثم التنبيه بأن تصرفه تعالى في الأكوان والأطوار تصرف رحمة عند المعتبر ، وكان من جملة تلك التصرفات تصرفات الأمر والنهي المعبر عنها بالتشريع الراجع إلى حفظ مصالح الناس عامة وخاصة ، وكان معظم تلك التشريعات مشتملاً على إخراج المكلف عن داعية الهوى الذي يلائمه اتباعه وفي نزعه عنه إرغام له ومشقة ، خيف أن تكون تلك الأوصاف المتقدمة في فاتحة الكتاب مخففاً عن المكلفين عِبءَ العصيان لما أمروا به ومثيراً لأطماعهم في العفو عن استخفافهم بذلك وأن يمتلكهم الطمع فيعتمدوا على ما علموا من الربوبية والرحمة المؤكَّدة فلا يخشوا غائلة الإعراض عن التكاليف ، لذلك كان من مقتضى المقام تعقيبه بذكر أنه صاحب الحُكم في يوم الجزاء : { اليوم تجزى كل نفس بما كسبت } \\[ غافر : 17 \\] لأن الجزاء على الفعل سبب في الامتثال والاجتناب لحفظ مصالح العالم ، وأحيط ذلك بالوعد والوعيد ، وجعل مِصداقُ ذلك الجزاء يوم القيامة ، ولذلك اختير هنا وصف ملك أو مالك مضافاً إلى يوم الدين . فأما ملك فهو مؤذن بإقامة العدل وعدم الهوادة فيه لأن شأن الملك أن يدبر صلاح الرعية ويذب عنهم ، ولذلك أقام الناس الملوك عليهم . ولو قيل رب يوم الدين لكان فيه مطمع للمفسدين يجدون من شأن الرب رحمة وصفحاً ، وأما مالك فمثل تلك في إشعاره بإقامة الجزاء على أوفق كيفياته بالأفعال المجزى عليها .فإن قلت فإذا كان إجراء الأوصاف السابقة مؤذناً بأن جميع تصرفات الله تعالى فينا رحمة فقد كفى ذلك في الحث على الامتثال والانتهاء إذ المرء لا يخالف ما هو رحمة به فلا جرم أن ينساق إلى الشريعة باختياره . قلت المخاطبون مراتب : منهم من لا يهتدي لفهم ذلك إلا بعد تعقيب تلك الأوصاف بهذا الوصف ، ومنهم من يهتدي لفهم ذلك ولكنه يظن أن في فعل الملائم له رحمة به أيضاً فربما آثر الرحمة الملائمة على الرحمة المنافرة وإن كانت مفيدة له ، وربما تأول الرحمة بأنها رحمة للعموم وأنه إنما يناله منها حظ ضعيف فآثر رحمة حظه الخاص به على رحمة حظه التابع للعامة . وربما تأول أن الرحمة في تكاليف الله تعالى أمر أغلبي لا مطرد وأن وصفه تعالى بالرحمن بالنسبة لغير التشريع من تكوين ورزققٍ وإحياءٍ ، وربما ظن أن الرحمة في المآل فآثر عاجل ما يلائمه . وربما علم جميع ما تشتمل عليه التكاليف من المصالح باطراد ولكنه ملكته شهوته وغلبت عليه شقوته .فكل هؤلاء مظنة للإعراض عن التكاليف الشرعية ، ولأمثالهم جاء تعقيب الصفات الماضية بهذه الصفة تذكيراً لهم بما سيحصل من الجزاء يوم الحساب لئلا يفسد المقصود من التشريع حين تتلقفه أفهام كل متأول مضيع . ثم إن في تعقيب قوله : { رب العالمين الرحمن الرحيم } بقوله : { ملك يوم الدين } إشارة إلى أنه ولي التصرف في الدنيا والآخرة فهو إذن تتميم .وقوله ( ملك ) قرأه الجمهور بدون ألف بعد الميم وقرأه عاصم والكسائي ويعقوب وخلف ( مالك ) بالألف فالأول صفة مشبهة صارت اسماً لصاحب المُلك ( بضم الميم ) والثاني اسم فاعل من ملك إذا اتصف بالمِلك ( بكسر الميم ) وكلاهما مشتق من مَلَك ، فأصل مادة ملك في اللغة ترجع تصاريفها إلى معنى الشد والضبط كما قاله ابن عطية ، ثم يتصرف ذلك بالحقيقة والمجاز ، والتحقيق والاعتبار ، وقراءة ( ملك ) بدون ألف تدل على تمثيل الهيئة في نفوس السامعين لأن المَلِك بفتح الميم وكسر اللام هو ذو المُلك بضم الميم والمُلك أخص من المِلك ، إذ المُلك بضم الميم هو التصرف في الموجودات والاستيلاء ويختص بتدبير أمور العقلاء وسياسة جمهورهم وأفرادهم وموَاطنهم فلذالك يقال : مَلِك الناس ولا يقال : مَلك الدواب أو الدراهم ، وأما المِلك بكسر الميم فهو الاختصاص بالأشياء ومنافعها دون غيره .وقرأ الجمهور ( ملك ) بفتح الميم وكسر اللام دون ألف ورويت هذه القراءة عن النبيء صلى الله عليه وسلم وصاحبيه أبي بكر وعمر في «كتاب الترمذي» . قال ابن عطية : حكى أبو على عن بعض القراء أن أول من قرأ ( مَلِك يوم الدين ) مروان بن الحكم فرده أبو بكر بن السراج بأن الأخبار الواردة تبطل ذلك فلعل قائل ذلك أراد أنه أول من قرأ بها في بلد مخصوص . وأما قراءة ( مالك ) بألف بعد الميم بوزن اسم الفاعل فهي قراءة عاصم والكسائي ويعقوب وخلف ، ورويت عن عثمان وعلي وابن مسعود وأبي بن كعب ومعاذ بن جبل وطلحة والزبير ، ورواها الترمذي في «كتابه» أنها قرأَ بها النبيء صلى الله عليه وسلم وصاحباه أيضاً . وكلتاهما صحيحة ثابتة كما هو شأن القراءات المتواترة كما تقدم في المقدمة السادسة . وقد تصدى المفسرون والمحتجون للقراءات لبيان ما في كل من قراءة ( ملك ) بدون ألف وقراءة ( مالك ) بالألف من خصوصيات بحسب قَصْر النظر على مفهوم كلمة ملك ومفهوم كلمة ( مالك ) ، وغفلوا عن إضافة الكلمة إلى يوم الدين ، فأما والكلمة مضافة إلى يوم الدين فقد استويا في إفادة أنه المتصرف في شؤون ذلك اليوم دون شبهة مشارك . ولا محيصَ عن اعتبار التوسع في إضافة ( ملك ) أو ( مالك ) إلى ( يوم ) بتأويل شؤون يوم الدين . على أن ( مالك ) لغة في ( ملك ) ففي «القاموس» : «وكأمير وكتف وصاحب ذُو الملك» .ويوم الدين يوم القيامة ، ومبدأ الدار الآخرة ، فالدين فيه بمعنى الجزاء ، قال الفِنْد الزماني :فلما صرَّحَ الشرُّ ... فأَمسى وهْوَ عُريانُولم يَبْقَ سوى العُدوا ... ننِ دِنَّاهم كما دَانُواأي جازيناهم على صنعهم كما صنعوا مشاكلة ، أو كما جازَوْا من قبل إذا كان اعتداؤهم ناشئاً عن ثأر أيضاً ، وهذا هو المعنى المتعين هنا وإن كان للدين إطلاقات كثيرة في كلام العرب .واعلم أن وصفه تعالى بملك يوم الدين تكملة لإجراء مجامع صفات العظمة والكمال على اسمه تعالى ، فإنه بعد أن وُصف بأنه رب العالمين وذلك معْنى الإلهية الحقة إذ يفوق ما كانوا ينعتون به آلهتهم من قولهم إله بني فلان فقد كانت الأُمم تتخذ آلهة خاصة لها كما حكى الله عن بعضهم : { فقالوا هذا إلهكم وإله موسى } \\[ طه : 88 \\] وقال : { قالوا يا موسى اجعل لنا إلها كما لهم آلهة } \\[ الأعراف : 138 \\] وكانت لبعض قبائل العرب آلهة خاصة ، فقد عبدت ثقيف اللات قال الشاعر :ووقرت ثقيف إلى لاتها ... وفي حديث عائشة في «الموطأ» : «كان الأنصار قبل أن يسلموا يهلون لمَنَاةَ الطاغية التي كانوا يعبدونها عند المُشَلَّل» الحديث .فوُصِفَ اللَّهُ تعالى بأنه رب العالمين كلهم ، ثم عقب بوَصفي الرحمن الرحيم لإفادة عظم رحمته ، ثم وصف بأنه مَلِك يوم الدين وهو وَصْف بما هو أعظم مما قبله لأنه ينبىء عن عموم التصرف في المخلوقات في يوم الجزاء الذي هو أول أيام الخلود ، فمَلِك ذلك الزمان هو صاحب المُلك الذي لا يشذ شيء عن الدخول تحت مُلكه ، وهو الذي لا ينتهي ملكه ولا ينقضي ، فأين هذا الوصف من أوصاففِ المبالغة التي يفيضها الناس على أعظم الملوك مثل مَلِك الملوك ( شَاهَانْ شَاهْ ) ومَلِك الزمان ومَلِك الدنيَا ( شاهْ جَهان ) وما شابه ذلك . مع ما في تعريف ذلك اليوم بإضافته إلى الدين أي الجزاء من إدماج التنبيه على عدم حكم الله لأن إيثار لفظ الدين ( أي الجزاء ) للإشعار بأنه معاملة العَامل بما يعادِل أَعماله المَجْزِيَّ عليها في الخير والشر ، وذلك العدلُ الخاص قال تعالى : { اليوم تجزى كل نفس بما كسبت لا ظلم اليوم } \\[ غافر : 17 \\] فلذلك لم يقلْ ملك يوم الحساب فوَصفُه بأنه ملك يَوممِ العدل الصِّرف وصف له بأشرف معنى المُلك فإن الملوك تتخلد محَامدهم بمقدار تفاضلهم في إقامة العدل وقد عرف العرب المِدْحةَ بذلك . قال النابغة يمدح الملك عَمْرو بن الحارث الغساني ملك الشام :وكَم جزَانَا بأَيْدٍ غَيرِ ظالمة ... عُرْفاً بعُرف وإنكاراً بإنكارِوقال الحارث بن حلزة يمدح الملك عَمرو بن هند اللخمي ملك الحِيرة :مَلِك مُقْسِطٌ وأَفْضَلُ مَنْ يَمْ ... شِي ومن دون مَا لَدَيْه القَضَاءوإجراء هذه الأوصاف الجليلة على اسمه تعالى إيماء بأن موصوفها حقيق بالحمد الكامل الذي أعربت عنه جملة { الحمد لله } ، لأن تقييد مُفاد الكلام بأوصاف مُتَعَلَّق ذلك المفاد يُشعر بمناسبة بين تلك الأوصاف وبين مُفاد الكلام مُناسبة تفهم من المقام مثل التعليل في مقام هذه الآية .\n\n",
      "translations": [
        {
          "translation": "(Owner of the Day of Judgement) the Arbitrator on the Day of Judgement which is the Day of Reckoning and settlement of disputes between created beings, i.e. the Day when people are judged according to their deeds; there is no judge save Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَـٰلِكِ يَوْمِ ٱلدِّينِ } يومُ الحسابِ والجزاءِ\n\n\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"The King on the Day of Judgment\" - the Day of Reckoning and Retribution.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَـٰلِكِ يَوْمِ ٱلدِّينِ } [الفاتحة: 4] والجزاء المسمى في الشرع بيوم القيامة\n والطامة الكبرى المندكة فيها الأرض والسماء المطويات فيها سجلات الأولى والأخرى في الأرض\n إذ فيها ارتجت الآراء والأفكار وارتفعت الحجب والأستار\n واضمحلت أعيان السوى والأغيار\n ولم يبق إلا الله الواحد القهار\n ثم لما تحقق العبد في هذا المقام\n ووصل إلى هذا المرام\n وفوض الأمور كلها إلى الملك العلام القدوس السلام حق له أن يلازم ربه ويخاطب معه بلا ستر ولا حجاب\n تتميماً لمرتبة العبودية إلى أن يرتفع كاف الخطاب عن البين\n وينكشف الغين عن العين\n وعند ذلك قال لسان مقالة مطابقاً بلسان حاله:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { مَلِكَ } نِعت لما قبله\n قراءةُ الجماعة بغير ألف من المُلك بالضم\n وقرأ عاصم والكسائي بالألف\n من المِلك بالكسر\n والتقدير على هذا: مالك مجيء يوم الدين\n أو مالك الأمر يوم الدين\n وقراءةُ الجماعة أرجح\n لثلاثة أوجه: الأول: أن الملك أعظم من مالك\n إذ قد يوصف كل أحد بالمالك لماله\n وأما المَلِكُ فهو سيد الناس\n والثاني: قوله:\n[الأنعَام: 73]\n والثالث: أنها لا تقتضي حذفاً\n والحدف خلاف الأصل\n و { يوم الدين } ظرف مضاف إلى ما قبله على طريق الاتساع\n وأُجري الظرف مجرى المفعول به\n والمعنى على الظرفية\n أي: الملك في يوم الدين\n أو ملك الأمر يوم الدين\n فيكون فيه حذف\n وقد رُويت القراءتان - أي: القصر والمد - عن النبيّ صلى الله عليه وسلم\n وقد قرئ { ملك } بوجوه كثيرة تركنا ذكرها لشذوذها\n\nفإن قيل: ملك ومالك نكرة لأن إضافة اسم الفاعل لا تُخصص\n وكيف يُنعت به { الرحمان الرحيم } وهما معرفتان؟ قلت: إنما تكون إضافةُ اسم الفاعل لا تخصص إذا كان بمعنى الحال أو الاستقبال لأنها حينئذٍ غيرُ مَحْضَةٍ\n وأما هذا فهو مستمر دائماً\n فإضافته محضة\n قاله ابن جُزَيّ\n يقول الحقّ جلّ جلاله مُعلَّماً لعباده كيف يُثْنُونَ عليه ويعظمونه ثم يسألونه: يا عبادي قولوا { الحمد لله رب العالمين } أي: الثناء الجميل إنما يستحقه العظيم الجليل\n فلا يستحق الحمدَ سواه\n إذ لا منعم علىالحقيقة إلا الله\n\n[النّحل: 53]\n أو جميعُ المحامدِ كلُّها لله\n أو الحمدُ المعهودُ في الأذهان هو حمدُ الله تعالى نفسَه في أزله\n قبل أن يُوجِدَ خلقّه\n فلما أوجد خلقه قال لهم: الحمد لله\n أي: احْمَدُوني بذلك المعهود في الأزل\n وإنما استحق الحمد وحده لأنه { ربّ العالمين } \n وكأن سائلاً سأله: لم اختصصت بالحمد؟ فقال: لأني ربُّ العالمين\n أنا أوجدتُهم برحمتي\n وأمددتهم بنعمتي\n فلا منعم غيري\n فاستحققت الحمد وحدي\n مِنِّي كان الإيجاد وعليَّ توالي الإِمْدَاد\n فأنا ربُّ العباد\n فالعوالم كلها - على تعدد أجناسها واختلاف أنواعها - في قبضتي وتحت تربيتي ورعايتي\n قال بعضهم: خلق الله ثمانيةَ عَشرَ ألف عالَم\n نصفها في البر ونصفها في البحر\n وقال الفخرُ الرازي: رُوِيَ أن بني آدم عُشْرُ الجن\n وبنو آدم والجنُ عُشْرُ حيوانات البر\n وهؤلاء كلُّهم عشر الطيور\n وهؤلاء كلهم عشر حيوانات البحار\n وهؤلاء كلهم عشر ملائكة الأرض الموكلين ببني آدم\n وهؤلاء كلهم عشر ملائكة سماء الدنيا\n وهؤلاء كلهم عشر ملائكة السماء الثانية\n ثم على هذا الترتيب إلى ملائكة السماء السابعة\n ثم الكلُّ في مقابلة الكرسي نَزْرٌ قليل\n ثم هؤلاء عشر ملائكة السُّرَادِق الواحد من سُرادقات العرش\n التي عددُها: مائةُ ألف\n طول كل سرادق وعرضُه - إذا قُوبلتْ به السماوات والأرض وما فيهما وما بينهما - يكون شيئاً يسيراً ونَزْراً قليلاً\n وما من موضع شِبْرٍ\n إلا وفيه مَلَكٌ ساجد أو راكع أو قائم\n وله زَجَل بالتسبيح والتهليل\n ثم هؤلاء كلهم في مقابلة الذين يَجُولُون حول العرش كالقطرة في البحر\n ولا يَعلم عددّهم إلا الله تعالى:\n[المدَّثِّر: 31]\n هـ\n وقال وَهْبُ بن مُنّبِّه: قائمُ العرش ثلاثُمائةٍ وست وستون قائمة\n وبين كل قائمة وقائمة ستون ألف صحراء\n وفي كل صحراء ستون ألف عالم\n وكل عالم قَدْرُ الثقلين\n فهذه العوالم كلها في قبضة الحق وتحت تربيته وحفظه\n يوصل المدد إلى كل واحد وهو في مستقرِّه ومستودعه\n إما إلى روحانيته من قوة العلوم والمعارف\n وإما إلى بشريته من قوة الأشباح\n من العرش إلى الفرش\n كلها مقدَّرة أرزاقها محصورة آجالُها\n محفوظة أشباحُها\n معلومات أماكنها\n لا يخفى عليه شيء في الأرض ولا في السماء وهو السميع العليم\n\nثم هذه التربية التي ربى سبحانه بها خلقه إنما هي رحمة منه وإحسان\n لا لزوم عليه وإيجاب\n ولذلك وصلَه بقوله: { الرحمن الرحيم } \n أي: الرحمن بنعمة الإيجاد\n الرحيم بنعمة الإمداد\n \" نعمتان ما خلا موجود عنهما\n ولا بد لكل مُكَوَّنَ منهما: نعمة الإيجاد ونعمة الإمداد\n أنعم أولاً بالإيجاد\n وثنى بتوالي الإمداد \"\n كما في الحِكَم\n فاسمُه { الرحمن } يقتضي إيجادَ الأشياء وإبرازها\n واسمه { الرحيم } يقتضي تربيتَها وإمدادها\n ولذلك لا يجوز إطلاق اسم { الرحمان } على أحد\n ولم يَتَسَمَّ أحد به إذ الإيجاد لا يصح من غيره تعالى\n بخلاف اسمه { الرحيم } فيجوز إطلاقه على غيره تعالى لمشاركة صدور الإمداد في الظاهر من بعض المخلوقات مجازاً وعاريةً\n أو: الرحمن في الدنيا والآخرة\n والرحيم في الآخرة: لأن رحمة الآخرة خاصة بالمؤمنين\n أو الرحمن بجلائل النعم والرحيم بدقائقها\n فجلائل النعم مثل: نعمة الإسلام والإيمان والإحسان\n والمعرفة والهداية\n وكشف الحجاب وفتح الباب والدخول مع الأحباب\n ودقائقُ النعم مثل: الصحة والعافية والمال الحلال\n وغير ذلك مما يأتي ذكره في المُنْعَم عليهم\n ثم من تحقق منه الإيجادُ والإمداد استحق أن يكون ملكاً لجميع العباد\n ولذلك ذكرَهِ بِأَثَره فقال: { ملك يوم الدين } أي: المتصرف في عباده كيف شاء\n لا رادّ لما قضى ولا مانع لما أعطى\n فهو ملكُ الملوك رب الأرباب في هذه الدار وفي تلك الدار\n\n وإنما خصّ يوم الدين - وهو يوم الجزاء - بالملكية لأن ذلك اليوم يظهرُ فيه المُلْكُ لله عيَاناً لجميع الخلق\n فإن الله تعالى يتجلّى لفصل عباده\n حتى يراه المؤمنون عياناً\n بخلاف الدنيا فإن تصرفه تعالى لا يفهمه إلا الكَمَلَةُ من المؤمنين\n ولذلك ادَّعى كثير من الجهلة الملكَ ونسبوه لأنفسهم\n ويوم القيامة ينفرد الملك لله عند الخاص والعام\n قال تعالى:\n[غَافر: 16]\n الإشارة: لما تلجَّى الحق سبحانه من عالَم الجبروت إلى عالم الملكوت\n أو تقول: من عالم الغيب إلى عالم الشهادة\n حمد نفسه بنفسه\n ومجَّد نفسه بنفسه\n ووحَّد نفسه بنفسه\n ولله دَرُّ الهَرَوِيّ\n حيث قال:\nفقال في توحيد نفسه بنفسه مترجماً عن نفسه بنفسه: { الحمد لله رب العالمين } \n فكأنه يقول في عنوان كتابه وسر خطابه: أنا الحامد والمحمود\n وأنا القائم بكل موجود\n أنا رب الأرباب\n وأنا مسبب الأسباب لمن فهم الخطاب\n أنا رب العالمين\n أنا قيوم السموات والأرَضين\n بل أنا المتوحِّدُ في وجودي\n والمتجلِّي لعبادي بكرمي وجودي\n فالعوالم كلها ثابتة بإثباتي\n مَمْحُوَّةٌ بأحدية ذاتي\n قال رجل بين يدي الجنيد: { الحمد لله } ولم يقل: { رب العالمين } \n فقال له الجنيد: كَمِّلْهَا يا أخي\n فقال الرجل: وأيّ قَدْر للعالمين حتى تُذكر معه؟! فقال الجنيد: قُلها يا أخي فإن الحادث إذا قُرن بالقديم تلاشى الحادُ وبقي القديم\n\nيقول سبحانه:\n \" يا مَن هو مني قريب\n تَدبر سِرِّي فإنه غريب أنا المحبُ\n وأنا الحبيب\n وأنا القريب\n وأنا المجيب\n أنا الرحيم الرحمن\n وأنا الملك الديّان\n أنا الرحمن بنعمة الإيجاد\n والرحيمُ بتوالي الإمداد\n منِّي كان الإيجاد\n وعليَّ دوام الإمداد\n وأنا رب العباد\n أنا الملك الديَّان\n وأنا المجازي بالإحسان على الإحسان\n أنا الملك على الإطلاق\n لولا جهالة أهل العناد والشقاق\n الأمر لنا على الدوام\n لمن فهم عنا من الأنام \"\n \nقال في الرسائل الكبرى: لا عبرة بظواهر الأشياء\n وإنما العبرة بالسر المكنون\n وليس ذلك إلا بظهور أمر الحق وارتفاع غَطَائه وزوال أستاره وخفائه\n فإذا تحقق ذلك التجلّي والظهور\n واستولى على الأشياء الفناءُ والدُّثُور\n وانقشعت الظلمات بإشراق النور\n فهناك يبدو عينُ ويَحِقُّ الحق المبين\n وعند ذلك تبطل دعوى المدعين\n كما يفهم العامة بطلان ذلك في يوم الدين\n حين يكون الملك لله رب العالمين\n وليت شعري أيُّ وقت كان الملكُ لسواه حتى يقع التقييد بقوله:\n[الحَجّ: 56]\n وقوله:\n[الانفِطار: 19]؟! لولا الدعاوَى العريضة من القلوب المريضة\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "109:6",
      "similarity": 0.7336511347740973
    },
    {
      "verse": "83:11",
      "similarity": 0.7284750179004101
    },
    {
      "verse": "74:46",
      "similarity": 0.7234273427091641
    },
    {
      "verse": "56:56",
      "similarity": 0.6942018068176231
    },
    {
      "verse": "70:26",
      "similarity": 0.6713809746469906
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/001004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/001004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/1:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}