{
  "chapter": "طه",
  "text": "ولا تمدن عينيك الى ما متعنا به ازوجا منهم زهرة الحيوة الدنيا لنفتنهم فيه ورزق ربك خير وابقى",
  "translations": [
    {
      "translation": "Do not direct your eyes longingly to what We have given certain of them to enjoy, the flower of the life of this world, so that We can test them by it. Your Lord's provision is better and longer lasting.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not covet what We have granted myriads of people of the pomp and glitter of this world to tempt them. The means your Lord has given you are better far and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not turn your eyes covetously towards the embellishments of worldly life that We have bestowed upon various kinds of people to test them. But the clean provision bestowed upon you by your Lord is better and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be envious of what We have given to some people as means of enjoyment and worldly delight. Such means are a trial for them, but the reward that you will receive from your Lord will be far better and everlasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O listener, do not extend your eyes towards what We have given to disbelieving couples to enjoy – the bloom of the worldly life – so that We may test them with it; and the sustenance of your Lord is the best, and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strain not your eyes in longing for the things We have given for enjoyment to various groups of them, the splendor of the life of this world, that We may test them thereby. But the provision of your Lord is better and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not stretch your eyes after that with which We have provided different classes of them, (of) the splendor of this world's life, that We may thereby try them; and the sustenance (given) by your Lord is better and more abiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stretch not thine eyes to that We have given pairs of them to enjoy - the flower of the present life, that We may try them therein and thy Lord's provision is better, and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strain not thine eyes toward that which We cause some wedded pairs among them to enjoy, the flower of the life of the world, that We may try them thereby. The provision of thy Lord is better and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not regard with envy the worldly benefits We have given some of them, for with these We seek only to test them. The provision of your Lord is better and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strain not thine eyes after that which We have given classes of them to enjoy: the splendour of the life of the World, that We might try them therein; and the provision of thy Lord is the best and most lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not extend your glance toward what We have provided certain groups of them as a glitter of the life of this world, so that We may test them thereby. The provision of your Lord is better and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor strain thine eyes in longing for the things We have given for enjoyment to parties of them, the splendour of the life of this world, through which We test them: but the provision of thy Lord is better and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strain not your eyes in longing for the things We have given for enjoyment to various groups of them (polytheists and disbelievers in the Oneness of Allah), the splendour of the life of this world that We may test them thereby. But the provision (good reward in the Hereafter) of your Lord is better and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not stretch your eyes at the flower of this life which We have given couples to enjoy, it is with this that We might try them; and the provision of yourLord is better, and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not extend your glance towards what We have given some classes of them to enjoy—the splendor of the life of this world—that We may test them thereby. Your Lord’s provision is better, and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not extend your eyes toward that by which We have given enjoyment to [some] categories of them, [its being but] the splendor of worldly life by which We test them. And the provision of your Lord is better and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:131] And do not extend your glance toward what We have given to some pairs, [certain] categories, among them to enjoy, [as] the flower of the life of this world, its adornment and delight, that We may try them thereby, [to see] if they transgress [the bounds]. And your Lord’s provision, in Paradise, is better, than what they have been given in this world, and more enduring, longer lasting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And strain not your eyes) do not look out of desire (towards that which We cause some wedded pairs) men (among them) among the people of Banu Qurayzah and Banu'l-Nadir (to enjoy) wealth, (the flower of the life of the world) the adornment of this worldly life, (that We may try them thereby) that We may try them with that adornment which We have given them. (The provision of thy Lord) Paradise (is better and more lasting) than that which they have in this worldly life.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { زَهْرَةَ ٱلْحَيَاةِ ٱلدُّنْيَا } معناهُ زينةُ الدّنيا وجمالُها\n\n\n\n\nوقوله تعالى: { لِنَفْتِنَهُمْ فِيهِ } معناه لِنبلوَهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the flower of life of the world}, means the adornment of the world and its beauty.\n\n\nAnd His saying, {We will test them in it}, means that We will put them to the test.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولا تمدنّ عينيك } في التلوينات النفسية وظهور النفس بالميل إلى الزخارف الدنيوية\n فإنها صور ابتلاء أهل الدنيا { ورزق ربّك } من الحقائق والمعارف الأخروية والأنوار الروحانية { خير وأبقى } أفضل وأدوم { وأمر أهلك } القوى الروحانية والنفسانية بصلاة الحضور والمراقبة والانقياد والمطاوعة { واصطبر } على تلك الحالة بالمجاهدة والمكاشفة { لا نسألك } لا نطلب منك { رزقاً } من الجهة السفلية كالكمالات الحسيّة والمدركات النفسية { نحن نرزقك } من الجهة العلوية المعارف الروحانية والحقائق القدسية { والعاقبة } التي تعتبر وتستأهل أن تسمى عاقبة للتجرّد عن الملابس البدنية والهيئات النفسانية { أو لم تأتهم بينة ما في الصحف الأولى } من الحقائق والحِكَم والمعارف اليقينية الثابتة في الألواح السماوية والأرواح العلوية\n والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بحيث { لاَ تَمُدَّنَّ عَيْنَيْكَ } حال كونك متحسراً متمنياً مثله { إِلَىٰ مَا مَتَّعْنَا بِهِ } المنافقين المشركين { أَزْوَاجاً } أصنافاً من كل شيء\n لأن من أعطينا { مِّنْهُمْ زَهْرَةَ ٱلْحَيَاةِ ٱلدُّنْيَا } أي: زينتها وزخرفتها { لِنَفْتِنَهُمْ فِيهِ } نجربهم\n ونخبترهم كيف يعيشون بوجودها في الدنيا\n هل يتكبرون ويفتخرون بسببها على الفقراء ويمشون على وجه الأرض خيلاء أم لا؟\n\n\n{ وَ } إذا نبهناك عن متاع الدنيا استرزق منا عما في خزائننا من المكاشفات والمشاهدات بدل تلك اللذات الفانية\n إذ { رِزْقُ رَبِّكَ } الذي رزقك بها\n ليكون لك الكشف والشهود والتمكن في المقام المحمود { خَيْرٌ } لك من مزخرفات الدنيا ومموهاتها لأنها فانيةُ زائلةُ لا ثبات لها { وَ } هو { أَبْقَىٰ } [طه: 131] لك لبقائه مع استعدادك إلى ما شاء اللهز\n\n{ وَ } إذ رزقت ما رزقت تفضلاً من ربك\n فعليك أن تأمر من يلازمك ويؤانسك من أهل الطلب بالميل إلى ما رزقك الله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { زهرة }: مفعول بمحذوف\n يدل عليه { مَتَّعْنَا } أي: أعطينا\n أو على الذم\n وفيه لغتان: سكون الهاء وفتحها\n يقول الحقّ جلّ جلاله لنبيه صلى الله عليه وسلم: { ولا تمدنَّ عينيك } أي لا تطل نظرهما\n بطريق الرغبة والميل { إلى ما متّعنا به } من زخارف الدنيا { أزواجًا منهم } أي: أصنافًا من الكفرة\n والمعنى: لا تنظر إلى ما أعطيناه أصناف الكفرة من زخارف الدنيا الغرارة\n ولا تستحسن ذلك\n فإنه فانٍ\n وهو من { زهرة الحياة الدنيا } أي بهجتها\n ثم يفنى ويبيد\n كشأن الزهر\n فإنه فائق المنظر\n سريع الذبول والذهاب\n متعناهم بذلك\n وأعطيناهم الأموال والعز في الدنيا { لنفتنهم فيه } أي: لنعاملهم معاملة من يبتليهم ويختبرهم\n هل يقومون بشكره فيؤمنوا بك\n ويصرفوه في الجهاد معك\n وينفقوه على من آمن معك… أم لا؟ أو لنعذبهم في الآخرة بسببه\n فلا تهتم بذلك\n { ورزقُ ربك } أي: ما ادخر لك في الآخرة { خيرٌ } \n أو: ورزقك في الدنيا من الكفاف مع الهُدى\n خير مما منحهم في الدنيا\n لأنه مأمون الغائلة بخلاف ما منحوه\n فعاقبته الحساب والعقاب\n { وأبقى } فإنه لا ينقطع نفْسُه أو أثره\n بخلاف زهرة الدنيا\n فإنها فانية منقطعة\n فالواجب: الاشتغال بما يدوم ثوابه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:36",
      "similarity": 0.1313102796867187
    },
    {
      "verse": "28:60",
      "similarity": 0.1276791006155346
    },
    {
      "verse": "15:88",
      "similarity": 0.11309301508444178
    },
    {
      "verse": "11:86",
      "similarity": 0.08659405237070389
    },
    {
      "verse": "87:17",
      "similarity": 0.0864343941958364
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/20:131.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/20:131.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:131.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}