{
  "chapter": "طه",
  "text": "طه",
  "translations": [
    {
      "translation": "Ta Ha.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "TA HA.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta' Ha'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta-Ha.* (O dear Prophet Mohammed – peace and blessings be upon him) (Alphabets of the Arabic language – Allah and to whomever He reveals know their precise meanings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta. Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta. Ha. *Chapter: 20\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta-Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta-Ha. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings.]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "TaHa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta, Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta, Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:1] Tā hā: God knows best what He means by these [letters].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said upon the explanation of Allah's saying: (Ta. Ha. We have not revealed unto thee (Muhammad) this Qur'an that thou shouldst be distressed) We have not revealed the Qur'an to you that you should toil. This verse was revealed when the Prophet (pbuh) used to stand in prayer at night vigil until his feet swelled up, and so Allah alleviated this for him through this verse. He said: Taha, which in the dialect of Mecca means: man, i.e. Muhammad, We have not sent Gabriel with the Qur'an for you to toil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قال حدّثنا علي بن أحمد، قال حدّثنا عطاء بن السائب عن أبي خالد عن الإِمام زيد بن علي عليهما السَّلامُ في قوله تعالى: { طه } يا رجل بالسُّريانيةِ\n وقال: لو كان اسماً لَمْ يَكنْ سَاكناً، ولكنَّهُ فَاتحةُ السُّورةِ وعَلامةٌ لَها\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us that Ali ibn Ahmad told us that Ata' ibn al-Sa'ib told us that Abu Khalid told us that Imam Zayd ibn Ali said regarding the verse {Ta ha}, \"O man of Syrian origin.\"\n\n\nAnd he said: \"If it were a name, it would not be a stationary one, but it is the opening of the Surah and a sign for it.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ طه } الطاء إشارة إلى الطاهر، والهاء إلى الهادي\n وذلك أن النبي صلى الله عليه وسلم من شدّة حنوه وتعطفه على قومه لكونه صورة الرحمة ومظهر المحبة، تأسّف من عدم تأثير التنزيل في إيمانهم واستشعر البقية كما ذكر في قوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ طه } [طه: 1] طالب الهدياة العامة على كافرة البرايا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: عن ابن عباس أن \" طه \" من أسماء الله تعالى، وقيل: معناه: طوبى لمن هدى، وقيل: يا طاهر يا هادي، فالطاء تشير إلى طهارته صلى الله عليه وسلم وتطهيره من دنس الحس، والهاء تشير إلى هدايته في نفسه، وهدايته غيره إلى حضرة القدس\n ورُوِيَ عنه صلى الله عليه وسلم أنه قال:\n\n \" لي عشرة أسماء\n\n\n \" \n\nفذكر أن منها \" طه ويس \" ، وقيل: معناه: طِئ الأرض بقدمك لأنه كان يرفع رِجْلاً في الصلاة ويضع أخرى في طول تهجده، فأبدل الهمزة ألفًا، والضمير للأرض، ورُد بأنه لو كان كذلك لكُتبت بالألف، فإنَّ الكتابة بصورة الحرف مع التلفظ بخلافه من خصائص حروف المعجم\n وقيل: معناه: يا رجل\n وهو مروي عن ابن عباس والحسن ومجاهد وغيرهم، وهو عندهم على اللغة النبطية، أو السريانية\n قيل: من جعل معنى \" طه \" يا رجل، لم يقل على طه، وكذا من جعله اسمًا للنبي صلى الله عليه وسلم لأن النداء تنبيه على ما بعده، ومن جعلها افتتاحًا، أو على وجه من الوجوه المذكورة في البقرة، وقف عليها، إلا في قول من جعلها قَسَمًا، فإنه لا يقف عليها لأن قوله: { ما أنزلنا\n\n\n } الخ جواب قسم",
      "translations": []
    }
  ],
  "most_similar_verses": []
}