{
  "chapter": "طه",
  "text": "ولولا كلمة سبقت من ربك لكان لزاما واجل مسمى",
  "translations": [
    {
      "translation": "And were it not for a prior word from your Lord, and a specified term, it would inevitably have already taken place.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the decree (of respite) had not been pronounced by your Lord, (the inevitable judgement would have ensued); but a term is fixed (for everything).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for a word already gone from your Lord, the decree (of their destruction) would have come to pass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had not the word of your Lord been decreed (otherwise), the unbelievers deserved immediate punishment. The appointed time for their punishment will inevitably come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had not a command of your Lord been passed, then the punishment would have gripped them – and had a term not been appointed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had it not been for a Word that went forth before from your Lord, and a term determined, (their punishment) must necessarily have come (in this world).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had there not been a word (that had) already gone forth from your Lord and an appointed term, it would surely have been made to cleave (to them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And but for a word that preceded from thy Lord, and a stated term, it had been fastened.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And but for a decree that had already gone forth from thy Lord, and a term already fixed, the judgment would have been inevitable (in this world).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for a pre-ordained Word from your Lord, and a term [of respite] already fixed, immediate punishment would inevitably have taken place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had not a word from thy Lord gone forth, and a term determined, it must necessarily have come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for a prior decree of your Lord and a specified time, [their doom] would have attended [their guilt].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for a Word that went forth before from thy Lord, (their punishment) must necessarily have come; but there is a Term appointed (for respite).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had it not been for a Word that went forth before from your Lord, and a term determined, (their punishment) must necessarily have come (in this world).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for a Word that preceded from your Lord, and a stated term, it had been fastened.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for a word that issued from your Lord, the inevitable would have happened, but there is an appointed term.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if not for a word that preceded from your Lord, punishment would have been an obligation [due immediately], and [if not for] a specified term [decreed].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:129] And but for a decree that had already preceded from your Lord, that their chastisement be deferred to the Hereafter, it, destruction, would have been an inevitability, [their destruction] would have been necessary in this world, and a specified term, fixed for them (ajalun musamman, a supplement to the pronoun concealed in kāna, ‘it would have been’, the separation [of both subjects] by the predicate of both serves as an   emphasis).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And but for a decree that had already gone forth from thy Lord) that their punishment shall be postponed, (and a term already fixed) for this nation, (the judgement would (have) been inevitable (in this world)) their punishment would have been inevitable.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَكَانَ لِزَاماً } معناه فِعلٌ يَلزمُ كُلَّ إنسانٍ عملَهُ من خيرٍ أو شَرٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْلاَ كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ } يا أكمل الرسل في حق أمتك بدعائك لهم، وهو ارتفاع العذاب عنهم في دار الدنيا من المسخ والكسف، وغير ذلك من أهلكنا به الأمم الماضية { لَكَانَ } عذاب المنافقين اليوم { لِزَاماً } أي: لزاماً حتماً لازماً مبرماً لظهر أسبابه منهم { وَ } لكن قُدِّر له { أَجَلٌ مُّسَمًّى } [طه: 129] وهو يوم الجزاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وجملة { يمشون }: حال من القرون، أي: أهلكناهم وهم في حال أمن وتقلب في ديارهم، أو من الضمير في \" لهم \" ، مؤكد للإنكار، والعامل: \" يهد \" ، والمعنى: أفلم يهد لهم إهلاكنا للقرون السالفة، كقوم نوح ولوط وأصحاب الأيكة، حال كونهم، أي: قريش - ماشين في مساكنهم إذا سافروا إلى الشام -، و { أجل مسمى }: عطف على { كلمة } ، أو استئناف، أي: وأجل مسمى حاصل لهم\n  يقول الحقّ جلّ جلاله: { أفَلَمْ يَهْدِ لهم } أي: أو لم يُبين لهم عاقبة أمرهم { كم أهلكنا قبلَهم من القرون } أي: كثرة إهلاكنا للقرون السالفة قبلهم، وهم { يمشون في مساكنهم } إذا سافروا إلى الشام، كأصحاب الحجر، وثمود، وفرعون، وقوم لوط، مشاهدين لآثار ديارهم خاربة، مع علمهم بما جرى عليهم، بسبب تكذيبهم، فإنَّ ذلك مما يُوجب أن يهتدوا إلى الحق، فيعتبروا، لئلا يحل بهم مثل ما حلّ بأولئك، أو: { أفلم يهد لهم } كثرة إهلاكنا للقرون السالفة قبلهم، حال كونهم آمنين، { يمشون } في ديارهم ويتقلبون في رباعهم\n\n[الأعراف: 78]\n { إِنّ في ذلك } الإهلاك الفظيع { لآياتٍ } كثيرة عظيمة واضحة الهداية، دالة على الحق { لأُولي النُّهى } لذوي العقول الناهية عن القبائح، التي من أقبحها ما يتعاطاه كفار مكة من الكفر بآيات الله، والتعامي عنها، وغير ذلك من فنون المعاصي\n { ولولا كلمةٌ سبقتْ من ربك } ، وهو تأخير العذاب عن هذه الأمة إلى الآخرة لحكمة، لعجلنا لهم الهلاك كما عجلنا لتلك القرون المهلكة، التي يمرون عليها ولا يعتبرون، فأصروا على الكفر والعصيان، فلولا تلك العِدّة بتأخير العذاب { لكان لزامًا } أي: لكان عقاب جناياتهم لازمًا لهؤلاء الكفرة، بحيث لا يتأخرون عن جناياتهم ساعة، لزوم ما أنزل بأولئك الغابرين، وفي التعرض لعنوان الربوبية، مع الإضافة إلى ضميره - عليه الصلاة والسلام - تلويح بأن ذلك التأخير تشريف له صلى الله عليه وسلم، كما ينبئ عنه قوله تعالى:\n\n[الأنفال: 33]\n واللزام: مصدر لازم، وصف به للمبالغة، { وأجَلٌ مسمىً } أي: لولا كلمة سبقت بتأخيرهم، وأجل مسمى لأعمارهم أو عذابهم، وهو يوم القيامة، أو يوم بَدْرٍ، لَمَا تأخر عذابهم أصلاً\n\n\nوإنما فصله عما عطف عليه، للمسارعة إلى بيان جواب \" لولا \" ، وللإشعار باستقلال كل منهما بنفي لزوم العذاب المعجل، ومراعاة فواصل الآية الكريمة",
      "translations": []
    }
  ]
}