{
  "chapter": "طه",
  "text": "افلم يهد لهم كم اهلكنا قبلهم من القرون يمشون فى مسكنهم ان فى ذلك لءايت لاو۟لى النهى",
  "translations": [
    {
      "translation": "Are they not guided by the many generations We have destroyed before them, among whose dwelling places they walk about? There are Signs in that for people of sound intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not learn from the many generations that We destroyed before them, whose habitations they now frequent? Verily there are signs in this for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not find any guidance in the fact that We destroyed many nations in whose ruined dwelling-places they now walk about? Surely there are many Signs in them for people endowed with wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a warning for them to see how many generations living before them We destroyed and how they are now walking in their ruins? In this there is the evidence (of the Truth) for the people of reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So did they not gain guidance from (knowing) how many generations We have destroyed before them, among whose dwellings they walk? Indeed in it are signs for men of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a guidance for them (to know) how many generations We have destroyed before them, in whose dwellings they walk Verily, in this are signs indeed for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it not then direct them aright how many of the generations In whose dwelling-places they go about We destroyed before them? Most surely there are signs in this for those endowed with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a guidance to them, how many generations We destroyed before them in whose dwelling-places they walk? Surely in that are signs for men possessing reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a guidance for them (to know) how many a generation We destroyed before them, amid whose dwellings they walk? Lo! therein verily are signs for men of thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not learn a lesson from Our destruction of many generations before them in whose dwelling-places they walk about? Surely in this are signs for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath it not served as guidance to them how many a generation We have destroyed before them, amidst whose dwellings they Walk! Verily therein are signs for men of sagacity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it not dawn upon them how many generations We have destroyed before them, amid [the ruins of] whose dwellings they walk? There are indeed signs in this for those who have reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a warning to such men (to call to mind) how many generations before them We destroyed, in whose haunts they (now) move? Verily, in this are Signs for men endued with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a guidance for them (to know) how many generations We have destroyed before them, in whose dwellings they walk? Verily, in this are signs indeed for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a guidance to them, how many generations We destroyed before them in whose dwelling places they walk? Surely, in this there are signs for thoseof reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not instructive to them, how many generations before them We destroyed, in whose settlements they walk? Surely in that are signs for people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, has it not become clear to them how many generations We destroyed before them as they walk among their dwellings? Indeed in that are signs for those of intelligence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:128] Is it not a guidance, has it not become clear, to them, to the disbelievers of Mecca, how many (kam, is predicative and the object of [the following] ahlaknā) We destroyed, in other words, Our frequent destruction, before them of generations, that is, of past communities, for denying messengers, amid [the ruins of] whose dwelling-places they walk? (yamshūna is a circumstantial qualifier referring to the person of the pronoun lahum, ‘to them’) during their journeys to Syria and other places, that they might thus be admonished? (what has been mentioned [by grammarians] regarding the derivation of [the verb] ihlāk to be that verb that does not contain a particle referring to [the object of] the action of the verb, as a way of preserving the [original] sense [of the statement], is acceptable). Surely in that there are signs, lessons, for people of sense, for possessors of intellect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is it not a guidance for them (to know)) has it not been explained to the people of Mecca (how many a generation) past generations (We destroyed before them, amid whose dwellings they walk? Lo! Therein) in that which We did to them (verily are signs for men of thought) for men possessed of sound intellects.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَفَلَمْ يَهْدِ لَهُمْ } معناه يُبيّنُ لَهم، ويُوضحُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Has He not guided them} means He has explained to them and made it clear.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولم يذكر عذابنا لمنكري آياتنا { فَلَمْ يَهْدِ لَهُمْ } ولم يرشدهم لم يذكّرهم إهلاكنا الأمم السالفة بسبب إنكار الآيات وتكذيب الرسل\n إذ { كَمْ أَهْلَكْنَا قَبْلَهُمْ مِّنَ ٱلْقُرُونِ } أي: أهلكنا كثيراً من أهل القرون الماضية حين { يَمْشُونَ فِي مَسَاكِنِهِمْ } أمثالهم أصحاء سالمين فجاءهم بأسنا بياتا أ\n نهارا\n فجعلناهم هالكين فانين\n كأن لم يكونوا موجودين أصلاً لإعراضهم عنَّا وتكذيبهم آياتنا ورسلنا { إِنَّ فِي ذَلِكَ } الإهلاك { لآيَاتٍ } دلائلَ ظاهرةٍ على قدرتنا على الانتقام على المعرضين المكذِّبين لكتبنا ورسلنا\n لكن لا تحصل تلك الدلائل إلا { لأُوْلِي ٱلنُّهَىٰ } [طه: 128] أصحاب العقول المنتهية مقتضى عقولهم إلى الشهود\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أفلم } الهمزة للإنكار التوبيخي\n والفاء للعطف على محذوف\n أي: أغْفَلوا فلم يهد لهم\n وعدى الهداية باللام لتضمنها معنى التبيين\n والفاعل مضمونُ { كم أهلكنا } \n أي: أفلم يُبين لهم مآل أمرهم كثرة إهلاكنا للقرون الأولى؟ وقيل: الفاعل ضمير عائد إلى الله\n و { كم… } الخ: مُعلق للفعل سد مسد مفعوله\n أي: أفلم يُبين الله لهم كثرة إهلاك القرون من قبلهم؟ والأوجه: أنْ لا يُلاحظ له مفعول\n كأنه قيل: أفلم يفعل الله لهم الهداية\n ثم قيل بطريق الالتفات: كم أهلكنا… الخ بيانًا لتلك الهداية\n و { مِنَ القُرون }: في محل نصب\n نعت لمفعول محذوف\n أي: قرنًا كائنًا من القرون\n وجملة { يمشون }: حال من القرون\n أي: أهلكناهم وهم في حال أمن وتقلب في ديارهم\n أو من الضمير في \" لهم \" \n مؤكد للإنكار\n والعامل: \" يهد \" \n والمعنى: أفلم يهد لهم إهلاكنا للقرون السالفة\n كقوم نوح ولوط وأصحاب الأيكة\n حال كونهم\n أي: قريش - ماشين في مساكنهم إذا سافروا إلى الشام -",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:26",
      "similarity": 0.9155787541673291
    },
    {
      "verse": "36:31",
      "similarity": 0.6386180498994466
    },
    {
      "verse": "17:17",
      "similarity": 0.45277937169917704
    },
    {
      "verse": "43:6",
      "similarity": 0.3657402492260915
    },
    {
      "verse": "10:13",
      "similarity": 0.3318678767087115
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/20:128.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/20:128.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/20:128.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}