{
  "chapter": "طه",
  "text": "فاكلا منها فبدت لهما سوءتهما وطفقا يخصفان عليهما من ورق الجنة وعصى ءادم ربه فغوى",
  "translations": [
    {
      "translation": "So the two of them ate from it and their private parts were disclosed to them and they started stitching together the leaves of the Garden to cover themselves. Adam disobeyed his Lord and became misled.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And both ate of (its fruit), and their hidden parts were exposed to one another, and they patched the leaves of the garden (to hide them). Adam disobeyed his Lord, and went astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the two of them ate the fruit of that tree and their shameful parts became revealed to each other, and they began to cover themselves with the leaves from the Garden. Thus Adam disobeyed his Lord and strayed into error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Adam and his wife ate (fruits) from the tree and found themselves naked. Then they started to cover themselves with the leaves from the garden. Adam disobeyed his Lord and went astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they both ate from it – thereupon their shame became manifest to them, and they started applying on themselves the leaves of heaven; and Adam lapsed in obeying his Lord, so did not reach his goal. (Of achieving immortality)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they both ate of the Tree, and so their private parts became manifest to them, and they began to cover themselves with the leaves of the Paradise for their covering. Thus Adam disobeyd his Lord, so he went astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they both ate of it, so their evil inclinations became manifest to them, and they both began to cover themselves with leaves of the garden, and Adam disobeyed his Lord, so his life became evil (to him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the two of them ate of it, and their shameful parts revealed to them, and they took to stitching upon themselves leaves of the Garden. And Adam disobeyed his Lord, and so he erred.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they twain ate thereof, so that their shame became apparent unto them, and they began to hide by heaping on themselves some of the leaves of the Garden. And Adam disobeyed his Lord, so went astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They both ate the fruit of this tree, and so they became conscious of their nakedness and began to cover themselves with the leaves of the Garden. Thus Adam disobeyed his Lord and fell into error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the twain ate thereof; so there became disclosed to them their shame, and they began sewing upon them selves some of the leaves of the Garden, so Adam disobeyed his Lord, and erred,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they both ate of it, and their nakedness became evident to them, and they began to stitch over themselves with the leaves of paradise. Adam disobeyed his Lord, and went amiss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the result, they both ate of the tree, and so their nakedness appeared to them: they began to sew together, for their covering, leaves from the Garden: thus did Adam disobey his Lord, and allow himself to be seduced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they both ate of the tree, and so their private parts appeared to them, and they began to stick on themselves the leaves from Paradise for their covering. Thus did Adam disobey his Lord, so he went astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They both ate of it, and their shameful parts appeared to them, whereupon they began to stitch upon themselves leaves from the Garden. And so it was, Adam erred and disobeyed his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so they ate from it; whereupon their bodies became visible to them, and they started covering themselves with the leaves of the Garden. Thus Adam disobeyed his Lord, and fell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Adam and his wife ate of it, and their private parts became apparent to them, and they began to fasten over themselves from the leaves of Paradise. And Adam disobeyed his Lord and erred.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:121] So both of them, Adam and Eve, ate of it, and their shameful parts were exposed to them, that is, the front [private part] of each became visible to the other, as well as the other’s behind — both of these [parts] are called saw’a, ‘shame’, because its exposure ‘shames’ (yasū’u) that person); and they began to piece together, they took to sticking, onto themselves leaves of the Garden, to cover themselves up therewith. And Adam disobeyed his Lord and so he erred, by [his] eating from the tree.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then they twain ate thereof) Adam and Eve ate from the tree, (so that their shame became apparent unto them) so that their nakedness appeared to them, (and they began) intentionally (to hide by heaping on themselves) by covering their nakedness with (some of the leaves of the Garden) some of the leaves of fig trees; whenever they put some on them, they fell off. (And Adam disobeyed his Lord) by eating from the tree, (so went astray) he left the way of guidance, and did not get what he wanted when he ate from the tree.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذ وسوس إليهما سمعا قوله وقيلا وسوسته فنسيا عهد ربهما { فَأَكَلاَ مِنْهَا } حتى شيعا وأراد أن يتبرزا ويتغوطا\n ثم لما اتكبا المنهي\n وظهر منهما ما هو منافٍ لطهارة الجنة ونظافتها\n أمر سبحانه بإخراجهما منها\n فنزع أولاً عنهما لباسهما\n أي: لباس الطهارة والنجاة الفطرية والتقوى الجبلية { فَبَدَتْ } ظهرت بعد نزع اللباس { لَهُمَا سَوْءَاتُهُمَا }  عوراتهما\n فاضطروا على التستر والتغطي { وَطَفِقَا } أي: شرعا { يَخْصِفَانِ } ويلزقان { عَلَيْهِمَا } أي: على عورتهما { مِن وَرَقِ ٱلْجَنَّةِ } أي: من أوراق بعض أشجارها\n قيل: هي ورق التين\n\n{ وَ } إذا كان حالهما كذلك قالت الملائكة: { عَصَىٰ ءَادَمُ } المكرَم المسجود له { رَبَّهُ } الذي رباه بتناول ما يصلحه منها عن تناول ما يضره\n بأن أعرض عن النهي\n وبادر إلى ارتكاب المنهي بغرور الشيطان المغوي المضل { فَغَوَىٰ } [طه: 121] بإغوائه\n وضل عن مراده الأصلي بتغرير العدو\n لأن العدو إنما يلقى عدوه عكس مطلوبه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وطفِقَا يَخْصِفَان } يَرْقََعانِ { عليهما من ورقِ الجنة } \n وقد تقدم في الأعراف\n الإشارة: ولقد عهدنا إلى آدم ألا ينسانا\n وألا يغيب عن شهودنا بمُتْعَةِ جنتنا\n فنسي شهودنا\n ومال إلى زخارف جنتنا\n فأنزلناه إلى أرض العبودية\n حتى يتطهر من البقايا\n وتكمل فيه المزايا\n فحينئذ نُسكنه في جوارنا\n ونكشف له عن حضرة جمالنا\n على سبيل الخلود في دارنا\n قال جعفر الصادق: عهدنا إلى آدم ألا ينسانا\n فنسي واشتغل بالجنة\n فابتلى بارتكاب النهي\n وذلك أنه ألهاه النعيم عن المنعم\n فوقع من النعمة في البلية\n فأُخرج من النعيم والجنة ليعلم أن النعيم هو مجاورة المنعم\n لا الالتذاذ بالأكل والشرب\n فلا ينبغي لأحد أن ينظر إلى ما سواه\n نسأل الله تعالى أن يمدنا وإياك بالتوفيق والعناية\n هـ\n قال بعض الحكماء: إنما نسي آدم العهد لأنه لما خلقت له زوجته أوقع الله في قلبه الأنس بها\n وابتلاه بشهوات النفس فيها\n فرأى في وجهها شجرة الحسن بادية\n وشهوة الوقاع عليه غالبة\n\nهـ\n أي: فترك النظر إلى جمال المعاني\n واشتغل بحس الأواني\n فأفضى به إلى ترك الأدب\n ولزمه التعب\n فليحذر المريد جهده من الميل إلى الحظوظ\n وليكن على حذر من الغفلة حين تناولها\n والعصمةُ من الله\n وقوله تعالى: { ولم نجد له عزمًا } \n قال الحاتمي: أي: على انتهاك الحرمة\n بل وقع بمطالعة قدَر سابق\n أنساه ما توجه على التركيب من خطاب الحِجْر\n هـ\n قال شيخ شيوخنا سيدي عبد الرحمن الفاسي: وبما أشار إليه من مطالعة القدر يتضح لك قوله عليه السلام:\n \" فحج آدمُ موسى \" \n\n وليس ذلك لغيره إن لم يكن مجبورًا ومأخوذًا عنه\n وهذا القدر هو الفارق بين ما يجري من المخالفة على الولي وغيره\n وقد نبه على ذلك الجنيد بقوله: { وكان أمر الله قدرًا مقدورًا } \n فأشار لغلبة القدر وقهره\n من غير وجود عزم من العبد\n هـ\n قلت: احتجاج آدم وموسى - عليهما السلام - لم يكن في عالم الأشباح\n الذي هو محل التشريع\n إنما كان في عالم الأرواح\n الذي هو محل التحقيق\n فالنظر في ذلك العالم الروحاني\n إنما هو لسر الحقيقة\n وهو ألا نسبة لأحد في فعل ولا ترك\n فمن احتج بهذا غَلب\n بخلاف عالم الأشباح\n لا يصح الاحتجاج بالقدر لأن فيه خرق رداء الشريعة\n فتأمله\n وقال في التنوير: اعلم أن أكل آدم من الشجرة لم يكن عنادًا ولا خلافًا\n فإما أن يكون نسي الأمر\n فتعاطى الأكل وهو غير ذاكر\n وهو قول بعضهم\n ونحمل عليه قوله سبحانه: { فَنَسِيَ } \n وإن كان تناوله\n ذاكرًا للأمر\n فهو إنما تناول لأنه قيل له:\n[الأعرَاف: 20] الآية\n فلحبه في الله\n وشغفه به\n أحب ما يؤديه إلى الخلود في جواره والبقاء عنده\n أو ما يؤديه إلى الملَكِية لأن آدم عليه السلام عاين قُرب الملائكة من الله\n فأحب أن يأكل من الشجرة ليتناول الملَكِية\n التي هي في ظنه أفضل\n لا سيما وقد قال سبحانه:\n[الأعرَاف: 21]\n قال آدم عليه السلام: ما ظننتُ أن أحدًا يحلف بالله كاذبًا\n فكان كما قال الله سبحانه: { فدلاهما بغرور }\n هـ\n وسُئل ابن عطاء عن قوله تعالى: { هل أدلك على شجرة الخلد }؟ فقال: قال آدم عليه السلام: يا رب لِمَ أدَّبتني\n وإنما أكلتُ من الشجرة طمعًا في الخلود في جوارك؟ فقال الله: يا آدم طلبتَ الخلود من الشجرة لا مني\n والخلود بيدي وملكي\n فأشركْتَ بي\n وأنت لا تعلم\n ولكن نبهتك بالخروج من الجنة حتى لا تنساني في وقت من الأوقات\n هـ\n والحاصل: أنه إمَّا أن يُحمل النسيان على حقيقته\n ويكون معه وقوع الأكل بمطالعة القدر وقبضة الجبر\n ولا يُعارضه: { ما نهاكما عن هذه الشجرة } لأنه اتفق ذلك صورة وظاهرًا\n مع شهود الجبر باطنًا\n وإمّا أن يُحمل النسيان على الترك\n بتأويل أن النهي ليس على التحتم\n فتركه لما أمل من جوار الحق وقربه في الأكل\n فقدمه لأنه أرجح عنده\n\nقاله المحشي\n وقوله تعالى: { فوسوس إِليه الشيطان\n\n\n } الآية\n يؤخذ منه سد باب التأويلات والرخص في الأمر الممنوع شرعًا\n فإن أُبيح بعضه ومُنع البعض فلا توسعة\n فلأن تترك مباحًا خير من أن تقع في محرم\n وقد كان السلف يتركون مائة جزء من المباح\n خوفًا من الوقوع في المحرم\n والله الهادي إلى سواء الطريق\n ثم قال تعالى: {\n\n\n وَعَصَىٰ ءَادَمُ رَبَّهُ فَغَوَىٰ ثُمَّ ٱجْتَبَاهُ رَبُّهُ فَتَابَ عَلَيْهِ وَهَدَىٰ قَالَ ٱهْبِطَا مِنْهَا جَمِيعاً بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ فَإِمَّا يَأْتِيَنَّكُم مِّنِّي هُدًى فَمَنِ ٱتَّبَعَ هُدَايَ فَلاَ يَضِلُّ وَلاَ يَشْقَىٰ وَمَنْ أَعْرَضَ عَن ذِكْرِي فَإِنَّ لَهُ مَعِيشَةً ضَنكاً وَنَحْشُرُهُ يَوْمَ ٱلْقِيامَةِ أَعْمَىٰ قَالَ رَبِّ لِمَ حَشَرْتَنِيۤ أَعْمَىٰ وَقَدْ كُنتُ بَصِيراً قَالَ كَذٰلِكَ أَتَتْكَ آيَاتُنَا فَنَسِيتَهَا وَكَذٰلِكَ ٱلْيَوْمَ تُنْسَىٰ وَكَذٰلِكَ نَجْزِي مَنْ أَسْرَفَ وَلَمْ يُؤْمِن بِآيَاتِ رَبِّهِ وَلَعَذَابُ ٱلآخِرَةِ أَشَدُّ وَأَبْقَىٰ }  يقول الحقّ جلّ جلاله: { وعصى آدمُ ربَّه } بما ذكر من أكل الشجرة { فَغَوى } أي: ضل عن مطلوبه\n الذي هو الخلود\n بل ترتب عليه نقيضه\n فكان تأميل ذلك باطلاً فاسدًا لأنه خلاف القدر\n أو عن الرشد\n حيث اغتر بقول العدو\n وقال الكواشي: فعل فعلاً لم يكن له فعله\n أو أخطأ طريق الحق\n حيث طلب الخلد بأكل المنهي عنه\n فخاب ولم ينل مراده\n هـ\n وفي وصفه عليه السلام بالعصيان والغواية\n مع صغر زلته\n تعظيم لها\n وزجر بليغ لأولاده عن أمثالها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:22",
      "similarity": 0.8357434895638977
    },
    {
      "verse": "38:33",
      "similarity": 0.3564934324021777
    },
    {
      "verse": "18:19",
      "similarity": 0.2615948310243782
    },
    {
      "verse": "6:59",
      "similarity": 0.19791342324951666
    },
    {
      "verse": "2:33",
      "similarity": 0.10498720340700962
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020121.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020121.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:121.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}