{
  "chapter": "طه",
  "text": "وعنت الوجوه للحى القيوم وقد خاب من حمل ظلما",
  "translations": [
    {
      "translation": "Faces will be humbled to the Living, the All-Sustaining, and anyone weighed down with wrongdoing will have failed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All heads will be bowed before the Living, the Eternal; and whosoever bears a load of iniquity will be full of despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All faces shall be humbled before the Ever-Living, the Self-Subsisting Lord, and he who bears the burden of iniquity will have failed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Faces will be humble before the Everlasting and the Self-existing God. Despair will strike those who are loaded with the burden of injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all faces shall bow before the Living, the All Sustaining; and the one who bore the burden of injustice, has failed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (all) faces shall be humbled before the Ever Living, the Sustainer. And he who carried wrongdoing, will be indeed a complete failure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the faces shall be humbled before the Living, the Self-subsistent Allah, and he who bears iniquity is indeed a failure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And faces shall be humbled unto the Living, the Eternal. He will have failed whose burden is of evildoing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And faces humble themselves before the Living, the Eternal. And he who beareth (a burden of) wrongdoing is indeed a failure (on that day).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on that Day all faces shall be humbled before the Living, Self-Subsisting One. Those burdened with evil deeds will come to grief,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And downcast will be faces before the Living, the Self- subsisting, and disappointed will be he who beareth a wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All faces shall be humbled before the Living One, the All-sustainer, and those who bear [the burden of] wrongdoing will fail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(All) faces shall be humbled before (Him) - the Living, the Self-Subsisting, Eternal: hopeless indeed will be the man that carries iniquity (on his back).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (all) faces shall be humbled before (Allah), the Ever Living, the One Who sustains and protects all that exists. And he who carried (a burden of) wrongdoing (i.e. he who disbelieved in Allah, ascribed partners to Him, and did deeds of His disobedience), became indeed a complete failure (on that Day).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(All) faces shall be humbled before the Living One, the Eternal. Those who are burdened with wrong doing shall have failed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Faces will be humbled before the Living, the Eternal. Whoever carries injustice will despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [all] faces will be humbled before the Ever-Living, the Sustainer of existence. And he will have failed who carries injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:111] And faces shall be humbled, they shall be submissive, before the Living, the Eternal Sustainer, namely, God; and he will certainly have failed, he will have lost, [he] who carries [the burden of] evildoing, that is, [of] idolatry.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And faces humble themselves) faces are lowered in this worldly life through prostration; it is also said that this means: the faces are humbled and submitted on the Day of Judgement (before the Living) Who dies not, (the Eternal) Who has no beginning. (And he who beareth (a burden of) wrong-doing) idolatry (is indeed a failure (on that Day)) he loses on that Day.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَعَنَتِ ٱلْوُجُوهُ } معناه خَصعتْ وذَلتْ\n ومنهُ وضعُكَ وَجَهَك ويَديكَ ورُكبتيكَ وأَطرافَ قَدميكَ فِي السّجودِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And prostrate yourselves\" - its meaning is that you humble and lower yourselves.\n\nAnd from him, you put your {face}, {hands}, {feet} and {fingers} in the {sujud}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } في ذلك اليوم { عَنَتِ ٱلْوُجُوهُ } أي: هلكت وجوه الأشياء\n أي: ظهورها وبقي الوجه الذي هو { لِلْحَيِّ ٱلْقَيُّومِ } المنزه عن الظهور والبطون\n المقدس عن الحركة والسكون { وَقَدْ خَابَ } وخسر خسراناً مبيناً في ذلك اليوم { مَنْ حَمَلَ ظُلْماً } [طه: 111] شركاً بالله الواحد القهار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وقد خاب… } الخ: استئنافٌ، تعليلُ ما لأجله عنت وجوههم، أو اعتراض، كأنه قيل: خابوا وخسروا، أو حال من الوجوه، و { مَنْ }: عبارة عنها، مُغنية عن ضميرها، أي: خضعت الوجوه، والحال أنها خابت حين حملت ظلمًا\n وقيل: { الوجوه } على العموم، فالمعنى حينئذ: وقد خاب من حمل منهم ظلمًا، ومن قرأ: \" فلا يخف \": فعلى النهي، وهو جواب، ومن قرأ بالرفع: فعلى الخبر، أي: فهو لا يخاف\n يقول الحقّ جلّ جلاله: { وعَنَتِ الوجوهُ للحيّ القيّوم } أي: ذلت وخضعت خضوع العناة، أي: الأسارى في يد الملك القهار، ومنه قيل للأسير: \" عانٍ \" ، أي: خاضع ذليل، وفي ذلك يقول أمية بن أبي الصلت:\n\nولعلها وجوه المجرمين، كقوله تعالى\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:15",
      "similarity": 0.2522230938020757
    },
    {
      "verse": "20:61",
      "similarity": 0.23054523993699869
    },
    {
      "verse": "3:127",
      "similarity": 0.19274586681452924
    },
    {
      "verse": "91:10",
      "similarity": 0.16571963298474227
    },
    {
      "verse": "19:27",
      "similarity": 0.036810516820677895
    }
  ]
}