{
  "chapter": "طه",
  "text": "طه",
  "translations": [
    {
      "translation": "Ta Ha.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "TA HA.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta' Ha'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta-Ha.* (O dear Prophet Mohammed – peace and blessings be upon him) (Alphabets of the Arabic language – Allah and to whomever He reveals know their precise meanings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta. Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta. Ha. *Chapter: 20\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta Ha!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta-Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta-Ha. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings.]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "TaHa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta, Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ta, Ha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:1] Tā hā: God knows best what He means by these [letters].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said upon the explanation of Allah's saying: (Ta. Ha. We have not revealed unto thee (Muhammad) this Qur'an that thou shouldst be distressed) We have not revealed the Qur'an to you that you should toil. This verse was revealed when the Prophet (pbuh) used to stand in prayer at night vigil until his feet swelled up, and so Allah alleviated this for him through this verse. He said: Taha, which in the dialect of Mecca means: man, i.e. Muhammad, We have not sent Gabriel with the Qur'an for you to toil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قال حدّثنا علي بن أحمد، قال حدّثنا عطاء بن السائب عن أبي خالد عن الإِمام زيد بن علي عليهما السَّلامُ في قوله تعالى: { طه } يا رجل بالسُّريانيةِ\n وقال: لو كان اسماً لَمْ يَكنْ سَاكناً، ولكنَّهُ فَاتحةُ السُّورةِ وعَلامةٌ لَها\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us that Ali ibn Ahmad told us that Ata' ibn al-Sa'ib told us that Abu Khalid told us that Imam Zayd ibn Ali said regarding the verse {Ta ha}, \"O man of Syrian origin.\"\n\n\nAnd he said: \"If it were a name, it would not be a stationary one, but it is the opening of the Surah and a sign for it.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ طه } الطاء إشارة إلى الطاهر\n والهاء إلى الهادي\n وذلك أن النبي صلى الله عليه وسلم من شدّة حنوه وتعطفه على قومه لكونه صورة الرحمة ومظهر المحبة\n تأسّف من عدم تأثير التنزيل في إيمانهم واستشعر البقية كما ذكر في قوله:\n[الكهف\n الآية:6]\n وزاد في الرياضة فكان يحيي الليالي بالتهجد وبالغ في القيام حتى تورّمت قدماه فأخبر أن عدم إيمانهم ليس من جهتك بل من جهتهم وغلظ حجابهم أعدم استعدادهم لا لبقاء صفات نفسك أو بقية أنائيتك أو وجود نقصك وقصورك في الهداية كما استشعرت فلا تتعب نفسك\n ونودي باسمين من أسماء الله تعالى دالين على نزاهته عن الأمرين المذكورين وجود البقية أو القصور عن الهداية فقيل: يا طاهر عن لوث البقية\n يا هادي { ما أنزلنا عليك القرآن لتشقى } وتتعب بالرياضة لكن لتذكير من يلين قلبه ويستعدّ لقبوله بعد صفائك وطهارتك وقد حصل الأمران بحمد الله وكنت كاملاً مكملاً\n وما المقصود بالرياضة إلا هذان الأمران اللذان ظهرا فيك تجلينا عليك بالاسمين المذكورين فلم تتعب نفسك وإنما لم يحصل الاهتداء بهدايتك لقسوة القلوب التي هي ضدّ الخشية واللين الذي هو شرط في حصوله لا لقصورك\n ويجوز أن يكون قسماً لا نداء\n أي: أقسم بالاسمين اللذين يربه بهما ويتجلى بهما له لإفادة التزكية والتخلية إذ المقصود بالإنزال حصول أثرهما فيك لا التعب والمشقة وقد حصل فلا تفرط في الرياضة\n ولهذا المعنى سمي آل محمداً: آل طه\n أي بحصول المعنيين لهم وظهور مسمى الاسمين فيهم { تنزيلاً ممن خلق الأرض } إلى قوله: { له الأسماء الحسنى } معناه: أنزلناه تنزيلاً ممن اتّصف بجميع الصفات الجمالية والجلالية فكان لذاتك نصيب من جميعها وإلا لما أمكنك قبوله وحمله إذ الأثر الوارد لا بد وأن يناسب المورد كما ناسب المصدر\n فلما كان مصدره الذات الموصوفة بجميع الأسماء الحسنى وجب أن يكون مورده الذي هو ذاتك كذلك موصوفة بها\n فكما خلق السموات العلا والأرض أي: عالم الأرواح وعالم الأجسام الذي هو الجسم المطلق وجعلها حجب جلاله الساترة لجماله كذلك حجبك بسموات طبقات غيوبك من الحجب السبعة المذكورة التي هي روحانيتك ومراتب كمالك وأرض شهادتك التي هي بدنك\n { الرحمن } أي: ربّك الجليل\n المحتجب بحجب المخلوقات لجلاله\n هو الجميل\n المتجلي بجمال رحمته على الكل\n إذ لا يخلو شيء من الرحمة الرحمانية وإلا لم يوجد\n ولهذا اختصّ الرحمن به دون الرحيم لامتناع عموم الفيض للكل إلا منه\n فكما استوى على عرش وجود الكل بظهور الصفة الرحمانية فيه وظهور أثرها أي: الفيض العام منه إلى جميع الموجودات فكذا استوى على عرش قلبك بظهور جميع صفاته فيه ووصول أثرها منه إلى جميع الخلائق\n فصرت رحمة للعالمين وصارت نبوّتِك عامة خاتمة\n فمعنى الاستواء: ظهوره فيه سوياً تاماً إذ لا يطابق كلها مظهر غيره فلا يستوي ولا يستقيم إلا عليه\n ولذلك لم يكن له عليه السلام ظل إذ لم يبق من ذاته مع صفاته بقية لم تتحقق بالحق بالبقاء بعد الفناء التام",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ طه } [طه: 1] طالب الهدياة العامة على كافرة البرايا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: عن ابن عباس أن \" طه \" من أسماء الله تعالى\n وقيل: معناه: طوبى لمن هدى\n وقيل: يا طاهر يا هادي\n فالطاء تشير إلى طهارته صلى الله عليه وسلم وتطهيره من دنس الحس\n والهاء تشير إلى هدايته في نفسه\n وهدايته غيره إلى حضرة القدس\n ورُوِيَ عنه صلى الله عليه وسلم أنه قال:\n \" لي عشرة أسماء\n\n\n \" \nفذكر أن منها \" طه ويس \" \n وقيل: معناه: طِئ الأرض بقدمك لأنه كان يرفع رِجْلاً في الصلاة ويضع أخرى في طول تهجده\n فأبدل الهمزة ألفًا\n والضمير للأرض\n ورُد بأنه لو كان كذلك لكُتبت بالألف\n فإنَّ الكتابة بصورة الحرف مع التلفظ بخلافه من خصائص حروف المعجم\n وقيل: معناه: يا رجل\n وهو مروي عن ابن عباس والحسن ومجاهد وغيرهم\n وهو عندهم على اللغة النبطية\n أو السريانية\n قيل: من جعل معنى \" طه \" يا رجل\n لم يقل على طه\n وكذا من جعله اسمًا للنبي صلى الله عليه وسلم لأن النداء تنبيه على ما بعده\n ومن جعلها افتتاحًا\n أو على وجه من الوجوه المذكورة في البقرة\n وقف عليها\n إلا في قول من جعلها قَسَمًا\n فإنه لا يقف عليها لأن قوله: { ما أنزلنا\n\n\n } الخ جواب قسم",
      "translations": []
    }
  ],
  "most_similar_verses": [],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}