{
  "chapter": "طه",
  "text": "قال كذلك اتتك ءايتنا فنسيتها وكذلك اليوم تنسى",
  "translations": [
    {
      "translation": "He will say, 'Just as Our Signs came to you and you forgot them, in the same way you too are forgotten today.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(God) will say: \"Because Our signs came to you, but you disregarded them. So shall We disregard you this day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: \"Even so it is. Our Signs came to you and you ignored them. So shall you be ignored this Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord will say, \"This is true. But just as you forgot Our revelations that had come to you, so, too, are you forgotten on this day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, “Similarly did Our signs come to you but you forgot them; and in the same way, nobody will heed you today.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) will say: \"Like this Our Ayat came unto you, but you disregarded them, and so this Day, you will be neglected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: Even so, Our communications came to you but you neglected them; even thus shall you be forsaken this day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall say, 'Even so it is. Our signs came unto thee, and thou didst forget them; and so today thou art forgotten.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: So (it must be). Our revelations came unto thee but thou didst forget them. In like manner thou art forgotten this Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say, \"Just as Our signs came to you and you ignored them, so will you on this Day be ignored.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: Thus came Our signs Unto thee and thou ignoredst them; so that wise today thou shalt be ignored.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: ‘So it is. Our signs came to you, but you forgot them, and so you will be forgotten today.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) will say: \"Thus didst Thou, when Our Signs came unto thee, disregard them: so wilt thou, this day, be disregarded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) will say: \"Like this, Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) came unto you, but you disregarded them (i.e. you left them, did not think deeply in them, and you turned away from them), and so this Day, you will be neglected (in the Hell-fire, away from Allah's Mercy).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) will say: 'It is so, Our verses came to you and you forgot them. So this Day you are forgotten'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, “Just as Our revelations came to you, and you forgot them, today you will be forgotten.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] will say, \"Thus did Our signs come to you, and you forgot them; and thus will you this Day be forgotten.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:126] He will say, ‘So it, the affair, is. Our signs came to you, but you forgot them, you neglected them and did not believe in them; and so, just as you forgot Our signs, today you will be forgotten’, abandoned in the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَ كَذَلِكَ أَتَتْكَ آَيَاتُنَا فَنَسِيتَهَا وَكَذَلِكَ الْيَوْمَ تُنْسَى (126) وفي هذه الآية وصاية الله آدم وذريته باتباع رسل الله والوحي الإلهي ، وبذلك يعلم أن طلب الهدى مركوز في الجبلة البشريّة حتى قال كثير من علماء الإسلام : إن معرفة الإله الواحد كائنة في العقول أو شائعة في الأجيال والعصور . وإنه لذلك لم يُعذر أهل الشرك في مُدد الفِتر التي لم تجىء فيها رسل للأمم . وهذه مسألة عظيمة وقد استوعبها علماء الكلام ، وحررناها في «رسالة النسب النبوي» .وقد تقدم تفسير نظير الجملتين الأوليْن في سورة البقرة .وأما قوله { فلا يضل } فمعناه : أنه إذا اتبع الهُدى الوارد من الله على لسان رسله سَلِم من أن يعتريه شيء من ضلال ، وهذا مأخوذ من دلالة الفِعل في حيّز النفي على العموم كعموم النكرة في سياق النفي ، أي فلا يعتريه ضلال في الدنيا ، بخلاف من اتبع ما فيه هدى وارد من غير الله فإنه وإن استفاد هدى في بعض الأحوال لا يسلم من الوقوع في الضلال في أحْوال أخرى . وهذا حال متبعي الشرائع غير الإلهية وهي الشرائع الوضعية فإن واضعيها وإن أفرغوا جهودهم في تطلب الحق لا يسلمون من الوقوع في ضلالات بسبب غَفلات ، أو تعارض أدلة ، أو انفعال بعادات مستقرة ، أو مصانعة لرؤساء أو أمم رأوا أن من المصلحة طلبَ مرضاتهم . وهذا سقراط وهو سيّد حكماء اليونان قد كان يتذرع لإلقاء الأمر بالمعروف في أثينا بأن يفرغه في قوالب حكايات على ألسنة الحيوان ، ولم يسلم من الخنوع لمصانعة اللفيف فإنه مع كونه لا يرى تأليه آلهتهم لم يسلم من أن يأمر قبل موته بقربان ديك لعطارد ربّ الحكمة . وحالهم بخلاف حال الرسل الذين يتلقون الوحي من علاّم الغيوب الذي لا يضل ولا ينسى ، وأيدهم الله ، وعصمهم من مصانعة أهل الأهواء ، وكوّنهم تكويناً خاصاً مناسباً لما سبق في علمه من مراده منهم ، وثبت قلوبهم على تحمل اللأواء ، ولا يخافون في الله لومة لائم . وإن الذي ينظر في القوانين الوضعية نظرة حكيم يجدها مشتملة على مراعاة أوهام وعادات .والشقاء المنفي في قوله { ولا يشقى هو شقاء الآخرة لأنه إذا سلم من الضلال في الدنيا سلم من الشقاء في الآخرة .ويدل لهذا مقابلة ضده في قوله ومن أعرض عن ذكري فإن له معيشة ضنكاً ونحشره يوم القيامة أعمى } ، إذ رتب على الإعراض عن هدي الله اختلال حَاله في الدنيا والآخرة ، فالمعيشة مراد بها مدة المعيشة ، أي مدّة الحياة .والضنك : مصدر ضَنُك ، من باب كَرُم ضناكة وضنكاً ، ولكونه مصدراً لم يتغيّر لفظه باختلاف موصوفه ، فوصف به هنا { معيشة وهي مؤنث . والضنك : الضيق ، يقال : مكان ضنك ، أي ضيق . ويستعمل مجازاً في عسر الأمور في الحياة ، قال عنترة :إن يلحقوا أكرُر وإن يستلحموا ... أشدد وإن نَزلوا بضَنْك أنْزِلِأي بمنزل ضنك ، أي فيه عسر على نازله . وهو هنا بمعنى عسر الحال من اضطراب البال وتبلبله . والمعنى : أن مجامع همه ومطامح نظره تكون إلى التحيل في إيجاد الأسباب والوسائل لمطالبه ، فهو متهالك على الازدياد خائف على الانتقاص غير ملتفت إلى الكمالات ولا مأنوس بما يسعى إليه من الفضائل ، يجعله الله في تلك الحالة وهو لا يشعر ، وبعضهم يبدو للناس في حالة حسنة ورفاهية عيش ولكن نفسَه غير مطمئنة .وجعل الله عقابه يوم الحشر أن يكون أعمى تمثيلاً لحالته الحسية يومئذ بحالته المعنوية في الدنيا ، وهي حالة عدم النظر في وسائل الهدى والنجاة . وذلك العمى عنوان على غضب الله عليه وإقصائه عن رحمته ، فأعمى الأول مجاز وأعمى الثاني حقيقة .\n\n",
      "translations": [
        {
          "translation": "348 (He will say: So (it must be)). Because (Our revelations) Our Scripture and Messenger (came unto thee but thou didst forget them) you abstained from believing in them or acting upon them. (In like manner thou art forgotten this Day) you will be left in hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } سبحانه توبيخاً عليه وتقريعاً: { كَذٰلِكَ } أي: مثل ذلك فعلتَ بنا حين { أَتَتْكَ } بلسان الأنبياء { آيَاتُنَا } لهدايتك وإصلاح حالك { فَنَسِيتَهَا } ونبذتَها وراء ظهرك فكانت نسبتُك إليها كنسبة الأعمى إلى الأشياء المحسوسة { وَكَذٰلِكَ } أي: كالمنبوذ وراء الظهر { ٱلْيَوْمَ تُنْسَىٰ } [طه: 126] أنت في جهنم العبد والحرمان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكذلك اليومَ تُنسى }: تُترك في العمى والعذاب\n جزاء وفاقًا\n وحشره أعمى لا يدل على دوامه\n بل يزيله عنه فيرى أهوال الموقف ومقعده\n وكذلك الصمم والبكم يزيلهما الله تعالى عنهم\n\n\n[مريَم: 38]\n فيومُ القيامة ألوان\n ثم قال تعالى: { وكذلك } أي: مثل ذلك الجزاء الموافق للجنايات\n { نجزي من أسْرَف } وتَعدى بالانهماك في الشهوات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:19",
      "similarity": 0.6684976974713723
    },
    {
      "verse": "20:52",
      "similarity": 0.6458189118412833
    },
    {
      "verse": "87:6",
      "similarity": 0.6149355981596192
    },
    {
      "verse": "19:64",
      "similarity": 0.5645710163665114
    },
    {
      "verse": "45:34",
      "similarity": 0.5609884202732315
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020126.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020126.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:126.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}