{
  "chapter": "طه",
  "text": "قال كذلك اتتك ءايتنا فنسيتها وكذلك اليوم تنسى",
  "translations": [
    {
      "translation": "He will say, 'Just as Our Signs came to you and you forgot them, in the same way you too are forgotten today.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(God) will say: \"Because Our signs came to you, but you disregarded them. So shall We disregard you this day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: \"Even so it is. Our Signs came to you and you ignored them. So shall you be ignored this Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord will say, \"This is true. But just as you forgot Our revelations that had come to you, so, too, are you forgotten on this day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, “Similarly did Our signs come to you but you forgot them; and in the same way, nobody will heed you today.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) will say: \"Like this Our Ayat came unto you, but you disregarded them, and so this Day, you will be neglected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: Even so, Our communications came to you but you neglected them; even thus shall you be forsaken this day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall say, 'Even so it is. Our signs came unto thee, and thou didst forget them; and so today thou art forgotten.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: So (it must be). Our revelations came unto thee but thou didst forget them. In like manner thou art forgotten this Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say, \"Just as Our signs came to you and you ignored them, so will you on this Day be ignored.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: Thus came Our signs Unto thee and thou ignoredst them; so that wise today thou shalt be ignored.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: ‘So it is. Our signs came to you, but you forgot them, and so you will be forgotten today.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) will say: \"Thus didst Thou, when Our Signs came unto thee, disregard them: so wilt thou, this day, be disregarded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) will say: \"Like this, Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) came unto you, but you disregarded them (i.e. you left them, did not think deeply in them, and you turned away from them), and so this Day, you will be neglected (in the Hell-fire, away from Allah's Mercy).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) will say: 'It is so, Our verses came to you and you forgot them. So this Day you are forgotten'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, “Just as Our revelations came to you, and you forgot them, today you will be forgotten.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] will say, \"Thus did Our signs come to you, and you forgot them; and thus will you this Day be forgotten.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:126] He will say, ‘So it, the affair, is. Our signs came to you, but you forgot them, you neglected them and did not believe in them; and so, just as you forgot Our signs, today you will be forgotten’, abandoned in the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "348 (He will say: So (it must be)). Because (Our revelations) Our Scripture and Messenger (came unto thee but thou didst forget them) you abstained from believing in them or acting upon them. (In like manner thou art forgotten this Day) you will be left in hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } سبحانه توبيخاً عليه وتقريعاً: { كَذٰلِكَ } أي: مثل ذلك فعلتَ بنا حين { أَتَتْكَ } بلسان الأنبياء { آيَاتُنَا } لهدايتك وإصلاح حالك { فَنَسِيتَهَا } ونبذتَها وراء ظهرك فكانت نسبتُك إليها كنسبة الأعمى إلى الأشياء المحسوسة { وَكَذٰلِكَ } أي: كالمنبوذ وراء الظهر { ٱلْيَوْمَ تُنْسَىٰ } [طه: 126] أنت في جهنم العبد والحرمان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال ربِّ لِمَ حشرتني أعمى وقد كنت بصيرًا } في الدنيا؟ { قال كذلك } أي: مثل ذلك فعلتَ أنتَ { أتتك آياتُنا } أي: حجتنا النيرة على أيدي رسلنا { فنسيتَها } أي: عميتَ عنها، وتركتها ترك المنسي الذي لا يذكر قط، { وكذلك اليومَ تُنسى }: تُترك في العمى والعذاب، جزاء وفاقًا\n وحشره أعمى لا يدل على دوامه، بل يزيله عنه فيرى أهوال الموقف ومقعده، وكذلك الصمم والبكم يزيلهما الله تعالى عنهم\n\n\n\n\n[مريَم: 38]، فيومُ القيامة ألوان\n ثم قال تعالى: { وكذلك } أي: مثل ذلك الجزاء الموافق للجنايات",
      "translations": []
    }
  ]
}