{
  "chapter": "طه",
  "text": "انى انا۠ ربك فاخلع نعليك انك بالواد المقدس طوى",
  "translations": [
    {
      "translation": "I am your Lord. Take off your sandals. You are in the holy valley of Tuwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Moses, I am verily your Lord, so take off your shoes, for you are in the holy plain of Towa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily I am your Lord! Take off your shoes. You are in the sacred valley, Tuwa!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I Am your Lord. Take off your shoes; you are in the holy valley of Tuwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Indeed I am your Lord, therefore take off your shoes; indeed you are in the holy valley of Tuwa!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, I am your Lord! So take off your shoes; you are in the sacred valley, Tuwa.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely I am your Lord, therefore put off your shoes; surely you are in the sacred valley, Tuwa,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am thy Lord; put off thy shoes; thou art in the holy valley, Towa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! I, even I, am thy Lord, So take off thy shoes, for lo! thou art in the holy valley of Tuwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am your Lord! Take off your sandals, for you are in the sacred valley of Tuwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily I! I am thy Lord: so take off thy shoes; verily thou art into the holy valley, Tuwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed I am your Lord! So take off your sandals. You are indeed in the sacred valley of Tuwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily I am thy Lord! therefore (in My presence) put off thy shoes: thou art in the sacred valley Tuwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! I am your Lord! So take off your shoes, you are in the sacred valley, Tuwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am your Lord. Take off your shoes, for you are in Towa, the sacred valley.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I—I am your Lord. Take off your shoes. You are in the sacred valley of Tuwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, I am your Lord, so remove your sandals. Indeed, you are in the sacred valley of Tuwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:12] Indeed (read as innī, if one understands nūdiya, ‘he was called’, as meaning qīla, ‘it was said’; or read it as annī, because of an implied [prefixed] bā’) I am (anā, reiterates the [first person indicator] yā’ [of innī] used by the [direct] speaker) your Lord. So take off your sandals, for lo! you are in the holy, [meaning] either the pure, or the blessed, valley of Tuwā ([this is] either a substitution, or an explicative supplement; read [Tuwan] with nunation or [Tuwā] without: it is [considered] declinable on account of it being a location; but [alternatively considered] indeclinable, if taken as considered a feminine proper noun denoting a place name).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! I, even I, am thy Lord. So take off thy shoes) for his shoes were made of the skin of a dead ass, (for Lo! thou art in the holy valley of Tuwa) Tuwa is the name of the valley; it also said that Tuwa means: this valley has been crossed (tawathu) by prophets before you; it is also said that Tuwa is a well which was filled with stones (tuwiyyat bi'l-sakhr) in the valley where he found the tree.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِٱلْوَادِ ٱلْمُقَدَّسِ طُوًى } وتقرأ طِوَىً معناه طا الوادي\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنِّيۤ } وإن ظهرتُ على هذه الصورة المطلوبة لك هذا { أَنَاْ رَبُّكَ } أي: مطلوبك الحقيقي الذي ربيتك بأنواع اللطف والكرم، وابتليتك بأنواع البلاء في طريق المجاهدة؛ لتتوجه إليُّ فتعرفني، فالآن ارتفعت الحجب والقيود، وتحققتَ بمقام الكشف والشهود { فَٱخْلَعْ نَعْلَيْكَ } فاسترح عن الطلب بعد وجدان الرب، وتمكْن ي مقعد الصدق { إِنَّكَ بِٱلْوَادِ ٱلْمُقَدَّسِ } عن رذائل الأغيار { طُوًى } [طه: 12] أي: طويتَ التوجُّه إلى الغير، ولم يبقَ لك احتياج إلى الاستكمال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يروى أنه لما نودي يا موسى، قال عليه السلام: مَن المتكلم؟ فقال الله عزّ وجلّ: { أنا ربك } ، فوسوس إليه الخاطر: لعلك تسمع كلام شيطان، قال: فلما قال: { إنني أنا } ، عرفت أنه كلام الله عزّ وجلّ\n قيل: إنه سمعه من جميع الجهات بجميع الأعضاء\n ثم قال له: { فاخلع نعليك } لأنه أليق بحسن الأدب، ومنه أخذ الصوفية - رضي الله عنهم - خلع نعالهم بين يدي المشايخ والأكابر، وقيل: ليباشر الوادي المقدس بقدميه، ومنه يؤخذ تعظيم المساجد، بخلعها ولو طاهرة، وقيل: إن نعليه كانتا من جلد حمار غير مدبوغ\n وقيل: النعلين: الكونين، أي: فرغ قلبك من الكونين إن أردت دخول حضرتنا\n وقوله تعالى: { إِنك بالوادِ المقدَّس }: تعليل لوجوب الخلع، وبيان لسبب ورود الأمر بذلك\n رُوي أنه عليه السلام خلعهما وألقاهما وراء الوادي، و { طُوى }: بدل من الوادي، وهو اسم له\n وقُرئ منونًا لتأوله بالمكان، وغير المنون لتأوله بالبقعة",
      "translations": []
    }
  ]
}