{
  "chapter": "طه",
  "text": "ومن يعمل من الصلحت وهو مؤمن فلا يخاف ظلما ولا هضما",
  "translations": [
    {
      "translation": "But anyone who does right actions, being a mumin, need fear no wrong or any belittlement.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who has done good things and believes, will have no fear of either being wronged or deprived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but whosoever does righteous works, being a believer, shall have no fear of suffering wrong or loss.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteously striving believers should have no fear of being treated with injustice or inequity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the one who does some good deeds, and is a Muslim – he shall have no fear of injustice, nor suffer any loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who works deeds of righteousness, while he is a believer, then he will have no fear of injustice, nor of any curtailment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does good works and he is a believer, he shall have no fear of injustice nor of the withholding of his due.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but whosoever does deeds of righteousness, being a believer, shall fear neither wrong nor injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who hath done some good works, being a believer, he feareth not injustice nor begrudging (of his wage).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but he who does good works, being a believer, shall fear no harm nor any injustice.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever worketh of the righteous works, and is a believer, he will not fear Wrong or begrudging\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever does righteous deeds, being faithful, will neither fear any injustice or disparagement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who works deeds of righteousness, and has faith, will have no fear of harm nor of any curtailment (of what is his due).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who works deeds of righteousness, while he is a believer (in Islamic Monotheism) then he will have no fear of injustice, nor of any curtailment (of his reward).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but those who have believed and done good works shall fear neither wrong nor injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever has done righteous deeds, while being a believer—will fear neither injustice, nor grievance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who does of righteous deeds while he is a believer - he will neither fear injustice nor deprivation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:112] But whoever does righteous deeds, acts of obedience, being a believer, shall fear neither wrong, by having his evil deeds increased, nor injustice, by having his good deeds diminished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And he who hath done some good works) between him and his Lord, (being a believer) true in his faith, (he fears not injustice) he does not fear the thwarting of all his works (nor begrudging) nor the decrease of his works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ يَخَافُ ظُلْماً وَلاَ هَضْماً } معناه انتِقاصٌ\n وقال: غَصبٌ\n وقال لا يَخَافُ أَنْ يُؤخذَ بِمَا لَم يَعملْ\n فَهو قَولُهُ (ظُلماً) وَلاَ يَخافُ أَن يُنقَّصُ من عَملهِ الصالحِ شيئاً فذَلك الهَضمُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {There is no fear for those who have believed and done righteous deeds}, means that there is no decrease [in their reward].\n\n\nAnd he said: \"I have been deprived.\"\n He said that he is not afraid of being taken for what he has not done.\n\n\n\"And he (the oppressor) does not fear that any good will be reduced from his good deeds. That is the digestion.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَعْمَلْ مِنَ ٱلصَّالِحَاتِ } في الدنيا { وَهُوَ مُؤْمِنٌ } موقن بوحدانية الله { فَلاَ يَخَافُ } في ذلك اليوم { ظُلْماً } بأن يحبط أعماله الصالحة بالكلية، ولم يجز بها { وَلاَ هَضْماً } [طه: 112] بأن ينقص من جزاء عمله الصالح\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:148",
      "similarity": 0.8240571758804338
    },
    {
      "verse": "2:277",
      "similarity": 0.06643473999632363
    },
    {
      "verse": "6:48",
      "similarity": 0.062057476107411656
    },
    {
      "verse": "24:55",
      "similarity": 0.05847336332041205
    },
    {
      "verse": "19:60",
      "similarity": 0.055726566099418846
    }
  ]
}