{
  "chapter": "طه",
  "text": "قال اهبطا منها جميعۢا بعضكم لبعض عدو فاما ياتينكم منى هدى فمن اتبع هداى فلا يضل ولا يشقى",
  "translations": [
    {
      "translation": "He said, 'Go down from it, all of you, as enemies to one another! But when guidance comes to you from",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And) said: \"Go down hence together, one the enemy of the other. Then will guidance come to you from Me; and whoever follows My direction will neither be disgraced nor be miserable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and said: \"Get down, both of you, (that is, man and Satan), and be out of it; each of you shall be an enemy to the other. Henceforth if there comes to you a guidance from Me, then whosoever follows My guidance shall neither go astray nor suffer misery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God then told them, \"Get out of here all of you; you are each other's enemies. When My guidance comes to you, those who follow it will not go astray nor will they endure any misery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Both of you go down from heaven, one of you is an enemy to the other; then if the guidance from Me comes to you – then whoever follows My guidance, will not go astray nor be ill-fated.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) said: \"Get you down, both of you, together, some of you are an enemy to some others. Then if there comes to you guidance from Me, then whoever follows My guidance he shall neither go astray nor shall be distressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Get forth you two therefrom, all (of you), one of you (is) enemy to another. So there will surely come to you guidance from Me, then whoever follows My guidance, he shall not go astray nor be unhappy;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'Get you down, both of you together, out of it, each of you an enemy to each; but if there comes to you from Me guidance, then whosoever follows My guidance shall not go astray, neither shall he be unprosperous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Go down hence, both of you, one of you a foe unto the other. But when there come unto you from Me a guidance, then whoso followeth My guidance, he will not go astray nor come to grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, \"Go down, both of you, from here, as enemies to one another.\" If there comes to you guidance from Me, then whoever follows My guidance will not lose his way, nor will he come to grief,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: get ye twain down therefrom together: some of you an enemy unto some others; then if there cometh unto you from Me guidance, whosoever followeth My guidance shall neither go astray nor be distressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Get down both of you from it, all together, being enemies of one another! Yet, should any guidance come to you from Me, those who follow My guidance will not go astray, nor will they be miserable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Get ye down, both of you,- all together, from the Garden, with enmity one to another: but if, as is sure, there comes to you Guidance from Me, whosoever follows My Guidance, will not lose his way, nor fall into misery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said:\"Get you down (from the Paradise to the earth), both of you, together, some of you are an enemy to some others. Then if there comes to you guidance from Me, then whoever follows My Guidance shall neither go astray, nor fall into distress and misery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both of you, together, go down out of it (the Garden) each of you an enemy to the other' He said: 'but, if My Guidance comes to you, whosoever followsMy Guidance shall neither go astray nor be unprosperous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Go down from it, altogether; some of you enemies of some others. But whenever guidance comes to you from Me, whoever follows My guidance, will not go astray, nor suffer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"Descend from Paradise - all, [your descendants] being enemies to one another. And if there should come to you guidance from Me - then whoever follows My guidance will neither go astray [in the world] nor suffer [in the Hereafter].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:123] He said, ‘Go down both of you, that is, Adam and Eve, including all of your progeny, from it, from the Garden, all together, some of you, some of the progeny, being enemies of others, because of some wronging others. Yet if (the nūn of the conditional particle in has been assimilated with the mā, which is extra) there should come to you guidance from Me, then whoever follows My guidance, the Qur’ān, shall not go astray, in this world, neither shall he be miserable, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: Go down hence) from Paradise, (both of you) along with serpent and the peacock, (one of you a foe unto the other) i.e. the children of Adam and the serpent are foes to one another. (But if there come unto you from Me a guidance) when it comes to you, O Children of Adam, guidance from Me: a Scripture and a Messenger, (then whoso followeth My guidance) My Scripture and Messenger, (he will not go astray) by following them in the life of this world (nor come to grief) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَمَنِ ٱتَّبَعَ هُدَايَ فَلاَ يَضِلُّ وَلاَ يَشْقَىٰ } معناه لا يَضِلُ: في الدّنيا\n وَلاَ يَشقى: فِي الأَخرةِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {But whoever follows My guidance will neither go astray [in the world] nor suffer}. Its meaning is that he will not go astray: in this world.\n\n\nAnd he will not be harmed in the hereafter.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك { قَالَ ٱهْبِطَا مِنْهَا } أي: انزلا من الجنة التي هي دار الأمن والسرور إلى الدنيا التي هي دار التفرقة والغرور { جَمِيعاً } أصلاً وفرعاً\n صديقاً وعدواً\n وبعد هبوطكم إليها { بَعْضُكُمْ } يا بني آدم { لِبَعْضٍ عَدُوٌّ } في أمور معاشكم\n والشيطان عدو لكم في أمور معادكم\n فتبقى هذه العداوة بينكم ما دمتم فيها\n ومع أمرنا لكم بالهبوط والخروج منها إليها\n لا نترككم هناك ضالّين محرومين مطرودين { فَإِمَّا يَأْتِيَنَّكُم مِّنِّي هُدًى } بواسطة الرسل والكتب المنزلة عليهم فاتبعوا هداي { فَمَنِ ٱتَّبَعَ هُدَايَ } عزيمة وقصداً صحيحاً { فَلاَ يَضِلُّ } في النشأة ا لأولى لاتصافه بصفاتنا { وَلاَ يَشْقَىٰ } [طه: 123] في النشأة الأخرى لفنائه فينا وبقائه ببقائنا\n\n\n{ وَمَنْ أَعْرَضَ عَن ذِكْرِي } أي: كتابي الجاري على ألسنة رسلي الهادين عن الضلال { فَإِنَّ لَهُ } أي: ثَبَتَ له وحقَّ ما دام دار الدنيا { مَعِيشَةً ضَنكاً } ضيقاً يضيق قلبه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { قال اهبطا منها جميعًا } ، وهو استئناف بياني، كأنَّ سائلاً قال: فما قال تعالى بعد قبول توبته؟ فقيل: قال له ولزوجته: { اهبِطَا منها } أي انزلا من الجنة إلى الأرض، حال كونكم { بعضُكم لبعض عدوٌّ } أي متعادين في أمر المعاش، كما عليه الناس من التجاذب والتحارب والاختلاف في الدين\n والجمع لأنهما أصل الذرية ومنشأ الأولاد وفي اللباب: ولما أُهبطوا إلى الأرض ألقى آدمُ يده تحت خده، وبكى مائة سنة، وألقت حواءُ يدها على رأسها، وجعلت تصيح وتصرخ، فبقيت سنَّة في النساء\n ولم يزل آدم يبكي حتى صار بخديه أخاديد من كثرة الدموع، وجرى من عينيه على الأرض جدولان، يجريان إلى قيام الساعة\n\n\nوأُهبط آدم على ورقة من ورق الجنة، كان يتستر بها، وفي يده قبضة من ريحان الجنة، فلما اشتغل بالبكاء أدارتها الرياحُ في أرض الهند، فصار أكثر نباتها طيبًا\n انظر بقية كلامه\n { فإِمّا يأتينكم مني هُدًى } أي: هداية من رسول وكتاب يهدي إلى الوصول إليَّ، أي: سيأتيكم مني رسل وكتاب\n والخطاب لهما بما اشتملا عليه من ذريتهما\n { فمن اتبع هُدايَ } بأن آمن بالرسل وبما جاؤوا به من عند الله { فلا يضل } في الدنيا { ولا يشقى } في الآخرة\n ووضع الظاهر موضع المضمر يعني: من اتبع هداي، مع الإضافة إلى ضميره تعالى لتشريفه والمبالغة في إيجاب اتباعه\n وعن ابن عباس رضي الله عنه: من قرأ الفرقان، واتبع ما فيه، هداه الله من الضلالة، ووقاه يوم القيامة سوء الحساب، وذلك لأن الله تعالى يقول: { فمن اتبع هداي } أي: كتابي ورسولي، { فلا يضل } في الدنيا، { ولا يشقى } في الآخرة\n وفي لفظ آخر: أجار الله تابع القرآن أن يضل في الدنيا ويشقى في الآخرة\n قال ابن عرفة: والعطف بالفاء في قوله: { فإما… } الخ، إشارة إلى أن العداوة سبب في أن يبعث لهم الرسل يهدونهم إلى طريق الحق، فضلاً منه تعالى، ولذلك أتى \" بإن \" ، دون \" إذا \" المقتضية للتحقيق الموهم للوجوب\n فانظره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:24",
      "similarity": 0.6040949221592328
    },
    {
      "verse": "2:38",
      "similarity": 0.5941321036037858
    },
    {
      "verse": "7:13",
      "similarity": 0.5257465967655012
    },
    {
      "verse": "11:48",
      "similarity": 0.4713340436727863
    },
    {
      "verse": "20:117",
      "similarity": 0.46699498791353655
    }
  ]
}