{
  "chapter": "طه",
  "text": "فتعلى الله الملك الحق ولا تعجل بالقرءان من قبل ان يقضى اليك وحيه وقل رب زدنى علما",
  "translations": [
    {
      "translation": "High exalted be Allah, the King, the Real! Do not rush ahead with the Qur'an before its revelation to you is complete, and say: 'My Lord, increase me in knowledge.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted then be God, the real King; and do not try to anticipate the Qur'an before the completion of its revelation, but pray: \"O Lord, give me greater knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is Allah, the True King! Hasten not with reciting the Qur'an before its revelation to you is finished, and pray: \"Lord! Increase me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the Most High and the True King. (Muhammad), do not be hasty in reading the Quran to the people before the revelation has been completed. \"Say, My Lord, grant me more knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore Supreme is Allah, the True King; and do not hasten in the Qur’an (O dear Prophet Mohammed – peace and blessings be upon him) until its divine revelation has been completed to you; and pray, “My Lord, bestow me more knowledge.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then High above all be Allah, the True King. And be not in haste with the Qur'an before its revelation is completed to you, and say: \"My Lord! Increase me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Supremely exalted is therefore Allah, the King, the Truth, and do not make haste with the Quran before its revelation is made complete to you and say: O my Lord! increase me in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So high exalted be God, the true King! And hasten not with the Koran ere its revelation is accomplished unto thee; and say, 'O my Lord, increase me in knowledge.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then exalted be Allah, the True King! And hasten not (O Muhammad) with the Qur'an ere its revelation hath been perfected unto thee, and say: My Lord! Increase me in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "exalted is God, the True King. Do not be impatient with the Quran before its revelation is completed, and say, \"My Lord, increase my knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is Allah, the True King! And hasten thee not with the Qur'an before there is finished to thee the revelation thereof, and say thou: O my Lord! increase me in knowledge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So exalted is Allah, the True Sovereign. Do not hasten with the Quran before its revelation is completed for you, and say, ‘My Lord! Increase me in knowledge.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "High above all is Allah, the King, the Truth! Be not in haste with the Qur'an before its revelation to thee is completed, but say, \"O my Lord! advance me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then High above all be Allah, the True King. And be not in haste (O Muhammad SAW) with the Quran before its revelation is completed to you, and say: \"My Lord! Increase me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Highly exalted be Allah, the true King! Do not hasten with the Koran before its revelation has been completed to you, but say: 'Lord, increase me in knowledge'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is God, the True King. Do not be hasty with the Quran before its inspiration to you is concluded, and say, “My Lord, increase me in knowledge.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So high [above all] is Allah, the Sovereign, the Truth. And, [O Muhammad], do not hasten with [recitation of] the Qur'an before its revelation is completed to you, and say, \"My Lord, increase me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:114] So exalted be God, the King, the Truth, above what the idolaters say. And do not hasten with the Qur’ān, that is, to recite it, before its revelation is completed for you, [before] Gabriel is through delivering it, and say, ‘My Lord, increase me in knowledge’, that is, [knowledge] of the Qur’ān: thus every time something of it was revealed to him his knowledge increased because of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then exalted be Allah, the True King) He exonerated Himself from having children or partners! (And hasten not with the Qur'an) do not hasten, O Muhammad, to recite the Qur'an (ere its revelation hath been perfected unto thee) before Gabriel finishes reading the Qur'an to you. This is because when Gabriel used to bring new revelations, the Prophet (pbuh) would start to repeat them after Gabriel even before the latter finished his reading, for fear of forgetting what was recited to him. Allah therefore told him to stop doing this, saying: (and say) O Muhammad: (My Lord! Increase me in knowledge) and memorisation and understanding of the Qur'an as well as in judging by the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِن قَبْلِ أَن يُقْضَىٰ إِلَيْكَ وَحْيُهُ } معناه يُبيّنُ لَكَ بَيانَهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {before it is decided to you} means He will explain to you His statement.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن قالوا على سبيل المكابرة عتواً وعناداً: لربك حاجة إلى إيماننا وتقوانا، وإلا لِمَ يرجوا إيماننا؟ قل لهم يا أكمل الرسل: { فَتَعَٰلَى ٱللَّهُ } أي: تنزه وتقدس { ٱلْمَلِكُ } المستولي المطلق { ٱلْحَقُّ } الثابت الدائم أزلاً وأبداً عما يقول الظالمون المشركون من إثبات الاحتياج له بمجرد الرخاء العائد نفعه إياهم أيضاً\n\n\n\n\n{ وَ } إذا كان ظنهم هذا { لاَ تَعْجَلْ } يا أكمل الرسل { بِٱلْقُرْءانِ } أي: بأدائه وتبليغه لهم وقراءته عليهم { مِن قَبْلِ أَن يُقْضَىٰ إِلَيْكَ وَحْيُهُ } أي: من قبل أن يفرغ جبرائيل عليه السلام من وحيه وتبليغه، بل أصبر حتى يفرغ من الوحي، ثم تأمل في مرمزاته وإشاراته الخفية بدقر استعدادك { وَ } بعد التأمل والتدبر { قُل رَّبِّ زِدْنِي عِلْماً } [طه: 114] بما فيه من نفائس المعلومات وعجائب المعارف والحقائق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:58",
      "similarity": 0.478614586636177
    },
    {
      "verse": "16:1",
      "similarity": 0.42095928053147524
    },
    {
      "verse": "26:204",
      "similarity": 0.31878503915286677
    },
    {
      "verse": "37:176",
      "similarity": 0.31878503915286677
    },
    {
      "verse": "21:25",
      "similarity": 0.3032215393077345
    }
  ]
}