{
  "chapter": "طه",
  "text": "اننى انا الله لا اله الا انا۠ فاعبدنى واقم الصلوة لذكرى",
  "translations": [
    {
      "translation": "I am Allah. There is no god but Me, so worship Me and establish salat to remember Me.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am God, and there is no god but I, so serve Me, and observe acts of prayer to remember Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily I am Allah. There is no god beside Me. So serve Me and establish Prayers to remember Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I Am the only God. Worship Me and be steadfast in prayer to have My name always in your mind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Indeed it is Me, Allah – there is no God except I – therefore worship Me and keep the prayer established for My remembrance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, I am Allah! There is no God but Me, so worship Me, and perform Salah for My remembrance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely I am Allah, there is no god but I, therefore serve Me and keep up prayer for My remembrance:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily I am God; there is no god but I; therefore serve Me, and perform the prayer of My remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! I, even I, am Allah, There is no Allah save Me. So serve Me and establish worship for My remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am God. There is no deity save Me; so worship Me alone, and say your prayers in My remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily I! I am Allah! no God there is butI; so Worship Me, and establish prayer for My remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed I am Allah—there is no god except Me. So worship Me, and maintain the prayer for My remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, I am Allah: There is no god but I: So serve thou Me (only), and establish regular prayer for celebrating My praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! I am Allah! La ilaha illa Ana (none has the right to be worshipped but I), so worship Me, and perform As-Salat (Iqamat-as-Salat) for My Remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, I am Allah. There is no god except Me. Worship Me, and establish the prayer of My remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I—I am God. There is no God but I. So serve Me, and practice the prayer for My remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, I am Allah. There is no deity except Me, so worship Me and establish prayer for My remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:14] Verily I am God — there is no god except Me. So worship Me and establish prayer for to make remembrance of Me, in it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّنِي أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدْنِي وَأَقِمِ الصَّلَاةَ لِذِكْرِي (14) هذا ما يوحى المأمور باستماعه ، فالجملة بدل من { ما يوحى } \\[ طه : 13 \\] بدلاً مطلقاً .ووقع الإخبار عن ضمير المتكلم باسمه العلَم الدالّ على الذات الواجب الوجود المستحق لجميع المحامد . وذلك أول ما يجب علمه من شؤون الإلهية ، وهو أن يعلم الاسم الذي جعله الله علَماً عليه لأن ذلك هو الأصل لجميع ما سيُخاطب به من الأحكام المبلغة عن ربّهم .وفي هذا إشارة إلى أنّ أول ما يتعارف به المتلاقون أن يعرفوا أسماءهم ، فأشار الله إلى أنه عالم باسم كليمه وعلّم كليمه اسمه ، وهو الله .وهذا الاسم هو علم الربّ في اللغة العربية . واسمه تعالى في اللغة العبرانية ( يَهْوهْ ) أو ( أَهْيَهْ ) المذكور في الإصحاح الثالث من سفر الخروج في التوراة ، وفي الإصحاح السادس . وقد ذكر اسم الله في مواضع من التوراة مثل الإصحاح الحادي والثلاثين من سفر الخروج في الفقرة الثامنة عشرة ، والإصحاح الثاني والثلاثين في الفقرة السادسة عشرة . ولعله من تعبير المترجمين وأكثر تعبير التوراة إنما هو الرب أو الإله .ولفظ ( أهْيَهْ ) أو ( يَهْوَهْ ) قريب الحروف من كلمة إله في العربية .ويقال : إن اسم الجلالة في العبرانية «لاَهُمْ» . ولعل الميم في آخره هي أصل التنوين في إله .وتأكيد الجملة بحرف التأكيد لدفع الشك عن موسى؛ نزل منزلة الشاكّ لأن غرابة الخبر تعرّض السامع للشك فيه .وتوسيط ضمير الفصل بقوله { إنَّني أنا الله } لزيادة تقوية الخبر ، وليس بمفيد للقصر ، إذ لا مقتضى له هنا لأن المقصود الإخبار بأنّ المتكلّم هو المسمى الله ، فالحمل حمل مواطاة لا حملُ اشتقاق . وهو كقوله تعالى : { لقد كفر الذين قالوا إن الله هو المسيح ابن مريم } \\[ المائدة : 72 \\].وجملة { لا إله إلاَّ أنا } خبر ثان عن اسم ( إنّ ). والمقصود منه حصول العلم لموسى بوحدانية الله تعالى .ثمّ فرع على ذلك الأمر بعبادته . والعبادة تجمع معنى العمل الدالّ على التعظيم من قول وفعل وإخلاصصٍ بالقلب . ووجه التفريع أن انفراده تعالى بالإلهية يقتضي استحقاقه أن يُعبد .وخصّ من العبادات بالذكر إقامة الصلاة لأنّ الصلاة تجمع أحوال العبادة . وإقامة الصلاة : إدامتها ، أي عدم الغفلة عنها .والذكر يجوز أن يكون بمعنى التذكر بالعقل ، ويجوز أن يكون الذكر باللّسان .واللاّم في { لِذِكْرِي } للتّعليل ، أي أقم الصلاة لأجل أن تذْكُرني ، لأنّ الصلاة تذكّر العبد بخالقه . إذ يستشعر أنه واقف بين يدي الله لمناجاته . ففي هذا الكلام إيماء إلى حكمة مشروعية الصلاة وبضميمته إلى قوله تعالى : { إن الصلاة تنهى عن الفحشاء والمنكر } \\[ العنكبوت : 45 \\] يظهر أن التقوى من حكمة مشروعية الصلاة لأنّ المكلّف إذا ذكر أمر الله ونهيه فعل ما أمره واجتنب ما نهاه عنه والله عرّف موسى حكمَة الصلاة مُجملةً وعرّفها محمداً صلى الله عليه وسلم مفصّلة .ويجوز أن يكون اللام أيضاً للتوقيت ، أي أقم الصلاة عند الوقت الذي جعلتُه لذِكري .ويجوز أن يكون الذكر الذكرَ اللساني لأن ذكر اللسان يحرّك ذكر القلب ويشتمل على الثناء على الله والاعتراففِ بما له من الحق ، أي الذي عيّنته لك . ففي الكلام إيماء إلى ما في أوقات الصلاة من الحكمة ، وفي الكلام حذف يعلم من السياق .\n\n",
      "translations": [
        {
          "translation": "(Lo! I, even I, am Allah. There is no God save Me. serve Me) obey Me (and establish worship for My remembrance) when you forget to perform a prayer, perform it when you do remember.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوكرر { إنني أنا الله } بالتأكيد\n وتبديل الربّ بالله لئلا يقف مع الصفات في الحضرة الأسمائية فيحتجب عن الذات إذ الرب هو الاسم الذي تجلى به له\n إذ لا يريه عند طلب الهداية والقبس إلا بذلك الاسم العليم الهادي الذي هو جبريل\n أي: إنني الواحد الموصوف بجميع الصفات { لا إله إلا أنا } لم أتكثر ولم يتعدد أنائيتي وأحديتي بكثرة المظاهر وتعدّد الصفات { فاعبدني } خصّص عبادتك بذاتي دون أسمائي وصفاتي بالعبادة الذاتية وتهيئة استعداد فناء الأنية في حقيقتي والتسبيح المطلق الذاتي { وأقم الصلوة } أي: صلاة الشهود الروحي لذكر ذاتي فوق صلاة الحضور القلبي لذكر صفاتي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "96:10",
      "similarity": 0.7044687447010991
    },
    {
      "verse": "87:15",
      "similarity": 0.6940688456900975
    },
    {
      "verse": "70:22",
      "similarity": 0.6789408042274183
    },
    {
      "verse": "75:31",
      "similarity": 0.5606839193868152
    },
    {
      "verse": "74:43",
      "similarity": 0.5446135498884352
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}