{
  "chapter": "طه",
  "text": "فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل غروبها ومن ءانائ اليل فسبح واطراف النهار لعلك ترضى",
  "translations": [
    {
      "translation": "So be steadfast in the face of what they say and glorify your Lord with praise before the rising of the sun and before its setting. And glorify Him during part of the night and at both ends of the day, so that hopefully you will be pleased.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So you bear with patience what they say, and sing the praises of your Lord before the rising and setting of the sun, and honour Him in the watches of the night, and then at the two ends of day, that you may find acceptance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So bear patiently with what they say. Glorify your Lord, praising Him before sunrise and before sunset, and in the watches of the night, and glorify Him and at the ends of the day that you may attain to happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), have patience with what they say, glorify your Lord, and always praise Him before sunrise, sunset, in some hours of the night and at both the beginning and end of the day, so that perhaps you will please your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore (O dear Prophet Mohammed – peace and blessings be upon him), patiently forbear upon their speech, and praising your Lord proclaim His Purity, before the sun rises and before it sets; and proclaim His Purity at some times of the night and at the two ends of the day, in the hope that you be pleased. (*With the great reward from your Lord)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So bear patiently what they say, and glorify the praises of your Lord before the rising of the sun, and before its setting, and during some hours of the night, and at the ends of the day, that you may become pleased with the reward which Allah shall give you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear then patiently what they say, and glorify your Lord by the praising of Him before the rising of the sun and before its setting, and during hours of the night do also glorify (Him) and during parts of the day, that you may be well pleased\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be thou patient under what they say, and proclaim thy Lord's praise before the rising of the sun, and before its setting, and proclaim thy Lord's praise in the watches of the night, and at the ends of the day; haply thou wilt be well-pleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor (O Muhammad), bear with what they say, and celebrate the praise of thy Lord ere the rising of the sun and ere the going down thereof. And glorify Him some hours of the night and at the two ends of the day, that thou mayst find acceptance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient with anything they may say and glorify your Lord with His praise before the rising of the sun and before its setting; and glorify Him in the hours of the night and at the beginning and end of the day, so that you may find comfort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So bear thou patiently that which they say, and hallow the praise of thy Lord before the rising of the sun and before the setting thereof. And hallow Him in part of the night and the ends of the day, haply thou wilt be pleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient with what they say, and celebrate the praise of your Lord before the rising of the sun and before the sunset, and glorify Him in watches of the night and at the day’s ends, that you may be pleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore be patient with what they say, and celebrate (constantly) the praises of thy Lord, before the rising of the sun, and before its setting; yea, celebrate them for part of the hours of the night, and at the sides of the day: that thou mayest have (spiritual) joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So bear patiently (O Muhammad SAW) what they say, and glorify the praises of your Lord before the rising of the sun, and before its setting, and during some of the hours of the night, and at the sides of the day (an indication for the five compulsory congregational prayers), that you may become pleased with the reward which Allah shall give you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, be patient with what they say, and exalt with the praise of your Lord before sunrise and before sunset. And in the watches of the night and at the edges of the day, exalt Him, so that you will be pleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So bear patiently what they say, and celebrate the praises of your Lord before the rising of the sun, and before its setting. And during the hours of the night glorify Him, and at the borders of the day, that you may be satisfied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting; and during periods of the night [exalt Him] and at the ends of the day, that you may be satisfied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:130] So be patient with what they say — this is abrogated by the ‘fighting’ verse [cf. Q. 2:190ff] — and make glorifications, pray, by praising your Lord (bi-hamdi rabbika is a circumstantial qualifier, in other words, ‘ensconced in such [praise]’) before the rising of the sun, the morning prayer, and before its setting — the afternoon prayer — and in the watches of the night, [during] the hours thereof, and make glorifications, perform the sunset and the evening prayer, and at either side of the day (wa-atrāfa’l-nahāri, a supplement to the syntactical locus of the accusative clause wa-min ānā’i, ‘and in the watches’), in other words, perform the noon prayer, because the time for it begins at the point where the sun starts to go down, which is the [end] side of the first half [of the day] and the [start] side of the second half [of the day]; that perhaps you may be pleased, with the reward that you will be given.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore, bear with what they say) bear, O Muhammad, all their insults and denial; this verses was however abrogated by the verses of fighting, (and celebrate the praises of thy Lord) pray, O Muhammad, by the command of your Lord (ere the rising of the sun) the morning prayer (and ere the going down thereof. And glorify Him) pray the Maghrib and 'Isha' prayers (some hours of the night) after the advent of the night (and at the two ends of the day) the prayers of Zuhr and 'Asr, (that thou mayst find acceptance) that you may be given the intercession and be pleased thereby.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمِنْ آنَآءِ ٱلْلَّيْلِ } معناه من سَاعاتِ الليلِ\n واحدُها آنا\n",
      "translations": [
        {
          "translation": "\nAnd His saying - exalted be He: {And from the hours of the night} its meaning is from the hours of the night.\n\n\nOne of them is us.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱصْبِرْ } يا أكمل الرسل { عَلَىٰ مَا يَقُولُونَ } إلى حلول الأجل المسمى\n ولا يضيق صدرك من قولهم: إنكَ لا تقدرُ على إتيان العذاب بمقتضى دعواك\n لذلك تخوفنا بالقيامة الموهومة\n فلو كنتَ رسولاً مثل سائر الرسل لفعلتَ بنا ما فعلوا بأممهم { وَ } إذا سمعت أقوالهم الخشنةَ أعْرضْ عنهم\n ولا تلتفت إليهم\n ولا تشغل إلى المعارضة معهم\n\n\nبل { سَبِّحْ } ونزه ربك عما يقولون من إنكار يوم الجزاء تسبيحاً مقروناً { بِحَمْدِ رَبِّكَ } شكراً لنعمائه وآلائه الواصلة إليك\n وداوم عليه { قَبْلَ طُلُوعِ ٱلشَّمْسِ } بعد انتباهك من منام غفلتك\n وقبل اشتغالك في أمور معاشك { وَقَبْلَ غُرُوبِهَا } بعد فراغك عن كسب المعاش\n وقبل استراحك بالمنام { وَمِنْ آنَآءِ ٱلْلَّيْلِ } المعدِّ للاستراحة إن أيقظتَ فيها { فَسَبِّحْ وَ } سبح أيضاً { أَطْرَافَ ٱلنَّهَارِ } إذا فرغتَ عن الاشتغال { لَعَلَّكَ تَرْضَىٰ } [طه: 130] عن الله في جميع الأوقات\n ويرضى الله فيها\n\n{ وَ } عليك الاعتزال من أبناء الدنيا وعدم الالتفات إلى لذاتهم بمتاعها ومزخرفاتها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاصبر على ما يقولون } أي: إذا كان الأمر على ما ذكرنا من أن تأخير عذابهم ليس بإهمال\n بل إمهال\n وأنه لازم لهم ألبتة\n فاصبر على ما يقولون من كلمات الكفر فإن علمه صلى الله عليه وسلم بأنهم هالكون لا محالة مما يسليه ويحمله على الصبر\n أو اصبر على ما يقولون\n واشتغل بالله عنهم\n ولا تلتفت إلى هلاكهم ولا بقائهم\n فالله أدرى بهم\n { وسَبِّحْ بحمدِ ربك } أي: نزّهه عما ينسبون إليه\n ما لا يليق بشأنه الرفيع\n حامدًا له على ما خصك به من الهدى\n معترفًا بأنه مولى النعم كلها\n قال الورتجبي: سماع الأذى يُوجب المشقة\n فأزال عنه ما كان قد لحقه من سماع ما يقولونه بقوله: { وسبح بحمد ربك } أي: إن كان سماع ما يقولون يُوحشك\n فتسبيحنا يُروحك\n هـ\n أو: صَلِّ وأنت حامد لربك\n الذي يبلغك إلى كمال هدايتك\n ويرجح هذا قوله: { قبل طُلوع الشمس وقبل غُروبها } \n فإن توقيت التنزيه غير معهود\n فإنَّ المراد بقبل طلوع الشمس: صلاة الفجر\n وقبل غروبها: صلاة الظهر والعصر\n وقيل: العصر فقط\n  { ومن أناء الليل } أي: ساعاته { فسبِّح } أي: صَلِّ\n والمراد به المغرب والعشاء\n وآناء: جمع \" إنَى \" \n بالكسر والقصر\n أو \" أناء \" بالفتح والمد\n وتقديم المجرور في قوله تعالى: { ومن آناء الليل فسبح } لاختصاصها بمزيد الفضل\n فإن القلب فيها أجمع\n والنفس إلى الاستراحة أميل\n فتكون العبادة فيها أشق\n ولذلك قال تعالى:\n[المُزمّل: 6]\n { و } سبح أيضًا\n { أطراف النهار } وهو تكرير لصلاتي الفجر والمغرب إيذانًا باختصاصهما بمزيد مزية\n وجمع أطراف بحسب اللفظ مع أمن اللبس\n أو يراد بأطراف النهار: الفجر والمغرب والظهر لأنها نهاية النصف الأول من النهار وبداية النصف الثاني\n أو يريد التطوع في أجزاء النهار\n قلت: وإذا حملناه على التنزيه - وهو أن يقول: سبحان الله\n أو: لا إله إلاّ الله\n أو كل ما يدل على تنزيه الحق - يكون تخصيص هذه الأوقات بالذكر لشرفها\n فقد وردت أحاديث في الترغيب في ذكر الله أول النهار وآخره\n وآناء الليل حين ينتبه من نومه\n بحيث يكون كلما تيقظ من نومه سبَّح الله وهلّله وكبّره\n قبل أن يعود إلى نومه\n وهكذا كان أهل اليقظة من السلف الصالح\n وقوله تعالى: { لعلك ترضى } أي: بما يعطيك من الثواب الجزيل\n بالتسبيح في هذه الأوقات\n أو ترضى بالشفاعة في جميع الخلائق\n فتقر عينك حينئذ\n\nوفي صحيح البخاري: \" إِنَّكُمْ تَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ الشمس ليس دونها سحاب\n فَإِنِ استَطَعْتُم أَلا تُغْلَبُوا عَلَى صَلاَةٍ قَبْلَ طُلُوعِ الشَّمْسِ وقَبْلَ غروبِها فافْعَلُوا \" \n ثُم تَلا هذه الآية: { وسبح بحمد ربك قبل طلوع الشمس وقبل غروبها } \n ففيه ترجيح من فسرها بالصلاة\n وفيه إشارة إلى أن الصلاة ذكر وإقبال على الله وانقطاع إليه\n وذلك مزرعة المشاهدة والرؤية في الآخرة\n وقد جاء في أهل الجنة: \" أنهم يرون ربهم بكرة وعشيًا \" \n هذا في حق العموم\n وأما خصوص الخصوص\n ففي كل ساعة ولحظة\n والله تعالى أعلم\n الإشارة: أفَلَم يَهد لأهل الإيمان والاعتبار\n وأهل الشهود والاستبصار\n كم أهلكنا قبلهم من القرون الخالية\n والأمم الماضية\n فهم يمشون في مساكنهم الدارسة\n ويُشاهدون آثارهم الدائرة\n كيف رحلوا عنها وتركوها\n واستبدلوا ما كانوا فيه من سعة القصور بضيق القبور\n وما كانوا عليه من الفُرش الممهدة بافتراش التراب وتغطية اللحود الممددة\n فيعتبروا ويتأهبوا للحوق بهم\n فقد كانوا مثلهم أو أشد منهم\n قد نما ذكرهم\n وعلا قدرهم\n وخسف بعد الكمال بدرهم\n فكأنهم ما كانوا\n وعن قريب مضوا وبانوا\n وأفضوا إلى ما قدموا\n وانقادوا قهرًا\n إلى القضاء وسلموا\n ففي ذلك عِبَر وآيات لأولي النُهى\n لكن القلوب القاسية لا ينفع فيها وعظ ولا تذكير\n فلولا كلمة الرحمة والحلم بتأخير العذاب\n وأجل مسمى لأعمارهم\n لعجل لهم العقاب\n فاصبر\n أيها المتوجه إلى الله\n المنفرد بطاعة مولاه\n على ما يقولون\n مما يُكدر القلوب\n واشتغل بذكر ربك وتنزيهه\n مع الطلوع والغروب وآناء الليل والنهار\n حتى تغيب في حضرة علام الغيوب\n لعلك ترضى بمشاهدة المحبوب\n وبالله التوفيق\n ولما كان محصل الاعتبار هو صرف الهمة عن هذه الدار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:39",
      "similarity": 0.5935286656131693
    },
    {
      "verse": "3:113",
      "similarity": 0.41274575106840944
    },
    {
      "verse": "88:5",
      "similarity": 0.394164952068613
    },
    {
      "verse": "55:44",
      "similarity": 0.3798617288285186
    },
    {
      "verse": "11:114",
      "similarity": 0.31827414467309845
    }
  ]
}