{
  "chapter": "طه",
  "text": "قال هى عصاى اتوكؤا۟ عليها واهش بها على غنمى ولى فيها مـارب اخرى",
  "translations": [
    {
      "translation": "He said, 'It is my staff. I lean on it and beat down leaves for my sheep with it and have other uses for it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It's my staff,\" he answered; \"I lean on it, and fell leaves for my goats with it, and I have other uses for it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses answered: \"This is my staff. I lean on it (when I walk), and with it I beat down leaves for my flock, and I have many other uses for it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"It is my staff. I lean on it, bring down leaves for my sheep with it and I need it for other reasons.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “This is my staff; I support myself on it, and I knock down leaves for my sheep with it, and there are other uses for me in it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"This is my stick, whereon I lean, and wherewith I beat down branches for my sheep, and wherein I find other uses.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: This is my staff: I recline on it and I beat the leaves with it to make them fall upon my sheep, and I have other uses for it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, it is my staff,' said Moses. 'I lean upon it, and with it I beat down leaves to feed my sheep; other uses also I find in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: This is my staff whereon I lean, and wherewith I bear down branches for my sheep, and wherein I find other uses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"It is my staff. I lean on it, and with it, I beat down the leaves for my flock; I also have other uses for it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: it is my staff; I lean there on; and therewith beat down fodder for my sheep; and for me therein are other purposes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘It is my staff. I lean on it, and with it I beat down leaves for my sheep; and I have other uses for it.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"It is my rod: on it I lean; with it I beat down fodder for my flocks; and in it I find other uses.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"This is my stick, whereon I lean, and wherewith I beat down branches for my sheep, and wherein I find other uses.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is my staff,\" Moses replied, \"upon it I lean and with it I beat down leaves to feed my sheep and for me there are other uses in it'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “This is my staff. I lean on it, and herd my sheep with it, and I have other uses for it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"It is my staff; I lean upon it, and I bring down leaves for my sheep and I have therein other uses.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:18] He said, ‘It is my staff. I lean, I support myself, upon it, when I leap [across something] or walk, and I beat down [leaves], I strike the leaves on trees, with it, so that they fall, for my sheep, which then consume them; and I have uses for it (ma’ārib, ‘uses’, is the plural of ma’ruba, with the rā’ taking any [one] of the three vowels [sc. ma’ruba, ma’raba or ma’riba] meaning ‘needs’) in other ways, such as [using it] to carry food supplies and waterskins, as well as to drive away [undesirable] animals. He [Moses] gives an extensive response to indicate his [many] needs for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "He said: This is my staff whereon I lean) when I am tired, (and wherewith I beat down branches for my 337 sheep, and wherein I find other uses) different other uses.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلِيَ فِيهَا مَآرِبُ أُخْرَىٰ } يعني حوائجَ\n واحدتُها مَأرُبةٌ\n ومَأربَةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Therein shall no other god be worshipped} means the necessities.\n It is a {maarubah}\n\nIt is a building.\n {and a place of} worship",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإذا عييتُ وتعبتُ { أَتَوَكَّأُ عَلَيْهَا وَ } إذا احتجت إلى هشِّ الورق\n وإسقاطه من الشجر لرعي الغنم { أَهُشُّ } وأُسط { بِهَا } ليكون علفاً { عَلَىٰ غَنَمِي وَلِيَ فِيهَا } غير ذلك { مَآرِبُ أُخْرَىٰ } [طه: 18] من الاستظلال\n ودفع الهوام\n مقاتلة العدو إلى غير ذلك\n\n\n{ قَالَ أَلْقِهَا يٰمُوسَىٰ } [طه: 19] حتى تشهد آيتنا الكبرى { فَأَلْقَاهَا } امتثالاً للأمر الإلهي { فَإِذَا هِيَ حَيَّةٌ تَسْعَىٰ } [طه: 20] تشمي علي بطنها كسائر الحيات\n فخاف وموسى منها\n وتضيق صدره من قلة رسوخه وعدم تمرنه بابتلاءات الله واختباراته\n لأنه كان في أوائل حاله\n\n{ قَالَ } سبحانه بعدما ظهرت أمارات الوجل منه: { خُذْهَا } هي عصاك يا موسى { وَلاَ تَخَفْ } من صورتها الحادثة\n فإنا من كمال قدرتنا { سَنُعِيدُهَا سِيرَتَهَا } وصورتها { ٱلأُولَىٰ } [طه: 21] التي هي في يدك\n استعنتَ بها في بعض الأمور\n وإنما بدلنا صورتها لتتنبه على أن لنا القدرة على إحياء الجمادات التي هي أبعد بمراحل عن إهداء الضالين من الأحياء\n\n\n{ وَٱضْمُمْ يَدَكَ إِلَىٰ جَنَاحِكَ تَخْرُجْ بَيْضَآءَ } ذات شعاعٍ محيٍّرٍ للعقول والأبصار { مِنْ غَيْرِ سُوۤءٍ } أي: من غير حجاب يسترها وينُقص من نورها\n لتكون { آيَةً أُخْرَىٰ } [طه: 22] لك أجلى من الآية السابقة\n\n\nوإنما أريناك الآيات قبل إرسالك من أرسلناك { لِنُرِيَكَ } أولاً { مِنْ آيَاتِنَا ٱلْكُبْرَىٰ } [طه: 23] فيطمئن بها قلبك\n ويقوى ظهرك بإمدادنا لك في رسالتك\n وتأييدنا إياك فيها\n\n\nفإذا اطمئن قلبك وقوي ظهرك { ٱذْهَبْ } أيها الهادي بإهدائنا وتوفيقنا نيابةً عنا { إِلَىٰ فِرْعَوْنَ } الضال المستغرق في بحر العتو والعناد { إِنَّهُ طَغَىٰ } [طه: 24] أي: ظهر علينا مستكبراً بقوله للضعفة:\n[النازعات: 24] فبلِّغ إنذاراتنا وتخويفاتنا\n وزد عليها الدلائل العقلية والنقلية والكشفية\n لعله يتنبه بها\n وينزجر بسببها عما عليه من العتو والعناد\n\n\nوبعدما سمع موسى خطاب الله إياه { قَالَ } مشمِّرَ الذيل إلى الذهاب طالباً التوفيق من رب الأرباب: { رَبِّ } يا من ربَّاني بأنواع اللطف والكرم\n وأعطائي الآيتين الكريمتين العظيمتين\n لتكوننا شاهدين على صدقي في دعواي { ٱشْرَحْ لِي صَدْرِي } [طه: 25] أي: وسِّع لبي\n بحيث لا يخطر ببالي خوفُ من العدو أصلاً\n\n\n{ وَ } مع ذلك { يَسِّرْ } وسهِّل { لِيۤ أَمْرِي } [طه: 26] هذا\n بحيث لا أضطربُ في تبليغه\n ولا أستوحشُ من جاه فرعون وشوكته\n\n\n{ وَ } إذا شرعُت لأداء الرسالة { ٱحْلُلْ } وارفع لكنةً عارضةً من مهابة العدو\n سيما هذا الطاغي { عُقْدَةً مِّن لِّسَانِي } [طه: 27] كي { يَفْقَهُواْ قَوْلِي } [طه: 28] وغرضي منها\n\n\n{ وَ } إذا أوقعتني لأداء رسالتك يا ربي { ٱجْعَل لِّي وَزِيراً } ظهيراً\n يصدِّقني في أمري\n ويعينني عليه\n ولا تجعل ظهيري من الأجانب\n لقلة شفقتهم عليَّ وعطفهم بي\n بل اجعله { مِّنْ أَهْلِي } [طه: 29] وأقربائي أولى\n وهو { هَارُونَ } إذ هو { أَخِي } [طه: 30] الأكبر بمنزلة الأب في الشفقة\n وإذا جعلتَ هارون وزيري { ٱشْدُدْ بِهِ } أي: أقوِّ وأحكم بسببه يا معيني ومغيثي { أَزْرِي } [طه: 31] أي: ظهري { وَ } لا يتحقق تقويته على حقيقته إلا بعد اشتراك معي في أداء الرسالة { أَشْرِكْهُ } يا ربي { فِيۤ أَمْرِي } [طه: 32] ورسالتي\n بأن تنكشف عليه كما انكشفت لي\n ليكون من المكاشفين\n الموقنين بوحدانيتك يا ربي\n الممتثلين بأوامرك\n المجتنبين عن نواهيك\n\n\nوإنما سأتلك يا ربي الإعانة بأخي { كَيْ نُسَبِّحَكَ } ونقدَس ذاتَك عما لا يليق بشأنك تقديساً { كَثِيراً } [طه: 33]\n\n\n{ وَنَذْكُرَكَ } ونناجيك بأسمائك الحسنى وصفاتك العظمى ذكراً { كَثِيراً } [طه: 34]\n\n\nوكيف لا نسبحك ونَذْكُرِك { إِنَّكَ } بذاتك وأوصافك وأسماءك { كُنتَ } محيطاً { بِنَا بَصِيراً } [طه: 35] بجمع أحوالنا\n\n\n{ قَالَ } تعالى رفقاً له وامتناناً عليه\n لرجوعه إليه بالكلية: { قَدْ أُوتِيتَ سُؤْلَكَ } أي: قد حصل لك جمع مطالبك\n لتوجهك علينا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أتوكأ عليها } أي: أعتمد عليها إذا مشيت، وعند الإعياء، والوقوف على رأس قطيع الغنم، { وأهشُّ } أي: أخبط { بها } الورق من الشجر ليسقط { على غنمي } فتأكله\n وقرئ بالسين، وهو زجر الغنم، تقول العرب: هَس هَس، في زجرها، وعداه بعلى لتضمنه معنى الإقبال والتوجه\n { ولِيَ فيها مآرِبُ أُخرى } أي: حاجات أخرى من هذا الباب\n قال ابن عباس: كان موسى عليه السلام يحمل عليها زاده وسقاءه، فجعلت تأتيه وتحرسه، ويضرب بها الأرض فتخرج ما يأكل يومَه، ويركز بها فيخرج الماء، فإذا رفعها ذهب، وكان يرد بها عن غنمه ونعمه الهوام بإذن الله، وإذا ظهر له عدو حاربت وناضلت عنه، وإذا أراد الاستسقاء من البئر أَدْلاَهَا، فطالت على طول البئر وصارت شعبتاها كالدول فيستقي بها، وكان يظهر على شعبتيها كالشمعتين بالليل فيستضيء بها، وإذا اشتهى ثمرة ركزها فتغصّنت غصن تلك الشجرة، وأورقت وأثمرت\n فهذه المآرب\n وكأنه عليه السلام فهم أن المقصود من السؤال بيان حقيقتها، وتفصيل منافعها بطريق الاستقصاء، فلذلك أطنب في كلامه، فلما بدت منها خوارق بديعة عَلِمَ أنها آية باهرة ومعجزات قاهرة، وأيضًا: الإطناب في مناجاة الأحباب محمود\n { قال } له تعالى: { ألْقِهَا يا موسى } لترى من شأنها ما لم يخطر ببالك، قيل: إنما أُمِر بإلقائها قطعًا للسكون إليها، لِمَا كان فيها من المآربِ، وبالغ الحق تعالى في ذلك بقلبها حية، حتى خاف منها، وحين قطعه عنها، وأخرجها من قلبه، بالفرار منها ردها إليه بقوله: { خذها ولا تخف } { فألقاها } على الأرض { فإِذا هي حيةٌ تَسْعَى } ، رُوي أنه عليه السلام ألقاها فانقلبت حية صفراء، في غلظ العصا، ثم انتفخت وعظمت، فلذلك شبهت بالجان تارة، وبالثعبان مرة أخرى، وعبَّر عنها هنا بالاسم العام للحالين، وقيل: انقلبت من أول الأمر ثعبانًا، وهو أليق بالمقام، كما يفصح عنه قوله عزّ وجلّ:\n\n\n\n[الأعرَاف: 107]، وإنما سميت بالجان في الجلادة وسرعة المشي، لا في صغر الجثة\n وقيل: الجان عبارة عن ابتداء حالها، والثعبان عن انتهائه\n { قال } تعالى: { خُذها } يا موسى، { ولا تخفْ } ، قال ابن عباس رضي الله عنه: انقلبت ثعبانًا ذَكَرًا، يبتلع كل شيء من الصخر والشجر، فلما رآه كذلك خاف ونفر، ولحقه ما يلحق البشر عند مشاهدة الأهوال من الخوف والفزع، إذ لا يلزم من ثبوت الخصوصية عدم وصف البشرية\n { سنعيدُها سِيرَتَها الأولى } أي: سنعيدها، بعد الأخذ، إلى حالتها الأولى التي كانت عليها عصًا، قيل: بلغ عليه السلام عند ذلك من الثقة وعدم الخوف إلى حيث كان يدخل يده في فمها، ويأخذ بلَحْيَيْهَا\n فلما أخذها عادت عصًا، وحكمة قلبها وأخذها هنا ليكون معها على ثقة عند مخاصمة فرعون، وطمأنينةٍ من أمره، فلا يعتريه شائبة دهش ولا تزلزل\n والسيرة: فعلة من السير، يجوز بها إلى الطريقة والهيئة، وانتصابها على نزع الخافض\n ثم أراه معجزة أخرى، فقال: { واضممْ يدكَ إِلى جناحك } أي: أدخلها تحت عضدك، فجناح الإنسان: جنباه، مستعار من جناح الطير، { تخرجْ بيضاءَ }: جواب الأمر، أي: إن أدخلتها تخرج بيضاء شعاعية، { من غير سُوءٍ } أي: حال كونها كائنة من غير عيب بها كبرص ونحوه\n رُوي أنه عليه السلام كان آدم اللون، فأخرج يده من مدرعته بيضاء، لها شعاع كشعاع الشمس، تضيء حال كونها { آيةً أخرى } أي: معجزة أخرى غير العصا، { لنُرِيَك من آياتنا الكبرى } أي: فعلنا ما فعلنا، لنريك بعض أياتنا العظمى، أو: لنريك الكبرى من آياتنا\n قال ابن عباس: \" كانت يد موسى أكبر آياته \"\n والله تعالى أعلم\n الإشارة: يقال للفقير: وما تلك بيمينك أيها الفقير؟ فيقول: هي دنياي أعتمد عليها في معاشي وقيام أموري، وأُنفق منها على عيالي، ولي فيها حوائج أخرى من الزينة والتصدق وفعل الخير، فيقال له: ألقها من يدك أيها الفقير، واخرج عنها، أو أخرجها من قلبك إن تيسر ذلك مع الغيبة عنها، فألقاها وخرج عنها، فيلقيها، فإذا هي حية كانت تلدغه وتسعى في هلاكه وهو لا يشعر\n فلما تمكن من اليقين، وحصل على غاية التمكين، قيل له: خذها ولا تخف منها، حيث رفضت الأسباب، وعرفت مسبب الأسباب، فاستوى عندك وجودها وعدمها، ومنعها وإعطاؤها، سنعيدها سيرتها الأولى، تأخذ منها مأربك، وتخدمك ولا تخدمها\n يقول الله تعالى:\n\n \" يا دنياي، اخدمي من خدمني، وأتعبي من خدمك \"\n \n\nوأما قوله تعالى: في حديث آخر مرفوعًا:\n\n \" تمرري على أوليائي ولا تحلو لهم فتفتنهم عني \" \n\n، فالمراد بالمرارة: ما يصيبهم من الأهوال والأمراض وتعب الأسفار، وإيذاء الفجار وغير ذلك\n\n\nوقد يلحقهم الفقر الظاهر شرفًا لهم، لقوله صلى الله عليه وسلم:\n\n \" الفقر فخري وبه أفتخر \" \n\n، أو كما قال عليه السلام إن صح\n وقال شيخنا البوزيدي رضي الله عنه: الحديث الأول: في الصالحين المتوجهين من أهل الظاهر، والثاني - يعني تمرري\n\n\n الخ - في الأولياء العارفين من أهل الباطن\n هـ\n ويقال له أيضًا - إن تجرد وألقى الدنيا من يده وقلبه -: اضمم يدَ فكرتك إلى قلبك، تخرج بيضاء نورانية صافية، لا تخليط فيها ولا نقص، هي آية أخرى، بعد آية التجريد والصبر على مشاقه\n وقال في اللباب: اليد: يدَ الفكر، والجيب: جيب الفهم، وخروجها بيضاء بالعرفان\n هـ\n قال الورتجبي: أرى الله موسى من يده أكبر آية، وذلك أنه ألبس أنوار يد قدرته يد موسى، فكان يَدُ موسى يدَ قدرة الله، من حيث التخلق والاتصاف، كما في حديث:\n\n \" كنت له سمعًا وبصرًا ولسانًا ويدًا \" \n\nهـ\n وبالله التوفيق\n ثمَّ ذكر ابتداء رسالة موسى عليه السلام\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:31",
      "similarity": 0.2363491359761357
    },
    {
      "verse": "48:19",
      "similarity": 0.11538739285618631
    },
    {
      "verse": "8:69",
      "similarity": 0.11280280104841854
    },
    {
      "verse": "4:94",
      "similarity": 0.10909453829066788
    },
    {
      "verse": "48:20",
      "similarity": 0.10804558578246264
    }
  ]
}