{
  "chapter": "طه",
  "text": "فوسوس اليه الشيطن قال يـادم هل ادلك على شجرة الخلد وملك لا يبلى",
  "translations": [
    {
      "translation": "But Shaytan whispered to him, saying, 'Adam, shall I show you the way to the Tree of Everlasting Life and to a kingdom which will never fade away?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But then Satan tempted him by saying: \"O Adam, should I show you the tree of immortality, and a kingdom that will never know any wane?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan seduced him, saying: \"Adam! Shall I direct you to a tree of eternal life and an abiding kingdom?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan, trying to seduce him, said, \"Adam, do you want me to show you the Tree of Eternity and the Everlasting Kingdom?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the devil incited him, saying, “O Adam, shall I show you the tree of immortality and a kingdom that does not erode?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Shaytan whispered to him, saying: \"O Adam! Shall I lead you to the Tree of Eternity and to a kingdom that will never waste away\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Shaitan made an evil suggestion to him; he said: O Adam! Shall I guide you to the tree of immortality and a kingdom which decays not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan whispered to him saying, 'Adam, shall I point thee to the Tree of Eternity, and a Kingdom that decays not?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the devil whispered to him, saying: O Adam! Shall I show thee the tree of immortality and power that wasteth not away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan whispered evil to him, saying, \"Adam, shall I lead you to the tree of immortality and to a kingdom that never declines?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Satan whispered unto him; he said: Adam! shall direct thee to the tree of eternity and a dominion that ageth not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan tempted him. He said, ‘O Adam! Shall I show you the tree of immortality, and an imperishable kingdom?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan whispered evil to him: he said, \"O Adam! shall I lead thee to the Tree of Eternity and to a kingdom that never decays?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Shaitan (Satan) whispered to him, saying: \"O Adam! Shall I lead you to the Tree of Eternity and to a kingdom that will never waste away?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But satan whispered to him saying: 'Adam, shall I direct you the Tree of Eternity and a kingdom which never decays'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan whispered to him. He said, “O Adam, shall I show you the Tree of Immortality, and a kingdom that never decays?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan whispered to him; he said, \"O Adam, shall I direct you to the tree of eternity and possession that will not deteriorate?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:120] Then Satan whispered to him saying, ‘O Adam, shall I guide you to the Tree of Immortality, which gives everlasting life to the one who eats thereof, and a kingdom that does not waste away?’, that does not perish while he remains immortal.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But the Devil whispered to him) to eat of the tree, (saying: O Adam! Shall I show thee the tree of immortality) whoever eats from it will live for ever and shall never die (and power that wasteth not away) and will remain holding on to a power that will never cease?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لم يقدر على إضلالهما { فَوَسْوَسَ إِلَيْهِ ٱلشَّيْطَانُ } أي: ألقى وسوسته في نفسه و { قَالَ يٰآدَمُ } على وجه النصيحة: هنيئاً لك عيشك في الجنة بلا تعب ومحنة { هَلْ أَدُلُّكَ عَلَىٰ شَجَرَةِ ٱلْخُلْدِ } إن أكلت منها يخلدك أبداً فيها { وَ } أهديك على { مُلْكٍ لاَّ يَبْلَىٰ } [طه: 120] أي: لا يخلق ولا يعتق\n بل يتجدد دائماً بتجدد الأمثال\n بلا انتقالٍ وزوالٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { فوسوس إِليه الشيطانُ } أي: أنهى إليه وسوسته، أو أسرها إليه، { قال } فيها: { يا آدمُ هل أدلُّكَ على شجرة الخُلْدِ }؟ أي: شجرة من أكل منها خلد، ولم يمت أصلاً، سواء كان على حاله، أو بأن يكون ملكًا، { و } أدلك على { مُلكٍ لا يَبْلَى } أي: لا يفنى ولا يزول، ولا يَخْتَلُّ بوجه من الوجوه، { فأكلا منها فبدتْ لهما سوآتُهما } قال ابن عباس رضي الله عنه: عَريا عن النور الذي كان الله تعالى ألبسهما، حتى بدت فروجهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:20",
      "similarity": 0.6283827040708927
    },
    {
      "verse": "114:5",
      "similarity": 0.5650650783974587
    },
    {
      "verse": "50:16",
      "similarity": 0.4086807098678529
    },
    {
      "verse": "61:10",
      "similarity": 0.35774914455801554
    },
    {
      "verse": "25:45",
      "similarity": 0.3375074388611927
    }
  ]
}