{
  "chapter": "طه",
  "text": "فلا يصدنك عنها من لا يؤمن بها واتبع هوىه فتردى",
  "translations": [
    {
      "translation": "Do not let those who have no iman in it and follow their whims and desires debar you from it or you will be destroyed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not let those who do not believe in it and follow their vain desires, turn you away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let him who does not believe in it and follows his lust not turn your thought away from it, lest you are ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not the unbelievers who follow their vain desires make you forget the Day of Judgment, lest you will perish.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore never let one, who does not accept faith in it and follows his own desires, prevent you from accepting this, so then you become ruined.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, let not the one who believes not therein, but follows his own lusts, divert you therefrom, lest you perish.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore let not him who believes not in it and follows his low desires turn you away from it so that you should perish;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let none bar thee from it, that believes not in it but follows after his own caprice, or thou wilt perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor, let not him turn thee aside from (the thought of) it who believeth not therein but followeth his own desire, lest thou perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let anyone who does not believe in it and follows his own desires turn you away from it and so bring you to ruin.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let not him who believeth not therein and followeth his own desire keep thee away therefrom lest thou perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not let yourself be distracted from it by those who do not believe in it and who follow their desires, or you will perish.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore let not such as believe not therein but follow their own lusts, divert thee therefrom, lest thou perish!\"..\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, let not the one who believes not therein (i.e. in the Day of Resurrection, Reckoning, Paradise and Hell, etc.), but follows his own lusts, divert you therefrom, lest you perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let those who disbelieve in it and follow their desires bar you from it, or you will perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not let him who denies it and follows his desire turn you away from it, lest you fall.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not let one avert you from it who does not believe in it and follows his desire, for you [then] would perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:16] So do not let him bar you, distract you, from it, that is, from believing in it, who believes not in it but follows his own whim, in denying [the truth of] it, lest you perish, that is, lest you be ruined if you are barred from [remembering] it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَلَا يَصُدَّنَّكَ عَنْهَا مَنْ لَا يُؤْمِنُ بِهَا وَاتَّبَعَ هَوَاهُ فَتَرْدَى (16)وفُرع على كونها آتية وأنها مخفاة التحذيرُ من أن يصدّه عن الإيمان بها قوم لا يؤمنون بوقوعها اغتراراً بتأخر ظهورها ، فالتفريع على قوله أكاد أُخفيها } أوقع لأنّ ذلك الإخفاء هو الذي يُشبّه به الذين أنكروا البعث على الناس ، قال تعالى : { فسينغضون إليك رؤوسهم ويقولون متى هو قل عسى أن يكون قريباً } \\[ الإسراء : 51 \\] وقال : { وإذا قيل إن وعد الله حق والساعة لا ريب فيها قلتم ما ندري ما الساعة إن نظن إلا ظناً وما نحن بمستيقنين } \\[ الجاثية : 32 \\].وصيغ نهي موسى عن الصدّ عنها في صيغة نهي من لا يؤمن بالساعة عن أن يصدّ موسى عن الإيمان بها ، مبالغة في نهي موسى عن أدنى شيء يحول بينه وبين الإيمان بالساعة ، لأنه لما وجّه الكلام إليه وكان النّهي نهي غير المؤمن عن أن يصدّ موسى ، عُلم أنّ المراد نهي موسى عن ملابسة صدّ الكافر عن الإيمان بالساعة ، أي لا تكن ليّن الشكيمة لمن يصدك ولا تُصْغ إليه فيكون لينك له مجرئاً إياه على أن يصدك ، فوقع النهي عن المسبب .والمراد النهي عن السبب ، وهذا الأسلوب من قبيل قولهم : لا أعرفنّك تفعل كذا ولا أرَينّك ههنا .وزيادة { واتَّبَعَ هَواه } للإيماء بالصلة إلى تعليل الصدّ ، أي لا داعي لهم للصدّ عن الإيمان بالساعة إلا اتّباع الهوى دون دليل ولا شبهة ، بل الدليل يقتضي الإيمان بالساعة كما أشار إليه قوله { لِتُجزى كلُّ نفسسٍ بما تَسعى }.وفرع على النهي أنّه إن صُدّ عن الإيمان بالساعة رَدِيَ ، أي هلك . والهلاك مستعار لأسْوأ الحال كما في قوله تعالى : { يهلكون أنفسهم } في سورة براءة ( 42 ).والتفريع ناشىء عن ارتكاب المنهِي لا على النهي ، ولذلك جيء بالتفريع بالفاء ولم يقع بالجزاء المجزوم ، فلم يقل : تَرْدَ ، لعدم صحة حلول ( إنْ ) مع ( لا ) عوضاً عن الجزاء ، وذلك ضابط صحة جزم الجزاء بعد النّهي .وقد جاء خطاب الله تعالى لموسى عليه السلام بطريقة الاستدلال على كلّ حكممٍ ، وأمرٍ أو نهي ، فابتدىء بالإعلام بأنّ الذي يُكلمه هو الله ، وأنه لا إله إلاّ هو ، ثمّ فرع عليه الأمر في قوله فاعْبُدني وأقِممِ الصلاة لِذِكري } ، ثم عقب بإثبات الساعة ، وعلل بأنها لتجزى كلّ نفس بما تسعى ، ثم فرع عليه النهي عن أن يصده عنها من لا يؤمن بها . ثم فرع على النهي أنه إن ارتكب ما نهي عنه هلك وخسر .\n\n",
      "translations": [
        {
          "translation": "(Therefore, let not him turn thee aside from it) so let him not bar you from believing in it he (who believeth not therein but followeth his own desire) through denial and worship of idols, (lest thou perish).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱتَّبَعَ هَوَاهُ فَتَرْدَىٰ } معناه فَتَهلَكَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd he followed his own desires, so he was led astray.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فلا يصدّنك عنها } فتبقى في حجاب الصفات { من لا يؤمن بها } لقصور استعداده فيقف في بعض المراتب محجوباً إما بالصفات أو الأفعال أو الآثار أو الأنداد\n أي: الشرك الخفيّ والجليّ { واتّبع هواه } في مقام النفس أو القلب\n فإن الهوى باق ببقاء الأنائية فتهلك أنت كما هلك من صدّك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا كان الأمر كذلك { فَلاَ يَصُدَّنَّكَ عَنْهَا } أي: فلا يصرفك عن الأم بالانكشاف التام إعراضُ { مَن لاَّ يُؤْمِنُ بِهَا } تقليداً\n حتى يطلبها تحقيقاً\n بل أنكرها وأعرضَ عنها { وَٱتَّبَعَ هَوَاهُ } المضلةُ في تيه الغفلة والحرمان { فَتَرْدَىٰ } [طه: 16] فتهلك بداء الجهل والخذلان\n\n\nوإذ اخترناك للرسالة العامة\n وهبنا لك شاهداً أصدق على دعواك الرسالة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلا يَصُدَّنك عنها } أي: عن ذكر الساعة ومراقبتها والاستعداد لها { مَن لا يؤمن بها } حتى تكسَل عن التزود لها\n والنهي - وإن كان بحسب الظاهر متوجهًا للكافر عن صدر موسى عليه السلام - لكنه في الحقيقة نهى له عليه السلام عن الانصداد عنها\n على أبلغ وجه\n فإنَّ النهي عن أسباب الشيء المؤدية إليه نهي عنه بالطريق البرهاني\n كقوله تعالى:\n[هُود: 89]\n أي: لا تتبع في الصد عنها من لا يؤمن بها { واتَّبعَ هواه } أي: ما تهواه نفسه من اللذات الفانية\n { فَتَرْدَى }: فتهلك فإنَّ الإغفال عنها\n وعن تحصيل ما يُنجي من أهوالها\n مستتبع للهلاك لا محالة\n وبالله التوفيق\n الإشارة: وهل أتاك أيها العارف حديث موسى\n كيف سار إلى نور الحبيب\n ومناجاة القريب\n إذ رأى نارًا في مرأى العين\n وهو نورُ تَجَلِّي الحبيب بلا بين\n فقال لأهله ومن تعلق به: امكثوا\n أقيموا في مقام الطلب\n واصبروا وصابروا ورابطوا على قلوبكم\n في نيل المُطَّلَبِ\n إني آنست نارًا\n وهو نور وجه الحبيب في مرائي تجلياته\n وهذا مقام الفناء\n لعلي آتيكم منها بقبس\n تقتبسون منه أنوارًا لقلوبكم وأسراركم\n\nأو أجد على النار هدى يهديني إلى مقام البقاء والتمكين\n فلما أتاها\n وتمكن من شهودها\n نودي يا موسى: إني أنا ربك\n فلا نار ولا أثر\n وإنما وجه الحبيب قد تجلى وظهر\n في مرأى الأثر\n فاخلع نعليك\n أي: اخرج عن الكونين إن أردت شهود حضرة المكون\n كما قال القائل:\nإنك بالواد المقدس\n أي: بحر حضرة القدس ومحل الأنس\n قد طويت عنك الأكوان\n وأبصرت نور الشهود والعيان\n وأنا اخترتك لحضرتي\n واصطفيتك لمناجاتي\n فاستمع لما يوحى إليك مني\n فأنا الله لا إله إلا أنا وحدي\n فإذا تمكنت من شهودي\n فانزل لمقام العبودية شكرًا\n وأقم الصلاة لذكري\n إن الساعة آتية لا محالة\n فأُكرم مثواك\n وأُجل منصبك\n وأرفعك مع المقربين\n فلا يصدنك عن مقام الشهود أهلُ العناد والجحود\n فتسقط عن مقام القرب والأنس\n وتصير في جوار أهل حجاب الحس\n ولعل هذا المنزع هو الذي انتحى ابنُ الفارض\n حيث قال في كلام له:\nقوله: \" صارت جبالي دكًّا \" أي: جبال وجوده\n فحصل الزوال من هيبة نور المتجلي\n وهو الكبير المتعال\n وهذا إنما يكون بعد موت النفس وقهرها\n فإنها حينئذ تحيا بشهود ربها\n حياة لا موت بعدها\n وقوله: \" مذ صار بعضي كلي \" \n يعني: إنما حصلت له المناجاة والقرب الحقيقي حين فنيت دائرة حسه\n فاتصل جزء معناه بكل المعنى المحيط به\n وهو بحر المعاني المُفني للأواني\n وبالله التوفيق\n ثمَّ ذكر مكالمته مع كليمه موسى عليه السلام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:11",
      "similarity": 0.7793228906389048
    },
    {
      "verse": "41:23",
      "similarity": 0.7236143492526513
    },
    {
      "verse": "37:56",
      "similarity": 0.5980939852055306
    },
    {
      "verse": "6:137",
      "similarity": 0.5701868219043619
    },
    {
      "verse": "30:29",
      "similarity": 0.22568957594718989
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}