{
  "chapter": "طه",
  "text": "يومئذ يتبعون الداعى لا عوج له وخشعت الاصوات للرحمن فلا تسمع الا همسا",
  "translations": [
    {
      "translation": "On that day they will follow the Summoner who has no crookedness in him at all. Voices will be humbled before the All-Merciful and nothing but a whisper will be heard.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That day they will follow the summoner from whom there will be no receding; and their voices will be hushed before Ar-Rahman, and you will not hear a sound but faint shuffling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day people shall follow straight on to the call of the summoner, no one daring to show any haughtiness. Their voices shall be hushed before the Most Compassionate Lord, so that you will hear nothing but a whispering murmur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day they will follow their caller without deviation. Their voices will be low in the presence of the Beneficent God. You will hear nothing but the tread of the marching feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day they will run after a caller, there will be no deviation in it; and voices shall become hushed before the Most Gracious, so you will not hear except a faint sound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day mankind will follow strictly (the voice of) Allah's caller, no crookedness (that is without going to the right or left of that voice) will they show him (Allah's caller). And all voices will be humbled for the Most Gracious (Allah), and nothing shall you hear except Hamsa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day they shall follow the inviter, there is no crookedness in him, and the voices shall be low before the Beneficent Allah so that you shall not hear aught but a soft sound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day they will follow the Summoner in whom is no crookedness; voices will be hushed to the All-merciful, so that thou hearest naught but a murmuring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day they follow the summoner who deceiveth not, and voices are hushed for the Beneficent, and thou hearest but a faint murmur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day all will follow the summoning voice from which there is no escape; and all voices will be hushed before the Lord of Mercy, and nothing will be heard except a subdued murmur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day they shall follow the caller for Whom there shall be no crookedness; and voices Shall be humbled for the Compassionate; so that thou shalt not hear ought except pattering\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day they will follow the summoner without zigzagging. Their voices will be muted before the All-beneficent, and you will hear nothing but a murmur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day will they follow the Caller (straight): no crookedness (can they show) him: all sounds shall humble themselves in the Presence of (Allah) Most Gracious: nothing shalt thou hear but the tramp of their feet (as they march).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day mankind will follow strictly (the voice of) Allah's caller, no crookedness (that is without going to the right or left of that voice) will they show him (Allah's caller). And all voices will be humbled for the Most Beneficent (Allah), and nothing shall you hear but the low voice of their footsteps.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, they will follow the Summoner, who is not crooked, their voices hushed before the Merciful, and you shall hear nothing except a murmuring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, they will follow the caller, without any deviation. Voices will be hushed before the Merciful, and you will hear nothing but murmur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day, everyone will follow [the call of] the Caller [with] no deviation therefrom, and [all] voices will be stilled before the Most Merciful, so you will not hear except a whisper [of footsteps].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:108] On that day, that is, on the day the mountains are scattered as ashes, they will follow, that is, mankind [will follow], after rising from their graves, the Summoner, to the Gathering, by [the call of] his voice — this [Summoner] will be [the archangel] Isrāfīl, and he will say: ‘Forward to the parade before God!’ — there will be no deviation therein, that is, in the manner in which they follow [him], in other words, they cannot but follow [him]. Voices will be hushed, will become silent, before the Compassionate One, so that you hear nothing but a faint shuffle, the light tread of feet walking towards the Gathering, similar to the sound of the hoofs of camels as they pass.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَوْمَئِذٍ يَتَّبِعُونَ الدَّاعِيَ لَا عِوَجَ لَهُ وَخَشَعَتِ الْأَصْوَاتُ لِلرَّحْمَنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا (108) جملة { يتبعون الدّاعي } في معنى المفرعة على جملة { يَنسِفُهَا } \\[ طه : 105 \\]. و { يَوْمَئِذٍ } ظرف متعلق ب { يَتَّبِعُونَ الدَّاعِيَ }. وقدم الظرف على عامله للاهتمام بذلك اليوم ، وليكون تقديمه قائماً مقام العَطف في الوصل ، أي يتبعون الداعي يوم ينسف ربّك الجبال ، أي إذا نسفت الجبال نودوا للحشر فحضروا يتبعون الداعي لذلك .والداعي ، قيل : هو المَلك إسرافيل عليه السلام يدعو بنداء التسخير والتكوين ، فتعود الأجساد والأرواح فيها وتهطع إلى المكان المدعوّ إليه . وقيل : الداعي الرسول ، أي يتبع كلّ قوم رسولهم .و { عِوَجَ لَهُ } حال من { الدَّاعِيَ }. واللام على كلا القولين في المراد من الداعي للأجْل ، أي لا عوج لأجل الداعي ، أي لا يروغ المدعوون في سيرهم لأجل الداعي بل يقصدون متجهين إلى صَوبه . ويجيء على قول من جعل المراد بالداعي الرسول أن يرَاد بالعوج الباطل تعريضاً بالمشركين الذين نسبوا إلى الرسول صلى الله عليه وسلم العِوج كقولهم { إن تتبعون إلاّ رجلاً مسحوراً } \\[ الفرقان : 8 \\] ، ونحو ذلك من أكاذيبهم ، كما عُرض بهم في قوله تعالى : { الذي أنزل على عبده الكتاب ولم يجعل له عوجاً } \\[ الكهف : 1 \\].فالمصدر المنفي أريد منه نفي جنس العوج في اتباع الداعي ، بحيث لا يسلكون غير الطريق القويم ، أو لا يسلك بهم غير الطريق القويم ، أو بحيث يعلمون براءة رسولهم من العِوج .وبيْن قوله { لا ترى فيها عوجاً } \\[ طه : 107 \\] وقوله { لا عِوَج له } مراعاة النظير ، فكما جعل الله الأرض يومئذ غير معوجة ولا ناتئة كما قال { فإذا هم بالساهرة } \\[ النازعات : 14 \\] كذلك جعل سير النّاس عليها لا عوج فيه ولا مراوغة .والخشوع : الخضوع ، وفي كلّ شيء من الإنسان مظهر من الخشوع؛ فمظهر الخشوع في الصوت : الإسرار به ، فلذلك فرع عليه قوله { فلا تسمع إلاّ همساً }.والهمس : الصوت الخفيّ .والخطاب بقوله { لا ترى فيها عوجاً وقوله فلا تسمع إلا همساً خطاب لغير معين ، أي لا يرى الرائي ولا يسمع السامع .وجملة وخَشَعَتتِ الأصوَاتُ } في موضع الحال من ضمير { يتّبعون وإسناد الخشوع إلى الأصوات مجاز عقلي ، فإن الخشوع لأصحاب الأصوات؛ أو استعير الخشوع لانخفاض الصوت وإسراره ، وهذا الخشوع من هول المقام .\n\n",
      "translations": [
        {
          "translation": "(On that day) which is the Day of Judgement (they follow the summoner) they will all rush and go to the summoner (who deceiveth not) they will turn neither to the right nor to the left, (and voices are hushed for the Beneficent) out of awe for the Beneficent, (and thou hearest) O Muhammad (but a faint murmur). 346\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ تَسْمَعُ إِلاَّ هَمْساً } معناه كلامٌ خَفي\n ويقال: نَقلُ الأَقْدامِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {So listen not to the disbelievers, but only to a Whisper } its meaning is a hidden speech.\n It is said: \"The transfer of the feet\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أي: يجتمعون عنده كل واحد منهم بطريق { لاَ عِوَجَ لَهُ } لاستواء الأرض\n وعدم المانع من العقباب والأغوار { وَ } في ذلك اليوم { خَشَعَتِ ٱلأَصْوَاتُ } أي: خفضت وخفيت أصواتهم وقت الدعاء { لِلرَّحْمَـٰنِ } من شدة أهوال ذلك اليوم\n بحيث إذا أصغيت إلى سماع أقوالهم { فَلاَ تَسْمَعُ إِلاَّ هَمْساً } [طه: 108] ذِكراً خفياً\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يومئذ } أي: يوم إذ نسفت الجبال\n { يتبعون الداعيَ } أي: يتبع الناسُ داعي الله تعالى إلى المحشر\n وهو إسرافيل عليه السلام\n يدعو الناس بعد النفخة الثانية\n قائمًا على صخرة بيت المقدس: أيها الناس هلموا إلى ربكم\n بعد أن يدعوهم إلى الخروج من قبورهم\n قائلاً: أيتها العظام النخرة\n والأوصال المتمزقة\n واللحوم المتفرقة قوموا إلى العرض والحساب\n فَيُقبلون من كل جانب منتشرين\n كأنهم جراد منتشر\n لا يدرون أين يذهبون\n فَيُنادي حينئذ من الصخرة للجمع للحساب\n هذا ما تدل عليه الأحاديث والأخبار\n وقوله تعالى: { لا عِوَجَ له } أي: لا يعوجُ له مدعو ولا يعدل عنه\n فلا يزيغ عنه\n بل كلهم يقصدون صوته\n من مشارق الأرض ومغاربها وجوانبها\n والتقدير: لا عوج للصوت عن أحد\n بل يصل إليه أينما كان\n ويتوجه إليه حيث كان\n { وخشعتِ الأصواتُ للرحمن } أي: خضعت وسكنت لهيبته { فلا تسمع إلا همسًا } أي: صوتًا خفيًا\n والهمس: صوت وطء الأقدام في نقلها إلى المحشر\n أي\n انقطعت أصوات اللسان\n فلا تسمع إلا همس الأقدام في مشيها إلى المحشر\n من شدة الهيبة والخوف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "49:2",
      "similarity": 0.21732558230780125
    },
    {
      "verse": "31:19",
      "similarity": 0.17716490893826561
    },
    {
      "verse": "49:3",
      "similarity": 0.16740949729928384
    },
    {
      "verse": "17:64",
      "similarity": 0.15097803933703463
    },
    {
      "verse": "18:1",
      "similarity": 0.14431493941776619
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020108.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020108.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:108.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}