{
  "chapter": "طه",
  "text": "فقلنا يـادم ان هذا عدو لك ولزوجك فلا يخرجنكما من الجنة فتشقى",
  "translations": [
    {
      "translation": "So We said; \"O Adam, he is truly your enemy and your wife's. Do not let him have you turned out of Paradise and come to grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We said: \"Adam! He is an enemy to you and to your wife. So let him not drive both of you out of Paradise and plunge you into affliction,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Adam, this (satan) is your enemy and the enemy of your spouse. Let him not expel you and your spouse from Paradise lest you plunge into misery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore said, “O Adam, he is your and your wife’s enemy, so may he not get you both out from heaven, so you then fall into hardship.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We said: \"O Adam! Verily, this is an enemy to you and to your wife. So let him not get you both out of Paradise, so that you will be distressed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We said: O Adam! This is an enemy to you and to your wife; therefore let him not drive you both forth from the garden so that you should be unhappy;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We said, 'Adam, surely this is an enemy to thee and thy wife. So let him not expel you both from the Garden, so that thou art unprosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor we said: O Adam! This is an enemy unto thee and unto thy wife, so let him not drive you both out of the Garden so that thou come to toil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Adam, [Satan] is an enemy to you and to your wife. Let him not turn you both out of Paradise and thus make you come to grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We said: Adam! verily this is an enemy unto thee and thine spouse; so let him not drive forth you twain from the Garden, lest thou be destressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, ‘O Adam! This is indeed an enemy of yours and your mate’s. So do not let him expel you from paradise, or you will be miserable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We said: \"O Adam! verily, this is an enemy to thee and thy wife: so let him not get you both out of the Garden, so that thou art landed in misery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We said: \"O Adam! Verily, this is an enemy to you and to your wife. So let him not get you both out of Paradise, so that you be distressed in misery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Adam' We said, 'This is you and your wife's enemy. Do not let him expel you from the Garden, so that you (Adam) will be tired.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, “O Adam, this is an enemy to you and to your wife. So do not let him make you leave the Garden, for then you will suffer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We said, \"O Adam, indeed this is an enemy to you and to your wife. Then let him not remove you from Paradise so you would suffer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:117] Then We said, ‘Adam, indeed this is an enemy of yours and of your wife, Eve (read Hawwā’). So do not let him cause you both to be expelled from the Garden, so that you then toil, [so that you then] become fatigued by [the toil of] tillage, sowing, harvesting, milling, baking and otherwise — the statement is restricted to [the mention of] his [Adam’s] ‘toil’ because it is the man who has to strive [to provide] for his wife.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore We said: Adam! This is an enemy unto thee and unto your wife) Eve, (so let him not drive you both out of the Garden) if you obey him (so that thou come to toil) and toil as a consequence.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذ استكبر إبليس عن تعظيمه نبهنا عليه عداوته { فَقُلْنَا } له: { يآءَادَمُ } المكرم بسجود الملائكة { إِنَّ هَـٰذَا } المشار إليه بالإشارة القريبة الممتنع عن سجودك وتعظيمك { عَدُوٌّ لَّكَ وَلِزَوْجِكَ } يريد إفسادكما فاحذروا عن مصاحبته وتغريره، ولا تتكلما معه { فَلاَ يُخْرِجَنَّكُمَا مِنَ ٱلْجَنَّةِ } إلى دار الابتلاء { فَتَشْقَىٰ } [طه: 117] أنت يا آدم على الخصوص، أي: تتعب وتعيى بسبب كسب المعيشة؛ لأن معيشتك حينئذٍ من كد يمينك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فقلنا } عقب ذلك، اعتناء بنصحه، وهو العهد الذي عهدناه إليه: { يا آدمُ إِنَّ هذا } الذي رأيته فَعَلَ ما فعل { عدوٌّ لك ولزوجك } حيث لم يرض بالسجود لك، { فلا يُخرجكما من الجنة } أي: لا يكونن سببًا لإخراجكما من الجنة، والمراد: نهيهما عن الاغترار به، { فتشقى }: جواب النهي، أي: فتتعب بما ينالكما من شدائد الدنيا، من الجوع والعطش، والفقر والضر، وتعب الأبدان في تحصيل المعاش واللباس، فيكون عيشك من كد يمينك\n\n\nقال ابن جبير: أهبط إلى آدم ثور أحمر، فكان يَحرث عليه، ويمسح العرق عن جبينه، فهو شقاؤه\n ولم يقل: فتشقيا لأنه غلَّب الذِّكَرَ لأن تعبه أكثر، مع مراعاة الفواصل",
      "translations": []
    }
  ]
}