{
  "chapter": "طه",
  "text": "اذ رءا نارا فقال لاهله امكثوا۟ انى ءانست نارا لعلى ءاتيكم منها بقبس او اجد على النار هدى",
  "translations": [
    {
      "translation": "When he saw a fire and said to his family, 'Wait here. I can make out a fire. Maybe I will bring you a brand from it, or will find guidance there.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire he said to his family: \"You wait here. I have seen a fire. I may haply be able to bring an ember from it, or find direction by the fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire and said to his family: \"Hold on! I have just perceived a fire; perhaps I will bring a brand from it for you, or I will find some guidance at the fire about the way to follow.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the fire, he said to his family, \"Wait here for I can see a fire. Perhaps I shall bring you a burning torch or find a way to some fire\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire and said to his wife, “Wait – I have seen a fire – perhaps I may bring you an ember from it or find a way upon the fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire, he said to his family: \"Wait! Verily, I have seen a fire; perhaps I can bring you some burning brand therefrom, or find some guidance at the fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw fire, he said to his family: Stop, for surely I see a fire, haply I may bring to you therefrom a live coal or find a guidance at the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire, and said to his family, 'Tarry you here; I observe a fire. Perhaps I shall bring you a brand from it, or I shall find at the fire guidance.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire and said unto his folk: Lo! Wait! I see a fire afar off. Peradventure I may bring you a brand therefrom or may find guidance at the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire, he said to his family, \"Wait here. I can see a fire. Perhaps I can bring you a brand from it, or find some guidance at the fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time he saw a fire and said to his household, bide ye! verily I have perceived a fire! haply I may bring you from it a brand or may find at the fire a guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when he sighted a fire, and said to his family, ‘Wait! Indeed, I descry a fire! Maybe I will bring you a brand from it, or find some guidance at the fire.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, he saw a fire: So he said to his family, \"Tarry ye; I perceive a fire; perhaps I can bring you some burning brand therefrom, or find some guidance at the fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire, he said to his family: \"Wait! Verily, I have seen a fire, perhaps I can bring you some burning brand therefrom, or find some guidance at the fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire, he said to his family: 'Stay here, for I can see a fire. Perhaps I can bring you a lighted torch or find at the fire guidance'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire, he said to his family, “Stay; I have noticed a fire; Perhaps I can bring you a torch therefrom, or find some guidance by the fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw a fire and said to his family, \"Stay here; indeed, I have perceived a fire; perhaps I can bring you a torch or find at the fire some guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:10] When he caught sight of a fire and said to his family, namely, to his wife, ‘Wait, here! — this was when he was leaving Midian, heading for Egypt — Indeed I see a fire [in the distance]. Perhaps I [can] bring you a brand from it, [bring you] a burning wick or a torch, or find at the fire some guidance’, that is, someone to guide me by showing me the [proper] route — for he had lost it in the darkness of the night. He [Moses] said, ‘perhaps’ (la‘alla) because he could not be certain of fulfilling his promise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When he saw a fire) on his left side (and said unto his folk: Wait) stay here! (I see a fire afar off. Peradventure I may bring you a brand therefrom) a brand of fire from there, for that night was very cold, (or may find guidance at the Fire) to show me the way.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَّعَلِّيۤ آتِيكُمْ مِّنْهَا بِقَبَسٍ } يعني بنارٍ في طَرفِ العُودِ أَو القَصبةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكما نبهناك يا أكمل الرسل على ظهورنا في الكائنات مجملاً، نبَّهناك عليها مفصلاً { وَ } ذلك أنه { هَلْ أَتَاكَ } أي: قد ثبت و تحقق عندك الكليم { حَدِيثُ مُوسَىٰ } [طه: 9] أي: قصةُ انكشافه من النار التي احتاج إليها هو وأهله في الليلة الشاتية المظلمة، وقت { إِذْ رَأَى نَاراً } مطلوبةً لدفع البرودة، ولوجدان الطريق في الظلمة { فَقَالَ لأَهْلِهِ } المحتاجين إليها في تلك الليلة: { ٱمْكُثُوۤاْ إِنِّيۤ آنَسْتُ نَاراً لَّعَلِّيۤ } أو أنس عندها مع إنسان استخبره عن الطريق، وحين رجوعي إليكم { آتِيكُمْ مِّنْهَا بِقَبَسٍ } تتصطلون به { أَوْ } أتخذ منها سراجاً { أَجِدُ عَلَى ٱلنَّارِ } اي: مع السراج المسرجة منها { هُدًى } [طه: 10] طريقاً موصلاً إلى مطلوبنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فبينما هو في ذلك { إِذْ رأى نارًا } على يسار الطريق من جانب الطور، { فقال لأهله امكثوا } أي: أقيموا مكانكم\n أمرهم عليه السلام بذلك لئلا يتبعوه، كما هو المعتاد من النساء\n والخطاب للمرأة والخادم والولد، وقيل: لها وحدها، والجمع للتعظيم، { إِني آنستُ } أي: أبصرت { نارًا } ، وقيل: الإيناس خاص بإبصار ما يُؤنس به\n\n\n{ لعلّي آتيكم منها بقَبَس } أي: بشعلة مقتبسة من معظم النار، وهو المراد بالجذوة في سورة القصص، وبالشهاب القبس، { أو أجدُ على النار هُدىً } هاديًا يدلني إلى الطريق، فهو مصدر بمعنى الفاعل، و { أوْ } في الموضعين: لمنع الخلو، لا لمنع الجمع إذ يمكن أن يقتبس من النار ويجد هاديًا\n ومعنى الاستعلاء في قوله: { على النار } لأن أهلها يستعلون عليها عند الاصطلاء، ولما كان الإيتاء بها غير محقق، صدَّر الجملة بكلمة الترجي\n { فلما أتاها } أي: النار التي آنسها\n قال ابن عباس رضي الله عنه: رأى شجرة خضراء، حفت بها، من أسفلها إلى أعلاها، نارٌ بيضاء، تتَقِدُ كأضوء ما يكون، فوقف متعجبًا من شدة ضوئها، رُوي أن الشجرة كانت عوسجة، وقيل: سَمُرَة\n\n\n بينما هو ينظر، { نُودي } فقيل: { يا موسى إِني أنا ربك } ، أو بأني أنا ربك، وتكرير الضمير لتأكيد الدلالة، وتحقيق المعرفة وإماطة الشبهة",
      "translations": []
    }
  ]
}