{
  "chapter": "طه",
  "text": "ولو انا اهلكنهم بعذاب من قبله لقالوا۟ ربنا لولا ارسلت الينا رسولا فنتبع ءايتك من قبل ان نذل ونخزى",
  "translations": [
    {
      "translation": "If We had destroyed them with a punishment before this, they would have said. 'Our Lord, why did You not send us a Messenger, so we could follow Your Signs before we were humbled and disgraced?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We had destroyed them by some calamity sooner than this, they would have surely said: \"O Lord, if You had sent to us a messenger we would have followed Your command before being humbled and disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We destroyed them through some calamity before his coming, they would have said: \"Our Lord! Why did You not send any Messenger to us that we might have followed Your signs before being humbled and disgraced?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We destroyed them with a torment before the coming of Muhammad they would have said, \"Lord, would that you had sent us a Messengers so that we could have followed Your revelations before being humiliated and disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We destroyed them with some punishment before the advent of a Noble Messenger, they would have certainly said, “Our Lord, why did You not send a Noble Messenger to us, so we would have followed Your signs, before being humiliated and disgraced?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had destroyed them with a torment before this, they would surely have said: \"Our Lord! If only You had sent us a Messenger we should certainly have followed Your Ayat, before we were humiliated and disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We destroyed them with chastisement before this, they would certainly have said: O our Lord! why didst Thou not send to us an apostle, for then we should have followed Thy communications before that we met disgrace and shame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We destroyed them with a chastisement aforetime, they would have said, 'Our Lord, why didst Thou not send us a Messenger, so that we might have followed Thy signs before that we were humiliated and degraded?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if we had destroyed them with some punishment before it, they would assuredly have said: Our Lord! If only Thou hadst sent unto us a messenger, so that we might have followed Thy revelations before we were (thus) humbled and disgraced!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We had destroyed them with a punishment before this, they would have surely said, \"Our Lord, why did you not send to us a messenger so that we might have followed Your commandment before we were humiliated and disgraced?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We destroyed them With a torment before it, surely they would have said: O our Lord why sent not Thou Unto us an apostle that we might have followed Thy signs before we were disgraced and humiliated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We destroyed them with a punishment before it, they would have surely said, ‘Our Lord! Why did You not send us an apostle so that we might have followed Your signs before we were abased and disgraced?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had inflicted on them a penalty before this, they would have said: \"Our Lord! If only Thou hadst sent us a messenger, we should certainly have followed Thy Signs before we were humbled and put to shame.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had destroyed them with a torment before this (i.e. Messenger Muhammad SAW and the Quran), they would surely have said: \"Our Lord! If only You had sent us a Messenger, we should certainly have followed Your Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), before we were humiliated and disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We destroyed them with a punishment before this, they would have said: 'Our Lord, why did You not send us a Messenger so that we could have followed Your verses before we were humiliated and degraded'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We destroyed them with a punishment before him, they would have said, “Our Lord, if only You had sent us a messenger, we would have followed Your revelations before we were humiliated and disgraced.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had destroyed them with a punishment before him, they would have said, \"Our Lord, why did You not send to us a messenger so we could have followed Your verses before we were humiliated and disgraced?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:134] Had We destroyed them with a chastisement before him, before [the coming of] Muhammad (s) the Messenger, they would have said, on the Day of Resurrection: ‘Our Lord, if only You had sent us a messenger, so that we might have followed those signs of Yours, given to the messengers [to convey], before we were [thus] abased, at the Resurrection, and disgraced?’, in Hell.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "349 (And if We had destroyed them) i.e. the people of Mecca (with some punishment before it) before the Prophet Muhammad (pbuh) came with the Qur'an, (they would assuredly have said) on the Day of Judgement: (Our Lord!) our Lord! (If only Thou hadst sent unto us) why did You not send us (a messenger, so that we might have followed Your revelations) so that we you follow your Messenger and believe in Your Book (before we were (thus) humbled) before we were killed at Badr (and disgraced!) and tormented by the torment of the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } قل لهم يا أكمل الرسل أيضاَ قولنا هذا { لَوْ أَنَّآ أَهْلَكْنَاهُمْ بِعَذَابٍ } نازل من عندنا لإصرارهم وعنادهم { مِّن قَبْلِهِ } أي: من قبل إرسالك إليهم { لَقَالُواْ } حين نزول العذاب مثلما قالت تلك الأمم الهالكة عند نزوله: { رَبَّنَا لَوْلاۤ } هلا { أَرْسَلْتَ إِلَيْنَا رَسُولاً } من عندك { فَنَتَّبِعَ آيَاتِكَ } الالة على توحيدك { مِن قَبْلِ أَن نَّذِلَّ } بهذا الإذلال { وَنَخْزَىٰ } [طه: 134] بهذا الخزي والوبال\n\nوإن عاندوا معك بعد سماع هذه الدلائل الواضحة والتنبيهات اللائحة\n أعرضْ عن مكالمتهم ومناصحتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ولو أنَّا أهلكناهم } في الدنيا { بعذابٍ } مستأصل\n { من قَبْلِه } أي: من قبل إتيان البينة\n وهو نزول القرآن ومجيء محمد صلى الله عليه وسلم\n { لقالوا ربنا لولا أرسلتَ إِلينا رسولاً } يدعونا مع كتاب يهدينا\n { فنتّبعَ آياتك } التي جاءنا بها\n { من قبل أن نَّذِلَّ } بالعذاب في الدنيا\n { ونخْزَى } بدخول النار يوم القيامة\n ولكنا لم نهلكهم قبل إتيانها\n فانقطعت حجتهم\n فإذا كان يوم القيامة\n[المُلك: 9]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:69",
      "similarity": 0.4392450724094479
    },
    {
      "verse": "39:26",
      "similarity": 0.42634768161550357
    },
    {
      "verse": "3:194",
      "similarity": 0.4241064168607854
    },
    {
      "verse": "39:40",
      "similarity": 0.41824821036661575
    },
    {
      "verse": "26:87",
      "similarity": 0.4108904744551854
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/20:134.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/20:134.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:134.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}