{
  "chapter": "طه",
  "text": "ان الساعة ءاتية اكاد اخفيها لتجزى كل نفسۭ بما تسعى",
  "translations": [
    {
      "translation": "The Hour is coming but I have concealed it so that every self can be repaid for its efforts.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the Hour (of the great change) is about to come. I keep it secret that every soul may be rewarded for its endeavour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour of Resurrection is coming. I have willed to keep the time of its coming hidden so that everyone may be recompensed in accordance with his effort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Although it is certain that the Day of Judgment will come, I prefer to keep it almost a secret so that every soul will receive the recompense for what it has done (on its own).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“The Last Day will surely come – it was close that I hide it from all – in order that every soul may get the reward of its effort.” (He revealed it to His Prophets, so that people may fear and get ready. The exact time is not revealed to the people.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the Hour is coming -- and I am almost hiding it -- that every person may be rewarded for that which he strives.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the hour is coming-- I am about to make it manifest-- so that every soul may be rewarded as it strives:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour is coming; I would conceal it that every soul may be recompensed for its labours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the Hour is surely coming. But I will to keep it hidden, that every soul may be rewarded for that which it striveth (to achieve).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour is coming. But I choose to keep it hidden, so that every human being may be recompensed in accordance with his labours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the Hour is coming--I wish to conceal it - in Order that every one may be requited according to that which he hath endeavoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the Hour is bound to come: I will have it hidden, so that every soul may be rewarded for its endeavour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the Hour is coming - My design is to keep it hidden - for every soul to receive its reward by the measure of its Endeavour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the Hour is coming and My Will is to keep it hidden that every person may be rewarded for that which he strives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour is coming. I almost conceal it, so that every soul will be recompensed for its labors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour is coming—but I keep it almost hidden—so that each soul will be paid for what it endeavors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the Hour is coming - I almost conceal it - so that every soul may be recompensed according to that for which it strives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:15] The Hour is assuredly coming. [But] I will to keep it hidden, from mankind — and its nearness [in time] will manifest itself to them through its signs — so that every soul may be requited, thereupon, for what it strives for, of good or evil.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! the Hour is surely coming) the Hour will surely take place. (But I will to keep it hidden) so how would I reveal it to any created being, (that every soul) whether it is righteous or sinner (may be rewarded for that which it striveth (to achieve)) whether it is good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَكَادُ أُخْفِيهَا } معناهُ أُظهرُها\n وأُخفِيهَا: أكتُمُهَا\n وهما ضدٌّ\n وخَفيتُ: أَظهرتُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تعليماً لعباده، وحثاً لهم على طلب الانكشاف التام: { إِنَّ ٱلسَّاعَةَ } أي: ساعة الانكشاف التام على الذي لم يبق معه الطلب كانكشافك يا موسى { آتِيَةٌ } حاصلةً لكل أحدٍ من الناس دائماً في كل آنٍ، لكن { أَكَادُ أُخْفِيهَا } أي: أُخفي ظهورها لهم { لِتُجْزَىٰ } أي: لتتمكن { كُلُّ نَفْسٍ } بمرتبةٍ من المراتب الإلهية { بِمَا تَسْعَىٰ } [طه: 15] أي: بسبب ما تجتهد فيه، وتكتسب من امتثال الأوامر، واجتناب النواهي الجارية على ألسنة الرسل؛ يبطل سر التكليف والتشريع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِن الساعة آتيةٌ }: كائنة لا محالة، وهو تعليل لوجوب العبادة وإقامة الصلاة، وإنما عبَّر بالإتيان تحقيقًا لحصولها، بإبرازها في معرض أمر محقق متوجه نحو المخاطبين\n { أكادُ أُخفيها } أي: لا أظهرها، بأن أقول: آتية فقط، فلا تأتي إلا بغتة، أو أكاد أظهرها بإيقاعها، مِنْ أخفاه، إذا أظهره، فأخفى - على هذا - من الأضداد\n وردّه ابن عطية، فإن الذي بمعنى الظهور هو: \" خفى \" الثلاثي، لا \" أخفى \"\n وقال الزمخشري: قد جاء في بعض اللغات: أخفى بمعنى خفى، أي: ظهر، فلا اعتراض\n ونقل الثعلبي عن ابن عباس وأكثر المفسرين أن المعنى: أكاد أخفيها عن نفسي، فكيف عن غيري؟ وكذلك هو في مصحف أُبي، وفي مصحف عبد الله: فكيف يعلمها مخلوق، وفي بعض القراءات: وكيف أظهرها لكم؟ قال قطرب: فإن قيل: كيف يُخفي الله تعالى عن نفسه، وهو خَلَق الأشياء؟ قلنا: إن الله تعالى كلم العرب بكلامهم الذي يعرفونه\n انظر بقية كلامه\n وظهور علاماتها لا يزيل إخفاءها\n قال ابن عرفة في تفسيره: وإذا ظهرت عند وقوع الأشراط لم ينسلخ عنها معنى الخفاء المتقدم، غاية الأمر أنها بذكر الأشراط وسط بين الإخفاء والإظهار، فتكون مقاربة لكل واحد منهما\n هـ\n وقوله تعالى: { لتُجزى كُلُّ نفس بما تسعى } متعلق بآتية، أو بأُخفيها - على معنى: أظهرها -، لتُجزى كل نفس بسعيها، أي: بعملها خيرًا كان أو شرًا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "76:22",
      "similarity": 0.42202333584323054
    },
    {
      "verse": "32:17",
      "similarity": 0.3742646490081542
    },
    {
      "verse": "79:35",
      "similarity": 0.3686370119117778
    },
    {
      "verse": "53:39",
      "similarity": 0.3557897773787808
    },
    {
      "verse": "21:94",
      "similarity": 0.3555347183230246
    }
  ]
}