{
  "chapter": "طه",
  "text": "ومن اعرض عن ذكرى فان له معيشة ضنكا ونحشره يوم القيمة اعمى",
  "translations": [
    {
      "translation": "But if anyone turns away from My reminder, his life will be a dark and narrow one and on the Day of Rising We will gather him blind.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who fails to heed My warning will have his means restricted; and on the Day of Resurrection We shall raise him blind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever turns away from this Admonition from Me shall have a straitened life; We shall raise him blind on the Day of Resurrection,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever ignores My guidance will live a woeful life and will be brought in Our presence blind on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And the one who turned away from My remembrance – for him is a confined existence, and We shall raise him blind on the Day of Resurrection.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever turns away from My Reminder, verily, for him is a life of hardship, and We shall raise him up blind on the Day of Resurrection.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever turns away from My reminder, his shall be a straitened life, and We will raise him on the day of resurrection, blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but whosoever turns away from My remembrance, his shall be a life of narrowness, and on the Resurrection Day We shall raise him blind.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who turneth away from remembrance of Me, his will be a narrow life, and I shall bring him blind to the assembly on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but whoever turns away from My reminder, will lead a straitened existence and on the Day of Judgement We shall raise him up blind\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever turneth away from My admonition, for him verily will be a livelihood shrunken, and We shall raise him up on the Day of Judgment sightless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever disregards My remembrance, his shall be a wretched life, and We shall raise him blind on the Day of Resurrection.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever turns away from My Message, verily for him is a life narrowed down, and We shall raise him up blind on the Day of Judgment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever turns away from My Reminder (i.e. neither believes in this Quran nor acts on its orders, etc.) verily, for him is a life of hardship, and We shall raise him up blind on the Day of Resurrection.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but whosoever turns away from My remembrance, his life shall be narrow and on the Day of Resurrection We shall raise him blind'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever turns away from My Reminder, for him is a confined life. And We will raise him on the Day of Resurrection blind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever turns away from My remembrance - indeed, he will have a depressed life, and We will gather him on the Day of Resurrection blind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:124] But whoever disregards My remembrance, [disregards] the Qur’ān and does not believe in it, his shall be a straitened life (read dankan with nunation, a verbal noun meaning ‘straitened [circumstances]’). This [statement] has been interpreted in one hadīth to mean the punishment of the grave for the disbeliever. And on the Day of Resurrection We shall bring him to the assembly, namely, the one who disregards the Qur’ān, blind’, blind in eyesight.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But he who turneth away from remembrance of Me) but he who turns from professing My divine Oneness; it is also said that this means: he who disbelieves in My Scripture and Messenger, (his will be a narrow life) he will be exposed to a severe punishment in the grave; and it is also said: he will be exposed to a severe punishment in hell, (and I shall bring him blind to the assembly on the Day of Resurrection.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَعِيشَةً ضَنكاً } معناه ضَيقٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {a life of hardship} means hardship.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ومن أعرض عن ذِكْري } بالتوجه إلى العالم السفلي بالميل النفسي\n ضاقت معيشته لغلبة شحه وشدّة بخله\n فإنّ المعرض عن جناب الحق ركدت نفسه وانجذبت إلى الزخارف الدنيوية والمقتنيات المادية لمناسبتها إياها\n واشتدّ حرصه وكَلَبَه عليها ونهمه وشغفه بها لقوّة محبته إياها للجنسية والاشتراك في الظلمة والميل إلى الجهة السفلية\n فيشحّ بها عن نفسه وغيره\n وكلما استكثر منها ازاد حرصه عليها وشحّه بها وذلك هو الضنك في المعيشة\n ولهذا قال بعض الصوفية: لا يعرض أحد عن ذكر ربّه إلا أظلم عليه وتشوّش عليه رزقه\n بخلاف الذاكر المتوجّه إليه فإنه ذو يقين منه وتوكل عليه في سعة من عيشه ورغد\n ينفق ما يجد ويستغنى بربّه عما يفقد\n { ونحشره يوم القيامة } الصغرى على عماه من نور الحق كقوله:\n[الإسراء\n الآية:72] وإنكاره لعماه إنما يكون بلسان الاستعداد الأصلي والنور الفطري المنافي لعماه من رسوخ هيئة الحبّ السفلي والعشق النفسي بالفسق الجرمي ونسيان الآيات البينات والأنوار المشرقات الموجب لإعراضه تعالى عنه وتركه فيما هو فيه { ولعذاب الآخرة أشدّ وأبقى } من ضنك العيش في الدنيا لكونه روحانياً دائماً\n { ولولا كلمة سبقت } أي: قضاء سابق أن لا يستأصل هذه الأمّة بالدمار والعذاب في الدنيا لكون نبيهم نبيّ الرحمة\n وقوله:\n[الأنفال\n الآية:33] لكان الإهلاك لازماً لهم\n { فاصبر } بالله\n { على ما يقولون } فإنك تراهم جارين على ما قضى الله عليهم\n مأسورين في أسر قهره ومكره بهم { وسبّح } أي: نزّه ذاتك بتجريدها عن صفاتها متلبساً بصفات ربّك\n فإن ظهورها عليك هو الحمد الحقيقي { قبل طلوع } شمس الذات حال الفناء { وقبل غروبها } باستتارها عند ظهور صفات النفس\n أي: في مقام القلب حال تجلي الصفات\n فإن تسبيح الله هناك محو صفات القلب { ومن آناء الليل } أي: أوقات غلبات صفات النفس المظلمة والتلوينات الحاجبة { فسبّح } بالتزكية { وأطراف } نهار إشراق الروح على القلب بالتصفية { لعلك } تصل إلى مقام الرضا الذي هو كمال مقام تجلي الصفات وغايته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بحيث لا يسع فيه غير التفكر في أمر المعاش { وَ } إذا انتقل منها { نَحْشُرُهُ يَوْمَ ٱلْقِيامَةِ } الكبرى { أَعْمَىٰ } [طه: 124] أي: يصور إعراضَه عن الحق في الدنيا على صورة العمى في الآخرة\n\n\nحيث { قَالَ } تحسراً وتحزناً: { رَبِّ لِمَ حَشَرْتَنِيۤ أَعْمَىٰ } في الآخرة { وَقَدْ كُنتُ بَصِيراً } [طه: 125] في الدنيا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإِنَّ له معيشةً ضنكًا }: ضيقًا\n مصدر وصف به\n ولذلك يستوي فيه المذكر والمؤنث\n يقال: منزل ضنك وعيشة ضنك\n وقرئ: \" ضنكى \" كسكرى\n وإنما كان عيشُهُ ضيقًا لأن مجامع همته\n ومطامح نظره مقصورة على أغراض الدنيا\n وهو متهالك على ازديادها\n وخائف من انتقاصها\n بخلاف المؤمن الطالب للآخرة\n فإنَّ نور الإيمان يُوجب له القناعة\n التي هي رأس الغنى وسبب الراحة\n فيحيى حياة طيبة\n وقيل: هو عذاب القبر\n ورُوي ذلك عن النبي صلى الله عليه وسلم\n قال أبو سعيد الخدري:\n \" يُضيق عليه قبره\n حتى تختلف أضلاعه\n ويسلط عليه تسعة وتسعون تنينا… \" \nالحديث\n وقيل: الصبر على الزقوم والضريع والغسلين\n { ونحْشُره يومَ القيامةِ أعمى }: فاقد البصر كقوله:\n[الإسراء: 97]\n لا أعمى عن الحجة كما قيل\n { قال ربِّ لِمَ حشرتني أعمى وقد كنت بصيرًا } في الدنيا؟ { قال كذلك } أي: مثل ذلك فعلتَ أنتَ { أتتك آياتُنا } أي: حجتنا النيرة على أيدي رسلنا { فنسيتَها } أي: عميتَ عنها\n وتركتها ترك المنسي الذي لا يذكر قط",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:11",
      "similarity": 0.18638990560627816
    },
    {
      "verse": "69:21",
      "similarity": 0.18592502503197883
    },
    {
      "verse": "101:7",
      "similarity": 0.18592502503197883
    },
    {
      "verse": "15:20",
      "similarity": 0.18536002553319997
    },
    {
      "verse": "7:10",
      "similarity": 0.17554984096200504
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/20:124.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/20:124.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/20:124.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}