{
  "chapter": "طه",
  "text": "فتعلى الله الملك الحق ولا تعجل بالقرءان من قبل ان يقضى اليك وحيه وقل رب زدنى علما",
  "translations": [
    {
      "translation": "High exalted be Allah, the King, the Real! Do not rush ahead with the Qur'an before its revelation to you is complete, and say: 'My Lord, increase me in knowledge.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted then be God, the real King; and do not try to anticipate the Qur'an before the completion of its revelation, but pray: \"O Lord, give me greater knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is Allah, the True King! Hasten not with reciting the Qur'an before its revelation to you is finished, and pray: \"Lord! Increase me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the Most High and the True King. (Muhammad), do not be hasty in reading the Quran to the people before the revelation has been completed. \"Say, My Lord, grant me more knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore Supreme is Allah, the True King; and do not hasten in the Qur’an (O dear Prophet Mohammed – peace and blessings be upon him) until its divine revelation has been completed to you; and pray, “My Lord, bestow me more knowledge.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then High above all be Allah, the True King. And be not in haste with the Qur'an before its revelation is completed to you, and say: \"My Lord! Increase me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Supremely exalted is therefore Allah, the King, the Truth, and do not make haste with the Quran before its revelation is made complete to you and say: O my Lord! increase me in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So high exalted be God, the true King! And hasten not with the Koran ere its revelation is accomplished unto thee; and say, 'O my Lord, increase me in knowledge.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then exalted be Allah, the True King! And hasten not (O Muhammad) with the Qur'an ere its revelation hath been perfected unto thee, and say: My Lord! Increase me in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "exalted is God, the True King. Do not be impatient with the Quran before its revelation is completed, and say, \"My Lord, increase my knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is Allah, the True King! And hasten thee not with the Qur'an before there is finished to thee the revelation thereof, and say thou: O my Lord! increase me in knowledge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So exalted is Allah, the True Sovereign. Do not hasten with the Quran before its revelation is completed for you, and say, ‘My Lord! Increase me in knowledge.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "High above all is Allah, the King, the Truth! Be not in haste with the Qur'an before its revelation to thee is completed, but say, \"O my Lord! advance me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then High above all be Allah, the True King. And be not in haste (O Muhammad SAW) with the Quran before its revelation is completed to you, and say: \"My Lord! Increase me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Highly exalted be Allah, the true King! Do not hasten with the Koran before its revelation has been completed to you, but say: 'Lord, increase me in knowledge'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is God, the True King. Do not be hasty with the Quran before its inspiration to you is concluded, and say, “My Lord, increase me in knowledge.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So high [above all] is Allah, the Sovereign, the Truth. And, [O Muhammad], do not hasten with [recitation of] the Qur'an before its revelation is completed to you, and say, \"My Lord, increase me in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:114] So exalted be God, the King, the Truth, above what the idolaters say. And do not hasten with the Qur’ān, that is, to recite it, before its revelation is completed for you, [before] Gabriel is through delivering it, and say, ‘My Lord, increase me in knowledge’, that is, [knowledge] of the Qur’ān: thus every time something of it was revealed to him his knowledge increased because of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَتَعَالَى اللَّهُ الْمَلِكُ الْحَقُّ وَلَا تَعْجَلْ بِالْقُرْآَنِ مِنْ قَبْلِ أَنْ يُقْضَى إِلَيْكَ وَحْيُهُ وَقُلْ رَبِّ زِدْنِي عِلْمًا (114)والجمع بين اسم الجلالة واسمه ( المَلِك ) إشارة إلى أن إعظامه وإجلاله مستحَقّان لذاته بالاسم الجامع لصفات الكمال ، وهو الدال على انحصار الإلهيّة وكمالها .ثمّ أتبع ب ( الحق ) للإشارة إلى أن تصرفاته واضحة الدلالة على أن ملكه ملك حق لا تصرف فيه إلاّ بما هو مقتضَى الحكمة .والحق : الذي ليس في ملكه شائبة عجز ولا خضوع لغيره ، وفيه تعريض بأن ملك غيره زائف .وفي تفريع ذلك على إنزال القرآن إشارة أيضاً إلى أن القرآن قانون ذلك الملك ، وأن ما جاء به هو السياسة الكاملة الضامنة صلاح أحوال متبعيه في الدنيا والآخرة .وجملة { ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه } ناشئة على ما تقدم من التنويه بالقرآن وما اشتمل عليه من تصاريف إصلاح الناس . فلمّا كان النبي صلى الله عليه وسلم حريصاً على صلاح الأمّة شديد الاهتمام بنجاتهم لا جرم خطرت بقلبه الشريف عَقِب سماع تلك الآيات رغبةٌ أو طِلْبة في الإكثار من نزول القرآن وفي التعجيل به إسراعاً بعِظة الناس وصلاحهم ، فعلمه الله أن يكِل الأمر إليه فإنه أعلم بحيث يناسب حال الأمة العامَّ .ومعنى { من قبل أن يقضى إليك وحيه } أي من قبل أن يتم وحي ما قضي وحيه إليك ، أي ما نُفذ إنزاله فإنه هو المناسب . فالمنهي عنه هو سؤال التعجيل أو الرغبة الشديدة في النفس التي تشبه الاستبطاء لا مطلق مودة الازدياد ، فقد قال النبي صلى الله عليه وسلم في شأن قصة موسى مع الخضر عليهما السلام \" ودَدنا أن موسى صبَر حتى يقص الله علينا من أمرهما أو من خبرهما \"ويجوز أن يكون معنى العجلة بالقرآن العجلة بقراءته حال إلقاء جبريل آياته . فعن ابن عبّاس : كان النبي يبادر جبريل فيقرأ قبل أن يفرغ جبريل حرصاً على الحفظ وخشية من النسيان فأنزل الله { ولا تعجل بالقرآن الآية . وهذا كما قال ابن عبّاس في قوله تعالى : { لا تُحرّكْ به لسانك لتعجلَ به } \\[ القيامة : 16 \\] كما في «صحيح البخاري» . وعلى هذين التأويلين يكون المراد بقضاء وحيه إتمامه وانتهاؤه ، أي انتهاء المقدار الذي هو بصدد النزول .وعن مجاهد وقتادة أن معناه : لا تعجل بقراءة ما أُنزل إليك لأصحابك ولا تُمْلِه عليهم حتى تتبين لك معانيه .وعلى هذا التأويل يكون قضاء الوحي تمام معانيه . وعلى كلا التفسيرين يجري اعتبار موقع قوله { وقل رب زدني علماً .وقرأ الجمهور يُقضى بتحتية في أوله مبنياً للنائب ، ورفع وحيُه على أنه نائب الفاعل . وقرأه يعقوب بنون العظمة وكسر الضاد وبفتحة على آخر نقضي وبنصب وحيَه .وعطف جملة وقل رب زدني علماً } يشير إلى أن المنهي عنه استعجال مخصوص وأن الباعث على الاستعجال محمود . وفيه تلطف مع النبي صلى الله عليه وسلم إذ أتبع نهيه عن التعجل الذي يرغبه بالإذن له بسؤال الزيادة من العلم ، فإن ذلك مجمع كل زيادة سواء كانت بإنزال القرآن أم بغيره من الوحي والإلهام إلى الاجتهاد تشريعاً وفهماً ، إيماء إلى أن رغبته في التعجل رغبة صالحة كقول النبي صلى الله عليه وسلم لأبي بَكر حين دخل المسجد فوجد النبي راكعاً فلم يلبث أن يصل إلى الصف بل ركع ودَبّ إلى الصف راكعاً فقال له : «زادك الله حرصاً ولا تَعُدْ» .\n\n",
      "translations": [
        {
          "translation": "(Then exalted be Allah, the True King) He exonerated Himself from having children or partners! (And hasten not with the Qur'an) do not hasten, O Muhammad, to recite the Qur'an (ere its revelation hath been perfected unto thee) before Gabriel finishes reading the Qur'an to you. This is because when Gabriel used to bring new revelations, the Prophet (pbuh) would start to repeat them after Gabriel even before the latter finished his reading, for fear of forgetting what was recited to him. Allah therefore told him to stop doing this, saying: (and say) O Muhammad: (My Lord! Increase me in knowledge) and memorisation and understanding of the Qur'an as well as in judging by the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِن قَبْلِ أَن يُقْضَىٰ إِلَيْكَ وَحْيُهُ } معناه يُبيّنُ لَكَ بَيانَهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {before it is decided to you} means He will explain to you His statement.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإلا لِمَ يرجوا إيماننا؟ قل لهم يا أكمل الرسل: { فَتَعَٰلَى ٱللَّهُ } أي: تنزه وتقدس { ٱلْمَلِكُ } المستولي المطلق { ٱلْحَقُّ } الثابت الدائم أزلاً وأبداً عما يقول الظالمون المشركون من إثبات الاحتياج له بمجرد الرخاء العائد نفعه إياهم أيضاً\n\n\n{ وَ } إذا كان ظنهم هذا { لاَ تَعْجَلْ } يا أكمل الرسل { بِٱلْقُرْءانِ } أي: بأدائه وتبليغه لهم وقراءته عليهم { مِن قَبْلِ أَن يُقْضَىٰ إِلَيْكَ وَحْيُهُ } أي: من قبل أن يفرغ جبرائيل عليه السلام من وحيه وتبليغه\n بل أصبر حتى يفرغ من الوحي\n ثم تأمل في مرمزاته وإشاراته الخفية بدقر استعدادك { وَ } بعد التأمل والتدبر { قُل رَّبِّ زِدْنِي عِلْماً } [طه: 114] بما فيه من نفائس المعلومات وعجائب المعارف والحقائق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فتعالى الله } أي: تعاظم شأنه عما يصفه الكفرة\n وتهاون العصاة\n الذين لم يُحدث فيهم القرآن زجرًا ولا وعظًا\n أي: ارتفع بذاته وتنزه عن مماثلة المخلوقين في ذاته وصفاته وأفعاله\n { الملكُ } لها\n النافذ أمره ونهيه\n الحقيق بأن يُرجى وعده\n ويُخشى وعيده\n { الحقُّ } في ألوهيته لذاته\n أو الثابت الذي لا يمكن عدمه\n أزلاً وأبدًا\n { ولا تَعْجَلْ بالقرآنِ من قبل أن يُقضى إِليك وحيُه } أي وإذا كنا أنزلنا عليك قرآنًا عربيًا\n وصرفنا فيه من الوعيد\n فَأَمْهِلْ عند نزوله\n حتى يقرأه عليك الملك\n ولا تعجل به قبل أن يتم وحيه\n ويفرغ من قراءته عليك\n كان صلى الله عليه وسلم\n إذا ألقى جبريلُ عليه الوحي\n يتبعه عند تلفظ كل حرف وكل كلمة\n لكمال اعتنائه بالتلقي والحفظ\n فنهى عن ذلك لأنه ربما يشغله التلفظ بكلمة عن سماع ما بعدها\n ولأنَّ المراد من الألفاظ فهم المعاني المتضمنة للعلوم التي لا حصر لها\n ولذلك أمره باستفاضة العلم واستزادته منه فقال: { وقل ربِّ زِدْني علمًا } أي: وقل في نفسك\n أو بلسانك: رب زدني علمًا\n والمراد: سل الله عزّ وجلّ زيادة العلم به وبأحكامه إذ لا نهاية لعلمه كما لا نهاية لذاته\n فإنه الموصل إلى مطلبك دون الاستعجال\n والله تعالى أعلم\n الإشارة: وكذلك أنزلناه قرآنًا عربيًا\n يُعرب عن كمال ظهور ذاته وأنوار صفاته\n وصرفنا فيه من الوعيد\n لمن تخلف عن شهوده\n بعد كمال ظهوره\n لعلهم يتقون ما يحجبهم عن رؤيته\n أو يُحدث لهم ذكرًا\n أي: شوقًا يُزعجهم إلى النهوض إلى حضرته\n والوصول إليه\n فتعالى الله الملك الحق أن يتصل بشيء\n أو يتصل به شيء\n وإنما الوصول إليه: العلم بإحاطته ووحدة ذاته\n ولا تعجل\n أيها العارف\n بالقرآن الذي ينزل على قلبك من وحي الإلهام\n من قبل أن يُقضى إليك وحيه\n فإنَّ الواردات الإلهية تأتي مجملة\n وبعد الوعي يكون البيان\n { فإذا قرأناه فاتبع قرآنه ثم إن علينا بيانه } \n ولكن استزد من ربك العلوم اللدنية والكشوفات الإلهية\n أي: لا يكن همك استعجالَ الواردات أو بقاءها\n وليكن همك استزادةُ العلوم ومعرفة واهبها\n فإن العلوم وسائل لمعرفة المعلوم\n والوصول للحي القيوم\n وبالله التوفيق\n ثمَّ بين تصريف الوعيد على ارتكاب العصيان وبيان منشئه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:58",
      "similarity": 0.478614586636177
    },
    {
      "verse": "16:1",
      "similarity": 0.42095928053147524
    },
    {
      "verse": "26:204",
      "similarity": 0.31878503915286677
    },
    {
      "verse": "37:176",
      "similarity": 0.31878503915286677
    },
    {
      "verse": "21:25",
      "similarity": 0.3032215393077345
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020114.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020114.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:114.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}