{
  "chapter": "طه",
  "text": "ولقد عهدنا الى ءادم من قبل فنسى ولم نجد له عزما",
  "translations": [
    {
      "translation": "We made a contract with Adam before, but he forgot. We did not find that he had a firm resolve.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had commanded Adam before, but he disregarded it: We found him lacking in resolution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most certainly We had given Adam a command before, but he forgot. We found him lacking in firmness of resolution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had commanded Adam (certain matters). He forgot Our commandment and We did not find in him the determination to fulfil Our commandments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed before this We made a covenant with Adam, so he forgot, and We did not find its intention (in him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We made a covenant with Adam before, but he forgot, and We found on his part no firm willpower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave a commandment to Adam before, but he forgot; and We did not find in him any determination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made covenant with Adam before, but he forgot, and We found in him no constancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We made a covenant of old with Adam, but he forgot, and We found no constancy in him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant with Adam before you, but he forgot, and We found him lacking in constancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We covenanted with Adam aforetime, then he forgat, and We found not in him steadiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We had enjoined Adam earlier; but he forgot, and We did not find any resoluteness in him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had already, beforehand, taken the covenant of Adam, but he forgot: and We found on his part no firm resolve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We made a covenant with Adam before, but he forgot, and We found on his part no firm will-power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant with Adam, but he forgot and We found in him no constancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We covenanted with Adam before, but he forgot, and We found in him no resolve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had already taken a promise from Adam before, but he forgot; and We found not in him determination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:115] And We made a covenant with Adam, We enjoined him not to eat of the tree, before, that is, before he ate of it, but he forgot, he disregarded Our covenant, and We did not find in him any constancy, any resoluteness or patience in [abiding by] what We forbade him from.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We made a covenant of old) before he ate from the tree; it is also said that this means: before the advent of Muhammad (pbuh) (with Adam) We commanded him not to eat from the tree, (but he forgot) he left what he was commanded to do, (and We found no constancy in him) We found in him no firmness or resoluteness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ عَهِدْنَآ إِلَىٰ ءَادَمَ مِن قَبْلُ فَنَسِيَ وَلَمْ نَجِدْ لَهُ عَزْماً } معناه فَتَرَك ولَم يَحفظْ\n والعَزمُ: الحِفظُ لَما أُمر بهِ\n ويقالُ: صَبرٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم بعد ذلك اقرأ عليهم، وبههم بما فيه من قدر عقولهم { وَ } لا تنسى نيهنا عن الاستعجال بأداء القرآن قبل تمام الوحي مثل نيسان أبيك آدم عليه السلام عهده معنا، فإنا { لَقَدْ عَهِدْنَآ إِلَىٰ } أبيك { ءَادَمَ مِن قَبْلُ } بقولنا نهياً له ولامرأته:\n\n[البقرة: 35] { فَنَسِيَ } عهدنا هذا لتغرير الشيطان له { وَلَمْ نَجِدْ لَهُ عَزْماً } [طه: 115] رأياً صائباً في حفظ العهد حتى يوطن نفسه على مقتضى النهي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَلَقَدْ عَهِدْنَآ إِلَىٰ ءَادَمَ مِن قَبْلُ فَنَسِيَ وَلَمْ نَجِدْ لَهُ عَزْماً وَإِذْ قُلْنَا لِلْمَلاَئِكَةِ ٱسْجُدُواْ لآدَمَ فَسَجَدُوۤاْ إِلاَّ إِبْلِيسَ أَبَىٰ فَقُلْنَا يٰآدَمُ إِنَّ هَـٰذَا عَدُوٌّ لَّكَ وَلِزَوْجِكَ فَلاَ يُخْرِجَنَّكُمَا مِنَ ٱلْجَنَّةِ فَتَشْقَىٰ إِنَّ لَكَ أَلاَّ تَجُوعَ فِيهَا وَلاَ تَعْرَىٰ وَأَنَّكَ لاَ تَظْمَأُ فِيهَا وَلاَ تَضْحَىٰ فَوَسْوَسَ إِلَيْهِ ٱلشَّيْطَانُ قَالَ يٰآدَمُ هَلْ أَدُلُّكَ عَلَىٰ شَجَرَةِ ٱلْخُلْدِ وَمُلْكٍ لاَّ يَبْلَىٰ فَأَكَلاَ مِنْهَا فَبَدَتْ لَهُمَا سَوْءَاتُهُمَا وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِن وَرَقِ ٱلْجَنَّةِ\n\n\n }  قلت: يقال: عهد إليه الملك، وأوعد إليه، وتقدم إليه: إذا أمره ووصاه\n يقول الحقّ جلّ جلاله: { و } الله { لقد عَهدنا } وتقدمنا { إِلى آدم } من غرور الشيطان وعداوته، ووصيناه ألا يغتر به، { فقلنا يا آدم إن هذا عدو لك ولزوجك } ، فلا تغتر بنصحه { فَنَسِيَ } ذلك العهد ولم يحتفل به، حتى غفل عنه، واغتر بإظهار نصحه، حتى أكل من الشجرة، متأولاً أن النهي للتنزيه، أو عن عين الشجرة، لا عن جنسها، فأكل من غيرها، { ولم نَجِدْ له عَزْمًا } أي: ثبات قدم، وحزمًا في الأمور، إذ لو كان كذلك لما غرّه الشيطان بوسوسته، وقد كان ذلك منه عليه السلام في بدء أمره، قبل أن يجرب الأمور ويتولى حارها وقارها، ويذوق شرِّيها وأريها\n وعن النبي صلى الله عليه وسلم:\n\n \" لو وُزنت أحلام بني آدم - أي: عقولهم - بحلم آدم، لرجح حلمه \" \n\nوقيل: { ولم نجد له عزمًا } على الذنب، فإنه أخطأ، أو تأول، ولم يتعمد، وأما قوله: { وعصى… } فلعلو شأنه وقُربه عُد عصيانًا في حقه، \" حسنات الأبرار سيئات المقربين \"",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:43",
      "similarity": 0.6189519666709561
    },
    {
      "verse": "47:21",
      "similarity": 0.5727119355684217
    },
    {
      "verse": "2:227",
      "similarity": 0.5641014668189522
    },
    {
      "verse": "31:17",
      "similarity": 0.48412406630479193
    },
    {
      "verse": "3:186",
      "similarity": 0.4764047056831101
    }
  ]
}