{
  "chapter": "طه",
  "text": "يومئذ لا تنفع الشفعة الا من اذن له الرحمن ورضى له قولا",
  "translations": [
    {
      "translation": "On that Day intercession will not be of any use except for him whom the All-Merciful has authorised and with whose speech He is well-pleased.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day no intercession will matter other than his whom Ar-Rahman grants permission and accepts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day intercession shall not avail save of him whom the Most Compassionate Lord permits, and whose word of intercession is pleasing to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day no one's intercession will be of any benefit unless he has received permission from the Beneficent God and whose word is acceptable to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day no one’s intercession shall benefit except his to whom the Most Gracious has given permission and whose word He has liked. (The Holy Prophets and virtuous people will be given the permission to intercede. Prophet Mohammed – peace and blessings be upon him – will be the first to intercede.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day no intercession shall avail, except the one for whom the Most Gracious has given permission and whose word is acceptable to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day shall no intercession avail except of him whom the Beneficent Allah allows and whose word He is pleased with.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon that day the intercession will not profit, save for him to whom the All-merciful gives leave, and whose speech He approves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day no intercession availeth save (that of) him unto whom the Beneficent hath given leave and whose word He accepteth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day no intercession will avail, except from one who has received the sanction of the Merciful and of whose words He approves,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day intercession will Profit not except him for whom the Compassionate giveth leave, and of whom He approveth the Word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Intercession will not avail that day except from him whom the All-beneficent allows and approves of his word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day shall no intercession avail except for those for whom permission has been granted by (Allah) Most Gracious and whose word is acceptable to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day no intercession shall avail, except the one for whom the Most Beneficent (Allah) has given permission and whose word is acceptable to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day intercession will not benefit them except him that has received the permission of the Merciful and whose words are pleased by Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, intercession will not avail, except for him permitted by the Merciful, and whose words He has approved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day, no intercession will benefit except [that of] one to whom the Most Merciful has given permission and has accepted his word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:109] On that day intercession will not profit, anyone, except [intercession] from him whom the Compassionate One permits, that he intercede for such [a person], and whose word He approves, that is to say, because such [an intercessor] will say, ‘there is no god but God’ (lā ilāha illā’Llāh).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On that Day) the Day of Judgement (no intercession availeth) the angels will not intercede for anyone (save (that of) him unto whom the Beneficent hath given leave) to intercede (and whose He accepteth) He accepts from him his saying: \"there is no deity except Allah\":\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَوْمَئِذٍ لاَّ تَنفَعُ ٱلشَّفَاعَةُ } أي: شفاعة كل أحد من الناجين كل واحد من العاصين { إِلاَّ مَنْ أَذِنَ لَهُ ٱلرَّحْمَـٰنُ } بالشفاعة لبعض العصاة من أرباب العناية في ذلك اليوم { وَ } مع إذنه سبحانه له { رَضِيَ لَهُ قَوْلاً } [طه: 109] أي: تعلق رضاه سبحانه الشفعي وقت الشفاعة\n\n\nوإنما أذن ورضي سبحانه بالشفاعة للبعض",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يومئذٍ لا تنفعُ الشفاعة } أي: يوم إذ يقع ما ذكر من الأمور الهائلة لا تنفع شفاعة أحد\n { إِلا من أَذِنَ له الرحمن } في الشفاعة\n كالأنبياء والأولياء والعلماء الأتقياء\n { وَرَضِيَ له قولاً } أي: ورضي قوله في المشفوع له بحيث يقبل شفاعته\n وقيل: { ورضي له قولاً } في الدنيا\n وهو: لا إله إلا الله\n مخلصًا من قلبه\n\n\n أو: إلا من أذن له الرحمن أن يشفع فيه\n ورضي لأجله قولاً من الشافع\n وهذا أليق بمقام التهويل\n وأما من عداه فلا تنفع\n وإن وقعت لقوله تعالى:\n[المدَّثِّر: 48]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:48",
      "similarity": 0.743353937414956
    },
    {
      "verse": "26:100",
      "similarity": 0.5635733870269666
    },
    {
      "verse": "53:26",
      "similarity": 0.558498986441219
    },
    {
      "verse": "2:123",
      "similarity": 0.530786230131086
    },
    {
      "verse": "30:13",
      "similarity": 0.5190657757899961
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/20:109.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/20:109.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/20:109.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}