{
  "chapter": "طه",
  "text": "وانا اخترتك فاستمع لما يوحى",
  "translations": [
    {
      "translation": "I have chosen you, so listen well to what is revealed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have chosen you, so listen to what is revealed to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I Myself have chosen you; therefore, give ear to what is revealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have chosen you as My Messengers. Listen to the revelation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I have chosen you, therefore listen carefully to what is divinely revealed to you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I have chosen you. So listen to that which will be revealed (to you)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I have chosen you, so listen to what is revealed:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I Myself have chosen thee; therefore give thou ear to this revelation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I have chosen thee, so hearken unto that which is inspired.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have chosen you. So listen to what is being revealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I! I have chosen thee hearken thou then to that which shall be revealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have chosen you; so listen to what is revealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have chosen thee: listen, then, to the inspiration (sent to thee).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I have chosen you. So listen to that which is inspired to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have chosen you. Therefore, listen to what shall be revealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have chosen you, so listen to what is revealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I have chosen you, so listen to what is revealed [to you].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:13] And I [Myself] have chosen you, from among [all of] your people, so listen to what is being revealed, to you from Me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And I have chosen thee) to carry the message to Pharaoh, (so hearken unto that which is inspired) so act upon that which you have been commanded.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد وصولك إلى مقام الكشف والشهود { أَنَا ٱخْتَرْتُكَ } أي: اصطفيتك من المكاشفين من أرباب الولاية للتكميل والرسالة على الناس النسين التوجه إلى بحر الحقيقة، فعليك التوجه إلى الإهداء والتجنب عن الميل إلى الهوى { فَٱسْتَمِعْ } أي: اقتصر في تكميلك ورسالتك { لِمَا يُوحَىۤ } [طه: 13] إليك من مقام عظيم جودنا، ولا تلتفت إلى الأهواء الفاسدة، حتى لا تضف أنت، ولا تضلهم عن السبيل، فبلّغ إلى الناس نيابة عني: { إِنَّنِيۤ أَنَا ٱللَّهُ } الواحد الأحد المحيط بجميع مراتب الأسماء { لاۤ إِلَـٰهَ } أي: لا جامع لجميع المراتب { إِلاۤ أَنَاْ } الجامعُ لجميعها، المستحق للإطاعة والانقياد { فَٱعْبُدْنِي } أنت حق عبادتي؛ أي: أحسن الأدب معي، وتخلَّق بأخلاقي { وَأَقِمِ ٱلصَّلاَةَ } أي: دوام الميل بجميع الأعضاء والجوارح { لِذِكْرِيۤ } [طه: 14] أي: توجه نحوي بجميع أعضائك وجوارحك لتذكرَني بها وتشكرَني بجميعها، حتى أنكشف لك من كلٍ منها بحيث كنتُ سمعك وبصرك وبدنك ورجلك، إلى غير ذلك من جوارحك حتى قامت قيامتُك الكبرى، وقمتَ بين يدي المولى، وتمكنتَ في جنة المأوى، عند سدرة المنتهى، التي يرتقي وينتهي إليها عروجك في الصعود والارتقاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنا اخترتُك } أي: اصطفيتُكَ للنبوة والرسالة، وقرأ حمزة: { وإنَّا اخترناك } بنون العظمة، { فاستمع لما يُوحى } أي: للذي يُوحى إليك، أو لوحينا إليك، وهو: { إِنني أنا الله لا إِله إِلا أنا } ، فالجملة بدلَ من \" ما \"\n { فاعبدني } أَفردني بالعبادة والخضوع، والفاء لترتيب ما بعدها على ما قبلها، فإن اختصاص الألوهية به سبحانه من موجبات تخصيص العبادة به تعالى\n { وأقم الصلاة لذكري }: لتذكرني فيها لاشتمالها على الأذكار، وأُفردت بالذكر، مع اندراجها في الأمر بالعبادة لفضلها على سائر العبادات لما نيطت به من ذكر المعبود، وشغل القلب واللسان بذكره، فإنَّ الذكر كما ينبغي لا يتحقق إلا في ضمن العبادة\n أو { لذكري }: لإخلاص ذكري وابتغاء وجهي، بحيث لا تُرائي بها غيري\n وقيل: لذكري إياها، وأمري بها في الكتب، أو لأن أذكرك فيها بالمدح والثناء، وقيل: لأوقات ذكري، وهي مواقيت الصلوات، وقيل: لذكر صلاتي إذا نسيتها، لما رُوِيَ أنه عليه الصلاة والسلام قال:\n\n\n\n \" مَنْ نَامَ عَنْ صَلاَة، أَوْ نَسِيَها، فَلْيُصلِّهَا إِذَا ذَكَرَهَا لأنَّ الله تَعالى يَقُول: \" وأقم الصلاة لذكري \" \n\nقال بعضهم: أصول العمل ثلاثة: أقوال وأفعال وأحوال، فأفضل الأقوال: لا إله إلا الله، وأفضل الأفعال: الصلاة لله أو بالله، وأفضل الأحوال: الطمأنينة بشهود الله",
      "translations": []
    }
  ]
}