{
  "chapter": "طه",
  "text": "يوم ينفخ فى الصور ونحشر المجرمين يومئذ زرقا",
  "translations": [
    {
      "translation": "On the Day the Trumpet is blown - and We will gather the evildoers sightless on that Day -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the trumpet blast is sounded We shall raise the sinners blind,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Day when the Trumpet shall be sounded and We shall muster the sinners, their eyes turned blue with terror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the trumpet will be sounded We will raise the criminals from their graves and their eyes will be turned blue and blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the Trumpet is blown and We shall assemble the guilty on that day, blue -eyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when the Sur will be blown: that Day, We shall gather the criminals blue-eyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the trumpet shall be blown, and We will gather the guilty, blue-eyed, on that day\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day the Trumpet is blown; and We shall muster the sinners upon that day with eyes staring,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when the Trumpet is blown. On that day we assemble the guilty white-eyed (with terror),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Day when the trumpet shall be blown: We shall gather all the sinners on that Day.  Their eyes will turn blue with terror\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day whereon the trumpet will be blown into, and We shall gather the culprits on that Day blear-eyed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—the day the Trumpet will be blown; on that day We shall muster the guilty with blind eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when the Trumpet will be sounded: that Day, We shall gather the sinful, blear-eyed (with terror).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when the Trumpet will be blown (the second blowing): that Day, We shall gather the Mujrimun (criminals, polytheists, sinners, disbelievers in the Oneness of Allah, etc.) Zurqa: (blue or blind eyed with black faces).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when the Horn shall be blown. On that Day, We shall assemble all the sinners with blued eyes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the Trumpet is blown—We will gather the sinners on that Day, blue.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day the Horn will be blown. And We will gather the criminals, that Day, blue-eyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:102] The day the Trumpet is blown, the Horn, the Second Blast, and We shall assemble the criminals, the disbelievers, on that day bruised, in the eye along with their faces blackened.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The day when the Trumpet is blown) i.e. on the first blowing of the Trumpet. (On that day we assemble the guilty) the idolaters (white-eyed) blind,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَوْمَ يُنفَخُ فِي ٱلصُّورِ } لأخراج ما بالقوة إلى الفعل { وَنَحْشُرُ ٱلْمُجْرِمِينَ } المشركين { يَوْمِئِذٍ زُرْقاً } [طه: 102] زرق العيون سود الوجوه، وهما كنايتان عن الحسد والنفاق اللذَين هم عليهما في دار الدنيا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { يتخافتون }: استئناف مُبين لحالهم يومئذ، أو حال أخرى من { المجرمين }\n و { قاعًا }: حال من ضمير { يذرها } ، أو مفعول ثان ليذر\n و { صفصفًا }: حال ثانية، أو بدل من المفعول الثاني، وجملة: { لا ترى }: استئناف مبين لما سبق من القاع الصفصف، أو حال أخرى، و { يومئذ }: ظرف ليتبعون، أو بدل من { يوم القيامة }\n يقول الحقّ جلّ جلاله: { وقد آتيناك } يا محمد { من لَّدُنا } خصوص عنديتنا { ذِكْرًا } عظيمًا وقرآنا كريمًا، جامعًا لكل كمال، مُخبرًا بعجائب القصص والأمثال\n\n\n{ مَنْ أعْرَضَ عنه } أي: عن ذلك الذِكْر العظيم الشأن، المستتبع لسعادة الدارين، بأن لم يؤمن به، { فإِنه يحملُ يومَ القيامة وِزْرًا } أي: عقوبة ثقيلة فادحة على كفره وسائر ذنوبه\n وتسميتها وزرًا لتشبيهها في ثقلها على المعاقَب، وصعوبة احتمالها، بالحمل الذي يُثقل الحامل ويُنقِضُ ظهره، وقيل: يُجسّم، ويُجعل على ظهره في طريق الحشر، والأول أنسب لقوله: { خالدين فيه } أي: في ذلك الوزر، وهو العذاب، أو في ذلك الحمل الثقيل لاستمراره فيه بعد دخول النار، { وساء لهم يوم القيامة حِمْلاً } أي: بئس حملهم هذا يوم القيامة، وإعادة يوم القيامة لزيادة التهويل\n { يوم يُنفخُ في الصُّور } أي: ذلك اليوم هو يوم يُنفخ في الصور، أو: اذكر يوم ينفخ في الصور نفخة البعث، { ونَحشُر المجرمين } أي: المشركين { يومئذٍ } أي: يوم ينفخ في الصور، وأعاده، تهويلاً، حَال كونهم { زُرقًا } أي: زُرق العُيون\n وإنما جُعلوا كذلك لأن الزرقة أسوأ ألوان العين وأبغضها إلى العرب، وكانت تتشاءم بزرقة العين، كما قال الشاعر:\n\nوقيل زرقًا، أي: عُميًا لأن حدقة العين تزرق من شدة العمى\n وقيل: عِطاشًا لأن سواد العين يتغير من شدة العطش ويرزق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:20",
      "similarity": 0.18317641544924992
    },
    {
      "verse": "69:13",
      "similarity": 0.17841351297379657
    },
    {
      "verse": "6:73",
      "similarity": 0.17445328596945808
    },
    {
      "verse": "39:68",
      "similarity": 0.1643865714894471
    },
    {
      "verse": "18:99",
      "similarity": 0.16230208909660418
    }
  ]
}