{
  "chapter": "طه",
  "text": "وكذلك انزلنه قرءانا عربيا وصرفنا فيه من الوعيد لعلهم يتقون او يحدث لهم ذكرا",
  "translations": [
    {
      "translation": "In this way We have sent it down as an Arabic Qur'an and We have made various threats in it so that hopefully they will have taqwa or it will spur them into remembrance.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is why We have sent it down as an eloquent Qur'an, and explained in different ways the intimidations through it that they may haply take heed, or perhaps it may lead them to contemplate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), thus have We revealed this as an Arabic Qur'an and have expounded in it warning in diverse ways so that they may avoid evil or become heedful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed the Quran in the Arabic language containing various warnings so that it may cause them to have fear (of God) or take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how We revealed it as an Arabic Qur’an, and in different ways gave promises of punishment, that they may fear or it may create some pondering in their hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have sent it down as a Qur'an in Arabic, and have explained therein in detail the warnings, in order that they may have Taqwa, or that it may cause them to have a lesson from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We sent it down an Arabic Quran, and have distinctly set forth therein of threats that they may guard (against evil) or that it may produce a reminder for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so We have sent it down as an Arabic Koran, and We have turned about in it something of threats, that haply they may be godfearing, or it may arouse in them remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus we have revealed it as a Lecture in Arabic, and have displayed therein certain threats, that peradventure they may keep from evil or that it may cause them to take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have thus sent down the Quran in Arabic and given all kinds of warnings in it, so that they may fear God, or may take heed --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Thus We have sent it down, an Arabic Recitation, and have propounded variously therein of the threats, that haply they may fear, or that it may generate in them some admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have sent it down as an Arabic Quran and We have paraphrased the warnings in it variously so that they may be Godwary, or it may prompt them to remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We sent this down - an arabic Qur'an - and explained therein in detail some of the warnings, in order that they may fear Allah, or that it may cause their remembrance (of Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have sent it down as a Quran in Arabic, and have explained therein in detail the warnings, in order that they may fear Allah, or that it may cause them to have a lesson from it (or to have the honour for believing and acting on its teachings).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such We sent it down, an Arabic Koran, and explained in it threats in order that they be cautious, or, that it prompts the Remembrance in them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have revealed it an Arabic Quran, and We have diversified the warnings in it, that perhaps they would become righteous, or it may produce a lesson for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have sent it down as an Arabic Qur'an and have diversified therein the warnings that perhaps they will avoid [sin] or it would cause them remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:113] Thus (kadhālika, a supplement to [the previous] kadhālika naqussu, ‘thus We relate’ [Q. 20:99]), just as We have revealed what has been mentioned, We have revealed it, that is, the Qur’ān, as an Arabic Qur’ān, and   We have distributed, We have repeated, in it [statements] of threats, so that they may fear, associating others with God, or it, the Qur’ān, may arouse in them a remembrance, of the destruction of those communities before, and may thus be admonished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَكَذَلِكَ أَنْزَلْنَاهُ قُرْآَنًا عَرَبِيًّا وَصَرَّفْنَا فِيهِ مِنَ الْوَعِيدِ لَعَلَّهُمْ يَتَّقُونَ أَوْ يُحْدِثُ لَهُمْ ذِكْرًا (113) عطف على جملة { كذلك نقص عليك من أنباء ما قد سبق } \\[ طه : 99 \\] ، والغرض واحد ، وهو التنويه بالقرآن . فابتدىء بالتنويه به جزئياً بالتنويه بقصصه ، ثمّ عطف عليه التنويه به كليّاً على طريقة تشبه التذييل لما في قوله { أنزلناه قرآناً عربياً } من معنى عموم ما فيه .والإشارة ب { كذلك } نحوُ الإشارة في قوله { كذلك نقص عليك } ، أي كما سمعته لا يُبين بأوضح من ذلك .و { قرآناً } حال من الضمير المنصوب في { أنزلناه }. وقرآن تسمية بالمصدر . والمراد المقروء ، أي المتلو ، وصار القرآن علماً بالغلبة على الوحي المنزل على محمد صلى الله عليه وسلم بألفاظ معينة متعبّداً بتلاوتها يعجز الإتيان بمثل سورة منها . وسمي قرآناً لأنه نظم على أسلوب تسهل تلاوته . ولوحظ هنا المعنى الاشتقاقي قبل الغلبة وهو ما تفيده مادة قرأ من يسر تلاوته؛ وما ذلك إلاّ لفصاحة تأليفه وتناسب حروفه . والتنكير يفيد الكمال ، أي أكمل ما يقرأ .و { عربياً } صفة { قرآناً }. وهذا وصف يفيد المدح ، لأنّ اللغة العربية أبلغ اللّغات وأحسنها فصاحة وانسجاماً . وفيه تعريض بالامتنان على العرب ، وتحميق للمشركين منهم حيث أعرضوا عنه وكذبوا به ، قال تعالى : { لقد أنزلنا إليكم كتاباً فيه ذكركم أفلا تعقلون } \\[ الأنبياء : 10 \\].والتصريف : التنويع والتفنين . وقد تقدّم عند قوله تعالى : { انظر كيف نصرف الآيات ثم هم يصدفون } في سورة الأنعام ( 46 ) ، وقوله { ولقد صرفنا } في هذا القرآن ليذكروا في سورة الإسراء ( 41 ).وذكر الوعيد هنا للتهديد ، ولمناسبة قوله قبله { وقد خاب من حمل ظلماً } \\[ طه : 111 \\].والتقوى : الخوف . وهي تستعمل كناية عن الطاعة لله ، أي فَعلْنا ذلك رجاء أن يؤمنوا ويطيعوا . والذكر هنا بمعنى التذكر ، أي يُحدث لهم القرآن تذكراً ونظراً فيما يحق عليهم أن يختاروه لأنفسهم .وعبر ب { يحدث } إيماء إلى أن الذكر ليس من شأنهم قبل نزول القرآن ، فالقرآن أوجد فيهم ذكراً لم يكن من قبل ، قال ذو الرمة :ولما جرت في الجزل جرياً كأنه ... سنا الفجر أحدثنا لخالقها شُكراًو ( لعل ) للرجاء ، أي إن حال القرآن أن يقرّب الناس من التقوى والتذكر ، بحيث يمثَّل شأن من أنزله وأمر بما فيه بحال من يرجو فيلفظ بالحرف الموضوع لإنشاء الرجاء . فحرف ( لعل ) استعارة تبعية تنبىء عن تمثيلية مكنية ، وقد مضى معنى ( لعل ) في القرآن عند قوله تعالى : { يا أيها الناس اعبدوا ربكم الذي خلقكم والذين من قبلكم لعلكم تتقون } في سورة البقرة ( 21 ).وجملة فتعالى الله الملك الحق } معترضة بين جملة { وكذلك أنزلناه } وبين جملة { ولا تعجل بالقرآن }. وهذا إنشاء ثناء على الله منزل القرآن وعلى منة هذا القرآن ، وتلقين لشكره على ما بيّن لعباده من وسائل الإصلاح وحملهم عليه بالترغيب والترهيب وتوجيهه إليهم بأبلغ كلام وأحسن أسلوب فهو مفرع على ما تقدم من قوله { وكذلك أنزلناه قرآناً عربياً } إلى آخرها . . .والتفريع مؤذن بأن ذلك الإنزال والتصريف ووسائل الإصلاح كلّ ذلك ناشىء عن جميل آثار يشعر جميعها بعلوه وعظمته وأنه الملك الحق المدبر لأمور مملوكاته على أتم وجوه الكمال وأنفذ طرق السياسة .وفي وصفه بالحق إيماء إلى أن مُلك غيره من المتَسَميّن بالملوك لا يخلو من نقص كما قال تعالى : { الملك يومئذ الحق للرحمان } \\[ الفرقان : 26 \\]. وفي الحديث : \" فيقول الله أنا الملِكُ أيْنَ ملوك الأرض \" ، أي أحضروهم هل تجدون منهم من ينازع في ذلك ، كقول الخليفة معاوية حين خطب في المدينة «يا أهل المدينة أين علماؤكم» .\n\n",
      "translations": [
        {
          "translation": "(Thus We have revealed it as a Lecture in Arabic) We have sent down Gabriel with the Qur'an to Muhammad (pbuh) in the Arabic usage, (and have displayed therein) and have exposited in the Qur'an (certain threats) i.e. threats and promises, (that peradventure they may keep from evil) that perhaps they may ward off disbelief, idolatry and indecencies (or that it may cause them to take heed) or obtain a reward if they believed; it is also said that this means: or obtain eminence through the profession of Allah's divine Oneness; it is also said that this means: or incur chastisement if they did not believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَصَرَّفْنَا فِيهِ مِنَ ٱلْوَعِيدِ } معناه بَيَّنا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd He has diverted us from the path of truth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ } أي: مثل إحاطة علمنا بجميع الأشياء { أَنزَلْنَاهُ } أي: هذا الكتاب المحيط بجميع ما في العالم\n إذ لا رطب ولا يابس إلا فيه { قُرْآناً عَرَبِيّاً } أي: كلاماً عربيَّ الأسلوب { وَصَرَّفْنَا فِيهِ مِنَ ٱلْوَعِيدِ } أي: كثر تصرفنا فيه من الإنذارات والتخويفات { لَعَلَّهُمْ يَتَّقُونَ } رجاء أن يتوجهوا إلى توحيدنا ويجتنبوا عن شركنا { أَوْ يُحْدِثُ } ويجدد وعيد القرآن { لَهُمْ ذِكْراً } [طه: 113] من أحوال الماضين\n وعقاب الله عليهم من الغرق والمسخ والكسف والخسف لعلهم يتذكرون\n\n\nوإن قالوا على سبيل المكابرة عتواً وعناداً: لربك حاجة إلى إيماننا وتقوانا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وكذلك }: عطف على قوله: { كذلك نقصّ } \n و \" ذلك \": إشارة إلى إنزال ما سبق من الآيات المتضمنة للوعيد\n المنبئة عما سيقع من أهوال يوم القيامة\n يقول الحقّ جلّ جلاله: { وكذلك } أي: ومثل ذلك الإنزال المتقدم\n { أنزلناه } أي: القرآن كله\n وإضماره\n من غير سبقية ذكره للإيذان بنباهة شأنه\n وكونه مركوزًا في العقول\n حاضرًا في الأذهان\n حال كونه: { قرآنًا عربيًّا } ليفهمه العرب\n ويقفوا على ما فيه من النظم المعجز\n الدال على كونه خارجًا عن طوق البشر\n نازلاً من عند خلاّق القوى والقُدَر\n { وصرَّفْنا فيه من الوعيد } أي: كررنا فيه بعض الوعيد\n أو من جنس الوعيد\n { لعلهم يتقون } أي كي يتقوا الكفر والمعاصي بالفعل\n { أو يُحْدِثُ لهم ذِكْرًا } اتعاظًا واعتبارًا يؤديهم إلى الارتقاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:2",
      "similarity": 0.5592827672206988
    },
    {
      "verse": "43:3",
      "similarity": 0.5295983162388057
    },
    {
      "verse": "41:3",
      "similarity": 0.4678734669008692
    },
    {
      "verse": "13:37",
      "similarity": 0.4335804852653609
    },
    {
      "verse": "39:28",
      "similarity": 0.39669056226745664
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020113.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020113.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:113.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}