{
  "chapter": "طه",
  "text": "وامر اهلك بالصلوة واصطبر عليها لا نسـلك رزقا نحن نرزقك والعقبة للتقوى",
  "translations": [
    {
      "translation": "Instruct your family to do salat, and be constant in it. We do not ask you for provision. We provide for you. And the best end result is gained by taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enjoin on your people service to God, and be yourself constant in it. We do not ask you to provide: It is We who provide for you. The reward is for piety and fear of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enjoin Prayer on your household, and do keep observing it. We do not ask you for any worldly provision; rather, it is We Who provide you, and ultimately the pious will end up the best.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Instruct your family to pray and to be steadfast in their worship. We do not ask any sustenance from you; it is We who give you sustenance. Know that piety will have a happy end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And command your household to establish prayer, and yourself be steadfast in it; We do not ask any sustenance from you; We will provide you sustenance; and the excellent result is for piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And enjoin Salah on your family, and be patient in offering them. We ask not of you a provision: We provide for you. And the good end is for those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And enjoin prayer on your followers, and steadily adhere to it; We do not ask you for subsistence; We do give you subsistence, and the (good) end is for guarding (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bid thy family to pray, and be thou patient in it; We ask of thee no provision, but it is We who provide thee and the issue ultimate is to godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And enjoin upon thy people worship, and be constant therein. We ask not of thee a provision: We provided for thee. And the sequel is for righteousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bid your people say their prayers, and be constant in their observance. We demand nothing from you. It is We who provide for you, and the best end is that of righteousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And command thy household for prayer, and persevere thou therein; We ask not of thee any provision; we Who provide thee; and the happy end is for piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bid your family to prayer and be steadfast in maintaining it. We do not ask any provision of you: it is We who provide for you, and to Godwariness belongs the ultimate outcome [in the Hereafter].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enjoin prayer on thy people, and be constant therein. We ask thee not to provide sustenance: We provide it for thee. But the (fruit of) the Hereafter is for righteousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And enjoin As-Salat (the prayer) on your family, and be patient in offering them [i.e. the Salat (prayers)]. We ask not of you a provision (i.e. to give Us something: money, etc.); We provide for you. And the good end (i.e. Paradise) is for the Muttaqun (pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Order your family to pray and be patient in it. We do not ask you for provisions, rather, it is We who provide for you. And the final outcome is for the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And exhort your people to pray, and patiently adhere to it. We ask of you no sustenance, but it is We who sustain you. The good ending is that for righteousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And enjoin prayer upon your family [and people] and be steadfast therein. We ask you not for provision; We provide for you, and the [best] outcome is for [those of] righteousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:132] And bid your family to prayer, and be steadfast in [the maintenance of] it. We do not ask of you, We [do not] charge you with [the procurement of], any provision, [either] for yourself or for anyone else. We [it is Who] provide you, and the [best] sequel, Paradise, will be in favour of God-fearing, for such people.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And enjoin upon thy people worship) in the time of hardship, (and be constant therein) be steadfast in prayer. (We ask not of thee a provision) We do not ask you to be the provider of yourself or your family: (We provide for thee. And the sequel is for righteousness) Paradise is for the person who wards off disbelief, idolatry and indecencies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأْمُرْ أَهْلَكَ } معناه قومُكَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And command your people} means your people.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ليكون لهم نصيبُ مما تفضل الله به عليك من الرزق المعنوي لذلك أمرناك بقولنا: { أْمُرْ أَهْلَكَ بِٱلصَّلاَةِ } الشاغلة جميع قوامهم عن التوجه إلى غيرنا\n ليكون منبهاً عليهم على ما في استعدادهم { وَٱصْطَبِرْ عَلَيْهَا } أي: تحمَّل على متاعب تبليغها\n ولا تقصِّر خوفاً من انتقاص رزقك\n لأنا { لاَ نَسْأَلُكَ } أي: لا نسأل منهم { رِزْقاً } وجُعلاً لأجلك منهم حتى يشقَّ عليهم\n بل { نَّحْنُ نَرْزُقُكَ } وإياهم من مقام جودنا ونوالِ إفضالنا من غير أن ينقص من خزائننا شيءٌ\n\n\nونبِّههم أيضاً على العواقب الحميدة المترتبة على الصلاة\n وجنِّبهم عن شواغلها { وَ } قل لهم: { ٱلْعَاقِبَةُ } الحميدة { لِلتَّقْوَىٰ } [طه: 132] أي: المتصفين بالتقوى\n أي: الراضين عن الله بما يرضى لهم ويأمرهم\n المجتنبين عما لا يرضى منه سبحانه\n\n\nولما سمعوا كشفك وشهودك ورزقك الأوفى من عند ربك\n وإرشادك على من آمن بك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولذلك قال له صلى الله عليه وسلم: { وَأْمُرْ أهْلَكَ بالصلاةِ } \n أمره بأن يأمر أهل بيته\n أو التابعين له من أمته\n بالصلاة\n بعد ما أمر هو بقوله: { وسبح بحمد ربك } على ما مر ليتعاونوا على الاستعانة على الخصاصة\n ولا يهتموا بأمر المعيشة\n ولا يلتفتوا لغنى أرباب الثروة\n { واصْطَبر عليها } وتكلف الصبر على مداومتها\n غير ملتفت لأمر المعاش\n { لا نسألك رزقًا } أي: لا نُكلفك أن ترزق نفسك ولا أهلك\n { نحن نرزقك } وإياهم\n ففرغ قلبك لمشاهدة أسرارنا\n { والعاقبةُ } المحمودة { للتقوى } أي: لأهل التقوى\n رُوي أنه صلى الله عليه وسلم كان إذا أصاب أَهْلَه ضُر أو خصاصة أَمَرهُمْ بِالصّلاة\n وتلا هذه الآية\n والله تعالى أعلم\n الإشارة: ما خوطب به نبينا صلى الله عليه وسلم خوطب به خاصة أمته\n فلا تمدن عينيك\n أيها الفقير\n إلى ما متع به أهل الدنيا\n من زهرتها وبهجتها\n بل ارفع همتك عن النظر إليها\n واستنكف عن استحسان ما شيدوا وزخرفوا\n فإن ذلك حمق وغرور\n كان عروة بن الزبير رضي الله عنه إذا رأى أبناء السلاطين وشاراتهم دخل داره وتلا: { ولا تمدن عينيك… } الآية\n وكان يحيى بن معاذ الرازي يقول لعلماء زمانه: يا علماء السوء دياركم هامانية\n ومراكبكم قارونية\n وملابسكم فرعونية\n فأين السنة المحمدية؟ ولا تشتغل بطلب رزق فرزق ربك - وهو ما يبرز لك في وقتك من عين المنة\n من غير سبب ولا خدمة - خير وأبقى -\n أما كونه خيرًا فلِمَا يصحبه من اليقين والفرح بالله وزيادة المعرفة\n وأما كونه أبقى لأن خزائنه لا تنفد\n مع بقاء أثره في القلب من ازدياد اليقين\n والتعلق برب العالمين\n { وأْمر أهلك بالصلاة } واصطبر أنت عليها\n فإن رزقنا يأتيك لا محالة\n في الوقت الذي نريده\n { لا نسألك رزقًا } لك ولا لأهلك\n { نحن نرزقك } \n لكن رزق المتقين\n لا رزق المترفين\n { والعاقبة للتقوى }\n وبالله التوفيق\n ثمَّ ذكر بعض أقاويل الكفرة التي أمر عليه الصلاة والسلام بالصبر عليها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:126",
      "similarity": 0.4554101387153765
    },
    {
      "verse": "11:49",
      "similarity": 0.3880861874067924
    },
    {
      "verse": "13:24",
      "similarity": 0.3858268008322729
    },
    {
      "verse": "8:3",
      "similarity": 0.38156305696660253
    },
    {
      "verse": "19:55",
      "similarity": 0.3587279352802666
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/20:132.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/20:132.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/20:132.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}