{
  "chapter": "طه",
  "text": "وكذلك نجزى من اسرف ولم يؤمنۢ بـايت ربه ولعذاب الءاخرة اشد وابقى",
  "translations": [
    {
      "translation": "That is how We repay anyone who is profligate and does not have iman in the Signs of his Lord. And the punishment of the Next World is much harsher and longer lasting.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that is how We requite him who is extravagant and does not believe the signs of his Lord; and surely the punishment of the Hereafter is far more severe and persistent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We requite him who transgresses and does not believe in the signs of your Lord (during the life of the world); and surely the punishment of the Hereafter is even more terrible and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We recompense those who are unjust and have no faith in Our revelations. The torment in the life to come will be more severe and last longer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how We reward him who transgresses and does not accept faith in the signs of his Lord; and indeed the punishment of the Hereafter is the most severe and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We requite him who transgresses beyond bounds and believes not in the Ayat of his Lord; and the torment of the Hereafter is far more severe and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We recompense him who is extravagant and does not believe in the communications of his Lord, and certainly the chastisement of the hereafter is severer and more\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We recompense him who is prodigal and believes not in the signs of his Lord; and the chastisement of the world to come is more terrible and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We reward him who is prodigal and believeth not the revelations of his Lord; and verily the doom of the Hereafter will be sterner and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We shall reward the transgressor who denies the signs of his Lord. But the suffering of the life to come is more terrible and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We requite him who trespasseth and believeth not in the signs of his Lord, and surely the torment of the Hereafter is most severe and most lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We requite those who transgress and do not believe in the signs of their Lord, and the punishment of the Hereafter is severer and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We recompense him who transgresses beyond bounds and believes not in the Signs of his Lord: and the Penalty of the Hereafter is far more grievous and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We requite him who transgresses beyond bounds [i.e. commits the great sins and disobeys his Lord (Allah) and believes not in His Messengers, and His revealed Books, like this Quran, etc.], and believes not in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of his Lord, and the torment of the Hereafter is far more severe and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this way We recompense the prodigal who disbelieves the verses of his Lord. But the punishment of the Everlasting Life is more terrible and everlasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We recompense him who transgresses and does not believe in the revelations of his Lord. The punishment of the Hereafter is more severe, and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We recompense he who transgressed and did not believe in the signs of his Lord. And the punishment of the Hereafter is more severe and more enduring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:127] And so, just as We requite him who disregards the Qur’ān, We requite him who is prodigal, [him who] associates others with God, and believes not in the signs of his Lord. And the chastisement of the Hereafter is more terrible, than the chastisement of the life of this world and the punishment of the grave, and more enduring, longer lasting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus do We reward him who is prodigal) him who associates partners with Allah (and believeth not the revelations of his Lord) i.e. the Scripture and the Messenger; (and verily the doom of the Hereafter will be sterner and more lasting) than the torment of this worldly life.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ } أي: مثل نسيان من أعرض في العذاب { نَجْزِي } ونترك منسياً في جهنم { مَنْ أَسْرَفَ } وأفرط في الإعراض عن الله ورسله بمتابعة العقل واعتباراته ومضى عليها زماناً { وَلَمْ يُؤْمِن } أي: لم يُذعن ولم يُوقن { بِآيَاتِ رَبِّهِ } النازلة على أنبيائه ورسله\n ولم ينتبه لمرموزاتها ومكنوناتها { وَ } الله وإن احتمل الشدائد\n وارتكب المتاعب في تحصيل تلك الاعتبارات { لَعَذَابُ ٱلآخِرَةِ } في شأنه لاشتغاله بغير الله وإعراضه عن آياته { أَشَدُّ } من شدائد ذلك التحصيل { وَأَبْقَىٰ } [طه: 127] وأدوم وباله من النخوة المترتبة عليها\n\n\n{ أَ } ينكر القريشي بآياتنا ويصر على إنكارها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولم يُؤمن بآياتِ ربه } \n بل كذّب بها وأعرض عنها\n { ولعذابُ الآخرة } على الإطلاق\n أو عذاب النار\n { أشدُّ وأبقى } من ضنك العيش\n أو منه ومن الحشر أعمى\n عائذًا بالله من جميع ذلك\n الإشارة: قوله تعالى: { وعصى آدمُ ربَّه } \n اعلم أن العصيان الحقيقي هو عصيان القلوب\n كالتكبر على عباد الله وتحقير شيء من خلق الله\n وكالاعتراض على مقادير الله\n وعدم الرضا بأحكام الله\n قال بعض الصوفية: أذنبتُ ذنبًا فأنا أبكي منه أربعين سنة\n قيل: وما هو؟ قال: قلت لشيء كان: ليته لم يكن\n وأما معصية الجوارح\n إن لم يكن معها إصرار\n فقد تُوجب القرب من الكريم الغفار \" معصية أورثت ذُلاً وافتقارًا خير من طاعة أورثت عزّا واستكبارًا \" \n وربما قضى عليك بالذنب فكان سبب الوصول وتأمل معصية إبليس حيث كانت من القلب أورثت طردًا وإبعادًا\n ومخالفة آدم حيث كانت الجوارح أورثت قُربًا واجتباء\n والحاصل: أن كل ما يَردُّ العبد إلى مولاه\n ويحقق له العبودية والانكسار\n فهو شرف له وكمال\n وكل ما يُقوي وجود النفس ورفعتها فهو نقص وإبعاد\n كائنًا ما كان\n فالعصمة والحِفظة إنما هي من المعاصي القلبية\n أو من الإصرار\n وأما معاصي الجوارح فيجري على العبد ما كتب\n ولا تنقصه\n بل تكمله\n كما تقدم فالتنزيه إنما يكون من النقائص\n وهي التي تُوجب البعد عن الحق\n لا مما يؤدي إلى الكمال\n وبهذا تفهم أن ما وقع من الأنبياء - عليهم السلام - مما صُورته المعصية\n ليس بنقص\n إنما هو كمال\n وكذا ما يصدر من الأولياء\n على سبيل الهفوة\n فتأمله\n ولا تبادر بالاعتراض\n حتى تصحب الرجال\n فيعلموك النقص من الكمال\n قال الواسطي: العصيان لا يُؤثر في الاجتبائية\n وقوله: { وعصى } أي: أظهر خلافًا\n ثم أدركته الاجتبائية فأزالت عنه مذمة العصيان\n ألا ترى كيف أظهر عذره بقوله: { فنسي ولم نجد له عزمًا }\n هـ\n وقال الشيخ أبو الحسن الشاذلي رضي الله عنه: نعمت المعصية أورثت الخلافة\n واعلم أن آدم عليه السلام قد أهبط إلى الأرض قبل أن يخلق\n قال تعالى:\n[البَقَرَة: 30] فقد استخلفه قبل أن يخلقه\n لكن حكمته اقتضت وجود الأسباب\n فكان أكله سببًا في نزوله للخلافة والرسالة وعمارة الأرض\n فهو نزول حسًا\n ورفعة معنى\n وكذلك زلة العارف تنزله لشرف العبودية\n فيرتفع قدره عند الله\n  وقوله تعالى: { بعضكم لبعض عدو } \n هذا فيمن غلبت عليها الطينية الإمشاجية\n وأما من غلبت عليه الروحانية فهم إخوان متحابون\n أخلاء متقون\n قال تعالى:\n[الزُّخرُف: 67]\n وقوله تعالى: { فإما يأتينكم مني هدى } أي: داع يدعو إليَّ\n ويهدي إلى معرفتي ودخول حضرتي\n فمن تبعهم دخل تحت تربيتهم\n فلا يضل ولا يشقى\n بل يهتدي ويسعد السعادة العظمى\n\nومن أعرض عن ذكرهم ووعظهم\n وتنكب عن صحبتهم\n فإن له معيشة ضنكًا\n مصحوبة بالحرص والطمع\n والجزع والهلع\n ونحشره يوم القيامة أعمى عن شهود ذاتنا\n فلا يرى إلا الأكوان الحسية\n والزخارف الحسية دون أسرار الذات القدسية\n قال ربِّ لِمَ حشرتني أعمى عن شهود أسرار المعاني\n عند رؤية الأواني\n وقد كنتُ بصيرًا في الدنيا ببصر الحس؟ قال: كذلك أتتك آياتنا\n وهم الأولياء العارفون\n فنسيتها ولم تحتفل بشانها\n وكذلك اليوم تُنسى لأن المرء يموت على ما عاش عليه\n ويُبعث على ما مات عليه\n  قال الورتجبي: ونحشره يوم القيامة أعمى\n يعني: جاهلاً بوجود الحق\n كما كان جاهلاً في الدنيا\n كما قال عليّ - كرم الله وجهه -: من لم يعرف الله في الدنيا لا يعرفه في الآخرة\n وقيل: عن رؤية أوليائه وأصفيائه\n هـ\n وقال القشيري: في الخبر:\n \" مَنْ كان بحالة لقي الله بها \" \nفَمن كان في الدنيا أعمى القلب\n يُحشرُ على حالته\n يعيش على ما جهل\n ويُحشر على ما جهل\n ولذلك يقولون: { من بعثنا من مرقدنا }؟ إلى أنْ تصيرْ معارفُهم ضرورية\n كما يَتركون التَدبُّرَ في آياتهِ يُتركون غدًا في العقوبة من غير رحمةٍ على ضعفِ حالاتهم\n هـ\n  وكذلك نجزي من أسرف بالعكوف على شهواته\n واغتنام أوقات لذاته\n حتى انقضت أيام عمره في البطالة\n نجزيه غم الحجاب والبعد عن حضرة الأحباب\n حيث لم يصدق بوجود آيات ربه وهم الدعاة إلى الله\n ولعذاب حجاب الآخرة أشد وأبقى لدوامه واتصاله\n نعوذ بالله من غم الحجاب وسوء الحساب\n والتخلف عن حضرة الأحباب\n وبالله التوفيق\n  ثمَّ حض على الاعتبار في هذه الدار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "87:17",
      "similarity": 0.5403918378255244
    },
    {
      "verse": "26:151",
      "similarity": 0.4877181120889212
    },
    {
      "verse": "69:8",
      "similarity": 0.4864434446254769
    },
    {
      "verse": "74:28",
      "similarity": 0.46156732630679054
    },
    {
      "verse": "11:86",
      "similarity": 0.4591699850975995
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020127.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020127.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:127.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}