{
  "chapter": "طه",
  "text": "ما انزلنا عليك القرءان لتشقى",
  "translations": [
    {
      "translation": "We have not sent down the Qur'an to you that you should be burdened,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not reveal the Qur'an to you to cause you distress;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent the Quran only as reminder\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not sent down this Qur’an upon you (O dear Prophet Mohammed – peace and blessings be upon him) for you to fall into hardship! (Either because he used to pray at length during the night or because he was distressed due to the disbelievers not accepting faith.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not sent down the Qur'an unto you to cause you distress,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not revealed the Quran to you that you may be unsuccessful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not sent down the Koran upon thee for thee to be unprosperous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not revealed unto thee (Muhammad) this Qur'an that thou shouldst be distressed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not sent the Quran down to you to distress you,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not Sent down on thee the Qur'an that thou shouldst be distressed. *Chapter: 20\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send down to you the Quran that you should be miserable,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not sent down the Qur'an to thee to be (an occasion) for thy distress,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not sent down the Quran unto you (O Muhammad SAW) to cause you distress,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not sent down the Koran to you for you to be tired,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not reveal the Quran to you to make you suffer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not sent down to you the Qur'an that you be distressed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:2] We have not revealed the Qur’ān to you, O Muhammad (s), that you should be miserable, that you should toil because of what you used to do after it was revealed [to you], in the way of long vigils performing night prayers; in other words, so unburden your soul;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said upon the explanation of Allah's saying: (Ta. Ha. We have not revealed unto thee (Muhammad) this Qur'an that thou shouldst be distressed) We have not revealed the Qur'an to you that you should toil. This verse was revealed when the Prophet (pbuh) used to stand in prayer at night vigil until his feet swelled up, and so Allah alleviated this for him through this verse. He said: Taha, which in the dialect of Mecca means: man, i.e. Muhammad, We have not sent Gabriel with the Qur'an for you to toil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَآ أَنَزَلْنَا } من مقام إرشادنا وتكملينا { عَلَيْكَ } أيها المتوجهُ إلى السعادة الأبدية، المعِرضُ عن الشقاوة { ٱلْقُرْآنَ } الفرقانَ بين الهداية والضلالة، والسعادة والشقاوة { لِتَشْقَىٰ } [طه: 2] أي: لتكون شقياً بنزوله بعدما كنت سعيداً قبله كما توهمه الكفار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قلت: المتبادر من سبب نزولها ومن قوله: { ما أنزلنا }: إما القسم أو النداء، فالقَسَم على أن ذلك من أسماء الله، والنداء على كون ذلك بمعنى يا رجل، أو من أسمائه صلى الله عليه وسلم\n وأمَّا غير ذلك فبعيد، إلا أن يكون ما بعد ذلك استئنافًا بعد الوقف على \" طه \"\n قاله في الحاشية",
      "translations": []
    }
  ]
}