{
  "chapter": "طه",
  "text": "ان اقذفيه فى التابوت فاقذفيه فى اليم فليلقه اليم بالساحل ياخذه عدو لى وعدو له والقيت عليك محبة منى ولتصنع على عينى",
  "translations": [
    {
      "translation": "\"Place him into the box and throw it into the sea and the sea will wash it up on the shore, where an enemy of Mine and his will pick it up.\" I showered you with love from Me so that you would be brought up under My supervision.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put him in a wooden box and cast it in the river. The river will cast it on the bank. An enemy of Ours, and his, will retrieve it.' We bestowed Our love on you that you may be reared under Our eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put the baby into a chest and then throw him in the river. The river will throw him up on the shore, and then an enemy of Mine and an enemy of his will take him.' And I spread My love over you in order that you might be reared in My sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to lace her child in a chest and throw it into the sea which would hurl it towards the shore. Then an enemy of Mine who was also the enemy of the child would pick it up from there. I made you attractive and loveable so that you would be reared before My own eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“That, ‘Put him into a chest and cast it into the river, so the river shall deposit it on to a shore – therefore one who is an enemy to Me and you, shall pick him up’; and I bestowed upon you love from Myself; and for you to be brought up in My sight.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: `Put him (the child) into the Tabut and put it into the river; then the river shall cast it up on the bank, and there, an enemy of Mine and an enemy of his shall take him.' And I endued you with love from Me, in order that you may be brought up under My Eye.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: Put him into a chest, then cast it down into the river, then the river shall throw him on the shore; there shall take him up one who is an enemy to Me and enemy to him, and I cast down upon you love from Me, and that you might be brought up before My eyes;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cast him into the ark, and cast him into the river, and let the river throw him up on the shore. An enemy of Mine and his shall take him.\" And I loaded on thee love from Me, and to be formed in My sight,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: Throw him into the ark, and throw it into the river, then the river shall throw it on to the bank, and there an enemy to Me and an enemy to him shall take him. And I endued thee with love from Me that thou mightest be trained according to My will,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put him into a chest, then cast it into the river. The river will cast it on to the bank, and there he shall be taken up by an enemy of Mine and his.' I showered My love on you so that you might be reared under My watchful eye.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying! cast him in the ark, and cast him into the river, and the river will throw him on the bank, and then an enemy of Mine and an enemy of his will take him up. And I cast on thee love from Me in order that thou mayest be formed under Mine eye.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Put him in the casket, and cast it into the river. Then the river will cast it on the bank, and he shall be picked up by an enemy of Mine and an enemy of his.” And I made you endearing, and that you might be reared under My [watchful] eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw (the child) into the chest, and throw (the chest) into the river: the river will cast him up on the bank, and he will be taken up by one who is an enemy to Me and an enemy to him': But I cast (the garment of) love over thee from Me: and (this) in order that thou mayest be reared under Mine eye.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: 'Put him (the child) into the Tabut (a box or a case or a chest) and put it into the river (Nile), then the river shall cast it up on the bank, and there, an enemy of Mine and an enemy of his shall take him.' And I endued you with love from Me, in order that you may be brought up under My Eye,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying: \"Put him in the box and cast it into the river. The river will cast him on to the bank, and he shall be taken up by an enemy of Mine and an enemy of his.\" I lavished My Love on you, and to be formed in My Sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`Put him in the chest; then cast him into the river. The river will wash him to shore, where an enemy of Mine and an enemy of his will pick him up. And I have bestowed upon you love from Me, so that you may be reared before My eye.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Saying], 'Cast him into the chest and cast it into the river, and the river will throw it onto the bank; there will take him an enemy to Me and an enemy to him.' And I bestowed upon you love from Me that you would be brought up under My eye.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:39] “Cast him, place him, in the ark, then cast him, [while] in the ark, into the river, [into] the flow of the Nile, and then the river shall throw him up onto the shore, that is, its bank (the imperative here [fa’l-yulqihi, ‘let it throw him’] functions as a predicate); [there] an enemy of Mine and an enemy of his, namely, Pharaoh, shall take him”. And, after he took you, I cast upon you love from Me, that you may be loved by people; and indeed Pharaoh, and all who saw you, loved you; and that you might be reared under My eyes, be nurtured under My guardianship and My protection of you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Saying: Throw him into the ark) put the baby in the ark, (and throw it into the river) and place the ark in the river, (then the river shall throw it on to the bank) of the river, (and there an enemy to Me) as concern Religion, i.e. Pharaoh (and an enemy to him) who intends to kill (shall take him) shall pick him up. (And I endued thee with love from Me) O Moses, such that whoever sees you loves you (that thou mightest be trained according to My will) whatever was done to you was under our very watch,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱقْذِفِيهِ فِي ٱلْيَمِّ } يعني ارمِ بِه في البَحرِ\n\n\n\n\nوقوله تعالى: { وَأَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّي } يعني لا يراه أَحدٌ إِلاَّ أحبَّهُ\n وأَلقيتُ: أَي جَعلتُ\n\n\n\n\nوقوله تعالى: { وَلِتُصْنَعَ عَلَىٰ عَيْنِيۤ } معناه تُغَذَّى عَلَى مَحبتي وقال: بحِفظي وكلايَتِي\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفألهمناها حينئذٍ: { أَنِ ٱقْذِفِيهِ } واطرحيه { فِي ٱلتَّابُوتِ } المصنوع من الخشب فاتَّخَذتْ تابوتاً ووضعتْك فيها، ثم ألهمناها ثانياً إذا وضعت فيه، توكلي على خالقه وحافظه وفوضي أمره إليه { فَٱقْذِفِيهِ فِي ٱلْيَمِّ } يعني: النيل، ولا تخافي من غرفة { فَلْيُلْقِهِ ٱلْيَمُّ بِٱلسَّاحِلِ } ألبتة؛ إذ من عادة الماء إلقاءُ ما فيه إلى جانبه، فإذا قرب من الساحل ورآه الناس { يَأْخُذْهُ } ويأمره بأخذه { عَدُوٌّ لِّي } يعني: فرعون المفرط بدعوى الإلهية لنفسه { وَعَدُوٌّ لَّهُ } يعني: الوليد، أو هو من أبناء بني إسرائيل، وهو عدوُ لهم بل هو سبب عداوة جميعهم في الحقيقة\n\n\n\n\n{ وَ } بعدما أمر عدوك بأخذك والتقاطك من البحر { أَلْقَيْتُ } من كمال قدرتي ووفور حولي وقوتي في نفس فرعون وزوجته آسية - رضي الله عنها - وأهل بيته { عَلَيْكَ } أي: على حفظِك وحضانتِك يا موسى { مَحَبَّةً } في قلوبهم مع شدة عداوتهم معك، وكانت تلك المحبة صادرةُ { مِّنِّي } فظاهرهم حفظاً لك وإظهاراً لكمال قدرتي بأن أربيك في يد عدوك؛ لتكون سبباً لهلاكه { وَ } إنما القيتُ في قلوبهم المحبة مني { لِتُصْنَعَ } ولتربى أنت وإن كنت بيدَي العدو ظاهراً { عَلَىٰ عَيْنِيۤ } [طه: 39] أي: أعيان أوصافي وأسمائي؛ إذ الكل مظاهر ذاتي وأوصافي وأسمائي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إِذْ }: ظرف لمننّا، و { أنِ اقذفيه }: مفسرة، أو مصدرية، و { يأخذه }: جواب \" أن اقذفيه \"\n و { لتُصنع }: متعلق بألقيتُ، عطف على علة مضمرة، أي: ليتعطف عليك ولتربى على حفظي ورعايتي\n و { إذ تمشي }: ظرف { لتصنع } على أن المراد وقت مشيها إلى بيت فرعون، وما يترتب عليه من القول والرجع إلى أمه\n يقول الحقّ جلّ جلاله: { قال } الله تعالى لموسى عليه السلام: { قد أُوتيتَ سُؤْلك } أي: أعطيت مسؤولك، وبلغنا لك مأمولك في كل ما طبلت منا\n والإيتاء، هنا، عبارة عن تعلق الإرادة بوقوع تلك المطالب وحصولها، وإن كان وقوع بعضها مستقبلاً، ولذلك قال:\n\n[القَصَص: 35]، وإعادة النداء في قوله: { يا موسى } تشريفًا له بتوجيه الخطاب بعد تشريفه بإجابة المطلب\n  ثم ذكَّره بنعمة أخرى قد سلفت، فقال: { ولقد مَنَنَّا عليك مرة أخرى } قبل أن يكون منك لنا طلب، فكيف لا نجيبك بعد الطلب؟ وتلك المنة: { إِذْ أوحينا إِلى أمك } حين تحيرت في أمرك، وخافت عليك من عدوك، فأوحينا إليها وحي منام أو إلهام أو بملك كريم - عليهما السلام - فقلنا لها: { أنِ اقْذِفيه في التابوت } أي: ضعيه فيه، وأغلقي عليه حتى لا يصل الماء عليه، { فاقذفيه في اليمِّ } أي: ألقيه في البحر بتابوته، { فليُلقَه اليمُّ بالساحل } أي: فسيرميه البحرُ بالساحل، ولمّا كان إلقاء البحر له بالساحل أمرًا واجب الوقوع لتعلُق الإرادة الربانية به، جعل البحر كأنه مأمور بإلقائه، ذو تمييز، مطيع، فإنْ يُلْقه { يأْخُذُه عدوٌ لي وعدوٌ له } وهو فرعون\n ولا تخافي عليه\n\n[القَصَص: 7]\n وتكرير عداوته والتصريح بها للإشعار بأن عداوته له، مع تحققها، لا تضره، بل تؤدي إلى محبته، لأن الأمر بما فيه الهلاك من القذف في البحر، ووقوعه في يد العدو، مشعر بأن هناك ألطافًا خفية، ومننًا كامنة مندرجة تحت قهر صوري\n وليس المراد بالساحل نفس الشاطئ، بل ما يقابل الوسط، وهو ما يلي الساحل من البحر، حيث يجري ماؤه إلى نهر فرعون، لِمَا رُوي أنها جعلت في التابوت قطنًا محلوجًا، ووضعته فيه، ثم قيَّرته وألقته في اليم\n وقيل: كان التابوت من البردى، صنعته أمه\n وقال مقاتل: صنعه لها رجل مؤمن اسمه \" حزقيل \" ، ثم طلته بالقار - أي: الزفت - وألقته في اليم، وكان يشرع منه إلى بستان فرعون نهر كبير، فدفعه الماء إليه، فأتى به إلى بركة في البستان، وكان فرعون جالسًا ثمَّ مع آسية بنت مزاحم، فأمر به فأُخرج، فإذا فيه صبي أصبح الناس وجهًا، فأحبه فرعون حبًا شديدًا لا يكاد يتمالك الصبر عنه، وذلك قوله تعالى: { وألقيتُ عليك محبةً مني } ، قال ابن عباس: \" أحبه وحبَّبَه إلى خلقه \"\n\n\nوقال قتادة: \" ملاحة كانت في عيني موسى، ما رآه أحد إلاَّ عشقه \" ، أي: وألقيتُ عليك محبة عظيمة كائنة مني، قد زرعت في القلوب، بحيث لا يكاد يصبر عنك من رآك، ولذلك أحبك عدو الله وأهله، وذلك ليتعطف عليك\n { ولتُصنع على عيني } أي: ولتربّى بالحنو والشفقة، وتغذى بمرأى مني، مصحوبًا برعايتي وحفظي، في أحسن تربية ونشأة",
      "translations": []
    }
  ]
}