{
  "chapter": "طه",
  "text": "انا قد اوحى الينا ان العذاب على من كذب وتولى",
  "translations": [
    {
      "translation": "It has been revealed to us that punishment is for him who denies the truth and turns away.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been revealed to us that punishment will befall him who denies and turns away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been revealed to us that chastisement awaits those who called the lie to the truth and turned away from it.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is revealed to us that those who call our message a lie or turn away from it will face the torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘It has indeed been revealed to us that the punishment is upon the one who denies and turns away.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`Truly, it has been revealed to us that the torment will be for him who denies, and turns away.`\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely it has been revealed to us that the chastisement will surely come upon him who rejects and turns back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been revealed to us that chastisement shall light upon him who cries lies and turns his back.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! it hath been revealed unto us that the doom will be for him who denieth and turneth away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it has been revealed to us that punishment shall overtake him who rejects it and turns away!'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! it hath been revealed unto us that the torment will be for him who belieth and turneth away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it has been revealed to us that punishment shall befall those who impugn us and turn their backs [on us].’’ ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily it has been revealed to us that the Penalty (awaits) those who reject and turn away.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, it has been revealed to us that the torment will be for him who denies [believes not in the Oneness of Allah, and in His Messengers, etc.], and turns away.'(from the truth and obedience of Allah)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is revealed to us that a punishment will fall on those who belie and turn away.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was revealed to us that the punishment falls upon him who disbelieves and turns away.'“\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, it has been revealed to us that the punishment will be upon whoever denies and turns away.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:48] Indeed it has been revealed to us that the chastisement shall befall him who denies, [the truth of] what we have brought, and turns away” ’, [and who] rejects it. And so they came to him and said [to him] all of what has been mentioned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! it hath been revealed unto us that the) continuous (doom will be for him who denieth) God's divine Oneness (and turneth away) from faith.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّا قد أوحي إلينا أنّ العذاب } في جحيم الطبيعة وهاوية الهيولى على من خالفه وأعرض عنه { فمن ربّكما } إشارة إلى احتجاب النفس من جناب الربّ\n وقوله: { ربنا الذي أعطى } هداية لها بالدليل وتبصيراً بالحجة\n أي: أعطاه خلقاً على وفق مصالح ذاته وآلات تناسب خواصه ومنافعه ومقاصده وهداه إلى تحصيلها { فما بال القرون الأولى } إشارة إلى احتجابها عن المعاد والأحوال الأخروية من السعادة والشقاوة وعن إحاطة علم الله تعالى لها\n ولما كان الواجب الأول معرفة الله تعالى بصفاته وكانت معرفة المعاد موقوفة عليها أجاب بإحاطة علمه بها وبأحوالها مع كثرتها وكون ذلك العلم مثبتاً في اللوح المحفوظ باقياً أزلاً وأبداً\n لا يجوز عليه الخطأ والنسيان\n { الذي جعل لكم } أيها القوى البدنية أرض البدن { مهداً وسلك لكم فيها سبلاً } من الأعضاء والجوارح كالعين والأذن والأنف وغيرها { وأنزل } من سماء الروح ماء الإدراك والمدد الروحاني { فأخرجنا به } أصنافاً من الإدراكات والأفاعيل والخواص والهيئات والملكات المخصوصة بكل قوة منكم { كلوا } اغتذوا وتقووا بما يختص بكم من الأحوال والأخلاق والأمداد والمواهب كالرضا والصبر وعلم الأسماء والخواص والأعداد وسائر الإدراكات والإرادات والمقامات { وارعوا أنعامكم } القوى الحيوانية بما يختص بها من الأخلاق والآداب { منها خلقناكم } أنشأناكم على حسب اختلاف أمزجة الأعضاء التي هي مظاهرها { وفيها نعيدكم } بإماتة عند الرياضة حتى يلازم كل محله ويندس فيه لا حراك به ولا يتطلب التجاوز عن حدّه والاستيلاء على غيره بمحو صفات النفس حتى الفناء { ومنها نخرجكم تارة أخرى } عند البقاء بالحياة الموهوبة الحقيقية فتعتدل حركاتها وتفضل ملكاتها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أنَّ العذابَ } الدنيوي والأخروي { على مَن كذَّب } بآيات الله { وتولى } أي: أعرض عن قبولها\n وفيه من التلطف في الوعيد حيث لم يصرح بحلول العذاب به ما لا مزيد عليه\n والله تعالى أعلم\n الإشارة: ينبغي لأهل العلم ولأهل الوعظ والتذكير أن يتعاونوا على نشر العلم ووعظ العباد\n ويتوجهوا إليهم في أقطار البلاد\n فإن ذلك فرض كفاية على أهل العلم\n ولا يشغلهم نشر العلم عن ذكر الله\n ولا تذكير العباد عن شهود الله\n كما قال الله تعالى: { ولا تنيا في ذكري } أي: ولا تغفلا عن شهودي وقت إرشاد عبادي\n فإن توجهوا إلى الجبابرة والفراعنة فليلينوا لهم المقال\n وليدعوهم إلى أسهل الخلال\n فإن ذلك أدعى إلى الامتثال\n خلافًا لمن قال هذه ملة موسوية\n وأما الملة المحمدية فقال تعالى فيها:\n[الكهف: 29] فإنَّ بيان الحق لا ينافي أن يكون بملاطفة وإحسان\n فإن خاف الواعظ من صولة المتجبر فإن الله معه\n يحفظه ويرعاه\n ويسمعه ويراه\n فإن لم يسمع لقوله ولم يتعظ لوعظه\n فقد بلغ ما عليه\n وليقل بلسان الحال أو المقال: والسلام على من اتبع الهدى\n وبالله التوفيق\n ثمَّ ذكر جواب فرعون: { قَالَ فَمَن رَّبُّكُمَا\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "99:5",
      "similarity": 0.6058098057308069
    },
    {
      "verse": "53:4",
      "similarity": 0.590633015812216
    },
    {
      "verse": "53:10",
      "similarity": 0.5808316607327733
    },
    {
      "verse": "38:70",
      "similarity": 0.5458757543842985
    },
    {
      "verse": "21:25",
      "similarity": 0.541862538548409
    }
  ]
}