{
  "chapter": "طه",
  "text": "اذ تمشى اختك فتقول هل ادلكم على من يكفله فرجعنك الى امك كى تقر عينها ولا تحزن وقتلت نفسا فنجينك من الغم وفتنك فتونا فلبثت سنين فى اهل مدين ثم جئت على قدر يموسى",
  "translations": [
    {
      "translation": "When your sister went and said, \"Shall I direct you to someone who will take care of him?\" that was how We returned you to your mother so that she might delight her eyes and not be grieved. You killed a man and We rescued you from trouble and tested you with many trials. You stayed some years among the people of",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your sister followed you, and said (to the people who had retrieved the child): 'Should I guide you to a person who can nurse him?' We thus brought you back to your mother that her heart may be cheered, and she may not grieve. (Remember) when you killed a man We saved you from anguish; and tested and steeled you (in other ways). Afterwards you sojourned for several years with the people of Midian; then you came up to the measure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall, when your sister went along, saying: 'Shall I direct you to one who will take charge of him?' Thus We brought you back to your mother so that her heart might be gladdened and she might not grieve. Moses, recall when you slew a person. We delivered you from distress and made you go through several trials. Then you stayed for several years among the people of Midian, and now you have come at the right moment as ordained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your sister went to them and said, \"May I show you someone who will nurse this child?\" We returned you to your mother to make her rejoice and forget her grief. You slew a man and We saved you from trouble. We tried you through various trials. Then you stayed some years with the people of Midian (Shu'ayb and his family) and after that you came back to Egypt as was ordained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“When your sister went, then said, ‘Shall I show you the people who may nurse him?’ And We brought you back to your mother in order to soothe her eyes and that she may not grieve; and you killed a man, so We freed you from sorrow, and tested you to the maximum; you therefore stayed for several years among the people of Madyan; then you came (here) at an appointed time, O Moosa.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your sister went and said: `Shall I show you one who will nurse him' So We restored you to your mother, that she might cool her eyes and she should not grieve. Then you did kill a man, but We saved you from great distress and tried you with a heavy trial.\" Then you stayed a number of years with the people of Madyan. Then you came here according to the fixed term which I ordained (for you), O Musa!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your sister went and said: Shall I direct you to one who will take charge of him? So We brought you back to your mother, that her eye might be cooled and she should not grieve and you killed a man, then We delivered you from the grief, and We tried you with (a severe) trying. Then you stayed for years among the people of Madyan; then you came hither as ordained, O Musa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when thy sister went out, saying, \"Shall I point you to one to have charge of him?\" So We returned thee to thy mother that she might rejoice, and not sorrow. Then thou slewest; a living soul, and We delivered thee out of grief, and We tried thee with many trials. Many years among the people of Midian thou didst sojourn, then camest hither, Moses, according to a decree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thy sister went and said: Shall I show you one who will nurse him? and we restored thee to thy mother that her eyes might be refreshed and might not sorrow. And thou didst kill a man and We delivered thee from great distress, and tried thee with a heavy trial. And thou didst tarry years among the folk of Midian. Then camest thou (hither) by (My) providence, O Moses,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall when your sister walked along and said, \"Shall I guide you to one who will take care of him?\" Thus We returned you to your mother,  so that her eyes might be cooled and that she might not grieve. And you killed a man and We delivered you from sorrow. We tested you with various trials. You stayed for a number of years among the people of Midian, then you came upto the standard, Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What time thy sister was walking along and saying: shall I direct you unto one who will take care of him! Thus We returned thee to thy mother that she might cool her eyes and she might not grieve. And thou slewest a person, but We delivered thee from sorrow, and We tried thee with several trials. Then thou tarriedst for years among the people of Madyan then thou camest according to fate, O Musa!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your sister walked up [to Pharaoh’s palace] saying, “Shall I show you someone who will take care of him?” Then We restored you to your mother, that she might not grieve and be comforted. Then you slew a soul, whereupon We delivered you from anguish, and We tried you with various ordeals. Then you stayed for several years among the people of Midian. Then you turned up as ordained, O Moses!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! thy sister goeth forth and saith, 'shall I show you one who will nurse and rear the (child)?' So We brought thee back to thy mother, that her eye might be cooled and she should not grieve. Then thou didst slay a man, but We saved thee from trouble, and We tried thee in various ways. Then didst thou tarry a number of years with the people of Midian. Then didst thou come hither as ordained, O Moses!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your sister went and said: 'Shall I show you one who will nurse him?' So We restored you to your mother, that she might cool her eyes and she should not grieve. Then you did kill a man, but We saved you from great distress and tried you with a heavy trial. Then you stayed a number of years with the people of Madyan (Midian). Then you came here according to the fixed term which I ordained (for you), O Musa (Moses)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your sister went (to them) and said: 'Shall I guide you to one who will nurse him' And so We restored you to your mother, so that her eyes might rejoice and that she might not sorrow. And when you killed a soul We saved you from grief and then We tried you with many trials. You stayed among the people of Midian for a number of years, and then, Moses, you came here according to a decree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your sister walked along, and said, ‘Shall I tell you about someone who will take care of him?' So We returned you to your mother, that she may be comforted, and not sorrow. And you killed a person, but We saved you from stress; and We tested you thoroughly. And you stayed years among the people of Median. Then you came back, as ordained, O Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And We favored you] when your sister went and said, 'Shall I direct you to someone who will be responsible for him?' So We restored you to your mother that she might be content and not grieve. And you killed someone, but We saved you from retaliation and tried you with a [severe] trial. And you remained [some] years among the people of Madyan. Then you came [here] at the decreed time, O Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:40] When (idh, for explanation) your sister, Maryam, walked up, to obtain news of you, for they had brought wet nurses [for you] but you would not take to the breast of any of them, and she then said, “Shall I show you someone who will take care of him?”. Her offer was accepted and so she brought [them] his mother and he took to her breasts. Thus We restored you to your mother that her eyes might rejoice, in seeing you again, and not grieve, at that point [anymore]. Then you slew a soul, namely, the Copt in Egypt — and you became distressed for having slain him because of [how] Pharaoh [would react]; whereupon We delivered you from [great] distress, and We tried you with various ordeals, We tested you by landing you in some other [ordeal] and [again] delivered you from it. Then you stayed for several years, ten [years], among the people of Midian, after you had reached it having left Egypt, [staying] with the prophet Shu‘ayb and marrying his daughter. Then you came [hither] as ordained, in My knowledge, with the Message [that you will deliver] — and this was when you were forty years old, O Moses!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When your sister went) when she entered Pharaoh's palace (and said: Shall I show you one who will nurse him) breastfeed him? (and We restored thee) We returned you to your mother (to your mother that her eyes might be refreshed) that she might be comforted (and might not sorrow) thinking that her son may have died upon throwing him in the river. (And thou didst kill a man) a Coptic man (and We delivered thee from great distress) from the distress caused to you by the people, (and tried thee with a heavy trial) We tried again and again. (And thou didst tarry years) ten years (among the folk of Midian. Then comest thou (hither) by (My) providence, O Moses) then you came to face My decree, in that I spoke with you and sent you with a message to Pharaoh,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَفَتَنَّاكَ فُتُوناً } معناه ابتَلَينَاكَ بَلاءً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We will test you with adversity,\" means that We will try you with hardship.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { فَرَجَعْنَاكَ إِلَىٰ أُمِّكَ } امتناناً لك بأن تحفظ أمك\n ولأمّك أيضاً { كَيْ تَقَرَّ } وتنوّر { عَيْنُها } بمشاهتدك بعدما ذهب نور عينها بفمارقتك\n\n\n{ وَ } بالجملة: { لاَ تَحْزَنَ } يا موسى في حالٍ من الأحوال\n فأنا رقيبك من جميع ما يضرك ويؤذيك\n ومعينك وناصرك على جميع ما أمرتك { وَ } اذكر أيضاً امتناناً عليك وتذكر أيضاً وقت إذ { قَتَلْتَ نَفْساً } أي: شخصاً من آل فرعون\n فهمُّوا بقتلك قصاصاً\n وخفتَ منهم ومن العقوبة الأخروية أيضاً\n لأنك قتلت نفساً بلا رخصةٍ شرعيةٍ\n وتحزنتَ لشناعة فعلك وخوف عدوك حزناً شديداً { فَنَجَّيْنَاكَ مِنَ ٱلْغَمِّ } وأزلنا حزنك الأخرويَ بقبول توبتك ورجوعك عن فعلك نادماً مخلصاً\n والدنيويَ بإخراجك عن يارهم وإبعادك عنهم\n\n{ وَفَتَنَّاكَ } وابتليناك أيضاً بعدما أخرجناك من بينهم { فُتُوناً } أي: ابتلاءً واختباراً كثيراً من الجوع والعطش وضلال الطريق ووحش الغربة وكربة الوحدة وضيق الصدر والكآبة وتحمل مشاق السفر ومتاعبه\n حتى تستعد لقبول الإرشاد والتكميل\n\n\nثم بعدما اختبرناك بأمثال هذه الشدائد\n أوصلناك وهديناك إلى مَدْيَن للاسترشاد والاستكمال { فَلَبِثْتَ سِنِينَ } أي: ثمانيَ أو عشرَ سنين { فِيۤ أَهْلِ مَدْيَنَ } عند نبينا وخليفتنا الكامل المكمل - وهو شعيب عليه السلام - لتسترشد منه\n وتستكمل من شرف صبحته\n وتتخلق بأخلاقه { ثُمَّ } بعد لُبْثِك فيهم مدةً\n واستكمال من الرشد الكامل { جِئْتَ عَلَىٰ } وطنك المألوف على { قَدَرٍ } أي: مقدارٍ عظيم من الكشف والشهود وفوق ما يحصل بالكسب والاجتهاد بل من لدنا { يٰمُوسَىٰ } [طه: 40] تفضلاً وإحساناً\n\n\nوكيف لا يكون كذلك { وَ } قد { ٱصْطَنَعْتُكَ } أي: اجتبيتك وانتخبتك من بين المكاشفين { لِنَفْسِي } [طه: 41] لتكون خليفتي ونائبي ومولي أمري وحامل أسراري\n\n\nوإذا أخترتك للرسالة: { ٱذْهَبْ أَنتَ } أصالةً { وَأَخُوكَ } تبعاً لك { بِآيَاتِي } ومعجزاتي الدالة على تصديقي لكما وتقويتي لرسالتكما { وَلاَ تَنِيَا } أي: لا تفترا أو لا تضعفا { فِي } تبليغ { ذِكْرِي } [طه: 42] المشتمل على الأوامر والنواهي اغتراراً وخوفاً\n\n\nبل { ٱذْهَبَآ } بأمرنا مسرعين { إِلَىٰ فِرْعَوْنَ } المبالغ في التجبر والتكبر مِنْ غير مبالاة والتفاتٍ بعظمته وشوكته { إِنَّهُ طَغَىٰ } [طه: 43] علينا\n ولا عبرة بعظمة الطغاة\n\n\nوإذا ذهبتما إليه: { فَقُولاَ لَهُ } تلطفاً ورفقاً كما هو دأب المرسلين { قَوْلاً لَّيِّناً } رجاء أن يلين قلبه عن صلابة الفساد\n وبعد الأداء على وجه التليين والتلطف { لَّعَلَّهُ يَتَذَكَّرُ } الفطرة الأصلية التي فطر الناس عليها\n فصدقكما وآمن بدينكما { أَوْ يَخْشَىٰ } [طه: 44] من نزول العذاب بدعائكما\n\n\n{ قَالاَ } خوفاً من فرعون وأعوانه على مقتضى بشريتهما ملتجئين إلينا: { رَبَّنَآ } وإن ربتنا بحولك وقوتك وأيَّدتَنا بآياتك { إِنَّنَا } من ضعف بشريتنا { نَخَافُ أَن يَفْرُطَ عَلَيْنَآ } بالعقوبة والقتل { أَوْ أَن يَطْغَىٰ } [طه: 45] لك بما لا يليق بجنابك\n\n\n{ قَالَ } سبحانه: { لاَ تَخَافَآ } من إفراطه وطغيانه { إِنَّنِي مَعَكُمَآ } عند أدائكما الرسالة { أَسْمَعُ } أقواله { وَأَرَىٰ } [طه: 46] أفعاله\n فإذا أفرط عليكما أقدر على منعه وزجره\n\n\n{ فَأْتِيَاهُ } مجترئين عليه من غير مبالاةٍ بعظمته وشوكته { فَقُولاۤ إِنَّا رَسُولاَ رَبِّكَ } الذي رباك بالعزة وأنواع الكرامة\n وأبقاك بها إمهالاً لك إلى تتكبر عليه باستكبارك على عباده\n وإذا ظهر كبرك الآن أَرْسَلَنَا إليك أيها المتكبر المتجبر\n لترسل معنا خواص عباده الذين عندك وتحت قهرك وغلبتك إنجاءً لهم من استكبارك وطغيانك عليهم\n\n\nومتى سمعت ما بلغناك بإذن الله ووحيه { فَأَرْسِلْ مَعَنَا بَنِيۤ إِسْرَائِيلَ } المستوحشين عنك بظلمك وقهرك\n لينجوا من استيلائك واستعلائك عليهم { وَ } إذ أَرْسَلَناَ الله لإنجائهم وتخليصهم من عذابك { لاَ تُعَذِّبْهُمْ } بعد أدائنا الرسالة إليك لأنا { قَدْ جِئْنَاكَ بِآيَةٍ } ساطعةٍ ومعجزةٍ باهرةٍ ظاهرةٍ إنها { مِّن رَّبِّكَ } الذي هو رب العالمين\n\nإن تأملت فيها حق التأمل والتدبر تركتَ العتو والعناد\n وآمنتَ بتوحيده { وَٱلسَّلاَمُ } أي: الأمن والسلامة من الله { عَلَىٰ مَنِ ٱتَّبَعَ ٱلْهُدَىٰ } [طه: 47] وتأملَ الآيات الكبرى وتركَ الهوى\n ومن اتبع الهوى فقط ضل وغوى\n واستحق عذاب الآخرة والأولى\n\n\nواعلموا أيها الهالكون في تيه الغفلة والضلال { إِنَّا قَدْ أُوحِيَ إِلَيْنَآ } من عندنا ربنا { أَنَّ ٱلْعَذَابَ } الإلهي ناولُ { عَلَىٰ } كل { مَن كَذَّبَ وَتَوَلَّىٰ } [طه: 48] أي: كذّب الحق وأعرض عن أوامره ونواهيه\n فلما رأى فرعون جرأتهما وسمع قولهما { قَالَ } لهما تهكماً واستهزاء: { فَمَن رَّبُّكُمَا } الذي رباكما وأرسلكما لإنجاء بني إسرارئيل من عذابي\n مع أني لم أعرف لك رباً ربَّاك غيري { يٰمُوسَىٰ } [طه: 49] المقتدى في أمر الرسالة\n\n\n{ قَالَ } له موسى على وجه التنبيه رجاء أن ينتبه: { رَبُّنَا ٱلَّذِيۤ } أظهر الأشياء من العدم { أَعْطَىٰ كُلَّ شَيءٍ خَلْقَهُ } أي: مرتبته في النشأة الأولى { ثُمَّ هَدَىٰ } [طه: 50] الكلَّ بالرجوع إليه والانقياد له في النشأة الأخرى\n إذ منه الابتداء وإليه الانتهاء\n\n\n{ قَالَ } فرعون: إذا كان الكل من عند ربك وبعلمك أحواله { فَمَا بَالُ ٱلْقُرُونِ ٱلأُولَىٰ } [طه: 51] أي: ما أحوال الأمم الماضية\n هل هم مهتدونن بمتابعة مثلك أم هم ضالون بمتابعة الهوى مثلي على رعمك؟!",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فتقولُ } لفرعون وآسية\n حين رأتهما يَطْلُبَانِ له مُرضعة يقبل ثديها\n وكان لا يقبل ثديًا\n وصيغة المضارع في الفعلين لحكاية الحال الماضية\n والأصل: إذ مشت فقالت: { هل أدلُّكم على مَن يكفله }؟ يضمه إلى نفسه ويربيه\n وذلك إنما يكون بقبول ثديها\n رُوِيَ أنه فشا الخبر بمصر أن آل فرعون أخذوا غلامًا في النيل لا يرتضي ثدي امرأة\n واضطروا إلى تتبع النساء\n فخرجت أختُه مريم لتتعرف خبره\n فجاءت متنكرة\n فقالت ما قالت\n وقالوا: نعم\n فجاءت بأمه فقبِل ثديها\n  قال تعالى: { فرَجَعْناك إِلى أمك } وفاء بعهدنا\n { كي تقرَّ عينُها } بلقائك\n { ولا تحزن } أي: ولا يطرأ عليها حزن بفراقك بعد ذلك\n { وقتلتَ } بعد ذلك { نفسًا } \n وهي نفس القبطي الذي استغاثه الإسرائيلي عليه\n قال كعب: كان إذ ذاك ابن ثنتي عشرة سنة\n { فنجيناك من الغَمِّ } أي: غم قتله\n خوفًا من عقاب الله تعالى بالمغفرة\n ومن اقتصاص فرعون\n بوحينا إليك بالمهاجرة\n { وفتناك فتونًا } أي: ابتليناك ابتلاءً عظيمًا\n وخلصناك مرة بعد أخرى\n حتى صَلَحْتَ للنبوة والرسالة\n وهو تحمل ما ناله في سفره من الهجرة عن الوطن\n ومفارقة الأحباب\n والمشي راجلاً\n وفقد الزاد\n بعد ما خلصه من الذبح\n ثم من البحر\n ثم من القصاص بالقتل\n وسُئل عنها ابن عباس\n فقال: خلَّصناك من محنة بعد محنة\n ولد في عام كان يقتل فيه الغلمان\n فهذه فتنة\n وألقته أمه في البحر\n وهمّ فرعون بقتله\n وقتل قبطيًا\n وأجَرَّ نَفسه عشر سنين\n وضل الطريق\n وتفرقت غنمه في ليلة مظلمة\n فكل واحدة من هذه فتنة\n هـ\n لكن الذي يقتضيه النظم الكريم أن لا تعد إجارته نفسه وما بعدها من الفتون لأن المراد: ما وقع له قبل وصوله إلى مدين\n بدليل قوله تعالى: { فلبثتَ سنينَ في أهل مَدْيَنَ } \n إذ لا ريب أن الإجارة وما بعدها كانت بعد وصوله إلى مدين\n أي: لبثت عشر سنين في أهل مدين\n وقال وَهْب: لبث عند شعيب ثمانيًا وعشرين سنة\n عشرًا منها في مهر امرأته صفراء بنت شعيب\n وثماني عشرة أقام عنده حتى وُلد له\n\nوأشار باللبث في مدين\n دون الوصول إليها\n إلى ما أصابه في تضاعيفها\n من فنون الشدائد والمكاره\n التي كل واحد منها فتنة\n و \" مدين \": بلدة شعيب عليه السلام\n على ثماني مراحل من مصر\n ولم تبلغها مملكة فرعون\n خوفًا على نفسه من هيبة النبوة أو يصيبه ما أصاب مَنْ خالفه\n { ثم جئتَ } إلى المكان الذي آنستَ فيه النار\n ورأيتَ فيه الخوارق\n وخُصصتَ فيه بالرسالة\n { على قَدَرٍ } قدرته لك في الأزل\n ووقت عينته لك\n لأكلمك وأرسلك فيه إلى فرعون\n فما جئتَ إلا على ذلك القدَر\n غير متقدم ولا متأخر\n وقيل: على مقدار من الزمان\n يُوحى فيه إلى الأنبياء\n وهو رأس أربعين سنة\n { واصْطنعتُكَ لنفسي } أي: اختصصتك بالرسالة والمحبة و المناجاة\n وهو تذكير لقوله: { وأنا اخترتك } \n وتمهيد لإرساله عليه السلام إلى فرعون مُؤَيَّدًا بأخيه\n حسبما طلب\n بعد تذكيره المنن السالفة\n زيادة في وثوقه عليه السلام بحصول نظائرهم اللاحقة\n والعدول عن نون العظمة الواقعة في قوله تعالى: { وفتناك } إلى تاء المتكلم لمناسبتها للنفس فإنها أدخل في تحقيق الاصطناع والاستخلاص\n والله تعالى أعلم\n الإشارة: قال قد أوتيت سؤلك أيها الفقير\n حيث وصلناك إلى من يأخذ بيدك\n ويُرشدك إلى ربك ويُربيك\n ولقد مننا عليك مرة أخرى\n حيث أنشأناك بين أبوين مسلمين\n فقذفناك في تابوت الإسلام\n ثم في نهر الإيمان\n ثم رميناك في بحر العرفان\n وألقينا عليك محبة منا\n فأحببناك وأحببتنا\n وألقينا محبتك في قلوب عبادنا\n فتربيت في حفظنا ورعايتنا\n فلما فارقتَ الأوطان وهجرت الإخوان\n في طلب تحقيق العرفان\n رددناك إليهم بعد التمكين\n لتنهضهم إلى الله\n فتقرّ أعينهم بطاعة رب العالمين\n وقتلت نفسًا كانت تحجبك عن ربك\n فنجيناك من غم الحجاب\n وأخرجناك من سجن الأكوان\n إلى فضاء الشهود والعيان\n وفتناك بمجاهدة نفسك فتونًا عظامًا\n فتنة الفقر\n ثم فتنة الذل\n ثم فتنة هجر الأوطان\n حتى تخلصت من حبس الأكوان\n وجئت إلينا على قدر قدرناه لك\n ووقت عيناه لفتحك\n فاصطنعتك لنفسي\n واجتبيتك لحضرتي بسابق عنايتي\n من غير حول منك ولا قوة\n فعِنايتنا فيك سابقة\n فأين كنت حين واجهتك عنايتنا\n وقابلتك رعايتنا؟ لم يكن في أزلنا إخلاص أعمال\n ولا وجود أحوال\n بل لم يكن هناك إلا محض الإفضال ووجود النوال\n كما في الحكم\n وأنشدوا:\nوقال آخر:\nثمَّ ارسلها الحق تعالى إلى فرعون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:12",
      "similarity": 0.3704378261042639
    },
    {
      "verse": "28:13",
      "similarity": 0.3508931075630237
    },
    {
      "verse": "57:28",
      "similarity": 0.312688190054707
    },
    {
      "verse": "61:10",
      "similarity": 0.28031107687965934
    },
    {
      "verse": "3:153",
      "similarity": 0.2801362805271358
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/20:40.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/20:40.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/20:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}