{
  "chapter": "طه",
  "text": "فاتياه فقولا انا رسولا ربك فارسل معنا بنى اسرءيل ولا تعذبهم قد جئنك بـاية من ربك والسلم على من اتبع الهدى",
  "translations": [
    {
      "translation": "Go to him and say, \"We are your Lord's Messengers so send the tribe of Israel away with us and do not punish them. We have brought you a Sign from your Lord. Peace be upon those who follow the guidance.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go to him and say: 'The two of us have indeed been sent by your Lord. So let the children of Israel come with us, and do not oppress them. We have come to you with a token from your Lord. Peace on him who follows the way of guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, go to him, and say: 'Behold, both of us are the Messengers of your Lord. Let the Children of Israel go with us, and do not chastise them. We have come to you with a sign from your Lord; and peace shall be for him who follows the true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They came to the Pharaoh and told him that they were the Messengerss of his Lord and that they wanted him to let the Israelites go with them and stop afflicting the Israelites with torment. They told the Pharaoh, \"We have brought miracles from Our Creator. Peace be with those who follow the right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore go to him and say, ‘We are the sent ones of your Lord, therefore let the Descendants of Israel go with us, and do not trouble them; we have indeed brought to you a sign from your Lord; and peace be upon him who follows the guidance.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go you both to him, and say: 'Verily, we are both Messengers of your Lord, so let the Children of Israel go with us, and torment them not; indeed, we have come with a sign from your Lord! And peace will be upon him who follows the guidance!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go you both to him and say: Surely we are two apostles of your Lord; therefore send the children of Israel with us and do not torment them! Indeed we have brought to you a communication from your Lord, and peace is on him who follows the guidance;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go you both to Pharaoh, and say, \"We are the Messengers of thy Lord, so send forth with us the Children of Israel and chastise them not; we have brought thee a sign from thy Lord; and peace be upon him who follows the guidance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go ye unto him and say: Lo! we are two messengers of thy Lord. So let the children of Israel go with us, and torment them not. We bring thee a token from thy Lord. And peace will be for him who followeth right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go to him and say, 'We are both messengers from your Lord. Let the Children of Israel go with us, and do not oppress them. We have brought you a Sign from your Lord, and may peace be upon whoever follows the right guidance;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go to him, and say: verily we are two apostles of thy Lord, so let go with us the Children of Isra'il, and torment them not; surely we have come unto thee with a sign from thy Lord: and peace be upon him who followeth the guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So approach him and say, ‘‘We are the apostles of your Lord. Let the Children of Israel go with us, and do not torture them! We certainly bring you a sign from your Lord, and may peace be upon him who follows guidance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go ye both to him, and say, 'Verily we are messengers sent by thy Lord: Send forth, therefore, the Children of Israel with us, and afflict them not: with a Sign, indeed, have we come from thy Lord! and peace to all who follow guidance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go you both to him, and say: 'Verily, we are Messengers of your Lord, so let the Children of Israel go with us, and torment them not; indeed, we have come with a sign from your Lord! And peace will be upon him who follows the guidance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both of you go to him (Pharaoh) and say: \"We are the Messengers of your Lord. Let the Children of Israel depart with us, and do not punish them. We have come to you with a sign from your Lord; peace be on him who follows guidance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Approach him and say, `We are the messengers of your Lord; so let the Children of Israel go with us, and do not torment them. We bring you a sign from your Lord, and peace be upon him who follows guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go to him and say, 'Indeed, we are messengers of your Lord, so send with us the Children of Israel and do not torment them. We have come to you with a sign from your Lord. And peace will be upon he who follows the guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:47] So go to him and say, “Truly we are two messengers of your Lord, so let the Children of Israel go with us, to Syria, and do not [continue to] chastise them, in other words, release them from your exploitation of them in those oppressive works of yours, such as digging, construction and the lifting of heavy objects. We have verily brought you a sign, a definitive argument, from your Lord, as proof of our truthfulness in [delivering] the Message; and may peace be upon him who follows [right] guidance, that is to say, may he be secure from [God’s] chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So go ye unto him) to Pharaoh (and say: Lo! we are two messengers of thy Lord) to you. (So let the Children of Israel go with us) to their homeland, (and torment them not) do not toil them with work, nor kill their men and use their women as servants, because they are free. (We bring thee a token) a sign (from thy Lord) i.e. the sign of the hand, which is the first sign that he showed to Pharaoh (And peace will be for him who follows right guidance) monotheism.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأتياهُ } \n أمر بإتيانه\n الذي هو عبارة عن الوصول إليه\n بعد ما أمر بالذهاب إليه\n فلا تكرار\n { فقولا } له: { إِنّا رسولا ربك } إليك\n أمر بذلك من أول الأمر\n ليعرف الطاغية شأنهما\n ويبني جوابه على ذلك\n { فأرسِلْ معنا بني إِسرائيل } أي: أطلقهم من الأسر والقهر\n وأخرجهم من تحت يدك العادية\n وليس المراد إرسالهم معه إلى الشام\n بدليل قوله: { ولا تعذِّبْهم } بإبقائهم على ما كانوا عليه من العذاب\n فإنهم كانوا تحت مملكة القبط\n يستخدمونهم في الأعمال الصعبة\n من الحفر ونقل الأحجار\n وضرب اللبن والطين\n وبناء المدائن\n وغير ذلك من الأعمال الشاقة\n ويقتلون ذكور أولادهم عامًا دون عام\n فكانت رسالة موسى إلى فرعون بالإيمان بالله وحده\n وتسريح بني إسرائيل\n رُوي أنه لمّا رغبه في الإيمان بذكر ما أعد الله لأهله من الخلود في الجنة والملك الدائم\n أعجبه\n فقال: حتى أستشير هامان\n وكان غائبًا\n فقَدِم\n فأخبره\n فقال هامان: قد كنتُ أرى لك عقلاً\n بينما أنت رب تصيرُ مربوبًا\n وبينما أنت تُعبد تصير تعبد غيرك\n فغلبه على رأيه\n فقال له موسى: { قد جئناك بآيةِ من ربك } \n قال فرعون: وما هي؟ فأدخل يده في جيب قميصه ثم أخرجها بيضاء\n لها شعاع كشعاع الشمس\n فعجب منها\n ولم يُره العصا إلا بعد ذلك\n يوم الزينة\n قاله الثعلبي\n قلت: والذي يظهر من سورة الشعراء - بل هو صريح فيها - أنه أراه العصا واليد\n وإنما أفردت في اللفظ\n هنا لأن المراد إثبات الحجة بصحة الرسالة\n لا تَعدد الآية\n وكذلك قوله تعالى:\n\n[آل عِمرَان: 49]\n\n[الشُّعَرَاء: 30]\n وأما قوله تعالى:\n[الأعرَاف: 106] فالظاهر أن المراد بها آية من الآيات\n ثم قال له: { والسلامُ على مَن اتبعَ الهُدى } أي: وسلام الله وملائكته والمؤمنين المقتضي سلامة الدارين\n على من اتبع الهدى\n بتصديق آيات الله تعالى الهادية إلى الحق\n دون من اتبع الغي والهوى\n وفيه من الترغيب\n في اتباعها على ألطف وجه\n ما لا يخفى\n { إِنا قد أُوحي إِلينا } من جهة ربنا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:105",
      "similarity": 0.7460526702269782
    },
    {
      "verse": "26:17",
      "similarity": 0.6753457668851136
    },
    {
      "verse": "26:197",
      "similarity": 0.5567156858863755
    },
    {
      "verse": "40:53",
      "similarity": 0.5060962176689301
    },
    {
      "verse": "46:10",
      "similarity": 0.4985251887250263
    }
  ]
}