{
  "chapter": "طه",
  "text": "قالا ربنا اننا نخاف ان يفرط علينا او ان يطغى",
  "translations": [
    {
      "translation": "They said, 'Our Lord, we are afraid that he might persecute us or overstep the bounds.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O our Lord, we are really frightened lest he behave insolently with us or become violent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The two said:\" Lord! We fear he may commit excesses against us, or transgress all bounds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Lord, we are afraid of his transgression and rebellion against us\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They both submitted, “Our Lord – indeed we fear that he may oppress us or deal mischievously.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both of them said: \"Our Lord! Verily, we fear lest he should hasten to punish us or lest he should transgress.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both said: O our Lord! Surely we fear that he may hasten to do evil to us or that he may become inordinate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord,' said Moses and Aaron, 'truly we fear he may exceed against us, or wax insolent.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Our Lord! Lo! we fear that he may be beforehand with us or that he may play the tyrant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They both said, \"Our Lord, We fear that he may commit some excess against us, or exceed all bounds in transgression.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The twain said: O our Lord! verily we fear that he may hasten against us or wax exorbitant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Our Lord! We are indeed afraid that he will forestall us or will exceed all bounds.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (Moses and Aaron) said: \"Our Lord! We fear lest he hasten with insolence against us, or lest he transgress all bounds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Our Lord! Verily! We fear lest he should hasten to punish us or lest he should transgress (all bounds against us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O our Lord' both said, 'We fear lest he may be excessive against us or become insolent'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Lord, we fear he may persecute us, or become violent.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Our Lord, indeed we are afraid that he will hasten [punishment] against us or that he will transgress.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:45]   The two [of them] said, ‘Our Lord, We truly fear that he may forestall us, that is, by hastening to punish us, or become tyrannical’, against us, that is, be high-handed [with us].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Our Lord! Lo! we fear that he may be beforehand with us) we fear that he may be hasty with us (or that he may play the tyrant) and kill us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَآ أَوْ أَن يَطْغَىٰ } معناه أنْ يَتسَلّطَ عَلينا ويُعاقِبَنا\n وقالَ: يعجلُ عَلينا\n ويَطغَى: يَعتدي عَلينا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالاَ } خوفاً من فرعون وأعوانه على مقتضى بشريتهما ملتجئين إلينا: { رَبَّنَآ } وإن ربتنا بحولك وقوتك وأيَّدتَنا بآياتك { إِنَّنَا } من ضعف بشريتنا { نَخَافُ أَن يَفْرُطَ عَلَيْنَآ } بالعقوبة والقتل { أَوْ أَن يَطْغَىٰ } [طه: 45] لك بما لا يليق بجنابك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالا ربنا إِننا نخاف أن يَفْرُطَ علينا } أي: يعجل علينا بالعقوبة، ولا يصبر إلى تمام الدعوة وإظهار المعجزة\n وهو من \" فَرطَ \" إذا تقدم، ومنه: الفارط، للوليد الذي مات صغيرًا\n\n\nوقرئ بضم الياء، من \" أفرط \" إذا حَمله على العجلة، أي: نخاف أن يحمله حامل من الاستكبار والخوف على المُلك أو غيرهما، على المعاجلة والعقاب، { أو أن يطغى } يزداد طغيانًا، كأن يقول في شأنك ما لا ينبغي، لكمال جرأته وقساوته، وإظهار \" أن \" لإظهار كمال الاعتناء بالأمر، والإشعار بتحقيق الخوف من كل منهما، وهذا القول يحتمل أن يكون قاله موسى ودخل هارون بالتبع، إيذانًا بأصالة موسى عليه السلام في كل قول وفعل، وتبعية هارون عليه السلام، أو يكون هارون قال ذلك بعد تلاقيهما، فحكى الله قولهما عند نزول الآية، كما في قوله تعالى:\n",
      "translations": []
    }
  ]
}