{
  "chapter": "طه",
  "text": "قال موعدكم يوم الزينة وان يحشر الناس ضحى",
  "translations": [
    {
      "translation": "He said, 'Your time is the day of the Festival. The people should gather in the morning.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said (Moses): \"Let your meeting be on the day of the Feast, and let people assemble in broad daylight.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"The appointment to meet you is on the Day of the Feast and let all people come together before noon.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"Let the contest take place on the Day of Feast so that all the people can come together during the brightness of the day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moosa, “Your meeting is the day of the festival, and that the people be assembled at late morning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Musa) said: \"Your appointed meeting is the day of the festival, and let the people assemble when the sun has risen (forenoon).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Musa) said: Your appointment is the day of the Festival and let the people be gathered together in the early forenoon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your tryst shall be upon the Feast Day.' said Moses. 'Let the people be mustered at the high noon.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: Your tryst shall be the day of the feast, and let the people assemble when the sun hath risen high.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"The day of the encounter will be the day of the festival, and let the people assemble when the sun has risen high.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said: your appointment is the gala day, and that the people be gathered in the forenoon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Your tryst shall be the Day of Adornment, and let the people be assembled in early forenoon.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: \"Your tryst is the Day of the Festival, and let the people be assembled when the sun is well up.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Musa (Moses)] said: \"Your appointed meeting is the day of the festival, and let the people assemble when the sun has risen (forenoon).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Moses) replied: 'Your meeting shall be on the day of the feast, and let the people be assembled by midmorning'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Your appointment is the day of the festival, so let the people be gathered together at mid-morning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Moses] said, \"Your appointment is on the day of the festival when the people assemble at mid-morning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:59] Said he, Moses, ‘Your tryst shall be the Day of Adornment — a festive day of theirs on which they adorn themselves and [the public] assemble — and let the people assemble, [let] the inhabitants of Egypt gather, at forenoon’, the time for this [tryst], to observe what will transpire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Moses) said: Your tryst) the appointed time (shall be the day of the feast) the day of the market, it is also said this means the day of celebration; and it is also said this means the new year's day, (and let the people assemble) from all the townships (when the sun hath risen high) at the time of mid-morning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَالَ مَوْعِدُكُمْ يَوْمُ ٱلزِّينَةِ } معناه يومُ العِيدِ\n وقال: يومُ السَّبتِ\n وقال: يومُ سُوقٍ لَهم\n\n",
      "translations": [
        {
          "translation": "\n\nThe meaning of the verse {Your appointment is on the Day of Adornment} is the Day of the Feast.\n\n\nHe said, \"Saturday is the day.\"\n He said: \"The day of the market is for them.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } موسى: إن معي ربي سيقويني لا أخاف من معارضتك بالسحر وتعيين موعد إتيانك، بل { مَوْعِدُكُمْ } للمعارضة مع المعجزة { يَوْمُ ٱلزِّينَةِ } أي: يوم العيد؛ إذ يجتمع فيه الأقاصي والأداني { وَ } لا يكون وقت تفرقهم إلى بيوتهم { أَن يُحْشَرَ ٱلنَّاسُ ضُحًى } [طه: 59] أي: في وقت الضحوة المعدة لإظهار الزينة، ليظهر كل منهم على صاحبه زينةً؛ ليكون إعجازي لك أبعد من أن يرتاب فيه أحد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { مكانًا }: مفعول بفعل محذوف، أي: تعدنا مكانًا سُوى، لا بموعد، لأنه وصف، ويجوز نصبه على إسقاط الخافض، و { يوم الزينة }: على حذف مضاف، أي: مكان يوم الزينة، و { أن يحشر }: عطف على يوم، أو الزينة\n يقول الحقّ جلّ جلاله: { ولقد أريناه } أي: فرعون، { آياتنا } ، حين قال له:\n\n[الشُّعَرَاء: 31-33]، وعبّر بالجمع، مع كونهما اثنتين، باعتبار ما في تضاعيفهما من الخوارق، التي كل واحدة منها آية\n وقد رأى فرعونُ من هاتين الآيتين أمورًا دواهي، فإنه روى أنه عليه السلام، لما ألقى العَصا، انقلبت ثعبانًا أشعر، فاغرًا فاه، بين لَحْيَيْهِ ثمانون ذراعًا، وضع لحيه الأسفل على الأرض، والأعلى على سور القصر، ثم توجه نحو فرعون، فهرب وأحدث، وانهزم الناس مزدحمين، فمات منهم خمسة وعشرون ألفًا من قومه، فصاح فرعون: يا موسى أُنشدك الذي أرسلك إلا أخذته، فأخذه، فعاد عصًا\n ورُوي أنها، لما انقلبت حية ارتفعت في السماء قدر ميل، ثم انحطت مقبلة نحو فرعون، وجعلت تقول: يا موسى مُرني بما شئت، ويقول فرعون: أنشدك\n\n\n الخ\n ونزع يده من جيبه، فإذا هي بيضاء بياضًا نورانيًا خارجًا عن العادة\n ففي تضاعيف كُلٍّ من الآيتين آيات جمة، لكنها لما كانت غير مذكورة بالصراحة، أكدت بقوله تعالى: { كلَّها } ، كأنه قيل: أريناه آياتنا بجميع مستتبعاتها وتفاصيلها، قصدًا إلى بيان أنه لم يبق له في ذلك عذر\n وقيل: أريناه آياتنا التسع، وهو بعيد لأنها إنما ظهرت على يده عليه السلام بعد ما غلبت السحرة على مَهَل، في نحو من عشرين سنة، والكلام هنا قبل المعارضة، اللهم إلا أن يكون الحق تعالى أخبرنا أنه أراه الآيات التسع كلها، فأبى عن الإيمان، ثم رجع إلى إتمام القصة\n وأبعد منه: من عَدّ في الآيات ما جُعِل لإهلاكهم، لا لإرشادهم إلى الإيمان من فلق البحر، وما ظهر بعد مهلكه من الآيات الظاهرة لبني إسرائيل من نتق الجبل والحجر، وغير ذلك، وكذلك من عَدّ منها الآيات الظاهرة على يد الأنبياء - عليهم السلام - حيث حكاها موسى عليه السلام لفرعون، بناء على أن حكايته إياها له في حكم إظهارها بين يديه لاستحالة الكذب عليه، فإنَّ حكايته إياها لفرعون مما لم يجر ذكره هنا، فكل هذا بعيد من سياق النظم الكريم\n قال تعالى: { فَكَذَّبَ } فرعونُ موسى، { وأَبَى } الإيمان والطاعة، مع ما شاهد على يده من الشواهد الناطقة بصدقه\n جحودًا وعنادًا لعتوه واستكباره، وقيل: كذَّب بالآيات جميعًا، وأبَى أن يقبل شيئًا منها\n\n\n{ قال أجئتنا لتُخْرِجَنا من أرضنا بسحرك يا موسى } ، هذا استئناف مُبين لكيفية تكذيبه وإبائه\n والمجيء إما على حقيقته، أو بمعنى الإقبال على الأمر والتصدي له، أي: أجئتنا من مكانك الذي كنتَ فيه ترعى الغنم لتُخرجنا من أرضنا؟ أو: أقبلت إلينا لتُخرجنا من مصر بما أظهرت لنا من السحر، فإن ذلك مما لا يصدر عن عاقل لكونه من باب محاولة المحال، وإنما قاله تحريضًا لقومه على مقت موسى والبعد عنه، بإظهار أن مراده عليه السلام إخراج القبط من وطنهم، وحيازة أموالهم، وإهلاكهم بالكلية، حتى لا يميل أحد إليه،\n\n[يوسف: 21]\n وسمى ما أظهره عليه السلام من المعجزة الباهرة سحرًا، ثم ادعى أنه يعارضه، حيث قال: { فَلنَأْتينك بسحرٍ مثله } أي: وإذا كان الأمر كذلك، فوالله لنأتينك بسحر مثل سحرك، { فاجعلْ بيننا وبينك موعدًا } أي: وعدًا { لا نُخلفه } أي: لا نخلف ذلك الوعد، ولا نجاوزه { نحنُ ولا أنت } ، بل نجتمع فيه وقت ذلك الموعد، وإنما فوض اللعينُ أمرَ الوعد إلى موسى عليه السلام للاحتراز عن نسبته إلى ضعف القلب ودخول الرعب إليه، وإظهار الجلادة، بإظهار أنه متمكن من تهيئَة أسباب المعارضة، طال الأمر أو قصر، كما أن تقديم ضميره على ضمير موسى عليه السلام، وتوسيط كلمة \" النفي \" بينهما للإيذان بمسارعته إلى عدم الاختلاف\n وقوله تعالى: { مكانًا سُوىً } أي: يكون ذلك الوعد - أي: وعد الاجتماع - في مكان مستوٍ، تستوي مسافته بيننا وبينك، عدلاً، لا ظلم على أحد في الإتيان إليه، منا ومنك، وفيه لغتان: ضم السين وكسرها\n  { قال } لهم موسى عليه السلام: { موعدُكُم يومُ الزينة } أي: مكان الزينة لأن يوم الزينة يدل على مكان مشتهر باجتماع الناس فيه في ذلك اليوم، وهو يوم عيد لهم، في كل عام يتزينون ويجتمعون فيه، وقيل: يوم النيروز، وقيل: يوم عاشوراء، وقيل: يوم سوق لهم\n { وأن يُحشر الناسُ ضحًى } أي: موعدكم يوم الزينة، وحشرُ الناس ضحى، أو يوم حشر الناس في وقت الضحى، يجتمعون نهارًا جهارًا، أراد عليه السلام أن يكون أبلغ في إظهار الحجة وإدحاض الباطل، بكونه على رؤوس الأشهاد\n والله تعالى أعلم\n الإشارة: من سبق له البعد عن الرحمن، لا ينفع فيه خوارق معجزاتٍ، ولا قاطع برهان ودليل، أبعده التكبر والطغيان، ودفعُ الحق بالباطل\n نعوذ بالله من موارد الخذلان\n ثمَّ ذكر جمعهم وما كان من شأنهم\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "93:1",
      "similarity": 0.8231353894155885
    },
    {
      "verse": "91:1",
      "similarity": 0.7553519324703274
    },
    {
      "verse": "7:98",
      "similarity": 0.6479935664750274
    },
    {
      "verse": "79:46",
      "similarity": 0.5739441086569712
    },
    {
      "verse": "20:119",
      "similarity": 0.4218932172973564
    }
  ]
}