{
  "chapter": "طه",
  "text": "قال ربنا الذى اعطى كل شىء خلقه ثم هدى",
  "translations": [
    {
      "translation": "(Moses) said: \"Our Lord is He who gave everything its natural form and directed it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Our Lord is He Who gave everything its form and then guided it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"Our Lord is the One Who has created all things and has given guidance\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Our Lord is One Who gave everything its proper shape, then showed the path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Musa] said: \"Our Lord is He Who gave to each thing its form and nature, then guided it aright.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Our Lord is He Who gave to everything its creation, then guided it (to its goal).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Our Lord is He who gave everything its creation, then guided it.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Our Lord is He Who gave unto everything its nature, then guided it aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses replied, \"Our Lord is He who has given everything its form, then guided it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said: our Lord is He who vouchsafed unto everything its creation, then guided it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Our Lord is He who gave everything its creation and then guided it.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Our Lord is He Who gave to each (created) thing its form and nature, and further, gave (it) guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Musa (Moses)] said: \"Our Lord is He Who gave to each thing its form and nature, then guided it aright.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord' he replied, 'is He Who gave everything its creation and then guided it'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Our Lord is He who gave everything its existence, then guided it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Our Lord is He who gave each thing its form and then guided [it].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:50] He said, ‘Our Lord is He Who gave to everything, in creation, its [peculiar] nature, through which it is distinguished from another [thing], and then guided [it]’, the animal among them to its source of food, drink and procreation and in other ways.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: Our Lord is He Who gave unto everything its nature) its shape, He gave to humans human progeny, to camels, donkeys and sheep progenies of their own species, (then guided it aright) then He inspired them how to eat, drink and copulate.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { رَبُّنَا ٱلَّذِيۤ أَعْطَىٰ كُلَّ شَيءٍ خَلْقَهُ ثُمَّ هَدَىٰ } معناه صَوّرهُ ثُمَّ هَداهُ مَعيشتَهُ\n ويقال: هَدَى: إِتيانُ الذكرُ الأُنثَى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } له موسى على وجه التنبيه رجاء أن ينتبه: { رَبُّنَا ٱلَّذِيۤ } أظهر الأشياء من العدم { أَعْطَىٰ كُلَّ شَيءٍ خَلْقَهُ } أي: مرتبته في النشأة الأولى { ثُمَّ هَدَىٰ } [طه: 50] الكلَّ بالرجوع إليه والانقياد له في النشأة الأخرى؛ إذ منه الابتداء وإليه الانتهاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { خَلْقَه }: يحتمل أن يكون اسمًا بمعنى المخلوق، فيكون مفعولاً أولاً، و { كل شيء }: مفعولاً ثانيًا، أو يكون مصدرًا بمعنى الخلقة، فيكون مفعولاً ثانيًا، أي: أعطى كل شيء خِلقتَه وصُورته التي هو عليها\n  يقول الحقّ جلّ جلاله: { قال } فرعونُ في جواب موسى، لما أتاه مع أخيه وبلغا الرسالة، وقالا له ما أمرهما به ربهما، وإنما حذفه للإيجاز، وللإشعار بأنهما لما أُمرا بذلك سارعا إلى الامتثال من غير تلعثم، أو بأن ذلك من الظهور بحيث لا حاجة إلى التصريح به، فقال لهما فرعون: { فمن ربكما يا موسى }؟ لم يضف الرب إلى نفسه لغاية عتوه وطغيانه، بل أضافه إليهما، وفي الشعراء:\n\n[الشُّعَرَاء: 23]، والجمع بينهما تَعدد الدعوة، ففي كل مرة حكى لنا ما قال\n وتخصيص النداء بموسى، مع توجيه الخطاب إليهما لأنه الأصل في الرسالة، وهارون وزيره\n { قال } موسى عليه السلام مجيبًا له: { ربُنا الذي أعطى كُلَّ شيءٍ خلقه } أي: ربنا هو الذي أعطى كل شيء خلقه، أي: مخلوقاته مما يحتاجون إليه ويرتفقون به في قوام أبدانهم ومعايشهم، أو أعطى كل شيء خِلْقته وصُورته التي يختص بها، ولم يجعل خلق الإنسان في خلق البهائم، ولا خلق البهائم في خلق الإنسان\n ولكن خلق كل شيء فقدره تقديرًا\n أو أعطى كل شيء فعله وتصرفه، فاليد للبطش، والرجل للمشي، واللسان للنطق، والعين للنظر، والأذن للسمع، أو أعطى كل شيء شكله من جنسه، للإنسان زوجةً، وللبعير ناقةً، وللفرس رَمْكةً، وللحمار أتَانًا\n { ثم هَدى } إلى طريق الانتفاع والارتقاء، بما أعطاه وعرفه كيف يتوصل إلى بقائه وكماله، فألهمه الرضاع والأكل والشرب والجماع، وطلب الرعي وتوفي المهالك، وكيف يأتي الذكرُ الأنثى\n ولمّا كان الخلق - الذي هو عبارة عن تركيب الأجزاء وتسوية الأجسام - مقدمًا على الهداية، التي هي عبارة عن إيداع القوى المحركة والمدركة في تلك الأجسام، عطف بثم المفيدة للتراخي\n ولقد ساق عليه السلام جوابه على نمط رائق، وأسلوب لائق حيث بيَّن أنه تعالى عالم قادر بالذات، خالق لجميع الكائنات، منعم عليهم بجميع النعم السابغات، هادٍ لهم إلى طرق المرْتَفقات",
      "translations": []
    }
  ]
}