{
  "chapter": "طه",
  "text": "الذى جعل لكم الارض مهدا وسلك لكم فيها سبلا وانزل من السماء ماء فاخرجنا به ازوجا من نبات شتى",
  "translations": [
    {
      "translation": "It is He who made the earth a cradle for you and threaded pathways for you through it and sent down water from the sky by which We have brought forth various different types of plants.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the earth a bed for you, and traced for you paths upon it, and sends down water from the sky, and brings out through it every kind of vegetation\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who spread the earth for you; and made in it paths for you, and sent down water from the sky, and then through it We brought forth many species of diverse plants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has made the earth as a cradle for you with roads for you to travel. He has sent water from the sky to produce various pairs of plants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The One Who has made the earth a bed for you and kept operative roads for you in it and sent down water from the sky; so with it We produced different pairs of vegetation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made earth for you like a bed; and has opened ways for you therein, and has sent down water (rain) from the sky. And We have brought forth with it various kinds of vegetation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who made the earth for you an expanse and made for you therein paths and sent down water from the cloud; then thereby We have brought forth many species of various herbs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who appointed the earth to be a cradle for you, and therein threaded roads for you, and sent down water out of heaven, and therewith We have brought forth divers kinds of plants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath appointed the earth as a bed and hath threaded roads for you therein and hath sent down water from the sky and thereby We have brought forth divers kinds of vegetation,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has laid out the earth for you and traced routes in it and sent down water from the sky. We have brought forth every sort of plant with it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath appointed for you the earth as a bed, and hath opened for you therein pathways, and hath sent down from the heaven water, and thereby We have brought forth kinds of plants, various.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He, who made the earth for you a cradle, and in it threaded for you ways, and sent down water from the sky, and with it We brought forth various kinds of vegetation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He Who has, made for you the earth like a carpet spread out; has enabled you to go about therein by roads (and channels); and has sent down water from the sky.\" With it have We produced diverse pairs of plants each separate from the others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made earth for you like a bed (spread out); and has opened roads (ways and paths etc.) for you therein; and has sent down water (rain) from the sky. And We have brought forth with it various kinds of vegetation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made for you the earth as a cradle and threaded roads for you and sends down water from the sky with which We bring forth every kind of plant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who made the earth a habitat for you; and traced in it routes for you; and sent down water from the sky, with which We produce pairs of diverse plants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It is He] who has made for you the earth as a bed [spread out] and inserted therein for you roadways and sent down from the sky, rain and produced thereby categories of various plants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:53] He is, the One Who made for you, as well as [for] all creatures, the earth a cradle, a bed, and threaded, facilitated, for you therein ways, roads, and sent down from the heaven water, rain. God, exalted be He, says, as a complement to Moses’s description of Him and as an address to the people of Mecca: and therewith We brought forth various kinds, species, of plants (shattā, ‘various’, adjectivally qualifies azwājan, ‘kinds’), in other words, [plants] of different colours, flavours and [different] in other ways (shattā is the plural of shatīt, similar [in pattern] to marīd, [plural] mardā, as [may be used] in [a phrase like] shatta alamr, ‘the affair has become divided’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who hath appointed the earth as a bed and hath threaded roads) to use for going and coming (for you therein) in the earth (and hath sent down water) rain (from the sky and thereby) by means of the rain (We have brought forth diverse kinds of vegetation) of different colours,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَزْوَاجاً مِّن نَّبَاتٍ شَتَّىٰ } معناهُ مُختلِفةُ الأَلوانِ والطُعومِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {azwajan min nabatin shatta'a}, means different colors and tastes of plants.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَ } مع ذلك { أَنزَلَ } لكم لتكميل استراحتكم أيضاً { مِنَ ٱلسَّمَآءِ } أي: عالم الأسباب { مَآءً } لإحياء الأرض الميتة { فَأَخْرَجْنَا } أي: أنشأَنا وأنبتنا { بِهِ } أي: بسبب الماء فيها { أَزْوَاجاً } وأصنافاً { مِّن نَّبَاتٍ شَتَّىٰ } [طه: 53] مختلفةٍ\n ليكون مفرّجاً لغمومكم مقوياً لنفوسكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وَسَلَكَ لكم فيها سُبُلاً } أي: طُرقًا تتوصلون بها من قطر إلى قطر\n لتقضوا منها مآربكم\n وتنتفعوا بمرافقها ومنافعها\n ووسطها بين الجبال والأودية لتعرف أمارات سُبلها\n { وأنزل من السماء ماءً } هو المطر\n { فأخرجنا به } \n يحتمل أن يكون من كلام الله\n وما قبله من كلام موسى\n أو كله من كلام الله تعالى\n حكاه موسى عليه السلام\n وإنما التفت إلى التكلم للتنبيه على ظهور ما فيه من الدلالة على كمال القدرة والحكمة\n والإيذان بأنه لا يتأتى إلا من قادر مطاع عظيم الشأن\n أي: فأخرجنا بذلك الماء { أزواجًا }: أصنافًا\n سميت أزواجًا لازدواجها\n واقتران بعضها ببعض\n كائنة { من نباتٍ شتى }: متفرقة\n جمع شتيت: أي: متفرق\n وهو\n في الأصل\n مصدر\n يستوي فيه الواحد والجمع\n يعني: أنها مختلفة في الشكل واللون والطعم والرائحة والنفع\n وبعضها صالح للناس على اختلاف صلاحها لهم\n وبعضها للبهائم\n\nومن تمام نعمته تعالى أن أرزاق عباده\n لمَّا كان تحصيلها بعمل الأنعام\n جعل عَلفَها مما يفضل عن حاجتهم\n ولا يليق بكونه طعامًا لهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:4",
      "similarity": 0.581544967837356
    },
    {
      "verse": "99:6",
      "similarity": 0.5799528786375326
    },
    {
      "verse": "59:14",
      "similarity": 0.3581006646835185
    },
    {
      "verse": "15:12",
      "similarity": 0.30041549301239173
    },
    {
      "verse": "26:200",
      "similarity": 0.30041549301239173
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/20:53.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/20:53.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/20:53.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}