{
  "chapter": "طه",
  "text": "منها خلقنكم وفيها نعيدكم ومنها نخرجكم تارة اخرى",
  "translations": [
    {
      "translation": "We created you from the earth and will revert you back to it; and raise you up from it a second time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From this very earth We created you and to the same earth We shall cause you to return, and from it We shall bring you forth to life again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created you from the earth to which We will return you and will bring you back to life again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the earth We have created you, and to it We shall return you, and from it We shall raise you again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereof We created you, and into it We shall return you, and from it We shall bring you out once again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From it We created you and into it We shall send you back and from it will We raise you a second time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Out of the earth We created you, and We shall restore you into it, and bring you forth from it a second time.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereof We created you, and thereunto We return you, and thence We bring you forth a second time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the earth We have created you and We will return you to it, and from it We shall bring you forth a second time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereof We created you, and thereunto We return you, and therefrom We shall bring You forth once again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From it did We create you, into it shall We return you, and from it shall We bring you forth another time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the (earth) did We create you, and into it shall We return you, and from it shall We bring you out once again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereof (the earth) We created you, and into it We shall return you, and from it We shall bring you out once again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created you from it (the earth), and to it We shall restore you; and from it We will bring you forth yet a second time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From it We created you, and into it We will return you, and from it We will bring you out another time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the earth We created you, and into it We will return you, and from it We will extract you another time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:55] From it, that is, from the earth, We created you, by creating your father Adam from it, and into it We shall restore you, [when you are] interred after death, and from it We shall bring you forth, at the Resurrection, a second time’, in the same way that We brought you forth [from it] when We initiated your creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thereof) from the earth (We created you) He says We created you from Adam and Adam is from dust, and the dust is from the earth, (and thereunto) to the earth (we return you) He says: We bury you (and thence) from the earth (We bring you forth) He says: from the grave We shall bring you forth (a second time) after death, i.e. for the Resurrection.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا تأملتم في بدائع مصنوعاتنا وغرائب مخترعاتنا على وجه الأرض جزمتم أنا { مِنْهَا } أي: من الأرض { خَلَقْنَاكُمْ } وأوجدناكم بقدرتنا واختيارنا إيجاد النبات منها وقت الربيع { وَفِيهَا نُعِيدُكُمْ } أيضاً بالآجال المقدرة لانقضاء حياتكم، إفناء النبات في أيام الخريف { وَمِنْهَا نُخْرِجُكُمْ } للحشر والعرض في يوم الجزاء { تَارَةً أُخْرَىٰ } [طه: 55]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { منها خلقناكم } أي: من الأرض الممهدة لكم، خلقناكم بخلق أبيكم آدم عليه السلام، وأنتم في ضمنه، إذ لم تكن فطرته مقصورة على نفسه عليه السلام، بل كانت أنموذجًا منطويًا على فطرة سائر أفراد الجنس، انطواء إجماليًا، فكان خلقه عليه السلام منها خلقًا لكل منها، وقيل: خلقت أبدانكم من النطفة المتولدة من الأغذية المتولدة من الأرض\n وقال عطاء: إن المَلَك الموكل بالرحم ينطلق، فيأخذ من تراب المكان الذي يُدفن فيه العبد، فيذره على النطفة، فتخلق من التراب ومن النطفة\n هـ\n { وفيها نُعيدكم } بالإماتة وتفريق الأجزاء، والكلام على الأشباح دون الأرواح، فإنها، بعد السؤال، تصعد إلى السماء، كما يأتي عند قوله تعالى:\n\n[الواقِعَة: 88] الآية\n ولم يقل: وإليها نُعيدكم إشارة إلى استقرار العبد فيها، { ومنها نُخرجكم تارةً أخرى } بتأليف أجزائكم المتفتتة، المختلطة بالتراب، على الهيئة السابقة، ورد الأرواح إليها\n وكون هذا الإخراج تارة أخرى: باعتبار أن خلقهم من الأرض إخراج لهم منها، وإن لم يكن على التارة الثانية\n والتارة في الأصل: اسم للتور، وهو الجريان، فالتارة واحدة منه، ثم أطلق على كل فعلة واحدة من الفعلات المتحدة، كما مر في المرة\n والله تعالى أعلم\n الإشارة: ربنا الذي أعطى كل شيء خلقه، مما سبق لهم في أزله، ثم هدى إلى الأسباب الموصلة إليه، فمنهم من كان حظه في الأزل قوت الأشباح، هداه إلى أسبابها، وهم أهل مقام البعد، ومنهم من كان حظه قوت القلوب، فهداه إلى أسبابها من المجاهدة في الطاعات وأنواع القربات، وهم أنواع: فمنهم من شغلهم بتدريس العلوم وتدقيق الفهوم، وتحرير المسائل وتمهيد النوازل، وهداهم إلى أسباب ذلك، وهم حملة الشريعة، إن صحت نيتهم وثبت إخلاصهم\n ومنهم من شغلهم بتوالي الطاعات وتعمير الأوقات، وهداهم إلى أسبابها، وقواهم على مشاقها، وهم العباد والزهاد\n\n\nومنهم من شغلهم بإطعام الطعام والرفق بالأنام، وتعمير الزوايا وقبول الهدايا، وهداهم إلى أسباب عمارتها والقيام بها، وهم الصالحون\n ومنهم: من كان حظه قوت الأرواح، وهم المريدون السائرون، أهل الرياضة والتصفية، والتخلية والتحلية، والتهذيب والتدريب، وهداهم إلى أسبابها، ووصلهم إلى شيخ كامل يُبينها ويسلّكها، وهم في ذلك مقامات متفاوتة، على حسب صدقهم وجدهم، ومنهم من كان حظه قوت الأسرار، وهم العارفون الكبار، السابقون المقربون، أهل الفناء والبقاء، أهل الرسوخ والتمكين، فهداهم إلى ما أمّلوا، ووصلهم إلى ما طلبوا\n نفعنا الله بهم، وخرطنا في سلكهم\n آمين\n وقوله: { فما بال القرون الأولى\n\n\n } الآية، فيه زجر للمريد عن الاشتغال بالحكايات الماضية، لأن في ذلك شُغُلاً عن الله، إلا ما كان فيه زيادة إلى الله، فتلك أمة قد خلت لها ما كسبت ولكم ما كسبتم\n وقوله تعالى: { الذي جعل لكم الأرض مهادًا } أي: جعل أرض النفوس مهادًا للقيام برسم العبودية، وسلك فيها سبلاً توصل إلى مشاهدة الربوبية، لمن سلكها بالرياضة والمجاهدة، وأنزل من سماء الملكوت ماء الواردات الإلهية، تحيا به الأرواح، فتخرج أصنافًا من العلوم والحكم شتى، كُلوا برعي القلوب في نِوار تجلياتها، وارعوا لقوت أشباحكم من ثمار حسياتها، إن في ذلك لآيات لأولي النُهى\n { منها خلقناكم }: من أرض نفوسكم أخرجناكم، بشهود عظمة الربوبية، وفيها نُعيدكم للقيام برسم العبودية، ومنها نُخرجكم لتكونوا لله، لا لشيء دونه\n أو منها خلقناكم، أي: أخرجناكم من شهود ظلمتها إلى نور خالقها، بالفناء عنها، وفيها نُعيدكم بالرجوع إلى الأثر في مقام البقاء، { ومنها نُخرجكم تارة أخرى } بعقد الحرية في مقام البقاء، فتكونوا عبيدًا شُكَّرًا\n وبالله التوفيق\n ثمَّ إنَّ فرعون لم ينفعه هذه الموعظة ولا ما رأى من الآيات الباهرة\n\n\n\n",
      "translations": []
    }
  ]
}