{
  "chapter": "طه",
  "text": "ولقد ارينه ءايتنا كلها فكذب وابى",
  "translations": [
    {
      "translation": "We showed him all of Our Signs, but he denied and spurned them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We showed him all Our signs, but he denied them and refused,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We showed Pharaoh Our Signs, all of them, but he declared them to be false and rejected them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We showed the Pharaoh all of Our miracles, but he called them lies and turned away from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We showed him all Our signs – so he denied them and did not accept.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We showed him (Fir`awn) all Our Ayat, but he denied and refused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And truly We showed him Our signs, all of them, but he rejected and refused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We showed Pharaoh all Our signs, but he cried lies, and refused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We verily did show him all Our tokens, but he denied them and refused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We showed Pharaoh all Our signs but he rejected them and refused to believe in them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We shewed him Our signs, all of them, but he belied and refused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We showed him all Our signs. But he denied [them] and refused [to believe them].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We showed Pharaoh all Our Signs, but he did reject and refuse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We showed him [Fir'aun (Pharaoh)] all Our Signs and Evidences, but he denied and refused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We showed him (Pharaoh) Our signs, all of them, but he belied and refused them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We showed him Our signs, all of them, but he denied and refused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly showed Pharaoh Our signs - all of them - but he denied and refused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:56] And verily We showed him, that is, We made Pharaoh see, all Our signs, [all] nine, but he denied, them, and claimed that they were [the result of] sorcery, and refused, to affirm the Oneness [of God], exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَقَدْ أَرَيْنَاهُ آَيَاتِنَا كُلَّهَا فَكَذَّبَ وَأَبَى (56)رجوع إلى قصص موسى عليه السلام مع فرعون . وهذه الجملة بين الجمل التي حكت محاورة موسى وفرعون وقعت هذه كالمقدمة لإعادة سَوق ما جرى بين موسى وفرعون من المحاورة . فيجوز أن تكون الجملة معطوفة على جملة : { قال فمن ربكما يا موسى } \\[ طه : 49 \\] باعتبار ما يقدّر قبل المعطوف عليها من كلام حذف اختصاراً ، تقديره : فأتيَاهُ فقالاَ ما أمرناهما أن يقولاه قال فمن ربّكما الخ . المعنى : فأتياه وقالا ما أمرناهما وأريناه آياتنا كلها على يد موسى عليه السلام .ويجوز أن تكون الجملة معترضة بين ما قبلها ، والواو اعتراضيّة .وتأكيد الكلام بلام القسم و ( قد ) مستعمل في التعجيب من تصلّب فرعون في عناده ، وقصد منها بيان شِدّته في كفره وبيان أن لموسى آيات كثيرة أظهرها الله لفرعون فلم تُجْد في إيمانه .وأجملت وعُممت فلم تفصل ، لأنّ المقصود هنا بيان شدّة تصلبه في كفره بخلاف آية سورة الأعراف التي قصد منها بيان تعاقب الآيات ونصرتها .وإراءة الله إياه الآيات : إظهارها له بحيث شاهدها .وإضافة ( آيات ) إلى ضمير الجلالة هنا يفيد تعريفاً لآيات معهودة ، فإن تعريف الجمع بالإضافة يأتي لما يأتي له التعريف باللاّم يكون للعهد ويكون للاستغراق ، والمقصود هنا الأول ، أي أرينا فرعون آياتنا التي جرت على يد موسى ، وهي المذكورة في قوله تعالى : { في تسع آيات إلى فرعون وقومه } \\[ النمل : 12 \\]. وهي انقلاب العصا حيّة ، وتبدّل لون اليد بيضاء ، وسِنُو القحط ، والجراد ، والقُمَّل ، والضفادع ، والدم ، والطوفان ، وانفلاق البحر . وقد استمر تكذيبه بعد جميعها حتى لما رأى انفلاق البحر اقتحمه طمعاً للظفر ببني إسرائيل .وتأكيد الآيات بأداة التوكيد { كُلَّها } لزيادة التعجيب من عناده . ونظيره قوله تعالى : { ولقد جاء آل فرعون النذر كذبوا بآياتنا كلها } في سورة القمر ( 41 ، 42 ).وظاهر صنيع المفسرين أنهم جعلوا جملة ولَقَدْ أريناهُ ءاياتنا } عطفاً على جملة { قال فمن ربكما يا موسى } \\[ طه : 49 \\] ، وجملة { قال فمن ربكما بياناً لجملة فَكَذَّبَ وأبى }. فيستلزم ذلك أن يكون عزم فرعون على إحضار السحرة متأخّراً عن إرادة الآيات كلها فوقعوا في إشكال صحة التعميم في قوله تعالى : { آياتِنَا كُلَّهَا . } وكيف يكون ذلك قبل اعتراف السحرة بأنهم غلبوا مع أن كثيراً من الآيات إنما ظهر بعد زمن طويل مثل : سني القحط ، والدم ، وانفلاق البحر . وهذا الحمل لا داعي إليه لأنّ العطف بالواو لا يقتضي ترتيباً .\n\n",
      "translations": [
        {
          "translation": "(And We verily did show him) i.e. Pharaoh (all Our tokens) the hand, the staff, the flood, the locusts, the lice, the frogs, blood, drought and lack of harvest, (but he denied them) i.e. the signs and said that they are not from Allah (and refused) to surrender to Allah, rejecting thus all the signs.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أريناه آياتنا } من الحجج والبينات الدالة على التجرّد عن المواد ووجود الأنوار { فكذب } لكونها مادة { وأبى } القبول لامتناع إدراكها للمجرّدات وأنكر إزعاجها عن وكرها البدني بقوله: { أجئتنا لتخرجنا من أرضنا } ونسب البرهان إلى السحر لقصورها عن إدراكه وعجزها عن قبوله وأغرى القوى التخيلية والوهمية على المعارضة والمجادلة وقلما أذعنت النفس للبرهان النير والحق البين بدون الرياضة والإماتة\n وكلما أورد عليها حرّضت الوهم والتخيل على التشكيك والقدح\n والموعد هو وقت تركيب الحجة وترتيب المقامات وذلك وقت زينة النفس الناطقة بالمدركات وحشر القوى العقلية والروحانية لاستحضار المعلومات والمخزونات { ضحىً } إشراق نور شمس العقل الفعال إذ هناك تعرض النفس عن قبولها ويجمع كيدها من أنواع المغالطات والوهميات ويقمعها القلب باليقينيات وإظهار أكاذيبها المفتريات\n والتنازع الواقع بين القوى النفسانية هو عدم مسالمتها في طاعة القلب وانجذاب كل منها إلى لذته متمانعة متخالفة\n وإسرارها النجوى استبطان الكل الدواعي المخالفة للقلب مع تخالفها في أنفسها\n ونسبتها إلى السحر إشارة إلى عجزها عن إدراك معانيها وخفاء براهينها عليها\n والطريق المثلى\n أي: الفضلى عندها هي تحصيل اللذات الحسيّة والانهماك في الشهوات البدنية\n وإلقاؤها أولاً إشارة إلى تقدّم الوهميات والخياليات في الوجود الإنساني على العقليات واليقينيات عند السلوك وإلا ما احتيج إلى البرهان القاطع والدليل الواضح وإلى أن الواجب على الداعي إلى الحق أولاً نقض الباطل ودفع الشبهة بالحجة ليزول الاعتقاد الفاسد ويتمكن استقرار الحق\n والحبال والعصيّ هي المغالطات والسفسطات من الشبهة الجدلية التي تكاد تتمشى وتغلب على القلب لولا تأييد الحق بنور الروح والعقل وهو معنى قوله:\n[طه\n الآية:68 - 69] العاقلة النظرية من البرهان المعتمد عليه يفن مصنوعاتهم المزخرفة وأباطيلهم المموّهة\n فتضمحلّ وتتلاشى\n إنما صنعوا كيد تزوير ومكر لا حقيقة له لا ما صنعت كما زعموا\n فألقي السحرة سجداً فانقادت حينئذ القوى الوهمية والخيالية والتخييلية والحسية عند ظهور عجزها والنفس الأمارة ثابتة في تفرعنها وعتوّها لعدم ارتياضها واعتيادها بمألوفاتها وترأسها على القوى وتجبرها\n باقية على عنادها وشدّة شكيمتها\n { ولأقطعنّ } إشارة إلى إبعادها وتخويفها للقوى عند إذعانها يمنع تصرّفاتها في المعايش وترك سعيها في تحصيل الملاذ والمشتهيات الجسمانية من جهة مخالفتها إياها بموافقة القلب\n وصلبها في جذوع النخل: إيقافها بالإماتة عند الرياضة في حدّ القوى النباتية وإثباتها في مقارّها ومبادىء نشأتها من أعالي مراتب القوى النباتية دون التصرّف في سائر المراتب والاستعلاء على المناصب والاستيلاء في المكاسب\n أو من الأعضاء التي هي معادنها ومظاهرها\n وهذا التخويف على هذا التأويل من قبيل أحاديث النفس وهواجسها بسبب اللمات الشيطانية المثبطة عن المجاهدة لقوله تعالى:\n[آل عمران\n الآية:175] ليفيد إعراضها عن مطاوعة القلب وقيامها بخدمتها وتسخرها لها ولو حمل على المباحثة الظاهرة المستفادة من قوله تعالى:\n[النحل\n الآية:125] بعد التصديق بالظاهر والإيمان بالإعجاز الباهر لأجرى قوله:\n[طه\n الآية:42] على ظاهره إلى قوله: { فَتَنَازَعُوۤاْ أَمْرَهُمْ بَيْنَهُمْ } [طه\n الآية:62] أي: تباحثوا فيما بينهم في السر\n متنازعين فيما يعارضونه به من ضروب الجدل\n وقيل في قوله: { إِنْ هَـٰذَانِ لَسَاحِرَانِ } [طه\n الآية:63] مفلقان في البيان والفصاحة والاحتجاج لا يكاد يعارضهما أحد فيحجّهما",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والتنبيه بدلائل الآفاق والأنفس { لَقَدْ أَرَيْنَاهُ } تحقيقاً وتأكيداً\n لئلا يبقى عنا جداله\n حين أخذنا بظلمه في وقت الجزاء\n مع علمنا بأنه من الهالكين في بيداء البُعد والعناد { آيَاتِنَا } الدالة على صدق موسى المرسَل { كُلَّهَا } متعاقبة مترادفة\n وهي: العصا واليد البيضاء والطوفان والجراد والقمّل والضفادع والدم والسنين والطمس { فَكَذَّبَ } بجميعها { وَأَبَىٰ } [طه: 56] فامتنع عن تصديق شيءٍ منها\n بل نسب الكل إلى السحر والشعبذة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:50",
      "similarity": 0.7257535462145598
    },
    {
      "verse": "17:89",
      "similarity": 0.6899582503849827
    },
    {
      "verse": "17:99",
      "similarity": 0.6234844315652512
    },
    {
      "verse": "15:31",
      "similarity": 0.5635522294589045
    },
    {
      "verse": "20:116",
      "similarity": 0.49960669598654667
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020056.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020056.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:56.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}