{
  "chapter": "طه",
  "text": "كلوا۟ وارعوا۟ انعمكم ان فى ذلك لءايت لاو۟لى النهى",
  "translations": [
    {
      "translation": "Eat and pasture your cattle. Certainly there are Signs in that for people of sound intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To eat and feed your cattle. Surely there are signs in these for those who are wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat yourself and pasture your cattle. Surely there are many Signs in this for people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consume them as food or for grazing your cattle. In this there is evidence (of the existence of God) for the people of reason\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat, and graze your cattle; indeed in this are signs for people of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat and pasture your cattle; verily, in this are Ayat for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat and pasture your cattle; most surely there are signs in this for those endowed with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you eat, and pasture your cattle! Surely in that are signs for men possessing reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): Eat ye and feed your cattle. Lo! herein verily are portents for men of thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so eat and graze your cattle. In this there are signs for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat and pasture your cattle: verily therein are signs for men of sagacity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Eat and pasture your cattle.’ There are indeed signs in that for those who have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat (for yourselves) and pasture your cattle: verily, in this are Signs for men endued with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat and pasture your cattle, (therein); verily, in this are proofs and signs for men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You eat and let your cattle graze' Surely, in this there are signs for those of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat and pasture your livestock. In that are signs for those with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat [therefrom] and pasture your livestock. Indeed, in that are signs for those of intelligence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:54] Eat, thereof, and pasture your cattle, therein (an‘ām, ‘cattle’, is the plural of na‘am, which are camels, cows and sheep; one says ra‘atu’l-an‘āmu, ‘the cattle grazed’ or ra‘aytuhā, ‘I grazed them’; the imperative here is meant as a permissive and a reminder of [God’s] grace, the sentence being a circumstantial qualifier referring to the subject of [the verb] akhrajnā, ‘We brought forth’, in other words [what is meant is], ‘[We brought forth the plants] permitting you to eat thereof and to graze [your] cattle [thereon]’). In that, which is mentioned here, there are indeed signs, indeed lessons, for people of sense, possessors of intellect (alnuhā, the plural of nuhya, similar [in pattern] to ghurfa, [plural] ghuraf. The intellect is called by this [term, nuhya] because it shows a person the sense to refrain from committing vile deeds).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Saying): Eat ye) that which you eat (and feed your) grazing (cattle) from its vegetation. (Lo! Herein) in their difference and different colours (verily are portents) signs (for men of thought) for those endowed with intellect among people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لأُوْلِي ٱلنُّهَىٰ } يعني لأُولي العُقُولِ\n واحدُها نُهْيةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا احتجتم إلى الغذاء { كُلُواْ } منها؛ حيث شئتم رغداً { وَٱرْعَوْا أَنْعَامَكُمْ } التي تستريحون بسببها من أكلها وحملها وركوبها { إِنَّ فِي ذٰلِكَ } الجَعَل والإنزال والإخراج { لآيَاتٍ } دلائلَ واضحاتٍ على قدرتنا واختبارنا { لأُوْلِي ٱلنُّهَىٰ } [طه: 54] الناهين عقولهم عن إسناد الأمور إلى الأسباب بل يسندونها إلى مُسَبِّبها أولاً وبالذات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nومن تمام نعمته تعالى أن أرزاق عباده، لمَّا كان تحصيلها بعمل الأنعام، جعل عَلفَها مما يفضل عن حاجتهم، ولا يليق بكونه طعامًا لهم، وهو معنى قوله: { كُلوا وارْعَوا أنعامكم } ، والجملة: حالٌ، على إرادة القول، أي: أخرجنا منها أصناف النبات، قائلين: كلوا وارعوا أنعامكم، آذنين في ذلك لكم\n { إِن في ذلك } المذكور، من شؤونه تعالى، وأفعاله وأنعامه، { لآياتٍ } جليلة واضحة الدلالة على عظيم شأنه تعالى، في ذاته وصفاته وأفعاله، وعلى صحة نبوة موسى وهارون - عليهما السلام-، { لأُولي النُّهَى } أي: العقول الصافية، جمع \" نُهْيَة \" ، سمى بها العقل، لنهيه عن اتباع الباطل، وارتكاب القبيح، أي: لذوي العقول الناهية عن الأباطيل، التي من جملتها ما يدعيه الطاغية وما يقبله منه الفئة الباغية\n وتخصيص كونها آيات لهم، مع أنها آية للعالمين لأنهم المنتفعون بها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "87:4",
      "similarity": 0.8040219907198989
    },
    {
      "verse": "79:31",
      "similarity": 0.7585064355745424
    },
    {
      "verse": "23:8",
      "similarity": 0.743473106753682
    },
    {
      "verse": "70:32",
      "similarity": 0.743473106753682
    },
    {
      "verse": "2:104",
      "similarity": 0.7223513229400966
    }
  ]
}