{
  "chapter": "طه",
  "text": "فتنزعوا۟ امرهم بينهم واسروا۟ النجوى",
  "translations": [
    {
      "translation": "They argued among themselves about the matter and had a secret conference.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they discussed their strategy among themselves and conferred privately,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon they wrangled among themselves about the matter and conferred in secret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They started arguing and whispering to each other\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they differed with one another in their task, and secretly conferred.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they debated one with another what they must do, and they kept their talk secret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they disputed with one another about their affair and kept the discourse secret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they disputed upon their plan between them, and communed secretly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they debated one with another what they must do, and they kept their counsel secret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they [the magicians] conferred among themselves, whispering to one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they wrangled about their affair among themselves, and kept secret their private counsel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they disputed their matter among themselves, and kept their confidential talks secret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they disputed, one with another, over their affair, but they kept their talk secret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they debated with one another what they must do, and they kept their talk secret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disputed upon their plan with one another, and spoke in secret\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disagreed among themselves over their affair, and conferred secretly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they disputed over their affair among themselves and concealed their private conversation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:62] So they disputed their matter among themselves, regarding Moses and his brother, and kept secret their   private counsel, that is, their conversation regarding the two,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then they debated one with another what they must do) they consulted with one another and decided that if Moses defeats them, they will believe in him, (and they kept their counsel secret) from Pharaoh.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفإذا سمع السحرة من موسى قوله هذا، وتأملوا فيه تأملاً صادقاً، وجدوه صادراً عن محض الحكمة والفطانة، فلذلك تأثروا من قوله تأثراً عظيماً { فَتَنَازَعُوۤاْ } وتشاوروا { أَمْرَهُمْ بَيْنَهُمْ } بأن أمثال هذا الكلام لا يصدر إلا من المؤيَّدِ من عند الله، المستظهِر به سبحانه، ما يشبه كلام السحرة المعارضين، فمآل كل منهم في نفسه إلى تصديقه { وَأَسَرُّواْ ٱلنَّجْوَىٰ } [طه: 62] أي: مناجاتهم في أنفسهم من فرعون وملئه، فتمكن فرعون وملئه في معرض المعارضة وقابلوا السحرة لممانعتهما\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}