{
  "chapter": "طه",
  "text": "والق ما فى يمينك تلقف ما صنعوا۟ انما صنعوا۟ كيد سحر ولا يفلح الساحر حيث اتى",
  "translations": [
    {
      "translation": "Throw down what is in your right hand. It will swallow up their handiwork. Their handiwork is just a",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down what is in your right hand: It will swallow up what they have conjured. For what they have fashioned is only a trick of the sorcerer; and a sorcerer does not succeed wherever he may come.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And throw down what is in your right hand; it will swallow up all that they have wrought. They have wrought only a magician's stratagem. A magician cannot come to any good, come whence he may.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down what is in your right hand and it will swallow up all that they have performed; theirs is only a magical performance. Magicians can find no happiness in whatever they do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And cast down which is in your right hand – it will devour all that they have fabricated; what they have made is only a magician’s deceit; and a magician is never successful, wherever he comes.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And throw that which is in your right hand! It will swallow up that which they have made. That which they have made is only a magician's trick, and the magician will never be successful, to whatever amount (of skill) he may attain.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cast down what is in your right hand; it shall devour what they have wrought; they have wrought only the plan of a magician, and the magician shall not be successful wheresoever he may come from.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cast down what is in thy right hand, and it shall swallow what they have fashioned; for they have fashioned only the guile of a sorcerer, and the sorcerer prospers not; wherever he goes.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw that which is in thy right hand! It will eat up that which they have made. Lo! that which they have made is but a wizard's artifice, and a wizard shall not be successful to whatever point (of skill) he may attain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down that [staff] which is in your right hand -- it shall swallow up what they have wrought, for what they have wrought is only a magician's trick. A magician shall never thrive, come whence he may.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cast thou down that which is in thy right hand: it shall swallow up that which they have wrought; They have wrought only a magician's stratagem; and the magician prospereth not wheresoever he cometh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down what is in your right hand, and it will swallow what they have conjured. What they have conjured is only a magician’s trick, and the magician does not fare well wherever he may show up.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw that which is in thy right hand: Quickly will it swallow up that which they have faked what they have faked is but a magician's trick: and the magician thrives not, (no matter) where he goes.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And throw that which is in your right hand! It will swallow up that which they have made. That which they have made is only a magician's trick, and the magician will never be successful, no matter whatever amount (of skill) he may attain.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw that which is in your right hand. It will swallow up that which they have made, for that which they made is but the guile of a sorcerer. Wherever he goes the sorcerer does not prosper'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now throw down what is in your right hand—it will swallow what they have crafted. What they have crafted is only a magician’s trickery. But the magician will not succeed, no matter what he does.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And throw what is in your right hand; it will swallow up what they have crafted. What they have crafted is but the trick of a magician, and the magician will not succeed wherever he is.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:69] And cast that which is in your right hand — and this was his staff. It shall swallow up that which they have produced. For what they have produced is only a sorcerer’s trick, that is to say, a kind thereof, and the sorcerer does not succeed wherever he may go’, in his sorcery. So Moses cast his staff and it swallowed up all of that which they [had] produced.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Throw) to the ground (that which is in thy right hand) Moses! (It will eat up) it will swallow (that which they have made) that which they have thrown of staffs and ropes. (Lo! that which they have made) that which they have thrown to the ground is (but a wizard's artifice, and a wizard shall not be successful) he shall not be safe nor escape Allah's chastisement or succeed (to whatever point (of skill) he may attain) wherever he is.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ يُفْلِحُ ٱلسَّاحِرُ حَيْثُ أَتَىٰ } يعني حيثُ كَانَ فَلاَ ظَفرَ لَهُ\n وقال: إِنهُ يُقتلُ حَيثُما وُجدَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And the sorcerer will not prosper wherever he goes,\" means that wherever he is, he will not be saved.\n He said, \"He will be killed wherever he is found.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { تَلْقَفْ ما صنعوا }: جواب الأمر\n من لقفه\n إذا ابتلعه والتقمه بسرعة\n أي: تبتلع\n وتلتقم بسرعة\n ما صنعوا من الحبال والعصي\n التي تخيل إليك\n والجملة الأمرية معطوفة على النهي عن الخوف\n موجبة لبيان كيفية غلبته عليه السلام وعلوه\n وإدحاض الخوف عنه\n فإن ابتلاع عصاه لأباطيلهم\n التي منها أوجس في نفسه ما أوجس\n مما يقلع مادته بالكلية\n وهذا\n كما ترى\n صريح في أن خوفه عليه السلام لم يكن - كما قال مقاتل - من خوف شك الناس وعدم اتباعه له عليه السلام\n وإلا لعلله بما يزيله من الوعد بالنصر الذي يُوجب اتباعه\n فتأمله\n قاله أبو السعود\n وفيه نظر بأن قوله: { تلقف ما صنعوا } صريح في عدم الالتباس إذ لا ينبغي التباس مع ابتلاع عصاه لعصيهم\n فتأمله\n { إِنما صنعوا كَيْدُ ساحرٍ } أي: إن الذي صنعوه كيد ساحر وحِيلَهُ\n وقرأ أهل الكوفة: { سِحْر } بكسر السين\n فالإضافة للبيان\n كما في \" علم فقه \" \n أو: كيد ذي سحر\n أو يسمى الساحر سحرًا مبالغة\n والجملة تعليل لقوله: { تلقف } أي: تبتلعه لأنه كيد ساحر\n { ولا يُفلح الساحرُ حيث أتى } أي: حيث وُجد\n وأين أقبل\n وهو من تمام التعليل\n والله تعالى أعلم\n الإشارة: يقال للفقير\n المتوجه إلى الله تعالى\n من قبل الحق: إمَّا أن تُلقي الدنيا من يدك\n وإمَّا أن نكون أول من ألقاها عنك\n أي: إما أن تتركها اختيارًا\n أو تزول عنك اضطرارًا لأن عادته تعالى\n مع المتوجه الصادق\n أن يدفع عنه كل ما يشغله من أمور الدنيا فيقول - إن كان صادق القلب -: بل ألقها\n ولا حاجة لي بها\n فألقاها الحق تعالى\n وأخرجها من يده\n عناية به\n فإذا أشغالها وعلائقها كانت تسعى في هلاكه وخراب قلبه وتضييع عمره\n فأوجس في نفسه خيفة من العيلة ولحوق الفاقة\n قلنا: لا تخف\n حيث توجهت إلى مولاك\n فإن الله يرزق بغير حساب وبلا أسباب\n وأَلقِ ما في يمين قلبك من اليقين\n تلقف ما صنعوا\n أي: ما صنعت بِكَ خواطر السوء والشيطان\n لأنه يَعدِ بالفقر ويأمر بالفحشاء\n وإنما صنعوا ذلك تخويفًا وتمويهًا\n لا حقيقة له\n كما يفعل الساحر\n { ولا يفلح الساحر حيث أتى }\n ثمَّ ذكر إسلام السحرة وما كان من شأنهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:45",
      "similarity": 0.6860820140238724
    },
    {
      "verse": "7:117",
      "similarity": 0.6748203047925506
    },
    {
      "verse": "20:41",
      "similarity": 0.18157408436138522
    },
    {
      "verse": "20:64",
      "similarity": 0.17654100773950782
    },
    {
      "verse": "26:129",
      "similarity": 0.17565910358388215
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/20:69.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/20:69.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/20:69.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}