{
  "chapter": "طه",
  "text": "قالوا۟ ان هذن لسحرن يريدان ان يخرجاكم من ارضكم بسحرهما ويذهبا بطريقتكم المثلى",
  "translations": [
    {
      "translation": "They said, 'These two magicians desire by their magic to expel you from your land and abolish your most excellent way of life,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And) said: \"These two are surely magicians. They want to deprive you of your land with their magic, and eradicate your distinct way (of life).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them said: \"These two are magicians, who want to drive you out of your land with their magic and to destroy your excellent way of life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and said, \"These two people are magicians. They want to expel you from your land through their magic and to destroy your own tradition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Undoubtedly these two are magicians for sure, who wish to expel you from your land by the strength of their magic, and destroy your exemplary religion!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Verily, these are two magicians. Their object is to drive you out from your land with magic, and to take you away from your exemplary way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: These are most surely two magicians who wish to turn you out from your land by their magic and to take away your best traditions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying, 'These two men are sorcerers and their purpose is to expel you out of your land by their sorcery, and to extirpate your justest way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Lo! these are two wizards who would drive you out from your country by their magic, and destroy your best traditions;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Certainly they are both magicians who want to drive you out of your land by their magic, and destroy your best traditions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: verily these two are magicians, intending to drive you forth from your land by their magic and to do away with your superior way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘These two are indeed magicians who intend to expel you from your land with their magic, and to abolish your excellent tradition!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"These two are certainly (expert) magicians: their object is to drive you out from your land with their magic, and to do away with your most cherished institutions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Verily! These are two magicians. Their object is to drive you out from your land with magic, and overcome your chiefs and nobles.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying: 'These two are sorcerers whose aim is to drive you from your land by their sorcery and destroy your noble ways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “These two are magicians who want to drive you out of your land with their magic, and to abolish your exemplary way of life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Indeed, these are two magicians who want to drive you out of your land with their magic and do away with your most exemplary way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:63] They said, to each other, ‘These two men (hādhān, this [form] concords with the forms used by those [grammarians] who use the alif [ending] for all three cases of the dual person; Abū ‘Amr has [the variant reading] hādhayn) are indeed sorcerers who intend to expel you from your land by their sorcery, and do away with your excellent traditions (muthlā, the feminine form of amthal, meaning ‘the noblest’) in other words, [they will do away with the loyalty of] the noblemen among you, because these [latter] will prefer the two of them [Moses and Aaron] on account of their triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then (They said) openly: (Lo! these are two wizards) i.e. Moses and Aaron are two wizards (who would drive you out from your country) Egypt (by their magic, and destroy your best traditions) your religion and your best men;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَذْهَبَا بِطَرِيقَتِكُمُ ٱلْمُثْلَىٰ } معناه ويَصْرِفا وِجَوهَ الناسِ إِليهما\n\n",
      "translations": [
        {
          "translation": " And His saying - exalted be He: {And they will go on their [separate] ways, and [all] will come to know their return}, its meaning is that they will go on their [separate] ways and will turn the faces of the people towards them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُوۤاْ } أي: فرعون وأشرافهم للسحرة تقويةً لهم في أمرهم: { إِنْ هَـٰذَانِ } الرجلان الحقيران { لَسَاحِرَانِ } يدَّعيان الرسالة من ربهما الموهوم ترويجاً لسحرهما\n وبعد الترويج { يُرِيدَانِ أَن يُخْرِجَاكُمْ مِّنْ أَرْضِكُمْ } المألوفة { بِسِحْرِهِمَا } أي: بمجرد سحرهما لا من أمرٍ سماويٍ كما زعمان\n وبعد إخراجكم من أرضكم يريدان الاستقرار والاستيلاء على عموم ملك العمالقة { وَيَذْهَبَا } بعد التقرر والتمكن { بِطَرِيقَتِكُمُ ٱلْمُثْلَىٰ } [طه: 63] أي: عادتكم العظمى ومرتبتكم العليا\n\n\nوبالجملة: يريدان أن يجعلا أمرنا وأمر بني إسرائيل بالعكس\n ليكون لهم الكبرياء ولنا المذلة والهوان\n بعكس ما كان من سالف الزمان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فتنازعوا } أي: السحرة، حين سمعوا كلامه عليه السلام، { أمرَهُم } أي: في أمرهم الذي أريد منهم من مغالبته عليه السلام، وتشاوروا وتناظروا { بينهم } في كيفية المعارضة، وتشاجروا، ورددوا القول في ذلك، { وأسَرُّوا النجوى } أي: من موسى عليه السلام لئلا يقف عليه فيدافعه، ونجواهم على هذا هو قوله: { قالوا إِنْ هذان } أي: موسى وهارون، { لساحران } عظيمان { يُريدان أن يُخرجاكم من أرضكم } مصر، بالاستيلاء عليها { بسحرهما } الذي أظهره قبل، { ويَذْهبا بطريقتكُمُ المثلى } أي: بمذهبكم، الذي هو أفضل المذاهب وأمثلُها، بإظهار مذهبهما وإعلاء دينهما\n قال ابن عطية: والأظهر، في الطريقة هنا، أنه السيرة والمملكة\n والمُثلى: تأنيث الأمثل، أي: الفاضلة الحسنة\n هـ\n وقيل: الطريقة هنا: اسم لوجوه القوم وأشرافِهم، لأنهم قدوة لغيرهم، والمعنى: يريدان أن يصرفا وجوه الناس وأشرافَهم إليهما، ويُبطلان ما أنتم عليه\n وقال قتادة: طريقتهم المثلى يومئذ: بنو إسرائيل، كانوا أكثر القوم عددًا وأموالاً، فقال فرعون: إنما يريدان أن يذهبا به لأنفسهما\n ولا شك أن حمل الإخراج على إخراج بني إسرائيل من بينهم، مع بقاء قوم فرعون على حالهم آمِنين في ديارهم بعيد، مما يجب تنزيه التنزيل عن أمثاله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "86:1",
      "similarity": 0.7278143748548889
    },
    {
      "verse": "4:168",
      "similarity": 0.6835905274121217
    },
    {
      "verse": "20:104",
      "similarity": 0.657015976235902
    },
    {
      "verse": "86:2",
      "similarity": 0.6423308580554169
    },
    {
      "verse": "46:30",
      "similarity": 0.6056848080674483
    }
  ]
}