{
  "chapter": "طه",
  "text": "قال لهم موسى ويلكم لا تفتروا۟ على الله كذبا فيسحتكم بعذاب وقد خاب من افترى",
  "translations": [
    {
      "translation": "Musa said to them, 'Woe to you! Do not fabricate lies against Allah or He will annihilate you with His punishment. Fabricators of lies are bound to fail.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to them: \"Woe betide you. Do not fabricate a lie against God, or He will destroy you with some affliction. For he who fabricates lies is doomed to failure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(At the time of the encounter) Moses said to them: \"Woe to you! Do not invent falsehoods against Allah lest He destroy you with a scourge. Surely those who invent lies shall come to grief.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses told them, (the magicians) \"Woe to you if you invent falsehood against God; you will be destroyed by the torment. Whoever invents falsehood against God will certainly be lost.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moosa said to them, “Ruin is to you – do not fabricate a lie against Allah, that He may destroy you by a punishment; and indeed one who fabricates lies has failed.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said to them: \"Woe unto you! Invent not a lie against Allah, lest He should destroy you completely by a torment. And surely, he who invents a lie (against Allah) will fail miserably.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said to them: Woe to you! do not forge a lie against Allah, lest He destroy you by a punishment, and he who forges (a lie) indeed fails to attain (his desire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Moses said to them, 'O beware! Forge not a lie against God, lest He destroy you with a chastisement. Whoso forges has ever failed.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said unto them: Woe unto you! Invent not a lie against Allah, lest He extirpate you by some punishment. He who lieth faileth miserably.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to them, \"Woe to you! Do not invent lies against God, lest He destroy you by some calamity: whoever invents lies is bound to fail.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said unto them: woe unto you! fabricate not against Allah a lie, lest he extirpate you with a torment, and surely He who fabricateth, loseth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to them, ‘Woe to you! Do not fabricate lies against Allah, or He will obliterate you with a punishment. Whoever fabricates lies certainly fails.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to him: Woe to you! Forge not ye a lie against Allah, lest He destroy you (at once) utterly by chastisement: the forger must suffer frustration!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa (Moses) said to them: \"Woe unto you! Invent not a lie against Allah, lest He should destroy you completely by a torment. And surely, he who invents a lie (against Allah) will fail miserably.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Moses said to them: 'Alas! Do not forge a lie against Allah lest He destroys you with a punishment. Indeed, whosoever forges has failed'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to them, “Woe to you. Do not fabricate lies against God, or He will destroy you with a punishment. He who invents lies will fail.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to the magicians summoned by Pharaoh, \"Woe to you! Do not invent a lie against Allah or He will exterminate you with a punishment; and he has failed who invents [such falsehood].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:61] Moses said to them — and there were 72 of them, each with a rope and a staff in his hand — ‘Woe to you!, meaning, may God make you liable to woe. Do not invent a lie against God, by ascribing partners to Him, lest He annihilate you (read fa-yushitakum or fa-yashatakum) by some chastisement, from Him. For verily he who invents lies, against God, fails’, [he] is the loser.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Moses said unto them) to the magicians: (Woe unto you!) may Allah tighten this worldly life for you (Invent not a lie against Allah, lest He extirpate you) lest He destroys you (by some punishment) from Him. (He who lieth) about Allah (faileth miserably) loses miserably. 341\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَيُسْحِتَكُم بِعَذَابٍ } معناه يَستَأصِلَكُمْ\n ويقالُ: سَحَتهُ وأَسْحَتهُ لغتان\n\n",
      "translations": [
        {
          "translation": " And His saying, { \"So I will surely strike you with a punishment\" } its meaning is that He will cut you off.\n\n\nIt is said: \"He has mastered his language(s) {and} has become an expert in them.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما حضروا الموعد { قَالَ لَهُمْ } أي: للسحرة { مُّوسَىٰ } على مقضتى شفقة النبوة أو بإلقاء الله إياه بطريق الإلهام كلاماً خالياً عن الميل إلى الخصومة إمحاضاً للنصح: { وَيْلَكُمْ } أي: ويلُ لكم ايها العقلاء التاركومن طريقَ العقل بمتابعة هذا الطاغي { لاَ تَفْتَرُواْ عَلَى ٱللَّهِ كَذِباً } بأن أفعاله مما يعارَض بالسحر والشعوذة؛ لأن ما جئتُ به من الآيات مما آتاني الله من فضله، وإن افتريتم على الله { فَيُسْحِتَكُم } أي: يهلككم ويستأصلكم { بِعَذَابٍ } نازلٍ من قهره { وَقَدْ } تحقق عندكم أيها العقلاء أنه { خَابَ } خيبةً أبديةً { مَنِ ٱفْتَرَىٰ } [طه: 61] على الله بما لا يليق بذاته من إبطال قدرته أو دعوى المعارضة معه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال لهم موسى } ، حيث اجتمعوا من طريق النصيحة: { ويلَكُم } أي: ألزمَكم اللهُ الويل، إن افتريتم على الله الكذب، { لا تفتروا على الله كذبًا } بإشراك أحد معه، كما تعتقدون في فرعون، أو بأن تحيلوا الباطل حقًا، { فَيُسْحِتَكم } أي: يستأصلكم، بسببه، { بعذابٍ } لا يُقَادَر قدره، وقرئ رباعيًا وثلاثيًا، يقال: سحت وأسحت\n فالثلاثي: لغة أهل الحجاز، والرباعي: لغة بني تميم ونجد\n { وقد خاب } وخسر { مَن افترى } على الله، كائنًا من كان، بأي وجه كان، فيدخل الافتراء المنهي عنه دخولاً أوليًا، أو: قد خاب فرعون المفتري على الله، فلا تكونوا مثله في الخيبة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:62",
      "similarity": 0.5670498356958508
    },
    {
      "verse": "5:42",
      "similarity": 0.5653902192841986
    },
    {
      "verse": "5:63",
      "similarity": 0.46860959100899824
    },
    {
      "verse": "14:15",
      "similarity": 0.46814323888981707
    },
    {
      "verse": "3:127",
      "similarity": 0.29792334416981425
    }
  ]
}