{
  "chapter": "طه",
  "text": "فاجمعوا۟ كيدكم ثم ائتوا۟ صفا وقد افلح اليوم من استعلى",
  "translations": [
    {
      "translation": "so decide on your scheme and then arrive together in force. He who gains the upper hand today will definitely prosper.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So prepare your strategy and come forward. He alone shall win today who is superior.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So muster all your stratagem and come forth in a row. Whoever prevails today shall triumph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring together your devices and come forward in ranks; the winner will, certainly, have great happiness\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore strengthen your scheme, and come forth in rows; indeed whoever dominates this day has succeeded.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So devise your plot, and then assemble in line. And whoever overcomes this day will be indeed successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore settle your plan, then come standing in ranks and he will prosper indeed this day who overcomes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So gather your guile; then come in battle-line. Whoever today gains the upper hand shall surely prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So arrange your plan, and come in battle line. Whoso is uppermost this day will be indeed successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, decide upon your plan and then come forward in ranks. Whoever gains the upper hand today shall surely triumph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore devise your stratagem, and then come in a row; and prospered to-day is he who overcometh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So summon up your ingenuity, then come in ranks. Today he who has the upper hand will be felicitous!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore concert your plan, and then assemble in (serried) ranks: He wins (all along) today who gains the upper hand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So devise your plot, and then assemble in line. And whoever overcomes this day will be indeed successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gather your guile and then lineup a rank those who gain the upper hand today shall indeed prosper'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So settle your plan, and come as one front. Today, whoever gains the upper hand will succeed.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So resolve upon your plan and then come [forward] in line. And he has succeeded today who overcomes.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:64] So summon up your guile, in the way of sorcery (read fa’jma‘ū, from [the first form] jama‘a, meaning ‘he gathered’, or read fa-ajmi‘ū, from [the fourth form] ajma‘a, meaning ‘he resolved [to do something]’) and come in battle-line (saffan, a circumstantial qualifier, meaning ‘standing in rows’). For truly he who is uppermost, [he who] triumphs, this day shall be the victor!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So arrange your plan) your scheming, magic and knowledge, (and come in battle line) all together. (Whoso is uppermost) victorious (this day will be indeed successful).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَجْمِعُواْ } معناه احكموا أَمركُم واعزِموا عَليهِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {So judge [between them]}, its meaning is: Pass judgment on your affair and resolve upon it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فأجمعوا كيدكم } أي: اتّفقوا فيما تبارزونهما به فتكونوا متفقي الكلمة متعاضدين { فإذا حبالهم وعصيهم } أي: تخيلاتهم ووهمياتهم { يخيل إليه من سحرهم } في التركيب والبلاغة وحسن التقرير وتمشية المغالطة والسفسطة وهيئة ترتيب القياس الجدلي كأنها تسعى\n أي: تمشي { خيفة } عن غلبة الجهّال ودولة الضلال\n كما قال أمير المؤمنين عليّ عليه السلام: \" لم يوجس موسى خيفة على نفسه\n إنما خاف من غلبة الجهّال ودولة الضلال \"\n { قلنا لا تخف } شجعناه وأيّدناه\n بروح القدس { وألق ما في يمينك } أي: ما في ضبط عقلك من النفس المؤتلفة بشعاع القدس المضيئة بنور الحق { تلقف ما صنعوا } ما زخرفوا وزوّروا من الشبهات والتمويهات الباطلة والأباطيل المزخرفة بالحجج النيرة والبراهين الواضحة { إنما صنعوا } وتلقفوا { كيد ساحر } أي: تمويه وتزوير { فألقي السحرة سجداً } منصفين مذعنين مقرين بكونه على الحق لما عرفوا من صدق البينة وظهور المعجزة وقيام الحجة وجلية البرهان { قالوا آمنا } الإيمان اليقيني لأنهم كوشفوا بالحق فعرفوا ربوبيته للكل\n وإنما أضافوا الربّ إليهما مع تعميم الإضافة إلى العالمين لزيادة اختصاصهما به وفضل ربوبيته إياهما\n فإنه يربّ كل شيء باسم يناسبه ويقتضيه استعداده ويربهما بأكبر أسمائه الحسنى على حسب كمال استعدادهما ولظهوره فيهما بكمالات صفاته وتجليه عليهم فيهما بآياته\n فعلموا أنهم من شكوتهما عرفوا ما عرفوا\n وبوسيلتهما وصلوا إلى ما وصلوا\n وبتبعيتهما وجدوا ما وجدوا\n لا على سبيل الاستقلال\n واعلم أن الساحر أقرب الناس استعداداً من النبي لأن مبادىء خوارق العادات أمور ثلاثة: إما خواص التركيب وتمزيجات المواد العنصرية والصور وجمع الأخلاط المختلفة المزاج والجوهر وهو من باب النيرنجات\n وإما جمع القوى السماوية والأرضية بإعداد الصور السفلية والمواد العنصرية لاستجلاب فيض النفوس السماوية واتصالها بقوى الأجرام الأرضية وهو من باب الطلسمات\n وإما تأثير النفوس وهيئاتها المستفادة من العالم العلوي وهو من الكامل المبعوث للنبوّة القائم بالدعوة إعجاز ومن الواصل المحق المترقي إلى ذروة الولاية غير المبعوث للنبوّة كرامة\n والفرق بينهما أن الإعجاز مقارن للتحدّي والمعارضة دون الكرامة ومن المقبل على الدنيا المعرض عن العالم الأعلى سحر\n فكانت نفس الساحر في بدء فطرتها قوية مخصوصة بهيئات مؤثرة في هذا العالم وأجرامه إلا أنها أعرضت عن مبدئها بالركون إلى العالم السفلي وانقطعت عن أصل القوى والقدر ومنبع التأثير والقهر بالميل إلى عالم الطبع\n فلا يزال يضعف ما فيها من الهيئة النورية والشعاع القدسي كما لا يزال يزداد في نفس النبيّ والوليّ بالإقبال على الحق والائتلاف بنور القدس والتأييد بالقوة الملكوتية والتوجه إلى الحضرة الإلهية ولا جرم ينكسر من النبيّ حين عارضه وينقمع بنفسه إذا قابله\n فهو أعرف الناس بالنبيّ عند عجزه وإنكاره وأقبل الخلق لدعوته وأنواره\n وأسبقهم إلى الإقرار به لكونه أقربهم في الاستعداد إليه ما لم يبطل استعداده الأول بالكلية ولم يغلب عليه دين الطبيعة السفلية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا سمعتم نُبَذاً من مقاصدهما { فَأَجْمِعُواْ كَيْدَكُمْ } أي: هيئوا جميع أسباب سحركم\n بحيث لا تحتاجون لدى الحاجة إلى شيءٍ من أدواته { ثُمَّ ٱئْتُواْ } عليها { صَفّاً } أي: صافِّين مجتمعين بمقابلتهما\n لأنه أدخلُ في المهابة { وَ } اعلموا أنه { قَدْ أَفْلَحَ ٱلْيَوْمَ } أي: فازَ ووصلَ بانواع العطاء والمواهب { مَنِ ٱسْتَعْلَىٰ } [طه: 64] وغلبَ عليهما",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { فأجْمِعُوا كيدكم }: تصريح بالمطلوب\n أي: إذا كان الأمر كما ذكر\n من كونهما ساحرين يُريدان إخراجكم من بلادكم\n فأجمعوا كيدكم\n أي: اجعلوه مُجمعًا عليه\n بحيث لا يتخلف عنه واحد منكم\n وارموه عن قوس واحدة\n\nوقرأ أبو عمرو: { فاجْمَعُوا } \n من الجمع\n أي: فاجمعوا أدوات سحركم ورتبوها كما ينبغي\n { ثم ائْتُوا صفًّا } أي: مصطفين\n أمروا بذلك لأنه أَهْيَبُ في صدور الرائين\n وأَدْخَلُ في استجلاب الرهبة من المشاهدين\n قيل: كانوا سبعين ألفًا\n مع كل واحد منهم حبل وعصا\n وأقبلوا عليه إقبالة واحدة\n وقيل: كانوا اثنين وسبعين ساحرًا اثنان من القبط\n والباقي من بني إسرائيل\n وقيل: تسعمائة ثلاثمائة من الفُرس\n وثلاثمائة من الروم\n وثلاثمائة من الإسكندرية\n وقيل: خمسة عشر ألفًا\n والله تعالى أعلم\n ولعل الموعد كان مكانًا متسعًا\n خاطبهم موسى عليه السلام بما ذكر في قطر من أقطاره\n وتنازعوا أمرهم في قطر آخر\n ثم أمروا أن يأتوا وسطه على الوجه المذكور\n ثم قالوا في آخر نجواهم: { وقد أفلح اليوم مَن استعلى } فاز بالمطلوب مَنْ غلب\n يريدون بما وعدهم فرعون من الأجر والتقريب\n أو بالرئاسة والجاه والذكر الحسن في الناس\n وقيل: كان نجواهم أن قالوا - حين سمعوا مقاله موسى عليه السلام -: ما هذا بقول ساحر\n وقيل: كان ذلك أن قالوا: إن غلبنا موسى اتبعناه\n وقيل: قالوا فيها: إن كان ساحرًا غلبناه\n وإن كان من السماء فله أمر\n فيكون إسرارهم حينئذ من فرعون\n ويحمل قولهم: { إِن هذان لساحران\n\n\n } الخ\n على أنهم اختلفوا فيما بينهم على الأقاويل المذكورة\n ثم أعرضوا عن ذلك بعد التنازع والتناظر\n واستقرت آراؤهم على المغالبة والمعارضة\n والله تعالى أعلم بما كان\n ثم طلبوا المعارضة\n فقالوا: { يا موسى إِما أن تُلقي } ما تلقيه أولاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:1",
      "similarity": 0.642125702988033
    },
    {
      "verse": "37:165",
      "similarity": 0.6399881939014891
    },
    {
      "verse": "89:22",
      "similarity": 0.6179744051972799
    },
    {
      "verse": "78:38",
      "similarity": 0.5093050623345963
    },
    {
      "verse": "24:41",
      "similarity": 0.48234475033745317
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/20:64.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/20:64.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:64.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}