{
  "chapter": "طه",
  "text": "له ما فى السموت وما فى الارض وما بينهما وما تحت الثرى",
  "translations": [
    {
      "translation": "Everything in the heavens and everything on the earth and everything in between them and everything under the ground belongs to Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and the earth and in between them, belongs to Him, as whatever lies under the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and all that is in the earth, and all that is in between, and all that is beneath the soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and the earth, all that lies between them, and lies below the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him only belongs all whatever is in the heavens and all whatever is in the earth, and all whatever is between them, and all whatever is beneath this wet soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and all that is on the earth, and all that is between them, and all that is under the soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is what is in the heavens and what is in the earth and what is between them two and what is beneath the ground.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "all that is in the heavens and the earth and all that is between them, and all that is underneath the soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him belongeth whatsoever is in the heavens and whatsoever is in the earth, and whatsoever is between them, and whatsoever is beneath the sod.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatever is in the heavens and whatever is on the earth, and whatever lies in between them, and all that lies under the ground.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is whatsoever is in the heavens and whatsoever on the earth and - whatsoever is in-between. and whatsoever is underneath the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatever is in the heavens and whatever is on the earth, and whatever is between them, and whatever is under the ground.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs what is in the heavens and on earth, and all between them, and all beneath the soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and all that is on the earth, and all that is between them, and all that is under the soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and the earth, and all that lies between them, and underneath the soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs everything in the heavens and the earth, and everything between them, and everything beneath the soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs what is in the heavens and what is on the earth and what is between them and what is under the soil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:6] to Him belongs whatever is in the heavens and whatever is in the earth and whatever is between them, of   creatures, and whatever is beneath the soil (al-tharā, is moist earth) meaning [whatever is beneath] the seven earths, since these lie beneath it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Him belongeth whatsoever is in the heavens and whatsoever is in the earth, and whatsoever is between them) of created beings and marvels, (and whatsoever is beneath the sod) that which is beneath the seven earths. This is because the seven earths are above water, and water is above the whale, the whale is above the rock and the rock is above the two horns of the bull and the bull is above the dust, and the dust is moist soil and none knows what is beneath it except Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ له ما في السموات } إلى قوله: { وما تحت الثرى } بيان لشمول قهره وملكته للكل، أي: كلها تحت ملكته وقهره وسلطنته وتأثيره لا توجد ولا تتحرك ولا تسكن ولا تتغير ولا تثبت إلا بأمره وكذلك فنيت بالكلية مقهورة بوحدانيته وفناء قهاريته لا تسمع ولا تبصر ولا تبطش ولا تمشي إلا به وبأمره",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { لَهُ } الاستيلاءُ والإحاطةُ التامةُ على { مَا } ظهر { فِي ٱلسَّمَٰوَٰتِ وَ } على { مَا } ظهر { فِي ٱلأَرْضِ } من الكائنات والفاسدات { وَ } كذا على { مَا } ظهر { بَيْنَهُمَا } من الأمور الكائنة فيها { وَ } كذا { مَا } هو كائنُ وسيكون { تَحْتَ ٱلثَّرَىٰ } [طه: 6]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "65:11",
      "similarity": 0.03931383934084194
    },
    {
      "verse": "57:12",
      "similarity": 0.03881773537285401
    },
    {
      "verse": "10:9",
      "similarity": 0.03832484420271525
    },
    {
      "verse": "5:85",
      "similarity": 0.03824391232048137
    },
    {
      "verse": "3:198",
      "similarity": 0.038206749591149274
    }
  ]
}