{
  "chapter": "طه",
  "text": "فاجمعوا۟ كيدكم ثم ائتوا۟ صفا وقد افلح اليوم من استعلى",
  "translations": [
    {
      "translation": "so decide on your scheme and then arrive together in force. He who gains the upper hand today will definitely prosper.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So prepare your strategy and come forward. He alone shall win today who is superior.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So muster all your stratagem and come forth in a row. Whoever prevails today shall triumph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bring together your devices and come forward in ranks; the winner will, certainly, have great happiness\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore strengthen your scheme, and come forth in rows; indeed whoever dominates this day has succeeded.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So devise your plot, and then assemble in line. And whoever overcomes this day will be indeed successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore settle your plan, then come standing in ranks and he will prosper indeed this day who overcomes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So gather your guile; then come in battle-line. Whoever today gains the upper hand shall surely prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So arrange your plan, and come in battle line. Whoso is uppermost this day will be indeed successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, decide upon your plan and then come forward in ranks. Whoever gains the upper hand today shall surely triumph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore devise your stratagem, and then come in a row; and prospered to-day is he who overcometh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So summon up your ingenuity, then come in ranks. Today he who has the upper hand will be felicitous!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore concert your plan, and then assemble in (serried) ranks: He wins (all along) today who gains the upper hand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So devise your plot, and then assemble in line. And whoever overcomes this day will be indeed successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gather your guile and then lineup a rank those who gain the upper hand today shall indeed prosper'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So settle your plan, and come as one front. Today, whoever gains the upper hand will succeed.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So resolve upon your plan and then come [forward] in line. And he has succeeded today who overcomes.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:64] So summon up your guile, in the way of sorcery (read fa’jma‘ū, from [the first form] jama‘a, meaning ‘he gathered’, or read fa-ajmi‘ū, from [the fourth form] ajma‘a, meaning ‘he resolved [to do something]’) and come in battle-line (saffan, a circumstantial qualifier, meaning ‘standing in rows’). For truly he who is uppermost, [he who] triumphs, this day shall be the victor!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So arrange your plan) your scheming, magic and knowledge, (and come in battle line) all together. (Whoso is uppermost) victorious (this day will be indeed successful).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَجْمِعُواْ } معناه احكموا أَمركُم واعزِموا عَليهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا سمعتم نُبَذاً من مقاصدهما { فَأَجْمِعُواْ كَيْدَكُمْ } أي: هيئوا جميع أسباب سحركم؛ بحيث لا تحتاجون لدى الحاجة إلى شيءٍ من أدواته { ثُمَّ ٱئْتُواْ } عليها { صَفّاً } أي: صافِّين مجتمعين بمقابلتهما؛ لأنه أدخلُ في المهابة { وَ } اعلموا أنه { قَدْ أَفْلَحَ ٱلْيَوْمَ } أي: فازَ ووصلَ بانواع العطاء والمواهب { مَنِ ٱسْتَعْلَىٰ } [طه: 64] وغلبَ عليهما\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { فأجْمِعُوا كيدكم }: تصريح بالمطلوب، أي: إذا كان الأمر كما ذكر، من كونهما ساحرين يُريدان إخراجكم من بلادكم، فأجمعوا كيدكم، أي: اجعلوه مُجمعًا عليه، بحيث لا يتخلف عنه واحد منكم، وارموه عن قوس واحدة\n\n\nوقرأ أبو عمرو: { فاجْمَعُوا } ، من الجمع، أي: فاجمعوا أدوات سحركم ورتبوها كما ينبغي، { ثم ائْتُوا صفًّا } أي: مصطفين، أمروا بذلك لأنه أَهْيَبُ في صدور الرائين، وأَدْخَلُ في استجلاب الرهبة من المشاهدين\n قيل: كانوا سبعين ألفًا، مع كل واحد منهم حبل وعصا، وأقبلوا عليه إقبالة واحدة، وقيل: كانوا اثنين وسبعين ساحرًا اثنان من القبط، والباقي من بني إسرائيل، وقيل: تسعمائة ثلاثمائة من الفُرس، وثلاثمائة من الروم، وثلاثمائة من الإسكندرية، وقيل: خمسة عشر ألفًا\n والله تعالى أعلم\n ولعل الموعد كان مكانًا متسعًا، خاطبهم موسى عليه السلام بما ذكر في قطر من أقطاره، وتنازعوا أمرهم في قطر آخر، ثم أمروا أن يأتوا وسطه على الوجه المذكور\n ثم قالوا في آخر نجواهم: { وقد أفلح اليوم مَن استعلى } فاز بالمطلوب مَنْ غلب، يريدون بما وعدهم فرعون من الأجر والتقريب، أو بالرئاسة والجاه والذكر الحسن في الناس\n وقيل: كان نجواهم أن قالوا - حين سمعوا مقاله موسى عليه السلام -: ما هذا بقول ساحر، وقيل: كان ذلك أن قالوا: إن غلبنا موسى اتبعناه، وقيل: قالوا فيها: إن كان ساحرًا غلبناه، وإن كان من السماء فله أمر\n فيكون إسرارهم حينئذ من فرعون، ويحمل قولهم: { إِن هذان لساحران\n\n\n } الخ، على أنهم اختلفوا فيما بينهم على الأقاويل المذكورة، ثم أعرضوا عن ذلك بعد التنازع والتناظر، واستقرت آراؤهم على المغالبة والمعارضة\n والله تعالى أعلم بما كان",
      "translations": []
    }
  ]
}