{
  "chapter": "طه",
  "text": "ومن ياته مؤمنا قد عمل الصلحت فاو۟لئك لهم الدرجت العلى",
  "translations": [
    {
      "translation": "But as for those who come to Him as muminun, having done right actions, they will have the highest ranks:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever comes before Him a believer having done good deeds, will be raised to higher stations --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who comes to Him with faith and righteous works shall be exalted to high ranks,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who comes into the presence of his Lord with faith and righteous deeds\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the one who presents himself as a believer before Him, having done good deeds – so for them are the high ranks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever comes to Him as a believer, and has done righteous good deeds, for such are the high ranks,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever comes to Him a believer (and) he has done good deeds indeed, these it is who shall have the high ranks,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso comes unto Him a believer having done deeds of righteousness, those -- for them await the most sublime degrees;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoso cometh unto Him a believer, having done good works, for such are the high stations;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who comes to Him as a believer, having done good deeds, shall be exalted to the highest ranks,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever cometh unto Him as a believer, and he hath done righteous works---then these! for them are ranks high.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever comes to Him with faith and he has done righteous deeds, for such shall be the highest ranks\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But such as come to Him as Believers who have worked righteous deeds,- for them are ranks exalted,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever comes to Him (Allah) as a believer (in the Oneness of Allah, etc.), and has done righteous good deeds, for such are the high ranks (in the Hereafter),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for whosoever comes before Him as a believer and having done good works there awaits the most highest degree;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever comes to Him a believer, having worked righteousness—these will have the highest ranks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever comes to Him as a believer having done righteous deeds - for those will be the highest degrees [in position]:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:75] And whoever comes to Him a believer, having performed righteous deeds — the obligatory and supererogatory deeds, for such shall be the highest degrees (al-‘ulā, the plural of ‘ulyā, the feminine form of a‘lā) —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But whoso cometh unto Him) on the Day of Judgement (a believer) sincere in his faith, (having done good works) secretly between himself and his Lord, (for such are the high stations) in the Gardens;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوثانياً إنه { وَمَن يَأْتِهِ مُؤْمِناً } موقناً بذاته وصفاته وأفعاله، ومع ذلك { قَدْ عَمِلَ ٱلصَّالِحَاتِ } بمقتضى أوامره { فَأُوْلَـٰئِكَ } المؤمنون الصالحون { لَهُمُ } لا لغيرهم من الصالحين { ٱلدَّرَجَاتُ ٱلْعُلَىٰ } [طه: 75] القريبة إلى الدرجة العليا التي انتهت إليها جميع الدرجات، وهي { جَنَّاتُ عَدْنٍ تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أي: أنهار المعارف والحقائق لأولي البصائر والأبصار الناظرين بعيون الاعتبار المستغرقين بمطالعة جمال الله بلا مزاحمة الأغيار { خَالِدِينَ فِيهَا } بلا ملاحظة زمانٍ ومقدارٍ { وَذٰلِكَ جَزَآءُ مَن تَزَكَّىٰ } [طه: 76] من ذمائم الأخلاق ورذائل الأطوار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومَن يأتِهِ مؤمنًا } به تعالى، وما جاء من عنده من المعجزات، التي من جملتها ما شهدناه، حال كونه { قد عمل الصالحات } أي: الأعمال الصالحات، وهي كل ما استقام شرعًا وخلص عقدًا، { فأولئك } أي: من يأت مؤمنًا\n\n\n الخ\n وجمع الإشارة باعتبار معنى \" مَن \" ، كما أن الإفراد في الفعلين السابقين باعتبار لفظها، وما فيه من معنى البُعد للإشعار بعلو درجتهم وبُعد منزلتهم، أي: فأولئك المؤمنون العاملون للصالحات، { لهم } بسبب إيمانهم وأعمالهم الصالحات { الدرجات العُلى } أي: المنازل الرفيعة، وليس فيه ما يدل على عدم اعتبار الإيمان المجرد عن العمل في استتباع الثواب لأن ما نيط بالإيمان المقرون بالأعمال الصالحة هو الفوز بالدرجات العلى، لا بالثواب مطلقًا",
      "translations": []
    }
  ]
}