{
  "chapter": "طه",
  "text": "فاتبعهم فرعون بجنوده فغشيهم من اليم ما غشيهم",
  "translations": [
    {
      "translation": "Pharaoh pursued them with his troops and the sea overwhelmed them utterly.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Pharaoh followed them with his army, but the sea overpowered and engulfed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh pursued them with his hosts, but they were fully overwhelmed by the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh and his army chased Moses and his people but were drowned by the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Firaun went after them with his army – therefore the sea enveloped them, the way it did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Fir`awn pursued them with his hosts, but the sea [Al-Yamm] completely overwhelmed them and covered them up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Firon followed them with his armies, so there came upon them of the sea that which came upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh followed them with his hosts, but they were overwhelmed by the sea;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Pharaoh followed them with his hosts and there covered them that which did cover them of the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh pursued them with his hosts, but they were submerged by the sea, which was destined to overwhelm them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Fir'awn followed them with his hosts; and there came upon them of the sea that which came upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Pharaoh pursued them with his troops, whereat they were engulfed by what engulfed them of the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Pharaoh pursued them with his forces, but the waters completely overwhelmed them and covered them up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Fir'aun (Pharaoh) pursued them with his hosts, but the sea-water completely overwhelmed them and covered them up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh pursued them with his legions so they were overwhelmed from the sea with that which drowned them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh pursued them with his troops, but the sea overwhelmed them, and completely engulfed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Pharaoh pursued them with his soldiers, and there covered them from the sea that which covered them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:78] Then Pharaoh pursued them with his hosts, with him [Pharaoh] alongside them, and there engulfed them what did engulf them of the sea, and it drowned them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then Pharaoh followed with his hosts and there covered them that which did cover them of the sea) they drowned in the sea.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَتْبَعَهُمْ فِرْعَوْنُ بِجُنُودِهِ } بلا تراخٍ فدخلوا اغتراراً بيبسه { فَغَشِيَهُمْ } أي: غطَّاهم وسترهم { مِّنَ ٱلْيَمِّ } أي: البحر { مَا غَشِيَهُمْ } [طه: 78] أي: غشاوةً عظيمة بحيث يكون البحر كما كان، فهدى موسى قومه فأنجيناهم امتناناً عليه وعليهم { وَأَضَلَّ فِرْعَوْنُ قَوْمَهُ } باتباعهم بني إسرائيل على الفور { وَمَا هَدَىٰ } [طه: 79] وأرشد لهم طريق المخلص، فأغرقناهم متبوعاً وتابعاً زاجراً عليه وعليهم\n\n\n\n\nثم بعد إنجائنا بني إسرائيل من عدوهم وإهلاك عدوهم بالمرة، وإيراثهم أرضهم وديارهم وأموالهم، نبهنا عليهم التوجه والرجوع إلينا بتعديد نعمنا التي أنعمناهم؛ ليواظبوا على شكرها أداءً لحقٍّ شيء منها، حتى يكونوا من الشاكرين المزيدين لنعمنا إياهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَأَتْبَعَهُمْ فرعونُ بجنوده } أي: تبعهم ومعه جنوده حتى لحقهم، يقال: اتبعتهم، أي: تبعتهم، إذا كانوا سبقوك ولحقتهم، ويؤيده قراءة: { فاتَّبَعَهُمْ } بالشد\n وقيل: الباء زائدة، والمعنى: فأتبعهم فرعون جنودَه، أي: ساقهم خلفهم، وأيًا ما كان، فالفاء فصيحة مُعْربة عَن مضمر قد طوى ذكره، ثقة بظهوره، وإيذانًا بكمال مسارعة موسى إلى الامتثال، أي: فَفَعل ما أُمر به من الإسراء بهم، وضرب الطريق في البحر وسلكوه، فأتبعهم بجنوده برّا وبحرًا\n رُوِيَ أن موسى عليه السلام خرج بهم أول الليل، وكانوا ستمائة وسبعين ألفًا، فأخبر فرعون بذلك، فأتبعهم بعساكره، وكانت مقدمته سبعمائة ألف، فقص أثرهم فلحقهم، بحيث تراءى الجمعان، فلما أبصروا رهجَ الخيل، قالوا:\n\n[الشُّعَرَاء: 61، 62]\n فلما قربوا، قالوا: يا موسى أين نمضي، البحر أمامنا، وخيل فرعون خلفنا، فعند ذلك ضرب موسى عصاه البحر فانفلق على ثنتي عشرة فرقة،\n\n[الشُّعَرَاء: 63] أي: كالجبل العظيم من الماء، وكانوا يمرون به، وكلهم بنو أعمام، لا يرى بعضُهم بعضًا، فقالوا: قد غرق إخواننا، فأوحى الله إلى أطواد الماء: أن اشتبكي، وصارت شبابك، يرى بعضهم بعضًا، ويسمع بعضهم كلامَ بعض، فلما أتى فرعونُ الساحلَ، وجد البحر منفلقًا، فقال: سحر موسى البحر، فقالوا: إن كنت ربًا فادخل كما دخل، فجاء جبريلُ على رَمَكةٍ ودَيِقٍ، أي: تحب الفحل، وكان فرعون على حصان، فاقتحم جبريل بالرمكة الماء، فلم يتمالك حصان فرعون، فاقتحم البحر على إثره، ودخل القبط كلهم، فلما لَجَّجُوا، أوحى الله تعالى إلى البحر أن أغرقهم، فعلاهم البحر وأغرقهم\n\n\nفَعبَر موسى عليه السلام بمن معه من الأسباط سالمين، وأما فرعون وجنوده { فغَشِيَهم من اليمِّ ما غشيهم } أي: علاهم منه وغمرهم من الأمر الهائل، الذي لا يُقادر قدره ولا يبلغ كنهه\n قال القشيري: فغرقوا بجملتهم، وآمن فرعونُ لما ظهر له البأس، فلم ينفعه إقراره، وكان ينفعه لو لم يكن إصرارُه، وقد أدركته الشقاوةُ التي سَبَقَتْ له من التقدير\n هـ\n وقال الكواشي: { وغشيهم } من الغضب والغرق، وغير ذلك، ما لا يعلم حقيقته إلا الله تعالى\n هـ\n فإبهام الصلة للتهويل والتفخيم، وقيل: { غشيهم من اليم } ما سمعتَ قصته في غير هذه السورة، وليس بشيء فإن مدار الإبهام على التهويل والتفخيم، بحيث يخرج عن حدود الفهم والوصف، لا سماع قصته فقط",
      "translations": []
    }
  ]
}