{
  "chapter": "طه",
  "text": "وان تجهر بالقول فانه يعلم السر واخفى",
  "translations": [
    {
      "translation": "Whether you say a thing aloud or inaudibly, He has knowledge of the secret and the hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you speak out aloud (or in a low voice), He knows what is said secretly, and even that which is most hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether or not you express (your thoughts) in words, God certainly knows all unspoken thoughts and all that is even more difficult to find.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you speak aloud – so He surely knows the secret and that which is more concealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you speak aloud, then verily, He knows the secret and that which is yet more hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you utter the saying aloud, then surely He knows the secret, and what is yet more hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be thou loud in thy speech, yet surely He knows the secret and that yet more hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thou speakest aloud, then lo! He knoweth the secret (thought) and (that which is yet) more hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you speak aloud [or in a low voice], He hears all, for He knows your secrets and what is even more hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thou speakest the word aloud, then verily He knoweth the secret and the most hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you speak loudly [or in secret tones,] He indeed knows the secret and what is still more hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou pronounce the word aloud, (it is no matter): for verily He knoweth what is secret and what is yet more hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you (O Muhammad SAW) speak (the invocation) aloud, then verily, He knows the secret and that which is yet more hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you speak loudly; He has indeed knowledge of the secret and the hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you speak aloud—He knows the secret, and the most hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you speak aloud - then indeed, He knows the secret and what is [even] more hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:7] And should you be loud in your speech, in remembrance [of God] or supplication, then God has no need for this to be [spoken] loud, then indeed He knows the secret and [that which is] yet more hidden, than that [secret], namely, that which the soul whispers [to itself] and that which occurs to the mind but which you do not speak of [to anyone], so do not strain yourself to be loud [in your speech].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if thou speakest aloud) and act openly, (then Lo! He knoweth the secret (thought)) and secret action (and (that which is yet) more hidden) than that which is a secret, whether it has ensued from you or has not yet ensued from you but will in the future. Allah knows all that. 336\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِنَّهُ يَعْلَمُ ٱلسِّرَّ وَأَخْفَى } قالَ الإِمامُ زيد بن علي عليهما السلام السِّرُّ: ما أَحْرَزْتَهُ فِي نفسِكَ\n وقالَ: ما أَسررتَ إِلى غَيرِكَ\n وأَخفى: ما لم تُحدِّثْ بِهِ نَفسَكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وإن تجهر بالقول فإنه يعلم السرّ وأخفى } بيان لكمال لطفه أي: علمه نافذ في الكل يعلم ظواهرها وبواطنها والسر وسر السر، فكذلك إن تجهر وإن تخفت فيعلمه بجهر وبخفت",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nهذا باعتبار ظهوره واستيلائه على الآفاق الخارجة عنك { وَ } أما ظهوره واستيلاؤه على نفسك، فإنه يستولي على ذاتك وأفعالك وأقوالك؛ بحيث { إِن تَجْهَرْ بِٱلْقَوْلِ فَإِنَّهُ يَعْلَمُ } القولَ بالجهر منك، الذي تعلمه أنت أيضاً وغيرك، بل { ٱلسِّرَّ } الذي لا يعلمه غيرك { وَأَخْفَى } [طه: 7] من السرِّ الذي لا تعلمه أنت أيضاً من مقتضيات استعداداتك قبل الخطور ببالك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إن تجهر }: شرط، والجواب محذوف دل عليه { فإنه\n\n\n } الخ، أي: فالله غني عن جهرك، فإنه\n\n\n\n\n الخ\n  يقول الحقّ جلّ جلاله: تسلية لرسوله صلى الله عليه وسلم، أو ترويحًا له من التعب: يا محمد { ما أنزلنا عليك القرآن لتشقى } أي: لتتعب نفسك بالمجاهدة في العبادة\n رُوِيَ أنه صلى الله عليه وسلم كانَ يَقُومُ باللّيل حَتَّى تَوَرّمَتْ قَدَمَاهُ، فقَالَ لهُ جِبْرِيلُ عليه السلام: \" أبْق عَلى نَفْسِكَ، فإِنَّ لَها عَلَيْكَ حَقًا \"\n أي: ما أنزلناه عليك لتتعب بنهك نفسك وحملها على الرياضَات الشاقة، و الشدائد الفادحة، وما بعثتَ إلا بالحنيفية السمحة\n أو: ما أنزلناه لتتعب نفسك في تبليغه بمكابدة الشدائد في مقاومة العتاة ومحاورة الطغاة، وفرط التأسف على كفرهم والتحسر على إيمانهم، كقوله:\n\n[الشُّعَرَاء: 3]، بل للتبليغ، وقد فعلت\n وإطلاق الشقاء في هذا المعنى شائع، ومنه قولهم: أشقى من رائض مُهر، وقيل: إن أبا جهل والنضر بن الحارث قالا لرسول الله صلى الله عليه وسلم: إنك شقي، حيث تركت دين آباءك، وما نزل عليك هذا القرآن إلا لتشقى، فردَّ اللهُ ذلك عليهم\n والأول أظهر، والعموم أحسن، فإنه نفى عنه جميع الشقاء في الدنيا والآخرة\n { إِلا تذكرةً لمن يخشى } أي: ما أنزلناه لتتعب، لكن أنزلناه تذكرة وموعظة لمن يخشى الله - عزّ وجلّ -، ليتأثر بالإنذار، لرقة قلبه ولين عريكته، أو لمن عَلِمَ الله أنه يخشى بالتخويف، وتخصيصها بهم مع عموم التذكرة والتبليغ لأنهم المنتفعون بها\n { تنزيلاً } أي: أنزل تنزيلاً، أو حالَ كَوْنِ القرآن تنزيلاً، أي: منزلاً { ممّن خلق الأرض والسماوات العلى } ، ونسبة التنزيل إلى الموصول بعد نسبته إلى نون العظمة بقوله: { ما أنزلنا } لبيان فخامته تعالى بحسب الأفعال والصفات، إثر بيانها بحسب الذات بطريق الإبهام، ثم التفسير لزيادة تحقيق وتقرير\n وتخصيص خلقهما بالذكر لتضادهما\n وتقديم الأرض لكونه أقرب إلى الحس، ووصف السماوات بالعُلى، وهو جمع \" عليا \" لتأكيد الفخامة مع ما فيه من مراعاة الفواصل",
      "translations": []
    }
  ]
}