{
  "chapter": "طه",
  "text": "انا ءامنا بربنا ليغفر لنا خطينا وما اكرهتنا عليه من السحر والله خير وابقى",
  "translations": [
    {
      "translation": "We have had iman in our Lord so that He may forgive us for our mistakes and for the magic which you forced us to perform. Allah is better and longer lasting.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have certainly come to believe in our Lord that He may forgive our trespasses and the magic you have forced us to perform, for God is nobler and abiding.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We believe in our Lord that He may forgive us our sins and also forgive us the practice of magic to which you had compelled us. Allah is the Best and He alone will abide.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have faith in our Lord so that He will forgive our sins and our magical performances that you forced us to show. God is better than all things and His rewards last longer.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Indeed we have accepted faith in our Lord, so that He may forgive us our sins and the magic which you forced us to perform; and Allah is Better, and the Most Lasting.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, we have believed in our Lord, that He may forgive us our faults, and the magic to which you did compel us. And Allah is better as regards reward in comparison to your reward, and more lasting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely we believe in our Lord that He may forgive us our sins and the magic to which you compelled us; and Allah is better and more abiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We believe in our Lord, that He may pardon us our offences, and the sorcery thou hast constrained us to practise; God is better, and more abiding.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! we believe in our Lord, that He may forgive us our sins and the magic unto which thou didst force us. Allah is better and more lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "we have believed in our Lord so that He may forgive us our sins and forgive us the sorcery that you have forced us to practice. God is the best and the most abiding.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily we! we have believed in our Lord, that he may forgive us our faults, and that to which thou hast constrained us in the way of magic; and Allah is Best and Most Lasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed believed in our Lord that He may forgive us our offences and the magic you compelled us to perform. Allah is better and more lasting.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For us, we have believed in our Lord: may He forgive us our faults, and the magic to which thou didst compel us: for Allah is Best and Most Abiding.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! We have believed in our Lord, that He may forgive us our faults, and the magic to which you did compel us. And Allah is better as regards reward in comparison to your [Fir'aun's (Pharaoh)] reward, and more lasting (as regards punishment in comparison to your punishment).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We believe in our Lord so that He forgives us our sins and the sorcery you have forced us to practice. Allah is Better, and Everlasting'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have believed in our Lord, so that He may forgive us our sins, and the magic you have compelled us to practice. God is Better, and more Lasting.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, we have believed in our Lord that He may forgive us our sins and what you compelled us [to do] of magic. And Allah is better and more enduring.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:73] Indeed We profess belief in our Lord, that He may forgive us our sins, in the way of ascribing partners [to God] and otherwise, and the sorcery to which you forced us, to learn and to perform in order to oppose Moses. And God is better, than you in rewarding if he is obeyed, and more enduring’, than you in chastisement if he is disobeyed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! we believe in our Lord, that He may forgive us our sins) our idolatry (and the magic unto which thou didst force us) the magic which you coerced us to learn. (Allah is better and more lasting) that which is with Allah of reward and favour is better and more lasting that the wealth you give us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ليغفر لنا خطايانا } أي: يستر بنوره الهيئات المظلمة والصفات الرديئة التي عرضت لنفوسنا بسبب الميل إلى اللذات الطبيعية ومحبة الزخارف الدنيوية { وما أكرهتنا عليه من السحر } أي: معارضة موسى لأنهم لما عرفوه بنور استعدادهم وعلموا كونه على الحق\n فاستعفوا عن معارضته فأكرهم اللعين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } يغفر لنا أيضًا { ما أكرهتنا عليه من السحر } الذي عملناه في معارضة موسى عليه السلام\n بإكراهك وحشرك لنا من المدائن القاصية\n وخصوه بالذكر\n مع اندراجه في خطاياهم إظهارًا لغاية نفرتهم عنه\n ورغبة في مغفرته\n وفي ذكره الإكراه: نوع اعتذار لاستجلاب المغفرة\n وقيل: أرادوا الإكراه على تعلم السحر\n لما رُوي أن رؤساءهم كانوا اثنين وسبعين اثنان منهم من القبط\n والباقي من بني إسرائيل\n وكان فرعون أكرههم على تعلم السحر\n وقيل: إنه أكرههم على المعارضة\n حيث رُوي أنهم قالوا لفرعون: أرنا موسى نائمًا\n ففعل\n فوجدوه تحرسه عصاه\n فقالوا: ما هذا بسحر\n فإن الساحر إذا نام بطل سحره\n فأبى إلا أن يعارضوه\n لكن يأباه تصديهم للمعارضة بالرغبة والنشاط\n كما يُعرب عنه قولهم:\n[الأعرَاف: 113] الخ\n وقولهم:\n[الشُّعَرَاء: 44]\n إلا أن يُقال: لما رأوا جدَّهُ طمعوا وطلبوا الأجر\n { والله خيرٌ وأبقى } أي: وثواب الله خير من إيثار الدنيا الفانية\n وأبقى في الدار الباقية\n أو: والله في ذاته خير\n وجزاؤه أبقى\n نعيمًا كان أو عذابًا\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "87:17",
      "similarity": 0.49211330766625005
    },
    {
      "verse": "11:86",
      "similarity": 0.4782443717457759
    },
    {
      "verse": "69:37",
      "similarity": 0.45060986990422247
    },
    {
      "verse": "12:97",
      "similarity": 0.43398971618046206
    },
    {
      "verse": "69:8",
      "similarity": 0.4321220395722025
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/20:73.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/20:73.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:73.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}