{
  "chapter": "طه",
  "text": "ولقد اوحينا الى موسى ان اسر بعبادى فاضرب لهم طريقا فى البحر يبسا لا تخف دركا ولا تخشى",
  "translations": [
    {
      "translation": "We revealed to Musa, 'Travel with My slaves by night. Strike a dry path for them through the sea. Have no fear of being overtaken and do not be afraid.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We commanded Moses: \"Journey by night with Our creatures, and strike a dry path for them through the sea. Do not fear being overtaken, nor have dread of any thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most certainly We revealed to Moses: \"Proceed with My servants in the night and strike for them a dry path in the sea. Have no fear of being overtaken, nor be afraid of treading through the sea.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent revelations to Moses telling him, \"Travel with My servants during the night and strike a dry road across the sea (for them). Have no fear of being overtaken (by the Pharaoh) nor of anything else\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We divinely inspired Moosa that, “Journey with My bondmen in a part of the night and strike a dry path in the sea for them, you shall have no fear of Firaun getting to you, nor any danger.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We revealed to Musa: \"Travel by night with My servants and strike a dry path for them in the sea, fearing neither to be overtaken nor being afraid.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We revealed to Musa, saying: Travel by night with My servants, then make for them a dry path in the sea, not fearing to be overtaken, nor being afraid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also We revealed unto Moses, 'Go with My servants by night; strike for them a dry path in the sea, fearing not overtaking, neither afraid.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We inspired Moses, saying: Take away My slaves by night and strike for them a dry path in the sea, fearing not to be overtaken, neither being afraid (of the sea).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent a revelation to Moses saying, \"Take away My servants by night and strike for them a dry path through the sea. Have no fear of being overtaken and do not be afraid.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We revealed unto Musa, saying: depart in night with my bondmen, and make for them in the sea a parth dry: thou Shalt fear neither overtaking, nor shalt thou be afraid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We revealed to Moses, [saying], ‘Set out with My servants at night, and strike out for them a dry path through the sea. Do not be afraid of being overtaken, and have no fear [of getting drowned].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent an inspiration to Moses: \"Travel by night with My servants, and strike a dry path for them through the sea, without fear of being overtaken (by Pharaoh) and without (any other) fear.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We inspired Musa (Moses) (saying): \"Travel by night with Ibadi (My slaves) and strike a dry path for them in the sea, fearing neither to be overtaken [by Fir'aun (Pharaoh)] nor being afraid (of drowning in the sea).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Moses we also revealed: 'Set forth with My worshipers by night and strike for them a dry path in the sea. Do not fear that you will be overtaken, neither be afraid'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We inspired Moses: “Travel by night with My servants, and strike for them a dry path across the sea, not fearing being overtaken, nor worrying.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had inspired to Moses, \"Travel by night with My servants and strike for them a dry path through the sea; you will not fear being overtaken [by Pharaoh] nor be afraid [of drowning].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:77] And verily We revealed to Moses, [saying], ‘Lead My servants on a journey by night (read as an asri, ‘that: lead on a journey by night’, from [fourth form] asrā, ‘he travelled by night’; or read as an’isri, from [first form] sarā, ‘he travelled by night’, both being alternative forms), in other words, travel with them by night from the land of Egypt, and strike for them, make for them, by striking your staff, a dry path in the sea. So he fulfilled what he had been commanded, and God made the ground dry so that they were able to pass through it. Do not fear to be overtaken, that is, [fearing] that Pharaoh might catch you, and do not be afraid’, of drowning.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We inspired Moses, saying: Take away) lead (My slaves by night) at the beginning of the night (and strike for them) show them (a dry path in the sea, fearing not to be overtaken) by Pharaoh, (neither being afraid (of the sea)) neither being afraid of drowning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱضْرِبْ لَهُمْ طَرِيقاً فِي ٱلْبَحْرِ يَبَساً } يعني يابساً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allaah {faḍrib lahum ṭarīqan fi'l-bahri yabasāan}, which means \"make them a lesson in the sea.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يكون للتزكية هذه الآثار! { وَلَقَدْ أَوْحَيْنَآ } من عندنا { إِلَىٰ مُوسَىٰ } المختار بعدما هذَّبنا ظاهره عن ذمائم الأخلاق ورذائل الأطوار\n وحلَّينا باطنه بأنواع المكاشفات والأسرار\n إنجاءً له ولقومه من يد الكفار حين عزم عليه فرعون الغدَّار { أَنْ أَسْرِ بِعِبَادِي } أي: سِر ليلاً معهم على صورة الفِرَار\n فمتى أُخبروا بذلك\n اتبعوا أثرك بمقتضى الاغترار\n ومتى أردفك العدو وقربوا أن يدركوا\n ومنعك البحر من العبور\n قلنا لك: { فَٱضْرِبْ لَهُمْ } بعصاك المعين في الأمور البحرَ\n ليكون لك معجزةً وظهر لهم { طَرِيقاً فِي ٱلْبَحْرِ يَبَساً } جافاً لا وحلَ فيها\n لئلا يخافوا من الغرق ومن ورائك العدو\n وأنت أيضاً { لاَّ تَخَافُ دَرَكاً } أي: أن يدركك فرعون { وَلاَ تَخْشَىٰ } [طه: 77] أن يغرقك البحر\n فضربَ البحرَ بأمر به بعدما سار بإذنه\n فسلك فيه مسلك قومه خلفه\n فعبروا\n فصول فرعون وملؤه الأرض\n فرأوا عبورهم من الطريق اليابس\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولقد أوحينا إِلى موسى أنْ أسرِ بعبادي } بعد ما لبث يدعو فرعون إلى الله تعالى ويُريه الآيات المفصلات\n بعد غلبة السحرة\n نحوًا من عشرين سنة\n كما فصّل ذلك في الأعراف\n فلما أيس من إيمانهم أوحى الله بالخروج عنهم\n أي: والله لقد أوحينا إلى موسى أن أسر\n أو بأن أسر بعبادي الذين أرسلتك لإنقاذهم من يد فرعون\n أي: سر بهم من مصر ليلاً إلى بحر القلزم\n والتصدير بالقسم لإبراز كمال العناية بمضمونها\n والتعبير عنهم بعبادي لإظهار الرحمة والاعتناء بهم\n والتنبيه على غاية قبح صنيع فرعون\n حيث استعبدهم\n وهم عباده عزّ وجلّ\n وفعل بهم من فنون العذاب ما فعل\n { فاضربْ لهم } أي: اجعل لهم\n أو اتخذ لهم { طريقًا في البحر يبسًا } أي: يابسًا لا ماء فيه\n { لا تخاف دَرَكًا } أي: حال كونك آمنًا من أن يُدرككم العدو\n { ولا تخشى } الغرق\n وقرأ حمزة: \" لا تخف \" بالجزم\n جوابًا للأمر\n فيكون { ولا تخشى }: إما استئناف\n أي: وأنت لا تخشى\n أو عطف عليه\n والألف للإطلاق\n أو يقدر الجزم\n كقوله:\n\n\nالخ\n  وتقديم نفي خوف الدرك\n للمسارعة إلى إزاحة ما كانوا عليه من الخوف\n حيث قالوا:\n[الشُّعَرَاء: 61]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:52",
      "similarity": 0.3720266885335007
    },
    {
      "verse": "44:23",
      "similarity": 0.31779091514140506
    },
    {
      "verse": "89:4",
      "similarity": 0.3101528776328842
    },
    {
      "verse": "19:24",
      "similarity": 0.2998285167599358
    },
    {
      "verse": "6:59",
      "similarity": 0.2864411030464227
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/20:77.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/20:77.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/20:77.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}