{
  "chapter": "طه",
  "text": "انه من يات ربه مجرما فان له جهنم لا يموت فيها ولا يحيى",
  "translations": [
    {
      "translation": "As for those who come to their Lord as evildoers, they will have Hell where they will neither die nor stay alive.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely for him who comes before his Lord a sinner shall be Hell, where he will neither die nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth is that Hell awaits him who comes to his Lord laden with sin; he shall neither die in it nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dwelling place of one who comes into the presence of his Lord as a criminal will be hell wherein he will never die nor enjoy his life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the one who comes guilty to his Lord – so undoubtedly for him is hell; neither dying nor living in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, whoever comes to his Lord as a criminal, then surely, for him is Hell, wherein he will neither die nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever comes to his Lord (being) guilty, for him is surely hell; he shall not die therein, nor shall he live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever comes unto his Lord a sinner, for him awaits Gehenna wherein he shall neither die nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! whoso cometh guilty unto his Lord, verily for him is hell. There he will neither die nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, he who comes to his Lord a sinner shall be consigned to Hell; he shall neither die therein nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily whosoever cometh unto his lord as a Culprit, for him is Hell wherein he will neither die nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever comes to his Lord laden with guilt, for him shall be hell, where he will neither live nor die.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily he who comes to his Lord as a sinner (at Judgment),- for him is Hell: therein shall he neither die nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! Whoever comes to his Lord as a Mujrim (criminal, polytheist, disbeliever in the Oneness of Allah and His Messengers, sinner, etc.), then surely, for him is Hell, therein he will neither die nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gehenna (Hell) awaits whosoever comes before his Lord as a sinner, there he shall neither die nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever comes to his Lord guilty, for him is Hell, where he neither dies nor lives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, whoever comes to his Lord as a criminal - indeed, for him is Hell; he will neither die therein nor live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:74] God, exalted be He, says: Truly whoever comes to his Lord a criminal, a disbeliever, like Pharaoh, for him there shall be Hell wherein he shall neither die, and thus find rest, nor live, a life of any benefit to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! whoso cometh) on the Day of Judgement (guilty) an idolater (unto his Lord, verily for him is hell. There he will neither die) such that he finds rest (nor live) a beneficial life.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوقد تحقق عندنا أيضاً { إِنَّهُ مَن يَأْتِ رَبَّهُ } القادر على الانتقام والإنعام { مُجْرِماً } مشركاً طاغياً { فَإِنَّ } أي: حقَّ وثبتَ { لَهُ جَهَنَّمَ } التي هي دار البعد والخذلان أبداً { لاَ يَمُوتُ فِيهَا } حتى يستريح { وَلاَ يَحْيَىٰ } [طه: 74] أيضاً حياةً يستفيد بها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nثم عللوا خيريته وبقاءه فقالوا: { إِنه مَن يأت ربه مجرمًا } بأن يموت على الكفر والمعاصي، { فإِنّ له جهنمَ لا يموتُ فيها } فيستريح وينتهي عذابه، وهذا تحقيق لقوله: { وأبقى } ، { ولا يحيا } حياة ينتفع بها، وضمير { إنه }: للشأن، وفيه تنبيه على فخامة مضمون الجملة لأن مناط وضع الضمير موضعه ادعاء شهرته المغنية عن ذكره، مع ما فيه من زيادة التقرير، فإن الضمير لا يفهم منه أول الأمر إلا شأنٌ مبهَمٌ له خطر، فيبقى الذهن مترقبًا لما يعقبه، فيتمكن، عند وروده، فَضل تمكن، كأنه قيل الشأن الخطير هذا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:43",
      "similarity": 0.6666138905577532
    },
    {
      "verse": "43:74",
      "similarity": 0.6402944293462769
    },
    {
      "verse": "74:41",
      "similarity": 0.46583527198383656
    },
    {
      "verse": "15:58",
      "similarity": 0.452918839570708
    },
    {
      "verse": "51:32",
      "similarity": 0.452918839570708
    }
  ]
}