{
  "chapter": "طه",
  "text": "يبنى اسرءيل قد انجينكم من عدوكم ووعدنكم جانب الطور الايمن ونزلنا عليكم المن والسلوى",
  "translations": [
    {
      "translation": "Tribe of Israel! We rescued you from your enemy and made an appointment with you on the right hand side of the Mount and sent down manna and quails for you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Israel, We delivered you from your enemy, and made a covenant with you on the right side of the Mount, and sent down for you manna and quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel! We saved you from your enemy and made a covenant with you on the right side of the Mount and sent down on you manna and quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel, We saved you from your enemy and promised to settle you on the right side of the peaceful Mount Tur (Sinai)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Descendants of Israel, indeed We rescued you from your enemy, and We made a covenant with you on the right side of Mount Tur, and sent down Manna and Salwa upon you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We delivered you from your enemy, and We made a covenant with you on the right side of the Mount, and We sent down to you manna and quail,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Israel! indeed We delivered you from your enemy, and We made a covenant with you on the blessed side of the mountain, and We sent to you the manna and the quails.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel, We delivered you from your enemy; and We made covenant with you upon the right side of the Mount, and sent down on you manna and quails:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We delivered you from your enemy, and we made a covenant with you on the holy mountain's side, and sent down on you the manna and the quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel! We delivered you from your enemies and We made a covenant with you on the right side of the Mount. We sent down manna and quails for you,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel; We delivered you from your enemy, and treated with you on the right side of the mount and sent down upon you the manna and the quails.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We delivered you from your enemy, and We appointed with you a tryst on the right side of the Mount and We sent down to you manna and quails:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye Children of Israel! We delivered you from your enemy, and We made a Covenant with you on the right side of Mount (Sinai), and We sent down to you Manna and quails:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We delivered you from your enemy, and We made a covenant with you on the right side of the Mount, and We sent down to you Al-Manna and quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel! We saved you from your enemies and made a covenant with you on the right side of the Mountain. We sent down manna and quails.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We have delivered you from your enemy, and promised you by the right side of the Mount, and sent down to you manna and quails.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel, We delivered you from your enemy, and We made an appointment with you at the right side of the mount, and We sent down to you manna and quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:80] O Children of Israel, truly We delivered you from your enemy, Pharaoh, by drowning him, and We made a tryst with you on the right side of the [Tūr] Mount, in order to give Moses the Torah, that it may be implemented it [by you], and We sent down to you manna and quails, namely, turunjabīn [citrus fruit] and the quail. The ones being addressed in the vocative [by ‘O Children of Israel’] are those Jews living at the time of the Prophet (s), and they are addressed with reference to the graces which God bestowed on their forefathers at the time of the prophet Moses as a preface to what God [now] says to them:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا بَنِي إِسْرَائِيلَ قَدْ أَنْجَيْنَاكُمْ مِنْ عَدُوِّكُمْ وَوَاعَدْنَاكُمْ جَانِبَ الطُّورِ الْأَيْمَنَ وَنَزَّلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَى (80) هذه الجمل معترضة في أثناء القصة مثل ما تقدم آنفاً في قوله تعالى : { إنه من يأت ربه مجرماً } الآية . وهذا خطاب لليهود الذين في زمن النبي صلى الله عليه وسلم تذكيراً لهم بنعم أخرى .وقُدّمت عليها النعمة العظيمة ، وهي خلاصهم من استعباد الكفرة .وقرأ الجمهور { قد أنجيناكم وواعدناكم بنون العظمة . وقرأهما حمزة ، والكسائي ، وخلف قد أنجيتكم ووعدتكم بتاء المتكلّم .وذكّرهم بنعمة نزول الشريعة وهو ما أشار إليه قوله وواعدناكم جَانِبَ الطُّورِ الأيْمَنَ }. والمواعدة : اتّعاد من جانبين ، أي أمرنا موسى بالحضور للمناجاة فذلك وعد من جانب الله بالمناجاة ، وامتثالُ موسى لذلك وعدٌ من جانبه ، فتم معنى المواعدة ، كما قال تعالى في سورة البقرة ( 52 ) : { وإذ واعدنا موسى أربعين ليلة }ويظهر أنّ الآية تشير إلى ما جاء في الإصحاح 19 من سفر الخروج : في الشهر الثالث بعد خروج بني إسرائيل من أرض مصر جاءوا إلى برّية سيناء هنالك نزل إسرائيل مقابل الجبل . وأما موسى فصعد إلى الله فناداه الربّ من الجبل قائلاً : هكذا نقول لبيت يعقوب أنتم رأيتم ما صنعت بالمصريين وأنا حملتكم على أجنحة النّسور ، إن سمعتم لصوتي وحفظتم عهدي تكونون لي خاصة . . . إلخ .وذكر الطور تقدم في سورة البقرة .وجانب الطور : سفحه . ووصفه بالأيمن باعتبار جهة الشخص المستقبل مشرقَ الشمس ، وإلاّ فليس للجبل يمين وشمال معيّنان ، وإنما تعرَّف بمعرفة أصل الجهات وهو مطلع الشمس ، فهو الجانب القبلي باصطلاحنا . وجُعل محلّ المواعدة الجانب القبلي وليس هو من الجانب الغربي الذي في سورة القصص ( 30 ) : { فلما أتاها نودي من شاطىء الواد الأيمن في البقعة المباركة من الشجرة وقال فيها وما كنت بجانب الغربي إذ قضينا إلى موسى الأمر } \\[ القصص : 44 \\] فهو جانب غربي ، أي من جهة مغرب الشمس من الجبل ، وهو الذي آنس موسى منه ناراً .وانتصب { جَانِبَ الطُّورِ } على الظرفية المكانية لأنّه لاتساعه بمنزلة المكان المبهم .ومفعول المواعدة محذوف ، تقديره : المناجاة .وتعدية { واعدناكم } إلى ضمير جماعة بني إسرائيل وإن كانت مواعدة لموسى ومن معه الذين اختارهم من قومه باعتبار أنّ المقصد من المواعدة وحي أصول الشريعة التي تصير صلاحاً للأمّة فكانت المواعدة مع أولئك كالمواعدة مع جميع الأمّة .وقرأ الجميع { ونزَّلنا عليكم الخ؛ فباعتبار قراءة حمزة ، والكسائي ، وخلف قد أنجيتكم وواعدتكم بتاء المفرد تكون قراءة وأنزلنا بنون العظمة قريباً من الالتفات وليس عينه ، لأن نون العظمة تساوي تاء المتكلّم .والسلوَى تقدم في سورة البقرة . وكان ذلك في نصف الشهر الثاني من خروجهم من مصر كما في الإصحاح 16 من سفر الخروج .\n\n",
      "translations": [
        {
          "translation": "(O Children of Israel!) O Children of Jacob (We delivered you from your enemy) from Pharaoh, (and We made a covenant with you on the holy mountain's side) the right side of Moses by giving him the Scripture, 343 (and sent down on you the manna and the quails) in the wilderness,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وواعدناكم جانب } طور القلب { الأيمن } الذي يلي روح القدس وهو محل الوحي الذي يسمونه الروع والفؤاد { ونزّلنا عليكم } من الأحوال والمذاهب من الذوقيات وسلوى العلوم والمعارف من اليقينيات { كلوا من طيبات ما رزقناكم } أي: تغذوا تلك المعارف الطيبة وتقبلوها بقلوبكم فإنها سبب حياتها { ولا تطغوا فيه } بظهور النفس وإعجابها بنفسها عند استشراقها ورؤيتها بهجتها وكمالها وزينتها { فيحلَ عليكم } غضب الحرمان وآفة الخذلان { فقد هوى } سقط عن مقام القرب في جحيم النفس واحتجب عن نور تجلي صفات الجمال في ظلمات الاستتار وأستار الجلال\n { وإني لغفّار } لستّار صفات النفس الطاغية الظاهرة بتزييناتها واستغنائها بأنوار صفاتي { لمن تاب } عن تظاهرها واستيلائها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويعلموا أن الكل من عندنا: { يٰبَنِي إِسْرَائِيلَ } المنظورين بنظر الرحمة والشفقة { قَدْ أَنجَيْنَاكُمْ } أولاً بقدرتنا { مِّنْ عَدُوِّكُمْ } الغالب القاهر عليكم { وَ } أنجيناكم ثانياً عن جرائم تقصيراتكم بامتثال الأوامر الوجوبية حال { وَاعَدْنَاكُمْ } نزول التوراة بصعودكم { جَانِبَ ٱلطُّورِ } لا جميع جوانبه بل جانبه { ٱلأَيْمَنَ } ذا اليُمن والكرامة\n ليشير إلى العفو عن التقصير { وَ } أنجيناكم ثالثاً عن شدائد التيه من جوعه وعطشه وحره وبرده بأن { نَزَّلْنَا عَلَيْكُمُ ٱلْمَنَّ } الزنجبين { وَٱلسَّلْوَىٰ } [طه: 80] السماني\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: لبني إسرائيل\n بعد ما أنجاهم من الغرق\n وأفاض عليهم من فنون النعم الدينية والدنيوية: { يا بني إِسرائيل قد أنجيناكم من عدوكم } فرعون وقومه\n حيث كانوا\n[البَقَرَة: 49]\n { ووعدناكم جانبَ الطُّورِ الأيمنِ } أي: واعدناكم بواسطة نبيكم\n إتيان جانب الطور\n الجانب الأيمن منه للمناجاة وإنزال التوراة\n وهل هو الطور الذي أبصر فيه النار ووقعت فيه الرسالة\n أو غيره؟ خلاف\n ونسبة المواعدة إليهم مع كونه لموسى عليه السلام خاصة\n أو له وللسبعين المختارين\n نظرٌ إلى ملابستها إياهم\n وسراية منفعتها إليهم\n وإعطاء لمقام الامتنان حقه\n كما في قوله تعالى:\n[الأعرَاف: 11] حيث نسب الخلق والتصوير للمخاطبين\n مع أن المخلوق كذلك هو آدم عليه السلام\n ثم قال تعالى: { ونزَّلنا عليكم } حين تُهتم\n { المنَّ والسَّلْوى } أي: الترنجبين والطير السُّماني\n حيث كان ينزل عليهم المنَّ وهم في التيه\n مثل الثلج\n من الفجر إلى الطلوع\n لكل إنسان صالح\n ويبعث الجنوب عليهم السُّماني\n فيذبح الرجل منه ما يكفيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:57",
      "similarity": 0.6563185127256288
    },
    {
      "verse": "19:52",
      "similarity": 0.3977363126865198
    },
    {
      "verse": "28:46",
      "similarity": 0.31966238620142323
    },
    {
      "verse": "7:160",
      "similarity": 0.27676014593640885
    },
    {
      "verse": "71:14",
      "similarity": 0.2737641629994394
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020080.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020080.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:80.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}