{
  "chapter": "طه",
  "text": "قالوا۟ ما اخلفنا موعدك بملكنا ولكنا حملنا اوزارا من زينة القوم فقذفنها فكذلك القى السامرى",
  "translations": [
    {
      "translation": "They said: \"We did not break our promise to you of our own will, but we were made to carry the loads of ornaments belonging to the people, which we threw (into the fire), and so did Sameri.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They answered: \"We did not break our promise with you out of our own volition; but we were laden with the load of people's ornaments, and we simply threw them down(into the fire), and the Samiri also threw down something,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"We did not go against our promise with you out of our own accord. We were forced to carry people's ornaments. We threw them away and so did the Samiri.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We did not renege on our promise to you on our own will, but we were made to carry the burdens of ornaments of the people, so we cast them – and similarly did Samri cast.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We broke not the promise to you, of our own will, but we were made to carry the weight of the ornaments of the people, then we cast them, and that was what As-Samiri suggested.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: We did not break (our) promise to you of our own accord, but we were made to bear the burdens of the ornaments of the people, then we made a casting of them, and thus did the Samiri suggest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not failed in our tryst with thee,' they said, 'of our volition; but we were loaded with fardels, even the ornaments of the people, and we cast them, as the Samaritan also threw them, into the fire.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: We broke not tryst with thee of our own will, but we were laden with burdens of ornaments of the folk, then cast them (in the fire), for thus As-Samiri proposed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They answered, \"We did not break our promise to you of our own accord, but we had to carry loads of the people's ornaments and so we threw them [into the fire] for that was what the Samiri suggested,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: we failed not to keep thy appointment of our own authority, but we were laden with burthens of the people's ornaments; then we threw them, and Thus Samiri cast down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘We did not fail our tryst with you of our own accord, but we were laden with the weight of those people’s ornaments, and we cast them [into the fire] and so did the Samiri.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We broke not the promise to thee, as far as lay in our power: but we were made to carry the weight of the ornaments of the (whole) people, and we threw them (into the fire), and that was what the Samiri suggested.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We broke not the promise to you, of our own will, but we were made to carry the weight of the ornaments of the [Fir'aun's (Pharaoh)] people, then we cast them (into the fire), and that was what As-Samiri suggested.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied: 'We have not failed in our promise to you through our choosing. We were laden with fardels, even the ornaments of the nation, and threw them just as the Samaritan had thrown them (into the fire),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We did not break our promise to you by our choice, but we were made to carry loads of the people’s ornaments, and we cast them in. That was what the Samarian suggested.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We did not break our promise to you by our will, but we were made to carry burdens from the ornaments of the people [of Pharaoh], so we threw them [into the fire], and thus did the Samiri throw.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:87] They said, ‘We did not break our tryst with you of our own accord (read the mīm with any of the three vowellings, meaning ‘by our own power’ or ‘of our own will’), but we were laden with (read hamalnā, ‘we carried’, or hummilnā, ‘we were made to carry’) the burdens, the weight, of the people’s ornaments, of the trinkets of Pharaoh’s folk — which the Children of Israel had borrowed from them on the pretext of [using them for] a wedding, but which had remained with them — and we cast them, we threw them into the fire   at the command of the Samaritan, and so, just as We cast, did the Samaritan cast, what he had on him of their trinkets together with the dust that he took from the track left by the hoof of Gabriel’s steed, as follows:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said) O Moses: (We broke not tryst with thee) we did not go against your promise (of our own will) intentionally knowing that we were doing so, (but we were laden with burdens) loads (of ornaments of the folk) of the ornament of the people of Pharaoh, and the evil omen of that burden led us to worship the calf, (then cast them) then we cast the ornament ((in the Fire), for thus al-Samiri proposed) just as al-Samiri did.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَآ أَخْلَفْنَا مَوْعِدَكَ بِمَلْكِنَا } يعني بِطَاقتَنا { وَلَـٰكِنَّا حُمِّلْنَآ أَوْزَاراً مِّن زِينَةِ ٱلْقَوْمِ } معناه حُمِّلنَا آثاماً مِن حُلى القِبطِ؛ فَقَذَفنَاها في الحُفرةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } يا موسى { مَآ أَخْلَفْنَا مَوْعِدَكَ بِمَلْكِنَا } بقدرتنا واختيارنا من غير ظهور دليل يشغلنا عن موعدك، بل { وَلَـٰكِنَّا } كنا على ما وعدتنا، ولا يصدر عنا مخالفتك غير أن { حُمِّلْنَآ أَوْزَاراً } وآثاماً مستعاراً { مِّن زِينَةِ ٱلْقَوْمِ } أي: من حلي القبط ولم يمكنا الرد إليهم لاستئصالهم، ولا يمكننا أيضاً حملها وحفظها دائماً؛ لذلك اضطررنا فحفرنا حفرة { فَقَذَفْنَاهَا } أي: قذف كل منَّا منا في يده من الحلي فيها { فَكَذَلِكَ أَلْقَى ٱلسَّامِرِيُّ } [طه: 87] ما في يده من الحلي فيه بعد قذفنا بلا صنع زائدٍ منا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا ما أخلفنا موعدك } أي: وعدنا إياك بالثبات على ما أمرتنا به، { بمَلْكنا } أي: بسلطاننا وقدرتنا، ونحن نملك أمرنا\n وفيه لغتان: فتح الميم وكسرها\n يعنون: لو خلينا وأُمورَنا، ولم يسوِّل لنا السامريُّ ما سوله، ما أخلفنا، ولكن غلبنا على أمرنا، واستغوانا السامري مع مساعدة الأحوال\n وقال القشيري: أي: لم نكن في ابتداء حالنا قاصدين إلى ما حَصَلَ مِنَّا، ولا عالمين بما آلَتْ إليه عاقبة أمرِنَا، وإنَّ الذي حملنا عليه حُلِيّ القبط، صاغَ السامريُّ منه العجلَ، فآل الأمر إلى ما بلغ من الشر، وكذلك الحرامُ لا يخلو شؤمُه من الفتنة والشر\n هـ\n وقوله تعالى: { ولكِنَّا حُمِّلْنَا أوزارًا من زينةِ القوم } ، استدراك عما سبق، واعتذار ببيان منشأ الخطأ، أي: حملنا أحمالاً من حُليّ القبط، التي استعرناها منهم، حين هممنا بالخروج من مصر باسم العرس\n وقيل: كانوا استعاروها لعيد كان لهم، ثم لم يردوها إليهم، مخافة أن يقفوا على أمرهم\n وقيل: لما رمى البحر أجساد القبط، وكان غالب ثيابهم الذهب والفضة، التقطها بنو إسرائيل، فهي زينة القوم التي صيغ منها العجل، ولعل تسميتها أوزارًا لأنها تبعات وآثام، حيث لم تحل الغنائم لهم\n { فقذفناها } أي: في النار رجاء الخلاص من عقوبتها، أو قذفناها إلى السامري وألقاها في النار، { فكذلك ألقى السامريُّ } ما كان معه منها كما ألقيناه، أو ألقى ما كان معه من تراب حافر فَرس جبريل، كان قد صرَّه في عمامته، وكان ألقى إليه الشيطان: أنه ما خالط شيئًا إلا حيى، فألقاه في فمه فصار يخور\n\n",
      "translations": []
    }
  ]
}