{
  "chapter": "طه",
  "text": "كلوا۟ من طيبت ما رزقنكم ولا تطغوا۟ فيه فيحل عليكم غضبى ومن يحلل عليه غضبى فقد هوى",
  "translations": [
    {
      "translation": "Eat of the good things We have provided for you but do not go to excess in it or My anger will be unleashed on you. Anyone who has My anger unleashed on him has plunged to his ruin.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And said): \"Eat of the good things We have given you for food, and do not exceed the bounds (of law) in this, or My wrath will surely fall upon you; and he who incurs My wrath will fall into the abyss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying: \"Partake of the good things that We have provided for you, but do not transgress lest My wrath fall upon you; for he upon whom My wrath falls is ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We sent you manna and quails.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Eat the good clean things We have provided you, and do not exceed the limits in respect of it causing My wrath to descend upon you; and indeed the one on whom My wrath descended, has fallen.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying) eat of the Tayyibat wherewith We have provided you, and commit no transgression or oppression therein, lest My anger should justly descend on you. And he on whom My anger descends, he is indeed perished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of the good things We have given you for sustenance, and be not inordinate with respect to them, lest My wrath should be due to you, and to whomsoever My wrath is due be shall perish indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of the good things wherewith We have provided you; but exceed not therein, or My anger shall alight on you; and on whomsoever My anger alights, that man is hurled to ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): Eat of the good things wherewith We have provided you, and transgress not in respect thereof lest My wrath come upon you: and he on whom My wrath cometh, he is lost indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat from the wholesome things with which We have provided you but do not transgress, lest you should incur My wrath.\" [We said], \"He that incurs My wrath shall surely be ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: eat of the clean things wherewith We have provided you, and wax not exorbitant in respect thereof, lest My wrath alight on you; and upon whomsoever My wrath alighteth, he surely perisheth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Eat of the good things We have provided you, but do not overstep the bounds therein, lest My wrath should descend on you, and he on whom My wrath descends certainly perishes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): \"Eat of the good things We have provided for your sustenance, but commit no excess therein, lest My Wrath should justly descend on you: and those on whom descends My Wrath do perish indeed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying) eat of the Taiyibat (good lawful things) wherewith We have provided you, and commit no oppression therein, lest My Anger should justly descend on you. And he on whom My Anger descends, he is indeed perished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of the good things with which We have provided you and do not transgress therein lest My Anger should fall upon you, and upon whosoever My Anger falls has assuredly fallen,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of the good things We have provided for you, but do not be excessive therein, lest My wrath descends upon you. He upon whom My wrath descends has fallen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Saying], \"Eat from the good things with which We have provided you and do not transgress [or oppress others] therein, lest My anger should descend upon you. And he upon whom My anger descends has certainly fallen.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:81] ‘Eat of the good things We have provided you, that is to say, of that which has been bestowed on you as a grace [from God], but do not transgress regarding it, by being ungrateful for the grace thereof, lest My wrath descend on you ([if read] fa-yahilla, it means ‘[lest] it [My wrath] become incumbent [upon you]’; or [if read] fa-yuhilla, it means ‘[lest] it descend [on you]’). And he on whom My wrath descends (read yahlil, ‘becomes incumbent’, or yahlul, ‘descends’) certainly perishes, falls into the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Saying): Eat of the good things) of the lawful things (wherewith We have provided you) of manna and quails, (and transgress not in respect thereof) do not disbelieve in Him; it is also said that this means: do not save for the next day (lest My wrath) and torment (come upon you; and he on whom My wrath cometh) and he on whom my wrath and torment is decreed, (he is lost indeed) he is destroyed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوأمرناكم بالأكل منهما مباحاً بأن قلنا: { كُلُواْ مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ } بعد تحملكم شدائد الابتلاء واشكروا لنعمنا لنزيدهم { وَلاَ تَطْغَوْاْ فِيهِ } أي: لا تضلوا بإسناد النعم إياكم إليكم لا إلينا\n مثل فرعون وقومه\n وإن كنتم مثلهم في كفرانها { فَيَحِلَّ } أي: فينزل { عَلَيْكُمْ غَضَبِي } ألبتة مثل حلولهم { وَ } اعلموا أن { مَن يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوَىٰ } [طه: 81] سقط عن درجة الاعتبار والتقرب\n\n\n{ وَ } إن ابتليتم بحلول الغضب لا تيأسوا عن نزول الرحمة بعد التوبة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقلنا لهم: { كُلوا من طيباتِ ما رزقناكم } أي: من لذائده\n أو حلاله\n وفي البدء بنعمة الإنجاء ثم بالنعمة الدينية ثم بالنعمة الدنيوية من حسن الترتيب ما لا يخفى\n { ولا تطغَوا فيه } أي: فيما رزقناكم بالإخلال بشكره\n والتَعدي لما حَدَّ لكم فيه\n كالترفه والبطر والمنع من المستحق\n وقال القشيري: مجاوزة الحلال إلى الحرام\n أو بالزيادة على الكفاف وما لا بُدَّ منه\n فأزاد على سدِّ الرمق\n أو بالأكل على الغفلة والنسيان\n هـ\n وقيل: لا تدخروا\n فادَّخروا فتعودوا\n وقيل: لا تنفقوه في المعصية\n { فيَحِلَّ عليكم غضبي } بفعل شيء من ذلك\n أي: ينزل ويجب\n من حَلَّ الدين إذا وجب\n { ومَن يَحْلِلْ عليه غضبي فقد هَوَى } أي: تردَّى وهلك\n أو وقع في المهاوي\n { وإِني لغفارٌ } أي: كثير الغفران { لمن تابَ } عن الشرك والمعاصي\n التي من جملتها الطغيان فيما ذكر\n { وآمن } بما يجب الإيمان به",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:88",
      "similarity": 0.5355060533337762
    },
    {
      "verse": "16:114",
      "similarity": 0.4265086713672364
    },
    {
      "verse": "1:7",
      "similarity": 0.37481403416383896
    },
    {
      "verse": "5:87",
      "similarity": 0.3515291326826734
    },
    {
      "verse": "8:69",
      "similarity": 0.32115074751250783
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020081.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020081.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:81.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}