{
  "chapter": "طه",
  "text": "قال هم او۟لاء على اثرى وعجلت اليك رب لترضى",
  "translations": [
    {
      "translation": "He said, They are following in my tracks. I have hurried on ahead to you, My Lord, to gain Your good pleasure.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"They are right behind me. I have hastened to You, O Lord, so that You may be pleased.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"They are close behind me, and I hastened to You, Lord, that You may be pleased with me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses replied, \"They are just behind me. I came earlier to seek Your pleasure\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He submitted, “They are here, just behind me – and O my Lord, I hastened towards You, in order to please You.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"They are close on my footsteps, and I hastened to You, O my Lord, that You might be pleased.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: They are here on my track and I hastened on to Thee, my Lord, that Thou mightest be pleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are upon my tracks,' Moses said. 'I have hastened, Lord, only that I may please Thee.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: They are close upon my track. I hastened unto Thee, my Lord, that Thou mightest be well pleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"They are following in my footsteps, while I have hastened to You, my Lord, to please You.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: those! they are close on my footstep, and hastened to Thee, O my Lord; that Thou mightest be wellpleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘They are close upon my heels, and I hurried on to You, my Lord, that You may be pleased.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: \"Behold, they are close on my footsteps: I hastened to thee, O my Lord, to please thee.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"They are close on my footsteps, and I hastened to You, O my Lord, that You might be pleased.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses replied: 'They are following me. My Lord, I made haste only so that I might please You'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “They are following in my footsteps; and I hurried on to You, my Lord, that you may be pleased.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"They are close upon my tracks, and I hastened to You, my Lord, that You be pleased.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:84] He said, ‘They are close, behind me, coming, upon my track, and I hastened to You, my Lord, that You may be pleased’, with me, in other words, to please you [even] more — before [giving] the response, he gives an excuse, according to what he supposed [was the situation with his people],\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "He said: They are close upon my track) they are following in my track. And (I hastened unto Thee that Thou mightest be well pleased) so that Your good pleasure with me is increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } موسى: { هُمْ } من غاية قربهم { أُوْلاۤءِ } المشار إليهم التابعين { عَلَىٰ أَثَرِي وَعَجِلْتُ } من غاية اشتياقي { إِلَيْكَ رَبِّ لِتَرْضَىٰ } [طه: 84] عني ويزداد تقربي إليك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال الكواشي: ولما كان سُؤال الرب تعالى لموسى يقتضي شيئين: أحدهما: إنكار العَجَلة، والثاني: السؤال عن السبب والحامل عليها، كان أهم الأمرين إلى موسى بسَطَ العذر وتمهيد العلة في نفس ما أنكر عليه، فاعتل أن قال: إن ما وُجدَ مني تقدم يسير، لا يُعتد بمثله في العادة لقربه، كما يتقدم الوفدَ رئيسُهم ومُتقدمُهم، ثم عقبه بجواب السؤال فقال: { عَجِلْتُ إِليك رَبِّ لِترضَى } لتزداد عني رضا لمسارعتي إلى الامتثال لأمرك، واعتنائي بالوفاء بعهدك لأنه ظن أن إسراعه إليه أبلغ في رضاه\n وفي هذا دليل على جواز الاجتهاد للأنبياء - عليهم السلام - والمعنى: لتعلم أني أُحبك ولا قرار لي مع غيرك\n هـ\n وقال القشيري: { هم أولاء على أثري } ما خلَّفْتُهم لتضييعي إياهم، ولكن عَجِلْتُ إليك ربِّ لترضى\n قال: يا موسى، رضائي في أن تكون مَعهم، ولا تتقدمهم ولا تَسْبِقَهم، وكونُكَ مع الضعفاءِ، الذين استصحبتهم في حصول رضاي، أبلغُ مِن تَقَدُّمِكَ عليهم\n هـ\n { قال } له تعالى: { فإِنا فتنَّا قومَك من بعدِك } أي: ابتليناهم بعبادة العجل من بعد ذهابك من بينهم\n رُوِيَ أنهم أقاموا على ما وصاهم به موسى عليه السلام عشرين ليلة، بعد ذهابه، فحسبوها مع أيامها أربعين، وقالوا: قد أكملنا العدة، وليس من موسى عين ولا أثر، وكان وعدهم أن يغيب عنهم أربعين يومًا، واستخلف هارون على من بقي منهم، وكانوا ستمائة ألف، فافتتنوا بعبادة العجل كلهم، ما نجا منهم إلا اثنا عشر ألفًا\n وهذا معنى قوله تعالى: { وأضلَّهُمُ السامريُّ } ، حيث كان هو السبب في فتنتهم، فقال لهم: إنما أخلف موسى عليه السلام ميعادكم لِمَا معكم من حُليّ القوم، فهو حرام عليكم، فكان من أمر العِجل ما يأتي تفسيره إن شاء الله\n فإخباره تعالى بهذه الفتنة عند قدومه عليه السلام، قبل وقوعها، إما باعتبار تحققها في علمه تعالى، وإما باعتبار التعبير عن المتوقع بالواقع، كما في قوله تعالى:\n\n\n\n[الأعرَاف: 44]، أو لأن السامري كان قد عزم على إيقاع الفتنة عند ذهاب موسى عليه السلام، وتصدى لها بترتيب مبادئها، فكانت الفتنة واقعة عند الإخبار بها\n والسامري منسوب إلى قبيلة من بني إسرائيل، يقال لها: سامرة، وقيل: كان رجلاً من كرمان\n وقال ابنُ عباس: كان من قرية يعبدون البقر، فدخل في بني إسرائيل وأظهر الإسلام، وفي قلبه ما فيه من حب عبادة البقرة، فابتلى اللهُ به بني إسرائيل، واسمه: موسى بن ظفر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:38",
      "similarity": 0.6222722236978794
    },
    {
      "verse": "74:24",
      "similarity": 0.6058767938790369
    },
    {
      "verse": "87:16",
      "similarity": 0.5886016949927085
    },
    {
      "verse": "43:22",
      "similarity": 0.5408045033955865
    },
    {
      "verse": "30:50",
      "similarity": 0.5104596425187006
    }
  ]
}