{
  "chapter": "طه",
  "text": "وانى لغفار لمن تاب وءامن وعمل صلحا ثم اهتدى",
  "translations": [
    {
      "translation": "But I am Ever-Forgiving to anyone who makes tawba and has iman and acts rightly and then is guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet I am gracious to him who repents and believes, and does the right, and follows the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But I am indeed Most Forgiving to him who repents and believes and does righteous works and keeps to the Right Way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I allowed you to consume the pure sustenance which We had given you but not to become rebels, lest you become subject to My wrath. Whoever becomes subject to My wrath will certainly be destroyed. I am All-forgiving to the righteously striving believers who repent and follow the right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed I am Most Oft Forgiving for him who repented and accepted faith and did good deeds, and then remained upon guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, I am indeed forgiving to him who repents, believes and does righteous deeds, and then Ihtada.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely I am most Forgiving to him who repents and believes and does good, then continues to follow the right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet I am All-forgiving to him who repents and believes, and does righteousness, and at last is guided.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! verily I am Forgiving toward him who repenteth and believeth and doeth good, and afterward walketh aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But I am most forgiving towards him who turns in repentance and believes and acts righteously and follows the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily I am the Most Forgiving unto whomsoever repenteth and believeth and worketh righteously, and thereafter letteth himself remain guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed I forgive those who repent, become faithful, act righteously, and follow guidance.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, without doubt, I am (also) He that forgives again and again, to those who repent, believe, and do right, who,- in fine, are ready to receive true guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, I am indeed Forgiving to him who repents, believes (in My Oneness, and associates none in worship with Me) and does righteous good deeds, and then remains constant in doing them, (till his death).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but to whosoever repents, believes and does good deeds, and is at last guided, I am Forgiving'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I am Forgiving towards him who repents, believes, acts righteously, and then remains guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But indeed, I am the Perpetual Forgiver of whoever repents and believes and does righteousness and then continues in guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:82] And indeed I am Forgiving toward him who repents, from ascribing partners [to God], and believes, affirms God’s Oneness, and acts righteously, is sincere in [performing] the obligatory and the supererogatory [deeds], and then follows guidance’, by adhering to what has been mentioned up to his death.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! verily I am Forgiving towards him who repenteth) from idolatry (and believeth) in Allah (and doeth good) with sincerity, (and afterward walketh aright) then truly sees the reward of his works; it is also said that this means: he is guided to the community of the orthodox faithful (ahl al-sunnah wa'l-jama'ah) and dies in that state.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنِّي لَغَفَّارٌ لِّمَن تَابَ وَآمَنَ وَعَمِلَ صَالِحَاً } معناه لمنْ تَابَ مِنَ الشِّركِ، وعَمِلَ صالحاً مِن صَلاةٍ وصَومٍ، وغيرِ ذَلكَ منَ الفَرائضِ { ثُمَّ ٱهْتَدَىٰ } يعني ثَبَتَ عَلَى ذَلِكَ حتَّى ماتَ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And indeed, I am forgiving to those who repent and have faith and do righteous deeds}, its meaning is for whoever repents from polytheism and does righteous deeds from prayers and fasting, and other than that from the obligations {then he has guidance}, meaning he is firm upon that until he dies.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن ابتليتم بحلول الغضب لا تيأسوا عن نزول الرحمة بعد التوبة؛ إذ { إِنِّي } بعد رجوعكم إليّ بالإخلاص { لَغَفَّارٌ } ستارُ { لِّمَن تَابَ } عما جرى عليه { وَآمَنَ } بعد التوبة تأكيداً للإيمان السابق { وَعَمِلَ صَالِحَاً } بعد ذلك نادماً على ما مضى من العصيان { ثُمَّ ٱهْتَدَىٰ } [طه: 82] بالأخلاص والعمل الصالح إلى درجات القرب واليقين\n\n\nولما كان موسى حريصاً على أهداء قومه لشفقته عليهم، تسارع إلى تصفيتهم، واختار منهم سبعين رجلاً من خيارهم حتى يذهبوا معه إلى الطور ليأخذوا التوراة، فساروا معه، فسارع موسى في الصعود شوقاً إلى لقاء ربه، وأمرهم أن يتبعوه في الارتقاء إلى الجبل، فوصل موسى الموعد قبل وصولهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِني لغفارٌ } أي: كثير الغفران { لمن تابَ } عن الشرك والمعاصي، التي من جملتها الطغيان فيما ذكر، { وآمن } بما يجب الإيمان به، { وعَمِلَ صالحًا } أي: عملاً صالحًا مستقيمًا عند الشرع، وفيه ترغيب وحث لمن وقع في زلَّة أو طغيان على التوبة والإيمان، { ثم اهتدى } أي: استقام على الهدى ودام عليها حتى مات\n وفيه إشارة إلى أن من لم يستمر عليها بمعزل عن الغفران\n قال الكواشي: { ثم اهتدى } أي: علم أن ذلك بتوفيق من الله تعالى\n هـ\n الإشارة: إذا ذهبت عن العبد أيام المحن، وجاءت له أيام المنن، فينبغي له أن يتذكر ما سلف له من المحن، وينظر ما هو فيه الآن من المنن، ليزداد شكرًا وتواضعًا، فتزداد نعمه، وتتواتر عليه الخيرات\n وأما إن نسي أيام المحن، ولم يشكر ما هو فيه من المنن، فحقيق أن تزول عنه، ويرجع إلى ما كان عليه\n\n\nوتَذَكَّرْ حديث الأبرص والأقرع والأعمى، حسبما في الصحيح\n فإن الأبرص والأقرع، حين شفاهما الله وأغناهما، أنكرا ما كانا عليه، فرجعا إلى ما كانا عليه، والأعمى حين أقر بما كان عليه، وشكر الحال الذي حال إليه، دامت نعمته وكثر خيره\n فالشكر قيد الموجود وصيد المفقود\n فيقال لأهل النعم، إن قاموا بشكرها: كُلوا من طيبات ما رزقناكم، ولا تطغوا فيه، بأن تصرفوه في غير محله، أو تمنعوه عن مستحقه، { فيحلَّ عليكم غضبي\n\n\n } الآية\n وقوله تعالى: { وإِني لغفار لمن تاب\n\n\n } الخ، قال القشيري: { وإني لغفار لمن تاب } من الزَّلَّة { وآمن } فلم يَرَ أعماله من نَفْسه، بل جميع الحوادث من الحقِّ، { وعمل صالحًا } فلم يُخِلّ بالفرائض، { ثم اهتدى } للسُّنَّةِ والجماعة، وقال أيضًا: ثم اهتدى بنا إلينا\n هـ\n قال الورتجبي: التائب: المنقطعُ إلى الله، والمؤمن: العارف بالله، والعمل الصالح: تركه ما دون الله، فإذا كان كذلك، فاهتدى بالله إلى الله، ويكون مغمورًا برحمة الله، ومعصومًا بعصمة الله\n هـ\n ثمَّ ذكر فتنة بني إسرائيل بالعجل\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:71",
      "similarity": 0.7523613707802018
    },
    {
      "verse": "3:89",
      "similarity": 0.6925764559616701
    },
    {
      "verse": "24:5",
      "similarity": 0.6925764559616701
    },
    {
      "verse": "7:153",
      "similarity": 0.6882037565155774
    },
    {
      "verse": "5:39",
      "similarity": 0.6795541182202666
    }
  ]
}