{
  "chapter": "طه",
  "text": "وما اعجلك عن قومك يموسى",
  "translations": [
    {
      "translation": "'Why have you hurried on ahead of your people, Musa?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What made you hurry away, O Moses, from your people?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, O Moses, what has made you come in haste from your people?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord asked, \"Moses, what made you attend your appointment with Me before your people?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And why did you come in haste ahead of your people, O Moosa?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what made you hasten from your people, O Musa\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what caused you to hasten from your people, O Musa?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What has sped thee far from thy people, Moses?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (it was said): What hath made thee hasten from thy folk, O Moses?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[When Moses was upon the Mount, God said,] \"O Moses, why have you come with such haste from your people?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what hath made thee hasten from thy people, O Musa?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[God said,] ‘O Moses, what has prompted you to hasten ahead of your people?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(When Moses was up on the Mount, Allah said:) \"What made thee hasten in advance of thy people, O Moses?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what made you hasten from your people, O Musa (Moses)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses, why have you come with such haste from your nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And what made you rush ahead of your people, O Moses?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"And what made you hasten from your people, O Moses?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:83] ‘And what has hurried you [to depart] from your people, in order to come to the appointed time to receive the Torah, O Moses?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When Moses was about to go with the seventy chosen men to the tryst, he hastened and went ahead of them; (And (it was said)) Allah said to him: (What hath made thee hasten from thy folk, Moses?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما أعجلك عن قومك } - إلى قوله - { في اليم نسفاً } معناه على التحقيق: أنّ موسى عليه السلام لما شرّف بمقام المكالمة وأوتي كشف الصفات وبعث لإنقاذ بني إسرائيل وإرشادهم إلى الحق وُعد شريعة يسوس بها قومه\n فاستخلف هارون على قومه وتخلى للمراقبة قبل تثبتهم على الإيمان وتقريرهم على الحق بالإيقان\n فعوقب على تلك العجلة وإن كانت من غاية الشوق إلى المشاهدة\n واقتضاء المقام عدم التفرّغ إلى تكميل الغير لأن في تكميلهم بالمعرفة اليقينية والكمال العلمي ثبات قدمه في الطاعة وامتثال الأمر المستلزم للترقي في الحال\n فاعتذر بكونهم على متابعته في الدين وإن لم تبن معاملتهم على أساس اليقين والتعجيل\n إنما بدر منه لطلب مقام الرضا الذي هو كمال الفناء في الصفات وهو استحكام مقام التجلي الصفاتي الذي منه المكالمة\n وإنما ابتلاهم الله بالسامري ليتميز المستعدّ القابل للكمال بالتجريد من القاصر الاستعداد المنغمس في الموادّ الذي لا يدرك إلا المحسوس ولا يتنبّه للمجرد المعقول\n ولهذا قالوا: { ما أخلفنا موعدك بملكنا } أي: بأن ملكنا أمرنا وخلينا ورأينا\n فإنهم عبيد بالطبع لا رأي لهم ولا ملكة وليسوا مختارين بل مطبوعون مسوسون مقودون بدنيون لا طريق لهم إلا التقليد والعمل\n لا التحقيق والعلم\n وإنما استعبدهم بالطلسم المفرع من الحلي لرسوخ محبة الذهب في طباعهم لكون نفوسهم سفلية منجذبة إلى الطبيعة الذهبية\n وتجلي تلك الصورة النوعية فيها للتناسب الطبيعي وكان ذلك من باب مزج القوى السماوية بالقوى الأرضية ولذلك قال: { بصرت بما لم يبصروا به } من العلم الطبيعي والرياضي اللذين يبتنى عليهما علم الطلسمات والسيميات\n { فقبضت قبضة من أثر الرسول } وهي على ما قيل: تراب موطىء حافر الحيزوم الذي هو فرس الحياة مركب جبرائيل\n أي: مما اتصل به أثر النفس الحيوانية الكلية السماوية المسخّرة للعقل الفعال\n المتأثرة منه\n الحاملة لصفاته التي هي بمثابة مركبه لاستعلائه عليها ووصول تأثيره إلى الطبائع العنصرية والأجرام السفلية بواسطتها من الأوضاع التي تفيض بسببها الآثار على المواد\n فتنفعل منها بحسب الاستعداد وتقبل الأحوال الغريبة التي هي بمثابة تراب موطىء مركبه { فنبذتها } فطرحتها على الجرم المذاب عند الإفراغ في صورة العجل وذلك من تسويل النفس الشيطانية الشريرة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفقال له سبحانه تنبيهاً على استعجاله واضطرابه في أمره: { وَمَآ أَعْجَلَكَ } أي: أي شيء أسبقك { عَن قَومِكَ } المستكملين برفاقتك { يٰمُوسَىٰ } [طه: 83] المرسَل لتكميلهم\n بل من حقك أن تجيء معهم مجتمعين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله لموسى عليه السلام\n لما ذهب إلى الطور\n لموافاة الميقات\n للعهد الذي عهد إليه\n واختار سبعين من بني إسرائيل\n يحضرون معه لأخذ التوراة بأمره تعالى\n فلما دنا من الجبل حمله الشوق\n فاستعجل إلى الجبل\n وترك قومه أسفله\n فقال له الحق جلّ جلاله: { وما أعجَلَكَ عن قومك يا موسى } أي: ما حملك على العَجَلَة\n وأيُّ شيء أعجلك منفردًا عن قومك\n وقد أمرتك باستصحابهم\n ولعل في إفرادك عنهم عدم اعتناء بهم؟ فأجاب عليه السلام بقول: { هُمْ أُولاءِ على أَثَري } أي: هم هؤلاء قريبًا مني\n فهُم معي\n وإنما سبقتهم بخطا يسيرة\n ظننت أنها لا تُخلُّ بالمعية\n ولا تقدح في الاستصحاب\n فإن ذلك مما لا يُعتد به فيما بين الرفقة\n قال الكواشي: ولما كان سُؤال الرب تعالى لموسى يقتضي شيئين: أحدهما: إنكار العَجَلة\n والثاني: السؤال عن السبب والحامل عليها\n كان أهم الأمرين إلى موسى بسَطَ العذر وتمهيد العلة في نفس ما أنكر عليه\n فاعتل أن قال: إن ما وُجدَ مني تقدم يسير\n لا يُعتد بمثله في العادة لقربه\n كما يتقدم الوفدَ رئيسُهم ومُتقدمُهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:204",
      "similarity": 0.6809730155873159
    },
    {
      "verse": "37:176",
      "similarity": 0.6809730155873159
    },
    {
      "verse": "2:92",
      "similarity": 0.6506681500655962
    },
    {
      "verse": "19:84",
      "similarity": 0.5527657657522255
    },
    {
      "verse": "21:37",
      "similarity": 0.540634895867129
    }
  ]
}