{
  "chapter": "طه",
  "text": "يبنى اسرءيل قد انجينكم من عدوكم ووعدنكم جانب الطور الايمن ونزلنا عليكم المن والسلوى",
  "translations": [
    {
      "translation": "Tribe of Israel! We rescued you from your enemy and made an appointment with you on the right hand side of the Mount and sent down manna and quails for you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Israel, We delivered you from your enemy, and made a covenant with you on the right side of the Mount, and sent down for you manna and quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel! We saved you from your enemy and made a covenant with you on the right side of the Mount and sent down on you manna and quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel, We saved you from your enemy and promised to settle you on the right side of the peaceful Mount Tur (Sinai)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Descendants of Israel, indeed We rescued you from your enemy, and We made a covenant with you on the right side of Mount Tur, and sent down Manna and Salwa upon you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We delivered you from your enemy, and We made a covenant with you on the right side of the Mount, and We sent down to you manna and quail,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Israel! indeed We delivered you from your enemy, and We made a covenant with you on the blessed side of the mountain, and We sent to you the manna and the quails.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel, We delivered you from your enemy; and We made covenant with you upon the right side of the Mount, and sent down on you manna and quails:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We delivered you from your enemy, and we made a covenant with you on the holy mountain's side, and sent down on you the manna and the quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel! We delivered you from your enemies and We made a covenant with you on the right side of the Mount. We sent down manna and quails for you,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel; We delivered you from your enemy, and treated with you on the right side of the mount and sent down upon you the manna and the quails.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We delivered you from your enemy, and We appointed with you a tryst on the right side of the Mount and We sent down to you manna and quails:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye Children of Israel! We delivered you from your enemy, and We made a Covenant with you on the right side of Mount (Sinai), and We sent down to you Manna and quails:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We delivered you from your enemy, and We made a covenant with you on the right side of the Mount, and We sent down to you Al-Manna and quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel! We saved you from your enemies and made a covenant with you on the right side of the Mountain. We sent down manna and quails.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! We have delivered you from your enemy, and promised you by the right side of the Mount, and sent down to you manna and quails.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel, We delivered you from your enemy, and We made an appointment with you at the right side of the mount, and We sent down to you manna and quails,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:80] O Children of Israel, truly We delivered you from your enemy, Pharaoh, by drowning him, and We made a tryst with you on the right side of the [Tūr] Mount, in order to give Moses the Torah, that it may be implemented it [by you], and We sent down to you manna and quails, namely, turunjabīn [citrus fruit] and the quail. The ones being addressed in the vocative [by ‘O Children of Israel’] are those Jews living at the time of the Prophet (s), and they are addressed with reference to the graces which God bestowed on their forefathers at the time of the prophet Moses as a preface to what God [now] says to them:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O Children of Israel!) O Children of Jacob (We delivered you from your enemy) from Pharaoh, (and We made a covenant with you on the holy mountain's side) the right side of Moses by giving him the Scripture, 343 (and sent down on you the manna and the quails) in the wilderness,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويعلموا أن الكل من عندنا: { يٰبَنِي إِسْرَائِيلَ } المنظورين بنظر الرحمة والشفقة { قَدْ أَنجَيْنَاكُمْ } أولاً بقدرتنا { مِّنْ عَدُوِّكُمْ } الغالب القاهر عليكم { وَ } أنجيناكم ثانياً عن جرائم تقصيراتكم بامتثال الأوامر الوجوبية حال { وَاعَدْنَاكُمْ } نزول التوراة بصعودكم { جَانِبَ ٱلطُّورِ } لا جميع جوانبه بل جانبه { ٱلأَيْمَنَ } ذا اليُمن والكرامة\n ليشير إلى العفو عن التقصير { وَ } أنجيناكم ثالثاً عن شدائد التيه من جوعه وعطشه وحره وبرده بأن { نَزَّلْنَا عَلَيْكُمُ ٱلْمَنَّ } الزنجبين { وَٱلسَّلْوَىٰ } [طه: 80] السماني\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: لبني إسرائيل، بعد ما أنجاهم من الغرق، وأفاض عليهم من فنون النعم الدينية والدنيوية: { يا بني إِسرائيل قد أنجيناكم من عدوكم } فرعون وقومه، حيث كانوا\n\n[البَقَرَة: 49]، { ووعدناكم جانبَ الطُّورِ الأيمنِ } أي: واعدناكم بواسطة نبيكم، إتيان جانب الطور، الجانب الأيمن منه للمناجاة وإنزال التوراة\n وهل هو الطور الذي أبصر فيه النار ووقعت فيه الرسالة، أو غيره؟ خلاف\n ونسبة المواعدة إليهم مع كونه لموسى عليه السلام خاصة، أو له وللسبعين المختارين، نظرٌ إلى ملابستها إياهم، وسراية منفعتها إليهم، وإعطاء لمقام الامتنان حقه\n كما في قوله تعالى:\n\n[الأعرَاف: 11] حيث نسب الخلق والتصوير للمخاطبين، مع أن المخلوق كذلك هو آدم عليه السلام\n ثم قال تعالى: { ونزَّلنا عليكم } حين تُهتم، { المنَّ والسَّلْوى } أي: الترنجبين والطير السُّماني، حيث كان ينزل عليهم المنَّ وهم في التيه، مثل الثلج، من الفجر إلى الطلوع، لكل إنسان صالح، ويبعث الجنوب عليهم السُّماني، فيذبح الرجل منه ما يكفيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:57",
      "similarity": 0.6563185127256288
    },
    {
      "verse": "19:52",
      "similarity": 0.3977363126865198
    },
    {
      "verse": "28:46",
      "similarity": 0.31966238620142323
    },
    {
      "verse": "7:160",
      "similarity": 0.27676014593640885
    },
    {
      "verse": "71:14",
      "similarity": 0.2737641629994394
    }
  ]
}