{
  "chapter": "طه",
  "text": "الله لا اله الا هو له الاسماء الحسنى",
  "translations": [
    {
      "translation": "Allah, there is no god but Him. The Most Beautiful Names are His.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God: There is no god but He. To Him belong the attributes most beautiful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah - there is no god but He. His are the most excellent names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the only Lord and to Him belong all the exalted Names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah – there is no worship except for Him; His only are the best names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is no God but Him! To Him belong the Best Names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah-- there is no god but He; His are the very best names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God -- there is no god but He. To Him belong the Names Most Beautiful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is no Allah save Him. His are the most beautiful names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God, there is no deity but Him. His are the most excellent names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! no God there is but he! His are the names excellent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah—there is no god except Him—to Him belong the Best Names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! there is no god but He! To Him belong the most Beautiful Names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! La ilahla illa Huwa (none has the right to be worshipped but He)! To Him belong the Best Names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, there is no god except He. To Him belong the most Beautiful Names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God, there is no god but He, His are the Most Beautiful Names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah - there is no deity except Him. To Him belong the best names.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:8] God — there is no god save Him. To Him belong the Most Beautiful Names, the ninety nine [Names], cited in the hadīth (al-husnā is the feminine form of al-ahsan, ‘the best’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah! There is no God save Him) alone without any partner. (His are the most beautiful names) His are the most exalted attributes, so call upon Him through them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ولما كانت الصفات المذكورة هي الأمهات التي لا صفة إلا تحت شمولها ولا اسم إلا كان مندرجاً في هذه الأسماء المذكورة ولم تتكثر الذات بها، قال: { الله } أي: ذلك المنزل الموصوف بهذه الصفات هو الله { لا إله إلا هو } لم تتكثر ذاته الأحدية وحقيقة هويته بها ولم يتعدّد، فهو هو في الأبد كما كان في الأزل لا هو إلا هو ولا موجود سواه باعتبار واحديته ومصدريته لما ذكر { له الأسماء الحسنى } التي هي ذاته مع اعتبار تعيينات الصفات { إذ رأى ناراً } هي روح القدس التي ينقدح منها النور في النفوس الإنسانية رأها باكتحال عين بصيرته بنور الهداية { فقال لأهله } القوى النفسانية { امكثوا } اسكنوا ولا تتحرّكوا إذ السير إنما يصير إلى العالم القدسي ويتصل به عند هذه القوى البشرية من الحواس الظاهرة والباطنة الشاغلة لها { إني آنست ناراً } أي: رأيت ناراً { لعلي آتيكم منها بقبس } أي: هيئة نورية اتصالية ينتفع بها كلكم فيتنوّر وتصير ذاته فضيلة { أو أجد على النار } من يهديني بالعلم والمعرفة الموجب للهداية إلى الحق أي: اكتسب بالاتصال بها الهيئة النورية أو الصور العلمية { فلما أتاها } أي: اتصل بها { نودي } من وراء الحجب النارية التي هي سرادقات العزة والجلال المحتجبة بها الحضرة الإلهية { يا موسى إني أنا ربّك } محتجباً بالصورة النارية التي هي أحد أستار جلالي تجلياً فيها { فاخلع نعليك } أي: نفسك وبدنك أو الكونين لأنه إذا تجرّد عنهما فقد تجرّد عن الكونين أي: كما تجرّدت بروحك وسرّك عن صفاتهما وهيئاتهما حتى اتصلت بروح القدس وتجرّد بقلبك وصدرك عنهما بقطع العلاقة الكلية ومحو الآثار والفناء عن الصفات والأفعال\n وإنما سماهما نعلين ولم يسمهما ثوبين لأنه لو لم يتجرّد عن ملابسهما لم يتصل بعالم القدس والحال حال الاتصال، وإنما أمره بالانقطاع إليه بالكلية كما قال:\n\n[المزمل، الآية:8] فكأنه بقيت علاقته معهما والتعلق بهما يسوّخ قدمه التي هي الجهة السفلية من القلب المسماة بالصدر، فهما بعد التوجه الروحي والسري نحو القدس، فأمره بالقطع عنهما في مقام الروح، ولهذا علل وجوب الخلع بقوله: { إنك بالواد المقدّس طوىً } أي: عالم الروح المنزّه عن آثار التعلق وهيئات اللواحق والعلائق المادية المسمى طوى، لطيّ أطوار الملكوت وأجرام السموات والأرضين تحته\n\n\nولقد صدق من قال: أمر بخلعهما لكونهما من جلد حمار ميت غير مدبوغ\n وقيل: لما نودي وسوس إليه الشيطان: إنك تنادى من شيطان! فقال: أفرق به، إني أسمع من جميع الجهات الست بجميع أعضائي ولا يكون ذلك إلا بنداء الرحمن\n { وأنا اخترتك فاستمع لما يوحى } هذا وعد بالاصطفاء الذي كان بعد التجلي التام الذاتي الذي جعل جبل وجوده دكّاً بالفناء فيه بالاندكاك وخروره صعقاً عند إفاقته بالوجود الحقاني كما قال تعالى:\n\n[الأعراف، الآيات:143 - 144]، وهذا التجلي هو تجلي الصفات قبل تجلي الذات، ولهذا أرسله ولم يستنبئه بالوحي هنا، وأمره بالرياضة والحضور والمراقبة ووعده وقوع القيامة الكبرى عن قريب\n فهذا الاختيار قريب من الاجتباء الأصلي المشار إليه بقوله:\n\n[طه، الآية:122] متوسط بينه وبين الاصطفاء\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فلا يكون الموجود الثابت إلا { ٱللَّهُ } أي: مسمى هذا الاسم الجامع جميع مراتب العالم بحيث لا يخرج عن حيطته شيء أصلاً\n إذ { لاۤ إِلَـٰهَ } أي: لا موجوداً { إِلاَّ هُوَ } أي: هذا المسمى الذي لا تعدد فيه أصلاً\n فيكون أحداً صمداً فرداً وتراً\n لم يتخذ صاحبةً ولا ولداً\n\n\nغايةُ ما في الباب أن { لَهُ } أي: لهذا المسمى { ٱلأَسْمَآءُ ٱلْحُسْنَىٰ } [طه: 8] الكليةُ التي جزئياتها لا تُعدُّ ولا تُحصى\n وباختلاف الأسماء\n اختلفت الظهورات والتجليات عن المسمى\n\n\nوكما نبهناك يا أكمل الرسل على ظهورنا في الكائنات مجملاً\n نبَّهناك عليها مفصلاً { وَ } ذلك أنه { هَلْ أَتَاكَ } أي: قد ثبت و تحقق عندك الكليم { حَدِيثُ مُوسَىٰ } [طه: 9] أي: قصةُ انكشافه من النار التي احتاج إليها هو وأهله في الليلة الشاتية المظلمة\n وقت { إِذْ رَأَى نَاراً } مطلوبةً لدفع البرودة\n ولوجدان الطريق في الظلمة { فَقَالَ لأَهْلِهِ } المحتاجين إليها في تلك الليلة: { ٱمْكُثُوۤاْ إِنِّيۤ آنَسْتُ نَاراً لَّعَلِّيۤ } أو أنس عندها مع إنسان استخبره عن الطريق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وكل ذلك إلى قوله: { له الأسماء الحسنى } ، مسوق لتعظيم المنزل - عزّ وجلّ - المستتبع بتعظيم المنزَّل عليه، الداعي إلى تربية المهابة وإدخال الروعة، المؤدية إلى استنزال المتمردين عن رتبة العتو والطغيان، واستمالتهم إلى الخشية، المفضية إلى التذكير والإيمان\n ثم قال تعالى: { الرحمنُ } أي: هو الرحمن، ووصف تعالى بالرحمانية إثر وصفه بالخالقية للإيذان بأن ربوبيته تعالى، وقيامَه بالأشياء، من طريق الرحمة والإحسان، لا بالإيجاب، وفيه إشارة إلى أن تنزيله القرآن أيضًا من رحمته - تعالى -، كما ينبئ عنه قوله عزّ من قائل:\n\n[الرَّحمن: 1،2]\n أو: { الرحمن على العرش استوى }: مبتدأ وخبر، وجعل الرحمة عنوان الموضوع الذي من شأنه أن يكون معلوم الثبوت للموضوع عند المخاطب للإيذان بأن ذلك أمر بيِّن لا خفاء فيه، غني عن الإخبار صريحًا\n\n\nوالاستواء على العرش مجاز عن المُلك والسلطان، يقال: استوى فلان على سرير الملك مرادًا به مَلَك الملك والتصرف، وإن لم يقعد على سرير أصلاً، والمراد: تعلق قدرته وقهريته في جميع الكائنات بالتدبير والتصرف التام\n وسُئل أحمد بن حنبل عن الاستواء، فقال: استواء مَنْ غَلَبَ وقهر، لا استواء كما يتوهم البشر\n وسئل عنه مالك والشافعي - رضي الله عنهما - فقالا: الاستواء معلوم، والكيفية مجهولة، والإيمان به واجب، والسؤال عن هذا بدعة وضلالة، آمنوا بلا تشبيه، وصدّقوا بلا تمثيل، وأمسكوا عن الخوض في هذا كل الإمساك\n وقال الجنيد رضي الله عنه: خلق الله العرش فوق سبع سماوات، وجعله قبلة لدعاء المخلوقات، وقابله بقلب عبده المؤمن، ليكون محلاً للتجليات والتنزلات والمخاطبات\n هـ\n وقد تقدم الكلام عليها في الأعراف مستوفيًا\n { له ما في السماوات وما في الأرضِ } ، سواء كان ذلك بالجزئية منهما أو بالحلول فيهما، { وما بينهما } من الموجودات الكائنة في الجو دائمًا، كالهواء والسحاب، أو أكثريًا كالطير، أي: له ذلك وحده دون غيره، لا شركةً ولا استقلالاً، كل ما ذكر هو له ملكًا وتصرفًا، وإحياء وإماتة، وإيجادًا وإعدامًا، { وما تحت الثرى }: وما وراء التراب المتصل بالهوى السفلى\n وعن محمد بن كعب: أنه ما تحت الأرضين السبع\n وعن السدي: أن الثرى هو الصخرة التي عليها الأرض السابعة، وذكره مع دخوله تحت ما في الأرض لزيادةِ التقرير\n { وإِن تجهر بالقول } أي: وإن تجهر بذكره تعالى - أو دعائه -، فاعلم أنه تعالى غني عن جهرك { فإِنه يعلمُ السرَّ وأخْفَى } أي: ما أسررته إلى غيرك، وشيئًا أخفى من ذلك، وهو ما أخطرته ببالك، من غير أن تتفوه به أصلاً أو:: السر: ما أسررته في نفسك، وأخفى منه: ما ستُسره في المستقبل\n وهو إمّا نهي عن الحركة، كقوله تعالى:\n\n[الأعرَاف: 205]، وإما إرشاد للعباد إلى أن الجهر ليس لإسماعه تعالى بل لغرض آخر من تأنيس النفس بالذكر وتثبيته فيها، ومنعها من الاشتغال بغيره، وقطع الوسوسة عنها، وهضمها بالتضرع والجؤار\n هذا والغرض من الآية: بيان إحاطة علمه تعالى بجميع الأشياء، إثر بيان سعة سلطانه وشمول قدرته بجميع الكائنات\n ثم بيَّن الموصوف بتلك الكمالات، فقال: { الله } أي: ما ذكر من صفات الكمال، موصوفها الله المعبود بالحق، { لا إِله إِلا هو } أي: لا معبود بحق إلا هو، ولا مستحق للعبادة إلا هو\n وهو تصريح بما تضمنه ما قبله من اختصاص الألوهية به سبحانه، فإنَّ ما أسند إليه تعالى من خلق جميع الموجودات، ومن الرحمانية والمالكية للكل، والعلم الشامل، يقتضي اختصاصه تعالى بالألوهية والربوبية، وقوله تعالى: { له الأسماء الحسنى } بيان لكون ما ذكر من الخالقِية والرحمانية والمالكية والعالِمِية أسماءه تعالى وصفاته، من غير تعدد في ذاته تعالى فالأسماء والصفات كثيرة، والمسمى والموصوف واحد\n\n\nو { الحسنى }: تأنيث الأحسن، فُعلى، يُوصف به الواحد المؤنث، والجمع المذكر والمؤنث، كـ\n\n[طه: 18]، و\n\n[طه: 23]\n والله تعالى أعلم\n الإشارة: من تأمل القرآن العظيم، وما جاء به الرسول - عليه أفضل الصلاة وأزكى التسليم - وجده يدل على ما يُفضي إلى الراحة دون التعب، وإلى السعادة العظمى دون الشقاء، لكن لا يتوَصل إلى الراحة إلا بعد التعب، ولا يُفضي العبد إلى السعادة الكبرى إلا بعد الطلب، فإذا اجتهد العبد في طلب ربه، وكله إلى شيخ ينقله من عمل الجوارح إلى عمل القلوب، فإذا وصل العمل إلى القلب استراحت الجوارح، وأفضى حينئذ إلى رَوْح وريحان، وجنة ورضوان، أعني جنة العرفان\n ولذلك قال الشيخ أبو الحسن: \" ليس شيخك من يدلك على تعبك، إنما شيخك من يريحك من تعبك \" ، كما في لطائف المنن\n وقال شيخنا القطب ابن مشيش: وقد سُئل عن قوله صلى الله عليه وسلم:\n\n \" يَسِّرُوا ولا تُعَسِّرُوا \" \n\nفقال: دلوهم على الله، ولا تدلوهم على غيره، فإن من دَلَّك على الدنيا فقد غشك، ومن دلَّك على العمل فقد أتعبك، ومن دلَّك على الله فقد نصحك\n هـ\n فإذا دلك على الله غَيَّبك عن وجود نفسك بشهود ربك، وهي السعادة العظمى، كما تقدم في سورة هود\n فمن اتخذ شيخًا ثم لم ينقله من مقام التعب، ولم يُرحله من مقام إلى مقام، فاعلم أنه غير صالح للتربية\n وقوله تعالى: { إِلا تذكرة لمن يخشى } ، قال شيخ شيوخنا سيدي عبد الرحمن العارف: قيل: أنزل اللهُ القرآنَ لتذكير سابق الوصال لأن الأرواح لمّا دخلت الأشباح اكتسبت خشية ووحشة وفرقة عن معادنها، فأنزل الله القرآن تأنيسًا لأن المحب يأنس بكتاب حبيبه وكلامه\n وقال جعفر الصادق: أنزل اللهُ القرآنَ موعظةً للخائفين، ورحمة للمؤمنين، وأنسًا للمحبين\n وايضًا: القرآن يُذَكّر عظمة الله الموجبة خشيته، فهو مُذهب للغفلة\n ثم قال: وفي الشهود الحاصل بالتذكير رفعُ المشقة، ووجدان الراحة بالطاعة، لكونه يصير محمولاً، وقد قال:\n\n[طه: 14]، أي: لشهودي فيها، وفي ذلك قرة عين، وراحةٌ، وأنس، وتشابه حال المصلي بحال موسى، بجامع النجوى، فلذلك ذكر في سياقه\n والله أعلم\n هـ\n وقوله تعالى: { الرحمنُ على العرش استوى } ، تفسيرها هو الذي قصد ابن عطاء الله في الحِكَم بقوله: \" يا من استوى برحمانيته على عرشه، فصار العرش غيبًا في رحمانيته، كما صارت العوالم غيبًا في عرشه، مَحَقْتَ الآثار بالآثار، ومحوت الأغيار بمحيطات أفلاك الأنوار\n وأنت خبير بأن الرحمانية وصف لازم للذات، والصفة لا تفارق الموصوف، فإذا استوت الرحمانية على العرش وغمرته فقد استوت عليه أسرار الذات وغمرته، وهي أفلاك الأنوار التي أحاطت بالعرش والآثار، ومحت كل شيء، حتى لم يبق إلا الذي ليس كمثله شيء، وليس معه شيء، وهو السميع البصير\n وما نسبة حس الآثار بالنسبة إلى أفلاك الأسرار التي استوت عليه إلا كالهباء في الهواء\n والله تعالى أعلم وأعظم\n ثمَّ ذكر قصص موسى عليه السلام وتسليته لرسوله صلى الله عليه وسلم\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:9",
      "similarity": 0.5216566761562258
    },
    {
      "verse": "31:3",
      "similarity": 0.49092282290806494
    },
    {
      "verse": "55:70",
      "similarity": 0.4695279887907647
    },
    {
      "verse": "92:6",
      "similarity": 0.45956294914622176
    },
    {
      "verse": "53:31",
      "similarity": 0.42040734453195
    }
  ]
}