{
  "chapter": "طه",
  "text": "فاخرج لهم عجلا جسدا له خوار فقالوا۟ هذا الهكم واله موسى فنسى",
  "translations": [
    {
      "translation": "Then he produced the image of a calf which mooed like a cow. And they said: 'This is your god and the god of Moses (whom) he has neglected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and brought out of there (from the molten gold) the effigy of a calf that lowed.\" The people cried out: \"This is your deity and the deity of Moses, whom Moses has forgotten.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Samiri forged the body of a motionless calf which gave out a hollow sound.\" The people said, \"This is your Lord and the Lord of Moses whom he (Moses) forgot to mention\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He therefore made a calf for them – a lifeless body, making sounds like a cow – so they said, “This is your God and the God of Moosa; whereas Moosa has forgotten.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he took out for them a calf which was mooing. They said: \"This is your god, and the god of Musa,\" but he had forgotten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he brought forth for them a calf, a (mere) body, which had a mooing sound, so they said: This is your god and the god of Musa, but he forgot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then he brought out for them a Calf, a mere body that lowed; and they said, 'This is your god, and the god of Moses, whom he has forgotten.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he produced for them a calf, of saffron hue, which gave forth a lowing sound. And they cried: This is your god and the god of Moses, but he hath forgotten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then he forged a calf for them -- an image producing a lowing sound. They said, \"This is your deity, the deity of Moses; he has forgotten it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he produced for them a calf: a body with a low. Then they Said: this is your god and the god of Musa, and that he forgat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he produced for them a calf—a [lifeless] body with a low—and they said, This is your god and the god of Moses, so he forgot!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he brought out (of the fire) before the (people) the image of a calf: It seemed to low: so they said: This is your god, and the god of Moses, but (Moses) has forgotten!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he took out (of the fire) for them a statue of a calf which seemed to low. They said: \"This is your ilah (god), and the ilah (god) of Musa (Moses), but [Musa (Moses)] has forgotten (his god).'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and made a calf for them, a figure that lowed. \"This,\" they said, \"is your god and the god of Moses but whom he has forgotten.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he produced for them a calf—a mere body which lowed. And they said, “This is your god, and the god of Moses, but he has forgotten.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he extracted for them [the statue of] a calf which had a lowing sound, and they said, \"This is your god and the god of Moses, but he forgot.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:88] Then he produced for them a calf, which he fashioned from the [melted] trinkets — a [mere] body, of flesh and blood, with a low, in other words, [it made] a sound that was audible; it was transformed into such [a state] because of the dust [from Gabriel’s steed] the effect of which is [to create] life in whatever thing it is placed. After he had fashioned it, he placed it [the dust] in its mouth. And they, namely, the Samaritan and his followers, said, ‘This is your God and the God of Moses: so he, Moses, forgot’, his Lord here and set off in search of him. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then he produced for them) from the gold they threw in the Fire, al-Samiri made for them (a calf, of saffron hue) a small form without a spirit, (which gave forth a lowing sound. And they cried) what is this? And al-Samiri said: (This is your God and the God of Moses, but he hath forgotten) al-Samiri abandoned Allah's worship and command; it is also said that this means: Moses left the way and took a wrong turn.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما قذف الكل حليهم فيها، أدخل السامري يده فيها { فَأَخْرَجَ لَهُمْ } منها { عِجْلاً } أي: صورة عجل أوجده الله تعالى من تلك الحلي المقذوفة، ولم يكن من ذوي الحس والحركة بل { جَسَداً } وهيكلاً { لَّهُ خُوَارٌ } بصوّت صوتَ البقرة { فَقَالُواْ } السامري أصالة والباقي تعباً: { هَـٰذَآ } الجسد الذي خار خورة { إِلَـٰهُكُمْ } الذين أوجدكم من العدم { وَإِلَـٰهُ مُوسَىٰ } المتردد في بيدان طلبه، أنزله في هذه الحفرة من قبل { فَنَسِيَ } [طه: 88] منزلة وسعى في طلبه سعياً بليغاً، فرقى الطور لهذا الطلب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nرُوِيَ: أنه قال لهم: إنما تأخر موسى عنكم، لما معكم من الأوزار، فالرأي أن نحفر حفرة ويُسجر فيها نار، ونقذف فيها كل ما معنا، ففعلوا، { فأخرج لهم } من ذلك الحليّ المذاب { عِجْلاً } أي: صورة عجل { جَسدًا } أي: جثة ذات لحم ودم، أو جسدًا من ذهب لا روح فيه، { له خُوار } أي: صوت عِجْل، { فقالوا } أي: السامري ومن افتتن به: { هذا إِلهكم وإِله موسى فَنَسِيَ } أي: غفل عنه وذهب يطلبه في الطور\n فقوله تعالى: { فَأخْرجَ لهم\n\n\n } الخ\n\n\n هو من كلام الله تعالى، حكاية لنتيجة فتنة السامري، قولاً وفعلاً، قصدًا إلى زيادة تقريرها، وتمهيدًا للإنكار عليهم، وليس من كلام المعتذرين، وإلا لقال: فَأَخْرجَ لنا\n\n\n والله تعالى أعلم\n الإشارة: ينبغي لرئيس القوم، إذا كان في سفر، أن يكون وسَطهم، أو سائقًا لهم، ولا يتقدمهم أو يستعجل لأمر عنهم، فإن التأني كله من الله، والعَجَلة كلها من الشيطان، والخير كله في الاجتماع مع الضعفاء والمساكين، حتى يكون كأحدهم، فإن فارقهم، لأمر مهم، فليستخلف عليهم من يثق به في دينه، وليكن اعتماده في ذلك على ربه، ونظره كله إلى رعايته وحفظه\n قال الكواشي: عن ابن عطاء: أوحى الله تعالى إلى موسى عليه السلام: أتدري من أين أُتيت؟ - يعني في فتنة قومه - قال: لا يا رب، قال: حين قلت لهارون: اخلفني في قومي، أين كنتُ أنا حين اعتمدتَ على هارون؟\n هـ\n فكل فتنة أو ضلال يُصيب الفقراء، فإنما ذلك من عدم الاجتماع مع أهل الفن، أو قلة الاستماع لهم، فإن أصابتهم فتنة الأسباب، والركون إلى شيء من الدنيا في غيبة الشيخ، فليرجع إليهم غضبان أسفًا، وليقل لهم: ألم يعدكم ربكم وعدًا حسنًا، وهو الفتح الكبير لو صبرتم على السير والتجريد، أفطال عليكم العهد، فقد كانت الرجال تمكث في خدمة الأشياخ العشرين والثلاثين سنة، أم أردتم أن يحل عليكم غضب من ربكم، بالإبعاد وإسْدَال الحجاب، حيث خالفتم عهود أشياخكم، فإن اعتذروا فليقبل عذرهم، وإن ركنوا إلى عبادة شيء من عجل الدنيا فليخرجه من أيديهم، وليقل: وانظر إلى إلهك الذي ظلت عليه عاكفًا، لنحرقنه ثم لننسفنه في اليم نسفًا\n وبالله التوفيق\n ثمَّ ذكر الانكار على عبدة العجل\n",
      "translations": []
    }
  ]
}