{
  "chapter": "طه",
  "text": "انما الهكم الله الذى لا اله الا هو وسع كل شىء علما",
  "translations": [
    {
      "translation": "Your god is Allah alone, there is no god but Him. He encompasses all things in His knowledge.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your god is only God. There is no other god but He. His knowledge extends over everything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is none else than Allah, beside Whom there is no god. His knowledge embraces everything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is the One who is the only God and He has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Your God is only Allah – other than for Whom there is no worship; His knowledge encompasses all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is only Allah, there is no God but Him. He has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Allah is only Allah, there is no god but He; He comprehends all things in (His) knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is only the One God; there is no god, but He alone who in His knowledge embraces everything.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Allah is only Allah, than Whom there is no other Allah. He embraceth all things in His knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your only deity is God, there is no deity but Him. His knowledge encompasses all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is only Allah, the One other than whom there is no god. He comprehendeth everything in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your God is Allah. There is no god except Him. He embraces all things in [His] knowledge.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the god of you all is the One Allah: there is no god but He: all things He comprehends in His knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Ilah (God) is only Allah, the One (La ilaha illa Huwa) (none has the right to be worshipped but He). He has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is only One, Allah. There is no god, except He, alone. His knowledge encompasses all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your god is God, the One besides whom there is no other god. He comprehends everything in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your god is only Allah, except for whom there is no deity. He has encompassed all things in knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:98] Indeed your God is the One God, than whom there is no other god. He embraces all things in [His] knowledge’ (‘ilman, a specification derived from the subject of the verb, in other words, it means ‘His knowledge embraces all things’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Your God is only Allah, than Whom there is no other God) He has no children or partners. (He embraceth all 345 things in His knowledge) He knows all things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَسِعَ كُلَّ شَيْءٍ عِلْماً } معناه أَحاطَ بهِ عِلماً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفأحرقها ونسفها وتوجه إلى بني إسرائيل، فقال: { إِنَّمَآ إِلَـٰهُكُمُ ٱللَّهُ } المستجمع جميع أوصاف الكمال هو { ٱلَّذِي لاۤ إِلَـٰهَ } أي: لا موجود { إِلاَّ هُوَ } وما سواه عدمُ، ولو تعقل فلا يخرج عن حضرة علمه شيء؛ لأنه { وَسِعَ كُلَّ شَيْءٍ } في الذهن والخارج { عِلْماً } [طه: 98]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم نبَّه على الحق فقال: { إِنما إِلهُكم الله } أي: إنما معبودكم المستحق للعبادة هو الله\n والجملة: استئنافية مسوقة لتحقيق الحق، إثر إبطال الباطل، بتلوين الخطاب وتوجيهه إلى الكل، ثم وصفه بقوله: { الذي لا إِله إِلا هو } وحده، من غير أن يُشاركه في الألوهية شيء من الأشياء، { وَسِعَ كل شيءٍ علمًا } أي: وسع علمه كل ما من شأنه أن يُعلم\n وجملة: { وسع }: بدل من الصلة، أي: إنما إلهكم: الذي وسع كل شيء علمًا لا غيره كائنًا ما كان، فيدخل فيه العجل دخولاً أوليًا\n وهذا ختم كلام موسى عليه السلام، بتقرير أمر التوحيد، كما كان افتتاح الوحي إليه به بقوله: { إِنني أنا الله لا إِله إِلا أنا }\n والله تعالى أعلم\n الإشارة: انظر أثر حافر فرس جبريل: كيف حييت به الأشباح، فكيف لا تحيا بتقبيل أثر وطء العارفين بالله، أو بتقبيل أقدامهم، بل كل من خضع لهم وقبَّل أقدامهم حييت روحه، وشعشعت أنواره، وتحقق عرفانه، كما هو معلوم لأن الخضوع لأولياء الله إنما هو خضوع لله لأنهم يدلون على الله، ويبعدون عن كل ما سواه\n وانظر السامري حين خضع لغير الله بمجرد هواه كيف طُرد وأُبعد، حتى صار مثلاً في الناس\n فقالت الصوفية: ينبغي للفقير أن يفر من أبناء جنسه، ويكون كالسامريِ، إذا رأى أحدًا قال: لا مساس، وأنشدوا:\n\n\n\nوالسنبتاء: كل حيوان جريء، وقيل: اسم للنمر\n ويقال، لمن ركن إلى شيء دون الله تعالى مِنْ علم، أو عمل، أو حال، أو مقام، أو فني في مخلوق: وانظر إلى إلهك الذي ظلت عليه عاكفًا لنُحرقنه ثم لننسفنّه في اليم نسفًا\n وفي بعض الأثر: يقول الله:\n\n \" يا عبدي، لا تركْن لشيء دوني، فإنْ ركنتَ إلى علم جهّلناك فيه، وإن ركنت إلى عمل رددناه عليك، وإن ركنتَ إلى حال وقفناك معه، وإن ركنتَ إلى معرفة نكرناها عليك\n فأي حيلة لك أيها العبد، فكن لنا عبدًا أكن لك ربًّا \" \n\nأو كما قال\n وإليه الإشارة بقوله: { إنما إلهكم الله\n\n\n } الآية\n ثمَّ ذكر نبيه عليه الصلاة والسلام بنعمة اطلاعه على هذه القصص البديعة\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:130",
      "similarity": 0.6397778093492134
    },
    {
      "verse": "6:80",
      "similarity": 0.5435381577168616
    },
    {
      "verse": "29:56",
      "similarity": 0.5268350697339921
    },
    {
      "verse": "6:147",
      "similarity": 0.47873765987348293
    },
    {
      "verse": "39:10",
      "similarity": 0.4312000414144643
    }
  ]
}