{
  "chapter": "طه",
  "text": "وهل اتىك حديث موسى",
  "translations": [
    {
      "translation": "Has the story of Musa not reached you?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the story of Moses come to you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the story of Moses reached you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), have you heard the story of Moses?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And did the news of Moosa reach you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has there come to you the story of Musa\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has the story of Musa come to you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou received the story of Moses?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath there come unto thee the story of Moses?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you heard the story of Moses?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath there come unto thee the story of Musa?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did the story of Moses come to you,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the story of Moses reached thee?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has there come to you the story of Musa (Moses)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the story of Moses reached you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the story of Moses reached you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has the story of Moses reached you? -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:9] Has the story of Moses — indeed, it has — come to you?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hath there come unto thee) it had not come to you before, Muhammad, but has now, (the story of Moses) the event of Moses?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال القشيري: أجرى الله سنته في كتابه أن يذكر قصة موسى في أكثر المواضع التي يذكر فيها حديث نبينا - عليه الصلاة والسلام - يتبعه بذكر موسى، تنبيهًا على علو شأنه، لأنه كما أن التخصيص بالذكر يدل على شرف المذكور، فالتكرير في التفصيل يوجب التفضيل، في الوصف لأن القضية الواحدة إذا أعيدت مرارًا كثيرة كانت في باب البلاغة أتم، ولا سيما في كل مرة فائدة زائدة\n هـ\n قلت: ولعل وجه تناسقهما في الذكر قرب المنزلة، ومشاركة الصفة، وذلك باعتبار المعالجة وهداية الأمة، فإن أمة موسى عليه السلام كانت انتشرت فلم يقع لنبي هداية على يديه لقومه مثله، إلا لنبينا - عليه أفضل الصلاة وأزكى التسليم - فإن أمته انتشرت وشاعت مسير الشمس والقمر، وفي حديث البخاري ما يدل على هذا، حين عرضت عليه الأمم صلى الله عليه وسلم مرة، فرأى أمة موسى عليه السلام كثيرة، ثم رأى أمته قد سدت الأفق\n فانظر لفظه فيه\n وقال أبو السعود: المناسبة إنما هي تقرير أمر التوحيد الذي إليه انتهى مَسَاق الحديث، وبيان أنه مستمر فيما بين الأنبياء، كابرًا عن كابر، وقد خوطب به موسى عليه السلام، حيث قيل له: { إِنني أنا الله لا إِله إِلا أنا فاعبدني } ، وبه ختم عليه السلام مقاله، حيث قال:\n\n[طه: 98]، ثم ردَّ مناسبة التسلية بأن مساق النظم الكريم إنما هو لصرفه عليه السلام عن اقتحام المشاق\n فانظره\n و { هل }: لفظة استفهام، والمراد به التشويق لما يخبره به، أو التنبيه\n و { إذ رأى }: ظرف للحديث لأن فيه معنى الفعل، أو لمضمر مؤخر، أي: حين رأى كان كيت وكيت، أو: لاذكر، أي: اذكر وقت رؤيته\n\n\n الخ\n يقول الحقّ جلّ جلاله: { وهل أتاك حديثُ موسى }: أي: قصته في معالجة فرعون، فإنا سنذكرها لك تسلية وتقريرًا لأمر التوحيد، { إِذْ راى نارًا } تلمع في الوادي، وذلك أنه عليه السلام استأذن شعيبًا عليه السلام في الخروج إلى أمه وأخيه، فخرج بأهله، وأخذ على غير الطريق، مخافةً من ملوك الشام، فلما وافى وادي طُوى، وهو بالجانب الغربي من الطور، وُلد له ولد في ليلة مظلمة شاتية مثلجة، وكانت ليلة الجمعة، وقد ضل عن الطريق، وتفرقت ماشيته، ولا ماء عنده، فقدحَ النار فلم تُورِ المِقْدَحة",
      "translations": []
    }
  ]
}