{
  "chapter": "طه",
  "text": "ولقد قال لهم هرون من قبل يقوم انما فتنتم به وان ربكم الرحمن فاتبعونى واطيعوا۟ امرى",
  "translations": [
    {
      "translation": "Aaron had indeed told them earlier: \"O my people, you are being only misled with this. Surely your Lord is Ar-Rahman. So follow me and obey my command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Aaron had said to them even before (the return of Moses): \"My people, you were fallen into error because of the calf. Surely your Lord is Most Compassionate; so follow me and obey my command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron had told them before, \"My people, you are deceived by the calf. Your Lord is the Beneficent God. Follow me and obey my orders\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And undoubtedly Haroon had told them before it that, “O my people – you have needlessly fallen into trial because of this; and indeed your Lord is the Most Gracious, therefore follow me and obey my command.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Harun indeed had said to them beforehand: \"O my people! You are being tried in this, and verily, your Lord is (Allah) the Most Gracious, so follow me and obey my order.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly Haroun had said to them before: O my people! you are only tried by it, and surely your Lord is the Beneficent Allah, therefore follow me and obey my order.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet Aaron had aforetime said to them, 'My people, you have been tempted by this thing, no more; surety your Lord is the All-merciful; therefore follow me, and obey my commandment!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Aaron indeed had told them beforehand: O my people! Ye are but being seduced therewith, for lo! your Lord is the Beneficent, so follow me and obey my order.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron had already told them, \"O my people! You are only being tested by this. Your Lord is the All Merciful, so follow me and obey my command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly Harun had said unto them afore: O my people! ye are only being tempted thereby; and verily your Lord is the Compassionate; so follow me and obey my command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron had certainly told them earlier, ‘O my people! You are only being tested by it. Indeed your Lord is the All-beneficent. So follow me and obey my command!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron had already, before this said to them: \"O my people! ye are being tested in this: for verily your Lord is (Allah) Most Gracious; so follow me and obey my command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Harun (Aaron) indeed had said to them beforehand: \"O my people! You are being tried in this, and verily, your Lord is (Allah) the Most Beneficent, so follow me and obey my order.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron had said to them before: 'My nation, you have been tempted by it. Your Lord is the Merciful. Follow me and obey my order'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron had said to them before, “O my people, you are being tested by this. And your Lord is the Merciful, so follow me, and obey my command.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Aaron had already told them before [the return of Moses], \"O my people, you are only being tested by it, and indeed, your Lord is the Most Merciful, so follow me and obey my order.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:90] And Aaron had certainly said to them beforehand, that is, before the return of Moses, ‘O my people, you are only being tested thereby! But truly your Lord is the Compassionate One, so follow me, in worship of Him, and obey my command’, therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Aaron indeed had told them beforehand) before the return of Moses (pbuh) to them: (0 my people! Ye are but being seduced therewith) you have been tried with the lowing sound and the worship of the calf, (for lo! your Lord is the Beneficent, so follow me) regarding His religion (and obey my order) obey my saying and advice.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَقَدْ قَالَ لَهُمْ هَارُونُ مِن قَبْلُ } أي: قبل رجوع موسى إليهم نيابة عنه إصلاحاً لحالهم، بعدما أفسدوا على أنفسهم ما أمرهم موسى من الأصلاح بحالهم: { يٰقَوْمِ } المائلين عن طريق الحق بسبب هذه الصورة { إِنَّمَا فُتِنتُمْ بِهِ } أي: ما هذا إلا ابتلاءُ لهم من ربكم؛ ليختبر سبحانه رسوخكم وتمكنكم على التوحيد، أعرِضوا عن الشرك بالهل وتوجهوا إليه { وَإِنَّ رَبَّكُمُ ٱلرَّحْمَـٰنُ } لكم بإرسال أخي إليكم رسولاً وإنجائكم من عدوكم، وأنا نائب عن أخي استخلفني عليكم { فَٱتَّبِعُونِي } لتتبعوا الحق، ولا تميلوا إلى الباطل { وَأَطِيعُوۤاْ أَمْرِي } [طه: 90] واقبلا قولي وإرشادي لكم حتى يصلح حالكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولقد قال لهم هارونُ من قبلُ } أي: والله لقد نصحهم هارون ونبههم على الحق، من قبل رجوع موسى عليه السلام إليهم، وقال لهم: { يا قوم إِنما فُتنتم به } أي: وقعتم في الفتنة بالعِجْل أو ضللتم به، والمعنى: إنما فعل بكم الفتنة، لا الإرشاد إلى الحق، { وإِنَّ ربكم الرحمنُ } وحده، لا العِجْل، أرشدهم إلى الحق بعد أن زجرهم عن الباطل\n والتعرض لعنوان الرحمانية للاعتناء باستمالتهم إلى الحق المُفضي إلى الرحمة الشاملة، أي: إن ربكم الذي يستحق أن يُعبد هو الرحمن لا غير\n { فاتبعوني } على الثبات على الدين، { وأطيعوا أمري } من ترك عبادة ما علمتم شأنه",
      "translations": []
    }
  ]
}