{
  "chapter": "طه",
  "text": "قال يبنؤم لا تاخذ بلحيتى ولا براسى انى خشيت ان تقول فرقت بين بنى اسرءيل ولم ترقب قولى",
  "translations": [
    {
      "translation": "He said, 'Son of my mother! Do not seize me by the beard or by the hair. I was afraid that you would say, \"You have caused division in the tribe of Israel and taken no notice to anything I said.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O son of my mother,\" (Aaron cried), do not pull me by my beard or my hair! I was really afraid you may say that I had created a rift among the children of Israel, and did not pay heed to your command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron answered: \"Son of my mother! Do not seize me with my beard, nor by (the hair of) my head. I feared that on returning you might say: 'You sowed discord among the Children of Israel, and did not pay heed to my words.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron replied, \"Son of my mother, do not seize me by my beard or head. I was afraid that you might consider me responsible for causing discord among the children of Israel and would not pay attention to my words.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O son of my mother, do not clutch my beard nor the hair on my head; I feared that you may say, ‘You have caused a division among the Descendants of Israel and did not wait for my advice.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Harun) said: \"O son of my mother! Seize (me) not by my beard, nor by my head! Verily, I feared lest you should say: `You have caused a division among the Children of Israel, and you have not respected my word!\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O son of my mother! seize me not by my beard nor by my head; surely I was afraid lest you should say: You have caused a division among the children of Israel and not waited for my word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Son of my mother,' Aaron said, 'take me not by the beard, or the head! I was fearful that thou wouldst say, \"Thou hast divided the Children of Israel, and thou hast not observed my word.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O son of my mother! Clutch not my beard nor my head! I feared lest thou shouldst say: Thou hast caused division among the Children of Israel, and hast not waited for my word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aaron said, \"Son of my mother! Do not seize me by my beard nor by my head. I was afraid that you would say, 'You have caused dissension among the Children of Israel and did not pay heed to my words.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Harun said: O my mother's son! hold me not by my beard nor by my head verily feared that thou wouldst say, thou hast caused a division among the Children of Israel and hast not guarded my Word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘O son of my mother! Do not grab my beard or my head! I feared lest you should say, ‘‘You have caused a rift among the Children of Israel and did not heed my word [of advice].’’’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Aaron) replied: \"O son of my mother! Seize (me) not by my beard nor by (the hair of) my head! Truly I feared lest thou shouldst say, 'Thou has caused a division among the children of Israel, and thou didst not respect my word!'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Harun (Aaron)] said: \"O son of my mother! Seize (me) not by my beard, nor by my head! Verily, I feared lest you should say: 'You have caused a division among the Children of Israel, and you have not respected my word!' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Son of my mother' he replied, 'Do not seize my beard nor my head. I was afraid that you might say: \"You have divided the Children of Israel and did not uphold my word.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Son of my mother, do not seize me by my beard or my head. I feared you would say, `You have caused division among the Children of Israel, and did not regard my word.'“\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Aaron] said, \"O son of my mother, do not seize [me] by my beard or by my head. Indeed, I feared that you would say, 'You caused division among the Children of Israel, and you did not observe [or await] my word.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:94] He, Aaron, said, ‘O son of my mother (read ya’bna’ummi or ya’bna’umma, meaning ummī, ‘my mother’) the mention of her is more effective in provoking the affection of his heart — do not clutch my beard, which he had seized with his left hand, or my head!, for he had seized his hair with his right hand in anger. Indeed I feared that, if I followed you, for inevitably a group of those who did not worship the calf would have followed me, you would have said, “You have caused division among the Children of Israel — and have been furious with me — and you did not wait for my word”’, concerning what my opinion would have been in this matter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Aaron said to Moses: (0 son of my mother) he mentioned their mother so that he be kind and compassionate with him! (Clutch not my beard nor my head) nor my hair! (I feared lest thou shouldst say: Thou hast caused division among the Children of Israel) if I had killed them, (and hast not waited for my word) and did not wait until I come back. This is why I refrained from fighting them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } له حينئذ هارون قولاً يحرك مقتضى الأخوة\n وينبه على قبول العذر: { يَبْنَؤُمَّ } نسبه إلى الأم استعطافاً: احذر عن الغضب وتوجه إليَّ واسمع عذري { لاَ تَأْخُذْ بِلِحْيَتِي وَلاَ بِرَأْسِي } ما لم تسمع عذري\n لم أترك قتالهم { إِنِّي } وإن كنت لا أقدر على قتالهم لكثرتهم { خَشِيتُ } مع ذلك إن قاتلت معهم { أَن تَقُولَ فَرَّقْتَ بَيْنَ بَنِيۤ إِسْرَآءِيلَ } أي: جعلتهم فرقاً متخالفة متقابلة { وَلَمْ تَرْقُبْ } ولم تحفظ { قَوْلِي } [طه: 94] لك: اخلفني في قومي\n وأصلح بينهم حتى أرجع\n\nفلما سمع موسى عذره\n ندم على فعله\n فرجع إلى معاتبة من يضلهم و { قَالَ فَمَا خَطْبُكَ } أي: أي شيء هو أعظم مقصودك من هذه التفرقة والإضلال { يٰسَامِرِيُّ } [طه: 95] المضل\n\n\n{ قَالَ } مقصودي الرئاسة عليهم بشيء يميزني عنهم من الخوارق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:279",
      "similarity": 0.09029536372795934
    },
    {
      "verse": "37:65",
      "similarity": 0.08604035791329193
    },
    {
      "verse": "44:59",
      "similarity": 0.08041388696382906
    },
    {
      "verse": "11:93",
      "similarity": 0.07941935038981754
    },
    {
      "verse": "28:21",
      "similarity": 0.07850985588141526
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/20:94.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/20:94.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:94.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}