{
  "chapter": "طه",
  "text": "قال بصرت بما لم يبصروا۟ به فقبضت قبضة من اثر الرسول فنبذتها وكذلك سولت لى نفسى",
  "translations": [
    {
      "translation": "He said, 'I saw what they did not see. So I gathered up a handful from the Messenger's footprints and threw it in. That is what my inner self urged me to do.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"I saw what they did not see. I picked up a handful of dust from the messenger's tracks and threw it in, for the idea seemed attractive to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answered: \"I saw what the people did not see. So I took a handful of dust from the trail of the Messenger, and I flung it (into the fire). Thus did my mind prompt me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"I had the skill (of carving) which they did not have. I followed some of the Messengers's (Moses) tradition, but I then ignored it. Thus, my soul prompted me (to carve a golden calf with an artificial hollow sound).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I witnessed what the people did not witness – I therefore took a handful from the tracks* of the angel, then threw it** – and this is what seemed pleasing to my soul.” (* The marks left behind by the mount of Angel Jibreel. ** Into the mouth of the calf.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Samiri) said: \"I saw what they saw not, so I took a (Qabdah) handful (of dust) from the (hoof) print of the messenger and threw it. Thus my inner self suggested to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I saw (Jibreel) what they did not see, so I took a handful (of the dust) from the footsteps of the messenger, then I threw it in the casting; thus did my soul commend to me\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I beheld what they beheld not,' he said, 'and I seized a handful of dust from the messenger's track, and cast it into the thing. So my soul prompted me.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: I perceived what they perceive not, so I seized a handful from the footsteps of the messenger, and then threw it in. Thus my soul commended to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"I perceived what they did not see. So I took a handful [of dust] from the footprint of the Messenger and threw it in [the calf]. That is what my inner self prompted me to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: l saw that which they saw not; so I seized a handful from the footstep of the messenger, and then cast it; Thus my soul embellished the affair to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘I saw what they did not see. I took a handful [of dust] from the messenger’s trail and threw it. That is how my soul prompted me.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: \"I saw what they saw not: so I took a handful (of dust) from the footprint of the Messenger, and threw it (into the calf): thus did my soul suggest to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Samiri) said: \"I saw what they saw not, so I took a handful (of dust) from the hoof print of the messenger [Jibrael's (Gabriel) horse] and threw it [into the fire in which were put the ornaments of the Fir'aun's (Pharaoh) people, or into the calf]. Thus my inner-self suggested to me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'I saw what they did not see and seized a handful of dust from the foot print of the messenger and so I cast it this my soul prompted me to do'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “I saw what they did not see, so I grasped a handful from the Messenger’s traces, and I flung it away. Thus my soul prompted me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"I saw what they did not see, so I took a handful [of dust] from the track of the messenger and threw it, and thus did my soul entice me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:96]   He said, ‘I perceived what they did not perceive (read [either as third person plural] yabsurū or [as second person plural] tabsurū ‘[what] you [did not] perceive’), in other words, I realised what they did not realise, so I seized a handful, of dust, from the track of, [from] the hoof of the steed of, the messenger, Gabriel, and threw it [in], I cast it onto the figure of the calf that had been fashioned. Thus my soul prompted, [thus] it adorned for, me’ and it was cast into me [the idea] that I seize a handful of the dust from that mentioned [hoof] and cast it onto what possessed no spirit, so that it might [thus] acquire a spirit. I had seen that your people had asked that you make for them a god, and so my soul suggested to me [the idea] that this calf should be their god.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) al-Samiri said: (I perceived what they perceive not) I saw what the children of Israel did not see. Moses asked him: and what did you see that they did not? He said: I saw Gabriel riding a female horse, Balqa', the beast of life, (so I seized a handful from the footsteps of the messenger) from the dust upon which Gabriel's horse stepped on, (and then threw it in) and threw it in the calf's mouth and behind. (Thus my soul commended to me) thus did my soul entice me to do.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَصُرْتُ بِمَا لَمْ يَبْصُرُواْ بِهِ } معناه عَلِمتُ بمَا لَم يَعْلَمُوا\n\n\n\n\nوقوله تعالى: { فَقَبَضْتُ قَبْضَةً } يعني فأَخذتُ بملءِ كَفّي\n ويقالُ قَبَضْتُ معناهُ تَناولتُ بأَطرافِ أَصابِعي\n\n\n\n\nوقوله تعالى: { سَوَّلَتْ لِي نَفْسِي } معناه زَيّنتْ لِي\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"I have seen what you have not seen\" - I have come to know what they have not known.\n\n\nAnd His saying, {So I seized the grasp}, meaning that I took hold of it completely.\n\n\nThis is translated to mean that I have taken hold of it with my fingers.\n\n\nAnd His saying, \"My self has been made beautiful for me,\" means that He has made it adorned for me.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { بَصُرْتُ بِمَا } أي: بشيء { لَمْ يَبْصُرُواْ بِهِ } أصلاً\n وذلك أني رأيت جبريل راكباً على فرس الحياة\n ما وضع قدمه على شيء إلا حيي { فَقَبَضْتُ قَبْضَةً مِّنْ أَثَرِ ٱلرَّسُولِ } أي: من تراب وطئها حافر فرس الرسول الذي هو جبريل\n وكنت أحفظها إلى أن أذابوا حليهم { فَنَبَذْتُهَا } فيه\n فسرى الحياة منها إلى الصورة المتخذة من الحلي فخار\n فأمرتهم باتخاذها إلهاً { وَكَذٰلِكَ سَوَّلَتْ } وزينت { لِي نَفْسِي } [طه: 96] حتى أكون متبوعاً لهم\n ومقتدى بينهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } السامري في جوابه: { بَصُرْتُ بما لم يَبْصُرُوا به } أي: علمت ما لم يعلمه القوم\n وفطِنت لما لم يفطنوا به\n أو رأيتُ ما لم يروه\n وهذا أنسب\n وقد كان رأى جبريل عليه السلام\n جاء راكبًا فرسًا\n وكان كلما رفع الفرسُ يده أو رجله عن الطريق اليبس\n اخضر ما تحت قدمه بالنبات\n فعرف أن له شأنًا\n فأخذ من موطئه شيئًا من التراب\n وذلك قوله تعالى: { فقبضتُ قبضةً من أَثَرِ الرسولِ } أي: أثر فرس الرسول\n وهو جبريل\n الذي أرسل إليك ليذهب بك إلى الطور\n وقال في اللباب: كان السامري من المقربين لموسى عليه السلام\n فرأى جبريلَ راكبًا على فرس\n وقد دخل البحر فانفلق\n فأخذ من أثره\n ولم ير ذلك إلا من كان مع موسى\n هـ\n وقال قتادة: كان السامري عظيمًا في بني إسرائيل\n من قبيلة يقال لها: سامرة\n ولكن عدو الله نافق\n بعدما قطع البحرَ مع بني إسرائيل\n فلما مرت بنو إسرائيل بالعمالقة\n وهم يعكفون على أصنام لهم\n وكانوا يعبدون البقر\n\n[الأعرَاف: 138]\n فاغتنمها السامري فاتخذ العجل\n هـ\n وقال الكواشي: وإنما عرف السامريُّ جبريلَ من بين سائر الناس لأن أمه ولدته في السنة التي يُقتل فيها الغلمان\n فوضعته في كهف حذرًا عليه\n فبعث الله تعالى جبريل ليربيه لِمَا قضى على يديه من الفتنة\n هـ\n وضعّفه ابن عطية\n قلت: ولعل تضعيفه من جهة النقل\n وأما القدرة فهي صالحةَ ليقضي الله أمرًا كان مفعولاً\n ثم قال: فأخذت تلك القبضة { فنبذتُها } في فم تلك الصورة المذابة من الحُليّ\n فصارت تخور\n { وكذلك سَوَّلَتْ لي نفسي } أي: زينت\n والإشارة: نعت لمصدر محذوف\n أي: سَوَّلَتْ لي نفسي تسويلاً كائنًا مثل ذلك التسويل البديع\n وحاصل جوابه: أن ما فعله إنما صدر منه بمحض اتباع هوى النفس الأمارة وإغوائها\n لا لشيء آخر من البرهان العقلي أو الإلهام الإلهي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:83",
      "similarity": 0.525993452471071
    },
    {
      "verse": "47:25",
      "similarity": 0.515468935400687
    },
    {
      "verse": "25:46",
      "similarity": 0.3962981758418981
    },
    {
      "verse": "12:18",
      "similarity": 0.37832037288846915
    },
    {
      "verse": "9:67",
      "similarity": 0.3445418204775464
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/20:96.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/20:96.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:96.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}