{
  "chapter": "طه",
  "text": "كذلك نقص عليك من انۢباء ما قد سبق وقد ءاتينك من لدنا ذكرا",
  "translations": [
    {
      "translation": "In this way We give you news of what has gone before and We have given you a reminder direct from Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We narrate some account to you of what has gone before, and We have truly given you a Reminder of Our own.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), thus do We recount to you the events of the past, and We have bestowed upon you from Ourself an admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We tell you, (Muhammad), the stories of the past and We have given you the Quran.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is how We relate the former tidings to you (O dear Prophet Mohammed – peace and blessings be upon him); and We have given you a Remembrance* from Ourselves. (*The Holy Qur’an.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We relate to you some information of what happened before. And indeed We have given you from Us a Reminder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We relate to you (some) of the news of what has gone before; and indeed We have given to you a Reminder from Ourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We relate to thee stories of what has gone before, and We have given thee a remembrance from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus relate We unto thee (Muhammad) some tidings of that which happened of old, and We have given thee from Our presence a reminder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We relate to you the history of past events, and We have given you a reminder [the Quran] from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We recount unto thee some tidings of that which hath preceded; and surely We have vouchsafed unto thee from before Us an admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We relate to you some accounts of what is past. Certainly, We have given you a Reminder from Ourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We relate to thee some stories of what happened before: for We have sent thee a Message from Our own Presence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We relate to you (O Muhammad SAW) some information of what happened before. And indeed We have given you from Us a Reminder (this Quran).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so We narrate to you the stories of the past, and We have given you a remembrance from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We narrate to you reports of times gone by; and We have given you a message from Our Presence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, [O Muhammad], We relate to you from the news of what has preceded. And We have certainly given you from Us the Qur'an.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[20:99] Thus, just as We have related to you O Muhammad (s) this story, We relate to you some stories, [some] accounts, of what is past, of communities, and We have given you from Ourselves a Reminder, a Qur’ān.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكَذَلِكَ نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ مَا قَدْ سَبَقَ وَقَدْ آَتَيْنَاكَ مِنْ لَدُنَّا ذِكْرًا (99) جملة مستأنفة تذييلية أفادت التنويه بقصّة رسالة موسى وما عقبها من الأعمال التي جرت مع بني إسرائيل ابتداء من قوله { وهل أتاك حديث موسى إذ رأى ناراً } \\[ طه : 9 ، 10 \\] ، أي مثل هذا القصص نقصّ عليك من أنباء القرون الماضية . والإشارة راجعة إلى القصة المذكورة .والمراد بقوله { نَقُصُّ } قَصصنا ، وإنما صيغ المضارع لاستحضار الحالة الحسنة في ذلك القصص .والتشبيه راجع إلى تشبيهها بنفسها كناية عن كونها إذا أريد تشبيهها وتقريبها بما هو أعرف منها في بابها لم يجد مُريد ذلك طريقاً لنفسه في التشبيه إلا أن يشبهها بنفسها ، لأنها لا يفوقها غيرها في بابها حتى تقرَّب به ، على نحو ما تقدم في قوله تعالى : { وكذلك جعلناكم أمة وسطاً } في سورة البقرة ( 143 ) ، ونظائره كثيرة في القرآن .و ( مِن ) في قوله مِنْ أنْبَاءِ ما قَدْ سَبَقَ } تبعيضية ، هي صفة لمحذوف تقديره : قصصاً من أنباء ما قد سبق . ولك أن تجعل ( من ) اسماً بمعنى بعض ، فتكون مفعول { نقصّ .والأنباء : الأخبار . و ( ما ) الموصولة ما صدقها الأزمان ، لأنّ الأخبار تضاف إلى أزمانها ، كقولهم : أخبار أيام العرب ، والقرون الوسطى . وهي كلها من حقها في الموصولية أن تعرف ب ( ما ) الغالبة في غير العاقل . ومعلوم أن المقصود ما فيها من أحوال الأمم ، فلو عرفت ب ( مَن ) الغالبة في العقلاء لصح ذلك وكل ذلك واسع . وقوله وقَدْ ءاتيناك مِن لَّدُنَّا ذِكْراً } إيماء إلى أن ما يقص من أخبار الأمم ليس المقصود به قطْع حصة الزمان ولا إيناس السامعين بالحديث إنما المقصود منه العبرة والتذكرة وإيقاظ لبصائر المشركين من العرب إلى موضع الاعتبار من هذه القصة\n\n",
      "translations": [
        {
          "translation": "(Thus relate Who unto thee) in this way we sent you, Muhammad, Gabriel with (some tidings of that which happened of old) with the events of past nations, (and We have given thee from Our presence a Reminder) We have honoured you with the Qur'an which contains the events of past and future generations.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَذٰلِكَ نَقُصُّ عَلَيْكَ } معناه نُخبِرُ\n و: { مِنْ أَنْبَآءِ مَا قَدْ سَبَقَ } أَي قَد مَضَى\n\n",
      "translations": [
        {
          "translation": " And His saying, \"Thus do We detail the signs for you\" - its meaning is that We inform [you].\n And {of the news of what has passed before} that is, what has passed",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n مقرّة بربوبيته بقدر ما أعطاها من معرفته: مثل ذلك القصص { نقص عليك من أنباء ما قد سبق } من أحوال السالكين الذي سبقوا\n ومقاماتهم لتثبيت فؤادك وتمكينك في مقام الاستقامة كما أُمرت { وقد آتيناك من لدنا ذِكْرَاً } أي: ذِكْراً ما أعظمه وهو: ذكر الذات الذي يشمل مراتب التوحيد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَذٰلِكَ } أي: مثلما أوحينا إلى موسى لأهداء قومه وإهلاك عدوه\n وأوحينا إليكَ يا أكمل الرسل قصص السابقين\n ليعتبر من هلاك عدوهم من عاداك\n ويفرح من إهداء صديقهم مَن صدّقك وآمن بك\n إذ { نَقُصُّ عَلَيْكَ } قصصهم مع كونك خالي الذهن { مِنْ أَنْبَآءِ مَا قَدْ سَبَقَ } بمدة مديدة { وَقَدْ آتَيْنَاكَ } امتناناً لك { مِن لَّدُنَّا } بلا واسطة معلم ومرشد { ذِكْراً } [طه: 99] كلاماً جامعاً يذكرك جميع ما في الكتب السالفة من الحقائق والأحكام والقصص على الوجه الأثم الأبلغ\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ كَذَلِكَ نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ مَا قَدْ سَبَقَ\n\n\n }  قلت: محل الكاف: نصب على أنه نعت لمصدر محذوف\n أي: نقص عليك قصًا مثل ذلك القص المارّ\n وما في الإشارة من معنى البُعد للإيذان بعلو درجته - عليه الصلاة والسلام - وبُعد منزلته في الفضل\n و { من أنباء }: في محل النصب\n إما على أنه مفعول { نقُصّ } باعتبار معناه\n أي: نقص عليك بعض أنباء\n وإما على أنه متعلق بمحذوف صفة للمفعول\n أي: نقص عليك خبرًا كائنًا من أخبار ما قد سبق\n يقول الحقّ جلّ جلاله: { كذلك } أي: مثل ذلك القصص البديع الذي سمعته { نقصُّ عليك من أنباء ما قد سبق } أي: من أخبار الأمم الماضية والقرون الخالية ليكون تبصرة لك\n وزيادة في علمك\n وتذكيرًا لغيرك\n وعبرة لمن يقف عليه ممن يأتي بعدك\n والله تعالى أعلم\n الإشارة: حكايات الصالحين وسِيَر العارفين جند من جنود القلب\n فيها تنشيط لمن يريد اللحوق بهم\n وتشويق لمقاماتهم\n وتسلية لمن يُصاب في ذات الله بمثل ما أصابهم\n وبالله التوفيق\n ثم ذكر وعيد مَن أعرض عن القرآن المشتمل على هذه الأنباء الحسان\n فقال: {\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:67",
      "similarity": 0.5337495690735902
    },
    {
      "verse": "18:65",
      "similarity": 0.5224511717004438
    },
    {
      "verse": "27:6",
      "similarity": 0.5050292589538268
    },
    {
      "verse": "11:1",
      "similarity": 0.44568498950023955
    },
    {
      "verse": "17:80",
      "similarity": 0.44348631638628305
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/020099.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/020099.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/20:99.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}