{
  "chapter": "الأنبياء",
  "text": "ولقد كتبنا فى الزبور منۢ بعد الذكر ان الارض يرثها عبادى الصلحون",
  "translations": [
    {
      "translation": "We had prescribed in the Book of Psalms after the reminder and admonition, that those of Our creatures who are good will in the end rule the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We wrote in the Psalms, after the exhortation, that the earth shall be inherited by My righteous servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have written in the psalms which We had revealed after the Torah that the earth will be given to Our righteous servants as their inheritance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We wrote, after the reminder in the Zaboor that, “My virtuous bondmen will inherit the earth.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have written in Az-Zabur after Adh-Dhikr that My righteous servants shall inherit the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We wrote in the Book after the reminder that (as for) the land, My righteous servants shall inherit it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For We have written in the Psalms, after the Remembrance, 'The earth shall be the inheritance of My righteous servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily we have written in the Scripture, after the Reminder: My righteous slaves will inherit the earth:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have already written in the Psalms following the Reminder, \"My righteous servants shall inherit the earth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have prescribed in the Scripture after the admonition, that: the land! there shall inherit it My bondmen righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We wrote in the Psalms, after the Torah: ‘Indeed My righteous servants shall inherit the earth.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before this We wrote in the Psalms, after the Message (given to Moses): My servants the righteous, shall inherit the earth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have written in Zabur (Psalms) [i.e. all the revealed Holy Books the Taurat (Torah), the Injeel (Gospel), the Quran] after (We have already written in) Al-Lauh Al-Mahfuz (the Book, that is in the heaven with Allah), that My righteous slaves shall inherit the land (i.e. the land of Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have written in the Psalms, after the Remembrance: 'The righteous among My worshipers shall inherit the earth'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have written in the Psalms, after the Reminder, that the earth will be inherited by My righteous servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have already written in the book [of Psalms] after the [previous] mention that the land [of Paradise] is inherited by My righteous servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:105] Certainly We wrote in the Scripture, (al-zabūr) means ‘the Book’, that is, the revealed Books of God, after the Remembrance, meaning the Mother of the Book (umm al-kitāb), which is [kept] with God: ‘Indeed the land, the land of Paradise, shall be inherited by My righteous servants’ — [this promise] applies to all righteous ones.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We have written in the Scripture) in the Psalm of David, (after the Reminder) after the Torah; it is also said that this means: and We wrote in the Psalms and the Scriptures of the prophets after writing in the Guarded Tablet: (My righteous slaves) those who profess Allah's divine oneness (will inherit the earth) the earth of Paradise; and it is said: the righteous slaves from among the Children of Israel will dwell in the Holy Land; as it is said: it is the righteous slaves of the end of time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ كَتَبْنَا فِي ٱلزَّبُورِ مِن بَعْدِ ٱلذِّكْرِ } قال: الزَّبورُ زَبورُ دَاودَ\n ويقالُ: القُرآنُ\n والذِّكرُ: التَوراةُ\n ويقالُ الذِّكرُ: الذي نُسِخَتْ منهُ الكُتُبُ\n\n\n\n\nوقوله تعالى: { أَنَّ ٱلأَرْضَ يَرِثُهَا عِبَادِيَ ٱلصَّالِحُونَ } معناه: أرضُ الجَنةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف نفنيه ولا نعدمه { لَقَدْ كَتَبْنَا } وأثبتنا { فِي ٱلزَّبُورِ } وفي جميع الكتب المنزلة منَّا { مِن بَعْدِ ٱلذِّكْرِ } أي: بعد الحضور والثبوت في حضرة علمنا ولوح قضائنا: { أَنَّ ٱلأَرْضَ } أي: أرض الجنة المعدَّة لأهل الولاء والمحبة، ومستقر أرباب العناية؛ إذ لكل نفس من النفوس البشرية أرضُ معدة من فضاء الجنة، وإنما وصلوا إليها بالإيمان والأعمال الصالحة المقربة إلى الحق، فمتى لم يتصفوا بالإيمان والمعارف والتوحيد لم يصلوا إليها؛ وإذا لم يصلوا إليها بكفرهم وعنادهم وظلمهم { يَرِثُهَا } من الكفار أماكنهم المعدة لهم فيها { عِبَادِيَ ٱلصَّالِحُونَ } [الأنبياء:105] المقبولون عندنا، المتصفون بشعائر التوحيد والإيمان، والعارفون بمعالم الدين ومسالك العرفان، المرضيون الراضون بجميع ما جرى عليهم من قضائنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولقد كتبنا في الزَّبور } كتاب داود عليه السلام، { من بعْدِ الذِّكْرِ }: التوراة، أو اللوح المحفوظ، { أنَّ الأرض } أي: جنس الأرض، يعني: مشارقها ومغاربها، { يرثُها عبادي الصالحون } وهم أمة نبينا محمد صلى الله عليه وسلم، ففي الآية ثناء عليهم وبشارة لهم، وإخبار بظهور غيب تحقق ظهوره في الوجود مِن فَتْح الله على هذه الأمة مشارقَ الأرض ومغاربها، كقوله:\n\n[النُّور: 55]\n وقال القشيري: على قوله: { عبادي الصالحون }: هم أمة محمد - عليه الصلاة والسلام - وهم بجملتهم قوم صالحون لنعمته، وهم المطيعون، وآخرون صالحون لرحمته وهم العاصون\n هـ\n قال في الحاشية الفاسية: والظاهر أن حديث:\n\n \" لا تزال طائفة من أمتي ظاهرين على الحق، لا يضرهم من خالفهم حتى يأتي أمر الله \" \n\n، مفسر للآية، وموافق لوعدها\n قيل: وهذه الطائفة مُفْتَرَقَةً من أنواع المؤمنين، ممن فيه عائدة على الدين ونفع له من شجعان مقاتلين، وفقهاء ومحدِّثين، وزهاد وصالحين، وناهين وآمرين بالمعروف\n هـ\n قلت: وعارفين متمكنين، علماء بالله ربانيين\n ثم قال: وغير ذلك من أنواع أهل الحسنى، ولا يلزم اجتماعهم، بل يكونون متفرقين في أقطار\n هـ\n قلت \": وفيه نظر لأن مراد الآية الأمة كلها، كما قال القشيري، ومراد الحديث بعضها، فلا يليق أن يكون تفسيرًا لها، وهي أعم منه\n وقيل: المراد بالأرض: أرض الشام، وقيل: أرض الجنة",
      "translations": []
    }
  ]
}