{
  "chapter": "الأنبياء",
  "text": "لهم فيها زفير وهم فيها لا يسمعون",
  "translations": [
    {
      "translation": "There will be sighing for them in it and they will not be able to hear.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will only be groaning for them, and they will not hear any thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they shall groan with anguish and the din and noise in Hell will not let them hear anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will groan in pain therein, but no one will listen to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will bray in it and not be able to hear anything in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein they will be breathing out with deep sighs and roaring and therein they will hear not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them therein shall be groaning and therein they shall not hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there shall be sighing for them therein, and naught they shall hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein wailing is their portion, and therein they hear not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall groan. They will not hear therein anything else.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Theirs therein shall be roaring, and therein they shall hear not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their lot therein will be groaning, and they will not hear anything in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There, sobbing will be their lot, nor will they there hear (aught else).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein breathing out with deep sighs and roaring will be their portion, and therein they will hear not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is groaning for them therein, and they do not hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In it they will wail. In it they will not hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them therein is heavy sighing, and they therein will not hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:100] For them, for the worshippers, there will be groaning therein and they will not hear in it, anything, because of the ferocity with which it boils. When [‘Abd Allāh] Ibn al-Ziba‘rī said, ‘Ezra, Jesus and the angels were worshipped: they must also be in the Fire then, according to what has just been stated’, the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therein) in the Fire (wailing) which resembles the braying of an ass (is their portion, and therein they hear not) the voice of mercy and intercession nor will they hear the sound of exit and comfort nor will they be able to see.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَهُمْ فِيهَا } أي: لأهل النار في النار { زَفِيرٌ } تنفيس شديد\n وأنين طويلِ { وَهُمْ فِيهَا } من شدة الأهوال والأفزاع { لاَ يَسْمَعُونَ } [الأنبياء: 100]\n\n\nثم لما نزلت هذه الآية اعترض ابن الزبعري بأن عزيراً وعيسى والملائكة من المعبودين\n فهم أيضاً في النار\n مع أنهم من الأنبياء والمَلَك\n وهم محفوظون منها على زعمكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لهم فيها زفير } أي: للكفار في النار أنينٌ وبكاء وعويل، { وهم فيها لا يسمعون } شيئًا لأن في سماع بعضهم بعضًا نوع أُنس\n قال ابن مسعود رضي الله عنه: يُجعلون في توابيت من نار، ثم جعلت التوابيت في توابيت أُخَر لها مسامير من نار، فلا يسمعون شيئًا\n رُوِيَ أن النبي صلى الله عليه وسلم دَخَلَ المَسْجِدَ الحَرام، وصَنَادِيدُ قُريشٍ في الحَطِيمِ، وَحَوْلَ الكَعْبَةِ ثلاثمائة وَسِتونَ صَنَمًا، فَجَلَسَ إِلَيْهِمْ، فَعَرَضَ لَهُ النَّضْرُ بْنُ الحَارِثِ، فكلَّمهُ النبي صلى الله عليه وسلم حَتَّى أفْحَمَهُ، ثُمَّ تلا عليه وعليهم: { إِنكم وما تعبدون من دون الله حصب جهنم\n\n\n } الآيات الثلاث\n ثم أقْبَلَ عَبْدُ اللهِ بْنُ الزِبَعْرَى فرآهم يتساهمون، فقال: فيم خوضكم؟ فأخفى الوَلِيدُ ما قاله النبي صلى الله عليه وسلم، ثم أخبره بعضهم بما قاله، عليه الصلاة والسلام، فقال ابن الزبعرى للنبي صلى الله عليه وسلم: أأنت قلت: { إنكم وما تعبدون من دون الله حصب جهنم }؟ قال: نعم، قال: قد خصمتك، ورب الكعبة، أَلَيْست اليَهُودُ تعبد عُزَيرًا، والنصارى تعبد المَسِيحَ، وبَنُو مُلَيْحٍ يعبدون الملائكة؟ فقال النبي صلى الله عليه وسلم:\n\n \" بَلْ هُمْ يَعْبُدُونَ الشياطِينَ الّتي أَمَرَتْهُم بِهذا، فأنزل الله تعالى: { إن الذين سبقت لهم منا الحسنى\n\n\n } \"\n \n\nقلت: كل من عَبَدَ شيئًا من دون الله فإنما عَبَدَ في الحقيقة الشيطان لأنه أمر به وزينه له، ويدل على ذلك أنهم يتبرؤون يوم القيامة، حين تتحقق الحقائق، من عبادتهم، كما قال تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:12",
      "similarity": 0.8574865664529117
    },
    {
      "verse": "11:106",
      "similarity": 0.5202796598538861
    },
    {
      "verse": "8:21",
      "similarity": 0.040223005368456806
    },
    {
      "verse": "21:4",
      "similarity": 0.03969045106273527
    },
    {
      "verse": "8:23",
      "similarity": 0.039124660495040535
    }
  ]
}