{
  "chapter": "الأنبياء",
  "text": "ان فى هذا لبلغا لقوم عبدين",
  "translations": [
    {
      "translation": "Certainly there is a transmission in this for people who worship.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily there is a message in this for people who are devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Herein, surely, is a message for those devoted to worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a lesson for those who worship (God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Qur’an is sufficient for people who are devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in this there is a plain Message for people who worship Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely in this is a message to a people who serve\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in this is a Message delivered unto a people who serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! there is a plain statement for folk who are devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Herein, surely is a message for true worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in this in a preaching for a people who are worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is indeed in this a proclamation for a devout people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in this (Qur'an) is a Message for people who would (truly) worship Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in this (the Quran) there is a plain Message for people who worship Allah (i.e. the true, real believers of Islamic Monotheism who act practically on the Quran and the Sunnah legal ways of the Prophet SAW).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, in this is a proclamation to a worshiping nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, in this is a message for people who worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, in this [Qur'an] is notification for a worshipping people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:106] Indeed there is in this, Qur’ān, a proclamation, sufficient means for [securing] entry into Paradise, for a people who are devout, acting in accordance with [what is stipulated in] it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "361 (Lo! there is) in the Qur'an (a plain statement) sufficiency; it is also said: there is an admonition through the commands and prohibitions (for folk who are devout) for people who declare Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ فِي هَـٰذَا } أي: ما ذكر في القرآن من المواعظ والتذكيرات والرموز والإشارات { لَبَلاَغاً } وتبليغاً بليغاً إلى أقصى مراتب التوحيد { لِّقَوْمٍ عَابِدِينَ } [الأنبياء: 106] عارفين بمسالك اليقين وأماراته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { إِنَّ في هذا } أي: ما ذكر في السورة الكريمة من الأخبار والمواعظ البالغة، والوعد والوعيد، والبراهين القاطعة الدالة على التوحيد وصحة النبوة، { لبلاغًا } أي: كفاية، أو سبب بلوغ إلى البغية، من رضوان الله تعالى، ومحبته، وجزيل ثوابه، فمن تبع القرآن وعمل به، وصل إلى ما يرجو من الثواب العظيم، فالقرآن زادُ الجنة كبلاغ المسافر، فهو بلاغ وزاد { لقومٍ عابدين } أي: لقومٍ همتُهُم العبادة دون العادة\n وبالله التوفيق\n الإشارة: قد أورث الله أرضه وبلاده لأهل التوجه إلى الله، والإقبال عليه\n فوراثة كل أحد على قدر توجهه وإقباله على مولاه\n والمراد بالوراثة: التصرف بالهمة ونفوذ الكلمة في صلاحَ الدين وهداية المخلوقين، وهم على قسمين: قسم يتصرف في ظواهر الخلق بإصلاح ظواهرهم، وهم العلماء الأتقياء، فهم يُبلغون الشرائع والأحكام، لإصلاح نظام الإسلام، وقد تقدم تفصيلهم في سورة التوبة عند قوله تعالى:\n\n[التّوبَة: 122] الخ، وقسم يتصرفون في بواطنهم وهم أهل التصرف العارفون بالله، على اختلاف مراتبهم من غوث وأقطاب وأوتاد، وأبدال، ونجباء، ونقباء، وصالحين، وشيوخ مربين، فهم يُعالجون بواطن الناس بالتربية بالهمة والحال والمقال، حتى يتطهر مَنْ يصحبهم من الرذائل، ويتحلى بأنواع الفضائل، فيتأهل لحضرة القدس ومحل الأنس\n وهؤلاء حازوا الوراثة النبوية كلها، كما قال ابن البنا في مباحثه:\n",
      "translations": []
    }
  ]
}