{
  "chapter": "الأنبياء",
  "text": "قل انما يوحى الى انما الهكم اله وحد فهل انتم مسلمون",
  "translations": [
    {
      "translation": "Say: 'It is revealed to me that your god is One God. So are you Muslims?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"This is what has been revealed to me: 'Your God is one and only God.' So will you bow in homage to Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is revealed to me that your God is only One God. Will you, then, submit to Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is revealed to me that there is only one Lord. Will you then submit yourselves to His will?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “It is divinely revealed to me that your God is the only One God – Allah; do you therefore become Muslims?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is revealed to me that your God is only one God. Will you then be Muslims\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: It is only revealed to me that your Allah is one Allah; will you then submit?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It is revealed unto me only that your God is One God; do you then surrender?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: It is only inspired in me that your Allah is One Allah. Will ye then surrender (unto Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It has been revealed to me that your God is but One God. Will you then submit to Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: this only hath been revealed unto me, that your god is only One God. submit ye then?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘It has been revealed to me that your God is the One God. So will you submit?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"What has come to me by inspiration is that your Allah is One Allah: will ye therefore bow to His Will (in Islam)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"It is revealed to me that your Ilah (God) is only one Ilah (God - Allah). Will you then submit to His Will (become Muslims and stop worshipping others besides Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It is revealed to me that your God is One God, do you then surrender'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “It is revealed to me that your God is One God. Are you going to submit?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is only revealed to me that your god is but one God; so will you be Muslims [in submission to Him]?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:108] Say: ‘All that is being revealed to me is that your God is One God, that is, the only thing that is being revealed to me with respect to the Divine is His Oneness. So will you submit?’, [will you] accede to [affirming] the Oneness of the Divine that is being revealed to me? (the interrogative is meant as an imperative).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ إِنَّمَا يُوحَى إِلَيَّ أَنَّمَا إِلَهُكُمْ إِلَهٌ وَاحِدٌ فَهَلْ أَنْتُمْ مُسْلِمُونَ (108)عقب الوصف الجامع لرسالة محمد صلى الله عليه وسلم من حيث ما لها من الأثر في أحوال البشر بوصف جامع لأصل الدعوة الإسلامية في ذاتها الواجب على كلّ متبع لها وهو الإيمان بوحدانية الله تعالى وإبطالُ إلهية ما سواه ، لنبذ الشرك المبثوث بين الأمم يومئذ . وللاهتمام بذلك صُدرت جملته بالأمر بأن يقول لهم لاستصغاء أسماعهم .وصيغت الجملة في صيغة حصر الوحي إليه في مضمونها لأن مضمونها هو أصل الشريعة الأعظم ، وكل ما تشتمل عليه الشريعة متفرع عليه ، فالدعوة إليه هي مَقادة الاجتلاببِ إلى الشريعة كلّها ، إذ كان أصل الخلاف يومئذ بين الرسول ومُعانديه هو قضية الوحدانية ولذلك قالوا : { أجعل الآلهة إلهاً واحداً إن هذا لشيء عجاب } \\[ ص : 5 \\].وما كان إنكارهم البعث إلا لأنهم لم يجدوه في دين شركهم إذ كان الذين وضعوا لهم الشرك لا يحدثونهم إلا عن حالهم في الدنيا فما كان تصلبهم في إنكار البعث إلا شعبة من شعب الشرك . فلا جرم كان الاهتمام بتقرير الوحدانية تضييقاً لشقة الخلاف بين النبي وبين المشركين المعرضين الذين افتتحت السورة بوصف حالهم بقوله تعالى : { اقترب للناس حسابهم وهم في غفلة معرضون ما يأتيهم من ذكر من ربهم محدَث إلا استمعوه وهم يلعبون لاهية قلوبهم } \\[ الأنبياء : 13 \\].وأفادت ( إنما ) المكسورة الهمزة وإتلاؤها بفعل { يوحى } قصر الوحي إلى الرسول على مضمون جملة { أنّما إلهكم إله واحد }. وهو قصر صفة على موصوف . و ( أنما ) المفتوحة الهمزة هي أخت «إنما» المكسورة الهمزة في إفادة القصر لأن ( أنَما ) المفتوحة مركبة من ( أنّ ) المفتوحة الهمزة و ( مَا ) الكافّة . كما ركبت ( إنّما ) المكسورة من ( إِن ) المكسورة الهمزة و ( ما ) الكافّة . وإذ كانت ( أنّ ) المفتوحة أخت ( إن ) المكسورة في إفادة التأكيد فكذلك كانت عند اتصالها ب ( ما ) الكافّة أختاً لها في إفادة القصر . وتقدم الكلام على ذلك عند قوله تعالى : { فإن توليتم فاعلموا أنما على رسولنا البلاغ المبين } في سورة العقود ( 92 ).وإذ قد أُتليتْ ( أنَما ) المفتوحة بالاسم الجامع لحقيقة الإله ، وأخبر عنه بأنه إلهٌ واحد فقد أفادت أن صاحب هذه الحقيقة مستأثر بالوحدانية فلا يكون في هذه الحقيقة تعدد أفراد فأفادت قصراً ثانياً ، وهو قصر موصوف على صفة .والقصر الأول إضافي ، أي ما يوحى إلي في شأن الإله إلا أن الإله إله واحد . والقصر الثاني أيضاً إضافي ، أي في شأن الإله من حيث الوحدانية . ولما كان القصر الإضافي من شأنه ردُّ اعتقاد المخاطب بجملة القصر لزم اعتبار ردّ اعتقاد المشركين بالقصرين .فالقصر الأول لإبطال ما يُلبسون به على الناس من أن محمداً يدعو إلى التوحيد ثم يذكر الله والرحمان ، ويُلبسون تارة بأنه ساحر لأنه يدعو إلى ما لا يُعقل ، قال تعالى : { وقال الكافرون هذا ساحر كذاب أجعل الآلهة إلهاً واحداً إن هذا لشيء عجاب }\\[ ص : 45 \\] فيكون معنى الآية في معنى قوله تعالى : { قل ما كنت بدعاً من الرسل } \\[ الأحقاف : 9 \\] وقوله تعالى : { واسأل من أرسلنا قبلك من رُسُلنا أجعلنا من دون الرحمن آلهة يعبدون } \\[ الزخرف : 45 \\].ثم إن كلا القصرين كان كلمة جامعة لدعوة الإسلام تقريباً لشقة الخلاف والتشعيب . وعلى جميع هذه الاعتبارات تفرع عليها جملة { فهل أنتم مسلمون }.والاستفهام حقيقي ، أي فهل تسلمون بعد هذا البيان . وهو مستعمل أيضاً في معنى كنائي وهو التحريض على نبذ الإشراك وعلى الدخول في دعوة الإسلام .واسم الفاعل مستعمل في الحال على أصله ، أي فهل أنتم مسلمون الآن استبطاء لتأخر إسلامهم . وصيغ ذلك في الجملة الاسمية الدالة على الثبات دون أن يقال : فهل تسلمون ، لإفادة أن المطلوب منهم إسلام ثابت . وكأنّ فيه تعريضاً بهم بأنهم في ريب يترددون .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad: (It is only inspired in me) in this Qur'an (that your God is One God) Who has no children or partners. (Will ye then) people of Mecca (surrender (unto Him)) will you then believe and be sincere in your worship and profession of Allah's divine Oneness!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما صرت خاتم النبوة والرسالة وصار دينك ناسخاً لجميع الأديان { قُلْ } لقاطبة الأنام على سبيل الدعوة العامة والتبليغ التام: { إِنَّمَآ يُوحَىٰ إِلَيَّ } من ربي ما جعلني مبعوثاً إلى عموم عباده { أَنَّمَآ إِلَـٰهُكُمْ } أيها الواصلون إلى مرتبة التكليف { إِلَـٰهٌ وَاحِدٌ } أحدُ صمد لا يقبل التعدد\n ولا يعرضه نقصان\n ولا يشغله شأن عن شأن\n بل\n[الرحمن: 29] { فَهَلْ أَنتُمْ } أيها العابدون { مُّسْلِمُونَ } [الأنبياء: 108] منقادون له\n مسلّمون توحيده\n مخلصون في إطاعته وانقياده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إنما } الأولى: لقصر الحكم على الشيء\n كقولك: إنما يقوم زيد\n والثانية: لقصر الشيء على الحكم\n كقولك: إنما زيد قائم\n أي: إنما يُوحى إليّ وحدي أنما إلهكم واحد\n { فهل أنتم مسلمون } أي: مخلصون العبادة لله { فإن تولوا } عن الإسلام\n ولم يلتفتوا إلى ما يوجبه من استماع الوحي\n { فقل آذنتُكم } أي: أعلمتكم ما أُمرت به\n أو بمحاربتي لكم ومخالفتي لدينكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:6",
      "similarity": 0.4808187236776041
    },
    {
      "verse": "37:4",
      "similarity": 0.4552131780190079
    },
    {
      "verse": "53:10",
      "similarity": 0.4506804317959043
    },
    {
      "verse": "21:25",
      "similarity": 0.43534459222442484
    },
    {
      "verse": "99:5",
      "similarity": 0.43443038389569566
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021108.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021108.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:108.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}