{
  "chapter": "الأنبياء",
  "text": "اقترب للناس حسابهم وهم فى غفلة معرضون",
  "translations": [
    {
      "translation": "Mankind's Reckoning has drawn very close to them, yet they heedlessly turn away.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "NEAR HAS COME the reckoning for men, but they turn away in remissness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The time of people's reckoning has drawn near, and yet they turn aside in heedlessness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people's day of reckoning is drawing closer, yet they are heedlessly neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people’s reckoning is near, whereas they are in neglect, turned away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Draws near for mankind their reckoning, while they turn away in heedlessness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reckoning has drawn near to men, and in heedlessness are they turning aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nigh unto men has drawn their reckoning, while they in heedlessness are yet turning away;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reckoning draweth nigh for mankind, while they turn away in heedlessness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The time of reckoning has drawn near for mankind, yet they are heedless and turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There hath approached unto mankind their reckoning, while they in neglect are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind’s reckoning has drawn near to them, yet they are disregardful in [their] obliviousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Closer and closer to mankind comes their Reckoning: yet they heed not and they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Draws near for mankind their reckoning, while they turn away in heedlessness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Reckoning for mankind is drawing near, yet they are heedless and turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind’s reckoning has drawn near, but they turn away heedlessly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The time of] their account has approached for the people, while they are in heedlessness turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:1] Nigh has drawn for mankind, the people of Mecca, the deniers of the Resurrection, their reckoning, [on] the Day of Resurrection, yet they are heedless, of it, disregardful, of the preparation [required] for it by way of [embracing] faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas who said regarding the meaning of Allah, Exalted is He, saying: (Their reckoning draweth nigh for mankind): He says: the chastisement that the people of Mecca were promised in the Book has drawn near, (while they turn away in heedlessness) while they are oblivious to it; they have disbelieved in and discarded it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ اقْتَرب للناس حسابهم } في القيامة الصغرى، بل لو عرفوا القيامة لعاينوا حسابهم الآن\n أي: لو أردنا أن نتخذ موجودات تحدث وتفنى كما قيل:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱقْتَرَبَ } أي: دنا وقرب { لِلنَّاسِ } الناسين عهود ربهم التي عهدوا بها معه سبحانه وقت ظهور فطرتهم الأصلية من حَمْلِ أمانة المعارف، والحقائق وقبول أعباء الإيمان، والتوحيد، ومشاق الأعمال، والتكاليف المقربة لهم إليه { حِسَابُهُمْ } أي: قَرْبَ وقت حسابهم، وانتقاد أفعالهم وأعمالهم الصالحة المقبولة عند ربهم من الفاسدة المردودة دونه { وَهُمْ } مغمورون مستغرقون { فِي غَفْلَةٍ مُّعْرِضُونَ } [الأنبياء: 1] عن ربهم، وعن حسابه أياهم، بل أكثرهم معرضون عنه بحيث لا يلتفتون نحوه أصلاً، بل ينكرون وجوده فكيف حسابه وعذابه؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ٱقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِي غَفْلَةٍ مُّعْرِضُونَ مَا يَأْتِيهِمْ مِّن ذِكْرٍ مِّن رَّبِّهِمْ مُّحْدَثٍ إِلاَّ ٱسْتَمَعُوهُ وَهُمْ يَلْعَبُونَ لاَهِيَةً قُلُوبُهُمْ\n\n\n }  قلت: { وهم }: مبتدأ، و { في غفلة }: خبر، و { معرضون }: خبر بعد خبر، والجملة: حال من الناس",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:6",
      "similarity": 0.4907788026559729
    },
    {
      "verse": "30:7",
      "similarity": 0.4250006745485834
    },
    {
      "verse": "10:29",
      "similarity": 0.39407007564477275
    },
    {
      "verse": "46:5",
      "similarity": 0.3926162614098173
    },
    {
      "verse": "6:131",
      "similarity": 0.38838269590168156
    }
  ]
}