{
  "chapter": "الأنبياء",
  "text": "لا يحزنهم الفزع الاكبر وتتلقىهم الملئكة هذا يومكم الذى كنتم توعدون",
  "translations": [
    {
      "translation": "The greatest terror will not upset them and the angels will welcome them: 'This is your Day, the one that you were promised.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have safety from the mighty terror, and angels will receive them, (saying:) \"This is your day which had been promised you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour of the Great Terror shall not grieve them, and the angels shall receive them saying: \"This is your Day which you had been promised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not be affected by the great terror. The angels will come to them with this glad news: \"This is your day which was promised to you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The greatest fear will not aggrieve them, and the angels will welcome them; saying “This is your day, which you were promised.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The greatest terror will not grieve them, and the angels will meet them, (with the greeting:) \"This is your Day which you were promised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The great fearful event shall not grieve them, and the angels shall meet them: This is your day which you were promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the greatest terror shall not grieve them, and the angels shall receive them: 'This is your day that you were promised.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Supreme Horror will not grieve them, and the angels will welcome them, (saying): This is your Day which ye were promised;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The great Horror [of the Day of Judgement] shall not grieve them, and the angels will welcome them, saying, \"This is your Day which you have been promised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Great Terror shall grieve them not, and the angels will meet them: this is Your Day which ye were ever promised-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Great Terror will not upset them, and the angels will receive them [saying]: ‘This is your day which you were promised.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Great Terror will bring them no grief: but the angels will meet them (with mutual greetings): \"This is your Day,- (the Day) that ye were promised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The greatest terror (on the Day of Resurrection) will not grieve them, and the angels will meet them, (with the greeting): \"This is your Day which you were promised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The greatest terror shall not grieve them, and the angels will receive them: 'This is the Day you have been promised'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Supreme Fear will not worry them, and the angels will receive them: “This is your Day which you were promised.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not be grieved by the greatest terror, and the angels will meet them, [saying], \"This is your Day which you have been promised\" -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:103] The Supreme Terror — which is that a servant be ordered off to the Fire, shall not grieve them, and the angels shall receive them, upon their exiting from their graves, saying to them: ‘This is your day, the one which you were promised’, during the [life of the] world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ وَتَتَلَقَّاهُمُ الْمَلَائِكَةُ هَذَا يَوْمُكُمُ الَّذِي كُنْتُمْ تُوعَدُونَ (103)وجملة { لا يحزنهم الفزع } خبر ثان عن الموصول .والفزع : نفرة النفس وانقباضها مما تتوقع أن يحصل لها من الألم وهو قريب من الجَزع . والمراد به هنا فزع الحشر حين لا يعرف أحد ما سيؤول إليه أمره ، فيكونون في أمن من ذلك بطمأنة الملائكة إياهم .وذلك مفاد قوله تعالى : { وتتلقاهم الملائكة هذا يومكم الذي كنتم توعدون } فهؤلاء الذين سبقت لهم الحسنى هم المراد من الاستثناء في قوله تعالى :{ ويوم ينفخ في الصور ففزع من في السماوات ومن في الأرض إلا مَن شاء الله } \\[ النمل : 87 \\].والتلقي : التعرض للشيء عند حلوله تعرض كرامة . والصيغة تشعر بتكلف لقائه وهو تكلف تهيؤ واستعداد .وجملة { هذا يومكم الذي كنتم توعدون } مقول لقول محذوف ، أي يقولون لهم : هذا يومكم الذي كنتم توعدون ، تذكيراً لهم بما وُعدوا في الدنيا من الثواب ، لئلا يحسبوا أن الموعود به يقع في يوم آخر . أي هذا يوم تعجيل وعدكم . والإشارة باسم إشارة القريب لتعيين اليوم وتمييزه بأنه اليوم الحاضر .وإضافة ( يوم ) إلى ضمير المخاطبين لإفادة اختصاصه بهم وكون فائدتهم حاصلة فيه كقول جرير :يا أيها الراكب المزجي مطيته ... هذا زمَانُك إني قد خلا زمنيأي هذا الزمن المختص بك ، أي لتتصرف فيه .\n\n",
      "translations": [
        {
          "translation": "(The Supreme Horror) when the Fire will be closed and death is slaughtered between Paradise and hell (will not grieve them, and the angels will welcome them) at the gate of Paradise with the good news, ((saying): This is your Day which you were promised) in the life of the world; the verses (Lo! you and that which you worship beside [...] This is your Day which ye were promised) were revealed regarding 'Abdullah Ibn al- Zib'ari al-Sahmi, the Poet, and his dispute with the Prophet (pbuh) because of the idols.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يسمعون ويحزنون أولئك الآمنون من حسيس النار مع أنهم من فرط فرحهم وسرورهم { لاَ يَحْزُنُهُمُ ٱلْفَزَعُ ٱلأَكْبَرُ } وهو النخفة الأخيرة في الصور\n مع أنها في نهاية الهول والفظاعة\n وإذا لم يشوشهم تلك الهائلة فكيف بالحسيس { وَ } بعد دخولهم في الجنة الموعودة { تَتَلَقَّاهُمُ ٱلْمَلاَئِكَةُ } مرحبين مهنئين قائلين: { هَـٰذَا يَوْمُكُمُ ٱلَّذِي كُنتُمْ تُوعَدُونَ } [الأنبياء: 103] في نشأتكم الأولى أيها المؤمنون الآمنون\n وأنتم فيها تؤمنون بها\n فالآن نلِتم بما آمنتم\n وفزتهم بما أملتم\n\n\nاذكر يا أكمل الرسل: { يَوْمَ نَطْوِي } ونلف { ٱلسَّمَآءَ } المبسوطة المنشورة { كَطَيِّ ٱلسِّجِلِّ لِلْكُتُبِ } أي: طياً مثل طي الصحيفة الحافظة الحارسة للمكتوب فيها\n يعني: نلفها لفاً بعد نشرها بحيث لا يبقى لها اسم ولا رسم\n إذ طي الصحيفة كنايةُ عن نيسان الشيء وإعدامها وعدم التذكر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا يحزنهم الفزعُ الأكبر } \n وهو القيام من القبور عند صيحة البعث\n بدليل قوله: { وتتلقاهم الملائكةُ }\n قال ابن عباس: \" تتلقاهم الملائكة بالرحمة\n عند خروجهم من القبور \" \n قائلين: { هذا يومُكم الذي كنتم تُوعدون } بالكرامة والثواب\n والنعيم المقيم فيه\n أي: بعد دخولكم الجنة\n وقال الحسن: الفزع الأكبر: الانصراف إلى النار\n وعن الضحاك: حين يُطبق على أهل النار\n وقيل: حين نفخة الصعق\n وقيل: حين يُذبح الموت\n\nقلت: من سبقت له الحسنى ينجو من جميعها\n وقيل: تتلقاهم الملائكة على أبواب الجنة\n مُهنئين لهم قائلين: { هذا يومكم الذي كنتم توعدون } في الدنيا\n ويُبشرون بما فيه من فنون المثوبات على الإيمان والطاعات\n وهذا\n كما ترى\n صريح في أن المراد بالذين سبقت لهم الحسنى: كافةُ المؤمنين الموصوفين بالإيمان والأعمال الصالحة\n لا من ذكر من المسيح\n وعُزير\n والملائكة\n كما قيل\n قاله أبو السعود\n قلت: وقد يجاب بأنها نزلت في شأنهم وتعم غيرهم لأن سبب النزول لا يخصص\n والله تعالى أعلم\n الإشارة: قال الجنيد رضي الله عنه: { إن الذين سبقت لهم منّا الحسنى } أي: سبقت لهم منا العناية في البداية\n فظهرت لهم الولاية في النهاية\n هـ\n { أولئك عنها } أي: عن نار القطيعة\n وهي أغيار الدنيا\n مُبعدون\n لا يسمعون حسيسها\n ولا ما يقع فيها من الهرج والفتن\n لغيبتهم عنها بالكلية في الشغل بالله تعالى\n فهم فيما اشتهت أنفسهم من لذة الشهود\n والقُرب من الملك الودود\n خالدون دائمون\n لا يحزنهم الفزع الأكبر في الدنيا والآخرة\n وتتلقاهم الملائكة بالبُشرى بالوصول\n هذا يومكم الذي كنتم توعدون\n وهو يوم ملاقاة الحبيب والعكوف في حضرة القريب\n عند مليك مقتدر\n منحنا الله من ذلك الحظ الأوفر بمنّه وكرمه\n  ثمَّ ذكر أوصاف ذلك اليوم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:89",
      "similarity": 0.8128630998337556
    },
    {
      "verse": "34:23",
      "similarity": 0.628376391197992
    },
    {
      "verse": "34:51",
      "similarity": 0.5416043343307194
    },
    {
      "verse": "27:87",
      "similarity": 0.43689820956528436
    },
    {
      "verse": "38:22",
      "similarity": 0.35477673641551966
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021103.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021103.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:103.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}