{
  "chapter": "الأنبياء",
  "text": "بل نقذف بالحق على البطل فيدمغه فاذا هو زاهق ولكم الويل مما تصفون",
  "translations": [
    {
      "translation": "Rather We hurl the truth against falsehood and it cuts right through it and it vanishes clean away! Woe without end for you for what you portray!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact We strike the truth against the false, which shatters it, and it disappears. Woe to you for what you attribute (to Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, We hurl the Truth at falsehood so that the Truth crushes falsehood, and lo! it vanishes. Woe to you for what you utter!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bring forward the Truth to crush and destroy falsehood; it is doomed to be banished. Woe to you for your way of thinking about God!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But in fact We hurl the truth upon falsehood, so it scatters its brains – thereupon it vanishes; and for you is the ruin due to the matters you fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, We fling the truth against the falsehood, so it destroys it, and behold, it disappears. And woe to you for that which you ascribe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! We cast the truth against the falsehood, so that it breaks its head, and lo! it vanishes; and woe to you for what you describe;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but We hurl the truth against falsehood and it prevails over it, and behold, falsehood vanishes away. Then woe to you for that you describe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but We hurl the true against the false, and it doth break its head and lo! it vanisheth. And yours will be woe for that which ye ascribe (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will hurl the truth at falsehood, the falsehood shall be crushed and will disappear. Woe to you for what you utter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! We hurl truth against false hood, so that it braineth it, and lo! it vanisheth; and to you be the woe for that which ye utter!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We hurl the truth against falsehood, and it crushes its head, and behold, falsehood vanishes! And woe to you for what you allege [about Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, We hurl the Truth against falsehood, and it knocks out its brain, and behold, falsehood doth perish! Ah! woe be to you for the (false) things ye ascribe (to Us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, We fling (send down) the truth (this Quran) against the falsehood (disbelief), so it destroys it, and behold, it (falsehood) is vanished. And woe to you for that (lie) which you ascribe (to Us) (against Allah by uttering that Allah has a wife and a son).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, We hurl truth at falsehood, and it shall conquer it, and see, falsehood vanishes. Woe to you for all you have described.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, We hurl the truth against falsehood, and it crushes it, so it vanishes. Woe unto you, for what you describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, We dash the truth upon falsehood, and it destroys it, and thereupon it departs. And for you is destruction from that which you describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:18] Nay, but We hurl, We cast, the truth, faith, against falsehood, disbelief, and it obliterates it, and behold, it vanishes, disappears (damaghahu, ‘it obliterates it’, actually means ‘it struck the brain with a blow’, [a blow] which is fatal). And for you, O disbelievers of Mecca, there shall be woe, severe chastisement, for what you ascribe, to God, of mate or child.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but We hurl the true) We cast the Truth (against the false) upon falsehood; it is also said: We exposit the Truth and falsehood, (and it doth break its head) and it makes it perish (and lo! it vanisheth) i.e. falsehood. (And yours) group of disbelievers (will be woe) severe punishment (for that which ye ascribe (unto Him)) for your claim that the angels are Allah's daughters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَكُمُ ٱلْوَيْلُ مِمَّا تَصِفُونَ } فالويلُ: وادٍ في جهنّمَ من قَيحٍ مما يَسيلُ من صَديدِ أهل النَّارِ\n وتَصِفونَ: معناه تَكذِبُونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ نَقْذِفُ } أي: بل اللائق المستحسن منَّا، المناسب بعلو شأننا أن نضمحل ونُبطل { بِٱلْحَقِّ } الذي هو شمس وجودنا، ولمعان آثار فضلنا وجودنا { عَلَى ٱلْبَاطِلِ } الذي هو الظلُّ الزائغُ الآفلُ، والعدمُ والعاطلُ الزائلُ { فَيَدْمَغُهُ } أي: يَمحقه ويُسقط عنه اسم الوجود المستعار ويُلحقه إلى ما هو عليه من العدم بلا عبرةٍ واعتبارٍ؛ ليظهر عند المعتبرين أن\n\n\n\n[العنكبوت: 64]\n\n[غافر: 39]\n\n[الحشر: 2]، فكيف لا يمحقه، ولا يلحقه بالعدم { فَإِذَا هُوَ } في نفسه وفي حد ذاته { زَاهِقٌ } هالكُ زائلُ ما شمَّ رائحة الوجود { وَلَكُمُ ٱلْوَيْلُ } والهلكة أيها الواصفون والجاهلون بقدْر الله { مِمَّا تَصِفُونَ } [الأنبياء: 18] ذاته من الأمور التي لا تليق بجنابنا من ارتكاب العبث، وإسناد اللهو واللعب بذاته تعالى، وإشراك هذه الأظلال الهالكة معه في الوجود، تعالىعن ذلك علواً كبيراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { بل نقذفُ بالحق على الباطل } أي: نرمي بالحق، الذي هو الجد، على الباطل، الذي من جملته اللهو، وهو إضراب عن اتخاذ الولد، بل عن إرادته، كأنه قيل: لكنا لا نريده، بل شأننا أن نقذف بالحق على الباطل { فيدْمَغُه }: فيمحقه بالكلية، كما فعلنا بأهل القُرى المحكية وأمثالهم، وقد استعير، لإيراد الحق على الباطل، القذف، الذي هو الرمي الشديد، وللباطل الدمغ، الذي هو تشتيت الدماغ وتزهيق الروح، فكأنَّ الباطل حيوان له دماغ، فإذا تشتت دماغه مات واضمحل، { فإِذا هو زاهق } أي: فإذا الباطل ذاهب بالكلية، متلاش عن أصله\n وفي { إذا } الفجائية والجملة الاسمية من الدلالة على كمال السُرعة في الذهاب والبطلان ما لا يخفى\n ثم ردَّ على أهل الباطل فقال: { ولكم الويلُ مما تصفون } أي: وقد استقر لكم الويل والهلاك من أجل ما تصفونه، سبحانه، بما لا يليق بشأنه الجليل، من الولد والزوجة، وغير ذلك مما هو باطل\n وهو وعيد لقريش ومن دان دينهم، بأنَّ لهم أيضًا مثل ما لأولئك القرى المتقدمة من الهلاك، إن لم ينزجروا\n والله تعالى أعلم\n الإشارة: ما نصبت لك الكائنات لتراها كائنات، بل لتراها أنوارًا وتجليات، الأكوان ثابتة بإثباته، ممحوة بأحدية ذاته، فالغير والسِّوى عند أهل الحق باطل، والباطل لا يثبت مع الحق\n قال تعالى: { بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق }\n قال القشيري: نُدْخِلُ نهارَ التحقيق على ليالي الأوهام، أي: فتمحى، وتبقى شمس الأحدية ساطعة\n هـ\n وبالله التوفيق\n ثمَّ قرر وحدانيته تعالى في ملكه وملكوته\n",
      "translations": []
    }
  ]
}