{
  "chapter": "الأنبياء",
  "text": "فما زالت تلك دعوىهم حتى جعلنهم حصيدا خمدين",
  "translations": [
    {
      "translation": "And this remained their lament till We mowed them down and made them extinct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not cease to cry this until We reduced them to stubble, still and silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such was what they continued to say until We mowed them down and made them completely extinct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they kept saying this until We made them cut off, extinguished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that cry of theirs ceased not, till We made them as a field that is reaped, extinct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this ceased not to be their cry till We made them cut off, extinct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they ceased not to cry, until We made them stubble, silent and still.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this their crying ceased not till We made them as reaped corn, extinct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and this they kept repeating until We caused them to become like a field mowed down, and reduced to ashes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this ceased not to be their cry until We made them a harvestreaped, extinguished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That remained their cry until We turned them into a mown field, stilled [like burnt ashes].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that cry of theirs ceased not, till We made them as a field that is mown, as ashes silent and quenched.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that cry of theirs ceased not, till We made them as a field that is reaped, extinct (dead).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this they did not stop crying out until We made them stubble, silent, and still.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This continued to be their cry, until We made them silent ashes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that declaration of theirs did not cease until We made them [as] a harvest [mowed down], extinguished [like a fire].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:15] So that, saying, remained their cry, which they would make and repeat, until We made them as reaped [crops], as crops harvested with sickles when they were killed with the sword, stilled, dead, like the stillness of fire when it is extinguished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And this their crying) i.e. saying \"Alas for us!\" (ceased not till We made them as reaped corn, extinct) dead, motionless. This is the story of a township near Yemen called \"Hudur\". Allah sent a prophet to them but they killed him. Allah set on them Nebuchadnezzar who exterminated them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جَعَلْنَاهُمْ حَصِيداً خَامِدِينَ } معناهُ مُسْتأصلينَ بالسَّيفِ والخَامدُ: هو الهَامدُ معناه الذَّاهبُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَمَا زَالَت تِلْكَ } تلك الكلمة المذكورة؛ يعني: يا ويلنا إنا كنا ظالمين { دَعْوَاهُمْ } أي: دعاؤهم، ونداؤهم جارية على ألسنتهم على وجه الخضوع والخشوع والتذلل التام والانكسار المفرط؛ لأنهم قصدوا بها النجاة والخلاص، إذ هم اعترفوا بذنوبهم في ضمنها، وندموا عن فعلهم بتكرارها، ومع ذلك لم ينفعهم؛ لمضيّ وقت التوبة والندامة { حَتَّىٰ جَعَلْنَاهُمْ حَصِيداً خَامِدِينَ } [الأنبياء: 15] أي: صارت أجسامهم مثل: المحصود الخامد من النبات، كأنه ماشمَّ رائحةً من الحياة في وقتٍ من الأوقات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}