{
  "chapter": "الأنبياء",
  "text": "وله من فى السموت والارض ومن عنده لا يستكبرون عن عبادته ولا يستحسرون",
  "translations": [
    {
      "translation": "Everyone in the heavens and the earth belongs to Him. Those in His presence do not consider themselves too great to worship Him and do not grow tired of it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever is in the heavens and the earth belongs to Him; and those who are near Him do not disdain to worship Him or weary (of His service),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whosoever dwells in the heavens and on earth. Those (angels) that are with Him neither disdain to serve Him out of pride, nor do they weary of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all those who are in the heavens and the earth. Those who are closer to Him are not too proud to worship Him, nor do they get tired of worshipping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him only belong all those who are in the heavens and in the earth; and those with Him are not conceited towards worshipping Him, nor do they tire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whosoever is in the heavens and on earth. And those who are near Him are not too proud to worship Him, nor are they weary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever is in the heavens and the earth is His; and those who are with Him are not proud to serve Him, nor do they grow weary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whosoever is in the heavens and the earth; and those who are with Him wax not too proud to do Him service neither grow weary,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him belongeth whosoever is in the heavens and the earth. And those who dwell in His presence are not too proud to worship Him, nor do they weary;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whosoever is in the heavens and on the earth and those that are with Him are never too proud to worship Him, nor do they grow weary;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And His is whosoever is in the heavens and the earth; and those nigh unto Him are not too stiff-necked for His worship nor are they weary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatever is in the heavens and the earth, and those who are near Him do not disdain to worship Him, nor do they become weary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong all (creatures) in the heavens and on earth: Even those who are in His (very) Presence are not too proud to serve Him, nor are they (ever) weary (of His service):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whosoever is in the heavens and on earth. And those who are near Him (i.e. the angels) are not too proud to worship Him, nor are they weary (of His worship).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whosoever is in the heavens and the earth. Those who are with Him are not too proud to worship Him, nor are they ever wearied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs everyone in the heavens and the earth. Those near Him are not too proud to worship Him, nor do they waver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whoever is in the heavens and the earth. And those near Him are not prevented by arrogance from His worship, nor do they tire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:19] And to Him, exalted be He, belongs whoever is in the heavens and the earth, as possessions, and those who are near Him, namely, the angels (wa-man ‘indahu, the subject, the predicate of which [is the following clause]) do not disdain to worship Him, nor do they weary.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Him belongeth whosoever is in the heavens and the earth) all created beings are His slaves. (And those who dwell in His presence) among the angels (are not too proud to worship Him) they are not too proud to obey Him and acknowledge His Lordship (nor do they weary) and they do not tire from worshipping Allah;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ يَسْتَحْسِرُونَ } معناه لا يَفتُرُونَ، ولا يَمَلُّونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And let them not be neglectful} means that they should not be negligent, and should not be content with what they have.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوالعدل الذي قامت به السموات والأرض هو ظل الوحدة في عالم الكثرة\n ولو لم يوجد هيئة وحدانية في المركبات كاعتدال المزاج لما وجدت\n ولو زالت تلك الهيئة لفسدت في الحال { فسبحان الله } أي: نزّه للفيض على الكل بربوبيته للعرش الذي ينزل منه الفيض على جميع الموجودات عما تصفونه من إمكان التعدّد\n { يعلم ما بين أيديهم } أي: ما تقدّمهم من العلم الكليّ الثابت في أمّ الكتاب المشتمل على جميع علوم الذوات المجرّدة من أهل الجبروت والملكوت { وما خلفهم } من علوم الكائنات والحوادث الجزئية الثابتة في السماء الدنيا\n فكيف يخرج عن علمهم إحاطة علمه ويسبق فعلهم أمره وقولهم قوله { ولا يشفعون إلا لمن } علمه أهلاً للشفاعة بقبوله لصفاء استعداده ومناسبة نفسه للنور الملكوتي { وهم } في الخشية من سبحات وجهه والخشوع والإشفاق والانقهار تحت أنوار عظمته\n { أو لم ير } المحجوبون عن الحق { أنّ السموات والأرض كانتا } مرتوقتين من هيولى واحدة ومادة جسمانية { ففتقناهما } بتباين الصور\n أو أن سموات الأرواح وأرض الجسد كانا مرتوقتين في صورة نطفة واحدة ففتقناهما بتباين الأعضاء والأرواح\n { وجعلنا } أي: خلقنا من النطفة كل حيوان { وجعلنا } في أرض الجسد { رواسي } العظام كراهة أن تضطرب وتجيء وتذهب وتختلف بهم فلا تقوم بهم وتستقل { وجعلنا فيها فجاجاً } مجاري\n طرقاً للحواس وجميع القوى { لعلهم يهتدون } بتلك الحواس والطرق إلى آيات الله فيعرفوه\n { وجعلنا } سماء العقل { سقفاً } مرتفعاً فوقهم { محفوظاً } من التغير والسهو والخطأ { وهم } عن حججها وبراهينها { معرضون }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف تشركون أيها المشركون معه أضلاله وعبيده\n إذ { لَهُ } تعالى إيجاداً وإبداعاً وإظهاراً وتصرفاً { مَن فِي ٱلسَّمَٰوَٰتِ } أي: عالم الأرواح المجردة عن الأبدان { وَ } من في { ٱلأَرْضِ } أي: الأرواحُ المتعلقة بها { وَ } كذا { مَنْ عِنْدَهُ } من الأرواح التي لا تزولَ لهم ولا عروجَ\n كلهم متذللون { لاَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ } وإطاعته { وَلاَ يَسْتَحْسِرُونَ } [الأنبياء: 19] ولا يعْيَون ع إقامتها وإتيانها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وله من في السماوات والأرض } أي له جميع المخلوقات\n خلقًا ومِلكًا\n وتدبيرًا وتصرفًا\n وإحياء وإِماتة\n وتعذيبًا وإثابة\n من غير أن يكون لأحد في ذلك دخل\n لا استقلالاً ولا استتباعًا\n ولا فرق بين أهل العالم العلوي والسفلي\n { ومَنْ عنده } وهم الملائكة - عليهم السلام - عبَّر عنهم بذلك إثر ما عبَّر عنهم بمن في السماوات تنزيلاً لهم - لكرامتهم عليه\n وزلفاهم عنده - منزلة المقربين عند الملك\n وهو مبتدأ وخبره: { لا يستكبرون عن عبادته } أي: لا يتعاظمون عنها\n ولا يَعُدون أنفسهم كبراء\n { ولا يستحسرون } أي: لا يكِلُّون ولا يَعْيون\n { يُسبِّحُون الليلَ والنهار } أي: ينزهونه في جميع الأوقات\n ويُعظمونه ويمجدونه دائمًا\n وهو استئناف بياني\n كأنه قيل: ماذا يصنعون في عبادتهم\n أو كيف يعبدون؟ فقال: يُسبحون\n\n الخ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:50",
      "similarity": 0.8542698624172291
    },
    {
      "verse": "36:30",
      "similarity": 0.7324223069519552
    },
    {
      "verse": "19:39",
      "similarity": 0.6551387515300968
    },
    {
      "verse": "35:8",
      "similarity": 0.5164913147303031
    },
    {
      "verse": "8:36",
      "similarity": 0.5048097351740863
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}