{
  "chapter": "الأنبياء",
  "text": "قل انما يوحى الى انما الهكم اله وحد فهل انتم مسلمون",
  "translations": [
    {
      "translation": "Say: 'It is revealed to me that your god is One God. So are you Muslims?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"This is what has been revealed to me: 'Your God is one and only God.' So will you bow in homage to Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is revealed to me that your God is only One God. Will you, then, submit to Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is revealed to me that there is only one Lord. Will you then submit yourselves to His will?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “It is divinely revealed to me that your God is the only One God – Allah; do you therefore become Muslims?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is revealed to me that your God is only one God. Will you then be Muslims\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: It is only revealed to me that your Allah is one Allah; will you then submit?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It is revealed unto me only that your God is One God; do you then surrender?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: It is only inspired in me that your Allah is One Allah. Will ye then surrender (unto Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It has been revealed to me that your God is but One God. Will you then submit to Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: this only hath been revealed unto me, that your god is only One God. submit ye then?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘It has been revealed to me that your God is the One God. So will you submit?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"What has come to me by inspiration is that your Allah is One Allah: will ye therefore bow to His Will (in Islam)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"It is revealed to me that your Ilah (God) is only one Ilah (God - Allah). Will you then submit to His Will (become Muslims and stop worshipping others besides Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It is revealed to me that your God is One God, do you then surrender'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “It is revealed to me that your God is One God. Are you going to submit?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is only revealed to me that your god is but one God; so will you be Muslims [in submission to Him]?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:108] Say: ‘All that is being revealed to me is that your God is One God, that is, the only thing that is being revealed to me with respect to the Divine is His Oneness. So will you submit?’, [will you] accede to [affirming] the Oneness of the Divine that is being revealed to me? (the interrogative is meant as an imperative).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (It is only inspired in me) in this Qur'an (that your God is One God) Who has no children or partners. (Will ye then) people of Mecca (surrender (unto Him)) will you then believe and be sincere in your worship and profession of Allah's divine Oneness!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما صرت خاتم النبوة والرسالة وصار دينك ناسخاً لجميع الأديان { قُلْ } لقاطبة الأنام على سبيل الدعوة العامة والتبليغ التام: { إِنَّمَآ يُوحَىٰ إِلَيَّ } من ربي ما جعلني مبعوثاً إلى عموم عباده { أَنَّمَآ إِلَـٰهُكُمْ } أيها الواصلون إلى مرتبة التكليف { إِلَـٰهٌ وَاحِدٌ } أحدُ صمد لا يقبل التعدد، ولا يعرضه نقصان، ولا يشغله شأن عن شأن، بل\n\n[الرحمن: 29] { فَهَلْ أَنتُمْ } أيها العابدون { مُّسْلِمُونَ } [الأنبياء: 108] منقادون له، مسلّمون توحيده، مخلصون في إطاعته وانقياده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إنما } الأولى: لقصر الحكم على الشيء، كقولك: إنما يقوم زيد، والثانية: لقصر الشيء على الحكم، كقولك: إنما زيد قائم، أي: إنما يُوحى إليّ وحدي أنما إلهكم واحد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:6",
      "similarity": 0.4808187236776041
    },
    {
      "verse": "37:4",
      "similarity": 0.4552131780190079
    },
    {
      "verse": "53:10",
      "similarity": 0.4506804317959043
    },
    {
      "verse": "21:25",
      "similarity": 0.43534459222442484
    },
    {
      "verse": "99:5",
      "similarity": 0.43443038389569566
    }
  ]
}