{
  "chapter": "الأنبياء",
  "text": "وما خلقنا السماء والارض وما بينهما لعبين",
  "translations": [
    {
      "translation": "We did not create heaven and earth and everything in between them as a game.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not created the heavens and the earth, and all that lies between them, out of fun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create in sport the heavens and the earth and all that lies between the two.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the heavens and the earth just for fun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have not created the heavens and the earth and all that is between them, unnecessarily.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens and the earth and all that is between them for play.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not create the heaven and the earth and what is between them for sport.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heaven and the earth, and whatsoever between them is, as playing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heaven and the earth and all that is between them in play.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was not in play that We created the heavens and the earth and all that lies between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We created not the heaven and the earth and that which is in between in play.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the sky and the earth and whatever is between them for play.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not for (idle) sport did We create the heavens and the earth and all that is between!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created not the heavens and the earth and all that is between them for a (mere) play.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was not in play that We created the heavens and the earth and all that lies between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not create the sky and the earth and what is between them for amusement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not create the heaven and earth and that between them in play.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:16] And We did not create the heaven and the earth and all that is between them, playing, being frivolous, but to indicate Our power and to benefit Our servants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We created not the heaven and the earth and all that is between them) of created beings (in play) without ordaining commands and prohibitions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا نأخذهم بظلمهم ولا نجعلهم محصوداً خامداً جامداً؛ إذ { مَا خَلَقْنَا ٱلسَّمَآءَ } المزينة بزينة الكواكب، كل منها مقدَّر لأمور لا يعرف تعديده وإحصاءه غيرنا { وَٱلأَرْضَ } المزينة بزينة المعادن والنبات، والحيوان، والأشجار، والأنهار، وأنواع الفواكه، والأثمار، كل منها مشتمل على حِكَمٍ ومصالحَ لا يسعه إلا حضرة علمنا { وَمَا } يحصل { بَيْنَهُمَا } من امتزاج آثارهما وأفعالهما من العجائب والغرائب التي تَدهش منها العقول، وتكلّ في وصفها الألسنة، وتنحسر الصدور { لَـٰعِبِينَ } [الأنبياء: 16] أي: ما جعلناهما عبئاً باطلاً بلا سرائرَ ودَّعنا فيها، وبدائعَ أضمرنا في خلقها وظهورها، إذ الحكيم لا يفعل فعلاً إلا وقد أودع فيه من المصالح الحكم ما لا يُعدُّ ولا يُحصى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { لاعبين }: حال من فاعل خلق، و \" إن كنا \": شرط حُذف جوابه، أي: إن كنا فاعلين اتخذناه من لّدُنا، وقيل: نافية\n يقول الحقّ جلّ جلاله: { وما خلقنا السماءَ والأرضَ وما بينهما } من المخلوقات التي لا تُحصى أجناسها، ولا تُعد أفرادها، ولا تُحصر أنواعها وآحادها، على هذا النمط البديع والأسلوب الغريب، { لاعبين } خالية عن الحِكم والمصالح، بل لحِكَم بديعة ومصالح عديدة، دينية تَقْضي بسعادة الأبد أو بشقاوته، ودنيوية لا تُعد ولا تُحصى، وهذا كقوله:\n\n[ص: 27]، فالمراد من الآية: إشارة إجمالية إلى أن تكوين العالم، وإبداع بني آدم، مؤسس على قواعد الحِكَم البالغة، المستتبعة للغايات الجليلة، وتنبيه على أن ما حكي من العذاب الهائل، والعقاب النازل بأهل القُرى، من مقتضيات تلك الحِكم، ومتفرع عليها حسبما اقتضته أعمالهم\n وإنما فعل ذلك عدلاً منه، ومجازاة على أعمالهم، وأن المخاطبين المتقدمين - وهم قريش - على آثارهم لأن لهم ذنوبًا مثل ذنوبهم\n وإنما عبَّر عن نفي الحكمة باللعب، حيث قال: { لاعبين } لبيان كمال تنزهه تعالى عن الخلق الخاليِ عن الحكمة، بتصويره بصورة ما لا يرتاب أحد في استحالة صدوره منه سبحانه، وهو اللهو واللعب، بل إنما خلقناهما، وما بينهما لتكون مبدأ الوجود الإنساني وسببًا لمعاشه، ودليلاً يقوده إلى تحصيل معرفتنا، التي هي الغاية القصوى والسعادة العظمى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:38",
      "similarity": 0.9999999999999998
    },
    {
      "verse": "21:55",
      "similarity": 0.7576116360377028
    },
    {
      "verse": "21:2",
      "similarity": 0.6481763195976912
    },
    {
      "verse": "44:9",
      "similarity": 0.5302871199034099
    },
    {
      "verse": "5:57",
      "similarity": 0.5236466493718364
    }
  ]
}