{
  "chapter": "الأنبياء",
  "text": "قل رب احكم بالحق وربنا الرحمن المستعان على ما تصفون",
  "translations": [
    {
      "translation": "Say: 'Lord, judge with truth! Our Lord is the All-Merciful, the One whose help is sought in the face of what you describe.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Judge in truth (between us), O Lord,\" he said. \"Our Lord is merciful, whose help we seek against what you attribute.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger said: \"My Lord! Judge with truth. Our Compassionate Lord alone is our support against your (blasphemous) utterances.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He also said, \"Lord, judge (us) with Truth. Our Lord is the Beneficent One whose help I ask against the blasphemies you say about Him\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Prophet submitted, “My Lord – render the true judgement”; “And only the help of Our Lord, the Most Gracious, is sought against all what you fabricate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said:\"My Lord! Judge You in truth! Our Lord is the Most Gracious, Whose help is to be sought against that which you attribute!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my Lord! judge Thou with truth; and our Lord is the Beneficent Allah, Whose help is sought against what you ascribe (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'My Lord, judge Thou with truth! And our Lord is the All-merciful; His succour is ever to be sought against that you describe.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He saith: My Lord! Judge Thou with truth. Our Lord is the Beneficent, Whose help is to be implored against that which ye ascribe (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"My Lord, judge with truth. Our Lord is the Gracious One whose help we seek against what you utter.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He saith: my Lord! judge Thou with truth. And our Lord is the Compassionate Whose help is to be sought against that which ye utter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! Judge [between us and the polytheists] with justice.’ ‘Our Lord is the All-beneficent; [He is our] resort against what you allege.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O my Lord! judge Thou in truth!\" \"Our Lord Most Gracious is the One Whose assistance should be sought against the blasphemies ye utter!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Muhammad SAW) said:\"My Lord! Judge You in truth! Our Lord is the Most Beneficent, Whose Help is to be sought against that which you attribute (unto Allah that He has offspring, and unto Muhammad SAW that he is a sorcerer, and unto the Quran that it is poetry, etc.)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'My Lord, judge in truth. Our Lord is the Merciful whose help is ever to be sought against what you describe'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord, judge with justice.” And, “Our Lord is the Gracious, Whose help is sought against what you allege.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The Prophet] has said, \"My Lord, judge [between us] in truth. And our Lord is the Most Merciful, the one whose help is sought against that which you describe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:112] Say (qul, a variant reading has qāla, ‘He said’): ‘My Lord! Judge, between me and my deniers, with truth, by [assigning] chastisement for them or victory [for me] over them. And so they were chastised at [the battles of] Badr, Uhud, Hunayn, al-Ahzāb and al-Khandaq and he [the Prophet] was given victory over them. And our Lord is the Compassionate One, Whose help is to be sought against what you allege’, when you invent lies against God, saying that ‘[God] has taken a son’ [cf. Q. 2:116]; and against me, when you say, ‘[he is] a   sorcerer’ [cf. Q. 38:4], or against the Qur’ān, when you say, ‘[it is] poetry’ [cf. Q. 52:30]. Medinese, except for verses 52, 53, 54 and 55, which were [revealed] between Mecca and Medina; it consists of 78 verses, revealed after [sūrat] al-Nūr.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He saith) Muhammad (pbuh) says: (My Lord! Judge Thou with truth) judge between me and the people of Mecca with justice. (Our Lord is the Beneficent, whose help is to be implored) we seek His help (against that which ye ascribe (unto Him)) against the lies which you utter about Him'. And of the surah in which the pilgrimage is mentioned, which is all Meccan except for five verses-(And among mankind is he who worshippeth Allah upon a narrow marge so that if good befalleth him he is content therewith, but if a trial befalleth him, he falleth away utterly. He loseth both the world and the Hereafter. That is the sheer loss. He calleth, beside Allah, unto that which hurts him not nor benefits him. That is the far error), and (Sanction is given unto those who fight because they have been wronged; and Allah is indeed Able to give them victory; Those who have been driven from their homes unjustly only because they said: Our Lord is Allah. For had it not been for Allah's repelling some men by means of others, cloisters and churches and oratories and mosques, wherein the name of Allah is oft mentioned, would assuredly have been pulled down. Verily Allah helpeth one who helpeth Him. Lo! Allah is Strong, Almighty), and the verse of the last prostration (0 ye who believe! Bow down and prostrate yourselves, and worship your Lord, and do good, that haply ye may prosper)-which are Medinan, and consists of 75 verses, 1,291 words and 5,135 letters: (Al-Hajj) Surah 22: The Pilgrimage (al-Hajj) And of the surah in which the pilgrimage is mentioned, which is all Meccan except for five verses— (And among mankind is he who worshippeth Allah upon a narrow marge so that if good befalleth him he is content therewith, but if a trial befalleth him, he falleth away utterly. He loseth both the world and the Hereafter. That is the sheer loss. He 362 calleth, beside Allah, unto that which hurts him not nor benefits him. That is the far error), and (Sanction is given unto those who fight because they have been wronged; and Allah is indeed Able to give them victory; Those who have been driven from their homes unjustly only because they said: Our Lord is Allah. For had it not been for Allah's repelling some men by means of others, cloisters and churches and oratories and mosques, wherein the name of Allah is oft mentioned, would assuredly have been pulled down. Verily Allah helpeth one who helpeth Him. Lo! Allah is Strong, Almighty), and the verse of the last prostration (0 ye who believe! Bow down and prostrate yourselves, and worship your Lord, and do good, that haply ye may prosper)— which are Medinan, and consists of 75 verses, 1,291 words and 5,135 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أمر سبحانه حبيبه صلى الله عليه وسلم بالاستعانة منه سبحانه والتفويض إليه بقوله: { قَالَ } يا أكمل الرسل بعدما أصروا على إنكارك ملتجئاً إلينا مناجياً: { رَبِّ } يا من ربَّاني بكرامة الرسالة والتبليغ والإرشاد والتشريع { ٱحْكُم بِٱلْحَقِّ } الصريح الصحيح عنك بيني وبين هؤلاء المعاندين\n وأنت تعلم أنهم لا ينزجرون لا بنزول العذاب الموعود عليهم\n أنزل بمقتضى قهرك عليهم ما ينزجرون به من العذاب { وَرَبُّنَا } وإن كان هو { ٱلرَّحْمَـٰنُ } الذي وسعت رحمته كل شيء حتى الكافر الشقي النافي له\n لكنه { ٱلْمُسْتَعَانُ } والمعين المنان والناصر الديَّا لأهل المعرفة والإيمان { عَلَىٰ } إزالة { مَا تَصِفُونَ } [الأنبياء: 112] اللهَ به مما لا يليق بشأنه وجنابه\n\nوبالجملة أولئك المشركون هم الهالكون في تيه الجحود والطغيان\n المنهمكون في بحر الغفلة والضلال والكفران\n\n\nخاتمة السورة\n\nعليك أيها الطالب القاصد لاقتصاد الأحوال واعتدال الأقوال والأفعال أن تستعين بالله ما صدر عنك\n وجرى عليك\n و تسنده إلى الله سبحانه بلا رؤية الوسائل والبين\n وتتخذه وكيلاً على مقتضى أمره سبحانه\n[المزمل: 9] وتفوض جميع أمورك في جميع شؤونك وأطوارك إليه سبحانه\n إذ هي له أصالة\n وإن صدر عنك صورة\n إذ لا وجود لك في ذاتك\n فيكف ما يترتب عليه من الأفعال والآثار المرتبة عليه\n فلك أن تميت نفسك عما حداك إليه أمّارة نفسك وشيطان وهمك وخيالك\n إذ هو مضلك ومغويك يبعدك عما يعينك وينبغي لك\n ويغريك إلى ما لا يعينك ويرديك\n\n\nفلك أن تميز بين تسويلات الهوى\n وأماني النفس المائلة عن المولى وبين آيات الهدى وعلامات التقى الموصلة إلى الدرجة العليا والفوز بشرف اللقيا\n\n\nوإن شئت أن تخلص نفسك من جنود الهوى وعساكر الغفلات من الأوهام والخيالات فاعتزل عن أظهر الناس\n وأعرض عن ملئهم\n واحذر عن مخالطتهم ومصاحبتهم\n واتخذ لنفسك خلوة تنجيك عن جميع ما يغويك ويؤذيك\n إذ المرء إنما يذوق حلاوة الوحدة ولذة التوحيد في العزلة والفرار عن الخلطة\n سيما في هذا الزمان الذي غلب فيه النفاق\n وكثر الخلاف والشقاق\n\n\nربنا هب لنا من لدنك جذبة عن لذات الدنيا ومشتهياتها\n وأنساً بك تخلصنا عن مؤانسة غيرك\n إنك على ما تشاء قدير\n وبإنجاح آمال المؤملين جدير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ قل ربِّ احكُم بالحق } أي: اقض بيننا وبين كفار مكة بالعدل\n المقتضي لتعجيل العذاب\n فهو كقول شعيب عليه السلام:\n[الأعرَاف: 89]\n أو بما يحق عليهم من العذاب\n واشدد عليهم\n كقوله صلى الله عليه وسلم:\n \" اللَّهُمَّ اشْدُدْ وطأَتَكَ عَلَى مُضَرَ \" \n\n وقد استجيب دعاؤه - عليه الصلاة والسلام -\n حيث عُذبوا ببدر أيّ تعذيب\n وقرأ الكسائي وحفص: { قال } حكاية لدعائه صلى الله عليه وسلم\n ثم استعان بالله على إبطال ما كانوا يؤملون من النصرة لهم\n وتكذيبهم في ذلك\n فقال: { وربنا الرحمن } كثير الرحمة على عباده\n { المستعان على ما تصفون } من كون الغلبة لكم\n كانوا يصفون الحال على خلاف ما جرت عليه\n وكانوا يطمعون أن تكون الشوكة والغلبة لهم\n فكذب الله ظنونهم\n وخيّب آمالهم\n وغيّر أحوالهم\n ونصر رسوله صلى الله عليه وسلم عليهم\n وخذلهم لكفرهم\n وبالله التوفيق\n الإشارة: قال الشيخ أبو العباس المرسي رضي الله عنه: الأنبياء - عليهم السلام - خُلقوا من الرحمة\n ونبينا صلى الله عليه وسلم هو عين الرحمة\n قال تعالى: { وما أرسلناك إِلا رحمة للعالمين }\n هـ\n وقال أيضًا: الأنبياء - عليهم السلام - لأممهم صدقة\n ونبينا صلى الله عليه وسلم لنا هدية\n قال صلى الله عليه وسلم:\n \" وأنا النعمة المهداة \" \n\n فالصدقة للفقراء\n والهدية للكبراء\n ثم إن غاية الرحمة: الوصول إلى التوحيد الخاص لأنه سبب الزلفى من الله والاختصاص\n ولذلك أمره به\n بعد أن جعله رحمة\n فقال: { قل إنما يُوحى إليَّ أنما إلهكم إله واحد\n\n\n } الخ\n فمن أعرض عنه فقد أوذن بالبُعد والطرد\n ولعل تأخير العقوبة عنه\n في الدنيا\n استدراج ومتاع إلى حين\n ثم إن الصارف عن الدخول إلى التوحيد الخاص - وهو توحيد العيان -: القواطع الأربع: النفس\n والشيطان\n والدنيا\n والهوى\n زاد بعضهم: الناس - أي: عوام الناس\n فإذا حكم الله بين العبد وبين هذه القواطع\n وصل إلى صريح المعرفة\n { قل ربِّ احكم بالحق } أي: احكم بيني وبين عدوي بحكمك الحق\n حتى تدفعه عني وتدمغَهُ\n { وربنا الرحمن المستعان } به { على ما تصفون } من التعويق والتشغيب\n والله المستعان\n وعليه أتوكل\n ولا حول ولا قوة إلا بالله العلي العظيم\n وصلى الله على سيدنا محمد وآله وصحبه وسلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:153",
      "similarity": 0.5948005058501991
    },
    {
      "verse": "1:5",
      "similarity": 0.5740951005726803
    },
    {
      "verse": "107:7",
      "similarity": 0.5553349889554612
    },
    {
      "verse": "37:159",
      "similarity": 0.5426695566663282
    },
    {
      "verse": "37:180",
      "similarity": 0.5342236634178276
    }
  ]
}