{
  "chapter": "الأنبياء",
  "text": "ام اتخذوا۟ من دونه ءالهة قل هاتوا۟ برهنكم هذا ذكر من معى وذكر من قبلى بل اكثرهم لا يعلمون الحق فهم معرضون",
  "translations": [
    {
      "translation": "Have they taken gods besides God? Say: \"Then bring your proof. Here is the Book of those who are with me, and the Book of those who have gone before me.\" But most men do not know the truth and turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken gods other than Him? Say, (O Muhammad): \"Bring forth your proof! Here is the Book with admonition for those of my time and there are also scriptures with admonition for people before me.\" But most people do not know the Truth, and have, therefore, turned away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they chosen other gods besides God? (Muhammad), ask them, \"Show the proof (in support of such belief). This is (the Quran) which tells us about the (beliefs of the people) in my time and those who lived before me.\" Most of them do not know. Moreover, the truth is that they neglect (the question of belief altogether).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they set up other Gods besides Allah? Say, “Bring your proof; this is the remembrance of those with me and those before me”; but in fact most of them do not know the Truth, so they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken for worship gods besides Him Say: \"Bring your proof. This is the Reminder for those with me and the Reminder for those before me.\" But most of them know not the Truth, so they are averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, have they taken gods besides Him? Say: Bring your proof; this is the reminder of those with me and the reminder of those before me. Nay! most of them do not know the truth, so they turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken gods apart from Him? Say: 'Bring your proof! This is the Remembrance of him who is with me, and the Remembrance of those before me. Nay, but the most part of them know not the truth, so therefore they are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they chosen other gods beside Him? say: Bring your proof (of their godhead). This is the Reminder of those with me and those before me, but most of them know not the Truth and so they are averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken other deities besides Him? Say to them, \"Bring your proofs. This is the reminder of those who are with me and the reminder of those who were before me.\" But most of them do not know the truth, and so they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken gods beside Him? Say thou: forth with your proof This is an admonition unto those with me and an admonition unto those before me. But most of them knew not the truth, and so they are averters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken gods besides Him? Say, ‘Produce your evidence! This is a precept of those who are with me, and a precept of those [who went] before me.’ But most of them do not know the truth, and so they are disregardful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken for worship (other) gods besides him? Say, \"Bring your convincing proof: this is the Message of those with me and the Message of those before me.\" But most of them know not the Truth, and so turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken for worship (other) aliha (gods) besides Him? Say: \"Bring your proof:\" This (the Quran) is the Reminder for those with me and the Reminder for those before me. But most of them know not the Truth, so they are averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they taken gods, other than Him? Say: 'Bring us your proof! Here is the Remembrance of he who is with me and the Remembrance of those before me' But no, most of them do not know the truth, therefore they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken, besides Him, other gods? Say, “Bring your proof. This is a message for those with me, and a message of those before me.” But most of them do not know the truth, so they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they taken gods besides Him? Say, [O Muhammad], \"Produce your proof. This [Qur'an] is the message for those with me and the message of those before me.\" But most of them do not know the truth, so they are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:24] Or have they chosen besides Him, exalted be He, other than Him, gods? (herein is an interrogative meant as a rebuke). Say: ‘Bring your proof, for this — but such a thing is impossible. This is the Remembrance of those with me, namely, my community, and that [Remembrance] is the Qur’ān, and the Remembrance of those before me, of communities, namely, the Torah and the Gospel and other Books of God, not a single one of which contains the statement that with God there exists another god, in the way that they claim — exalted be He above such a thing. Nay, but most of them do not know the truth, the affirmation of God’s Oneness, and so they are disregardful’, of that discernment that leads to [knowledge of] it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "352 (Or have they chosen) or have they worshipped (other gods) idols (beside Him) beside Allah? (Say) to them, Muhammad: (Bring your proof (of their godhead)) bring your proofs for the validity of their worship. (This) i.e. the Qur'an (is the Reminder of those with me) is the events of those with me (and those before me) and the events of those who were before among the believers and disbelievers, and it does not contain that Allah has children or partners, (but most of them) all of them (know not the Truth) nor believe in Muhammad (pbuh) and the Qur'an (and so they are averse) they disbelieve in Muhammad (pbuh) and in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومع علو شأنه ووضوح برهانه وظهور وحدة ذاته واستقلاله في ألوهيته وربوبيته، ترددوا فيه، وفي توحيده { أَمِ ٱتَّخَذُواْ } أي: بل قد أخذوا { مِن دُونِهِ آلِهَةً } شركاء له سبحانه لا واحداً، بل متعدداً وعبدوها كعبادته سبحانه ظلماً وزوراً وجهلاً وعناداً { قُلْ } يا أكمل الرسل إلزاماً لهم وتبكيتاً: { هَاتُواْ } أيها المشركون المثبتون لله الواحد الأحد الصمد شريكاً { بُرْهَانَكُمْ } على وجود آلهةٍ سواه عقلاً أو نقلاً إن كنتم من ذوي الألباب وأهل العقد والرشاد، ولا سبيلَ لكم إلى الدليل العقلي، إذ برهان التمانع قطعَ عرق الشركة بالمرة، ولا إلى النقل، إذ جميع الكتب الإلهية متطابقةُ في توحيد الحق، ونفي الشرك عنه سبحانه إذ { هَـٰذَا } الكتاب الجامع لجميع ما في الكتب السالفة المنزلة عليَّ { ذِكْرُ مَن مَّعِيَ } أي: عظة وتذكير يذكر من معي من المؤمنين من أصحابي { وَذِكْرُ مَن قَبْلِي } من أمم الأنبياء الماضيين لو صدقوه وقبلوا ما فيه، لكنهم لا يصدقونه ليهديهم إلى الحق { بَلْ أَكْثَرُهُمْ } جاهلون { لاَ يَعْلَمُونَ ٱلْحَقَّ } ولا يعرفون الحق الصريح الظاهر في الآفاق بلا سترةٍ وحجابٍ { فَهُمْ } لغلظ حجبهم وكثافة غشاوتهم { مُّعْرِضُونَ } [الأنبياء: 24] عن الحق منكرون له،\n\n\n\n[النور: 40]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { أم اتخذوا من دونه آلهة } ، هو إضراب وانتقال من إظهار بطلان كون ما اتخذوه آلهة بإظهار خلوها من خصائص الألوهية، التي من جملتها إنشار الموتى، وإقامة البرهان القاطع على استحالة تعدد الإله، إلى إظهار بُطلان اتخاذهم تلك الآلهة، مع عرائها عن تلك الخصائص، وتبكيتهم بإلجائهم إلى إقامة البرهان على دعواهم الباطلة\n والهمزة: لإنكار ما اتخذوه واستقباحه، أي: بل اتخذوا من دونه - أي: متجاوزين إياه تعالى، مع ظهور شؤونه الجليلة الموجبة لتفرده بالألوهية - آلهة، مع ظهور خلوهم عن خصوص الإلهية بالكلية\n { قلْ } لهم، بطريق التبكيت: { هاتُوا برهانكم } على ما تَدَّعونَه، من جهة العقل والنقل فإنه لا صحة لقول لا دليل عليه في الأمور الدينية، لا سيما في هذا الأمر الخطير، فإن بُهتوا فقل لهم: { هذا ذكر مَنْ معي وذكر مَنْ قبلي } أي: بهذا نطقت الكتب السماوية قاطبة، وشهدت به سُنَّة الرسل المتقدمة كافة\n فهذا الوحي الوارد في شأن التوحيد المتضمن للبرهان القاطع { ذُكرُ من معي } من أمتي، أي: عظتهم، { وذكرُ مَن قبلي } من الأمم السالفة، أي: بهذا أمَرنا ربُنا ووعظنا، وبه أمر مَنْ قبلنا، يعني: انفراده سبحانه بالألوهية واختصاصه بها\n وقيل: المعنى: هذا كتاب أُنزل على أمتي، وهذا كتاب أُنزل على أمم الأنبياء - عليهم السلام - قبلي، فانظروا: هل في واحد منها غير الأمر بالتوحيد والنهي عن الإشراك، ففيه تبكيت لهم\n\n\n{ بل أكثرهم لا يعلمون الحقَّ } أي: لا يفهمونه، ولا يميزون بينه وبين الباطل، فهو إضراب وانتقال من تبكيتهم بمطالبة البرهان، إلى بيان أنه لا ينجع فيهم المحاججة لجهلهم وعنادهم، ولذلك قال: { فهم معرضون } أي: فهم لأجل جهلهم وعتوهم مستمرون على الإعراض عن التوحيد واتباع الرسول، لا يَرْعَوُونَ عما هم عليه من الغي والضلال، وإن كررت عليهم البينات والحجج\n أو معرضون عما ألقى عليهم من البراهين العقلية والنقلية لانهماكهم\n { وما أرسلنا مِن قَبْلِكَ من رسولٍ إِلا يوحى إِليه أنه لا إِله إِلا أنا فاعبدون } ، هذا مقرر لما قبله من كون التوحيد مما نطقت به الكتب الإلهية، وأجمعت عليه الرسل - عليهم السلام - قاطبة\n وصيغة المضارع في يوحى لحكاية الحال الماضية استحضارًا لصورة الوحي العجيبة\n والله تعالى أعلم\n الإشارة: قوله تعالى: { ومن عنده لا يستكبرون عن عبادته } ، العندية، هنا، عندية اصطفاء وتقريب، وهذه صفة العارفين المقربين، لا يستكبرون عن عبادته، بل خاضعون لجلاله وقهريته على الدوام، ولا يستحسرون: لا يملُّون منها ولا يشبعون، غير أنهم يتلونون فيها من عبادة الجوارح إلى عبادة القلوب كالتفكر والاعتبار، إلى عبادة الأرواح كالشهود والاستبصار، إلى عبادة الأسرار كالعكوف في حضرة الكريم الغفار، يُنزهون الله تعالى في جميع الأوقات، لا يفترون عن تسبيحه بالمقال أو الحال\n وقوله تعالى: { أم اتخذوا آلهة\n\n\n } الخ، تَصْدُق على من مال بقلبه إلى محبة الأكوان، أو ركن إلى الحظوظ والشهوات، وقوله تعالى: { لو كان فيهما آلهة إِلا الله لفسدتا } ، اعلم أن ثلاثة اشياء إذا تعدد مدبرها فسد نظامها أولها: الألوهية، فلو تعددت لفسد نظام العالم، وثانيها: السلطنة، إذا تعددت في قُطْر واحد فسدت الرعية، وثالثها: الشيخوخة، إذا تعددت على مريد واحد فسدت ترتبيته، كالطبيب إذا تعدد على مريض واحد فسد علاجه\n والله تعالى أعلم\n وقوله تعالى: { لا يُسأل عما يفعل وهم يُسألون } قال الكواشي: يعني: لا يُسأل عن فعله وحُكمه لأنه الرب، وهم يُسألون لأنهم عبيده\n وبعض الناس يقول: هذه آية الدبوس\n قلت: وقد تقلب السين زايًا، ومعناها: أن كل ما تحكم به القدرة يجب حنو الرأس له، من غير تردد ولا سؤال\n ثم قال: ولو نظر النظر الصحيح لرآها أنصف آية في كتاب الله تعالى وذلك لأنه جمع فيها بين صفة الربوبية وصفة العبودية\n هـ\n وقوله: { وما أرسلنا من قبلك من رسول إِلا نُوحيَ إِليه أنه لا إله إلا أنا } يعني: أن التوحيد مما أجمعت عليه الرسل والكتب السماوية\n والفناء فيه على ثلاثة أقسام: فناء في توحيد الأفعال، وهو ألا يرى الفعل إلا من الله، ويغيب عن الوسائط والأسباب، وفناء في توحيد الصفات، وهو أن يرى ألا قادر ولا سميع ولا بصير ولا متكلم إلا الله، وفناء في توحيد الذات، وهو أن يرى ألا موجود إلا الله، ذوقًا ووجدًا وعقدًا\n كما قال صاحب العينية:\n\nوقد أشار بعضهم إلى هذه الفناءات، فقال:\n\nوهنا - أي: في مقام الفناء والبقاء - انتهت أقدام السائرين، ورسخت أسرار العارفين، مع ترقيات وكشوفات أبد الآبدين، جعلنا الله من حزبهم\n آمين\n ثمَّ انكر على من ادعى الولد له\n",
      "translations": []
    }
  ]
}