{
  "chapter": "الأنبياء",
  "text": "لو كان فيهما ءالهة الا الله لفسدتا فسبحن الله رب العرش عما يصفون",
  "translations": [
    {
      "translation": "If there had been any gods besides Allah in heaven or earth, they would both be ruined. Glory be to Allah, Lord of the Throne, beyond what they describe!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been gods apart from God, both (the heavens and the earth) would have been despoiled. Much too glorious is God, the Lord of the mighty throne, for things they assert!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been any gods in the heavens and the earth apart from Allah, the order of both the heavens and the earth would have gone to ruins. Glory be to Allah, the Lord of the Throne, Who is far above their false descriptions of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been other deities in the heavens and the earth besides God, both the heavens and the earth would have been destroyed. God, the Lord of the Throne, is too Glorious to be as they think He is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If other than Allah, there were Gods* in the heavens and the earth, they would be destroyed; therefore Purity is to Allah, Owner of the Throne, from the matters that they fabricate. (* Which is not possible. ** The heavens and the earth.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been therein (in the heavens and the earth) gods besides Allah, then verily, both would have been ruined. Glorified be Allah, the Lord of the Throne, (High is He) above all that (evil) they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there had been in them any gods except Allah, they would both have certainly been in a state of disorder; therefore glory be to Allah, the Lord of the dominion, above what they attribute (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, were there gods in earth and heaven other than God, they would surely go to ruin; so glory be to God, the Lord of the Throne, above that they describe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there were therein gods beside Allah, then verily both (the heavens and the earth) had been disordered. Glorified be Allah, the Lord of the Throne, from all that they ascribe (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there had been in the heavens and on the earth, other deities besides God, both the heavens and earth would be ruined. God, Lord of the throne, is far above that which they ascribe to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been in between the twain gods except Allah surely the twain would have gone to ruin. Hallowed be Allah, the Lord of the Throne, from that which they utter!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been any gods in them other than Allah, they would surely have fallen apart. Clear is Allah, the Lord of the Throne, of what they allege [concerning Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there were, in the heavens and the earth, other gods besides Allah, there would have been confusion in both! but glory to Allah, the Lord of the Throne: (High is He) above what they attribute to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been therein (in the heavens and the earth) gods besides Allah, then verily both would have been ruined. Glorified be Allah, the Lord of the Throne, (High is He) above what they attribute to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been gods in heaven or earth, other than Allah, both would indeed have been ruined. Exalted be Allah, Lord of the Throne, above that they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there were in them gods other than God, they would have gone to ruin. So glory be to God, Lord of the Throne, beyond what they allege.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been within the heavens and earth gods besides Allah, they both would have been ruined. So exalted is Allah, Lord of the Throne, above what they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:22] Had there been in [either of] them, that is, [in] the heavens and the earth, gods other than God, that is, other than Him, the two would have surely deteriorated, they [the heavens and the earth] would have deviated from their observed order, because counteractive forces would exist among such [gods], as is usually the case, when there is more than one ruler, that there is counteraction and a lack of consensus regarding something. So glory be to God — an exaltation — the Lord, the Creator, of the Throne, al-kursī, above what they ascribe, the disbelievers, to God, of His having a partner and otherwise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَوْ كَانَ فِيهِمَا آَلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا فَسُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ (22)جملة مبينة للإنكار الذي في قوله تعالى { أم اتخذوا آلهة } \\[ الأنبياء : 21 \\] ولذلك فصلت ولم تعطف .وضمير المثنى عائد إلى { السموات والأرض } \\[ الأنبياء : 19 \\] من قوله تعالى : { وله من في السموات والأرض } \\[ الأنبياء : 19 \\] أي لو كان في السماوات والأرض آلهة أخرى ولم يكن جميع من فيها مِلكاً لله وعباداً له لفسدت السماوات والأرض واختل نظامهما الذي خُلقتا به .وهذا استدلال على بطلان عقيدة المشركين إذ زعموا أن الله جعل آلهة شركاء له في تدبير الخلق ، أي أنه بعد أن خلق السماوات والأرض أقام في الأرض شركاء له ، ولذلك كانوا يقولون في التلبية في الحج «لبيكَ لا شريك لك إلاّ شريكاً هو لك تملكه ومَا ملك» وذلك من الضلال المضطرب الذي وضعه لهم أيمة الكفر بجهلهم وترويج ضلالهم على عقول الدهماء .وبذلك يتبين أن هذه الآية استدلال على استحالة وجود آلهة غير الله بعد خلق السماوات والأرض لأن المشركين لم يكونوا ينكرون أن الله هو خالق السماوات والأرض ، قال تعالى : { ولئن سألتهم من خلق السموات والأرض ليقولن الله } في سورة \\[ الزمر : 38 \\] ، وقال تعالى : { ولئن سألتهم من خلق السموات والأرض ليقولن خلقهن العزيز العليم } في سورة الزخرف ( 9 ). فهي مسوقة لإثبات الوحدانية لا لإثبات وجود الصانع إذ لا نزاع فيه عند المخاطبين ، ولا لإثبات انفراده بالخلق إذ لا نزاع فيه كذلك ، ولكنها منتظمة على ما يناسب اعتقادهم الباطل لكشف خطئهم وإعلان باطلهم .والفساد : هو اختلال النظام وانتفاء النفع من الأشياء . ففساد السماء والأرض هو أن تصيرا غير صالحتين ولا منتسقتي النظام بأن يبطل الانتفاع بما فيهما . فمن صلاح السماء نظام كواكبها ، وانضباط مواقيت طلوعها وغروبها ، ونظام النور والظلمة . ومن صلاح الأرض مهدها للسير ، وإنباتها الشجرَ والزرع ، واشتمالها على المرعى والحجارة والمعادن والأخشاب ، وفساد كل من ذلك ببطلان نظامه الصالح .ووجه انتظام هذا الاستدلال أنه لو تعددت الآلهة للزم أن يكون كل إله متصفاً بصفات الإلهية المعروفةِ آثارها ، وهي الإرادة المطلقة والقدرة التامة على التصرف ، ثم إن التعدد يقتضي اختلاف متعلقات الإرادات والقُدَر لأن الآلهة لو استوت في تعلقات إراداتها ذلك لكان تعدد الآلهة عبثاً للاستغناء بواحد منهم ، ولأنه إذا حصل كائن فإن كان حدوثه بإرادة متعددين لزم اجتماع مؤثريْن على مؤثّر واحد وهو محال لاستحالة اجتماع علتين تامتين على معلول واحد . فلا جرم أن تعدد الآلهة يستلزم اختلاف متعلقات تصرفاتها اختلافاً بالأنواع ، أو بالأحوال ، أو بالبقاع ، فالإله الذي لا تنفذ إرادته في بعض الموجودات ليس بإله بالنسبة إلى تلك الموجودات التي أوجدها غيره .ولا جرم أن تختلف متعلقات إرادات الآلهة باختلاف مصالح رعاياهم أو مواطنهم أو أحوال تصرفاتهم فكل يغار على ما في سُلطانه .فثبت أنّ التعدد يستلزم اختلاف الإرادات وحدوثَ الخلاف .ولما كان التماثل في حقيقة الإلهية يقتضي التساوي في قوة قدرة كل إله منهم ، وكان مقتضياً تمام المقدرة عند تعلق الإرادة بالقهر للضد بأن لا يصده شيء عن استئصال ضده ، وكل واحد منهم يدفع عن نفسه بغزو ضده وإفساد ملكه وسلطانه ، تعين أنه كلما توجه واحد منهم إلى غزو ضده أن يُهلك كلَّ ما هو تحت سلطانه فلا يزال يَفْسُد ما في السماوات والأرض عند كل خلاف كما قال تعالى : { وما كان معه من إله إذن لذهب كل إله بما خلق ولعلا بعضهم على بعض } في سورة المؤمنون ( 91 ).فلا جرم دلت مشاهدة دوام السماوات والأرض على انتظامهما في متعدد العصور والأحوال على أنّ إلهَها واحد غير متعدد .فأما لو فُرض التفاوت في حقيقة الإلهية فإن ذلك يقتضي رُجحان بعض الآلهة على بعض ، وهو أدخل في اقتضاء الفساد إذ تصير الغلبة للأقوى منهم فيجعل الكل تحت كلاكله ويَفسد على كل ضعيف منهم ما هو في حَوزته فيكون الفساد أسرع .وهذا الاستدلال باعتبارِ كونه مسوقاً لإبطال تعدّدِ خاص ، وهو التعدد الذي اعتقده أهل الشرك من العرب واليونان الزاعمِين تعدد الآلهة بتعدد القبائل والتصرفات ، وكذا ما اعتقده المانوية من الفرس المثبتين إلهين أحدهما للخير والآخر للشّر أو أحدهما للنور والآخر للظلمة هو دليل قطعي .وأما باعتبار ما نحاه المتكلمون من الاستدلال بهذه الآية على إبطال تعدد الآلهة من أصله بالنسبة لإيجاد العالم وسمّوه برهان التمانع ، فهو دليل إقناعي كما قال سعد الدين التفتزاني في «شرح النسفية» . وقال في «المقاصد» : «وفي بعضها ضعف لا يخفى» .وبيانه أن الاتفاق على إيجاد العالم يمكن صدوره من الحكيمين أو الحكماء فلا يتم الاستدلال إلا بقياس الآلهة على الملوك في العُرف وهو قياس إقناعي .ووجه تسميته برهان التمانع أن جانب الدلالة فيه على استحالة تعدد الإله هو فرض أن يتمانع الآلهة ، أي يمنعَ بعضهم بعضاً من تنفيذ مراده ، والخوض فيه مَقامُنا غنيٌّ عنه .والمنظور إليه في الاستدلال هنا هو لزوم فساد السماوات والأرض لا إلى شيء آخر من مقدمات خارجة عن لفظ الآية حتى يصير الدليل بها دليلاً قطعياً لأن ذلك له أدلة أخرى كقوله تعالى { وما كان معه من إله إذن لذهب كل إله بما خلق ولعلا بعضهم على بعض } وسيجيء في سورة المؤمنون ( 91 ).وأما الاستدلال ببرهان التمانع فللمتكلمين في تقريره طريقتان ذكرهما صاحب «المواقف» .الأولى : طريقة الاستدلال بلزوم التمانع بالفعل وهي الطريقة المشهورة . وتقريرها : أنه لو كان للعالم صانعان متماثلان في القدرة ، فلا يخلو إما أن تتفق إرادتاهما وحينئذ فالفعل إن كان بإرادتيهما لزم اجتماع مؤثرين تامين على مؤثر بفتح المثلثة واحدٍ وهو محال لامتناع اجتماع العلتين التامتين على معلول واحد . وإن كان الفعل بإحدى الإرادتين دون الأخرى لزم ترجيح إحداهما بلا مُرجح لاستوائهما في الصفة والموصوف بها ، وإما أن تختلف إرادتاهما فيلزم التمانع ، ومعناه أن يمنع كل منهما الآخر من الفعل لأن الفرض أنهما مستويان في القدرة .ويرد على الاستدلال بهاته الطريقة أمور :أحدها أنه لا يلزم تساوي الإلهين في القدرة بل يجوز عقلاً أن يكون أحدهما أقوى قدرةً من الآخر ، وأجيب عنه بأن العجز مطلقاً مناف للألوهية بداهةً . قاله عبد الحكيم في «حاشية البيضاوي» .الأمر الثاني : يجوز أن يتفق الإلهان على أن لا يريد أحدهما إلا الأمرَ الذي لم يرده الآخر فلا يلزم عجز من لم يفعل .الأمر الثالث : يجوز أن يتفق الإلهان على إيجاد الأمر المراد بالاشتراك لا بالاستقلال .الأمر الرابع : يجوز تفويض أحدهما للآخر أن يفعل فلا يلزم عجز المفوّض لأن عدم إيجاد المقدور لمانععٍ أرَاده القادرُ لا يسمّى عجزاً ، لا سيما وقد حصل مراده ، وإن لم يفعله بنفسه .والجواب عن هذه الثلاثة الأخيرة أنّ في جميعها نقصاً في الألوهية لأن الألوهية من شأنها الكمال في كل حال .إلا أن هذا الجواب لا يخرج البرهان عن حد الإقناع .الطريقة الثانية : عول عليها التفتزاني في «شرح العقائد النسفية» وهي أنّ تعدد الإلهين يستلزم إمكان حصول التمانع بينهما ، أي أن يمنع أحدهما ما يريده الآخر ، لأن المتعددين يجوز عليهم الاختلاف في الإرادة . وإذا كان هذا الإمكان لازماً للتعدد فإن حصل التمانع بينهما إذ تعلقت إرادة أحدهما بوجود شخص معين وتعلقت إرادة الآخر بعدم وجوده ، فلا يصح أن يحصل المُرَادَاننِ معاً للزوم اجتماع النقيضين ، وإن حصل أحد المرادين لزم عجز صاحب المراد الذي لم يحصل ، والعجزُ يستلزم الحدوث وهو محال ، فاجتماع النقيضين أو حدوث الإله لازمُ لازِممِ لازممٍ للتعدد وهو محال ، ولازم اللازم لازمٌ فيكون الملزوم الأول محالاً ، قال التفتزاني : وبه تندفع الإيرادات الواردة على برهان التمانع .وأقول يرد على هذه الطريقة أن إمكان التمانع لا يوجب نهوض الدليل ، لأن هذا الإمكان يستحيل وقوعه باستحالة حدوث الاختلاف بين الإلهين بناء على أنّ اختلاف الإرادة إنما يجيء من تفاوت العلم في الانكشاف به ، ولذلك يقل الاختلاف بين الحكماء . والإلهان نفرضهما مستويين في العلم والحكمة فعلمهما وحكمتهما يقتضيان انكشافاً متماثلاً فلا يريد أحدهما إلا ما يريده الآخر فلا يقع بينهما تمانع ، ولذلك استدل في المقاصد على لزوم حصول الاختلاف بينهما بحكم اللزوم العادي .بقي النظر في كيفية صدور الفعل عنهما فذلك انتقال إلى ما بنيت عليه الطريقة الأولى .وإن احتمال اتفاق الإلهين على إرادة الأشياء إذا كانت المصلحة فيها بناء على أنّ الإلهين حكيمان لا تختلف إرادتهما ، وإن كان احتمالاً صحيحاً لكن يصير به تعدد الإله عبثاً لأن تعدد ولاة الأمور ما كان إلا لطلب ظهور الصواب عند اختلافهما ، فإذا كانا لا يختلفان فلا فائدة في التعدد ، ومن المحال بناء صفة أعلى الموجودات على ما لا أثر له في نفس الأمر ، فالآية دليل قطعي .ثم رجع عن ذلك في «شرح النسفية» فحقق أنها دليل إقناعي على التقديرين ، وقال المحقق الخيالي إلى أنها لا تكون دليلاً قطعياً إلا بالنظر إلى تحقيق معنى الظرفية من قوله تعالى { فيهما ، } وعين أن تكون الظرفية ظرفية التأثير ، أي لو كان مؤثر فيهما ، أي السماوات والأرض غير الله تكون الآية حجة قطعية . وقد بسطه عبد الحكيم في «حاشيته على الخيالي» ولا حاجة بنا إلى إثبات كلامه هنا .والاستثناء في قوله تعالى { إلا الله } استثناء من أحد طرفي القضية لا من النسبة الحكمية ، أي هو استثناء من المحكوم عليه لا من الحكم . وذلك من مواقع الاستثناء لأن أصل الاستثناء هو الإخراج من المستثنى منه فالغالب أن يكون الإخراج من المستثنى باعتبار تسلط الحكم عليه قبلَ الاستثناء وذلك في المفرغ وفي المنصوب ، وقد يكون باعتباره قبل تسلط الحكم عليه وذلك في غير المنصوب ولا المفرغ فيقال حينئذ إن ( إلا ) بمعنى غير والمستثنى يعرب بدلاً من المستثنى منه .وفُرع على هذا الاستدلال إنشاءُ تنزيه الله تعالى عن المقالة التي أبطلها الدليل بقوله تعالى : { فسبحان الله ربّ العرش عما يصفون } أي عما يصفونه به من وجود الشريك .وإظهار اسم الجلالة في مقام الإضمار لتربية المهابة .ووصفه هنا برب العرش للتذكير بأنه انفرد بخلق السماوات وهو شيء لا ينازعون فيه بل هو خالق أعظم السماوات وحاويها وهو العرش تعريضاً بهم بإلزامهم لازم قولهم بانفراده بالخلق أن يلزم انتفاء الشركاء له فيما دون ذلك .\n\n",
      "translations": [
        {
          "translation": "(If there were therein) in the heavens and earth (Gods beside Allah) other than Allah, (then verily both had been disordered) the dwellers of the heavens and the earth would have been destroyed. (Glorified be Allah, the Lord of the Throne, from all that they ascribe (unto Him)) from the children and partners they ascribe to Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فلا بدَّ لهم أن ينشروا فكيف يثبتون أولئك المشركون تعددَ الآلهة مع أنه { لَوْ كَانَ فِيهِمَآ } أي: في السماء والأرض { آلِهَةٌ إِلاَّ ٱللَّهُ } أي: غير الله الواحد القهار للأغيار مطلقاً { لَفَسَدَتَا } واختل نظامها\n ولم يبقا على الهيئة المخصوصة المشاهدة ألبتة\n إذ المفهوم من الإلهة هو المستقل في التصرف والآثار بالإرادة والاختيار\n فكلُ من الآلهة المتعددة متصفُ بجميع أوصاف الألوهية بالاستقلال\n فلا يمكن اتفاقهم على أمرٍ من الأمور { فَسُبْحَانَ ٱللَّهِ } الواحد الأحد الصمد المستقلِّ في الألوهية والربوبية بلا شريكٍ له في ملكه\n بل في الوجود والتحقق { رَبِّ ٱلْعَرْشِ } أي: عروش جميع المظاهر المستولي عليها\n إذ لا ظهور لها إلا منه { عَمَّا يَصِفُونَ } [الأنبياء: 22] من اتخاذ الولد والشريك والصاحبة والنظير\n لتوحيده في الوجود واستقلاله في التصرف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لفسدَتَا } أي: لفسد نظامهما بما فيهما\n لوجود التمانع\n كعادة الملوك\n أو لبطلتا بما فيهما\n ولم يوجد شيء منهما للزوم العجز لهما\n بيان ذلك: أن الألوهية مستلزمة للقدرة على الاسْتِبْدَادِ بالتصرف فيهما على الإطلاق\n تغييرًا وبديلاً\n وإيجادًا وإعدامًا\n وإحياء وإماتة\n فبقاؤهما على ما هما عليه من غير فساد\n إما بتأثير كل منها\n وهو محال لاستحالة وقوع الأثر الواحد بين مؤثرين\n وإما بتأثير واحد منها\n فالباقي بمعزل عن الإلهية\n والمسألة مقررة في علم الكلام\n\nو { إلا }: صفة لآلهة\n كما يُوصف بغير\n ولمَّا كانت حرفًا\n ظهر إعرابها في اسم الجلالة\n ولا يصح رفعه على البدل لعدم وجود النفي\n ثم قال تعالى: { فسبحان الله } أي: فسبحوا سُبحان الله اللائق به\n وننزهوه عما لا يليق به من الأمور\n التي من جملتها: أن يكون له شريك في الألوهية\n وإيراد الجلالة في موضع الإضمار\n حيث لم يقل فسبحانه للإشعار بعلية الحكم\n فإنَّ الألوهية مناط لجميع صفات كماله\n التي من جملتها: تنزهه تعالى عما لا يليق به\n ولتربية المهابة وإدخال الروعة\n ثم وصفه بقوله: { ربِّ العرش } \n وخصه بالذكر\n مع كونه رب كل شيء لعظم شأنه لأنَّ الأكوان في جوفه كلا شيء\n أي: تنزيهًا له عما يصفونه عن أن يكون من دونه آلهة\n ثم بيَّن قوة عظمته وعز سلطانه القاهر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:82",
      "similarity": 0.8666944641236883
    },
    {
      "verse": "37:159",
      "similarity": 0.7320639649983173
    },
    {
      "verse": "37:180",
      "similarity": 0.7110101429723313
    },
    {
      "verse": "23:91",
      "similarity": 0.5542505298955381
    },
    {
      "verse": "21:112",
      "similarity": 0.4467013158365878
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}