{
  "chapter": "الأنبياء",
  "text": "يعلم ما بين ايديهم وما خلفهم ولا يشفعون الا لمن ارتضى وهم من خشيته مشفقون",
  "translations": [
    {
      "translation": "He knows what is in front of them and what is behind them. They only intercede on behalf of those with whom He is pleased, and even they are apprehensive out of fear of Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what was there before them and what came after them; and they did not intercede for any one but whom He willed, and they were filled with awe of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows whatever is before them and whatsoever is remote from them and they do not intercede except for him, intercession on whose behalf pleases Him, and they stand constantly in awe of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows all that is in front of them and all that is behind them. (These servants of God) will not intercede with Him for anyone without His permission and they tremble in awe (before His greatness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is before them and what is behind them, and they do not intercede except for him whom He likes, and they fear with awe of Him. (The Holy Prophets and virtuous people will be given the permission to intercede. Prophet Mohammed – peace and blessings be upon him – will be the first to intercede.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is before them, and what is behind them, and they cannot intercede except for him with whom He is pleased. And they stand in awe for fear of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is before them and what is behind them, and they do not intercede except for him whom He approves and for fear of Him they tremble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is before them and behind them, and they intercede not save for him with whom He is well-pleased, and they tremble in awe of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knoweth what is before them and what is behind them, and they cannot intercede except for him whom He accepteth, and they quake for awe of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is before them and what is behind them, and they cannot intercede without His permission. Indeed they themselves stand in awe of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knoweth whatsoever is before them and whatsoever is behind them; and they intercede not except for him whom He approveth, and in awe of Him they are fearful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows that which is before them and that which is behind them, and they do not intercede except for someone He approves of, and they are apprehensive for the fear of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is before them, and what is behind them, and they offer no intercession except for those who are acceptable, and they stand in awe and reverence of His (Glory).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is before them, and what is behind them, and they cannot intercede except for him with whom He is pleased. And they stand in awe for fear of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is before them and what is behind them. They intercede for none except for him whom He is well pleased, and they tremble in awe of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is before them, and what is behind them; and they do not intercede except for him whom He approves; and they tremble in awe of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows what is [presently] before them and what will be after them, and they cannot intercede except on behalf of one whom He approves. And they, from fear of Him, are apprehensive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:28] He knows what is before them and what is behind them, that is, what they have done and what they will do, and they do not intercede except for him with whom He is satisfied, that he be interceded for, and they, for awe of Him, exalted be He, are apprehensive, fearful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He knoweth what is before them) of the matter of the Hereafter (and what is behind them) of the matter of this worldly life, (and they) i.e. the angels (cannot intercede) on the Day of Judgement (except for him whom He accepteth) except for those who profess Allah's divine Oneness and with whose monotheism Allah is pleased, (and they quake for awe of Him) among those who fear Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يعملون بأمره إذ هو { يَعْلَمُ } بعلمه الحضوري منهم ومن أحوالهم { مَا بَيْنَ أَيْدِيهِمْ } أي: ما هو حاضرٌ عندهم\n معلومٌ دونهم من أحوالهم وأفعالهم { وَمَا خَلْفَهُمْ } أي: ما هو غائبُ عنهم ومجهولُ لديهم { وَ } إن خرجوا عن مقتضى أمره سبحانه { لاَ يَشْفَعُونَ } أي: لا تقبل شفاعتهم لغيرهم\n أو لا يُشفع لهم عند الله بعدما خرجوا عن مقتضى حكمه { إِلاَّ لِمَنِ ٱرْتَضَىٰ } سبحانه\n ورضي بشفاعة من يشفع لهم وأَذِن { وَ } كيف يشفع عنده سبحانه بغير إذنه ورضاه؟ إذ { هُمْ } أي: الشفعاء { مِّنْ } كمال { خَشْيَتِهِ } سبحانه ومن غاية سطوته وهيبته وقهره { مُشْفِقُونَ } [الأنبياء: 28] خائفون مرعوبون وَجلون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يعلمُ ما بين أيديهم وما خلْفَهم } أي: ما عملوا وما هم عاملون\n وقيل: ما كان قبل خلقهم وما يكون بعد خلقهم\n وهو تقرير لتحقق عبوديتهم لأنهم إذا كانوا مقهورين تحت علمه تعالى وإحاطته انتفت عنهم أوصاف الربوبية المكتَسبَة من مجانسة البنوة\n { ولا يشفعون إِلا لمن ارتضى } أن يشفع له\n مهابة منه تعالى\n قال ابن عباس: \" هم أهل لا إله إلا الله \" \n { وهم من خشيته } عزّ وجلّ { مشفقون }: خائفون مرتعدون\n قال بعضهم: أصل الخشية: الخوف مع التعظيم\n ولذلك خص بها العلماء\n وأصل الإشفاق: الخوف مع الاعتناء\n فعند تعديته بمن: يكون معنى الخوف فيه أظهر\n وعند تعديته بعلى: ينعكس الأمر فيكون معنى الإشفاق فيه أظهر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:57",
      "similarity": 0.7407555669403076
    },
    {
      "verse": "21:49",
      "similarity": 0.6580218017198005
    },
    {
      "verse": "70:27",
      "similarity": 0.6275360820350953
    },
    {
      "verse": "52:26",
      "similarity": 0.6043533076252288
    },
    {
      "verse": "84:16",
      "similarity": 0.5722977223631042
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/21:28.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/21:28.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/21:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}