{
  "chapter": "الأنبياء",
  "text": "ومن يقل منهم انى اله من دونه فذلك نجزيه جهنم كذلك نجزى الظلمين",
  "translations": [
    {
      "translation": "If any one of them said: \"I am God besides Him,\" We should award him Hell; for this is how We requite the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone of them were to claim: \"Indeed I am a god apart from Him,\" We shall recompense both with Hell. Thus do We recompense the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense of those of them who say that they are the Lord instead of God will be hell; thus, do We recompense the unjust ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the one among them who says, “I am a God beside Allah” – We shall reward him with hell; this is how We punish the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of them should say: \"Verily, I am a god besides Him,\" such We should recompense with Hell. Thus We recompense the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever of them should say: Surely I am a god besides Him, such a one do We recompense with hell; thus do, We recompense the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of them says, 'I am a god apart from Him', such a one We recompense with Gehenna; even so We recompense the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one of them who should say: Lo! I am a god beside Him, that one We should repay with hell. Thus We Repay wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever of them should say, \"I am a deity besides Him,\" shall be requited with Hell. Thus do We reward the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever of them should say: verily I am a god beside Him, such a one We shall requite with Hell; Thus We requite the wrong- doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should any of them say, ‘I am a god besides Him,’ We will requite him with hell. Thus do We requite the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of them should say, \"I am a god besides Him\", such a one We should reward with Hell: thus do We reward those who do wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of them should say: \"Verily, I am an ilah (a god) besides Him (Allah),\" such a one We should recompense with Hell. Thus We recompense the Zalimun (polytheists and wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any one of them says: 'I am a god other than Him' We will recompense him with Gehenna (Hell). As such We recompense the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever of them says, “I am a god besides Him,” We will reward him with Hell. Thus We reward the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever of them should say, \"Indeed, I am a god besides Him\"- that one We would recompense with Hell. Thus do We recompense the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:29] And should any of them say, ‘I am a god besides Him’, that is, [besides] God, in other words, [a god] other than Him — and this is Iblīs, who summoned [others] to worship his soul and commanded that it be obeyed — such a one We will requite with Hell. Thus, in the same way that We requite him, We requite wrongdoers, idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And one of them) of the angels; and it is said this means: of created beings (who should say: Lo! I am a God beside Him) beside Allah, (that one We should repay with hell) Hell will be his lot because of this. (Thus We repay wrong-doers) thus We repay disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } متى كان حال الشفعاء وخشيتهم على هذا المنوال { مَن يَقُلْ مِنْهُمْ إِنِّيۤ إِلَـٰهٌ } مستحقُ للعبادة، مستقلُ في الألوهية { مِّن دُونِهِ } سبحانه { فَذٰلِكَ } أي: بمجرد قولهم هذا، وإن كان غير مطابق لاعتقادهم { نَجْزِيهِ } ونصليه { جَهَنَّمَ } البعد والحرمان ونيران الخيبة والخسران { كَذَلِكَ نَجْزِي ٱلظَّالِمِينَ } [الأنبياء: 29] الخارجين عن مقتضى توحيدنا، المسيئين الأدب معنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن يَقُلْ منهم } أي: من الملائكة إذ الكلام فيهم، { إِني إِلهٌ من دونه } أي: متجاوزًا إياه تعالى، { فذلك } الذي فرض أنه قال ذلك فرض المحال، { نَجْزِيه جهنم } كسائر المجرمين، ولا ينفي هذا عنهم ما ذكر قبلُ من صفاتهم السنية وأفعالهم المرضية لأنه فرض تقدير، وفيه من الدلالة على قوة ملكوته تعالى، وعزة جبروته، واستحالة كون الملائكة بحيث يتوهم في حقهم ما توهمه أولئك الكفرة، ما لا يخفى، { كذلك نجزي الظالمين } أي: مثل ذلك الجزاء الفظيع نجزي الظالمين، الذين يضعون الأشياء في غير مواضعها، ويتعدون أطوارهم\n\n\nقال الكواشي: هذا القول وارد على سبيل التهديد والوعيد الشديد على ارتكاب الشرك، كقوله:\n\n[الأنعَام: 88]\n هـ\n فالقصد: تفظيع أمر الشرك، وأنه لو صدر ممن صدر لأحبط عمله، وكان جزاء صاحبه جهنم، ومثل ذلك الجزاء نجزي الظالمين، وهم الكافرون، والحاصل: أنه على سبيل الفرض، مع علمه تعالى أنه لا يكون من الملائكة، فهو من إخباره عما لا يكون كيف يكون، لعلمه بما لا يكون، مما جاز أن يكون، كيف يكون\n هـ\n من الحاشية الفاسية ببعض اختصار\n فالكاف من \" كذلك \": في محل مصدر تشبيهي، مؤكد لمضمون ما قبله\n والقصر، المستفاد من التقديم للمصدر، معتبر بالنسبة إلى النقصان دون الزيادة، أي: لا جزاء أنقص منه\n والله تعالى أعلم\n الإشارة: أنوار الملكوت متدفقة من بحر أسرار الجبروت، من غير تفريع، ولا تولد، ولا علاج، ولا امتزاج، بل: كن فيكون، لكن حكمته تعالى اقتضت ترتيب الأشياء وتفريع بعضها من بعض، ليبقى السر مصونًا والكنز مدفونًا\n فأسرار الذات العلية منزّهة عن اتخاذ الصاحبة والولد، بل القدرة تُبرز الأشياء بلا علاج ولا أسباب، والحكمة تسترها بوجود العلاج والأسباب\n فكل ما ظهر في عالم التكوين قد عَمَّتْهُ قهرية العبودية، وانتفت عنه نسبة البُنوة لأسرار الربوبية، فأهل الملأ الأعلى عباد مكرمون، مقدّسون من دنس الحس، مستغرقون في هَيَمَان القرب والأنس، وأهل الملأ الأسفل مختلفون، فمن غلب عقلُه على شهوته، ومعناه على حسه، وروحانيته على بشريته، فهو كالملائكة أو أفضل\n ومن غلبت شهوته على عقله، وحسه على معناه، وبشريته على روحانيته، كان كالبهائم أو أضل\n ومن التحق بالملأ الأعلى، من الأولياء المقربين، انسحب عليه ما مدحهم به تعالى من قوله: { يُسبحون الليل والنهار لا يَفْتُرون } ، ومن قوله: { لا يسبقونه بالقول } ، بأن يدبروا معه شيئًا قبل ظهور تدبيره، وهم بطاعته يعملون، ولا يشفعون إلا لمن ارتضى، وهم من خشية هيبته مشفقون، { ومَن يقل منهم إني إله من دونه } بأن يدّعي شيئًا من أوصاف الربوبية، كالكبرياء، والعظمة على عباده، فذلك نجزيه جهنم، وهي نار القطيعة، كذلك نجزي الظالمين\n وفي الحِكَم: \" منعك أن تدّعي ما ليس لك مما للمخلوقين، أفيبيح لك أن تدّعي وصفه وهو رب العالمين \"؟ ثمَّ برهن على وحدانيته\n",
      "translations": []
    }
  ]
}