{
  "chapter": "الأنبياء",
  "text": "وما ارسلنا من قبلك من رسول الا نوحى اليه انه لا اله الا انا۠ فاعبدون",
  "translations": [
    {
      "translation": "We sent no Messenger before you without revealing to him: 'There is no god but Me, so worship Me.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not sent an apostle before you without instructing him that there is no god but I, so worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did We send any Messenger before you to whom We did not reveal: \"There is no god but Me. So serve Me alone.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To all the Messengers that were sent before you We revealed that I am the only God to be worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send any Noble Messenger before you, but We divinely revealed to him that, “There is no God except I (Allah), therefore worship Me alone.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send any Messenger before you but We revealed to him (saying): \"There is no God but I, so worship Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send before you any apostle but We revealed to him that there is no god but Me, therefore serve Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent never a Messenger before thee except that We revealed to him, saying, 'There is no god but I; so serve Me.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent no messenger before thee but We inspired him, (saying): There is no Allah save Me (Allah), so worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent all messengers before you with this revelation: \"There is no deity save Me, so worship Me alone.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not before thee an apostle but We revealed unto him that there is no god but I, so worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send any apostle before you but that We revealed to him that ‘There is no god except Me; so worship Me.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not a messenger did We send before thee without this inspiration sent by Us to him: that there is no god but I; therefore worship and serve Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send any Messenger before you (O Muhammad SAW) but We inspired him (saying): La ilaha illa Ana [none has the right to be worshipped but I (Allah)], so worship Me (Alone and none else).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never sent a Messenger before you except that We revealed to him saying: 'There is no god except Me, therefore, worship Me'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never sent a messenger before you without inspiring him that: “There is no god but I, so worship Me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent not before you any messenger except that We revealed to him that, \"There is no deity except Me, so worship Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:25] And We did not send any Messenger before you but We revealed to him (read nūhī or yūhā, ‘[but] it was revealed to him’) that, ‘There is no god except Me, so worship Me’, that is, affirm My Oneness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ إِلَّا نُوحِي إِلَيْهِ أَنَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدُونِ (25)لما أظهر لرسوله أن المعاندين لا يعلمون الحق لإعراضهم عن تلقّيه أقبل على رسوله صلى الله عليه وسلم بتأييد مقاله الذي لقّنه أن يجيبهم به وهو قوله تعالى : { قل هاتوا برهانكم هذا ذكر من معي وذكر من قبلي } \\[ الأنبياء : 24 \\] ، فأفادهُ تعميمه في شرائع سائر الرسل سواء من أنزل عليه كتاب ومن لم ينزل عليه كتاب ، وسواء من كان كتابه باقياً مثل موسى وعيسى وداود ومن لم يبق كتابه مثل إبراهيم .وليس ذكر هذه الجملة لمجرد تقرير ما قبلها من آي التوحيد وإن أفادت التقرير تبعاً لفائدتها المقصودة . وفيها إظهارٌ لعناية الله تعالى بإزالة الشرك من نفوس البشر وقطع دابره إصلاحاً لعقولهم بأن يُزال منها أفظع خطل وأسخف رأي ، ولم تَقطع دابرَ الشرك شريعةٌ كما قطعه الإسلام بحيث لم يحدث الإشراك في هذه الأمَّة .وحرف ( مِن ) في قوله تعالى { مِن رسول } مزيد لتوكيد النفي .وفرع فيما أوحي إليهم أمرَه إياهم بعبادته على الإعلان بأنه لا إله غيره ، فكان استحقاق العبادة خاصاً به تعالى .وقرأ الجمهور { إلاّ يُوحى إليه بمثناة تحتية مبنياً للنائب ، وقرأه حفص وحمزة والكسائي بالنون مبنياً للفاعل ، والاستثناءُ المفرّع في موضع الحال .\n\n",
      "translations": [
        {
          "translation": "(And We sent no messenger before you) Muhammad (but We inspired him) tell your people that they should say: (There is no God save Me (Allah), so worship Me) so declare My divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه كلاماً جلياً مثبتاً للتوحيد خالياً عن سمة التقليد: { وَمَآ أَرْسَلْنَا } من مقام جودنا وفضلنا { مِن قَبْلِكَ } يا أكمل الرسل من الرسل { مِن رَّسُولٍ } من الرسل الماضين { إِلاَّ نُوحِيۤ إِلَيْهِ } أولاً { أَنَّهُ لاۤ إِلَـٰهَ } يُعبَد بالحق ويستحق للعبادة والإطاعة { إِلاَّ أَنَاْ } المتفرد برداء العظمة والكبرياء\n المنفرد بكمال الجلال\n ودوام البقاء { فَٱعْبُدُونِ } [الأنبياء: 25] أيها الأظلال الهالكة والعكوس المضمحلة الباطلة\n وتذللوا نحوي خاضعين خاشعين\n إذ لا مرجع لكم غيري\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:10",
      "similarity": 0.7957102941108446
    },
    {
      "verse": "53:4",
      "similarity": 0.6651536824530709
    },
    {
      "verse": "99:5",
      "similarity": 0.6325464053496708
    },
    {
      "verse": "38:70",
      "similarity": 0.619298800204628
    },
    {
      "verse": "42:3",
      "similarity": 0.5701157855541893
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021025.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021025.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}