{
  "chapter": "الأنبياء",
  "text": "لو كان فيهما ءالهة الا الله لفسدتا فسبحن الله رب العرش عما يصفون",
  "translations": [
    {
      "translation": "If there had been any gods besides Allah in heaven or earth, they would both be ruined. Glory be to Allah, Lord of the Throne, beyond what they describe!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been gods apart from God, both (the heavens and the earth) would have been despoiled. Much too glorious is God, the Lord of the mighty throne, for things they assert!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been any gods in the heavens and the earth apart from Allah, the order of both the heavens and the earth would have gone to ruins. Glory be to Allah, the Lord of the Throne, Who is far above their false descriptions of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been other deities in the heavens and the earth besides God, both the heavens and the earth would have been destroyed. God, the Lord of the Throne, is too Glorious to be as they think He is.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If other than Allah, there were Gods* in the heavens and the earth, they would be destroyed; therefore Purity is to Allah, Owner of the Throne, from the matters that they fabricate. (* Which is not possible. ** The heavens and the earth.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been therein (in the heavens and the earth) gods besides Allah, then verily, both would have been ruined. Glorified be Allah, the Lord of the Throne, (High is He) above all that (evil) they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there had been in them any gods except Allah, they would both have certainly been in a state of disorder; therefore glory be to Allah, the Lord of the dominion, above what they attribute (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, were there gods in earth and heaven other than God, they would surely go to ruin; so glory be to God, the Lord of the Throne, above that they describe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there were therein gods beside Allah, then verily both (the heavens and the earth) had been disordered. Glorified be Allah, the Lord of the Throne, from all that they ascribe (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there had been in the heavens and on the earth, other deities besides God, both the heavens and earth would be ruined. God, Lord of the throne, is far above that which they ascribe to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been in between the twain gods except Allah surely the twain would have gone to ruin. Hallowed be Allah, the Lord of the Throne, from that which they utter!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been any gods in them other than Allah, they would surely have fallen apart. Clear is Allah, the Lord of the Throne, of what they allege [concerning Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there were, in the heavens and the earth, other gods besides Allah, there would have been confusion in both! but glory to Allah, the Lord of the Throne: (High is He) above what they attribute to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been therein (in the heavens and the earth) gods besides Allah, then verily both would have been ruined. Glorified be Allah, the Lord of the Throne, (High is He) above what they attribute to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been gods in heaven or earth, other than Allah, both would indeed have been ruined. Exalted be Allah, Lord of the Throne, above that they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there were in them gods other than God, they would have gone to ruin. So glory be to God, Lord of the Throne, beyond what they allege.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there been within the heavens and earth gods besides Allah, they both would have been ruined. So exalted is Allah, Lord of the Throne, above what they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:22] Had there been in [either of] them, that is, [in] the heavens and the earth, gods other than God, that is, other than Him, the two would have surely deteriorated, they [the heavens and the earth] would have deviated from their observed order, because counteractive forces would exist among such [gods], as is usually the case, when there is more than one ruler, that there is counteraction and a lack of consensus regarding something. So glory be to God — an exaltation — the Lord, the Creator, of the Throne, al-kursī, above what they ascribe, the disbelievers, to God, of His having a partner and otherwise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If there were therein) in the heavens and earth (Gods beside Allah) other than Allah, (then verily both had been disordered) the dwellers of the heavens and the earth would have been destroyed. (Glorified be Allah, the Lord of the Throne, from all that they ascribe (unto Him)) from the children and partners they ascribe to Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فلا بدَّ لهم أن ينشروا فكيف يثبتون أولئك المشركون تعددَ الآلهة مع أنه { لَوْ كَانَ فِيهِمَآ } أي: في السماء والأرض { آلِهَةٌ إِلاَّ ٱللَّهُ } أي: غير الله الواحد القهار للأغيار مطلقاً { لَفَسَدَتَا } واختل نظامها\n ولم يبقا على الهيئة المخصوصة المشاهدة ألبتة\n إذ المفهوم من الإلهة هو المستقل في التصرف والآثار بالإرادة والاختيار\n فكلُ من الآلهة المتعددة متصفُ بجميع أوصاف الألوهية بالاستقلال\n فلا يمكن اتفاقهم على أمرٍ من الأمور { فَسُبْحَانَ ٱللَّهِ } الواحد الأحد الصمد المستقلِّ في الألوهية والربوبية بلا شريكٍ له في ملكه\n بل في الوجود والتحقق { رَبِّ ٱلْعَرْشِ } أي: عروش جميع المظاهر المستولي عليها\n إذ لا ظهور لها إلا منه { عَمَّا يَصِفُونَ } [الأنبياء: 22] من اتخاذ الولد والشريك والصاحبة والنظير\n لتوحيده في الوجود واستقلاله في التصرف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لفسدَتَا } أي: لفسد نظامهما بما فيهما\n لوجود التمانع\n كعادة الملوك\n أو لبطلتا بما فيهما\n ولم يوجد شيء منهما للزوم العجز لهما\n بيان ذلك: أن الألوهية مستلزمة للقدرة على الاسْتِبْدَادِ بالتصرف فيهما على الإطلاق\n تغييرًا وبديلاً\n وإيجادًا وإعدامًا\n وإحياء وإماتة\n فبقاؤهما على ما هما عليه من غير فساد\n إما بتأثير كل منها\n وهو محال لاستحالة وقوع الأثر الواحد بين مؤثرين\n وإما بتأثير واحد منها\n فالباقي بمعزل عن الإلهية\n والمسألة مقررة في علم الكلام\n\nو { إلا }: صفة لآلهة\n كما يُوصف بغير\n ولمَّا كانت حرفًا\n ظهر إعرابها في اسم الجلالة\n ولا يصح رفعه على البدل لعدم وجود النفي\n ثم قال تعالى: { فسبحان الله } أي: فسبحوا سُبحان الله اللائق به\n وننزهوه عما لا يليق به من الأمور\n التي من جملتها: أن يكون له شريك في الألوهية\n وإيراد الجلالة في موضع الإضمار\n حيث لم يقل فسبحانه للإشعار بعلية الحكم\n فإنَّ الألوهية مناط لجميع صفات كماله\n التي من جملتها: تنزهه تعالى عما لا يليق به\n ولتربية المهابة وإدخال الروعة\n ثم وصفه بقوله: { ربِّ العرش } \n وخصه بالذكر\n مع كونه رب كل شيء لعظم شأنه لأنَّ الأكوان في جوفه كلا شيء\n أي: تنزيهًا له عما يصفونه عن أن يكون من دونه آلهة\n ثم بيَّن قوة عظمته وعز سلطانه القاهر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:82",
      "similarity": 0.8666944641236883
    },
    {
      "verse": "37:159",
      "similarity": 0.7320639649983173
    },
    {
      "verse": "37:180",
      "similarity": 0.7110101429723313
    },
    {
      "verse": "23:91",
      "similarity": 0.5542505298955381
    },
    {
      "verse": "21:112",
      "similarity": 0.4467013158365878
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/21:22.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/21:22.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/21:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}