{
  "chapter": "الأنبياء",
  "text": "لو يعلم الذين كفروا۟ حين لا يكفون عن وجوههم النار ولا عن ظهورهم ولا هم ينصرون",
  "translations": [
    {
      "translation": "If those who are kafir only knew of the time when they will not be able to keep the Fire away from their faces or their backs! And they will receive no help!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only the unbelievers could apprehend the moment when they would neither be able to ward off the fire from their faces and their backs, nor help reach them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only the unbelievers knew of the Hour when they shall not be able to keep off the Fire from their faces, nor from their backs; nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that the unbelievers knew that no one would protect their faces and backs against the fire, nor they would be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only the disbelievers realised the time when they will not be able to stop the fire from their faces and from their backs – and nor are they to be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only those who disbelieved knew (the time) when they will not be able to ward off the Fire from their faces, nor from their backs, and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had those who disbelieve but known (of the time) when they shall not be able to ward off the fire from their faces nor from their backs, nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the unbelievers but knew when that they shall not ward off the Fire from their faces nor from their backs, neither shall they be helped!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If those who disbelieved but knew the time when they will not be able to drive off the fire from their faces and from their backs, and they will not be helped!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only those who deny the truth knew the time when they would not be able to ward off the fire neither from their faces nor from their backs. They will not be helped!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only those who disbelieve have known of the time when they shall not be able to ward off from their faces the Fire nor from their backs, nor shall they be succoured!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only the faithless knew about the time when they will not be able to keep the Fire off their faces and their backs, nor will they be helped!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only the Unbelievers knew (the time) when they will not be able to ward off the fire from their faces, nor yet from their backs, and (when) no help can reach them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only those who disbelieved knew (the time) when they will not be able to ward off the Fire from their faces, nor from their backs; and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the unbelievers only knew when they will be unable to shield either their faces or their backs from the Fire; when they will not be helped!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If those who disbelieve only knew, when they cannot keep the fire off their faces and off their backs, and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If those who disbelieved but knew the time when they will not avert the Fire from their faces or from their backs and they will not be aided...\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:39] [God] exalted be He, says: If those who disbelieved only knew of the time when they shall not [be able to] ward off, repel, the Fire from their faces, nor from their backs, nor shall they be helped, [nor] shall they be protected from it at the Resurrection (the response to the [conditional particle] law, ‘if only’, is [something along the lines of] ‘they would not have said that’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If those who disbelieved) if those who disbelieved in Muhammad (pbuh) and in the Qur'an knew the chastisement awaiting them, they would not ask for it to be hastened, (but knew the time when they will not be able to drive off) when the chastisement comes, they will not be able to push away (the Fire from their faces and from their backs, and they will not be helped) to drive away the chastisement!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تفظيعاً لهم وتهويلاً عليهم: { لَوْ يَعْلَمُ } ويطلع { ٱلَّذِينَ كَفَرُواْ } كيفية ما استعجلوا من العذاب وكميته { حِينَ لاَ يَكُفُّونَ } أي: حين نزل عليهم حتماً\n ولا يمكنهم حينئذٍ أن يدفعوا { عَن وُجُوهِهِمُ ٱلنَّارَ وَلاَ عَن ظُهُورِهِمْ } لأنهم محاطون بها\n مغمورون فيها بحيث لا يسع لهم دفعها بأنفسهم { وَلاَ هُمْ يُنصَرُونَ } [الأنبياء: 39] من الغير\n\n\nإذ كل نفس رهينةُ بما كسبت\n يعني: لو علموا فظاتها وهولها\n لما استعجلوا\n لكنه لا يعلمون لذلك استعجلوا اغتراراً واستكباراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { لو يعلمُ الذين كفروا } \n هذا استئناف مسوق لبيان شدة هول ما يستعجلونه\n وفظاعة ما فيه من العذاب\n وأنهم يستعجلونه لجهلهم بشأنه\n وقوله تعالى: { حين لا يَكُفُّون عن وجوههم النارَ ولا عن ظهورهم ولا هم يُنصرون }: مفعول { يعلم } \n وهو عبارة عن الوقت الموعود\n الذي كانوا يستعجلونه\n وقوله: { لو يعلمُ الذين كفروا } أي: حين يرون ويعلمون حقيقة الحال\n وهو معاينة العذاب\n وجواب \" لو \": محذوف\n أي: لو يعلمون الوقت الذي يستعجلونه بقولهم: متى هذا الوعد؟ وهو الوقت الذي تحيط بهم النار من ورائهم وقدامهم\n فلا يقدرون على دفعها ومنعها من أنفسهم\n ولا يجدون ناصرًا ينصرهم\n لَمَا كانوا بهذه الصفة من الكفر والاستهزاء والاستعجال\n ولكن جهلهم به هو الذي هوّنه عندهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:28",
      "similarity": 0.5428133214437075
    },
    {
      "verse": "48:20",
      "similarity": 0.34213878476387644
    },
    {
      "verse": "13:14",
      "similarity": 0.3404875689489102
    },
    {
      "verse": "5:11",
      "similarity": 0.3246635663382742
    },
    {
      "verse": "37:178",
      "similarity": 0.32143101175321226
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/21:39.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/21:39.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/21:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}