{
  "chapter": "الأنبياء",
  "text": "وهو الذى خلق اليل والنهار والشمس والقمر كل فى فلك يسبحون",
  "translations": [
    {
      "translation": "It is He who created night and day and the sun and moon, each one swimming in a sphere.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created night and day, the sun and the moon, revolving on its orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who created the night and the day, and the sun and the moon. Each of them is floating in its orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has created the night, the day, the Sun, and Moon and has made them swim in a certain orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who created the night and the day, and the sun and the moon; each one floats in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has created the night and the day, and the sun and the moon, each in an orbit floating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who created the night and the day and the sun and the moon; all (orbs) travel along swiftly in their celestial spheres.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the night and the day, the sun and the moon, each swimming in a sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who created the night and the day, and the sun and the moon. They float, each in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the night and the day, and the sun and the moon, each gliding in its orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who hath created the night and the day, and the sun and the moon, each in an orb floating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the night and the day, the sun and the moon, each swimming in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who created the Night and the Day, and the sun and the moon: all (the celestial bodies) swim along, each in its rounded course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has created the night and the day, and the sun and the moon, each in an orbit floating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the night and the day, and the sun and the moon; each floating in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the night and the day, and the sun and the moon; each floating in an orbit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who created the night and the day and the sun and the moon; all [heavenly bodies] in an orbit are swimming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:33] And He it is Who created the night and the day, and the sun and the moon, each (kullun, the nunation of this [particle] stands in place of the second noun [of the genitive construction] that would have been alshams, ‘the sun’, or al-qamar, ‘the moon’, or their subsidiaries, namely, al-nujūm, ‘the stars’) in an orbit, a circular [one] like a mill in the sky, swimming, moving with speed, like a swimmer in water. In order to effect the analogy with the latter, the plural person [of the verb employed] for rational beings is used.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He it is Who created the night and the day, and the sun and the moon) He made the sun and the moon subservient. (They float, each in an orbit) each one of them rotate around its orbit.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كُلٌّ فِي فَلَكٍ يَسْبَحُونَ } معناه يَجرُون\n والفَلكُ: القُطبُ الذي تَدورُ بهِ النجومُ\n وقال: الفَلكُ: السَّماءُ!\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {All in the heavens and the earth praise Him} means they glorify Him.\n\n\nThe constellation: the point around which the stars revolve.\n {And the ship said: The heaven!}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يتفكرون في خلق السماوات، ولا يتدبرون في الآيات الدالة على وحدة صانعها وبالجملة كيف ينكرون أولئك المنكرون المسرفون وجود موجدها مع أنه سبحانه { هُوَ ٱلَّذِي خَلَقَ } وقدر لهم { ٱلْلَّيْلَ } سبباً ووقتاً لاستراحتهم ورقودهم { وَٱلنَّهَارَ } لمعاشهم واكتسابهم { وَ } جعل { ٱلشَّمْسَ وَٱلْقَمَرَ } سببين لإنضاج ما يتقوتون ويتفكهون و { كُلٌّ } من الشمس والقمر وسائر السيارات { فِي فَلَكٍ } من الأفلاك السبعة { يَسْبَحُونَ } [الأنبياء: 33] يسيرون ويدورون بسرعة تامة دائماً بلا قرار وسكونٍ؛ لتدبير مصالحهم، وإصلاح معايشهم، وهم لا يعلمون، ولا يشكرون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو الذي خلق الليلَ } لتسكنوا فيه، { والنهارَ } لتتصرفوا فيه، { والشمسَ } لتكون سراجَ النهار، { والقمرَ } ليكون سراج الليل، وهذا بيان لبعض تلك الآيات التي هم عنها معرضون\n وقوله: { كلٌّ } أي: كلهم، والمراد: جنس الطوالع، { في فَلكٍ يَسْبَحُون } أي: يسيرون سير العائم في الماء\n عن ابن عباس رضي الله عنه: الفلك السماء، وقيل: موج مكفوف تحت السماء، يجري فيه الشمس والقمر والنجوم\n وجمهور أهل الهيئة أن الفلك: جسم مستدير، وأنهن تسعة، وهل هي السماوات السبع، فيكون الكرسي ثامنًا، والعرش تاسعًا، أو غيرهن، فتكون تحت السماوات أو فوقها؟ قولان لهم\n والمراد هنا: الجنس، كقولك: كَسَاهُمُ الأميرُ حلةٌ، أي: حُلة حُلةً، وجعل الضمير واو العقلاء لأن السباحة حالُهم\n قال في المستخرج من كتاب الغزنوني: \" كلٌّ \" أي: كل واحد من الشمس والقمر وسائر السيارة، وإن لم تُذْكرون لأنه جمعَ قوله: { يَسْبَحُون } والمعنى: يجرون كالسابح أو يدورون، والسيارة تجري في الفلك على عكس جري الفلك، ولها تسعة أفلاك، فالقمر في الفلك الأدنى، ثم عطارد، ثم الزهرة، ثم الشمس، ثم المريخ، ثم المشتري، ثم زُحل، والثامن: فلك البروج، والتاسع: الفلك الأعظم\n هـ\n وقال في سورة يس: خص الشمس والقمر هنا، وفي سورة الأنبياء لأن سيرهما أبدًا على عكس دور الفلك، وسَيْر الخمسة قد يكون موافقًا لسيره عند رجوعها\n\n\nهـ\n والله تعالى أعلم\n الإشارة: أوَ لَم ير الذين كفروا بوجود التربية أن سماوات الأرواح وأرض النفوس كانتا رتقًا صلبة، ميتة بالجهل، ففتقناهما بالعلوم وأسرار التوحيد؟ والمعنى: أن بعض الأرواح والنفوس تكون ميتة صلبة، فإذا صَحِبَتْ أهل التربية، انفتقت بالعلوم والأسرار، فهذا شاهد بوجود أهل التربية، ومن قال بانقطاعها فقوله مردود بالمشاهدة\n وجعلنا من ماء الغيب - وهي الخمرة الأزلية - كلَّ شيء حي، أفلا يؤمنون بوجود هذا الماء عند أربابه؟ وجعلنا في أرض النفوس جبالاً من العقول لئلا تميل إلى الهوى فتموت، وجعلنا فيها طُرقًا يسلك منها إلى الحضرة، وهي كيفية الرياضة وأنواع المجاهدة، وهي طرق كثيرة، والمقصد واحد، وهو الوصول إلى الفناء والبقاء، التي هي معرفة الحق بالعيان، وهو قوله تعالى: { لعلهم يهتدون } إلى الوصول إلى حضرتنا\n وجعلنا السماء، أي: سماء القلوب الصافية، سقفًا محفوظًا من الخواطر والوساوس والشكوك والأوهام والشياطين، قال بعضهم: \" إذا كان الحق تعالى قد حفظ السماء بالشهب من الشياطين، فقلوب أوليائه أولى بالحفظ\n وهم عن آياتها، أي: عن دلائل حفظها وصيانتها معرضون لانهماكهم في الغفلة\n وهو الذي خلق ليل القبض ونهار البسط وشمس العرفان وقمر توحيد الدليل والبرهان، كلٌّ في موضعه، لا يتعدى أحد على صاحبه، ولكل واحد سير معلوم وأدب محتوم\n وبالله التوفيق\n ولمّا قامت الحجة على الكفرة بما ذكرَ من الآيات والدلائل القاطعة، وانقطعوا، قالوا: ننتظر به ريب المنون، فنستريح منه\n فأنزل الله تعالى\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:40",
      "similarity": 0.6805752421489247
    },
    {
      "verse": "41:37",
      "similarity": 0.6194665028629684
    },
    {
      "verse": "75:9",
      "similarity": 0.6074158774696596
    },
    {
      "verse": "55:5",
      "similarity": 0.601685421130662
    },
    {
      "verse": "16:12",
      "similarity": 0.48717488291180705
    }
  ]
}