{
  "chapter": "الأنبياء",
  "text": "وما جعلنا لبشر من قبلك الخلد افاي۟ن مت فهم الخلدون",
  "translations": [
    {
      "translation": "We have given no man everlastingness before you. So then if you die, will they live ever after?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad), We did not grant everlasting life to any human being even before you. If you were to die, will they live for ever?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made no mortal before you immortal. Will they become immortal after you die?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And before you, We did not appoint on earth a never-ending life for any human; will they, if you depart, become immortal?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted not to any human being immortality before you; then if you die, would they live forever\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not ordain abiding for any mortal before you. What! Then if you die, will they abide?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not assigned to any mortal before thee to live forever; therefore, if thou diest, will they live forever?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed immortality for no mortal before thee. What! if thou diest, can they be immortal!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have not granted everlasting life to any human being before you; then if you [Muhammad] should die, will they live forever?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed not for any human being before thee immortality; if thou then diest, are they to be immortals?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not give immortality to any human before you. If you are fated to die, will they live on forever?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We granted not to any man before thee permanent life (here): if then thou shouldst die, would they live permanently?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We granted not to any human being immortality before you (O Muhammad SAW), then if you die, would they live forever?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have never assigned immortality to a human before you, therefore, if you yourself die, will they live for ever?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not grant immortality to any human being before you. Should you die, are they then the immortal?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not grant to any man before you eternity [on earth]; so if you die - would they be eternal?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:34] When the disbelievers said that Muhammad (s) would die, the following was revealed: And We did not assign to any human being before you immortality, permanence [of life] in this world. What, if you [are fated to] die, will they be immortal?, in it? No! (The last sentence constitutes the [syntactical] locus of the interrogative of denial).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We appointed) We have created (immortality) in this worldly life (for no mortal) among the prophets (before thee. What! if thou diest) Muhammad, (can they be immortal) in this worldly life? This verse was revealed when they said: we will wait until Muhammad dies and then we will find rest.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَمَا جَعَلْنَا لِبَشَرٍ مِّن قَبْلِكَ ٱلْخُلْدَ } يعني: إن النصارى ادعوا خلود عيسى وبقاءه بلا طريان موت عليه دائماً كما كان الآن، وكذا خلود جميع من لحق بالملائكة من البشر، ردَّ الله عليهم على أبلغ وجه وآكده حيث قال: ما جعلنا وقدرنا لبشر من بني نوعك يا أكمل الرسل الخلد والبقاء السرمدي، لا من الذين مضوا قبلَك، ولا من الذين يأتون بعدك، إذ هم بشر محدث مركب، وكل مركب محدث لا بدَّ أن ينهدم امتزاجه وتنحل أجزاؤه ومزاجه، ولو كان فرد من أفراد المحدث البشر قديماً لكنت أنت يا أكمل الرسل ألبتة { أَ } تزعم وتردد يا أكمل الرسل { فَإِنْ مِّتَّ } وعدمت عن الدنيا { فَهُمُ } الذين ادعى الجاهلون خلودهم { ٱلْخَالِدُونَ } [الأنبياء: 34] المقصرون على الخلود بلا لحوق عدمٍ عليهم، كلا وحاشا لا يكون الأمر كذلك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: لنبيه - عليه الصلاة والسلام -: { وما جعلنا لبشرٍ من قبلكَ الخُلدَ } أي: البقاء الدائم لكونه مخالفًا للحكمة التكوينية والتشريعية، { أَفإِن مِّتَّ } بمقتضى حكمتنا { فهُم الخالدون } بعدك؟ نزلت حين قالوا: نتربص به رب المنون، فنفى عنه الشماتة بموته، فإن الشماتة بالموت مما لا ينبغي أن يصدر من عاقل، أي: قضى الله ألا يخلد في الدنيا بشرًا، فإن مِّتَّ - يا محمد - أيبقى هؤلاء الكفرة؟ كلا { كلُّ نَفْسٍ ذائقةُ الموت } أي: ذائقة مرارة مفارقتها جسدها، فتستوي أنت وهم فيها، فلا تتصور الشماتة بأمر عام",
      "translations": []
    }
  ]
}