{
  "chapter": "الأنبياء",
  "text": "خلق الانسن من عجل ساو۟ريكم ءايتى فلا تستعجلون",
  "translations": [
    {
      "translation": "Man was created hasty. I will show you My Signs so do not try to hasten Me.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is made of inordinate haste. We will show you Our signs, then you will not desire to hasten (the punishment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is hasty by nature. I shall certainly show you My Signs. Do not ask Me to be hasty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The human being is created hasty. Tell them, \"Do not be hasty, for God will soon show you the evidence of His existence\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man has been created hasty; very soon I shall show you My signs, do not be impatient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is created of haste. I will show you My Ayat. So ask Me not to hasten (them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is created of haste; now will I show to you My signs, therefore do not ask Me to hasten (them) on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man was created of haste. Assuredly I shall show you My signs; so demand not that I make haste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is made of haste. I shall show you My portents, but ask Me not to hasten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is a creature of haste. Soon I will show you My signs, but do not ask Me to hasten them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man was created of hast, surely I shall show you MY signs, so ask Me not to hasten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is a creature of haste. Soon I will show you My signs. So do not ask Me to hasten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is a creature of haste: soon (enough) will I show you My Signs; then ye will not ask Me to hasten them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man is created of haste, I will show you My Ayat (torments, proofs, evidences, verses, lessons, signs, revelations, etc.). So ask Me not to hasten (them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The human was created of haste. Indeed, I will show you My signs; so do not ask Me to hasten them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The human being was created of haste. I will show you My signs, so do not seek to rush Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man was created of haste. I will show you My signs, so do not impatiently urge Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:37] The following was revealed regarding their demand that chastisement be hastened: Man was created of   haste, that is to say, because he is so hasty in his affairs, it is as if he had been created out of it. Assuredly I shall show you My signs, My promises of chastisement, so do not demand that I hasten, in [sending] it. And so He [God] made them suffer death at [the battle of] Badr.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Man) i.e. Adam (is made of haste) he is hasty; it is also said that this means: man, al-Nadr Ibn al-Harth, was created hasty, for he wanted chastisement to be hastened for him. (I shall show you My portents) I shall show you the signs of My divine Oneness in the horizons; it is also said that this means: I will show the signs of My punishment of you through the sword on the Day of Badr, (but ask Me not to hasten) My chastisement before its appointed time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { خُلِقَ ٱلإنْسَانُ مِنْ عَجَلٍ } معناه خُلِقَتْ العَجلةُ من الإِنسانِ كقولِهِ تعالى:\n\n[القصص: 76] والعُصبة: هي التي تَنوء بالمفاتيح\n وتَنوءُ: أي تَنهضُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Man was created from a {swift} creature,\" means that the creature was created from man, as His saying, \"And {He created} the creature from water.\"\n\n\nThe nerve is the one that is infused with the keys.\n And it {stands up / rises}: that is, it {awakens / becomes active}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما استعجل المنهمكون في بحر الضلال والإنكار، التائهون في تيه العتو والاستكبار نزولَ العذاب وقيام الساعة وجميع الوعيدات الواردة فيها على سبيل الاستهزاء والتهكم، ردَّ الله عليهم إنكارهم واستعجالهم بأبلغ وجه فقال: { خُلِقَ ٱلإنْسَانُ } أي: هذا النوع من الحيوان { مِنْ عَجَلٍ } يعني: من غاية استعجاله ف يالخير والشر كأنه مصنوع منه، قل لهم يا أكمل الرسل نيابة عنَّا: إلى متى تستعجلون أيها المسرفون المغرورون { سَأُوْرِيكُمْ } عن قريب في هذه النشأة { آيَاتِي } أي: بعضها من نقماتي التي هي من مقدمات عذاب الآخرة، قيل هي وقعة بدر، إذ المستعجلون هم قريش، وسيأتي عذاب الساعة، وعذابها بعدما { فَلاَ تَسْتَعْجِلُونِ } [الأنبياء: 37] أيها الضالون المسرفون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { خُلِقَ الإنْسانُ من عَجَل } ، العَجَل والعَجَلة مصدران، وهو تقديم الشيء على وقته\n والمراد بالإنسان: الجنس، جُعل لفرط استعجاله، وقلة صبره، كأنه خُلق من العَجَلة، والعرب تقول لمن يكثر منه الشيء: خُلق منه، تقول لمن يكثر منه الكرم: خُلق من الكرم\n ومن عجلته: مبادرته إلى الكفر واستعجاله بالوعيد\n رُوي أنها نزلت في النضر بن الحارث، حين استعجل العذاب بقوله:\n\n[الأنفَال: 32] الآية، كأنه قال: ليس ببدع منه أن يستعجل، فإنه مجبول على ذلك، وطبعُه، وسجيته\n وعن ابن عباس رضي الله عنه: أن المراد بالإنسان آدم عليه السلام، فإنه حين بلغ الروح صدره أراد أن يقوم\n ورُوي: أنه لما دخل الروح في عينيه نظر إلى ثمار الجنة، ولمَّا وصل جوفه اشتهى الطعام، فكانت العجلة من سجيته، وسرت في أولاده\n وإنما منعَ الإنسان من الاستعجال وهو مطبوع عليه، ليتكمل بعد النقص، كما أمره بقطع الشهوة وقد رَكّبها فيه لأنه أعطاه القدرة التي يستطيع بها قمع الشهوة وترك العَجَلة\n\n\nقال القشيري: العَجَلةُ مذمومةٌ، والمُسَارَعَةُ محمودةٌ\n والفرق بينهما: أن المسارعة: البِدارُ إلى الشيء في أول وقته، والعَجَلة: استقباله قبل وقته، والعَجَلةُ سمة وسوسة الشيطان، والمسارعةُ قضية التوفيق\n هـ\n وقال الورتجبي: خلقهم من العَجَلة، وزجرَهم عن التعجيل إظهارًا لقهاريته على كل مخلوق، وعجزهم عن الخروج عن ملكه وسلطانه\n وحقيقة العَجَلة متولدة من الجهل بالمقادير السابقة\n هـ\n قلت: ما زالت الطمأنينة والرَّزانَةُ من شأن العارفين، وبها عُرفوا، والعَجَل والقلق من شأن الجاهلين، وبها وصفوا\n وقيل: العَجَل الطين، بلغة حِمْير، ولا مناسبة له هنا\n قال تعالى، صارفًا للخطاب عن الرسول إلى المستعجلين: { سأُوريكم آياتي }: نَقَماتي، كعذاب النار وغيره، { فلا تستعجلون } بالإتيان بها، وهو نهي عما جُبلت عليه نفوسهم ليقهروها عن مرادها من الاستعجال",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:204",
      "similarity": 0.6192568039341617
    },
    {
      "verse": "37:176",
      "similarity": 0.6192568039341617
    },
    {
      "verse": "20:83",
      "similarity": 0.540634895867129
    },
    {
      "verse": "19:84",
      "similarity": 0.5191003869186499
    },
    {
      "verse": "2:92",
      "similarity": 0.45741216812365953
    }
  ]
}