{
  "chapter": "الأنبياء",
  "text": "لاهية قلوبهم واسروا۟ النجوى الذين ظلموا۟ هل هذا الا بشر مثلكم افتاتون السحر وانتم تبصرون",
  "translations": [
    {
      "translation": "Their hearts are distracted. Those who do wrong confer together secretly, saying, 'Is this man anything but a human being like yourselves? Do you succumb to magic with your eyes wide open?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their minds are lost in frivolous pastimes; and the evil-doers discuss secretly: \"Is he not but only a man like you? Then why are you taken in by magic seeingly?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "their hearts being set on other concerns. The wrong-doers whisper to one another: \"This person is no more than a mortal like yourselves. Will you, then, be enchanted by sorcery while you see?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and their hearts are preoccupied with trivial matters. The unjust ones whisper to each other and say, \"Is he (Muhammad) more than a mere mortal like you? How can you follow that which you know is only a magic?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their hearts are involved in play; and the unjust secretly conferred, “What is he, except another a human like you?! So do you follow magic although you have perceived?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With their hearts occupied. Those who do wrong, conceal their private counsels, (saying): \"Is this more than a human being like you Will you submit to magic while you see it\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their hearts trifling; and those who are unjust counsel together in secret: He is nothing but a mortal like yourselves; what! will you then yield to enchantment while you see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "diverted their hearts. The evildoers whisper one to another, 'Is this aught but a mortal like to yourselves? What, will you take to sorcery with your eyes open?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With hearts preoccupied. And they confer in secret. The wrong-doers say: Is this other than a mortal like you? Will ye then succumb to magic when ye see (it)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "their hearts are distracted and forgetful. The wrongdoers confer together secretly, saying, \"Is not this man a mortal like you? Will you succumb to magic with your eyes open?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In sport being their hearts. And those who do wrong keep secret their private discourse this is but a human being like unto yourselves; will ye then betake yourselves to magic while ye know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "their hearts set on diversions. The wrongdoers secretly whisper together, [saying], ‘Is this [man] not a human being like yourselves? Will you give in to magic with open eyes?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their hearts toying as with trifles. The wrong-doers conceal their private counsels, (saying), \"Is this (one) more than a man like yourselves? Will ye go to witchcraft with your eyes open?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With their hearts occupied (with evil things) those who do wrong, conceal their private counsels, (saying): \"Is this (Muhammad SAW) more than a human being like you? Will you submit to magic while you see it?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "their hearts are diverted. The harmdoers mutter to one another: 'Is this anything else but a human like yourself? What, will you follow sorcery with your eyes open'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their hearts distracted, the wrongdoers confer secretly, “Is this anything but a mortal like you? Will you take to sorcery, with open-eyes?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With their hearts distracted. And those who do wrong conceal their private conversation, [saying], \"Is this [Prophet] except a human being like you? So would you approach magic while you are aware [of it]?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:3] with their hearts preoccupied, heedless of its meanings. And they are secret in [their] conference, [their] speech, [they] the evildoers (alladhīna zalamū, a substitution for the [third person plural indicator] wāw of wa-asarrū’l-najwā, ‘and they are secret in conference’) ‘Is this, namely, Muhammad (s), other than a [mortal] human being like yourselves?, and so what he produces is [mere] sorcery. Will you then take [to] sorcery, [will] you [succumb and] follow it, even though you are able to see?’, [even though] you know that it is sorcery?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(With hearts preoccupied) with hearts heedless of the matter of the Hereafter. (And they confer in secret) they hide among themselves their disbelief in Muhammad (pbuh) and in the Qur'an. (The wrong-doers) these are the idolaters: Abu Jahl and his host; they say to one another: (say: Is this) they mean Muhammad (pbuh) (other than a mortal like you) other than a human being like you? (Will ye then succumb to magic) will you then believe in magic and lies (when ye see (it)) while knowing that it is magic and lies?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال حدّثنا علي بن أحمد عن عطاء بن السائب عن أبي خالد الواسطي عن زيد بن علي عليهما السلام في قولِه تعالى: { وَأَسَرُّواْ ٱلنَّجْوَى } معناه أظهَروا\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nIt was narrated from Zayd ibn Ali that he said regarding the meaning of the verse: {And they whispered secretly to each other} - this means that they showed themselves.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لاَهِيَةً } معه ذاهلةً { قُلُوبُهُمْ } عن التأمل فيه\n والتفكر في معناه والتدرب في رموزه وإشاراته { وَ } هم وإن أغفلوا نفوسهم وقلوبهم عنه لفط عتوِّهم واستكبارهم\n لكن تفطنوا بحقيته من كمال إعجازه ومتانته\n لكونهم من أرباب البلاغة والفصاحة والذكاء والفطانة\n لكنهم { أَسَرُّواْ ٱلنَّجْوَى } أي: بالغوا في إخفاء ما يتناجوا به في نفوسهم من حقية القرآن وإعجازه\n إذ هم { ٱلَّذِينَ ظَلَمُواْ } أنفسهم بارتكاب الكفر\n والمعاصي\n وأنواع الضلال عناداً ومكابرة\n وقصدوا أيضاً إضلال ضعفاء الأنام حيث قالوا لهم على سبيل الإنكار: { هَلْ هَـٰذَآ } أي: ما هذا الشخص الحقير الذي ادَّعى الرسالة والنبوة والوحي والإنزال من جانب السماء { إِلاَّ بَشَرٌ مِّثْلُكُمْ } وهو من بني نوعكم لا ميزة له عليكم\n والرسول المرسل من جانب السماء لا يكون إلا ملكاً { أَ } تميلون نحوه وتزعمونه صادقاً بواسطة خوارق صدرت عنه على سبيل السحر والشعبذة مدعياً أنه معجز مع أنه ليس كذلك { فَتَأْتُونَ } وتحضرون { ٱلسِّحْرَ وَأَنتُمْ تُبْصِرُونَ } [الأنبياء: 3] آلاته وأدواته وتعلمون عياناً أنه سحرُ مفترىً\n هل تصدقونه أم لا؟ وهذا تسجيلُ وتنصيصُ منهم على كذب الرسول\n وإغراءُ وتضليلُ على ضعفاء الأنام\n وحثُ لهم على تكذيبه وإنكاره ما أتى به\n\n\n{ قَالَ } يا أكمل الرسل في جوانبهم\n والرد عليهم: { رَبِّي } الذي ربَّاني بأنواع الكرامات والمعجزات { يَعْلَمُ ٱلْقَوْلَ } أي: جنس الأقوال والأفعال والأحوال الكائنة { فِي ٱلسَّمَآءِ } أي: عالم الأرواح { وَٱلأَرْضِ } أي: عالم الطبيعة والأشباح { وَ } كيف لا يعلم ويعزب عن علمه شيء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { لاهية }: حال من واو \" يلعبون \" \n و { قلوبهم }: فاعل بلاهية\n يقول الحقّ جلّ جلاله: { اقتربَ للناس حسابُهُم } أي: قَرُبَ قيام الساعة التي هي محل حسابهم\n قال ابن عباس: \" المراد بالناس: المشركون \" وهو الذي يُفصح عنه ما بعده ولم يقل تعالى: \" اقترب حساب الناس \" \n بل قدّم لام الجر على الفاعل للمسارعة إلى إدخال الروعة\n فإن نسبة الاقتراب إليهم من أول الأمر مما يسوؤهم ويورثهم رهبة وانزعاجًا\n كما أن تقديم اللام في قوله تعالى:\n[البَقَرَة: 29] لتعجيل المسرة لأن كون الخلق لأجل المخاطبين مما يسرهم ويزيدهم رغبة وشوقًا إليه تعالى\n وفي إسناد الاقتراب إلى الحساب المنبئ عن التوجه نحوهم\n مع صحة إسناد الاقتراب إليهم بأن يتوجهوا نحوه\n من تفخيم شأنه\n وتهويل أمره\n ما لا يخفى\n لِمَا فيه من تصويره بشيء مقبل عليهم\n لا يزال يطلبهم حتى يصيبهم لا محالة\n ومعنى اقترابه: دنوه منهم شيئًا فشيئًا حتى يلحقهم لأن كل آت قريب\n أي: دنا حساب أعمالهم السيئة الموجبة للعقاب\n { وهم في غفلةٍ } تامة منه\n ساهون بالمرة عنه\n غير ذاكرين له\n لا أنهم غير مبالين به\n مع اعترافهم بإتيانه\n بل هم منكرون له\n كافرون به\n { معرضون } عن الآيات والنُذر المنبهة لهم عن سِنة الغفلة\n { ما يأتيهم من ذكر } أي: من طائفة نازلة من القرآن\n تذكر ذلك الحساب\n وتنبههم عن الغفلة عنه\n كائن أو نازل { من ربهم } \n أو ذاكر ومذكر من ناحية ربهم\n وفي إضافته إليه سبحانه دلالة على شرفه\n وكمال شناعة ما فعلوه من الإعراض عنه\n وفي التعبير بعنوان الربوبية تشنيع لكمال عتوهم\n ومِنْ صفة ذلك الذكر { مُّحْدَث } تنزيله بحسب اقتضاء الحكمة\n بمعنى أنه نزل شيئًا فشيئًا\n أو قريب عهد بالنزول\n فمعاني القرآن قديمة\n وإظهاره بهذه الحروف والأصوات حادث\n وقال ابن راهويه: قديم من رب العزة\n محدث إلى أهل الأرض\n فما ينزل عليهم شيء من القرآن يذكرهم ويعظهم { إِلا استمعوه وهم يلعبون } لا يتعظون به\n ولا يتدبرون في معانيه\n { لاهيةً قلوبُهم } ساهية\n معرضة عن التفكر والتدبر في معانيه\n\nوتقدير الآية: ما يأتيهم من ذكر من ربهم محدث\n في حال من الأحوال\n إلا حال استماعهم إياه كانوا لاعبين مستهزئين به\n لاهين عنه\n حال كون قلوبهم لاهيةً عنه لتناهي غفلتهم وفرط إعراضهم عن النظر والتفكر في عواقب الأمور\n والله تعالى أعلم\n الإشارة: حمل الآية على العموم هو الظاهر عند الصوفية\n وقد ورد عن رجل من الصحابة أنه كان يبني\n فلقي بعض الصحابة فقال: ماذا نزل اليوم من القرآن؟ فقال له: { اقترب للناس حسابهم } \n فنفض التراب\n وقال: والله لا بنيتُ\n هـ\n أي: اقترب للناس حسابهم على النقير والقطمير\n وهم في غفلة عن التأهب والاستعداد\n معرضون عن اتخاذ الزاد\n ما يأتيهم من ذكر من ربهم\n يعظهم ويُوقظهم\n إلا استمعوه بآذانهم\n وهم يلعبون ساهون عنه بقلوبهم لحشوها بالوساوس الشيطانية والعلائق النفسانية\n لاهية قلوبهم عن التفكر والاعتبار والتدبر والاستبصار\n قال القشيري: ويقال: الغفلة على قسمين غافلٍ عن حسابه لاستغراقه في دنياه\n وغافلٍ عن حسابه لاستهلاكه في مولاه\n فالغفلة الأولى سِمَةُ الهجر\n والثانية صِفَةُ الوصل\n فالأولون لا يستفيقون من غفلتهم إلا في عسكر الموتى\n وهؤلاء لا يرجون عن غيبتهم أبَدَ الأبد لفنائهم في وجود الحق\n هـ\n قلت: القسمة ثلاثية: قوم غفلوا عن حسابهم لاشتغالهم بحظوظهم وهواهم\n وهم: الغافلون الجاهلون\n وقوم ذكروا حسابهم\n وجعلوه نصب أعينهم\n وتأهبوا له\n وهم: الصالحون والعباد والزهاد\n وقوم غفلوا عنه\n وغابوا عنه لاستغراقهم في شهود مولاهم\n وهم: العارفون المقربون\n جعلنا الله منهم بمنِّه وكرمه\n ثم ذكر المنهمكين في الغفلة\n فقال: {\n\n\n وَأَسَرُّواْ ٱلنَّجْوَى ٱلَّذِينَ ظَلَمُواْ هَلْ هَـٰذَآ إِلاَّ بَشَرٌ مِّثْلُكُمْ أَفَتَأْتُونَ ٱلسِّحْرَ وَأَنتُمْ تُبْصِرُونَ قَالَ رَبِّي يَعْلَمُ ٱلْقَوْلَ فِي ٱلسَّمَآءِ وَٱلأَرْضِ وَهُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ بَلْ قَالُوۤاْ أَضْغَاثُ أَحْلاَمٍ بَلِ ٱفْتَرَاهُ بَلْ هُوَ شَاعِرٌ فَلْيَأْتِنَا بِآيَةٍ كَمَآ أُرْسِلَ ٱلأَوَّلُونَ مَآ آمَنَتْ قَبْلَهُمْ مِّن قَرْيَةٍ أَهْلَكْنَاهَآ أَفَهُمْ يُؤْمِنُونَ }  قلت: { الذين ظلموا }: بدل من الواو\n مُنبئ عن كونهم موصوفين بالظلم فيما أسروا به\n وقال الكلبي: فيه تقديم وتأخير\n أراد الذين ظلموا أسروا النجوى\n فيكون { الذين }: مبتدأ و { أسروا }: خبر مقدم\n وقال قطرب: على لغة بعض العرب\n يقولون: أكلوني البراغيث\n وهي بلغة بلحارث وغيرهم\n وقال الفراء: بدل من الناس\n أي: اقترب للناس وهم الذين ظلموا\n و { هل هذا\n\n\n } الخ: بدل من النجوى\n أو مفعول بقول مضمر\n كأنه قيل: ماذا قالوا في نجواهم؟ فقيل: قالوا: هل هذا\n\n\n الخ و { أنتم تبصرون }: حال من واو \" تأتون \" مقررة للإنكار\n مؤكدة للاستبعاد\n و { من قرية }: فاعل آمنت\n و \" من \": صلة للعموم\n و { أهلكناها }: صفة لقرية\n يقول الحقّ جلّ جلاله: { وأسَرُّوا النجوى }: أخفوا تناجيهم بحيث لم يشعر أحد بما قالوا\n وهم { الذين ظلموا } بالكفر والطغيان\n قائلين في تلك النجوى الشنيعة: { هل هذا } أي: ما هذا الرجل الذي يزعم أنه رسول { إلا بشرٌ مثلكم } أي: من جنسكم\n وما أتى به سحر\n { أفتأتون السحر وأنتم تُبصرون } أي: تعلمون ذلك فتأتونه\n وتحضرونه على وجه الإذعان والقبول\n وأنتم تعاينون أنه سحر؟ قالوا ذلك\n بناء على ما ارتكز في اعتقادهم الزائغ\n أن الرسول لا يكون إلا مَلَكًا\n وأنَّ كل ما يظهر على يد البشر من الخوارق هو من قبيل السحر\n وغاب عنهم أن إرسال البشر إلى البشر هو الذي تقتضيه الحكمة التشريعية\n\nقاتلهم الله أنى يؤفكون\n وإذا أسروا ذلك ولم يعلنوه لأنه كان على طريق توثيق العهد خفية\n وتمهيدًا لمقدمات المكر والكيد في هدم أمر النبوة\n وإطفاء نور الدين\n\n[الصف: 8]\n ثم فضح الله سرهم ونجواهم بقوله: { قل ربي يعلم القولَ في السماء والأرض } أي: قل يا محمد: ربي يعلم القول\n سرًا كان أو جهرًا\n سواء كان في السماء أو الأرض\n فلا يخفى عليه ما تناجيتم به\n فيفضحكم به ويجازيكم عليه\n وقرأ أكثر أهل الكوفة: قال على الخبر\n وهو حكاية من جهته تعالى لِمَا قاله - صلى الله عليه وسلم - بعد ما أوحى إليه أحوالهم وأقوالهم بيانًا لظهور أمرهم وانكشاف سرهم\n وإيثار القول المشتمل على السر والجهر للإيذان بأن علمه تعالى بالسر والجهر على وتيرة واحدة\n لا تفاوت بينهما بالجلاء والخفاء\n كما في علوم الخلق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "80:10",
      "similarity": 0.5503080301515986
    },
    {
      "verse": "102:1",
      "similarity": 0.5405726179312238
    },
    {
      "verse": "63:9",
      "similarity": 0.45954903812804576
    },
    {
      "verse": "29:64",
      "similarity": 0.42095596429027543
    },
    {
      "verse": "21:17",
      "similarity": 0.4031018290710193
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/21:3.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/21:3.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}