{
  "chapter": "الأنبياء",
  "text": "وجعلنا فى الارض روسى ان تميد بهم وجعلنا فيها فجاجا سبلا لعلهم يهتدون",
  "translations": [
    {
      "translation": "We placed firmly embedded mountains on the earth, so it would not move under them, and We put broad valleys as roadways in it, so that perhaps they might be guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We placed stabilisers in the earth so that as it revolved with them you lived undisturbed; and We provided passageways between them so that men may find their way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We placed firm mountains on earth lest it should sway with them, and We made wide paths in them that they may find their way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We placed firm mountains on earth lest it would shake them away. We made wide roads for them so that they might have the right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have placed mountains as anchors in the earth so that it may not shake with them; and We kept wide roads in it, so that they may find guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have placed on the earth firm mountains, lest it should shake with them, and We placed therein broad highways for them to pass through, that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made great mountains in the earth lest it might be convulsed with them, and We have made in it wide ways that they may follow a right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We set in the earth firm mountains lest it should shake with them, and We set in it ravines to serve as ways, that haply so they may be guided;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have placed in the earth firm hills lest it quake with them, and We have placed therein ravines as roads that haply they may find their way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We set firm mountains upon the earth lest it should sway under them, and We placed therein passages for paths so that they might find their way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have placed in the earth firm mountains lest it should move away with them, and We placed therein Passages for paths, that haply they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We set firm mountains in the earth lest it should shake with them, and We made broad ways in them so that they may be guided [to their destinations].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have set on the earth mountains standing firm, lest it should shake with them, and We have made therein broad highways (between mountains) for them to pass through: that they may receive Guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have placed on the earth firm mountains, lest it should shake with them, and We placed therein broad highways for them to pass through, that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We set firm mountains upon the earth lest it should shake with them, and We placed therein ravines to be paths so that they might be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We placed on earth stabilizers, lest it sways with them, and We placed therein signposts and passages, that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We placed within the earth firmly set mountains, lest it should shift with them, and We made therein [mountain] passes [as] roads that they might be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:31] And We set in the earth firm mountains lest it should shake with them, and We set in them, [in] the firm mountains, ravines, as roads (subulan substitutes [for fijājan, ‘ravines’, which are wide through-routes]), that perhaps they may be guided, to their destinations during travel.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We have placed in the earth firm hills) the mountains as pillars for it (lest it quake with them) lest the earth trembles with them on it, (and We have placed therein) in the earth (ravines) valleys (as roads) as spacious roads (that haply they may find their way) in their goings and comings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلْنَا فِي ٱلأَرْضِ رَوَاسِيَ أَن تَمِيدَ بِهِمْ } فالرَّواسيُ: الجبالُ الثَوابتُ\n وتَمِيدَ بِهِم: معناه تَميلَ بِهِم\n\n\n\n\nوقوله تعالى: { وَجَعَلْنَا فِيهَا فِجَاجاً سُبُلاً } معناه مَسالِكٌ\n واحدُها فجٌّ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - exalted be He: {And We have placed within the earth firm mountains, lest it should shift with them} - the mountains are firm.\n And he inclined toward them {with kindness}.\n\nAnd His saying - Exalted is He: {And We have made therein mountains standing firm,} [this] means firm pathways.\n\n\n{One of them is a fajj.}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أخذ سبحانه في تعداد نعمه على خلَّص عباده امتناناً عليهم وتنبيهاً لهم كي يتفطنوا منها بوحدة ذاته، وكمال قدرته وبسطته فقال: { وَجَعَلْنَا فِي ٱلأَرْضِ } التي هي الكرة الحقيقية، المائلة بالطبع إلى التدور والانقلاب { رَوَاسِيَ } شامخاتٍ مخافة { أَن تَمِيدَ } تتحرك وتضطرب وتضر { بِهِمْ وَجَعَلْنَا فِيهَا } أي: في تلك الرواسي { فِجَاجاً } شقوقاً وأدويةً لتكون { سُبُلاً } ومسالكَ متسعةً وطرقاً واسعةً عنايةً منَّا إياهم { لَّعَلَّهُمْ يَهْتَدُونَ } [الأنبياء: 31] من تلك الطرق إلى ما يرومون من الأمكان البعيدة والبلدان النائية، فيتجرون ويتبعون منها مطالبهم ومصالحهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فِجَاجًا }: حال من \" سُبل \" ، وأصله: وصف له، فلما تقدم أُعرب حالاً\n وقيل { سُبُلاً }: بدل من { فجاجًا }\n وفي إتيانه: إيذان أن تلك الفجاج نافذة لأن الفج قد يكون نافذًا وقد لا\n قاله المحشي\n  يقول الحقّ جلّ جلاله: { أوَ لَمْ يَر الذين كفروا } رؤية اعتبار { أنّ السماواتِ والأرضَ } أي: جماعة السماوات وجماعة الأرض { كانتا } ، ولذلك لم يقل كُنَّ، { رَتْقًا } أي: ملتصقة بعضها ببعض\n والرتق: الضم والالتصاق\n وهو مصدر بمعنى المفعول، أي: كانتا مرتوقتين، أي: ملتصقتين، { ففتقناهما } فشققناهما، فالفتق ضد الرتق\n قال ابن عباس رضي الله عنه: \" كانتا شيئًا واحدًا متصلتين، ففصل الله بينهما، فرفع السماء إلى حيث هي، وأقرّ الأرض \"\n وفي رواية عنه: أرسل ريحًا فتوسطتهما ففتقتهما\n وقال السدي: كانت السماوات مؤتلفة طبقة واحدة ففتقها، فجعلها سبع سماوات، وكذلك الأرض، كانت طبقة واحدة، ففتقها، فجعلها سبع أرضين\n فإِن قيل: متى رأوهما رتقًا حتى جاء تقريرهم بذلك؟ قلنا: مصب الكلام والتقرير هو فتق السماوات ورفعها، وهو مشاهد بالأبصار، وهم متمكنون من النظر والاعتبار، فيعلمون أن لها مدبرًا حكيمًا، فَتَقَهَا ورفعها، وهو الحق جلّ جلاله، وذكر الرتق زيادة إخبار، فكأنه قال: ألم يروا إلى فتق السماوات ورفعها؟ وقال الكواشي: لَمّا كان القرآن معجزًا، كان وروده برتقهما كالمشاهد المرئي، أو: لمّا كان تلاصق السماوات والأرضين، وما بينهما، وتباينهما، جائزًا عقلاً، وجب تخصيص التلاصق من التباين، وليس ذلك إلا لله تعالى\n هـ\n وقيل: كانت السماوات صلبة لا تمطر، والأرض رتقًا لا تنبت، ففتق السماء بالأمطار، والأرض بالنبات\n ورُوي هذا عن ابن عباس أيضًا، وعليه أكثر المفسرين، وعِلْمُ الكفرةِ الرتقِ والفتق، بهذا المعنى، مما لا خفاء فيه\n والرؤية على الأول رؤية علم، وعلى الثاني رؤية عين\n { وجعلنا من الماء كل شيءٍ حيٍّ } أي: خلقنا من الماء كل حيوان، كقوله تعالى:\n\n[النُّور: 45]، وذلك لأنه من أعظم مواده، أو لفرط احتياجه إليه، وحبه له، وعدم صبره عنه، وانتفاعه به، ويدخل في ذلك: النبات مجازًا دون الملائكة، فأَلْ فيه للحقيقة والماهية، إلا أنه صرفه عن ذلك إلى العهد الذهني قرينةُ الجعل، كما في آية:\n\n[يُوسُف: 17]، فإن القرينة تخلص ذلك للبعضية وإرادة الأشخاص\n وقيل المراد به: المَنِيُّ\n فأَلْ فيه، حينئذ، للعهد الذهني فقط\n قال القشيري: كُلُّ مخلوقٍ حيٍّ فَمِنَ الماء خَلْقُه، فإنَّ أصلَ الحيوان الذي يحصل بالتناسل النطفةُ، وهي من جملة الماء\n هـ\n وتقدم أن الملائكة لا تناسل فيها\n { أفلا يؤمنون } بالله وحده، وهو إنكار لعدم إيمانهم، مع ظهور ما يُوجبه حتمًا من الآيات الآفاقية والأنفُسية، الدالة على تفرده تعالى بالألوهية\n\n\n{ وجعلنا في الأرض رواسِيَ } أي: جبالاً ثوابت، من رسا الشيءُ إذا ثبت ورسخ، { أن تميد بهم } أي: كراهية أن تتحرك وتضطرب بهم، أو لئلا تميد بهم - بحذف اللام -، و \" لا \" لعدم الإلباس\n { وجعلنا فيها } أي: في الأرض، وتكرير الجعل لاختلاف المجعولين، ولتوفية مقام الامتنان حقه، أو في الرواسي لأنها المحتاجة إلى الطرق، { فِجاجًا }: جمع فج، وهو الطريق الواسع، نفذ أم لا، أي: جعلنا في الأرض مسالك واسعة، و { سُبُلاً } نافذة: فالسبل هي الفجاج مع قيد النفوذ\n فإن قيل: أيّ فرق بين هذا وبين قوله:\n\n[نُوح: 20]؟ فالجواب: أنه هُنا بيَّن أنه خلقها على هذه الصفة، وهناك بيَّن أنه جعل فيها طُرقًا واسعة، وليس فيه بيان أنه خلقها كذلك، فما هنا تفسير لما هناك\n انظر النسفي\n وقوله تعالى: { لعلهم يهتدون } أي: إلى البلاد المقصودة بتلك السبل، أو إلى مصالحهم ومهماتهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:20",
      "similarity": 0.6437921196250609
    },
    {
      "verse": "16:15",
      "similarity": 0.6246927399429117
    },
    {
      "verse": "31:10",
      "similarity": 0.4112136476548847
    },
    {
      "verse": "5:112",
      "similarity": 0.3881821962363774
    },
    {
      "verse": "5:114",
      "similarity": 0.34318053757680694
    }
  ]
}