{
  "chapter": "الأنبياء",
  "text": "وجعلنا السماء سقفا محفوظا وهم عن ءايتها معرضون",
  "translations": [
    {
      "translation": "We made the sky a preserved and protected roof yet still they turn away from Our Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the sky a well-protected roof. Still they turn away from His signs!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We made the sky a secure canopy; and yet they turn away from these Signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the sky above them as a well-guarded ceiling, but they have neglected the evidence (of Our existence) therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made the sky a roof, protected; and they turn away from its signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made the heaven a roof, safe and well-guarded. Yet they turn away from its signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made the heaven a guarded canopy and (yet) they turn aside from its signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We set up the heaven as a roof well-protected; yet still from Our signs they are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we have made the sky a roof withheld (from them). Yet they turn away from its portents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the heaven a well-secured canopy; yet still they turn away from Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made the heaven a roof, safe, and from the signs there of they are averters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the sky a preserved roof and yet they are disregardful of its signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made the heavens as a canopy well guarded: yet do they turn away from the Signs which these things (point to)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made the heaven a roof, safe and well guarded. Yet they turn away from its signs (i.e. sun, moon, winds, clouds, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We established the heaven as a well protected roof, yet they still turn away from its signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the sky a protected ceiling; yet they turn away from its wonders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the sky a protected ceiling, but they, from its signs, are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:32] And We made the heaven a roof, for the earth, [functioning] like the roof of a house, preserved, from collapsing; and yet of the signs thereof, namely, [the signs of this heaven such as] the sun, the moon and the stars, they are disregardful, failing to reflect on them and thus realise that the Creator of such [things] can have no partner.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "353 (And We have made the sky a roof) for the earth (withheld (from them)) such that it does not fall; it is also said that this means: it is protected from the satans by the stars. (Yet they) i.e. the people of Mecca (turn away from) they do not believe nor reflect upon (its portents) its sun, moon and stars.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً قد { جَعَلْنَا ٱلسَّمَآءَ } المرفوع فوقهم { سَقْفاً مَّحْفُوظاً } لهم فيها أوقات مزارعهم ومتاجرهم، وسائر مصالحهم في البر والبحر، إذ هي من أقوى أسباب معاشهم { وَهُمْ عَنْ آيَاتِهَا } الدالة على وحدة مبدعها وكمال قدرة مخترعها وموجودها { مُعْرِضُونَ } [الأنبياء: 32] منصرفون منكرون، لا يتفكرون فيها كي تصلوا إلى زلال توحيدنا، وإلى كمال قدرتنا وأرادتنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وجعلنا السماء سقفًا محفوظًا } من السقوط، كقوله:\n\n[الحَجّ: 65]، أو من الفساد والانحلال إلى الوقت المعلوم، أو من استراق السمع بالشهب، كما قال:\n\n[الصَّافات: 7]\n { وهم } أي: الكفار { عن آياتها } أي: عن الأدلة التي فيها، كالشمس والقمر والنجوم، وغير ذلك مما فيها من العجائب الدالة على وحدانيته تعالى وقدرته وحكمته، التي بعضها محسوس، وبعضها معلوم بالبحث في علمي الطبيعة والهيئة، { مُعْرِضُون } لا يتدبرون فيها، فيقفون على ما هم عليه من الكفر والضلال، فيؤمنون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:5",
      "similarity": 0.8587624435351678
    },
    {
      "verse": "16:26",
      "similarity": 0.6111740400668673
    },
    {
      "verse": "43:33",
      "similarity": 0.5894577106057753
    },
    {
      "verse": "42:48",
      "similarity": 0.1567780502832252
    },
    {
      "verse": "6:107",
      "similarity": 0.15182615034748853
    }
  ]
}