{
  "chapter": "الأنبياء",
  "text": "واذا رءاك الذين كفروا۟ ان يتخذونك الا هزوا اهذا الذى يذكر ءالهتكم وهم بذكر الرحمن هم كفرون",
  "translations": [
    {
      "translation": "When those who are kafir see you, they only make a mockery out of you: 'Is this the one who makes",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the unbelievers see you they make fun of you (and say): \"Is this the one who mentions your gods (deridingly)?\" Yet in Ar-Rahman they disbelieve!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the unbelievers see you they make you an object of fun, saying: \"Is he the one who mentions your gods?\" They say so, and yet they reject with disdain the very mention of the Most Compassionate Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), whenever the unbelievers see you, they think that you deserve nothing more than to be mocked. They say, \"Is it he, (Muhammad), who speaks against your gods?\" But they themselves have no faith at all in the Beneficent God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the disbelievers see you, they do not appoint you except as an object of mockery; “Is he the one who speaks ill of your Gods?”; whereas they deny the remembrance of the Most Gracious Himself!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who disbelieved see you, they take you not except for mockery (saying): \"Is this the one who talks about your gods\" While they disbelieve at the mention of the Most Gracious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who disbelieve see you, they do not take you but for one to be scoffed at: Is this he who speaks of your gods? And they are deniers at the mention of the Beneficent Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the unbelievers behold thee, they take thee only for mockery: 'Ha, is this the one who makes mention of your gods?' Yet they in the Remembrance of the All-merciful are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who disbelieve behold thee, they but choose thee out for mockery, (saying): Is this he who maketh mention of your gods? And they would deny all mention of the Beneficent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who deny the truth see you, they laugh at you, saying, \"Is this the one who talks of your deities?\" Yet it is they who deny all mention of the Gracious One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who disbelieve behold thee they only take thee up for mockery: is this he who mentioneth your gods? while in the mention of the compassionate they are themselves blasphemers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever the faithless see you they only take you in derision: ‘Is this the one who remembers your gods?’ while they remain defiant towards the remembrance of the All-beneficent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Unbelievers see thee, they treat thee not except with ridicule. \"Is this,\" (they say), \"the one who talks of your gods?\" and they blaspheme at the mention of (Allah) Most Gracious!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who disbelieve (in the Oneness of Allah) see you (O Muhammad SAW), they take you not except for mockery (saying): \"Is this the one who talks (badly) about your gods?\" While they disbelieve at the mention of the Most Beneficent (Allah). [Tafsir. Al-Qurtubi].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the unbelievers see you, they take you only for mockery, saying: 'Is this he who talks about your gods' While they are unbelievers in the Remembrance of the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who disbelieve see you, they treat you only with ridicule: “Is this the one who mentions your gods?” And they reject the mention of the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who disbelieve see you, [O Muhammad], they take you not except in ridicule, [saying], \"Is this the one who insults your gods?\" And they are, at the mention of the Most Merciful, disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:36] And whenever the disbelievers see you, they only take you in derision, that is, as one to be derided, saying: ‘Is this the one who mentions your gods?’, that is, [the one who] derides them? And yet when it comes to the mention of the Compassionate One, to them, they (hum, [repeated] for emphasis) are disbelieving, of it, saying, ‘We do not know of any such [individual]’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when those who disbelieve) Abu Jahl and his host (behold thee) Muhammad, (they but choose thee) Muhammad (out for mockery) in what they say to you, ((saying)) to one another: (Is this he who maketh mention of) is this he who ridicules (your gods? And they would deny all mention of the Beneficent) they deny the Beneficent, saying: we do not know anyone by the name of the Beneficent (al-Rahman) except Musaylimah, the liar.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه امتناناً لحبيبه صلى الله عليه وسلم: { وَ } اذكر { إِذَا رَآكَ ٱلَّذِينَ كَفَرُوۤاْ } حين اشتغالك بقراءة القرآن أو بتذكير الأصحاب وعظة أولي الألباب، المشمرين نحو الحق أذيال همَّهم، المستفيدين المسترشدين منك قصارى مقاصدهم هي التوحيد الإلهي { إِن يَتَّخِذُونَكَ } أي: ما يتخذونك حين التفاتهم نحوك { إِلاَّ هُزُواً } أي: محل اسهتزاء وسخرية قائلين حين بعضهم لبعض مستحقرين شأنك: { أَهَـٰذَا } الرجل الحقير الفقير الملحق بالأراذل والضعفاء { ٱلَّذِي يَذْكُرُ آلِهَتَكُمْ } بالسوء، وينكر على شفعائكم ويسيء الأدب مع غاية حقارتهم وضعفهم، وهم من غاية عمههم وسكرتهم، ونهاية غيهم وغفلتهم { وَهُمْ بِذِكْرِ ٱلرَّحْمَـٰنِ } المنزَّه عن شوب الشك وريب التردد { هُمْ كَافِرُونَ } [الأنبياء: 36] منكرون وجوده وتحققه مع كما ظهوره واستحقاقه بالألوهية والربوبية بالأصالة بخلاف معبوداتهم الباطلة الزائغة؛ إذ هم مقهورون تحت قدرته، مجبورون جنب إرادته واختياره، لا قدرة لهم من أنفسهم أصلاً، فهم بالاستهزاء أحق، وبالاستهانة والسخرية أحرى وأليق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أهذا الذي }: مقول لحال محذوفة، أي: قائلين: أهذا الذي، وحذف الحال، إذا كان قولاً، مطردٌ\n { وهم بذكر الرحمن }: حال، و { بل تأتيهم }: عطف على { لا يكُفُّون } أي: لا يكفونها، بل تأتيهم\n يقول الحقّ جلّ جلاله: { وإِذا رآك الذين كفروا } أي: المشركون { إِن يتخذونك } ما يتخذونك { إِلا هُزُوًا } مهزوءًا بك على معنى قصر معاملتهم معه - عليه الصلاة والسلام - على اتخاذهم إياه هزوًا، كأنه قيل: ما يفعلون بك إلا اتخاذك هزوًا\n نزلت في أبي جهل - لعنه الله -، مرّ به النبي صلى الله عليه وسلم، فضحك وقال: هذا نبيُّ بني عبد مناف\n قال القشيري: لو شاهدوه على ما هو عليه من أوصاف التخصيص، وما رقَّاه الله من المنزلة، لظلوا له خاضعين، ولكنهم حُجِبُوا عن معانيه وسريرته، وعاينوا فيه جسمه وصورته\n فاستهزؤوا بما لم يُحيطوا بعلمه، حَال كونهم يقولون: { أهذا الذي يَذْكُرُ } أي: يعيب { آلهتكم } ، فالذكر يكون بخير وبضده، فإنْ كان الذاكر صديقًا للمذكور فهو ثناء\n وإن كان عدوًا فهو ذم\n { وهم بذكر الرحمن } أي: بذكر الله وما يجب أن يذكر به من الوحدانية، { هم كافرون } لا يصدقون به أصلاً، فهم أحق بالهزء والسخرية منك لأنك مُحق وهم مُبطلون\n والمعنى أنهم يعيبون - عليه الصلاة والسلام - أن يذكر آلهتهم، التي لا تضر ولا تنفع، بالسوء، والحال: أنهم بذكر الرحمن، المنعم عليهم بأنواع النعم، التي هي من مقتضيات رحمانيته، كافرون، لا يذكرونه بما يليق به من التوحيد وأوصاف الكمال، أو: بما أنزل من القرآن لأنه ذكر الرحمن، { هم كافرون } جاحدون، فهم أحقاء بالعيب والإنكار\n وكرر لفظ \" هُم \" للتأكيد، أو لأن الصلة حالت بينه وبين الخبر، فأعيد المبتدأ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:41",
      "similarity": 0.7827898834359716
    },
    {
      "verse": "15:11",
      "similarity": 0.6736302590210059
    },
    {
      "verse": "43:7",
      "similarity": 0.6458957675603899
    },
    {
      "verse": "18:106",
      "similarity": 0.6208045248141996
    },
    {
      "verse": "26:6",
      "similarity": 0.5408338633878289
    }
  ]
}