{
  "chapter": "الأنبياء",
  "text": "اولم ير الذين كفروا۟ ان السموت والارض كانتا رتقا ففتقنهما وجعلنا من الماء كل شىء حى افلا يؤمنون",
  "translations": [
    {
      "translation": "Do those who are kafir not see that the heavens and the earth were sewn together and then We unstitched them and that We made from water every living thing? So will they not have iman?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not these unbelievers see that the heavens and the earth were an integrated mass, then We split them and made every living thing from water? Will they not believe even then?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did the unbelievers (who do not accept the teaching of the Prophet) not realize that the heavens and the earth were one solid mass, then We tore them apart, and We made every living being out of water? Will they, then, not believe (that We created all this)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have the unbelievers not ever considered that the heavens and the earth were one piece and that We tore them apart from one another. From water We have created all living things. Will they then have no faith?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did not the disbelievers observe that the heavens and the earth were together, so We parted them, and we made every living thing from water? So will they not accept faith?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have not those who disbelieve known that the heavens and the earth were joined together as one united piece, then We parted them And We have made from water every living thing. Will they not then believe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not those who disbelieve see that the heavens and the earth were closed up, but We have opened them; and We have made of water everything living, will they not then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have not the unbelievers then beheld that the heavens and the earth were a mass all sewn up, and then We unstitched them and of water fashioned every living thing? Will they not believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have not those who disbelieve known that the heavens and the earth were of one piece, then We parted them, and we made every living thing of water? Will they not then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not those who deny the truth see that the heavens and the earth were joined together and that We then split them asunder? And that We have made every living thing out of water? Will they still not believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have not these who disbelieve considered that the heavens and the earth were closed up, then We rent them? And We have made of water everything living; will they not then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have the faithless not regarded that the heavens and the earth were interwoven and We unravelled them, and We made every living thing out of water? Will they not then have faith?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not the Unbelievers see that the heavens and the earth were joined together (as one unit of creation), before we clove them asunder? We made from water every living thing. Will they not then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have not those who disbelieve known that the heavens and the earth were joined together as one united piece, then We parted them? And We have made from water every living thing. Will they not then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have the unbelievers not seen that the heavens and the earth were sewn up as one (solid) mass, then We unstitched them, and that We made every living thing of water? Will they not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the disbelievers not see that the heavens and the earth were one mass, and We tore them apart? And We made from water every living thing. Will they not believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have those who disbelieved not considered that the heavens and the earth were a joined entity, and We separated them and made from water every living thing? Then will they not believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:30] Have they not ([one may] read a-wa-lam or a-lam) realised, [have they not] come to know, those who disbelieve, that the heavens and the earth were closed together and then We parted them, We made seven heavens and seven earths — or [it is meant] that the heaven was parted and began to rain, when it did not use to do so, and that the earth was parted and began to produce plants, when it did not use to do so; and We made, of water, [the water] that falls from the heaven and that springs from the earth, every living thing?, in the way of plants and otherwise: in other words, water is the cause of such [things] having life. Will they not then believe?, by affirming My Oneness?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have not those who disbelieve) in Muhammad (pbuh) and the Qur'an (known that the heavens and the earth were of one piece) We did not send down to it a drop of rain or grow vegetation on the earth which were aligned with each other (then We parted them) and then separated them and singled them out from each other through rain and plants, (and We made every living thing of water) We made of water from the male and female everything that requires water? (Will they) i.e. the people of Mecca (not then believe) in Muhammad (pbuh) and in the Qur'an?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَنَّ ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ كَانَتَا رَتْقاً فَفَتَقْنَاهُمَا } معناه كانتْ السّمواتُ والأرضُ واحِدةً فَفَتَق من الأَرضِ سَبعَ أرضينَ\n ويقال: فَتقَ السَّماءَ بالمطرِ والأَرضَ بالنَّباتِ\n والرَّتقُ: التي لا ثَقبَ فيهَا\n\n\n\n\nوقوله تعالى: { وَجَعَلْنَا مِنَ ٱلْمَآءِ كُلَّ شَيْءٍ حَيٍّ } معناهُ من النُّطفةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } ينكرون وحدتنا، ويثبتون لنا شريكاً من مصنوعاتنا، وينسبون بنا ولداً ظلماً وزوراً { وَلَمْ يَرَ ٱلَّذِينَ كَفَرُوۤاْ } بنا بأمثال هذه الخرافات الباطنة، ولم يعلموا كمال قدرتنا { أَنَّ ٱلسَّمَٰوَٰتِ } أي: عالم الأسماء والصفات { وَٱلأَرْضَ } أي: عالم الطبيعة والعكوس والأظلال قد { كَانَتَا رَتْقاً } أي: كان كلُ منهما مرتَّقاً متضمناً بلا تعددٍ وتكثرٍ\n\n\n\n\nأما الأسماء والصفات فمندمجةُ مندرجةُ في الذات بلا هبوطٍ وتنزلٍ وظهور أثرٍ\n\n\n\n\nوأمَّا الطبيعة العدمية قد كانت ساكنةً في زاوية العدم بلا امتداد ظل الوجود عليها، { فَفَتَقْنَاهُمَا } بالتجليات الحبية المنتشئة من الأسماء الذاتية والصفات الكمالية الفعلية، المقتضية للظهور والانجلاء لحكم، ومصالح قد استأثرنا بها، وبالقبول والتأثر من أشعة التجليات { وَ } إن أردتم أن تنكشف لكم كيفية انتشاء الأشياء الكثيرة من الذات الواحدة المتصفة بالصفات والأسماء المتماثلة والمتقابلة، فانظروا كيف { جَعَلْنَا مِنَ ٱلْمَآءِ } الواحد بالذات، والمشتمل على الأوصاف الكثيرة بحسب الآثار الصادرة منه { كُلَّ شَيْءٍ حَيٍّ } أي: خلقنا، وصيَّرنا كل شيء له إحساسُ وتغذيةُ وتنميةُ وازديادُ وانتقاص من الماء؛ إذ هو أقوى أسباب التبدلات والتشكلات، وأقبل إلى قبول التصرفات والامتزاجات { أَفَلاَ يُؤْمِنُونَ } [الأنبياء: 30] ويصدقون بهذا، مع أنه من أجلى البديهات، وأظهر المحسوسات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:39",
      "similarity": 0.03004803227200316
    },
    {
      "verse": "29:63",
      "similarity": 0.02762763037151334
    },
    {
      "verse": "16:65",
      "similarity": 0.027595273427303453
    },
    {
      "verse": "30:24",
      "similarity": 0.027499522703792634
    },
    {
      "verse": "22:63",
      "similarity": 0.027365964547547063
    }
  ]
}