{
  "chapter": "الأنبياء",
  "text": "قال ربى يعلم القول فى السماء والارض وهو السميع العليم",
  "translations": [
    {
      "translation": "He said: \"My Lord knows whatever is spoken in the heavens and the earth. He hears all and knows everything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord knows well all that is spoken in the heavens and the earth. He is All-Hearing, All- Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord said, \"Tell them (Muhammad), 'My Lord knows all that is said in the heavens and the earth. He is All-hearing and All-knowing \".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Prophet said, “My Lord knows all that is spoken in the heavens and in the earth; and He only is the All Hearing, the All Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"My Lord knows what is said in the heavens and on earth. And He is the All-Hearer, the All-Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord knows what is spoken in the heaven and the earth, and He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He says: 'My Lord knows what is said in the heavens and the earth, and He is the All-hearing, the All-knowing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He saith: My Lord knoweth what is spoken in the heaven and the earth. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"My Lord knows every word spoken in the heavens and on the earth. He is All Hearing, All Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet said: my Lord knoweth the word in the heavens and the earth, and He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord knows every word [spoken] in the sky and on the earth, and He is the All-hearing, the All-knowing.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"My Lord knoweth (every) word (spoken) in the heavens and on earth: He is the One that heareth and knoweth (all things).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Muhammad SAW) said: \"My Lord knows (every) word (spoken) in the heavens and on earth. And He is the All-Hearer, the All-Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'My Lord has knowledge of what is said in the heavens and on earth. He is the Hearer, the Knower'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord knows what is said in the heaven and the earth; and He is the Hearer, the Knower.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet said, \"My Lord knows whatever is said throughout the heaven and earth, and He is the Hearing, the Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:4] He said, to them, ‘My Lord knows the words, that are [spoken], in the heavens and the earth, and He is the Hearer, of what they keep secret, the Knower’, of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He saith) Muhammad says to them: (My Lord knoweth what is spoken in the heaven and the earth) Allah knows the secret words that the dwellers of the heaven and the earth say and the secret works they do. (He is the Hearer) of what Abu Jahl and his host say, (the Knower) of Abu Jahl and his host as well as of their punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } يا أكمل الرسل في جوانبهم، والرد عليهم: { رَبِّي } الذي ربَّاني بأنواع الكرامات والمعجزات { يَعْلَمُ ٱلْقَوْلَ } أي: جنس الأقوال والأفعال والأحوال الكائنة { فِي ٱلسَّمَآءِ } أي: عالم الأرواح { وَٱلأَرْضِ } أي: عالم الطبيعة والأشباح { وَ } كيف لا يعلم ويعزب عن علمه شيء؛ إذ { هُوَ ٱلسَّمِيعُ } المقصور على السمع بحيث لا يسمع سواه { ٱلْعَلِيمُ } [الأنبياء: 4] المستقلُّ بالعلم لا عالم إلا هو\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو السميعُ العليم } أي: المبالغ في العلم بالمسموعات والمعلومات، التي من جملة ما أسروه من النجوى، فيجازيهم بأقوالهم وأفعالهم",
      "translations": []
    }
  ]
}