{
  "chapter": "الأنبياء",
  "text": "ونضع الموزين القسط ليوم القيمة فلا تظلم نفس شيـا وان كان مثقال حبة من خردل اتينا بها وكفى بنا حسبين",
  "translations": [
    {
      "translation": "We will set up the Just Balance on the Day of Rising and no self will be wronged in any way. Even if it is no more than the weight of a grain of mustard-seed, We will produce it. We are sufficient as a Reckoner.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall fix the scales of justice on the Day of Resurrection, so that none will be wronged in the least; and even if it were equal to a mustard seed in weight We shall take it (into account). We are sufficient for computation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall set up just scales on the Day of Resurrection so that none will be wronged in the least. (We shall bring forth the acts of everyone), even if it be the weight of a grain of mustard seed. We shall suffice as Reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall maintain proper justice on the Day of Judgment. No soul will be wronged the least. For a deed even as small as a mustard seed one will duly be recompensed. We are efficient in maintaining the account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall set up the scales of justice on the Day of Resurrection – therefore no soul will be wronged in the least; and if a thing is equal to a grain of mustard seed, We will bring it; and We are Sufficient to (take) account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall set up Balances of justice on the Day of Resurrection, then none will be dealt with unjustly in anything. And if there be the weight of a mustard seed, We will bring it. And sufficient are We to take account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will set up a just balance on the day of resurrection, so no soul shall be dealt with unjustly in the least; and though there be the weight of a grain of mustard seed, (yet) will We bring it, and sufficient are We to take account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall set up the just balances for the Resurrection Day, so that not one soul shall be wronged anything; even if it be the weight of one grain of mustard-seed We shall produce it, and sufficient are We for reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We set a just balance for the Day of Resurrection so that no soul is wronged in aught. Though it be of the weight of a grain of mustard seed, We bring it. And We suffice for reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall set up scales of justice on the Day of Resurrection, so that no soul can be in the least wronged. Actions as small as a grain of mustard seed shall be weighed. We are sufficient as a reckoner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall set balances of justice for the Day of Judgment; then no soul shall be wronged at all; and if it be but the weight of a grain of mustard-seed We shall bring it; and We suffice as Reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall set up just scales on the Day of Resurrection, and no soul will be wronged in the least. Even if it be the weight of a mustard seed We shall produce it and We suffice as reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall set up scales of justice for the Day of Judgment, so that not a soul will be dealt with unjustly in the least, and if there be (no more than) the weight of a mustard seed, We will bring it (to account): and enough are We to take account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall set up balances of justice on the Day of Resurrection, then none will be dealt with unjustly in anything. And if there be the weight of a mustard seed, We will bring it. And Sufficient are We as Reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection We shall set up just scales, so that no soul shall in the least be wronged, even though it be the weight of a grain of mustard seedWe will bring it We Suffice as reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will set up the scales of justice for the Day of Resurrection, so that no soul will suffer the least injustice. And even if it be the weight of a mustard-seed, We will bring it up. Sufficient are We as Reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We place the scales of justice for the Day of Resurrection, so no soul will be treated unjustly at all. And if there is [even] the weight of a mustard seed, We will bring it forth. And sufficient are We as accountant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:47] And We shall set up the just balances, the equitable ones, for the Day of Resurrection, that is, on it, and no soul shall be wronged in any way, neither by deducting a good deed [from its record], nor by adding [to it] an evil one; and even if it, the action, be the weight of a [single] mustard seed, We shall produce it, with its full weight, and We suffice as reckoners, to count all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We set a just balance for the Day of Resurrection) on the Day of Judgement, there will be a balance which will weigh only good and bad works (so that no soul is wronged in aught) no one will have his good works diminished nor his evil works increased. (Though it be of the weight of a grain of mustard seed, We bring it) We requite for it. (And We suffice for reckoners) We are enough as Preserver and Knower.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا } معناه جَازينَا بِهَا\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - \"{And if the weight of a mustard seed was brought, We would bring it}\" - means that We are capable of it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بمجرد اعترافهم بظلمهم لا نأخذهم ولا نعذبهم حينئذٍ بل { نَضَعُ ٱلْمَوَازِينَ ٱلْقِسْطَ } العدل المسوى المستقيم بحيث لا عوج ولا انحراف لها إلى جانبٍ أصلاً\n المعدة { لِيَوْمِ ٱلْقِيَامَةِ } لنوزن فيها أعمال العباد صالحها وفاسدها\n ثم نجازيهم على مقتضى ما ظهر منها { فَلاَ تُظْلَمُ } وتنقص { نَفْسٌ شَيْئاً } من جزائها\n ولا تزداد عليها أيضاً سواء كان خيراً أو شراً\n ثواباً أو عقاباً على مقتضى عدلنا القويم وصراطنا المستقيم { وَإِن كَانَ } العمل والظلم وزنه { مِثْقَالَ حَبَّةٍ } كائنة { مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا } مع أنها لا اعتداد لها\n وجازينا صاحبها عليها تتميماً لعدلنا\n وتوفيةً لحقوق عبادنا { وَكَفَىٰ بِنَا حَاسِبِينَ } [الأنبياء: 47] أي: كفى حسبانا لحقوق عبادانا أو لا يعزب عن حيطة حضرة علمنا شيء منها وإن قلَّ وحقر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ومن قرأ: { مثقال } بضم اللام، فكان تامة، وبالنصب: خبر كان، أي: وإن كان العمل المدلول عليه بوضع الموازين\n يقول الحقّ جلّ جلاله: { قل } لهم يا محمد { إِنما أُنذِرُكُم } وأخوفكم من العذاب الذي تستعجلونه، أو بالساعة الموعودة، { بالوحي } القرآني الصادق، الناطق بإتيانه، وفظاعة شأنه، أي: إنما شأني أن أُنذركم بالإخبار به، لا بإتيانه فإنه مخالف للحكمة الإلهية إذ الإيمان برهاني لا عياني، فإذا أَنذرتَهم فلا يسمع إنذارك إلا من سبقت له العناية، دون من سبق له الشقاء، ولذلك قال تعالى: { ولا يسمع الصمُّ الدعاءَ } أي: الإنذار، أو لا تُسمع أنت الصمَّ الدعاءَ { إِذا ما يُنذَرُون } يُخوَّفون، واللام في للعهد، وهو إشارة إلى هؤلاء المنذرين، والأصل: ولا يسمعون إنذارك إذا يُنذرون، فوضع الظاهر موضع المضمر إشارة إلى تصاممهم وسد أسماعهم إذا أنذروا، وتسجيلاً عليهم بذلك\n وفي التعبير بالدعاء، دون الكلام في الإنذار، إشارة إلى تناهي صممهم في حال الإنذار، فإن الدعاء من شأنه أن يكون بأصوات عالية مكررة مقارنة لهيئة دالة عليه، فإذا لم يسمعوا، مع هذه الحالة، يكون صممهم في غايةٍ لا غاية ورائها\n { ولَئِنْ مسّتْهم نفحةٌ } أي: دفعة يسيرة { من عذاب ربك } أي: كائنة منه، { ليقولنَّ يا ويلنا إِنا كنا ظالمين } ، وهذا بيان لسرعة تأثيرهم من مجيء نفس العذاب، إثر بيان عدم تأثرهم من مجرد الإخبار به، لانهماكهم في الغفلة، أي: والله لئن أصابهم أدنى شيء من هذا العذاب الذي يُنذرون به، لذلوا، ودَعوا بالويل على أنفسهم، وأقروا بأنهم ظلموا أنفسهم حين تصامموا وأعرضوا\n وقد بُولغ في الكلام، حيث عبَّر بالمس والنفح لأن النفح يدل على القلة، فأصل النفح: هبوب رائحة الشيء، يُقال: نفحه بعطية، إذا أعطاه شيئًا يسيرًا، مع أن بناءها للمرة مؤكد لقلتها\n ثم بيَّن ما يقع عند إتيان ما أنذروه، فقال: { ونضع الموازينَ القِسْطَ } أي: نقيم الموازين العادلة التي تُوزن بها الأعمال، وهو جمع ميزان، وهو ما يوزن به الشيء ليُعرف كمِّيته\n وعن الحسن: \" هو ميزان له كفتان ولسان \" ، وإنما جمع الموازين لتعظيم شأنها، والوزن لصحائف الأعمال في قول، وقيل: وضع الميزان كناية عن تحقيق العدل، والجزاء على حسب الأعمال\n\n\nوإفراد القسط لأنه مصدر وصف به للمبالغة، كأنها في نفسها قسط، أو على حذف مضاف، أي: ذوات القسط\n وقوله: { ليوم القيامة } أي: لأهل يوم القيامة، أي: لأجلهم، أو في يوم القيامة، { فلا تُظلم نفسٌ شيئًا } من الظلم، ولا تنقص حقًا من حقوقها، بل يُؤتى كل ذي حق حقه، إن خيرًا فخيرٌ، وإن شرًّا فشر\n { وإِن كان مثقالَ حبةٍ من خَرْدَلٍ } أي: وإن كان الشيء أو العمل مثقال حبة من خردل، { أتينا بها }: أحضرناها وجازينا عليها، وأنث ضمير المثقال لإضافته إلى حبة، { وكفى بنا حاسبين } ، إذ لا مزيد على علمنا وعدلنا، أو عالمين حافظين، لأن من حسب شيئًا علمه وحفظه، قاله ابن عباس - رضي الله عنهما -\n الإشارة: كان صلى الله عليه وسلم يُنذر الناس ويذكّرهم بالوحي التنزيلي، وبقي خلفاؤه يذكرون بالوحي الإلهامي، موافقُا للتنزيلي، ولا يسمع وعظهم ويحضر مجالسهم إلا من سبقت له سابقة العناية، وأما من انتكبت عنه العناية تنكب مجالسهم، وتصامم عن وعظهم وتذكيرهم، ولا يسمع الصمُّ الدعاء إذا ما ينذرون، ولا يندمون إلا حين تنزل بهم الأهوال، ولا ينفع الندم وقد جف القلم، وذلك حين تُوضع موازين الأعمال، فتثقل أعمال المخلصين، وتخف أعمال المخلَّطين، ولا تُوضع الموازين إلا لأهل النفوس الموجودة، وأما من غاب عن نفسه في شهود محبوبه، لفنائه في شهوده، وانطوائه في وجوده، فلا ينصب له ميزان إذ لا يشهد لنفسه حسًا ولا فعلاً ولا تركًا، وإنما الفعل كله للواحد القهار\n ويكون من السبعين ألفًا الذين يدخلون الجنة بغير حساب، جعلنا الله من خواصهم بمنِّه وكرمه\n آمين\n ثم شرع في تفصيل ما أجمل في قوله:\n\n، [الأنبياء: 7] إلى قوله:\n\n[الأنبيَاء:9]\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:16",
      "similarity": 0.6172677345829766
    },
    {
      "verse": "55:9",
      "similarity": 0.22473695609674724
    },
    {
      "verse": "7:8",
      "similarity": 0.2064773839647562
    },
    {
      "verse": "55:7",
      "similarity": 0.20565414813362515
    },
    {
      "verse": "101:6",
      "similarity": 0.20399823652560534
    }
  ]
}