{
  "chapter": "الأنبياء",
  "text": "قل من يكلؤكم باليل والنهار من الرحمن بل هم عن ذكر ربهم معرضون",
  "translations": [
    {
      "translation": "Say: 'Who will protect you night and day from the All-Merciful?' Yet they turn away from the remembrance of their Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who guards you from Ar-Rahman by night and by day?\" Yet from a mention of their Lord they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Muhammad): \"Who protects you, during the night or the day from the Most Compassionate Lord?\" And yet they turn away from the Admonition of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, \"Who can protect them from (the wrath of) the Beneficent God during the night and day?\" Yet they are neglectful about their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Who guards you night and day from the Most Gracious?” In fact they have turned away from the remembrance of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who can guard and protect you in the night or in the day from the Most Gracious\" Nay, but they turn away from the remembrance of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who guards you by night and by day from the Beneficent Allah? Nay, they turn aside at the mention of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who shall guard you by night and in the daytime from the All-merciful?' Nay, but from the Remembrance of their Lord they are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who guardeth you in the night or in the day from the Beneficent? Nay, but they turn away from mention of their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who will save you from the wrath of the Most Gracious, by night and by day?\" Yet they turn away from the remembrance of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: who guardeth you by night and by day from the Compassionate! O Yet from the remembrance of their Lord they avert themselves!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Who can guard you, day and night, against [the punishment of] the All-beneficent [should He want to punish you]?’ Indeed, they are disregardful of their Lord’s remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who can keep you safe by night and by day from (the Wrath of) (Allah) Most Gracious?\" Yet they turn away from the mention of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who can guard and protect you in the night or in the day from the (punishment of the) Most Beneficent (Allah)?\" Nay, but they turn away from the remembrance of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who will guard you, by night and by day from the Merciful' But no, they turn away from their Lord's remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who guards you against the Merciful by night and by day?” But they turn away from the mention of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who can protect you at night or by day from the Most Merciful?\" But they are, from the remembrance of their Lord, turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:42] Say, to them: ‘Who can guard you, preserve you, by night and day from the Compassionate One?’, from His chastisement, if it should befall you? In other words, no one can do such a thing. Those being addressed [here] do not fear God’s chastisement because they deny [the truth of] it. Nay, but of the Remembrance of their Lord, that is, the Qur’ān, they are disregardful, failing to reflect on it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ مَنْ يَكْلَؤُكُمْ بِاللَّيْلِ وَالنَّهَارِ مِنَ الرَّحْمَنِ بَلْ هُمْ عَنْ ذِكْرِ رَبِّهِمْ مُعْرِضُونَ (42) { قُلْ مَن يَكْلَؤُكُم باليل والنهار مِنَ الرحمن بَلْ هُمْ عَن ذِكْرِ رَبِّهِمْ مُّعْرِضُونَ \\* أَمْ لَهُمْ آلِهَةٌ تَمْنَعُهُمْ مِّن دُونِنَا لاَ يَسْتَطِيعُونَ نَصْرَ أَنْفُسِهِمْ وَلاَ هُمْ مِّنَّا يُصْحَبُونَ \\* بَلْ مَتَّعْنَا هَؤُلاءِ وءابَاءهم حَتَّى طَالَ عَلَيْهِمْ العُمُرُ }بعد أن سُلِّيَ الرسول صلى الله عليه وسلم على استهزائهم بالوعيد أُمر أن يذكرهم بأن غرورهم بالإمهال من قِبل الله رحمة منه بهم كشأنه في الرحمة بمخلوقاته بأنهم إذا نزل بهم عذابه لا يجدون حافظاً لهم من العذاب غيره ولا تمنعهم منه آلهتهم .والاستفهام إنكار وتقريع ، أي لا يكلؤُهم منه أحد فكيف تجهلون ذلك ، تنبيهاً لهم إذ نسوا نعمه .وذكر الليل والنهار لاستيعاب الأزمنة كأنه قيل : من يكلؤكم في جميع الأوقات .وقدم الليل لأنه زمن المخاوف لأن الظلام يُعين أسباب الضر على الوصول إلى مبتغاها من إنسان وحيوان وعلل الأجسام .وذكر النهار بعده للاستيعاب .ومعنى { من الرحمان } من بأسه وعذابه .وجيء بعد هذا التفريع بإضرابات ثلاثة انتقالية على سبيل التدريج الذي هو شأن الإضراب .فالإضراب الأول قوله تعالى : { بل هم عن ذكر ربهم معرضون } ، وهو ارتقاء من التقريع المجعول للإصلاح إلى التأييس من صلاحهم بأنهم عن ذكر ربهم معرضون فلا يُرجَى منهم الانتفاع بالقوارع ، أي أخِّرْ السؤال والتقريع واتركهم حتى إذا تورّطوا في العذاب عرفوا أن لا كالىء لهم .ثم أضرب إضراباً ثانياً ب ( أم ) المنقطعة التي هي أخت ( بل ) مع دلالتها على الاستفهام لقصد التقريع\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad to the people of Mecca: (Who guardeth you) who protects you (in the night or in the day from the Beneficent) from the chastisement of the Beneficent? It is also said that this means: who protects you from the punishment of other than the Beneficent? (Nay, but they turn away from) but they disbelieve and discard the (the mention of their Lord) from the profession of Allah's divine Oneness and the Scripture of their Lord,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُلْ مَن يَكْلَؤُكُم } معناه يَحفَظُكمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Who will protect you} means He will protect you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن أنكروا إلمام العذاب وإنزاله عليهم { قُلْ } لهم يا أكمل الرسل نيابة عنَّا: { مَن يَكْلَؤُكُم } ويحفظكم { بِٱلْلَّيْلِ } وقت فراغكم ومنامكم { وَٱلنَّهَارِ } وقت شغلكم وترددكم { مِنَ } نزول العذاب عذاب { ٱلرَّحْمَـٰنِ } القادر على أنواع القهر والانتقام بمقتضى جلاله\n لو لم يرحم عليكم بمقتضى لطفه وجماله\n لكن يرحم عليكم\n فلم يعذبكم رجاء أن تنتبهوا وتواظبوا على شكر نعمه\n وأداء حقوق كرمه { بَلْ هُمْ } من شدة غفلتهم وسكرتهم { عَن ذِكْرِ رَبِّهِمْ } الذي يحفظهم عن أنواع المكروهات والمؤذيات { مُّعْرِضُونَ } [الأنبياء: 42] لا يتوجهون نحوه ولا يلازمون عبادته ولا يداومون شكره\n\n\n{ أَمْ } يزعمون أولئك المصرون المسرفون أن يدفعوا عذابنا النازل لهم بقوة نفوسهم { لَهُمْ آلِهَةٌ تَمْنَعُهُمْ } أي: تمنع عنهم العذاب مع أهم { مِّن دُونِنَا } شركاء لنا في الألوهية والربوبية كما زعموا\n وتشفعه لهم عندنا\n كلا وحاشا أن يسع لآلهتهم هذا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { قلْ } لهم يا محمد: { مَن يكلؤكُم }: يحفظكم { بالليل والنهار من } بأس { الرحمنِ } الذي تستحقونه\n إذا نزل بكم ليلاً أو نهارًا\n قال الواسطي: من يحفظكم بالليل والنهار من الرحمن أن يظهر عليكم ما سبق فيكم؟ وقال ابن عطاء: من يكلؤكم من أمر الرحمن سوى الرحمن\n وهل يقدر أحد على الكلاءة سواه؟ وتقديم الليل لأن الدواهي فيه أكثر وقوعًا وأشد وقعًا\n وفي التعرض لعنوان الرحمانية إيذان بأن كلاءتهم ليس إلا برحمته العامة\n { بل هم عن ذِكْرِ ربهم معرضون } أي: بل هم معرضون عن ذكره\n ولا يُخطِرونه ببالهم\n فضلاً أن يخافوا بأسه\n حتى إذا رزقوا الكلاءة عرفوا مَن الكالئ\n وصلحوا للسؤال عنه\n والمعنى: أنه أمر رسوله - عليه الصلاة والسلام - بسؤالهم عن الكالئ\n ثم أضرب عنه\n وبيَّن أنهم لا يصلحون لذلك\n لإعراضهم عن ذكر من يكلؤهم\n هكذا للزمخشري ومن تبعه\n وقال ابن جزي: والمعنى: أنه تهديد وإقامة حجة عليهم لأنهم لو أجابوا عن هذا السؤال لاعترفوا بأنه ليس لهم مانع ولا حافظ غيره تعالى - يعني لِمَا جربوه في أحوال محنتهم - ثم قال: وجاء قوله: { بل هم عن ذكر ربهم معرضون } \n بمعنى أنهم\n إذا سُئلوا ذلك السؤال\n لم يجيبوا عنه\n لأنهم تقوم عليهم الحجة إن أجابوا\n ولكنهم يعرضون عن ذكر الله\n هـ\n أي: يعرضون عن أن يقولوا: كالأنا الله عتوًا وعنادًا\n وهو معنى قوله: { بل هم عن ذكر ربهم مُعرِضون } \n كأنه قال: لو سُئلوا\n لم يجدوا جوابًا\n إلا أن يقولوا: هو الله\n لكنهم يعرضون عن ذكره مكابرة\n قلت: وما قاله ابن جزي أحسن مما قاله الزمخشري ومن تبعه\n وأقرب\n ثم قال تعالى: { أم لهم آلهةٌ تمنعُهم من دوننا } \n هذا انتقال من بيان جهلهم بحفظه تعالى\n أو إعراضهم عن ذكره\n إلى توبيخهم باعتمادهم على آلهتهم\n والمعنى: ألهم آلهة تمنعهم من العذاب تجاوز منعنا وحفظنا\n فهم يعولون عليها واثقون بحفظها؟ وفي توجيه الإنكار والنفي إلى وجود الآلهة بما ذكر من المنع\n لا إلى نفس الصفة\n بأن يقال: أم تمنعهم آلهتهم\n\n\n الخ\n من الدلالة على سقوطها عن مرتبة الوجود\n فضلاً عن رتبة المنع\n ما لا يخفى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:54",
      "similarity": 0.5531523912701211
    },
    {
      "verse": "80:11",
      "similarity": 0.5531523912701211
    },
    {
      "verse": "74:53",
      "similarity": 0.5492527864240305
    },
    {
      "verse": "82:9",
      "similarity": 0.5486443116306613
    },
    {
      "verse": "70:39",
      "similarity": 0.48402614228116325
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}