{
  "chapter": "الأنبياء",
  "text": "بل متعنا هؤلاء وءاباءهم حتى طال عليهم العمر افلا يرون انا ناتى الارض ننقصها من اطرافها افهم الغلبون",
  "translations": [
    {
      "translation": "No indeed! We have given these people enjoyment, as We did their fathers, until life seemed long and good to them. Do they not see how We come to the land eroding it from its extremities? Or are they the victors?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We allowed them and their fathers time to enjoy till the very end of their lives. Do they not see Us advancing into the land, reducing its frontiers? Would they still prevail?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, We generously provided them and their fathers, and they enjoyed Our provision for long. Do they not see that We are now advancing into their territory, diminishing it from different sides? Is it they, then, who will triumph?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have been providing these men and their fathers with the means of enjoyment for a long time. Have they not ever considered that We populated the earth and then caused many of the inhabitants to pass away? Can they have any success (in their wickedness)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But in fact We have given these (disbelievers) and their fathers a benefit to the extent that life became long for them; so do they not see that We are reducing the land from its borders? So will these be victorious?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, We gave the luxuries of this life to these men and their fathers until the period grew long for them. See they not that We gradually reduce the land from its outlying borders Is it then they who will overcome\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, We gave provision to these and their fathers until life was prolonged to them. Do they not then see that We are visiting the land, curtailing it of its sides? Shall they then prevail?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but Ourselves gave these and their fathers enjoyment of days, until their life had lasted long while upon them. What, do they not see how We come to the land, diminishing it in its extremities? Or are they the victors?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but We gave these and their fathers ease until life grew long for them. See they not how we aim to the land, reducing it of its outlying parts? Can they then be the victors?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet We bestowed the good things [of life] upon their fathers for a great length of time. But do they not see how We are shrinking their borders? Is it they who will prevail?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! We let these people and their fathers enjoy until there grew long upon them the life. Behold they not that We come unto the land diminishing it by the borders thereof? Shall they then be the victors?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have provided for them and their fathers until they lived on for long years. Do they not see how We visit the land diminishing it at its edges? Are they the ones who will prevail?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, We gave the good things of this life to these men and their fathers until the period grew long for them; See they not that We gradually reduce the land (in their control) from its outlying borders? Is it then they who will win?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, We gave the luxuries of this life to these men and their fathers until the period grew long for them. See they not that We gradually reduce the land (in their control) from its outlying borders? Is it then they who will overcome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave days of enjoyment to them and their fathers until their life became long. Are they unable to see how We come to their land and reduce its borders. Or, is it they who are the victors?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have given these enjoyments, and their ancestors, until time grew long upon them. Do they not see how We gradually reduce the land from its extremities? Are they then the victors?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, [on the contrary], We have provided good things for these [disbelievers] and their fathers until life was prolonged for them. Then do they not see that We set upon the land, reducing it from its borders? So it is they who will overcome?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:44] Nay, but We provided [comforts] for these and their fathers, in the way of the graces which We bestowed on them, until life lasted long for them, so that they were deluded by such [longevity]. Do they not see how We visit the land, [how] We target their land, diminishing it at its edges?, by granting the Prophet victory [through conquest]. Are they the ones who will prevail? No, it is rather the Prophet and his Companions [who will do so].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but We gave these) the people of Mecca (and their fathers) before them (ease) a reprieve (until life grew long for them) until their lifespan grew long for them. (See they) i.e. the people of Mecca (not how we visit the land) how We seize the land, (reducing it) conquering it, for Muhammad (of its outlying parts) from its sides? (Can they then be the victors) are they then going to be victorious over Muhammad (pbuh)?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَفَلاَ يَرَوْنَ أَنَّا نَأْتِي ٱلأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَآ } معناه بموتِ عُلمائِها\n وقالَ: ألَمْ يَعلمُوا أَنَّا نَفتحُ لِمحمدٍ صلَّى الله عليه وعلى آلهِ وسلمَ أرضاً بعد أرضٍ\n أفهُم الغَالِبونَ\n بل والله ورسُولُه هُما الغَالبانِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Do they not see that We are coming to the earth and We are depleting it from its edges} [means] the death of its scholars.\n\n\nAnd he said: \"Did they not know that we would open up the earth for Muhammad (peace and blessings of Allah be upon him and his family) after the earth?\"\n\n\nThe majority understand.\n\n\nYes, by Allah and His Messenger, they are the prevailing ones.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ مَتَّعْنَا هَـٰؤُلاۤءِ } المسرفين المعاندين { وَآبَآءَهُمْ } الضالين المستكبرين { حَتَّىٰ طَالَ عَلَيْهِمُ ٱلْعُمُرُ } فارتكبوا أنواع المعاصي والآثام مدة حياتهم فظنوا أنهم مصونون عن الأخذ والانتقام\n ونزول العذاب والنكال { أَ } يتوهمون من إمهالنا إيام هذا الموهوم { فَلاَ يَرَوْنَ أَنَّا } من مقام قهرنا وانتقامنا إياهم { نَأْتِي ٱلأَرْضَ } أي: نبعث ونغلب جنود المسلمين على أرض الكفرة بحيث { نَنقُصُهَا } ونخربها مبتدئين { مِنْ أَطْرَافِهَآ } إلى أن وصل إلى أقاصيها { أَ } يزعمون ويتوهمون بعد أخذنا في تخريبه أطراف بلادهم وتنقيصها { فَهُمُ ٱلْغَالِبُونَ } [الأنبياء: 44] على جنودنا وجنود أنبيائنا ورسلنا\n ما هو إلا زعم فاسد\n فإن ادعوا أنا وآباؤنا دائماً مستمراً في كنف حفظ الله وجوار صونه من أعمارنا\n فمن أين تخوفنا وتنذرنا أنت من إنزال الله العذاب علينا بغتة مع أنه لم يعهد لنا ولا لآبائنا منه تعالى أمثال هذا\n\n\n{ قُلْ } يا أكمل الرسل في جوابهم: { إِنَّمَآ أُنذِرُكُم } أي: ما أنذركم وأخوفكم من تلقاء نفسي بل { بِٱلْوَحْيِ } المنزل عليّ من عند الله\n المشتمل على إنذاركم وتخويلكم\n\n\nثم قال سبحانه توبيخاً عليهم وتقريعاً: { وَ } كيف يرشدكم ويهديكم الرسول المنزل إليكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أفهم الغالبون } على رسول الله صلى الله عليه وسلم والمؤمنين\n أي: أفكفار مكة يغلبون بعد أن نقصنا من أطراف أرضهم؟ أي: ليس كذلك\n بل يغلبهم الرسول - عليه الصلاة والسلام - وأصحابه الكرام\n وقد تحقق ذلك وأنجز الله وعده\n والله غالب على أمره\n الإشارة: قل من يكلؤ قلوبكم وأسراركم من الرحمن\n أن يذهب بما أودع فيها من المعارف وأنوار الإحسان؟ فلا أحد يحفظها إلا من رحمها بما أودع فيها\n ولهذا كان العارفون لا يزول اضطرارهم\n ولا يكون مع غير الله قرارهم\n لا يعتمدون على عمل ولا حال\n ولا على علم ولا مقال\n وفي الحكم: \" إلهي\n حكمك النافذ\n ومشيئتك القاهرة\n لم يتركا لذي حال حالاً\n ولا لذي مقال مقالاً \"\n وقال أيضًا: \" إلهي كم من طاعة بنيتُها وحالة شيدتُها\n هدم اعتمادي عليها عدلك\n بل أقالني منها فضلك \"\n وكثير من الناس غافلون عن هذا المعنى\n بل هم عن ذكر ربهم مُعرِضون\n قال الورتجبي: قوله تعالى: { قل من يكلؤكم\n\n\n } الآية\n أخبر عن كمال إحاطته بكل مخلوق\n وتنزيهه عن العَجَلة بمؤاخذتهم\n كأنه يقول: أنا بذاتي تعاليت\n أدفع بلطفي القديم عنكم قهري القديم\n ولولا فضلي السابق وعنايتي القديمة بالرحمة عليكم\n من يدفعه بالعلة الحدثانية؟ وهذا من كمال لطفي عليكم وأنتم بعد معرضون عني يا أهل الجفا\n وذلك قوله: { بل هم عن ذكر ربهم مُعرِضون }\n هـ\n بلفظه مع تصحيف في النسخة\n وقوله تعالى: { بل متعنا هؤلاء\n\n\n } الآية\n تمتيع العبد بطول الحياة\n إن كان ذلك في طاعة الله\n وازدياد في معرفته\n فهو من النعم العظيمة\n وفي الحديث:\n \" خَيرُكُم مَنْ طَال عُمُرهُ وحَسُنَ عَمَلُهُ \" \nلكن عند الصوفية: أنه لا ينبغي للمريد أن ينظر إلى ما مضى من عمره في طريق القوم\n فقد كان بعض الشيوخ يقول: لا يكن أحدكم عبد الدهور وعبد العدد\n قال الشيخ أبو العباس المرسي رضي الله عنه: معنى كلامه: أنه لا ينبغي للفقير أن يعدكم له في طريق القوم\n ليقول: أنا لي كذا وكذا من السنين في طريق القوم\n هـ\n بالمعنى\n ولعل علة النهي لئلا يرى للأيام تأثيرًا في الفتح\n فقد قالوا: هي لمن صدق لا لمن سبق\n وقوله تعالى: { أفلا يرون أنا نأتي الأرض ننقصها من أطرافها } قال القشيري: فيه إشارة إلى سقوط قوى العبد بمرور السنين\n وتطاول العمر\n فإن آخر الأمر كما قيل:\nوكما قيل:\nوكأنه فسر الأرض بأرض النفوس من باب الإشارة\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:41",
      "similarity": 0.568164273512262
    },
    {
      "verse": "28:45",
      "similarity": 0.3821664625020487
    },
    {
      "verse": "73:7",
      "similarity": 0.3579506493133007
    },
    {
      "verse": "50:4",
      "similarity": 0.3573056447599505
    },
    {
      "verse": "35:11",
      "similarity": 0.35369209667959406
    }
  ]
}