{
  "chapter": "الأنبياء",
  "text": "قل انما انذركم بالوحى ولا يسمع الصم الدعاء اذا ما ينذرون",
  "translations": [
    {
      "translation": "Say: 'I can only warn you through the Revelation.' But the deaf cannot hear the call when they are warned.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am warning you by God's command.\" But the deaf do not hear the call when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"I only warn you by the Revelation.\" But the deaf do not hear the cry when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"I am warning you by revelation alone.\" The deaf do not hear any call when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him) “I warn you only with the divine revelation; and the deaf do not hear the call when warned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I warn you only by the revelation. \"But the deaf will not hear the call, (even) when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I warn you only by revelation; and the deaf do not hear the call whenever they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I warn you only by the Revelation'; but they that are deaf do not hear the call when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad, unto mankind): I warn you only by the Inspiration. But the deaf hear not the call when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I warn you only through the Revelation.\" But the deaf can hear nothing when they are warned,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: I only warn you by the revelation; and the deaf hearken not unto the call when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I indeed warn you by the means of revelation.’ But the deaf do not hear the call when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I do but warn you according to revelation\": But the deaf will not hear the call, (even) when they are warned!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"I warn you only by the revelation (from Allah and not by the opinion of the religious scholars and others). But the deaf (who follow the religious scholars and others blindly) will not hear the call, (even) when they are warned [(i.e. one should follow only the Quran and the Sunnah (legal ways, orders, acts of worship, statements of Prophet Muhammad SAW, as the Companions of the Prophet SAW did)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I warn you only by the Revelation' But the deaf hear nothing when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am warning you through inspiration.” But the deaf cannot hear the call when they are being warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I only warn you by revelation.\" But the deaf do not hear the call when they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:45] Say, to them: ‘I warn you only by the Revelation’, [that comes] from God, and not by my own prompting. But the deaf do not hear the call when (idhā, read pronouncing both hamzas fully, or omitting the second [hamza] between it and the yā’) they are warned. They are like those who are deaf, when they fail to act in   accordance with the warnings they hear.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (I warn you only by the Inspiration) by that which is revealed of the Qur'an. (But the deaf hear not the call when they are warned) but you cannot make hear he who pretends not to hear Allah's call.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المؤيد بالآيات والمعجزات أيها المقصرون على الصمم الحقيقي والإعراض الفطري الجبلي إذ { لاَ يَسْمَعُ } الرسولُ { ٱلصُّمُّ ٱلدُّعَآءَ } والذكرَ المتضمنَ لأنواع الهداية والرشاد\n ولا يسع له إسماعكم { إِذَا مَا يُنذَرُونَ } [الأنبياء: 45] أي: إلا وقت قابليتكم والتفاتكم إلى الإنذار والتخويف\n وأنتم من شدة صممكم وقسوتكم خارجون عن قابلية الإنذار والإرشاد والوعد والوعيد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nولمَّا بيَّن الحق تعالى غاية هول ما يستعجله المستعجلون، ونهاية سوء حالهم، عند إتيانه، ونعى عليهم جهلهم بذلك، وإعراضهم عند ذكر ربهم، الذي يكلؤهم من طوارق الليل والنهار، أمَرَ نبيه - عليه الصلاة والسلام - بأن يخبرهم أن ما ينذرهم به، مما يستعجلونه، إنما هو بالوحي، لا من عنده\n قلت: مَن قرأ: { يَسمع } بفتح الياء، فالصُّم: فاعل، والدعاء: مفعول، ومن قرأ بضم التاء، رباعي فالصم: مفعول أول، والدعاء: مفعول ثان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:80",
      "similarity": 0.7458901917538792
    },
    {
      "verse": "30:52",
      "similarity": 0.7444156121364744
    },
    {
      "verse": "10:42",
      "similarity": 0.7106203376237678
    },
    {
      "verse": "43:40",
      "similarity": 0.6384795534399078
    },
    {
      "verse": "47:23",
      "similarity": 0.5623760483727678
    }
  ]
}