{
  "chapter": "الأنبياء",
  "text": "ام لهم ءالهة تمنعهم من دوننا لا يستطيعون نصر انفسهم ولا هم منا يصحبون",
  "translations": [
    {
      "translation": "Or do they have gods besides Us who will protect them? They cannot even help themselves! They will not be safe from Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they have lords of their own besides Us who can defend them? But they are not able to help themselves, nor can they find protection against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have any gods who would protect them against Us? They have no power even to help themselves; nor do they enjoy Our support.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can their gods protect them against Us? Their gods have no power even to help themselves, nor are they safe from Our retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have some Gods who protect them from Us? Neither can they save themselves nor save their friends from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they gods who can guard them from Us They have no power to help themselves, nor can they be protected from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, have they gods who can defend them against Us? They shall not be able to assist themselves, nor shall they be defended from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they gods that shall defend them apart from Us? Why, they are not able to help themselves, nor shall they be guarded in safety from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they gods who can shield them from Us? They cannot help themselves nor can they be defended from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have other deities who can defend them against Us? They cannot even help themselves, neither can they be aided against Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they gods who defend them beside Us? They are not able to succour themselves, and against Us they cannot be kept company with.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have gods besides Us to defend them? Neither can they help themselves, nor can they shield [the idolaters] from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they gods that can guard them from Us? They have no power to aid themselves, nor can they be defended from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they aliha (gods) who can guard them from Us? They have no power to help themselves, nor can they be protected from Us (i.e. from Our Torment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they gods to defend them, other than Us? Indeed, they are unable to help themselves, neither shall they be guarded in safety from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they have gods who can defend them against Us? They cannot help themselves, nor will they be protected from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they have gods to defend them other than Us? They are unable [even] to help themselves, nor can they be protected from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:43] Or is it that they have (am, ‘or’, functions with the sense of a hamza used to indicate denial, that is, [read it as] a-lahum, ‘do they have’) gods to defend them, against that which might cause them harm, besides Us? In other words, do they have anyone other than Us to defend them against such [things]? No! They, namely, the gods, cannot help themselves, and so they will not [be able to] help them; nor shall they, the disbelievers, be protected from Us, from Our chastisement (one may say sahibaka’Llāhu, to mean ‘May God preserve and protect you’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمْ لَهُمْ آَلِهَةٌ تَمْنَعُهُمْ مِنْ دُونِنَا لَا يَسْتَطِيعُونَ نَصْرَ أَنْفُسِهِمْ وَلَا هُمْ مِنَّا يُصْحَبُونَ (43) { أم لهم آلهة تمنعهم من دوننا } ، أي بل ألهم آلهة . والاستفهام إنكار وتقريع ، أي ما لهم آلهة مانعة لهم من دوننا . وهذا إبطال لمعتقدهم أنهم اتخذوا الأصنام شفعاء .وجملة { لا يستطيعون نصر أنفسهم } مستأنفة معترضة . وضمير { يستطيعون } عائد إلى آلهة أجري عليهم ضمير العقلاء مجاراة لما يجريه العرب في كلامهم . والمعنى : كيف ينصرونهم وهم لا يستطيعون نصر أنفسهم ، ولا هم مؤيدون من الله بالقبول .ثم أضرب إضراباً ثالثاً انتقل به إلى كشف سبب غرورهم الذي من جهلهم به حسبوا أنفسهم آمنين من أخَذ الله إياهم بالعذاب فجرّأهم ذلك على الاستهزاء بالوعيد ، وهو قوله تعالى : { بل متعنا هؤلاء وآباءهم } ، أي فما هم مستمرون فيه من النعمة إنما هو تمتيع وإمهال كما متعنا آباءهم من قبل ، وكما كان لآبائهم آجال انتهوا إليها كذلك يكون لهؤلاء ، ولكن الآجال تختلف بحسب ما علم الله من الحكمة في مَداها حتى طالت أعمار آبائهم . وهذا تعريض بأن أعمار هؤلاء لا تبلغ أعمار آبائهم ، وأن الله يحل بهم الهلاك لتكذيبهم إلى أمدٍ عَلِمَه .وقد وُجه الخطاب إليهم ابتداء بقوله تعالى : { قل من يكلؤكم } ، ثم أُعرض عنهم من طريق الخطاب إلى طريق الغيبة لأن ما وجه إليهم من إنكار أن يكلأهم أحد من عذاب الله جعلهم أحرياء بالإعراض عنهم كما في قوله تعالى :{ هو الذي يسيركم في البر والبحر حتى إذا كنتم في الفلك وجرين بهم بريح طيبة وفرحوا بها } الآية في سورة \\[ يونس : 22 \\].و { يصحبون } إما مضارع صحبهُ إذا خالطه ولازمه ، والصحبة تقتضي النصر والتأييد ، فيجوز أن يكون الفاعل الذي ناب عنه من أسند إليه الفعلُ المبنيّ للنائب مراداً به الله تعالى ، أي لا يصحبهم الله ، أي لا يؤيدهم؛ فيكون قوله تعالى : { منا } متعلقاً ب { يصحبون } على معنى ( مِن ) الاتصالية ، أي صحبة متصلةً بنا بمعنى صحبة متينة . وهذا نفي لما اعتقده المشركون بقولهم { ما نعبدهم إلا ليقربونا إلى الله زلفى } \\[ الزمر : 3 \\].ويجوز أن يكون الفاعل المحذوف محذوفاً لقصد العموم ، أي لا يصحبهم صاحب ، أي لا يجيرهم جار فإن الجوار يقتضي حِماية الجار فيكون قوله تعالى : { منا } متعلقاً ب { يصحبون } على معنى ( مِن ) التي بمعنى ( على ) كقوله تعالى : { فمن ينصرنا من بأس الله إن جاءنا } \\[ غافر : 29 \\].وإما مضارع أصحبه المهموز بمعنى حفظه ومنعه ، أي من السوء .والإشارة ب { هؤلاء } لحَاضرين في الأذهان وهم كفار قريش .وقد استقريْت أن القرآن إذا ذكرت فيه هذه الإشارة دون وجود مشار إليه في الكلام فهو يعني بها كفارَ قريش .\n\n",
      "translations": [
        {
          "translation": "(Or have they gods) or do they have deities (who can shield them from Us) from Our chastisement? (They cannot help themselves) they, these gods, cannot drive away chastisement from themselves, so how can they drive it away from others? (nor can they be defended from Us) nor are they going to receive immunity from Our chastisement, so how can they give immunity to others?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { لاَ يَسْتَطِيعُونَ } أولئك التماثل الهلكى { نَصْرَ أَنْفُسِهِمْ } لا يقدرون لدفع ما لحقهم ونزلَ عليهم من المكروهات فكيف عن غيره؟ { وَلاَ هُمْ } أي: آلهتهم { مِّنَّا يُصْحَبُونَ } [الأنبياء: 43] ويقربون حتى يشفعوا لهم\n ويدفعوا عذابنا عنهم بواسطة قربتهم وصبحتهم معنا\n وإن خيلوا أن إمهالنا إياهم وآباءهم متنعمين مترفهين طول أعمارهم أمارة عدم أخذنا إياهم وانتقامنا منهم\n إنما هو خيال باطل\n ووهم زائغ زائل مما سولت لهم أنفسهم بتغرير إبليس عليهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { لا يستطيعون نصر أنفسهم ولا هم منّا يُصْحَبُون } أي: يُجَارون\n والصاحب: المُجِير الوافي\n يعني: أن الأصنام لا تُجير نفسها\n ولا نُجيرهم نحن\n أو لا يصحبُهم نصر من جهتنا\n فهم لا يستطيعون أن ينصروا أنفسهم\n ولا يُصحبون بالنصر والتأييد من جهتنا\n فكيف يتوهم أن ينصروا غيرهم؟ { بل متّعنا هؤلاء وآباءهم حتى طال عليهم العُمُرُ } \n إضراب عما توهموه من منع آلهتهم وحفظها لهم\n أي: ما هم فيه من الحفظ والكلاءة إنما هو منا\n لا من مانع يمنعهم من إهلاكنا\n وما كلأناهم وآباءهم الماضين إلا تمتيعًا لهم بالحياة الدنيا وإمهالاً\n كما متعنا غيرهم من الكفار وأمهلناهم حتى طال عليهم الأمد فقست قلوبهم\n وظنوا أنهم دائمون على ذلك\n وهو أمل كاذب\n\n{ أفلا يَرَوْن أنَّا نأتي الأرضَ ننقُصُها من أطرافها } أي: ألا ينظرون فيرون أنَّا نأتي أرض الكفرة فننقصها من أطرافها بإدخالها في أيدي المسلمين\n فكيف يتوهمون أنهم ناجون من بأسنا\n وهو تمثيل وتصوير لما يخربه الله من ديارهم على أيدي المسلمين\n ويضيفها إلى دار الإسلام\n وفي التعبير بنأتي: إشارة إلى أن الله تعالى يجريه على أيدي المسلمين\n وأن عساكرهم كانت تأتيهم لغزوهم غالبة عليهم\n ناقصة من أطراف أرضهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:21",
      "similarity": 0.6154822179148667
    },
    {
      "verse": "56:33",
      "similarity": 0.6148656622347509
    },
    {
      "verse": "68:12",
      "similarity": 0.572587061157048
    },
    {
      "verse": "50:25",
      "similarity": 0.5596935005764296
    },
    {
      "verse": "17:94",
      "similarity": 0.5543159176187429
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}