{
  "chapter": "الأنبياء",
  "text": "ولئن مستهم نفحة من عذاب ربك ليقولن يويلنا انا كنا ظلمين",
  "translations": [
    {
      "translation": "If even a single waft of the punishment were to touch them, they would say, 'Alas for us! We were indeed wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if a whiff of the Lord's chastisement were to touch them they would surely say: \"Ah woe, alas, we were surely sinful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were only the slightest whiff from your Lord's punishment to touch them, they would cry out: \"Woe to us; we were indeed wrong-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a blast of the torment of your Lord strikes them, they will say, \"Woe to us! We have been unjust people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a whiff of your Lord’s punishment were to touch them, they would certainly say, “Woe to us – we were indeed unjust!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a breath of the torment of your Lord touches them, they will surely cry: \"Woe unto us! Indeed we have been wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a blast of the chastisement of your Lord were to touch them, they will certainly say: O woe to us! surely we were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If but a breath of thy Lord's chastisement touched them, they would surely say, 'Alas for us! We were evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a breath of thy Lord's punishment were to touch them, they assuredly would say: Alas for us! Lo! we were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "yet if even a breath of your Lord's punishment touched them, they would say, \"Woe to us! We were indeed wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a breath of the torment of thy Lord were to touch them, they will say: woe unto us! we have been wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should a whiff of your Lord’s punishment touch them, they will surely say, ‘Woe to us! We have indeed been wrongdoers!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If but a breath of the Wrath of thy Lord do touch them, they will then say, \"Woe to us! we did wrong indeed!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a breath (minor calamity) of the Torment of your Lord touches them, they will surely cry: \"Woe unto us! Indeed we have been Zalimun (polytheists and wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if just a breath of your Lord's punishment were to touch them, they would say: 'Woe for us, we were harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a breath of your Lord’s punishment touches them, they say, “Woe to us, we were truly wicked.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if [as much as] a whiff of the punishment of your Lord should touch them, they would surely say, \"O woe to us! Indeed, we have been wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:46] And if a whiff, a slight instance, of your Lord’s chastisement were to touch them, they would indeed say, ‘O (yā, used for drawing attention [to something]) woe for us!, [O this is] our destruction! Truly we were doing evil’, in ascribing partners to God and denying [the Mission of] Muhammad (s).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if a breath of thy Lord's punishment were to touch them, they assuredly would say: Alas for us! Lo! we were wrong-doers) against ourselves, and we were disbelievers in Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اللهِ يا أكمل الرسل { لَئِن مَّسَّتْهُمْ } وظهرت عليهم { نَفْحَةٌ } واحدة مني ورائحة قليلة { مِّنْ عَذَابِ رَبِّكَ } نازلة على سبيل المقدمة والأنموذج { لَيَقُولُنَّ } مصرخين صائحين متضرعين معترفين بذنوبهم قائلين: { يٰويْلَنَآ } وهلاكنا تعالى { إِنَّا كُنَّا ظَالِمِينَ } [الأنبياء: 46] خارجين عن حدود الله مستوجبين للمقت والهلاك، أدركنا فقد حان حينك وقرب أوانك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}