{
  "chapter": "الأنبياء",
  "text": "ولقد استهزئ برسل من قبلك فحاق بالذين سخروا۟ منهم ما كانوا۟ به يستهزءون",
  "translations": [
    {
      "translation": "Messengers before you were also mocked, but those who jeered were engulfed by what they mocked.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many apostles have been scoffed before you; but they who scoffed were themselves caught by what they had ridiculed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other Messengers before you were also mocked, but those who scoffed at the Messengers were overtaken by the same scourge that they had scoffed at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They mocked the Messengers who were sent before you; thus, the torment which they had ridiculed encompassed them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed the Noble Messengers before you were mocked at, but their mockery ruined the mockers themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed (many) Messengers were mocked before you, but the scoffers were surrounded by what they used to mock.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly apostles before you were scoffed at, then there befell those of them who scoffed that at which they had scoffed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers indeed were mocked at before thee, but those that scoffed at them were encompassed by that they mocked at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers before thee, indeed, were mocked, but that whereat they mocked surrounded those who scoffed at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other messengers have been mocked before you, but those who scoffed were overwhelmed by the very thing they had mocked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly mocked were the apostles before thee, then there surrounded those of them Who scoffed that whereat they had been mocking!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Apostles were certainly derided before you; but those who ridiculed them were besieged by what they had been deriding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mocked were (many) messenger before thee; But their scoffers were hemmed in by the thing that they mocked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed (many) Messengers were mocked before you (O Muhammad SAW), but the scoffers were surrounded by that, whereat they used to mock.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before you, other Messengers were mocked, but the mockers were encompassed by the very thing they mocked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers before you were also ridiculed, but those who jeered were surrounded by what they had ridiculed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And already were messengers ridiculed before you, but those who mocked them were enveloped by what they used to ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:41] And verily messengers before you were derided — herein is a statement to comfort the Prophet (s) — but those who mocked them were encircled by, it was sent down [against them], that which they used to deride, namely, chastisement — likewise it shall befall those who have derided you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "354 (Messengers before thee, indeed, were mocked) the messengers who came before you, Muhammad, were mocked by their people just as your people are mocking you, (but that whereat they mocked) the chastisement they mocked; it is also said that this means: they were chastised because of their mockery, (surrounded) was decreed and came down upon (those who scoffed at them) those who mocked the prophets.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لا تبال بهم يا أكمل الرسل، ولا تحزن عن استهزائهم وسخريتهم؛ إذ { لَقَدِ ٱسْتُهْزِىءَ بِرُسُلٍ } كثيرٍ مضوا { مِّن قَبْلِكَ } استهزءوا معهم أممهم مثل ما استهزءوا معك قريش { فَحَاقَ } وأحاط بالآخرة { بِٱلَّذِينَ } أي: بالمستهزئين الذين { سَخِرُواْ مِنْهُمْ } أي: من الرسل وبآل { مَّا كَانُواْ بِهِ يَسْتَهْزِئُونَ } [الأنبياء: 41] ويستسخرون، وبأضعاف ما لحق لهم المعاندين المكابرين فلا تحزن عليه ولا تك في ضيق مما يستهزئون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم سلّى رسوله عن استهزائهم، فقال: { ولقد استُهزئ برسل من قبلك فحاقَ }: نزل أو أحاط أو حلّ { بالذين سخروا منهم } أي: من أولئك الرّسل - عليهم السلام - جزاء { ما كانوا به يستهزئون } ، وهو العذاب الدائم\n نسأل الله العافية\n الإشارة: كل من خرق عوائد نفسه، وخرج عن عوائد الناس، أو أمر بالخروج عن العوائد، رفضه الناس واتخذوه هُزوًا، سنة الله التي قد خلت من قبل، لم يأت أحد بذلك إلا عُودي، فإن ظهر عليه أثر الخصوصية من علم لدني، أو هداية خلق على يده، استعجلوه بإظهار الكرامة، كما هو شأن الإنسان، خُلق من عَجَل، فيقول: سأوريكم آياتي، فإن الأمر إذا كان مؤسسًا على الحق لا بد أن تظهر أنواره وأسراره، فلو يعلم الذين كفروا بطريق الخصوص، حين ترهقهم الحسرة، وتُحيط بهم الندامة، إذا رأوا أهل الصفاء يسرحَون في أعلى عليين حيث شاؤوا، وجوههم كالشموس الضاحية، لبادروا إلى الانقياد لهم، وتقبيل التراب تحت أقدامهم، ولكنهم اليوم في غفلة ساهون\n\n\nويقال لمن أنكر عليه أهلُ زمانه طريقَ التجريد وخرقَ العوائد: ولقد استُهزئ بمن كان قبلك ممن سلك هذه الطريق، فأُوذوا، وضُربوا، وأُخرجوا من بلادهم، فحاق بالذين سخروا منهم ما كانوا به يستهزئون، إما في الدنيا أو في الآخرة\n فإذا أنزل بأسه فلا حافظ منه إلاَّ الرحمن\n",
      "translations": []
    }
  ]
}