{
  "chapter": "الأنبياء",
  "text": "قالوا۟ من فعل هذا بـالهتنا انه لمن الظلمين",
  "translations": [
    {
      "translation": "They said, 'Who has done this to our gods? He is definitely one of the wrongdoers!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They asked (on return): \"Who has done this to our gods? He is surely a mischief-monger.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(When they saw the idols in this state) they said: \"Who has done this to our gods? Surely he is one of the wrong-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(When the people came to the temple and saw the broken idols) they asked each other, \"Who has done this to our gods? He certainly is an unjust person\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Who has done this to our Gods? He is indeed cruel!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Who has done this to our gods He must indeed be one of the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Who has done this to our gods? Most surely he is one of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Who has. done this with our gods? Surely he is one of the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Who hath done this to our gods? Surely it must be some evil-doer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has done this to our deities? He must be a wrongdoer.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: who hath wrought this to our gods? verily he is of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Whoever has done this to Our gods?! He is indeed a wrongdoer!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Who has done this to our gods? He must indeed be some man of impiety!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Who has done this to our aliha (gods)? He must indeed be one of the wrong-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has done this to our gods' they exclaimed. 'He must surely be a harmdoer'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Who did this to our gods? He is certainly one of the wrongdoers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Who has done this to our gods? Indeed, he is of the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:59] They said, upon returning and seeing what had been done, ‘Who has done this to our gods? Truly he is an evildoer’, in this regard.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "They entered the house of their idols. (They said: Who hath done this to our gods? Surely it must be some evil-doer) he committed an evil deed against our deities. 356\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قالوا } أي: قالت النفوس العاشقة بالعقول { من فعل هذا } الاستخفاف والتحقير { بآلهتنا } التي هي معشوقاتنا ومعبوداتنا بنسبتها إلى الاحتجاب والنظر إليها بعين الفناء وجعلها بقوّة الظهر كالهباء، متعجبين منه، معظمين له، مستعظمين لأمره { إنه لمن الظالمين } الناقصين حقوق المعبودات المجرّدة وجميع الموجودات من الوجودات والكمالات بنفيها عنهم وإثباتها للحق، أو الناقصين حق نفسهم بإفنائها وقهرها { قالوا سمعنا فتى } كاملاً في الفتوّة والشجاعة على قهر ما سوى الله من الأغيار والسخاوة ببذل النفس والمال { يذكرهم } بنفي القدرة والكمال عنهم ونسبة العدم والفناء إليهم { فأتوا به } أي: استحضروه وأحضروه معايناً لجميع النفوس { لعلهم يشهدون } كماله وفضيلته فيستفيدون منه\n { أأنت فعلت هذا } صورة إنكار لما لم يعرفوا من كماله إذ كل ما يمكن للنفوس معرفته فهو دون كمال العقول التي هي معشوقاتها وهي محجوبة عن كماله الإلهي الذي هو به أشرف منها { قال بل فعله كبيرهم } أي: ما فعلته بأنائيتي التي أنا بها أحسن منها، بل بحقيقتي وهويتي التي هي أشرف وأكبر منها { فاسألوهم إن كانوا ينطقون } بالاستقلال، أي: لا نطق لهم ولا علم ولا وجود بأنفسهم بل بالله الذي لا إله إلا هو\n { فرجعوا إلى أنفسهم } بالإقرار والإذعان معترفين بأن الممكن لا وجود له بنفسه فكيف كماله { فقالوا إنكم أنتم الظالمون } بنسبة الوجود والكمال إلى الغير لا هو { ثم نكسوا على رؤوسهم } حياء من كماله ونقصهم وخضوعاً وانفعالاً منه { لقد علمت } بالعلم اللدني الحقاني فناءهم فنفيت النطق عنهم، وأما نحن فلا نعلم إلا ما علمنا الله فاعترفوا بنقصهم كما اعترفوا به عند معرفتهم لآدم بعد الإنكار، فقالوا:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما رجعوا من معبدهم ودخلو إلى معابدهم وكنائسهم للعبادة والتقرب نحو الآلهة، وجدوها مجذوذة منكسرة متفرقة الأجزاء { قَالُواْ } من فرط حزنهم وأسفهم مستبعدين مستحسرين: { مَن فَعَلَ هَـٰذَا } الفعل الفظيع والأمر الفجيع { بِآلِهَتِنَآ } ومعبوداتنا { إِنَّهُ لَمِنَ ٱلظَّالِمِينَ } [الأنبياء: 59] الخارجين عن شعائر ديننا الجاحدين لآلهتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مَن فَعَلَ }: استفهام، وقيل: موصولة، و { إنه }: خبرها، أي: الذي فعل هذا معدود من الظلمة، و { يذْكُرهم }: إما مفعول ثان لسمع لتعلقه بالذات، على قول، أو صفة لفتى",
      "translations": []
    }
  ]
}