{
  "chapter": "الأنبياء",
  "text": "بل قالوا۟ اضغث احلمۭ بل افترىه بل هو شاعر فلياتنا بـاية كما ارسل الاولون",
  "translations": [
    {
      "translation": "Furthermore they say, 'A muddled jumble of dreams!' and, 'He has invented it!' and, 'He is a poet!' and, 'Let him bring us a Sign like those sent to previous peoples.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they say: \"These are only confused dreams,\" or rather: \"He has invented them;\" or: \"He is only a poet. Let him therefore bring a miracle to us as the earlier (apostles) were sent with.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Nay, these are confused dreams; nay, he has forged it; nay, he is a poet. So let him bring us a sign, even as the Messengers of the past were sent with signs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said, \"It, (the Quran), is only the result of some confused dreams. He is only a poet. He should show us some miracles, as the ancient Prophets had done.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather they said, “These are confused dreams, but in fact he has fabricated it – but in fact he is a poet; so he must bring us some sign, like those who were sent before.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they say: \"These are mixed up false dreams! Nay, he has invented it! -- Nay, he is a poet! Let him then bring us an Ayah like the ones that were sent before!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! say they: Medleys of dreams; nay! he has forged it; nay! he is a poet; so let him bring to us a sign as the former (prophets) were sent (with).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they say: 'A hotchpotch of nightmares! Nay, he has forged it; nay, he is a poet! Now therefore let him bring us a sign, even as the ancient ones were sent as Messengers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, say they, (these are but) muddled dreams; nay, he hath but invented it; nay, he is but a poet. Let him bring us a portent even as those of old (who were Allah's messengers) were sent (with portents).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some say, \"These are his confused dreams.\" Others say, \"He has invented it himself,\" and yet others say, \"He is a poet. Let him bring us a sign as previous messengers did.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! they say: a medley of dreams; aye! he hath fabricated it; aye! he is a poet; so let him bring us a sign even as the ancients were sent with.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they said, ‘[They are] muddled dreams!’ ‘Indeed, he has fabricated it!’ ‘Indeed, he is a poet!’ ‘Let him bring us a sign, like those sent to the former generations.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay,\" they say, \"(these are) medleys of dream! - Nay, He forged it! - Nay, He is (but) a poet! Let him then bring us a Sign like the ones that were sent to (Prophets) of old!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they say:\"These (revelations of the Quran which are inspired to Muhammad SAW) are mixed up false dreams! Nay, he has invented it! Nay, he is a poet! Let him then bring us an Ayah (sign as a proof) like the ones (Prophets) that were sent before (with signs)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some say: 'No, it is only mixed dreams' 'No, he has forged it himself', or, 'no, he is a poet! Let him bring us a sign, just as the ancient ones were sent asMessengers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “A jumble of dreams,” and, “He made it up,” and, “He is a poet,” “let him bring us a sign, like those sent to the ancients.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they say, \"[The revelation is but] a mixture of false dreams; rather, he has invented it; rather, he is a poet. So let him bring us a sign just as the previous [messengers] were sent [with miracles].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:5] Nay (bal, in the three instances [below] effects a transition from one subject to another) but they say, regarding those parts of the Qur’ān he [the Prophet] has brought [to them] are: ‘A muddle of nightmares, a confusion [of things] he has seen in [his] sleep. Nay, he has fabricated it, he has invented it; nay, he is a poet, and what he has brought is [merely] poetry! So let him bring us a sign, such as was sent to the ancients’, like the she-camel [Sālih], the staff and the [glowing] hand [of Moses]. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nبَلْ قَالُوا أَضْغَاثُ أَحْلَامٍ بَلِ افْتَرَاهُ بَلْ هُوَ شَاعِرٌ فَلْيَأْتِنَا بِآَيَةٍ كَمَا أُرْسِلَ الْأَوَّلُونَ (5){ بل } الأولى من كلام الله تعالى إضراب انتقال من حكاية قول فريق منهم { أفتأتون السحر وأنتم تبصرون } \\[ الأنبياء : 3 \\] إلى حكاية قول آخر من أقوال المشركين ، وهو زعمهم أنّ ما يخبر عنه ويحكيه هو أحلام يراها فيحكيها ، فضمير { قالوا } لجماعة المشركين لا لخصوص القائلين الأولين .و { بل } الثانية يجوز أن تكون من الكلام المحكي عنهم وهي إضراب انتقال فيما يصفون به القرآن . والمعنى : بل افتراه واختلقه من غير أحلام ، أي هو كلام مكذوب .ثم انتقلوا فقالوا { هو شاعر } أي كلامه شعر ، فحرف ( بل ) الثالثة إضراب منهم عن كلامهم وذلك مؤذن باضطرابهم وهذا الاضطراب ناشىء عن ترددهم مما ينتحلونه من الاعتلال عن القرآن . وذلك شأن المبطل المباهت أن يتردد في حجته كما قيل : الباطل لَجْلَج ، أي ملتبس متردّد فيه .ويجوز أن تكون ( بل ) الثانية والثالثة مثل ( بل ) الأولى للانتقال في حكاية أقوالهم . والتقدير : بل قالوا افتراه بل قالوا هو شاعر ، وحذف فعل القول لدلالة القول الأول عليهما ، وعلى هذا الوجه يجوز أن يكون المحكي كلام جماعات من المشركين انتحلت كل جماعة اعتلالاً .والأضغاث : جمع ضغث بكسر الضاد ، وهو الحزمة من أعواد أو عُشب أو حشيش مختلط ثم أطلق على الأخلاط مطلقاً كما في سورة يوسف ( 44 ) { قالوا أضغاث أحلام } أرادوا أن ما يخبركم به من أنه أوحي إليه ومن أخبار البعث والحساب ويوم القيامة هو أحلام يراها .وفرعوا على ترددهم أو فرع كل فريق على مقالته نتيجة واحدة وهي المطالبة أن يأتيهم بمعجزة تدل على صدقه غير هذا القرآن من نوع ما يحكى عن الرسل السابقين أنهم أتوا به مثل انقلاب العصا حية .ومن البهتان أن يسألوا الإتيان بآية يكون الادعاءُ بأنها سَحْر أروجَ في مثلها فإن من أشهر أعمال السحرة إظهار ما يبدو أنه خارق عادة . وقديماً قال آل فرعون في معجزات موسى : إنها سحر ، بخلاف آية إعجاز القرآن .ودخلت لام الأمر على فعل الغايب لمعنى إبلاغ الأمر إليه ، أي فقولوا له : ائتنا بآية ، والتشبيه في قوله { كما أرسل الأولون } في موضع الحال من ضمير { يأتنا } أي حالة كون هذا البشر حين يأتي بالآية يشبه رسالته رسالة الأولين ، والمشبه ذات والمشبه به معنى الرسالة وذلك واسع في كلام العرب . قال النابغة :وقد خِفت حتى ما تزيد مخافتي ... على وَعِل من ذي المطارة عاقلأي على مخافة وَعِل أو حالة كون الآية كما أرسل الأولون ، أي به .\n\n",
      "translations": [
        {
          "translation": "(Nay, say they) some of them say, ((these are but) muddled dreams) false dreams, that which Muhammad (pbuh) brought to us is but false dreams; (nay, he hath but invented it) some others say: Muhammad (pbuh) invented the Qur'an; (nay, he is but a poet) some of them said: no, he is a poet. (Let him bring us a 350 portent) a sign (even as those of old (who were God's messengers) were sent (with portents)) just as the messengers of old were sent with signs to their people, as he claims.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { بَلْ قَالُوۤاْ }  ما هو إلا { أَضْغَاثُ أَحْلاَمٍ } أي: من تخليطات القوة المتخيلة وتمويهاتها التي رآها في المنام\n ثم سطَّرها\n وسَمَّاه كلاماً نازلاً من السماء موحى إليه من عند الله { بَلِ ٱفْتَرَاهُ } واختلقه واخترعه من تلقاء نفسه\n ونَسَبه إلى الوحي ترويجاً له بلا رؤيته في المنام { بَلْ هُوَ شَاعِرٌ } فصيحُ تكلم بكلام كاذبٍ مُخيَّلٍ نظمه على وجهٍ يعدب الأسماع\n وبالجملة ما هو نبيُ ولا كلامه الذي أتى به وحيُ نازلُ من الله كما ادعاه مثل كلام سائر الرسل\n وإلا { فَلْيَأْتِنَا بِآيَةٍ } مقترحةٍ أو غيرها تُلجئنا إلى تصديقه والإيمان به { كَمَآ أُرْسِلَ ٱلأَوَّلُونَ } [الأنبياء: 5] أي: مثلما أُرسل بها الأنبياء الماضون: كالعصا\n واليد\n البيضاء وإبراء الأكمه والأبرص\n وإحياء الموتى\n وغير ذلك من الآيات الواقعة من الرسل الما ضين\n\nثم لما تقاولوا بما تقاولوا\n واهتم رسول الله صلى الله عليه وسلم أيضاً أن ينزل عليه مثلما أنزل على أولئك الرسل نزلت: { مَآ آمَنَتْ قَبْلَهُمْ } رسلنا الذين جاءوا بالآيات المقترحة { مِّن قَرْيَةٍ } أي: أهلها من القرى التي أرسلوا إليهم لذلك { أَهْلَكْنَاهَآ } واستأصلناها\n ولو تأتي أنت أيضاً بمقترحاتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { بل قالوا أضغاثُ أحلام } \n هو إضراب من جهته تعالى\n وانتقال من حكاية قولهم السابق إلى حكاية قول آخر مضطرب في مضارب البطلان\n أي: لم يقتصروا على أن يقولوا في حقه - عليه الصلاة والسلام -: هل هذا إلا بشر\n وفي حق ما ظهر على يديه من القرآن الكريم: إنه السحر\n بل قالوا: هو تخاليط أحلام وأباطيلها\n فهو أشبه شيء بالهذيان\n ثم أضربوا عنه\n وقالوا: { بل افتراه } من تلقاء نفسه\n من غير أن يكون له أصل أو شبهة أصل\n ثم قالوا: { بل هو شاعر } \n وما أتى به شعر يُخيل إلى السامع\n لا حقيقة لها\n وهكذا شأن المبطل المحجوج\n متحير\n لا يزال يتردد بين باطل وأبطل\n ويتذبذب بين فاسد وأفسد\n فالإضراب الأول\n كما ترى\n من جهته تعالى\n والثاني والثالث من قِبلهم\n وقد قيل: الكل من قِبلهم\n حيث أضربوا عن قولهم: هو سحر\n إلى أنه تخاليط أحلام\n ثم إلى أنه كلام مفترى\n ثم إلى أنه قول شاعر\n وهو بعيد لأنه لو كان كذلك لقال: قالوا: بل أضغاث أحلام\n\n\n الخ\n ثم قالوا: { فلْيأتِنا بآيةٍ } وهو جواب عن شرط محذوف\n يُفصح عنه السياق\n كأنه قيل: وإن لم يكن كما قلنا\n بل كان رسولاً من الله تعالى\n فليأتنا بمعجزة ظاهرة { كما أُرسل الأولون } أي: مثل الآية التي أُرسل بها الأولون كاليد\n والعصا\n و الناقة وشبه ذلك\n\nفالكاف: صفة لمصدر محذوف\n أي: إتيانًا مثل إتيان الأولين\n قال تعالى: { ما آمنت قبلَهم من قرية أهلكناها } أي: أهلكنا أهلها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:44",
      "similarity": 0.9248120922708003
    },
    {
      "verse": "38:44",
      "similarity": 0.4728091568606706
    },
    {
      "verse": "22:59",
      "similarity": 0.1868317851056098
    },
    {
      "verse": "52:32",
      "similarity": 0.18378863210901245
    },
    {
      "verse": "37:101",
      "similarity": 0.1721119907582988
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}