{
  "chapter": "الأنبياء",
  "text": "فجعلهم جذذا الا كبيرا لهم لعلهم اليه يرجعون",
  "translations": [
    {
      "translation": "He broke them in pieces, except for the biggest one, so that they would have it to consult!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he smashed them up to pieces with the exception of the biggest, so that they may turn to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he broke them all into pieces, sparing only the supreme one among them that they may possibly return to him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He broke all the idols into pieces, except the biggest among them so that perhaps people would refer to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He shattered them all, except the biggest among them, that perhaps they may question it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he broke them to pieces, except the biggest of them, that they might turn to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he broke them into pieces, except the chief of them, that haply they may return to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he broke them into fragments, all but a great one they had, for haply they would return to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he reduced them to fragments, all save the chief of them, that haply they might have recourse to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He broke them all into pieces, except for the biggest one of them, so that they might return to it [for enquiry].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he made them fragments, all except the big one of them, that haply unto it they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he broke them into pieces—all except the biggest of them—so that they might come back to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he broke them to pieces, (all) but the biggest of them, that they might turn (and address themselves) to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he broke them to pieces, (all) except the biggest of them, that they might turn to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He broke them all into pieces, except their great one so that they might return to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he reduced them into pieces, except for their biggest, that they may return to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he made them into fragments, except a large one among them, that they might return to it [and question].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:58] And so, after they had set off to a gathering of theirs on one of their festival days, he reduced them to fragments (read judhādhan or jidhādhan, meaning ‘pieces’), [smashing them] with a hatchet, [all] except the principal one among them, around whose neck he hung the hatchet, that they might return to it, that is, to the principal one, and see what he had done to the others.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When they went to their festival and they left Abraham behind in their township, he went to the house of their idols. (Then he reduced them to fragments) he destroyed them, (all save the chief of them) he left it intact, (that haply they might have recourse to it) after coming back from their festival and he could say that it was it that did it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَجَعَلَهُمْ جُذَاذاً } معناه قِطعٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فجعلهم } بفأس القهر الذاتي والشهود العيني { جذاذاً } قطعاً متلاشية فانية { إلا كبيراً لهم } هو عينه الباقي على اليقين الأول الذي به سمى الخليل خليلاً { لعلهم إليه يرجعون } يقبلون منه الفيض ويستفيضون منه النور والعلم كما استفاض هو منه أولاً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما ذهبوا إلى معبدهم دخل إبراهيم كنيستهم ومعبدهم التي فيها أصنامهم وأوثانهم { فَجَعَلَهُمْ } كلها { جُذَاذاً } قطعاً منكسرة وأجزاء متلاشية { إِلاَّ كَبِيراً لَّهُمْ } يعني: لم يكسر الصنم الكبير من الأصنام فقط؛ ليكون سبباً لإلزامهم، وإفحامهم لدى الحاجة { لَعَلَّهُمْ إِلَيْهِ } أي: إلى الصنم الكبير { يَرْجِعُونَ } [الأنبياء: 58] أي: يراجعون له ويستفسرون منه عن كسر الأصنام؛ لأنهم اعقدوه أعظم الآلهة، والإله لا بدَّ أن يجيب لهم جميع حوائجهم وحاجاتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:108",
      "similarity": 0.5634900770221841
    },
    {
      "verse": "43:48",
      "similarity": 0.08852508809876398
    },
    {
      "verse": "32:21",
      "similarity": 0.08230587555952026
    },
    {
      "verse": "43:28",
      "similarity": 0.06638839997892251
    },
    {
      "verse": "7:174",
      "similarity": 0.06205434962878274
    }
  ]
}