{
  "chapter": "الأنبياء",
  "text": "اذ قال لابيه وقومه ما هذه التماثيل التى انتم لها عكفون",
  "translations": [
    {
      "translation": "When he said to his father and his people, 'What are these statues you are clinging to?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father and his people: \"What are these idols to which you cling so passionately?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall, when he said to his father and his people: \"What are these images to which you are devoutly clinging?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham asked his father and his people, \"What are these statues which you worship?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father and his people, “What are these idols before whom you squat (worshipping)?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father and his people: \"What are these images to which you are devoted\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father and his people: What are these images to whose worship you cleave?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when he said to his father and his people, 'What are these statues unto which you are cleaving?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said unto his father and his folk: What are these images unto which ye pay devotion?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he asked his father and his people, \"What are these images to which you are so devoted?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time he said unto his father and his people what are these images to which ye are cleaving?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when he said to his father and his people, ‘What are these images to which you keep on clinging?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! he said to his father and his people, \"What are these images, to which ye are (so assiduously) devoted?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father and his people: \"What are these images, to which you are devoted?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said to his father and to his nation: 'What, are these the statues to which you cling'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father and his people, “What are these statues to which you are devoted?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he said to his father and his people, \"What are these statues to which you are devoted?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:52] when he said to his father and his people, ‘What are these images, [these] idols, to which you [constantly] cleave?’, that is, which you are constantly worshipping.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When he said unto his father) Azar (and his folk) Nimrod son of Canaan and his host: (What are these images unto which ye pay devotion) which you worship?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إذ قال لأبيه } النفس الكلية { وقومه } من النفوس الناطقة السماوية وغيرها { ما هذه التماثيل } أي: الصور المعقولة من حقائق العقول والأشياء وماهيات الموجودات المنتقشة فيها { التي أنتم لها عاكفون } مقيمون على تمثلها وتصوّرها وذلك عند عروجه من مقام الروح المقدّسة وبروزه عن الحجب النورية إلى فضاء التوحيد الذاتي، كما قال عليه السلام:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل: { إِذْ قَالَ } جدك إبراهيم { لأَبِيهِ وَقَوْمِهِ } حين جذبه الحق نحو جنابه وهداه إلى بابه، مستفهماً على سبيل الإنكار والتقريع: { مَا هَـٰذِهِ ٱلتَّمَاثِيلُ } الباطلة والهياكل الزائغة الزائلة { ٱلَّتِيۤ أَنتُمْ } مع كونكم من زمرة العقلاء المجبولين لمصلحة التوحيد والعرفان { لَهَا عَاكِفُونَ } [الأنبياء: 52] عابدون متذللون، مع أنها جمادات لا شعور لها ولا حركة، فكيف المعرفة واليقين وعبادة الفاضل للمفضول المرذول في غاية السقوط عند ذوي النهي وأولي الألباب؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذ قال }: ظرف لآتينا، أو لرُشْدَه\n يقول الحقّ جلّ جلاله: { ولقد آتينا إِبراهيم رُشدَه } أي: الرشد اللائق به وبأمثاله من كُبراء الرسل، وهو الاهتداء الكامل، المستند إلى الهداية الخاصة الحاصلة بالوحي، مع الاقتدار على إصلاح الأمة وإرشادها بسياسة النبوة والوحي الإلهي، { من قبلُ } أي: من قبل إيتاء موسى وهارون التوراة، وتقديم ذكرهما، لما بين التوراة والقرآن من الشبه التام\n وقيل: من قبل إنزال القرآن، أو من قبل استنبائه، أو من قبل بلوغه، { وكُنا به عَالمين } أي: بأنه أهل لما آتيناه، أو عالمين برُشده، وما خصصناه به من الهداية الخاصة\n { إذ قال لأبيه وقومه } أي: آتيناه ذلك حين قال لأبيه، أو اذكر وقت قوله لهم: { ما هذه التماثيلُ } أي: الأصنام المصورة على صورة السباع والطيور والإنسان، وفيه تجاهل بهم تحقيرًا لها، مع علمه بتعظيمهم لها توبيخًا لهم على إجلالها مع كونها خشبًا وأحجارًا لا تضر ولا تنفع، { التي أنتم لها عاكفون } أي: لأجل عبادتها مقيمون، فلما عجزوا عن الدليل { قالوا وجدنا آباءنا لها عابدين } فقلدناهم، فأبطله عليه السلام، على طريقة التوكيد بالقسم، فقال: { لقد كنتم أنتم وآباؤكم } الذين سنُّوا لكم هذه السُّنَّة الباطلة، { في ضلال مبين }: ظاهر بيِّن، بحيث لا يخفى على أحد من العقلاء، أي: والله لقد كنتم مستقرين في ضلال عظيم ظاهر لعدم استناده إلى دليل، فالتقليد إنما يجوز فيما يحتمل الحَقِّية في الجملة، لا فيما اتضح بطلانه، سيما في أمر التوحيد\n { قالوا أجئتنا بالحق } أي: بالجد، { أم أنت من اللاعبين } ، فتقول ما تقول على الملاعبة والمزاح\n والمعنى: أجادٌ أنتَ، أم لاعب فيما تقول؟ قالوا ذلك استعظامًا منهم لإنكاره، واستبعادًا لكون ما هم عليه ضلال، وتعجيبًا من تضليله إياهم\n ثم أضرب عنهم مخبرًا بأنه جاد فيما قال، غير لاعب، بإقامة البرهان على بطلان ما ادعوه فقال: { بل ربُّكم ربُّ السماواتِ والأرض الذي فطرهنَّ } ، لا التماثيل التي صورتم\n وقيل: هو إضراب عما بنوا عليه مقالتهم من اعتقاد كونها أربابًا لهم، كما يُفصح عنه قولهم:\n\n[الشُّعَرَاء: 71]، كأنه قال: ليس الأمر كذلك، بل ربكم رب السماوات والأرض الذي خلقهن وأنشأهن، فالضمير للسماوات والأرض، وصفَه تعالى بإيجادهن، إثر وصفه تعالى بربوبيته لهن تحقيقًا للحق، وتنبيهًا على أن ما لا يكون كذلك بمعزل من الربوبية، أي: أنشأهن بما فيهن من المخلوقات، التي من جملتها أنتم وآباؤكم وما تعبدونه، من غير مثالٍ يحتَذِيه، ولا قانون ينتحيه\n وقيل: الضمير للتماثيل، وهو أدخل في تضليلهم، وأظهر في إلزام الحجة عليهم لِمَا فيه من التصريح المُغني عن التأمل في كون ما يعبدونه من المخلوقات، والأول أقرب\n\n\nثم قال عليه السلام: { وأنا على ذلكم } الذي ذكرتُ: من كون ربكم رَبَّ السماوات والأرض، دون ما عداه، كائنًا ما كان، { من الشاهدين } أي: العالمين به على سبيل الحقيقة، المبرهنين عليه، فإن الشاهد على الشيء: مَنْ تحققه وبرهن عليه، كأنه قال: وأنا أعلم ذلك، وأتحققه، وأُبرهن عليه، والله تعالى أعلم\n الإشارة: زخارف الدنيا وبهجتها، من تشييد بناء، وتزويق سقف وحيطان، وإنشاء غروس وبساتين، وجمع أموال، وتربية جاه، كلها تماثيل لا حقيقة لها، فانية لا دوام لها\n فمن عكف عليها، وأولع بخدمتها وجمعها وتحصيلها، كان عابدًا لها، فينبغي لذي الرشد والعقل الوافر، الذي تحرر منها، أن يُنكر عليهم، ويقول لهم: ما هذه التماثيل التي أنتم لها عاكفون، فإن قالوا: وجدنا أباءنا يفعلون هذا، وعلماءنا مثلنا، فليقل لهم: لقد كنتم وآباؤكم وعلماؤكم في ضلال مبين، عما كان عليه الأنبياء والأولياء والسلف الصالح\n فإن قالوا: أجادٌّ أنت أم لا؟ فليقل: بل ربكم الذي ينبغي أن يُفرد بالمحبة والخدمة، وهو رب السماوات والأرض، لا ما أنتم عليه من محبة الدنيا وبهجتها، وأنا على ذلكم من الشاهدين\n ثمَّ ذكر كسره الاصنام وما ترتب عليه\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:71",
      "similarity": 0.4601372674112425
    },
    {
      "verse": "22:25",
      "similarity": 0.38842148038210655
    },
    {
      "verse": "20:91",
      "similarity": 0.36024494378166627
    },
    {
      "verse": "2:125",
      "similarity": 0.36005778407833744
    },
    {
      "verse": "7:138",
      "similarity": 0.29699016513820053
    }
  ]
}