{
  "chapter": "الأنبياء",
  "text": "قالوا۟ حرقوه وانصروا۟ ءالهتكم ان كنتم فعلين",
  "translations": [
    {
      "translation": "They said, 'Burn him and support your gods if you are resolved to do something.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Burn him, and save your gods, if you are men of action.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Burn him, and come to the support of your gods, if you are going to do anything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Burn him to ashes if you want to help your gods\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Burn him and help your Gods, if you want to.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Burn him and help your gods, if you will be doing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Burn him and help your gods, if you are going to do (anything).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Burn him, and help your gods, if you would do aught.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They cried: Burn him and stand by your gods, if ye will be doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Burn him and help your deities, if you are resolved to do something.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: burn him, and succour your gods, if ye will be doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Burn him, and help your gods, if you are to do anything!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Burn him and protect your gods, If ye do (anything at all)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Burn him and help your aliha (gods), if you will be doing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'Burn him and help your gods, if you are going to do anything'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Burn him and support your gods, if you are going to act.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Burn him and support your gods - if you are to act.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:68] They said, ‘Burn him, that is, [burn] Abraham, and stand by your gods, by having him burnt, if you are to do anything’, in the way of standing by them. Thus they gathered lots of firewood and lit a fire throughout it. They then tied up Abraham, placed him in a ballista and had him hurled into the fire. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They cried) their king Nimrod said to them: (Burn him) in the Fire (and stand by your gods) and avenge your deities, (if ye will be doing) something to him; and they threw him in the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ حرّقوه } أي: اتركوه يحترق بنار العشق التي أنتم أوقدتموها أولاً بإلقاء الحقائق والمعارف إليه التي هي حطب تلك النار عند رؤيته ملكوت السموات والأرض بإراءة الله إياه، كما قال:\n\n[الأنعام، الآية: 75] وإشراق الأنوار الصفاتية والأسمائية عند تجليات الجمال والجلال عليه من وراء أستار أعيانكم التي هي منشأة اتقاد تلك النار { وانصروا آلهتكم } أي: معشوقاتكم ومعبوداتكم في الإمداد بتلك الأنوار وإيقاد تلك النار { إن كنتم فاعلين } بأمر الحق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سمعوا منه التعيير والتشنيع ثارت نار حميتهم واشتد غيظ غيرتهم { قَالُواْ } بعدما شاوروا كثيراً في وجه إهلاكه وانتقامه: { حَرِّقُوهُ } إذ لا عذاب أقرع وأهول منه { وَٱنصُرُوۤاْ } بحرقة { آلِهَتَكُمْ } لأن التعذيب بالنار مخصوص بالإلهة، كما قال \" لاَ يُعَذِّبُ بِالنَّارِ غَيْرُ خَالِقِهِا \" ولما كان تعذيبهم إياه لأجل آلهتهم، لذلك اختاروا تعذيبه بالنار { إِن كُنتُمْ فَاعِلِينَ } [الأنبياء: 68] ناصرين آلهتكم بأخذ انتقامهم عنه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { قالوا حرِّقوه } أي: قال بعضهم لبعض، لَمَّا عجزوا عن المحاججة، وضاقت عليهم الحيل، وعييت بهم العلل، وهذا دَيْدنُ المبطل المحجوج، إذا قُرعَت شبهه بالحجة القاطعة وافتضح، لم يبق له حينئذ إلا المناصبة والمعاداة، فناصبوا إبراهيم عليه السلام، وقالوا حرِّقوه بالنار لأنه أشد العقوبات، { وانصُروا آلهتكم } بالانتقام لها { إن كنتم فاعلين } للنصر، أي: إن كنتم ناصرين آلهتكم نصرًا مؤزرًا، فاختاروا له أهول المعاقبات، وهو الإحراق، وإلاَّ فقد فرطتم في نصرتها، والذي أشار بالإحراق نمرود، أو رجل من أكراد فارس، اسمه \" هيزن \" ، وقيل: \" هدير \" ، خسفت به الأرض، فهو يتجلجل إلى يوم القيامة\n رُوِيَ أنهم، لما أجمعوا على حرقه عليه السلام، بنوا له حظيرة بكُوثَى - قرية من قرى الأنباط بالعراق - فجمعوا صلاب الحطب من أصناف الخشب، مدة أربعين يومًا، وقيل: شهرًا، حتى إن المرأة تنذر: لَئِنْ أصابت حاجتها لتَحِطَبنَّ في نار إبراهيم\n ثم أوقدوا نارًا عظيمة، لا يكاد يحومُ حولها أحد، حتى إن كانت الطير لتمرُ بها، وهي في أقصى الجو فتحترق من شدة وهجها، ولم يقدر أحد أن يقربها، فلم يعلموا كيف يُلقونه عليه السلام فيها، فأتى إبليس وعلمهم علمَ المنجنيق، فعملوه\n وقيل: صنعه لهم رجل من الأكراد، فخسف الله تعالى به في الأرض مثل الآخر، ثم عمدوا إلى إبراهيم عليه السلام، فوضعوه فيه مغلولاً مقيدًا مجردًا، فصاحت السماءُ والأرضُ ومن فيها من الملائكة: يا ربنا، إبراهيم، ليس في الأرض أحد يعبدك غيرُه، يُحرق فيك، فَأذَنْ لنا في نصرته، فقال لهم: إن استغاث بواحد منكم فأغيثوه، فرموا به فيها من مكان شاسع، فقال له جبريل عليه السلام، وهو في الهواء: ألك حاجة؟ فقال: أما إليك فلا\n قال: فسل ربك\n فقال: حسبي من سؤالي علمه بحالي، فرفع همته عن الخلق، واكتفى بالواحد الحق، فجعل الله الخطيرةَ روضة\n وهذا معنى قوله: { قلنا يا نار كوني بردًا وسلامًا على إِبراهيم } أي: كوني ذات برد وسلام، أي: ابردي بردًا غير ضار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:10",
      "similarity": 0.7451272890119355
    },
    {
      "verse": "29:24",
      "similarity": 0.7275533790754474
    },
    {
      "verse": "8:50",
      "similarity": 0.6304017238735604
    },
    {
      "verse": "3:181",
      "similarity": 0.5687757163954666
    },
    {
      "verse": "22:22",
      "similarity": 0.5579040499288306
    }
  ]
}