{
  "chapter": "الأنبياء",
  "text": "قال افتعبدون من دون الله ما لا ينفعكم شيـا ولا يضركم",
  "translations": [
    {
      "translation": "He said, 'Do you then worship, instead of Allah, what cannot help or harm you in any way?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(So Abraham) said: \"Then why do you worship something apart from God that cannot profit you or do you harm?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham said: \"Do you, then, worship beside Allah a thing that can neither benefit you nor hurt you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Do you, instead of God, worship things that can neither harm nor benefit you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “What! You worship, instead of Allah, one that neither benefits you nor harms you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Do you then worship besides Allah, things that can neither profit you nor harm you\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: What! do you then serve besides Allah what brings you not any benefit at all, nor does it harm you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'What, and do you serve, apart from God, that which profits you nothing; neither hurts you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Worship ye then instead of Allah that which cannot profit you at all, nor harm you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham said, \"So, do you worship something instead of God that can neither benefit you nor harm you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: worship ye, then, beside Allah, that which profiteth you not at all, nor it hurteth you\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Then, do you worship besides Allah that which cannot cause you any benefit or harm?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Abraham) said, \"Do ye then worship, besides Allah, things that can neither be of any good to you nor do you harm?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Ibrahim (Abraham)] said: \"Do you then worship besides Allah, things that can neither profit you, nor harm you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Would you then worship that, instead of Allah, which can neither help nor harm you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Do you worship, instead of God, what can neither benefit you in anything, nor harm you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Then do you worship instead of Allah that which does not benefit you at all or harm you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:66] He said, ‘Do you then worship, besides God, that is, in His place, that which cannot benefit you in any way, with regard to [granting you] provision and otherwise, nor harm you?, in any way if you were not to worship it?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Abraham said: (Worship ye then instead of Allah that which cannot profit you at all) if you worshipped it, (nor harm you) if you did not worship it?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما اعترفوا بحمادية آلهتهم وعدم قابليتهم للنطق، والتنطق، والتكلم { قَالَ } إبراهيم موبخاً عليهم ومقرعاً: { أَ } ما تستحيون وتخجلون أيها الضالون المكابرون { فَتَعْبُدُونَ مِن دُونِ ٱللَّهِ } الواحد الأحد المتوحد بالألوهية والربوبية، المستقل بجميع التصرفات الواقعة في عالم الغيب والشهادة { مَا لاَ يَنفَعُكُمْ شَيْئاً وَلاَ يَضُرُّكُمْ } [الأنبياء: 66] أي: أصناماً وأوثاناً، لا يرجى منهم النفع والضر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو: أنتم الظالمون لا من كسرها، { ثم نُكِسُوا على رؤوسهم } ، وردّوا إلى أسفل سافلين، أُجري الحقُّ على لسانهم في القول الأول، ثم أدركتهم الشقاوة، أي: انقلبوا إلى المجادلة، بعدما استقاموا بالمراجعة، شَبَّه عودهم إلى الباطل بصيرورة أسفل الشيء أعلاه، قائلين: { لقد علمتَ } يا إبراهيم { ما هؤلاء ينطقون } ، فكيف تأمرنا بسؤالها؟ { قال } مبكتًا لهم وتوبيخًا: { أفتعبدون من دون الله } أي: متجاوزين عبادته تعالى إلى { ما لا ينفعكم شيئًا } من النفع، { ولا يضُركُم } إن لم تعبدوه، فإنَّ العلم بالحالة المنافية للألوهية مما يُوجب اجتناب عبادته، { أفٍّ لكم ولما تعبدون من دون الله } ، أُفّ: اسم صوت تدل على التضجر، تَضجر عليه السلام من إصرارهم على الباطل، بعد انقطاع عذرهم ووضوح الحق، فأفَّف بهم وبأصنامهم، أي: لكم ولأصنامكم هذا التأفف، { أفلا تعقلون } أن من هذا وصفه لا يستحق أن يكون إلهًا\n\n\nوالله تعالى أعلم\n الإشارة: من أراد أن يكون إبراهيميًا حنيفيًا فليكسر أصنام نفسه، وهي ما كانت تهواه وتميل إليه من الحظوظ النفسانية والشهوات الجسمانية، حتى تنقلب حقوقًا ربانية، فحينئذ يريه الحق ملكوتَ السماواتِ والأرض، ويكون من الموقنين\n، وأمُّ الشهوات: حب الدنيا، ورأسها: حب الرئاسة والجاه، وأكبر الأصنام: وجودك الحسي، فلا حجاب أعظم منه، ولذلك قيل:\n\nفإن غبتَ عنه، وكسرته، غابت عنك جميعُ العوالم الحسية، وشهدت أسرار المعاني القدسية، فشهدت أسرار الذات وأنوار الصفات، وإلى هذا المعنى أشار ابن العريف رضي الله عنه بقوله:\n\nفالغيبة عن وجود العبد فناء، والرجوع إليه لوظائف العبودية بقاء، وإليه الإشارة بقوله تعالى: { إلا كبيرًا لهم لعلهم إليه يَرجعون } أي: إلا كبير الأصنام، وهو وجودك الوهمي، فلا ينبغي الغيبة عنه بالكلية حتى يترك وظائف العبودية والقيام بحقوق البشرية، فإنَّ هذا اصطلام، بل ينبغي ملاحظته، لعله يقع الرجوع إليه في مقام البقاء، والله تعالى أعلم\n ثمَّ ذكر قصة تحريقه وانجائه\n",
      "translations": []
    }
  ]
}