{
  "chapter": "الأنبياء",
  "text": "قال بل فعله كبيرهم هذا فسـلوهم ان كانوا۟ ينطقون",
  "translations": [
    {
      "translation": "He said, 'No, this one, the biggest of them, did it. Ask them if they are able to speak!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No,\" he said. \"It was done by that chief of theirs. Ask him in case they can speak.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answered: \"Rather it was this supreme one who has done it. So ask them, if they can speak.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"I think the biggest among them has broken the smaller ones. Ask them if they are able to speak\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, “Rather, their chief may have done it; so question them, if they can speak.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Nay, this one, the biggest of them did it. Ask them, if they can speak!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Surely (some doer) has done it; the chief of them is this, therefore ask them, if they can speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'No; it was this great one of them that did it. Question them; if they are able to speak!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: But this, their chief hath done it. So question them, if they can speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answered, \"Rather this biggest one of them did it. Ask them, if they can speak.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: rather he hath wrought it: this big one of them: so question them, if they ever speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘No, it was this biggest one of them who did it! Ask them, if they can speak.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Nay, this was done by - this is their biggest one! ask them, if they can speak intelligently!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Ibrahim (Abraham)] said: \"Nay, this one, the biggest of them (idols) did it. Ask them, if they can speak!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No' he replied. 'It was their great one amongst them that did it. Ask them, if they are able to speak'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “But it was this biggest of them that did it. Ask them, if they can speak.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Rather, this - the largest of them - did it, so ask them, if they should [be able to] speak.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:63] He said, concealing his deed: ‘Rather it was this principal one among them did it. So question them, about the perpetrator of this, if they can speak!’ (here the response to the conditional statement precedes [the conditional clause]; in the preceding clause there is an intimation for them that an idol, acknowledged as being incapable of action, cannot be a god).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "He said) Abraham said: (But this, their chief) who has the axe on its shoulder (hath done it. So question them, if they can speak) so that they can inform you who broke them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } في جوابهم على مقتضى اعتقادهم وزعمهم: أنا عبد مألوه مربوب، وهم آلهة معبودون، كيف أقدر أن أفعل بهم هذا { بَلْ فَعَلَهُ كَبِيرُهُمْ هَـٰذَا } أي: هذا الصنم الغير المنكسر؛ لئلا يشاركوا معه في المعبودية والألوهية، وإن شككتم أنه فعل هذا هو أم أنا { فَاسْأَلُوهُمْ } أي: الآلهة { إِن كَانُواْ يِنْطِقُونَ } [الأنبياء: 63] يعين: إن اعتقدتم نطقهم وتكلمهم؛ لأنهم آلهة، ومن لوازم الألوهية: التكلم، والتنطق، بل أنتم تعتقدون أن هؤلاء خلقوا جميع أهل التكلم واللسان، فهم أولى وأحق بجواب سؤالكم هذا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nفلما أحضروه { قالوا أأنت فعلتَ هذا بآلهتنا يا إِبراهيم }؟ واختصر إحضاره للتنبيه على أن إتيانهم به، ومسارعتهم إلى ذلك، أمر محقق غني عن البيان { قال } إبراهيم عليه السلام: { بل فعله كبيرُهُم هذا } ، غار أن يُعبدوا معه، مشيرًا إلى الذي لم يكسره\n وعن الكسائي: أنه يقف على { بل فعله } أي: فعله من فعله، ثم ابتدأ: كبيرهم هذا يُخبركم فسلوه\n\n\n الخ، والأكثر: أنه لا وقف، والفاعل: كبيرهم\n و \" هذا \": بدل، أو وصف، ونسبَ الفعل إلى كبيرهم، وقصده تقريره لنفسه وإسناده لها، على أسلوب تعريضي تبكيتًا لهم، وإلزامًا للحجة عليهم، لأنهم إذا نظروا النظر الصحيح عَلِموا عجز كبيرهم، وأنه لا يصلح للألوهية، وهذا كما لو كتبت كتابًا بخط أنيق، وأنت شهير بحسن الخط، ومعك صاحب أُميّ، فقال لك قائل: أأنت كتبت هذا؟ فتقول: بل كتبه هذا، وهو يعلم أنه أُميّ لا يُحسن الكتابة، فهو تقرير لإثبات الكتابة لك على أبلغ وجه\n قال الكواشي: ومن الجائز أن يكون أَذِنَ الله تعالى له في ذلك كما أَذِنَ ليوسف حين نادى على إخوته:\n\n[يُوسُف: 70]، ولم يكونوا سارقين لِمَا في ذلك من المصلحة لأنهم إذا نظروا النظر الصحيح، وسألوا عَلِمُوا أن كبيرهم لم يفعل شيئًا، وأنه عاجز عن النطق، فضلاً عن الفعل، فلا يجوز أن يُعبد، ولا يستحق العبادة إلا القادر الفعال\n هـ\n وقيل: اسند الفعل إلى كبيرهم لأنه الحامل له على كسرها، حيث رآه يُعظَّم أكثر منها، ويُعبد من دون الله، فاشتد غضبه حتى كسرها، وهو بعيد إذ لو كان كذلك لكسره أولاً، فتحصل أنه عليه السلام إنما قصد التعريض بعبادتهم، لا الإخبار المحض، حتى يكون كذبًا\n فإن قلت: قد ورد في الحديث أن إبراهيم كذب ثلاث كذبات؟ فالجواب: أن معنى ذلك: أنه قال قولاً ظاهره الكذب، وإن كان القصد به معنى آخر\n قاله ابن جزي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:35",
      "similarity": 0.82950977688687
    },
    {
      "verse": "37:92",
      "similarity": 0.8176828711630159
    },
    {
      "verse": "51:23",
      "similarity": 0.762346197445348
    },
    {
      "verse": "53:3",
      "similarity": 0.7241231770048876
    },
    {
      "verse": "27:85",
      "similarity": 0.6723921383414633
    }
  ]
}