{
  "chapter": "الأنبياء",
  "text": "وارادوا۟ به كيدا فجعلنهم الاخسرين",
  "translations": [
    {
      "translation": "They desired to trap him but We made them the losers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wished to entrap him, but We made them greater losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had sought to do evil to him, but We caused them to be the worst losers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had devised an evil plan (against Abraham), but We turned it into failure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they wished to cause him harm, so We made them the greatest of losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they wanted to harm him, but We made them the worst losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they desired a war on him, but We made them the greatest losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They desired to outwit him; so We made them the worse losers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they wished to set a snare for him, but We made them the greater losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had sought to do him harm, but We frustrated them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they intended to do him an evil, but We made them the worst losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They plotted to harm him, but We made them the biggest losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they sought a stratagem against him: but We made them the ones that lost most!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they wanted to harm him, but We made them the worst losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They sought to outwit him, but We made them the worst of losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They planned to harm him, but We made them the worst losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they intended for him harm, but We made them the greatest losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:70] And they sought to outwit him, namely, by having him burnt, but We made them the greater losers, in what they sought.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they wished to set a snare for him) i.e. to burn him, (but We made them the greater losers) the ones who were humbled. 357\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يا نار كوني برداً وسلاماً } بالوصول حال الفناء، فإن لذّة الوصول تفيد الروح الكامل والسلامة عن نقص الحدثان وآفة النقصان والإمكان في عين نار العشق { وأرادوا به كيداً } بإفنائه وإحراقه { فجعلناهم الأخسرين } الأنقصين منه كمالاً ورتبة { ونجيناه } ولوط العقل بالبقاء بعد الفناء بالوجود الحقاني الموهوب إلى أرض الطبيعة البدنية { التي باركنا فيها } بالكمالات العملية المثمرة والآداب الحسنة المفيدة والشرائع والملكات الفاضلة { للعالمين } أي: المستعدّين لقبول فيضه وتربيته وهدايته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما علموا وأبصروا أن النار لا تضره، بل صارت له روحاً وريحاناً، أُفحموا وألزموا وكيف لا يفحمون { أَرَادُواْ بِهِ كَيْداً } ومكراً لينتقموا عنه، ويبطلوا دعواه التوحيد فعاد عليهم الإلزام والإبطال، فغلبوا هنالك { فَجَعَلْنَاهُمُ ٱلأَخْسَرِينَ } [الأنبياء: 70] فيما قصدوا له وانقلبوا عن مجمعهم خاسرين خسراناً مبيناً وخيبة عظيمة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { وأرادوا به كيدًا } مكرًا عظيمًا في الإضرار، { فجعلناهم الأخسرين } أي: أخسر من كل خاسر، حيث جاء سعيهم في إطفاء نور الحق برهانًا قاطعًا على أنه عليه السلام على الحق، وهم على الباطل، وموجبًا لارتفاع درجته واستحقاقهم للهلاك، فأرسل الله على نمرود وقومه البعوض، فأكلت لحومهم وشربت دماءهم، ودخلت بعوضة في دماغ نمرود فأهلكته بعد المحنة الشديدة، وبالله التوفيق\n الإشارة: أجرى الله تعالى عادته في المتوجه الصادق، إذا أراد الوصول إلى حضرته، أن يبْتَليه قبل أن يُمكنه، ويمتحنه قبل أن يُصافيه لأنَّ محبته تعالى مقرونة بالبلاء، والداخل على الله منكور، والراجع إلى الناس مبرور\n فإذا رُمِيَ الولي في منجنيق الابتلاء، وألقي في نار الجلال، وتعرضت له الأكوان: ألك حاجة؟ فيقول - إن كان مؤيَدًا -: أمَّا إليك فلا، وأما إلى الله فبلى، فإذا قيل له: سله، فيقول: علمه بحالي يغني عن سؤالي\n فلا جرم أن الله تعالى يقول لنار الجلال: كوني بردًا وسلامًا على وليي، فينقلب حرها بردًا وسلامًا، فلا يرى أيامًا أحلى من تلك الأيام التي ابتُلي فيها\n\n\nوهذا أمر مجرب مَذُوق، وأما إن التفت إلى التعلق بغير الله تعالى، فإنَّ البلاء يُشدد عليه، أو يخرج من دائرة الولاية، والعياذ بالله\n فالولي هو الذي يقلب الأعيان بهمته، وبالنور الذي في قلبه، حسية كانت أو معنوية، فيقلب الخوف أمنًا، والحزن سرورًا، والقبض بسطًا، والفاقة غنًى، وهكذا\n\n\n فحينئذ تنفعل له الأشياء وتطيعه، وتخرق له العوائد، حتى لو ألقي في النار الحسية لبردت\n قال الورتجبي: كان الخليل منُورًا بنور الله، وكان فعل النار من فعل الله، فغلب نور الصفة على نور الفعل، ولو بقيت النار حتى وصل إليها الخليل لصارت مضمحلة، فعلم الحق ذلك، فقال لها: { كوني بردًا وسلامًا على إبراهيم } حتى تبقى لظهور معجزته وبيان كرامته\n هـ\n ومصداق ما ذكره: قول النار يوم القيامة للمؤمن: جُز فقد أطفأ نورك لهبي، كما ورد\n والله أعلم\n ثمَّ ذكر هجرة إبراهيم إلى الشام:\n",
      "translations": []
    }
  ]
}