{
  "chapter": "الأنبياء",
  "text": "وداود وسليمن اذ يحكمان فى الحرث اذ نفشت فيه غنم القوم وكنا لحكمهم شهدين",
  "translations": [
    {
      "translation": "(Remember) David and Solomon, when they pronounced judgement about the field which was eaten up at night by sheep belonging to certain people. We were witness to their judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed the same favour upon David and Solomon. Recall, when they gave judgement regarding a tillage into which the sheep of some people had strayed at night, and We were witnesses to their judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "David and Solomon were trying to settle the case of the people's sheep that grazed in a corn-field at night. We witnessed their decree in that matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Dawud and Sulaiman, when they were deciding the dispute of a field, when some people’s sheep had strayed into it at night; and We were Present at the time of their deciding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Dawud and Sulayman, when they gave judgement in the case of the field in which the sheep of certain people had Nafashat; and We were witness to their judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Dawood and Sulaiman when they gave judgment concerning the field when the people's sheep pastured therein by night, and We were bearers of witness to their judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And David and Solomon -- when they gave judgment concerning the tillage, when the sheep of the people strayed there, and We bore witness to their judgment;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And David and Solomon, when they gave judgment concerning the field, when people's sheep had strayed and browsed therein by night; and We were witnesses to their judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell of David and Solomon who both passed judgement on the field into which some people's sheep had strayed [and grazed] at night. We bore witness to their judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Daud and Sulaiman! recall what time they gave judgment regarding the tillage when certain people's sheep had pastured therein at night; and of the judgment concerning them We were the Witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] David and Solomon when they gave judgement concerning the tillage when the sheep of some people strayed into it by night, and We were witness to their judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember David and Solomon, when they gave judgment in the matter of the field into which the sheep of certain people had strayed by night: We did witness their judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Dawud (David) and Sulaiman (Solomon), when they gave judgement in the case of the field in which the sheep of certain people had pastured at night and We were witness to their judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And David and Solomon they passed judgment upon the tilled land on which the people? s sheep had strayed. We bore witness to their judgment, and\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And David and Solomon, when they gave judgment in the case of the field, when some people’s sheep wandered therein by night; and We were witnesses to their judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] David and Solomon, when they judged concerning the field - when the sheep of a people overran it [at night], and We were witness to their judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:78] And, mention, David and Solomon, that is, [mention] their story (Dāwūda wa-Sulaymāna is substituted by [the following, idh yahkumāni …]) when they gave judgement concerning the tillage, a field of crops or a vineyard, when the sheep of a [certain] people strayed into it, that is, [when these sheep] grazed there at night, but without a shepherd, because they had escaped; and We were witnesses to their judgement (lihukmihim shāhidīna: here the plural person is being used in the case of a dual). David decreed: to the owner of the tillage belong the head of the sheep. Solomon decreed: he shall benefit from [the use of] their milk, offspring and wool until such time as the tillage is restored to its original state at the hands of the owner [of the sheep], after which he [the owner of the tillage] should return them [the sheep] to him [their owner].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And David and Solomon) We also honoured them with prophethood and wisdom, (when they gave judgement concerning the field) the vineyard of the people, (when people's sheep) other people's sheep (had strayed and browsed therein by night; and We were witnesses to) We had knowledge of (their judgement) the judgement of David and Solomon.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ نَفَشَتْ فِيهِ غَنَمُ ٱلْقَوْمِ } فالنَّفشُ: أنْ تدخُلَ في الزَّرعِ ليلاً فتأكُلَهُ، ولا يكونُ إلاَّ بالليلِ\n والهَملُ بالنَّهارِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل في كتابك قصة { دَاوُودَ وَسُلَيْمَانَ } وقت { إِذْ يَحْكُمَانِ فِي ٱلْحَرْثِ } أي: زرع القوم { إِذْ نَفَشَتْ } ودخلت { فِيهِ غَنَمُ ٱلْقَوْمِ } الآخر ليلاً، فأكلته وأهكلته، فتنازعا ورفعا الأمر إليهما، واستحكما منهما فحكم داود بالغنم على صاحب الزرع، بناء على أن صاحب الغنم لا بدَّ له أن يضبط غنمه ليلاً؛ لئلا يخسر { وَكُنَّا لِحُكْمِهِمْ } أي: لحكم داود إياهم؛ أي: لأصحاب الزرع بالغنم { شَاهِدِينَ } [الأنبياء: 78] مطلعين اطلاع شهود وحضور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وداود }: عطف على { نوحًا } ، أو معمول لاذكر، و { إذ يحكمان }: ظرف للمضاف المقدر، أي: اذكر خبرهما، و { إذ نفشت }: ظرف للحكم\n { ففهمناها }: عطف على { يحكمان } فإنه في حكم الماضي\n يقول الحقّ جلّ جلاله: { و } اذكر خبر { داودَ وسليمانَ إِذْ يحكمان } أي: وقت حكمهما { في الحرث } أي: في الزرع، أو في الكرم المتدلي عناقيده، والحرث يطلق عليهما، { إِذ نَفَشَتْ }: دخلت { فيه غنمُ القوم } فأفسدته ليلاً، فالنفش: الرعي بالليل، والهمَلُ بالنهار، وهما الرعي بلا راع\n { وكنا لحُكمِهم } أي: لهما وللمتحاكمين إليهما، أو على أنَّ أقل الجمع اثنان، { شاهدين } ، كان ذلك بعلمنا ومرأى منا، لم يغب عنا شيء منه، { ففهمناها } أي: الحكومة، أو الفتوى، { سليمانَ } ، وفيه دليل على أن الصواب كان مع سليمان\n وقصتهما على ما قال ابن عباس وغيره: أن رجلين دخلا على داود عليه السلام أحدهما: صاحب حرث، والآخر صاحب غنم، فقال صاحب الزرع: إنَّ هذا نفشت غنمه ليلاً، فوقعت في حرثي، فلم تُبق منه شيئًا، فقال له داود: اذهب فإن الغنم لك، ولعله استوت قيمتاهما - أي: قيمة الغنم كانت على قدر النقصان في الحرث - فخرج الرجلان على سليمان، وهو بالباب، وكان ابن إحدى عشرة سنة، فأخبراه بما حكم به أبوه، فدخل عليه، فقال: يا نبي الله لو حكمت بغير هذا لكان أرفق بالفريقين، قال: وما هو؟ قال: يأخذ صاحبُ الغنم الأرضَ ليُصلحها، حتى يعود زرعها كما كان، ويأخذ صاحب الزرع الغنمَ ينتفع بألبانها وصوفها ونسلها، فإذا كمل الزرع، رُدت الغنم إلى صاحبها، والأرض بزرعها إلى ربها، فقال داود: وُفقت يا بُني، وقضى بينهم بذلك\n  والذي يظهر: أن حكمهما - عليهما السلام - كان باجتهاد، ففيه دليل على أن الأنبياء يجتهدون فيما لم ينزل فيه وحي، فإنَّ قول سليمان عليه السلام: \" هذا أرفق \" ، وقوله: \" أرى أن تدفع\n\n\n \" الخ، صريح في أنه ليس بطريق الوحي، وإلا لبت القول بذلك، ولعله وجه حكم داود عليه السلام قياس ذلك على جناية العبد، فإنَّ العبد فيما جنى\n وإذا قلنا: كان بوحي، يكون حكم سليمان ناسخًا لحكم داود عليه السلام\n وأما حُكْم إفساد المواشي للزرع في شرعنا: فقال مالك والشافعي: يضمن أربابُ المواشي ما أفسدت بالليل دون النهار للحديث الوارد في ذلك، على تفصيل في مذهب مالك فيما أفسدت بالنهار\n وقال أبو حنيفة: لا يضمن ما أفسدت بالليل ولا بالنهار لقوله - عليه الصلاة والسلام -:\n\n \" العَجْماءُ جُرْحُها جُبَار \" \n\n، ما لم يكن معها سائق أو قائد، فيضمن عنده",
      "translations": []
    }
  ]
}