{
  "chapter": "الأنبياء",
  "text": "ونجينه ولوطا الى الارض التى بركنا فيها للعلمين",
  "translations": [
    {
      "translation": "We delivered both him and Lut to the land which We had blessed for all beings.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We delivered him and Lot, and brought them to the land We had blessed for all the people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We saved him and Lot and brought him to the land upon which We had bestowed Our blessings for all the people of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We took Abraham and Lot safely to the land in which We had sent blessings to the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We rescued him and Lut towards the land which We have blessed for the entire world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We rescued him and Lut to the land which We have blessed for the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered him as well as Lut (removing them) to the land which We had blessed for all people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We delivered him, and Lot, unto the land that We had blessed for all beings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We rescued him and Lot (and brought them) to the land which We have blessed for (all) peoples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We saved him and Lot [and brought them] to a land which We had blessed for all people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered him and Lut to the land wherein We had placed Our blessings for the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We delivered him and Lot toward the land, which We have blessed for all nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We delivered him and (his nephew) Lut (and directed them) to the land which We have blessed for the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We rescued him and Lout (Lot) to the land which We have blessed for the 'Alamin (mankind and jinns).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We saved him and Lot, and brought them to the land which We had blessed for all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered him, and Lot, to the land that We blessed for all people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered him and Lot to the land which We had blessed for the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:71] And We delivered him, as well as Lot — son of his [Abraham’s] brother Hārān — from Iraq, [and brought them] to the land which We have blessed for all peoples, [blessed it] with an abundance of rivers and trees, and this is Syria. Abraham settled in Palestine, and Lot in the Sinful City (al-mu’tafika, cf. Q. 53:53); and between the two is [the distance of] a day’s journey.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We rescued him) from the Fire (and Lot) We saved Lot from being swallowed by the earth and We brought them (to the land which We have blessed) through water and trees (for (all) peoples) this is the land of Jerusalem, Palestine and Jordan.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما فعلوا مع خليلنا ما فعلوا { نَجَّيْنَاهُ } من مقام جودنا ولطفنا { وَ } صاحبناه مع ابن أخيه { لُوطاً } وبعثناهما عنايةً منَّا إياهما { إِلَى ٱلأَرْضِ ٱلَّتِي بَارَكْنَا فِيهَا } وصريناهما كثير الخير والبركة وذات الأم واليُمن والأمان والإيمان { لِلْعَالَمِينَ } [الأنبياء: 71] أي: لجميع من ينزل ويؤول إليها من أهل الدين والدنيا\n وهي الشام التي هي منازل الأنبياء والأولياءن ومقر السعداء والصلحاء\n ومهبط الوحي الإلهي\n لذلك ما بعث نبي إلا فيها وفي حواليها\n\n\nقيل: نزل إبراهيم عليه السلام بعدما جلا من وطنه بـ \" فلسطين \" من الشام\n ولوط بـ \" السدوم \" وبينهما مسيرة يوم وليلة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إلى الأرض }: يتعلق بحال محذوفة، ينساق إليها الكلام، أي: ذاهبًا بهما إلى الأرض\n يقول الحقّ جلّ جلاله: { ونجيناه } أي: إبراهيم { ولوطًا } ابن أخيه هاران، ذاهبًا بهما من العراق { إِلى الأرض التي باركنا فيها للعالمين } ، وهي أرض الشام\n وبركاته العامة: أنَّ أكثر الأنبياء بُعثوا فيها، فانتشرت في العالمين شرائعهم، التي هي مبادئ الخيرات الدينية والدنيوية، وهي أرض المحشر، فيها يجمع الناس، وفيها ينزل عيسى عليه السلام، وقال أُبي بن كعب: ما من ماء عذب إلاَّ وأصله من تحت صخرة بيت المقدس، وهي أرض خِصب، يعيش فيها الفقير والغني\n قال ابن إسحاق: خرج إبراهيم من كُوثى من أرض العراق، وخرج معه لوط وسارة، فنزل حَرّان، ثم خرج منها إلى مصر، ثم خرج منها إلى الشام، فنزل السَّبُعَ من أرض فلسطين بزوجه سارة، بنت عمه هاران الأكبر، ونزل لوط عليه السلام بالمؤتفكة، وبينهما مسيرة يوم وليلة، وكلاهما من الشام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:59",
      "similarity": 0.6396902807392336
    },
    {
      "verse": "37:133",
      "similarity": 0.5813131093034507
    },
    {
      "verse": "26:160",
      "similarity": 0.5550543022111202
    },
    {
      "verse": "54:33",
      "similarity": 0.5279689962894117
    },
    {
      "verse": "22:43",
      "similarity": 0.5176134923676752
    }
  ]
}