{
  "chapter": "الأنبياء",
  "text": "ولوطا ءاتينه حكما وعلما ونجينه من القرية التى كانت تعمل الخبئث انهم كانوا۟ قوم سوء فسقين",
  "translations": [
    {
      "translation": "We gave right judgement and knowledge to Lut and rescued him from the city which committed disgusting acts. They were evil people who were deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Lot We gave wisdom and knowledge, and saved him from a people who acted villainously and were certainly wicked and disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed upon Lot sound judgement and knowledge, and We delivered him from the city that was immersed in foul deeds. They were indeed a wicked people, exceedingly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Lot We gave knowledge and wisdom and saved him from the people of the town who were committing indecent acts. They were certainly a bad and sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Lut the kingdom and knowledge, and We rescued him from the township that committed vile deeds; indeed those evil people were disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Lut, We gave him wisdom and knowledge, and We saved him from the town who practised Al-Khaba'ith. Verily, they were a people given to evil, and were rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) Lut, We gave him wisdom and knowledge, and We delivered him from the town which wrought abominations; surely they were an evil people, transgressors;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lot -- to him We gave judgment and knowledge; and we delivered him from the city that had been doing deeds of corruption; they were an evil people, truly ungodly;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Lot we gave judgment and knowledge, and We delivered him from the community that did abominations. Lo! they were folk of evil, lewd.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Lot We gave wisdom and knowledge and delivered him from the city which practiced abomination. They were indeed a wicked people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lut! We vouchsafed unto him judgment and knowledge, and We delivered him out of the city which had been working foul deeds; verily they were a people evil, wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave judgement and knowledge to Lot, and We delivered him from the town which used to commit vicious acts. Indeed, they were an evil and depraved lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Lut, too, We gave Judgment and Knowledge, and We saved him from the town which practised abominations: truly they were a people given to Evil, a rebellious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Lout (Lot), We gave him Hukman (right judgement of the affairs and Prophethood) and (religious) knowledge, and We saved him from the town (folk) who practised Al-Khaba'ith (evil, wicked and filthy deeds, etc.). Verily, they were a people given to evil, and were Fasiqun (rebellious, disobedient, to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Lot, We gave judgment and knowledge and saved him from the village that had been committing corrupt deeds; for they were an evil nation and were debauched.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Lot—We gave him judgment and knowledge, and We delivered him from the town that practiced the abominations. They were wicked and perverted people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Lot We gave judgement and knowledge, and We saved him from the city that was committing wicked deeds. Indeed, they were a people of evil, defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:74]   And to Lot We gave judgement, the ability to judge decisively between opposing parties, and knowledge; and We delivered him from the town which had been committing, that is, whose inhabitants had been committing, deeds of, vileness, by way of homosexual intercourse, hazelnut-hurling and bird-games and other things. Truly they were a folk of evil [people] (saw’ is the verbal noun of sā’ahu, ‘he harmed him’, the opposite of sarrahu, ‘he delighted him’), immoral.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And unto Lot We gave judgement) understanding (and knowledge) prophethood, (and We delivered him from the community) We delivered them from the people of Sodom (that did abominations) whose people engaged in sodomy. (Lo! they were folk of evil) they were evil in their state of disbelief, (lewd) through their sodomy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلُوطاً آتَيْنَاهُ } من مقام فضلنا وجودنا { حُكْماً } وقطعاً للخصومات، وفصلاً للخطوب والمهمات { وَعِلْماً } بسرائر الأمور ورموزها وإشاراتها الدالة على وحدة الصانع الحكيم، وسرّ سريان هويتها الذاتية على صفائح ما ظهر وما بطن { وَ } من كمال لطفنا معه { نَجَّيْنَاهُ مِنَ } فتنة { ٱلْقَرْيَةِ ٱلَّتِي كَانَت } أهلها { تَّعْمَلُ ٱلْخَبَائِثَ } أي: الفعلة الشنيعة والديدنة الخسيسة الخبيثة المذموممة المسقطة للمروءة عقلاً وبالجملة { إِنَّهُمْ } من غاية قسوتهم وغفلتهم { كَانُواْ قَوْمَ سَوْءٍ فَاسِقِينَ } [الأنبياء: 74] مغمورين بين أنواع الفسق، منغمسين في أصناف المعاصي والآثام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ولوطًا }: إما مفعول بمحذوف يُفسره قوله: { آتيناه } أي: وآتينا لوطًا، أو: باذكر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:26",
      "similarity": 0.49502415015894985
    },
    {
      "verse": "5:100",
      "similarity": 0.3938480925783482
    },
    {
      "verse": "15:59",
      "similarity": 0.3633595521968135
    },
    {
      "verse": "21:71",
      "similarity": 0.3536523808428228
    },
    {
      "verse": "27:56",
      "similarity": 0.33229761001406366
    }
  ]
}