{
  "chapter": "الأنبياء",
  "text": "ففهمنها سليمن وكلا ءاتينا حكما وعلما وسخرنا مع داود الجبال يسبحن والطير وكنا فعلين",
  "translations": [
    {
      "translation": "We gave Sulayman understanding of it. We gave each of them judgement and knowledge. We subjected the mountains to Dawud, glorifying, and the birds as well. This is something We are well able to do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made Solomon understand the case, and bestowed on each wisdom and knowledge, We subdued the al-jibal (mountains) with David to sing Our praises, and at-tair (birds). It is We who did it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We guided Solomon to the right verdict, and We had granted each of them judgement and knowledge. We made the mountains and the birds celebrate the praise of Allah with David. It was We Who did all this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made Solomon understand the law about the case and gave both David and Solomon knowledge and wisdom. We made the mountains and birds glorify the Lord along with David. We had also done to him such favors before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We explained the case to Sulaiman; and to both We gave the kingdom and knowledge; and subjected the hills to proclaim the Purity along with Dawud, and (also subjected) the birds; and these were Our works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made Sulayman to understand (the case); and to each of them We gave wisdom (Hukm) and knowledge. And We subjected the mountains and the birds to glorify Our praises along with Dawud. And it was We Who were the doer (of all these things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We made Sulaiman to understand it; and to each one We gave wisdom and knowledge; and We made the mountains, and the birds to celebrate Our praise with Dawood; and We were the doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We made Solomon to understand it, and unto each gave We judgment and knowledge. And with David We subjected the mountains to give glory, and the birds, and We were doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made Solomon to understand (the case); and unto each of them We gave judgment and knowledge. And we subdued the hills and the birds to hymn (His) praise along with David. We were the doers (thereof).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Solomon the right understanding of the matter, and We bestowed wisdom and knowledge on both of them. We caused the mountains and the birds to celebrate Our praises along with David. We had the power to do this --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We gave the understanding thereof unto Sulaiman; and unto each We vouchsafed judgment and knowledge. And We so subjected the mountains that they shall hallow us along with Daud, and also the birds; and We were the doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave its understanding to Solomon, and to each We gave judgement and knowledge. We disposed the mountains and the birds to glorify [Us] with David, and We have been the doer [of these things].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Solomon We inspired the (right) understanding of the matter: to each (of them) We gave Judgment and Knowledge; it was Our power that made the hills and the birds celebrate Our praises, with David: it was We Who did (all these things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made Sulaiman (Solomon) to understand (the case), and to each of them We gave Hukman (right judgement of the affairs and Prophethood) and knowledge. And We subjected the mountains and the birds to glorify Our Praises along with Dawud (David), And it was We Who were the doers (of all these things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made Solomon to understand it, and to both We gave judgment and knowledge. And with David We subjected the mountains and birds to exalt (Allah). All this We have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so We made Solomon understand it, and to each We gave wisdom and knowledge. And We subjected the mountains along with David to sing Our praises, and the birds as well—surely We did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave understanding of the case to Solomon, and to each [of them] We gave judgement and knowledge. And We subjected the mountains to exalt [Us], along with David and [also] the birds. And We were doing [that].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:79] And We gave understanding of this, that is, the judgement, to Solomon. [It is said that] both of their decisions were [the result of] independent judgement [exercised by both], and that David consulted Solomon; but it is also said [that their decisions were] by way of inspiration [from God] — the second [decision] abrogated the first. And to each, of the twain, We gave judgement, prophethood, and knowledge, in matters of religion. And We disposed the mountains to glorify [God] with David, and the birds also, were disposed to glorify [God] with him, for he [David] had commanded such [glorification on their part], so that whenever there was a lapse [on his part], he would [be reminded to] apply himself to the task [of glorifying God] promptly. And We were [certainly] doers, of this disposing of them to glorify [God] along with him, even if it should amaze you, that they should [be able to] respond to the lord David.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We made Solomon to understand) gentleness in judgement; (and unto each of them) David and Solomon (We gave judgement) understanding (and knowledge) prophethood. (And We subdued the hills and the birds to hymn (His) praise along with David) when he praised his Lord. (We were the doers 358 (thereof)) We did that to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nولهذا قال: { ففهمناها سليمان } فإنّ العمل بالتقوى والرياضة على وفق الشرع والحكمة العملية أبلغ في تحصيل الكمال وإبرازه إلى الفعل من العلم الكلي والفكر والنظر والذوق والكشف { وكلاً آتينا حكماً وعلماً } إذ كل منهما على الصواب في رأيه والحكمة النظرية والعملية والمكاشفة والمعاملة كلتاهما متعاضدتان في طلب الكمال\n متوافقتان في تحصيل كرم الخصال بهما\n { وسخّرنا مع داود } الفؤاد\n جبال الأعضاء { يسبحن } بألسنة خواصها التي أمرن بها ويسرن معه بسيرتها المخصوصة بها فلا تعصي ولا تمتنع عليه\n فتكلّ وتثقل وتأبى أمره\n بل تسير معه مأمورة بأمره\n منقادة مطواعة لتأدبها وارتياضها وتعوّدها بأمره\n وتمرّنها في الطاعات والعبادات\n وطير القوى الروحانية يسبحنّ بالأذكار والأفكار والطيران في فضاء أرواح الأنوار { وكنا } قادرين على ذلك التسخير",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وكان ابنه سليمان حاضراً عنده سامعاً لحكمه { فَفَهَّمْنَاهَا } أي: ألهمنا الحكومة الحقّة والفتوى في هذه القضية { سُلَيْمَانَ } وهو ابن إحدى عشرة سنة\n فقال: الأرفق أن يدفع الغنم إلى أصحاب الحرث\n لينتفعوا من ألبانها وأصوافها\n والحرث إلى صاحب الغنم ليقوم بسقيها وحفظها ورعايتها\n حتى يعود إلى الذي كان\n ثم يترادان ويتدافعان\n فقال داود لسليمان: القضاء ما قضيت\n فرجع عن حكمه\n وحَكَم بحكم ابنه { وَ } إن كان { كُلاًّ } منهما { آتَيْنَا حُكْماً وَعِلْماً } أي: رشداً صورياً ومعنوياً بمقتضى قابليتها واستعدادها { وَ } كيف لا { سَخَّرْنَا مَعَ دَاوُودَ } تفضلاً منَّا عليه وتكريماً { ٱلْجِبَالَ } إلى حيث { يُسَبِّحْنَ } ويقدسن الله عما لا يليق بجنابه معه حين اشتغل بتسبيح الله وتقديسه ازدياداً لثوابه ورفعاً لدرجته { وَ } كذا { ٱلطَّيْرَ } أي: الطيور معه حين اشتغاله بتكبير الله وتنزيهه { وَكُنَّا } وبأمثاله { فَاعِلِينَ } [الأنبياء: 79] لأنبيائنا وأوليائنا\n ومن يتوجه نحونا من عبادنا\n فلا تتعجبوا من أمثال هذا\n ولا تستبعدوا عن قدرتنا أمثال إبداعها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ففهمناها } أي: الحكومة\n أو الفتوى\n { سليمانَ } \n وفيه دليل على أن الصواب كان مع سليمان\n وقصتهما على ما قال ابن عباس وغيره: أن رجلين دخلا على داود عليه السلام أحدهما: صاحب حرث\n والآخر صاحب غنم\n فقال صاحب الزرع: إنَّ هذا نفشت غنمه ليلاً\n فوقعت في حرثي\n فلم تُبق منه شيئًا\n فقال له داود: اذهب فإن الغنم لك\n ولعله استوت قيمتاهما - أي: قيمة الغنم كانت على قدر النقصان في الحرث - فخرج الرجلان على سليمان\n وهو بالباب\n وكان ابن إحدى عشرة سنة\n فأخبراه بما حكم به أبوه\n فدخل عليه\n فقال: يا نبي الله لو حكمت بغير هذا لكان أرفق بالفريقين\n قال: وما هو؟ قال: يأخذ صاحبُ الغنم الأرضَ ليُصلحها\n حتى يعود زرعها كما كان\n ويأخذ صاحب الزرع الغنمَ ينتفع بألبانها وصوفها ونسلها\n فإذا كمل الزرع\n رُدت الغنم إلى صاحبها\n والأرض بزرعها إلى ربها\n فقال داود: وُفقت يا بُني\n وقضى بينهم بذلك\n  والذي يظهر: أن حكمهما - عليهما السلام - كان باجتهاد\n ففيه دليل على أن الأنبياء يجتهدون فيما لم ينزل فيه وحي\n فإنَّ قول سليمان عليه السلام: \" هذا أرفق \" \n وقوله: \" أرى أن تدفع\n\n\n \" الخ\n صريح في أنه ليس بطريق الوحي\n وإلا لبت القول بذلك\n ولعله وجه حكم داود عليه السلام قياس ذلك على جناية العبد\n فإنَّ العبد فيما جنى\n وإذا قلنا: كان بوحي\n يكون حكم سليمان ناسخًا لحكم داود عليه السلام\n وأما حُكْم إفساد المواشي للزرع في شرعنا: فقال مالك والشافعي: يضمن أربابُ المواشي ما أفسدت بالليل دون النهار للحديث الوارد في ذلك\n على تفصيل في مذهب مالك فيما أفسدت بالنهار\n وقال أبو حنيفة: لا يضمن ما أفسدت بالليل ولا بالنهار لقوله - عليه الصلاة والسلام -:\n \" العَجْماءُ جُرْحُها جُبَار \" \n\n ما لم يكن معها سائق أو قائد\n فيضمن عنده\n قال تعالى: { وكُلاًّ آتينا حُكمًا وعلمًا } أي: كل واحد منهما آتيناه حكمًا\n أي: نبوة\n وعلمًا: معرفة بمواجب الحكم\n لا سليمان وحده\n\nوفيه دليل على أن خطأ المجتهد لا يقدح في علمه ولا يرفع عنه صفة الاجتهاد\n ثم بيَّن ما اختص به كل واحد منهما من المعجزات\n فقال: { وسخَّرنا } أي: ذللنا { مع داود الجبالَ } \n حال كونها { يُسَبِّحْنَ } أي: مسبحات ينزهْنَ الله تعالى بلسان المقال\n كما سبّح الحصا في كف نبينا عليه الصلاة والسلام\n { و } سخرنا له { الطير } كانت تسبح معه\n وقدَّم الجبال على الطير لأن تسخيرها وتسبيحها أغرب وأدخل في الإعجاز لأنها جماد\n قال الكواشي: كان داود إذا سبّح سبّح معه الجبالُ والطير\n وكان يفهم تسبيح الحجر والشجر\n وكان إذا فتَر من التسبيح\n يُسمعه الله تعالى تسبيح الجبال والطير لينشط في التسبيح ويشتاق إليه\n ورُوي أنه كان إذا سار سارت الجبال معه مسبحة\n قال قتادة: \" يُسبحن \" \n أي: يصلين معه إذا صلى\n وهذا غير ممتنع في قدرة الله تعالى\n وفي الأثر: \" كان داود يمرُّ\n وصِفَاح الروحاءُ تجاوبه\n والطير تساعده \"\n { وكنا فاعلين } بالأنبياء أمثال هذا وأكثر\n فليس ذلك ببدع منا ولا صعب على قدرتنا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:16",
      "similarity": 0.21894148052600038
    },
    {
      "verse": "27:15",
      "similarity": 0.1797035465913705
    },
    {
      "verse": "38:30",
      "similarity": 0.1668387327239614
    },
    {
      "verse": "34:10",
      "similarity": 0.16068439640084886
    },
    {
      "verse": "6:84",
      "similarity": 0.1292341528776889
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021079.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021079.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:79.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}