{
  "chapter": "الأنبياء",
  "text": "وجعلنهم ائمة يهدون بامرنا واوحينا اليهم فعل الخيرت واقام الصلوة وايتاء الزكوة وكانوا۟ لنا عبدين",
  "translations": [
    {
      "translation": "We made them leaders, guiding by Our command, and revealed to them how to do good actions and establish salat and pay zakat, and they worshipped Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them leaders to guide (the people) by Our command; and We inspired them to perform good deeds and observe their moral obligations and pay the zakat; and they obeyed Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them into leaders to guide people in accordance with Our command, and We inspired them to good works, and to establish Prayers and to give Zakah. They worshipped Us alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed them as leaders to guide the people through Our command and sent them revelation to strive for good deeds, worship their Lord, and pay religious tax. Both of them were Our worshipping servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them leaders who guide by Our command, and We sent them the divine revelation to do good deeds and to keep the prayer established and to give charity; and they used to worship Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them leaders, guiding by Our command, and We revealed to them the doing of good deeds, performing Salah, and the giving of Zakah, and of Us (Alone) they were the worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them Imams who guided (people) by Our command, and We revealed to them the doing of good and the keeping up of prayer and the giving of the alms, and Us (alone) did they serve;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and appointed them to be leaders guiding by Our command, and We revealed to them the doing of good deeds, and to perform the prayer, and to pay the alms, and Us they served.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them chiefs who guide by Our command, and We inspired in them the doing of good deeds and the right establishment of worship and the giving of alms, and they were worshippers of Us (alone).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made them leaders who guided people by Our command. We revealed to them the doing of good, observance of prayer and the giving of alms and Us alone did they worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them leaders, guiding by Our command; and We revealed unto them the doing of good deeds and the establishment of prayer, and the giving of poor-rate; and of Us they were the worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made them imams, guiding by Our command, and We revealed to them [concerning] the performance of good deeds, the maintenance of prayers, and the giving of zakat, and they used to worship Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them leaders, guiding (men) by Our Command, and We sent them inspiration to do good deeds, to establish regular prayers, and to practise regular charity; and they constantly served Us (and Us only).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them leaders, guiding (mankind) by Our Command, and We inspired in them the doing of good deeds, performing Salat (Iqamat-as-Salat), and the giving of Zakat and of Us (Alone) they were worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and appointed them leaders to guide by Our Command and We revealed to them to do good deeds, and to establish the prayer, and the giving of charity, and they were for Us worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them leaders, guiding by Our command; and We inspired them to do good works, and to observe the prayer, and to give out charity. They were devoted servants to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made them leaders guiding by Our command. And We inspired to them the doing of good deeds, establishment of prayer, and giving of zakah; and they were worshippers of Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:73] And We made them leaders (read a-immatan pronouncing both hamzas, or substituting the second one with a yā’), whose example of good [conduct] is followed, guiding, people, by Our command, to Our religion, and We inspired in them the performance of good deeds and the maintenance of prayers and the payment of alms, that is, [We inspired] that these [good deeds] be performed, [prayers] be maintained, and [alms] be payed by them and by their followers (the [final] hā’ of iqāma has been omitted to soften [the reading]), and they used to worship Us.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We made them chiefs) leaders of goodness (who guide by Our command) who call people by Our command, (and We inspired in them the doing of good deeds) and it is said that these good deeds relate to inviting people to profess Allah's divine Oneness (and the right establishment of worship) the fulfilment of the prayers (and the giving of alms and they were worshippers of Us (alone)) and they were obedient to Us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لصلاحيتهم واستعدادهم لقبول الخيرات { جَعَلْنَاهُمْ أَئِمَّةً } وقدوة هادين مهديين { يَهْدُونَ } الناس { بِأَمْرِنَا } ووحينا إلى زلال توحيدنا { وَ } بعدما جعلناهم قدوة هادين { أَوْحَيْنَآ } وألهمنا تتميماً لأهدائهم وإرشادهم { إِلَيْهِمْ فِعْلَ ٱلْخَيْرَاتِ } والإتيان بالأعمال الصالحات، وعموم الطاعات والمبرات، لتكون لهم وسيلة مقربة لهم إلى توحيدنا { وَ } أوحينا خاصة { إِقَامَ ٱلصَّلاَة } المتضمنة لتوجههم نحو الحق بجميع القوى والحركات والأركان والجوارح { وَإِيتَآءَ ٱلزَّكَـاةِ } المصفية لقلوبهم عما سوى الحق { وَ } هم بمقتضى أمرنا ووحينا إياهم { كَانُواْ لَنَا } خاصة بلا رؤيتهم الوسائل، والأسباب العادية في البين { عَابِدِينَ } [الأنبياء: 73] متذللين متواضعين مخلصين بظواهرهم وبواطنهم وجميع أعمالهم وحركاتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وجعلناهم } أي: إبراهيم وإسحاق ويعقوب، { أئمةً } يُقتدى بهم في أمور الدين إجابة لدعوته بقوله:\n\n[البَقَرَة: 124] أي: فاجعل أئمة، { يَهدُون } الخلق إلى الحق، { بأمرِنَا } لهم بذلك، وإرسالنا إياهم حتى صاروا مكملين، أو يهدون الخلق بإرادتنا ومشيئتنا\n { وأوحينا إِليهم فعلَ الخيرات } وهي جميع الأعمال الصالحة، أي: أمرناهم أن يفعلوا جميع الخيرات، ليتم كمالهم بانضمام العمل الصالح إلى العلم، وأصله: أن يفعلوا الخيرات، ثم فعلَ الخيرات، { وإِقامَ الصلاةِ وإِيتاءَ الزكاة } ، وهو من عطف الخاص على العام دلالة على فضله وشرفه، وأصله: وإقامة الصلاة، فحذفت التاء المعوضة من إحدى الألفين لقيام المضاف إليه مقامها\n { وكانوا لنا عابدين }: قانتين مُطيعين، لا يخطر ببالهم غير عبادتنا ومشاهدتنا\n وأنتم يا معشر العرب والعجم من ذريتهم، فاتبعوهم في ذلك\n وبالله التوفيق\n الإشارة: إنما يعظم جاه العبد عند الله بثلاثة أمور: انحياشه بقلبه إلى الله، ومسارعته إلى ما فيه رضا الله، وإرشاد العباد إلى الله، بدعائهم إلى الله بالحال والمقال، فبقدر ما يقع من هداية الخلق على يديه يعلو مقامه عند الله، إن حصلت المعرفة بالله، وبهذا تعرف شرف مرتبة مشيخة الصوفية، الدالين على الله، الداعين إلى حضرة الله، إن تكلموا وقع كلامهم في قلوب الخلق، فيرجعون إلى الله من ساعتهم، مجالسهم كلها وعظ وتذكير، حالهم يُنهض إلى الله، ومقالهم يدل على الله، ففي ساعة واحدة يتوب على يديهم من الخلق ما لا يتوب على يد العالم في سنين وذلك لإنهاض الحال والمقال، فلا جَرَمَ أنهم أعز الخلق إلى الله، وأعظمهم قدرًا عند الله\n قال السهروردي في العوارف: ورد في الخبر عن رسول الله صلى الله عليه وسلم أنه قال:\n\n \" والذي نفس محمد بيده لئن شئتم لأقسمن لكم، إن أحب عباد الله إلى الله يُحَبِّبُونَ الله إلى عباده، ويُحبِّبُون عباد الله إلى الله، ويمشون في الأرض بالنصيحة \" \n\nوهذا الذي ذكر رسول الله صلى الله عليه وسلم هو رتبة المشيخة والدعوة فإن الشيخ يُحبب الله إلى عباده حقيقة، ويحبب عباد الله إلى الله\n فأما كونه يُحبب عباد الله إلى الله لأن الشيخ يسلك بالمريد طريق الاقتداء برسول الله صلى الله عليه وسلم في أفعاله وأخلاقه\n ومن صح اقتداؤه واتباعه أحبه الله، قال تعالى:\n\n[آل عِمرَان: 31]، ووجه كونه يُحبب الله إلى عباده لأنه يسلك بالمريد طريق التزكية، وإذا تزكت النفس انجلت مرآة القلب، ودخل فيها نور العظمة الإلهية، ولاح فيها جمال التوحيد، وذلك ميراث التزكية، قال الله تعالى:\n\n[الشّمس: 9]، وفلاحها: الظفر بمعرفة الله، فإذا عرفه، قطعًا، أحبه وفنى فيه\n\n\nفرتبة المشيخة من أعلى الرتب لأنها خلافة النبوة في الدعوة إلى الله\n ثم قال: فعلى المشايخ وقار لله، وبهم يتأدب المريد ظاهرًا وباطنًا، قال الله تعالى:\n\n[الأنعَام: 90]، فالمشايخ، لَمَّا اهتَدْوا، أُهِّلُوا للاقتداء بهم، وجُعِلوا أئمة للمتقين، قال رسول الله صلى الله عليه وسلم، حاكيًا عن الله عزّ وجلّ:\n\n \" إذا كان الغالبُ على عبدي الاشتغال بي، جعلت همته ولذَّتهُ في ذكري، فإذا جعلت همته ولذته في ذكري، أحبني وأحببته، ورفعتُ الحجابُ فيما بيني وبينه، لا يسهو إذا سَهَا الناسُ، أولئك كلامُهُم كلام الأنبياءِ، أولئك الأبطالُ حقًا، أولئك الذين إذا أردتُ بأهلِ الأرضِ عقوبةً أو عذابًا، ذكرتُهم فصرفتُه بهم عنهم \" \n\nانتهى كلامه رضي الله عنه\n ومن كلام ذي النون المصري - لمّا تكلم على الأبدال - قال: فهممهم إليه ثائرة، وأعينهم إليه بالغيب ناظرة، قد أقامهم على باب النظر من رؤيته، وأجلسهم على كراسي أطباء أهل معرفته، ثم قال لهم: إن أتاكم عليل من فقدي فداووه، أو مريض من فراقي فعالجوه، أو خائف مني فانصروه، أو آمن مني فحذّروه، أو راغب في مواصلتي فمنوه، أو راحل نحوي فزودوه، أو جبان في متاجرتي فشجعوه، أو آيس من فضلي فرجُّوه، أو راجٍ لإحساني فبشروه، أو حسن الظن بي فباسطوه، أو مُعظَّم لقدري فعظموه، أو مسيء بعد إحساني فعاتبوه، أو مسترشد فأرشدوه\n هـ\n وهذه صفة مشايخ التربية على ما شهدناهم، وما شهدنا إلا بما علمنا\n وبالله التوفيق\n ثمَّ ذكر نبيه لوطاً ونوحاً عليهما السلام\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:4",
      "similarity": 0.4745579608318343
    },
    {
      "verse": "24:56",
      "similarity": 0.45478618113911484
    },
    {
      "verse": "19:55",
      "similarity": 0.4506289476554998
    },
    {
      "verse": "2:110",
      "similarity": 0.4341860408139403
    },
    {
      "verse": "20:38",
      "similarity": 0.41851941803512277
    }
  ]
}