{
  "chapter": "الأنبياء",
  "text": "ونصرنه من القوم الذين كذبوا۟ بـايتنا انهم كانوا۟ قوم سوء فاغرقنهم اجمعين",
  "translations": [
    {
      "translation": "We helped him against the people who rejected Our Signs. They were an evil people and We drowned them, every one.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We helped him against the people who rejected Our signs as lies. They were a wicked people indeed, so We drowned them one and all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We helped him against a people who rejected Our signs as false. They were indeed an evil people and so We drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We helped him against the people who said Our revelations were mere lies. They were a bad people and We drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We helped him against the people who denied Our signs; indeed they were evil people, We therefore drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We helped him against the people who denied Our Ayat. Verily, they were a people given to evil. So We drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We helped him against the people who rejected Our communications; surely they were an evil people, so We drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We helped him against the people who cried lies to Our signs; surely they were an evil people, so We drowned them all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And delivered him from the people who denied Our revelations. Lo! they were folk of evil, therefor did We drown them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We helped him against his people who rejected Our revelations. They were surely a wicked people, so We drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We succoured him against the people who belied Our signs; verily they were a people evil, so we drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We helped him against the people who denied Our signs. They were indeed an evil lot; so We drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We helped him against people who rejected Our Signs: truly they were a people given to Evil: so We drowned them (in the Flood) all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We helped him against people who denied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.). Verily, they were a people given to evil. So We drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and helped him against the nation who had belied Our signs. They were an evil nation; We drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We supported him against the people who rejected Our signs. They were an evil people, so We drowned them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We saved him from the people who denied Our signs. Indeed, they were a people of evil, so We drowned them, all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:77] And We helped him, We defended him, against the people who denied Our signs, the ones indicating his Mission, lest they cause him any harm. They were indeed an evil people, so We drowned them all.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And delivered him from the people who denied Our revelations) who disbelieved in Our Scripture and Messenger Noah. (Lo! they were folk of evil) in their state of disbelief, (therefore did We drown them all) by the flood.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n[القمر: 10] { وَ } لذلك { نَصَرْنَاهُ } وجعلناه منتصراً ناجياً { مِنَ ٱلْقَوْمِ ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا } الدالة على عظمة ذاتنا وكمال أسمائنا وصفاتنا\n وذلك أنه دعاهم إلى الإيمان والتوحيد\n وهداهم إلى صريح مستقيمن وهم امتنعوا عن القبول { إِنَّهُمْ } من شدة شكيمتهم وغلظ غيظهم مع أهل الحق { كَانُواْ قَوْمَ سَوْءٍ } كأنهم مغمورون فيه متخذون منه { فَأَغْرَقْنَاهُمْ } لذلك { أَجْمَعِينَ } [الأنبياء: 77] تطهيراً للأرض من فسادهم\n وقلعاً لعرق غيّهم وعنادهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وأصل الكرب: الغم الشديد، { ونصرناه } نصرًا مستتبعًا للانتقام، { من القوم الذين كذبوا بآياتنا } أي: منعناه من إذايتهم، { إِنهم كانوا قومَ سَوْءٍ } ، تعليل لما قبله، { فأغرقناهم أجمعين } ، صغيرهم وكبيرهم، ذكرهم وأنثاهم لأن الإصرار على تكذيب الحق، والانهماك في الشر والفساد، مما يُوجب الإهلاك العام\n والله تعالى أعلم\n الإشارة: نبي الله لوط عليه السلام لمَّا هاجر من أرض الظلمة إلى الأرض المقدسة، أعطاه الله العلم والحكمة\n فكل من هاجر من الغفلة إلى محل الذكر واليقظة، وهجر ما نهى الله عنه عوَّضه الله علمًا بلا تعلم، وأجرى على لسانه ينابيع الحكمة\n قال أبو سليمان الداراني رضي الله عنه: إذا اعتقدت النفس على ترك الآثام، جالت في الملكوت، وعادت إلى ذلك العبد بطرائف الحكمة، من غير أن يُؤدِّيَ إليها عالمٌ علمًا\n ومصداقه الحديث:\n\n \" من عمل بما يعلم، ورثه الله عَلْمَ ما لم يعلم \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:66",
      "similarity": 0.6828558117675666
    },
    {
      "verse": "37:82",
      "similarity": 0.6828558117675666
    },
    {
      "verse": "79:1",
      "similarity": 0.5144607481522291
    },
    {
      "verse": "26:120",
      "similarity": 0.49676618807503703
    },
    {
      "verse": "7:64",
      "similarity": 0.48375786837783785
    }
  ]
}