{
  "chapter": "الأنبياء",
  "text": "وزكريا اذ نادى ربه رب لا تذرنى فردا وانت خير الورثين",
  "translations": [
    {
      "translation": "And Zakariyya when he called out to his Lord, 'My Lord, do not leave me on my own, though You are the Best of Inheritors.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) Zachariah when he called to his Lord: \"Do not leave me alone (and childless), for you are the best of givers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed favour upon Zechariah, when he cried to his Lord: \"Lord! Leave me not solitary (without any issue). You are the Best Inheritor.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Zachariah prayed, \"Lord, do not leave me alone without offspring, although you are the best heir\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Zakaria, when he prayed to his Lord, “O my Lord – do not leave me alone, and You are the Best Inheritor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Zakariyya, when he cried to his Lord: \"O My Lord! Leave me not single (childless), though You are the Best of the inheritors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Zakariya, when he cried to his Lord: O my Lord leave me not alone; and Thou art the best of inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Zachariah -- when he called unto his Lord, 'O my Lord, leave me not solitary; though Thou art the best of inheritors.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Zachariah, when he cried unto his Lord: My Lord! Leave me not childless, though Thou art the Best of inheritors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Zachariah, when he called out to his Lord, \"Do not leave me heirless Lord, You are the best of heirs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Zakariyya! recall what time he cried unto his Lord: my Lord! leave me not solitary, though Thou art the best of heirs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] Zechariah, when he cried out to his Lord, ‘My Lord! Do not leave me without an heir, and You are the best of inheritors.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Zakariya, when he cried to his Lord: \"O my Lord! leave me not without offspring, though thou art the best of inheritors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Zakariya (Zachariah), when he cried to his Lord: \"O My Lord! Leave me not single (childless), though You are the Best of the inheritors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Zachariah when he called to his Lord saying: 'Lord, do not let me remain by myself; You are the Best of inheritors'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Zechariah, when he called out to his Lord, “My Lord, do not leave me alone, even though you are the Best of heirs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] Zechariah, when he called to his Lord, \"My Lord, do not leave me alone [with no heir], while you are the best of inheritors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:89] And, mention, Zachariah (Zakariyyā, is substituted by [the following, idh nādā rabbahu …]) when he cried out to his Lord, saying: ‘My Lord, do not leave me without an heir, without a son to inherit from me, and You are the best of inheritors’, the One that endures after all of your creation has perished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Zachariah) and mention, Muhammad, Zachariah, (when he cried unto) when he prayed to (his Lord: My Lord! Leave me not childless) alone without any helper, (though Thou art the best of inheritors) though You are the best of helpers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر أيضاً أخاك { زَكَرِيَّآ } الذي بلغ من الهرم والكهولة إلى حيث آيس ممن استخلفه من نطفته\n وقنط عمن يقوم مقام من نسله\n فشكا إلى الله وقت { إِذْ نَادَىٰ رَبَّهُ } متمنياً متحسراً آيساً: { رَبِّ } يا من ربَّاني بأنواع الكرم إلى أن كبرتُ وأشرفتْ أركان جسمي إلى الانهدام\n وأجزاء جسدي إلى الانحلال والانخرام { لاَ تَذَرْنِي فَرْداً } مطقوع الفرع\n منسي الذكر بلا ولدٍ يخلفني ويرث عني\n ويحيي اسمي { وَ } إن جرى حكمك على هذا\n أو مضى قضاؤك على ذا\n فلا أبالي به\n إذ { أَنتَ خَيْرُ ٱلْوَارِثِينَ } [الأنبياء: 89] وأكرم المستخلفين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:80",
      "similarity": 0.6716766880894628
    },
    {
      "verse": "19:95",
      "similarity": 0.6073735525279599
    },
    {
      "verse": "19:2",
      "similarity": 0.5330956757887233
    },
    {
      "verse": "34:46",
      "similarity": 0.46256372902174986
    },
    {
      "verse": "19:7",
      "similarity": 0.45910166046447093
    }
  ]
}