{
  "chapter": "الأنبياء",
  "text": "وذا النون اذ ذهب مغضبا فظن ان لن نقدر عليه فنادى فى الظلمت ان لا اله الا انت سبحنك انى كنت من الظلمين",
  "translations": [
    {
      "translation": "And Dhu'n-Nun when he left in anger and thought We would not punish him. He called out in the pitch darkness: 'There is no god but You! Glory be to You! Truly I have been one of the wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Dhu'n-Noon (Jonah of the fish), when he went away in anger and imagined We will not test him (with distress). Then he called out from the darkness: \"There is no god other than You. All glory to You; surely I was a sinner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We bestowed Our favour upon Dhu al-Nun. Recall, when he went forth enraged, thinking We have no power to take him to task. Eventually he cried out in the darkness:\" There is no god but You. Glory be to You! I have done wrong.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Dhun Nun went away in anger and thought that We would never have power over him, but in darkness he cried, \"Lord, You are the Only God whom I glorify. I have certainly done wrong to myself (so forgive me)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Zun-Noon,* when he left in anger, assuming that We would not restrict him – he therefore called out in the realms of darkness, saying, “There is no God except You, Purity is to You; I have indeed committed a lapse.” (* Prophet Yunus – peace and blessings upon him)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Dhun-Nun, when he went off in anger, and imagined that We shall not punish him! But he cried through the darknesses (Zulumat) (saying): \"There is no God but You, Glorified be You! Truly, I have been of the Zalimin wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Yunus, when he went away in wrath, so he thought that We would not straiten him, so he called out among afflictions: There is no god but Thou, glory be to Thee; surely I am of those who make themselves to suffer loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Dhul Nun -- when he went forth enraged and thought that We would have no power over him; then he called out in the darkness, 'There is no god but Thou. Glory be to Thee! I have done evil.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (mention) Dhu'n-Nun, when he went off in anger and deemed that We had no power over him, but he cried out in the darkness, saying: There is no Allah save Thee. Be Thou Glorified! Lo! I have been a wrong-doer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the man in the whale [Jonah] when he went away in anger, thinking We had no power over him. But he cried out in the darkness, \"There is no deity but You. Glory be to You! I was indeed wrong.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Zun-nun! recall what time he departed in anger and imagined that We could not straiten him, then he cried in the darknesses, that: there is no god but Thou! hallowed be Thou! verily I have been of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] the Man of the Fish, when he left in a rage, thinking that We would not put him to hardship. Then he cried out in the darkness, ‘There is no god except You! You are immaculate! I have indeed been among the wrongdoers!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Zun-nun, when he departed in wrath: He imagined that We had no power over him! But he cried through the deptHs of darkness, \"There is no god but thou: glory to thee: I was indeed wrong!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Dhan-Nun (Jonah), when he went off in anger, and imagined that We shall not punish him (i.e. the calamites which had befallen him)! But he cried through the darkness (saying): La ilaha illa Anta [none has the right to be worshipped but You (O Allah)], Glorified (and Exalted) are You [above all that (evil) they associate with You]. Truly, I have been of the wrong-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ThulNun (Prophet Jonah), he went away in anger thinking We had no power over him. But in the darkness he cried: 'There is no god except You. Exaltations to You! I was among the harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Jonah, when he stormed out in fury, thinking We had no power over him. But then He cried out in the darkness, “There is no god but You! Glory to You! I was one of the wrongdoers!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] the man of the fish, when he went off in anger and thought that We would not decree [anything] upon him. And he called out within the darknesses, \"There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:87] And, mention, Dhū’l-Nūn, the one of the whale, namely, Jonah son of Amittai (Yūnus bin Mattā) when he went off enraged ([Dhā’l-Nūn] is substituted by [the clause idh dhahaba mughādiban]) by his people, that is, furious with them because of what he had suffered at their hands — even though he had not been granted permission [by God to go off as he did] — thinking that We had no power over him, that is, that We could [not] compel him to [submit to] Our decree in the way that We did by imprisoning him inside the stomach of the whale; or that We could [not] make circumstances difficult for him. Then he cried out in the darknesses,   [through] the darkness of the night, the darkness of the sea and the darkness of the whale’s stomach, that: ‘There is no god except You! Glory be to You! I have indeed been one of the wrongdoers’, for leaving my people without [Your] permission.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (mention) Dhu'l-Nun) and mention the person of the whale, i.e. Jonah the son of Mathew (Matta), (when he went off in anger) with the king (and deemed that We had no power over him) i.e. to punish him, (but he cried out in the darkness) the darkness of the sea and the darkness of the whele's entrails and the darkness of its belly, (saying: There is no God save Thee. Be Thou glorified!) I repent to You (I have been a wrong-doer) I wronged myself when I became angry with Your command.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَذَا ٱلنُّونِ إِذ ذَّهَبَ مُغَاضِباً فَظَنَّ أَن لَّن نَّقْدِرَ } معناهُ لَنْ نَقْدِرَ عَلَيهِ البَلاء الذي أصابَهُ\n ونَقْدِرُ ونُقَّدِرُ بمعنى واحدٍ وقال: ظَنَّ أَنْ لَنْ نُعاقِبَهُ\n\n\n\n\nوقوله تعالى: { فَنَادَىٰ فِي ٱلظُّلُمَاتِ أَن لاَّ إِلَـٰهَ إِلاَّ أَنتَ [سُبْحَانَكَ] } فالظُّلماتُ ظُلمةُ الليلِ، وظُلمةُ المَاءِ، وظُلمةُ بَطنِ الحُوتِ\n ويقال: إِنَّ كُلَّ تَسبيح في القرآنِ فَهو صَلاةٌ إلاَّ فِي هذه الآيةِ فإنهُ من التسبيحِ\n وفي آياتٍ أُخر فإنهُ غَيرُ صَلاةٍ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And [mention] Zun-nun, when he went away in anger and thought that We would not punish him} [means that] we will not be able to [fully] punish him for the hardship that befell him.\n\n\nWe will judge and be judged by the same standard. He said: I think we will not punish him.\n\nAnd His saying - Exalted is He: {So he called out in the darknesses, \"There is no god but You; [glorified are You]\"}, the darknesses are the darkness of the night, and the darkness of the water, and the darkness of the belly of the fish.\n It is said that every tasbih in the Qur'an is a prayer, except in this verse, for it is from the tasbih.\n\n\nAnd in other verses, He makes it clear that prayer is not required.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَ } اذكر يا أكمل الرسل أخاك { ذَا ٱلنُّونِ } صاحب الحوت\n وهو يونس بن متى\n واذكر قصته وقت { إِذ ذَّهَبَ مُغَاضِباً } على قومه من أعمالهم حين وعظهم\n فلم يتعظوا\n فشق عليه الأمر\n فغضب عليهم\n فلم يكظم غيظه\n فخرج من بينهم تفريجاً لغضبه\n وتوسيعاً لصدره { فَظَنَّ } بخروجه من بينهم { أَن لَّن نَّقْدِرَ } وتضيّق { عَلَيْهِ } ولا يمكننا حبسه وتضييقه وتغميمه في مكان آخر فهرب\n ولقي البحر فركب على السفينة فسكنت الريح\n فقال البحَّارون: إن ها هنا عبداً آبقاً\n فاقترعوا\n فخرجت القرعة باسمه فألقى نفسه في البحر\n فالتقمه الحوت { فَنَادَىٰ } وناجى ضريعاً فجيعاً مغموراً { فِي ٱلظُّلُمَاتِ } التي تراكمت عليه\n إذ هو في بطن الحوت وكان الليل مظلماً { أَن } أي: أنه { لاَّ إِلَـٰهَ } بعيد بالحق\n ويستحق للعبادة استحقاقاً ذاتياً ووصفياً { إِلاَّ أَنتَ } يا من خضعتُ لك الرقاب\n وانتكستْ دون سرادقات جلالك أعناق أولي النهى والألباب { سُبْحَانَكَ } ربي أنزهك عن جميع ما لا يليق بجنابك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { و } اذكر { ذا النُّون } أي: صاحب الحوت\n وهو يونس عليه السلام\n { إِذ ذهبَ مغاضِبًا } أي: مراغمًا لقومه\n فارًا عنهم\n وغضب من طول دعوته إياهم\n وشدة شكيمتهم\n وتمادي إصرارهم\n فخرج مهاجرًا عنهم\n قبل أن يُؤمر\n وقيل: وعدهم بالعذاب فلم يأتهم لميعادهم لأجل توبتهم\n ولم يشعر بها\n فظن أنه كذبهم\n فغضب من ذلك\n فهو من باب المغالبة للمبالغة أو لأنه غضب لما رأى منهم من الإصرار\n وغضبوا لمفارقته إياهم\n وكان من حقه عليه السلام أن يصبر وينتظر الإذن الخاص من الله تعالى\n فلما استعجل ابتلي ببطن الحوت\n وقال ابن عباس: قال جبريلُ ليونس عليه السلام: انطلق إلى أهل نِينَوى فأنذرهم أن العذاب قد حضرهم\n قال: ألتمس دابة\n قال: الأمر أعجل من ذلك\n فانطلق إلى السفينة فركبها\n فاحتبست السفينة فساهموا فسُهِم\n فجاءه الحوت يبصبص بذنبه\n فنودي الحوت: إنا لم نجعل يونس لك رزقًا\n إنما جعلناه لك حِرزًا\n فالتقمه\n ومرّ به على الأبُلة\n ثم على دجلة\n ثم مَرَّ به حتى ألقاه بنينَوَى\n هـ\n وقال وهب بن منبه رضي الله عنه: إنَّ يونس كان عبدًا صالحًا ضَيِّق الخلق\n فلما حمل أثقال النبوة تفسخ منها تفسُّخَ الرّبَع تحت الحمل الثقيل\n فقذفها وخرج هاربًا عنها\n ولذلك أخرجه الله من أولي العزم\n قال لنبيه صلى الله عليه وسلم:\n[الأحقاف: 35]\n وقال:\n[القَلَم: 48]\n أي: لا تلق أمري كما ألقاه\n هـ\n وأما قول الحسن: مغاضبًا لربه\n فلا يليق بمقام الأنبياء - عليهم السلام - إلا أن يحمل على أن خروجه بلا إذن كأنه مغاضب\n والله تعالى أعلم\n ثم قال تعالى: { فظنَّ أن لن نقْدِرَ عليه } أي: لن نضيق عليه\n أو لن نقدر عليه بالعقوبة\n فهو من القدرة\n ويؤيده قراءة من شدَّد\n وعن ابن عباس رضي الله عنه قال: دخلت يومًا على معاوية\n فقال: لقد ضربتني أمواج القرآن البارحة\n فغرقت فيها\n فلا أرى لنفسي خلاصًا إلا بك\n قال: وما هي؟ فقرأ الآية\n\n\n فقال: أو يظن نبي الله ألا يقدر عليه؟ قال: هذا من القدر لا من القدرة\n هـ\n وقيل: إنه على حذف الاستفهام\n أي: أيظن أن لن نقدر عليه\n وقيل: هو تمثيل لحاله بحال من ظن أن لن يقدر عليه\n أي: تعامل معاملة من ظن أن لن نقدر عليه حيث استعجل الفرار\n قلت: لإعلاء مقامه كثرت مطالبته بالأدب\n فحين خرج من غير إذن خاص عُدَّ خروجه كأنه ظن ألا تنفذ فيه القدرة\n وتمسك عليه السلام بالإذن العام\n وهو الهجرة من دار الكفر\n وهو لا يكفي في حق أمثاله\n فعوقب بالسجن في بطن الحوت\n\n{ فنادى في الظلمات } أي: في الظلمة الشديدة المتكاثفة كقوله:\n[البَقَرة: 17]\n أو في ظلمة بطن الحوت والبحر والليل: { أن لا إِله إِلا أنتَ } أي: بأنه لا إله إلا أنت\n أو تفسيرية\n أي: قال: لا إله إلا أنت\n { سبحانك } أي: أنزهك تنزيهًا لائقًا بك من أن يعجزك شيء\n أو: تنزيهًا لك عما ظننتُ فيك\n { إِني كنتُ من الظالمين } لنفسي بخروجي عن قومي قبل أن تأذن لي\n أو من الظالمين لأنفسهم بتعريضها للهلكة\n وعن الحسن: ما نجاه\n والله\n إلا إقراره على نفسه بالظلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:6",
      "similarity": 0.09817134773541858
    },
    {
      "verse": "1:7",
      "similarity": 0.07966744573424883
    },
    {
      "verse": "24:9",
      "similarity": 0.07831494988410306
    },
    {
      "verse": "58:14",
      "similarity": 0.07717670433976175
    },
    {
      "verse": "20:81",
      "similarity": 0.07701414824980024
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/21:87.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/21:87.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/21:87.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}