{
  "chapter": "الأنبياء",
  "text": "ولسليمن الريح عاصفة تجرى بامره الى الارض التى بركنا فيها وكنا بكل شىء علمين",
  "translations": [
    {
      "translation": "And to Sulayman We gave the fiercely blowing wind, speeding at his command towards the land which We had blessed. And We had full knowledge of everything.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made tempestuous winds obedient to Solomon which blew swiftly to sail at his bidding (with his ships) to the land We had blessed. We are cognisant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We subdued the strongly raging wind to Solomon which blew at his bidding towards the land We blessed. We know everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made subservient to Solomon the swift wind that blew on his command to the land in which We had sent blessings. We have the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We subjected the fast wind for Sulaiman, which moved by his command towards the land in which We have placed blessings; and We know everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Sulayman (We subjected) the wind strongly raging, running by his command towards the land which We had blessed. And of everything We are the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We made subservient) to Sulaiman the wind blowing violent, pursuing its course by his command to the land which We had blessed, and We are knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Solomon the wind, strongly blowing, that ran at his command unto the land that We had blessed; and We had knowledge of everything;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Solomon (We subdued) the wind in its raging. It set by his command toward the land which We had blessed. And of everything We are Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We subjected to Solomon the stormy wind, which blew at his behest towards the land which We had blessed. For it is We who have knowledge of all things --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Sulaiman We subjected the wind, strongly raging, running at his command toward the land wherein We had placed Our blessing; and of evrything We are the knowers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [We disposed] for Solomon the tempestuous wind which blew by his command toward the land which We have blessed, and We have knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It was Our power that made) the violent (unruly) wind flow (tamely) for Solomon, to his order, to the land which We had blessed: for We do know all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Sulaiman (Solomon) (We subjected) the wind strongly raging, running by his command towards the land which We had blessed. And of everything We are the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Solomon the raging wind ran at his command to the land which We had blessed. We have knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Solomon the stormy wind, blowing at His command towards the land that We have blessed. We are aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Solomon [We subjected] the wind, blowing forcefully, proceeding by his command toward the land which We had blessed. And We are ever, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:81] And, We disposed, for Solomon the wind to blow strongly — in another verse it is [described as being] rukhā’an, ‘to blow softly’ [Q. 38:36]; in other words, [it is either] blowing violently or gently [respectively], according to what he [Solomon] wanted — making its way, at his command, to the land which We have blessed, namely, Syria; and We have knowledge of all things, among them the fact that God, exalted be He, knew that what He gave to Solomon would prompt him to be subservient to his Lord, and so God did this in accordance with His knowledge.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And unto Solomon (We subdued) the wind in its raging. It set by His command) and it is also said that this means: by Solomon's command (towards the land which We had blessed) with water and trees; this is the Holy Land: Jordan and Palestine. (And of everything) We subdued for him (We are aware).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كذا سخرنا { لِسُلَيْمَانَ ٱلرِّيحَ } حال كونها { عَاصِفَةً } سريعة السير والحركة\n آبية عن التسخير\n سخرنا له حيث { تَجْرِي بِأَمْرِهِ } وحكمه سريعة { إِلَى ٱلأَرْضِ ٱلَّتِي بَارَكْنَا } أي: كثرنا الخير { فِيهَا } لساكنيها\n وكذا لجميع من يأوي إليها\n وهي أرض الشام فكان يسير مع جنوده متمكنين على بساط كان فرسخاً في فرسخ\n منسوج من الإبريسم عملته الجن له حيث شاء\n ثم يعود من يومه إلى منزله { وَ } لا تستبعدوا منَّا أمثال هذا\n إذ { كُنَّا بِكُلِّ شَيْءٍ } تعلق إرادتنا بإيجاده { عَالِمِينَ } [الأنبياء: 81]ٍ بأسباب وجوده وظهوره\n فنوجده على الوجه الذي نريده ونُجريه على مقتضى حكمتنا وقدرتنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر ما اختص به سليمان عليه السلام فقال: { ولسليمان الريحَ } أي: وسخرنا له الريح\n وإيراد اللام هنا\n دون الأولى للدلالة على ما بين التسخيرين من التفاوت\n فإن تسخير ما سخر لسليمان عليه السلام كان بطريق الانقياد الكلي والامتثال لأمره ونهيه\n بخلاف تسخير الجبال\n لم يكن بهذه المثابة\n بل بطريق التبعية والاقتداء\n حال كون الريح { عاصفةً } شديدة الهبوب\n من حيث إنها كانت تقطع مسافة بعيدة في مدة يسيرة\n وكانت رُخاء في نفسها\n طيبة\n وقيل: كانت رُخاء تارة\n وعاصفة أخرى\n على حسب ما أراد منها\n أو رُخاء في ذهابه وعاصفة في رجوعه لأن عادة المسافرين: الإسراع في الرجوع\n أو عاصفة إذا رفعت البساط ورخاء إذا جرت به\n { تجري بأمره } بمشيئة سليمان\n { إِلى الأرض التي باركنا فيها } بكثرة الأنهار والأشجار والثمار\n وهي الشام\n وكان منزله بها\n وتحمله إلى نواحيها\n قال وهب: كان سليمان إذا خرج من منزله عكفت عليه الطير\n وقام له الجن والإنس حتى يجلس على سريره\n وكان غزّاءً لا يقصر عن الغزو\n فإذا أراد غزوًا أمر فضرب له بخشب\n ثم يُنصب له على الخشب\n ثم حَمَلَ عليه الناس والدواب وآلة الحرب\n فإذا حمل معه ما يريد أمر العاصف فدخلت تحت الخشب فاحتملته\n فإذا استقلت\n أمر الرخاء فمرت به شهرًا في روحته وشهرًا في غدوته\n إلى حيث أراد\n\nهـ\n { وكُنَّا بكل شيء عالمين } أي: أحاط علمنا بكل شيء\n فنُجري الأشياء على ما سبق به علمنا\n واقتضته حكمتنا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:12",
      "similarity": 0.718738177648949
    },
    {
      "verse": "77:2",
      "similarity": 0.6939756610248057
    },
    {
      "verse": "105:5",
      "similarity": 0.6699305302912479
    },
    {
      "verse": "10:22",
      "similarity": 0.3950512431376419
    },
    {
      "verse": "27:30",
      "similarity": 0.3301578313278465
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/21:81.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/21:81.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/21:81.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}