{
  "chapter": "الأنبياء",
  "text": "وايوب اذ نادى ربه انى مسنى الضر وانت ارحم الرحمين",
  "translations": [
    {
      "translation": "And Ayyub when he called out to his Lord, 'Great harm has afflicted me and You are the Most Merciful of the merciful,'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) Job when he called to his Lord: \"I am afflicted with distress, and You are the most compassionate of all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed (the same wisdom, judgement and knowledge) upon Job. Recall, when he cried to his Lord: \"Behold, disease has struck me and You are the Most Merciful of those that are merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Job prayed, \"Lord, I have been afflicted with hardships. Have mercy on me; You are the Most Merciful of those who have mercy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Ayyub (Job), when he called his Lord that, “Hardship has afflicted me, and You are the Most Merciful of all those who have mercy.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Ayyub, when he cried to his Lord: \"Verily, distress has seized me, and You are the Most Merciful of all those who show mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ayub, when he cried to his Lord, (saying): Harm has afflicted me, and Thou art the most Merciful of the merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Job -- when he called unto his Lord, 'Behold, affliction has visited me, and Thou art the most merciful of the merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Job, when he cried unto his Lord, (saying): Lo! adversity afflicteth me, and Thou art Most Merciful of all who show mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Job when he called on his Lord saying, \"I have been afflicted with great distress: but You are the most merciful of the merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ayyub! recall what time he cried unto his Lord: verily hurt hath touched me, and Thou art the Most Merciful of the mercifuls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] Job, when he called out to his Lord, ‘Indeed distress has befallen me, and You are the most merciful of the merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Job, when He cried to his Lord, \"Truly distress has seized me, but Thou art the Most Merciful of those that are merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Ayub (Job), when he cried to his Lord: \"Verily, distress has seized me, and You are the Most Merciful of all those who show mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Job when he called to his Lord: 'Affliction has befallen me, and You are the Most Merciful of the merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Job, when he cried out to his Lord: “Great harm has afflicted me, and you are the Most Merciful of the merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] Job, when he called to his Lord, \"Indeed, adversity has touched me, and you are the Most Merciful of the merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:83] And, mention, Job (Ayyūba, is substituted by [the following, idh nādā rabbahu …]) when he called out to his Lord — after he had been afflicted with the loss of all of his possessions and children, the laceration of his body, his being shunned by all except his wife, for a period of thirteen, seventeen, or eighteen years, as well as [the affliction of enduring] a straitened means of livelihood — ‘Indeed (read annī because of the implicit yā’ [of the first person pronoun]) harm, adversity, has befallen me, and You are the Most Merciful of the merciful’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Job) and mention Job, (when he cried unto his Lord) when he prayed to his Lord, ((saying): Lo! adversity afflicteth me) suffering has visited my body, so have mercy on me and deliver me, (and Thou art Most Merciful of all who show mercy).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل أخاك { أَيُّوبَ } الذي ابتلاه الله بأنواع المحن والبلاء، فصبر عليها فازداد ألمه، واشتد الأمر عليه واضطر إلى التضرع والتفزع، وبثِّ الشكوى إلى الله، اذكر { إِذْ نَادَىٰ رَبَّهُ } مشتكياً إليه، مناجياً له، متضرعاً إياه قائلاً { أَنِّي مَسَّنِيَ ٱلضُّرُّ } يا رب، وتنحّوا عني أقاربي وذوو أرحامي وجميع رحمائي { وَأَنتَ } تبقى عليّ رحيماً مشفقاً؛ لأنك { أَرْحَمُ ٱلرَّاحِمِينَ } [الأنبياء: 83] فأدركني بلطفك؛ إذ لا طاقة لي ولا صبر بعد اليوم، وقد بلغ الجهد غياته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { و } اذكر خبر { أيوبَ } عليه السلام { إِذْ نادى ربَّه }: دعاه: { إني } أي: بأني { مسَّنيَ الضرُّ } وهو بالضم: ما يصيب النفس من مرض وهزال، وبالفتح: الضرر في كل شيء، { وأنت أرحمُ الراحمين } ، تلطف في السؤال حيث ذكر نفسَه بما يوجب الرحمة، وذكر ربه بغاية الرحمة، ولم يصرح بالمطلوب من كمال أدبه، فكأنه قال: أنت أهل أن تَرحم، وأيوب أهل أن يُرحَم، فارحمه، واكشف عنه ضره الذي مسه\n عن أنس: أنه أخبر عن ضعفه حين لم يقدر على النهوض إلى الصلاة، ولم يشتك، وكيف يشكو، والله تعالى يقول:\n\n[ص: 44]\n وقيل: إنما اشتكى إليه تلذذًا بالنجوى، لا تضررًا بالشكوى، والشكاية إليه غاية في القُرب، كما أن الشكاية منه غاية في البُعد، وسيأتي في الإشارة تكميله، إن شاء الله\n رُوي أن أيوب عليه السلام، كان من الروم، وهو أيوب بن أمُوص ابن تارَح بن رعويل بن عيص بن إسحاق\n وكانت أمه من ولد لوط عليه السلام اصطفاه الله للنبوة والرسالة، وبسط عليه الدنيا فكان له ثلاثة آلاف بعير، وسبعة آلاف شاة، وخمسمائة فدان، يتبعها خمسمائة عبد، لكل عبد امرأة وولد، وكان له سبعة بنين، وسبع بنات\n قاله النسفي\n زاد الثعلبي: وكانت له المشيئةُ من أرض الشام كلها، وكان له فيها من صنوف المال ما لم يكن لأحد من الخيل والبقر والغنم والحُمُر وغيره، وكان برًا تقيًا رحيمًا بالمساكين، يكفل الأرامل والأيتام، ويُكرم الضيف، ويُبلغ ابن السبيل، شاكرًا لأنعم الله، لا يصيب منه إبليس ما يصيب من أهل الغنى من الغفلة والغِرَّة، وكان معه ثلاثةً قد آمنوا به: رجل من اليمن واثنان من بلده، كُهُولا\n قال وهب: فسمع إبليس تَجَاوُبَ الملائكة بالصلاة عليه في السماء فحسده، فقال: إلهي، عبدك أيوب أنعمتَ عليه فشكرك، وعافيته فحمدك، ولم تجرّبه بشدّة ولا بلاء، فلو جربته بالبلاء ليكفرنّ بك وبنعمتك، فقال له تعالى: انطلق، فقد سلطتك على ماله، فجمع عفاريته وأخبرهم، فقال عفريت من الجن: أُعطيتُ من القوة ما إذا تحوّلت إعصارًا من نار أحرقتُ كل شيء آتي عليه، فقال له إبليس: دونك الإبل ورعاتها، فجاءها حتى وثبت في مراعيها، فأثار من تحت الأرض إعصارًا من نار فأحرقها وأحرق رعاءها\n فلما فرغ منها تمثل إبليس براعيها، وجلس على قَعُودٍ منها، فأتاه، وقال: يا أيوب، إن ربك الذي عبدته قد أحرق إبلك ورُعَاءَها، فقال أيوب: هو ماله، أعارنيه، يفعل فيه ما يشاء، فرجع إبليس خاسئًا، حين حمد أيوبُ ربه، فقال عفريت آخر: عندي من القوة ما إذا صِحتُ لم يسمع صوتي ذو رُوح إلا خرجت روحه، قال له إبليس: ائت الغنم ورعاءَها، فأتى، فصاح، فصارت أمواتًا ورعاتها، ثم خرج إبليس متمثلاً بقهرَمَان الرعاة، فقال له كمقالته في الإبل، فأجابه أيوب بمثل ما أجابه فيها، فرجع خاسئًا، فقال عفريت آخر: عندي من القوة ما إذا تحولتُ ريحًا عاصفًا نسفتُ كل شيء أتيت عليه، قال إبليس: فأتِ الفدادين والحرث، فجاءها، فَهبَّتْ ريح عاصفة فنسفت كل شيء، حتى كأنه لم يكن ثَمَّ شيء، فخرج إبليس متمثلاً بقهْرَمَان الحرث، فقال له مثل قوله الأول، وردَّ عليه مثل رده، حتى أتى على جميع ماله، وأيوب يحمد الله تعالى\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:41",
      "similarity": 0.8854082181458091
    },
    {
      "verse": "6:84",
      "similarity": 0.48411618224437014
    },
    {
      "verse": "4:163",
      "similarity": 0.3132291681915133
    },
    {
      "verse": "30:33",
      "similarity": 0.15968467162735214
    },
    {
      "verse": "6:17",
      "similarity": 0.15336106390800874
    }
  ]
}