{
  "chapter": "الأنبياء",
  "text": "ومن الشيطين من يغوصون له ويعملون عملا دون ذلك وكنا لهم حفظين",
  "translations": [
    {
      "translation": "And some of the shaytans dived for him and did other things apart from that. And We were watching over them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many of the devils (We also made obedient to him) who dived for him, and did many other things; and We kept watch over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We subdued many devils who dived (into the sea) for him and carried out other jobs besides that. We kept watch over all of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We subdued the devils who would dive into the sea for him and perform other tasks for Solomon. We kept them in his service.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the devils, were those who dived (in water) for him and did works other than this; and We had kept them restrained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the Shayatin were some who dived for him, and did other work besides that; and it was We Who guarded them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the rebellious people there were those who dived for him and did other work besides that, and We kept guard over them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and of the Satans some dived for him and did other work besides; and We were watching over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the evil ones (subdued We unto him) some who dived (for pearls) for him and did other work, and We were warders unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We also subjected to him some of the jinn who dived for him in the sea and performed other tasks; We kept a watch over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the satans were some who dove for him, and worked a work beside that; and of them We were the Watchers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the devils were some who dived for him and performed tasks other than that, and We were watchful over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the evil ones, were some who dived for him, and did other work besides; and it was We Who guarded them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the Shayatin (devils) (from the jinns) were some who dived for him, and did other work besides that; and it was We Who guarded them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of the satans dived for him and others did work as well. We were watching over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the devils were some that dived for him, and performed other, lesser tasks. But We kept them restrained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the devils were those who dived for him and did work other than that. And We were of them a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:82] And, We disposed, of the devils some that dived for him, plunging into the sea and bringing out of it jewels for Solomon, and performed tasks other than that, that is, other than diving, such as building and otherwise. And We were watchful over them, lest they should spoil what they had made, for whenever they completed a task before nightfall, they would [invariably] spoil it, unless they were occupied with some other [task].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of the evil ones) We subdued for him the satans (some who dived for him) into the depth of the sea and brought up pearls for him (and did other work) other than diving in the sea, such as construction, (and We were warders unto them) We prevented that anyone transgresses against another in his time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ومن } شياطين الوهم والتخيّل { من يغوصون له } في بحر الهيولى الجسمانية يستخرجون درر المعاني الجزئية { ويعملون عملاً دون ذلك } من التركيب والتفصيل والمصنوعات وبهيج الدواعي المكسوبات وأمثالها { وكنا لهم حافظين } عن الزيغ والخطأ والتسويل الباطل والكذب",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كذا سخرنا لسليمان { مِنَ ٱلشَّيَاطِينِ مَن يَغُوصُونَ لَهُ } البحار\n ويخرجون منها نفائس الجواهر تتميماً وتوفيراً بخزانته { وَيَعْمَلُونَ } أيضاً { عَمَلاً دُونَ ذٰلِكَ } الغوص من بناء الأبنية الرفعية\n والقصور المنيعة\n واختراع الصنائع البديعة الغريبة والهياكل البديعة والتشكيلات العجيبة { وَكُنَّا لَهُمْ } من قبل سليمان { حَافِظِينَ } [الأنبياء: 82] مشغلين مشرفين إياهم\n لا يمكنهم أن يفسدوا في أعمالهم وأشغالهم ويزيغوها على مقتضى أهويتهم وطباعهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن الشياطين } \n قيل: لمَّا ذكر تسخير الريح - وهي شفافة لا تعقل - ذكر ما هو شفاف يعقل\n وهم الشياطين\n مع سرعة الحركة في الكل\n أي: وسخرنا له من الشياطين { مَن يغوصون } في البحار\n ويستخرجون { له } من نفائسه\n كالدر والياقوت\n { ويعملون عملاً دون ذلك } أي: غير ما ذكر من بناء المدن والقصور والمحاريب والتماثيل والقدور الراسيات\n وقيل: الحمام\n والنورة\n والطاحون\n والقوارير\n والصابون\n مما استخرجوه له\n { وكنا لهم حافظين } أن يزيغوا عن أمره\n أو يُبدلوا\n أو يوجد منهم فساد فيما هم مسخرون فيه\n على ما هو مقتضى جبلتهم\n وقال الزجاج: كان يحفظهم من أن يُفسدوا ما عملوا\n وكان دأبهم أن يُفسدوا بالليل ما عملوه بالنهار\n وقيل: وكَّل بهم جمعًا من الملائكة\n وجمعًا من مؤمني الجن\n رُوي أن المُسَخَّر له عليه السلام: كفارهم\n لا مؤمنهم لقوله تعالى: { ومن الشياطين }\n والله تعالى أعلم\n الإشارة: قوله تعالى: { ففهمناها سليمان } \n قال الورتجبي: بيَّن\n سبحانه\n أن الفضل متعلق بفضله\n لا يتعلق بالصغر والكبر والشيخوخة والاكتساب والتعلم\n إنما الفهم تعريف الله أحكام ربوبيته بنور هدايته\n وإبراز لطائف علومه الغيبية\n فحيث يظهر ذلك فهناك مواضع الفهوم من العلوم\n فهو سبحانه منَّ على سليمان بعلمه\n ولم يمنّ عليه بشيء خارج عن نفسه من الملك\n والحدثان أفضل من العلم فإنَّ العلم صفة من صفاته تعالى\n فلمَّا جعله متصفًا بصفاته منَّ عليه بجلال كبريائه\n هـ\n وقال في قوله: { وكُلاًّ آتينا حُكمًا وعلمًا }: حُكمًا معرفة بالربوبية\n وعلمًا بالعبودية\n هـ\n وقوله تعالى: { وسخرنا مع داود الجبال\n\n\n } الخ\n { ولسليمان الريح\n\n\n } الآية\n لمّا كانا - عليهما السلام - مع المُكَوِّنِ كانت الأكوان معهما\n \" أنت مع الأكوان ما لم تشهد المكون\n فإذا شهدته كانت الأكوان معك \" \n وذكر في القوت: أن سليمان عليه السلام لبس ذات يوم قميصًا رفيعًا جديدًا\n ثم ركب البساط\n وحملته الريح\n فبينما هو يسير إذ نظر إلى عطفه نظرةً\n فأنزلته الريح\n فقال: لِم أنزلتني ولم آمرك؟! فقالت: نطيعك إذا أطعت الله\n ونعصيك إذا عَصَيْتَه\n فاستغفر وحملته\n هـ بالمعنى\n والله تعالى أعلم\n ثمَّ ذكر أيوب عليه السلام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:37",
      "similarity": 0.956964679368888
    },
    {
      "verse": "15:17",
      "similarity": 0.11260764720479015
    },
    {
      "verse": "42:6",
      "similarity": 0.10313954324220263
    },
    {
      "verse": "37:7",
      "similarity": 0.09428156106649241
    },
    {
      "verse": "13:11",
      "similarity": 0.09326568646329952
    }
  ]
}