{
  "chapter": "الأنبياء",
  "text": "فاستجبنا له فكشفنا ما به من ضر وءاتينه اهله ومثلهم معهم رحمة من عندنا وذكرى للعبدين",
  "translations": [
    {
      "translation": "We responded to him and removed from him the harm which was afflicting him and restored his family to him, and the same again with them, as a mercy direct from Us and a Reminder to all worshippers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We heard his cry and relieved him of the misery he was in. We restored his family to him, and along with them gave him others similar to them as a grace from Us and reminder for those who are obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We accepted his prayer and removed the affliction from him, and We not only restored to him his family but as many more with them as a mercy from Us and as a lesson to the worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We answered his prayer, relieved him from his hardships, brought his family (back to him) and gave him twice as much property as that (which was destroyed). It was a mercy from Us and a reminder for the worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore heard his prayer and removed the adversity that had afflicted him, and We gave him his family and in addition bestowed along with them a similar number, by mercy from Ourselves – and an advice for the people who worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered his call, and We removed the distress that was on him, and We restored his family to him, and the like thereof along with them as a mercy from Ourselves and a Reminder for all those who worship Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore We responded to him and took off what harm he had, and We gave him his family and the like of them with them: a mercy from Us and a reminder to the worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him, and removed the affliction that was upon him, and We gave his people, and the like of them with them, mercy from Us, and a Reminder to those who serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We heard his prayer and removed that adversity from which he suffered, and We gave him his household (that he had lost) and the like thereof along with them, a mercy from Our store, and a remembrance for the worshippers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We heard his prayer and relieved his suffering, We restored to him his family, doubling their number as an act of Our grace, and as a reminder for the worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him and We removed that which was with him of the hurt, and We vouchsafed unto him his household and the like thereof along with them, as a mercy from us and a remembrance unto the worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered his prayer and removed his distress, and We gave him [back] his family along with others like them, as a mercy from Us and an admonition for the devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We listened to him: We removed the distress that was on him, and We restored his people to him, and doubled their number,- as a Grace from Ourselves, and a thing for commemoration, for all who serve Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered his call, and We removed the distress that was on him, and We restored his family to him (that he had lost), and the like thereof along with them, as a mercy from Ourselves and a Reminder for all who worship Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We answered him and removed his affliction, and We gave his people, and those like them that were with them, mercy from Us, as a reminder to those who worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him, lifted his suffering, and restored his family to him, and their like with them—a mercy from Us, and a reminder for the worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We responded to him and removed what afflicted him of adversity. And We gave him [back] his family and the like thereof with them as mercy from Us and a reminder for the worshippers [of Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:84] So We responded to him, in his call, and removed the harm that had befallen him, and We gave him [back] his family, his male and female children, by bringing them back to life — of each sex there were three or seven along with them [other children] the like of them, from his wife, for she was made younger. He had also possessed a threshing floor for wheat and another for barley, so God sent two clouds and one of them poured forth gold onto the wheat threshing floor and the other poured forth silver onto the barley threshing floor, until they overflowed; as a mercy (rahmatan, a direct object denoting reason) from Us (min ‘indinā, an adjectival phrase) and a reminder to worshippers, that they be patient and thus be rewarded [by God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We heard his prayer and removed that adversity) the suffering (from which he suffered, and We gave him his household) in Paradise that he had lost in this worldly life (and the like thereof along with them) and gave him children in this world the like of those he lost, (a mercy) a blessing (from Our store, and a remembrance for the worshippers) an admonition for the believers;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱسْتَجَبْنَا لَهُ } دعاءه { فَكَشَفْنَا } عنه { مَا بِهِ مِن ضُرٍّ } مؤلم مزعج { وَ } بعدما شفيناه وأزلنا عنه مرضه { آتَيْنَاهُ أَهْلَهُ } وأحيينا الذين هلكوا بسقوط البيت عليهم\n وأمواله التي تلفت بالحوادث والنوائب { وَ } زدناها امتناناً له وتفضلاً عليه { مِثْلَهُمْ مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا } إياه وزيادة إنعامٍ وإحسان منَّا عليه { وَ } ليكون ما فضلنا به وأعطيناه { ذِكْرَىٰ } تذكرة وحثاً { لِلْعَابِدِينَ } [الأنبياء: 84] الذين صبروا على مشاق التكاليف\n ومتاعب الطاعات والعبادات\n ليفوزوا بأفضل المثوبات\n وأعظم الكرامات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n إلا { رحمةً } امرأته بنت إفراثيم بن يوسف عليه السلام\n فقامت عليه بما يصلحه\n روى أنس أن النبي صلى الله عليه وسلم قال:\n \" إنَّ أيُّوبَ نبي الله لَبث به بَلاؤُه ثَمَانِي عَشْرَةَ سَنَة\n فَرَفَضه الْقَرِيبُ والبَعِيدُ \" \nالحديث\n وقال كعب: سبع سنين\n وقيل: ثلاث عشرة سنة\n وما قاله - عليه الصلاة والسلام - إن ثبت\n هو الصحيح\n وقال الحسن: مكث أيوب مطرودًا على كناسة\n في مزبلة بني إسرائيل سبع سنين وشهرًا\n يختلف فيه الدود\n ويمكن الجمع بين الأقوال بأن الشدة كانت سبعًا والباقي مقدمات لها\n رُوِيَ أن امرأته قالت له يومًا: لو دعوتَ الله عزّ وجلّ؟ فقال لها: كم كانت مدة الرخاء؟ قالت: ثمانين سنة\n فقال: إني أستحيي من الله أن أدعوه وما بلغت مدة بلائي مدة رخائي\n هـ\n ورُوي أن الدود أكل جميع جسده حتى بقي عظامًا نخرة\n وهو مع ذلك لا يفتر عن ذكر الله وحمده وشكره\n فصرخ إبليس صرخة\n وقال: أعياني هذا العبد الذي سألتُ ربي أن يسلطني عليه\n قالت له العفاريت: أرأيت آدم حين أخرجته من الجنة\n ما أتيته إلا من قِبَلِ امرأته\n فتمثل بها بصورة رجل طيب\n وفي رواية الحسن: في هيئة ليست كهيئة بني آدم\n في أحسن صورة\n فقال لها: أين بعلك يا أمة الله؟ فقالت: هو ذاك\n يحك قروحه\n ويتردد الدود في جسده\n فقال لها: أنا إله الأرض الذي صنعتُ بصاحبك ما صنعت لأنه عبد إله السماء وتركني\n فلو سجد لي سجدة واحدة لرددت لكما ما كان لكما\n\nوقال وهب: قال لها: لو أكل طعامًا ولم يسمّ عليه لعُوفيَ من البلاء\n فأخبرت أيوب\n فقال: أتاك عدوُ الله ليفتنك عن دينك\n ثم أقسم\n إن عافه الله\n ليضربنها مائة ضربة\n ثم حلف لا يأكل لها طعامًا\n فبقي مهملاً لا يأتي إليه أحد\n وقال عند ذلك: { مسّني الضر } من طمع إبليس في سجودي له\n { وأنت أرحم الراحمين } \n فقيل له: { اركض برجلك } فركض\n فنبعت عين ماء\n فاغتسل منها\n فلم يبق من دائه شيء\n وسقطت الدود من جسده\n وعاد شبابه وجماله\n ثم ضرب برجله فنبعت عين أخرى\n فشرب منها\n فلم يبق في جوفه داء إلا خرج\n وكانت امرأته \" رحمة \" حين حلف\n تركته مدة\n ثم ندمت وعادت\n فوجدته في أحسن هيئة\n فلم تعرفه\n فقالت له: أين الرجل المبتلى الذي كان هنا؟ قال: أنا هو\n شفاني الله\n ثم عرفته بضحكه\n فتعانقا\n ثم أمره الله تعالى أن يأخذ جماعة من القضبان فيضربها ضربة واحدة ليبرّ في يمينه\n هـ\n قلت: تسليط الشيطان على بشرية الأنبياء الظاهرة: جائز وواقع\n وأما الأمراض المنفرة\n فإن كانت بعد التبليغ وتقرير الشرائع\n فجائز عند بعضهم\n وهو الصواب\n جمعًا بين ما ثبت في الأخبار عن السلف وبين الدلائل العقلية في تنزيه الأنبياء - عليهم السلام -\n لأن العلة هي تنفير الخلق عنهم\n وبَعْد التبليغ فلا يضر\n وقد ورد أن شُعيبًا عليه السلام عَمى في آخر عمره\n وكذلك يعقوب\n وكان بعد تبليغ الرسالة\n فلم يضر\n ثم قال تعالى في حق أيوب عليه السلام: { فاستجبنا له فكشفنا ما به من ضُرّ } إنعامًا عليه\n فلمّا قام من مرضه جعل يلتفت فلا يرى شيئًا مما كان له من الأهل\n والمال\n ثم أحيا الله أولاده بأعيانهم\n ورزقه مثلهم\n ورد عليه ماله\n بأن أخلف له مثله\n وذلك قوله تعالى: { وآتيناه أهلَه ومثلهم معهم } وقيل: كان ذلك بأن ولد له ضعف ما كان له\n وقال عكرمة: آتيناه أهله في الآخرة\n ومثلهم معهم في الدنيا\n والأول هو ظاهر الآية\n ردهم الله تعالى بأعيانهم إظهارًا لكمال قدرته تعالى\n  ثم قال { رحمةً من عندنا }: مفعول من أجله\n أي: آتينا ما ذكر لرحمتنا أيوب\n { وذكرى للعابدين } أي: وتذكرة لغيره من العابدين ليصبروا كما صبر\n ويُثابوا كما أُثيب\n أو لرحمتنا العابدين\n الذين من جملتهم أيوب\n وذكرنا إياهم بالإحسان\n وعدم نسياننا لهم\n\nوالله تعالى أعلم\n الإشارة: ما ينزل بالمؤمن من الأوجاع والأسقام والشدائد والنوائب\n في النفس أو في الأهل\n كله رحمة\n عظيمة\n ومنَّة جسيمة\n ويقاس عليه: مفارقة الأحباب والأوطان ومشاق الأسفار والمتاعب البدنية\n ويُسمى عند الصوفية: التعرفات الجلالية لأن الله تعالى يتعرف إليهم بها ليعرفوه عيانًا\n ولذلك تجدهم يفرحون بها\n وينبسطون عند ورودها لما يتنسمون فيها\n ويجدون بعدها\n من مزيد الاقتراب وكشف الحجاب\n وطي مسافة البُعد بينهم وبين رب الأرباب\n فهم يؤثرونها على الأعمال الظاهرة لِمَا يتحققون بها من وجود الأعمال الباطنية كالصبر والزهد والرضا والتسليم\n وما ينشأ عنها\n عند ترقيق البشرية\n من تشحيذ الفكرة والنظرة\n وغير ذلك من أعمال القلوب\n وفي الحكم: \" إذا فتح لك وجهة من التعرف\n فلا تُبالي معها إن قلَّ عملك فإنه ما فتحها لك إلاَّ وهو يريد أن يتعرف إليك منها\n ألم تعلم أن التعرف هو مورده عليك\n والأعمال أنت مهديها إليه\n وأين ما تهديه إليه مما هو مورده عليك؟ \"\n قال الشيخ ابن عباد رضي الله عنه: معرفة الله تعالى هي غاية المطالب\n ونهاية الأماني والمآرب\n فإذا واجه اللهُ عبده ببعض أسبابها\n وفتح له باب التعرّف له منها\n فذلك من النعم الجزيلة عليه\n فينبغي ألا يكترث بما يفوته بسبب ذلك من أعمال البر\n وما يترتب عليها من جزيل الأجر\n وليعلم أنه سلك به مسلك الخاصة المقرّبين\n المؤدي إلى حقائق التوحيد واليقين\n من غير اكتساب من العبد ولا تَعَمُّلٍ\n والأعمالُ التي من شأنها أن يتلبس بها هي باكتسابه وتعمله\n وقد لا يسلم من دخول الآفات عليها\n والمطالبة بوجود الإخلاص فيها\n وقد لا يحصل له ما أمّله من الثواب عند مناقشة الحساب\n وأين أحدهما من الآخرة\n ومثاله: ما يُصاب به الإنسان من البلايا والشدائد التي تُنَغِّصُ عليه لذات الدنيا\n وتمنعه من كثير من أعمال البر\n فإنَّ مرادَ العبد أن يستمر بقاؤه في الدنيا\n طيَّبَ العيش ناعمَ البال\n ويكون حاله في طلب سعادة الاخرة حال المترفين فلا تسخو نفسه إلا بالأعمال الظاهرة\n التي لا كثير مُؤْنَةٍ عليه فيها ولا مشقة\n ولا تقطع عنه لذة\n ولا يفوته شهوة\n ومراد الله منه أن يُطهره من أخلاقه اللئيمة\n ويحول بينه وبين صفاته الذميمة\n ويُخرجه من أَسْرِ وجوده إلى متسع شهوده\n ولا سبيل إلى الوصول إلى هذا المقام على غاية الكمال والتمام\n إلا بما يُضادُ مراده\n ويشوّش عليه معتادَه\n وتكون حاله حينئذ المعاملة بالباطن\n ولا مناسبة بينها وبين الأعمال الظاهرة\n فإذا فَهِمَ هذا عَلِمَ أن اختيار الله له\n ومرادَه منه\n خيرٌ من اختياره لنفسه ومراده لها\n\nوقد رُوِيَ أن الله تعالى أوحى إلى بعض أنبيائه:\n \" إني إذا أنزلت بعبدي بلائي\n فدعاني\n فماطلتُه بالإجابة\n فشكاني\n قلت: عبدي كيف أرحمك من شيء به أرحمك \" \n؟ وفي حديث أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال:\n \" قال الله تعالى: إذا ابتليت عبدي المؤمن فلم يشكني إلى عُوّاده\n أنشطته من عقالي\n وبدَّلته لحمًا خيرًا من لحمه\n ودمًا خيرًا من دمه\n ويستأنف العمل \" \nثم نقل عن أبي العباس ابن العريف رضي الله عنه قال: كان رجل بالمغرب يُدعى أبا الخيَّار\n وقد عمّ جسده الجذامُ\n ورائحة المسك تُوجد منه على مسافة بعيدة\n لقيه بعضُ الناس\n فقال له: يا سيدي كأن الله تعالى لم يجد للبلاء مَحلاً من أعدائه حتى أنزله بكم\n وأنتم خاصة أوليائه!! فقال لي: اسكت\n لا تقل ذلك لأنا لمّا أشرفنا على خزائن العطاء\n لم نجد عند الله أشرف ولا أقرب من البلاء\n فسألناه إِيّاه\n وكيف بك لو رأيت سيّد الزهّاد\n وقطبَ العباد\n وإمام الأولياء والأوتاد\n في غار بأرض طرطوس وجبالها\n ولحمُه يتناثر\n وجلده يسيل قيحًا وصديدًا\n وقد أحاط به الذباب والنمل\n فإذا كان الليل لم يقنع بذكر الله وشكره على ما أعطاه من الرحمة\n حتى يشدّ نفسه بالحديد\n ويستقبل القبلة عامَّةَ ليله حتى يطلع الفجر\n هـ\n وقد تكلم الصوفية في قول أيوب عليه السلام: { مسّني الضر } هل شكى ضرر جسمه\n أو ضرر قلبه من جهة دينه؟ قال بعضهم: قيل: إنه أراد النهوضِ إلى الصلاة فلم يستطع\n فقال: { مسّني الضر } \n وقيل: إنه أكل الدود جميع جسده\n حتى بقي عظامًا\n فلما قصد الدودُ قلبَه ولسانَه غار على قلبه لأنه موضع المعرفة والتوحيد\n والنبوة والولاية\n وأسرار الله تعالى\n وخاف انقطاع الذكر\n فقال: { مسّني الضر } \n وقيل: خاف تبدد همه وتفرق قلبه\n وليس في العقوبة شيء أشد من تبدد الهم\n فتارة يقول: لعلي ببلائي مُعاقب\n وتارة يقول: بضري مُستدرج\n فلما خاف تشتيت خاطِره عليه\n قال: { مسّني الضر }\n هـ\n قلت: هذا المقام لا يليق بالأنبياء\n وإنما يجوز على غيرهم إذ الأولياء يترقون عن هذا المقام فكيف بالأنبياء! وقال بعضهم: قال: مسني الضر من شماتة الأعداء\n واقتصر عليه ابنُ جُزي\n وفيه شيء إذ كثير من الأولياء سقط الناس من عينهم\n فلا يُبالون بخيرهم ولا شرهم\n ولا مدحهم ولا ذمهم\n فكيف بالأنبياء - عليهم السلام -؟! وقال القشيري \" كان ذلك منه إظهارًا للعجز\n لا اعتراضًا\n فلا يُنافي الصبر\n مع ما فيه من التنفيس عن الضعفاء من الأمة\n ليكون أسوة\n وقال: إن جبريل أمره بذلك\n وقال له: إن الله يغضبُ إن لم يُسأل\n وسيان عنده البلاء والعافية\n فسَله العافية\n\nويقال: إن أيوب كان مُكَاشَفًا بالحقيقة\n مأخوذًا عنه\n وكان لا يُحِسُّ بالبلاء\n فَسَتَر عليه\n فردَّه إليه\n فقال: مَسني الضُّرُّ\n وقيل: أَدْخَل على أيوب تلك الحالة\n فاستخرج منه تلك المقالة ليظهر عليه سمة العبودية\n هـ\n وقال الورتجبي: سُئل الجنيد عن قوله: { مسّني الضر } \n فقال عرّفه فاقة السؤال\n ليمنّ عليه بكرم النوال\n وفي الحديث المروي عن النبي صلى الله عليه وسلم: أنه جاء إليه رجل فسأله عن قول أيوب { مسّني الضر } فبكى - عليه الصلاة والسلام - وقال: والذي بعثني بالحق نبيًا ما شكى فقرًا نزل من ربه\n ولكن كان في بلائه سبع سنين وسبعة أشهر وسبعة أيام وسبع ساعات\n فلما كان في بعض الساعات وثب ليُصلي\n فلم يستطع النهوض\n فقال: { مسني الضر } الخ\n ثم قال: - عليه الصلاة والسلام -: أكل الدود عامة جسده حتى بقي عظامًا نخرة\n فكادت الشمس تطلع من قُبله وتخرج من دُبره\n وما بقي إلا قلبه ولسانه\n وكان قلبه لا يخلو من ذكر الله\n ولسانه لا يخلو من ثنائه على ربه\n فلما أحب الله له الفرج\n بعث إليه الدودتين إحداهما إلى لسانه والأخرى إلى قلبه\n فقال: يا رب ما بقي إلا هاتان الجارحتان\n أذكرك بهما\n فأقبلت هاتان الدودتان إليهما ليشغلاني عنك ويطلعان على سري\n مسني الضر وأنت أرحم الراحمين\n هـ\n وفي قوله تعالى: { رحمة من عندنا وذكرى للعابدين }: تسلية لمن أصيب بشيء من هذه التعرفات الجلالية\n وقد تقدم في أول الإشارة الكلام على هذا\n والله تعالى أعلم\n ثمَّ ذكر ما بقي من مشاهير الأنبياء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:62",
      "similarity": 0.7049971510455068
    },
    {
      "verse": "16:54",
      "similarity": 0.5739903316674836
    },
    {
      "verse": "6:17",
      "similarity": 0.5537142825311978
    },
    {
      "verse": "44:12",
      "similarity": 0.529350557457732
    },
    {
      "verse": "53:58",
      "similarity": 0.5042319102634548
    }
  ]
}