{
  "chapter": "الأنبياء",
  "text": "وايوب اذ نادى ربه انى مسنى الضر وانت ارحم الرحمين",
  "translations": [
    {
      "translation": "And Ayyub when he called out to his Lord, 'Great harm has afflicted me and You are the Most Merciful of the merciful,'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) Job when he called to his Lord: \"I am afflicted with distress, and You are the most compassionate of all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed (the same wisdom, judgement and knowledge) upon Job. Recall, when he cried to his Lord: \"Behold, disease has struck me and You are the Most Merciful of those that are merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Job prayed, \"Lord, I have been afflicted with hardships. Have mercy on me; You are the Most Merciful of those who have mercy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Ayyub (Job), when he called his Lord that, “Hardship has afflicted me, and You are the Most Merciful of all those who have mercy.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Ayyub, when he cried to his Lord: \"Verily, distress has seized me, and You are the Most Merciful of all those who show mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ayub, when he cried to his Lord, (saying): Harm has afflicted me, and Thou art the most Merciful of the merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Job -- when he called unto his Lord, 'Behold, affliction has visited me, and Thou art the most merciful of the merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Job, when he cried unto his Lord, (saying): Lo! adversity afflicteth me, and Thou art Most Merciful of all who show mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Job when he called on his Lord saying, \"I have been afflicted with great distress: but You are the most merciful of the merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ayyub! recall what time he cried unto his Lord: verily hurt hath touched me, and Thou art the Most Merciful of the mercifuls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] Job, when he called out to his Lord, ‘Indeed distress has befallen me, and You are the most merciful of the merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Job, when He cried to his Lord, \"Truly distress has seized me, but Thou art the Most Merciful of those that are merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) Ayub (Job), when he cried to his Lord: \"Verily, distress has seized me, and You are the Most Merciful of all those who show mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Job when he called to his Lord: 'Affliction has befallen me, and You are the Most Merciful of the merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Job, when he cried out to his Lord: “Great harm has afflicted me, and you are the Most Merciful of the merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] Job, when he called to his Lord, \"Indeed, adversity has touched me, and you are the Most Merciful of the merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:83] And, mention, Job (Ayyūba, is substituted by [the following, idh nādā rabbahu …]) when he called out to his Lord — after he had been afflicted with the loss of all of his possessions and children, the laceration of his body, his being shunned by all except his wife, for a period of thirteen, seventeen, or eighteen years, as well as [the affliction of enduring] a straitened means of livelihood — ‘Indeed (read annī because of the implicit yā’ [of the first person pronoun]) harm, adversity, has befallen me, and You are the Most Merciful of the merciful’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Job) and mention Job, (when he cried unto his Lord) when he prayed to his Lord, ((saying): Lo! adversity afflicteth me) suffering has visited my body, so have mercy on me and deliver me, (and Thou art Most Merciful of all who show mercy).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأيوب } النفس المطمئنة الممتحنة بأنواع البلاء في الرياضة البالغة كمال الزكاء في المجاهدة { إذ نادى ربّه } عند شدّة الكرب في الكدّ وبلوغ الطاقة والوسع في الجدّ والجهد { أني مسّني الضرّ } من الضعف والانكسار والعجز { وأنت أرحم الراحمين } بالتوسعة والروح { فاستجبنا له } بروح الأحوال عن كدّ الأعمال عند كمال الطمأنينة ونزول السكينة { وكشفنا ما به من ضرّ } الرياضة بنور الهداية ونفسنا عنه ظلمة الكرب بإشراق نور القلب { وآتيناه أهله } القوى النفسانية التي ملكناها وأمتناها بالرياضة بإحيائها بالحياة الحقيقية { ومثلهم معهم } من إمداد القوى الروحانية وأنوار الصفات القلبية ووفرنا عليهم أسباب الفضائل الخلقية وأحوال العلوم النافعة الجزئية { رحمة من عندنا وذكرى للعابدين }\n { وذا النون } أي: الروح الغير الواصل إلى رتبة الكمال { إذ ذهب } بالمفارقة عن البدنية { مغاضباً } عن قومه\n القوى النفسانية لاحتجابها وإصرارها على مخالفته وإبائها واستكبارها عن طاعته { فظن أن لن نقدر عليه } أي: لن نستعمل قدرتنا فيه بالابتلاء بمثل ما ابتلي به\n أو: لن نضيق عليه\n فالتقمه حوت الرحمة لوجوب تعلّقه بالبدن في حكمتنا للاستعمال { فنادى } في ظلمات المراتب الثلاث من الطبيعة الجسمانية والنفس النباتية والحيوانية بلسان الاستعداد { أن لا إله إلا أنت } فأقرّ بالتوحيد الذاتي المركوز فيه عند العهد السابق وميثاق الفطرة والتنزيه المستفاد من التجرّد الأول في الأزل بقوله: { سبحانك } واعترف بنقصانه وعدم استعمال العدالة في قومه فقال: { إني كنت من الظالمين فاستجبنا له } بالتوفيق بالسلوك والتصبير بنور الهداية إلى الوصول { ونجيناه } من غمّ النقصان والاحتجاب بنور التجلي ورفع الحجاب { وكذلك ننجي المؤمنين } بالإيمان التحقيقي الموقنين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل أخاك { أَيُّوبَ } الذي ابتلاه الله بأنواع المحن والبلاء\n فصبر عليها فازداد ألمه\n واشتد الأمر عليه واضطر إلى التضرع والتفزع\n وبثِّ الشكوى إلى الله\n اذكر { إِذْ نَادَىٰ رَبَّهُ } مشتكياً إليه\n مناجياً له\n متضرعاً إياه قائلاً { أَنِّي مَسَّنِيَ ٱلضُّرُّ } يا رب\n وتنحّوا عني أقاربي وذوو أرحامي وجميع رحمائي { وَأَنتَ } تبقى عليّ رحيماً مشفقاً\n لأنك { أَرْحَمُ ٱلرَّاحِمِينَ } [الأنبياء: 83] فأدركني بلطفك\n إذ لا طاقة لي ولا صبر بعد اليوم\n وقد بلغ الجهد غياته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { و } اذكر خبر { أيوبَ } عليه السلام { إِذْ نادى ربَّه }: دعاه: { إني } أي: بأني { مسَّنيَ الضرُّ } وهو بالضم: ما يصيب النفس من مرض وهزال\n وبالفتح: الضرر في كل شيء\n { وأنت أرحمُ الراحمين } \n تلطف في السؤال حيث ذكر نفسَه بما يوجب الرحمة\n وذكر ربه بغاية الرحمة\n ولم يصرح بالمطلوب من كمال أدبه\n فكأنه قال: أنت أهل أن تَرحم\n وأيوب أهل أن يُرحَم\n فارحمه\n واكشف عنه ضره الذي مسه\n عن أنس: أنه أخبر عن ضعفه حين لم يقدر على النهوض إلى الصلاة\n ولم يشتك\n وكيف يشكو\n والله تعالى يقول:\n[ص: 44]\n وقيل: إنما اشتكى إليه تلذذًا بالنجوى\n لا تضررًا بالشكوى\n والشكاية إليه غاية في القُرب\n كما أن الشكاية منه غاية في البُعد\n وسيأتي في الإشارة تكميله\n إن شاء الله\n رُوي أن أيوب عليه السلام\n كان من الروم\n وهو أيوب بن أمُوص ابن تارَح بن رعويل بن عيص بن إسحاق\n وكانت أمه من ولد لوط عليه السلام اصطفاه الله للنبوة والرسالة\n وبسط عليه الدنيا فكان له ثلاثة آلاف بعير\n وسبعة آلاف شاة\n وخمسمائة فدان\n يتبعها خمسمائة عبد\n لكل عبد امرأة وولد\n وكان له سبعة بنين\n وسبع بنات\n قاله النسفي\n زاد الثعلبي: وكانت له المشيئةُ من أرض الشام كلها\n وكان له فيها من صنوف المال ما لم يكن لأحد من الخيل والبقر والغنم والحُمُر وغيره\n وكان برًا تقيًا رحيمًا بالمساكين\n يكفل الأرامل والأيتام\n ويُكرم الضيف\n ويُبلغ ابن السبيل\n شاكرًا لأنعم الله\n لا يصيب منه إبليس ما يصيب من أهل الغنى من الغفلة والغِرَّة\n وكان معه ثلاثةً قد آمنوا به: رجل من اليمن واثنان من بلده\n كُهُولا\n قال وهب: فسمع إبليس تَجَاوُبَ الملائكة بالصلاة عليه في السماء فحسده\n فقال: إلهي\n عبدك أيوب أنعمتَ عليه فشكرك\n وعافيته فحمدك\n ولم تجرّبه بشدّة ولا بلاء\n فلو جربته بالبلاء ليكفرنّ بك وبنعمتك\n فقال له تعالى: انطلق\n فقد سلطتك على ماله\n فجمع عفاريته وأخبرهم\n فقال عفريت من الجن: أُعطيتُ من القوة ما إذا تحوّلت إعصارًا من نار أحرقتُ كل شيء آتي عليه\n فقال له إبليس: دونك الإبل ورعاتها\n فجاءها حتى وثبت في مراعيها\n فأثار من تحت الأرض إعصارًا من نار فأحرقها وأحرق رعاءها\n فلما فرغ منها تمثل إبليس براعيها\n وجلس على قَعُودٍ منها\n فأتاه\n وقال: يا أيوب\n إن ربك الذي عبدته قد أحرق إبلك ورُعَاءَها\n فقال أيوب: هو ماله\n أعارنيه\n يفعل فيه ما يشاء\n فرجع إبليس خاسئًا\n حين حمد أيوبُ ربه\n فقال عفريت آخر: عندي من القوة ما إذا صِحتُ لم يسمع صوتي ذو رُوح إلا خرجت روحه\n قال له إبليس: ائت الغنم ورعاءَها\n فأتى\n فصاح\n فصارت أمواتًا ورعاتها\n ثم خرج إبليس متمثلاً بقهرَمَان الرعاة\n فقال له كمقالته في الإبل\n فأجابه أيوب بمثل ما أجابه فيها\n فرجع خاسئًا\n فقال عفريت آخر: عندي من القوة ما إذا تحولتُ ريحًا عاصفًا نسفتُ كل شيء أتيت عليه\n قال إبليس: فأتِ الفدادين والحرث\n فجاءها\n فَهبَّتْ ريح عاصفة فنسفت كل شيء\n حتى كأنه لم يكن ثَمَّ شيء\n فخرج إبليس متمثلاً بقهْرَمَان الحرث\n فقال له مثل قوله الأول\n وردَّ عليه مثل رده\n حتى أتى على جميع ماله\n وأيوب يحمد الله تعالى\n\nفقال إبليس: إلهي إن أيوب يقول: إنك ما متعْتَهُ إلا بنفسه وولده\n فهل تسلطني على ولده\n فإنها الفتنة؟ قال الله تعالى: قد سلطتك على ولده\n فجاء إبليس فقلب عليهم القصر منكسين\n وانطلق إلى أيوب متمثلاً بالمُعلم الذي يُعلمهم الحكمة\n وهو جريح\n فقال: يا أيوب لو رأيت بنيك كيف عُذبوا؟ ونُكِّسوا على رؤوسهم\n وسال دماغهم من أنوفهم\n فلم يزل من قوله حتى رقَّ أيوبُ وبكى\n وقبض قبضة من التراب فوضعها على رأسه\n فصعد إبليس مسرورًا\n ثم ذهب أيوب\n فلما أبصر ذلك استغفر\n وصعد قرناؤه من الملائكة\n بتوبته فبادروا إلى الله تعالى\n وهو أعلم\n فوقف إبليس خاسئًا\n فقال: إلهي إنما هوّن أيوب خطر المال والولد\n فهل أنت مسلطي على جسده\n فإني لك زعيم إن سَلَّطَّني على جسده ليكفرنّ بك\n قال الله تعالى: قد سلطتك على جسده\n ولكن ليس لك سلطان على لسانه وقلبه وعقله\n فجاءه إبليس فوجده ساجدًا\n فجاء من قِبل الأرض\n فنفخ في منخره نفخة اشتعل منها جسده\n فَوهِلَ\n وخرج من قرنه إلى قدمه تآليل مثل آليَاتِ الغنم\n ووقعت به حكة لا يملكها\n فحك بأظفاره\n ثم بالمسُوح الخشنة\n ثم بالحجارة\n حتى نغل لحمه\n وتغير\n ونش\n وتدود\n فأخرجه أهل القرية\n وجعلوه على كناسة\n وجعلوا له عريشًا\n ورفضه الخلق كلهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:41",
      "similarity": 0.8854082181458091
    },
    {
      "verse": "6:84",
      "similarity": 0.48411618224437014
    },
    {
      "verse": "4:163",
      "similarity": 0.3132291681915133
    },
    {
      "verse": "30:33",
      "similarity": 0.15968467162735214
    },
    {
      "verse": "6:17",
      "similarity": 0.15336106390800874
    }
  ]
}