{
  "chapter": "الأنبياء",
  "text": "فاستجبنا له ونجينه من الغم وكذلك نۨجى المؤمنين",
  "translations": [
    {
      "translation": "We responded to him and rescued him from his grief. That is how We rescue the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We heard his cry, and saved him from the anguish. That is how We deliver those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon We accepted his prayer, and rescued him from grief. Thus do We rescue the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We answered his prayer and saved him from his grief. Thus We save the faithful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore heard his prayer and rescued him from grief; and similarly We shall rescue the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered his call, and delivered him from the distress. And thus We do deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We responded to him and delivered him from the grief and thus do We deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him, and delivered him out of grief; even so do, We deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then we heard his prayer and saved him from the anguish. Thus we save believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We heard his prayer and delivered him from sorrow. Thus shall We deliver the true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him, and We delivered him from the distress, and Thus do We deliver the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered his prayer and delivered him from the agony; and thus do We deliver the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We listened to him: and delivered him from distress: and thus do We deliver those who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered his call, and delivered him from the distress. And thus We do deliver the believers (who believe in the Oneness of Allah, abstain from evil and work righteousness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We heard his prayer and saved him from grief. As such We shall save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him, and saved him from the affliction. Thus We save the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We responded to him and saved him from the distress. And thus do We save the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:88] So We responded to him and delivered him from the distress, by [means of] those words, and thus, in the same way that We delivered him, We deliver the believers, from their anguish when they call out to Us seeking succour.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We heard his prayer and saved him from the anguish) and We saved him from the pit of darkness. (Thus We save believers) when they call upon Us. 359\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا يليق لشأنك { إِنِّي } بواسطة خروجي عن قومي بغير إذنك ووحيك\n مع أنك أرسلتني إليهم\n وبعثتني بين أظهرهم نبيّاً ذا دعوة وهداية { كُنتُ مِنَ ٱلظَّالِمِينَ } [الأنبياء: 87] الخارجين عن مقتضى حكمك وأمرك\n لذلك ضيقتَ الأمر عليّ يا ربي\n وحبستني ولا مخلص لي من هذا المضيق إلا عفوك وكرمك\n\nوبعدما تاب إلينا\n وتوجه نحونا مخلصاً متضرعاً\n واستخلص منا مضطرباً مضطراً { فَٱسْتَجَبْنَا لَهُ } وأجبنا دعاءه فأخرجناه من بطن الحوت { وَنَجَّيْنَاهُ مِنَ ٱلْغَمِّ } العظيم والكرب الكبير { وَكَذٰلِكَ نُنجِـي } عموم { ٱلْمُؤْمِنِينَ } [الأنبياء: 88] المخلصين الذين أخلصوا في إنابتهم ورجوعهم نحوننا من كروبهم وأحزانهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاستجبنا له } أي: أجبنا دعاءه الذي دعا في ضمن الاعتراف بالذنب على ألطف وجه وأحسنه\n عن رسول الله صلى الله عليه وسلم:\n\n \" مَا مِنْ مَكْرُوبٍ يَدْعُو بِهَذا الدُّعَاءِ إلاّ اسْتُجِيبَ لَهُ \" \n\n{ ونجيناه من الغم }: الذلة والوحشة والوحدة، وذلك بأن قذفه الحوت إلى الساحل بعد أربع ساعات، وقيل: بعد ثلاثة أيام، { وكذلك نُنجي المؤمنين } أي: مثل ذلك الإنجاء الكامل نُنجي المؤمنين من غمومهم، إذا دعوا الله، مخلصين في دعائهم\n وعنه صلى الله عليه وسلم أنه قال:\n\n \" اسم الله الذي إذا دُعي به أجب، وإذا سُئل به أعطى \" \n\nدعوة يونس بن متى، قيل: يا رسول الله، أليونس خاصة؟ قال:\n\n \" بل هي عامة لكل مؤمن، ألم تسمع قول الله تعالى: { وكذلك ننجي المؤمنين } \" \n\nوهنا قراءات في { نُنجي } ، مذكورة في كتب القراءات، تركتها لطول الكلام فيها\n الإشارة: من تحققت له سابقة العناية لا تُبعده الجناية، ولا تُخرجه عن دائرة الولاية، بل يؤدب في الدنيا بالابتلاء في بدنه أو ماله، على قدر الجناية وعلو المقام، ثم يُرد إلى مقامه\n وها هنا حكايات للصوفية - رضي الله عنهم - من هذا النوع، مِنْهَا: حكاية خير النساج رضي الله عنه، قيل له: أكان النسج صنعتك؟ قال: لا، ولكن كنتُ عاهدت الله واعتقدت ألا آكل الرطب، فغلبتني نفسي واشتريت رطلاً منه، فجلستُ لآكله، فإذا رجل وقف عليّ، وخنقني، وقال: يا عبد السوء، أتهرب من مولاك - وكان له عبد اسمه: \" خير \" أَبَقَ مِنْه، أَلقى الله شبهه عليَّ - فحملني إلى حانوته، وقال: اعمل عملك، أمرني بعمل الكرباس - وهو القطن - فدليت رجلي لأنسجه، فكأني كنت أعمله سنين، فبقيت معه أشهرًا، فقمتُ ليلة إلى صلاة الغداة، وقلت: إلهي لا أعود، فأصبحت، فإذا الشبه قد زال عني، وعُدتُ إلى صورتي التي كُنتُ عليها، فأُطلقت، فثبت عليّ هذا الاسم، فكان سببُه اتباع شهوتي\n ومنها قضية أبي الخير العسقلاني رضي الله عنه قال: اشتهيتُ السمك سنين، ثم ظهر له من وجه حلال، فلما مد يده ليأكل، أخذت شوكة من عظامه إصبعَه، فذهبت في ذلك، فقال: إلهي هذا لمن مد يده لشهوة من حلال، فكيف بمن مد يده لشهوة من حرام\n\n\nومنها: قضية إبراهيم الخواص رضي الله عنه قال: كنت جائعًا في الطريق، فوافيت الرِّي - اسم بلدة - فخطر ببالي أن لي بها معارف، فإذا دخلتها أضافوني وأطعموني، فلمَّا دخلت البلد رأيت فيها مُنكرًا احتجت أن آمر فيه بالمعروف، فأخذوني وضربوني، فقلتُ في نفسي: من أين أصابني هذا، على جوعي؟ فنُوديت في سري: إنك سكنت إلى معارفك بقلبك، ولم تسكن إلى خالقك\n وأمثال هذا كثير بأهل الخصوصية، يُؤدبون على أقل شيء من سوء الأدب لشدة قربهم، ثم يُردون إلى مقامهم\n ومن هذا النوع قصة سيدنا يونس عليه السلام حيث خرج من غير إذن خاص، فأدَّبه، ثم رده إلى النبوة والرسالة، وقد كنتُ سمعت من بعض الأشياخ أن أيوب عليه السلام إنما أصيب في ماله، لأنه كان بجوار ماله كافر، فكان يداريه لأجل ماله، فأصيب فيه وفي بدنه تأديبًا وتكميلاً له\n و الله تعالى أعلم\n ثمَّ ذكر زكريا عليه السلام\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:25",
      "similarity": 0.6681413788464012
    },
    {
      "verse": "2:210",
      "similarity": 0.5887942516323811
    },
    {
      "verse": "10:71",
      "similarity": 0.526208416684681
    },
    {
      "verse": "22:22",
      "similarity": 0.4877774940412377
    },
    {
      "verse": "2:57",
      "similarity": 0.28254955890195405
    }
  ]
}