{
  "chapter": "الأنبياء",
  "text": "فاستجبنا له ووهبنا له يحيى واصلحنا له زوجه انهم كانوا۟ يسرعون فى الخيرت ويدعوننا رغبا ورهبا وكانوا۟ لنا خشعين",
  "translations": [
    {
      "translation": "We responded to him and gave him Yahya, restoring for him his wife's fertility. They outdid one another in good actions, calling out to Us in yearning and in awe, and humbling themselves to Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We heard him and gave him John, and cured his wife (of barrenness). These were men who vied in good deeds with one another, and prayed to Us with love and awe, and were meek before Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We accepted his prayer and bestowed upon him John, and We made his wife fit (to bear a child). Verily they hastened in doing good works and called upon Us with longing and fear, and humbled themselves to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We answered his prayer and granted him his son, John, by making his wife fruitful. They were people who would compete with each other in good deeds and pray to Us with love and reverence. With Us they were all humble people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore heard his prayer; and bestowed him Yahya, and cured his wife for him; indeed they used to hasten to perform good deeds, and pray to Us with hope and fear; and used to weep before Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered his call, and We bestowed upon him Yahya, and cured his wife for him. Verily, they used to hasten on to do good deeds, and they used to call on Us with hope and fear, and they were Khashi`in before Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We responded to him and gave him Yahya and made his wife fit for him; surely they used to hasten, one with another In deeds of goodness and to call upon Us, hoping and fearing and they were humble before Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him, and bestowed on him John, and We set his wife right for him; truly they vied with one another, hastening to good works, and called upon Us out of yearning and awe; and they were humble to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We heard his prayer, and bestowed upon him John, and adjusted his wife (to bear a child) for him. Lo! they used to vie one with the other in good deeds, and they cried unto Us in longing and in fear, and were submissive unto Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We heard his prayer and bestowed John upon him and made his wife fit to bear him a child. They used to hasten to do good and they called on Us in hope and fear, and they were always humble towards Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him, and We bestowed on him Yahya and We made sound for him his spouse. Verily they Were wont to vie with one anot her in good deeds and to call upon us with longing and dread, and they were ever before us meek.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered his prayer, and gave him John, and cured for him his wife [of infertility]. Indeed, they were active in [performing] good works, and they would supplicate Us with eagerness and awe and were humble before Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We listened to him: and We granted him Yahya: We cured his wife's (Barrenness) for him. These (three) were ever quick in emulation in good works; they used to call on Us with love and reverence, and humble themselves before Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered his call, and We bestowed upon him Yahya (John), and cured his wife (to bear a child) for him. Verily, they used to hasten on to do good deeds, and they used to call on Us with hope and fear, and used to humble themselves before Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him, and gave him John, curing his wife (of sterility). They raced with each other in good works and called on Us out of yearning and awe, and they were humble to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We answered him, and gave him John. And We cured his wife for him. They used to vie in doing righteous deeds, and used to call on Us in love and awe, and they used to humble themselves to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We responded to him, and We gave to him John, and amended for him his wife. Indeed, they used to hasten to good deeds and supplicate Us in hope and fear, and they were to Us humbly submissive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:90] So We responded to him, in his call, and gave him John, as a son, and We restored [fertility to] his wife for him, and so she bore a child, having been barren. Truly they, those prophets that have been mentioned, would hasten to, [they would] hurry [to perform], good works, [namely] acts of obedience, and supplicate Us out of desire, for Our mercy, and in awe, of Our chastisement, and they were submissive before Us, humble in their worship.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We heard his prayer, and bestowed upon him John) a righteous son, (and adjusted his wife for him) by bearing a son for him. (Lo! They) i.e. the prophets; and it is also said that they refer to Zachariah and John (used to vie one with the other in good deeds) they used to hasten to acts of obedience (and they cried unto Us in longing and in fear) they used to pray to us out of longing and fear; it is also said that this means: they used to worship Us out of longing for Paradise and fear from hell, (and were submissive unto Us) and they were humble and obedient.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَصْلَحْنَا لَهُ زَوْجَهُ } يقال: إنّه كَان في خُلقِها بَذاءٌ\n\n\n\n\nوقوله تعالى: { رَغَباً وَرَهَباً } معناه رَغبَ فِيما عِندنا, ورَهبَ منّا\n\n\n\n\nوقوله تعالى: { وَكَانُواْ لَنَا خاشِعِينَ } أي خائفينَ خَوفاً لاَزماً للقَلبِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd Allah said: {And We have made his wife fit for him} it is said: He was in her creation a blemish.\n\n\nAnd His saying, {raghadan wa rahaban} [means] He is pleased with what is with us and He is fearful of us.\n\n\nAnd His saying, {And they were for Us, submissive} - that is, fearful - necessarily for the heart.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تضرع وتمنى ما تمنى { فَٱسْتَجَبْنَا لَهُ } عناية منا إياه وفضلاً { وَوَهَبْنَا لَهُ } من كمال جودنا { يَحْيَىٰ } المحيي لاسمه { وَأَصْلَحْنَا لَهُ زَوْجَهُ } بل نفسه أيضاً بعدما أفسدهما الدهر\n وأخرجهما من قابلية الولاة والإيلاد\n وصيرنا زوجته شابة ولوداً بعدما كانت عجوزاً عقيماً\n إظهاراً لكمال قدرتنا ووفور حولنا وقوتنا\n وإنما فعلنا بالأنبياء المذكورين ما فعلنا بهم من كمال اللطف والكرم\n ومحض الفضل والإحسان { إِنَّهُمْ } من كمال توجههم وتحننهم نحونا { كَانُواْ } في جميع أوقاتهم وحالاتهم { يُسَارِعُونَ } ويبادرون { فِي ٱلْخَيْرَاتِ } ويسابقون إلى الطاعات المقبولة عندنا { وَ } مع ذلك { يَدْعُونَنَا } في مناجاتهم بنا\n وفي خلواتهم معنا { رَغَباً وَرَهَباً } راغبين إلينا\n راجين عفونا وغفراننا وراهبين عنا\n خائفين منا صولة سطوة قهرنا وغضبنا { وَ } بالجملة هم { كَانُواْ لَنَا } دائماً { خاشِعِينَ } [الأنبياء:: 90] خاضعين متذللين مخبتين\n ولذلك نالوا من الله بسبب خصائلهم هذه ما نالوا من جزيل العطاء\n والفوز بشرف اللقاء والبقاء بعد الفناء\n\n\n{ وَ } اذكر يا أكمل الرسل أختك العفيفة { ٱلَّتِيۤ أَحْصَنَتْ فَرْجَهَا } من الحلال والحرام\n وصبرت على العزوبة بلا ميل منها\n ولا دغدغة إلى الشهوة تقرباً إلى الله بتحمل المشاق والمتاعب في طريق توحيده\n وبعدما بالغت في الحصن والحفظ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاستجبنا له } دعاءه\n { ووهبنا له يحيى } ولدًا { وأصلحنا له زوجه } أي: أصلحناها للولادة بعد عُقمها\n أو أصلحناها للمعاشرة بتحسين خلْقها\n وكانت قبل سيئة الخلق\n { إنهم } أي: ما تقدم من الأنبياء\n { كانوا يُسارعون في الخيرات } أي: إنما استحقوا الإجابة إلى مطالبهم\n وأسعفناهم فيما أمَّلوا لمبادرتهم أبواب الخير\n ومسارعتهم إلى تحصيلها\n مع ثباتهم واستقرارهم في أصل الخير كله\n وهو السر في إتيان: { في } \n دون \" إلى \" \n المشعرة بخلاف المقصود من كونهم خارجين عن أصل الخيرات\n متوجهين إليها\n كما في قوله تعالى:\n[آل عِمرَان: 133]\n { و } كانوا { يدعوننا رغَبًا ورَهَبًا } طمعًا وخوفًا\n وهما مصدران في موضع الحال\n أو المفعول له\n أي: راغبين في الثواب أو الإجابة\n وراهبين من العقاب أو الخيبة\n أو للرغبة والرهبة\n { وكانوا لنا خاشعين }: متواضعين خائفين\n أي: إنما نالوا هذه المراتب العلية\n واستحقوا هذه الخصوصية لاتصافهم بهذه الأوصاف الحميدة\n والله تعالى أعلم\n الإشارة: الغالب في وراثة الخصوصية الحقيقية أن تكون لغير ورثة النسب\n وأما الخصوصية المجازية\n التي هي مقام الصلاح أو العلم\n فقد تكون لورثة النسب\n وتكون لغيرهم\n والخصوصية الحقيقية هي مقام الفناء والبقاء\n والتأهل للتربية النبوية\n ولا بأس بطلب وارث هذه الخصوصية\n لئلا ينقطع النفع بها\n وقد قيل\n في قول الشيخ ابن مشيش رضي الله عنه: اسمع ندائي بما سمعت به نداء عبدك زكريا\n إنه أشار إلى طلب الوارث الروحاني\n والله تعالى أعلم\n  وقوله تعالى: { إنهم كانوا يسارعون في الخيرات } \n فيه إشارة إلى بيان سبب حصول الخصوصية لأن بابها هو المسارعة إلى عمل الخيرات وأنواع الطاعات\n وأوكدها ثلاثة: دوام ذكر الله\n وحسن الظن بالله\n وبعباد الله\n وفي الحديث:\n \" خصلتان ليس فوقهما شيء من الخير: حسن الظن بالله\n وحسن الظن بعباد الله \" \nوقوله: { ويدعوننا رَغَبًا ورهبًا } \n هذه حالة الطالبين المسترشدين المتعطشين إلى الله\n يدعونه رغبًا في الوصول\n ورهبًا من الانقطاع والرجوع\n وقد تكون للواصلين رغبًا في زيادة الترقي\n ورهبًا من الوقوف أو الإبعاد\n وقال بعضهم: الرغب والرهب حاصلتان لكل مؤمن\n إذ لو لم تكن رغبة لكان قنوطًا\n وهو كفر\n ولو لم تكن رهبة لكان أمنًا\n والأمن كفر\n والله تعالى أعلم\n ثمَّ ذكر مريم وابنها عليهما السلام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "94:8",
      "similarity": 0.45471022850634196
    },
    {
      "verse": "68:32",
      "similarity": 0.42261153659568895
    },
    {
      "verse": "9:59",
      "similarity": 0.4124763064939917
    },
    {
      "verse": "2:130",
      "similarity": 0.32391099594370265
    },
    {
      "verse": "4:127",
      "similarity": 0.3154974912596588
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021090.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021090.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:90.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}