{
  "chapter": "الأنبياء",
  "text": "واقترب الوعد الحق فاذا هى شخصة ابصر الذين كفروا۟ يويلنا قد كنا فى غفلة من هذا بل كنا ظلمين",
  "translations": [
    {
      "translation": "and the True Promise is very close, the eyes of those who were kafir will be transfixed: 'Alas for us! We were unmindful of this! No, rather we were definitely wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the certain promise (of Doom) comes near. Then the eyes of unbelievers will be fixed in horror, (and they will cry:) \"Ah, woe betide, we were indeed heedless of this, and were oppressors and unjust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the time for the fulfilment of the true promise of Allah draws near, whereupon the eyes of those who disbelieved will stare in fear, and they will say: \"Woe to us, we were indeed heedless of this; nay, we were wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day of Judgment will then draw near and the unbelievers will stare amazedly and cry, \"Woe to us! We had neglected this day. We have done wrong\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the True Promise has come near – thereupon the eyes of the disbelievers will become fixed, staring wide; saying “Woe to us – we were in neglect of this, but in fact we were unjust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the true promise shall draw near. Then, you shall see the eyes of the disbelievers fixedly staring in horror. (They will say:) \"Woe to us! We were indeed heedless of this -- nay, but we were wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the true promise shall draw nigh, then lo! the eyes of those who disbelieved shall be fixedly open: O woe to us! surely we were in a state of heedlessness as to this; nay, we were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and nigh has drawn the true promise, and behold, the eyes of the unbelievers staring: 'Alas for us! We were heedless of this; 'nay, we were evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the True Promise draweth nigh; then behold them, staring wide (in terror), the eyes of those who disbelieve! (They say): Alas for us! We (lived) in forgetfulness of this. Ah, but we were wrong-doers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the true promise of God draws near, those who denied the truth will stare in amazement, crying, \"Woe to us! We have been so heedless of this. Indeed, we were wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there shall approach the true promise; and lo! the eyes of those who disbelieved shall be staring: woe unto us! surely we have been in neglect thereof; aye! we have been the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the true promise draws near [to its fulfillment], behold, the faithless will look on with a fixed gaze: ‘Woe to us! We have certainly been oblivious of this! Indeed, we have been wrongdoers!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will the true promise draw nigh (of fulfilment): then behold! the eyes of the Unbelievers will fixedly stare in horror: \"Ah! Woe to us! we were indeed heedless of this; nay, we truly did wrong!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the true promise (Day of Resurrection) shall draw near (of fulfillment). Then (when mankind is resurrected from their graves), you shall see the eyes of the disbelievers fixedly stare in horror. (They will say): \"Woe to us! We were indeed heedless of this; nay, but we were Zalimun (polytheists and wrong-doers, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the true promise draws near; the eyes of the unbelievers will stare (and they will say): 'Alas for us! Of this we have been heedless. We have beenharmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The promise of truth has drawn near. The eyes of those who disbelieved will stare in horror: “Woe to us. We were oblivious to this. In fact, we were wrongdoers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [when] the true promise has approached; then suddenly the eyes of those who disbelieved will be staring [in horror, while they say], \"O woe to us; we had been unmindful of this; rather, we were wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:97] And the true promise, that is, the Day of Resurrection, draws near and behold, when, the gaze of the disbelievers will be fixed, on that Day, because of its severity, saying: ‘O (yā is for exclamation) woe to us!, [this is] our destruction! Verily, in the [life of the] world, we were oblivious to this, Day. Nay, but we were doing wrong’, to our souls by our denial of the messengers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the True Promise draweth nigh) the Hour would be near upon their coming out of the barrier; (then behold them, staring wide (in terror)) humbled, hardly seeing, (the eyes of those who disbelieve) in 360 Muhammad (pbuh) and the Qur'an! ((They say): Alas for us) what a regret for us! (We (lived) in forgetfulness) in ignorance (of this) Day. (Ah, but we were wrong-doers) but we were disbelievers in Muhammad (pbuh) and in the Qur'an!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما { ٱقْتَرَبَ } ودنا { ٱلْوَعْدُ ٱلْحَقُّ } الموعود المحقق الذي هو فتح السد وخروجهما من أشراطه وعلامته، وقامت القيامة { فَإِذَا هِيَ } أي: الشأن والقصة حين أنها { شَاخِصَةٌ } حائرة مدهوشة مضطربة { أَبْصَارُ ٱلَّذِينَ كَفَرُواْ } في النشأة الأولى بالله، وكذبوا بهذا اليوم، فيقولون حينئذ متحسرين خائبين: { يٰوَيْلَنَا } وهلاكنا تعال فالآن وقت حلولك { قَدْ كُنَّا فِي غَفْلَةٍ } عظيمة { مِّنْ } مجيء { هَـٰذَا } اليوم في نشأتنا الأولى { بَلْ كُنَّا ظَالِمِينَ } [الأنبياء: 97] خارجين عن مقتضى الحكم الإلهي، منكرين لهذا اليوم بعدما أخبره بوقوعه الرسلُ ونطلق به الكتب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { اقترب }: عطف على فُتحت\n يقول الحقّ جلّ جلاله: { وحرامٌ } أي: ممتنع { على } أهل { قريةٍ أهلكناها } قدرنا هلاكها، أو حكمنا بإهلاكها لعتوهم، { إنهم إلينا لا يَرجعون } بالبعث والحشر، بل لا بد من بعثهم وحشرهم وجزائهم على أعمالهم\n وتخصيص امتناع عدم رجوعهم بالذكر مع شمول الامتناع للكل لقوله: { كُلٌ إلينا راجعون } لأنهم المنكِرون للبعث والرجوع دون غيرهم\n وقيل: المعنى: وممتنع على قرية، أردنا إهلاكها، رجوعهم إلى التوبة، أو ممتنع على قرية، أهلكناها بالفعل، رجوعهم إلى الدنيا\n وفيه رد على مذهب القائلين بالرجعة من الروافض وأهل التناسخ، على أن \" لا \" صلة\n وقُرئ بالكسر، على أنه تعليل لما قبله، فحرام، على هذا، خبر عن مبتدأ محذوف، أي: ذلك العمل الصالح حرام على قرية أردنا إهلاكها لأنهم لا يرجعون عن غيرهم\n وقال الزجاج: المعنى: وحرام على قرية، أردنا إهلاكها، أن يُتَقَبَّلَ منهم عمل لأنهم لا يرجعون، أي: لا يتوبون، ويجوز حمل المفتوحة على هذا بحذف اللام، ويستمرون على ما هم عليه من الهلاك، أو: فليستمر امتناعهم من الرجوع\n { حتى إذا فُتحت يأجوجُ ومأجوج } ونُفخ في الصور، وقامت القيامة، فيرجعون، ولا ينفعهم الرجوع\n ويأجوج ومأجوج قبيلتان، يقال: الناس عشرة أجزاء، تسعة منها يأجوج ومأجوج\n والمراد بفتحها: فتح سدها، على حذف مضاف أي: حتى إذا فُتح سد يأجوج ومأجوج، { وهم } أي: يأجوج ومأجوج، وقيل: الناس بعد البعث، { من كل حَدَبٍ } أي: نشز ومرتفع من الأرض، { يَنسِلُونَ }: يسرعون، وأصل النسل: مقاربة الخطو مع الإسراع\n ويدل على عَود الضمير ليأجوج ومأجوج: قوله - عليه الصلاة والسلام -:\n\n \" ويفتح ردم يأجوج ومأجوج، فيخرجون على الناس، كما قال الله تعالى: { من كل حدب ينسلون\n\n\n } \" \n\n \n\nالحديث، ويؤيد إعادتَه على الناس قراءة مجاهد: \" من كل جدث \" بالجيم، وهو القبر\n ثم قال تعالى: { واقتربَ الوعدُ الحقُّ } أي: ما بعد النفخة الثانية من البعث والحساب، { فإِذا هي شاخصةٌ } أي: فإذا القصة أو الشأن، وهو { أبصارُ الذين كفروا } شاخصة، أي: مرتفعة الأجفان، لا تكاد تطرق من شدة الهول، حال كونهم يقولون: { يا ويلنا } يا هلكتنا، هذا أوانك، فاحضري، { قد كُنَّا في غفلةٍ } تامة { من هذا } الذي دهَمنا من البعث، والرجوع إليه تعالى، للجزاء، ولم تعلم، حيث نُبِّهْنَا عليه بالآيات والنُذر، أنه حق، { بل كنا ظالمين } بتلك الآيات والنذر، مُكذبين بها، أو ظالمين أنفسنا بتعريضها للعذاب المخلد\n وهو إضراب عما قبله، من وصف أنفسهم بالغفلة، أي: لم نكن غافلين عنه، حيث نُبِّهْنَا عليه بالآيات والنذر، بل كنا ظالمين بتكذيبهم، والله تعالى أعلم\n تذييل: رَوى حذيفة أن النبي صلى الله عليه وسلم قال:\n\n \" أول الآية: الدَّجال، ونزول عيسى، ونار تخرج من قرن عدن، تسوق النار إلى المحشر - أي الشام - تقيل معهم إذا قالوا، والدُّخان، والدَّابة، ثم يأجوج ومأجوج \" \n\nقلت: وبعد موت يأجوج ومأجوج، تبقى مدة عيسى عليه السلام، في أَمَنَةٍ ورَغَدِ عَيْشٍ\n قيل: سبع سنين، وقيل: أربعون\n ثم يُقبض عيسى، ويُدفن في روضته صلى الله عليه وسلم، ثم تهب ريح تقبض المؤمنين، فلا يبقى من يقول الله الله، قيل: مائة سنة، وقيل: أقل، ثم تخرب الكعبة، ثم يُنفخ في الصور للصعق، واقترب الوعد الحق\n والله تعالى أعلم\n الإشارة: الحضرة محرمة على قلبٍ خراب، أهلكه الله بالوساوس والخواطر، وفتحت عليه من الشواغل والشواغب والخواطر يأجوج ومأجوج، فأفسدته وخربته وجعلته مزبلة للشياطين\n فحرام عليه رجوعه إلى الحضرة حتى يتطهر من هذه الوساوس والخواطر، ومن الشواغل والعلائق\n قال بعض الصوفية: حضرة القدوس محرمة على أهل النفوس\n فإذا اقترب وعد الحق، وهو أجل موته، قال: يا ويلنا إنا كنا عن هذا غافلين، لم نتأهب للقاء رب العالمين، حتى لقيتُه بقلب سقيم\n والعياذ بالله\n ثمَّ ذكر قال الكفرة إذا وقع الوعد الحق\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:42",
      "similarity": 0.9134001888212242
    },
    {
      "verse": "21:1",
      "similarity": 0.11968322531387005
    },
    {
      "verse": "51:60",
      "similarity": 0.11571212847826406
    },
    {
      "verse": "21:14",
      "similarity": 0.10314018976206335
    },
    {
      "verse": "16:108",
      "similarity": 0.10070814666488581
    }
  ]
}