{
  "chapter": "الأنبياء",
  "text": "واقترب الوعد الحق فاذا هى شخصة ابصر الذين كفروا۟ يويلنا قد كنا فى غفلة من هذا بل كنا ظلمين",
  "translations": [
    {
      "translation": "and the True Promise is very close, the eyes of those who were kafir will be transfixed: 'Alas for us! We were unmindful of this! No, rather we were definitely wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the certain promise (of Doom) comes near. Then the eyes of unbelievers will be fixed in horror, (and they will cry:) \"Ah, woe betide, we were indeed heedless of this, and were oppressors and unjust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the time for the fulfilment of the true promise of Allah draws near, whereupon the eyes of those who disbelieved will stare in fear, and they will say: \"Woe to us, we were indeed heedless of this; nay, we were wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day of Judgment will then draw near and the unbelievers will stare amazedly and cry, \"Woe to us! We had neglected this day. We have done wrong\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the True Promise has come near – thereupon the eyes of the disbelievers will become fixed, staring wide; saying “Woe to us – we were in neglect of this, but in fact we were unjust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the true promise shall draw near. Then, you shall see the eyes of the disbelievers fixedly staring in horror. (They will say:) \"Woe to us! We were indeed heedless of this -- nay, but we were wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the true promise shall draw nigh, then lo! the eyes of those who disbelieved shall be fixedly open: O woe to us! surely we were in a state of heedlessness as to this; nay, we were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and nigh has drawn the true promise, and behold, the eyes of the unbelievers staring: 'Alas for us! We were heedless of this; 'nay, we were evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the True Promise draweth nigh; then behold them, staring wide (in terror), the eyes of those who disbelieve! (They say): Alas for us! We (lived) in forgetfulness of this. Ah, but we were wrong-doers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the true promise of God draws near, those who denied the truth will stare in amazement, crying, \"Woe to us! We have been so heedless of this. Indeed, we were wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there shall approach the true promise; and lo! the eyes of those who disbelieved shall be staring: woe unto us! surely we have been in neglect thereof; aye! we have been the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the true promise draws near [to its fulfillment], behold, the faithless will look on with a fixed gaze: ‘Woe to us! We have certainly been oblivious of this! Indeed, we have been wrongdoers!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will the true promise draw nigh (of fulfilment): then behold! the eyes of the Unbelievers will fixedly stare in horror: \"Ah! Woe to us! we were indeed heedless of this; nay, we truly did wrong!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the true promise (Day of Resurrection) shall draw near (of fulfillment). Then (when mankind is resurrected from their graves), you shall see the eyes of the disbelievers fixedly stare in horror. (They will say): \"Woe to us! We were indeed heedless of this; nay, but we were Zalimun (polytheists and wrong-doers, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the true promise draws near; the eyes of the unbelievers will stare (and they will say): 'Alas for us! Of this we have been heedless. We have beenharmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The promise of truth has drawn near. The eyes of those who disbelieved will stare in horror: “Woe to us. We were oblivious to this. In fact, we were wrongdoers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [when] the true promise has approached; then suddenly the eyes of those who disbelieved will be staring [in horror, while they say], \"O woe to us; we had been unmindful of this; rather, we were wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:97] And the true promise, that is, the Day of Resurrection, draws near and behold, when, the gaze of the disbelievers will be fixed, on that Day, because of its severity, saying: ‘O (yā is for exclamation) woe to us!, [this is] our destruction! Verily, in the [life of the] world, we were oblivious to this, Day. Nay, but we were doing wrong’, to our souls by our denial of the messengers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَاقْتَرَبَ الْوَعْدُ الْحَقُّ فَإِذَا هِيَ شَاخِصَةٌ أَبْصَارُ الَّذِينَ كَفَرُوا يَا وَيْلَنَا قَدْ كُنَّا فِي غَفْلَةٍ مِنْ هَذَا بَلْ كُنَّا ظَالِمِينَ (97)وفسّر اقتراب الوعد باقتراب القيامة ، وسُمّيت وعداً لأن البعث سمّاه الله وعداً في قوله تعالى : { كما بدأنا أول خلق نعيده وعداً علينا إنا كنا فاعلين } \\[ الأنبياء : 104 \\].وعلى هذا أيضاً جعلوا ضمير { وهم من كل حدب ينسلون } عائد إلى «ياجوج وماجوج» فالجملة حال من قوله { ياجوج وماجوج }.وبناء على هذا التفسير تكون هذه الآية وصفتْ انتشار ياجوج وماجوج وصفاً بديعاً قبل خروجهم بخمسة قرون فعددنا هذه الآية من معجزات القرآن العلمية والغيبية . ولعل تخصيص هذا الحادث بالتوقيت دون غيره من علامات قرب الساعة قصد منه مع التوقيت إدماجُ الإنذار للعرب المخاطبين ليكون ذلك نُصب أعينهم تحذيراً لذرياتهم من كوارث ظهور هذين الفريقين فقد كان زوال ملك العرب العتيد وتدهور حضارتهم وقوتهم على أيدي ياجوج وماجوج وهم المَغول والتتار كما بيّن ذلك الإنذارُ النبوي في ساعة من ساعات الوحي . فقد روت زينب بنت جحش أن النبي صلى الله عليه وسلم دخل عليها فَزِعاً يقول : \" لا إله إلا الله ، ويلٌ للعرب من شرّ قد اقترب ، فُتح اليوم من رَدْم ياجوج وماجوج هكذا \" وحلّق بأصبعه الإبهام والتي تليها .والاقتراب على هذا اقتراب نسبي على نسبة ما بقي من أجل الدنيا بما مضى منه كقوله تعالى : { اقتربت الساعة وانشقّ القمر } \\[ القمر : 1 \\].ويجوز أن يكون المراد بفتح ياجوج وماجوج تمثيلَ إخراج الأموات إلى الحَشر ، فالفتح معنى الشق كقوله تعالى : { يوم تشقق الأرض عنهم سراعاً ذلك حشر علينا يسير } \\[ ق : 44 \\] ، ويكون اسم ياجوج وماجوج تشبيهاً بليغاً .وتخصيصهما بالذكر لشهرة كثرة عددهما عند العرب من خبر ذي القرنين . ويدلّ لهذا حديث أبي سعيد الخدري أن النبي صلى الله عليه وسلم قال : « يقول الله لآدم ( يوم القيامة ) أخرج بَعث النار ، فيقول : يا رب ، وما بعث النار؟ فيقول الله : من كل ألف تُسعمائة وتسعة وتسعون . قالوا : يا رسول الله وأيُّنا ذلك الواحد>؟ قال : أبشروا ، فإن منكم رجلاً ومن يأجوج وماجوج تسعمائة وتسعة وتسعين » . أو يكون اسم يأجوج ومأجوج استعمل مثلاً للكثرة كما في قول ذي الرمة :لوَ أنَ ياجوج وماجوجَ معاً ... وعادَ عادٌ واستجاشوا تُبّعاأي : حتى إذا أخرجت الأموات كيَأجوج ومأجوج على نحو قوله تعالى : { يخرجون من الأجداث كأنهم جراد منتشر } \\[ القمر : 7 \\] ، فيكون تشبيهاً بليغاً من تشبيه المعقول بالمعقول . ويؤيده قراءة ابن عباس وابن مسعود ومجاهد ، ( جدث ) بجيم ومثلثة ، أي من كل قبر في معنى قوله تعالى : { وإذا القبور بعثرت } \\[ الانفطار : 4 \\] فيكون ضميرا { وهم من كل حدب ينسلون } عائدَيْننِ إلى مفهوممٍ من المقام دلّت عليه قرينة الرجوع من قوله تعالى : { لا يرجعون } \\[ الأنبياء : 95 \\] أي أهلُ كل قرية أهلكناها .والاقتراب ، على هذا الوجه : القرب الشديد وهو المشارفة ، أي اقترب الوعد الذي وُعده المشركون ، وهو العذاب بأن رأوا النار والحساب .وعلامة التأنيث في فعل { فُتحت } لتأويل ياجوج وماجوج بالأمة . ثم يقدر المضاف وهو سُدٌّ فيكتسب التأنيث من المضاف إليه .وياجوج وماجوج هم قبيلتان من أمةٍ واحدة مثل طَسم وجديس .وإسناد فعل { فتحت } إلى { ياجوج وماجوج } بتقدير مضاف ، أي فُتح رَدْمهما أو سُدّهما . وفعل الفتح قرينة على المفعول .وقرأ الجمهور { فتحت } بتخفيف التاء الفوقية التي بعد الفاء . وقرأ ابن عامر وأبو جعفر ويعقوب بتشديدها .وتقدم الكلام على ياجوج وماجوج في سورة الكهف .والحدب : النَشَز من الأرض ، وهو ما ارتفع منها .و { ينسِلون } يمشون النّسَلانَ بفتحتين وفعله من باب ضرب ، وأصله : مشي الذئب . والمراد : المشي السريع . وإيثار التعبير به هنا من نكت القرآن الغيبية ، لأن ياجوج وماجوج لما انتشروا في الأرض انتشروا كالذئاب جياعاً مفسدين .هذا حاصل ما تفرق من كلام المفسرين وما فرضوه من الوجوه ، وهي تدور حول محوَر التزام أنّ ( حتى ) الابتدائية تفيد أن ما بعدها غاية لما قبلها مع تقدير مفعول { فُتحت } بأنه سدّ ياجوج وماجوج . ومع حمل ياجوج وماجوج على حقيقة مدلول الاسم ، وذلك ما زج بهم في مضيق تعاصى عليهم فيه تبيين انتظام الكلام فألجئوا إلى تعيين المغيّا وإلى تعيين غاية مناسبة له ولهاته المحامل كما علمت مما سبق .ولا أرى متابعتهم في الأمور الثلاثة .فأما دلالة ( حتى ) الابتدائية على معنى الغاية ، أي كون ما بعدها غاية لمضمون ما قبلها ، فلا أراه لازماً . ولأمر ما فرق العرب بين استعمالها جارّة وعاطفة وبين استعمالها ابتدائية ، أليس قد صرح النحاة بأن الابتدائية يكون الكلام بعدها جملة مستأنفة تصريحاً جرى مجرى الصواب على ألسنتهم فما رَعَوه حق رعايته فإن معنى الغاية في ( حتى ) الجارّة ( وهي الأصل في استعمال هذا الحرف ) ظاهر لأنها بمعنى ( إلى ).وفي ( حتّى ) العاطفة لأنها تفيد التشريك في الحكم وبين أن يكون المعطوف بها نهاية للمعطوف عليه في المعنى المراد .فأما ( حتى ) الابتدائية فإن وجود معنى الغاية معها في مواقعها غير منضبط ولا مطرّد ، ولما كان ما بعدها كلاماً مستقلاً تعيّن أن يكون وجودها بين الكلامين لمجرد الربط بين الكلامين فقد نقلت من معنى تنهية مدلول ما قبلها بما بعدها إلى الدلالة على تنهية المتكلم غرض كلامه بما يورده بعد ( حتى ) ولا يقصد تنهية مدلول ما قبل ( حتى ) بما عند حصول ما بعدها ( الذي هو المعنى الأصل للغاية ). وانظر إلى استعمال ( حتى ) في مواقع من معلقة لبيد .وفي قوله تعالى : { وزلزلوا حتى يقول الرسول والذين آمنوا معه متى نصر الله } \\[ البقرة : 214 \\] فإن قول الرسول ليس غاية للزلزلة ولكنه ناشىء عنها ، وقد مُثلت حالة الكافرين في ذلك الحين بأبلغ تمثيل وأشدّه وقعاً في نفس السامع ، إذ جعلت مفرعة على فتح ياجوج وماجوج واقتراببِ الوعد الحقّ للإشارة إلى سرعة حصول تلك الحالة لهم ثم بتصدير الجملة بحرف المفاجأة والمجازاة الذي يفيد الحصول دَفعة بلا تدرّج ولا مهلة ، ثم بالإتيان بضمير القصة ليحصل للسامع علم مجمل يفصله ما يفسِّر ضمير القصة فقال تعالى : { فإذا هي شاخصة أبصار الذين كفروا } إلى آخره .والشخوص : إحداد البصر دون تحرك كما يقع للمبهوت .وجملة : { يا ويلنا } مقول قول محذوف كما هو ظاهر ، أي يقولون حينئذ : يا ويلنا .ودلت ( في ) على تمكن الغفلة منهم حتى كأنها محيطة بهم إحاطة الظرف بالمظروف ، أي كانت لنا غفلة عظيمة ، وهي غفلة الإعراض عن أدلة الجزاء والبعث .و { يا ويلنا } دعاء على أنفسهم من شدة ما لحقهم .و { بل } للإضراب الإبطالي ، أي ما كنا في غفلة لأننا قد دُعينا وأُنذرنا وإنما كنا ظالمين أنفسنا بمكابرتنا وإعراضنا .والمشار إليه ب ( هذا ) هو مجموع تلك الأحوال من الحشر والحساب والجزاء .\n\n",
      "translations": [
        {
          "translation": "(And the True Promise draweth nigh) the Hour would be near upon their coming out of the barrier; (then behold them, staring wide (in terror)) humbled, hardly seeing, (the eyes of those who disbelieve) in 360 Muhammad (pbuh) and the Qur'an! ((They say): Alas for us) what a regret for us! (We (lived) in forgetfulness) in ignorance (of this) Day. (Ah, but we were wrong-doers) but we were disbelievers in Muhammad (pbuh) and in the Qur'an!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما { ٱقْتَرَبَ } ودنا { ٱلْوَعْدُ ٱلْحَقُّ } الموعود المحقق الذي هو فتح السد وخروجهما من أشراطه وعلامته\n وقامت القيامة { فَإِذَا هِيَ } أي: الشأن والقصة حين أنها { شَاخِصَةٌ } حائرة مدهوشة مضطربة { أَبْصَارُ ٱلَّذِينَ كَفَرُواْ } في النشأة الأولى بالله\n وكذبوا بهذا اليوم\n فيقولون حينئذ متحسرين خائبين: { يٰوَيْلَنَا } وهلاكنا تعال فالآن وقت حلولك { قَدْ كُنَّا فِي غَفْلَةٍ } عظيمة { مِّنْ } مجيء { هَـٰذَا } اليوم في نشأتنا الأولى { بَلْ كُنَّا ظَالِمِينَ } [الأنبياء: 97] خارجين عن مقتضى الحكم الإلهي\n منكرين لهذا اليوم بعدما أخبره بوقوعه الرسلُ ونطلق به الكتب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { اقترب }: عطف على فُتحت\n يقول الحقّ جلّ جلاله: { وحرامٌ } أي: ممتنع { على } أهل { قريةٍ أهلكناها } قدرنا هلاكها\n أو حكمنا بإهلاكها لعتوهم\n { إنهم إلينا لا يَرجعون } بالبعث والحشر\n بل لا بد من بعثهم وحشرهم وجزائهم على أعمالهم\n وتخصيص امتناع عدم رجوعهم بالذكر مع شمول الامتناع للكل لقوله: { كُلٌ إلينا راجعون } لأنهم المنكِرون للبعث والرجوع دون غيرهم\n وقيل: المعنى: وممتنع على قرية\n أردنا إهلاكها\n رجوعهم إلى التوبة\n أو ممتنع على قرية\n أهلكناها بالفعل\n رجوعهم إلى الدنيا\n وفيه رد على مذهب القائلين بالرجعة من الروافض وأهل التناسخ\n على أن \" لا \" صلة\n وقُرئ بالكسر\n على أنه تعليل لما قبله\n فحرام\n على هذا\n خبر عن مبتدأ محذوف\n أي: ذلك العمل الصالح حرام على قرية أردنا إهلاكها لأنهم لا يرجعون عن غيرهم\n وقال الزجاج: المعنى: وحرام على قرية\n أردنا إهلاكها\n أن يُتَقَبَّلَ منهم عمل لأنهم لا يرجعون\n أي: لا يتوبون\n ويجوز حمل المفتوحة على هذا بحذف اللام\n ويستمرون على ما هم عليه من الهلاك\n أو: فليستمر امتناعهم من الرجوع\n { حتى إذا فُتحت يأجوجُ ومأجوج } ونُفخ في الصور\n وقامت القيامة\n فيرجعون\n ولا ينفعهم الرجوع\n ويأجوج ومأجوج قبيلتان\n يقال: الناس عشرة أجزاء\n تسعة منها يأجوج ومأجوج\n والمراد بفتحها: فتح سدها\n على حذف مضاف أي: حتى إذا فُتح سد يأجوج ومأجوج\n { وهم } أي: يأجوج ومأجوج\n وقيل: الناس بعد البعث\n { من كل حَدَبٍ } أي: نشز ومرتفع من الأرض\n { يَنسِلُونَ }: يسرعون\n وأصل النسل: مقاربة الخطو مع الإسراع\n ويدل على عَود الضمير ليأجوج ومأجوج: قوله - عليه الصلاة والسلام -:\n \" ويفتح ردم يأجوج ومأجوج\n فيخرجون على الناس\n كما قال الله تعالى: { من كل حدب ينسلون\n\n\n } \" \n \nالحديث\n ويؤيد إعادتَه على الناس قراءة مجاهد: \" من كل جدث \" بالجيم\n وهو القبر\n ثم قال تعالى: { واقتربَ الوعدُ الحقُّ } أي: ما بعد النفخة الثانية من البعث والحساب\n { فإِذا هي شاخصةٌ } أي: فإذا القصة أو الشأن\n وهو { أبصارُ الذين كفروا } شاخصة\n أي: مرتفعة الأجفان\n لا تكاد تطرق من شدة الهول\n حال كونهم يقولون: { يا ويلنا } يا هلكتنا\n هذا أوانك\n فاحضري\n { قد كُنَّا في غفلةٍ } تامة { من هذا } الذي دهَمنا من البعث\n والرجوع إليه تعالى\n للجزاء\n ولم تعلم\n حيث نُبِّهْنَا عليه بالآيات والنُذر\n أنه حق\n { بل كنا ظالمين } بتلك الآيات والنذر\n مُكذبين بها\n أو ظالمين أنفسنا بتعريضها للعذاب المخلد\n وهو إضراب عما قبله\n من وصف أنفسهم بالغفلة\n أي: لم نكن غافلين عنه\n حيث نُبِّهْنَا عليه بالآيات والنذر\n بل كنا ظالمين بتكذيبهم\n والله تعالى أعلم\n تذييل: رَوى حذيفة أن النبي صلى الله عليه وسلم قال:\n \" أول الآية: الدَّجال\n ونزول عيسى\n ونار تخرج من قرن عدن\n تسوق النار إلى المحشر - أي الشام - تقيل معهم إذا قالوا\n والدُّخان\n والدَّابة\n ثم يأجوج ومأجوج \" \nقلت: وبعد موت يأجوج ومأجوج\n تبقى مدة عيسى عليه السلام\n في أَمَنَةٍ ورَغَدِ عَيْشٍ\n قيل: سبع سنين\n وقيل: أربعون\n ثم يُقبض عيسى\n ويُدفن في روضته صلى الله عليه وسلم\n ثم تهب ريح تقبض المؤمنين\n فلا يبقى من يقول الله الله\n قيل: مائة سنة\n وقيل: أقل\n ثم تخرب الكعبة\n ثم يُنفخ في الصور للصعق\n واقترب الوعد الحق\n والله تعالى أعلم\n الإشارة: الحضرة محرمة على قلبٍ خراب\n أهلكه الله بالوساوس والخواطر\n وفتحت عليه من الشواغل والشواغب والخواطر يأجوج ومأجوج\n فأفسدته وخربته وجعلته مزبلة للشياطين\n فحرام عليه رجوعه إلى الحضرة حتى يتطهر من هذه الوساوس والخواطر\n ومن الشواغل والعلائق\n قال بعض الصوفية: حضرة القدوس محرمة على أهل النفوس\n فإذا اقترب وعد الحق\n وهو أجل موته\n قال: يا ويلنا إنا كنا عن هذا غافلين\n لم نتأهب للقاء رب العالمين\n حتى لقيتُه بقلب سقيم\n والعياذ بالله\n ثمَّ ذكر قال الكفرة إذا وقع الوعد الحق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:42",
      "similarity": 0.9134001888212242
    },
    {
      "verse": "21:1",
      "similarity": 0.11968322531387005
    },
    {
      "verse": "51:60",
      "similarity": 0.11571212847826406
    },
    {
      "verse": "21:14",
      "similarity": 0.10314018976206335
    },
    {
      "verse": "16:108",
      "similarity": 0.10070814666488581
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021097.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021097.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:97.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}