{
  "chapter": "الأنبياء",
  "text": "وتقطعوا۟ امرهم بينهم كل الينا رجعون",
  "translations": [
    {
      "translation": "But they disagreed and split into different sects. Each one will return to Us.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they split up the order among themselves; (yet) all of them have to come back to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they tore asunder their faith into many parts. But to Us they are bound to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People have divided themselves into many sects, but all will return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others have shattered their works into pieces among themselves; all have to return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they have broken up and differed in their religion among themselves. (And) they all shall return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they broke their religion (into sects) between them: to Us shall all come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they split up their affair between them; all shall return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have broken their religion (into fragments) among them, (yet) all are returning unto Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they divided themselves into factions, but to Us they shall all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they cut up their affair among them:, all are unto Us returners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have fragmented their religion among themselves, but everyone of them will return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (later generations) cut off their affair (of unity), one from another: (yet) will they all return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they have broken up and differed as regards their religion among themselves. (And) they all shall return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they (the Christians and Jews) split their affair between them all shall return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they splintered themselves into factions. They will all return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [yet] they divided their affair among themselves, [but] all to Us will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:93] But they, that is to say, some of those being addressed, fragmented their affair among themselves, that is, they became divided in the matter of their religion, and at variance over it — these are the [different] sects of the Jews and the Christians. God, exalted be He, says: All shall return to Us, and We will requite each according to his deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they have broken their religion (into fragments) among them) they disagreed among themselves concerning their religion, i.e. the Jews, Christians and Magians, ((yet) all) all the different groups (are returning unto Us).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَقَطَّعُوۤاْ أَمْرَهُمْ بَيْنَهُمْ } معناه تَفرَّقُوا واختلَفُوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما كانوا أمة واحد لا اختلاف فيهم أصلاً { تَقَطَّعُوۤاْ أَمْرَهُمْ } أي: أمر دينهم قطعاً، وتحزبوا أحزاباً فوقع النزاع { بَيْنَهُمْ } فاختلفوا اختلافاً كثيراً على سبيل المراء والمجادلة، ولا تبال بهم وباختلافهم وتحزبهم؛ إذ { كُلٌّ إِلَيْنَا رَاجِعُونَ } [الأنبياء: 93] رجوع الأمواج إلى البحر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وتقطعوا أمرهم } ، أصل الكلام: وتقطعتم في أمر دينكم وتفرقتم\n إلاَّ أن الكلام صرف إلى الغيبة، على طريقة الالتفات ليَنْعي عليهم ما أفسدوه في الدين، والمعنى: فجعلوا أمر دينهم فيما { بينهم } قِطَعًا، وصاروا أحزابًا متفرقة، كأنه يُنْهِي إلى أهل التوحيد قبائح أفعالهم، ويقول: ألا ترون إلى عظيم ما ارتكب هؤلاء في دين الله، الذي أجمعت عليه كافة الأديان؟ ثم توعدهم بقوله: { كُلٌّ إِلينا راجعون } أي: كل واحد، من الفرق المتقطعة، راجع إلينا بالبعث، فنجازيهم حينئذ بحسب أعمالهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:168",
      "similarity": 0.4629077841100162
    },
    {
      "verse": "15:66",
      "similarity": 0.4508637689567888
    },
    {
      "verse": "6:45",
      "similarity": 0.44940564217579104
    },
    {
      "verse": "3:109",
      "similarity": 0.44072325099752024
    },
    {
      "verse": "7:72",
      "similarity": 0.4212344289097975
    }
  ]
}