{
  "chapter": "الأنبياء",
  "text": "والتى احصنت فرجها فنفخنا فيها من روحنا وجعلنها وابنها ءاية للعلمين",
  "translations": [
    {
      "translation": "And she who protected her private parts. We breathed into her some of Our Ruh and made her and her son a Sign for all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) her who preserved her chastity, into whom We breathed a new life from Us, and made her and her son a token for mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also recall the woman who guarded her chastity: We breathed into her of Our spirit, and made her and her son a Sign to the whole world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Into the woman who maintained her chastity We breathed Our Spirit and made her and her son a miracle for all people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember the woman who maintained her chastity, We therefore breathed Our Spirit into her and made her and her son a sign for the entire world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she who guarded her chastity, We breathed into her through Our Ruh, and We made her and her son a sign for nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she who guarded her chastity, so We breathed into her of Our inspiration and made her and her son a sign for the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she who guarded her virginity, so We breathed into her of Our spirit and appointed her and her son to be a sign unto all beings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she who was chaste, therefor We breathed into her (something) of Our Spirit and made her and her son a token for (all) peoples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the one who guarded her chastity; so We breathed Our Spirit into her, and made her and her son a sign for all people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she who guarded her chastity! Then We breathed into her of Our spirit, and made her and her son a sign unto the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] her who guarded her chastity, so We breathed into her Our spirit, and made her and her son a sign for all the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) her who guarded her chastity: We breathed into her of Our spirit, and We made her and her son a sign for all peoples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) she who guarded her chastity [Virgin Maryam (Mary)], We breathed into (the sleeves of) her (shirt or garment) [through Our Ruh - Jibrael (Gabriel)], and We made her and her son ['Iesa (Jesus)] a sign for Al-'Alamin (the mankind and jinns).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she (Mary) who guarded her virginity. We breathed into her of Our spirit (Gabriel), and made her and her son a sign for the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And she who guarded her virginity. We breathed into her of Our spirit, and made her and her son a sign to the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] the one who guarded her chastity, so We blew into her [garment] through Our angel [Gabriel], and We made her and her son a sign for the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:91] And, mention Mary, the one who guarded her virginity, [the one who] preserved it from being taken, so We breathed into her of Our spirit, namely, Gabriel, when he breathed into the opening of her garment and she conceived Jesus. And We made her and her son a sign for all the worlds, that is, [for] mankind, jinn and angels, because she bore him without [having] a male [partner].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And) and mention (she who was chaste, therefore We breathed into her (something) of Our Spirit) therefore, by Our command, Gabriel breathed into her (and made her and her son a token) a sign and admonition (for (all) peoples) for the children of Israel: a son without a father; and a birth without physical contact.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { والتي أحصنت } أي: النفس الزكية الصافية المستعدّة العابدة التي أحصنت فرج استعدادها ومحل تأثير الروح من باطنها بحفظه من مسافحي القوى البدنية فيها { فنفخنا فيها } من تأثير روح القدس بنفخ الحياة الحقيقية فولدت عيسى القلب { وجعلناها } مع القلب علامة ظاهرة وهداية واضحة { للعالمين } من القوى الروحانية والنفوس المستعدّة المستبصرة يهديهم إلى الحق وإلى طريق مستقيم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وبلغت في العفة كمالها وغايتها { فَنَفَخْنَا فِيهَا } أي: أمرنا حامل روحنا\n يعني: جبريل عليه السلام بأن ينفخ في جيبها { مِن رُّوحِنَا } فنفخ فسرى إلى جوفها\n فحبلت بعيسى عليه السلام وبعد وضع حملها { وَجَعَلْنَاهَا } أي: مريم { وَٱبْنَهَآ } عيسى { آيَةً } أي: كل منهما آية عجيبة غريبة دالة على كمال قدرتنا وحكمتنا\n خارقة للعادة\n وهي إيجاد الولد بلا أب\n وإيلاد المرأة بلا لمس زوج\n فصار هذا كرامة وإرهاصاً لمريم\n ومعجزةً لعيسى - عليهما الصلاة والسلام - وعبرة { لِّلْعَالَمِينَ } [الأنبياء: 91] من حسن حالهما ورفعة رتبتها وعلو شأنهما",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { و } اذكر { التي أحصنت فرْجَها } على الإطلاق من الحلال والحرام، والتعبير عنها بالموصول لتفخيم شأنها، وتنزيهها عما زعموه في حقها. { فنفخنا فيها من رُّوحِنَا } أي: أجرينا روح عيسى فيه وهو في بطنها، أو نفخنا في درع جيبها من ناحية روحنا، وهو جبريل عليه السلام، فأحدثنا بذلك النفخ عيسى عليه السلام، وإضافة الروح إليه تعالى لتشريف عيسى عليه السلام، { وجعلناها وابنها } أي قضيتهما، أو حالهما، { آية للعالمين } ، فإن من تأمل حالهما تحقق بكمال قدرته تعالى. وإنما لم يقل آيتين، كما قال:\n[الإسرَاء: 12] لأن مجموعهما آية واحدة، وهي ولادتها إياه من غير فحل. وقيل: التقدير: وجعلناها آية وابنها كذلك، فآيةٌ مفعول المعطوف عليه، فحذف أحدهما لدلالة الآخر عليه. والله تعالى أعلم. الإشارة: مَنْ حَصَّلَ التقوى في صغره، كان آية في كِبَرِهِ. تقول العامة: الثور الحراث في الربك يبان، وتقول الصوفية: البداية مجلاة النهاية. وقالت الحكماء: الصغر يخدم على الكبر. وبالله التوفيق. ثمَّ ذكر اتفاقهم في التوحيد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:9",
      "similarity": 0.5546641260505838
    },
    {
      "verse": "66:12",
      "similarity": 0.5359134442268331
    },
    {
      "verse": "23:5",
      "similarity": 0.5334143142606159
    },
    {
      "verse": "70:29",
      "similarity": 0.5334143142606159
    },
    {
      "verse": "50:6",
      "similarity": 0.4942461723695878
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/021091.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/021091.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/21:91.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}