{
  "chapter": "الأنبياء",
  "text": "ثم صدقنهم الوعد فانجينهم ومن نشاء واهلكنا المسرفين",
  "translations": [
    {
      "translation": "But We kept Our promise to them and rescued them and those We willed, and destroyed the profligate.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made Our promise good to them and delivered whomsoever We pleased, and destroyed the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We fulfilled the promise We had made to them: We rescued them and those whom We wished, and We destroyed those who exceeded all bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our promise to them came true and We saved them and those whom We wanted, but destroyed the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then fulfilled the promise to them, therefore rescued them and whomever We willed, and destroyed the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We fulfilled to them the promise. So We saved them and those whom We willed, but We destroyed Al-Musrifin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made Our promise good to them, so We delivered them and those whom We pleased, and We destroyed the extravagant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We made true the promise We gave them and We delivered them, and whomsoever We would; and We destroyed the prodigal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then we fulfilled the promise unto them. So we delivered them and whom We would, and We destroyed the prodigals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We fulfilled Our promise to them and We saved them and those with them whom We pleased, and We destroyed those who exceeded all bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made good unto them the premise; so We delivered them and those whom We willed, and We destroyed the extravagant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We fulfilled Our promise to them, and We delivered them and whomever We wished, and We destroyed the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the end We fulfilled to them Our Promise, and We saved them and those whom We pleased, but We destroyed those who transgressed beyond bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We fulfilled to them the promise, and We saved them and those whom We willed, but We destroyed Al-Musrifun (i.e. extravagants in oppression, polytheism and in sin).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We were true to the promise, We saved them together with those whom We willed, and destroyed the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We fulfilled Our promise to them, and We saved them together with whomever We willed, and We destroyed the extravagant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We fulfilled for them the promise, and We saved them and whom We willed and destroyed the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[21:9] Then We fulfilled to them the promise, to deliver them. So We delivered them and whomever We would, [of] those who believed in them, and We destroyed the prodigal, those who denied them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We fulfilled the promise unto them) We fulfilled the promise given to the prophets that they will be saved. (So We delivered them) i.e. the prophets (and whom We would) and those who believed in the prophets, (and We destroyed the prodigals) and We destroyed the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما كذَّبهم المنكرون { صَدَقْنَاهُمُ ٱلْوَعْدَ } وأوفينا لهم الوعود المعهودة الذي وعدناهم من إهلاك عدوهم وإنجائهم من بينهم سالمين { فَأَنجَيْنَاهُمْ } على الوجه الذي عهدنا معهم { وَمَن نَّشَآءُ } من أتباعهم الذين سبقت رحمتنا عليهم في حضرة علمنا { وَأَهْلَكْنَا ٱلْمُسْرفِينَ } [الأنبياء: 9] المصرين على البغي والعناد، المنهمكين في الجور والفساد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم صَدَقْناهم الوعد } بالنصر وإهلاك أعدائهم، وهو عطف على ما يُفْهَمُ من وحيه تعالى إليهم، كأنه قيل: أوحينا إليهم ما أوحينا، ثم صدقناهم في الوعد، الذي وعدناهم في تضاعيف الوحي، بإهلاك أعدائهم، { فأنجيناهم ومَنْ نشاء } من المؤمنين وغيرهم، ممن تستدعي الحكمة إبقاءه، كمن سَيُؤمن هو أو بعض فروعه، وهو السر في حماية العرب من عذاب الاستئصال\n أو يخص هذا العموم بغير نبي الرحمة صلى الله عليه وسلم فإن أمته لا تستأصل، وإن بقي فيها من يكفر بالله لعل الله يُخرج من أصلابهم من يُوحد الله تعالى\n { وأهلكنا المسرفين } أي: المجاوزين الحد في الكفر والمعاصي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:151",
      "similarity": 0.6007527977071735
    },
    {
      "verse": "44:31",
      "similarity": 0.5434893563055563
    },
    {
      "verse": "36:19",
      "similarity": 0.4512910818089761
    },
    {
      "verse": "51:34",
      "similarity": 0.43582494285731216
    },
    {
      "verse": "17:33",
      "similarity": 0.42383168816968025
    }
  ]
}