{
  "chapter": "الحج",
  "text": "يدعوا۟ من دون الله ما لا يضره وما لا ينفعه ذلك هو الضلل البعيد",
  "translations": [
    {
      "translation": "Leaving God they pray to those who cannot harm or profit them. That is the limit of going astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He invokes, instead of Allah, those who can neither harm nor benefit him. That indeed is straying far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship things instead of God which can neither harm them nor benefit them. This is indeed to stray far away from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship such, beside Allah, which neither harms them nor benefits them; this only is the extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He calls besides Allah unto that which can neither harm him nor profit him. That is a straying far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He calls besides Allah upon that which does not harm him and that which does not profit him, that is the great straying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He calls, apart from God, upon that which hurts him not, and which neither profits him anything; that is indeed the far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He calleth, beside Allah, unto that which hurteth him not nor benefiteth him. That is the far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He calls on, instead of God, something that can neither harm him, nor benefit him. That is indeed straying far away --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He calleth upon that, beside Allah, which can neither hurt him nor profit him! that! it is a straying far-off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He invokes besides Allah that which can bring him neither benefit nor harm. That is extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They call on such deities, besides Allah, as can neither hurt nor profit them: that is straying far indeed (from the Way)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He calls besides Allah unto that which hurts him not, nor profits him. That is a straying far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He calls to other than Allah, to that which neither hurts him, nor benefits him; that is indeed far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He invokes, instead of God, what can neither harm him nor benefit him. That is the far straying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He invokes instead of Allah that which neither harms him nor benefits him. That is what is the extreme error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:12] He calls on, he worships, besides God, in the way of idols, that which could not hurt him, should he refrain from worshipping it, and that which could not profit him, if were to worship it. Such, a call, is extreme error, from the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He calleth) the Banu'l-Hallaf worship others (beside Allah, unto that which hurts him not) if they do not worship them (nor benefits him) if they worshipped them. (That is the far error) far from the Truth and guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَدْعُواْ } ويعبد { مِن دُونِ ٱللَّهِ } المتصف بجميع أوصاف الكمال المستحق للعبادة والإطاعة استحقاقاً ذاتياً ووصفياً { مَا لاَ يَضُرُّهُ } أي: شيئاً، إن عصاه ولم يؤمن به لا يتأتى منه الضرب والانتقام { وَمَا لاَ يَنفَعُهُ } أي: إن أطاعه وعبده حق عبادته، لا يتأتى منه أن يثيبه ويغفر له ويحسن إليه { ذٰلِكَ } أي: الإطاعة والانقياد لشيء لا يرجى منه النفع والضر { هُوَ ٱلضَّلاَلُ ٱلْبَعِيدُ } [الحج: 12] عن الهداية والتوحيد بمراحل خارجة عن الحصر والتعديد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}