{
  "chapter": "الحج",
  "text": "يايها الناس اتقوا۟ ربكم ان زلزلة الساعة شىء عظيم",
  "translations": [
    {
      "translation": "Mankind, have taqwa of your Lord! The quaking of the Hour is a terrible thing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O YOU PEOPLE, fear your Lord. The great upheaval of the Hour will indeed be terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, fear the (wrath of) your Lord! Indeed, the earthquake of the Hour (of Judgement) will be an awesome thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, have fear of your Lord; the quake (of the physical realm) at the Hour of Doom will be terribly violent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, fear your Lord; indeed the earthquake of the Last Day is a tremendous thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Have Taqwa of your Lord! Verily, the earthquake of the Hour is a terrible thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! guard against (the punishment from) your Lord; surely the violence of the hour is a grievous thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, fear your Lord! Surely the earthquake of the Hour is a mighty thing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Fear your Lord. Lo! the earthquake of the Hour (of Doom) is a tremendous thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People! Fear your Lord. The catastrophe of the Last Hour shall be terrible indeed:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind! fear your Lord; verily the quake of the Hour shall be a thing mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Be wary of your Lord! Indeed the quake of the Hour is a terrible thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! fear your Lord! for the convulsion of the Hour (of Judgment) will be a thing terrible!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Fear your Lord and be dutiful to Him! Verily, the earthquake of the Hour (of Judgement) is a terrible thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, have fear of your Lord. The earthquake of the Hour shall be a great thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, be conscious of your Lord. The quaking of the Hour is a tremendous thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, fear your Lord. Indeed, the convulsion of the [final] Hour is a terrible thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:1] O mankind, that is, the inhabitants of Mecca and others: fear your Lord, that is, of His punishment, by being obedient to Him. Surely the earthquake of the Hour [of Doom], that is, the violent quaking of the earth after which the sun will rise from the west, [something] which will be near [the time of] the Hour, is a tremendous thing, in the way it will distress people — this itself being a sort of punishment.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas who said in explaining Allah's words (0 mankind!): '(0 mankind!) this expression could be of general applicability ('amm) as it could be of particular applicability (khass); here, it is an expression of general applicability. (Fear your Lord) and obey him. (Lo! the earthquake of the Hour (of Doom)) the advent of the Hour (is a tremendous thing) its horror is horrendous.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّاسُ } الناسون للعهود والمواثيق { ٱتَّقُواْ رَبَّكُمْ } الذي ربَّاكم بأنواع الكرامات وجلائل العم، واجتنبوا عما نهاكم عنه من المكاره والمعاصي، ولا تغتروا بإمهاله إياكم في نشأتكم هذه، واحذروا عن بطشه في النشأة الأخرى وقيام الساعة { إِنَّ زَلْزَلَةَ ٱلسَّاعَةِ } المعدة لانقهار النظام المشاهد، وانحلال أجزاء العالم المحسوس { شَيْءٌ عَظِيمٌ } [الحج: 1] وأمر فظيع هائل فجيع، بحيث تضعفت السماوات من هيبتها، واندكت الأرضون من شدة صولتها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { زلزلة }: مصدر مضاف إلى فاعله على المجاز، أو إلى الظرف، وهي الساعة",
      "translations": []
    }
  ]
}