{
  "chapter": "الحج",
  "text": "ان الله يدخل الذين ءامنوا۟ وعملوا۟ الصلحت جنت تجرى من تحتها الانهر ان الله يفعل ما يريد",
  "translations": [
    {
      "translation": "Allah will admit those who have iman and do right actions into Gardens with rivers flowing under them. Allah does whatever He wishes.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will admit those who believe and do the right to gardens full of rippling streams. Verily God does as He pleases.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(In contrast) Allah will assuredly cause those who believe and act righteously to enter Gardens beneath which rivers flow. For, most certainly, Allah does whatever He pleases.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will admit the righteously striving believers to the gardens wherein streams flow. God has all the power to do whatever He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah will admit those who believed and did good deeds, into Gardens beneath which rivers flow; indeed Allah does whatever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, Allah will admit those who believe and do righteous good deeds to Gardens underneath which rivers flow. Verily, Allah does what He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah will cause those who believe and do good deeds to enter gardens beneath which rivers flow, surely Allah does what He pleases.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall surely admit those who believe and do righteous deeds into gardens underneath which rivers flow; surely God does that He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah causeth those who believe and do good works to enter Gardens underneath which rivers flow. Lo! Allah doth what He intendeth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will admit those who believe and act righteously into Gardens watered by flowing rivers. God does whatever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah shall cause those who believe and work righteous works to enter Gardens whereunder rivers flow; verily Allah doth whatsoever He intendeth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will indeed admit those who have faith and do righteous deeds into gardens with streams running in them. Indeed Allah does whatever He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah will admit those who believe and work righteous deeds, to Gardens, beneath which rivers flow: for Allah carries out all that He plans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, Allah will admit those who believe (in Islamic Monotheism) and do righteous good deeds (according to the Quran and the Sunnah) to Gardens underneath which rivers flow (in Paradise). Verily, Allah does what He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good works Allah will admit them to gardens underneath which rivers flow. Allah indeed does what He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will admit those who believe and do righteous deeds into Gardens beneath which rivers flow. God does whatever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah will admit those who believe and do righteous deeds to gardens beneath which rivers flow. Indeed, Allah does what He intends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:14] Truly God shall admit those who believe and perform righteous deeds, in the way of obligatory and supererogatory acts [of worship], into gardens underneath which rivers flow. Indeed God does whatever He   desires, in the way of showing beneficence to those who obey Him and degrading those who disobey Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آَمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ إِنَّ اللَّهَ يَفْعَلُ مَا يُرِيدُ (14)هذا مقابل قوله { ونذيقه يوم القيامة عذاب الحريق } \\[ الحج : 9 \\] وقوله : { خسر الدنيا والآخرة } \\[ الحج : 11 \\]. فالجملة معترضة ، وقد اقتصر على ذكر ما للمؤمنين من ثواب الآخرة دون ذكر حالهم في الدنيا لعدم أهمية ذلك لديهم ولا في نظر الدين .وجملة { إن الله يفعل ما يريد } تذييل للكلام المتقدم من قوله { ومن الناس من يجادل في الله بغير علم } \\[ الحج : 8 \\] إلى هنا ، وهو اعتراض بين الجمل الملتئم منها الغرض . وفيها معنى التعليل الإجمالي لاختلاف أحوال الناس في الدنيا والآخرة .وفعْلُ الله ما يريد هو إيجاد أسباب أفعال العباد في سُنة نظام هذا العالم ، وتبيينه الخير والشرّ ، وترتيبه الثواب والعقاب ، وذلك لا يحيط بتفاصيله إلا الله تعالى .\n\n",
      "translations": [
        {
          "translation": "364 (Lo! Allah causeth those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) acts of obedience between them and their Lord (to enter the Gardens beneath) beneath their trees and habitations (which rivers) rivers of wine, water, honey and milk (flow. Lo! Allah doth what He intendeth) whether it is bestowing bliss or inflicting damnation. This was also revealed about them when they said: we are afraid that Muhammad does not triumph in this world and, thus, we would loose the affinity existing between us and the Jews.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته من تعقيب الوعيد بالوعد: { إِنَّ ٱللَّهَ } الهادي لعباده إلى دار السلام { يُدْخِلُ ٱلَّذِينَ آمَنُواْ } أي: سيقوا بالإيمان بالله\n وتصدق رسله وكتبه { وَ } مع ذلك { عَمِلُواْ ٱلصَّالِحَاتِ } التي أمرهم سبحانه في كتبه وأجراهم على ألسنة رسله بالإتيان والامتثال بها\n واجتبوا عن النوهي التي نهاهم سبحانه عنها { جَنَاتٍ } متنزهات من العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أي: المعارف والحقائق الجزئية المتجددة بتجددات الأمثال\n وهي الرموز والإرشادات التي يتفطن بها العارف من ظواهر المظاهر المرتبطة بالشؤون والتجليات الإلهية وبالجملة { إِنَّ ٱللَّهَ } الموفق لخواص عباده { يَفْعَلُ } معهم { مَا يُرِيدُ } [الحج: 14] من الصلاح والفوز بالنجاح\n والتحقق بمقام الرضا وشرف اللقاء\n\n\nثم لما اعتقد المشركون من في قلبه عداوة راسخة مع رسول الله صلى الله عليه وسلم\n وشيكمةُ شديدة\n وغيظُ مفرط ألاَّ نصرَ ولا إعانة له من عند الله لا في الدنيا ولا في الآخرة كما زعمه ردَّ الله عليهم نصراً له وترويجاً لقوله\n فقال: { مَن كَانَ يَظُنُّ أَن لَّن يَنصُرَهُ ٱللَّهُ } ولن يعين رسوله صلى الله عليه وسلم لا { فِي ٱلدُّنْيَا } ولا في { وَٱلآخِرَةِ } بل ما ادعاه من نصر الله إياه في الدنيا والآخرة\n إنما هو لإثبات دعوه وترويج مدعاه\n وإلا فلا نصر له ولا ناصر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { إِن الله يُدخلُ الذين آمنوا } ، وتمكنوا من الإيمان، وعبدوا الله وحده في جميع الحالات، ولم يعبدوه على حرف، { وعملوا } الأعمال { الصالحات } ، { جناتٍ تجري من تحتها } أي: من تحت قصورها { الأنهارُ } الأربعة. وهذا بيان حال المؤمنين العابدين له تعالى في جميع الحالات، وأنَّ الله تفضل عليهم، بما لا غاية وراءه، إثر بيان سوء حال الكفرة، من المجاهرين والمذبذبين، وأنَّ معبودهم لا ينفعهم، بل يضرهم مضرة عظيمة. ثم قال تعالى: { إِن الله يفعل ما يريد } من الأفعال المتقنة، المبنية على الحِكَم البالغة الرائقة، التي من جملتها: إثابة من آمن به، وصدّق رسوله، وعبده على كل حال، وعقابُ من أشرك به، وكذب رسول الله، أو عبده على حرف. وبالله التوفيق. الإشارة: إن الله يُدخل الذين آمنوا، واطمأنوا به، وعبدوه في جميع الحالات، وقاموا بعمل العبودية في كل الأوقات، جنات المعارف، تجري من تحتها أنهار العلوم والحكم، إن الله يفعل ما يريد فيقرب هذا، ويُبعد هذا، بلا سبب \" جَلَّ حُكْمُ الأزلِ أن يُضَافَ إلى العِلَلِ \". وبالله التوفيق. ولما كان نفوذ هذا الوعيد من المشرعين وإنجاز وعد المؤمنين تصديقاً لرسوله\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:9",
      "similarity": 0.750779628284492
    },
    {
      "verse": "14:23",
      "similarity": 0.7091773372309987
    },
    {
      "verse": "85:11",
      "similarity": 0.6331832400495828
    },
    {
      "verse": "4:122",
      "similarity": 0.603013578188517
    },
    {
      "verse": "3:136",
      "similarity": 0.5676224229119122
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}