{
  "chapter": "الحج",
  "text": "ومن الناس من يعبد الله على حرف فان اصابه خير اطمان به وان اصابته فتنة انقلب على وجهه خسر الدنيا والءاخرة ذلك هو الخسران المبين",
  "translations": [
    {
      "translation": "Among the people there is one who worships Allah right on the edge. If good befalls him, he is content with it, but if a trial befalls him, he reverts to his former ways, losing both this world and the Next World. That is indeed sheer loss.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some men who worship God only from the margin. If there is some profit they are content; but if calamity befalls them they turn about, thus losing both this world and the next. This is indeed a palpable loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among people is he who worships Allah on the borderline; if any good befalls him, he is satisfied; but if a trial afflicts him, he utterly turns away. He will incur the loss of this world and the Hereafter. That indeed is a clear loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some people worship God to achieve worldly gains. They are confident when they are prosperous, but when they face hardships they turn away from (worship). They are lost in this life and will be lost in the life to come. Such loss is indeed destructive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are some men who worship Allah upon an edge; then if some good occurs to them, they are content; and if some trial comes, they turn way upon their faces; a loss of this world and the Hereafter; and this is the complete loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among mankind is he who worships Allah as it were upon the edge: if good befalls him, he is content therewith; but if a Fitnah strikes him, he turns back on his face. He loses both this world and the Hereafter. That is the evident loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men is he who serves Allah (standing) on the verge, so that if good befalls him he is satisfied therewith, but if a trial afflict him he turns back headlong; he loses this world as well as the hereafter; that is a manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men there is such a one as serves God upon the very edge -- if good befalls him he is at rest in it, but if a trial befalls him he turns completely over; he loses this world and the world to come; that is indeed the manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among mankind is he who worshippeth Allah upon a narrow marge so that if good befalleth him he is content therewith, but if a trial befalleth him, he falleth away utterly. He loseth both the world and the Hereafter. That is the sheer loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some who worship God half-heartedly, then, if some good befalls them, they are content with it, but if an ordeal befalls them, they revert to their former ways. They lose in this world as well in the Hereafter. That is a clear loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who worshippeth Allah as on edge; if there befalleth him good, he in contented therewith, and if there befalleth him a trial, he turneth round on his face; he loseth the world and the Hereafter: that indeed is a loss manifest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the people are those who worship Allah on the [very] fringe: if good fortune befalls him, he is content with it; but if an ordeal visits him he makes a turnabout, to become a loser in the world and the Hereafter. That is manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are among men some who serve Allah, as it were, on the verge: if good befalls them, they are, therewith, well content; but if a trial comes to them, they turn on their faces: they lose both this world and the Hereafter: that is loss for all to see!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among mankind is he who worships Allah as it were, upon the very edge (i.e. in doubt); if good befalls him, he is content therewith; but if a trial befalls him, he turns back on his face (i.e. reverts back to disbelief after embracing Islam). He loses both this world and the Hereafter. That is the evident loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are among the people such who worship Allah and (yet stand) on the very edge. When goodness comes to him, he is content, but if a trial befalls him he falls upon his face, he loses this world and the Everlasting Life; that is indeed a clear loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the people is he who worships God on edge. When something good comes his way, he is content with it. But when an ordeal strikes him, he makes a turnaround. He loses this world and the next. That is the obvious loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people is he who worships Allah on an edge. If he is touched by good, he is reassured by it; but if he is struck by trial, he turns on his face [to the other direction]. He has lost [this] world and the Hereafter. That is what is the manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:11] And among mankind there are those who worship God on a knife-edge: that is, with uncertainty in his worship — such [a person] has been likened the [knife-] edge of a mountain in his precariousness — if good [fortune] befalls him, [so that he enjoys] health and security with respect to his own self and his property, he is reassured by it; but if an ordeal befalls him, a trial or ill-health with regard to himself or his property, he makes a turnabout, that is, he reverts to disbelief, losing both this world, when what he had hoped for in it has eluded him, and the Hereafter, by [his] disbelief. That is the manifest loss.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And among mankind is he who worshippeth Allah upon a narrow marge) and among people there is he who worships Allah on an experimental basis, in doubt and because of expectation of some benefit. This was revealed about the Banu'l-Hallaf, the hypocrites of the Banu Asad and Ghatafan, (so that if good) a bounty (befalleth him he is content therewith) he is pleased with the religion of Muhammad (pbuh) but just with his tongue, (but if a trial) hardship (befalleth him, he falleth away utterly) he reverts to his first religion: associating partners with Allah. (He loseth both the world) by missing the life of this world (and the Hereafter) by losing Paradise. (That is the sheer loss) the loss of both this worldly life and the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمِنَ ٱلنَّاسِ مَن يَعْبُدُ ٱللَّهَ عَلَىٰ حَرْفٍ } معناه عَلَى شَكٍّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd among people is one who worships Allah on the basis of doubt.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ ٱلنَّاسِ } المجبولين على نسيان المنعم\n وكفران نعمه { مَن يَعْبُدُ ٱللَّهَ } المنزه المستغنٍ عن إيمانه وعبادته { عَلَىٰ حَرْفٍ } أي: شاكاً منتظراً على طرف بلا جزم منه فيه\n وطمأنينة كالذي يتمكن يوم الوغى على طرف الجيش متردداً منتظراً\n إن أحس الظفر قرَّ في مكانه وتمكن\n وإلا فرَّ\n كذلك هذا المؤمن المتزلزل { فَإِنْ أَصَابَهُ } بعدما آمن وأسلم { خَيْرٌ } أي: شيء سُرُّه وينشطه { ٱطْمَأَنَّ بِهِ } وتمكن لأجله متفائلاً بالإيمان والإسلام { وَإِنْ أَصَابَتْهُ } بعد اختياره الإيمانَ والإسلام { فِتْنَةٌ } أي: بليةُ ومصيبةُ تُمِلْه { ٱنْقَلَبَ } ورجع { عَلَىٰ وَجْهِهِ } أي: وجْهته وجِهَته التي تركها من الكفر متطيراً متشائماً بالإيمان والإسلام وبالجملة { خَسِرَ } ذلك المتزلزل المتذبذب { ٱلدُّنْيَا } بأنواع البليات والمصيبات { وَٱلأَخِرَةَ } بالحرمان عن درجات الجنان والخلود في دركات النيران بأنواع الخسران { ذٰلِكَ } الخسران المستوعب للنشأتين { هُوَ ٱلْخُسْرَانُ ٱلْمُبِينُ } [الحج: 11] العظيم\n لا خسران أعظم منه وأفحش\n وكيف لا يخسر ذلك المردود المطرود\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:75",
      "similarity": 0.49602762530320643
    },
    {
      "verse": "5:41",
      "similarity": 0.4102883079494669
    },
    {
      "verse": "8:10",
      "similarity": 0.38004212141304256
    },
    {
      "verse": "13:28",
      "similarity": 0.37963599855117774
    },
    {
      "verse": "3:126",
      "similarity": 0.37832449735234
    }
  ]
}