{
  "chapter": "الحج",
  "text": "ان الذين ءامنوا۟ والذين هادوا۟ والصبـين والنصرى والمجوس والذين اشركوا۟ ان الله يفصل بينهم يوم القيمة ان الله على كل شىء شهيد",
  "translations": [
    {
      "translation": "As for those who have iman and those who are Jews and the Sabaeans and the Christians, Magians and idolaters, Allah will distinguish between them on the Day of Rising. Allah is witness of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will judge between those who believe and the Jews, the Sabians, Christians and the Magians and the idolaters, on the Day of Judgement. Verily God is witness to everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection Allah will most certainly judge among those who believe, and those who became Jews, and Sabaeans, and Christians, and Magians, and those who associate others with Allah in His Divinity. Surely Allah watches over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Judgment, God will make truth and falsehood clearly distinct from each other to the believers, the Jews, the Sabeans, the Christian, the Zoroastrians, and the Pagans on the Day of Judgment. God is a Witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the Muslims, and the Jews, and the Sabeans, and the Christians and the fire worshippers and the polytheists – indeed Allah will decide between all of them on the Day of Resurrection; indeed Allah witnesses all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe, and those who are Jews, and the Sabians, and the Christians, and the Majus, and those who worship others besides Allah; truly, Allah will judge between them on the Day of Resurrection. Verily, Allah is over all things a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who believe and those who are Jews and the Sabeans and the Christians and the Magians and those who associate (others with Allah)-- surely Allah will decide between them on the day of resurrection; surely Allah is a witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they that believe, and those of Jewry, the Sabaeans, the Christians, the Magians and the idolaters -- God shall distinguish between them on the Day of Resurrection; assuredly God is witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who believe (this revelation), and those who are Jews, and the Sabaeans and the Christians and the Magians and the idolaters - Lo! Allah will decide between them on the Day of Resurrection. Lo! Allah is Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will judge between the believers, the Jews, the Sabaeans, the Christians, the Magians and the polytheists on the Day of Judgement. Surely God is witness to everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who believe and those who are Judaised and the Sabians and the Nazarenes and the Magians and those who associate - verily Allah will decide between them on the Day of Judgment; verily Allah is over everything a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah will indeed judge between the faithful, the Jews, the Sabaeans, the Christians, the Magians and the polytheists on the Day of Resurrection. Indeed Allah is witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe (in the Qur'an), those who follow the Jewish (scriptures), and the Sabians, Christians, Magians, and Polytheists,- Allah will judge between them on the Day of Judgment: for Allah is witness of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe (in Allah and in His Messenger Muhammad SAW), and those who are Jews, and the Sabians, and the Christians, and the Magians, and those who worship others besides Allah, truly, Allah will judge between them on the Day of Resurrection. Verily! Allah is Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, they that believe, and those of Jewry, the Sabaeans, the Nazarenes, the Magians, and the unbelievers, Allah will judge them on the Day of Resurrection. Surely, Allah is witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and those who are Jewish, and the Sabeans, and the Christians, and the Zoroastrians, and the Polytheists—God will judge between them on the Day of Resurrection. God is witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have believed and those who were Jews and the Sabeans and the Christians and the Magians and those who associated with Allah - Allah will judge between them on the Day of Resurrection. Indeed Allah is, over all things, Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:17] Truly those who believe, and those of Jewry, namely, the Jews, and the Sabaeans, a sect from among them, and the Christians, and the Magians and the polytheists — God will indeed judge between them on the Day of Resurrection, by admitting the believers into Paradise, and all others into the Fire. Assuredly God, over all things, [the things] which they do, is Witness, Knowing them a knowledge of direct vision (‘ilm mushāhada).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who believe) in Muhammad (pbuh) (and those who are Jews) the Jews of Medina, (and the Sabaeans) the Itinerants, a Christian sect (and the Christians) the Christians of Najran (and the Magians) the worshippers of the sun and fire (and the idolaters) the Arab idolaters. (Lo! Allah will decide between them on the Day of Resurrection. Lo! Allah is Witness over all things) Allah is aware of their differences and works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والأفعال جميعاً { وَٱلَّذِينَ هَادُواْ } وهم الذين آمنوا بموسى عليه السلام الهادي لأمته إلى توحيد الصفات { وَٱلصَّابِئِينَ } الذين يدَّعون الاطلاع على سرائر الكواكب والأجرام العلوية { وَٱلنَّصَارَىٰ } وهم الذين يصدقون بعيسى عليه السلام الهادي لأمته إلى توحيد الأفعال { وَٱلْمَجُوسَ } الذين يدَّعون التمييز بين فاعل الخير وفاعل الشر { وَٱلَّذِينَ أَشْرَكُوۤاْ } بالله المنزه عن الشريك\n كلُ من هؤلاء المذكورين يدعي الحقية لنفسه\n والباطل لغيره { إِنَّ ٱللَّهَ } المطلع لسرائرهم وضمائرهم { يَفْصِلُ بَيْنَهُمْ } أي: بين من هو المحق منهم والمبطل { يَوْمَ ٱلْقِيامَةِ } وكيف لا يميز ويفصل سبحانه { إِنَّ ٱللَّهَ } المتجلي في الآفاق والأنفس { عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ } [الحج: 17] أي: حاضرُ مع كل شيء رقيب عليه\n غير مغيب عنه أصلاً\n\n{ أَلَمْ تَرَ } أيها الرائي ولم تعلم { أَنَّ ٱللَّهَ } المظهر لجميع المظاهر { يَسْجُدُ } أي: يذلل ويخضع { لَهُ مَن فِي ٱلسَّمَٰوَٰتِ } من العلويات { وَمَن فِي ٱلأَرْضِ } من السفليات وخصوصاً معظمات الأجرام العلوية وهي { وَٱلشَّمْسُ وَٱلْقَمَرُ وَٱلنُّجُومُ } ومعظمات الأجسام من السلفيات { وَ } هي { ٱلْجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَآبُّ وَ } يسجد له أيضاً طوعاً { كَثِيرٌ مِّنَ ٱلنَّاسِ } المجبولين على فطرة التوحيد\n المخلوقين على استعداد الإيمان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: إنَّ { الله يفصل }: خبر \" إنَّ \" الأولى. يقول الحقّ جلّ جلاله: { إِن الذين آمنوا } بما ذكر من الآيات البينات، أو بكل ما يجب الإيمان به - فيدخل ما ذكر دخولاً أوليًا - أي: آمنوا بذلك، بهداية الله وإرادته، { والذين هادوا والصابئين } ، وهم قوم من النصارى، اعتزلوهم، ولبسوا المسوح، وقيل: أخذوا من دين النصارى شيئًا، ومن دين اليهود شيئًا، وهم القائلون بأن للعالم أصلين: نورًا وظلمة، ويعتقدون تأثير النجوم. { والمجوس } وهم الذين يعبدون النار، ويقولون: إن الخير من النور، والشر من الظلمة، { والذين أشركوا } ، وهم عبدة الأصنام من العرب وغيرهم، فهذه ستة أديان، خمسة للشيطان، وواحد للرحمن. { إِن الله يفصِلُ بينهم يوم القيامة } في الأحوال والأماكن، فلا يجازيهم جزاء واحدًا، ولا يجمعهم في موطن واحد. أو يحكم بين المؤمنين، وبين الفرق الخمسة المتفقة على ملة الكفر، بإظهار المحق من المبطل، فيُكْرم المحق ويهين المبطل، { إن الله على كل شيء شهيد } أي: عالم بكل شيء، مراقب لأحواله، حافظ له، مطلع على سره وعقده. ومن قضية الإحاطة بتفاصيل كل فرد من أفراد الفرق المذكورة: إجراء جزائه اللائق عليه، وهو أبلغ وعيد. والله تعالى أعلم. الإشارة: كما يفصل اللهُ يوم القيامة بين الملل المستقيمة والفاسدة يفصل أيضًا بين أرباب القلوب المستقيمة الصحيحة المعمورة بنور الله، وبين أرباب القلوب السقيمة الخاربة من النور، المعمورة بالظلمة من الوساوس والخواطر، فيرفع الأولين مع المقربين الصديقين، ويسقط الآخرين في أسفل سافلين، أو مع عامة أهل اليمين. وبالله التوفيق. ثمَّ برهن على كونه شهيداً على الاشياء بسجودها له",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:69",
      "similarity": 0.41073223888902793
    },
    {
      "verse": "2:62",
      "similarity": 0.4070345579570252
    },
    {
      "verse": "2:113",
      "similarity": 0.06835864985539561
    },
    {
      "verse": "5:51",
      "similarity": 0.062333255030547166
    },
    {
      "verse": "3:67",
      "similarity": 0.061683930975121065
    }
  ]
}