{
  "chapter": "الحج",
  "text": "ذلك بما قدمت يداك وان الله ليس بظلم للعبيد",
  "translations": [
    {
      "translation": "That is for what you did before. Allah does not wrong His slaves.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is on account of what you had done in the past; yet God is not unjust to His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the outcome of what your own hands have wrought, for Allah never wrongs His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will be told), \"This is the result of what your hands have wrought. God is certainly not unjust to His servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“This is the recompense of what your hands have sent ahead, and Allah does not oppress His bondmen.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because of what your hands have sent forth, and verily, Allah is not unjust to servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is due to what your two hands have sent before, and because Allah is not in the least unjust to the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is for what thy hands have forwarded and for that God is never unjust unto His servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And unto him it will be said): This is for that which thy two hands have sent before, and because Allah is no oppressor of His slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[God will say],\"This is the reward of your misdeeds. God is not unjust to His servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because of that which thy hands have sent forth, and verily Allah is not a wronger of His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘That is because of what your hands have sent ahead, and because Allah is not tyrannical to the servants.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said): \"This is because of the deeds which thy hands sent forth, for verily Allah is not unjust to His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because of what your hands have sent forth, and verily, Allah is not unjust to (His) slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This, is the reward for what your hands have forwarded. Allah is not unjust to the worshipers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is for what your hands have advanced, and because God is not unjust to the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is for what your hands have put forth and because Allah is not ever unjust to [His] servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:10] ‘That is [the chastisement] for what your hands have sent ahead, in other words, what you have offered [in the way of deeds] — He refers to him with reference to the two [hands] as opposed to other [parts], because most actions are effected through them — and because God is not unjust to His servants’, chastising them without [their having committed] any sin.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This) killing and shackling on the Day of Badr (is for that which thy two hands have sent before) is because of what your two hands did in your state of idolatry; Allah's words from: (And among mankind is he who disputeth concerning Allah without knowledge or guidance...) to (This is for that which your two hands have sent before) were revealed about al-Nadr Ibn al-Harth, (and because Allah is no oppressor of His slaves) such that He would punish them without them having committed any crime.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أمرناهم أن يقولوا له على سبيل المثال التقريع والتوبيخ زجراً عليه: { ذٰلِكَ } الذي لحقك وينزل عليك من العذاب المخلد { بِمَا قَدَّمَتْ } وكسبت { يَدَاكَ } في النشاة الأولى\n وعلى مقدار ما اقترفته من المعاصي والآثام بلا زيادة عليها عدلاً منَّا { وَ } اعلم أيها المسرف المبالغ في اقتراف الجرائم المستوجبة للعذاب { أَنَّ ٱللَّهَ } المتصف بالعدل القويم { لَيْسَ بِظَلَّٰمٍ لِّلعَبِيدِ } [الحج: 10] يعني: ليس بمبالغٍ في جزاء الانتقام عنه مقدار الجرائم والآثام مثل مبالغته في جزاء الإنعام والإحسان تفضلاً وامتناناً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } أي: ما ذكر من العذاب الدنيوي والأخروي\n وما في الإشارة من البُعد للإيذان بكونه في الغاية القاصية من الهول والفظاعة\n أي: ذلك العذاب الهائل { بما قدمتْ يداك } أي: بسبب ما اقترفْتَهُ من الكفر والمعاصي\n وإسناده إلى يديه لأن الاكتساب في الغالب بهما\n والالتفات لتأكيد الوعيد وتشديد التهديد\n أو يقال له يوم القيامة: { ذلك بما قدمت يداك وأنَّ الله ليس بظلام للعبيد } \n فلا يأخذ أحدًا بغير ذنب ولا بذنب غيره\n وهو خبر عن مضمر\n أي: والأمر أنَّ الله ليس بمعذبٍ لعبيده بغير ذنب\n وأما عطفه على \" بما \" فغير سديد\n ولفظ المبالغة لاقترانه بلفظ الجمع في العبيد\n ولأن قليل الظلم منه\n مع علمه بقبحه واستغنائه عنه\n كالكثير منا\n قاله النسفي\n  وقِيل: { ظلام }: بمعنى: ذي ظلم\n فتكون الصيغة للنَّسَبِ\n والتعبير عن ذلك بنفي الظلم\n مع أن تعذيبهم بغير ذنب\n ليس بظلم قطعًا\n على ما تقرر في مذهب أهل السنة\n فضلاً عن كونه ظلمًا بالغًا لأن الحق تعالى إنما يُظهر لنا كمال العدل\n وغاية التنزيه\n وإن كان في نفس الأمر جائز أن يعذب عباده بلا ذنب\n ولا يسمى ظلمًا لأنه تصرف في ملكه\n لكنه تعالى لم يظهر لنا في عالم الشهادة إلا كمال العدل\n\nوالله تعالى أعلم\n الإشارة: من يخاصم في طريق القوم\n وينفيها عن أهلها\n إما أن يكون تقليدًا\n وهو ما تقدم\n أو يكون تكبرًا وعتوًا\n بحيث لم يرض أن يحط رأسه لهم\n وهو ما أشير إليه هنا\n ولا شك أن المتكبر لا بد أن يلحقه ذل\n ولو عند الموت\n ويوم القيامة يُحشر صاغرًا كالذر\n كما في الحديث\n والله تعالى أعلم\n ثمَّ ذكر حال المذبذبين بعد ذكر حال المجادلين: { وَمِنَ ٱلنَّاسِ مَن يَعْبُدُ ٱللَّهَ عَلَىٰ حَرْفٍ فَإِنْ أَصَابَهُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:182",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "8:51",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "49:1",
      "similarity": 0.552806175342218
    },
    {
      "verse": "15:24",
      "similarity": 0.5160055054174101
    },
    {
      "verse": "74:37",
      "similarity": 0.5112945417335801
    }
  ]
}