{
  "chapter": "الحج",
  "text": "من كان يظن ان لن ينصره الله فى الدنيا والءاخرة فليمدد بسبب الى السماء ثم ليقطع فلينظر هل يذهبن كيده ما يغيظ",
  "translations": [
    {
      "translation": "He who thinks that God will not help him in this world and the next should stretch a rope to the sky then cut it off and see if his mind is relieved (of doubts) by this stratagem.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anyone who fancies that Allah will not support him in this world and in the Hereafter, let him reach out to heaven through a rope, and then make a hole in the sky and see whether his device can avert that which enrages him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who thought that God would never grant victory to (Muhammad), in this world nor in the life hereafter (and now that he is victorious) should hang themselves by the necks from the ceiling, then cut the rope and see if this can do away with what has enraged them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore whoever assumes that Allah will not assist His Prophet (Mohammed – peace and blessings be upon him) in this world and the Hereafter, should extend a rope upwards and hang himself, and then see whether his scheme has taken away what he envies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever thinks that Allah will not help him in this world and in the Hereafter, let him stretch out a rope to the ceiling and let him strangle himself. Then let him see whether his plan will remove that whereat he rages!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever thinks that Allah will not assist him in this life and the hereafter, let him stretch a rope to the ceiling, then let him cut (it) off, then let him see if his struggle will take away that at which he is enraged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever thinks God will not help him in the present world and the world to come; let him stretch up a rope to heaven, then let him sever it, and behold whether his guile does away with what enrages him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso is wont to think (through envy) that Allah will not give him (Muhammad) victory in the world and the Hereafter (and is enraged at the thought of his victory), let him stretch a rope up to the roof (of his dwelling), and let him hang himself. Then let him see whether his strategy dispelleth that whereat he rageth!.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anyone who thinks that God will not help him [His messenger] in this world and the Hereafter, let him stretch a rope up to the sky; then let him cut it off and see if his plan can help to remove the cause of his anger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever hath been imagining that Allah shall not make him victorious in the world and the Hereafter, let him stretch a cord up to the heaven and let him cut it, and let him look if his stratagem can do away that whereat he enrageth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever thinks that Allah will not help him in this world and the Hereafter, let him stretch a rope to the ceiling and hang himself, and see if his artifice would remove his rage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any think that Allah will not help him (His Messenger) in this world and the Hereafter, let him stretch out a rope to the ceiling and cut (himself) off: then let him see whether his plan will remove that which enrages (him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever thinks that Allah will not help him (Muhammad SAW) in this world and in the Hereafter, let him stretch out a rope to the ceiling and let him strangle himself. Then let him see whether his plan will remove that whereat he rages!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any one thinks that Allah will not give him (Prophet Muhammad) victory in this present world and in the Everlasting Life, let him stretch a rope to heaven, and let him sever it. Then, let him see if his guile does away with that which has enraged him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever thinks that God will not help him in this life and in the Hereafter—let him turn to heaven, then sever, and see if his cunning eliminates what enrages him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever should think that Allah will not support [Prophet Muhammad] in this world and the Hereafter - let him extend a rope to the ceiling, then cut off [his breath], and let him see: will his effort remove that which enrages [him]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:15] Whoever supposes that God will not help him, namely, Muhammad (s) His Prophet, in this world and the Hereafter, let him extend a rope to the ceiling, [to] the roof of his house, fixing it there and [tying it] to his neck, and let him hang himself, that is, let him choke to death because of it, by severing his soul from [any existence on] the earth, as [reported] in the [various] Sahīh compilations. Then let him see whether his strategy, against the Prophet being helped, dispels that which enrages him, about it. In other words, let him choke to death with rage because of it, for it is inevitable.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso is wont to think that Allah will not give him) i.e. Muhammad (pbuh) (victory in the world and the Hereafter) through reason and proof, (let him stretch a rope up to the roof (of his dwelling), and let him hang himself. Then let him see) let him reflect upon (whether his strategy) hanging himself (dispelleth that whereat he rageth!) i.e. regarding Muhammad (pbuh). It is also said that there is another way of understanding this passage: whoever thinks that Allah will not help him in this worldly life with sustenance and in the Hereafter with reward, then let him tie a rope to the roof of his house, hang himself with it and see whether killing himself will dispel his rage regarding sustenance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَن كَانَ يَظُنُّ أَن لَّن يَنصُرَهُ ٱللَّهُ فِي ٱلدُّنْيَا وَٱلآخِرَةِ } معناه لَنْ يَرْزُقَهُ\n وقالَ مَنْ كَانَ يَظُنُ أَنْ لَنْ يَنصُرَ الله تعالى محمداً صلى الله عليهِ وعلى آلهِ وسلمَ في الدُّنيا والآخِرةِ\n\n\n\n\nوقوله تعالى: { فَلْيَمْدُدْ بِسَبَبٍ إِلَى ٱلسَّمَآءِ } فالسَّببُ: الحَبلُ\n والسَّماءُ: سَماءُ البَيتِ: معناهُ سَقفُهُ\n فليَختَفْ { فَلْيَنْظُرْ هَلْ يُذْهِبَنَّ كَيْدُهُ مَا يَغِيظُ }\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما اعتقد المشركون من في قلبه عداوة راسخة مع رسول الله صلى الله عليه وسلم، وشيكمةُ شديدة، وغيظُ مفرط ألاَّ نصرَ ولا إعانة له من عند الله لا في الدنيا ولا في الآخرة كما زعمه ردَّ الله عليهم نصراً له وترويجاً لقوله، فقال: { مَن كَانَ يَظُنُّ أَن لَّن يَنصُرَهُ ٱللَّهُ } ولن يعين رسوله صلى الله عليه وسلم لا { فِي ٱلدُّنْيَا } ولا في { وَٱلآخِرَةِ } بل ما ادعاه من نصر الله إياه في الدنيا والآخرة، إنما هو لإثبات دعوه وترويج مدعاه، وإلا فلا نصر له ولا ناصر، يقال للمنكر: إن شئت إزالة غيظك وحسدك عنه صلى الله عليه وسلم { فَلْيَمْدُدْ بِسَبَبٍ } أي: بحبل { إِلَى ٱلسَّمَآءِ } أي: نحوها وارتفع معلقاً بالحبل إلى أن يتباعد من الأرض مسافة بعيدة { ثُمَّ } يقال له بعدما ارتفع من الأرض: { لْيَقْطَعْ } الحبل وانفصل عنه، فقطع فوقع { فَلْيَنْظُرْ } بعدما وقع { هَلْ يُذْهِبَنَّ كَيْدُهُ } مكره وحيلته { مَا يَغِيظُ } [الحج: 15] أي: غيظه برسول الله تعالى صلى الله عليه وسلم\n\n\n\n\nوباجملة ما يزول إنكار المنكرين، وغيظ المشركين مع رسول الله صلى الله عليه وسلم إلا بهذه الحيلة والكيد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: لا تظنوا أن الله غير ناصر لرسوله صلى الله عليه وسلم بل هو ناصر له في الدنيا والآخرة لا محالة، فمن كان { يظن أن لن ينصرهُ الله في الدنيا والآخرة } ، ويغيظه ذلك من أعاديه وحُساده، ويفعل ما يدفع ذلك من الخدع والمكائد، فليبالغ في استفراغ المجهود، وليجاوز كل حد معهود، فعاقبة أمره أن يختنق خنقًا من ضلال مساعيه، وعدم إنتاج مقدماته ومبادئه\n { فليمدد بسبب إِلى السماء } أي: فليمدُد حبلاً إلى سقف بيته، { ثم ليقطع } أي: ليختنق، من قَطعَ: إذا اختنق لأنه يقطع نفَسه بحبس مجاريه\n أو: ليقطع من الأرض، بعد ربط الحبل في العنق وربطه في السقف\n { فلينظر هل يُذهِبَنَّ كيدُه } أي: فليصور في نفسه أنه إن فعل ذلك هل يذهب نصر الله الذي يغيظه بسبب فعله، وسمى فعله كيدًا، على سبيل الاستهزاء لأنه لم يكد به محسوده، إنما كاد به نفسه\n والمراد: ليس في يده إلا ما لَيْسَ بمُذهب لما يغيظه، فَتَحَصَّل أن الضمير في { ينصره } يعود على النبي صلى الله عليه وسلم، وإن لم يتقدم ذكره صراحة، لكنه معهود إذ الوحي إنما ينزل عليه\n وقيل: يعود على { مَن } ، والمعنى على هذا: من ظن - بسبب ضيق صدره، وكثرة غمه - أن لن ينصره الله، فليختنق وليمت بغيظه، فإنه لا يقدر على غير ذلك، فموجب الاختناق، على هذا، القنوطُ والسخط من القضاء، وسوء الظن بالله تعالى، حتى يئس من نصره\n قال ابن جزي: وهذا القول أرجح من الأول لوجهين: أحدهما: أن هذا القول مناسب لمن يعبد الله على حرف لأنه، إذا أصابته فتنة، انقلب وقنط، حتى ظنّ أن لن ينصره الله\n ويؤيده من فسّر { أن لن ينصره الله } أي: لن يرزقه إذ لا خير في حياة تخلو من عون الله عزّ وجلّ، فيكون الكلام، على هذا، متصلاً بما قبله\n ويؤيده أيضًا: قوله تعالى، قبله: { إن الله يفعل ما يريد } أي: الأمور بيد الله، فلا ينبغي لأحد أن يسخط من قضاء الله، ولا ينقلب إذا أصابته فتنة، والوجه الثاني: أن الضمير في \" ينصره \" ، على هذا، يعود على ما تقدّمه ذكر، دون الأول\n هـ\n وانظر ابن عطية والكواشي، ففيهما ما يدفع درك ابن جزي، ورده للأول، بما في سبب الآية ونزولها من المناسبة",
      "translations": []
    }
  ]
}