{
  "chapter": "الحج",
  "text": "يوم ترونها تذهل كل مرضعة عما ارضعت وتضع كل ذات حمل حملها وترى الناس سكرى وما هم بسكرى ولكن عذاب الله شديد",
  "translations": [
    {
      "translation": "On the day they see it, every nursing woman will be oblivious of the baby at her breast, and every pregnant woman will abort the contents of her womb, and you will think people drunk when they are not drunk; it is just that the punishment of Allah is so severe.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day you see it every suckling female will forget her suckling, and every pregnant female will discharge her burden. You will see men drunk, yet it will not be intoxication. The torment of God will be severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when you witness it, the suckling woman shall utterly neglect the infant she suckles, and every pregnant woman shall cast her burden, and you will see people as though they are drunk, when they are not drunk; but dreadful shall be Allah's chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When that hour comes, every breast-feeding mother will drop her baby out of fear and every pregnant female will cast off her burden. You will see the people behaving as though they were drunk, while, in fact, they are not drunk. They only will look such because of the severity of God's torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when you will witness it, every nursing mother will forget her nurseling and every pregnant one will discharge her burden, and you (O dear Prophet Mohammed – peace and blessings be upon him) will see people as if they are drunk, whereas they will not be intoxicated, but the fact is that Allah’s punishment is very severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day you shall see it, every nursing mother will forget her nursling, and every pregnant one will drop her load, and you shall see mankind as in a drunken state, yet they will not be drunk, but Allah's torment is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when you shall see it, every woman giving suck shall quit in confusion what she suckled, and every pregnant woman shall lay down her burden, and you shall see men intoxicated, and they shall not be intoxicated but the chastisement of Allah will be severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the day when you behold it, every suckling woman shall neglect the child she has suckled, and every pregnant woman shall deposit her burden, and thou shalt see mankind drunk, yet they are not drunk, but God's chastisement is terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when ye behold it, every nursing mother will forget her nursling and every pregnant one will be delivered of her burden, and thou (Muhammad) wilt see mankind as drunken, yet they will not be drunken, but the Doom of Allah will be strong (upon them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when that Day comes, every suckling mother shall forsake her infant and every pregnant woman shall cast her burden and everyone will appear intoxicated, although they are not: the punishment of God will be severe indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day whereon ye behold it, every suckling woman shall forget that which she suckleth, and every burthened woman shall lay down her burthen; and thou shalt behold mankind as drunken, whereas drunken they will be not, but the torment of Allah shall be severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day that you will see it, every suckling female will be unmindful what she suckled, and every pregnant female will deliver her burden, and you will see the people drunk, yet they will not be drunken, but Allah’s punishment is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day ye shall see it, every mother giving suck shall forget her suckling-babe, and every pregnant female shall drop her load (unformed): thou shalt see mankind as in a drunken riot, yet not drunk: but dreadful will be the Wrath of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day you shall see it, every nursing mother will forget her nursling, and every pregnant one will drop her load, and you shall see mankind as in a drunken state, yet they will not be drunken, but severe will be the Torment of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day you will see every one that suckles shall forsake her suckling, and every carrier shall miscarry, and you shall see mankind drunk although they arenot drunk; dreadful will be the punishment of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when you will see it: every nursing mother will discard her infant, and every pregnant woman will abort her load, and you will see the people drunk, even though they are not drunk—but the punishment of God is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day you see it every nursing mother will be distracted from that [child] she was nursing, and every pregnant woman will abort her pregnancy, and you will see the people [appearing] intoxicated while they are not intoxicated; but the punishment of Allah is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:2] On the day when you behold it, every, actually, nursing female, on account of this [tremendous day], will neglect her suckling, that is, she will forget it; and every pregnant female will deliver her burden, and you will see mankind [as though] drunk, because of the severity of [their] fear, yet they will not be drunk, because of any drink; but God’s chastisement is severe, and so they will be terrified of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when ye behold it) when you see it upon the first blowing of the Trumpet, (every nursing mother will forget) will be preoccupied from (her nursling and every pregnant one will be delivered of her burden) of pregnancy, (and thou (Muhammad) wilt see mankind) standing and (drunken, yet they will not be drunken) from intoxicants, (but the Doom of Allah will be strong (upon them)) this is why they were dazzled as if they were drunk.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحدّثنا أبو جعفر قال: حدّثنا علي بن أحمد قال: أخبرنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السلام في قولِه تعالى: { يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّآ أَرْضَعَتْ } معناه تَسلُو وتَنسَى\n\n",
      "translations": [
        {
          "translation": "\n\nWe were told by Abu Ja'far that he was told by Ali ibn Ahmad that he was told by 'Ata ibn al-Sa'ib from Abu Khalid from Zayd ibn Ali (peace be upon them) regarding the words of the Almighty {the day you see it, every nursing mother will be distracted by the child she is nursing}, meaning that she will be confused and forgetful.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أو كل نفس حاملة لما فيها من الهيئات والصفات من الفضائل والرذائل بإظهارها وإبرازها { وترى الناس سكارى } من سكرات الموت\n ذاهلين\n مغشيّاً عليهم { وما هم بسكارى } في الحقيقة من الشراب\n ولكن من شدّة العذاب\n { وترى } أرض النفس { هامدة } ميتة بالجهل لا نبات فيها من الفضائل والكمالات\n { فإذا أنزلنا عليها } ماء العلم من سماء الروح { اهتزّت } بالحياة الحقيقية { وربت } بالترقي في المقامات والمراتب { وأنبتت من كل } صنف { بهيج } من الكمالات والفضائل المزينة لها { ذلك بـ } سبب { أنّ الله هو الحق } الثابت الباقي وما سواه هو المغيّر الفاني { وأنه يحيي } موتى الجهل بفيض العلم في القيامة الوسطى كما يحيي موتى الطبع في القيامة الصغرى { وأنّ الساعة } بالمعنيين { آتية وأنّ الله يبعث من في القبور } أي: قبر البدن من موتى الجهل في الساعة الوسطى بالقيام في موضع القلب والعود إلى الفطرة وحياة العلم كما يبعث موتى الطبع في النشأة الثانية والقيامة الصغرى { بغير علم } أي: استدلال { ولا هدى } ولا كشف ووجدان { ولا كتاب } ولا وحي وفرقان { يدعو } مما سوى الله { ما لا يضرّه وما لا ينفعه } كائناً ما كان فإن الاحتجاب الغيري { هو الضلال البعيد } عن الحق وإنما كان ضرّه أقرب من نفعه لأن دعوته والوقوف معه يحجبه عن الحق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر أيها الرائي: { يَوْمَ تَرَوْنَهَا } أي: تلك الزلزلة الشديدة المهيبة بحيث { تَذْهَلُ } أي: تدهش وتغفل من غاية دهشتها { كُلُّ مُرْضِعَةٍ } مشفقة متحنننة { عَمَّآ أَرْضَعَتْ } أي: ولدها الرضيع مع كمال محبتها ومودتها { وَتَضَعُ } عند حدوثها من شدة هولها وفزعها { كُلُّ ذَاتِ حَمْلٍ } وحبلٍ { حَمْلَهَا } وجنينها { وَ } بالجملة { تَرَى } أيها الرائي { ٱلنَّاسَ } أي: جميع الأنام عند حدوثها { سُكَارَىٰ } حيارى مدهوشين\n زائلين عقولهم من شدة الهول { وَمَا هُم بِسُكَارَىٰ } حقيقة { وَلَـٰكِنَّ عَذَابَ ٱللَّهِ } النازل إياهم في تلك الحالة { شَدِيدٌ } [الحج: 2] مدهش محير لعقولهم وأبصارهم\n وجميع قواهم ومشاعرهم\n\n\n{ وَ } كيف لا يكون لله المنتقم الجبار ذي القدرة الكاملة والغيرة التامة العذاب والنكال في النشأة الأخرى لمن يسيء الأدب معه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { يوم ترونها } أي: الزلزلة\n وتُشاهدون هول مطلعها\n { تذهل كل مرضعة } أي: مباشرة للإرضاع\n { عما أرضعت } أي: تغفل وتغيب\n من شدة الدهش عما هي بصدد إرضاعه من طفلها\n الذي ألقمته ثديها\n فالمرضعة\n بالتاء\n هي المباشرة الإرضاع بالفعل\n والمرضع - بلا تاء - لمن شأنها ترضع\n ولو لم تباشر الإرضاع\n والتعبير عنه \" بما \" \n دون \" من \" لتأكيد الذهول\n كأنها من شدة الهول لا تدري من هو بخصوصه\n وقيل: \" ما \" مصدرية\n أي: تذهل عن إرضاعها\n\nوالأول أدل على شدة الهول وكمال الانزعاج\n { وتضع كل ذات حملٍ حملها } أي: تلقى جنينها من غير تمام\n كما أن المرضعة تذهل عن ولدها قبل الفطام\n وهذا على قول من يقول: إنها قبل نفخة الصعق ظاهر\n وأما على من يقول\n إنها بعد قيام الساعة\n فقد قيل: إنه تمثيل لتهويل الأمر وشدته\n { وترى الناس سُكارى } أي: وترى أيها الناظر الناس سكارى\n على التشبيه\n من شدة الهول\n كأنهم سكارى لمّا شاهدوا بساط العزة وسلطنة القهرية\n حتى قال كلُّ نبي: نفسي نفسي\n { وما هم بسُكارى } على التحقيق\n { ولكنَّ عذاب الله شديد } \n فخوف عذابه هو الذي أذهل عقولهم\n وطيَّر تمييزهم\n وردهم في حال من يَذهب السكُر بعقله وتمييزه\n وعن الحسن: وترى الناس سكارى من الخوف\n وما هم بسكارى من الشراب\n وقرئ: سكْرى كعطشى\n والمعنى واحد\n غير أن فعلى يختص بما فيه آفة\n كجرحى وقتلى ومرضى\n والله تعالى أعلم\n الإشارة: يا أيها الناس اتقوا ربكم وتوجهوا إليه بكليتكم\n حتى تُشرق على قلوبكم أنوار ربكم\n فتزلزل أرض نفوسكم\n وتدك جبال عقولكم\n عند سطوع شمس العرفان\n والاستشراف على مقام الإحسان\n إن زلزلة الساعة\n التي تشرف فيها على أسرار الذات\n شيء عظيم\n يوم ترونها تذهل كل مرضعة عما أرضعت\n لو كانت أنثى\n وتضع كل ذات حمل حملها كذلك\n أو تضع كل ذات حمل أثقالها بالغيبة في ربها\n وترى الناس سكارى من خمر المحبة\n وما هم بسكارى من شراب الدَّوالي\n لكن من خمر الكبير المتعالي\n كما قال الششتري في الخمرة الأزلية - بعد كلام -:\nولكن عذاب الله - الذي قدمه قبل دخول جنته المعنوية وحفت به\n وهي جنة المعارف - شديد\n ولكنه يحلو في جانب ما ينال بعده\n كما قال الشاعر:",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "65:6",
      "similarity": 0.23756158119973636
    },
    {
      "verse": "15:15",
      "similarity": 0.20370249786822217
    },
    {
      "verse": "15:72",
      "similarity": 0.18492022188992616
    },
    {
      "verse": "28:7",
      "similarity": 0.18475106585335288
    },
    {
      "verse": "16:67",
      "similarity": 0.1818505252361625
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/22:2.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/22:2.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}