{
  "chapter": "الحج",
  "text": "ليشهدوا۟ منفع لهم ويذكروا۟ اسم الله فى ايام معلومت على ما رزقهم منۢ بهيمة الانعم فكلوا۟ منها واطعموا۟ البائس الفقير",
  "translations": [
    {
      "translation": "so that they can be present at what will profit them and invoke Allah's name on specific days over livestock He has provided for them. Eat of them and feed those who are poor and in need.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to reach the place of advantage for them, and to pronounce the name of God on appointed days over cattle He has given them for food; then eat of the meat and feed the needy and the poor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to witness the benefits in store for them, and pronounce the name of Allah during the appointed days over the cattle that He has provided them. So eat of it and feed the distressed and the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to see their benefits, commemorate the name of God during the appointed days, and offer the sacrifice of the cattle that God has given them. They themselves should consume part of the sacrificial flesh and give the rest to the destitute and needy people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that they may gain their benefit, and mention the name of Allah on the appointed days as He has bestowed the sustenance to them – the inarticulate animals; therefore eat from them yourself and feed the distressed destitute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may witness things that are of benefit to them, and mention the Name of Allah on appointed days, over the beast of cattle that He has provided for them. Then eat thereof and feed therewith the poor having a hard time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may witness advantages for them and mention the name of Allah during stated days over what He has given them of the cattle quadrupeds, then eat of them and feed the distressed one, the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they may witness things profitable to them and mention God's Name on days well-known over such beasts of the flocks as He has provided them: \"So eat thereof, and feed the wretched poor.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may witness things that are of benefit to them, and mention the name of Allah on appointed days over the beast of cattle that He hath bestowed upon them. Then eat thereof and feed therewith the poor unfortunate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that they may witness its benefit for them and, on the appointed days may utter the name of God over the cattle He has provided for them. Then eat their flesh, and feed the distressed and the needy --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may witness the benefits to them and may mention the name of Allah on the days known over the beast cattle wherewith He hath provided them. So eat thereof, and feed the hungry poor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they may witness the benefits for them, and mention Allah’s Name during the known days over the livestock He has provided them. So eat thereof and feed the destitute and the needy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may witness the benefits (provided) for them, and celebrate the name of Allah, through the Days appointed, over the cattle which He has provided for them (for sacrifice): then eat ye thereof and feed the distressed ones in want.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may witness things that are of benefit to them (i.e. reward of Hajj in the Hereafter, and also some worldly gain from trade, etc.), and mention the Name of Allah on appointed days (i.e. 10th, 11th, 12th, and 13th day of Dhul-Hijjah), over the beast of cattle that He has provided for them (for sacrifice) (at the time of their slaughtering by saying: Bismillah, WAllahu-Akbar, Allahumma Minka wa Ilaik). Then eat thereof and feed therewith the poor who have a very hard time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they witness profitable things for them and mention the Name of Allah on well known days over the flocks which He has provided them. Eat thereof, and feed the wretched poor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may witness the benefits for themselves, and celebrate the name of God during the appointed days, for providing them with the animal livestock. So eat from it, and feed the unfortunate poor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they may witness benefits for themselves and mention the name of Allah on known days over what He has provided for them of [sacrificial] animals. So eat of them and feed the miserable and poor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:28] that they may witness, that they may be present before, things that are of benefit to them, in this world, such as commerce, or [of benefit] in the Hereafter, or in both — all [of which are [valid alternative] opinions — and mention God’s Name on appointed days, namely, the ten days of Dhū’l-Hijja, or the Day of ‘Arafa, or from the Day of Immolation up to the last days of tashrīq — all of which are [valid alternative] opinions —   over the livestock which He has provided them, such as the camels, cows and sheep immolated on the Day of the ‘Īd, and any subsequent offerings or sacrifices. “So eat thereof, if it be recommended, and feed the wretched poor”, that is, the one in dire poverty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That they may witness things that are of benefit to them) the benefits of this worldly life and the benefits of the Hereafter; the benefit of the Hereafter through supplications and worship and the benefit of this worldly life through trade and making profit (and mention the name of Allah) and so that they mention the name of 366 Allah (on appointed days) on well known days, the days of tashriq (over the beast of cattle that He hath bestowed upon them) the beast of cattle offered for immolation. (Then eat thereof) eat from the beasts of cattle you immolated (and feed therewith the poor unfortunate).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِّيَشْهَدُواْ مَنَافِعَ لَهُمْ } معناه تجاراتٌ كانوا يَقدِمُون بها، وَمَا رَضى الله عزّ وجلَّ من أمر الدُّنيا والآخرةِ\n\n\n\n\nوقوله تعالى: { وَيَذْكُرُواْ ٱسْمَ ٱللَّهِ فِيۤ أَيَّامٍ مَّعْلُومَاتٍ } معناه أيامُ العَشرِ\n\n\n\n\nوقوله تعالى: { عَلَىٰ مَا رَزَقَهُمْ مِّن بَهِيمَةِ ٱلأَنْعَامِ } فالبَهائمُ: الأنعامُ\n\n\n\n\nوقوله تعالى: { ٱلْبَآئِسَ ٱلْفَقِيرَ } فالبَائسُ: المَعروفُ بالبؤسِ\n والفَقيرُ: المُتعففُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وَأذّن في الناس } بالدعوة إلى مقام القلب وزيارته { يأتوك رجالا } مجرّدين عن صفات النفوس { وعلى كل } نفس ضامرة بطول الرياضة والمجاهدة { يأتين من كل } طريق بعيد العمق في قعر الطبيعة { ليشهدوا منافع لهم } من الفوائد العلمية والعملية المستفادة من مقام القلب { ويذكروا اسم الله } بالاتّصاف بصفاته { في أيام معلومات } من أنوار التجليات والمكاشفات { على ما رزقهم من بهيمة } أنعام النفوس المذبوحة تقرّباً إلى الله تعالى بحراب المخالفات وسكاكين المجاهدات { فكلوا } استفيدوا من لحوم أخلاقها وملكاتها المعينة المقوّية في السلوك { وأطعموا } أي: أفيدوا { البائس } الطالب القوي النفس، الذي أصابه شدّة من غلبة صفاتها واستيلاء هيئاتها للتهذيب والتأديب، والفقير الضعيف النفس، القديم العلم، الذي أضعفه عدم التعليم والتربية المحتاج إليها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ليشهدوا منافعَ لهم } أي: يأتوك ليحضروا منافع لهم، دنيوية ودينية، لا تُوجد في غير هذه العبادة كالطواف ونظر الكعبة، وتضعيف أمر الصلاة لأن العبادة شرعت للابتلاء بالنفس كالصلاة والصوم، أو بالمال، وقد اشتمل الحج عليهما، مع ما فيه من تحمل الأثقال وركوب الأهوال، وقطع الأسباب وقطيعة الأصحاب، وهجرة البلاد والأوطان، ومفارقة الأهل والولدان\n ولذلك ورد أنه يُكفر الذنوب كلها، كما في الحديث:\n\n \" مَنْ حَجَّ هَذا البَيْتَ فَلَمْ يَرْفُثْ، وَلَمْ يَفْسُقْ، رَجعَ من ذُنُوبِه كَيَوْمِ وَلَدَتْهُ أُمُّهُ \" \n\n{ ويذكروا اسمَ الله } عند ذبح الضحايا والهدايا { في أيام معدوداتٍ } ، وهي أيام النحر عند مالك، وعند الشافعي: اليوم الأول والثاني والثالث لأن هذه هي أيام الضحايا عنده\n ولم يجز ذبحها بالليل لقوله: { في أيام }\n وقال أبو حنيفة: الأيام المعلومات: عشر ذي الحجة ويوم النحر، وهو قول ابن عباس رضي الله عنه، وأما الأيام المعدودات، فهي: الثلاثة بعد يوم النحر - فيوم النحر معلوم لا معدود -، ورابعه: معدود لا معلوم، واليومان بعده: معلومان ومعدودان\n\n\nفيذكروا اسم الله { على ما رزقهم } أي: على ذبح ما رزقهم { من بهيمة الأنعام } ، وهي الإبل والبقر والغنم، { فكُلُوا منها } من لحومها، والأمر: للإباحة، ولإزاحة ما كانت عليه الجاهلية من التحرج\n قال ابن جزي: ويُستحب أن يأكل الأقل من الضحايا، ويتصدق بالأكثر\n هـ\n وقال النسفي: ويجوز الأكل من هَدي التطوع والمتعة والقِران لأنه دم نسك لأنه أشبه الأضحية، ولا يجوز الأكل من بقية الهدايا\n هـ\n وهو حنفي، وفي مذهب مالك تفصيل يطول ذكره\n { وأطعموا البائسَ } ، وهو الذي أصابه البؤس، أي: ضرر الحاجة، وقيل: المتعفف، وقيل: الذي يظهر عليه أثر الجوع، { الفقير }: المحتاج الذي أضعفه الإعسار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:1",
      "similarity": 0.5281910159777274
    },
    {
      "verse": "22:34",
      "similarity": 0.5074622588233876
    },
    {
      "verse": "75:25",
      "similarity": 0.23275106422319478
    },
    {
      "verse": "35:15",
      "similarity": 0.23133276931129088
    },
    {
      "verse": "2:271",
      "similarity": 0.22998096277628785
    }
  ]
}