{
  "chapter": "الحج",
  "text": "واذ بوانا لابرهيم مكان البيت ان لا تشرك بى شيـا وطهر بيتى للطائفين والقائمين والركع السجود",
  "translations": [
    {
      "translation": "And We located the position of the House for Ibrahim: 'Do not associate anything with Me and purify My House for those who circle it, and those who stand and bow and prostrate.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We chose the site of the House for Abraham (We said:) \"Associate no one with Me, and clean My House for those who will circumambulate it, stand (in reverence), and bow in homage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call to mind when We assigned to Abraham the site of the House (Kabah), directing him: \"Do not associate aught with Me\" and \"Keep My House pure for those who walk around it, and for those who stand and who bow down and who prostrate themselves (in worship),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We prepared for Abraham the place to build the Sacred House, We told him not to consider anything equal to Me and to keep the House clean for those walking around it, those standing, bowing down, and prostrating in prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when We showed Ibrahim the right place of the Sacred House (mosque) and commanded that, “Do not ascribe anything as a partner to Me, and keep My House clean for those who encircle it and those who stay in it (for worship) and those who bow and prostrate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We showed Ibrahim the site of the House (saying): \"Associate not anything with Me, and sanctify My House for those who circumambulate it, and those who stand up (for prayer), and those who bow and make prostration (in prayer);\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We assigned to Ibrahim the place of the House, saying: Do not associate with Me aught, and purify My House for those who make the circuit and stand to pray and bow and prostrate themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We settled for Abraham the place of the House: 'Thou shall not associate with Me anything. And do thou purify My House for those that shall go about it and those that stand, for those that bow and prostrate themselves;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We prepared for Abraham the place of the (holy) House, saying: Ascribe thou no thing as partner unto Me, and purify My House for those who make the round (thereof) and those who stand and those who bow and make prostration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We assigned to Abraham the site of the House, saying, \"Do not associate with Me anything and purify My House for those who circumambulate [the Kabah] and those who stand upright, and those who bow and prostrate themselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We settled Ibrahim in the place of the House, Saying: associate not thou with Me aught, and purify My House for these who circumambulate and those who stand up and those who bow and make prostration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We settled for Abraham the site of the House [saying], Do not ascribe any partners to Me, and purify My House for those who circle around it, and those who stand [in it for prayer], and those who bow and prostrate themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! We gave the site, to Abraham, of the (Sacred) House, (saying): \"Associate not anything (in worship) with Me; and sanctify My House for those who compass it round, or stand up, or bow, or prostrate themselves (therein in prayer).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We showed Ibrahim (Abraham) the site of the (Sacred) House (the Ka'bah at Makkah) (saying): \"Associate not anything (in worship) with Me, [La ilaha ill-Allah (none has the right to be worshipped but Allah Islamic Monotheism], and sanctify My House for those who circumambulate it, and those who stand up for prayer, and those who bow (submit themselves with humility and obedience to Allah), and make prostration (in prayer, etc.);\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We settled for Abraham (and Ishmael) the place of the Holy Mosque, (We said): 'You shall not associate with Me anything. Purify My House for those who circumambulate it and those who stand, for those who bow and prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We showed Abraham the location of the House: “Do not associate anything with Me; and purify My House for those who circle around, and those who stand to pray, and those who kneel and prostrate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], when We designated for Abraham the site of the House, [saying], \"Do not associate anything with Me and purify My House for those who perform Tawaf and those who stand [in prayer] and those who bow and prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:26] And, mention, when We settled, [when] We pointed out, for Abraham the site of the House, that he may build it — for it [the House] had been raised [to heaven] at the time of the Flood — and We commanded him, [saying]: ‘Do not ascribe any partner to Me and purify My House, of graven images, for those who circumambulate it and those who are resident, staying therein, and those who bow and prostrate ([al-rukka‘ and al-sujūd] are the plural forms of rāki‘ and sājid [respectively]), those praying.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remember) when We prepared for Abraham) when We explained to Abraham (the place of the (holy) House) by means of a cloud which had stopped close to him, and so he built the House by the side whereby the cloud stopped. And We inspired him (saying: Ascribe thou no thing) no idols (as partner unto Me, and purify My House) purify My Mosque from idols (for those who make the round (thereof) and those who stand) and those who live there (and those who bow and make prostration) the people who pray from all countries and from wherever they happen to come.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذْ بَوَّأْنَا لإِبْرَاهِيمَ مَكَانَ ٱلْبَيْتِ } معناه جَعلنَا لَهُ مَنزلاً\n\n\n\n\nوقوله تعالى: { وَطَهِّرْ بَيْتِيَ لِلطَّآئِفِينَ وَٱلْقَآئِمِينَ } معناه من الأَوثانِ والرِّيبِ، للطائفينَ بالبَيتِ والقَائمينَ فِي الصَّلاةِ\n\n",
      "translations": [
        {
          "translation": "\nAnd when We made the House a place of return for Abraham. We made it a place of return for him.\n\nAnd His saying, {Exalted is He} {And purify my house for those who circle it and those who stand [in prayer]} [has the meaning of] distancing from the idols and the doubtful things, for those who circle the House and those who stand in prayer.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وإذ بوّأنا } أي: جعلنا { لإبراهيم } الروح مكان بيت القلب وهو المصدر مباءة يرجع إليها في الأعمال والأخلاق\n وقيل: أعلم الله إبراهيم مكانه بعدما رفع إلى السماء أيام الطوفان بريح أرسلها\n فكشف ما حولها\n فبناه على أسّه القديم\n أي: هداه إلى مكانه بعد رفعه إلى السماء\n وأيام طوفان الجهل وأمواج غلبات الطبع برياح نفحات الرحمة فكشفت ما حوله من الهيئات النفسانية والألواث الطبيعية والغبارات الهيولانية فبناه على أسّه القديم من الفطرة الإنسانية { أن لا تشرك } أي: جعلناه مرجعاً في بناء البيت بأحجار الأعمال وطين الحكم وجصّ الأخلاق\n وقلنا: لا تشرك\n أي: أمرناه بالتوحيد ثم بتطهير بيت القلب عن الألواث المذكورة { للطائفين } من القوى النفسانية التي تطوف حوله للتنوّر واكتساب الفضائل الخلقية { والقائمين } من القوى الروحانية التي تقوم عليها بإلقاء المعارف والمعاني الحكمية { والرُّكع السجود } من القوى البدنية التي تستفيد منه صور العبادات والآداب الشرعية والعقلية\n أو لهداية الطالبين من المستبصرين المتعلمين\n والمجاهدين السالكين\n والمتعبدين الخاضعين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا نذيقه من عذابنا الأليم\n إذ بناء بيتنا هذا على الطهارة الكاملة من جميع الآثام\n اذكر يا أكمل الرسل { إِذْ بَوَّأْنَا } أي: بيَّنا وعيَّنا { لإِبْرَاهِيمَ } حين شرفناه بأمرنا المتعلق بيناء بيتنا هذا { مَكَانَ ٱلْبَيْتِ } أي: الكعبة بعدما اندرست وسقطت بالطوفان\n وصارت سوى لا علامة لها أصلاً\n فأعلمنا له بريحٍ أرسلناها مع إبراهيم فكنست الريحُ حولها فبناه على بنائه الذي بناه آدم عليه السلام\n وأوصينا { أَن لاَّ تُشْرِكْ بِي شَيْئاً } من مظاهري وأظلالي في الوجود معي { وَ } بعدما نزَّهت ذاتي عن الشريك والنظير { طَهِّرْ بَيْتِيَ } هذا الممثَّل من بيتي الذي في صدرك عن جميع المعاصي والآثام والمؤذيات والقاذورات\n وأنواع الخبائث والمكروهات\n إذ جعلناه قبلة ومقصداً { لِلطَّآئِفِينَ } القاصدين بطوافهم حول البيت التحققَ عند كعبة الذات والوقوف على عرفات الأسماء والصفات { وَٱلْقَآئِمِينَ } المواظبين بالتوجه الدائمي\n والميل الشوقي الحقيقي الحبي بجميع الأركان والجوارح نحو الذات الأحدية\n المنقطعين عن جميع العلائق والإضافات { وَٱلرُّكَّعِ } الراكعين الذين قُصمت ظهور هوياتهم عن حمل أعباء العبودية { ٱلسُّجُودِ } الحج: 26] أي: الساجدين المتذللين الخاضعين الواضعين جباه أنانيتهم على تراب المذلة والانكسار لدى الملك الجبار القهار لسمت السوى والأغيار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } اذكر يا محمد { إِذْ بوّأنا }: حين هيأنا { لإبراهيم مكانَ البيت } وعيناه له\n حتى بناه في مكانه مسامتًا للبيت المعمور\n حيث كان بناه آدم عليه السلام\n وقد كان رُفع إلى السماء الرابعة\n أيام الطوفان\n وكان من ياقوتة حمراء\n فأعلم اللهُ إبراهيم مكانه\n بريح أرسلها\n يقال لها: الخَجُوح\n فكنست مكان البيت\n وقيل: سحابة على قدر البيت\n وقيل: كلمته\n وقالت له: ابنِ على قَدري\n هـ\n فبناه على أساسه القديم\n وفي ابن حجر: أنه جعل طوله في السماء تسعة أذرع\n ودوره في الأرض ثلاثين ذراعًا بذراعه\n وأدخل الحِجْر في البيت\n وكان قبل ذلك لغنم إسماعيل\n وبنى الحجارة بعضها على بعض\n أي: بلا تراب\n ولم يجعل له سقفًا\n وحفر له بئرًا\n عند بابه خزانة للبيت\n يُلقي ما يهدى له\n هـ\n رُوِيَ أن الكعبة الشريفة بُنيت خمس مرات\n إحداها: بنتها الملائكة\n وكانت من ياقوتة حمراء\n ثم رُفعت أيام الطوفان\n والثانية: بناها إبراهيم عليه السلام\n وقيل: إن جُرهم كانت بنتها قبله\n ثم هدمت\n ويدل عليه: التجاء عادٍ إليها\n حين نزل بهم القحط\n فأرسل الله عليهم الريح\n وكان ذلك قبل إبراهيم عليه السلام\n والثالثة: بنتها قريش\n وقد حضرها رسول الله صلى الله عليه وسلم قبل النبوة\n\nوالرابعة: بناها ابن الزبير\n والخامسة: الحجاج\n ثم قال تعالى: { أن لا تُشرك } أي: وقلنا له: ألا تشرك { بي شيئًا } \n بل خلص عملك في بنائها وغيره\n من شوائب حظ النفس\n عاجلاً وآجلاً\n لا طَمَعًا في جزاء\n ولا خوفًا من عقوبة\n بل محبة وشكرًا وعبودية\n قال القشيري: أي: لا تلاحظ البيت ولا بنيانك\n هـ\n وقيل: في الآية طعن على من أشرك من قُطَّان البيت\n أي: هذا الشرط كان على أبيكم فمَنْ بعده وأنتم\n فلم تقبلوه\n بل أشركتم وصددتم وألحدتم\n فاستحققتم التوبيخ والذم على سلوككم على غير طريق أبيكم\n { وطهِّرْ بيتيَ } من الأصنام والأقذار\n { للطائفين } به { والقائمين } للصلاة فيه\n أو المقيمين فيه\n { والركَّع السجود } أي: المصلين\n جمعًا من راكع وساجد\n والله تعالى أعلم\n الإشارة: إن الذين كفروا بطريق الخصوصية\n ويصدون الناس عن الدخول فيها\n ويُعوقونهم عن مسجد الحضرة\n الذي جعله للناس محلاً تسكن فيه قلوبهم\n وتعشش فيه أرواحهم\n فكل من قصده وباع نفسه وقلبه لله\n وصله ودخله\n وهو محل المشاهدة والمكالمة\n والمساررة والمناجاة\n محل شهود الحبيب والمساررة مع القريب\n محل نزهة الأفكار في فضاء الشهود والاستبصار\n فمن عاق عنها نُذقه من عذاب أليم\n وقوله تعالى: { سواء العاكفُ فيه الباد } \n قال القشيري: فيه إشارة إلى أن التفاوت إنما يكون في الطريق\n وأما بعد الوصول\n فلا تفاوت\n ثم إذا اجتمعت النفوس\n فالموضع الواحد مجمعها\n ولكن لكلٍّ حالٌ يُعرف به\n هـ\n قلت: مقام التوحيد الخاص\n وهو الفناء\n هو محل الاجتماع\n وتتفاوت بعد ذلك أذواقهم ومواجيدهم\n وازدياد كشوفاتهم وترقياتهم\n تفاوتًا بعيدًا\n على حسب التفرغ والانقطاع\n والتأهب والاتباع\n حسبما سبقت به القسمة الأزلية\n وقال الورتجبي\n على قوله تعالى: { وإذ بوأنا\n\n\n } الآية: هيأ لخليله وجميع أحبائه بيته\n ودلَّه إلى ما فيه من الكرامات والآيات\n وما ألبسه من أنوار حضرته ليكون وسيلة لعبادته\n ومرآة لأنوار آياته\n هـ\n قلت: الإشارة بالبيت إلى القلب لأنه بيت الرب\n أي: هيأنا لإبراهيم مكان قلبه لمشاهدة أسرار جبروتنا وأنوار ملكوتنا\n ليكون من المُوقنين بشهود ذاتنا\n وقلنا له: لا تشرك بنا شيئًا من السِّوى\n ولا ترى معنا غيرنا\n وطهِّر بيتي\n الذي هو القلب\n من الأغيار والأكدار\n ليكون محلاً للطائفين به من الواردات والأنوار\n والعاكفين فيه من المشاهدات والأسرار\n والركع السجود من القلوب التي تواجهك بالتعظيم والانكسار\n فإنَّ قلبَ العارف كعبة للواردات والأسرار\n ومحل حج قلوب الصالحين والأبرار\n وفي بعض الأثر: \" يا داود طهر لي بيتًا أسكنه\n فقال: يا رب\n\n\n وأيُّ بيت يسعك؟ فقال: لم يسعني أرضي ولا سمائي\n ووسعني قلب عبدي المؤمن \"\n وفيه عند أهل الحديث كلام\n ووسعه للربوبية بالعلم والمعرفة الخاصة\n والله تعالى أعلم\n ولما فرغ إبراهيم عليه السلام من بناء البيت",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:125",
      "similarity": 0.5480161587863056
    },
    {
      "verse": "77:48",
      "similarity": 0.5076267722989928
    },
    {
      "verse": "22:77",
      "similarity": 0.47997109695900275
    },
    {
      "verse": "2:43",
      "similarity": 0.4703069536663567
    },
    {
      "verse": "5:55",
      "similarity": 0.465283287515759
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}