{
  "chapter": "الحج",
  "text": "يوم ترونها تذهل كل مرضعة عما ارضعت وتضع كل ذات حمل حملها وترى الناس سكرى وما هم بسكرى ولكن عذاب الله شديد",
  "translations": [
    {
      "translation": "On the day they see it, every nursing woman will be oblivious of the baby at her breast, and every pregnant woman will abort the contents of her womb, and you will think people drunk when they are not drunk; it is just that the punishment of Allah is so severe.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day you see it every suckling female will forget her suckling, and every pregnant female will discharge her burden. You will see men drunk, yet it will not be intoxication. The torment of God will be severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when you witness it, the suckling woman shall utterly neglect the infant she suckles, and every pregnant woman shall cast her burden, and you will see people as though they are drunk, when they are not drunk; but dreadful shall be Allah's chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When that hour comes, every breast-feeding mother will drop her baby out of fear and every pregnant female will cast off her burden. You will see the people behaving as though they were drunk, while, in fact, they are not drunk. They only will look such because of the severity of God's torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when you will witness it, every nursing mother will forget her nurseling and every pregnant one will discharge her burden, and you (O dear Prophet Mohammed – peace and blessings be upon him) will see people as if they are drunk, whereas they will not be intoxicated, but the fact is that Allah’s punishment is very severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day you shall see it, every nursing mother will forget her nursling, and every pregnant one will drop her load, and you shall see mankind as in a drunken state, yet they will not be drunk, but Allah's torment is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when you shall see it, every woman giving suck shall quit in confusion what she suckled, and every pregnant woman shall lay down her burden, and you shall see men intoxicated, and they shall not be intoxicated but the chastisement of Allah will be severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the day when you behold it, every suckling woman shall neglect the child she has suckled, and every pregnant woman shall deposit her burden, and thou shalt see mankind drunk, yet they are not drunk, but God's chastisement is terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when ye behold it, every nursing mother will forget her nursling and every pregnant one will be delivered of her burden, and thou (Muhammad) wilt see mankind as drunken, yet they will not be drunken, but the Doom of Allah will be strong (upon them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when that Day comes, every suckling mother shall forsake her infant and every pregnant woman shall cast her burden and everyone will appear intoxicated, although they are not: the punishment of God will be severe indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day whereon ye behold it, every suckling woman shall forget that which she suckleth, and every burthened woman shall lay down her burthen; and thou shalt behold mankind as drunken, whereas drunken they will be not, but the torment of Allah shall be severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day that you will see it, every suckling female will be unmindful what she suckled, and every pregnant female will deliver her burden, and you will see the people drunk, yet they will not be drunken, but Allah’s punishment is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day ye shall see it, every mother giving suck shall forget her suckling-babe, and every pregnant female shall drop her load (unformed): thou shalt see mankind as in a drunken riot, yet not drunk: but dreadful will be the Wrath of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day you shall see it, every nursing mother will forget her nursling, and every pregnant one will drop her load, and you shall see mankind as in a drunken state, yet they will not be drunken, but severe will be the Torment of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day you will see every one that suckles shall forsake her suckling, and every carrier shall miscarry, and you shall see mankind drunk although they arenot drunk; dreadful will be the punishment of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when you will see it: every nursing mother will discard her infant, and every pregnant woman will abort her load, and you will see the people drunk, even though they are not drunk—but the punishment of God is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day you see it every nursing mother will be distracted from that [child] she was nursing, and every pregnant woman will abort her pregnancy, and you will see the people [appearing] intoxicated while they are not intoxicated; but the punishment of Allah is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:2] On the day when you behold it, every, actually, nursing female, on account of this [tremendous day], will neglect her suckling, that is, she will forget it; and every pregnant female will deliver her burden, and you will see mankind [as though] drunk, because of the severity of [their] fear, yet they will not be drunk, because of any drink; but God’s chastisement is severe, and so they will be terrified of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when ye behold it) when you see it upon the first blowing of the Trumpet, (every nursing mother will forget) will be preoccupied from (her nursling and every pregnant one will be delivered of her burden) of pregnancy, (and thou (Muhammad) wilt see mankind) standing and (drunken, yet they will not be drunken) from intoxicants, (but the Doom of Allah will be strong (upon them)) this is why they were dazzled as if they were drunk.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحدّثنا أبو جعفر قال: حدّثنا علي بن أحمد قال: أخبرنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السلام في قولِه تعالى: { يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّآ أَرْضَعَتْ } معناه تَسلُو وتَنسَى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر أيها الرائي: { يَوْمَ تَرَوْنَهَا } أي: تلك الزلزلة الشديدة المهيبة بحيث { تَذْهَلُ } أي: تدهش وتغفل من غاية دهشتها { كُلُّ مُرْضِعَةٍ } مشفقة متحنننة { عَمَّآ أَرْضَعَتْ } أي: ولدها الرضيع مع كمال محبتها ومودتها { وَتَضَعُ } عند حدوثها من شدة هولها وفزعها { كُلُّ ذَاتِ حَمْلٍ } وحبلٍ { حَمْلَهَا } وجنينها { وَ } بالجملة { تَرَى } أيها الرائي { ٱلنَّاسَ } أي: جميع الأنام عند حدوثها { سُكَارَىٰ } حيارى مدهوشين، زائلين عقولهم من شدة الهول { وَمَا هُم بِسُكَارَىٰ } حقيقة { وَلَـٰكِنَّ عَذَابَ ٱللَّهِ } النازل إياهم في تلك الحالة { شَدِيدٌ } [الحج: 2] مدهش محير لعقولهم وأبصارهم، وجميع قواهم ومشاعرهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { يوم }: منصوب بتذهل\n يقول الحقّ جلّ جلاله: { يا أيها الناس اتقوا ربكم } ، الخطاب عام لجميع المكلفين ممن وُجد عند النزول، وينخرط في سلكهم من سيُوجد إلى يوم القيامة\n ولفظ { الناس } يشمل الذكور والإناث\n والمأمور به مطلق التقوى، الذي هو امتثال الأوامر واجتناب النواهي ظاهرًا وباطنًا، والتعرض لعنوان الربوبية، مع إضافتها لضمير المخاطبين لتأكيد الأمر، وتأكيد إيجاب الامتثال به لأن الربوبية دائمة، والعبودية واجبة بدوامها، أي: احذروا عقوبة مالك أموركم ومربيكم\n ثم علل وجوب التقوى بذكر بعض عقوبته الهائلة عند قيام الساعة، فقال: { إِن زلزلة الساعة شيء عظيم } ، فإن ملاحظة عظمها وهولها وفظاعة ما هي من مبادئه ومقدماته، مما يوجب مزيد اعتناء بملابسة التقوى والتدرع بها\n والزلزلة: التحرك الشديد والإزعاج العنيف، بطريق التكرير، بحيث تزيل الأشياء من مقارها، وتخرجها عن مراكزها، وهي الزلزلة المذكورة في قوله تعالى:\n\n[الزّلزَلة: 1] الآية\n واخْتُلِفَ في هذه الزلزلة وما ذكر بعدها، هل هي قيام الساعة عند نفخة الصعق، أو بعدها عند الحشر؟ فقال الحسن رضي الله عنه: إنها تكون يوم القيامة\n وعن ابن عباس رضي الله عنه: زلزلة الساعة: قيامها\n وعن علقمة والشعبي: أنها قبل طلوع الشمس من مغربها، فإضافتها إلى الساعة لكونها من أشراطها\n قال الكواشي: وهذه الزلزلة تكون قبل قيام الساعة من أشراطها\n قالوا: ومن أشراط الساعة، قبل قيامها، ست آيات: بينما الناس في أسواقهم، إذ ذهب ضوء الشمس، ثم تناثرت النجوم، ثم وقعت الجبال على وجه الأرض، فتحركت واضطربت الأرض، ففزع الإنسُ والجن، وماج بعض في بعض خوفًا ودهشًا، فقالت الجنُ للإنس: نحن نأتيكم بالخبر، فذهبوا، فرأوا البحار تَأَجَّجُ نارًا، فبينما هم كذلك إذ تصدعت الأرض إلى الأرض السابعة، ثم جاءتهم الريح فماتوا\n هـ\n وانظر ابن عطية\n قاله المحشي\n والتحقيق: ما قدمناه عند قوله:\n\n[الأنبيَاء: 97]، وأنَّ الريح إنما تقبض أرواح المؤمنين، وهذه الزلزلة إنما تقع عند نفخة الصعق\n والله تعالى أعلم\n وفي التعبير بـ { شيء عظيم } إيذان بأن العقول قاصرة عن إدراك كنهها، والعبارة ضيقة، لا تحيط بها إلا على وجه الإبهام\n ثم هوَّل شأنها، فقال: { يوم ترونها } أي: الزلزلة، وتُشاهدون هول مطلعها، { تذهل كل مرضعة } أي: مباشرة للإرضاع، { عما أرضعت } أي: تغفل وتغيب، من شدة الدهش عما هي بصدد إرضاعه من طفلها، الذي ألقمته ثديها\n فالمرضعة، بالتاء، هي المباشرة الإرضاع بالفعل، والمرضع - بلا تاء - لمن شأنها ترضع، ولو لم تباشر الإرضاع\n والتعبير عنه \" بما \" ، دون \" من \" لتأكيد الذهول، كأنها من شدة الهول لا تدري من هو بخصوصه، وقيل: \" ما \" مصدرية، أي: تذهل عن إرضاعها\n\n\nوالأول أدل على شدة الهول وكمال الانزعاج\n { وتضع كل ذات حملٍ حملها } أي: تلقى جنينها من غير تمام، كما أن المرضعة تذهل عن ولدها قبل الفطام\n وهذا على قول من يقول: إنها قبل نفخة الصعق ظاهر، وأما على من يقول، إنها بعد قيام الساعة، فقد قيل: إنه تمثيل لتهويل الأمر وشدته\n { وترى الناس سُكارى } أي: وترى أيها الناظر الناس سكارى، على التشبيه، من شدة الهول، كأنهم سكارى لمّا شاهدوا بساط العزة وسلطنة القهرية، حتى قال كلُّ نبي: نفسي نفسي\n { وما هم بسُكارى } على التحقيق، { ولكنَّ عذاب الله شديد } ، فخوف عذابه هو الذي أذهل عقولهم، وطيَّر تمييزهم، وردهم في حال من يَذهب السكُر بعقله وتمييزه\n وعن الحسن: وترى الناس سكارى من الخوف، وما هم بسكارى من الشراب\n وقرئ: سكْرى كعطشى\n والمعنى واحد، غير أن فعلى يختص بما فيه آفة، كجرحى وقتلى ومرضى\n والله تعالى أعلم\n الإشارة: يا أيها الناس اتقوا ربكم وتوجهوا إليه بكليتكم، حتى تُشرق على قلوبكم أنوار ربكم، فتزلزل أرض نفوسكم، وتدك جبال عقولكم، عند سطوع شمس العرفان، والاستشراف على مقام الإحسان\n إن زلزلة الساعة، التي تشرف فيها على أسرار الذات، شيء عظيم\n يوم ترونها تذهل كل مرضعة عما أرضعت، لو كانت أنثى، وتضع كل ذات حمل حملها كذلك، أو تضع كل ذات حمل أثقالها بالغيبة في ربها، وترى الناس سكارى من خمر المحبة، وما هم بسكارى من شراب الدَّوالي، لكن من خمر الكبير المتعالي، كما قال الششتري في الخمرة الأزلية - بعد كلام -:\n\nولكن عذاب الله - الذي قدمه قبل دخول جنته المعنوية وحفت به، وهي جنة المعارف - شديد، ولكنه يحلو في جانب ما ينال بعده، كما قال الشاعر:\n",
      "translations": []
    }
  ]
}