{
  "chapter": "الحج",
  "text": "ان الله يدخل الذين ءامنوا۟ وعملوا۟ الصلحت جنت تجرى من تحتها الانهر يحلون فيها من اساور من ذهب ولؤلؤا ولباسهم فيها حرير",
  "translations": [
    {
      "translation": "But Allah will admit those who have iman and do right actions into Gardens with rivers flowing under them where they will be adorned with gold bracelets and pearls, and where their clothing will be of silk.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will surely admit those who believe and do the right to gardens with rivers running by, where they will be decked in bracelets of gold and of pearls; and of silk will be their garments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the other hand), Allah will cause those who believed and acted righteously to enter the Gardens beneath which rivers flow. They shall be decked in them with bracelets of gold and pearls and their raiment shall be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will admit the righteously striving believers to the gardens wherein streams flow. There they will be decked with gold bracelets, pearls, and garments of silk,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah will admit those who believed and did good deeds into Gardens beneath which rivers flow – in it they will be made to wear armlets of gold, and pearls, and in it their garment is silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, Allah will admit those who believe and do righteous good deeds, to Gardens underneath which rivers flow (in Paradise), wherein they will be adorned with bracelets of gold and pearls and their garments therein will be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah will make those who believe and do good deeds enter gardens beneath which rivers flow; they shall be adorned therein with bracelets of gold and (with) pearls, and their garments therein shall be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall surely admit those who believe and do righteous deeds into gardens underneath which rivers flow; therein they shall be adorned with bracelets of gold and with pearls, and their apparel there shall be of silk;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah will cause those who believe and do good works to enter Gardens underneath which rivers flow, wherein they will be allowed armlets of gold, and pearls, and their raiment therein will be silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will admit those who believe and do good deeds to Gardens watered by flowing rivers; there they will be given bracelets of gold and pearls to wear and their clothing will be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah will cause those who believe and work righteous works to enter Gardens whereunder the rivers flow, wherein they will be bedecked with brace lets of gold and with pearls, and their garment therein shall be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah will admit those who have faith and do righteous deeds into gardens with streams running in them, adorned therein with bracelets of gold and pearl, and their dress therein will be silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will admit those who believe and work righteous deeds, to Gardens beneath which rivers flow: they shall be adorned therein with bracelets of gold and pearls; and their garments there will be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, Allah will admit those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, to Gardens underneath which rivers flow (in Paradise), wherein they will be adorned with bracelets of gold and pearls and their garments therein will be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will admit those who believe and do good works to gardens underneath which rivers flow. They shall be adorned therein with bracelets of gold and with pearls, and their garments shall be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God will admit those who believe and do good deeds into Gardens beneath which rivers flow. They will be decorated therein with bracelets of gold and pearls, and their garments therein will be of silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah will admit those who believe and do righteous deeds to gardens beneath which rivers flow. They will be adorned therein with bracelets of gold and pearl, and their garments therein will be silk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:23] And He [God] says of the believers: Indeed God shall admit those who believe and perform righteous deeds into gardens underneath which rivers flow; adorned therein with bracelets of gold and pearl (read walu’lu’in, genitive, to mean [bracelets] made of both [elements], so that the pearls are set in gold; or read wa-lu’lu’an, accusative, as a supplement to the [syntactical] locus of min asāwira, ‘bracelets’); and their raiment therein will be silk, namely, the one forbidden for men to wear in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah will cause those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) acts of obedience between themselves and their Lord (to enter Gardens beneath which) beneath their trees and habitations (rivers) of wine, water, honey and milk (flow, wherein they will be allowed) to wear in Paradise (armlets of gold, and pearls, and their raiment therein) in Paradise (will be silk) whose quality is beyond description.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته المستمرة: { إِنَّ ٱللَّهَ } المتجلي على أهل الإيمان بالتجليات الحبّية الجمالية { يُدْخِلُ ٱلَّذِينَ آمَنُواْ } بتوحيد الله مخلصين { وَعَمِلُواْ ٱلصَّالِحَاتِ } المقبولة عنده المقربة إليه { جَنَّاتٍ } وحدائق ذات بهجة ترويحاً لهم وتفريحاً، وانشراحاً لصدورهم، وتفريحاً لغمومهم حيث { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } المُذهِبة للهموم الفارجة للكروب { يُحَلَّوْنَ فِيهَا } تذهيباً وتزينناً لظواهرهم من عكوس بواطنهم { مِنْ أَسَاوِرَ } متخذة { مِن ذَهَبٍ وَلُؤْلُؤاً } بها يرصع أساورهم { وَلِبَاسُهُمْ } دائماً { فِيهَا حَرِيرٌ } [الحج: 23] تلييناً لبشرتهم وتكميلاً لترفههم وتنعمهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر جزاء الخصم الآخر، وهم أهل الحق، فقال: { إن الله يُدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار } ، وغيَّر الأسلوب فيه، بإسناد الإدخال إلى الله عزّ وجلّ، وتصدير الجملة بحرف التأكيد إيذانًا بكمال مباينة حالهم لحال الكفرة، وإظهارًا لمزيد العناية بحال المؤمنين، { يُحلَّون فيها } من التحلية، وهو التزين، أي: تحليهم الملائكة بأمره تعالى { من أساورَ } أي: بعض أساور: جمع سوار، { من ذهبٍ } للبيان، أي يلبسون أساور مصنوعة من ذهب، { ولؤلؤًا } ، من جَرَّهُ: عَطَفَهُ على { ذهب } ، أو { أساور } ، ومَنْ نَصَبَهُ: فعلى محل { من أساور } ، أي: ويُحَلَّوْنَ لؤلؤًا، أو بفعل محذوف، أي: ويُؤْتَوْنَ لؤلؤًا\n\n\n{ ولباسُهُم فيها حريرٌ }: أبريسِمْ، وغيَّر الأسلوب، فلم يقل: ويلبسون حريرًا لأن ثبوت اللباس لهم أمر محقق غَنِيُّ عن البيان، إذ لا يمكن عراؤهم عنه، وإنما المحتاج للبيان: أيُّ لباس هو، بخلاف الأساور واللؤلؤ، فإنها ليست من اللوازم الضرورية، فجعل بيان حليتهم بها مقصودًا بالذات\n انظر أبا السعود",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:33",
      "similarity": 0.8735928924935475
    },
    {
      "verse": "56:23",
      "similarity": 0.4006750383260302
    },
    {
      "verse": "55:22",
      "similarity": 0.3669559100427041
    },
    {
      "verse": "52:24",
      "similarity": 0.34628060910764424
    },
    {
      "verse": "76:19",
      "similarity": 0.2923108397875526
    }
  ]
}