{
  "chapter": "الحج",
  "text": "وهدوا۟ الى الطيب من القول وهدوا۟ الى صرط الحميد",
  "translations": [
    {
      "translation": "They have been guided to speak good words and guided to the praiseworthy path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be guided with gentle words, and guided to the commended path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were guided (to accept) the pure word; they were guided to the Way of the Praiseworthy (Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for they were guided to speak the noblest words and follow the praiseworthy path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were guided to sacred speech; and they were shown the path of the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they are guided unto goodly speech and they are guided to the path of Him, Who is Worthy of all praises.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they are guided to goodly words and they are guided into the path of the Praised One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they; shall be guided unto goodly speech, and they shall be guided unto the path of the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are guided unto gentle speech; they are guided unto the path of the Glorious One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For they were guided to purity of speech. And they were guided to the path of the Glorious Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have been guided unto goodly speech, and they have been guided to the path of the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were guided to chaste belief, and guided to the path of the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For they have been guided (in this life) to the purest of speeches; they have been guided to the Path of Him Who is Worthy of (all) Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they are guided (in this world) unto goodly speech (i.e. La ilaha ill-Allah, Alhamdu lillah, recitation of the Quran, etc.) and they are guided to the Path of Him (i.e. Allah's Religion of Islamic Monotheism), Who is Worthy of all praises.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For they shall be guided to good speech and guided to the praised path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were guided to purity of speech. They were guided to the path of the Most Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they had been guided [in worldly life] to good speech, and they were guided to the path of the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:24] And they shall be guided, in this world, to wholesome words, namely, ‘There is no god except God’, and they shall be guided to the path of the Praised, that is, to the praiseworthy way of God and His religion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They are guided unto gentle speech) they were guided in this worldly life to say: there is no deity except Allah; (they are guided unto the path of the Glorious One) and they were guided to the praiseworthy religion. This is Allah's judgement regarding the dispute between the believers, the Jews and the Christians.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لا يقتصر عليهم فيها على تزيين الظاهر وتفريح الباطن، بل { هُدُوۤاْ إِلَى ٱلطَّيِّبِ مِنَ ٱلْقَوْلِ } ليتصفوا بالصدق والتصديق، ويداوموا على شكر الله بقولهم: الحمد لله الذي صدقنا وعده، وبقولهم: الحمد لله الذي هدانا لهذا، { وَ } بعدما تصفوا بالصدق والعدالة في الأقوال والأفعال { هُدُوۤاْ إِلَىٰ صِرَاطِ ٱلْحَمِيدِ } [الحج: 24] الذي هو التوحيد المسقط للإضافات مطلقاً، سمي به لاستحقاقه الحمد لذاته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهُدُوا إِلى الطيب من القول } ، وهو كلمة التوحيد: لا إله إلا الله أو: الحمد لله، ولا إله إلا الله، والله أكبر، بدليل قوله:\n\n[فَاطِر: 10]\n { وهُدُوا إِلى صراط الحميد } أي: المحمود، وهو الإسلام\n أو: ألهمهم اللهُ في الآخرة أن يقولوا: الحمد لله الذي صدقنا وعده، وهداهم فيها إلى طريق الجنة\n وقيل: إلى طريق الوصول إلى الله العزيز الحميد، والله تعالى أعلم\n الإشارة: قد اختصم أهل الظاهر مع أهل الباطن في شأن الربوبية، فقال أهل الظاهر: الحق تعالى لا يُرى في دار الدنيا، ولا تُمكن معرفته، إلا من جهة الدليل والبرهان، على طريق الإيمان بالغيب\n وقال أهل الباطن من أكابر الصوفية: الحق تعالى يُرى في هذه الدار، كما يرى في تلك الدار، من طريق العرفان، على نعت الشهود والعيان، لكن ذلك بعد موت النفوس وحط الرؤوس لأهل التربية النبوية، فلا يزال يحاذيه ويسير به، حتى يقول: ها أنت وربك، فحينئذ تشرق عليه شموسُ العرفان، فتُغطى عنه وجود حس الأكوان، فلا يرى حينئذ إلا المكون، حتى لو كُلف أن يرى غيره لم يستطع إذ لا غير معه حتى يشهده\n وقال بعضهم: مُحال أن تشهده، وتشهد معه سواه\n وفي مناجاة الحكم العطائية: \" إلهي، كيف يُسْتَدَلُّ عليك بما هو في وجوده مفتقر إليك؟ أيكون لغيرك من الظهور ما ليس لك، حتى يكون هو المظهر لك؟ متى غِبْتَ، حتى تحتاج إلى دليل يدل عليك؟! ومتى بعدت حتى تكون الآثار هي التي توصل إليك؟! \"\n وقال الشيخ أبو الحسن رضي الله عنه: أهل الدليل والبرهان عموم عند أهل الشهود والعيان\n وهذه الطريق هي طريق التربية، لا تنقطع أبدًا، فمن كفر بها وجحدها قُطعت له ثياب من نار القطيعة، فيبقى مسجونًا بسرادقات محيطاته، محصورًا في هيكل ذاته، لا يَرى إلا ظلمة الأكوان، يُصب من فوق رأسه، إلى قلبه، حَرُّ التدبير والاختيار، وكلما أراد أن يخرج من سجن الأكوان وغم الحجاب ردته حَيْرَةُ الدَّهَشِ، وهيبة الكبرياء والعظمة والإجلال لأن فكرته مسجونة تحت أطباق الكائنات، مقيدة بعلائق العوائد والشواغل والشهوات\n\n\nويقال له: ذق عذاب الحريق، وهو حِرْمانك من شهود التحقيق\n إن الله يدخل الذين آمنوا بطريق الخصوص، جنات المعارف، تجري من تحتها أنهار العلوم، يُحلون فيها بأنواع المحاسن والفضائل، ويتطهرون من جميع المساوئ والرذائل، وهُدوا إلى الطيب من القول، وهو الذكر الدائم بالقلب الهائم، والمخاطبة اللينة من القلوب الصافية، وهُدوا إلى طريق التربية والترقية، حتى وصلوا إلى شهود الحبيب، الحامد المحمود، القريب المجيب\n حققنا الله بمقامهم بمنِّه وكرمه\n ثمَّ شرع في المقصود من السورة وهو أحكام الحج\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:6",
      "similarity": 0.6470370259212515
    },
    {
      "verse": "37:118",
      "similarity": 0.5618201989590801
    },
    {
      "verse": "1:6",
      "similarity": 0.5584238630416669
    },
    {
      "verse": "4:68",
      "similarity": 0.5559614484162948
    },
    {
      "verse": "14:1",
      "similarity": 0.5155910601416437
    }
  ]
}