{
  "chapter": "الحج",
  "text": "كلما ارادوا۟ ان يخرجوا۟ منها من غم اعيدوا۟ فيها وذوقوا۟ عذاب الحريق",
  "translations": [
    {
      "translation": "As often as they try to escape from its anguish they would be put back into (the fire), and taste the torment of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever they try, in their anguish, to escape from Hell, they will be driven back into it, (and shall be told): \"Now taste the torment of burning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever in anguish they will try to come out of hell they will be returned therein to suffer the burning torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever they wish to come out of it due to suffocation, they will be returned to it again and it will be commanded, “Taste the punishment of fire!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every time they seek to get away therefrom, from anguish, they will be driven back therein, and (it will be) said to them: \"Taste the torment of burning!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever they will desire to go forth from it, from grief, they shall be turned back into it, and taste the chastisement of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as often as they desire in their anguish to come forth from it, they shall be restored into it, and: 'Taste the chastisement of the burning!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever, in their anguish, they would go forth from thence they are driven back therein and (it is said unto them): Taste the doom of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whenever, in their anguish they seek to escape from Hell, they will be driven back into it, and they will be told, \"Taste the punishment of Hell.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So oft as they would seek to go forth therefrom, because of anguish, they shall be sent back therein, and taste the torment of Burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever they desire to leave it out of anguish, they will be turned back into it [and told]: ‘Taste the punishment of the burning!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every time they wish to get away therefrom, from anguish, they will be forced back therein, and (it will be said), \"Taste ye the Penalty of Burning!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every time they seek to get away therefrom, from anguish, they will be driven back therein, and (it will be) said to them: \"Taste the torment of burning!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever in their anguish they try to get out of it, they are restored to it. (It will be said): 'Taste the punishment of burning'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever they try to escape the gloom, they will be driven back to it: “Taste the suffering of burning.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every time they want to get out of Hellfire from anguish, they will be returned to it, and [it will be said], \"Taste the punishment of the Burning Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:22]   Whenever they desire to exit from it, that is, [from] the Fire, on account of [their] anguish, they are made to return into it, they are driven back into it with the hooked rods, and, it shall be said to them: ‘Taste the chastisement of the burning!’, namely, the one that has reached ultimate [degree of] combustion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whenever, in their anguish) from the anguish of being tortured in hell, (they would go forth from thence) from the Fire (they are driven back therein) beaten with the rods of iron (and (it is said unto them): Taste the doom of burning) taste the severe torment of the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَهُمْ } أي: لردهم ودفعهم زجراً وقهراً { مَّقَامِعُ } سياط مصنوعة { مِنْ حَدِيدٍ } [الحج: 21] بيد مَن ءوكل عليه من الزبانية { كُلَّمَآ أَرَادُوۤاْ أَن يَخْرُجُواْ مِنْهَا } أي: من النار { مِنْ غَمٍّ } وَهَمٍّ وكآبة، عرض لهم من شدة العذاب، فطلبوا الخروج تخفيفاً، وترويحاً حين التقطهم اللهب إلى الطرف الأعلى منها { أُعِيدُواْ فِيهَا } زجراً ضاربين عليهم بالمقامع { وَ } قائلين لهم { ذُوقُواْ } أيها المصرون على الكفر والعناد، المسرفون المفسدون بأنواع الفجور والفساد { عَذَابَ ٱلْحَرِيقِ } [الحج: 22] المحرق أكبادكم بدل ما تبردونها بالسحت والرشى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { كُلما أرادوا أن يخرجوا منها } أي: أشرفوا على الخروج من النار، ودنوا منه، حسبما رُويَ: أنها تضربهم بلهبها فترفعهم، حتى إذا كانوا بأعلاها ضُربوا بالمقامع، فَهَوَوْا فيها سبعين خريفًا\n وقوله: { من غَمّ }: بدل اشتمال من ضمير { منها } بإعادة الجار، والعائد: محذوف، أي: كلما أرادوا أن يخرجوا من غم شديد من غمومها { أُعيدوا فيها } أي: في قعرها، بأن رُدوا من أعاليها إلى أسافلها، من غير أن يخرجوا منها، { و } قيل لهم: { ذُوقوا عذابَ الحريق } أي: الغليظ من النار، العظيم الإحراق",
      "translations": []
    }
  ]
}