{
  "chapter": "الحج",
  "text": "ثم ليقضوا۟ تفثهم وليوفوا۟ نذورهم وليطوفوا۟ بالبيت العتيق",
  "translations": [
    {
      "translation": "Then they should end their state of self-neglect and fufil their vows and circle the Ancient House.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them then attend to their persons and complete the rites of pilgrimage, fulfil their vows and circuit round the ancient House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter, let them tidy up and fulfil their vows and circumambulate the Ancient House.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the pilgrims then neatly dress themselves, fulfil their vows, and walk seven times around the Kabah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They must then remove their dirt and fulfil their pledges and go around the Free House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then let them complete their prescribed duties and perform their vows, and circumambulate the `Atiq House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then let them accomplish their needful acts of shaving and cleansing, and let them fulfil their vows and let them go round the Ancient House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them then finish with their self-neglect and let them fulfil their vows, and go about the Ancient House.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then let them make an end of their unkemptness and pay their vows and go around the ancient House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then let the pilgrims purify themselves and fulfil their vows and perform the circumambulation of the Ancient House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter let them end their unkemptnesss and fulfil their vows and circumambulate the ancient House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then let them do away with their untidiness, fulfill their vows, and circle around the Ancient House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then let them complete the rites prescribed for them, perform their vows, and (again) circumambulate the Ancient House.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then let them complete the prescribed duties (Manasik of Hajj) for them, and perform their vows, and circumambulate the Ancient House (the Ka'bah at Makkah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, let the pilgrims accomplish their acts of cleansing, and let them fulfill their vows, and circumambulate the Ancient House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then let them perform their acts of cleansing, and fulfill their vows, and circle around the Ancient House.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then let them end their untidiness and fulfill their vows and perform Tawaf around the ancient House.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:29] Then let them do away with their self-neglect, that is to say, [let them] remove any dirt or unkemptness, such as [any] long fingernails, and let them fulfil (read wa’l-yūfū or wa’l-yuwaffū) their vows, in the way of offerings and sacrifices, and perform the circumambulation, the circumambulation following the egress [from ‘Arafa], of the Ancient House’, that is, the Old one, because it was the first House founded for mankind.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then let them make an end of their unkemptness) and then let them complete the rites of their pilgrimage: shaving their heads, throwing pebbles, cutting their nails and other things (and pay their vows) and fulfil that which they made incumbent upon themselves (and go around) the obligated circumambulation (the ancient House) more ancient than any tyrant that has ever stepped on its soil; it is also said that this means: more ancient than the flood of Noah; it is also said that it is the first House ever built; and it is also said that whoever go round it will be delivered.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ لْيَقْضُواْ تَفَثَهُمْ } معناه الأَخذُ من الشَّاربِ، وقَصُّ الأَظفارِ، وحلَقُ الرَّأسِ، والعَانةِ، ونتفُ الأبطِ، ثم النَّحرِ بَعدَ ذَلكَ، من هَديٍ أَو نَذرٍ\n\n\n\n\nوقوله تعالى: { وَلْيَطَّوَّفُواْ بِٱلْبَيْتِ ٱلْعَتِيقِ } معناه طَوافُ النَّحرِ\n وهو طَوافُ الزِّيارةِ\n وسُمي البَيتُ عَتيقاً، لأنَّه أَعتقُ منَ الجَبابرةِ، فَلَمْ يَدَّعِهِ جَبَّارٌ أَنهُ لَهُ\n والعَتيقُ: الكَريمُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ثم ليقضوا } وسخ الفضول وفضلات ألواث الهيئات كقصّ شارب الحرص، وقَلم أظفار الغضب والحقد\n وفي الجملة: بقايا تلوينات النفس { وليوفوا نذورهم } بالقيام بإبراز ما قبلوه في العهد الأول من المعاني والكمالات المودعة فيهم إلى الفعل، فقضاء التفث التزكية وإزالة الموانع والإيفاء بالنذور والتحلية وتحصيل المعارف { وليطوّفوا } بالانخراط في سلك الملكوت الأعلى حول عرش الله المجيد البيت القديم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعد ذبح الهدايا والضحايا { لْيَقْضُواْ } وليزلوا { تَفَثَهُمْ } أي: أوساخهم العارضة لهم من رين الإمكان، وطغيان الهويات، ومقتضى الأنانيات { وَ } بعد تطهير أوساخ الإمكان { لْيُوفُواْ نُذُورَهُمْ } التي نذروها في قطع بوادي تعيناتهم، ومهاوي هوياتهم من ذبح بقرة أمّارتهم المضِلَّة عن سواء السبيل { وَ } بعدما طهروا من الأوساخ ووافوا بالنذور { لْيَطَّوَّفُواْ } منخلعين عن خِلَع ناسوتهم، متجردين عن ثياب بشريتهم { بِٱلْبَيْتِ ٱلْعَتِيقِ } [الحج: 29] والركن الوثيق الأزلي الأبدي، الذي لا يحلقه انصرام، ولا يعرضه انقراض وانخرام، فالأمر ذلك لمن أراد سلوك طريق الفناء، والحج الحقيقي، والطواف المعنوي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم لْيَقْضُوا تَفَثَهم } أي: ليزيلوا عنهم أدرانهم، قاله نفطويه\n وقيل: قضاء التفث: قصُ الشارب والأظافر، ونتف الإبط، والاستحداد، وسائر خصال الفطرة\n وهذا بعد أن يُحلوا من الحج التحلل الأصغر بالنحر\n { ولْيُوفُوا نذورَهم } أي: ما ينذرونه من البر في الحج وغيره، وقيل: مواجب حجهم من فعل أركانه، { وليَطّوفوا } طواف الإفاضة، الذي هو ركن لا يُجبر بالدم، وبه يتم الحج، ويكون { بالبيت العتيق }: القديم لأنه أول بيت وضع للناس، بناه آدم ثم جدَّده إبراهيم، أو الكريم، ومنه: عتاق الخيل لكرائمها، أو: لأنه عتق من الغرق، أو من أيدي الجبابرة، فكم من جبار رام هدمه فمنعه الله منه\n وقيل: عتيق لم يملكه أحد قطُّ، وهو مَطاف أهل الغبراء، كما أن البيت المعمور مطاف أهل السماء",
      "translations": []
    }
  ]
}