{
  "chapter": "الحج",
  "text": "ومن الناس من يجدل فى الله بغير علم ويتبع كل شيطن مريد",
  "translations": [
    {
      "translation": "Among people there is one who argues about Allah without knowledge, and follows every rebellious shaytan.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And yet there are men who contend about God without understanding, and follow every wayward devil\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among people there are some who wrangle about Allah without knowledge and follow every rebellious devil,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some people argue about God without knowledge and follow every rebellious devil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among people are some who argue concerning Allah without knowing, and blindly follow every rebellious devil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among mankind is he who disputes about Allah, without knowledge, and follows every rebellious Shaytan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men there is he who disputes about Allah without knowledge and follows every rebellious Shaitan;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men there is such a one that disputes concerning God without knowledge and follows every rebel Satan,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among mankind is he who disputeth concerning Allah without knowledge, and followeth each froward devil;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there are some who dispute about God without having any knowledge and they follow every rebellious devil,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who disputeth respecting Allah without knowledge, and followeth any Satan froward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people are those who dispute about Allah without any knowledge, and follow every froward devil,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And yet among men there are such as dispute about Allah, without knowledge, and follow every evil one obstinate in rebellion!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among mankind is he who disputes concerning Allah, without knowledge, and follows every rebellious (disobedient to Allah) Shaitan (devil) (devoid of each and every kind of good).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among people there are those, who without knowledge, dispute about Allah and follow every rebel satan,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people is he who argues about God without knowledge, and follows every defiant devil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people is he who disputes about Allah without knowledge and follows every rebellious devil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:3] The following was revealed regarding al-Nadr b. al-Hārith and his companions: And among mankind are those who dispute about God without any knowledge — they would say, ‘The angels are God’s daughters, and the Qur’ān [a collection of] the fables of the ancients’. In addition, they would deny resurrection and the bringing back to life of those who had become dust — and [those who] follow, in their manner of disputing, every rebellious devil,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Among mankind) this refers to al-Nadr Ibn al-Harth (is he who disputeth concerning Allah) who argues against Allah's religion and Scripture (without knowledge) without proof or clarity, (and followeth each froward devil) each hardened and accursed rebellious one;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يكون لله المنتقم الجبار ذي القدرة الكاملة والغيرة التامة العذاب والنكال في النشأة الأخرى لمن يسيء الأدب معه، وينسب إليه سبحانه ما لا يليق بجنابه ونيكر يوم البعث الجزاء مع ورود الآيات العظام في شأنه { مِنَ ٱلنَّاسِ } المجبولين على المرءا والمجادلة { مَن يُجَادِلُ } ويخاصم داعي الله رسوله سيما { فِي } حق { ٱللَّهِ } ويبالغ فيها حيث ينفي ذاته سبحانه وصفاته الذاتية الكاملة { بِغَيْرِ عِلْمٍ } أي: دليل عقلي يتشبث به أو نقلي يستند إليه بل إنما هو عن جهل وعناد { وَ } مستنده ومتشبثه أنه { يَتَّبِعُ } في دعواه وجداله هذا { كُلَّ شَيْطَانٍ } مضل مغوٍ { مَّرِيدٍ } [الحج: 3] عالٍ متمرد في الشرارة والفساد بين العباد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:7",
      "similarity": 0.8429319698192279
    },
    {
      "verse": "4:117",
      "similarity": 0.7910176437192656
    },
    {
      "verse": "9:101",
      "similarity": 0.5841032796081289
    },
    {
      "verse": "27:44",
      "similarity": 0.30795358544733475
    },
    {
      "verse": "22:8",
      "similarity": 0.3022116584182191
    }
  ]
}