{
  "chapter": "الحج",
  "text": "ولكل امة جعلنا منسكا ليذكروا۟ اسم الله على ما رزقهم منۢ بهيمة الانعم فالهكم اله وحد فله اسلموا۟ وبشر المخبتين",
  "translations": [
    {
      "translation": "We have appointed a rite of sacrifice for every nation so that they may invoke Allah's name over the livestock He has given them. Your God is One God so submit to Him. Give good news to the humble-hearted,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every community We have ordained certain rites that they may commemorate the name of God by reading it over the cattle We have given them for sacrifice. Your God is one God, so be obedient to Him. Give good tidings to those who bow in obedience to God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every people We have laid down a ritual of sacrifice(- although the purpose of the ritual is the same -)that they pronounce the name of Allah over the cattle He has provided them. Your Lord is One God; so submit yourselves to Him alone. And give, (O Prophet), glad tidings to those that humble themselves (before Allah),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every nation We have given certain sacrificial rituals. Let them consecrate their sacrificial animals with His Name. Your God is One God and you must submit yourselves to His will. (Muhammad), give the glad news (of God's mercy) to the devoted servants of God:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation We have appointed a sacrifice, that they may mention the name of Allah over the inarticulate animal which He has provided them; so (remember) your God is One God, therefore submit only to Him; and give glad tidings (O dear Prophet Mohammed – peace and blessings be upon him) to the humble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation We have appointed religious ceremonies, that they may mention the Name of Allah over the beast of cattle that He has given them for food. And your God is One God, so you must submit to Him Alone. And give glad tidings to the Mukhbitin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to every nation We appointed acts of devotion that they may mention the name of Allah on what He has given them of the cattle quadrupeds; so your god is One God, therefore to Him should you submit, and give good news to the humble,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed for every nation a holy rite, that they may mention God's Name over such beasts of the flocks as He has provided them. Your God is One God, so to Him surrender. And give thou good tidings unto the humble\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation have We appointed a ritual, that they may mention the name of Allah over the beast of cattle that He hath given them for food; and your god is One God, therefor surrender unto Him. And give good tidings (O Muhammad) to the humble,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every people We have appointed rites of sacrifice, so that they may pronounce the name of God over the cattle which He has provided for them. Your God is One God; surrender yourselves to Him; and give good news to the humble\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto every community We appointed a ritual, that they mention the name of Allah over the beast cattle wherewith He hath provided them: and your God is One God, so unto Him submit. And bear thou glad tidings unto the humble-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation We have appointed a rite so that they might mention Allah’s Name over the livestock He has provided them. Your God is the One God, so submit to Him. And give good news to the humble\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every people did We appoint rites (of sacrifice), that they might celebrate the name of Allah over the sustenance He gave them from animals (fit for food). But your god is One God: submit then your wills to Him (in Islam): and give thou the good news to those who humble themselves,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation We have appointed religious ceremonies, that they may mention the Name of Allah over the beast of cattle that He has given them for food. And your Ilah (God) is One Ilah (God Allah), so you must submit to Him Alone (in Islam). And (O Muhammad SAW) give glad tidings to the Mukhbitin [those who obey Allah with humility and are humble from among the true believers of Islamic Monotheism],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation We have appointed a holy ritual, that they pronounce the Name of Allah over the beast of flocks which He has provided them. Your God isOne God; to Him surrender yourselves. Give glad tidings to the humble,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed a rite for every nation, that they may commemorate God’s name over the livestock He has provided for them. Your God is One God, so to Him submit, and announce good news to the humble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all religion We have appointed a rite [of sacrifice] that they may mention the name of Allah over what He has provided for them of [sacrificial] animals. For your god is one God, so to Him submit. And, [O Muhammad], give good tidings to the humble [before their Lord]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:34] And for every community, that is, [for every] believing group that came before you, We have appointed a [holy] rite (read mansakan as the verbal noun [‘ritual’], or mansikan as a noun denoting the site [for a rite]) in other words, [for every community We have appointed] a sacrificial slaughter or the site for such [a ritual], that they might mention God’s Name over the livestock that He has provided them, at the point of slaughtering them. For your God is One God, so submit, yield, to Him. And give good tidings to the humbly obedient,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And for every nation) of believers (have We appointed a ritual) a location for slaughtering their sacrifices in the lesser and greater pilgrimages, (that they may mention the name of Allah over the beast of cattle) which is sacrificed (that He hath given them for food; and your God is One God) without a son or partner, (therefore surrender unto Him) be sincere to Him in worship and profession of His divine Oneness. (And give good tidings to the humble) and give good tidings to those who exert their effort and are sincere.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَبَشِّرِ ٱلْمُخْبِتِينَ } معناه المُطيعون\n وقال: المُتواضعونَ\n\n",
      "translations": [
        {
          "translation": " And His saying - {And give glad tidings to the obedient} - its meaning is the obedient.\n The humble ones said",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولكل أمّة } من القوى { جعلنا } عبادة مخصوصة بها { ليذكروا اسم الله } بالاتصاف بصفاته التي هي مظاهرها في التوجه إلى التوحيد { على ما رزقهم من } الكمال بواسطة { بهيمة } النفس التي هي من جملة { الأنعام } أي: النفوس السليمة { فإلهكم إله واحد } فوحدوه بالتوجه نحوه من غير التفات إلى غيره\n وخصّصوه بالانقياد والطاعة ولا تنقادوا إلا له { وبشّر } المنكسرين المتذللين القابلين لفيضه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلِكُلِّ أُمَّةٍ } من الأمم الماضية { جَعَلْنَا مَنسَكاً } أي: مذبحاً معيناً يتقربون فيه إلينا\n ويهدون نحونا بهدايا وقرابين وإنما أعطيناهم ذلك { لِّيَذْكُرُواْ ٱسْمَ ٱللَّهِ } عند التذكية والذبح { عَلَىٰ مَا رَزَقَهُمْ } مما ملكت أيمانهم { مِّن بَهِيمَةِ ٱلأَنْعَامِ } قيدنا لهم\n لأن الخيل والحمير لا يليق بالقربان والهدي\n وبعدما علمتم أن لكل أمة مذبحاً معيناً ومنسكاً مخصوصاً يتقربون فيها إلينا { فَإِلَـٰهُكُمْ } أي: فاعلموا أن إلهكم { إِلَـٰهٌ وَاحِدٌ } أحد صمد فردٌ وترٌ لا تعدد فيه ولاشركة { فَلَهُ أَسْلِمُواْ } وتوجهوا إن كنتم مسلِّمين أموركم إليه { وَبَشِّرِ } يا أكمل الرسل من بين المؤمنين المسلمين بالمثوبة العظمى\n والدرجة العليا\n والفوز بشرف اللقيا { ٱلْمُخْبِتِينَ } [الحج: 34] المطيعين الخاضعين المتواضعين الذين خَبَت\n وخمدت نار شهواتهم من بأس الله وخشيته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولكلِّ أمة } جماعة مؤمنة قبلكم\n { جعلنا منسَكًا } أي: مُتَعبدًا وقربانًا يتقربون به إلى الله - عزّ وجلّ - والمنسك - بالفتح -: مصدر\n وبالكسر: اسم موضع النُسك\n أي: لكلٍّ حعلنا عبادة يتعبدون بها\n أو موضع قربان\n يذبحون فيه مناسكهم\n { ليذكروا اسمَ الله } دون غيره\n { على ما رزقهم من بهيمة الأنعام } أي: عند نحرها وذبحها\n { فإِلهكم إِلهٌ واحدٌ } أي: اذكروا على الذبائح اسم الله وحده فإن إلهكم إله واحد\n { فله أسلِمُوا } أي: فإذا كان إلهكم إلهًا واحدًا فأخلصوا له التقرب\n أو الذكر خاصة\n واجعلوه له سالمًا\n لا تشوبوه بإشراك\n { وبشر المخبتين } المطمئنين بذكر الله\n أو المتواضعين\n أو المخلصين\n فإن الإخبات من الوظائف الخاصة بهم\n والخَبْتُ: المطمئن من الأرض\n وعن ابن عباس رضي الله عنه: هم الذين لا يظلمون\n وإذا ظلموا لم ينتصروا\n وقيل: تفسيره ما بعده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:54",
      "similarity": 0.5199002270127464
    },
    {
      "verse": "11:23",
      "similarity": 0.5196116554097867
    },
    {
      "verse": "22:28",
      "similarity": 0.5074622588233875
    },
    {
      "verse": "5:1",
      "similarity": 0.4055387949678359
    },
    {
      "verse": "2:128",
      "similarity": 0.3298688171690956
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/22:34.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/22:34.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}