{
  "chapter": "الحج",
  "text": "لن ينال الله لحومها ولا دماؤها ولكن يناله التقوى منكم كذلك سخرها لكم لتكبروا۟ الله على ما هدىكم وبشر المحسنين",
  "translations": [
    {
      "translation": "Their flesh and blood does not reach Allah but your taqwa does reach Him. In this way He has subjected them to you so that you might proclaim Allah's greatness for the way that He has guided you. Give good news to the good-doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not their meat or blood that reaches God: It is the fealty of your heart that reaches him. That is why He has subjugated them to you that you may glorify God for having shown you the way. So give glad tidings to those who are doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their flesh reaches Allah nor their blood; it is your piety that reaches Him. He has subjected these animals (to you) that you may magnify Allah for the guidance He has bestowed upon you. Give glad tidings, (O Prophet), to those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not the flesh and blood of your sacrifice that pleases God. What pleases God is your piety. God has made subservient to you the sacrificial animals so that perhaps you will glorify Him; He is guiding you. (Muhammad), give the glad news (of God's mercy) to the righteous people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never does their flesh nor their blood reach Allah, but your piety successfully reaches Him; this is how We have given them in your control so that you may speak His Greatness for guiding you; and O dear Prophet (Mohammed – peace and blessings be upon him) give glad tidings to the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is neither their meat nor their blood that reaches Allah, but it is Taqwa from you that reaches Him. Thus have We made them subject to you that you may proclaim Allah's greatness for His guidance to you. And give glad tidings to the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There does not reach Allah their flesh nor their blood, but to Him is acceptable the guarding (against evil) on your part; thus has He made them subservient to you, that you may magnify Allah because He has guided you aright; and give good news to those who do good (to others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The flesh of them shall not reach God, neither their blood, but godliness from you shall reach Him. So He has subjected them to you, that you may magnify God for that He has guided you. And give thou good tidings unto the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their flesh and their food reach not Allah, but the devotion from you reacheth Him. Thus have We made them subject unto you that ye may magnify Allah that He hath guided you. And give good tidings (O Muhammad) to the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their flesh and blood do not reach God: it is your piety that reaches Him. Thus God has subjected them to you, so that you may glorify Him for the guidance He has given you. Give glad tidings to those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their flesh reacheth not Allah nor their blood: but it is Piety from you that reacheth Him. Thus He hath subjected them to you, that ye may magnify Allah for He hath guided you; and bear thou glad tidings unto the welldoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not their flesh or blood that reaches Allah; rather, it is your piety that reaches Him. Thus has He disposed them for your benefit so that you may magnify Allah for His guiding you. And give good news to the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not their meat nor their blood, that reaches Allah: it is your piety that reaches Him: He has thus made them subject to you, that ye may glorify Allah for His Guidance to you and proclaim the good news to all who do right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is neither their meat nor their blood that reaches Allah, but it is piety from you that reaches Him. Thus have We made them subject to you that you may magnify Allah for His Guidance to you. And give glad tidings (O Muhammad SAW) to the Muhsinun (doers of good).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their flesh and blood does not reach Allah rather it is piety from you that reaches Him. As such He has subjected them to you, in order that you exalt Allahfor guiding you. And give glad tidings to the generous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their flesh, nor their blood, ever reaches God. What reaches Him is the righteousness from you. Thus He subdued them to you, that you may glorify God for guiding you. And give good news to the charitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their meat will not reach Allah, nor will their blood, but what reaches Him is piety from you. Thus have We subjected them to you that you may glorify Allah for that [to] which He has guided you; and give good tidings to the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:37] Neither their flesh nor their blood shall reach God, that is, neither of these shall be raised up to Him; rather it is your piety that shall reach Him, that is, it is your righteous action, performed purely for Him, together with [your] faith, that shall be raised up to Him. Thus has He disposed them for you, that you may magnify God for His guiding you, for His pointing out to you the [ritual] ceremonies of His religion and the rites of His pilgrimage. And give good tidings to the virtuous, namely, those who affirm the Oneness [of God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Their flesh and their blood reach not Allah) because in the pre-Islamic time they used to splash the blood of sacrifices on the walls of the Holy House and sully themselves with this blood and so Allah forbade them from doing so; it is also said that this means: Allah does not accept their flesh or blood, (but the devotion from you reacheth Him) but He accepts your pure and sincere works. (Thus have We made them subject unto ye that you may magnify Allah that He hath guided you) as He guided you to His religion and wont. (And give good tidings to the good) to those who are good in their words and deeds; and it is said that the good means: the generous with their sacrifices.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { لن ينال الله } لحوم فضائلها وكمالاتها ولا إفناؤها بإزالة أهوائها التي هي دماؤها { ولكن يناله } التجرّد { منكم } عنها وعن صفاتها\n فإن سبب الوصول هو التجرّد والفناء في الله\n لا حصول الفضائل مكان الرذائل\n مثل ذلك التسخير بالرياضة { سخّرها لكم لتكبّروا الله } بالفناء فيه عنها وعن كل شيء على النحو الذي هداكم إليه بالتجريد والتفريد والسلوك في الطريقة إلى الحقيقة { وبشِّر المُحْسنين } الشاهدين في العبودية عن البقاء والفناء حال الاستقامة والتمكين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواعلموا أيها المتقربون إلى الله بالهدايا والضحايا: { لَن يَنَالَ ٱللَّهَ } أي: لن يصيب ويصل إليه سبحانه { لُحُومُهَا } المتصدق بها\n إذ هو منزه عنها وعن الانتفاع بها { وَ } أيضاً { لاَ } يصل إليه سبحانه { دِمَآؤُهَا } المهراقة { وَلَـٰكِن يَنَالُهُ } ويصل منها إليه سبحانه { ٱلتَّقْوَىٰ مِنكُمْ } أي: التحرز والاجتناب عن محارمه ومنهياته والامتثال بأوامره والإتيان بمأموراته\n وبالجملة بقربكم إليه سبحاه امتثال الأوامر واجتناب النواهي\n لا اللحوم والدماء\n\n\nثم كرره سبحانه تأكيداً أو مبالغة بقوله: { كَذٰلِكَ سَخَّرَهَا لَكُمْ } أي: الهدايا والضحايا { لِتُكَبِّرُواْ ٱللَّهَ } المتعزز بالعظمة والكبرياء\n المستقل بالمجد والبهاء حق تكبيره\n وتعظموه حق تعظيمه وتوقيره { عَلَىٰ مَا هَدَاكُمْ } وأرشدكم إلى الإيمان والتوحيد { وَبَشِّرِ } يا أكمل الرسل { ٱلْمُحْسِنِينَ } [الحج: 37] منهم\n وهم الذين يعبدون الله كأنهم يرونه\n ويحسنون الأدب معه\n كأنهم ينظرون إليه سبحانه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لن ينال اللهَ لحومُها } المُتَصَدَّقُ بها\n { ولا دماؤها } المهراقة بالنحر\n أي: لن يصل إلى الله اللحم والدم\n { ولكن ينالُه التقوى منكم } فإنه هو الذي طلب منكم\n وعليه يحصل الثواب\n والمراد: لن تصلوا إلى رضا الله باللحوم ولا بالدماء\n وإنما تصلون إليه بالتقوى\n أي: الإخلاص لله\n وقصد وجه الله\n بما تذبحون وتنحرون من الهدايا\n فعبَّر عن هذا المعنى بلفظ { ينال } مبالغةً وتأكيدًا\n كأنه قال: لن تصل لحومها ولا دماؤها إلى الله\n وإنما يصل إليه التقوى منكم\n وقيل: كان أهل الجاهلية يلطخون الكعبة بدماء قربانهم\n فهمَّ المسلمون أن يفعلوا مثل ذلك\n فنزلت الآية\n { كذلك سخرها لكم } أي: البدن\n وهو تكرير للتذكير والتعليل\n لقوله: { لتكبِّروا الله على ما هداكم } أي: لتعرفوا عظمة الله\n باقتداره على ما لا يقدر عليه غيره\n فتوحدوه بالكبرياء شكرًا على هدايته لكم\n وقيل: هو التكبير عند الذبح { وبشر المحسنين }: المخلصين في كل ما يأتون ويذرون في أمور دينهم\n وبالله التوفيق\n الإشارة: أعظم شعائر الله التي يجب تعظيمها أولياء الله\n الدالين على الله\n ثم الفقراء المتوجهون إلى الله\n ثم العلماء المعلمون أحكام الله\n ثم الصالحون المنتسبون إلى الله\n ثم عامة المؤمنين الذين هم من جملة عباد الله\n ويجب تعظيم مَنْ نصبه الله لقيام خطة من الخطط لإصلاح العباد كالسلاطين\n ولو لم يعدلوا\n والقضاة والقواد\n والمقدمين لأمور العامة\n فتعظيم هؤلاء كله من تقوى القلوب\n ويدخل في ذلك: الأماكن المعظمة كالمساجد والزوايا\n وأما الفقير فَيُعَظِّمُ كل ما خلق الله حتى الكلاب\n ويتأدب مع كل مخلوق\n وقوله تعالى: { لكم فيها منافع } أي: لكم في هذه التجليات\n إن عظمتموها وعرفتم الله فيها\n منافع\n ترعَوْن من أنوارها وتشربون من خمرة أسرارها\n فتزدادوا معرفة وتكميلاً\n إلى أجل مسمى\n وهو مقام التمكين\n فحينئذ تواجهه أنوار المواجهة\n فتكون الأنوار له\n لا هو للأنوار\n لأنه لله لا لشئ دونه\n\n\n[الأنعام: 91]\n ثم محل هذه الأنوار إلى بيت الحضرة\n فحينئذ يستغني بالله عن كل ما سواه\n وقوله تعالى: { ولكل أمة جعلنا منسكًا } أي: لكل عصر جعلنا تربية مخصوصة\n والوصول واحد ولذلك قال: { فإلهكم إله واحد }\n وقال القشيري: الشرائعُ مختلفةٌ فيما كان من المعاملات\n متفقة فيما كان من جملة المعارف\n ثم قال: ذكّرهم الله بأنه هو الذي أمرهم ويُثيبهم\n { فله أسلموا }: اسْتَسلموا لحكمِه\n من غير استكراهٍ من داخل القلب ولا من اللفظ\n هـ\n وقوله تعالى: { والبدن\n\n\n } الآية\n قال الورتجبي: فيه إشارة إلى ذبح النفس بالمجاهدات\n وزمها بالرياضات عن المخالفات\n وفناء الوجود للمشاهدات\n حتى لا يبقى للعارف في طريقه حظ من حظوظه\n ويبقى لله مفردًا من جميع الخلائق\n هـ\n وفي قوله تعالى: { فاذكروا اسم الله عليها صواف } \n إشارة إلى أن النفس لا تموت إلا بصحبة من ماتت نفسه\n فلا تموت النفس مع صحبة أهل النفوس الحية أبدًا\n فإذا ماتت وسقطت جنوبها\n وظفرتم بها فكلوا من أنوار أسرارها وعلومها لأن النفس\n إذا ماتت\n حييت الروح\n وفاضت عليها العلوم اللدنية\n فكلوا منها\n وأطعموا السائل والمتعرض لنفحاتكم\n وقوله تعالى: { لن ينال الله لحومها\n\n\n } الآية\n قال الورتجبي: الإشارة فيه إلى جميع الأعمال الصالحة من العرش إلى الثرى\n لا يلحق الحق بحق المراد منه\n ولكن يصل إليه قلب جريح من محبته\n ذُبح بسيف شوقه\n مطروح على باب عشقه\n قال سهل في قوله: { ولكن يناله التقوى }: هو التبري والإخلاص\n هـ\n قال القشيري: لا عِبْرةً بإظهار الأفعال\n سواء كانت بدنيةً أو ماليةً صِرْفًا\n أو مما يتعلق بالوجهين\n ولكن العبرة بقرائنها من الإخلاص\n فإذا انضَافَ إلى الجوارح إخلاص القصود\n وتَجَرَّدَتْ عن ملاحظة أصحابِها الأغيار\n صَلُحَتْ للقبول\n وينال صاحبها القرب\n بشهود الحق بنعت التفرد\n ثم قال: { لتكبروا الله على ما هداكم } وأرشدكم إلى القيام بحقِّ العبودية على قضية الشرع\n { وبشر المحسنين } \n الإحسان\n كما في الخبر:\n \" أنْ تعبد الله كَأنك تراه \" \nوأمارةُ صحته: سقوطُ تعب القلب عن صاحِبهِ\n فلا يستثقلُ شيئًا ولا يتبرم بشيءٍ\n هـ\n قلت: خواطر الاستثقال والتبرم لا تضر لأنه طبع بشري\n وإنما يضر ما سكن في القلب\n وقال في الإحياء: ليس المقصود من إراقة دم القربان الدم واللحم\n بل ميل القلب عن حب الدنيا\n وبذلُها إيثارًا لوجه الله تعالى\n وهذه الصفة قد حصلت عند جزم النية والهمة\n وإن عاق عن العمل عائق\n فلن ينال الله لحومُها ولا دماؤها\n ولكن يناله التقوى منكم\n والتقوى ها هنا عمل القلب\n من نية القربة\n وإرادة الخير\n وإخلاص القصد لله\n وهو المقصود\n وعمل الظاهر مؤكد له\n ولذلك كانت نية المؤمن أبلغ من عمله فإنَّ الطاعات غذاء القلوب\n والمقصود: لذة السعادة بلقاء الله تعالى\n والتنعم بها\n وذلك فرع محبته والأنس به\n ولا يكون إلاّ بذكره\n ولا يفرغ إلا بالزهد في الدنيا\n وترك شواغلها والانقطاع عنها\n هـ\n ومن كانت هذه صفته كان من المحسنين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:92",
      "similarity": 0.40855206734379085
    },
    {
      "verse": "7:49",
      "similarity": 0.37121195953264485
    },
    {
      "verse": "16:115",
      "similarity": 0.36428697705299173
    },
    {
      "verse": "2:173",
      "similarity": 0.35604094105713513
    },
    {
      "verse": "7:152",
      "similarity": 0.3288634512792181
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/22:37.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/22:37.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}