{
  "chapter": "الحج",
  "text": "ذلك ومن يعظم حرمت الله فهو خير له عند ربه واحلت لكم الانعم الا ما يتلى عليكم فاجتنبوا۟ الرجس من الاوثن واجتنبوا۟ قول الزور",
  "translations": [
    {
      "translation": "That is it. If someone honours Allah's sacred things, that is better for him in his Lord's sight. All livestock are permitted to you except what has already been recited to you. Have done with the defilement of idols and have done with telling lies.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Apart from this, whoever respects the sacred ordinances of God, will find a better reward for him with his Lord. You are allowed to eat all cattle except those already mentioned to you. Avoid the repugnance of idols, and false and frivolous talk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such (was the purpose of building the Kabah). Whosoever, then, venerates Allah's sanctities will find it to be good for him in the sight of his Lord. Cattle have been made lawful for you except those mentioned to you (as unlawful). So shun the abomination of idols and shun all words of falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the regulations of hajj. To respect the prohibitions of God is a virtuous deed in the sight of one's Lord. Consuming the flesh of certain animals is made lawful for you. Stay away from wickedness, idols, and false words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it is; and whoever reveres the sacred things of Allah – that is then a goodness for him in the sight of his Lord; the inarticulate animals are lawful to you except those the forbidding of which is recited to you, therefore shun the filth of idols, and avoid false speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That and whoever honors the sacred things of Allah, then that is better for him with his Lord. The cattle are lawful to you, except those (that will be) mentioned to you. So shun the Rijs of the idols, and shun false speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (shall be so); and whoever respects the sacred ordinances of Allah, it is better for him with his Lord; and the cattle are made lawful for you, except that which is recited to you, therefore avoid the uncleanness of the idols and avoid false words,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that; and whosoever venerates the sacred things of God, it shall be better for him with his Lord. And permitted to you are the flocks, except that which is recited to you. And eschew the abomination of idols, and eschew the speaking of falsehood,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (is the command). And whoso magnifieth the sacred things of Allah, it will be well for him in the sight of his Lord. The cattle are lawful unto you save that which hath been told you. So shun the filth of idols, and shun lying speech,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is God's commandment. Whoever honours that which is declared sacred by God may be sure that it counts for good in the sight of his Lord. Livestock is lawful for you, except that which has already been explicitly forbidden. Then shun the abomination of the deities and shun all falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus it is. And whosoever suspecteth the sacred ordinances of Allah, it shall be better for him with his Lord. And allowed unto you are the cattle, save that which hath been rehearsed unto you; so avoid the pollution of the idols, and avoid the word of falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, and whoever venerates the sacraments of Allah, that is better for him with his Lord. You are permitted [animals of] grazing livestock except for what will be recited to you. So avoid the abomination of idols, and avoid false speech,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such (is the Pilgrimage): whoever honours the sacred rites of Allah, for him it is good in the Sight of his Lord. Lawful to you (for food in Pilgrimage) are cattle, except those mentioned to you (as exception): but shun the abomination of idols, and shun the word that is false,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (Manasik prescribed duties of Hajj is the obligation that mankind owes to Allah), and whoever honours the sacred things of Allah, then that is better for him with his Lord. The cattle are lawful to you, except those (that will be) mentioned to you (as exceptions). So shun the abomination (worshipping) of idol, and shun lying speech (false statements)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that; and whosoever venerates the sacred rites of Allah it shall be better for him with his Lord. The flocks are lawful to you, except that which is recited to you. Therefore, avoid the filth of idols and avoid speaking falsely,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that. Whoever venerates the sanctities of God—it is good for him with his Lord. All livestock are permitted to you, except what is recited to you. So stay away from the abomination of idols, and stay away from perjury.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That [has been commanded], and whoever honors the sacred ordinances of Allah - it is best for him in the sight of his Lord. And permitted to you are the grazing livestock, except what is recited to you. So avoid the uncleanliness of idols and avoid false statement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:30] [That is] that (dhālika, the predicate of an implied subject, in other words: ‘the matter’ or ‘the affair’ is ‘that which has been mentioned’). And whoever venerates the sacraments of God, namely, those things whose violation is forbidden, that, veneration of them, shall be better for him with his Lord, in the Hereafter. And cattle are lawful for you, to consume, after [their] slaughter, except for that which has been recited to you, as being unlawful, in [the verse]: Forbidden to you is carrion … [Q. 5:3]. The exceptive clause [above] is a discontinuous one; but it could also be [taken as] continuous, so that the prohibition is of that which has died and so on. So avoid the abomination of idols (mina’l-awthān: min here is explicative [as opposed to partitive], in other words, ‘[avoid abomination], namely, idols’), and avoid false speech, that is to say, ascribing partners to God in your [uttering of the] talbiya, or [avoid] bearing false witness;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nذَلِكَ وَمَنْ يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَهُ عِنْدَ رَبِّهِ وَأُحِلَّتْ لَكُمُ الْأَنْعَامُ إِلَّا مَا يُتْلَى عَلَيْكُمْ فَاجْتَنِبُوا الرِّجْسَ مِنَ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ (30) { ذلك وَمَن يُعَظِّمْ حرمات الله فَهُوَ خَيْرٌ لَّهُ عِندَ رَبِّهِ وَأُحِلَّتْ لَكُمُ الانعام إِلاَّ مَا يتلى عَلَيْكُمْ فاجتنبوا الرجس مِنَ الاوثان واجتنبوا قَوْلَ الزور \\* حُنَفَآءَ للَّهِ غَيْرَ مُشْرِكِينَ بِهِ وَمَن يُشْرِكْ بالله فَكَأَنَّمَا خَرَّ مِنَ السمآء فَتَخْطَفُهُ الطير أَوْ تَهْوِى بِهِ الريح فِى مَكَانٍ سَحِيقٍ }اسم الإشارة مستعمل هنا للفصل بين كلامين أو بين وجهين من كلام واحد ، والقصد منه التنبيه على الاهتمام بما سيذكر بعده . فالإشارة مرادٌ بها التنبيه ، وذلك حيث يكون ما بعده غيرَ صالح لوقوعه خبراً عن اسم الإشارة فيتعين تقدير خبر عنه في معنى : ذلك بيانٌ ، أو ذكرٌ ، وهو من أساليب الاقتضاب في الانتقال . والمشهور في هذا الاستعمال لفظ ( هذا ) كما في قوله تعالى : { هذا وإن للطاغين لشر مئاب } \\[ ص : 55 \\] وقولِ زهير :هَذا وليس كمن يَعْيَا بخطبته ... وسْط النّدي إذا ما قائل نَطقاوأوثر في الآية اسم إشارة البعيد للدلالة على بعد المنزلة كناية عن تعظيم مضمون ما قبله .فاسم الإشارة مبتدأ حذف خبره لظهور تقديره ، أي ذلك بيان ونحوه . وهو كما يقدم الكاتب جملة من كتابه في بعض الأغراض فإذا أراد الخوض في غرض آخر ، قال : هذا وقد كان كذا وكذا .وجملة { ومن يعظم } الخ . . . معترضة عطفاً على جملة { وإذا بوأنا لإبراهيم مكان البيت } \\[ الحج : 26 \\] عطف الغرض على الغرض . وهو انتقال إلى بيان ما يجب الحفاظ عليه من الحنيفية والتنبيه إلى أن الإسلام بُنِي على أساسها .وضمير { فهو } عائد إلى التعظيم المأخوذ من فعل { ومن يعظم حرمات الله }. والكلام موجّه إلى المسلمين تنبيهاً لهم على أنّ تلك الحرمات لم يعطل الإسلام حرمتَها ، فيكون الانتقال من غرض إلى غرض ومن مخاطب إلى مخاطب آخر . فإن المسلمين كانوا يعتمرون ويحجون قبل إيجاب الحجّ عليهم ، أي قبل فتح مكة .والحُرمات : جمع حُرُمة بضمتين : وهي ما يجب احترامه .والاحترام : اعتبار الشيء ذَا حَرَم ، كناية عن عدم الدخول فيه . أي عدم انتهاكه بمخالفة أمر الله في شأنه ، والحُرمات يشمل كل ما أوصَى الله بتعظيم أمره فتشمل مناسك الحج كلها .وعن زيد بن أسلم : الحرمات خمس : المسجد الحرام ، والبيت الحرام ، والبلد الحرام ، والشهر الحرام ، والمُحرم ما دام محرماً ، فقصَرَه على الذوات دون الأعمال . والذي يظهر أن الحرمات يشمل الهدايا والقلائد والمشعر الحرام وغير ذلك من أعمال الحجّ ، كالغسل في مواقعه ، والحلق ومواقيته ومناسكه .{ وَأُحِلَّتْ لَكُمُ الانعام إِلاَّ مَا يتلى عَلَيْكُمْ فاجتنبوا الرجس مِنَ الاوثان واجتنبوا قَوْلَ الزور حُنَفَآءَ للَّهِ غَيْرَ مُشْرِكِينَ بِهِ }لما ذكر آنفاً بهيمة الأنعام وتعظيم حرمات الله أعقب ذلك بإبطال ما حرمه المشركون على أنفسهم من الأنعام مثل : البَحيرة ، والسائبة ، والوصيلة ، والحَامي وبعضضِ ما في بطونها . وقد ذكر في سورة الأنعام .واستثني منه ما يتلى تحريمه في القرآن وهو ما جاء ذكره في \\[ سورة الأنعام : 145 \\] في قوله : { قل لا أجد فيما أوحي إلي محرماً } الآيات وما ذكر في سورة النحل وكلتاهما مكيتان سابقتان .وجيء بالمضارع في قوله : إلا ما يتلى عليكم } ليشمل ما نزل من القرآن في ذلك مما سبق نزولَ سورة الحجّ بأنه تلي فيما مضى ولم يزل يتلى ، ويشمل ما عسى أن يَنزل من بعد مثل قوله : { ما جعل الله من بحيرة ولا سائبة } الآية في } \\[ سورة العقود : 103 \\].والأمر باجتناب الأوثان مستعمل في طلب الدوام كما في قوله : { يأيها الذين آمنوا آمنوا بالله ورسوله } \\[ النساء : 136 \\]. وفرع على ذلك جملة معترضة للتصريح بالأمر باجتناب ما ليس من حرمات الله ، وهو الأوثان .واجتناب الكذب على الله بقولهم لبعض المحرمات { هذا حلال } مثل الدم وما أهلّ لغير الله به ، وقولهم لبعض : هذا حرام مثل البَحيرة ، والسائبة . قال تعالى : { ولا تقولوا لما تصف ألسنتكم الكذب هذا حلال وهذا حرام لتفتروا على الله الكذب } \\[ النحل : 116 \\].والرّجس : حقيقته الخبث والقذارة ، وتقدم في قوله تعالى : { فإنه رجس } في \\[ سورة الأنعام : 145 \\].ووصف الأوثان بالرجس أنها رجس معنوي لِكون اعتقاد إلهيتها في النفوس بمنزلة تعلّق الخبث بالأجساد فإطلاق الرجس عليها تشبيه بليغ .و ( مِن ) في قوله من الأوثان بيان لمجمل الرجس ، فهي تدخل على بعض أسماء التمييز بياناً للمراد من الرجس هنا لا أن معنى ذلك أن الرجس هو عين الأوثان بل الرجس أعمّ أريد به هنا بعض أنواعه فهذا تحقيق معنى ( من ) البيانية .\n\n",
      "translations": [
        {
          "translation": "(That (is the command)) that which I have mentioned of rites, they have to fulfil it. (And whoso magnifieth the sacred things of Allah) i.e. the rites of the pilgrimage, (it will be well for him in the sight of his Lord) in terms of reward. (The cattle) the immolated cattle and the eating of their meat (are lawful unto you save that which has been told you) in Surah al-Ma'idah such as carrion, blood and pork. (So shun the filth of idols) so leave the drinking of intoxicants and the worship of idols, (and shun lying speech) and abstain from uttering falsehood and lies. This is because they used to say during their pilgrimage in the pre-Islamic time: \"here we are, Lord, here we are, you have no partners except for a partner that you possess and it possesses not\", and so Allah forbade them from saying this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ذلك } أي: الأمر ذلك { ومن يعظم حرمات الله } وهي مالا يحل هتكه وتطهيره والقربان بالنفس وجميع ما ذكر من المناسك كالتحلي بالفضائل\n واجتناب الرذائل\n والتعرّض للأنوار في التجليّات\n والاتصاف بالصفات\n والترقي في المقامات { فهو خير له } في حضرة ربّه ومقعد قربه { وأحلّت لكم } أنعام النفوس السليمة بالانتفاع بأخلاقها وأعمالها في الطريقة والتمتع بالحقوق دون الحظوظ { إلا ما يُتْلى عليكم } في صورة المائدة من الرذائل المشتبهة بالفضائل وهي التي صدرت من النفس لا على وجهها ولا على ما ينبغي من أمرها بالرذائل المحضة\n فإنها محرّمة في سبيل الله على السالكين { فاجتنبوا الرجس من } أوثان الشهوات المتعبدة والأهواء المتبعة\n كقوله تعالى:\n[الجاثية\n الآية: 23]\n { واجتنبوا قول الزور } من العلوم المزخرفة والشبهات المموهة من التخيلات والموهومات\n المستعملة في الجدل والخلاف والمغالطة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ وَمَن يُعَظِّمْ حُرُمَاتِ ٱللَّهِ } أي: ومن يحافظ على حرمة ما حرمه الله في أوقات الحج ولم يهتك حرمتها ليجبرها بدم { فَهُوَ } أي: الحفظ بلا هتك حرمة { خَيْرٌ لَّهُ } مقبول { عِندَ رَبِّهِ } من هتكها وجبرها بدم { وَ } اعلموا أيها المؤمنون { أُحِلَّتْ لَكُمُ } في دينكم { ٱلأَنْعَامُ } كلها بأنواعها وأصنافها\n وشرب ألبانها\n والانتفاع بأشعارها وأوبارها والتقرب بها إلى الله في أوقات الحج { إِلاَّ مَا يُتْلَىٰ عَلَيْكُمْ } في كتابكم تحريمه بقوله تعالى:\n[المائدة: 3] ومتى عرفتم ما أحل الله لكم { فَٱجْتَنِبُواْ } أيها الموحدون { ٱلرِّجْسَ } والقذر الذي هو { مِنَ ٱلأَوْثَانِ } أي: من قبلها\n إذ هي شرك منافٍ للتوحيد والشرك من أخبت الخبائث { وَٱجْتَنِبُواْ } أيضاً { قَوْلَ ٱلزُّورِ } [الحج: 30] والبهتان\n إذ هو ظلمُ والظلم مقرونُ باكفر\n والشركُ معدودُ من عداده مسقطُ للمروءة والعدالة اللازمة لأهل الإيمان والتوحيد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { ذلك } أي: الأمر ذلك\n وهذا من فضل الكلام\n كما يقدم الكاتبُ جملة من الكلام\n ثم يقول: هذا\n وقد كان كذا وكذا وكذا\n إذا أراد أن يخرج من كلام إلى كلام آخر\n وإن كان له تعلق بما قبله\n والكلام هنا متصل بتعظيم حرمات البيت\n فقال: { ومن يعظِّم حُرمات الله } \n جمع حرمة\n وهو ما لا يحل هتكه من الشريعة\n فيدخل ما يتعلق بالحج دخولاً أوليًا\n وقيل: حرمات الله: البيت الحرام\n والمشعر الحرام\n والبلد الحرام\n والشهر الحرام\n وقيل: المحافظة على الفرائض والسنن واجتناب المعاصي\n { فهو خيرٌ له } أي: فالتعظيم خير له ثوابًا { عند ربه } \n ومعنى التعظيم: العلم بوجوب مراعاتها\n والعمل بموجبه\n والاهتمام بشأنه والتأدب معه\n والله تعالى أعلم\n الإشارة: قوله تعالى: { ثم ليقضوا تفثهم } \n قال القشيري: أي: حوائجهم\n ويحققوا عهودهم\n ويُوفوا نذورهم فيما عقدوه مع الله بقلوبهم\n فَمَنْ كان عقدُه التوبةَ فوفاؤه ألاَّ يرجعَ إلى العصيان\n ومَنْ كان عَهْدُه اعتناقَ الطاعةِ\n فَشَرْطُ وفائه ترك تقصيره\n ومن كان عهدُه ألاَّ يرجع إلى طلب مقامٍ وتطلع إكرامٍ\n فوفاؤه استقامته على الجملة\n التي دخل عليها في هذه الطريق\n بألا يرجع إلى استعجال نصيبٍ واقتضاءِ حظ\n\nهـ\n قلت: ومن كان عقده الوصول إلى حضرة القدس ومحل الأنس\n فوفاؤه ألا يرجع عن صحبة من سقاه خمرة المحبة\n وحمله إلى درجة المعرفة\n ثم قال: ومَنْ عاهد الله بقلبه\n ثم لا يفي بذلك\n فهو من جملة قول الزور\n هـ\n وهو أيضًا ليس بمُعَظِّمٍ لحرمات الله\n حيث طلبها ثم تهاون وتركها\n والله تعالى أعلم\n ولمّا كان الإحرام يُحرم لحوم الصيد\n فربما يتوهم أن اللحوم كلها تجتنب\n رفعَ ذلك الإبهام\n فقال: {\n\n\n وَأُحِلَّتْ لَكُمُ ٱلأَنْعَامُ إِلاَّ مَا يُتْلَىٰ عَلَيْكُمْ فَٱجْتَنِبُواْ ٱلرِّجْسَ مِنَ ٱلأَوْثَانِ وَٱجْتَنِبُواْ قَوْلَ ٱلزُّورِ حُنَفَآءَ للَّهِ غَيْرَ مُشْرِكِينَ بِهِ وَمَن يُشْرِكْ بِٱللَّهِ فَكَأَنَّمَا خَرَّ مِنَ ٱلسَّمَآءِ فَتَخْطَفُهُ ٱلطَّيْرُ أَوْ تَهْوِي بِهِ ٱلرِّيحُ فِي مَكَانٍ سَحِيقٍ }  يقول الحقّ جلّ جلاله: { وأُحِلتْ لكم الأنعامُ } أي: أكلها\n { إِلا ما يُتلىَ } أي: سيتلى { عليكم } منها في آية المائدة\n كالميتة والموقوذة وأخواتهما\n والمعنى: إن الله قد أحل لكم الأنعام إلاَّ ما بيَّن في كتابه\n فحافظوا على حدوده\n ولا تُحرِّموا شيئًا مما أحلَّ لكم\n كتحريم البحيرة وما معها\n ولا تُحلوا ما حرَّم\n كإحلال المشركين الميتة والموقوذة وغيرهما\n ثم نهى عن الأوثان التي كانوا يذبحون لها\n فقال: { فاجتنبوا الرجس من الأوثان } لأن ذلك من تعظيم حرمات الله\n و { من }: للبيان\n أي: فاجتنبوا الرجس الذي هو الأوثان\n والرجس: كل ما يستقذر من الخبث\n وسمى الأوثان رجسًا على طريقة التشبيه\n أي: فكما تنفرون بطباعكم من الرجس\n فعليكم أن تنفروا عنها\n والمراد: النهي عن عبادتها\n أو عن الذبح تقربًا لها\n { واجتنبوا قولَ الزُّور } \n وهو تعميم بعد تخصيص\n فإنَّ عبادة الأوثان رأس الزور\n ويدخل فيه الكذب والبهتان وشهادة الزور\n وقيل: المراد شهادة الزور فقط\n لِمَا رُوي أنه - عليه الصلاة والسلام - قال:\n \" عَدلَتْ شَهَادَةُ الزُّورِ الإِشْرَاكَ بِاللهِ تعالى \" \nثلاثًا\n وتلى هذه الآية\n والزور من الزّور\n وهو الانحراف والميل لأن صاحبه ينحرف عن الحق\n ولا شك أن الشرك داخل في الزور لأن المشرك يزعم أن الوثن تحق له العبادة\n وهو باطل وزور",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:17",
      "similarity": 0.5803447021867364
    },
    {
      "verse": "29:25",
      "similarity": 0.5504045019147209
    },
    {
      "verse": "58:2",
      "similarity": 0.33377069670535325
    },
    {
      "verse": "102:2",
      "similarity": 0.3238499004329128
    },
    {
      "verse": "25:4",
      "similarity": 0.3212520591484857
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022030.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022030.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}