{
  "chapter": "الحج",
  "text": "الذين اذا ذكر الله وجلت قلوبهم والصبرين على ما اصابهم والمقيمى الصلوة ومما رزقنهم ينفقون",
  "translations": [
    {
      "translation": "whose hearts quake at the mention of Allah, and who are steadfast in the face of all that happens to them, those who establish salat and give of what We have provided for them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whose hearts are filled with awe when the name of God is mentioned before them, who endure with fortitude what befalls them, and fulfil their moral obligations, and expend of what We have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whose hearts shiver whenever Allah is mentioned, who patiently bear whatever affliction comes to them, who establish Prayer, and who spend (for good purposes) out of what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose hearts are filled with awe on hearing about God, who exercise patience in hardships, who are steadfast in prayer, and who spend their property for the cause of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose hearts fear when Allah is mentioned, and those who patiently endure whatever befalls them, and those who keep the prayer established, and who spend part of what We have provided to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whose hearts are filled with fear when Allah is mentioned, and the patient who bear whatever may befall them, and who perform the Salah, and who spend out of what We have provided for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(To) those whose hearts tremble when Allah is mentioned, and those who are patient under that which afflicts them, and those who keep up prayer, and spend (benevolently) out of what We have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who, when God is mentioned, their hearts quake, and such as endure patiently whatever visits them, and who perform the prayer, and expend of what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whose hearts fear when Allah is mentioned, and the patient of whatever may befall them, and those who establish worship and who spend of that We have bestowed on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whose hearts are filled with awe at the mention of God; who endure adversity with fortitude, say their prayers regularly and spend out of what We have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those---whose hearts, when Allah is mentioned, are filled with awe and who patiently endure that which befalleth them, and these who establish the prayer and of that wherewith We have provided them expend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those whose hearts tremble with awe when Allah is mentioned, and who are patient through whatever visits them, and who maintain the prayer and spend out of what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those whose hearts when Allah is mentioned, are filled with fear, who show patient perseverance over their afflictions, keep up regular prayer, and spend (in charity) out of what We have bestowed upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whose hearts are filled with fear when Allah is mentioned; who patiently bear whatever may befall them (of calamities); and who perform As-Salat (Iqamat-as-Salat), and who spend (in Allah's Cause) out of what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whose hearts, when Allah is mentioned, quake, who endure their misfortunes with patience, and establish their prayers, and spend of that which We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose hearts tremble when God is mentioned, and those who endure what has befallen them, and those who perform the prayer and spend from what We have provided for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, when Allah is mentioned, their hearts are fearful, and [to] the patient over what has afflicted them, and the establishers of prayer and those who spend from what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:35] who, when God is mentioned, their hearts tremble, fear, and who endure [patiently] whatever may befall them, of ordeals, and who observe prayer, at its appointed times, and who, from that which We have provided them, expend, [from it] give voluntary alms.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whose hearts fear when Allah is mentioned) when they are commanded with any command from Allah, 367 (and the patient) and give good tidings to those who are patient that they will have Paradise (of whatever may befall them) of hardship and misfortune, (and those who establish worship) and give good tidings to those who perform the five daily prayers, perfecting their ablution, bowings, prostrations and all that which is obligated in their prescribed times (and who spend) in alms and in giving the poor-due (of that We have bestowed on them) of wealth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجِلَتْ قُلُوبُهُمْ } معناه فَزِعَتْ وَخَافَتْ\n\n",
      "translations": [
        {
          "translation": " And His saying - Exalted is He, {And their hearts became fearful} - its meaning is that their hearts became afraid and terrified.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { الذين إذا ذُكِرَ الله } بالحضور { وجلتْ قلوبهم } انفعلت لقبول فيضه { والصابرين } الثابتين { على ما أصابهم } من المخالفات والمجاهدات { والمقيمي } صلاة المشاهدة { ومما رزقناهم } من الفضائل والكمالات { ينفقون } بالفناء في الله والإفاضة على المستعدين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم { ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ } القادر المقتدر بالإنعام والانتقام { وَجِلَتْ } وخشيت { قُلُوبُهُمْ } خوفاً من قهره وغضبه\n وصولة صفات جلاله وسطوة سلطنته وكبريائه { وَ } أيضاً { ٱلصَّابِرِينَ عَلَىٰ مَآ أَصَابَهُمْ } من المصيبات والبليات التي جرى حكم الله عليه في سابق قضائه { وَٱلْمُقِيمِي ٱلصَّلاَةِ } المفروضة بأوقاتها مع شرائطها\n وأركانها\n وآدابها تقرباً إليه\n وتوجهاً نحوه بكمال الخضوع\n والخشوع\n والتذلل\n والانكسار { وَمِمَّا رَزَقْنَاهُمْ } و استخلفناهم عليه\n ونسبناه إليهم { يُنفِقُونَ } [الحج: 35] على الوجه الذي أمرناهم به\n أي: على المصارف المذكورة في قوله سبحانه:\n\n[التوبة: 60]\n متقربين بها إلى الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهو قوله: { الذين إِذا ذُكرَ اللهُ وجِلَتْ قلوبُهم }: خافت منه هيبة لإشراق أشعة جلاله عليها\n\n{ والصابرين على ما أصابهم } من مشاق التكاليف ومصائب الزمان والنوائب\n { والمقيمي الصلاة } في أوقاتها\n { ومما رزقناهم يُنفقون } في وجوه الخيرات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:60",
      "similarity": 0.8285377502330449
    },
    {
      "verse": "15:52",
      "similarity": 0.8021763051219815
    },
    {
      "verse": "8:2",
      "similarity": 0.7865598080179964
    },
    {
      "verse": "15:53",
      "similarity": 0.7046051650421283
    },
    {
      "verse": "8:3",
      "similarity": 0.22779822560688628
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022035.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022035.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}