{
  "chapter": "الحج",
  "text": "حنفاء لله غير مشركين به ومن يشرك بالله فكانما خر من السماء فتخطفه الطير او تهوى به الريح فى مكان سحيق",
  "translations": [
    {
      "translation": "Be people of pure natural belief in Allah, not associating anything else with Him. As for anyone who associates others with Allah, it is as though he had fallen from the sky and the birds had seized him and carried him away or the wind had dropped him in a distant place.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turn uprightly to God without ascribing compeers to Him; for he who associates any one with God is like a thing that falls from the sky and is either snatched away by birds or carried far away by the wind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Become exclusively devoted to Allah, ascribing Divinity to none other than Him. Whoso ascribes Divinity to aught beside Allah, it is as though he fell down from the sky whereafter either the birds will snatch him away, or the wind will sweep him to a distant place (causing him to be shattered to pieces).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As the upright servants of God, do not consider anything equal to God. To consider things equal to God is like one falling from the sky who is snatched away by the birds or carried away by a strong wind to a far distant place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Devoting yourself to Allah, not ascribing any partner to Him; and whoever ascribes partners to Allah is as if he has fallen from the sky and the birds snatch him or the wind blows him away to a far-off place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hunafa' Lillah, not associating partners unto Him; and whoever assigns partners to Allah, it is as if he had fallen from the sky, the birds caught him in midair, or the wind had thrown him to a far off place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being upright for Allah, not associating aught with Him and whoever associates (others) with Allah, it is as though he had fallen from on high, then the birds snatch him away or the wind carries him off to a far-distant place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "being men pure of faith unto God, not associating with Him anything; for whosoever associates with God anything, it is as though he has fallen from heaven and the birds snatch him away, or the wind sweeps him headlong into a place far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turning unto Allah (only), not ascribing partners unto Him; for whoso ascribeth partners unto Allah, it is as if he had fallen from the sky and the birds had snatched him or the wind had blown him to a far-off place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Devote yourselves to God, not associating any partners with Him. Whoever associates anything with God is like one who falls from heaven and is snatched by the birds or carried away by the wind to a distant place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining unto Allah, not associating aught with Him. And whosoever associateth aught with Allah, it is as though he had fallen from the heaven and the birds had snatched him, or the wind had blown him to a place remote.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as persons having pure faith in Allah, not ascribing partners to Him. Whoever ascribes partners to Allah is as though he had fallen from a height, then [his corpse] is devoured by vultures, or [his remains are] blown away by the wind far and wide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being true in faith to Allah, and never assigning partners to Him: if anyone assigns partners to Allah, is as if he had fallen from heaven and been snatched up by birds, or the wind had swooped (like a bird on its prey) and thrown him into a far-distant place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hunafa' Lillah (i.e. to worship none but Allah), not associating partners (in worship, etc.) unto Him and whoever assigns partners to Allah, it is as if he had fallen from the sky, and the birds had snatched him, or the wind had thrown him to a far off place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "being of pure faith to Allah, not associating anything with Him. He who associates others with Allah is like he who falls from heaven and is snatched away by the birds or carried by the wind to some faroff place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Being true to God, without associating anything with Him. Whoever associates anything with God—it is as though he has fallen from the sky, and is snatched by the birds, or is swept away by the wind to a distant abyss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Inclining [only] to Allah, not associating [anything] with Him. And he who associates with Allah - it is as though he had fallen from the sky and was snatched by the birds or the wind carried him down into a remote place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:31] being hanīfs to God, [being] of those who have submitted [to God], inclining away from every religion except His religion, not ascribing partners to Him (this [clause] emphasises the preceding one, both [clauses] being circumstantial qualifiers referring to the [third person plural indicator] wāw [of ijtanibū, ‘avoid’]). For whoever ascribes partners to God, it is as though he had fallen from the heaven and been snatched away by [vulture] birds, that is, [as though] they had seized him swiftly, or [as though] the wind had blown him, dropped him, into a far-off place, so that there is no hope of his being saved.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Turning unto Allah (only)) be sincere to Allah in your chanting and pilgrimage, (not ascribing partners unto Him) in your chanting or pilgrimage; (for whoso ascribeth partners unto Allah, it is as if he had fallen from the sky and the birds had snatched him) to take him wherever they wish (or the wind had blown him to a far-off place).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي مَكَانٍ سَحِيقٍ } معناه بعيدٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in a place that is sahīq}, means distant.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nيعني: اجتبوا عن الشرك والمعاصي المنافية للتوحيد، وكونوا { حُنَفَآءَ للَّهِ } مخلصين له غير مائلين عن دينه { غَيْرَ مُشْرِكِينَ بِهِ } شيئاً من مظاهره ومصنوعاته { وَ } اعلموا أيها العقلاء الموحدون أن { مَن يُشْرِكْ بِٱللَّهِ } الواحد الأحد المنزه عن الشريك مطلقاً سواء كان شركه خفياً أو جلياً { فَكَأَنَّمَا خَرَّ } وسقط { مِنَ ٱلسَّمَآءِ } أي: أوج الإيمان وأعلى درجة التوحيد والعرفان { فَتَخْطَفُهُ } أي: إذا سقط أخذه { ٱلطَّيْرُ } فجأة في الهواء، فيرميه في حضيض غائر بعيد عن العمران { أَوْ تَهْوِي بِهِ ٱلرِّيحُ } حين سقوطه منها فتطرحه { فِي مَكَانٍ سَحِيقٍ } [الحج: 31] بعيد، ووادٍ عميق\n\n\n\n\nوبالجملة من يشرك بالله - والعاي به منه - فقد وقع في هاوية الضلال بحيث لا يرجى نجاته منها أصلاً، الحكم والأمر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { حنفاءَ لله }: مائلين عن كل دين زائغ إلى دين الحق، مخلصين لله، { غير مشركين به } شيئًا من الأشياء، { ومن يُشرك بالله } ، أظهر الاسم الجليل لإظهار كمال قبح الشرك، { فكأنما خَرَّ }: سقط { من السماء } إلى الأرض لأنه يسقط من أوج الإيمان إلى حضيض الكفر\n وقيل: هو إشارة إلى ما يكون له حين يصعد بروحه عند الموت، فتطرح من السماء إلى الأرض\n قاله ابن البنا\n { فتخطفه الطير } أي: تتناوله بسرعة، فالخطف والاختطاف: تناول الشيء بسرعة لأن الأهواء المردية كانت توزع أفكاره، { أو تَهْوِي به الريحُ } أي: تسقطه وتقذفه\n والهوى: السقوط\n { في مكان سحيق }: بعيد لأن الشيطان قد طرحه في الضلال والتحير الكبير\n والله تعالى أعلم\n الإشارة: جعل الحقُّ تعالى شكرَ النعم أمرين: طهارة الباطن من شرك الميل إلى السِّوى، ولسانه من زور الدعوى، وهو الترامي على مراتب الرجال قبل التحقق بها، حنيفًا موحدًا، شاكرًا لأنعمه يجتبيه ربه، ويهديه إلى صراط مستقيم\n ومن يشرك بالله بأن يُحب معه غيره، فقد سقط عن درجة القرب والتحقيق، فتخطفه طيور الحظوظ والشهوات، وتهوي به ريح الهوى، في مكان سحيق\n والعياذ بالله\n ثمَّ حض على الاعتناء بشأن الهدايا\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:11",
      "similarity": 0.6307971849270023
    },
    {
      "verse": "29:67",
      "similarity": 0.2679591807666954
    },
    {
      "verse": "8:26",
      "similarity": 0.24367588107556612
    },
    {
      "verse": "28:57",
      "similarity": 0.2280244645653361
    },
    {
      "verse": "2:20",
      "similarity": 0.21014334762096967
    }
  ]
}