{
  "chapter": "الحج",
  "text": "اذن للذين يقتلون بانهم ظلموا۟ وان الله على نصرهم لقدير",
  "translations": [
    {
      "translation": "Permission to fight is given to those who are fought against because they have been wronged - truly Allah has the power to come to their support -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission is granted those (to take up arms) who fight because they were oppressed. God is certainly able to give help to those\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission (to fight) has been granted to those for they have been wronged. Verily Allah has the power to help them:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission to take up arms is hereby granted to those who are attacked; they have suffered injustice. God has all the power to give victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission is granted to those against whom the disbelievers wage war, as they are being wronged; and indeed Allah is Able to assist them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission (to fight) is given to those (believers) who are fought against, because they have been wronged; and surely, Allah is able to give them victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission (to fight) is given to those upon whom war is made because they are oppressed, and most surely Allah is well able to assist them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave is given to those who fight because they were wronged -- surely God is able to help them --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sanction is given unto those who fight because they have been wronged; and Allah is indeed Able to give them victory;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission to fight is granted to those who are attacked, because they have been wronged, God indeed has the power to help them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permitted are those who are fought against, because they have been oppressed, and verily to succour them Allah is potent\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are fought against are permitted [to fight] because they have been wronged, and Allah is indeed able to help them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those against whom war is made, permission is given (to fight), because they are wronged;- and verily, Allah is most powerful for their aid;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission to fight is given to those (i.e. believers against disbelievers), who are fighting them, (and) because they (believers) have been wronged, and surely, Allah is Able to give them (believers) victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission is given to those who fight because they were wronged. Allah has power to grant them victory:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission is given to those who are fought against, and God is Able to give them victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permission [to fight] has been given to those who are being fought, because they were wronged. And indeed, Allah is competent to give them victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:39] Permission is granted to those who fight, namely, to the believers, to fight back — this was the first verse to be revealed regarding the struggle [in the way of God] (jihād), because they have been wronged, as a result of the wrong done to them by the disbelievers. And God is truly able to help them;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Sanction is given unto those who fight) sanction has been given to the believers to fight the disbelievers of Mecca (because they have been wronged) the disbelievers of Mecca wronged them; (and Allah is indeed Able to give them victory) Allah is able to give the believers victory over their enemies;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما شق على المسلمين ظلمهم وضررهم وصاروا مهانين صاغيرين مع قدرتهم على مقاتلتهم ومدافعتهم { أُذِنَ } ورُخِّص من جانب الله على لسان رسوله صلى الله عليه وسلم { لِلَّذِينَ يُقَاتَلُونَ } أي: يريدون القتال معهم بعدما تحلموا كثيراً من أذاهم وظلمهم\n فنزل هذه الآية للرخصة بعدما نزلت سبعون آية بعدمها\n لذلك قيل نسخت هذه الآية نيفاً وسبعين\n وإنما رخصهم سبحانه بها { بِأَنَّهُمْ ظُلِمُواْ } أي: بسبب أنهم صاروا مظلومين صاغرين عن أذى الكفار والمشركين { وَإِنَّ ٱللَّهَ } القادر المقتدر { عَلَىٰ نَصْرِهِمْ } أي: نصر الأولياء على الأعداء { لَقَدِيرٌ } [الحج: 39] لينصرهم ويغلبهم عليهم\n وإن كانوا أكثر منهم\n وكيف لا ينتقم سبحانه عن أعدائه لأجل أوليائه؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:19",
      "similarity": 0.455239204911919
    },
    {
      "verse": "74:20",
      "similarity": 0.4379914027368884
    },
    {
      "verse": "84:2",
      "similarity": 0.3897127589732651
    },
    {
      "verse": "84:5",
      "similarity": 0.3897127589732651
    },
    {
      "verse": "42:41",
      "similarity": 0.35526070444119234
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022039.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022039.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}