{
  "chapter": "الحج",
  "text": "والبدن جعلنها لكم من شعئر الله لكم فيها خير فاذكروا۟ اسم الله عليها صواف فاذا وجبت جنوبها فكلوا۟ منها واطعموا۟ القانع والمعتر كذلك سخرنها لكم لعلكم تشكرون",
  "translations": [
    {
      "translation": "We have appointed the sacrificial animals for you as one of the sacred rites of Allah. There is good in them for you, so invoke Allah's name over them, as they stand in rows. And then when they collapse on their sides, eat of them and feed both those who ask and those who are too shy to ask. In this way We have subjected them to you so that hopefully you will be thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the camels signs of God for you. There is good for you in this. So pronounce the name of God over them as they stand with their forefeet in a line. When they have fallen (slaughtered) on their sides, eat of (their meat) and feed those who are content with little, and those who supplicate. That is why We have brought them under your subjugation so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed sacrificial camels among the symbols of (devotion to) Allah. There is much good in them for you. So make them stand (at the time of sacrifice) and pronounce the name of Allah over them, and when they fall down on their sides (after they are slaughtered), eat and also feed them who do not ask and those who ask. Thus have We subjected these animals that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you We have made the sacrificial camel one of the reminders of God. It also has other benefits for you. Consecrate it with the Name of God when it is steadily standing. When it is slaughtered, consume its flesh and give part of it to the needy who do and those do not ask for help from others. Thus We have made the camel subservient to you so that perhaps you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the large sacrificial animals – the camels and the cows – We have made them among the symbols of Allah, there is goodness for you in them; therefore mention the name of Allah over them with their one leg tied and standing on three feet; then when their flanks have fallen, eat from it yourself and feed the one who patiently awaits, and the beggar; this is how We have given them in your control, so that you be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Budn, We have made them for you as among the symbols of Allah, wherein you have much good. So mention the Name of Allah over them when they are drawn up in lines (for sacrifice). Then, when they are down on their sides (after slaughter), eat thereof, and feed the Qani` and the Mu`tarr. Thus have We made them subject to you that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) the camels, We have made them of the signs of the religion of Allah for you; for you therein is much good; therefore mention the name of Allah on them as they stand in a row, then when they fall down eat of them and feed the poor man who is contented and the beggar; thus have We made them subservient to you, that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the beasts of sacrifice -- We have appointed them for you as among God's waymarks; therein is good for you. So mention God's Name over them, standing in ranks then, when their flanks collapse, eat of them and feed the beggar and the suppliant. So We have subjected them to you; haply you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the camels! We have appointed them among the ceremonies of Allah. Therein ye have much good. So mention the name of Allah over them when they are drawn up in lines. Then when their flanks fall (dead), eat thereof and feed the beggar and the suppliant. Thus have We made them subject unto you, that haply ye may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed for you the sacrificial camels as one of the symbols set up by God, in which there is much good for you. So invoke God's name over them as you line them up for slaughter, and when they have fallen down dead, feed yourselves and feed the needy -- those who do not ask as well as those who do. We have thus subjected them to you so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the camels! We have appointed them for you among the landmarks of Allah; for you is good therein; so mention the name of Allah over them, standing in rows. Then when they fall down on their sides, eat thereof and feed the contented and suppliant. Thus We have subjected them to you, that haply ye may return thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed for you the [sacrificial] camels as part of Allah’s sacraments. There is good for you in them. So mention the Name of Allah over them as they stand. And when they have fallen on their flanks, eat from them, and feed the self-contained needy and the mendicant. Thus have We disposed them for your benefit so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sacrificial camels we have made for you as among the symbols from Allah: in them is (much) good for you: then pronounce the name of Allah over them as they line up (for sacrifice): when they are down on their sides (after slaughter), eat ye thereof, and feed such as (beg not but) live in contentment, and such as beg with due humility: thus have We made animals subject to you, that ye may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Budn (cows, oxen, or camels driven to be offered as sacrifices by the pilgrims at the sanctuary of Makkah.) We have made for you as among the Symbols of Allah, therein you have much good. So mention the Name of Allah over them when they are drawn up in lines (for sacrifice). Then, when they are down on their sides (after slaughter), eat thereof, and feed the beggar who does not ask (men), and the beggar who asks (men). Thus have We made them subject to you that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the camels We have made a part of the waymarks of Allah. In them is good for you. Pronounce over them the Name of Allah, when they are hobbled; and when they have fallen down on their sides, eat of them and feed the impoverished nonrequestor and the requestor. As such We have subjected them to you, in order that you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the animal offerings emblems of God for you. In them is goodness for you. So pronounce God’s name upon them as they line up. Then, when they have fallen on their sides, eat of them and feed the contented and the beggar. Thus We have subjected them to you, that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the camels and cattle We have appointed for you as among the symbols of Allah; for you therein is good. So mention the name of Allah upon them when lined up [for sacrifice]; and when they are [lifeless] on their sides, then eat from them and feed the needy and the beggar. Thus have We subjected them to you that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:36] And [as for] the sacrificial camels (al-budn, plural of badana, which are ‘camels’) — We have appointed them for you as one of God’s sacraments, the [ritual] ceremonies of His religion. There is good for you in them, benefit for you in this world, as already mentioned, and a reward in the Hereafter. So mention God’s Name over them, at the point of immolating them, when they are lined up, standing on three legs, with the left foreleg hobbled. Then, when their flanks have collapsed, fallen to the ground after immolation — which is the time when one may eat of them — eat of them, if you wish, and feed the [self-contained] beggar (alqāni‘, [a beggar] who is content with what he is given, neither asking nor approaching [people]) and the suppliant (al-mu‘tarr, [a beggar] who asks [for charity] or approaches [people for that purpose]). So, that is, similar to such a disposal, We have disposed them for you, that it may be immolated or ridden — for otherwise it would not have been possible — that perhaps you might be thankful, for My graces to you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the camels!) and bovines (We have appointed them) We have made them subservient to you (among the ceremonies of Allah) among the rites of the pilgrimage so that you immolate them. (Therein) in these sacrifices (ye have much good) you have much reward. (So mention the name of Allah over them when they are drawn up in lines) when you immolate them, and let them be free of defects; it is also said that this means: they should have their left foot tied up such that they stand on three. (Then when their flanks fall (dead)) after immolating them, (eat thereof) of the meat of these sacrifices (and feed the beggar) who is content with little (and the supplicant) the one who faces you but does not beg of you. (Thus have We made them subject unto you, that haply ye may give thanks) that you may give thanks to His bounty and dispensation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱذْكُرُواْ ٱسْمَ ٱللَّهِ عَلَيْهَا صَوَآفَّ } معناه مصطفةٌ قياماً\n وصوافٌ: أي قيامٌ مَعقُولة عَلَى ثَلاثٍ\n\n\n\n\nوقوله تعالى: { فَإِذَا وَجَبَتْ جُنُوبُهَا } معناه سَقطتْ\n\n\n\n\nوقوله تعالى: { وَأَطْعِمُواْ ٱلْقَانِعَ وَٱلْمُعْتَرَّ } فالقَانعُ: السَّائلُ\n وقالَ: الجَالسُ في بيتِه\n والمُعترُ: الذي يأتيكَ ولاَ يسأُلكُ\n\n\n\n\nوقوله تعالى: { وَٱلْبُدْنَ جَعَلْنَاهَا لَكُمْ مِّن شَعَائِرِ ٱللَّهِ } فالبُدنُ: من البَقرِ والإِبلِ\n وسُميتْ بُدناً لسِمنِهَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd remember the name of Allah over it {i.e., the Quran}, and stand in reverence.\n\n\n{Wastūf} refers to a reasonable {qiyām} (i.e. a standing position) on three things.\n\n\nAnd when her sides fell, it meant that she had collapsed.\n\n\nAnd the saying of Allah, \"And give food to the needy and the oppressed,\" the needy are those who ask.\n\n\nAnd he said, \"Those who are seated in their homes.\"\n The one who comes to you and does not ask you\n\nAnd the {cattle} We have made for you as among the signs of Allah. So cattle, [are] from the cow and the camel.\n My body has been called fat.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } جعلنا خير الهدايا والضحايا { ٱلْبُدْنَ } جمع: بادن كبذل جميع باذل\n وهي: الإبل خاصةً سميت بها\n لعظم بدنها وجسامتها\n وغلاء ثمنها\n وعظم وقعها في نفوس الناس لذلك { جَعَلْنَاهَا لَكُمْ مِّن شَعَائِرِ ٱللَّهِ } وأعلام دينه ومعالم بيته { لَكُمْ فِيهَا خَيْرٌ } كثير\n وأجر جزيل\n وثواب عظيم عند الله إن ذبحتموها\n وإذا أردتم ذبحها { فَٱذْكُرُواْ ٱسْمَ ٱللَّهِ عَلَيْهَا } عند تذكيتها قائلين: الله أكبر\n الله أكبر\n لا إله إلا الله\n والله أكبر\n اللهم منك\n وما لنا إلا امتثال ما أمرتنا به\n والسرّ عندك ولديك\n والحكمة دونك\n واذبحوها { صَوَآفَّ } أي: صافة قوائمها مشدودة محكمة\n ثم تطعنون في لباتها { فَإِذَا وَجَبَتْ } وسقطت { جُنُوبُهَا } على الأرض وخرجت روحها من الجسد { فَكُلُواْ مِنْهَا } إن شئتم { وَأَطْعِمُواْ } أيضاً { ٱلْقَانِعَ } وهو الفقير يقنع بما يُعطى\n ولا يبادر إلى السؤال والإلحاح { وَ } أطعموا أيضاً { ٱلْمُعْتَرَّ } وهو الذي يبادر إلى السؤال قبل الإعطاء\n ويبالغ فيه { كَذٰلِكَ } أي: على الوجه المذكور { سَخَّرْنَاهَا } وذللناها\n أي: البُدن { لَكُمْ } مع أنها في كمال القوة والجسامة\n وأنتم في غاية الضعف\n كي تتفطنوا من تسخيرها وتذليلها عليكم إلى تذليل أمّارتكم المسلطة عليكم\n فذبحتموها في طريق الحق مشدودة قوائم قواها عن مقتضاها { لَعَلَّكُمْ تَشْكُرُونَ } [الحج: 36] نعمة الإقدار والتوفيق عليها\n وتعطون بدلها من لدنه سبحانه: ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والبُدْنَ جعلناها لكم من شعائر الله } أي: من أعلام دينه، وأضافها إلى نفسه تعظيمًا لها، وهي: جمع بدنة، سميت به لعظم بدنها، ويتناول الإبل والبقر والغنم\n { لكم فيها خيرٌ } أي: منافع دينية ودنيوية، النفع في الدنيا، والأجر في العقبى\n { فاذكروا اسم الله عليها } بأن تقولوا عند ذبحها: بسم الله، اللهم منك وإليك\n حال كونها { صوافَّ } أي: قائمات، قد صففن أيديهن وأرجلهن\n { فإِذا وَجَبَتْ جُنُوبُهَا }: سقطت على الأرض، وسكنت حركتها، من وجب الحائط وجبة: سقط، وهي كناية عن الموت\n { فكُلُوا منها } إن شئتم { وأطعِمُوا القانعَ }: السائل، مِنْ: قنع إليه قنوعًا: إذا خضع، { والمُعْتَرَّ } الذي يُعَرِّضُ ولا يسأل\n وقيل: القانع: الراضي بما عنده وبما يُعطي من غير سؤال، والمعترَّ: المتعرض للسؤال\n { كذلك سخرناها لكم } أي: كما أمرناكم بنحرها سخرناها لكم، أي: ذللناها لكم، مع قوتها وعظم أجرامها لتتمكنوا من نحرها، { لعلكم تشكرون } أي: لكي تشكروا إنعام الله عليكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:92",
      "similarity": 0.302021303041797
    },
    {
      "verse": "14:43",
      "similarity": 0.2599161647151231
    },
    {
      "verse": "48:25",
      "similarity": 0.2592962319366722
    },
    {
      "verse": "18:48",
      "similarity": 0.061096618773500304
    },
    {
      "verse": "24:41",
      "similarity": 0.06041396405887955
    }
  ]
}