{
  "chapter": "الحج",
  "text": "ان الله يدفع عن الذين ءامنوا۟ ان الله لا يحب كل خوان كفور",
  "translations": [
    {
      "translation": "Allah will defend those who have iman. Allah does not love any thankless traitor.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will certainly defend the believers. Surely God does not like the traitors who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah defends those who believe. Certainly Allah has no love for the perfidious, the thankless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God defends the believers but He does not love any of the treacherous, ungrateful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah repels the afflictions of the Muslims; indeed Allah does not like any extremely disloyal ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, Allah defends those who believe. Verily, Allah likes not any treacherous ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah will defend those who believe; surely Allah does not love any one who is unfaithful, ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly God will defend those who believe; surely God loves not any ungrateful traitor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah defendeth those who are true. Lo! Allah loveth not each treacherous ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will surely defend the believers. God does not love the perfidious and the ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah will repel from those who believe: verily Allah loveth not any treacherous, ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will indeed defend those who have faith. Indeed Allah does not like any ingrate traitor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah will defend (from ill) those who believe: verily, Allah loveth not any that is a traitor to faith, or show ingratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, Allah defends those who believe. Verily! Allah likes not any treacherous ingrate to Allah [those who disobey Allah but obey Shaitan (Satan)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will defend those who believe. Verily, Allah does not love the ungrateful cheat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God defends those who believe. God does not love any ungrateful traitor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah defends those who have believed. Indeed, Allah does not like everyone treacherous and ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:38] Indeed God protects those who believe, against the [ruinous] misguidance of idolaters. Indeed God does not love the treacherous, with regard to what is entrusted to him, the ungrateful, for His grace — these are the idolaters —in other words, He will punish them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah defendeth those who are true) Allah defends those who believe in Muhammad (pbuh) and in the Qur'an against the disbelievers of Mecca. (Lo! Allah loveth not each treacherous ingrate) who disbelieves in Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما خشي المؤمنون على معاداة المشركين، وخافوشا عن مخاصمتهم، وغيظهم إذا خرجوا نحو مكة للزيارة والطواف قاتَلوا معهم، وأكَّبوا عليهم وعلى أموالهم، وأَسَروا أولادهم، أزال الله سبحانه عنهم الرعب وأسقط عنهم الخشية بقوله: { إِنَّ ٱللَّهَ } المتكفل لأمور عباده، الحفيظ عليهم عما يؤذيهم { يُدَافِعُ } كيد الكفرة العداة البغاة الطغاة { عَنِ ٱلَّذِينَ آمَنُوۤاْ } بالله وصدقوا بشعائر دينه، وقصدوا إقامتها على أمره ووحيه، كيف لا يدفع سبحانه مع كمال قدرته خيانةَ من خان بأحبائه وأصدقائه { إِنَّ ٱللَّهَ } المنتقم لأعدائه { لاَ يُحِبُّ كُلَّ خَوَّانٍ } مبالغ في الخيانة سيما مع أوليائه وأحبائه { كَفُورٍ } [الحج: 38] مبالغ في كفران نعمه، حيث صرفها في غير محله مثل: هدي الكفرة، وذبحهم لأصنامهم وأوثانهم\n\n\n\n\nثم لما اشتد إضرار الكفرة بالمسلمين وامتد أذاهم عليهم ظلماً وعدواناً، أراد المؤمنون أن يقاتلوا ويشاجروا معهم، منعهم رسول الله صلى الله عليه وسلم عن القتال والحراب بإذن الله ووحيه سبعينَ مرة لنزول آية في المنع عنه، وقال صلى الله عليه وسلم في كل مرة: أصبروا حتى يأمر الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { إِن الله يُدافع } يدفع غائلة المشركين { عن الذين آمنوا } فلا يقدرون أن يعوقوهم عن شيء من عبادة الله، بل ينصرهم ويؤيدهم كما قال تعالى:\n\n[غَافر: 51]، وصيغة المفاعلة: إمَّا للمبالغة، أو للدلالة على تكرير الدفع، فإنها قد تجرد عن وقوع الفعل المتكرر من الجانبين، فيبقى تكرره من جانب واحد، كما في المحارسة، أي: يبالغ في دفع ضرر المشركين وشوكتهم، التي من جملتها صدهم عن سبيل الله، مبالغةَ مَن يغالَبُ فيه، أو يدفعها عنهم مرة بعد أخرى، بحسب تجرد قصد الإضرار بالمسلمين، كما في قوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:8",
      "similarity": 0.6583676996674196
    },
    {
      "verse": "70:2",
      "similarity": 0.645805493688798
    },
    {
      "verse": "8:27",
      "similarity": 0.5713290811974933
    },
    {
      "verse": "4:107",
      "similarity": 0.5399555945812289
    },
    {
      "verse": "23:96",
      "similarity": 0.5285989205536564
    }
  ]
}