{
  "chapter": "الحج",
  "text": "فكاين من قرية اهلكنها وهى ظالمة فهى خاوية على عروشها وبئر معطلة وقصر مشيد",
  "translations": [
    {
      "translation": "How many wrongdoing cities We destroyed, and now all their roofs and walls are fallen in; how many abandoned wells and stuccoed palaces!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a habitation given to wickedness have We destroyed, whose roofs tumbled down, which fell into ruins. How many a well and fortress reinforced lie abandoned!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many towns have We destroyed because their people were steeped in iniquity: so they lie fallen down upon their turrets! How many wells lie deserted; and how many towering palaces lie in ruins!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many were the unjust dwellers of the towns that We destroyed. From their trellises to their lofty mansions, all were toppled and their wells were abandoned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a township did We destroy, for they were oppressors – so they now lie flat on their roofs, and many a well lying useless and many a palace in ruins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a township did We destroy while they were given to wrongdoing, so that it lie in ruins, and a deserted well and castle Mashid!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So how many a town did We destroy while it was unjust, so it was fallen down upon its roofs, and (how many a) deserted well and palace raised high.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a city We have destroyed in its evildoing, and now it is fallen down upon its turrets! How many a ruined well, a tall palace!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a township have We destroyed while it was sinful, so that it lieth (to this day) in ruins, and (how many) a deserted well and lofty tower!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town We destroyed which was given to wrongdoing, so that its roofs fell down, and how many a well is deserted and how many a lofty castle is in ruins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a city have We destroyed, while it was a wrong- doer--and it lieth overturned on its roofs, -and how many a well abandoned and how many a castle fortifred!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many towns We have destroyed when they had been wrongdoers! So they lie fallen on their trellises, their wells neglected and their ruined palaces!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many populations have We destroyed, which were given to wrong-doing? They tumbled down on their roofs. And how many wells are lying idle and neglected, and castles lofty and well-built?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a township have We destroyed while it was given to wrong-doing, so that it lies in ruins (up to this day), and (many) a deserted well and lofty castles!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a village We have destroyed in its harmdoing, so that it lies fallen upon its turrets, and how many an abandoned well, and empty palace!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town have We destroyed while it was doing wrong? They lie in ruins; with stilled wells, and lofty mansions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a city did We destroy while it was committing wrong - so it is [now] fallen into ruin - and [how many] an abandoned well and [how many] a lofty palace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:45] How many a town I have destroyed (ahlaktuhā, a variant reading has ahlaknāhā, ‘We have destroyed’), while it was doing wrong, that is, while its inhabitants were [doing wrong] by being disbelievers, but now it lies fallen down, collapsed, on its roofs and, how many, a neglected well, abandoned because of the death of its owners, and a lofty palace, stands empty because of the death of its residents.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How many a township) how many population of townships (have We destroyed) with chastisement (while it was sinful) while their populations were idolaters and disbelievers, (so that it lieth (to this day) in) so they remain demolished until today, (and (how many) a deserted well) and how many wells have been destroyed by their owners such that no one uses them anymore (and lofty tower!) and how many massive towers which exist but which are uninhabited!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَصْرٍ مَّشِيدٍ } معناه مُزّينٌ بالشِّيدِ: وهو الجصُ والجيارُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And a fortified fortress} its meaning is adorned with stone: which is the wall and the moat.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولا تتعجب يا أكمل الرسل من كمال قدرتنا وبسطتنا أمثال هذا { فَكَأَيِّن مِّن قَرْيَةٍ أَهْلَكْنَاهَا } أي: أهكلنا كثيراً من أهل قرية بأنواع العذاب والعقاب { وَهِيَ ظَالِمَةٌ فَهِيَ } أي: أهلها خارجة عن مقتضى حدود الله فهي الآن من ظلم أهلها { خَاوِيَةٌ } ساقطةُ { عَلَىٰ عُرُوشِهَا } أي: ساقطة جدرانها على سقوفها من غاية انهدامها وانتكاسبها { وَ } كم { بِئْرٍ } معينة { مُّعَطَّلَةٍ } لا يستقى منها لهلاك أهلها { وَ } كم { قَصْرٍ } عالٍ { مَّشِيدٍ } [الحج: 45] محكم أركانه وبنيانه\n مجصص أساسه وجدرانه\n خالٍ عن ساكنيها\n غير مسكون فيها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فكأيِّن من قريةٍ أهلكناها } أي: كثيرًا من القرى أهلكناها وخربناها بإهلاك أهلها\n { وهي ظالمةٌ } أي: والحال أنها ظالمة بالكفر والمعاصي\n { فهي خاوية }: ساقطة على { عروشها } \n من خوى النجم: سقط\n والمعنى أنها ساقطة على سقوفها\n أي: خربت سقوفُها على الأرض\n ثم تهدمت حيطانها فسقطت فوق السقوف\n ويجوز أن يكون { على عروشها }: خبرًا بعد خبر\n أي: فهي خالية من السكان\n وهي على عروشها\n أي: قائمة مشرفة على السقوف الساقطة\n { وبئرٍ مُعَطَّلَةٍ } أي: وكم من بئر متروكة مهملة في البوادي والحواضر\n لا يستسقى منها لهلاك أهلها مع توفير مائها\n { وقصْرٍ مَشيدٍ }: مرفوع البنيان\n من شاد البنيان: إذا رفعه\n أو مجصّص بالشيد\n أي: الجص\n أي: مبنيًا بالشيد والجندل\n وقال الضحاك: كانت هذه البئر المعطلة بحضرموت\n في بلدة يقال لها: حاضوراء\n وذلك أن أربعة آلاف ممن آمن بصالح\n ونجوا من العذاب\n أتوا حضرموت\n ومعهم صالح\n فلما حضروا ذلك الموضع\n مات صالح\n فسُمي حضرموت لأن صالحًا لما حضره مات\n فبنوا حاضوراء\n وقعدوا على هذه البئر\n فأقاموا دهرًا طويلاً\n وتناسلوا حتى كثروا\n ثم عبدوا الأصنام وكفروا\n فأرسل الله إليهم نبيًا يقال له: \" حنظلة بن صفوان \" \n فقتلوه فأهلكهم الله\n وعطلت بئرهم وخربت قصورهم\n هـ\n وحاصل المعنى: وكم قرية أهلكناها\n وكم بئر عطلناها عن سقاتها\n وقصر مشيد أخليناه عن ساكنه\n أي: أهلكنا البادية والحاضرة جميعًا\n فخلت القصور عن أربابها\n والآبار عن روادها\n فالأظهر أن البئر والقصر على العموم\n الإشارة: ما سلّى به الرسل - عليهم السلام - تسلى به الأولياء - رضوان الله عليهم - فتكذيب أهل الخصوصية سُنَّة ماضية\n غير أن مُكذبي الرسل يُعاجَلون بالعقوبة\n ومكذبي الأولياء يعاقبون بالبعد والحجاب\n وقال القشيري: { وبئر معطلة } \n الإشارة إلى العيون المفجرة من بواطنهم\n { وقصر مشيد } الإشارة إلى تعطيل أسرارهم عن ساكنيها\n من الهيبة والأنس وسائر المواجيد\n هـ\n قلت: وكأنه فسر القرية بالقلب\n وهلاكه: خلاؤه من نور التوحيد\n فقلوب الغافلين خاوية على عروش عقولهم\n المطموس نورها\n وعيون بواطنهم معطلة من الفكرة\n وأسرارهم خاربة من نور النظرة\n والله تعالى أعلم\n ثمَّ أمر بالاعتبار عن سلف من القرون المهلكة والآبار المعطلة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "81:4",
      "similarity": 0.3284301828205063
    },
    {
      "verse": "4:78",
      "similarity": 0.2866437838959165
    },
    {
      "verse": "18:42",
      "similarity": 0.1535035028653155
    },
    {
      "verse": "27:52",
      "similarity": 0.14907168730337553
    },
    {
      "verse": "47:13",
      "similarity": 0.1304279523936319
    }
  ]
}