{
  "chapter": "الحج",
  "text": "الذين اخرجوا۟ من ديرهم بغير حق الا ان يقولوا۟ ربنا الله ولولا دفع الله الناس بعضهم ببعض لهدمت صومع وبيع وصلوت ومسجد يذكر فيها اسم الله كثيرا ولينصرن الله من ينصره ان الله لقوى عزيز",
  "translations": [
    {
      "translation": "those who were expelled from their homes without any right, merely for saying, 'Our Lord is Allah' (if Allah had not driven some people back by means of others, monasteries, churches, synagogues and mosques, where Allah's name is mentioned much, would have been pulled down and destroyed. Allah will certainly help those who help Him - Allah is All-Strong, Almighty),",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who were driven away from their homes for no other reason than they said: \"Our Lord is God.\" And if God had not restrained some men through some others, monastries, churches, synagogues and mosques, where the name of God is honoured most, would have been razed. God will surely help those who help Him, -- verily God is all-powerful and all-mighty, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who were unjustly expelled from their homes for no other reason than their saying: \"Allah is Our Lord.\" If Allah were not to repel some through others, monasteries and churches and synagogues and mosques wherein the name of Allah is much mentioned, would certainly have been pulled down. Allah will most certainly help those who will help Him. Verily Allah is Immensely Strong, Overwhelmingly Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to those who were unjustly expelled from their homes only because they said, \"God is our Lord.\" Had it not been for God's repelling some people through the might of the others, the monasteries, churches, synagogues, and mosques in which God is very often worshipped would have been utterly destroyed. God shall certainly help those who help Him. He is All-powerful and Majestic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were unjustly expelled from their homes just because they said, “Allah is Our Lord”; and had Allah not repelled some men by means of other men, the abbeys, churches, synagogues and mosques – in which the name of Allah is profusely mentioned – would definitely be demolished; and indeed Allah will assist the one who helps His religion; indeed surely Allah is Almighty, Dominant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been expelled from their homes unjustly only because they said: \"Our Lord is Allah.\" For had it not been that Allah checks one set of people by means of another, Sawami`, Biya`, Salawat, and Masjids, wherein the Name of Allah is mentioned much, would surely have been pulled down. Verily, Allah will help those who help His (cause). Truly, Allah is All-Strong, All-Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been expelled from their homes without a just cause except that they say: Our Lord is Allah. And had there not been Allah's repelling some people by others, certainly there would have been pulled down cloisters and churches and synagogues and mosques in which Allah's name is much remembered; and surely Allah will help him who helps His cause; most surely Allah is Strong, Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who were expelled from their habitations without right, except that they say 'Our Lord is God.' Had God not driven back the people, some by the means of others, there had been destroyed cloisters and churches, oratories and mosques, wherein God's Name is much mentioned. Assuredly God will help him who helps Him -- surely God is All-strong, All-mighty\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been driven from their homes unjustly only because they said: Our Lord is Allah - For had it not been for Allah's repelling some men by means of others, cloisters and churches and oratories and mosques, wherein the name of Allah is oft mentioned, would assuredly have been pulled down. Verily Allah helpeth one who helpeth Him. Lo! Allah is Strong, Almighty -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they are those who have been driven out of their homes unjustly, only because they said, \"Our Lord is God.\" If God did not repel the aggression of some people by means of others, cloisters and churches and synagogues and mosques, wherein the name of God is much invoked, would surely be destroyed. God will surely help him who helps His cause -- God is indeed powerful and mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been driven forth from their abodes without justice, except because they say: our Lord is Allah. And were it not for Allah's repelling of someby means of others, cloisters and churches, synogogues and mosques wherein the name of Allah is mentioned much, would have been pulled down. Surely Allah shall succour whosoever succoureth Him; verily Allah is strong, Mighty\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who were expelled from their homes unjustly, only because they said, ‘Allah is our Lord.’ Had not Allah repulsed the people from one another, ruin would have befallen the monasteries, churches, synagogues and mosques in which Allah’s Name is much invoked. Allah will surely help those who help Him. Indeed Allah is all-strong, all-mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are) those who have been expelled from their homes in defiance of right,- (for no cause) except that they say, \"our Lord is Allah\". Did not Allah check one set of people by means of another, there would surely have been pulled down monasteries, churches, synagogues, and mosques, in which the name of Allah is commemorated in abundant measure. Allah will certainly aid those who aid his (cause);- for verily Allah is full of Strength, Exalted in Might, (able to enforce His Will).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have been expelled from their homes unjustly only because they said: \"Our Lord is Allah.\" - For had it not been that Allah checks one set of people by means of another, monasteries, churches, synagogues, and mosques, wherein the Name of Allah is mentioned much would surely have been pulled down. Verily, Allah will help those who help His (Cause). Truly, Allah is All-Strong, All-Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who have been unjustly driven from their homes, just because they said: 'Our Lord is Allah' Had Allah not repelled some people by the means ofothers, the monasteries and churches, the synagogues and mosques in which the Name of Allah is remembered would have been destroyed. But whoever helps Allah shall be helped by Him. Allah is the Strong, the Almighty,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were unjustly evicted from their homes, merely for saying, “Our Lord is God.” Were it not that God repels people by means of others: monasteries, churches, synagogues, and mosques—where the name of God is mentioned much—would have been demolished. God supports whoever supports Him. God is Strong and Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They are] those who have been evicted from their homes without right - only because they say, \"Our Lord is Allah.\" And were it not that Allah checks the people, some by means of others, there would have been demolished monasteries, churches, synagogues, and mosques in which the name of Allah is much mentioned. And Allah will surely support those who support Him. Indeed, Allah is Powerful and Exalted in Might.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:40] they are, those who were expelled from their homes without right, for their expulsion; they were expelled, only because they said, that is, because of their saying: ‘Our Lord is God’, alone: such a saying is ‘right’, and so then to be expelled for [saying] it is to be expelled without right. Were it not for God’s causing some people (ba‘dahum, ‘some’, substitutes for al-nāsa, ‘people’) to drive back others, destruction would have befallen (read la-huddimat to emphasise a great number [of destructions]; or read la-hudimat) the monasteries, (sawāmi‘) is for monks, and churches, (kanā’is) are for Christians, and synagogues, (salawāt) is the Hebrew term for Jewish houses of worship (kanā’is), and mosques, (masājid) are for Muslims, in which, that is, in which mentioned places, God’s Name is mentioned greatly, and with such destruction acts of worship cease. Assuredly God will help those who help Him, that is, [who] help His religion. God is truly Strong, overpowering His creation, Mighty, Invincible in terms of His dominion and power;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who have been driven from their homes) the disbelievers of Mecca drove them from their homes (unjustly) without any right or crime (only because they said: Our Lord is Allah) only because they said: there is no deity except Allah and Muhammad is the Messenger of Allah. (For had it not been for Allah's repelling some men by means of others) and so He checks by means of the prophets the believers. And through the believers He checks the disbelievers, and through the fighters He checks those who do not take part in fighting; if it had not been for this (cloisters) the cloisters of monks (and churches) of the Jews (and oratories) the Magians' houses of fire, because these were safe from Muslims (and mosques) of the Muslims, (wherein the name of Allah is oft mentioned) repeating the formulas: \"Allah is the greatest\" and \"there is no deity except Allah\", (would assuredly have been pulled down. Verily Allah helpeth one) against his enemies (who helpeth Him) who helps His Prophet in jihad. (Lo! Allah is Strong) to help His Prophet and whoever helps His Prophet, (Almighty) He is Mighty in His vengeance against the enemies of His Prophet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَّهُدِّمَتْ صَوَامِعُ وَبِيَعٌ وَصَلَوَاتٌ وَمَسَاجِدُ } قالَ زيد بن علي عليهما السَّلامُ: فالصَّوامعُ: صَوامعُ الرُّهبانُ\n والبِيعُ: بِيعُ النَّصارى\n والصَّلواتُ: للصابئينَ وهي بالنبطيةِ صلوتا\n وقال: محاريبُ كَانت تُصنعُ عَلَى الطَّريقِ يُصلي فِيها الرُّهبانُ\n والمَساجدُ: مَساجدُ المُسلمين\n وقرأ عاصم الجحدري لَهُدمتْ صَوامعُ وبيعُ وصَلواتُ\n قال كَيفَ تُهدمُ الصَّلاةُ دُونَ الصَّوامعِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {The bridges will be demolished and the sales [of slaves] will be stopped, and the prayers will be interrupted, and the mosques} - Zayd ibn Ali said: \"The bridges are the monasteries of the monks.\"\n\n\nThe sale of Christians\n\n\nAnd the Salawat: for the sick and injured, which in Nabatiya are called Salawat.\n\n\nAnd he said: \"The monks used to build roads and pray on them.\"\n\n\nAnd the mosques: the mosques of the Muslims.\n\n\n{Asim al-Jahdari} read {that the destruction of the mosques, the sale of wine and the prayers} are permissible.\n How can prayer be destroyed without the pillars?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ هم { ٱلَّذِينَ أُخْرِجُواْ مِن دِيَارِهِم } ظلماً وعدواناً { بِغَيْرِ حَقٍّ } ورخصة شرعية موجبة للإخراج والإجلاء { إِلاَّ أَن يَقُولُواْ } أي: لا موجب لأخراجهم سوى قولهم هذا: { رَبُّنَا ٱللَّهُ } الواحد الأحد الصمد المنزه عن الشريك والولد { وَ } كيف لا يدفع سبحانه شر الكفرة عن أوليائه الموحدين؛ إذ { لَوْلاَ دَفْعُ ٱللَّهِ ٱلنَّاسَ بَعْضَهُمْ بِبَعْضٍ } أي: بتسليط أهل الإيمان على المشركين المعاندين { لَّهُدِّمَتْ } وخرجت باستيلاء الأعداء على الأولياء { صَوَامِعُ } للرهابنة { وَبِيَعٌ } للنصارى { وَصَلَوَاتٌ } هي كنائس اليهود { وَمَسَاجِدُ } للمسلمين، إنما عد كل واحد منها { يُذْكَرُ فِيهَا } أي: في كل واحد منها { ٱسمُ ٱللَّهِ كَثِيراً } أي: حيناً كثيراً، وذكراً كثيراً { وَ } اللهِ { لَيَنصُرَنَّ ٱللَّهُ } المتكفل بعباده { مَن يَنصُرُهُ } ويعين دينه ونبيه ويصدق كتابه { إِنَّ ٱللَّهَ } المطلع لما في صدور عباده من الإخلاص { لَقَوِيٌّ عَزِيزٌ } [الحج: 40] غالب قادر على الإنعام والانتقام لأوليائه من أعدائه، كما سلط ضعفاء أهل الإيمان على صناديد العرب والعجم من الأكاسرة والقياصرة، وشاع دينهم بين الأنام إلى يوم القيامة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إلا أن يقولوا } ، قيل: منقطع، وقال الزمخشري: في محل الجر، بدل من حق\n هـ\n وهو على طريق قول الشاعر:\n\nيقول الحقّ جلّ جلاله: { أُذِنَ } أي: رُخص وشرع، أو أَذن اللهُ { للذين يُقاتَلون } أي: يُقاتلهم الكفارُ المشركون، وحذف المأذون فيه لدلالة \" يُقاتَلون \" عليه، أي: في قتالهم، { بأنهم ظُلموا } أي: بسبب كونهم مظلومين، وهم أصحاب رسول الله صلى الله عليه وسلم، كان مشركو مكة يؤذونهم أذىً شديدًا، وكانوا يأتون رسول الله صلى الله عليه وسلم من بين مضروبٍ ومشجوج، فيتظلمون إليه، فيقول لهم رسول الله صلى الله عليه وسلم:\n\n \" اصبروا فإني لم أومر بالقتال \" \n\nحتى هاجر، فنزلت هذه الآية\n وهي أول آية نزلت في الجهاد، بعد ما نهى عنه في نيف وسبعين آية\n { وإِنّ الله على نصرهم لقديرٌ }\n وعدٌ لهم بالنصر، وتأكيد لِما مرّ من العِدَة الكريمة بالدفع، وتصريح بأن المراد ليس مجرد تخليصهم من يد المشركين، بل بغلبتهم وإظهارهم عليهم\n وتأكيده بكلمة التحقيق\n واللام لمزيد من تحقيق مضمونه، وزيادة توطين نفوس المؤمنين\n  ثم وصف الذين أَذن لهم، أو فسرهم، أو مدحهم بقوله: { الذين أُخرجوا من ديارهم } ، يعني مكة: { بغير حق } بغير ما يوجب إخراجهم { إلا أن يقولوا ربنا الله } أي: بغير موجب سوى التوحيد، الذي ينبغي أن يكون موجبًا للإقرار لا للإخراج\n ومثله:\n\n[المَائدة: 59]\n { ولولا دفعُ اللهِ الناسَ }: لولا أن يدفع الله الناس { بعضهم ببعض } بتسليط المؤمنين على الكافرين في كل عصر وزمان، وإقامة الحدود وكف المظالم، { لهُدِّمت } أي لخربت باستيلاء الكفرة على الملل، { صَوَامِعُ }: جمع صومَعة - بفتح الميم -، وهي: متعبد النصارى والصابئين منهم، ويسمى أيضًا الدير\n وسُمي بها موضع الأذان من الإسلام: { وَبِيَعٌ }: جمع بيعة - بكسر الباء -: كنائس النصارى، { وصلوات }: كنائس اليهود، سميت بما يقع فيها، وأصلها: صلَوتا بالعبرانية، ثم عُربت، { ومساجد } للمسلمين، { يُذْكَرُ فيها اسمُ الله كثيرًا } أي: ذكرًا كثيرًا، أو وقتًا كثيرًا، صفة مادحة للمساجد، خُصت بها دلالةً على فضلها وفضل أهلها\n وقيل يرجع للأربع، وفيه نظر فإنَّ ذكر الله تعالى في الصوامع والبيع والكنائس قد انقطع بظهور الإسلام، فَقَصْدُ بيانِه، بعد نسخ شرائعها مما لا يقتضيه المقام، ولا ترتضيه الأفهام\n وقدمت الثلاثة على المساجد لتقدمها وجودًا، أو لقربها من التهديم\n { ولينصرنّ اللهُ مَن ينصره } أي: وتالله، لينصرن الله من ينصر دينه ونبيه - عليه الصلاة والسلام - وأولياءه\n ومن نصرِه: إشهاره وإظهاره، وتعليمه لمن لا يعلَمه، وإعزاز حامل لوائه من العلماء والأولياء\n\n\nوقد أنجز الله وعده، حيث سلط المهاجرين والأنصارعلى صناديد العرب وأكاسرة العجم وقياصرة الروم، وأورثهم أرضهم وديارهم، { إِن الله لقوي عزيز }: غالب على ما يريد، ومن جملته: نصرهم وإعلاؤهم\n ثم وصف الذين أُخرجوا من ديارهم بقوله: { الذين إِن مكَّناهم في الأرض أقاموا الصلاة وآتُوا الزكاة وأمروا بالمعروف ونَهوا عن المنكر } قلت: الصواب ما قاله مكي: أنه بدل مِن: \" مَن ينصره \" ، في محل نصب\n قيل: المراد بهم: الصحابة - رضي الله عنهم -، وقيل: الأمة كلها\n وقيل الخلفاء الأربعة لأنهم هم الذين مُكِّنوا في الأرض بالخلافة، وفعلوا ما وصفهم الله به\n وفيه دليل صحة أمرِ الخلفاء الراشدين لأن الله - عزّ وجلّ - أعطاهم التمكين، ونفاذ الأمر مع السيرة العادلة\n وعن عثمان رضي الله عنه: هذا، والله، ثناء قبل بلاء، يعني: أن الله تعالى أثنى عليهم قبل ظهور الشر من الهرج والفتن فيهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:8",
      "similarity": 0.09055452389731895
    },
    {
      "verse": "70:2",
      "similarity": 0.08995450947578908
    },
    {
      "verse": "23:96",
      "similarity": 0.08815944411717072
    },
    {
      "verse": "22:38",
      "similarity": 0.08745801039873041
    },
    {
      "verse": "41:34",
      "similarity": 0.08678644609448806
    }
  ]
}