{
  "chapter": "الحج",
  "text": "الذين ان مكنهم فى الارض اقاموا۟ الصلوة وءاتوا۟ الزكوة وامروا۟ بالمعروف ونهوا۟ عن المنكر ولله عقبة الامور",
  "translations": [
    {
      "translation": "those who, if We establish them firmly on the earth, will establish salat and pay zakat, and command what is right and forbid what is wrong. The end result of all affairs is with Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who would be firm in devotion, give zakat, and enjoin what is good and forbid what is wrong, if We gave them authority in the land. But the resultance of things rests with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah will certainly help) those who, were We to bestow authority on them in the land, will establish Prayers, render Zakah, enjoin good, and forbid evil. The end of all matters rests with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will certainly help those who, if given power in the land, will worship God through prayer, pay the religious tax, enjoin others do good, and prevent them from committing evil. The consequence of all things is in the hands of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people who, if We give them control in the land, would keep the prayer established and pay charity and enjoin virtue and forbid from evil; and for Allah only is the result of all works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, if We give them power in the land, establish the Salah, enforce the Zakah, and they enjoin the good and forbid the evil. And with Allah rests the end of (all) matters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, should We establish them in the land, will keep up prayer and pay the poor-rate and enjoin good and forbid evil; and Allah's is the end of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who, if We establish them in the land, perform the prayer, and pay the alms, and bid to honour, and forbid dishonour; and unto God belongs the issue of all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, if We give them power in the land, establish worship and pay the poor-due and enjoin kindness and forbid iniquity. And Allah's is the sequel of events.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They are] those who, if We established them in the land, would say their prayers regularly and pay the zakat and enjoin good and forbid evil. The final outcome of all affairs rests with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who if We establish them in the earth, shall establish the prayer and give the poor-rate and command that which is reputable and restrain that which is disreputable and unto Allah is the end of all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, if We granted them power in the land, will maintain the prayer, give the zakat, bid what is right and forbid what is wrong. And with Allah rests the outcome of all matters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are) those who, if We establish them in the land, establish regular prayer and give regular charity, enjoin the right and forbid wrong: with Allah rests the end (and decision) of (all) affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those (Muslim rulers) who, if We give them power in the land, (they) order for Iqamat-as-Salat. [i.e. to perform the five compulsory congregational Salat (prayers) (the males in mosques)], to pay the Zakat and they enjoin Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam orders one to do), and forbid Al-Munkar (i.e. disbelief, polytheism and all that Islam has forbidden) [i.e. they make the Quran as the law of their country in all the spheres of life]. And with Allah rests the end of (all) matters (of creatures).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who, if We established them in the land, will establish the prayers and pay the obligatory charity, order with honor and forbid dishonor, and to Allah is the end of all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, when We empower them in the land, observe the prayer, and give regular charity, and command what is right, and forbid what is wrong. To God belongs the outcome of events.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And they are] those who, if We give them authority in the land, establish prayer and give zakah and enjoin what is right and forbid what is wrong. And to Allah belongs the outcome of [all] matters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:41] those who, if We empower them in the land, by granting them victory over their enemies, maintain the prayer, and pay the alms, and enjoin decency and forbid indecency (this [last] is the response to the   conditional clause, which together with the response constitute a relative clause of the relative noun [‘those who’]; hum, ‘they [are]’, may be taken as the implied subject before this). And with God rests the outcome of all matters, in other words, to Him these [matters] return in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "368 (Those who, if We give them power in the land) We make them dwell in the land of Mecca, (establish worship) perform the five daily prayers (and pay the poor-due) from their wealth (and enjoin kindness) and enjoin Allah's divine Oneness and the following of Muhammad (pbuh) (and forbid iniquity) and forbid disbelief, idolatry and disobedience of the Messenger. (And Allah's is the sequel of events) the consequence of all matters will be Allah's in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { الذين إن مكّناهم في الأرض } بالاستقامة بالوجود الحقاني { أقاموا } صلاة المراقبة والمشاهدة { وآتوا } زكاة العلوم الحقيقية والمعارف اليقينية من نصاب المكاشفة مستحقيها من الطلبة { وأمروا } القوى النفسانية والنفوس الناقصة { بالمعروف } من الأعمال الشرعية والأخلاق المرضية في مقام المشاهدة\n ونهوهم { عن المنكر } من الشهوات البدنية واللذات الحسيّة والرذائل المردية والمعاملة { ولله عاقبة الأمور } بالرجوع إليه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ هم: { ٱلَّذِينَ إِنْ مَّكَّنَّاهُمْ } وقدرناهم وجعلنا لهم التصرف والاستيلاء { فِي ٱلأَرْضِ } المعدة للطاعات والعبادات { أَقَامُواْ } وأداموا { ٱلصَّلاَةَ } والميل إلينا بجميع جوارحهم وأركانهم ميلاً مقروناً بأنواع الخضوع\n والخشوع\n والاستكانة\n والانكسار\n تطهيراً لنفوسهم عن العتو والاستكبار\n وتقريباً لهم إلينا على وجه المذلة والافتقار { وَ } مع ذلك { آتَوُاْ ٱلزَّكَـاةَ } المصفية لبواطنهم عن الميل إلى زخرفة الدنيا الغدارة { وَأَمَرُواْ } على من دونهم { بِٱلْمَعْرُوفِ } المستحسن عقلاً وشرعاً { وَنَهَوْاْ عَنِ ٱلْمُنْكَرِ } المستقبح شرعاً وعرفاً على الوجه المبين لهم من ألسنة رسلهم كتبهم المنزلة عليهم من الله { وَلِلَّهِ } المدبر لأحوال عباده { عَاقِبَةُ ٱلأُمُورِ } [الحج: 41] أي: مرجع جميع الأمور الجارية فيما بينهم\n المتعلق بتهذيب ظواهرهم\n وموانع بواطنهم عن موانع الوصول إلى مرتبة التوحيد\n\n\nثم لما تغمم رسول الله صلى لله عليه وسلم وتحزّن من تكذيب قومه إياه صلى الله عليه وسلم\n ونسبتهم له ما لا يليق بشأنه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولله عاقِبةُ الأمور } فإنَّ مرجعها إلى حكمه وتقديره فقط\n وفيه تأكيد للوعد بإظهار أوليائه وإعلاء كلمته\n الإشارة: إذا اتصل الإنسان بشيخ التربية فقد أذن له في جهاد نفسه\n إن أراد الوصول إلى حضرة ربه لأنها ظالمة تحول بينه وبين سعادته الأبدية\n وإن الله على نصرهم لقدير لأن هِمَّةَ الشيخ تحمله وتنصره بإذن الله\n وأما إن لم يتصل بشيخ التربية\n فإن مجاهدته لنفسه لا تُصيب مَقاتلها لدخولها تحت الرماية\n فلا يُصيبها ضربه\n وأما الشيخ فلأنه يريه مساوئها ويعينه على قتلها\n وقوله تعالى: { الذين أُخرجوا من ديارهم بغير حق } هم الذين أُمروا بقتل نفوسهم\n فإنهم إذا خرقوا عوائد نفوسهم\n وخرجوا عن عوائد الناس\n رفضوهم وأنكروهم\n وربما أخرجوهم من ديارهم\n فقلَّ أن تجد وليًا بقي في وطنه الأول\n وما نقموا منهم وأخرجوهم إلا لقصدهم مولاهم\n وقولهم: ربُّنا الله دون شيء سواه\n فحيث خرجوا عن عوائدهم وقصدوا مولاهم\n أنكروهم وأخرجوهم من أوطانهم\n ولولا دفع الناس بعضهم ببعض بأن شفع خيارهم في شرارهم\n لهدمت دعائم الوجود لأنَّ من آذى وليًا فقد آذن بالحرب\n قال القشيري: { ولولا دفع الله الناس } \n أي: يتجاوز عن الأصاغر لِقَدْرِ الأكابر استبقاء لمنازل العبادة\n تلك سُنَّة أجراها\n ثم قال: { الذين إن مكّناهم في الأرض } \n أي: لم يشتغلوا في ذلك بحظوظٍ\n ولكن قاموا لأداء حقوقنا\n هـ\n وكما بشر نبيه عليه الصلاة والسلام مع المؤمنين بالدفع والنصر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:71",
      "similarity": 0.6031101939830066
    },
    {
      "verse": "3:104",
      "similarity": 0.46086024865015385
    },
    {
      "verse": "77:21",
      "similarity": 0.45643747085587066
    },
    {
      "verse": "3:114",
      "similarity": 0.44347226077873464
    },
    {
      "verse": "3:110",
      "similarity": 0.43523454476228884
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022041.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022041.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:41.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}