{
  "chapter": "الحج",
  "text": "افلم يسيروا۟ فى الارض فتكون لهم قلوب يعقلون بها او ءاذان يسمعون بها فانها لا تعمى الابصر ولكن تعمى القلوب التى فى الصدور",
  "translations": [
    {
      "translation": "Have they not travelled about the earth and do they not have hearts to understand with or ears to hear with? It is not their eyes which are blind but the hearts in their breasts which are blind.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land that they could have the heart to understand, and ears to hear? It is not the eyes alone that do not see, oblivious are the hearts within their breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed in the land that their hearts might understand and their ears might listen? For indeed it is not the eyes that are blinded; it is rather the hearts in the breasts that are rendered blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled (sufficiently) in the land to have understanding hearts and listening ears? It is their hearts which are blind, not their ears.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So have they not travelled in the land, to have hearts with which to understand and ears to hear with? So it is not the eyes that are blind, but it is the hearts in the bosoms, that are blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not traveled through the land, and have they hearts wherewith to understand and ears wherewith to hear Verily, it is not the eyes that grow blind, but it is the hearts which are in the breasts that grow blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land so that they should have hearts with which to understand, or ears with which to hear? For surely it is not the eyes that are blind, but blind are the hearts which are in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not journeyed in the land so that they have hearts to understand with or ears to hear with? It is not the eyes that are blind, but blind are the hearts within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land, and have they hearts wherewith to feel and ears wherewith to hear? For indeed it is not the eyes that grow blind, but it is the hearts, which are within the bosoms, that grow blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have these people not travelled through the land to make their hearts understand and let their ears hear; the truth is that it is not the eyes that are blind but the hearts that are in the bosoms that are blinded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not marched forth in the land, so that there might become unto them hearts to understand with or ears re hear with? Verily it is not the sights that are blinded but blinded are the hearts that are in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the land so that they may have hearts by which they may exercise their reason, or ears by which they may hear? Indeed, it is not the eyes that turn blind, but it is the hearts in the breasts that turn blind!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not travel through the land, so that their hearts (and minds) may thus learn wisdom and their ears may thus learn to hear? Truly it is not their eyes that are blind, but their hearts which are in their breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the land, and have they hearts wherewith to understand and ears wherewith to hear? Verily, it is not the eyes that grow blind, but it is the hearts which are in the breasts that grow blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they never journeyed through the land so that they have hearts to understand, or ears to hear with? It is not the eyes, but the hearts in the chests that are blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed in the land, and had minds to reason with, or ears to listen with? It is not the eyes that go blind, but it is the hearts, within the chests, that go blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So have they not traveled through the earth and have hearts by which to reason and ears by which to hear? For indeed, it is not eyes that are blinded, but blinded are the hearts which are within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:46] Have they, namely, the disbelievers of Mecca, not travelled in the land so that they may have hearts with which to comprehend, what befell deniers before them, or ears with which to hear?, the stories of how they were destroyed and their dwelling-places were ruined, and so take heed? Indeed it is not the eyes that turn blind, but it is the hearts that turn blind within the breasts (allatī fī’l-sudūr, for emphasis).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they not travelled in the land) have the people of Mecca not travelled for their trade, (and have they hearts wherewith to feel) fear and that which was done to others upon beholding and reflecting (and ears wherewith to hear) the Truth and threats? (For indeed it) seeing without reflection; it is also said that \"it\" here refers to the expression of idolatry (is not the eyes that grow blind) such that it ceases to see physical objects, (but it is the hearts which are within the bosoms, that grow blind) from the Truth and guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } ينكرون هذه المذكورات { فَلَمْ يَسِيرُواْ } ويسافروا { فِي ٱلأَرْضِ } المعدة للعبرة والاستبصار { فَتَكُونَ } وتحصل { لَهُمْ قُلُوبٌ يَعْقِلُونَ } ويعتبرون { بِهَآ } من الوقائع الواقعة فيها للأم الهاكة { أَوْ } تحصل لهم { آذَانٌ } وقوة استماع { يَسْمَعُونَ بِهَا } أخبارهم وآثارهم، وكيفية إهلاكهم واستئصالهم { فَإِنَّهَا } أي: شأن قصصهم ووقائعهم أنها { لاَ تَعْمَى ٱلأَبْصَارُ } منها؛ لأن الأبصار تشاهد آثارهم وأطلالهم { وَلَـٰكِن تَعْمَىٰ ٱلْقُلُوبُ ٱلَّتِي فِي ٱلصُّدُورِ } [الحج: 46] إذ لم يعتبروا منها ولم يستبصروا ولم ينظروا إليها نظر المعتبر المتأمل والمستبصر الخبير، والجملة من لم يعتبر بما جرى على الأمم الهالكة من الوقائع الهائلة، فهم عميٌ قلوبهم وإن كانت أعينهم صحيحة\n\n\n\n\nوبعدما استبطأ الكفار نزول العذاب الموعود وقالوا:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أفلم }: الفاء عطف على مقدار أي أَغفلوا فلم يسيروا فيعتبروا، { فإنها }: ضمير القصة، أو مبهم يُفسره ما بعده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:109",
      "similarity": 0.38135302253772946
    },
    {
      "verse": "10:43",
      "similarity": 0.379438778509094
    },
    {
      "verse": "35:19",
      "similarity": 0.3605415713535185
    },
    {
      "verse": "27:81",
      "similarity": 0.34473238705823644
    },
    {
      "verse": "30:53",
      "similarity": 0.34473238705823644
    }
  ]
}