{
  "chapter": "الحج",
  "text": "وان يكذبوك فقد كذبت قبلهم قوم نوح وعاد وثمود",
  "translations": [
    {
      "translation": "If they deny you, the people of Nuh before them denied him and those of 'Ad and of Thamud",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they accuse you of falsehood, (remember that) the people of Noah, 'Ad and Thamud had accused (their apostles) before,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), if they give the lie to you, then before them the people of 'Ad and Thamud, also gave the lie (to the Prophets),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they have called you, (Muhammad), a liar, (remember that) the people of Noah, Ad, Thamud,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they belie you (O dear Prophet Mohammed – peace and blessings be upon him), then indeed the people of Nooh, and the tribes of A’ad and Thamud have belied before them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny you, so did deny before them the people of Nuh, `Ad and Thamud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they reject you, then already before you did the people of Nuh and Ad and Samood reject (prophets).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they cry lies to thee, so too before them the people of Noah cried lies, and Ad and Thamood,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they deny thee (Muhammad), even so the folk of Noah, and (the tribes of) A'ad and Thamud, before thee, denied (Our messengers);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If your opponents deny you, remember that, before them, the people of Noah and the tribes of 'Ad and Thamud denied their messengers likewise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they belie thee, then surely there have belied before them the people of Nuh and the 'Aad and the Thamud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they impugn you, the people of Noah had impugned before them and ‘Ad and Thamud,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they treat thy (mission) as false, so did the peoples before them (with their prophets),- the People of Noah, and 'Ad and Thamud;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they belie you (O Muhammad SAW), so were belied the Prophets before them, (by) the people of Nuh (Noah), 'Ad and Thamud,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they belie you, so too before them, the nation of Noah belied, and Aad and Thamood\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they deny you—before them the people of Noah, and Aad, and Thamood also denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they deny you, [O Muhammad] - so, before them, did the people of Noah and 'Aad and Thamud deny [their prophets],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:42] And if they deny you — these [words] to the end [of the statement] are meant to comfort the Prophet (s) — the people of Noah denied before them (kadhdhabat, in the feminine person on the basis of the [overall] import), and ‘Ād, the people of Hūd, and Thamūd, the people of Sālih,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If they deny thee) if the Quraysh deny, Muhammad, (even so the folk of Noah) denied Noah, (and (the tribes of) 'Aad) the people of Hud denied Hud (and Thamud) the people of Salih denied Salih, (before thee) before your people, (denied) they all denied their messengers;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nالفرق بين النبيّ والرسول، أن النبيّ هو الواصل بالفناء في مقام الولاية، الراجع بالوجود الموهوب إلى مقام الاستقامة متحققاً بالحق، عارفاً به، متنبئاً عنه وعن ذاته وصفاته وأفعاله وأحكامه بأمره، مبعوثاً للدّعوة إليه على شريعة المرسل الذي تقدّمه غير مشرّع لشريعة ولا واضع لحكم وملّة، مظهراً للمعجزات، منذراً أو مبشّراً للناس كأنبياء بني إسرائيل إذ كلهم كانوا داعين إلى دين موسى عليه السلام غير واضعين لملّة وشريعة، ومن كان ذا كتاب كداود عليه السلام كان كتابه حاوياً للمعارف والحقائق والمواعظ والنصائح دون الأحكام والشرائع\n ولهذا قال عليه السلام:\n\n \" علماء أمتي كأنبياء بني إسرائيل \" \n\n، وهم الأولياء العارفون، المتمكنون\n والرسول هو الذي يكون له مع ذلك كله وضع شريعة وتقنين، فالنبيّ متوسط بين الوليّ والرسول\n { إذا تمنى } ظهرت نفسه بالتمني في مقام التلوين { ألقى الشيطان في } وعاء { أمنيته } ما يناسبها لأن ظهور النفس يحدث ظلمة وسواداً في القلب يحتجب بها الشيطان ويتخذها محل وسوسته وقالب إلقائه بالتناسب { فينسخ الله ما يلقي الشيطان } بإشراق نور الروح على القلب بالتأييد القدسيّ وإزالة ظلمة ظهور النفس وقمعها ليظهر فساد ما يلقيه ويتميز منه الإلقاء الملكي فيضمحل ويستقرّ الملكي { ثم يحكم الله آياته } بالتمكين { والله عليم } يعلم الإلقاءات الشيطانية وطريق نسخها من بين وحيه { حكيم } يحكم آياته بحكمته، ومن مقتضيات حكمته أنه يجعل الإلقاء الشيطاني فتنة للشاكين المنافقين المحجوبين القاسية قلوبهم عن قبول الحق وابتلاءهم لازدياد شكّهم وحجابهم به، فإنهم بمناسبة نفوسهم الظلمانية وقلوبهم المسودّة القاسية لا يقبلون إلا ما يلقي الشيطان، كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما تغمم رسول الله صلى لله عليه وسلم وتحزّن من تكذيب قومه إياه صلى الله عليه وسلم، ونسبتهم له ما لا يليق بشأنه، أراد سبحانه أن يسلّي حبيبه صلى الله عليه وسلم ويزيل عنه همَّه فقال: { وَإِن يُكَذِّبُوكَ } قومُك يا أكمل الرسل لا تبال بهم وبتكذيبهم { فَقَدْ كَذَّبَتْ قَبْلَهُمْ } أي: قبل أمتك { قَوْمُ نُوحٍ } أخاك نوحاً عليه لاسلام { وَعَادٌ } أخاك هوداً عليه السلام { وَثَمُودُ } [الحج: 42] أخاك صالحاً عليه السلام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}