{
  "chapter": "الحج",
  "text": "كتب عليه انه من تولاه فانه يضله ويهديه الى عذاب السعير",
  "translations": [
    {
      "translation": "It is written of him that if anyone takes him as a friend, he will mislead him and guide him to the punishment of the Searing Blaze.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, it is inscribed, will beguile whoever follows him, and lead him to the torment of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "although it is decreed about him that he shall lead into error whosoever takes him for a friend, and will direct him to the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been decided that satan will mislead and submit anyone who establishes friendship with him to the torment of the burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The devil) Upon whom is decreed that whoever befriends him, he will certainly mislead him and show him the path to hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For him (the devil) it is decreed that whosoever follows him, he will mislead him, and will drive him to the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Against him it is written down that whoever takes him for a friend, he shall lead him astray and conduct him to the chastisement of the burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "against whom it is written down that whosoever takes him for a friend, him he leads astray, and he guides him to the chastisement of the burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For him it is decreed that whoso taketh him for friend, he verily will mislead him and will guide him to the punishment of the Flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it has been decreed concerning anyone whom he befriends, that he shall mislead him and guide him to the punishment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Against whom it is prescribed, that: whosoever befriendeth him, him he shall lead astray and shall guide him on to the torment of the Flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "about whom it has been decreed that he will mislead those who take him for an ally, and conduct them toward the punishment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "About the (Evil One) it is decreed that whoever turns to him for friendship, him will he lead astray, and he will guide him to the Penalty of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For him (the devil) it is decreed that whosoever follows him, he will mislead him, and will drive him to the torment of the Fire. [Tafsir At-Tabari]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "against whom it is written down that whosoever takes him for a guide, he guides astray, and leads him to the punishment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was decreed for him, that whoever follows him—he will misguide him, and lead him to the torment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been decreed for every devil that whoever turns to him - he will misguide him and will lead him to the punishment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:4] about whom it has been decreed, in other words, it has been decreed with regards to a devil, that whoever takes him for a friend, that is, [whoever] follows him, he will make him go astray and will lead him, summon him, to the chastisement of the Blaze, namely, to the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For him) for the devil (it is decreed that whoso taketh him for friend) whoever obeys him, (he verily will mislead him) from the guidance (and will guide him) and will invite him (to the punishment of the Flame) to that which incurs the punishment of the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولذلك { كُتِبَ } ونص { عَلَيْهِ } أي: الشيطان المَرِيد المردود { أَنَّهُ مَن تَوَلاَّهُ } أي: الشيطان، واتخذه ولياً من دون الله واقتدى له واقتفى أثره { فَأَنَّهُ } أي: الشيطان بإغوائه وإغرائه { يُضِلُّهُ } ويصرفه عن سواء السبيل الذي هو طريق الإيمان والتوحيد { وَيَهْدِيهِ } على مقتضى تلبيسه وتغريره { إِلَىٰ عَذَابِ ٱلسَّعِيرِ } [الحج: 4] بئس المولى وبئس النصير\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:47",
      "similarity": 0.7645231167614469
    },
    {
      "verse": "54:24",
      "similarity": 0.6819089372022836
    },
    {
      "verse": "84:12",
      "similarity": 0.6162488166266068
    },
    {
      "verse": "81:12",
      "similarity": 0.6150373193202681
    },
    {
      "verse": "67:10",
      "similarity": 0.582417626305483
    }
  ]
}