{
  "chapter": "الحج",
  "text": "واصحب مدين وكذب موسى فامليت للكفرين ثم اخذتهم فكيف كان نكير",
  "translations": [
    {
      "translation": "and the companions of Madyan; and Musa was denied as well. I allowed time to the kafirun but then I seized them. How terrible was My denial!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Midian too. Moses was also accused of lies. So I allowed the infidels respite and then seized them. How was My reprobation then!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and so did the dwellers of Midian, and Moses too was branded a liar. Initially I granted respite to the unbelievers for a while and then seized them. How dreadful was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Midian, and Moses had also called their Prophets liars. I gave respite to the unbelievers, then sized them with torment. How terrible was that torment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Madyan; and Moosa was belied, so I gave the disbelievers respite and then seized them, so how (dreadful) was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the dwellers of Madyan; and denied was Musa. But I granted respite to the disbelievers for a while, then I seized them, and how (terrible) was My punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As well as those of Madyan and Musa (too) was rejected, but I gave respite to the unbelievers, then did I overtake them, so how (severe) was My disapproval.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the men of Midian; to Moses also they cried lies. And I respited the unbelievers, then I seized them; and how was My horror!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And) the dwellers in Midian. And Moses was denied; but I indulged the disbelievers a long while, then I seized them, and how (terrible) was My abhorrence!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the inhabitants of Midian also charged their prophets with falsehood. Moses was also rejected. I gave respite to those who denied the truth, but then I seized them. Consider then, how terrible My repudiation of them was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the denizens of Madyan. And belied was Musa. I gave rein to the infidels; then took hold of them; so how hath been My wrath!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the inhabitants of Midian, and Moses was also impugned. But I gave the faithless a respite, then I seized them and how was My rebuttal!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Companions of the Madyan People; and Moses was rejected (in the same way). But I granted respite to the Unbelievers, and (only) after that did I punish them: but how (terrible) was my rejection (of them)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the dwellers of Madyan (Midian); and belied was Musa (Moses), but I granted respite to the disbelievers for a while, then I seized them, and how (terrible) was My Punishment (against their wrong-doing).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the inhabitants of Midian, to Moses they also belied. I respited the unbelievers, then I seized them, and how was My disapproval!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the inhabitants of Median. And Moses was denied. Then I reprieved those who disbelieved, but then I seized them. So how was My rejection?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the inhabitants of Madyan. And Moses was denied, so I prolonged enjoyment for the disbelievers; then I seized them, and how [terrible] was My reproach.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:44] and the inhabitants of Midian, the people of Shu‘ayb, and Moses was also denied: he was denied by the [native] Egyptians (al-qibt), and not by his people, the Children of Israel. In other words, [all of] those [people] denied their messengers, so take them [these messengers] as a good example [of constancy]. And I granted the disbelievers respite, I postponed [dealing with] them by deferring their requital, then I seized them, with chastisement, and how [terrible] was My abhorrence! (nakīr), that is to say, My rebuke (inkār) of them for their denial, by My destroying them (the interrogative is meant as an affirmative, in other words,: it [My chastisement] was well-placed).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((And) the dwellers in Midian) the people of Shu'ayb denied Shu'ayb. (And Moses was denied) the Copts denied him; (but I indulged the disbelievers a long while) but I gave a reprieve to the disbelievers in their state of disbelief until the appointed time, (then I seized them) with chastisement, (and how (terrible) was My abhorrence!) see, Muhammad, how I changed towards them through My punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَصْحَابُ مَدْيَنَ } أخاك شعيباً عليه السلام { وَ } لا سيما { كُذِّبَ مُوسَىٰ } يعني: كذّب بنو إسرائيل أخاك موسى الكليم عليه السلام مراراً متعددة\n مع أن آياته ومعجزاته من أظهر الآيات وأبهر المعجزات { فَأمْلَيْتُ } وأملهت { لِلْكَافِرِينَ } المكذبين المعاندين المستكبرين { ثُمَّ أَخَذْتُهُمْ } بأنواع العذاب والنكال إلى أن أهلكتُهم وأستأصلتُهم { فَكَيْفَ كَانَ نَكِيرِ } [الحج: 44] إياهم وإنكاري عليهم بعد إمهالي بأن النعمة عليهم نقمة\n والمنحةَ محنة\n واللذة ألماً\n والفرح ترحاً\n والقصور قبوراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأصحابُ مدينَ } شعيبًا\n { وكُذِّب موسى } كذَّبه فرعونُ والقبط\n ولم يقل: وقوم موسى لأن موسى ما كذبه قومه بنو إسرائيل\n وإنما كذبه القبطُ\n أو: كأنه لمَّا ذكر تكذيب كلُّ قوم رسولهم\n قال: وكُذِّب موسى\n مع وضوح آياته وظهور معجزاته\n فما ظنك بغيره؟ { فأمليتُ للكافرين }: أمهلتهم وأخرت عقوبتهم\n { ثم أخذتُهم }: عَاقَبْتُهم على كفرهم\n أي: أخذت كل فريق من فِرَقِ المكذبين\n بعد انقضاء مدة إملائه وإمهاله\n { فكيف كان نكير } أي: إنكاري وتغييري حيث أبدلتهم بالنعم نقمًا\n وبالحياة هلاكًا\n وبالعمارة خرابًا\n فكان ذلك في غاية ما يكون من الهول والفظاعة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:32",
      "similarity": 0.6546738362137907
    },
    {
      "verse": "3:178",
      "similarity": 0.5105915888215027
    },
    {
      "verse": "22:48",
      "similarity": 0.440174633663597
    },
    {
      "verse": "25:5",
      "similarity": 0.3778048854321176
    },
    {
      "verse": "35:26",
      "similarity": 0.36669030827249155
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022044.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022044.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:44.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}