{
  "chapter": "الحج",
  "text": "وكاين من قرية امليت لها وهى ظالمة ثم اخذتها والى المصير",
  "translations": [
    {
      "translation": "How many wrongdoing cities I allowed time to and then I seized them. I am their final destination!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To how many habitations did We give respite, though given to wickedness, and then seized them. To Me they had to come back in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many towns did I respite at first though they were steeped in iniquity, and then I seized them! To Me are all destined to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To how many unjust towns have We given respite and then sized with torment. To Me do all things return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to many a township did I give respite although they were oppressors; then I seized them; and towards Me is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a township did I give respite while it was given to wrongdoing. Then I seized it (with punishment). And to Me is the (final) return (of all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a town to which I gave respite while it was unjust, then I overtook it, and to Me is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a city I have respited in its evildoing; then I seized it, and to Me was the homecoming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a township did I suffer long though it was sinful! Then I grasped it. Unto Me is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To how many a town We gave respite while it was given to wrongdoing. Then I seized it. To Me all things shall return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a city did give reins to, While it wronged itself, then took hold of it! and unto Me is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To how many a town did I give respite while it was doing wrong! Then I seized it, and toward Me is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to how many populations did I give respite, which were given to wrong-doing? in the end I punished them. To me is the destination (of all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a township did I give respite while it was given to wrong-doing. Then (in the end) I seized it (with punishment). And to Me is the (final) return (of all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a village have I respited in its evil doing! Then I seized it. To Me is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town have I reprieved, although it was unjust? Then I seized it. To Me is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for how many a city did I prolong enjoyment while it was committing wrong. Then I seized it, and to Me is the [final] destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:48] To how many a town did I give respite while it was doing wrong; [but] then I seized it, meaning, [I seized] its inhabitants, and with Me lies the journey’s end, the [final] return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And how many a township) and how many a population of township (did I suffer long) I gave a reprieve from chastisement (though it was sinful!) though its population were idolaters and disbelievers. (Then I grasped it) I punished them in the life of this world. (Unto Me is the return) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَأَيِّن } معناه وكَمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَأَيِّن مِّن قَرْيَةٍ } أي: من أهلها { أَمْلَيْتُ } وأمهلت { لَهَا } وأخَّرت عنها عذابها { وَهِيَ ظَالِمَةٌ } أهلها مستحقة للعذاب أمثالكم { ثُمَّ أَخَذْتُهَا } بالعذاب الشديد بعدما كمل وازداد أهلها موجباته { وَ } لا مخلص لهم منه؛ إذ { إِلَيَّ ٱلْمَصِيرُ } [الحج: 48] أي: مرجع الكل إليّ ومنقبلهم عندي، ولا مقصد لهم غيري، وإن لم يعرفوا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "47:13",
      "similarity": 0.5900802012025561
    },
    {
      "verse": "12:105",
      "similarity": 0.5524600573171061
    },
    {
      "verse": "65:8",
      "similarity": 0.495137379694344
    },
    {
      "verse": "29:60",
      "similarity": 0.47800195278111124
    },
    {
      "verse": "13:32",
      "similarity": 0.4684729678547008
    }
  ]
}