{
  "chapter": "الحج",
  "text": "وليعلم الذين اوتوا۟ العلم انه الحق من ربك فيؤمنوا۟ به فتخبت له قلوبهم وان الله لهاد الذين ءامنوا۟ الى صرط مستقيم",
  "translations": [
    {
      "translation": "and so that those who have been given knowledge will know it is the truth from their Lord and have iman in it and their hearts will be humbled to Him. Allah guides those who have iman to a straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At the same time those who have been given knowledge may know that this is the truth from your Lord, and come to believe in it, and their hearts become submissive to Him. Verily God guides those who believe, to the even path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He also does this) in order that those endowed with knowledge may know that it is the Truth from your Lord and that they may have faith in it and their hearts may humble themselves before Him. Verily Allah always directs those that believe to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that those who have received knowledge would know and believe that whatever happens with the Prophets and Messengers is the Truth from their Lord and will believe it. This will cause their hearts to become filled with awe. God guides the believers to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so that the people given the knowledge may know that it is the truth from your Lord, in order that they may accept faith in it, therefore their hearts may humble before Him; and indeed Allah will guide the believers on the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been given knowledge may know that it (this Qur'an) is the truth from your Lord, so that they may believe therein, and their hearts may submit to it with humility. And verily, Allah is the Guide of those who believe, to the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been given the knowledge may know that it is the truth from your Lord, so they may believe in it and their hearts may be lowly before it; and most surely Allah is the Guide of those who believe into a right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that they who have been given knowledge may know that it is the truth from thy Lord and believe in it, and so their hearts be humble unto Him; and assuredly God ever guides those who believe to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been given knowledge may know that it is the truth from thy Lord, so that they may believe therein and their hearts may submit humbly unto Him. Lo! Allah verily is guiding those who believe unto a right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that those who are given knowledge may realize that this is the truth from your Lord and thus believe in it, and so that in their hearts they may humbly submit to Him. God will surely guide the faithful to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been vouchsafed knowledge may know that it is the truth from thy Lord and may believe therein, and so their hearts may submit thereto. And verily Allah is the Guide of those who believe unto a path straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And also for the reason] that those who have been given knowledge may know that it is the truth from your Lord, and so they may have faith in it, and their hearts may be humbled before Him. Indeed Allah guides those who have faith to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those on whom knowledge has been bestowed may learn that the (Qur'an) is the Truth from thy Lord, and that they may believe therein, and their hearts may be made humbly (open) to it: for verily Allah is the Guide of those who believe, to the Straight Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been given knowledge may know that it (this Quran) is the truth from your Lord, and that they may believe therein, and their hearts may submit to it with humility. And verily, Allah is the Guide of those who believe, to the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and so that those to whom knowledge has been given will know that this is the truth from your Lord and so believe in it and that their hearts will be humble to Him. Indeed, Allah will surely guide those who believe to a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so that those endowed with knowledge may know that it is the truth from your Lord, and so believe in it, and their hearts soften to it. God guides those who believe to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so those who were given knowledge may know that it is the truth from your Lord and [therefore] believe in it, and their hearts humbly submit to it. And indeed is Allah the Guide of those who have believed to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:54] And that those who have been given knowledge, [of] God’s Oneness and the Qur’ān, may know that it, the Qur’ān, is the truth from your Lord, so that they may believe therein, and their hearts may find reassurance in it. And assuredly God guides those who believe to a straight path, [a straight] route, namely, the religion of Islam.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And that those who have been given knowledge) those who were given knowledge of the Qur'an and the Torah, i.e. 'Abdullah Ibn Salam and his followers (may know) Allah's clarifications (that it is the Truth from thy Lord, so that they may believe therein) so that they believe the clarification of Allah (and their hearts may submit humbly unto Him) so that their hearts be sincere and accept the clarification of Allah. (Lo! Allah verily is guiding) Allah protects (those who believe) in Muhammad (pbuh) and in the Qur'an (unto a right path) to an established religion with which Allah is pleased: i.e. Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وليعلم الذين أوتوا العلم } من أهل اليقين والمحققين: أن تمكّن الشيطان من الإلقاء هو الحكمة والحق من ربّك على قضية العدل والمناسبة { فيؤمنوا به } بأن يروا الكل من الله فتطمئن { له قلوبهم } بنور السكينة والاستقامة الموجبة لتمييز الإلقاء الشيطاني من الرحماني { وإن الله } لهاديهم إلى طريق الحق والاستقامة فلا تزلّ أقدامهم بقبول ما يلقي الشيطان، ولا تقبل قلوبهم إلا ما يلقي الرحمن لصفائها وشدّة نوريتها وضيائها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلِيَعْلَمَ ٱلَّذِينَ أُوتُواْ ٱلْعِلْمَ } اللدني من دون الله ووُفِّقوا من عنده لقبول أحكامه { أَنَّهُ } أي: القرآن وآياته المشتملة على الأومر والنواهي\n والأحكام والمعارف والحقائق\n أو إقداره سبحانه على الشيطان بإلقائه المذكور افتناناً منه سبحانه و ابتلاء { ٱلْحَقُّ } الثابت المحقق النازل { مِن رَّبِّكَ } يا أكمل الرسل { فَيُؤْمِنُواْ بِهِ } أي: بالله بإنزاله القرآن أو بإقداره على الشيطان أن يلقي على لسان أنبيائه اختباراً لعباده { فَتُخْبِتَ } وتطمئن { لَهُ قُلُوبُهُمْ } ويزداد وثقوهم\n وصاروا على خطر عظيم واحتياط بليغ { وَإِنَّ ٱللَّهَ } المطلع لضمائر عباده { لَهَادِ ٱلَّذِينَ آمَنُوۤاْ } وأخلصوا بلا شوب شكٍ وترددٍ { إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } [الحج: 54] موصل إلى توحيده بلا عوج وانحراف\n\n\n{ وَلاَ يَزَالُ ٱلَّذِينَ كَفَرُواْ } بالله وانصرفوا عن مقتضيات آياته الكبرى لمرض صدروهم وعمى قلوبهم { فِي مِرْيَةٍ } أي: شك وارتياب { مِّنْهُ } أي: من القرآن",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وليعلم الذين أُوتوا العلم } بالله { أنه } أي: القرآن { الحقُّ من ربك } أي: النازل من عنده { فيُؤمنوا به } أي: بالقرآن { فتُخْبتَ }: تطمئن، أو تخشع { له قلوبُهم } بالانقياد إليه والإذعان لما فيه، { وإِنَّ الله لهادي الذين آمنوا إِلى صراط مستقيم } بالنظر الموصل إلى الحق الصريح، فيتأولوا ما تشابه في الدين بالتأويلات الصحيحة، ويطلبوا، لما أشكل منه، المحمل الذي تقتضيه الأصول المحكمة، حتى لا يلحقهم حيرة ولا تعتريهم شبهة\n والله تعالى أعلم\n الإشارة: إذا وقع التعبير من جانب الحق فكل واحد من المستمعين يسمع ما يليق بمقامه ويقويه فيه\n فأهل الباطل يسمعون ما يليق بباطلهم ويمدهم فيه، وأهل الحق يسمعون ما يليق بحقهم ويرقيهم، فأهل الإيمان يسمعون ما يقوي إيمانهم ويزيدهم يقينًا، وأهل الوصول يسمعون ما يليق بمقامهم ويرقيهم فيه، وهكذا\n\n\nوتأمل قضية الثلاثة الذين سمعوا قائلاً يقول: يا سعترا بري\n فسمع أحدهم: اسْعَ تَر بري، وسمع الآخر: الساعة ترى بري… وسمع الثالث: ما أوسع بري، فالأول: طالب للوصول، فقال له: اسع ترى بري، والثاني: سائر مستشرف على الوصول، فقال له: الساعة ترى بري، والثالث: واصل قد اتسع عليه ميدان النعم، فقال له: ما أوسع بري\n وكل من قَدِمَ على الأولياء فإنما يسمع حسب ما عنده فمن قَدِمَ عليهم بالميزان لا يسمع إلا ما يُبعده، ومن قَدِمَ بالتصديق والتعظيم لا يسمع ولا يرى إلا ما يُقربه من الكمالات والأنوار\n والله تعالى أعلم\n ثمَّ ذكر ضد الذين أوتوا العلم الذين تحققوا بحقية القرآن\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:23",
      "similarity": 0.8902616376095299
    },
    {
      "verse": "22:34",
      "similarity": 0.5199002270127462
    },
    {
      "verse": "34:6",
      "similarity": 0.16587633558231718
    },
    {
      "verse": "24:46",
      "similarity": 0.14350006432727844
    },
    {
      "verse": "2:213",
      "similarity": 0.1433877730851378
    }
  ]
}