{
  "chapter": "الحج",
  "text": "والذين سعوا۟ فى ءايتنا معجزين او۟لئك اصحب الجحيم",
  "translations": [
    {
      "translation": "But as for those who strive against My Signs and try to thwart them, they will be the Companions of the Blazing Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who try to defeat Our signs are people of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whereas those who strive against Our Signs, seeking to profane them, they are the friends of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who try to challenge Our miracles will be the dwellers of hell.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who strive in Our signs with the intention of disputing, are the people of fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who strive against Our Ayat to frustrate them, they will be dwellers of the Hellfire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who strive to oppose Our communications, they shall be the inmates of the flaming fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who strive against Our signs to void them -- they shall be the inhabitants of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While those who strive to thwart Our revelations, such are rightful owners of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereas those who strive against Our signs, seeking to defeat their purpose, shall be the inmates of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who endeavour in respect of Our signs to frustrate them- those shall be the fellows of Flaming Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who contend with Our signs, seeking to frustrate [their purpose], they shall be the inmates of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who strive against Our Signs, to frustrate them,- they will be Companions of the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who strive against Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), to frustrate and obstruct them, they will be dwellers of the Hell-fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but those who strive to void Our verses, thinking they have escaped, shall be the people of Hell'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who strive against Our revelations—these are the inmates of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the ones who strove against Our verses, [seeking] to cause failure - those are the companions of Hellfire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:51] But those who strive against Our signs, namely, the Qur’ān, in order to invalidate them, seeking to incapacitate (mu‘ajjizīna) those who follow the Prophet ([this meaning of mu‘ajjizīna] being derived from their assumption that these [followers] are incapable individuals) and impeding them from [practising their] faith; or [mu‘ajjizīna means] supposing Us to be incapable against them (a variant reading [of mu‘ajjizīna] has mu‘ājizīna, meaning, ‘contending with Us’) that is to say, they suppose that they will [be able to] elude Us by denying resurrection and requital — those, they shall be the inhabitants of hell-fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(While those who strive to thwart Our revelations) while those who disbelieved in Muhammad (pbuh) and in the Qur'an, (such are rightful owners of the Fire) these are not going to escape from Our chastisement, for they are the inhabitants of hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ سَعَوْاْ } وبذلوا وسعهم وجهدهم { فِيۤ } إبطال { آيَاتِنَا } وردِّها وتكذبها، ومع ذلك صاروا { مُعَاجِزِينَ } مسابقين ومبادرين إلى رد الممتثلين المصدقين بها وإنكارهم { أُوْلَـٰئِكَ } الأشقياء والمردودون هم { أَصْحَابُ ٱلْجَحِيمِ } [الحج: 51] وملازموها لا نجاة له منها أصلاً\n\n\n\n\nثم لما رأى رسول الله صلى الله عليه وسلم إصرار قومه على الكفر وشدة عنادهم وشيكمتهم عليه وعلى دينه، تمنى أن يأتيه الله ما يقاربهم ويحببهم معه، ويزل غيظه عن قلوبهم ويلينها، فأنزل الله سبحانه سورة:\n\n[النجم: 1] فقرأها فرحاً وسروراً كي يسمعوا، ويميلوا إلى طريق الحق، فلما وصل إلى قوله تعالى:\n\n[النجم: 10-20] توجهت قريش نحوه، والتفتوا إليه على وجهٍ يشعرهم التلقي والقبول، فيلهي تلقيهم الرسول صلى الله عليه وسلم فغفل عن قلبه وشغل، ألقى الشيطان على لسانه في أثناء كلامه على مقتضى مناه ومتمناه، وأسمعهم الآية هكذا: تلك الغرانيق العلى منهم شفاعة ترتجى، ففرحت بذلك قريش، وفلم يعلم النبي صلى الله عليه وسلم ما صدر عنه لاستغراقه في أمنيته، فوجودهم مائلين نحوه، محسنين له، وازداد تحسينهم ومحبتهم له إلى أن سجدوا في آخر السورة المؤمنون والمشركون جميعاً، فسَرَّ هذا رسول الله صلى الله عليه وسلم وسرَّت قريش معه، ومن كلامه صلى الله عليه وسلم حيث قالوا: إن محمداً قد ذكر شفعاءنا بالخير\n\n\n\n\nفجاء جبريل عليه السلام فأخبر بما صدر عنه من تخليط الوحي بغير الوحي، فاغتم رسول الله صلى الله عليه وسلم أشد اغتمام، وخاف خوفاً شديداً من غِيرة الله وقهره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:38",
      "similarity": 0.6347733207418264
    },
    {
      "verse": "5:10",
      "similarity": 0.5644160358857211
    },
    {
      "verse": "5:86",
      "similarity": 0.5644160358857211
    },
    {
      "verse": "34:5",
      "similarity": 0.47361086673498926
    },
    {
      "verse": "2:119",
      "similarity": 0.46384983446085337
    }
  ]
}