{
  "chapter": "الحج",
  "text": "وما ارسلنا من قبلك من رسول ولا نبى الا اذا تمنى القى الشيطن فى امنيته فينسخ الله ما يلقى الشيطن ثم يحكم الله ءايته والله عليم حكيم",
  "translations": [
    {
      "translation": "We did not send any Messenger or any Prophet before you without Shaytan insinuating something into his recitation while he was reciting. But Allah revokes whatever Shaytan insinuates and then Allah confirms His Signs - Allah is All-Knowing, All-Wise -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent no messenger or apostle before you with whose recitations Satan did not tamper. Yet God abrogates what Satan interpolates; then He confirms His revelations, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did We send a Messenger or a Prophet before you (O Muhammad), but that whenever he had a desire, Satan interfered with that desire. Allah eradicates the interference of Satan and strengthens His Signs. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan would try to tamper with the desires of every Prophet or Messenger whom We sent. Then God would remove Satan's temptations and strengthen His revelations. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all the Noble Messengers or Prophets whom We sent before you – it occurred with all of them – that whenever they recited (the message) Satan included a bit (from his own speech) in their recitation to the people; so Allah obliterates what Satan includes and then Allah fortifies His verses; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did We send a Messenger or a Prophet before you but when he did recite (the revelation or narrated or spoke), Shaytan threw (some falsehood) in his recitation (of the revelation). But Yansakh Allah that which Shaytan throws in. Then Allah establishes His revelations. And Allah is All-Knower, All-Wise:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send before you any apostle or prophet, but when he desired, the Shaitan made a suggestion respecting his desire; but Allah annuls that which the Shaitan casts, then does Allah establish His communications, and Allah is Knowing, Wise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent not ever any Messenger or Prophet before thee, but that Satan cast into his fancy, when he was fancying; but God annuls what Satan casts, then God confirms His signs -- surely God is All-knowing, All-wise --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never sent We a messenger or a prophet before thee but when He recited (the message) Satan proposed (opposition) in respect of that which he recited thereof. But Allah abolisheth that which Satan proposeth. Then Allah establisheth His revelations. Allah is Knower, Wise;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever We sent any messenger or prophet before you, and he recited anything [of Our revelation], Satan tampered with it. But God abrogates Satan's interjections and then He firmly reaffirms His revelations. God is all knowing and all wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have sent before thee no apostle or prophet but when he read the Satan cast forth suggestions in respect of his reading; then Allah abolisheth that which the Satan casteth forth; then Allah confirmeth His revelations; and Allah is Knowing. Wise;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send any apostle or prophet before you but that when he recited [the scripture] Satan interjected [something] in his recitation. Thereat Allah nullifies whatever Satan has interjected, and then Allah confirms His signs, and Allah is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did We send a messenger or a prophet before thee, but, when he framed a desire, Satan threw some (vanity) into his desire: but Allah will cancel anything (vain) that Satan throws in, and Allah will confirm (and establish) His Signs: for Allah is full of Knowledge and Wisdom:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did We send a Messenger or a Prophet before you, but; when he did recite the revelation or narrated or spoke, Shaitan (Satan) threw (some falsehood) in it. But Allah abolishes that which Shaitan (Satan) throws in. Then Allah establishes His Revelations. And Allah is All-Knower, All-Wise:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never have We sent a Messenger or a Prophet before you, but when he hoped, satan tampered with his hope. But Allah supersedes the tampering of satan and confirms His verses. And Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never sent a messenger before you, or a prophet, but when he had a desire Satan interfered in his wishes. But God nullifies what Satan interjects, and God affirms His revelations. God is Omniscient and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send before you any messenger or prophet except that when he spoke [or recited], Satan threw into it [some misunderstanding]. But Allah abolishes that which Satan throws in; then Allah makes precise His verses. And Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:52] And We did not send before you any messenger (rasūl) — this is a prophet who has been commanded to deliver a Message — or prophet (nabī) — one who has not been commanded to deliver anything — but that when he recited [the scripture] Satan cast into his recitation, what is not from the Qur’ān, but which those to whom he [the prophet] had been sent would find pleasing. The Prophet (s) had, during an assembly of the [men of] Quraysh, after reciting the [following verses from] sūrat al-Najm, Have you considered Lāt and ‘Uzzā? And Manāt, the third one? [53:19-20] added, as a result of Satan casting them onto his tongue without his [the Prophet’s] being aware of it, [the following words]: ‘those are the high-flying cranes (algharānīq al-‘ulā) and indeed their intercession is to be hoped for’, and so they [the men of Quraysh] were thereby delighted. Gabriel, however, later informed him [the Prophet] of this that Satan had cast onto his tongue and he was grieved by it; but was [subsequently] comforted with this following verse that he might be reassured [of God’s pleasure]: thereat God abrogates, nullifies, whatever Satan had cast, then God confirms His revelations. And God is Knower, of Satan’s casting of that which has been mentioned, Wise, in His enabling him [Satan] to do such things, for He does whatever He will.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ وَلَا نَبِيٍّ إِلَّا إِذَا تَمَنَّى أَلْقَى الشَّيْطَانُ فِي أُمْنِيَّتِهِ فَيَنْسَخُ اللَّهُ مَا يُلْقِي الشَّيْطَانُ ثُمَّ يُحْكِمُ اللَّهُ آَيَاتِهِ وَاللَّهُ عَلِيمٌ حَكِيمٌ (52) عطف على جملة { قل ياأيها الناس إنما أنا لكم نذير مبين } \\[ الحج : 49 \\] لأنه لما أفضى الكلام السابق إلى تثبيت النبي عليه الصلاة والسلام وتأنيس نفسه فيما يلقاه من قومه من التكذيب بأن تلك شنشنة الأمم الظالمة من قبلهم فيما جاء عقبَ قوله : { وكأين من قرية أمليت لها وهي ظالمة } \\[ الحج : 48 \\] الخ . . وأنه مقصور على النّذارة فمن آمن فقد نجا ومن كفر فقد هلك ، أريد الانتقال من ذلك إلى تفصيل تسليته وتثبيته بأنه لقي ما لقيه سلفُه من الرسل والأنبياء عليهم السلام ، وأنه لم يسلم أحد منهم من محاولة الشيطان أن يفسد بعض ما يحاولونه من هدي الأمم وأنهم لقُوا من أقوامهم مكذّبين ومصدّقين سنةَ الله في رُسله عليهم السلام .فقوله : { من رسول ولا نبيء } نص في العموم ، فأفاد أنّ ذلك لم يعدُ أحداً من الأنبياء والرسل .وعطف { نبي } على { رسول } دالّ على أنّ للنبي مَعنى غيرُ معنى الرسول :فالرسول : هو الرجل المبعوث من الله إلى الناس بشريعة . والنبي : مَن أوحَى الله إليه بإصلاح أمر قوم بحملهم على شريعة سابقةٍ أو بإرشادهم إلى ما هو مستقر في الشّرائع كلها فالنبي أعمّ من الرسول ، وهو التحقيق .والتمنّي : كلمة مشهورة ، وحقيقتها : طلب الشيء العسير حصولُه . والأمنية : الشيء المتمنّى . وإنما يتمنى الرسل والأنبياء أن يكون قومهم كلُّهم صالحين مهتدين ، والاستثناءُ من عموممِ أحوال تابعة لعموم أصحابها وهو { من رسول ولا نبيء } ، أي ما أرسلناهم في حال من الأحوال إلاّ في حاللِ إذا تمنّى أحدُهم أمنية ألقى الشيطان فيها الخ ، أي في حال حصول الإلقاء عند حصول التمني لأنّ أماني الأنبياء خيرٌ محض والشيطان دأبُه الإفساد وتعطيل الخير .والقصر المستفاد من النفي والاستثناء قصر موصوف على صفة ، وهو قصر إضافي ، أي دون أن نرسل أحداً منهم في حال الخلو من إلقاء الشيطان ومكره .والإلقاء حقيقته : رمي الشيء من اليد . واستعير هنا للوسوسة وتسويل الفساد تشبيهاً للتسويل بإلقاء شيء من اليد بين الناس . ومنه قوله تعالى : { فكذلك ألقى السامري } \\[ طه : 87 \\] وقوله : { فألقوا إليهم القول } \\[ النحل : 86 \\] وكقوله تعالى : { فقبضت قبضة من أثر الرسول فنبذتها } \\[ طه : 96 \\] على ما حققناه فيما مضى .\n\n",
      "translations": [
        {
          "translation": "(Never sent We a messenger or a Prophet before thee) Muhammad (but when he) the Prophet (recited (the message)) or spoke (Satan proposed (opposition) about that which he recited thereof) such that he does not act upon it. (But Allah abolisheth) but Allah elucidates (that which Satan proposeth) on the tongue of His Prophet such that he does not act upon it. (Then Allah establisheth) then He clarifies (His revelations) for His Prophet in order that he acts upon them. (Allah is Knower) of that which Satan proposes, (Wise) He decrees to abolish it;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذَا تَمَنَّىٰ } معنا إِذَا قَرَأَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"When you {desire}\", when he {reads}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويفصلها إحكاماً تاماً وإتقاناً محكماً { وَٱللَّهُ } المدبر لأحوال عباده واستعداداتهم { عَلِيمٌ } بما أنزل عليهم بما يناسب استعدادهم { حَكِيمٌ } [الحج: 52] في إنزلاه وتدبير مصالحهم\n\n\nفإن توهم أن الله قادرُ على محافظة أنبيائه ورسله\n سيما نبينا صلى الله عليه وسلم من إلقاء الشيطان وتغريره وتخليطه إياهم أول مرة\n فلِمَ لَمْ يحفظهم من إلقائه حتى لا يصدر عنهم ما صدر ثمَّ نُسخ؟ قِيل: إنما لم يحفظهم سبحانه أول مرة { لِّيَجْعَلَ } سبحانه { مَا يُلْقِي ٱلشَّيْطَانُ } في أثناء الوحي { فِتْنَةً } وابتلاء { لِّلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ } ميلُ عن الحق وانحرام عن طريقه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقال ابن عباس وغيره من المفسرين الأولين - رضي الله عنهم -: لما رأى النبي صلى الله عليه وسلم مباعدة قومه وتوليهم\n وشق عليه ذلك تمنى أن يأتيه من الله تعالى ما يُقارب بينه وبين قومه\n فجلس يومًا في جمع لهم\n فنزلت سورة النجم\n فقرأها عليهم\n فلما بلغ:\n[النّجْم: 19\n 20]\n ألقى الشيطان على لسانه: تلك الغرانيق العُلى وإنَّ شفاعتهم لترجى\n هـ\n قلت: بلى\n ألقى ذلك في مسامعهم فقط\n ولم ينطق بذلك - عليه الصلاة والسلام - فلما سمعت ذلك قريش فرحوا\n ثم سجد النبي صلى الله عليه وسلم في آخر السورة\n وسجد المسلمون والمشركون\n إلا الوليد بن المغيرة\n رفع حفنة من التراب وسجد عليه\n فقالت قريش: ذكر محمد آلهتنا بأحسن الذكر\n وقالوا: قد عرفنا أن الله يُحيي ويميت\n ويخلق ويرزق\n ولكن آلهتنا هذه تشفع لنا عنده\n فإذا جعل محمد لها نصيبًا فنحن معه\n فلما أمسى أتاه جبريل\n فقال يا محمد ما صنعتَ فقد تلوتَ على الناس ما لم آتك به؟ فحزن النبي صلى الله عليه وسلم حزنًا شديدًا\n فنزلت الآية تسلية له عليه الصلاة والسلام\n يقول الحقّ جلّ جلاله: { وما أرسلنا من قبلك من رسول } \n يُوحى إليه بشرع\n ويُؤمر بالتبليغِ\n { ولا نبيٍّ } يُوحى إليه\n ولم يُؤمر بالتبليغ\n فالرسول مكلف بغيره\n والنبي مقتصر على نفسه\n أو الرسول: مَن بُعث بشرع جديد\n والنبي: مَنْ قرر شريعة سابقة\n ولذلك شبه صلى الله عليه وسلم علماء أمته بهم\n فالنبي أعم من الرسول\n وقد سئل - عليه الصلاة والسلام - عن الأنبِيَاءِ\n فقال:\n \" مِائَةُ أَلْفٍ وأرْبَعَةٌ وعِشْرُونَ ألْفًا\n قِيل: فَكمِ الرُّسُلُ مِنْهُمْ؟ قال: ثَلاثُمِائةٍ وثلاثَةَ عَشَرَ\n جَمًّا غَفِيرًا \" \n{ إِلاَّ إِذا تَمَنَّى } هيأ في نفسه ما يهواه كهداية قومه ومقاربتهم له\n { ألقى الشيطانُ في أُمنيته } في تشهيه ما يُوجب حصول ما تمناه\n أو مقاربته\n كما ألقى في مسامع قريش ما يُوجب مقاربتهم له - عليه الصلاة والسلام - ثم ينسخ الله ذلك\n أو { إذا تمنى }: قرأ\n كما قال الشاعر:\n{ ألقى الشيطان في أُمنيته }: في قراءته\n حين قرأ سورة النجم بعد قوله: { ومناة الثالثة الأخرى } \n تلك الغرانيق العُلى\n كما تقدم\n قال القشيري: كانت لنبينا صلى الله عليه وسلم سكتات\n في خلال قراءته عند قراءة القرآن\n عند انقضاء كل آية\n فتلفظ الشيطان ببعض الألفاظ\n فمن لم يكن له تحصيل توهم أنه من ألفاظ الرسول\n هـ\n وقال ابن البنا: التمني هو التلاوة التي يُتمنى فيها\n فيتلو النبي وهو يريد أن يفهم عنه معناها\n فيلقي الشيطان في فهوم السامعين غير المعنى المراد\n وما قال الزمخشري: قرأ تلك الغرانيق العلى\n على جهة السهو والغلط\n فباطل\n لقول الله العظيم:\n\n[النّجْم: 3\n 4]\n فهو معصوم من السهو والغلط في تبليغ الوحي\n هـ\n قلت: فتحصل أنه - عليه الصلاة والسلام - لم ينطق بتلك الكلمات قط\n لا سهوًا ولا عمدًا\n وإنما أُلقيت في مسامع الكفار ليحصل ما تمناه - عليه الصلاة والسلام - من المقاربة\n ويدل على هذا أن من حضر من المسلمين لم يسمعوا من ذلك شيئًا\n فإذا تقرر هذا علمت أن ما حكاه السلف الصالح من المفسرين وأهل السير من أصل القصة في سبب نزول الآية صحيح\n لكنه يحتاج إلى نظر دقيق وتأويل قريب\n فلا تَحْسُن المبادرة بالإنكار والرد عليهم\n وهم عدول\n لا سيما حبر هذه الأمة\n وإنما يحتاج اللبيب إلى التطبيق بين المنقول والمعقول\n فإن لم يمكن\n قدَّم المنقول\n إن ثبتت صحته\n وحكم على العقل بالعجز\n هذا مذهب المحققين من الصوفية - رضي الله عنهم - ونسبة الإلقاء إلى الشيطان أدب وتشريع إذ لا فاعل في الحقيقة سواه تعالى\n  { فينسخ اللهُ ما يُلقي الشيطانُ } أي: يَذهب به ويُبطله\n أو يُرشد إلى ما يزيحه\n { ثم يُحْكِمُ اللهُ آياته } أي: يُثبتها ويحفظها عن لحوق الزيادة من الشيطان\n { والله عليمٌ حكيم } أي: عليم بما يوحى إلى نبيه\n حكيم في وحيه\n لا يدع الباطل يأتيه من بين يديه ولا من خلفه\n ثم ذكر حكمة ذلك الإلقاء\n فقال: { ليجعل ما يُلقي الشيطانُ فتنةً } أي: محنة وابتلاء { للذين في قلوبهم مرضٌ }: شك وشرك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:106",
      "similarity": 0.7522738658116876
    },
    {
      "verse": "45:29",
      "similarity": 0.7031125391339555
    },
    {
      "verse": "3:143",
      "similarity": 0.29231640553966065
    },
    {
      "verse": "4:120",
      "similarity": 0.2847164870149553
    },
    {
      "verse": "7:154",
      "similarity": 0.25979849481897177
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022052.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022052.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}