{
  "chapter": "الحج",
  "text": "والذين هاجروا۟ فى سبيل الله ثم قتلوا۟ او ماتوا۟ ليرزقنهم الله رزقا حسنا وان الله لهو خير الرزقين",
  "translations": [
    {
      "translation": "Those who make hiira in the Way of Allah and then are killed or die. Allah will provide for them handsomely. Truly Allah is the best Provider.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who left their homes in the way of God, and then were killed or died, will surely be given a better provision by God, for God is surely the best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who migrated in the way of Allah, whereafter they were slain, or died, Allah will certainly grant them a goodly provision. Indeed, Allah is the Best of all those who provide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who abandoned their homes for the cause of God and who then died or were murdered will receive honorable sustenance from God; He is the Most Generous and Munificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who left their homes and belongings in Allah's cause and were then killed or died – Allah will therefore indeed provide for them an excellent sustenance; and indeed the sustenance bestowed by Allah is the best.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who emigrated in the cause of Allah and after that were killed or died, surely, Allah will provide a good provision for them. And verily, it is Allah Who indeed is the Best of those who make provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who fly in Allah's way and are then slain or die, Allah will most certainly grant them a goodly sustenance, and most surely Allah is the best Giver of sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who emigrated in God's way and were slain, or died, God shall provide them with a fair provision; and surely God is the best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who fled their homes for the cause of Allah and then were slain or died, Allah verily will provide for them a good provision. Lo! Allah, He verily is Best of all who make provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who left their homes for the cause of God and then were slain or died, God will give them a generous provision. Surely God is the Best of Providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who emigrated in the way of Allah, and thereafter they were slain or they died - surely Allah will provide them with a goodly provision; and verily Allah! He is the Best Provider.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who migrate in the way of Allah and then are slain, or die, Allah will surely provide them with a good provision. Allah is indeed the best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who leave their homes in the cause of Allah, and are then slain or die,- On them will Allah bestow verily a goodly Provision: Truly Allah is He Who bestows the best provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who emigrated in the Cause of Allah and after that were killed or died, surely, Allah will provide a good provision for them. And verily, it is Allah Who indeed is the Best of those who make provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who emigrated in the way of Allah and were slain, or died, Allah will provide them with fine provisions. Allah is the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who emigrate in God’s cause, then get killed, or die, God will provide them with fine provisions. God is the Best of Providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who emigrated for the cause of Allah and then were killed or died - Allah will surely provide for them a good provision. And indeed, it is Allah who is the best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:58] And those who emigrated in the way of God, that is, in obedience to Him, from [emigrating from] Mecca to Medina, and then were slain, or died, God shall provide them with a good provision, namely, the provision of Paradise. Truly God is the best of providers, the most excellent of givers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who fled their homes for the cause of Allah) from Mecca to Medina for the sake of obeying Allah, (and then were slain) in the way of Allah by the enemies (or died) while travelling or in settlement, (Allah verily will provide for them a good provision) a good reward in Paradise for those who die among them; and those who remain alive will have spoils of war and wholesome, lawful things. (Lo! Allah, He verily is Best of all who make provision) the Best of all who give sustenance in this worldly life and in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَٱلَّذِينَ هَاجَرُواْ } وتركموا مضيق الإمكان ساكنين { فِي سَبِيلِ ٱللَّهِ } طالبين فضاءً به الوجوب والفناء فيه { ثُمَّ قُتِلُوۤاْ } على يد الغفلة الجهلة عن توحيد الله واستقلاله في الوجود { أَوْ مَاتُواْ } بالموت الاضطراري حتف أنوفهم بعدما خرجوا عن مقتضيات الحياة الصورية بالموت الإرادي { لَيَرْزُقَنَّهُمُ ٱللَّهُ } المنعم المفضل { رِزْقاً حَسَناً } حقيقاً من لدنه تفضيلاً عليهم وامتناناً\n وكيف لا يرزقهم مع أهم أولياؤه وهو رازق لأعدائه أيضاً؟ { وَإِنَّ ٱللَّهَ } المتجلي في الآفاق\n المتكفل لأرزاق من عليها وما عليها { لَهُوَ خَيْرُ ٱلرَّازِقِينَ } [الحج: 58] ممن نسب إليهم مجازاً\n إذ مرجع الكل إليه\n ومبدؤه منه وتوفيقهم بيده\n وهم تحت ظله\n وفعلهم حقيقةً منسوب إليه\n\n\nوبعدما رزقهم الله بالرزق المعنوي بدل ما جاهدوا في سبيله من تحمل المشاق والمتاعب في الانقطاع عن مألوفات بقعة الإمكان ومطبوعات نفوسهم وهوياتهم من اللذات والشهوات البهيمية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم قتلوا } في الجهاد\n { أو ماتوا } حتف أنفهم\n { لَيَرزقنَّهم الله رزقًا حسنًا } \n وهو ما لا ينقطع من نعيم الجنان\n ومراتب الحسن متفاوتة\n فيجوز تفاوت حال المرزوقين\n حسب تفاوت أرزاق الجنة\n رُوي أن بعض أصحاب النبي صلى الله عليه وسلم قالوا: يا نَبِي الله هؤُلاَءِ الذين قُتِلُوا في سَبِيل اللهِ قَدْ عَلِمْنَا مَا أعْطَاهُمُ الله مِن الخَيْرِ\n ونَحْنُ نُجَاهِدُ مَعَكَ كَما جَاهَدُوا\n فَمَا لَنَا مَعَكَ؟ فنزلت: { والذين هاجروا… } الآيتين\n وقيل: نزلت في طوائف\n خرجوا من مكة إلى المدينة\n فتبعهم المشركون فقتلوهم\n ثم قال تعالى: { وإِن الله لهو خير الرازقين } \n فإنه يرزق بغير حساب\n مع أنَّ ما يرزقه لا يقدر عليه غيره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:30",
      "similarity": 0.4691850317148875
    },
    {
      "verse": "3:157",
      "similarity": 0.4634249904819383
    },
    {
      "verse": "3:169",
      "similarity": 0.4610818562898424
    },
    {
      "verse": "8:74",
      "similarity": 0.44812907303338867
    },
    {
      "verse": "2:218",
      "similarity": 0.4239839765440855
    }
  ]
}