{
  "chapter": "الحج",
  "text": "ولا يزال الذين كفروا۟ فى مرية منه حتى تاتيهم الساعة بغتة او ياتيهم عذاب يوم عقيم",
  "translations": [
    {
      "translation": "But those who are kafir will not cease to be in doubt of it until the Hour comes on them suddenly or the punishment of a desolate Day arrives.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The infidels will remain in doubt about it till the Hour overtakes them unawares, or the punishment of the barren day destructive should come upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers will not cease to be in doubt about it until the Hour suddenly comes upon them, or the chastisement of an ominous day overtakes them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers will continue to doubt the Quran until the Hour of Doom suddenly sizes them or the torment of the last day strikes them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers will always be in doubt of it, to the extent that the Last Day will suddenly come upon them, or will come upon them the punishment of a day the result of which is not at all good for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved, will not cease to be in doubt about it until the Hour comes suddenly upon them, or there comes to them the torment of Yawm `Aqim.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve shall not cease to be in doubt concerning it until the hour overtakes them suddenly, or there comes on them the chastisement of a destructive day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the unbelievers will not cease to be in doubt of it, until the Hour comes on them suddenly, or there shall come upon them the chastisement of a barren day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve will not cease to be in doubt thereof until the Hour come upon them unawares, or there come unto them the doom of a disastrous day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth will continue in doubt until the [Last] Hour suddenly comes upon them or the scourge of the woeful Day descends upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve will not cease to be in doubt thereof until the Hour cometh upon them on a sudden, or there cometh upon them the torment of a Barren Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are faithless persist in their doubt about it, until either the Hour overtakes them suddenly, or they are overtaken by the punishment of an inauspicious day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Faith will not cease to be in doubt concerning (Revelation) until the Hour (of Judgment) comes suddenly upon them, or there comes to them the Penalty of a Day of Disaster.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve will not cease to be in doubt about it (this Quran) until the Hour comes suddenly upon them, or there comes to them the torment of the Day after which there will be no night (i.e. the Day of Resurrection).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers will never cease to doubt it until the Hour overtakes them suddenly or the punishment of the Barren Day comes upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve will continue to be hesitant about it, until the Hour comes upon them suddenly, or there comes to them the torment of a desolate Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve will not cease to be in doubt of it until the Hour comes upon them unexpectedly or there comes to them the punishment of a barren Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:55] And those who disbelieve will not cease to be in doubt of it, that is, the Qur’ān — because of what Satan had cast onto the tongue of the Prophet (s) and what had thereafter been nullified — until the Hour comes upon them unawares, that is, the Hour of their death or [of] resurrection, [comes upon them] suddenly, or there come upon them the chastisement of a day of desolation (‘aqīm), namely, the day of Badr, which held nothing of good for disbelievers, much like a sterile wind (rīh ‘aqīm) that bears no good; or it means, the Day of Resurrection, [referred to as ‘desolate’] because thereafter there will be no more night.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who disbelieve) in Muhammad (pbuh) and in the Qur'an, i.e. al-Walid Ibn al-Mughirah and his host (will not cease to be in doubt thereof) in doubt of the Qur'an, but wait, Muhammad, (until the Hour) the Last Hour (come upon them unawares) all of a sudden, (or there come unto them the doom of a disastrous day) in which there is no comfort, this is the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أو من ابتلاء الله إياهم بإلقاء الشيطان { حَتَّىٰ تَأْتِيَهُمُ ٱلسَّاعَةُ } أي: أشراطها وأماراتها { بَغْتَةً } فجأة\n وهم في ريبهم يترددون { أَوْ يَأْتِيَهُمْ عَذَابُ يَوْمٍ عَقِيمٍ } [الحج: 55] هو عذاب يوم القيامة\n وصفه بالعقم\n لأنه لا يقبل فيه توبة\n ولا إيمان\n ولا شفاعة\n كأنه عقيم لا بلد لهم خيراً\n ولا يثمر فيها عملهم ثواباً\n ولتوبتهم قبولاً\n وكيف يقبل فيه منهم التوبة الاستغفار وينفعهم الإيمان؟",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولا يزال الذين كفروا في مريةٍ }: شك { منه } من القرآن\n أو الصراط المستقيم\n { حتى تأتيهم الساعةُ بغتةً }: فجأة\n { أو يأتيهم عذاب يومٍ عقيم } \n وهو عذاب يوم القيامة\n كأنه قيل: حتى تأتيهم الساعة أو عذابها\n فزاد \" اليوم العقيم \" لمزيد التهويل\n واليوم العقيم: الذي لا يوم بعده\n كأنَّ كل يوم يلد ما بعده من الأيام\n فما لا يوم بعده يكون عقيمًا\n وقيل: اليوم العقيم: يوم بدر\n فهو عقيم عن أن يكون للكافرين فيه فَرح أو راحة\n كالريح العقيم لا تأتي بخير\n أو لأنه لا مثل له في عِظم أمره لقتال الملائكة فيه\n ولكن لا يساعده ما بعده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:41",
      "similarity": 0.6118015029262196
    },
    {
      "verse": "42:50",
      "similarity": 0.5979730285402718
    },
    {
      "verse": "12:107",
      "similarity": 0.3140265842795502
    },
    {
      "verse": "43:66",
      "similarity": 0.3038560365290585
    },
    {
      "verse": "11:118",
      "similarity": 0.2994259739107914
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/22:55.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/22:55.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/22:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}