{
  "chapter": "الحج",
  "text": "وليعلم الذين اوتوا۟ العلم انه الحق من ربك فيؤمنوا۟ به فتخبت له قلوبهم وان الله لهاد الذين ءامنوا۟ الى صرط مستقيم",
  "translations": [
    {
      "translation": "and so that those who have been given knowledge will know it is the truth from their Lord and have iman in it and their hearts will be humbled to Him. Allah guides those who have iman to a straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At the same time those who have been given knowledge may know that this is the truth from your Lord, and come to believe in it, and their hearts become submissive to Him. Verily God guides those who believe, to the even path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He also does this) in order that those endowed with knowledge may know that it is the Truth from your Lord and that they may have faith in it and their hearts may humble themselves before Him. Verily Allah always directs those that believe to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that those who have received knowledge would know and believe that whatever happens with the Prophets and Messengers is the Truth from their Lord and will believe it. This will cause their hearts to become filled with awe. God guides the believers to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so that the people given the knowledge may know that it is the truth from your Lord, in order that they may accept faith in it, therefore their hearts may humble before Him; and indeed Allah will guide the believers on the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been given knowledge may know that it (this Qur'an) is the truth from your Lord, so that they may believe therein, and their hearts may submit to it with humility. And verily, Allah is the Guide of those who believe, to the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been given the knowledge may know that it is the truth from your Lord, so they may believe in it and their hearts may be lowly before it; and most surely Allah is the Guide of those who believe into a right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that they who have been given knowledge may know that it is the truth from thy Lord and believe in it, and so their hearts be humble unto Him; and assuredly God ever guides those who believe to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been given knowledge may know that it is the truth from thy Lord, so that they may believe therein and their hearts may submit humbly unto Him. Lo! Allah verily is guiding those who believe unto a right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that those who are given knowledge may realize that this is the truth from your Lord and thus believe in it, and so that in their hearts they may humbly submit to Him. God will surely guide the faithful to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been vouchsafed knowledge may know that it is the truth from thy Lord and may believe therein, and so their hearts may submit thereto. And verily Allah is the Guide of those who believe unto a path straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And also for the reason] that those who have been given knowledge may know that it is the truth from your Lord, and so they may have faith in it, and their hearts may be humbled before Him. Indeed Allah guides those who have faith to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those on whom knowledge has been bestowed may learn that the (Qur'an) is the Truth from thy Lord, and that they may believe therein, and their hearts may be made humbly (open) to it: for verily Allah is the Guide of those who believe, to the Straight Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that those who have been given knowledge may know that it (this Quran) is the truth from your Lord, and that they may believe therein, and their hearts may submit to it with humility. And verily, Allah is the Guide of those who believe, to the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and so that those to whom knowledge has been given will know that this is the truth from your Lord and so believe in it and that their hearts will be humble to Him. Indeed, Allah will surely guide those who believe to a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so that those endowed with knowledge may know that it is the truth from your Lord, and so believe in it, and their hearts soften to it. God guides those who believe to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so those who were given knowledge may know that it is the truth from your Lord and [therefore] believe in it, and their hearts humbly submit to it. And indeed is Allah the Guide of those who have believed to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:54] And that those who have been given knowledge, [of] God’s Oneness and the Qur’ān, may know that it, the Qur’ān, is the truth from your Lord, so that they may believe therein, and their hearts may find reassurance in it. And assuredly God guides those who believe to a straight path, [a straight] route, namely, the religion of Islam.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلِيَعْلَمَ الَّذِينَ أُوتُوا الْعِلْمَ أَنَّهُ الْحَقُّ مِنْ رَبِّكَ فَيُؤْمِنُوا بِهِ فَتُخْبِتَ لَهُ قُلُوبُهُمْ وَإِنَّ اللَّهَ لَهَادِ الَّذِينَ آَمَنُوا إِلَى صِرَاطٍ مُسْتَقِيمٍ (54)الواضح كقوله تعالى :ومعنى هذه الآية : أن الأنبياء والرسل يرجون اهتداء قومهم ما استطاعوا فيبلغونهم ما ينزل إليهم من الله ويعظونهم ويدعونهم بالحجة والمجادلة الحسنة حتى يظنوا أن أمنيتهم قد نجحت ويقترب القوم من الإيمان ، كما حكى الله عن المشركين قولهم : { أهذا الذي بعث الله رسولاً إن كاد ليضلنا عن آلهتنا لولا أن صبرنا عليها }\\[ الفرقان : 41 - 42 \\] فيأتي الشيطان فلا يزال يوسوس في نفوس الكفار فينكصون على أعقابهم ، وتلك الوساوس ضروب شتى من تذكيرهم بحب آلهتهم ، ومن تخويفهم بسوء عاقبة نبذ دينهم ، ونحو ذلك من ضروب الضلالات التي حُكيت عنهم في تفاصيل القرآن ، فيتمسك أهل الضلالة بدينهم ويصدّون عن دعوة رسلهم ، وذلك هو الصبر الذي في قوله : { لولا أن صبرنا عليها } \\[ الفرقان : 42 \\] وقوله : { وانطلق الملأ منهم أن امشوا واصبروا على آلهتكم } \\[ ص : 6 \\]. وكلما أفسد الشيطان دعوة الرّسل أمرَ الله رسلَه فعاودوا الإرشاد وكرروه وهو سبب تكرر مواعظ متماثلة في القرآن ، فبتلك المعاودة يُنسخ ما ألقاه الشيطان وتُثبت الآيات السالفة . فالنسخ : الإزالة ، والإحكام : التثبيت . وفي كلتا الجملتين حذف مضاف ، أي ينسخ آثارَ ما يُلقي الشيطان ، ويُحكم آثارَ آياته .واللامان في قوله { ليجعل } وفي قوله { وليعْلَمَ } متعلقان بفعل { ينسخ الله } فإن النسخ يقتضي منسوخاً ، وفي { يجعل } ضميرٌ عائد إلى الله في قوله : { فينسخ الله }.والجعل هنا : جَعل نظام ترتب المسببات على أسبابها ، وتكويننِ تفاوت المدارك ومراتب درجاتها . فالمعنى : أنّ الله مكّن الشيطان من ذلك الفعل بأصل فطرته من يوم خلق فيه داعية الإضلال ، ونسخ ما يلقيه الشيطان بواسطة رسُله وآياته ليكون من ذلك فتنة ضلال كفر وهدي إيمان بحسب اختلاف القابليات . فهذا كقوله تعالى : { قال رب بما أغويتني لأزينن لهم في الأرض ولأغوينهم أجمعين إلا عبادك منهم المخلصين قال هذا صراط علي مستقيم إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين } \\[ الحجر : 39 -40 \\].ولام { ليجعل ما يلقي الشيطان فتنة } مستعار لمعنى الترتب مثل اللام في قوله تعالى : { فالتقطه آل فرعون ليكون لهم عدواً } \\[ القصص : 8 \\]. وهي مستعارة لمعنى التعقيب الذي حقه أن يكون بحرف الفاء ، أي تحصل عقب النسخ الذي فعله الله فتنةُ من افتتن من المشركين بانصرافهم عن التأمل في أدلة نسخ ما يلقيه الشيطان ، وعن استماع ما أحكم الله به آياته ، فيستمر كفرهم ويقوى .وأما لام { وليعلم الذين أوتوا العلم أنه الحق من ربك } فهي على أصل معنى التّعليل ، أي ينسخ الله ما يلقي الشيطان لإرادة أن يعلم المؤمنون أنه الحق برسوخ ما تمناه الرسول والأنبياء لهم من الهدى كما يحصل لهم بما يحكم الله من آياته ازدياد الهدى في قلوبهم .و { الذين في قلوبهم مرض } هم المتردّدون في قبول الإيمان . و { القاسية قلوبهم } هم الكافرون المصممون على الكفر . والفريقان هم المراد ب { الظالمين } في قوله : { وإن الظالمين لفي شقاق بعيد }. فذكر { الظالمين } إظهار في مقام الإضمار للإيماء إلى أن علّة كونهم في شقاق بعيد هي ظلمهم ، أي كفرهم .والشقاق : الخلاف والعداوة .والبعيد هنا مستعمل في معنى : البالغ حدّاً قوياً في حقيقته . تشبيهاً لانتشار الحقيقة فيه بانتشار المسافة في المكان البعيد كما في قوله تعالى { فذو دعاء عريض } \\[ فصلت : 51 \\] أي دعاء كثير مُلح .وجملة { وإن الظالمين لفي شقاق بعيد } معترضة بين المتعاطفات .و { الذين أوتوا العلم } هم المؤمنون بقرينة مقابلته ب { الذين في قلوبهم مرض } وبقوله { وإن الله لهاد الذين آمنوا إلى صراط مستقيم }. فالمراد بالعلم الوحي والكُتب التي أوتيها أصحاب الرسل السابقين فإنهم بها يصيرون من أهل العلم .وإطلاق { الذين أوتوا العلم } على المؤمنين تكرر في القرآن .وهذا ثناء على أصحاب الرسل بأنهم أوتوا العلم ، وهو علم الدّين الذي يبلغهم الرسل عليهم الصلاة والسلام ، فإن نور النُّبوءة يشرق في قلوب الذين يصحبون الرسول . ولذلك تجد من يصحب الرسول صلى الله عليه وسلم قد يكون قبل الإيمان جِلفاً فإذا آمن انقلب حكيماً ، مثل عمر بن الخطاب رضي الله عنه .وقد قال النبي صلى الله عليه وسلم « أصحابي كالنجوم بأيّهم اقتديتم اهتديتم » . وضمير { أنه الحق } عائد إلى العلم الذي أوتوه ، أي ليزدادوا يقيناً بأن الوحي الذي أوتوه هو الحق لا غيره مما ألقاه الشيطان لهم من التشكيك والشبه والتضليل ، فالقصر المستفاد من تعريف الجزأين قصر إضافي . ويجوز أن يكون ضمير { أنه } عائداً إلى ما تقدم من قوله { فينسخ الله } إلى قوله { ثم يحكم الله آياته } ، أي أن المذكور هو الحق ، كقول رُؤبة :فيها خطوط من سواد وبلق ... كأنه في الجِلد توليع البَهقأي كان كالمذكور .وقوله { فيؤمنوا به } معناه : فيزدادوا إيماناً أو فيؤمنوا بالناسخ والمحكَم كما آمنوا بالأصل .والإخباتُ : الاطمئنان والخشوع . وتقدم آنفاً عند قوله تعالى : { وبشر المخبتين } \\[ الحج : 34 \\] ، أي فيستقر ذلك في قلوبهم كقوله تعالى : { قال بلى ولكن ليطمئن قلبي } \\[ البقرة : 260 \\].وبما تلقيتَ في تفسير هذه الآية من الانتظام البيّن الواضح المستقل بدلالته والمستغني بنَهله عن عُلالته ، والسالم من التكلّفات والاحتياج إلى ضميمة القصص ترى أن الآية بمعزل عما ألصقه بها الملصقون والضعفاء في علوم السُّنّة ، وتلقاه منهم فريق من المفسرين حباً في غرائب النوادر دون تأمل ولا تمحيص ، من أن الآية نزلت في قصة تتعلق بسورة النجم فلم يكتفوا بما أفسدوا من معنى الآية حتى تجاوزوا بهذا الإلصاق إلى إفساد معاني سورة النجم ، فذكروا في ذلك روايات عن سعيد بن جبير ، وابن شهاب ، ومحمد بن كعب القرطبي ، وأبي العالية ، والضحاك وأقربُها رواية عن ابن شهاب وابن جبير والضحاك قالوا : إنّ النبي صلى الله عليه وسلم جلس في ناد من أندية قُريش كثير أهله من مسلمين وكافرين ، فقرأ عليهم سورة النجم فلما بلغ قوله : { أفرأيتم اللات والعزى ومناة الثالثة الأخرى } \\[ النجم : 19 - 20 \\] ألقى الشيطان بين السامعين عقب ذلك قوله : { تلك الغرانيق العلى وإن شفاعتهن لترتجى } ففرح المشركون بأن ذكَر آلهتهم بخير ، وكان في آخر تلك السورة سجدة من سجود التلاوة ، فلما سجد في آخر السورة سجد كلّ من حضر من المسلمين والمشركين ، وتسامع الناس بأن قُريشاً أسلموا حتى شاع ذلك ببلاد الحبشة ، فرجع من مهاجرة الحبشة نفرٌ منهم عثمان بن عفان إلى المدينة ، وأن النبي لم يشعر بأن الشيطان ألقى في القوم ، فأعلمه جبريل عليه السلام فاغتمّ لذلك فنزل قوله تعالى : { وما أرسلنا من قبلك } الآية تسلية له .وهي قصة يجدها السامع ضِغثاً على إبَالة ، ولا يلقي إليها النِّحرير بالَه . وما رُويت إلا بأسانيد واهية ومنتهاها إلى ذكر قصة ، وليس في أحد أسانيدها سماع صحابي لشيء في مجلس النبي صلى الله عليه وسلم وسندها إلى ابن عباس سندٌ مطعون . على أنّ ابن عباس يوم نزلت سورة النجم كان لا يحضر مجالس النبي صلى الله عليه وسلم وهي أخبار آحاد تعارض أصول الدين لأنها تخالف أصل عصمة الرسول صلى الله عليه وسلم لا التباس عليه في تلقي الوحي . ويكفي تكذيباً لها قوله تعالى : { وما ينطق عن الهوى } \\[ النجم : 3 \\] وفي معرفة الملكَ . فلو رووها الثقات لوجب رفضها وتأويلها فكيف وهي ضعيفة واهية . وكيف يروج على ذي مُسكة من عقل أن يجْتمع في كلاممٍ واحد تسفيهِ المشركين في عبادتهم الأصنام بقوله تعالى : { أفرأيتم اللات والعزى } \\[ النجم : 19 \\] إلى قوله : { ما أنزل الله بها من سلطان } \\[ النجم : 23 \\] فيقع في خلال ذلك مدحها بأنها «الغرانيق العلى وأن شفاعتهن لترتجى» . وهل هذا إلا كلام يلعنُ بعضُه بعضاً . وقد اتفق الحاكون أن النبي صلى الله عليه وسلم قرأ سورة النجم كلها حتى خاتمتِها { فاسجدوا لله واعبدوا } \\[ النجم : 62 \\] لأنهم إنما سجدوا حين سجد المسلمون ، فدلّ على أنهم سمعوا السورة كلها وما بين آية { أفرأيتم اللات والعزى } \\[ النجم : 19 \\] وبين آخر السورة آيات كثيرة في إبطال الأصنام وغيرها من معبودات المشركين ، وتزييف كثير لعقائد المشركين فكيف يصحّ أن المشركين سجدوا من أجل الثناء على آلهتهم . فإن لم تكن تلك الأخبار مكذوبة من أصلها فإن تأويلها : أن بعض المشركين وجدوا ذكر اللات والعُزّى فُرصة للدخَل لاختلاق كلمات في مدحهنّ ، وهي هذه الكلمات وروّجُوها بين الناس تأنيساً لأوليائهم من المشركين وإلقاء للريب في قلوب ضعفاء الإيمان .وفي «شرح الطيبي على الكشاف» نقلاً عن بعض المؤرّخين : أن كلمات «الغرانيق . . . » ( أي هذه الجمل ) من مفتريات ابن الزِّبعرى . ويؤيد هذا ما رواه الطبري عن الضحاك : «أن النبي صلى الله عليه وسلم أنزل عليه قصةُ آلهة العرب ( أي قوله تعالى : { أفرأيتم اللات والعزى } \\[ النجم : 19 \\] الخ ) فجعَل يتلو : اللاّتَ والعُزّى ( أي الآية المشتملة على هذا ) فسمع أهل مكة نبي الله يذكر آلهتهم ففرحوا ودنوا يستمعون فألقَى الشيطان تلك الغرانيق العُلَى مِنها الشفاعة ترتجَى» فإن قوله : «دنوا يستمعون فألقى الشيطان» الخ يؤذن بأنهم لم يسمعوا أول السورة ولا آخرها وأن شيطانهم ألقى تلك الكلمات . ولعل ابن الزبعرى كانت له مقدرة على محاكاة الأصوات وهذه مقدرة توجد في بعض الناس . وكنت أعرف فتى من أترابنا ما يحاكي صوت أحد إلا ظنه السامع أنه صوتُ المُحاكَى .وأما تركيب تلك القصة على الخبر الذي ثبت فيه أنّ المشركين سَجدوا في آخر سورة النجم لما سجد المسلمون ، وذلك مروي في الصحيح ، فذلك من تخليط المؤلفين .وكذلك تركيب تلك القصة على آية سورة الحجّ . وكم بين نزول سورة النجم التي هي من أوائل السور النازلة بمكة وبين نزول سورة الحج التي بعضها من أول ما نزل بالمدينة وبعضها من آخر ما نزل بمكة .وكذلك ربط تلك القصة بقصة رجوع من رَجع من مهاجرة الحبشة . وكم بين مدّة نزول سورة النجم وبين سنة رجوع من رجع من مهاجرة الحبشة .فالوجه : أن هذه الشائعة التي أشيعت بين المشركين في أول الإسلام ، إنما هي من اختلاقات المستهزئين من سفهاء الأحلام بمكة مثل ابن الزبعرى ، وأنهم عمدوا إلى آية ذُكرت فيها اللات والعُزّى ومناةَ فركّبوا عليها كلمات أخرى لإلقاء الفتنة في الناس وإنما خَصُّوا سورة النجم بهذه المرجَفة لأنهم حَضروا قراءتها في المسجد الحرام وتعلقت بأذهانهم وتطلباً لإيجاد المعذرة لهم بين قومهم على سجودهم فيها الذي جعله الله معجزة النبي صلى الله عليه وسلم وقد سرى هذا التعسف إلى إثبات معنى في اللغة ، فزعموا أن { تمنّى } بمعنى : قرأ ، والأمنية : القراءة ، وهو ادّعاء لا يوثق به ولا يُوجد له شاهد صريح في كلام العرب . وأنشدوا بيتاً لحسان بن ثابت في رثاء عثمان رضي الله عنه :تمنّى كتاب الله أول لَيْله ... وآخره لاقى حِمام المَقادروهو محتمل أن معناه تمنّى أن يقرأ القرآن في أول الليل على عادته فلم يتمكّن من ذلك بتشغيب أهل الحصار عليه وقتلوه آخر الليل . ولهذا جعله تمنياً لأنه أحبَ ذلك فلم يستطع . وربما أنشدوه برواية أخرى فظُنّ أنه شاهد آخر ، وربما توهَموا الرواية الثانية بيتاً آخر . ولم يذكر الزمخشري هذا المعنى في الأساس }. وقد قدمنا ذلك عند قوله تعالى : { ومنهم أميون لا يعلمون الكتاب إلا أماني } في سورة \\[ البقرة : 78 \\].وجملة { إن الله لهاد الذين آمنوا إلى صراط مستقيم } معترضة . والواو للاعتراض ، والذين أوتوا العلم هم المؤمنون . وقد جمع لهم الوصفان كما في قوله تعالى : { وقال الذين أوتوا العلم والإيمان لقد لبثتم في كتاب الله إلى يوم البعث } في سورة \\[ الروم : 56 \\]. وكما في سورة \\[ سبأ : 6 \\] { ويرى الذين أوتوا العلم الذي أنزل إليك من ربك هو الحق } فإظهار لفظ { الذين آمنوا } في مقام ضمير { الذين أوتوا العلم } لقصد مدحهم بوصف الإيمان ، والإيماء إلى أن إيمانهم هو سبب هديهم . وعكسه قوله تعالى : { إن الله لا يهدي من هو كاذب كفار } \\[ الزمر : 3 \\]. فالمراد بالهُدى في كلتا الآيتين عناية الله بتيسيره وإلا فإن الله هدى الفريقين بالدعوة والإرشاد فمنهم من اهتدى ومنهم من كفر .وكتب في المصحف { لهاد } بدون ياء بعد الدال واعتباراً بحالة الوصل على خلاف الغالب . وفي الوقف يثبت يعقوب الياء بخلاف البقية .\n\n",
      "translations": [
        {
          "translation": "(And that those who have been given knowledge) those who were given knowledge of the Qur'an and the Torah, i.e. 'Abdullah Ibn Salam and his followers (may know) Allah's clarifications (that it is the Truth from thy Lord, so that they may believe therein) so that they believe the clarification of Allah (and their hearts may submit humbly unto Him) so that their hearts be sincere and accept the clarification of Allah. (Lo! Allah verily is guiding) Allah protects (those who believe) in Muhammad (pbuh) and in the Qur'an (unto a right path) to an established religion with which Allah is pleased: i.e. Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وليعلم الذين أوتوا العلم } من أهل اليقين والمحققين: أن تمكّن الشيطان من الإلقاء هو الحكمة والحق من ربّك على قضية العدل والمناسبة { فيؤمنوا به } بأن يروا الكل من الله فتطمئن { له قلوبهم } بنور السكينة والاستقامة الموجبة لتمييز الإلقاء الشيطاني من الرحماني { وإن الله } لهاديهم إلى طريق الحق والاستقامة فلا تزلّ أقدامهم بقبول ما يلقي الشيطان\n ولا تقبل قلوبهم إلا ما يلقي الرحمن لصفائها وشدّة نوريتها وضيائها\n { ولا يزال } المحجوبون { في شك منه حتى } تقوم عليهم القيامة الصغرى { لو يأتيهم عذاب } وقت هائل لا يعلم كنهه ولا يمكن وصفه من الشدّة أو وقت لا مثل له في الشدّة أو لا خير فيه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلِيَعْلَمَ ٱلَّذِينَ أُوتُواْ ٱلْعِلْمَ } اللدني من دون الله ووُفِّقوا من عنده لقبول أحكامه { أَنَّهُ } أي: القرآن وآياته المشتملة على الأومر والنواهي\n والأحكام والمعارف والحقائق\n أو إقداره سبحانه على الشيطان بإلقائه المذكور افتناناً منه سبحانه و ابتلاء { ٱلْحَقُّ } الثابت المحقق النازل { مِن رَّبِّكَ } يا أكمل الرسل { فَيُؤْمِنُواْ بِهِ } أي: بالله بإنزاله القرآن أو بإقداره على الشيطان أن يلقي على لسان أنبيائه اختباراً لعباده { فَتُخْبِتَ } وتطمئن { لَهُ قُلُوبُهُمْ } ويزداد وثقوهم\n وصاروا على خطر عظيم واحتياط بليغ { وَإِنَّ ٱللَّهَ } المطلع لضمائر عباده { لَهَادِ ٱلَّذِينَ آمَنُوۤاْ } وأخلصوا بلا شوب شكٍ وترددٍ { إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } [الحج: 54] موصل إلى توحيده بلا عوج وانحراف\n\n\n{ وَلاَ يَزَالُ ٱلَّذِينَ كَفَرُواْ } بالله وانصرفوا عن مقتضيات آياته الكبرى لمرض صدروهم وعمى قلوبهم { فِي مِرْيَةٍ } أي: شك وارتياب { مِّنْهُ } أي: من القرآن",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وليعلم الذين أُوتوا العلم } بالله { أنه } أي: القرآن { الحقُّ من ربك } أي: النازل من عنده { فيُؤمنوا به } أي: بالقرآن { فتُخْبتَ }: تطمئن\n أو تخشع { له قلوبُهم } بالانقياد إليه والإذعان لما فيه\n { وإِنَّ الله لهادي الذين آمنوا إِلى صراط مستقيم } بالنظر الموصل إلى الحق الصريح\n فيتأولوا ما تشابه في الدين بالتأويلات الصحيحة\n ويطلبوا\n لما أشكل منه\n المحمل الذي تقتضيه الأصول المحكمة\n حتى لا يلحقهم حيرة ولا تعتريهم شبهة\n والله تعالى أعلم\n الإشارة: إذا وقع التعبير من جانب الحق فكل واحد من المستمعين يسمع ما يليق بمقامه ويقويه فيه\n فأهل الباطل يسمعون ما يليق بباطلهم ويمدهم فيه\n وأهل الحق يسمعون ما يليق بحقهم ويرقيهم\n فأهل الإيمان يسمعون ما يقوي إيمانهم ويزيدهم يقينًا\n وأهل الوصول يسمعون ما يليق بمقامهم ويرقيهم فيه\n وهكذا\n\nوتأمل قضية الثلاثة الذين سمعوا قائلاً يقول: يا سعترا بري\n فسمع أحدهم: اسْعَ تَر بري\n وسمع الآخر: الساعة ترى بري… وسمع الثالث: ما أوسع بري\n فالأول: طالب للوصول\n فقال له: اسع ترى بري\n والثاني: سائر مستشرف على الوصول\n فقال له: الساعة ترى بري\n والثالث: واصل قد اتسع عليه ميدان النعم\n فقال له: ما أوسع بري\n وكل من قَدِمَ على الأولياء فإنما يسمع حسب ما عنده فمن قَدِمَ عليهم بالميزان لا يسمع إلا ما يُبعده\n ومن قَدِمَ بالتصديق والتعظيم لا يسمع ولا يرى إلا ما يُقربه من الكمالات والأنوار\n والله تعالى أعلم\n ثمَّ ذكر ضد الذين أوتوا العلم الذين تحققوا بحقية القرآن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:23",
      "similarity": 0.8902616376095299
    },
    {
      "verse": "22:34",
      "similarity": 0.5199002270127462
    },
    {
      "verse": "34:6",
      "similarity": 0.16587633558231718
    },
    {
      "verse": "24:46",
      "similarity": 0.14350006432727844
    },
    {
      "verse": "2:213",
      "similarity": 0.1433877730851378
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022054.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022054.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:54.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}