{
  "chapter": "الحج",
  "text": "له ما فى السموت وما فى الارض وان الله لهو الغنى الحميد",
  "translations": [
    {
      "translation": "Everything in the heavens and everything in the earth belongs to Him. Allah is the Rich Beyond Need, the Praiseworthy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and the earth belongs to Him. Surely God is all-sufficing, worthy of praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and all that is in the earth. Surely Allah - He alone is Self- Sufficient, Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and the earth. God is Self-sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him only belongs all that is in the heavens and all that is in the earth; and indeed Allah only is the Perfect (Not Needing Anything), the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and all that is on the earth. And verily, Allah -- He is Rich, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is whatsoever is in the heavens and whatsoever is in the earth; and most surely Allah is the Self-sufficient, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and in the earth; surely God -- He is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him belongeth all that is in the heavens and all that is in the earth. Lo! Allah, He verily is the Absolute, the Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "all that is in the heavens and on the earth belongs to Him. Surely, God is self-sufficient and praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is whatsoever is in the heavens and whatsoever is on the earth; and verily Allah He is the Self-sufficient, the PraiseWorthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatever is in the heavens and whatever is in the earth, Indeed Allah is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and on earth: for verily Allah,- He is free of all wants, Worthy of all Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that is in the heavens and all that is on the earth. And verily, Allah He is Rich (Free of all wants), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belong all that is in the heavens and earth, surely, Allah is the Rich, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs everything in the heavens and everything on earth. God is the Rich, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs what is in the heavens and what is on the earth. And indeed, Allah is the Free of need, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:64] To Him belongs all that is in the heavens and all that is in the earth, in terms of ownership. Surely God, He is Independent, of His servants, Praiseworthy, to His friends.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَإِنَّ اللَّهَ لَهُوَ الْغَنِيُّ الْحَمِيدُ (64)الجملة خبر ثان عن اسم الجلالة في قوله : { إن الله لطيف خبير } \\[ الحج : 63 \\] للتنبيه على اختصاصه بالخالقية والملك الحقّ ليعلم من ذلك أنه المختصّ بالمعبودية فيرد زعم المشركين أنّ الأصنام له شركاء في الإلهية وصرف عبادتهم إلى أصنامهم ، والمناسبة هي ذكر إنزال المطر وإنبات العشب فما ذلك إلا بعض ما في السماوات وما في الأرض .وإنما لم تعطف الجملة على التي قبلها مع اتحادهما في الغرض لأن هذه تتنزّل من الأولى منزلة التذييل بالعموم الشامل لما تضمنته الجملة التي قبلها ، ولأن هذه لا تتضمن تذكيراً بنعمة .وجملة { إن الله لهو الغني الحميد } عطف على جملة { له ما في السماوات وما في الأرض }. وتقديم المجرور للدلالة على القصر . أي له ذلك لا لغيره من أصنامكم ، إن جعلتَ القصر إضافياً ، أو لعدم الاعتداد بغنى غيره ومحموديته إن جعلت القصر ادعائياً .ونبه بوصف الغنى على أنه غير مفتقر إلى غيره ، وهو معنى الغِنَى في صفاته تعالى أنه عدم الافتقار بذاته وصفاته لا إلى محلّ ولا إلى مخصّص بالوجود دون العدم والعكس تنبيهاً على أنّ افتقار الأصنام إلى من يصنعها ومن ينقلها من مكان إلى آخر ومن ينفض عنها القتام والقذر دليل على انتفاء الإلهية عنها .وأما وصف { الحميد } بِمعنى المحمود كثيراً ، فذكره لمزاوجة وصف الغِنى لأن الغني مفيض على الناس فهم يحمدونه .وفي ضمير الفصل إفادة أنه المختص بوصف الغنى دون الأصنام وبأنه المختص بالمحمودية فإن العرب لم يكونوا يوجّهون الحمد لغير الله تعالى . وأكد الحصرُ بحرف التوكيد وبلام الابتداء تحقيقاً لنسبة القصر إلى المقصور كقول عمرو بن معد يكرب : «إني أنا الموت» . وهذا التأكيد لتنزيل تحققهم اختصاصه بالغنى أو المحمودية منزلة الشك أو الإنكار لأنهم لم يجروا على موجِب علمهم حين عبدوا غيره وإنما يعبد من وصفه الغنى .\n\n",
      "translations": [
        {
          "translation": "(Unto Him belongeth all that is in the heavens and all that is in the earth) of created beings. (Lo! Allah, He verily is the Absolute) He is free of need for His created beings, (the Owner of Praise) the One Who is praised in His actions; it is also said that this means: the Owner of Praise with regard to he who declares His divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الحميد }: المحمود بنعمته\n قبل ثناء من في السماوات والأرض عليه\n أو المستحق للحمد\n أعطى أو لم يعط\n ثم ذكر موجب الحمد من عباده\n فقال: { ألم ترَ أن الله سخَّر لكم ما في الأرض } من الأنعام لتأكلوا منها\n ومن البهائم لتركبوها في البر\n { والفُلكَ تجري في البحر بأمره }: بقدرته وإذنه\n أي: وسخر لكم المراكب حال كونها جارية في البحر بإذنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:26",
      "similarity": 0.9999999999999998
    },
    {
      "verse": "14:8",
      "similarity": 0.7478109996789621
    },
    {
      "verse": "45:36",
      "similarity": 0.6984677533215046
    },
    {
      "verse": "64:6",
      "similarity": 0.6052449094385541
    },
    {
      "verse": "37:182",
      "similarity": 0.586056334563377
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022064.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022064.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:64.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}