{
  "chapter": "الحج",
  "text": "الم تر ان الله سخر لكم ما فى الارض والفلك تجرى فى البحر بامره ويمسك السماء ان تقع على الارض الا باذنه ان الله بالناس لرءوف رحيم",
  "translations": [
    {
      "translation": "Do you not see that Allah has made everything on the earth subservient to you and the ships running upon the sea by His command? He holds back the heaven, preventing it from falling to the earth - except by His permission. Allah is All-Compassionate to mankind, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see God has harnessed all that is in the earth, to your service? And the boats ply in the ocean by His command. He holds the sky in position lest it should fall upon the earth save by His dispensation. Verily God is compassionate and kind to men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how Allah has subjected to you all that is in the earth, and the vessels that sail in the sea by His command, and it is He Who holds back the sky that it may not fall on earth except by His leave? Surely Allah is Most Gentle, Ever Compassionate to people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God, through His command, has made all that is in the earth and the ships that sail on the sea subservient to you? He prevents the sky from falling on the earth unless He decides otherwise. God is Compassionate and Merciful to mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see that Allah has given in your control all that is in the earth – and the ship that moves upon the sea by His command? And He restricts the heavens that it may not fall on to the earth except by His command; indeed Allah is Most Compassionate, Most Merciful upon mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah has subjected to you all that is on the earth, and the ships that sail through the sea by His command He withholds the heaven from falling on the earth except by His leave. Verily, Allah is for mankind, full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has made subservient to you whatsoever is in the earth and the ships running in the sea by His command? And He withholds the heaven from falling on the earth except with His permission; most surely Allah is Compassionate, Merciful to men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how that God has subjected to you all that is in the earth and the ships to run upon the sea at His commandment, and He holds back heaven lest it should fall upon the earth, save by His leave? Surely God is All-gentle to men, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how Allah hath made all that is in the earth subservient unto you? And the ship runneth upon the sea by His command, and He holdeth back the heaven from falling on the earth unless by His leave. Lo! Allah is, for mankind, Full of Pity, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see, how God has subjected everything on the earth to you, and the ships that sail on the sea by His command. He holds back the sky from falling down on the earth, except with His permission. God is most compassionate and most merciful to mankind --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not that Allah hath subjected to Himself for you whatsoever is on the earth and the ships running in the sea by His command? And He with holdeth the heaven that it fall not on the earth save by His leave. Verily Allah is, unto mankind, Clement, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded that Allah has disposed for you [r benefit] whatever there is in the earth, and [that] the ships sail at sea by His command, and He sustains the sky lest it should fall on the earth, excepting [when it does so] by His leave? Indeed Allah is most kind and merciful to mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not that Allah has made subject to you (men) all that is on the earth, and the ships that sail through the sea by His Command? He withholds the sky (rain) from failing on the earth except by His leave: for Allah is Most Kind and Most Merciful to man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah has subjected to you (mankind) all that is on the earth, and the ships that sail through the sea by His Command? He withholds the heaven from falling on the earth except by His Leave. Verily, Allah is, for mankind, full of Kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has subjected to you all that is on the earth, and the ships which run upon the sea by His command? He holds the sky back lest it should fall upon the earth except by His permission. Allah is Gentle to people, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that God made everything on earth subservient to you? How the ships sail at sea by His command? That He holds up the sky lest it falls on earth—except by His permission? God is Gracious towards the people, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has subjected to you whatever is on the earth and the ships which run through the sea by His command? And He restrains the sky from falling upon the earth, unless by His permission. Indeed Allah, to the people, is Kind and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:65] Have you not seen, realised, that God has disposed for you all that is in the earth, of beasts, and [that] the ships run upon the sea, for transport and to carry loads, by His command, by His leave, and He holds back the heaven lest it should fall on the earth, save [when it may do so] by His leave, and you are destroyed. Surely God is, with mankind, Gentle, Merciful, in disposing [things for them] and holding [others] back [from them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "371 (Hast thou not seen) have you not, Muhammad, been informed in the Qur'an (how Allah hath made all that is in the earth) of trees and beasts (subservient unto you? And the ships runneth upon the sea by His command) by His leave, (and He holdeth back) and He prevents (the heaven from falling on the earth unless by His leave) that is until the Day of Judgement. (Lo! Allah is, for mankind) for the believers, (Full of Pity, Merciful).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ من شأنها الوقوع لولا إمساكه سبحانه إياها { إِلاَّ } أن تقع عليها { بِإِذْنِهِ } تعالى وتعلق مشيئته بوقوعها\n وذلك يوم القيامة { إِنَّ ٱللَّهَ } المدبر لمصالح عباده { بِٱلنَّاسِ } المجبولين على الكفران والنسيان { لَرَءُوفٌ } مشفق عطوف { رَّحِيمٌ } [الحج: 65] لهم يعفو عنهم زلتهم\n ويرزقهم من حيث لا يحتسب\n\n\n{ وَ } كيف لا يرحكمكم ولا يرأف عليكم سبحانه { هُوَ ٱلَّذِيۤ أَحْيَاكُمْ } في النشأة الأولى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويُمسكُ السماء أن تقعَ على الأرض } أي: يحفظها من السقوط\n بأن خلقها على هيئة متداعية إلى الاستمساك\n { إِلا بإِذنه }: إلا بمشيئته\n وذلك يوم القيامة\n وفيه رد لاستمساكها بذاتها فإنها مساوية لسائر الأجسام في الجسمية\n فتكون قابلة للميل الهابط قبُولَ غيرها\n { إِنَّ الله بالناس لرؤوفٌ رحيمٌ } حيث هيأ لهم هذه الأسباب لقيام معاشهم\n وفتح لهم أبواب المنافع\n ودفع عنهم أنواع المضار\n فأوضح لهم مناهج الاستدلال بالآيات التكوينية والتنزيلية\n فله الحمد وله الشكر\n الإشارة: ألم تر أن الله أنزل من سماء المعاني ماء علم الغيوب\n وهو علم أسرار الذات وأنوار الصفات\n أعني: التوحيد الخاص\n فإذا نزل على أرض النفوس\n اهتزت وربت\n واخضرت بالعلوم والمعارف\n إن الله لطيف خبير\n لطيف لسريان معانيه اللطيفة في كل شيء\n خبير ببواطن كل شيء\n فمن كوشف بلطيف معانيه وإحاطة علمه في كل شيء\n وبكل شيء\n حيي قلبه بمعرفة الله\n واخضرت أرض نفسه بأنواع العلوم والمعارف\n ألم تر أن الله سخر لكم ما في الأرض\n يكون عند أمركم ونهيكم\n وفلك الفكرة تجري في بحر التوحيد بأمره\n ويُمسك سماء الأرواح أن تقع على أرض الحظوظ إلا بإذنه\n بعد الرسوخ في معرفته\n والتمكين من الفهم عنه\n إن الله بالناس لرؤوف رحيم حيث فتح لهم باب العلوم\n وهيأ لهم أسباب الفهوم\n وهي الرياضة والتأديب\n ثمَّ ذكر دليلاً آخر على قدرته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:12",
      "similarity": 0.48634568189207417
    },
    {
      "verse": "14:32",
      "similarity": 0.45354870564782174
    },
    {
      "verse": "31:31",
      "similarity": 0.41610424603635454
    },
    {
      "verse": "16:47",
      "similarity": 0.39220627060747076
    },
    {
      "verse": "24:20",
      "similarity": 0.39171721084773253
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}