{
  "chapter": "الحج",
  "text": "ذلك ومن عاقب بمثل ما عوقب به ثم بغى عليه لينصرنه الله ان الله لعفو غفور",
  "translations": [
    {
      "translation": "That is so. And if anyone inflicts an injury the same as the one done to him and then is again oppressed, Allah will come to his aid. Allah is All-Pardoning, Ever-Forgiving.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever retaliates to the extent of injury suffered by him, and is wronged again, will certainly be helped by God. Verily God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That indeed is so, as for him who retaliates in proportion to the excess committed against him, and is thereafter again subjected to transgression, Allah will surely aid him. Verily Allah is All-Pardoning, All-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who is wronged and who retaliates by that which is equal to his suffering, God will certainly help him; He is All-pardoning and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it is; and whoever retaliates similarly to the affliction he was made to suffer, and then he is wronged again – so Allah will definitely assist him; indeed Allah is Oft Pardoning, Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so. And whoever has retaliated with the like of that which he was made to suffer, and then has again been wronged, Allah will surely help him. Verily, Allah indeed is Oft-Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (shall be so); and he who retaliates with the like of that with which he has been afflicted and he has been oppressed, Allah will most certainly aid him; most surely Allah is Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that; and whosoever chastises after the manner that he was chastised and then again is oppressed, assuredly God will help him; surely God is All-pardoning, All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (is so). And whoso hath retaliated with the like of that which he was made to suffer and then hath (again) been wronged, Allah will succour him. Lo! Allah verily is Mild, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus it shall be. As for one who retaliates to the same extent as he has suffered and then is again wronged, God will surely come to his aid. God is merciful and forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so. And whosoever Chastiseth the like of that whereby He was injured, and thereafter he hath been ogain oppressed, surely Allah will succour him: verily Allah is Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will it be; and whoever retaliates with the like of what he has been made to suffer, and is aggressed against [again] thereafter, Allah will surely help him. Indeed Allah is all-excusing, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (is so). And if one has retaliated to no greater extent than the injury he received, and is again set upon inordinately, Allah will help him: for Allah is One that blots out (sins) and forgives (again and again).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so. And whoever has retaliated with the like of that which he was made to suffer, and then has again been wronged, Allah will surely help him. Verily! Allah indeed is Oft-Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So shall it be. He who punishes after the manner that he was punished and then again is oppressed, shall be helped by Allah. Allah is Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so! Whoever retaliates similarly to the affliction he was made to suffer, and then he is wronged again, God will definitely assist him. God is Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That [is so]. And whoever responds [to injustice] with the equivalent of that with which he was harmed and then is tyrannized - Allah will surely aid him. Indeed, Allah is Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:60] That, which We have related to you, [is so]. And whoever retaliates, [whoever] from among the believers requites, with the like of what he was made to suffer, at the hands of the idolaters wrongfully: that is whoever fights against them if they fight against him during the sacred month, and then is [again] made to suffer aggression, by them, that is to say, he is [again] wronged, by being expelled from his house, God will surely help him. Indeed God is Pardoning, to believers, Forgiving, them their engaging in combat during the sacred month.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nذَلِكَ وَمَنْ عَاقَبَ بِمِثْلِ مَا عُوقِبَ بِهِ ثُمَّ بُغِيَ عَلَيْهِ لَيَنْصُرَنَّهُ اللَّهُ إِنَّ اللَّهَ لَعَفُوٌّ غَفُورٌ (60)اسم الإشارة للفصل بين الكلامين لفتاً لأذهان السامعين إلى ما سيجيء من الكلام لأنّ ما بعده غير صالح لأن يكون خبراً عن اسم الإشارة . وقد تقدم نظيره عند قوله : { ذلك ومن يعظم حرمات الله فهو خير له عند ربه } \\[ الحج : 30 \\].وجملة { ومن عاقب } الخ ، معطوفة على جملة { والذين هاجروا في سبيل الله } \\[ الحج : 58 \\] الآية .والغرض منها التهيئة للجهاد والوعد بالنصر الذي أشير إليه سابقاً بقوله تعالى : { أذن للذين يقاتلون بأنهم ظلموا وإن الله على نصرهم لقدير } إلى قوله : { ولينصرن الله من ينصره إن الله لقوي عزيز } \\[ الحج : 3940 \\] ، فإنه قد جاء معترضاً في خلال النّعي على تكذيب المكذبين وكفرِهم النعمَ ، فأكمل الغرض الأول بما فيه من انتقالات ، ثمّ عطف الكلام إلى الغرض الذي جرت منه لمحة فعاد الكلام هنا إلى الوعد بنصر الله القوم المعتدى عليهم كما وعدهم بأن يدخلهم في الآخرة مدخلاً يرضونه .وجيء بإشارة الفصل للتنبيه على أهمية ما بعده .وما صْدَقُ ( مَن ) الموصولة العموم لقوله فيما سلف { أذن للذين يقاتلون بأنهم ظلموا } \\[ الحج : 39 \\] ، فنبه على أن القتال المأذون فيه هو قتال جَزاء على اعتداء سابق كما دلّ عليه أيضاً قوله { بأنهم ظلموا } \\[ الحج : 39 \\].وتغيير أسلوب الجمع الذي في قوله { أذن للذين يقاتلون } \\[ الحج : 39 \\] إلى أسلوب الإفراد في قوله { ومن عاقب } للإشارة إلى إرادة العموم من هذا الكلام ليكون بمنزلة القاعدة الكلية لسنّة من سنن الله تعالى في الأمم .ولما أتي في الصلة هنا بفعل { عاقَب } مع قصد شمول عموم الصلة للذين أُذِن لهم بأنهم ظُلموا عَلم السامع أنّ القتال المأذون لهم به قتال جزاء على ظلم سابق .وفي ذلك تحديد لقانون العقاب أن يكون مماثلاً للعدوان المجزى عليه ، أي أن لا يكون أشدّ منه .وسُميّ اعتداء المشركين على المؤمنين عقاباً في قوله { بمثل ما عوقب به } لأن الذي دفع المعتدين إلى الاعتداء قصد العقاب على خروجهم عن دين الشرك ونبذ عبادة أصنامهم . ويعلم أنّ ذلك العقاب ظلم بقوله فيما مضى : { الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله } \\[ الحج : 40 \\].ومعنى { بمثل ما عوقب به } المماثلةُ في الجنس فإن المشركين آذوا المسلمين وأرْغموهم على مغادرة موطنهم فيكون عقابهم على ذلك بإخراج من يمكنهم أن يخرجوه من ذلك الوطن . ولا يستطيعون ذلك إلا بالجهاد لأنّ المشركين كانوا أهل كثرة وكانوا مستعصمين ببلدهم فإلجاء من يمكن إلجاؤه إلى مفارقة وطنه ، إما بالقتال فهو إخراج كامل ، أو بالأسر .و { ثمّ } من قوله : { ثم بغي عليه } عطف على جملة { ومن عاقب بمثل ما عوقب به } ، ف ( ثم ) للتراخي الرتبي فإن البغي عليه أهم من كونه عاقب بمثل ما عوقب به إذ كان مبدوءاً بالظلم كما يقال «البادىء أظلم» . فكان المشركون محقوقين بأن يعاقبوا لأنهم بغوا على المسلمين .ومعنى الآية في معني قوله : { ألا تقاتلون قوماً نكثوا أيمانهم وهموا بإخراج الرسول وهم بدأوكم أول مرة } \\[ التوبة : 13 \\].وكان هذا شرعاً لأصول الدفاع عن البيضة ، وأما آيات الترغيب في العفو فليس هذا مقام تنزيلها وإنما هي في شرع معاملات الأمة بعضها مع بعض ، وقد أكد لهم الله نصره إن هم امتثلوا لما أذنوا به وعاقبوا بمثل ما عُوقبوا به ، وللمفسرين في تقرير هذه الآية تكلفات تنبىء عن حَيرة في تلئيم معانيها .وجملة { إن الله لعفو غفور } تعليل للاقتصار على الإذن في العقاب بالمماثلة في قوله : { ومن عاقب بمثل ما عوقب به } دون الزيادة في الانتقام مع أن البادىء أظلم بأن عفو الله ومغفرته لخلقه قَضَيَا بحكمته أن لا يأذن إلا بمماثلة العقاب للذنب لأن ذلك أوفق بالحق . ومما يؤثر عن كسرى أنه قيل له : بم دام ملككم؟ فقال : لأننا نعاقب على قدر الذنب لا على قدر الغَضب ، فليس ذكر وصفي { عفو غفور } إيماء إلى الترغيب في العفو عن المشركين .ويجوز أن يكون تعليلاً للوعد بجزاء المهاجرين اتباعاً للتعليل في قوله : { إن الله لعليم حليم } \\[ الحج : 59 \\] لأن الكلام مستمر في شأنهم .\n\n",
      "translations": [
        {
          "translation": "(That (is so)) that is Allah's judgement between the believers and disbelievers in the Hereafter. (And whoso hath retaliated) against the killer of his relative (with the like of that which he) his relative (was made to suffer and then hath (again) been wronged) and then he transgresses again against him, (Allah will succour him) i.e. Allah will help the wronged person against the transgressor, such that he kills him and no blood money will be taken from him. This is the case of a man whose relative is killed. And so he takes blood money from the killer of his relative. But then this man proceeds to kill the killer of his relative. This man must be killed and no blood money is accepted from him. (Lo! Allah verily is Mild) He pardons whoever repents, (Forgiving) He forgives whoever dies repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } أي: الأمر والشأن ذلك المذكور لمن هاجر إلى الله طالباً لقياه\n خالصاً لوجهه الكريم { وَمَنْ عَاقَبَ } ظالمه يوماً غلب عليه\n وأراد أن ينتقم عنه { بِمِثْلِ مَا عُوقِبَ بِهِ } أي: بمقدار ظلمه بلا زيادة عليه ولا نقصان { ثُمَّ بُغِيَ عَلَيْهِ } أي: غلب الظالم على المظلوم المنتقم كرة أخرى\n وأراد أن يظلم عليه ثانياً { لَيَنصُرَنَّهُ ٱللَّهُ } العزيز المنتقم في الكرّة الثانية أيضاً ما لم يتجاوز عن حد الانتقام\n ولا ينظر سبحانه إلى اجترائه إلى الانتقام\n ويتركه ما هو الأولى وهو العفو عند القدرة\n وكظم الغيظ لدى الفرصة { إِنَّ ٱللَّهَ } المطلع لمقتضيات استعداد عباده { لَعَفُوٌّ غَفُورٌ } [الحج: 60] لما صدر عنهم من المبادرة إلى الانتقام لدى القدرة\n\n{ ذٰلِكَ } النصر على من ظُلم { بِأَنَّ ٱللَّهَ } أي: بسبب أن الله المستوي على القسط القويم { يُولِجُ } ويدخل { ٱللَّيْلَ } المظلم { فِي ٱلنَّهَارِ } المضيء { وَيُولِجُ ٱلنَّهَارَ } المضيء { فِي ٱللَّيْلِ } المظلم على التدريج ليعتدلا ويعتدل من ظهر وما ظهر كرهما وتجددهما { وَأَنَّ ٱللَّهَ } المدبر لمصالح مظاهره بالحكمة المتقنة { سَمِيعٌ } سمع ما هو من قبيل المسموعات من الوقائع التي أدركها السمع { بَصِيرٌ } [الحج: 61] يبصر ما هو من قبيل املبصرات من الحوادث المدركة بالبصر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ذلك }: خبر\n أي: الأمر ذلك\n و { مَن عاقب }: شرط سدّ مسد جوابه\n أي: من عاقب بمثل ما عُوقب به ينصره الله\n يقول الحقّ جلّ جلاله: { ذلك } أي: الأمر ذلك\n كما أخبرتك في بيان الفريقين\n ثم استأنف فقال: { ومن عاقب بمثل ما عُوقِبَ به } أي: لم يزد في القصاص على ما فُعل به\n وسمى الابتداء عقابًا للمشاكلة ولملابسته له\n من حيث إنه سبب له وهو مسبب عنه\n { ثم بُغِيَ عليه لينصُرَنَّه اللهُ } أي: من جازى بمثل ما فُعل به من الظلم\n ثم ظُلم\n بعد ذلك\n وبُغي عليه بعد ذلك\n فحق على الله أن ينصره { إِنَّ الله لعفوٌّ } يمحو آثار الذنوب\n { غفورٌ } يستر أنواع العيوب\n ومناسبة الوصفين لما قبلهما: أن المعاقب مأمور بالعفو من عند الله\n بقوله\n[الشورى: 40]\n\n[الشورى: 43]\n فحين لم يفعل ذلك\n وانتصر لنفسه\n فكأنه مُذنب\n فمعنى العفو في حقه أنه لا يلزمه على ترك الفضل شيء\n وأنه ضامن لنصره في الكرة الثانية\n إذا ترك العفو وانتقم من الباغي عليه\n وعَرَّضَ\n مع ذلك\n بما كان أولى به من العفو بذكر هاتين الصفتين\n  ثم ذكر دلائل قدرته على النصر وغيره بقوله: { ذلك بأن الله يُولج الليلَ في النهار ويُولجُ النهارَ في الليل وأنَّ الله سميع بصيرٌ } أي: ذلك النصر للمظلوم بسبب أنه قادر على ما يشاء\n ومن آيات قدرته أنه { يُولجُ الليلَ في النهار ويُولجُ النهارَ في الليل } أي: يُدخل أحدهما في الآخر\n فيدخل الليلَ في النهارِ إذا طال النهار\n ويُدخل النهارَ في الليل إذا طال الليلُ\n فيزيد في أحدهما ما ينقص من الآخر\n أو بسبب أنه خالق الليل والنهار ومصرفهما\n بإدخال أحدهما على الآخر\n فلا يخفى عليه ما يجري فيهما على أيدي عباده من الخير والشر\n والبغي والإنصاف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:52",
      "similarity": 0.4788383571092724
    },
    {
      "verse": "42:40",
      "similarity": 0.4629664386577154
    },
    {
      "verse": "4:99",
      "similarity": 0.4615398355423035
    },
    {
      "verse": "9:43",
      "similarity": 0.42526445363407595
    },
    {
      "verse": "42:25",
      "similarity": 0.3987141087148
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022060.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022060.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:60.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}