{
  "chapter": "الحج",
  "text": "ذلك بان الله هو الحق وانه يحى الموتى وانه على كل شىء قدير",
  "translations": [
    {
      "translation": "That is because Allah is the Real and gives life to the dead and has power over all things",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so for God is the undeniable Reality. It is He who brings the dead to life, for He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All this is because Allah, He is the Truth, and because He resurrects the dead, and because He has power over everything,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because God is the Supreme Truth who gives life to the dead and who has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah only is True and because He will revive the dead, and because He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah: He is the Truth, and it is He Who gives life to the dead, and it is He Who is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah is the Truth and because He gives life to the dead and because He has power over all things\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God -- He is the Truth, and brings the dead to life, and is powerful over everything,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah, He is the Truth and because He quickeneth the dead, and because He is Able to do all things;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that is because God is the truth. It is He who gives life to the dead and He has the power to will anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, because Allah! He is The Truth, and He quickeneth the dead, and verily He is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is because Allah is the Reality and it is He who revives the dead, and He has power over all things,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is so, because Allah is the Reality: it is He Who gives life to the dead, and it is He Who has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah, He is the Truth, and it is He Who gives life to the dead, and it is He Who is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah is the Truth; He revives the dead and has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God is the truth, and because He gives life to the dead, and because He is Capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah is the Truth and because He gives life to the dead and because He is over all things competent\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:6] That, which is mentioned, from the commencement of man’s creation to the end of [the description of] the   earth being revived, is because God, He is the Truth, the Constant, the Permanent, and because He revives the dead and has power over all things;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That is because) the power to transform you, and to do other things, so that you acknowledge and know that (Allah, He is the Truth) the worship of Allah is the Truth. (Lo! He quickeneth the dead) for the resurrection, (and lo! He is Able to do all things) of life and death;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } المذكور من إيجاد المقدورات التي تستبعدها العقول السخيفة والأحلام الردية الضعيفة { بِأَنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء { هُوَ ٱلْحَقُّ } الثابت المحقق المقصور على الحقية والثبوت لا متحقق في الوجود سواه، ولا معبود يُعبد بالحق إلا هو { وَأَنَّهُ } سبحانه بخصوصه المقتدر هو الحي القيوم المحيي { يُحْيِـي ٱلْمَوْتَىٰ } بالإرادة والاختيار { وَأَنَّهُ } بذاته وأسمائه وصفاته هو القادر بالاستقلال { عَلَىٰ كُلِّ شَيْءٍ } دخل تحت قدرته وحيطة حضرة علمه وإرادته بالاستقلال { قَدِيرٌ } [الحج: 6] بلا فتور وقصور ولا تزلزل وعثور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك بأن الله هو الحق } أي: ذلك الذي ذكرنا من خلق بني آدم، وإحياء الأرض، مع ما في تضاعيف ذلك من أصناف الحِكم، حاصل بهذا، وهو أن الله هو الحق، أي: الثابت الوجود\n هكذا للزمخشري ومن تبعه، وقال ابن جُزَي: والظاهر: أن الياء ليست سببية، كما قال الزمخشري، وهو أيضًا مقتضى تفسير ابن عطية، وإنما يُقدر لها فعل يتعلق به ويقتضيه المعنى، وذلك أن يكون التقدير: ذلك الذي تقدم من خلق الإنسان والنبات، شاهد بأن الله هو الحق، وبأنه يحيي الموتى، وبأن الساعة آتية، فيصح عطف { وأن الساعة } على ما قبله، بهذا التقدير، وتكون هذه الأشياء المذكورة، بعد قوله: { ذلك } ، مما استدل عليه بخلقة الإنسان والنبات\n\n\nهـ\n قال المحشي الفاسي: ويرد عليه: أن تقديره عاملاً خاصًا يمنع حذفه، وإنما يحذف إذا كان كونًا مُطلقًا، فلا يقال: زيد في الدار، وتريد ضاحكٌ مثلاً، إلا أن يقال في الآية: دل عليه السياق، فكأنه مذكور\n وعند الكواشي: ليعلموا بأن الله هو الحق\n وقال القرطبي: قوله: { ذلك بأن الله هو الحق } ، لمّا ذكر افتقار الموجودات إليه، وتسخيرها على وفق اقتداره واختياره، قال بعد ذلك: { ذلك بأن الله هو الحق } ، نبه بهذا على أن كل ما سواه، وإن كان موجودًا فإنه لا حقيقة له من نفسه لأنه مسخر ومُصَرفٌ، والحق الحقيقي هو الموجود المطلق، الغني المطلق، وإنَّ وجود كل موجود من وجوب وجوده، ولهذا قال في آخر السورة:\n\n[الحَجّ: 62]، والحق هو الوجود الثابت، الذي لا يزول ولا يتغير، وهو الله تعالى\n ثم قال عن الزجاج: { ذلك } في موضع رفع، أي: الأمر ما وُصِفَ لكم وبُيِّن لأن الله تعالى هو الحق، ويجوز كونه في مَوْضِع نصب، أي: فعل ذلك بأن الله هو الحق، قادر على ما أراد\n هـ\n وذلك أيضًا شاهد بأنه { يُحيي الموتى } كما أحيا الأرض، مرة بعد أخرى، { وأنه على كل شيء قدير } أي: مبالغ في القدرة، وإلاَّ لَمَا أوجد هذه الموجودات الفائتة الحصر\n وتخصيص إحياء الموتى بالذكر، مع كونه من جملة الأشياء المقدور عليها للتصريح بما فيه النزاع، وللطعن في نحور المنكرين",
      "translations": []
    }
  ]
}