{
  "chapter": "الحج",
  "text": "ذلك بان الله يولج اليل فى النهار ويولج النهار فى اليل وان الله سميعۢ بصير",
  "translations": [
    {
      "translation": "That is because Allah merges night into day and merges day into night and because Allah is All-Hearing, All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so for God turns night into day and day into night, for God is all-hearing and all-seeing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So shall it be because it is Allah Who causes the night to emerge out of the day and causes the day to emerge out of the night and Allah is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God causes the night to enter the day and the day to enter the night. He is All-hearing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah inserts the night into a part of the day and inserts the day into a part of the night, and because Allah is All Hearing, All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah merges the night into the day, and He merges the day into the night. And verily, Allah is All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah causes the night to enter into the day and causes the day to enter into the night, and because Allah is Hearing, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God makes the night to enter into the day and makes the day to enter into the night; and that God is All-hearing, All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah maketh the night to pass into the day and maketh the day to pass into the night, and because Allah is Hearer, Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God makes the night pass into the day and makes the day pass into the night. God is all hearing and all seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is to be because Allah plungeth the night into the day and plungeth the day into the night, and because He is Hearing, Beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will it be, because Allah makes the night pass into the day and makes the day pass into the night, and because Allah is all-hearing, all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah merges night into day, and He merges day into night, and verily it is Allah Who hears and sees (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah merges the night into the day, and He merges the day into the night. And verily, Allah is All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah causes the night to enter into the day, and the day enter into the night. Allah is the Hearer and the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God merges the night into the day, and He merges the day into the night, and because God is Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah causes the night to enter the day and causes the day to enter the night and because Allah is Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:61] That, help, is because God makes the night pass into the day and makes the day pass into the night, that is to say, He makes each enter into the other by increasing the one [and decreasing the other], which is a sign of His power, exalted be He, [the same power] that produces [His] help, and because God is Hearer, of the supplications of believers, Seer, of them, giving them faith and responding to their supplications.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) the punishment of whoever transgresses against his brother (is because Allah maketh the night to pass into the day) He makes the night longer than the day (and maketh the day to pass into the night) and makes the day longer than the night, (and because Allah is Hearer) of what His created beings say, (Seer) of their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ذلك } الغفران عند ظهور النفس في المعاقبة أو التأييد والنصر عند رعاية العدالة فيها مع الانظلام في الكرّة الثانية { بـ } سبب { أنّ الله يولج } ليل ظلمة النفس في نور نهار القلب بحركتها واستيلائها عليه\n فينبعث إلى المعاقبة { ويولج } نور نهار القلب في ظلمة النفس فيعفو\n وكل بتقديره وتصريفه قدرته { وأنّ الله سميع } لنيّاتهم { بصير } بأعمالهم\n يعاملهم على حسب أحوالهم\n { ما قدروا الله حقّ قدره } أي: ما عرفوه حق معرفته إذ نسبوا التأثير إلى غيره\n وأثبتوا وجوداً لغيره\n إذ كل عارف به لا يعرف منه إلا ما وجد في نفسه من صفاته ولو عرفوه حق معرفته لكانوا فانين فيه\n شاهدين لذاته وصفاته\n عالمين أنّ ما عداه ممكن موجود بوجوده\n قادر بقدرته لا بنفسه\n فكيف له وجود وتأثير { إنّ الله لقويّ } يقهر ما عداه بقوّة قهره فيفنيه فلا وجود ولا قوّة له { عزيز } يغلب كل شيء فلا قدرة له\n { يا أيها الذين آمنوا } الإيمان اليقيني { اركعوا } بفناء الصفات { واسجدوا } بفناء الذات { واعبدوا ربّكم } في مقام الاستقامة بالوجود الموهوب\n فإنّ من بقي منه بقية لم يمكنه أن يعبد الله حقّ عبادته إذ العبادة إنما تكون بقدر المعرفة { وافعلوا الخير } بالتكميل والإرشاد { لعلكم تفلحون } بالنجاة من وجود البقية والتلوين { وجاهدوا في الله حقّ جهاده } أي: بالغوا في المعبودية حتى لا تكون بأنفسكم وأنائيتكم وهو المبالغة في التحذير عن وجود التلوين لأن من نبض منه عرق الأنائية لم يجاهد في الله حقّ جهاده\n إذ حق الجهاد فيه هو الفناء بالكلية بحيث لا عين له ولا أثر\n وذلك هو الاجتهاد في ذاته\n { وهو اجتباكم } بالوجود الحقاني لا غيره\n فلا تلتفتوا إلى غيره بظهور أنائيتكم { وما جعل عليكم في } دينه { من حرج } من كلفة ومشقة في العبادة فإنه ما دامت النفس باقية أو يجد العابد من القلب والروح بقية ولم يستقر بنور التوحيد ولم يستحكم مقام التفريد لم يكن في العبادة روح تام وذوق عام\n ولا يخلو من حرج وضيق وكلفة ومشقة\n وإما إذا تمكن في الاستقامة\n وتصفى في المحبة التامة وجد السعة والروح\n { ملّة } أي: أعني وأخصّ ملّة { أبيكم } الحقيقي { إبراهيم } التي هي التوحيد المحض\n ومعنى أبوّته: كونه مقدّماً في التوحيد\n مفيضاً على كل موحد\n فكلهم من أولاده { هو } أي: إبراهيم\n أو الله تعالى { سمّاكم المسلمين } الذين أسلموا ذواتهم إلى الله بالفناء فيه وجعلكم علماء في الإسلام أولاً وآخراً وهو معنى قوله: { من قبل وفي هذا ليكون الرسول شهيداً عليكم } بالتوحيد\n رقيباً يحفظكم في مقامه بالتأييد حتى لا تظهر منكم بقية { وتكونوا شهداء على الناس } بتكميلهم\n مطلعين على مقاماتهم ومراتبهم\n تفيضون عليهم أنوار التوحيد إن قبلوا { فأقيموا } صلاة الشهود الذاتي فإنكم على خطر لشرف مقامكم وعزّ مرامكم { وآتوا الزكاة } بإفاضة الفيض على المستعدّين وتربية الطالبين المستبصرين فإنه شكر حالكم وعبادة مقامكم { واعتصموا } في ذلك الإرشاد { بالله } بأن لا تروه من نفسكم وتكونوا به متخلقين بأخلاقه { هو مولاكم } في مقام الاستقامة بالحقيقة وناصركم في الإرشاد بدوام الإمداد { فنِعْم المولى ونِعْم النصير } وهو الموفق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأن الله سميع } لما يقولون\n لا يشغله سمع عن سمع\n وإن اختلفت في النهار الأصوات بفُنون اللغات\n { بصير } بما يفعلون\n فلا يستتر عنه شيء بشيء في الليالي\n وإن توالت الظلمات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:6",
      "similarity": 0.8492879317506672
    },
    {
      "verse": "3:27",
      "similarity": 0.8076215742584678
    },
    {
      "verse": "31:29",
      "similarity": 0.5924476632885673
    },
    {
      "verse": "9:16",
      "similarity": 0.5856659700074524
    },
    {
      "verse": "34:2",
      "similarity": 0.5605540437321621
    }
  ]
}