{
  "chapter": "الحج",
  "text": "الله يحكم بينكم يوم القيمة فيما كنتم فيه تختلفون",
  "translations": [
    {
      "translation": "Allah will judge between you on the Day of Rising regarding everything about which you differed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will judge between you on the Day of Judgement in what you are at variance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge among you on the Day of Resurrection concerning matters about which you disagreed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will issue His decree about your differences on the Day of Judgment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge between you on the Day of Resurrection concerning what you dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge between you on the Day of Resurrection about that wherein you used to differ.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge between you on the day of resurrection respecting that in which you differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall judge between you on the Day of Resurrection touching that whereon you were at variance.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge between you on the Day of Resurrection concerning that wherein ye used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection, God will judge between you regarding your differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge between you on the Day of Judgment concerning that wherein ye have been differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge between you on the Day of Resurrection concerning that about which you used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge between you on the Day of Judgment concerning the matters in which ye differ.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge between you on the Day of Resurrection about that wherein you used to differ.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection, Allah will judge between you concerning that in which you vary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will judge between you on the Day of Resurrection regarding what you disagree about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will judge between you on the Day of Resurrection concerning that over which you used to differ.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:69] God will judge between you, O believers and disbelievers, on the Day of Resurrection concerning that wherein you used to differ’, when each of the two parties would say the opposite of what the other said.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah will judge between you on the Day of Resurrection concerning that wherein ye used to differ) regarding sacrifices and Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن ألجأتموني إلى الخصومة فـ { ٱللَّهُ } المطلع لضمائر كلا الفريقين { يَحْكُمُ بَيْنَكُمْ } وبيني { يَوْمَ ٱلْقِيَامَةِ فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ } [الحج: 69] معي من شعائر ديني وعلامة هدايتي ويقيني\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { اللهُ يحكمُ بينكم يومَ القيامةِ فيما كنتم فيه تختلفون } من أمر الدين، وهو خطاب من الله تعالى للمؤمنين والكافرين، تسلية لرسول الله صلى الله عليه وسلم مما كان يلقى منهم",
      "translations": []
    }
  ]
}