{
  "chapter": "الحج",
  "text": "ذلك ومن عاقب بمثل ما عوقب به ثم بغى عليه لينصرنه الله ان الله لعفو غفور",
  "translations": [
    {
      "translation": "That is so. And if anyone inflicts an injury the same as the one done to him and then is again oppressed, Allah will come to his aid. Allah is All-Pardoning, Ever-Forgiving.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever retaliates to the extent of injury suffered by him, and is wronged again, will certainly be helped by God. Verily God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That indeed is so, as for him who retaliates in proportion to the excess committed against him, and is thereafter again subjected to transgression, Allah will surely aid him. Verily Allah is All-Pardoning, All-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who is wronged and who retaliates by that which is equal to his suffering, God will certainly help him; He is All-pardoning and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it is; and whoever retaliates similarly to the affliction he was made to suffer, and then he is wronged again – so Allah will definitely assist him; indeed Allah is Oft Pardoning, Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so. And whoever has retaliated with the like of that which he was made to suffer, and then has again been wronged, Allah will surely help him. Verily, Allah indeed is Oft-Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (shall be so); and he who retaliates with the like of that with which he has been afflicted and he has been oppressed, Allah will most certainly aid him; most surely Allah is Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that; and whosoever chastises after the manner that he was chastised and then again is oppressed, assuredly God will help him; surely God is All-pardoning, All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (is so). And whoso hath retaliated with the like of that which he was made to suffer and then hath (again) been wronged, Allah will succour him. Lo! Allah verily is Mild, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus it shall be. As for one who retaliates to the same extent as he has suffered and then is again wronged, God will surely come to his aid. God is merciful and forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so. And whosoever Chastiseth the like of that whereby He was injured, and thereafter he hath been ogain oppressed, surely Allah will succour him: verily Allah is Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will it be; and whoever retaliates with the like of what he has been made to suffer, and is aggressed against [again] thereafter, Allah will surely help him. Indeed Allah is all-excusing, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That (is so). And if one has retaliated to no greater extent than the injury he received, and is again set upon inordinately, Allah will help him: for Allah is One that blots out (sins) and forgives (again and again).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so. And whoever has retaliated with the like of that which he was made to suffer, and then has again been wronged, Allah will surely help him. Verily! Allah indeed is Oft-Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So shall it be. He who punishes after the manner that he was punished and then again is oppressed, shall be helped by Allah. Allah is Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so! Whoever retaliates similarly to the affliction he was made to suffer, and then he is wronged again, God will definitely assist him. God is Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That [is so]. And whoever responds [to injustice] with the equivalent of that with which he was harmed and then is tyrannized - Allah will surely aid him. Indeed, Allah is Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:60] That, which We have related to you, [is so]. And whoever retaliates, [whoever] from among the believers requites, with the like of what he was made to suffer, at the hands of the idolaters wrongfully: that is whoever fights against them if they fight against him during the sacred month, and then is [again] made to suffer aggression, by them, that is to say, he is [again] wronged, by being expelled from his house, God will surely help him. Indeed God is Pardoning, to believers, Forgiving, them their engaging in combat during the sacred month.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That (is so)) that is Allah's judgement between the believers and disbelievers in the Hereafter. (And whoso hath retaliated) against the killer of his relative (with the like of that which he) his relative (was made to suffer and then hath (again) been wronged) and then he transgresses again against him, (Allah will succour him) i.e. Allah will help the wronged person against the transgressor, such that he kills him and no blood money will be taken from him. This is the case of a man whose relative is killed. And so he takes blood money from the killer of his relative. But then this man proceeds to kill the killer of his relative. This man must be killed and no blood money is accepted from him. (Lo! Allah verily is Mild) He pardons whoever repents, (Forgiving) He forgives whoever dies repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } أي: الأمر والشأن ذلك المذكور لمن هاجر إلى الله طالباً لقياه، خالصاً لوجهه الكريم { وَمَنْ عَاقَبَ } ظالمه يوماً غلب عليه، وأراد أن ينتقم عنه { بِمِثْلِ مَا عُوقِبَ بِهِ } أي: بمقدار ظلمه بلا زيادة عليه ولا نقصان { ثُمَّ بُغِيَ عَلَيْهِ } أي: غلب الظالم على المظلوم المنتقم كرة أخرى، وأراد أن يظلم عليه ثانياً { لَيَنصُرَنَّهُ ٱللَّهُ } العزيز المنتقم في الكرّة الثانية أيضاً ما لم يتجاوز عن حد الانتقام، ولا ينظر سبحانه إلى اجترائه إلى الانتقام، ويتركه ما هو الأولى وهو العفو عند القدرة، وكظم الغيظ لدى الفرصة { إِنَّ ٱللَّهَ } المطلع لمقتضيات استعداد عباده { لَعَفُوٌّ غَفُورٌ } [الحج: 60] لما صدر عنهم من المبادرة إلى الانتقام لدى القدرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ذلك }: خبر، أي: الأمر ذلك\n و { مَن عاقب }: شرط سدّ مسد جوابه، أي: من عاقب بمثل ما عُوقب به ينصره الله\n يقول الحقّ جلّ جلاله: { ذلك } أي: الأمر ذلك، كما أخبرتك في بيان الفريقين، ثم استأنف فقال: { ومن عاقب بمثل ما عُوقِبَ به } أي: لم يزد في القصاص على ما فُعل به، وسمى الابتداء عقابًا للمشاكلة ولملابسته له، من حيث إنه سبب له وهو مسبب عنه\n { ثم بُغِيَ عليه لينصُرَنَّه اللهُ } أي: من جازى بمثل ما فُعل به من الظلم، ثم ظُلم، بعد ذلك، وبُغي عليه بعد ذلك، فحق على الله أن ينصره { إِنَّ الله لعفوٌّ } يمحو آثار الذنوب، { غفورٌ } يستر أنواع العيوب\n ومناسبة الوصفين لما قبلهما: أن المعاقب مأمور بالعفو من عند الله، بقوله\n\n[الشورى: 40]،\n\n[الشورى: 43]، فحين لم يفعل ذلك، وانتصر لنفسه، فكأنه مُذنب، فمعنى العفو في حقه أنه لا يلزمه على ترك الفضل شيء، وأنه ضامن لنصره في الكرة الثانية، إذا ترك العفو وانتقم من الباغي عليه، وعَرَّضَ، مع ذلك، بما كان أولى به من العفو بذكر هاتين الصفتين\n  ثم ذكر دلائل قدرته على النصر وغيره بقوله: { ذلك بأن الله يُولج الليلَ في النهار ويُولجُ النهارَ في الليل وأنَّ الله سميع بصيرٌ } أي: ذلك النصر للمظلوم بسبب أنه قادر على ما يشاء\n ومن آيات قدرته أنه { يُولجُ الليلَ في النهار ويُولجُ النهارَ في الليل } أي: يُدخل أحدهما في الآخر، فيدخل الليلَ في النهارِ إذا طال النهار، ويُدخل النهارَ في الليل إذا طال الليلُ، فيزيد في أحدهما ما ينقص من الآخر\n أو بسبب أنه خالق الليل والنهار ومصرفهما، بإدخال أحدهما على الآخر، فلا يخفى عليه ما يجري فيهما على أيدي عباده من الخير والشر، والبغي والإنصاف",
      "translations": []
    }
  ]
}