{
  "chapter": "الحج",
  "text": "لكل امة جعلنا منسكا هم ناسكوه فلا ينزعنك فى الامر وادع الى ربك انك لعلى هدى مستقيم",
  "translations": [
    {
      "translation": "We have appointed for every nation a rite that they observe, so let them not dispute with you about the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have determined for each community a way of worship which they follow. So they should not contend with you in this matter; and you should go on calling them to your Lord. You are surely on the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every people We have prescribed a way of worship which they follow. So, (O Muhammad), let them not dispute with you concerning this, and call them to Your Lord. You are certainly on the Straight Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We enjoined every nation with certain worship acts which they perform. The unbelievers must not dispute with you about the manner of your worship. Invite them to follow the right path of the Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For each nation We have made the rules of worship for them to follow – so never should they quarrel with you in this matter – and call them towards your Lord; indeed you are upon the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation We have made Mansak which they must follow; so let them not dispute with you on the matter, but invite them to your Lord. Verily, you indeed are on the straight guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every nation We appointed acts of devotion which they observe, therefore they should not dispute with you about the matter and call to your Lord; most surely you are on a right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed for every nation a holy rite that they shall perform. Let them not therefore wrangle with thee upon the matter, and do thou summon unto thy Lord; surely thou art upon a straight guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto each nation have We given sacred rites which they are to perform; so let them not dispute with thee of the matter, but summon thou unto thy Lord. Lo! thou indeed followest right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed for every community ways of worship to observe. Let them not dispute with you on this matter. Call them to the path of your Lord -- for surely, you are rightly guided --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto every community We have appointed a rite which they perform. Let them not therefore contend with thee in the affair; and call them thou unto thy Lord, verily thou art on true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation We have appointed rites [of worship] which they observe; so let them not dispute with you concerning your religion, and invite to your Lord. Indeed, you are on a straight guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every People have We appointed rites and ceremonies which they must follow: let them not then dispute with thee on the matter, but do thou invite (them) to thy Lord: for thou art assuredly on the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation We have ordained religious ceremonies [e.g. slaughtering of the beast of cattle during the three days of stay at Mina (Makkah) during the Hajj (pilgrimage)] which they must follow; so let them (pagans) not dispute with you on the matter (i.e. to eat of the cattle which you slaughter, and not to eat of cattle which Allah kills by its natural death), but invite them to your Lord. Verily! You (O Muhammad SAW) indeed are on the (true) straight guidance. (i.e. the true religion of Islamic Monotheism).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation We have appointed a Holy Rite which they shall perform. Do not let them dispute with you concerning the matter. Call to your Lord; surely, you are upon a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every congregation We have appointed acts of devotion, which they observe. So do not let them dispute with you in this matter. And invite to your Lord; you are upon a straight guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every religion We have appointed rites which they perform. So, [O Muhammad], let the disbelievers not contend with you over the matter but invite them to your Lord. Indeed, you are upon straight guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:67] For every community We have appointed a [holy] rite (read mansakan or mansikan) a [Holy] Law, which they are to observe, which they are to implement. So do not let them dispute with you, the intended meaning is ‘do not dispute with them’, about the matter, namely, the matter of the slaughter animal, when they said, ‘What God has killed is worthier for you to eat than what you killed’; but summon [people] to your Lord, [to] His religion. Indeed you follow a straight guidance, [a straight] religion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto each nation) unto the adherents of each religion (have We given sacred rites) places where to immolate sacrifices; it is also said that this means: places of worship (which they are to perform) according to their religion; (so let them not dispute with thee) let them not go against you nor prevent you (of the matter) regarding the matter of immolated sacrifices and the divine Oneness of Allah, (but summon thou unto thy Lord) call for the profession of Allah's divine Oneness. (Lo! thou indeed follow right guidance) you indeed follow an established religion with which Allah is pleased: the religion of Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن جملة إنعامنا عليه إنا { لِّكُلِّ أُمَّةٍ } من الأمم { جَعَلْنَا } أي: عيَّنا وهيأنا { مَنسَكاً } معيناً ومقصداً مخصوصاً { هُمْ نَاسِكُوهُ } أي: ينكسون ويتقربون فيه إلينا بالقرابين والهدايا { فَلاَ يُنَازِعُنَّكَ } يا أكمل الرسل { فِي ٱلأَمْرِ } الذي كنت عليه من الذبح وغيره من الشعائر المتعلقة بأمور الدين، ومعالم الهدى واليقين { وَٱدْعُ إِلَىٰ } توحيد { رَبِّكَ } حسبما أُمرت { إِنَّكَ } في دعوتك إلى الحق { لَعَلَىٰ هُدًى مُّسْتَقِيمٍ } [الحج: 67] أي: طريق واضح سويّ موصل إلى التوحيد الذاتي بلا عوج وانحراف\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { لكل أمةْ } من الأمم الخالية والباقية { جعلنا } أي: وضعنا، وعَيَّنا { منسَكًا }: شريعة خاصة يتمسكون بها، أي: عيّنا كل شريعة لأمة معينة من الأمم، بحيث لا تتخطى أمة منهم شريعتها المعينة لها إلى شريعة أخرى، لا استقلالاً ولا اشتراكًا، فكل جيل لهم شرع مخصوص، { هم ناسكوه }: عاملون به، فالأمة التي كانت من مبعث موسى إلى مبعث عيسى - عليهما السلام - منسكهم التوراة، هم عاملون به لا غيرهم\n والتي كانت من مبعث عيسى عليه السلام إلى مبعث النبي صلى الله عليه وسلم منسكهم الإنجيل، هم ناسكوه وعاملون به\n وأما الأمة الموجودة عند مبعث النبي - عليه الصلاة والسلام - ومن بعدهم إلى يوم القيامة فهم أمة واحدة، منسكهم القرآن، ليس إلا\n والفاء في قوله: { فلا ينازعنك في الأمر } لترتيب ما بعدها على ما قبلها فإن تعيين كل أمة بشرع مخصوص، يجب اتباعه، يُوجب اتباع هؤلاء الموجودين لرسول الله صلى الله عليه وسلم وعدم منازعتهم له في أمر الدين، أي: فلا يجادلنك في أمر الدين، بل يجب عليهم الاستسلام والانقياد لكل أمر ونهي\n أو: فلا تلتفت إلى قولهم، ولا تمكنهم من أن ينازعوك في الأمر، أي: أمر الدين أو أمر الذبائح\n قيل: نزلت حين قال المشركون للمسلمين: ما لكم تأكلون ما قتلتم، ولا تأكلون ما قتله الله؟ يعني: الميتة، فأمر الله بالغيبة عنهم، وعدم الالتفات إلى قولهم\n { وادعُ إلى ربك } أي: دم على الدعاء إلى الله، والتمسك بدينه القويم { إِنك لعلى هُدىً مستقيم }: طريق قويم موصل إلى الحق",
      "translations": []
    }
  ]
}