{
  "chapter": "الحج",
  "text": "الم تر ان الله سخر لكم ما فى الارض والفلك تجرى فى البحر بامره ويمسك السماء ان تقع على الارض الا باذنه ان الله بالناس لرءوف رحيم",
  "translations": [
    {
      "translation": "Do you not see that Allah has made everything on the earth subservient to you and the ships running upon the sea by His command? He holds back the heaven, preventing it from falling to the earth - except by His permission. Allah is All-Compassionate to mankind, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see God has harnessed all that is in the earth, to your service? And the boats ply in the ocean by His command. He holds the sky in position lest it should fall upon the earth save by His dispensation. Verily God is compassionate and kind to men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how Allah has subjected to you all that is in the earth, and the vessels that sail in the sea by His command, and it is He Who holds back the sky that it may not fall on earth except by His leave? Surely Allah is Most Gentle, Ever Compassionate to people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God, through His command, has made all that is in the earth and the ships that sail on the sea subservient to you? He prevents the sky from falling on the earth unless He decides otherwise. God is Compassionate and Merciful to mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see that Allah has given in your control all that is in the earth – and the ship that moves upon the sea by His command? And He restricts the heavens that it may not fall on to the earth except by His command; indeed Allah is Most Compassionate, Most Merciful upon mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah has subjected to you all that is on the earth, and the ships that sail through the sea by His command He withholds the heaven from falling on the earth except by His leave. Verily, Allah is for mankind, full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has made subservient to you whatsoever is in the earth and the ships running in the sea by His command? And He withholds the heaven from falling on the earth except with His permission; most surely Allah is Compassionate, Merciful to men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how that God has subjected to you all that is in the earth and the ships to run upon the sea at His commandment, and He holds back heaven lest it should fall upon the earth, save by His leave? Surely God is All-gentle to men, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how Allah hath made all that is in the earth subservient unto you? And the ship runneth upon the sea by His command, and He holdeth back the heaven from falling on the earth unless by His leave. Lo! Allah is, for mankind, Full of Pity, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see, how God has subjected everything on the earth to you, and the ships that sail on the sea by His command. He holds back the sky from falling down on the earth, except with His permission. God is most compassionate and most merciful to mankind --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not that Allah hath subjected to Himself for you whatsoever is on the earth and the ships running in the sea by His command? And He with holdeth the heaven that it fall not on the earth save by His leave. Verily Allah is, unto mankind, Clement, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded that Allah has disposed for you [r benefit] whatever there is in the earth, and [that] the ships sail at sea by His command, and He sustains the sky lest it should fall on the earth, excepting [when it does so] by His leave? Indeed Allah is most kind and merciful to mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not that Allah has made subject to you (men) all that is on the earth, and the ships that sail through the sea by His Command? He withholds the sky (rain) from failing on the earth except by His leave: for Allah is Most Kind and Most Merciful to man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah has subjected to you (mankind) all that is on the earth, and the ships that sail through the sea by His Command? He withholds the heaven from falling on the earth except by His Leave. Verily, Allah is, for mankind, full of Kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has subjected to you all that is on the earth, and the ships which run upon the sea by His command? He holds the sky back lest it should fall upon the earth except by His permission. Allah is Gentle to people, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that God made everything on earth subservient to you? How the ships sail at sea by His command? That He holds up the sky lest it falls on earth—except by His permission? God is Gracious towards the people, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah has subjected to you whatever is on the earth and the ships which run through the sea by His command? And He restrains the sky from falling upon the earth, unless by His permission. Indeed Allah, to the people, is Kind and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:65] Have you not seen, realised, that God has disposed for you all that is in the earth, of beasts, and [that] the ships run upon the sea, for transport and to carry loads, by His command, by His leave, and He holds back the heaven lest it should fall on the earth, save [when it may do so] by His leave, and you are destroyed. Surely God is, with mankind, Gentle, Merciful, in disposing [things for them] and holding [others] back [from them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَلَمْ تَرَ أَنَّ اللَّهَ سَخَّرَ لَكُمْ مَا فِي الْأَرْضِ وَالْفُلْكَ تَجْرِي فِي الْبَحْرِ بِأَمْرِهِ وَيُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الْأَرْضِ إِلَّا بِإِذْنِهِ إِنَّ اللَّهَ بِالنَّاسِ لَرَءُوفٌ رَحِيمٌ (65)هذا من نسق التذكير بنعم الله واقع موقه قوله { ألم تر أن الله أنزل من السماء ماء فتصبح الأرض مخضرة } \\[ الحج : 63 \\] ، فهو من عداد الامتنان والاستدلال ، فكان كالتكرير للغرض ، ولذلك فصلت الجملة ولم تعطف . وهذا تذكير بنعمة تسخير الحيوان وغيره . وفيه إدماج الاستدلال على انفراده بالتسخير . والتقدير : فهو الرب الحق .وجملة { ألم تر أن الله سخر لكم ما في الأرض } مستأنفة كجملة { ألم تر أن الله أنزل من السماء ماء } \\[ الحج : 63 \\].والخطاب هنا والاستفهام كلاهما كما في الآية السابقة .والتسخير : تسهيل الانتفاع بدون مانع وهو يؤذن بصعوبة الانتفاع لولا ذلك التسخير ، وأصله تسهيل الانتفاع بما فيه إرادة التمنع مثل تسخير الخادم وتسهيل استخدام الحيوان الداجن من الخيل ، والإبل ، والبقر ، والغنم ونحوها بأن جعل الله فيها طبع الخوف من الإنسان مع تهيئتها للإلف بالإنسان ، ثم أطلق على تسهيل الانتفاع بما في طبعه أو في حاله ما يُعذّر الانتفاع به لولا ما ألهم الله إليه الإنسان من وسائل التغلّب عليها بتعرف نواميسه وأحواله وحركاته وأوقات ظهوره ، وبالاحتيال على تملكه مثل صيد الوحش ومغاصات اللؤلؤ والمرجان ، ومثل آلات الحفر والنقر للمعادن ، ومثل التشكيل في صنع الفلك والعَجل ، ومثل التركيب والتصهير في صنع البواخر والمزجيات والصياغة ، ومثل الإرشاد إلى ضبط أحوال المخلوقات العظيمة من الشمس والقمر والكواكب والأنهار والأودية والأنواء والليل والنهار ، باعتبار كون تلك الأحوال تظهر على وجه الأرض ، وما لا يحْصَى مما ينتفع به الإنسان مما على الأرض فكل ذلك داخل في معنى التسخير .وقد تقدم القول في التسخير آنفاً في هذه السورة . وتقدّم في سورة الأعراف وسورة إبراهيم وغيرهما ، وفي كلامنا هنا زيادة إيضاح لمعنى التسخير .وجملة { تجري في البحر بأمره } في موضع الحال من { الفلك } وإنما خصّ هذا بالذكر لأن ذلك الجري في البحر هو مظهر التسخير إذ لولا الإلهام إلى صنعها على الصفة المعلومة لكان حظها من البحر الغَرق .وقوله { بأمره } هو أمر التكوين إذ جعل البحر صالحاً لحملها ، وأوحى إلى نوح عليه السلام معرفة صنعها ، ثم تتابع إلهام الصناع لزيادة اتقانها .والإمساك : الشدّ ، وهو ضد الإلقاء . وقد ضُمّن معنى المنع هنا وفي قوله تعالى : { إن الله يُمسك السماوات والأرض أن تزولا } \\[ فاطر : 41 \\] فيقدر حرف جر لتعدية فعل الإمساك بعد هذا التضمين فيقدر ( عن ) أو ( من ).ومناسبة عطف إمساك السماوات على تسخير ما في الأرض وتسخير الفلك أن إمساك السماء عن أن تقع على الأرض ضرب من التسخير لما في عظمة المخلوقات السماوية من مقتضيات تغلّبها على المخلوقات الأرْضية وحطْمِها إياها لولا ما قدر الله تعالى لكل نوع منها من سُنن ونُظم تمنع من تسلط بعضها على بعض ، كما أشار إليه قوله تعالى : { لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار وكل في فلك يسبحون }\\[ يس : 40 \\]. فكما سخّر الله للناس ما ظهر عل وجه الأرض من موجودات مع ما في طبع كثير منها من مقتضيات إتلاف الإنسان ، وكما سخّر لهم الأحوال التي تبدو للناس من مظاهر الأفق مع كثرتها وسعتها وتباعدها ، ومع ما في تلك الأحوال من مقتضيات تعذرّ الضبط ، كذلك سخّر لمصلحة الناس ما في السماوات من الموجودات بالإمساك المنظم المنوط بما قدره الله كما أشار إليه قوله { إلا بإذنه } أي تقديره .ولفظ { السماء } في قوله : { ويمسك السماء } يجوز أن يكون بمعنى ما قابل الأرض في اصطلاح الناس فيكون كُلاً شاملاً للعوالم العلوية كلها التي لا نحيط بها علماً كالكواكب السيّارة وما الله أعلم به وما يكشفه للناس في متعاقب الأزمان .ويكون وقوعها على الأرض بمعنى الخرور والسقوط فيكون المعنى : أن الله بتدبير علمه وقدرته جعل للسماء نظاماً يمنعها من الخرور على الأرض ، فيكون قوله { ويمسك السماء } امتناناً على الناس بالسلامة مما يُفسد حياتهم ، ويكون قوله { إلا بإذنه } احتراساً جمعاً بين الامتنان والتخويف ، ليكون الناس شاكرين مستزيدين من النعم خائفين من غضب ربّهم أن يأذن لبعض السماء بالوقوع على الأرض . وقد أشكل الاستثناء بقوله { إلا بإذنه } فقيل في دفع الإشكال : إن معناه إلا يوم القيامة يأذن الله لها في الوقوع على الأرض . ولكن لم يرد في الآثار أنه يقع سُقوط السماء وإنما ورد تشقق السماء وانفطارها . وفيما جعلنا ذلك احتراساً دفع للإشكال لأن الاحتراس أمر فرضي فلا يقتضي الاستثناء وقوع المستثنى .ويجوز أن يكون لفظ { السّماء } بمعنى المطر ، كقول معاوية بن مالك :إذا نزَل السماء بأرض قوم ... رعيناه وإن كانوا غضاباوقول زيد بن خالد الجهني في حديث «الموطأ» : «صلّى بنا رسول الله صلى الله عليه وسلم يوم الحديبية على إثْر سَماء كانت من اللّيل» ، فيكون معنى الآية : أن الله بتقديره جعل لنزول المطر على الأرض مقادير قَدّر أسبابها ، وأنه لو استمر نزول المطر على الأرض لتضرّر الناس فكان في إمساك نزوله باطّراد منة على الناس ، وكان في تقدير نزوله عند تكوين الله إياه منة أيضاً . فيكون هذا مشتملاً على ذكر نعمتين : نعمة الغيث ، ونعمة السلامة من طغيان المياه .ويجوز أن يكون لفظ السماء قد أطلق على جميع الموجودات العلوية التي يشملها لفظ { السماء } الذي هو ما علا الأرض فأطلق على ما يحويه ، كما أطلق لفظ الأرض على سكانها في قوله تعالى : { أو لم يروا أنا نأتي الأرض ننقصها من أطرافها } \\[ الرعد : 41 \\]. فالله يُمسك ما في السماوات من الشهب ومن كريات الأثير والزمهرير عن اختراق كرة الهواء ، ويمسك ما فيها من القُوى كالمطر والبرَد والثلج والصواعق من الوقوع على الأرض والتحكك بها إلا بإذن الله فيما اعتاد الناس إذنه به من وقوع المطر والثلج والصواعق والشهب وما لم يعتادوه من تساقط الكواكب .فيكون موقع { ويمسك السماء } بعد قوله تعالى : { والفلك تجري في البحر بأمره } كموقع قوله تعالى : { الله الذي سخر لكم البحر لتجري الفلك فيه بأمره ولتبتغوا من فضله ولعلكم تشكرون وسخر لكم ما في السماوات وما في الأرض جميعاً منه } في \\[ سورة الجاثية : 12 - 13 \\].ويكون في قوله { إلا بإذنه } إدماجاً بين الامتنان والتخويف : فإن من الإذن بالوقوع على الأرض ما هو مرغوب للناس ، ومنه ما هو مكروه ، وهذا المحمل الثالث أجمع لما في المحملين الأخرين وأوجز ، فهو لذلك أنسب بالإعجاز .والاستثناء في قوله : { إلا بإذنه } استثناء من عموم متعلقات فعل { يمسك } وملابسات مفعوله وهو كلمة { السماء } على اختلاف محامله ، أي يمنع ما في السماء من الوقوع على الأرض في جميع أحواله إلا وقوعاً ملابساً لإذن من الله : هذا ما ظهر لي في معنى الآية .وقال ابن عطيّة : «يحتمل أن يعود قوله { إلا بإذنه } على الإمساك لأن الكلام يقتضي بغير عَمَد ( أي يدل بدلالة الاقتضاء على تقدير هذا المتعلق أخذاً من قوله تعالى : { بغير عمد ترونها } \\[ الرعد : 2 \\] ونحوه فكأنه أراد : إلا بإذنه فيمسكها» اه . يريد أن حرف الاستثناء قرينة على المحذوف .والإذن حقيقته : قول يُطلب به فعل شيء ، واستعير هنا للمشيئة والتكوين ، وهما متعلّق الإرادة والقدرة .وقد استوعبت الآية العوالم الثلاثة : البرّ ، والبحر ، والجوّ .وموقع جملة { إن الله بالناس لرؤوف رحيم } موقع التعليل للتسخير والإمساككِ باعتبار الاستثناء لأن في جميع ذلك رأفة بالناس بتيسير منافعهم الذي في ضمنه دفع الضر عنهم .والرؤوف : صيغة مبالغة من الرأفة أو صفة مشبهة ، وهي صفة تقتضي صرف الضر .والرّحيم : وصف من الرحمة ، وهي صفة تقتضي النفع لمحتاجه . وقد تتعاقب الصفتان ، والجمع بينهما يفيد ما تختص به كل صفة منهما ويؤكد ما تجتمعان عليه .\n\n",
      "translations": [
        {
          "translation": "371 (Hast thou not seen) have you not, Muhammad, been informed in the Qur'an (how Allah hath made all that is in the earth) of trees and beasts (subservient unto you? And the ships runneth upon the sea by His command) by His leave, (and He holdeth back) and He prevents (the heaven from falling on the earth unless by His leave) that is until the Day of Judgement. (Lo! Allah is, for mankind) for the believers, (Full of Pity, Merciful).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ من شأنها الوقوع لولا إمساكه سبحانه إياها { إِلاَّ } أن تقع عليها { بِإِذْنِهِ } تعالى وتعلق مشيئته بوقوعها\n وذلك يوم القيامة { إِنَّ ٱللَّهَ } المدبر لمصالح عباده { بِٱلنَّاسِ } المجبولين على الكفران والنسيان { لَرَءُوفٌ } مشفق عطوف { رَّحِيمٌ } [الحج: 65] لهم يعفو عنهم زلتهم\n ويرزقهم من حيث لا يحتسب\n\n\n{ وَ } كيف لا يرحكمكم ولا يرأف عليكم سبحانه { هُوَ ٱلَّذِيۤ أَحْيَاكُمْ } في النشأة الأولى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويُمسكُ السماء أن تقعَ على الأرض } أي: يحفظها من السقوط\n بأن خلقها على هيئة متداعية إلى الاستمساك\n { إِلا بإِذنه }: إلا بمشيئته\n وذلك يوم القيامة\n وفيه رد لاستمساكها بذاتها فإنها مساوية لسائر الأجسام في الجسمية\n فتكون قابلة للميل الهابط قبُولَ غيرها\n { إِنَّ الله بالناس لرؤوفٌ رحيمٌ } حيث هيأ لهم هذه الأسباب لقيام معاشهم\n وفتح لهم أبواب المنافع\n ودفع عنهم أنواع المضار\n فأوضح لهم مناهج الاستدلال بالآيات التكوينية والتنزيلية\n فله الحمد وله الشكر\n الإشارة: ألم تر أن الله أنزل من سماء المعاني ماء علم الغيوب\n وهو علم أسرار الذات وأنوار الصفات\n أعني: التوحيد الخاص\n فإذا نزل على أرض النفوس\n اهتزت وربت\n واخضرت بالعلوم والمعارف\n إن الله لطيف خبير\n لطيف لسريان معانيه اللطيفة في كل شيء\n خبير ببواطن كل شيء\n فمن كوشف بلطيف معانيه وإحاطة علمه في كل شيء\n وبكل شيء\n حيي قلبه بمعرفة الله\n واخضرت أرض نفسه بأنواع العلوم والمعارف\n ألم تر أن الله سخر لكم ما في الأرض\n يكون عند أمركم ونهيكم\n وفلك الفكرة تجري في بحر التوحيد بأمره\n ويُمسك سماء الأرواح أن تقع على أرض الحظوظ إلا بإذنه\n بعد الرسوخ في معرفته\n والتمكين من الفهم عنه\n إن الله بالناس لرؤوف رحيم حيث فتح لهم باب العلوم\n وهيأ لهم أسباب الفهوم\n وهي الرياضة والتأديب\n ثمَّ ذكر دليلاً آخر على قدرته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:12",
      "similarity": 0.48634568189207417
    },
    {
      "verse": "14:32",
      "similarity": 0.45354870564782174
    },
    {
      "verse": "31:31",
      "similarity": 0.41610424603635454
    },
    {
      "verse": "16:47",
      "similarity": 0.39220627060747076
    },
    {
      "verse": "24:20",
      "similarity": 0.39171721084773253
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}