{
  "chapter": "الحج",
  "text": "ويعبدون من دون الله ما لم ينزل به سلطنا وما ليس لهم به علم وما للظلمين من نصير",
  "translations": [
    {
      "translation": "They worship besides Allah something for which no authority has come down, something about which they have no knowledge. There is no helper for the wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they worship in place of God that for which no authority has been sent to them, and of which they have no knowledge. The wicked will have none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Instead of Allah they worship those concerning whom He has revealed no sanction and concerning whom they have no true knowledge. None shall be able to help such evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship things instead of God that have received no authority (from the heavens) nor have they any knowledge of such authority. The unjust people will have no one to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship those instead of Allah regarding whom He has not sent down any proof, and those regarding whom they themselves do not have any knowledge; and there are no supporters for the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship besides Allah others for which He has sent down no authority, and of which they have no knowledge; and for the wrongdoers there is no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they serve besides Allah that for which He has not sent any authority, and that of which they have no knowledge; and for the unjust there shall be no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They serve, apart from God, that whereon He has sent down never authority and that whereof they have no knowledge; and for the evildoers there shall be no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship instead of Allah that for which He hath sent down no warrant, and that whereof they have no knowledge. For evil-doers there is no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet instead of God, they worship something for which God has sent no authority and about which they have no knowledge. The wrongdoers will have no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship, beside Allah, that for which He hath revealed no authority and that whereof they have no knowledge; and for the wrong-doers there shall not be a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship besides Allah that for which He has not sent down any authority, and of which they have no knowledge. The wrongdoers will have no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they worship, besides Allah, things for which no authority has been sent down to them, and of which they have (really) no knowledge: for those that do wrong there is no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship besides Allah others for which He has sent down no authority, and of which they have no knowledge and for the Zalimun (wrong-doers, polytheists and disbelievers in the Oneness of Allah) there is no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they worship that for which He did not send down authority, and that of which they have no knowledge. Indeed, the harmdoers shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they worship, besides God, things for which He sent down no warrant, and what they have no knowledge of. There is no savior for the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they worship besides Allah that for which He has not sent down authority and that of which they have no knowledge. And there will not be for the wrongdoers any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:71] And they, the idolaters, worship besides God that, namely, idols, for which He has never revealed any warrant, [any] definitive proof, and that of which they have no knowledge, [when they claim] that these are gods. And those who do evil, by way of [practising] idolatry, shall have no helper, to protect them against God’s chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they) the disbelievers of Mecca (worship instead of Allah that for which no warrant has been revealed unto them) without any Scripture or pretext, (and that whereof they have no knowledge) proof or clarification. (For evil-doers) for idolaters (there is no helper) to save them from Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هو بسبب إنكارهم إحاطة علم الله { يَعْبُدُونَ مِن دُونِ ٱللَّهِ } المستحق للعبادة بالاستحقاق { مَا لَمْ يُنَزِّلْ بِهِ سُلْطَاناً } أي: أصناماً وأوثاناً\n لم ينزل سبحانه على استحقاقهم العبادة برهاناً من عند الله ليكون لهم حجة دالة على مدَّعاهم { وَ } أيضاً يعبدون { مَا لَيْسَ لَهُمْ بِهِ عِلْمٌ } أي: دليلُ عقلي دالُ على لياقتها واستحقاقها للعبادة والانقياد\n بل يعبدونها ظلماً وزوراً بلا مستند عقلي ونقلي { وَمَا لِلظَّالِمِينَ } المتجاوزين عن مقتضى العقل والنقل { مِن نَّصِيرٍ } [الحج: 71] ينصرهم ويستدفع عنه عذاب الله\n أو يستشفع لهم عنده سبحانه بتخفيفه عنهم\n\n\n{ وَ } من غاية ظلمهم وخروجهم عن حدود العقل والنقل { إِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا } الدالة على توحيد ذاتنا وكمال أسمائنا وصفاتنا مع كونها { بَيِّنَاتٍ } واضحات الدلالات { تَعْرِفُ } وتبصر أيها الرائي { فِي وُجُوهِ ٱلَّذِينَ كَفَرُواْ } بها { ٱلْمُنْكَرَ } أي: علامات الإنكار\n وأمارات العتو والاستكبار\n بحيث ترونهم من شدة شكيمتهم وغيظهم المفرط { يَكَادُونَ } ويقربون { يَسْطُونَ } يبطشون ويأخذون { بِٱلَّذِينَ يَتْلُونَ عَلَيْهِمْ آيَٰتِنَا } هم: النبي صلى الله عليه وسلم وأصحابه غيظاً عليهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويعبدونَ من دون الله } أي: متجاوزين إياه\n مع ظهور دلائل عظمته وقدرته وتوحيده\n { ما لم يُنزل به سلطانًا }: حجة وبرهانًا\n { وما ليس لهم به علمٌ } أي: وما ليس لهم بجواز عبادته علم من ضرورة أو استدلال\n أي: لم يتمسكوا في عبادتهم لها ببرهان سماوي من جهة الوحي\n ولا حملهم عليها دليل عقلي\n بل لمجرد التقليد الرديء\n { وما للظالمين من نصير } أي: وما للذين ارتكبوا مثل هذا الظلم العظيم من أحد ينصرهم\n أو يصوب مذهبَهم\n أو يدفع العذاب عنهم\n حين يعتريهم بسبب ظلمهم\n\nوالله تعالى أعلم\n الإشارة: كما اختلفت الشرائع باختلاف الملل\n اختلفت التربية باختلاف الأشخاص والأعصار\n وقد تقدم عند قوله\n[المائدة: 48]\n وجملتها ترجع إلى الهمة والحال\n وبهما كانت التربية في الصدر الأول\n فكانت الملاقاة والصحبة تكفي\n ويحصل التهذيب والتصفية وكمال المعرفة\n وذلك في زمان الصحابة والتابعين إلى القرن الثالث لقربهم من النور النبوي\n فلما بَعُد الأمر\n وأظلمت القلوب\n أحدثوا تربية الاصطلاح\n وهو التزيي بزي مخصوص\n كالمرقعة وحمل السبحة في العنق\n والركوة\n وغير ذلك من مسائل التجريد\n وترتيب أمور تموت بها النفوس وتعالج بها القلوب\n واستعمال أوراد مخصوصة\n فكانت التربية حينئذ بالهمة والحال والاصطلاح\n وقد تحصل التربية لمن له الهمة والحال بغير اصطلاح\n إذا رآه ينجع فيه ذلك\n فبقي الأمر كذلك إلى القرن التاسع\n فتصدى للتربية بالاصطلاح قوم مُدَّعُون\n لا همة لهم ولا حال\n فقال الحضرمي حسمًا لهذه الدعوى: قد انقطعت التربية بالاصطلاح\n وما بقي إلا الهمة والحال\n فعليكم بالكتاب والسنة\n أي: بظاهر الكتاب والسنة من غير زيادة ولا نقصان\n يعني طريق الأحوال والاصطلاح\n ومراده بذلك: قطع التربية بالاصطلاح من غير همة ولا حال\n وأما من له الهمة والحال فلا يقصد الحضرمي قطع تربيته بالاصطلاح\n والحاصل: أن الحضرمي ما حكم إلا على وقته لِمَا رأى من الفساد الذي دخل في التربية\n وقد وُجد بعده رجال مُربون بالاصطلاح مع الهمة والحال\n والمراد بالهمة: العلم بالله على نعت الشهود والعيان\n وبالحال: إنهاض القلوب عند رؤيته لذكر الله لقوله - عليه الصلاة والسلام -:\n \" خَيْرُكُمْ مَنْ إِذا رُؤوا ذُكر اللهُ \" \nولا بد من إذن خاص من الشيخ\n أو من يقوم مقامه\n وإلا فلا تنجح تربيته\n ولا ينهض حاله\n والله تعالى أعلم\n  فإن تأهلتَ للتربية بإذن خاص\n فلا ينازعنك في الأمر\n أي: لا تلفت إلى من ينازعك ويحتج عليك بانقطاع التربية تعنتًا وعنادًا\n وادع إلى ربك\n إنك لعلى هدى مستقيم\n قال القشيري: قوله: { وإن جادلوك… } الخ\n أي: كِلْهُم إلينا\n عندما راموا أمر الجدال\n ولا تتكل على ما تختاره من الاحتيال\n واحذر جنوحَ قلبك إلى الاستغاثة بالأمثال والأشكال فإنهم قوالبُ خاويةٌ\n وأشباحٌ من رؤية المعاني خالية\n هـ\n ويوم القيامة يظهر المحق من المبطل\n ويقال في شأن من يعبد هواه: { ويعبدون من دون الله… } الآية\n  ثمَّ ذكر وصفاً آخر لأهل الإنكار فقال:-",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:99",
      "similarity": 0.587133523501385
    },
    {
      "verse": "17:65",
      "similarity": 0.521528799083965
    },
    {
      "verse": "37:156",
      "similarity": 0.48757197459520113
    },
    {
      "verse": "16:100",
      "similarity": 0.48373407465475415
    },
    {
      "verse": "15:42",
      "similarity": 0.47725526047015043
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/22:71.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/22:71.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/22:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}