{
  "chapter": "الحج",
  "text": "واذا تتلى عليهم ءايتنا بينت تعرف فى وجوه الذين كفروا۟ المنكر يكادون يسطون بالذين يتلون عليهم ءايتنا قل افانبئكم بشر من ذلكم النار وعدها الله الذين كفروا۟ وبئس المصير",
  "translations": [
    {
      "translation": "When Our Signs are recited to them - Clear Signs - you can detect denial in the faces of those who are kafir. They all but assault those who recite Our Signs to them! Say: 'Shall I inform you of something worse than that? The Fire which Allah has promised those who are kafir. What an evil destination!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear messages are read out to them you can see denial on the faces of unbelievers. They can hardly restrain themselves from attacking those who recite Our revelations. Tell them: \"Should I give you news of something worse than this?\" -- Hell, which God has promised the infidels. How evil a destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Signs are plainly recited to them, you will perceive utter repugnance on their faces and it all but seems as if they will soon pounce upon those who recite Our Signs to them. Say: \"Shall I tell you what is worse than that? The Fire with which Allah has threatened those who disbelieve. That is truly an evil end.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our authoritative revelations are recited to the unbelievers, you can clearly read the dislike on their faces. They almost attack those who read Our revelations to them. Say to them, \"Should I tell you about what is the worst thing for you than these revelations? It is the fire which God has prepared for the unbelievers. What a terrible destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear verses are recited to them, you will see traces of anger in the faces of the disbelievers; possibly they may attack those who recite Our verses to them; say, “Shall I show you what is worse than your current state? That is the fire! Allah has promised it to the disbelievers; and what a wretched place to return!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear Ayat are recited to them, you will notice a denial on the faces of the disbelievers! They are nearly ready to attack with violence those who recite Our Ayat to them. Say: \"Shall I tell you of something worse than that The Fire which Allah has promised to those who disbelieved, and worst indeed is that destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear communications are recited to them you will find denial on the faces of those who disbelieve; they almost spring upon those who recite to them Our communications. Say: Shall I inform you of what is worse than this? The fire; Allah has promised it to those who disbelieve; and how evil the resort!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our signs are recited to them, clear signs, thou recognisest in the faces of the unbelievers denial; wellnigh they rush upon those who recite to them Our signs. Say: 'Shall I tell you of something worse than that? The Fire -- God has promised it to the unbelievers -- an evil homecoming!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our revelations are recited unto them, thou knowest the denial in the faces of those who disbelieve; they all but attack those who recite Our revelations unto them. Say: Shall I proclaim unto you worse than that? The Fire! Allah hath promised it for those who disbelieve. A hapless journey's end!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever Our clear revelations are recited to them, you will recognize the disgust on the faces of those who deny the truth. It is almost as if they are going to attack those who recite Our message to them. Say, \"Shall I tell you of something worse than this? It is the Fire that God has promised to those who are bent on denying the truth. What an evil destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our manifest signs are rehearsed unto them, thou recognizest repugnance on the countenaces of those who disbelieve; well- nigh they rush upon these who rehearse unto them Our Signs. Say thou: shall declare unto you something more grievous than that-the Fire--Allah hath promised it to those who disbelieve? An evil destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our manifest signs are recited to them, you perceive denial on the faces of the faithless: they would almost pounce upon those who recite Our signs to them. Say, ‘Shall I inform you about something worse than that? The Fire which Allah has promised the faithless, and it is an evil destination.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Clear Signs are rehearsed to them, thou wilt notice a denial on the faces of the Unbelievers! they nearly attack with violence those who rehearse Our Signs to them. Say, \"Shall I tell you of something (far) worse than these Signs? It is the Fire (of Hell)! Allah has promised it to the Unbelievers! and evil is that destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Verses are recited to them, you will notice a denial on the faces of the disbelievers! They are nearly ready to attack with violence those who recite Our Verses to them. Say: \"Shall I tell you of something worse than that? The Fire (of Hell) which Allah has promised to those who disbelieve, and worst indeed is that destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear verses are recited to them, you will recognize denial upon the faces of the unbelievers. They nearly rush upon those who recite Our verses to them. Say: 'Shall I tell you what is worse than that' The Fire which Allah has promised those who disbelieve an evil arrival'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Verses are recited to them, you will recognize disgust on the faces of those who disbelieve. They nearly assault those who recite to them Our Verses. Say, “Shall I inform you of something worse than that? The Fire! God has promised it to those who disbelieve. And what a wretched outcome!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to them as clear evidences, you recognize in the faces of those who disbelieve disapproval. They are almost on the verge of assaulting those who recite to them Our verses. Say, \"Then shall I inform you of [what is] worse than that? [It is] the Fire which Allah has promised those who disbelieve, and wretched is the destination.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:72] And when Our signs, in the Qur’ān, are recited to them, [though they are] clear, manifest, signs (bayyinātin, a circumstantial qualifier) you perceive on the faces of those who disbelieve denial, that is to say, denial of these [signs], in other words [you perceive] the effect of such [denial] in the way of aversion and frowning. They would almost pounce upon those who recite Our signs to them, that is, [they would almost] fall upon them in assault. Say: ‘Shall I inform you about something worse than that?, something more repulsive to you than the Qur’ān that is being recited to you? It is, The Fire! God has promised it to the disbelievers, in that their journey’s end shall be to it. And it is an evil journey’s end!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِذَا تُتْلَى عَلَيْهِمْ آَيَاتُنَا بَيِّنَاتٍ تَعْرِفُ فِي وُجُوهِ الَّذِينَ كَفَرُوا الْمُنْكَرَ يَكَادُونَ يَسْطُونَ بِالَّذِينَ يَتْلُونَ عَلَيْهِمْ آَيَاتِنَا قُلْ أَفَأُنَبِّئُكُمْ بِشَرٍّ مِنْ ذَلِكُمُ النَّارُ وَعَدَهَا اللَّهُ الَّذِينَ كَفَرُوا وَبِئْسَ الْمَصِيرُ (72){ وَإِذَا تتلى عَلَيْهِمْ ءاياتنا بينات تَعْرِفُ فِى وُجُوهِ الذين كَفَرُواْ المنكر يكادون يَسْطُونَ بالذين يَتْلُونَ عَلَيْهِمْ ءاياتنا }.عطف على جملة { ويعبدون من دون الله ما لم ينزل به سلطاناً } \\[ الحج : 71 \\] لبيان جُرم آخر من أجرامهم مع جُرم عبادة الأصنام ، وهو جرم تكذيب الرسول والتكذيب بالقرآن .والآيات هي القرآن لا غيره من المعجزات لقوله { وإذا تتلى عليهم }.والمنكر : إما الشيء الذي تُنكره الأنظار والنفوس فيكون هنا اسماً ، أي دلائل كراهيتهم وغضبهم وعزمهم على السوء ، وإما مصدر ميمي بمعنى الإنكار كالمُكْرم بمعنى الإكرام . والمَحْملان آيلان إلى معنى أنهم يلوح على وجوههم الغَيْظ والغضب عندما يُتلى عليهم القرآن ويُدعون إلى الإيمان . وهذا كناية عن امتلاء نفوسهم من الإنكار والغيظ حتى تجاوز أثرُه بواطنهم فظهر على وجوههم . كما في قوله تعالى : { تعرف في وجوههم نضرة النعيم } \\[ المطففين : 24 \\] كناية عن وفرة نعيمهم وفرط مسرّتهم به . ولأجل هذه الكناية عدل عن التصريح بنحو : اشتدّ غيظهم ، أو يكادون يتميزون غيظاً ، ونحو قوله : { قلوبهم منكرة وهم مستكبرون } \\[ النحل : 22 \\].وتقييد الآيات بوصف البينات لتفظيع إنكارها إياها ، إذ ليس فيها ما يعذر به منكروها .والخطاب في قوله { تعرف } لكلّ من يصلح للخطاب بدليل قوله { بالذين يتلون عليهم آياتنا }.والتعبير ب { الذين كفروا } إظهار في مقام الإضمار . ومقتضى الظاهر أن يكون { تعرف في وجوه الذين كفروا } ، أي وجوه الذين يعبدون من دون الله ما لم يُنزّل به سلطاناً ، فخولف مقتضى الظاهر للتسجيل عليهم بالإيماء إلى أن علّة ذلك هو ما يبطنونه من الكفر .والسُّطُوّ : البطش ، أي يقاربون أن يصولوا على الذين يتلون عليهم الآيات من شدّة الغضب والغيظ من سماع القرآن .{ والذين يتلون } يجوز أن يكون مراداً به النبي صلى الله عليه وسلم من إطلاق اسم الجمع على الواحد كقوله : { وقوم نوح لما كذبوا الرسل أغرقناهم } \\[ الفرقان : 37 \\] ، أي كذّبوا الرسول .ويجوز أن يراد به من يقرأ عليهم القرآن من المسلمين والرسول ، أما الذين سطوا عليهم من المؤمنين فلعلهم غير الذين قرأوا عليهم القرآن ، أو لعلّ السطو عليهم كان بعد نزول هذه الآية فلا إشكال في ذكر فعل المقاربة .وجملة { يكادون يسطون } في موضع بدل الاشتمال لجملة { تعرف في وجوه الذين كفروا المنكر } لأن الهمّ بالسطو مما يشتمل عليه المنكر .{ قُلْ أَفَأُنَبِّئُكُم بِشَرٍّ مِّن ذلكم النار وَعَدَهَا الله الذين كَفَرُواْ وَبِئْسَ المصير }استئناف ابتدائي يفيد زيادة إغاظتهم بأن أمرَ الله النبي صلى الله عليه وسلم أن يتلو عليهم ما يفيد أنهم صائرون إلى النار .والتفريع بالفاء ناشىء من ظهور أثر المنكر على وجوههم فجعل دلالة ملامحهم بمنزلة دلالة الألفاظ . ففرع عليها ما هو جواب عن كلام فيزيدهم غيظاً .ويجوز كون التفريع على التلاوة المأخوذة من قوله { وإذا تتلى عليهم آياتنا } ، أي اتل عليهم الآيات المنذرة والمبيّنة لكفرهم ، وفرع عليها وعيدهم بالنار .والاستفهام مستعمل في الاستئذان ، وهو استئذان تهكمي لأنه قد نبأهم بذلك دون أن ينتظر جوابهم .وشرّ : اسم تفضيل ، أصله أشرّ : كثر حذف الهمزة تخفيفاً ، كما حذفت في خير بمعنى أخير .والإشارة ب { ذلكم } إلى ما أثار مُنكَرهم وحفيظتهم ، أي بما هو أشد شرّاً عليكم في نفوسكم مما سمعتموه فأغضبكم ، أي فإن كنتم غاضبين لما تُلي عليكم من الآيات فازدادوا غضباً بهذا الذي أنَبّئكم به .وقوله { النّار } خبر مبتدأ محذوف دل عليه قوله { بشر من ذلكم }. والتقدير : شرّ من ذلكم النّارُ .فالجملة استئناف بياني ، أي إن سألتم عن الذي هو أشدّ شراً فاعلموا أنه النار .وجملة { وعدها الله } حال من النّار ، أو هي استئناف .والتعبير عنهم بقوله : { الذين كفروا } إظهار في مقام الإضمار ، أي وعدها الله إياكم لكفركم .{ وبئس المصير } أي بئس مصيرهم هي ، فحرف التعريف عوض عن المضاف إليه ، فتكون الجملة إنشاء ذمّ معطوفة على جملة الحال على تقدير القول . ويجوز أن يكون التعريف للجنس فيفيد العموم ، أي بئس المصير هي لمن صار إليها ، فتكون الجملة تذييلاً لما فيها من عموم الحكم للمخاطبين وغيرهم وتكون الواو اعتراضية تذييلية .\n\n",
      "translations": [
        {
          "translation": "(And when Our revelations) i.e. the Qur'an (are recited unto them) expositing to them the commands and prohibitions, (thou knowest) Muhammad (the denial) their hatred of the Qur'an (in the faces of those who disbelieve) in the Qur'an; (they all but attack) they are about to beat up and fall on (those who recite Our revelations) the Qur'an (unto them. Say) Muhammad, to the people of Mecca: (Shall I proclaim unto you worse than that) worse than what you told the Muslims in the life of this world? They said to them: \"We have seen no adherents of any religion who are less fortunate than you\". And so Allah said: Say, 372 Muhammad... Allah said: what is worse is (The Fire! Allah hath promised it for the ones who disbelieve) in Muhammad (pbuh) and in the Qur'an; and you are indeed disbelievers in Muhammad and the Qur'an. (A hapless journey's end) to which they will come!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَكَادُونَ يَسْطُونَ } معناه يَفرُطون عليهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {they almost overwhelm Him} - its meaning is that they are too much for Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وعلى ما جرى على ألسنتهم { قُلْ } يا أكمل الرسل على سبيل التوبيخ والتقريع { أَ } تنقبضون وتضجرون عن استماع هذه الآيات العظام وتتشاءمون من سماعها { فَأُنَبِّئُكُم } وأخبركم { بِشَرٍّ مِّن ذٰلِكُمُ } الآيات\n هي أشد عيظاً وأكثر تضجراً منها ألا وهي { ٱلنَّارُ } التي { وَعَدَهَا ٱللَّهُ ٱلَّذِينَ كَفَرُواْ } بسبب كفرهم وضلالهم { وَبِئْسَ ٱلْمَصِيرُ } [الحج: 72] النار لأصحاب الضلال والإنكار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { وإذا تُتلى }: عطف على { يعبدون } ، وصيغة المضارع للدلالة على الاستمرار التجددي. يقول الحقّ جلّ جلاله: { وإِذا تُتلى عليهم } أي: على المشركين { آياتُنا } القرآنية، حال كونها { بيناتٍ }: واضحات الدلالة على العقائد الحقية، والأحكام الصادقة، { تعرِفُ في وجوه الذين كفروا المنكَر } أي: الإنكار بالعبوس والكراهة، فالمُنكَر: مصدر بمعنى الإنكار. { يكادون يَسطُون }: يبطشون، والسطو: الوثب والبطش، أي: يثبون على الذين { يتلُون عليهم آياتنا } من فرط الغيظ والغضب، والتالون هم: النبي صلى الله عليه وسلم وأصحابه. { قلْ } لهم: { أفأنبئُكُم بشرٍّ من ذلكم } من غيظكم على التالين وسطوكم عليهم، أو مما أصابكم من الكراهة والضجر، بسبب ما يتلى عليكم، هو { النارُ وَعَدها اللهُ الذين كفروا } مثلكم، { وبئس المصيرُ } النار، التي ترجعون إليها مخلدين. الإشارة: من شأن أهل العتو والتكبر أنهم إذا وعظهم الفقراء عنفوا واستنكفوا، ويكادون يسطون عليهم من شدة الغضب، فما قيل لكبراء الكفار يجرُ ذيله على من تشبّه بهم من المؤمنين. ولما كان دعواهم الشريك لله تعالى جارية في الغرابة والشهرة...",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:10",
      "similarity": 0.09371033339521959
    },
    {
      "verse": "24:57",
      "similarity": 0.08556697666749453
    },
    {
      "verse": "57:15",
      "similarity": 0.08336928456991878
    },
    {
      "verse": "9:73",
      "similarity": 0.08320876689476958
    },
    {
      "verse": "66:9",
      "similarity": 0.08320876689476958
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022072.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022072.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:72.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}