{
  "chapter": "الحج",
  "text": "يايها الناس ضرب مثل فاستمعوا۟ له ان الذين تدعون من دون الله لن يخلقوا۟ ذبابا ولو اجتمعوا۟ له وان يسلبهم الذباب شيـا لا يستنقذوه منه ضعف الطالب والمطلوب",
  "translations": [
    {
      "translation": "Mankind! an example has been made, so listen to it carefully. Those whom you call upon besides Allah are not even able to create a single fly, even if they were to join together to do it. And if a fly steals something from them, they cannot get it back. How feeble are both the seeker and the sought!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, give ear to this parable: Those you worship other than God can never create as much as a fly, even if they get together to do so; and if the fly were to rob them of a thing they would not be able to snatch it away from it. How weak the seeker and how weak the sought!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, a parable is set forth: pay heed to it. Those who call upon aught other than Allah shall never be able to create even a fly, even if all of them were to come together to do that. And if the fly were to snatch away anything from them, they would not be able to recover that from it. Powerless is the supplicant; and powerless is he to whom he supplicates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, listen to this parable: Those whom you worship instead of God do not have the power to create even a fly, even though all of them would come together for the task. If the fly was to snatch something from them they would not be able to rescue it from the fly. How feeble are such worshippers and that which they worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, an example is being illustrated therefore listen to it attentively; “Those whom you worship besides Allah can never create a fly even if they all come together for it; and if a fly took away something from them, they cannot retrieve that from it; how weak are the seeker and the sought!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! A parable has been made, so listen to it: Verily, those on whom you call besides Allah, cannot create a fly, even though they combine together for the purpose. And if the fly snatches away a thing from them, they will have no power to release it from the fly. So weak are the seeker and the sought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! a parable is set forth, therefore listen to it: surely those whom you call upon besides Allah cannot create fly, though they should all gather for it, and should the fly snatch away anything from them, they could not take it back from it; weak are the invoker and the invoked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, a similitude is struck; so give you ear to it. Surely those upon whom you call, apart from God, shall never create a fly, though they banded together to do it; and if a fly should rob them of aught, they would never rescue it from him. Feeble indeed alike are the seeker and the sought!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! A similitude is coined, so pay ye heed to it: Lo! those on whom ye call beside Allah will never create a fly though they combine together for the purpose. And if the fly took something from them, they could not rescue it from it. So weak are (both) the seeker and the sought!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, here is an illustration. So listen carefully. Surely, those whom you invoke other than God cannot create even a fly, even if they were all to combine together to do it, and if a fly should snatch anything away from them, they cannot recover it from it. Both are indeed weak, the seeker and the sought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Mankind! a similitude is propounded; so hearken thereto. Verily those whom ye call upon beside Allah will by no means create a fly, even though they assembled for that; and if the fly were to snatch away aught from them, they cannot recover it from him: weak the seeker and the sought!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Listen to a parable that is being drawn: Indeed those whom you invoke besides Allah will never create [even] a fly even if they all rallied to do so! And if a fly should take away something from them, they can not recover that from it. Feeble is the seeker and the sought!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! Here is a parable set forth! listen to it! Those on whom, besides Allah, ye call, cannot create (even) a fly, if they all met together for the purpose! and if the fly should snatch away anything from them, they would have no power to release it from the fly. Feeble are those who petition and those whom they petition!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! A similitude has been coined, so listen to it (carefully): Verily! Those on whom you call besides Allah, cannot create (even) a fly, even though they combine together for the purpose. And if the fly snatched away a thing from them, they would have no power to release it from the fly. So weak are (both) the seeker and the sought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, this is a parable, listen to it. Those whom you call upon, other than Allah, could never create a fly, though they banded together to do this. And if a fly robs them of anything, they could never rescue it from it. The seeker and the sought are alike in their weakness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! A parable is presented, so listen to it: Those you invoke besides God will never create a fly, even if they banded together for that purpose. And if the fly steals anything from them, they cannot recover it from it. Weak are the pursuer and the pursued.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, an example is presented, so listen to it. Indeed, those you invoke besides Allah will never create [as much as] a fly, even if they gathered together for that purpose. And if the fly should steal away from them a [tiny] thing, they could not recover it from him. Weak are the pursuer and pursued.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:73]   O mankind, that is to say, [O] people of Mecca, a similitude is being struck, so listen to it, and it is that: truly those on whom you call, [whom] you worship, besides God, that is, other than Him, and these are the idols, will never create a fly (dhubāb is a generic noun, the singular of which is dhubāba, for both the masculine and the feminine) even if they rallied together to do so, to create it. And if a fly should take away something from them, [such as a drop] of the scents or the saffron in which they drench themselves, they would not be able to recover that from it, because of their [complete] incapacity: so how can they worship those [whom they suppose to be] partners of God, exalted be He? An odd thing — which He has expressed by striking a similitude. Feeble is the seeker, the worshipper, and the [thing] sought, the [thing] worshipped!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 mankind!) He means the people of Mecca. (A similitude is coined) He has explained the likeness of your deities, (so pay ye heed to it) and respond: (Lo! those on whom ye call beside Allah) of idols (will never create a fly) they will never be able to create a fly (though they) the worshipped and the worshippers (combine together for the purpose) they will not be able to create a fly. (And if the fly took something) like honey with which are sullied for example (from them) from the deities, (they could not rescue it from it) the deities would not be able to take it back from the fly. (So weak are (both) the seeker) i.e. the deity (and the sought) and the fly! It is also said that this means: so weak are both that which is worshipped and the worshipper.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّاسُ } الذين جبلوا على الغفلة والنيسان والجهل والطغيان عن عظمة الله وحق قدره\n لذلك أثبتُّم له أمثالاً وأشباهاً مع تعاليه وتنزهه في ذاته عنها\n اسمعوا: { ضُرِبَ مَثَلٌ } في حق شركائكم ومعبوداتكم { فَٱسْتَمِعُواْ لَهُ } سمع وتدبير وتأمل\n ثم أنصفوا { إِنَّ ٱلَّذِينَ تَدْعُونَ } وتعبدون أيها المدَّعون المكابرون { مِن دُونِ ٱللَّهِ } القادر بجميع المقدورات بالعلم التام\n والإدارة الكاملة\n والحكمة المتقنة { لَن يَخْلُقُواْ ذُبَاباً } بل لن يقدروا على خلق أحقر منها وأخس\n لا كل واحد منهم فرادى\n بل { وَلَوِ ٱجْتَمَعُواْ لَهُ } أي: لخلق الذباب وتظاهروا لإيجاده مجتمعين لن يقدروا أيضاً\n وكيف خلْقُ الذباب وإظهاره؟ { وَإِن يَسْلُبْهُمُ } ويأخذ منهم { ٱلذُّبَابُ } الحقير الضعيف { شَيْئاً } من الآلهة الباطلة من حيلهم وتزييناتهم { لاَّ يَسْتَنقِذُوهُ مِنْهُ } ولا يقدروا على أن يخرجوه من يده لعجزهم وعدم قدرتهم\n فكيف تعبدون أيها الحمقى العابدون أولئك الهلكى العاجزين الساقطين؟! فظهر للمتأمل المتدبر أنه { ضَعُفَ } أي: انحط وسقط عن زمرة العقلاء ورتبتهم { ٱلطَّالِبُ } العابد الجاهل { وَٱلْمَطْلُوبُ } [الحج: 73] المعبود المجهول المنحط عن رتبة أحقر الأشياء وأخسها فكيف عن أعلاها؟! فيكف عن خالقها وموجودها؟! تعالى عما يقول الظالمون علواً كبيراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:41",
      "similarity": 0.20913797125213598
    },
    {
      "verse": "7:54",
      "similarity": 0.15240802129796707
    },
    {
      "verse": "36:23",
      "similarity": 0.14403282935296724
    },
    {
      "verse": "39:19",
      "similarity": 0.13988071254040366
    },
    {
      "verse": "36:43",
      "similarity": 0.13021316954985296
    }
  ]
}