{
  "chapter": "الحج",
  "text": "وجهدوا۟ فى الله حق جهاده هو اجتبىكم وما جعل عليكم فى الدين من حرج ملة ابيكم ابرهيم هو سمىكم المسلمين من قبل وفى هذا ليكون الرسول شهيدا عليكم وتكونوا۟ شهداء على الناس فاقيموا۟ الصلوة وءاتوا۟ الزكوة واعتصموا۟ بالله هو مولىكم فنعم المولى ونعم النصير",
  "translations": [
    {
      "translation": "Do jihad for Allah with the jihad due to Him. He has selected you and not placed any constraint upon you in the deen - the religion of your forefather Ibrahim. He named you Muslims before and also in this, so that the and pay zakat and hold fast to Allah. He is your Protector - the Best Protector, the Best Helper.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Strive in the way of God with a service worthy of Him. He has chosen you and laid no hardship on you in the way of faith, the faith of your forbear Abraham. He named you Muslim earlier, and in this (Qur'an), in order that the Prophet be witness over you, and you be witness over mankind. So be firm in devotion, pay the zakat, and hold on firmly to God. He is your friend: How excellent a friend is He, how excellent a helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Strive in the cause of Allah in a manner worthy of that striving. He has chosen you (for His task), and He has not laid upon you any hardship in religion. Keep to the faith of your father Abraham. Allah named you Muslims earlier and even in this (Book), that the Messenger may be a witness over you, and that you may be witnesses over all mankind. So establish Prayer, and pay Zakah, and hold fast to Allah. He is your Protector. What an excellent Protector; what an excellent Helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Strive steadfastly for the Cause of God. He has chosen you but has not imposed on you hardship in your religion, the noble religion of your father, Abraham. God named you Muslims before and in this Book, so that the Messenger will witness (your actions) and will be the witness over mankind. Be steadfast in your prayer, pay the religious tax, and seek protection from God; He is your Guardian, a gracious Guardian and Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in Allah's cause as is the true manner of fighting; He has preferred you and has not kept any hardship upon you in religion; the religion of your father Ibrahim; Allah has named you Muslims – in the previous Books and in this Qur’an, so that the Noble Messenger be your guardian and witness, and you be witness against other people; therefore keep the prayer established and give charity, and hold fast to the rope of Allah; He is your Master; so what an excellent Master and what an excellent Supporter!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strive hard in Allah's cause as you ought to strive. He has chosen you, and has not laid upon you in religion any hardship: it is the religion of your father Ibrahim. He has named you Muslims both before and in this (Qur'an), that the Messenger may be a witness over you and you be witnesses over mankind! So, perform the Salah, give the Zakah and hold fast to Allah. He is your Mawla, what an Excellent Mawla and what an Excellent Helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strive hard in (the way of) Allah, (such) a striving as is due to Him; He has chosen you and has not laid upon you an hardship in religion; the faith of your father Ibrahim; He named you Muslims before and in this, that the Apostle may be a bearer of witness to you, and you may be bearers of witness to the people; therefore keep up prayer and pay the poor-rate and hold fast by Allah; He is your Guardian; how excellent the Guardian and how excellent the Helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and struggle for God as is His due, for He has chosen you, and has laid on you no impediment in your religion, being the creed of your father Abraham; He named you Muslims aforetime and in this, that the Messenger might be a witness against you, and that you might be witnesses against mankind. So perform the prayer, and pay the alms, and hold you fast to God; He is your Protector -- an excellent Protector, an excellent Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strive for Allah with the endeavour which is His right. He hath chosen you and hath not laid upon you in religion any hardship; the faith of your father Abraham (is yours). He hath named you Muslims of old time and in this (Scripture), that the messenger may be a witness against you, and that ye may be witnesses against mankind. So establish worship, pay the poor-due, and hold fast to Allah. He is your Protecting friend. A blessed Patron and a blessed Helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Strive for the cause of God as it behoves you to strive for it. He has chosen you and laid on you no burden in the matter of your religion, the faith of Abraham your forefather. In this, as in former scriptures He has given you the name of Muslims, so that the Messenger may be a witness over you, and so that you may be witnesses over mankind. Therefore, say your prayers  regularly and pay the zakat and hold fast to God. He is your master. An excellent master and an excellent helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strive hard for Allah as is due unto Him hard striving. He hath distinguished you, and hath not placed upon you any narrowness in the religion the faith of your father, Ibrahim. He hath named you Muslim aforetime and in this, that the apostle may be a witness for you, and that ye may be witnesses against mankind. Wherefore establish the prayer and'give the poor-rate, and hold fast by Allah; He is your Patron: an Excellent Patron and Excellent helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wage jihad for the sake of Allah, a jihad which is worthy of Him. He has chosen you and has not placed for you any obstacle in the religion, the faith of your father, Abraham. He named you ‘Muslims’ before, and in this, so that the Apostle may be a witness to you, and that you may be witnesses to mankind. So maintain the prayer, give the zakat, and hold fast to Allah. He is your master—an excellent master and an excellent helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strive in His cause as ye ought to strive, (with sincerity and under discipline). He has chosen you, and has imposed no difficulties on you in religion; it is the cult of your father Abraham. It is He Who has named you Muslims, both before and in this (Revelation); that the Messenger may be a witness for you, and ye be witnesses for mankind! So establish regular Prayer, give regular Charity, and hold fast to Allah! He is your Protector - the Best to protect and the Best to help!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strive hard in Allah's Cause as you ought to strive (with sincerity and with all your efforts that His Name should be superior). He has chosen you (to convey His Message of Islamic Monotheism to mankind by inviting them to His religion, Islam), and has not laid upon you in religion any hardship, it is the religion of your father Ibrahim (Abraham) (Islamic Monotheism). It is He (Allah) Who has named you Muslims both before and in this (the Quran), that the Messenger (Muhammad SAW) may be a witness over you and you be witnesses over mankind! So perform As-Salat (Iqamat-as-Salat), give Zakat and hold fast to Allah [i.e. have confidence in Allah, and depend upon Him in all your affairs] He is your Maula (Patron, Lord, etc.), what an Excellent Maula (Patron, Lord, etc.) and what an Excellent Helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Struggle for Allah as is due to Him. He has chosen you and has not laden a burden upon you in your religion, being the Creed of Abraham your father. He has named you Muslims before and in this so that the Messenger (Muhammad) can be a witness for you, and in order that you be witnesses against mankind. Therefore, establish the prayer and pay the obligatory charity and hold fast to Allah. He is your Guardian, the Excellent Guardian, the Excellent Helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strive for God, with the striving due to Him. He has chosen you, and has not burdened you in religion—the faith of your father Abraham. It is he who named you Muslims before, and in this. So that the Messenger may be a witness over you, and you may be witnesses over the people. So pray regularly, and give regular charity, and cleave to God. He is your Protector. What an excellent Protector, and what an excellent Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And strive for Allah with the striving due to Him. He has chosen you and has not placed upon you in the religion any difficulty. [It is] the religion of your father, Abraham. Allah named you \"Muslims\" before [in former scriptures] and in this [revelation] that the Messenger may be a witness over you and you may be witnesses over the people. So establish prayer and give zakah and hold fast to Allah. He is your protector; and excellent is the protector, and excellent is the helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:78] And struggle in the way of God, in order to establish His religion, a struggle worthy of Him, by expending all effort therein (haqqa is in the accusative because it is a verbal noun). He has elected you, He has chosen you for His religion, and has not laid upon you in your religion any hardship, that is, [any] constraint, for He has facilitated [adherence to] it during times of difficulty, such as [His permitting you] to shorten prayers, to seek ritual purification from earth, to eat of carrion, and to break the fast during illness or travel — the creed of your father (millata is in the accusative because the genitive preposition kāf [sc. ka-millati, ‘like the creed of’] has been omitted) Abraham (Ibrāhīma, an explicative supplement). He, that is, God, named you Muslims before, that is, before [the revelation of] this Book, and in this, that is, [in] the Qur’ān, so that the Messenger might be a witness against you, on the Day of Resurrection, that he delivered the Message to you, and that you might be witnesses against mankind, that their messengers delivered the Message to them. So maintain prayer, observe it regularly, and pay the alms, and hold fast to God, trust in Him. He is your Patron, your Helper and the Guardian of your affairs. An excellent Patron, is He, and an excellent Helper, for you. Meccan: it consists of 118 or 119 verses, revealed after [sūrat] al-Anbiyā’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And strive for Allah with the endeavour which is His right) and fulfil for Allah that which is His right. (He hath chosen you) for His religion (and hath not laid upon you in religion) in the matter of religion (any hardship) He says: whoever cannot pray standing, let him pray sitting; and whoever cannot pray sitting, let him pray lying down, just by making gestures; (the faith of your father Abraham) follow the religion of your father Abraham. (He hath named you) Allah named you (Muslims of old time) before this Qur'an, in the Scriptures of past prophets (and in this (Scripture)) i.e. the Qur'an, (that the messenger) Muhammad (pbuh) (may be a witness against you) against the disbelievers and in favour of the believers, (and that ye may be witnesses against mankind) in favour of the prophets. (So establish worship) perform the five daily prayers, by perfecting their ablutions, bowing, prostration and that which is prescribed in their appointed times, (pay the poor-due) from your wealth, (and hold fast to Allah) and hold fast to Allah's religion and Scripture. (He is your Protecting Friend. A blessed Patron) Protector (and a blessed Helper) Who will defend you!' And of the surah in which the believers are mentioned, which is all Meccan, and consists of 119 verses, 373 1,840 words and 4,800 letters: Surah 23: The Believers [al-Mu'minun) And of the surah in which the believers are mentioned, which is all Meccan, and consists of 119 verses, 1,840 words and 4,800 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وكيف لا تجاهدون وترابطون أيها المائلون إلى الله بالميل الحبّي الشوقي مع أنه { هُوَ } سبحانه { ٱجْتَبَاكُمْ } واصطفاكم من بين البرايا لإدراك توحيده والاتصاف بعرفانه\n وأرسل عليكم الرسل\n وأنزل عليكم الكتب ليرشدكم إليه\n ويبينوا لكم طريق توحيده بوضع المناهج والشرائع الموصلة إلأيه\n والأديان المثمرة له { وَمَا جَعَلَ } سبحانه { عَلَيْكُمْ فِي ٱلدِّينِ } الموضوع فيكم { مِنْ حَرَجٍ } ضيق وعسر خارج عن وسعكم وطاقتكم\n بل وسّع سبحانه عليكم أمر دينكم بأن جعل ملتكم { مِّلَّةَ أَبِيكُمْ إِبْرَاهِيمَ } صلوات الرحمن عليه\n إذ لا ضيق فيه ولا حرج\n\n\nأضاف أبوة إبراهيم إلى الأمة من أجداد الرسول صلى الله عليه وسلم\n والرسول أب لهم\n إذ رسول كلِّ أمة أ بُ ب النسبة إلى أمته\n بل هو خير الآباء\n لإرشادهم إلى طريق الحق\n ولا معنى للأب إلا المرشد المربي\n\nوكما جعل سبحانه ملتكم ملة إبراهيم { هُوَ } بذاته { سَمَّاكُمُ ٱلْمُسْلِمِينَ مِن قَبْلُ } في كتبه السالفة حيث قال سبحانه: من يؤمن ويصدق بمحمد خام النبوة والرسالة يصير مسلماً { وَفِي هَـٰذَا } الكتاب بيَّنَ التسمية على وجه التسليم فسماكم فيه أيضاً: مسلمين ضمناً\n وإنما سماكم مسلمين مسلِّمين منقادين { لِيَكُونَ ٱلرَّسُولُ } الذي هو أكمل الرسل وأفضل الأنبياء { شَهِيداً عَلَيْكُمْ } شاهداً على انقيادكم وتسليمكم في يوم الجزاء\n فتكونوا أفضل الأمم وأشرف الفرق\n وبواسطة كونكم أ مته وزمرته وتحت لوائه { وَتَكُونُواْ شُهَدَآءَ عَلَى } عموم { ٱلنَّاسِ } بتبليغ الرسالة إليهم وإظهار الدعوة لهم\n وإذا كنتم خير أمة وأشرفَ طائفة { فَأَقِيمُواْ ٱلصَّلاَةَ } وأديموا الميل والتوجه نحو الحق بجميع الجوارح والأركان تقرباً إليه شوقاً وتحنناً { وَآتُواْ ٱلزَّكَـاةَ } المسقطة لميلكم إلى زخرفة الدنيا وحطامها { وَ } بالجملة { ٱعْتَصِمُواْ بِٱللَّهِ } في كل الأحوال\n واثقينَ بفضله وجوده\n وفوضوا أمروكم كلها إليه\n متوكلين عليه { هُوَ مَوْلاَكُمْ } أي: ناصركم ومعينكم ومولّي أموركم { فَنِعْمَ ٱلْمَوْلَىٰ } الولي المعين { وَنِعْمَ ٱلنَّصِيرُ } [الحج: 78] الناصر المعين\n ذو القوة المتين\n حسبنا الله ونعم الوكيل\n\n\nخاتمة السورة\n\nعليك أيها السالك المجاهد في سبيل الله أعداءَ الله وموانعَ الوصول إلى توحيده أن تجاهد أولاً مع نفسك التي بين جنبيك\n إذ هي من أعدى عدوك\n وأشد صولة واستيلاء إلى مملكة باطنك وقلبك الذي هو مخيم سرادقات سلطان الوحدة\n ومحل نزول قهرمان العزة\n ومهبط الوحي الإلهي والوارد الغيبي\n فلك أن تزيل صولتها\n وتشتت شملها\n وتفرق جمعها التي هي جنودها وأنواعها من القوى الشهوانية والغضبية\n وجميع الأوصاف البهيمية المتداعية إلى تخريب القلب\n وتعمير النفس الأمّارة بالسوء\n وتقويتها وتقويمها\n إذ عداوتها ومنعها ذاتية حقيقية وبلا واسطة\n وعداوةُ سائر الموانع بواسطتها\n\n\nوإياك الإطاعة والانقياد إليها\n فإنها تشغلك عن الحق\n وتضلك عن سبيله وتغريك إلى الباطل وتقودك إلى طريقه\n\n\nفاعلم أيها المجاهد الطالب للغلبة على جنود النفس الأمارة أنه لا يمكن لك هذا إلا بالاعتزال عن إقطاع الشيطان ومهلكة النفس ومشتهياتها ومستلذاتها بالكلية\n والتشمر نحو الحق بالعزيمة الخالصة عن الرياء والرعونات والانخلاع عن مقتضيات الأوصاف البشرية بالإدارة الصادقة\n والتوجه نحو الوحدة الذاتية عن طريق الفناء بإسقاط الإضافات المشعرة لتوهم الكثرة\n\n\nوبالجملة لا يتم سلوك السالك في طريق التوحيد إلا بالفناء في الله\n والبقاء ببقائه\n\n\nربنا هب لنا من لدنك جذبة تنجينا عن مضائق هوياتنا\n وتوصلنا إلى فضاء توحيدك بمنك وجودك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ملة أبيكم }: منصوب بمحذوف\n أي: اتبعوا ملة إبراهيم\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا اركعوا واسجدوا } في صلاتكم\n وكانوا أول ما أسلموا يصلون بلا ركوع وسجود\n فأمروا أن تكون صلاتهم بركوع وسجود\n وفيه دليل على أن الأعمال ليست من الإيمان\n وأن هذه السجدة للصلاة لا للتلاوة\n قاله النسفي\n { واعبدوا ربكم } أي: واقصدوا بعبادتكم وجه الله\n وأخلصوا فيها\n أو هو عطف عام على خاص فإن العبادة أعم\n { وافعلوا الخير } كله\n قيل: لما كان للذكر مزية على غيره دعا المؤمنين أولاً للصلاة التي هي ذكر خالص لقوله:\n[طه: 14]\n ثم إلى العبادة بغير الصلاة\n كالصوم والحج\n ثم عم بالحث على سائر الخيرات\n وقال ابن عرفة: وافعلوا الخير: راجع للعبادة المتعدية\n وما قبله يختص بالقاصرة\n قال المحشي: وفيه نظر لشمول العبادة لِمَا هو متعدي النفع\n كتعليم العلم\n والصدقة ونحو ذلك\n بل أمر أولاً بالصلاة\n وهي نوع من العبادة\n وثانيًا بالعبادة\n وهي نوع من فعل الخير\n وثالثًا بفعل الخير\n وهو أعم من العبادة\n فبدأ بخاص ثم عام ثم بأعم\n هـ\n { لعلكم تُفلحون }: كي تفوزوا\n أي: افعلوا هذا كله\n وأنتم راجون للفلاح غير مستيقنين\n فلا تتكلوا على أعمالكم\n { وجاهدوا في الله } أي: في ذات الله ومن أجله { حقَّ جهاده } \n أمرٌ بالغزو وبمجاهدة النفس والهوى\n وهو الجهاد الأكبر\n ومنه: كلمة حق عند أمير جائر\n قال - عليه الصلاة والسلام -:\n \" أعمال البر كلها\n إلى جنب الأمر بالمعروف والنهي عن المنكر\n كنفثة إلى جنب البحر\n والأمر بالمعروف والنهي عن المنكر إلى جنب الجهاد في سبيل الله عزّ وجلّ كنفثة في بحر\n والجهاد في سبيل الله عزّ وجلّ إلى جنب مجاهدة النفس عن هواها في اجتناب النهي\n كنفثة في جنب بحر لجيّ \" \nوهذا على معنى الخبر الذي جاء:\n \" جئتم من الجهاد الأصغر إلى الجهاد الأكبر \" \nيعني: مجاهدة النفس\n قاله في القوت\n  قال القشيري: حق الجهاد ما يوافق الأمر في القَدْرِ والوقتِ والنوعِ\n فإذا حَصَل في شيءٍ منه مخالفة فليس حَقَّ جهاده\n هـ\n قلت: موافقة القَدْر\n في جهاد النفس\n أن يكون بغير إفراط ولا تفريط\n فالإفراط يُمل\n والتفريط يُخل\n وموافقة الوقت أن يكون قبل حصول المشاهدة إذ لا تجتمع مجاهدة ومشاهدة في وقت واحد\n والنوع أن يجاهدها بما يُباح في الشرع\n لا بمحرم ولا مكروه\n وقال في الحاشية: هو الوفاء بالمشروع مع رفع الحرج\n بدليل ما بعده\n فهو موافق لقوله تعالى:\n[التّغَابُن: 16]\n ومما هو ظاهر في الآية: الذب عن دينه وتغيير المناكر\n هـ\n { هو اجتباكم }: اختاركم لدينه بإظهاره والذب عنه\n وهو تأكيد للأمر بالجهاد\n أي: وجب عليكم أن تجاهدوا لأنَّ الله اختاركم لإظهار دينه\n { وما جعل عليكم في الدين من حَرجٍ }: ضيقٍ\n بل وسع عليكم من جميع ما كلفكم به\n من الطهارة\n والصلاة والصوم والحج\n بالتيمم والإيماء\n وبالقصر في السفر\n والإفطار لعذر\n وعدم الاستطاعة في الحج\n\nفاتبعوا { ملةَ أبيكم إِبراهيم } فإن ما جاءكم به رسولكم موافق لملته في الجملة\n لقوله صلى الله عليه وسلم:\n \" جئتكم بالحنيفية السمحة \"\n \nوسماه أبًا\n وإن لم يكن أبًا للأمة كلها لأنه أبو رسول الله صلى الله عليه وسلم فكان أبًا لأمته لأن أمة الرسول في حكم أولاده\n قال صلى الله عليه وسلم:\n \" إنَمَّا أَنَا لكُمْ مِثْلُ الوَالِدِ \"\n \n{ هو سماكم المسلمين } أي: الله\n بدليل قراءة أُبي: \" الله سماكم \" أو إبراهيم لقوله:\n[البَقَرَة: 128] { من قبلُ } أي: سماكم من قبل ظهورهم في الكتب السالفة\n { وفي هذا } أي: القرآن\n فقد فضلكم على سائر الأمم\n وسماكم بهذا الاسم الأكرم\n { ليكون الرسولُ شهيدًا عليكم } أنه قد بلغكم رسالة ربكم\n { وتكونوا شهداء على الناس } بتبليغ الرسل رسالات الله إليهم\n وإذا خصكم بهذه الكرامة والأثرة { فأقيموا الصلاة } بواجباتها\n { وآتوا الزكاة } لشرائطها\n { واعتصموا بالله } أي ثقوا به وتوكلوا عليه\n لا بالصلاة والزكاة\n أو: ثقوا به في جميع أموركم\n ولا تطلبوا الإعانة والنصر إلا منه\n { هو مولاكم }: مالككم وناصركم ومتولي أموركم\n { فنعم المولى } حيث لم يمنعكم رزقكم بعصيانكم\n { ونعمَ النصير } أي: الناصر حيث أعانكم على طاعتكم ومجاهدة نفوسكم وأعدائكم\n الإشارة: يا أيها الذين آمنوا تقربوا إليَّ بأنواع الطاعات وبالمسارعة إلى الخيرات\n لعلكم تفوزون بمعرفة أسرار الذات وأنوار الصفات\n وجاهدوا نفوسكم بأنواع المجاهدات\n كي أجتبِيكم وأنزهكم في أسرار ذاتي\n فإني قد اجتبيتكم قبل كونكم في أزل أزلي\n وكأنه يشير إلى قوله:\n \" لا يزال عبدي يتقرب إليَّ بالنوافل حتى أُحبه\n فإذا أحببتُه كنت سمعه الذي يسمع به\n\n\n \" \nالحديث\n والمأمورُ به من التقرب والمجاهدة قدر الاستطاعة\n من غير تشديد ولا تعقيد\n لقوله: { وما جعل عليكم في الدين من حَرج } لأن مبني الشرع الكريم على السهولة\n فالذي يتوصل إلى رضوانه أو صريح معرفته\n لا يشترط أن يستغرق كنه إمكان العبد فيه\n \" لو كنت لا تصل إليه إلا بعد فناء مساوئك ومحو دعاويك\n لم تصل إليه أبدًا\n ولكن إذا أراد أن يُوصلك إليه غطى وصفك بوصفه\n ونَعْتَكَ بنعته\n فوصلك بما منه إليك\n لا بما منك إليه \"\n كما في الحِكَم\n وقال الورتجبي: { وما جعل\n\n\n } الآية\n أي: إذا شاهدتم مشاهد جمالي سهل عليكم فناؤكم في جلالي\n وسهل عليكم بذل مهجكم إليه\n ألا ترى كيف قال: { ملة أبيكم إبراهيم } \n ومن ملته: الاستسلام والانقياد\n وبذل الوجوه بنعت السخاء والكرم\n يا أسباط خليلي\n رأى أبوكم استعداد هذه المراتب الشريفة فيكم\n قبل وجودكم بنور النبوة\n فسماكم المسلمين\n أي: منقادين بين يديَّ\n عارفين بوحدانيتي\n\nوفيما ذكرنا من أوصافكم\n حبيبي شاهد عليكم\n يعرف هذه الفضائل منكم\n وهو بلغكم نشر فضائلي عليكم\n ثم قال: اطلبوا الاعتصام مني\n استعينوا لأقويكم في طاعتي\n ثم قال: { فنعم المولى } حيث لا مولى غيره\n { ونعم النصير } حيث لا يُخذل من نصره فإن الله عزيز ممتنع من نقائص النقص\n قال جعفر في قوله: { حق جهاده }: ألاَّ تختارَ عليه شيئًا\n كما لم يختر عليك لقوله: { هو اجتباكم }\n هـ\n وقوله تعالى: { وتكونوا شهداء على الناس\n\n\n } الآية\n أي: اجتباكم واختاركم وسماكم مسلمين\n لتكونوا مرضيين عدولاً\n تشهدون على الأمم\n كما يشهد محمد صلى الله عليه وسلم عليكم ويزكيكم\n فهو كقوله تعالى:\n[البَقَرَة: 143] الخ\n وإذ قد خصكم بهذه الكرامة والأثرة فاعبدوه وثقوا به\n ولا تطلبوا الولاية والنصرة إلا منه فهو خير ولي وناصر\n ومن كان الله تعالى مولاه وناصره فقد أفلح وفاز\n ولذلك افتتح السورة التي تليها به\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:17",
      "similarity": 0.3168638628613473
    },
    {
      "verse": "5:67",
      "similarity": 0.3061495452817569
    },
    {
      "verse": "68:50",
      "similarity": 0.30439668547224763
    },
    {
      "verse": "7:2",
      "similarity": 0.30409546658908665
    },
    {
      "verse": "16:121",
      "similarity": 0.30230580388253325
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/022078.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/022078.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/22:78.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}