{
  "chapter": "الحج",
  "text": "وان الساعة ءاتية لا ريب فيها وان الله يبعث من فى القبور",
  "translations": [
    {
      "translation": "The Hour will come without a doubt, and God will raise those who are dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(all of which shows that) the Hour shall surely come to pass - in this there is no doubt - and Allah shall surely resurrect those that are in graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no doubt about the coming of the Hour of Doom and that God will raise every one from their graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because the Last Day will come, there is no doubt in it – and because Allah will revive those who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, the Hour is coming, there is no doubt about it; and certainly, Allah will resurrect those who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because the hour is coming, there is no doubt about it; and because Allah shall raise up those who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and because the Hour is coming, no doubt of it, and God shall raise up whosoever is within the tombs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because the Hour will come, there is no doubt thereof; and because Allah will raise those who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Last Hour is bound to come. There is no doubt about it. God will raise up those who are in their graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because the Hour is coming- there is no doubt thereof-- and because Allah will raise up those who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and because the Hour is bound to come, there is no doubt in it, and Allah will resurrect those who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily the Hour will come: there can be no doubt about it, or about (the fact) that Allah will raise up all who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, the Hour is coming, there is no doubt about it, and certainly, Allah will resurrect those who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Hour is sure to come there is no doubt. And Allah will raise up those in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because the Hour is coming—there is no doubt about it—and because God will resurrect those in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [that they may know] that the Hour is coming - no doubt about it - and that Allah will resurrect those in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:7] and because the Hour will come, whereof there is no doubt, uncertainty; and because God will resurrect those who are in the graves.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And because the Hour will come, there is no doubt thereof) there is no doubt that it will come; (and because Allah will raise those who are in the graves) for requital and chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَنَّ ٱللَّهَ يَبْعَثُ مَن فِي ٱلْقُبُورِ } معناهُ يُحيِيهِمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَنَّ ٱلسَّاعَةَ } الموعودة المعهودة من عنده { آتِيَةٌ لاَّ رَيْبَ فِيهَا } إذ هي من جملة مقدورات الله التي قدر وجودها في لوح قضائه وحضرة علمه { وَأَنَّ ٱللَّهَ } المتصرف بالاستقلال والاختيار { يَبْعَثُ } يوم الحشر { مَن فِي ٱلْقُبُورِ } [الحج: 7] من النفوس الخيرة والشريرة، ثم يحاسبهم ويجازيهم على مقتضى حسابه، إن خيراً فخير وإن شراً فشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنَّ الساعة آتيةً }: قادمة عليكم، { لا ريبَ فيها } ، وإيثار اسم الفاعل على الفعل للدلالة على تحقق إتيانها وتقريره ألْبَتَّةَ\n ومعنى نفي الريب عنها: أنها، في ظهور أمرها ووضوح دلائلها، بحيث ليس فيها مظنة الريب، { وأنَّ الله يبعثُ من في القبور } لأنه تعالى حكم بذلك ووعد به، وهو لا يخلف الميعاد، والتعبير بـ \" من في القبور \": خرج مخرج الغالب، وإلاَّ فهو يبعث كل من يموت\n والله تعالى أعلم وأحكم\n الإشارة: يا أيها الناس المنكرون لوجود التربية النبوية، وظهور أهل الخصوصية في زمانهم، الذين يحيي الله الأرواح الميتة، بالجهل والغفلة، على أيديهم إن كنتم في ريب من هذا البعث فانظروا إلى أصل نشأتكم وتنقلات أطواركم، فمن فعل ذلك وقدر عليه، قدر أن يحيي النفوس الميتة بالغفلة في كل زمان\n وفي الحِكَم: \" من استغرب أن ينقذه الله من شهوته، وأن يُخرجه من وجود غفلته، فقد استعجز القدرة الإلهية، وكان الله على كل شيء مقتدرًا \"\n وجرت عادته أنه لا يحييها في الغالب إلا على أيدي أهل الخصوصية\n وترى أرض النفوس هامدة ميتة بالغفلة، فإذا أنزلنا عليها ماء الحياة، وهي الواردات الإلهية، وأسقيناها الخمرة القدسية، اهتزت فرحًا بالله، وربت، وارتفعت بالعلم بالله، وأنبتت من أصناف العلوم والحكم، ما تَبْهَجُ منه العقول، ذلك شاهد بوحدانية الحق، وأن ما سواه باطل\n وبالله التوفيق\n  ثمَّ ذكر نوعاً آخر من أهل الانكار والجدل: { ومِنَ ٱلنَّاسِ مَن يُجَادِلُ فِي ٱللَّهِ بِغَيْرِ عِلْمٍ }\n\n",
      "translations": []
    }
  ]
}