{
  "chapter": "الحج",
  "text": "ومن الناس من يجدل فى الله بغير علم ولا هدى ولا كتب منير",
  "translations": [
    {
      "translation": "Among people there is one who argues about Allah without knowledge or guidance or any light-giving Book,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there are some who contend about God without any knowledge or guidance or enlightening Book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among people are those that wrangle about Allah without knowledge, without any true guidance, and without any scripture to enlighten them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some people argue about God without knowledge, guidance, and an enlightening Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is one who argues concerning Allah without having knowledge nor any proof nor a clear text.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men is he who disputes about Allah, without knowledge or guidance, or a Book giving light (from Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men there is he who disputes about Allah without knowledge and without guidance and without an illuminating book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men there is such a one that disputes concerning God without knowledge or guidance, or an illuminating Book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among mankind is he who disputeth concerning Allah without knowledge or guidance or a scripture giving light,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some who dispute about God without having any knowledge or guidance, or any enlightening Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who disputeth respecting Allah without knowledge or guidance or a Book luminous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people are those who dispute concerning Allah without any knowledge or guidance, or an enlightening Book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there is among men such a one as disputes about Allah, without Knowledge, without Guidance, and without a Book of Enlightenment,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men is he who disputes about Allah, without knowledge or guidance, or a Book giving light (from Allah),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some dispute about Allah, though they have neither knowledge nor guidance, nor an illuminating Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the people is he who argues about God without knowledge, or guidance, or an enlightening scripture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people is he who disputes about Allah without knowledge or guidance or an enlightening book [from Him],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:8] The following was revealed regarding Abū Jahl: And among mankind there are some who dispute about God without [any] knowledge or guidance, [being] with him, or an enlightening Scripture, one containing light, [being] with him,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And among mankind is he who disputeth concerning Allah) argues against Allah's religion and Scripture (without knowledge or guidance) or proof (or a Scripture giving light) or Scripture expositing what he says.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ومِنَ ٱلنَّاسِ } المجبولين على الكفر والنسيان { مَن يُجَادِلُ } ويكابر { فِي } أوامر { ٱللَّهِ } وينكر مقدراته الماضية والآتية مع أنه { بِغَيْرِ عِلْمٍ } أي: دليل عقلي مسبوق بترتيب المعلومات اليقينية أو الظنية { وَلاَ هُدًى } أي: حدس\n وكشف ملهم من عند الله ملقى في روعة { وَلاَ كِتَابٍ مُّنِيرٍ } [الحج: 8] دليل نقلي منسوب إلى الوحي\n والإلهام بنور قلب من صدّق به\n وأخذ بما فيه إيماناً واحتساباً\n ومع أنه ليس له سند عقلي ولا نقلي ولا كشفي وشهودي\n مُعِرِضٌ عن الدلائل والشواهد مع وضوحها وظهورها صارفاً عنان عزمه عن التأمل فيها\n\n\n{ ثَانِيَ عِطْفِهِ } يعني: لاوياً عنقه ومولياً جنبه عنها كبيراً وخيلاء على أصحاب الدلائل والبراهين وأرباب الكشف والشهود عتواً وعناداً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ومن الناس من يُجادل في الله } أي: في شأنه، فيصفه بغير ما هو أهله، وهو أبو جهل، كما قال ابن عباس رضي الله عنه، وقيل: هو من يتصدى لإضلال الناس، كائنًا من كان\n حال كونه { بغير علم } ، بل بجهل وهوىً\n والمراد بالعلم: الضروري، كما أن المراد بالهدى في قوله: { ولا هُدىً }: هو الاستدلال والنظر الصحيح، الهادي إلى المعرفة\n { ولا كتابٍ منير } أي: وحي يستند إليه، والحجة إنما تقوم بأحد هذه الثلاثة، أي: يجادل في شأنه تعالى، من غير تمسك بمقدمة ضرورية، ولا بحجة نظرية، ولا برهان سمعي\n حال كونه { ثانِيَ عِطْفِه } أي: لاويًا عُنُقَهُ عن طاعة الله كبرًا وعُتوًا، أو عاطفًا بجانبه، وطاويًا كَشْحَهُ، معرضًا متكبرًا، فثنْي العطف كناية عن التكبر\n وقرأ الحسن بفتح العين، أي: مانعًا تعطفه على المساكين قسوةً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:68",
      "similarity": 0.7214239360172015
    },
    {
      "verse": "16:111",
      "similarity": 0.5473311263565263
    },
    {
      "verse": "29:46",
      "similarity": 0.5455248159833492
    },
    {
      "verse": "4:109",
      "similarity": 0.5059171602972623
    },
    {
      "verse": "11:32",
      "similarity": 0.4844779783807836
    }
  ]
}