{
  "chapter": "الحج",
  "text": "ثانى عطفه ليضل عن سبيل الله له فى الدنيا خزى ونذيقه يوم القيمة عذاب الحريق",
  "translations": [
    {
      "translation": "turning away arrogantly, to misguide people from the Way of Allah. He will be disgraced in this world and on the Day of Rising We will make him taste the punishment of the Burning:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turning their backs that they may lead away from the path of God. For such there is disgrace in the world, and on the Day of Judgement We shall make them taste the torment of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wrangle arrogantly, intent on leading people astray from the Way of Allah. Such shall suffer disgrace in this world and We shall cause them to taste the chastisement of burning (in the Next).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They turn away (from the Truth) to lead people away from the path of God. Their share in this world will be disgrace and on the Day of Judgment a burning torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With his neck turned away from the truth, in order to deceive from the way of Allah; for him is disgrace in this world and on the Day of Resurrection We shall make him taste the punishment of fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bending his neck in pride, and leading (others) too (far) astray from the path of Allah. For him there is disgrace in this worldly life, and on the Day of Resurrection We shall make him taste the torment of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turning away haughtily that he may lead (others) astray from the way of Allah; for him is disgrace in this world, and on the day of resurrection We will make him taste the punishment of burning:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "turning his side to lead astray from God's way; for him is degradation in this world; and on the Resurrection Day We shall let him taste the chastisement of the burning:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turning away in pride to beguile (men) from the way of Allah. For him in this world is ignominy, and on the Day of Resurrection We make him taste the doom of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They turn away arrogantly, leading people astray from God's path. Such men shall incur disgrace in this life and taste the punishment of the Fire on the Day of Judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bending his neck, that he may lead astray from the way of Allah; his shall be humiliation in the world, and We shall make him taste on the Day of Judgment the torment of Burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "turning aside disdainfully to lead [others] astray from the way of Allah. For such there is disgrace in this world, and on the Day of Resurrection We will make him taste the punishment of the burning:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Disdainfully) bending his side, in order to lead (men) astray from the Path of Allah: for him there is disgrace in this life, and on the Day of Judgment We shall make him taste the Penalty of burning (Fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bending his neck in pride (far astray from the Path of Allah), and leading (others) too (far) astray from the Path of Allah. For him there is disgrace in this worldly life, and on the Day of Resurrection We shall make him taste the torment of burning (Fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is for him who turns his side to lead (others) astray from the Path of Allah, degradation in this life and We shall let him taste the punishment of theburning on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turning aside in contempt, to lead away from the path of God. He will have humiliation in this world, and on the Day of Resurrection We will make him taste the agony of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Twisting his neck [in arrogance] to mislead [people] from the way of Allah. For him in the world is disgrace, and We will make him taste on the Day of Resurrection the punishment of the Burning Fire [while it is said],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[22:9] turning aside (thāniya ‘itfihi, a circumstantial qualifier, meaning ‘turning his neck aside in disdain of belief; alītf means ‘a side’, and can be either the left or the right) to go astray (read li-yadilla; or li-yudilla, ‘to lead [others] astray’) from the way of God, that is, [from] His religion. For him there will be ignominy, chastisement, in this world — thus he [Abū Jahl] was slain on the day of Badr — and on the Day of Resurrection We shall make him taste the chastisement of the burning, that is, [the chastisement of] being burnt in the Fire, and it shall be said to him:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Turning away) from the signs and disbelieving in Muhammad (pbuh) and in the Qur'an (in pride to beguile (men) from the way of Allah) from Allah's religion and obedience. (For him in this world is ignominy) the torment of death and being shackled on the Day of Badr, (and on the Day of Resurrection We make him taste the doom of burning) We make him taste the chastisement of the Fire; and it is said that this means: We make him taste a severe chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثَانِيَ عِطْفِهِ } معناه مُتكبرٌ مُتجبرٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"The second of His two {attributes}\" - this means that He is arrogant and disobedient.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إنما فعل ما فعل من عدم الالتفات والتوجه نحو أهل الحق { لِيُضِلَّ } بفعله هذا ضعفاء الأنام { عَن سَبِيلِ ٱللَّهِ } الذي بيّنه الأنبياء وأوضحه الرسل بوحيه وإلهامه إليهم\n وإنزال الكتب\n والصحف عليهم { لَهُ } أي: لهذا المستكبر العاتي بسبب ضلاله وإضلاله { فِي ٱلدُّنْيَا خِزْيٌ } هوان وهون وطرد ولعن ونهب وأسر { وَنُذِيقُهُ يَوْمَ ٱلْقِيَامَةِ } بعد انقراض النشأة الأولى { عَذَابَ ٱلْحَرِيقِ } [الحج: 9] المحرق الذي هو عذاب النار الذي لا عذاب أشد منها\n\n\nوحين تعذيب الموكلين عليه إياه بالنار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فعل ذلك الجدال { ليضلَّ عن سبيل الله } أي: ليضل الناس عن سبيل الله فإنَّ غرضه بالمجادلة إضلال المؤمنين\n أو جميع الناس\n وقرأ المكي وأبو عمر: بفتح الياء\n أي: ليصير ضالاً عن سبيل الله\n وجعل ضلاله غاية لجداله\n من حيث إن المراد به الضلال المبين\n الذي لا هداية بعده\n مع تمكنه منها قبل ذلك\n أي: ليرسخ في الضلالة أيّ رسوخ\n { له في الدنيا خِزيٌ }: هوان وذُل\n وهو القتل يوم بدر\n وهو بيانُ نتيجةِ ما سلكه من الطريقة\n أي: يثبت له\n بسبب ما فعل\n خزي وصغار\n وهو ما أصابه ببدر\n { ونُذِيقه يومَ القيامة عذابَ الحريق } أي: النار المحرقة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:50",
      "similarity": 0.17886712763965718
    },
    {
      "verse": "3:181",
      "similarity": 0.17476857773885907
    },
    {
      "verse": "22:22",
      "similarity": 0.17440148081149917
    },
    {
      "verse": "21:68",
      "similarity": 0.16293958266532538
    },
    {
      "verse": "85:10",
      "similarity": 0.1628552068689666
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/22:9.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/22:9.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/22:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}