{
  "chapter": "المؤمنون",
  "text": "لعلى اعمل صلحا فيما تركت كلا انها كلمة هو قائلها ومن ورائهم برزخ الى يوم يبعثون",
  "translations": [
    {
      "translation": "so that perhaps I may act rightly regarding the things I failed to do!' No indeed! It is just words he utters. Before them there is an interspace until the Day they are raised up.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That I may do some good I did not do (in the world).\" Not so. These are only words he utters. Behind them lies the intervening barrier (stretching) to the day of their resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that I have left behind. I am likely to do good.\" Nay, it is merely a word that he is uttering. There is a barrier behind all of them (who are dead) until the Day when they will be raised up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that perhaps I shall act righteously for the rest of my life.\" Although he will say so but his wish will never come true. After death they will be behind a barrier until the day of their resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Perhaps I may do some good deeds in what I have left behind”; this is just a word that he utters from his mouth; and confronting them is a barrier until the day in which they will be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that I may do good in that which I have left behind!\" No! (Kalla) It is but a word that he speaks; and in front of them is Barzakh until the Day when they will be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Haply I may do good in that which I have left. By no means! it is a (mere) word that he speaks; and before them is a barrier until the day they are raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "haply I shall do righteousness in that I forsook.' Nay, it is but a word he speaks; and there; behind them, is a barrier until the day that they shall be raised up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That I may do right in that which I have left behind! But nay! It is but a word that he speaketh; and behind them is a barrier until the day when they are raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that I may do good works in the world I have left behind.\" Never! It is indeed but a meaningless word that he utters. A barrier shall stand behind such people till the Day they are raised up again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That I may work righteously in that which have left. By no means! It is but a word he uttereth; and before them is a barrier until the Day when they shall be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that I may act righteously in what I have left behind.’ ‘By no means! These are mere words that he says.’ And before them is a barrier until the day they will be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that I may work righteousness in the things I neglected.\" - \"By no means! It is but a word he says.\"- Before them is a Partition till the Day they are raised up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that I may do good in that which I have left behind!\" No! It is but a word that he speaks, and behind them is Barzakh (a barrier) until the Day when they will be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that I should do righteousness in that I forsook' No! It is only a word which he will speak. Behind them there shall stand a barrier till the Day that they shall be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That I may do right in what I have neglected.” By no means! It is just a word that he utters. And behind them is a barrier, until the Day they are resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That I might do righteousness in that which I left behind.\" No! It is only a word he is saying; and behind them is a barrier until the Day they are resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:100] that I might act righteously, by witnessing that ‘there is no god but God’, that this might be, in that which I have left behind’, [in what] I have wasted of my life, in other words [that this affirmation might be] in its place. God, exalted be He, says: By no means!, that is, there shall be no return. It, namely, [the statement] ‘My Lord! Send me back’, is merely a word that he speaks, but [a word] in which there is no benefit for him; and behind them, ahead of them, there is a barrier, which prevents them from going back [to this world], until the day when they are raised, after which [day] there will be no more return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That I may do right) and believe in You (in that which I have left behind) in the life of the world and disbelieved in! (But nay!) he will not be returned to the life of the world. (It) his saying: \"Return me that I may do right\" (is but a word that he speaketh) is just a mere expression that he utters and which will not benefit him; (and behind them) in front of them (is a barrier) the grave (until the day when they are raised) from the graves. 383\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمِن وَرَآئِهِمْ بَرْزَخٌ } معناه أمامهُم\n وكُلُّ مَا بَينَ شَيئين فهو بَرزخٌ\n وما بَين الدُّنيا والآخرةِ فَهو بَرزخٌ\n ومَا بَين المَوتِ والبَعثِ بَرزخٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And there is a barrier before them}, means in front of them.\n\n\nAnd everything between two things is a space.\n\n\nAnd what is between this world and the next is a bridge.\n\n\nAnd what lies between death and resurrection is a period of time.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَعَلِّيۤ } بعد رجوعي عملاً { أَعْمَلُ صَالِحاً } مصلحاً { فِيمَا تَرَكْتُ } وأفسدتُ من أمور الإيمان والإطاعة والانقياد { كَلاَّ } ردعُ له عن هذا السؤال والدعاء\n ومنعُ له عن أنجاح سؤله { إِنَّهَا } أي: طلب المراجعة { كَلِمَةٌ هُوَ قَآئِلُهَا } من غاية الحسرة والندامة على ما فات عنه في الابتلاء { وَ } كيف يرجع إليها\n إذ { مِن وَرَآئِهِمْ } أي: أمامهم وقدامهم { بَرْزَخٌ } أي: حجابُ مانعُ يمنعهم عن الرجوع { إِلَىٰ يَوْمِ يُبْعَثُونَ } [المؤمنون: 100] يعني: لا يمكنهم الرجوع إلى دار الدنيا والحياة يها إلا الحياة في يوم البعث والجزاء\n\n\n{ فَإِذَا نُفِخَ فِي ٱلصُّورِ } لحشر الأموات ونشرها من قبورهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { كَلاَّ } أي: لا رجوع له أصلاً\n وهو ردع عن طلب الرجعة\n واستبعاد لها\n { إِنها } أي: قوله: رب ارجعون\n { كلمةٌ } \n والمراد: طائفة من الكلام\n وهو ربِّ ارجعون\n\n\n إلخ\n { هو قائلها } \n ولا فائدة له فيها\n ولا حقيقة لها لعدم حصول مضمونها\n أو هو قائلها لا محالة لتسليط الحسرة والندم عليه\n فلا يقدر على السكوت عليها\n ومن ورائهم أي: أمامهم\n والضمير للجماعة لأن أحدهم بمعنى كلهم\n { برزخٌ }: حائل بينهم وبين الرجعة\n { إلى يوم يُبعثون }: يوم القيامة\n وهو إقناط كلي عن الرجوع إلى الدنيا\n لما علِم أنه لا رجعة يوم القيامة إلى الدنيا\n وإنما الرجوع فيه إلى الحياة الأخرية\n\nوالله تعالى أعلم\n الإشارة: ما قاله صلى الله عليه وسلم في تضرعه إلى الله تعالى - كما أمره الحق تعالى - يقوله كل عارف ومتيقظ\n فيقول: ربِّ إما تُريني ما يُوعدهُ أهل الغَفلة والبطالة من التحسر والندم\n عند انقراض الدنيا وإقبال الآخرة\n فلا تجعلني في القوم الظالمين\n أي: لا تسلك بي مسلكهم حتى أتحسر معهم فإذا أوذي في الله - كما هو شأن أهل الخصوصية - يقال له: ادفع بالتي هي أحسنُ السيئةَ\n وقابل الإساءة بالإحسان\n وإياك والانتصار لنفسك\n وتعوذ بالله من همزات الشياطين\n إن قامت عليك نفسك وأرادت الانتصار\n كما هو شأن أهل الغفلة\n في كونهم منهمكين في الغفلة\n مملوكين في أيدي أنفسهم\n مستمرين على ذلك\n حتى إذا حضر أجلهم طلبوا من الله الرجعة\n هيهات هيهات\n { كَلاَّ إِنَّهَا كَلِمَةٌ هُوَ قَآئِلُهَا وَمِن وَرَآئِهِمْ بَرْزَخٌ إِلَىٰ يَوْمِ يُبْعَثُونَ } [المؤمنون: 100]\n وفي الأثر:\n \" ما منكم من أحد إلا وسيندم عند الموت\n إن كان محسناً أن لو زاد\n وإن كان مسيئاً أن لو تاب \" \nأو كما قال\n ولأجل هذا المعنى شد أهل اليقظة الحُزُم\n وشمروا عن ذراعهم في طاعة مولاهم\n وعمروا أوقاتهم بما يقربهم إلى محبوبهم\n وتنافسوا في ذلك أيَّ تنافس\n وفي ذلك يقول القائل:\nوكان بعض العباد حفر قبراً في بيته\n فإذا صلى العشاء دخل فيه\n وقرأ: { قال رب ارجعون لعلي أعمل صالحاً\n\n\n } الآية\n فيقول لنفسه: ستطلبين الرجعة ولا تُمكنين منها\n وأنت اليوم متمكنة من الرجوع\n قومي إلى خدمة مولاك\n قبل أن يحال بينك وبينها\n فيبيت قائماً يُصلي\n وهكذا شأن اهل اليقظة يُقدمون الندم والجد قبل فوات إبَّانِهِ\n أعاننا الله على اغتنام طاعته\n وما يقربنا إلى حضرته\n آمين\n ثمَّ ذكر أهوال ذلك اليوم الموعود",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:20",
      "similarity": 0.8099207945592541
    },
    {
      "verse": "25:53",
      "similarity": 0.2983738927350465
    },
    {
      "verse": "42:51",
      "similarity": 0.13386026897456746
    },
    {
      "verse": "56:71",
      "similarity": 0.12390827147372432
    },
    {
      "verse": "2:91",
      "similarity": 0.12386845024408934
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/23:100.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/23:100.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:100.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}