{
  "chapter": "المؤمنون",
  "text": "ومن خفت موزينه فاو۟لئك الذين خسروا۟ انفسهم فى جهنم خلدون",
  "translations": [
    {
      "translation": "Those whose scales are light, they are the losers of their selves, remaining in Hell timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those whose scales are lighter will perish and abide in Hell for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those whose scales are light, those will be the ones who will have courted loss. They will abide in Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but if it weighs less, one will be lost forever in hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the ones whose scales prove light – it is they who put their lives into ruin, remaining in hell forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whose Scales (of good deeds) are light, they are those who lose themselves, in Hell will they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for him whose good deeds are light, these are they who shall have lost their souls, abiding in hell\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and he whose scales are light -- they have lost their souls in Gehenna dwelling forever,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whose scales are light are those who lose their souls, in hell abiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those whose scales weigh light will have ruined their souls; in Hell will they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he whose balances shall be light--these are they who have lost themselves: in Hell they are abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those whose deeds weigh light in the scales—they will be the ones who have ruined their souls, and they will remain in hell [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those whose balance is light, will be those who have lost their souls, in Hell will they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whose scales (of good deeds) are light, they are those who lose their ownselves, in Hell will they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but those whose scales are light shall forfeit their souls and live in Gehenna (Hell) for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those whose scales are light—those are they who have lost their souls; in Hell they will dwell forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those whose scales are light - those are the ones who have lost their souls, [being] in Hell, abiding eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:103] and those whose scales are light, because of evil deeds, they are the ones who have lost their souls, and so they will be, abiding in Hell.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those whose scales are light) with good works (are those who lose their souls, in hell abiding) forever, neither to die or leave.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ خَفَّتْ مَوَازِينُهُ } ورجحت سيئاته على حسناته { فأُوْلَـٰئِكَ } الأشقياء المردودون هم { ٱلَّذِينَ خَسِرُوۤاْ أَنفُسَهُمْ } خسراناً مبيناً إلى حيث هم؛ لانهماكهم في الشرور والسيئات { فِي جَهَنَّمَ } البعد والخذلان { خَالِدُونَ } [المؤمنون: 103] مخلدون دائمون لا نجاة لهم منها أصلاً من شدة اشتعال النار وتلهبها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأولئك الذين خسروا أنفسهم }: ضيعوها بتضييع زمان استكمالها، وأبطلوا استعدادها لنيل كمالها، { في جهنم خالدون } ، وهو خبر ثان لأولئك، أو بدل من الصلة، وعن ابن مسعود رضي الله عنه قال: يؤخذ بيد العبدِ أو الأمة يوم القيامة، فينصب على رؤوس الأولين والآخرين، ثم ينادي مناد: هذا فلان بن فلان، من كان له حق فليأت إلى حقه، فتفرح المرأة أن يدور لها الحق على ابنها، أو على زوجها، أو على أبيها، أو على أخيها، ثم قرأ ابن مسعود: { فلا أنساب بينهم يومئذٍ ولا يتساءلون } ، ثم يقول الرب تعالى: آت هؤلاء حقوقهم، فيقول ربِّ، فنيت الدنيا فمن أين آتيهم؟ فيقول للملائكة: خذوا من حسناته فأعطوا كل إنسان بقدر طلْبته\n\n\n إلخ الحديث، انظر النسفي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:9",
      "similarity": 0.8886956639229429
    },
    {
      "verse": "101:8",
      "similarity": 0.7599526397949876
    },
    {
      "verse": "2:162",
      "similarity": 0.5912367545080536
    },
    {
      "verse": "3:88",
      "similarity": 0.5912367545080536
    },
    {
      "verse": "35:36",
      "similarity": 0.525090219179855
    }
  ]
}