{
  "chapter": "المؤمنون",
  "text": "ولقد خلقنا فوقكم سبع طرائق وما كنا عن الخلق غفلين",
  "translations": [
    {
      "translation": "We created above you seven levels and We were not unaware of the creation.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made several highways one over the other above you. We are not neglectful of creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed fashioned above you seven paths. Never were We unaware of the task of creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created seven heavens above you and have never been neglectful to Our Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have created seven paths above you; and We are not unmindful of the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have created above you seven Tara'iq, and We are never unaware of the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We made above you seven heavens; and never are We heedless of creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We created above you seven ways, and We were not heedless of creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have created above you seven paths, and We are never unmindful of creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created seven paths above you; We have never been unmindful of Our creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We created above you seven paths, and of the creation We have not been neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We created above you seven levels and We have not been oblivious of the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made, above you, seven tracts; and We are never unmindful of (our) Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have created above you seven heavens (one over the other), and We are never unaware of the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created seven ways above you; of Our creation, We are never inattentive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created above you seven pathways, and We are never heedless of the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have created above you seven layered heavens, and never have We been of [Our] creation unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:17] And verily We created above you seven paths, that is, [seven] heavens (tarā’iq is the plural of tarīqa [so called] because they are the paths used by the angels) and of creation, that lies beneath these [paths], We are never unmindful, lest these should fall upon them and destroy them. Nay, but We hold them back, as [stated] in the verse: And He holds back the heaven lest it should fall upon the earth [Q. 22:65].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We have created above you seven paths) seven heavens, some above others like a dome, (and We are never unmindful of creation) leaving them without commands and prohibitions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أخذ سبحانه في تعداد نعمه على عباده تفضلاً عليهم وامتناناً فقال: { وَلَقَدْ خَلَقْنَا فَوْقَكُمْ } أي: جانب علوكم { سَبْعَ } سماوات { طَرَآئِقَ } أي: متطارقة متطابقة بعضها فوق بعض\n مشتملة على كواكب لا في السفليات من الأشياء المتعلقة لمعاشكم { وَ } بالجملة { مَا كُنَّا } في حال من الأحوال السابقة واللاحقة { عَنِ ٱلْخَلْقِ } أي: عن جميع المخلوقات المستندة إلينا\n الظاهر من امتداد أظلالنا { غَافِلِينَ } [المؤمنون: 17] ذاهلين عن حفظها وتفقدها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" سيناء \" ، مَنْ فتحها: جعل همزتها للتأنيث، فلم يصرفه للتأنيث والوصف، كحمراء، أو لألف التأنيث، لقيامه مقام علتين، ومن كسرها: لم يصرفه للتعريف والعجمة، وهذا البناء ليس من أبنية التأنيث، وإنما ألفُهُ ألف الإلحاق، كعلِباء وجِرباء\n ونبت وأنبت: لغتان بمعنى واحد وكذلك سقى وأسقى\n يقول الحق جل جلاله: { ولقد خلقنا فوقكم سبعَ طرائق } ، وهي السموات السبع، جمع طريقة لأنها طرق الملائكة وتقلباتها، وطرق الكواكب، فيها مسيرها { وما كنا عن الخلق غافلين } ، أراد بالخلق السموات، كأنه قال: خلقناها وما غفلنا عن حفظها وإمساكها، أو الناس، أي: خلقناها فوقكم لنفتح عليكم منها الأرزاق والبركات، وما كنا غافلين عنكم وعما يصلحكم، أو: خلقناها فوقكم، وما حالت بيننا وبينكم، بل نحن أقرب إليكم من كل شيء، فلا نغفل عن شيء من أمركم، قلَّ أو جلَّ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "86:1",
      "similarity": 0.6269246980894545
    },
    {
      "verse": "4:168",
      "similarity": 0.596524896685701
    },
    {
      "verse": "86:2",
      "similarity": 0.5657917652903974
    },
    {
      "verse": "20:104",
      "similarity": 0.5331171424001219
    },
    {
      "verse": "46:30",
      "similarity": 0.529261070783448
    }
  ]
}