{
  "chapter": "المؤمنون",
  "text": "ومن يدع مع الله الها ءاخر لا برهن له به فانما حسابه عند ربه انه لا يفلح الكفرون",
  "translations": [
    {
      "translation": "Whoever calls on another god together with Allah, has no grounds for doing so at all and his reckoning is with his Lord. Truly the kafirun have no success.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever worships another god apart from God, for which he holds no proof, will have to account for it before his Lord. Verily the unbelievers will not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who invokes any other god along with Allah \" one for whom he has no evidence\" his reckoning is with his Lord alone. Indeed, these unbelievers shall not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who worships things besides God has no proof of the authority of such things. God is certainly keeping the record of his deeds. The unbelievers will not have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the one who worships any other God along with Allah – of which he does not have any proof – his account is with his Lord; indeed there is no salvation for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever invokes besides Allah, any other god, of whom he has no proof; then his reckoning is only with his Lord. Surely, disbelievers will not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever invokes with Allah another god-- he has no proof of this-- his reckoning is only with his Lord; surely the unbelievers shall not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever calls upon another god with God, whereof he has no proof, his reckoning is with his Lord; surely the unbelievers shall not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who crieth unto any other god along with Allah hath no proof thereof. His reckoning is only with his Lord. Lo! disbelievers will not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He, who invokes another deity along with God, a deity of whose divinity he has no proof, will be brought to account by his Lord. Certainly, those who deny the truth shall never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever calleth, along with Allah, unto anot her god, of whom he hath no warranty, then his reckoning is only with his Lord; verily thrive will not the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever invokes besides Allah another god of which he has no proof, his reckoning will indeed rest with his Lord. Indeed the faithless will not be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anyone invokes, besides Allah, Any other god, he has no authority therefor; and his reckoning will be only with his Lord! and verily the Unbelievers will fail to win through!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever invokes (or worships), besides Allah, any other ilah (god), of whom he has no proof, then his reckoning is only with his Lord. Surely! Al-Kafirun (the disbelievers in Allah and in the Oneness of Allah, polytheists, pagans, idolaters, etc.) will not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever calls upon another god, other than Allah, having no proof his reckoning will be with his Lord. The unbelievers shall never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever invokes another god besides God—he has no proof thereof—his reckoning rests with his Lord. The disbelievers will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever invokes besides Allah another deity for which he has no proof - then his account is only with his Lord. Indeed, the disbelievers will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:117] And he who calls on another god along with God has no proof thereof (lā burhāna lahu bihi, an [extra] explicative adjectival qualification that has no [other syntactical] signification), his reckoning, his requital, will indeed be with his Lord. Truly the disbelievers will not be successful, they will not be felicitous.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "He who crieth unto) worships (any other god) among idols (along with Allah hath no proof thereof) no proof for worshipping other than Allah. (His reckoning) his chastisement (is only with his Lord) in the Hereafter. (Lo! disbelievers will not be successful) disbelievers will not be safe from Allah's chastisement nor escape from it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما تحقق أن الكل في حيطة أوصافه وأسمائه، ومن أضلاله، وتحت لوائه { مَن يَدْعُ مَعَ ٱللَّهِ } المحيط للكل { إِلَـهَا آخَرَ } من الأضلال المحاطة والعكوس الساقطة مع أنه { لاَ بُرْهَانَ لَهُ } يثبت به وجود إله آخر سواه، بعدما شمل سواه سبحانه الكل وأحاط { بِهِ فَإِنَّمَا حِسَابُهُ } أي: حساب المدعي، وجزاء ما ادعى من الشرك { عِندَ رَبِّهِ } يجازيه على مقتضى علمه { إِنَّهُ } أي: إن الشأن والأمر عنده سبحانه إنه { لاَ يُفْلِحُ } ولا يفوز { ٱلْكَافِرُونَ } [المؤمنون: 117] بكفرهم وشركهم إلى ما هو موجبُ للفلاح والنجاح؟\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن يدعُ مع الله إلهاً آخر } ، يعبده فرداً أو اشتراكاً، من صفته { لا برهان له به } على صحة عبادته\n وفيه تنبيه على أن التدين بما لا دليل عليه باطل، فكيف بما شهدت بديهة العقول بخلافه؟ { فإنما حسابُه عند ربه } ،\n فهو مُجازٍ له على قدر ما يستحقه، { إنه } أي: الأمر والشأن { لا يُفلح الكافرون } لا فوز لهم ولا نجاة\n بدئت السورة الكريمة بتقرير فلاح المؤمنين، وختمت بنفي فلاح الكافرين تحريضاً على الإيمان، وعلى ما يوجب بقاءه وتنميته، من التمسك بما جاء به التنزيل، وبما جاء به النبي الجليل، ليقع الفوز بالفلاح الجميل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:174",
      "similarity": 0.7348699707220728
    },
    {
      "verse": "12:24",
      "similarity": 0.43378464492432695
    },
    {
      "verse": "21:24",
      "similarity": 0.42070626759103547
    },
    {
      "verse": "28:75",
      "similarity": 0.38040536912742984
    },
    {
      "verse": "27:64",
      "similarity": 0.3797905493764722
    }
  ]
}