{
  "chapter": "المؤمنون",
  "text": "ثم خلقنا النطفة علقة فخلقنا العلقة مضغة فخلقنا المضغة عظما فكسونا العظم لحما ثم انشانه خلقا ءاخر فتبارك الله احسن الخلقين",
  "translations": [
    {
      "translation": "then formed the drop into a clot and formed the clot into a lump and formed the lump into bones and clothed the bones in flesh; and then brought him into being as another creature. Blessed be Allah, the Best of Creators!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We fashioned the sperm into an embryo, then fashioned the embryo into a shapeless lump of flesh; then from the lump of flesh We fashioned bones, then clothed the bones with flesh. Thus We formed him into a new creation. So blessed be God the best of Creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We made this drop into a clot, then We made the clot into a lump, then We made the lump into bones, then We clothed the bones with flesh, and then We caused it to grow into another creation. Thus Most Blessed is Allah, the Best of all those that create.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The living germ, then, was turned into a shapeless lump of flesh from which bones were formed. The bones, then, were covered with flesh. At this stage, We caused it to become another creature. All blessings belong to God, the best Creator.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then turned the drop of fluid into a clot of blood, then the clot into a small lump of flesh, then the lump into bones, then covered the bones with flesh; then developed it in a different mould; therefore Most Auspicious is Allah, the Best Creator.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the Nutfah into a clot, then We made the clot into a little lump of flesh, then We made out of that little lump of flesh bones, then We clothed the bones with flesh, and then We brought it forth as another creation. So Blessed is Allah, the Best of creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the seed a clot, then We made the clot a lump of flesh, then We made (in) the lump of flesh bones, then We clothed the bones with flesh, then We caused it to grow into another creation, so blessed be Allah, the best of the creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We created of the drop a clot then We created of the clot a tissue then We created of the tissue bones then We garmented the bones in flesh; thereafter We produced him as another creature. So blessed be God, the fairest of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then fashioned We the drop a clot, then fashioned We the clot a little lump, then fashioned We the little lump bones, then clothed the bones with flesh, and then produced it as another creation. So blessed be Allah, the Best of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We developed that drop into a clinging form, and We developed that form into a lump of flesh, and We developed that lump into bones, and clothed the bones with flesh. Then We brought him into being as a new creation, glory be to God, the best of creators,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "-Thereafter We created the sperm a clot; then We created the clot a lump of flesh; then We created the lump of flesh bones; then We clothed the bones with flesh: thereafter We brought him forth as anot her creature. Blest then be Allah, the Best of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We created the drop of fluid as a clinging mass. Then We created the clinging mass as a fleshy tissue. Then We created the fleshy tissue as bones. Then We clothed the bones with flesh. Then We produced him as [yet] another creature. So blessed is Allah, the best of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the sperm into a clot of congealed blood; then of that clot We made a (foetus) lump; then we made out of that lump bones and clothed the bones with flesh; then we developed out of it another creature. So blessed be Allah, the best to create!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the Nutfah into a clot (a piece of thick coagulated blood), then We made the clot into a little lump of flesh, then We made out of that little lump of flesh bones, then We clothed the bones with flesh, and then We brought it forth as another creation. So blessed be Allah, the Best of creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We created of the drop, a clot (of congealed blood) and We created the clot into bitesize tissue, then We created the bitesize tissue into bones, thenWe clothed the bones with flesh, and then produced it an other creation. Blessed is Allah, the Best of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We developed the seed into a clot. Then We developed the clot into a lump. Then We developed the lump into bones. Then We clothed the bones with flesh. Then We produced it into another creature. Most Blessed is God, the Best of Creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the sperm-drop into a clinging clot, and We made the clot into a lump [of flesh], and We made [from] the lump, bones, and We covered the bones with flesh; then We developed him into another creation. So blessed is Allah, the best of creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:14] Then We transformed the drop [of semen] into a clot, congealed blood. Then We transformed the clot into a [little] lump of flesh (mudgha), a piece of flesh, about the size of what one would be able to chew (mā yumdagh). Then We transformed the lump of flesh into bones. Then We clothed the bones with flesh (a variant reading in both instances [instead of the plurals ‘izāman and al-‘izāma, ‘the bones’] is [singular] ‘azman [and ‘al-‘azma], ‘the bone’; and in all three instances above khalaqnā, means ‘We made it become’ [as opposed to ‘We created’]). Then We produced him as [yet] another creature, by breathing into him [Our] Spirit. So blessed be God, the best of creators!, that is, [the best of] determiners (the specificier noun for ahsana, ‘the best’, has been omitted because it is obvious: khalqan, ‘in terms of creation’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَلَقْنَا الْمُضْغَةَ عِظَامًا فَكَسَوْنَا الْعِظَامَ لَحْمًا ثُمَّ أَنْشَأْنَاهُ خَلْقًا آَخَرَ فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ (14)وحرف ( ثم ) في قوله : { ثم خلقنا النطفة علقة } للترتيب الرتْبي إذ كان خلق النطفة علقة أعجبَ من خلق النطفة إذ قد صُير الماء السائل دَماً جامداً فتغير بالكثافة وتبدل اللون من عواملَ أودعها الله في الرحم .ومن إعجاز القرآن العلمي تسمية هذا الكائن باسم العلَقة فإنه وضْع بديع لهذا الاسم إذ قد ثبت في علم التشريح أن هذا الجزء الذي استحالت إليه النطفة هو كائن له قوة امتصاص القوة من دم الأم بسبب التصاقه بعروق في الرحم تدفع إليه قوة الدم ، والعلقة : قطعة من دم عاقد .والمضغة : القطعة الصغيرة من اللحم مقدار اللقمة التي تمضغ . وقد تقدم في أول سورة الحج كيفية تخلق الجنين .وعطف جَعل العَلقةِ مُضغةً بالفاء لأن الانتقال من العلقة إلى المضغة يشبه تعقيب شيء عن شيء إذ اللحم والدم الجامد متقاربان فتطورهما قريب وإن كان مكث كل طورٍ مدة طويلة .وخلق المضغة عظاماً هو تكوين العظام في داخل تلك المضغة وذلك ابتداء تكوين الهيكل الإنساني من عظم ولحم ، وقد دل عليه قوله : { فكسونا العظام لحماً } بفاء التفريع على الوجه الذي قرر في عطف { فخلقنا المضغة } بالفاء .فمعنى { فَكَسَوْنا } أن اللحم كانَ كالكسوة للعظام ولا يقتضي ذلك أن العظام بقيت حيناً غير مكسوة ، وفي الحديث الصحيح : « إن أحدكم يُجمع خلقه في بطن أمه أربعين يوماً نطفة ثم يكون علقة مثلَ ذلك ثم يكون مضغة مثل ذلك ثم يرسل إليه الملَك فَيَنْفُخُ فيه الروحَ » الحديث ، فإذا نُفخ فيه الروح فقد تهيأ للحياة والنماء وذلك هو المشار إليه بقوله تعالى : { ثم أنشأناه خلقاً آخر } لأن الخلق المذكور قبله كان دون حياة ثم نشأ فيه خَلق الحياة وهي حالة أخرى طرأت عليه عبر عنها بالإنشاء .وللإشارة إلى التفاوت الرتبي بين الخلقين عطف هذا الإنشاء ب ( ثم ) الدالة على أصل الترتيب في عطف الجمل ب ( ثم ) .وهذه الأطوار التي تعرضت لها الآية سبعة أطوار فإذا تمت فقد صار المتخلِّق حياً ، وفي «شرح الموطأ» : «تناجى رجلان في مجلس عمر بن الخطاب وعليٌّ حاضر فقال لهما عمر : ما هذه المناجاة؟ فقال أحدهما : إن اليهود يزعمون أن العزل هو الموءودة الصغرى ، فقال علي : لا تكون موءودة حتَّى تمرّ عليها التارات السبع { ولقد خلقنا الإنسان من سلالة من طين } الآية ، فقال عُمرُ لعليّ : صدقت أطال الله بقاءك» . فقيل : إن عمر أول من دعا بكلمة «أطال الله بقاءك» .وقرأ الجمهور { فخلقنا المضغة عظاماً فكسونا العظام } بصيغة جمع { العظام } فيهما . وقرأه ابن عامر وأبو بكر عن عاصم { عظماً . . والعَظْمَ } بصيغة الإفراد .وفُرع على حكاية هذا الخلق العجيب إنشاء الثناء على الله تعالى بأنه { أحسن الخالقين } أي أحسن المنشئين إنشاءً ، لأنه أنشأ ما لا يستطيع غيره إنشاءه .ولما كانت دلالة خلق الإنسان على عظم القدرة أسبق إلى اعتبار المعتبر كان الثناء المعقب به ثناء على بديع قدرة الخالق مشتقاً من البركة وهي الزيادة .وصيغة تفاعَل صيغة مطاوعة في الأصل ، وأصل المطاوعة قبول أثر الفعل ، وتستعمل في لازم ذلك وهو التلبس بمعنى الفعل تلبساً مكيناً لأن شأن المطاوعة أن تكون بعد معالجة الفعل فتقتضي ارتساخ معنى الفعل في المفعول القابل له حتى يصير ذلك المفعول فاعلاً فيقال : كسرته فتكسر ، فلذلك كان تفاعَل إذا جاء بمعنى فَعَل دالاًّ على المبالغة كما صرح به الرضيّ في «شرح الشافية» ، ولذلك تتفق صيغ المطاوعة وصيغ التكلف غالباً في نحو : تثنَّى . وتكبَّرَ ، وتشامخ ، وتقاعس . فمعنى { تبارك الله } أنه موصوف بالعظمة في الخير ، أي عظمةِ ما يقدره من خير للناس وصلاح لهم .وبهذا الاعتبار تكون الجملة تذييلاً لأن { تبارك } لما حذف متعلقه كان عاماً فيشمل عظمة الخير في الخلق وفي غيره . وكذلك حذف متعلق { الخالقين } يعم خلق الإنسان وخلق غيره كالجبال والسماوات .\n\n",
      "translations": [
        {
          "translation": "(Then fashioned We) then We transformed (the drop) into (a clot) for another forty days, (then fashioned We) then We transformed (the clot) into (a little lump) for forty days, (then fashioned We) the We transformed (the little lump) into (bones) without flesh, (then clothed the bones with flesh) joints, veins and other things, (and then produced it another creation) and then We placed in it the spirit. (So blessed be Allah, the Best of Creators) the Best of Transformers!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ أَنشَأْنَاهُ خَلْقاً آخَرَ } يعني نَفخُ الروحِ فيهِ\n ويقال نَبتُ سِنهِ، وشَعرِ رَأسِهِ، ولحيتِه، وأُبطهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Then We created him as another creature} [means] the blowing of the soul into him.\n He is said to have a beard, head hair, mustache, and pubic hair.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما مكناها في المقر المكين مدة { خَلَقْنَا } وصيرنا { ٱلنُّطْفَةَ } المقررة المتمكنة في الرحم { عَلَقَةً } أي: لحماً متصلاً ملتصقاً أجزاؤها إلى حيث صارت قابلة للمضغ { فَخَلَقْنَا } بعد ذلك { ٱلْعَلَقَةَ مُضْغَةً } المتلصقة المتصلة بعد انفصالها وتفريقهما التقديري { فَخَلَقْنَا ٱلْمُضْغَةَ عِظَاماً } صلبةً خارجة عن قابلية المضغ والتليين\n متقومة غير مائلة لتكون قوائم وأعمدة للجسم { فَكَسَوْنَا ٱلْعِظَامَ } الصلبة القابلة للكسر والانكسار { لَحْماً } لحماً صوناً لها عما يضرها ويكسرها\n فتم حنيئذٍ تركيب صورته الجسمية وقالب الطبيعية بجميع لوازمها ومتمماتها من العروق والعظام والأعصاب والغضاريف والشريانات وغيرها { ثُمَّ } بعدما تم تركيبه وكمل مزاجه وتصويره على أبدع وجه وأعجبه\n وصار حيواناً حساساً متحركاً بالإرادة كسائر الحيوانات { أَنشَأْنَاهُ } أي: أبدعناه واخترعناه فيه خاصة { خَلْقاً آخَرَ } إبداعياً مخصوصاً بهذا الجسم بين سائر الأجسام\n وهو نفخنا فيه من روحنا ليتصف بأوصافنا ويتخلق بأخلاقنا ويستحق بخلافتنا ونيابتنا\n ويليق لأن يصير مرآة لنا قابلة لانعكاس أضلال أسمائنا الحسنى وأوصافنا العليا { فَتَبَارَكَ } أي: تعالى وتعاظم { ٱللَّهُ } القادر المقتدر بالقدرة الكاملة على أمثال هذه التبدلات والتطورات التي تحيرت العقول عندها\n وانحسرت الأفهام دونها\n وهو في ذاته { أَحْسَنُ ٱلْخَالِقِينَ } [المؤمنون: 14] المقدرين تقديراً وخلقاً\n وأتمها إبداعاً واختراعاً لو فرض مقدرُ غيره\n مع أنه محال عقلاءً وعادة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ومنه { ثُمَّ خَلَقْنَا ٱلنُّطْفَةَ عَلَقَةً } \n ومن بعده\n يقول الحق جل جلاله: { ولقد خلقنا الإنسان } جنس الإنسان\n أو آدم\n { من سُلالةٍ } \" من \": للابتداء\n والسلالة: الخُلاصة لأنها تسل من بين الكدر\n وهو ما سُلَّ من الشيء واستخرج منه\n فإن فُعالة اسم لما يحصل من الفعل\n فتارة يكون مقصوداً منه\n كالخُلاصة\n وتارة غير مقصود\n كالقُلامة والكناسة\n والسلالة من قبيل الأول فإنها مقصودة بالسَّل\n وقيل: إنما سمي التراب الذي خُلق منه آدم سلالة\n لأنه سُلّ من كل تربة\n وقوله: من طين\n بيان\n متعلقة بمحذوف\n صفة للسلالة\n أي: خلقناه من سلالة كائنة من طين\n { ثم جعلناه } أي: الجنس\n باعتبار أفراده المتغايرة لآدم عليه السلام\n وجعلنا نسله\n على حذف مضاف\n إن أُريد بالإنسان آدم\n فيكون كقوله تعالى:\n[السجدة: 8\n7] أي: جعلنا نسله { نطفة }: ماءً قليلاً { في قرار مكين } أي: في مستقر - وهو الرحم - مكين: حصين\n أو متمكن فيه\n وَصف الرحم بصفة ما استقر فيه\n مثل طريق سائر\n أي: مسير فيه\n { ثم خلقنا النطفة علقة } أي: دماً جامداً\n بأن جعلنا النطفة البيضاء علقة حمراء\n { فخلقنا العلقة مُضغة } أي: قطعة لحم لا استبانةَ ولا تمايز فيها { فخلقنا المضغة } أي: غالبها ومعظمها\n أو كلها { عظاماً } \n بأن صلبناها\n وجعلناها عَموداً على هيئةٍ وأوضاع مخصوصة\n تقتضيها الحكمة\n { فكسونا العظام } المعهودة { لحما } بأن أنبتنا عليها اللحم\n فصار لها كاللباس\n أو كسونا كل عظم من تلك العظام ما يليق به من اللحم\n على مقدار لائق به\n وهيئة مناسبة\n وقرئ بالإفراد فيهما\n اكتفاء بالجنس\n وبتوحيد الأول فقط\n وبتوحيد الثاني فحسب\n { ثم أنشأناه خلقاً آخر } أي: خلقاً مبايناً للخلق الأول\n حيث جعله حيواناً\n وكان جماداً\n وناطقاً وسميعاً وبصيراً\n وكان بضد هذه الصفات\n ولذلك قال الفقهاء: من غصب بيضة فأفرخت عنده ضمِّنَ البيضة\n ولم يَرُدّ الفرخ لأنه خلق آخر سوى البيضة\n { فتبارك الله أحسن الخالقين } أي: فتعالى أمره في قدرته الباهرة\n وعلمه الشامل\n والالتفات إلى الإسم الجليل لتربية المهابة\n وإدخال الروعة\n والإشعار بأنَّ ما ذكر من الأفاعيل العجيبة من أحكام الألوهية\n وللإيذان بأنَّ من حق كل من سمع ما فصَّل من آثار قدرته تعالى أو لاحظه\n أن يسارع إلى التكلم به\n إجلالاً وإعظاماً لشؤونه تعالى\n وقوله: أحسن الخالقين: بدل اسم الجلالة\n أو نعت\n على أنَّ الإضافة محضة ليطابقه في التعريف\n أو خبر\n أي: هو أحسن الخالقين خلقاً\n أي: أحسن المقدرين تقديراً\n فحذف التمييز لدلالة الخالقين عليه\n\nقيل: إنَّ عبدَ اللهِ بنَ أبي سَرْح كان يَكْتُبُ الوحيَ للنبي صلى الله عليه وسلم\n فلمَّا انتهى - عليه الصلاة والسلام - إلى قوله: { خلقا آخَر } \n سَاَرَعَ عبدُ الله إلى النُطقِ بِذَلِكَ\n فَنَطَقَ بذلِكَ\n قبل إِمْلاَئِهِ\n فَقَالَ له رسُول الله صلى الله عليه وسلم\n \" اكْتبْ\n هَكَذَا أُنْزِلَتْ \" \nفَشَكَّ عبدُ الله\n فَقَالَ: إنْ كانَ مُحمدٌ يُوحَى إليْهِ\n فَأَنَا يُوحَى إليَّ\n فارتدَّ ولَحِق بمكَّةَ كافِراً\n ثم أَسْلَمَ يَوْمَ الفَتْحِ\n وقيل: الحكاية غير صحيحة لأن ارتداده كان بالمدينة\n والسورة مكية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:5",
      "similarity": 0.33931806752474447
    },
    {
      "verse": "4:5",
      "similarity": 0.27127154099177514
    },
    {
      "verse": "75:38",
      "similarity": 0.26524353839762654
    },
    {
      "verse": "96:2",
      "similarity": 0.26254680124411145
    },
    {
      "verse": "40:67",
      "similarity": 0.253001349093096
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/023014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/023014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}