{
  "chapter": "المؤمنون",
  "text": "ثم خلقنا النطفة علقة فخلقنا العلقة مضغة فخلقنا المضغة عظما فكسونا العظم لحما ثم انشانه خلقا ءاخر فتبارك الله احسن الخلقين",
  "translations": [
    {
      "translation": "then formed the drop into a clot and formed the clot into a lump and formed the lump into bones and clothed the bones in flesh; and then brought him into being as another creature. Blessed be Allah, the Best of Creators!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We fashioned the sperm into an embryo, then fashioned the embryo into a shapeless lump of flesh; then from the lump of flesh We fashioned bones, then clothed the bones with flesh. Thus We formed him into a new creation. So blessed be God the best of Creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We made this drop into a clot, then We made the clot into a lump, then We made the lump into bones, then We clothed the bones with flesh, and then We caused it to grow into another creation. Thus Most Blessed is Allah, the Best of all those that create.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The living germ, then, was turned into a shapeless lump of flesh from which bones were formed. The bones, then, were covered with flesh. At this stage, We caused it to become another creature. All blessings belong to God, the best Creator.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then turned the drop of fluid into a clot of blood, then the clot into a small lump of flesh, then the lump into bones, then covered the bones with flesh; then developed it in a different mould; therefore Most Auspicious is Allah, the Best Creator.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the Nutfah into a clot, then We made the clot into a little lump of flesh, then We made out of that little lump of flesh bones, then We clothed the bones with flesh, and then We brought it forth as another creation. So Blessed is Allah, the Best of creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the seed a clot, then We made the clot a lump of flesh, then We made (in) the lump of flesh bones, then We clothed the bones with flesh, then We caused it to grow into another creation, so blessed be Allah, the best of the creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We created of the drop a clot then We created of the clot a tissue then We created of the tissue bones then We garmented the bones in flesh; thereafter We produced him as another creature. So blessed be God, the fairest of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then fashioned We the drop a clot, then fashioned We the clot a little lump, then fashioned We the little lump bones, then clothed the bones with flesh, and then produced it as another creation. So blessed be Allah, the Best of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We developed that drop into a clinging form, and We developed that form into a lump of flesh, and We developed that lump into bones, and clothed the bones with flesh. Then We brought him into being as a new creation, glory be to God, the best of creators,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "-Thereafter We created the sperm a clot; then We created the clot a lump of flesh; then We created the lump of flesh bones; then We clothed the bones with flesh: thereafter We brought him forth as anot her creature. Blest then be Allah, the Best of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We created the drop of fluid as a clinging mass. Then We created the clinging mass as a fleshy tissue. Then We created the fleshy tissue as bones. Then We clothed the bones with flesh. Then We produced him as [yet] another creature. So blessed is Allah, the best of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the sperm into a clot of congealed blood; then of that clot We made a (foetus) lump; then we made out of that lump bones and clothed the bones with flesh; then we developed out of it another creature. So blessed be Allah, the best to create!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the Nutfah into a clot (a piece of thick coagulated blood), then We made the clot into a little lump of flesh, then We made out of that little lump of flesh bones, then We clothed the bones with flesh, and then We brought it forth as another creation. So blessed be Allah, the Best of creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We created of the drop, a clot (of congealed blood) and We created the clot into bitesize tissue, then We created the bitesize tissue into bones, thenWe clothed the bones with flesh, and then produced it an other creation. Blessed is Allah, the Best of creators!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We developed the seed into a clot. Then We developed the clot into a lump. Then We developed the lump into bones. Then We clothed the bones with flesh. Then We produced it into another creature. Most Blessed is God, the Best of Creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made the sperm-drop into a clinging clot, and We made the clot into a lump [of flesh], and We made [from] the lump, bones, and We covered the bones with flesh; then We developed him into another creation. So blessed is Allah, the best of creators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:14] Then We transformed the drop [of semen] into a clot, congealed blood. Then We transformed the clot into a [little] lump of flesh (mudgha), a piece of flesh, about the size of what one would be able to chew (mā yumdagh). Then We transformed the lump of flesh into bones. Then We clothed the bones with flesh (a variant reading in both instances [instead of the plurals ‘izāman and al-‘izāma, ‘the bones’] is [singular] ‘azman [and ‘al-‘azma], ‘the bone’; and in all three instances above khalaqnā, means ‘We made it become’ [as opposed to ‘We created’]). Then We produced him as [yet] another creature, by breathing into him [Our] Spirit. So blessed be God, the best of creators!, that is, [the best of] determiners (the specificier noun for ahsana, ‘the best’, has been omitted because it is obvious: khalqan, ‘in terms of creation’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then fashioned We) then We transformed (the drop) into (a clot) for another forty days, (then fashioned We) then We transformed (the clot) into (a little lump) for forty days, (then fashioned We) the We transformed (the little lump) into (bones) without flesh, (then clothed the bones with flesh) joints, veins and other things, (and then produced it another creation) and then We placed in it the spirit. (So blessed be Allah, the Best of Creators) the Best of Transformers!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ أَنشَأْنَاهُ خَلْقاً آخَرَ } يعني نَفخُ الروحِ فيهِ\n ويقال نَبتُ سِنهِ، وشَعرِ رَأسِهِ، ولحيتِه، وأُبطهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Then We created him as another creature} [means] the blowing of the soul into him.\n He is said to have a beard, head hair, mustache, and pubic hair.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما مكناها في المقر المكين مدة { خَلَقْنَا } وصيرنا { ٱلنُّطْفَةَ } المقررة المتمكنة في الرحم { عَلَقَةً } أي: لحماً متصلاً ملتصقاً أجزاؤها إلى حيث صارت قابلة للمضغ { فَخَلَقْنَا } بعد ذلك { ٱلْعَلَقَةَ مُضْغَةً } المتلصقة المتصلة بعد انفصالها وتفريقهما التقديري { فَخَلَقْنَا ٱلْمُضْغَةَ عِظَاماً } صلبةً خارجة عن قابلية المضغ والتليين، متقومة غير مائلة لتكون قوائم وأعمدة للجسم { فَكَسَوْنَا ٱلْعِظَامَ } الصلبة القابلة للكسر والانكسار { لَحْماً } لحماً صوناً لها عما يضرها ويكسرها، فتم حنيئذٍ تركيب صورته الجسمية وقالب الطبيعية بجميع لوازمها ومتمماتها من العروق والعظام والأعصاب والغضاريف والشريانات وغيرها { ثُمَّ } بعدما تم تركيبه وكمل مزاجه وتصويره على أبدع وجه وأعجبه، وصار حيواناً حساساً متحركاً بالإرادة كسائر الحيوانات { أَنشَأْنَاهُ } أي: أبدعناه واخترعناه فيه خاصة { خَلْقاً آخَرَ } إبداعياً مخصوصاً بهذا الجسم بين سائر الأجسام، وهو نفخنا فيه من روحنا ليتصف بأوصافنا ويتخلق بأخلاقنا ويستحق بخلافتنا ونيابتنا، ويليق لأن يصير مرآة لنا قابلة لانعكاس أضلال أسمائنا الحسنى وأوصافنا العليا { فَتَبَارَكَ } أي: تعالى وتعاظم { ٱللَّهُ } القادر المقتدر بالقدرة الكاملة على أمثال هذه التبدلات والتطورات التي تحيرت العقول عندها، وانحسرت الأفهام دونها، وهو في ذاته { أَحْسَنُ ٱلْخَالِقِينَ } [المؤمنون: 14] المقدرين تقديراً وخلقاً، وأتمها إبداعاً واختراعاً لو فرض مقدرُ غيره، مع أنه محال عقلاءً وعادة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" خلق \": إن كان بمعنى اخترع وأحدث تعدى إلى واحد، وإن كان بمعنى صَيَّر تعدى إلى مفعولين، ومنه { ثُمَّ خَلَقْنَا ٱلنُّطْفَةَ عَلَقَةً } ، ومن بعده\n يقول الحق جل جلاله: { ولقد خلقنا الإنسان } جنس الإنسان، أو آدم، { من سُلالةٍ } \" من \": للابتداء، والسلالة: الخُلاصة لأنها تسل من بين الكدر، وهو ما سُلَّ من الشيء واستخرج منه، فإن فُعالة اسم لما يحصل من الفعل، فتارة يكون مقصوداً منه، كالخُلاصة، وتارة غير مقصود، كالقُلامة والكناسة، والسلالة من قبيل الأول فإنها مقصودة بالسَّل، وقيل: إنما سمي التراب الذي خُلق منه آدم سلالة، لأنه سُلّ من كل تربة\n وقوله: من طين، بيان، متعلقة بمحذوف، صفة للسلالة، أي: خلقناه من سلالة كائنة من طين\n { ثم جعلناه } أي: الجنس، باعتبار أفراده المتغايرة لآدم عليه السلام، وجعلنا نسله، على حذف مضاف، إن أُريد بالإنسان آدم، فيكون كقوله تعالى:\n\n[السجدة: 8،7] أي: جعلنا نسله { نطفة }: ماءً قليلاً { في قرار مكين } أي: في مستقر - وهو الرحم - مكين: حصين، أو متمكن فيه، وَصف الرحم بصفة ما استقر فيه، مثل طريق سائر، أي: مسير فيه\n { ثم خلقنا النطفة علقة } أي: دماً جامداً، بأن جعلنا النطفة البيضاء علقة حمراء، { فخلقنا العلقة مُضغة } أي: قطعة لحم لا استبانةَ ولا تمايز فيها { فخلقنا المضغة } أي: غالبها ومعظمها، أو كلها { عظاماً } ، بأن صلبناها، وجعلناها عَموداً على هيئةٍ وأوضاع مخصوصة، تقتضيها الحكمة، { فكسونا العظام } المعهودة { لحما } بأن أنبتنا عليها اللحم، فصار لها كاللباس، أو كسونا كل عظم من تلك العظام ما يليق به من اللحم، على مقدار لائق به، وهيئة مناسبة\n وقرئ بالإفراد فيهما، اكتفاء بالجنس، وبتوحيد الأول فقط، وبتوحيد الثاني فحسب\n { ثم أنشأناه خلقاً آخر } أي: خلقاً مبايناً للخلق الأول، حيث جعله حيواناً، وكان جماداً، وناطقاً وسميعاً وبصيراً، وكان بضد هذه الصفات، ولذلك قال الفقهاء: من غصب بيضة فأفرخت عنده ضمِّنَ البيضة، ولم يَرُدّ الفرخ لأنه خلق آخر سوى البيضة\n { فتبارك الله أحسن الخالقين } أي: فتعالى أمره في قدرته الباهرة، وعلمه الشامل\n والالتفات إلى الإسم الجليل لتربية المهابة، وإدخال الروعة، والإشعار بأنَّ ما ذكر من الأفاعيل العجيبة من أحكام الألوهية، وللإيذان بأنَّ من حق كل من سمع ما فصَّل من آثار قدرته تعالى أو لاحظه، أن يسارع إلى التكلم به، إجلالاً وإعظاماً لشؤونه تعالى، وقوله: أحسن الخالقين: بدل اسم الجلالة، أو نعت، على أنَّ الإضافة محضة ليطابقه في التعريف، أو خبر، أي: هو أحسن الخالقين خلقاً، أي: أحسن المقدرين تقديراً، فحذف التمييز لدلالة الخالقين عليه\n\n\nقيل: إنَّ عبدَ اللهِ بنَ أبي سَرْح كان يَكْتُبُ الوحيَ للنبي صلى الله عليه وسلم، فلمَّا انتهى - عليه الصلاة والسلام - إلى قوله: { خلقا آخَر } ، سَاَرَعَ عبدُ الله إلى النُطقِ بِذَلِكَ، فَنَطَقَ بذلِكَ، قبل إِمْلاَئِهِ، فَقَالَ له رسُول الله صلى الله عليه وسلم\n\n \" اكْتبْ، هَكَذَا أُنْزِلَتْ \" \n\nفَشَكَّ عبدُ الله، فَقَالَ: إنْ كانَ مُحمدٌ يُوحَى إليْهِ، فَأَنَا يُوحَى إليَّ، فارتدَّ ولَحِق بمكَّةَ كافِراً، ثم أَسْلَمَ يَوْمَ الفَتْحِ\n وقيل: الحكاية غير صحيحة لأن ارتداده كان بالمدينة، والسورة مكية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:5",
      "similarity": 0.33931806752474447
    },
    {
      "verse": "4:5",
      "similarity": 0.27127154099177514
    },
    {
      "verse": "75:38",
      "similarity": 0.26524353839762654
    },
    {
      "verse": "96:2",
      "similarity": 0.26254680124411145
    },
    {
      "verse": "40:67",
      "similarity": 0.253001349093096
    }
  ]
}