{
  "chapter": "المؤمنون",
  "text": "الم تكن ءايتى تتلى عليكم فكنتم بها تكذبون",
  "translations": [
    {
      "translation": "'Were My Signs not recited to you and did you not deny them?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were not My messages read out to you? But you denied them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you not those to whom My revelations were recited, and you dubbed them as lies?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will be told), \"Were Our revelations not recited to you and did you not call them lies?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Were not My verses recited to you, so you used to deny them?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were not My Ayat recited to you, and then you used to deny them\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were not My communications recited to you? But you used to reject them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, were My signs not recited to you, and you cried them lies?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said): Were not My revelations recited unto you, and then ye used to deny them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were not My messages recited to you and did you not reject them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have not My revelations been rehearsed unto you, and them ye have been belying?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Was it not that My signs were recited to you but you would deny them?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were not My Signs rehearsed to you, and ye did but treat them as falsehood?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were not My Verses (this Quran) recited to you, and then you used to deny them?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We shall say): 'Were My verses not recited to you, and did you not belie them'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Were not My revelations recited to you, and you kept on rejecting them?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It will be said]. \"Were not My verses recited to you and you used to deny them?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:105] ‘Were not My signs, in the Qur’ān, recited to you, were you [not] threatened therewith, and you used to deny them?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah says to them: (Were not My revelations) the Qur'an (recited unto you) in the life of the world, (and then ye used to deny them) and you used to disbelieve in the revelations?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومتى تضرعوا وتفزعوا، وبثُّوا الشكوى إلى الله قيل لهم من قِبل الحق: { أَلَمْ تَكُنْ آيَاتِي } الدالةُ على عظة ذاتي، وكمال قدرتي على الأنعام والانتقام { تُتْلَىٰ عَلَيْكُمْ } حين ابتليناكم في النشأة الأولى { فَكُنْتُمْ } من غاية غفلتكم وضلالكم { بِهَا تُكَذِّبُونَ } [المؤمنون: 105] وتنكرون عناداً واستكباراً، فالآن لحقكم وعرض عليكم ما أنكرتم له وأعرضتم عنه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nفيقال لهم - تعنيفاً وتذكيراً لما به استحقوا ما ابتلوا به: { ألم تكن آياتي } أي: القرآن { تُتْلَى عليكم } في الدنيا { فكنتم بها تُكذِّبون } حينئذٍ، فذوقوا وبال ما كنتم به تكذبون\n\n\nنسأل الله التوفيق والهداية\n الإشارة: قال الترمذي الحكيم: الأنساب كلها منقطعة إلا من كانت نسبته صحيحة في عبودية ربه، فإن تلك نسبة لا تنقطع أبداً، وتلك النسبة المفتخر بها، لا نسبة الأجناس من الآباء والأمهات والأولاد\n هـ\n وقال الورتجبي: عند المعاينة والمشاهدة بوجوده ونشر جوده، نسبهم هناك نسب المعرفة والمحبة الأزلية، واصطفائيته القدسية، لا يفتخرون بشيء دونه، من العرش إلى الثرى، ولا يتساءلون شغلاً بما هم فيه\n هـ\n ومعنى كلام الشيخين: أن العبد، إذا صحت نسبته إلى مولاه، وانقطع بكليته إليه، ورفض كل ما سواه، اتصلت نسبته، ودامت محبته وأنسه، ومن تعلق بغيره، وتودد إلى سواه، انقطع ذلك وانفصل، ومن النسب التي تتصل وتدوم، النسبة إلى أولياء الله، والتحبب إليهم وخدمتهم، وهي في الحقيقة من نسبة الله تعالى لأنها سبب معرفته والتحقق بعبوديته، فهي عينها، فمن انتسب إليهم فقد انتسب إلى الله، ومن أحبهم فإنما أحب الله، فمحبتهم، والاجتماع معهم يؤدي إلى محبة الله ورضوانه، وهم الذين يكونون عن يمين الرحمن، يغشى نورُهُم الناس يوم القيامة، يغبطهم النبيون والشهداء لمنزلتهم عند الله\n قال عليه الصلاة والسلام: لما سئل عنهم:\n\n \" هم رجال من قبائل شتى، يجتمعون على ذكر الله ومحبته \" \n\nأو كما قال صلى الله عليه وسلم كما في الحديث\n والله تعالى أعلم\n ثمَّ ذكر جواب أهل النار\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:252",
      "similarity": 0.6640725717190002
    },
    {
      "verse": "37:3",
      "similarity": 0.6638609214301883
    },
    {
      "verse": "3:58",
      "similarity": 0.6314757657033053
    },
    {
      "verse": "3:108",
      "similarity": 0.5638882760075865
    },
    {
      "verse": "28:53",
      "similarity": 0.5260544596556798
    }
  ]
}