{
  "chapter": "المؤمنون",
  "text": "انه كان فريق من عبادى يقولون ربنا ءامنا فاغفر لنا وارحمنا وانت خير الرحمين",
  "translations": [
    {
      "translation": "There was a group of My slaves who said, \"Our Lord, we have iman, so forgive us and have mercy on us. You are the Best of the Merciful.\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was a section among My creatures that said: 'O Lord, we believe. Forgive us and have mercy upon us, for You are the best of the merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are those that when a party of My servants said: 'Our Lord, we believe, so forgive us, and have mercy on us, for You are the Best of those that are merciful,'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was a group of my servants among you who always prayed: Lord, forgive us and grant us mercy; You are the best of those who show mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there was a group among My bondmen who said, 'Our Lord! We have accepted faith, therefore forgive us and have mercy on us, and You are the Best Among The Merciful.' ”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, there was a party of My servants who used to say: \"Our Lord! We believe, so forgive us and have mercy on us, for You are the Best of all who show mercy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely there was a party of My servants who said: O our Lord! we believe, so do Thou forgive us and have mercy on us, and Thou art the best of the Merciful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a party of My servants who said, \"Our Lord, we believe; therefore forgive us, and have mercy on us, for Thou art the best of the merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! there was a party of My slaves who said: Our Lord! We believe, therefor forgive us and have mercy on us for Thou art Best of all who show mercy;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among My servants, there were those who said, \"Lord, We believe, so forgive us and have mercy on us. You are the best one to show mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily there was a party of My bondmen who said: our Lord! we have believed, wherefore forgive us and have mercy upon us, and Thou art the Best of the merciful ones!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there was a part of My servants who would say, ‘‘Our Lord! We have believed. So forgive us, and have mercy on us, and You are the best of the merciful.’’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A part of My servants there was, who used to pray 'our Lord! we believe; then do Thou forgive us, and have mercy upon us: For Thou art the Best of those who show mercy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! There was a party of My slaves, who used to say: \"Our Lord! We believe, so forgive us, and have mercy on us, for You are the Best of all who show mercy!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among My worshipers there were a party who said: \"Lord, we believed. Forgive us and have mercy on us: You are the Best of the merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was a group of My servants who would say, `Our Lord, we have believed, so forgive us, and have mercy on us; You are the Best of the merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, there was a party of My servants who said, 'Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:109] Indeed there was a party of My servants — namely, the Emigrants — who would say, “Our Lord, we believe; therefore forgive us, and have mercy on us, for You are the best of the merciful”.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! there was a party of My) believing (slaves who said: Our Lord!) O our Lord! (We believe) in You, in Your Messenger and in Your Book, (therefore forgive us) our sins (and have mercy on us) by not punishing us (for Thou art Best of all who show mercy) You are more merciful towards us than our own parents;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأما تستحيون أيها المسرفون تذكروا ما أنتم عليه { إِنَّهُ } أي: إن شأنكم وأمركم في دنياكم { كَانَ فَرِيقٌ مِّنْ } خُلّص { عِبَادِي يَقُولُونَ } متضرعين متحننين نحونا راجعين العفو والرحمة منا بقولهم: { رَبَّنَآ } كما ربيتنا بأنواع الكرم { آمَنَّا } وصدقناك بالربوبية والألوهية { فَٱغْفِرْ لَنَا } ذنوبنا واستر لنا عيوبنا { وَٱرْحَمْنَا } تفضلاً علينا وامتناناً { وَأَنتَ خَيْرُ ٱلرَّاحِمِينَ } [المؤمنون: 109] إذ رحمتك بنا لا تُعَلَّلُ بغرضٍ منك وعوضٍ منا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم علل استحقاقهم لذلك العذاب بقوله: { إنه } أي: الأمر والشأن { كان فريق من عبادي } وهم المؤمنون، او الصحابة، أو أهل الصفة - رضوان الله تعالى عليهم أجمعين - { يقولون } في الدنيا: { ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين فاتخذتموهم سخريا } أي: هزواً، وهو مصدر سخر، زيدت فيه ياء النسب للمبالغة، وفيه الضم والكسر",
      "translations": []
    }
  ]
}