{
  "chapter": "المؤمنون",
  "text": "قالوا۟ لبثنا يوما او بعض يوم فسـل العادين",
  "translations": [
    {
      "translation": "They will say, 'We tarried there for a day or part of a day. Ask those able to count!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"A day or less than a day. Ask the enumerators of numbers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"We stayed for a day or part of a day. Ask of those who keep count of this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will reply. \"We remained for about a day or part of it, but ask those who have kept count\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “We stayed a day or part of a day, so ask those who keep count.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"We stayed a day or part of a day. Ask of those who keep account.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: We tarried a day or part of a day, but ask those who keep account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say, 'We have tarried a day, or part of a day; ask the numberers!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: We tarried by a day or part of a day. Ask of those who keep count!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"We stayed a day or part of a day. Ask those who have kept count.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "-They will say we tarried a day or part of a day; ask those who keep count.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘We remained for a day, or part of a day; yet ask those who keep the count.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"We stayed a day or part of a day: but ask those who keep account.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"We stayed a day or part of a day. Ask of those who keep account.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will reply: 'A day, or part of a day; ask those who have kept count'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “We remained a day, or part of a day; but ask those who keep count.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"We remained a day or part of a day; ask those who enumerate.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:113] They will say, ‘We tarried a day, or part of a day — they are uncertain thereof, deeming it shorter [than what it was] because of the gravity of the chastisement they are suffering. Yet ask those who keep count!’, namely, [ask] the angels who number the deeds of [all] creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ فَاسْأَلِ الْعَادِّينَ (113) والظاهر أن المراد بقولهم { يوماً أو بعض يوم } أنهم قدروا مدة مكثهم في باطن الأرض بنحو يوم من الأيام المعهودة لديهم في الدنيا كما دل عليه قوله تعالى في سورة الروم ( 55 ) { ويوم تقوم الساعة يقسم المجرمون ما لبثوا غير ساعة . } ولم يعرج المفسرون على تبيين المقصد من سؤالهم وإجابتهم عنه وتعقيبه بما يقرره في الظاهر . والذي لاح لي في ذلك أن إيقافهم على ضلال اعتقادهم الماضي جيء به في قالب السؤال عن مدة مكثهم في الأرض كناية عن ثبوت خروجهم من الأرض أحياءً وهو ما كانوا ينكرونه ، وكناية عن خطأ استدلالهم على إبطال البعث باستحالة رجوع الحياة إلى عظام ورفات .وهي حالة لا تقتضي مدة قرن واحد فكيف وقد أعيدت إليهم الحياة بعد أن بقوا قروناً كثيرة ، فذلك أدل وأظهر في سعة القدرة الإلهية وأدخل في إبطال شبهتهم إذ قد تبين بطلانها فيما هو أكثر مما قدروه من علة استحالة عود الحياة إليهم .وقد دل على هذا قوله في آخر الآية { أفحسبتم أنما خلقناكم عبثاً وأنكم إلينا لا ترجعون } \\[ المؤمنون : 115 \\] وقد ألجأهم الله إلى إظهار اعتقادهم قِصرَ المدة التي بقوها زيادة في تشويه خطإهم فإنهم لمّا أحسوا من أنفسهم أنهم صاروا أحياء كحياتهم الأولى وعاد لهم تفكيرهم القديم الذي ماتوا عليه ، وكانوا يتوهمون أنهم إذا فنيت أجسادهم لا تعود إليهم الحياة أوهمهم كمالُ أجسادهم أنهم ما مكثوا في الأرض إلا زمناً يسيراً لا يتغير في مثله الهيكل الجثماني فبنوا على أصل شبهتهم الخاطئة خطأ آخر .وأما قولهم : { فسئل العادين } فهو اعتراف بأنهم لم يضبطوا مدة مكثهم فأحالوا السائل على من يضبط ذلك من الذين يظنونهم لم يزالوا أحياء لأنهم حسبوا أنهم بعثوا والدنيا باقية وحسبوا أن السؤال على ظاهره فتبرأوا من عهدة عدم ضبط الجواب .\n\n",
      "translations": [
        {
          "translation": "(They will say: We tarried but a day) upon saying this, they will have some doubt, and therefore will say: (or part of a day). Then, they said: we do not know: (Ask of those who keep count!) i.e. the angels who record people's deeds; it is also said that this refers to the angel of death and his helpers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } مستقصرين مستحقرين: { لَبِثْنَا } عليها { يَوْماً أَوْ بَعْضَ يَوْمٍ } أي: بل بعض يوم بالنسبة إلى هذه الأيام الطوال التي كنا فيها مذنبين\n بل نسينا نحن مدة ما كنا عليها لغاية قصرها ولا نقدر عليها { فَسْئَلِ ٱلْعَآدِّينَ } [المؤمنون: 113] المعاصرين بنا من أهل القبول والسرور\n والموكَّلين علينا من الموكلين علينا من الملائكة\n المستحضرين لأعمارنا وأعمالنا وجميع ما كنا عليها من الأحوال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا لبثنا يوماً أو بعض يوم } \n استقصار لمدة لبثهم فيها بالنسبة إلى خلودهم\n ولِمَا هم فيه من عذابها لأن الممتحن يستطيل أيام محنته\n ويستقصر ما مر عليه من أيام الدعة\n { فاسْئَل العادِين } أي: المتمكنين من العد فإنا بما دُهمنا من العذاب بمعزل من العد\n أو الملائكة العادين لأعمار العباد وأعمالهم\n\n{ قال } الله تعالى\n أو الملك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:114",
      "similarity": 0.5118133830777125
    },
    {
      "verse": "30:56",
      "similarity": 0.4803688997547338
    },
    {
      "verse": "23:112",
      "similarity": 0.4753516300472432
    },
    {
      "verse": "37:144",
      "similarity": 0.4298071500826669
    },
    {
      "verse": "33:8",
      "similarity": 0.40207165878371826
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/023113.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/023113.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:113.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}