{
  "chapter": "المؤمنون",
  "text": "فاتخذتموهم سخريا حتى انسوكم ذكرى وكنتم منهم تضحكون",
  "translations": [
    {
      "translation": "But you made a mockery of them so that they made you forget to remember Me while you were laughing at them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you ridiculed them. So much so that out of (spite) for them you forgot to remember Me and laughed at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "you made a laughingstock of them and your hostility to them caused you to forget Me, and you simply kept laughing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You mocked and laughed at them until you forgot all about Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So you took them for a mockery until your mocking at them made you forget My remembrance, and you used to laugh at them!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you took them for a laughing stock, so much so that they made you forget My remembrance while you used to laugh at them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you took them for a mockery until they made you forget My remembrance and you used to laugh at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you took them for a laughing-stock, till they made you forget My remembrance, mocking at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But ye chose them for a laughing-stock until they caused you to forget remembrance of Me, while ye laughed at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you made a laughing stock of them to the point where it made you forget My remembrance; and you went on laughing at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then ye took them mockingly, so that they caused you to forget remembrance of Me, and at them ye were wont to laugh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you took them by ridicule until they made you forget My remembrance, and you used to laugh at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But ye treated them with ridicule, so much so that (ridicule of) them made you forget My Message while ye were laughing at them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you took them for a laughingstock, so much so that they made you forget My Remembrance while you used to laugh at them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you took them for laughingstock, mocking at them, until they caused you to forget My remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you made then a target of ridicule, until they made you forget My remembrance; and you used to laugh at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you took them in mockery to the point that they made you forget My remembrance, and you used to laugh at them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:110] But then you took them as an object of ridicule (read sukhriyyan or sikhriyyan, a verbal noun meaning ‘mockery’). Among those [ridiculed] were Bilāl [al-Habashī], Suhayb [al-Rūmī], ‘Ammār [b. Yāsir] and Salmān [al-Fārisī]; until they made you forget My remembrance, which you disregarded, as you were engaged in deriding them. Thus these [men] were the cause of the forgetting, which is why this [act] has been attributed to them, and you used to laugh at them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But ye chose them from a laughing stock until they caused you to forget remembrance of Me) until they preoccupied you from declaring My divine Oneness and worshipping Me, (while ye laughed at them) and mocked them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱتَّخَذْتُمُوهُمْ سِخْرِيّاً } معناه تَسخَرونَ مِنهم وسِخْرِيا: من السَّخرةِ، يُريدُ العَبيدَ والخَدَمَ، سَخَّرهُم لَهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومتى سمعتم مناجاتهم هذه، ودعاءهم هذا { فَٱتَّخَذْتُمُوهُمْ سِخْرِيّاً } وصرتم مستهزئين بأقوالهم وأعمالهم، متمادين في الهزء والسخرية، متوغلين في الغفلة والغرور { حَتَّىٰ أَنسَوْكُمْ } جهلَكم وغفلَتكم { ذِكْرِي } والتوجه نحوي، والرجوع إليِّ بل صرتم غافلين ذاهلين، محرومين عن كمال الإنسان، منحطين عن رتبة الخلافة، مستحقين لأنواع السخرية والضحكة { وَ } مع ذلك { كُنْتُمْ مِّنْهُمْ تَضْحَكُونَ } [المؤمنون: 110] مع أنهم ساعون نحونا، سالكون في طريق توحيدنا، طالبون الوصول إلى ما هم جبلوا لأجله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقال الكوفيون: المكسور بمعنى الهزء، والمضموم من السخرة، بمعنى الانقياد للخدمة، ولذلك اتفق عليه في الزخرف، أي: اتخذتموهم مهزواً بهم، وتشاغلتم بهم { حتى أَنْسَوْكم ذكري } ، من فرط اشتغالكم بالاستهزاء بهم، ولم تخافوني في أوليائي، { وكنتم منهم تضحكون } ، وذلك غاية الاستهزاء",
      "translations": []
    }
  ]
}