{
  "chapter": "المؤمنون",
  "text": "قل ان لبثتم الا قليلا لو انكم كنتم تعلمون",
  "translations": [
    {
      "translation": "He will say, 'You only tarried there for a little while if you did but know!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: \"You stayed there only a moment, if you knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: \"You stayed only for a while, if you only knew that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say, \"You have indeed remained there for a short time. Would that you knew it during your life time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, “You stayed but only a little, if you knew.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: \"You stayed not but a little, if you had only known!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: You did tarry but a little-- had you but known (it):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He shall say, 'You have tarried but a little, did you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: Ye tarried but a little if ye only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, \"You only stayed for a little while, if only you knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: ye tarried a little indeed; would that ye had known that:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, ‘You only remained a little; if only you had known.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: \"Ye stayed not but a little,- if ye had only known!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) will say: \"You stayed not but a little, if you had only known!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: 'You have tarried a little, did you know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, “You remained only for a little while, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, \"You stayed not but a little - if only you had known.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:114] He, exalted, will say, to them, also by the tongue of Keeper [of Hell] (a variant reading [for qāla, ‘He will say’] has qul, ‘say’): ‘You tarried but a little, if only you knew, the length of time you tarried, [you would have realised that it is] trivial relative to how long you will tarry in the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He will say) Allah will say to them: (Ye tarried) you remained in your graves (but a little) in comparison to your dwelling in hell (if ye only knew) this; He says: if you only believe what I say; it is also said that this means: if only you did believe in My prophets in the life of the world, you would know now that you remained in your graves but a short time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } القائل المذكور في جوابهم تصديقاً لهم في مقالهم واستقلالهم: { إِن لَّبِثْتُمْ } أي: ما لبثتم فيها { إِلاَّ قَلِيلاً } قصيراً في غاية القلة والقصر { لَّوْ أَنَّكُمْ } أيها الضالون المسرفون { كُنتُمْ تَعْلَمُونَ } [المؤمنون: 114] في أنفسكم طول مدة العذاب وعدم تناهيها، لما اخترتم لأنفسكم ما يستجلب عليكم العذاب ويوقعكم فيه، ومع جهلكم هذا لم تقبلوه من الأنبياء العارفين الهادين أيضاً، بل أنكرتم عليهم واستهزأتم مستكبرين مستنكرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ قال } الله تعالى، أو الملك، تصديقاً لهم في مقالهم: { إن لبثتم إلاَّ قليلاً }: ما لبثتم إلا زماناً قليلاً أو لبثاً قليلاً بالنسبة لما بعده، { لو أنكم كنتم تعلمون } شيئاً، أو: لو كنتم من أهل العلم لعلمتم قلة لبثكم فيها، فالجواب محذوف\n والله تعالى أعلم\n الإشارة: إذا تميز المتحابون في الله، المجتمعون على ذكر الله ومحبته وطلب معرفته، وعُرفوا بأنوارهم وأسرارهم، وانحازوا إلى ظل العرش، يوم لا ظل إلا ظله، ورآهم البطالون المنكرون عليهم، وهم في حسرة الحساب، يقولون بلسان الحال أو المقال: ربنا غلبت علينا شقوتنا حيث لم نصحب هؤلاء الأولياء، وكنا قوماً ضالين، ربنا أخرجنا من هذه الحسرة، وردنا إلى الدنيا، فإن عدنا إلى البطالة والإنكار عليهم فإنا ظالمون، فيقال لهم: اخسؤوا فيها فقد فات الإبان، إنه كان فريق من عبادي، وهم المنتسبون من أهل التجريد، المتزيون بزي الصوفية أهل التفريد، يقولون: ربنا آمنا بطريق الخصوصية ودخلنا فيها، فاغفر لنا، أي: غط مساوئنا، وارحمنا رحمة تضمنا إلى حضرتك، وأنت خير الراحمين، فاتخذتموهم سخرياً، وانشغلتم بالوقوع فيهم، حتى أنسوكم ذكري، وكنتم منهم تضحكون، إني جزيتهم اليوم، بما صبروا، أنهم هم الفائزون بشهود ذاتي، والقرب من أحبابي، المتنزهون في كمال جمالي، في درجات المقربين من النبيين والصديقين\n قال القشيري: الحق ينتقم من أعدائه بما يُطَيَّبُ به قلوبَ أوليائه، وتلك خَصْمَةُ الحق، فيقول لهم: كان فريقٌ من أوليائي يُفْصِحون بمدحي وإطرائي، فاتخذتموهم سخرياً، فأنا اليوم أُجازيهم، وأنتقم ممن كان يناويهم\n هـ\n قوله تعالى: { قال كم لبثتم\n\n\n } إلخ، اعلم أن أيام الدنيا كلها تقصر عند انقضاء عمر العبد، فتعود كيوم واحد، أو بعض يوم، فإن أفضى إلى الراحة بعد الموت نسي أيام التعب، وغاب عنها، فتصير كأضغاث أحلام، وإن أفضى إلى التعب، نسي أيام الراحة كأنها طيف منام\n قال في الحاشية: الأشياء وإن كانت كثيرة فقد تنقص وتقل بالإضافة إلى ما يرجّى عليها كذلك مدة مقامهم تحت الأرض إن كانوا في الراحة فقد تقل، بالإضافة إلى الراحات التي يلقونها في القيامة، وإن كانت شديدة فقد تتلاشى في جنب رؤية ذلك اليوم لما فيه من أليم تلك العقوبات المتوالية\n هـ\n ثمَّ تممَّ توبيخيهم يوم القيامة\n",
      "translations": []
    }
  ]
}