{
  "chapter": "المؤمنون",
  "text": "فاوحينا اليه ان اصنع الفلك باعيننا ووحينا فاذا جاء امرنا وفار التنور فاسلك فيها من كل زوجين اثنين واهلك الا من سبق عليه القول منهم ولا تخطبنى فى الذين ظلموا۟ انهم مغرقون",
  "translations": [
    {
      "translation": "We revealed to him: 'Build the Ship under Our supervision and as We reveal. When Our command comes and water bubbles up from the earth, load into it a pair of every species, and your family - except for those among them against whom the word has already gone ahead. And do not address Me concerning those who do wrong. They shall be drowned.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We asked him to build the ark under Our eyes and guidance, (and said): \"When Our command is issued and the source of water boils over, put a pair of every species in it, and your family except those for whom Our sentence has been passed already; and do not speak to Me for those who are wicked: They will be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon We revealed to him, saying: \"Build the Ark under Our eyes and according to Our revelation. And when Our command comes to pass and the oven boils over, take on board a pair each from every species, and also take your household except those of them against whom sentence has already been passed and do not plead to Me on behalf of the wrong-doers. They are doomed to be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We inspired him, saying, \"Build the Ark before Our eyes and by the instruction of Our revelation. When our decree comes to pass and water comes forth from the Oven, embark in the Ark with a pair of every kind of animals and your family except those already doomed (to perish). Do not plead with Me for the unjust; they will be drowned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We sent him the divine revelation that, “Make the ship in front of Our sight, and by Our command – then when Our command comes and the oven overflows, embark in it two of every couple, and from your household except those upon whom the Word has been decreed; and do not speak to Me in respect of these unjust people; they will surely be drowned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We revealed to him: \"Construct the ship under Our Eyes and under Our revelation. Then, when Our command comes, and (water) gushes forth from the oven, take on board of each kind two, and your family, except those thereof against whom the Word has already gone forth. And address Me not in favor of those who have done wrong. Verily, they are to be drowned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We revealed to him, saying: Make the ark before Our eyes and (according to) Our revelation; and when Our command is given and the valley overflows, take into it of every kind a pair, two, and your followers, except those among them against whom the word has gone forth, and do not speak to Me in respect of those who are unjust; surely they shall be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We said to him, 'Make thou the Ark under Our eyes and as We reveal, and then, when Our command comes and the Oven boils, insert in it two of every kind and thy, family -- except for him against whom the word already has been spoken; and address Me not concerning those who have done evil; they shall be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We inspired in him, saying: Make the ship under Our eyes and Our inspiration. Then, when Our command cometh and the oven gusheth water, introduce therein of every (kind) two spouses, and thy household save him thereof against whom the Word hath already gone forth. And plead not with Me on behalf of those who have done wrong. Lo! they will be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We revealed Our will to him: \"Build the Ark under Our watchful eye according to Our instructions. When Our command comes, and waters gush up out of the earth, take on board pairs of every species and members of your household, except for any of them on whom sentence has already been passed -- do not plead with Me for those who have done wrong: they shall be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed unto him, saying: build the ark under Our eyes and Our Revelation; then when Our command cometh and the oven boileth over, make way therein of every pair two, and thy household save him thereof against whom there hath already gone forth the word; and address me not in respect of those who have done wrong; verily they are to be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We revealed to him: ‘Build the ark before Our eyes and by Our revelation. When Our edict comes and the oven gushes [a stream of water], bring into it a pair of every kind [of animal], and your family, except those of them against whom the decree has gone beforehand, and do not plead with Me for those who are wrongdoers: they shall indeed be drowned.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We inspired him (with this message): \"Construct the Ark within Our sight and under Our guidance: then when comes Our Command, and the fountains of the earth gush forth, take thou on board pairs of every species, male and female, and thy family- except those of them against whom the Word has already gone forth: And address Me not in favour of the wrong-doers; for they shall be drowned (in the Flood).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We inspired him (saying): \"Construct the ship under Our Eyes and under Our Revelation (guidance). Then, when Our Command comes, and the oven gushes forth water, take on board of each kind two (male and female), and your family, except those thereof against whom the Word has already gone forth. And address Me not in favour of those who have done wrong. Verily, they are to be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said to him: 'Make the Ark under Our Eye, and Our Revelation, and then when Our command comes and the oven gushes water, take onboard a pair from every kind and your family, except him against whom the decision has already been passed. Do not address Me concerning those who have done evil; they shall be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We inspired him: “Build the Ark under Our observation and by Our inspiration. And when Our decree comes to pass, and the oven boils over, load into it two pairs of every kind, together with your family, except those of them against whom the word has already been pronounced. And do not speak to me concerning those who did wrong; for they are to be drowned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We inspired to him, \"Construct the ship under Our observation, and Our inspiration, and when Our command comes and the oven overflows, put into the ship from each [creature] two mates and your family, except those for whom the decree [of destruction] has proceeded. And do not address Me concerning those who have wronged; indeed, they are to be drowned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:27] So We revealed to him [saying], ‘Build the Ark, the ship, under Our watch, under Our observation and protection, and [by] Our revelation, Our command. Then, when Our command comes, that they be destroyed, and the oven, of the baker, gushes, with water — and this was Noah’s sign — bring into it, admit into the ship, of every kind [of animal] two mates, a male and a female, that is, [two] of every species thereof (ithnayn is an object; min, ‘of’, is semantically connected to usluk, ‘bring into [it]’). According to the story God, exalted be He, gathered all the beasts of prey and the birds and other [animals] for Noah. As he [Noah] pushed forth his hands into each species, his right hand would fall upon a male and the left upon a female, whereafter he would take them on board the ship (a variant reading [for min kuli, ‘of every’] is min kullin, ‘of every [kind]’, in which case zawjayni, ‘[two] mates’, becomes a direct object, with ithnayn, ‘two’, [being repeated] for emphasis thereof); together with your family — his wife [?] and children — except for those against whom the Word has already gone forth, that they be destroyed, namely, his wife and his son Canaan (Kan‘ān), unlike Shem (Sām), Ham (Hām) and Japheth (Yāfith) whom, together with their three wives, he carried on board. In sūrat Hūd [the following is mentioned where Noah is told who he should carry in the ship]: ‘… and those who believe.’ And none believed with him except a few [Q. 11:40]. It is said that these were six men and their wives. Moreover it is said that all those who were on the ship numbered seventy eight, half of them were men and half were women. And do not plead with Me concerning those who have done wrong, those who have disbelieved, that I should refrain from destroying them. They shall indeed be drowned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We inspired in him) We sent Gabriel to him, (saying: Make the ship) saying: start building a ship (under Our eyes) under Our gaze (and Our inspiration) and through that which We inspired you. (Then, when Our command) Our punishment (cometh and the oven gusheth water) and the water gushes out of the oven (al-Tannur); it is also said that this means: when dawn breaks, (introduce therein) transport in the ship (of every (kind) two spouses) of every kind: a male and a female, (and thy household) and take those of your household who believe in you (save him thereof against whom the Word) that they will be chastised (hath already gone forth. And plead not with Me) by means of supplications (on behalf of those who have done wrong) i.e. to save those who disbelieved among your people: (Lo! they will be drowned) in the flood.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَفَارَ ٱلتَّنُّورُ } معناه ظَهرَ المَاءُ من مَسجدِ الكُوفةِ\n وقال: بالهند\n ويقال: على وَجهِ الأرضِ\n ويقال: طُلوعُ الفَجرِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And the light of the sun disappeared,\" means that the water emerged from the Mosque of Kufa.\n He said: \"To India\"\n\n\nIt is said that on the face of the earth\n It is said: The dawn has risen.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَوْحَيْنَآ إِلَيْهِ } أنجازاً لما أوعدنا إياهم من العذاب والهلاك بعد تكذيبهم رسلونا وما جاء به من عندنا من الإيمان والتوحيد { أَنِ ٱصْنَعِ ٱلْفُلْكَ } أي: أعمال السفينة\n ولا تخف عن فساها بعدم تعلمك من أحدٍ بل اصنعها { بِأَعْيُنِنَا } أي: يحفظنا إيَّاك نحفظك عن عروض الخطأ والفساد في صنعها { وَوَحْيِنَا } أي: بأمرنا وتعليمنا لك كيفية صنعها\n ولا تبال بتسفيههم واستهزائهم معك ونسيتك إلى الخبط والجنون وأنواع الأذيات { فَإِذَا جَآءَ أَمْرُنَا } الوجوبي المتعلق بإغراقهم واستئصالهم { وَفَارَ ٱلتَّنُّورُ } المعينُ المعهودُ\n فدلق ونبع الماء منه نبعةً { فَٱسْلُكْ } وأَدْخل على الفور فيها { فِيهَا } أي: في السفينة { مِن كُلٍّ زَوْجَيْنِ ٱثْنَيْنِ } أي: من نوع الحيوانات اثنين ذكراً وانثى\n إبقاءً لجميع الأنواع في العالم { وَ } اسلك أيضاً { أَهْلَكَ } ومن ينتمي إليك قرابةً وديناً { إِلاَّ مَن سَبَقَ عَلَيْهِ ٱلْقَوْلُ } والحكم منَّا في لوح قضائنا بأنه من الهالكين { مِنْهُمْ } أي: من أهلك\n أي: أَدْخِل جميع أهلك سوى من مضى قضاؤنا بغرقه وإهلاكه وهو ابنه كنعان { وَ } بعدما سبق قضاؤنا لإهلاك من كفر من أهلك { لاَ تُخَاطِبْنِي } يا نوح\n ولا تدعُ إليّ في حق من سبق الحكم مني بغرقه ولا تسع { فِي } خلاص القوم { ٱلَّذِينَ ظَلَمُوۤاْ } على أنفسهم بالعرض على عذابنا { إِنَّهُمْ مُّغْرَقُونَ } [المؤمنون: 27] معدودون من عدد الغرقى الهلكى\n ولا أثر لدعائك لهم بعدما صار الأمر منَّا مقضياً والحكم مبرماً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأوحينا إليه } أجبنا دعاءه وأوحينا إليه عند ذلك { أَنِ اصنعِ الفُلكَ بأعيننا } أي: ملتبساً بحفظنا وكلاءتنا\n كأنَّ معك حُفاظنا يكلؤونك بأعينهم\n لئلا يتعرض لك أحد\n يفسد عملك\n ومنه قولهم: عليه من الله عيون كالئة\n { ووَحْينا } أي: أمرنا وتعليمنا إياك صنعتها\n رُوي: أنه أوحى إليه أن يصنعها مثل جُؤْجؤ الطائر\n وفي القاموس جُؤجؤ - كَهُدْهُد-: الصدرُ\n { فإذا جاء أَمْرُنا } أي: عذابنا بأمرنا\n { وفار التنُّور } أي: فار الماء من تنور الخبز\n فخرج سبب الغرق من موضع الحرق ليكون أبلغ في الإنذار والإعتبار\n رُوي أنه قيل لنوح: إذا رأيت الماء يفور من التنور فاركب أنت وأهلك السفينة\n فلما نبع الماء من التنور أخبرته امرأته\n فركب\n وكان التنور تنورَ آدم\n فصار إلى نوح\n وكان من حجارة\n واختلف في مكانه\n فقيل: في مسجد الكوفة عن يمين الداخل\n وقيل: بالشام\n وقيل: بالهند\n فإذا فار { فاسْلُكْ فيها }: فَأَدْخِلْ في السفينة { من كل زوجين اثنين } من كل أمة اثنين مزدوجين\n ذكر وأنثى\n قال الحسن: لم يحمل نوح في السفينة إلا ما يلد ويبيض\n فأما البق والدود والزباب\n فلم يحمل منه شيئاً\n وإنما يخرج من الطير\n هـ\n { و } احمل في السفينة { أهلَك } نساءك وأولادك\n أو من آمن معك\n { إلا من سبق عليه القولُ منهم } أي: القول من الله بهلاكه\n وهو ابنه وإحدى زوجتيه\n وإنما جيء بعلى لكون السابق ضاراً\n كما جيء باللام في قوله:\n[الأنبياء: 101]\n\n[الصافات: 171] لكونه نافعاً\n ونحوه:\n[البقرة: 286]\n { ولا تخاطبني في الذين ظلموا إنهم مغرقون } أي: لا تسألني نجاة الذين كفروا\n إنهم مقضى عليهم بالإغراق لا محالة لظلمهم بالإشراك والإصرار\n ومَنْ هذا شأنه لا يُشفع له\n وكأنه عليه السلام ندم على الدعاء عليهم\n حين تحقق هلاكهم\n فهَمَّ بمراجعة الحق فيهم شفقة ورحمة\n فَنُهي عن ذلك\n ثم قال له: { فإِذا استويتَ أنت ومن معك على الفُلْك } فإذا تمكنتم عليها راكبين { فقل الحمد لله الذي نجَّانا من القوم الظالمين } \n أُمر بالحمد على هلاكهم والنجاة منهم على طريق:\n\n[الأنعام: 45]\n ولم يقل: فقولوا\n وإن كان أهله ومن معه قد استووا معه لأنه نبيهم وإمامهم\n فكان قوله قولَهم\n مع ما فيه من الإشعار بفضل النبوة\n { وقل ربِّ أنزلني } في السفينة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:40",
      "similarity": 0.8148077821026735
    },
    {
      "verse": "11:37",
      "similarity": 0.3519126721687235
    },
    {
      "verse": "3:125",
      "similarity": 0.2789935992536599
    },
    {
      "verse": "67:7",
      "similarity": 0.2572044993266042
    },
    {
      "verse": "11:38",
      "similarity": 0.14198017508337799
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/23:27.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/23:27.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/23:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}