{
  "chapter": "المؤمنون",
  "text": "وشجرة تخرج من طور سيناء تنۢبت بالدهن وصبغ للءاكلين",
  "translations": [
    {
      "translation": "and a tree springing forth from Mount Sinai yielding oil and a seasoning to those who eat.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The tree that grows on Mount Sinai yields oil and seasoning for those who eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We also produced the tree which springs forth from Mount Sinai, containing oil and sauce for those that eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have also created for you the tree that grows on Mount Sinai which produces oil and relish for those who use it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And created the tree that comes forth from Mount Sinai – that grows containing oil and curry for the eaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a tree that springs forth from Tur Sinai, that grows oil, and relish for the eaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a tree that grows out of Mount Sinai which produces oil and a condiment for those who eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and a tree issuing from the Mount of Sinai that bears oil and seasoning for all to eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a tree that springeth forth from Mount Sinai that groweth oil and relish for the eaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "also a tree growing on Mount Sinai which produces oil and a condiment for those who eat it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also a tree that springeth forth from mount Sinai, that groweth oil and is a sauce for the eaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and a tree that grows on Mount Sinai, which produces oil and a seasoning for those who eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also a tree springing out of Mount Sinai, which produces oil, and relish for those who use it for food.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a tree (olive) that springs forth from Mount Sinai, that grows oil, and (it is a) relish for the eaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also, a tree which grows on the Tor of Sinai and gives oil and relish for its eaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a tree springing out of Mount Sinai, producing oil, and seasoning for those who eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [We brought forth] a tree issuing from Mount Sinai which produces oil and food for those who eat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:20] And, We produced, a tree that grows on Mount of Sinai (read Sīnā’ or Saynā’, indeclinable as it is a proper noun with the feminine ending denoting a location) that produces (read either as tunbitu from the fourth form [anbata], or as tanbutu from the trilateral form [nabata]) oil (bi’l-duhni: in the case of the former [reading of tunbitu] the bā’ [bi-] here would be extra, whereas in the case of the second [reading of tanbutu], it would be [a preposition needed] for the transitive) — and this [tree] is the olive tree, and seasoning for those who eat (wa-sibghin li’l-ākilīna, a supplement to bi’l-duhni, ‘oil’, [that is to say] it is [like] a dye that colours a morsel dipped in it) — and this [seasoning] is the [olive] oil.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And a tree) and by means of water a tree grows, this refers to the olive tree (that springeth forth from Mount Sinai) that springs forth from the mountain which is covered with trees (that groweth oil and relish for the eaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِن طُورِ سَيْنَآءَ } قال: الطُّورُ: الجَبلُ\n وسيناءُ اسمُ موضعٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"From the Mount of Sinai\" - He said: The Mount of Sinai is the mountain.\n\n\nThe city of Aswan is located in Egypt.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لاسيما أنشأنا لكم بالماء { شَجَرَةً } مباركة { تَخْرُجُ } وتنشأ { مِن طُورِ سَيْنَآءَ } هو جبل رفيع بين مصر وأيلة { تَنبُتُ } ثمرة ملتبسة { بِٱلدُّهْنِ } المضيء للسرج { وَ } مع ذلك { صِبْغٍ } أي: إدام { لِّلآكِلِيِنَ } [المؤمنون: 20] لأنهم يغمسون أخبازهم فيه تأدماً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } أنبتنا به { شجرةً } هي الزيتون { تخرج من طُور سَيْناء } ، وهو جبل موسى عليه السلام بين مصر وأيلة، وقيل: بفلسطين، ويقال: فيه طور سنين، فإمَّا أن يكون الطور اسم الجبل، وسيناء اسم البقعة أضيف إليها، أو المركب منهما عَلَمٌ له، كامرئ القيس، وتخصيصها بالخروج منه، مع خروجها من سائر البقع، إما لتعظيمها، أو لأنه المنشأ الأصلي لها لأن أصل الزيتون من الشام، وأول ما نبت في الطور، ومنه نُقل إلى سائر البلاد، { تَنْبُتُ بالدُّهن } أي: متلبسة بالدهن، أي: ما يدهن به، وهو الزيت، { وصِبْغِ للآكلين } أي: إدام لهم، قال مقاتل: جعل الله في هذه إداماً ودُهناً، فالإدام: الزيتون، والدهن: الزيت\n\n\nوقيل: هي اول شجرة تنبت بعد الطوفان، وخص هذه الأنواع الثلاثة لأنها أكرم الشجر وأفضلها وأنفعها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:138",
      "similarity": 0.4086212304867729
    },
    {
      "verse": "56:81",
      "similarity": 0.22539280379279125
    },
    {
      "verse": "68:9",
      "similarity": 0.22398700754112744
    },
    {
      "verse": "55:37",
      "similarity": 0.21275146834291686
    },
    {
      "verse": "52:1",
      "similarity": 0.08992593951782395
    }
  ]
}