{
  "chapter": "المؤمنون",
  "text": "فاذا استويت انت ومن معك على الفلك فقل الحمد لله الذى نجىنا من القوم الظلمين",
  "translations": [
    {
      "translation": "When you and those with you are settled in the Ship, then say: \"Praise be to Allah who has rescued us from the people of the wrongdoers!\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you and those with you have boarded the ark, say: 'All praise be to God who has delivered us from the people who were sinful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then when you and those accompanying you are firmly seated in the Ark, say: \"Thanks be to Allah Who has delivered us from the wrong-doing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When all of you settle in the Ark, say, \"Only God Who has saved us from the unjust people deserves all praise\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And when you and those with you have safely boarded the ship say, ‘All praise is to Allah Who has rescued us from the unjust.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have embarked on the ship, you and whoever is with you, then say: `All the praise be to Allah, Who has saved us from the people who are wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you are firmly seated, you and those with you, in the ark, say: All praise is due to Allah who delivered us from the unjust people:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when thou art seated in the Ark and those with thee, say, \"Praise belongs to God, who has delivered us from the people of the evildoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou art on board the ship, thou and whoso is with thee, then say: Praise be to Allah Who hath saved us from the wrongdoing folk!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you and all your followers have settled in the Ark, say, \"Praise be to God who has delivered us from a wicked people,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou art settled, thou and those with thee, in the ark, say thou: praise unto Allah who hath delivered us from the wrong doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘When you, and those who are with you, are settled in the ark, say, ‘‘All praise belongs to Allah, who has delivered us from the wrongdoing lot.’’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou hast embarked on the Ark - thou and those with thee,- say: \"Praise be to Allah, Who has saved us from the people who do wrong.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have embarked on the ship, you and whoever is with you, then say: \"All the praises and thanks be to Allah, Who has saved us from the people who are Zalimun (i.e. oppressors, wrong-doers, polytheists, those who join others in worship with Allah, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you and all those with you are seated in the Ark, say: 'Praise be to Allah who has saved us from the harmdoing nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when you and those with you are settled in the Ark, say, “Praise be to God, who has saved us from the wrongdoing people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have boarded the ship, you and those with you, then say, 'Praise to Allah who has saved us from the wrongdoing people.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:28] And when you have settled, [when] you are balanced, in the Ark together with those with you, say, “Praise be to God Who has delivered us from the wrongdoing folk”, [from] the disbelievers and the destruction that   came upon them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when thou art on board the ship, thou and whoso is with thee) of the believers, (then say: Praise be to Allah) gratitude is due to Allah (Who hath saved us from the wrong-doing folk!) who has saved us from the disbelievers!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِذَا ٱسْتَوَيْتَ أَنتَ } يا نوح\n وتمكنت { وَمَن مَّعَكَ } من المؤمنين { عَلَى ٱلْفُلْكِ } وصرتم متمكنين متعززين عليها { فَقُلِ } شكراً لما أنعمنا عليك من إنجاز النصرة المعهودة الموعودة وإهلاك الله وغير ذلك من النعم العظام: { ٱلْحَمْدُ للَّهِ ٱلَّذِي نَجَّانَا } من كمال جوده وسعة رحمته { مِنَ ٱلْقَوْمِ ٱلظَّالِمِينَ } [المؤمنون: 28] الخارجين عن مقتضى العقل والشرع عتواً وعناداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال له: { فإِذا استويتَ أنت ومن معك على الفُلْك } فإذا تمكنتم عليها راكبين { فقل الحمد لله الذي نجَّانا من القوم الظالمين } ، أُمر بالحمد على هلاكهم والنجاة منهم على طريق:\n\n\n\n[الأنعام: 45]\n ولم يقل: فقولوا، وإن كان أهله ومن معه قد استووا معه لأنه نبيهم وإمامهم، فكان قوله قولَهم، مع ما فيه من الإشعار بفضل النبوة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:22",
      "similarity": 0.5138624908707864
    },
    {
      "verse": "7:64",
      "similarity": 0.5095562754595361
    },
    {
      "verse": "10:73",
      "similarity": 0.4624896737147706
    },
    {
      "verse": "31:31",
      "similarity": 0.35858192854982657
    },
    {
      "verse": "29:65",
      "similarity": 0.3551911090029538
    }
  ]
}