{
  "chapter": "المؤمنون",
  "text": "ولقد ارسلنا نوحا الى قومه فقال يقوم اعبدوا۟ الله ما لكم من اله غيره افلا تتقون",
  "translations": [
    {
      "translation": "We sent Nuh to his people and he said, 'My people, worship Allah. You have no god other than Him. So will you not have taqwa?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He said: \"O my people, worship God, for you have no other god but He. Will you not take heed for yourselves?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people, and he said: \"My people! Serve Allah; you have no deity other than He. Do you have no fear?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people who said, \"My people, worship God for He is your only Lord. Will you then not have fear of Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nooh towards his people – he therefore said, “O my people! Worship Allah, you do not have any other God except Him; so do you not fear?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nuh to his people, and he said: \"O my people! Worship Allah! You have no other God but Him. Will you not then have Taqwa\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent Nuh to his people, and he said: O my people! serve Allah, you have no god other than Him; will you not then guard (against evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Noah to his people; and he, said, 'O my people, serve God! You have no god other than He. Will you not be godfearing?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We verily sent Noah unto his folk, and he said: O my people! Serve Allah. Ye have no other Allah save Him. Will ye not ward off (evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people, and he said, \"My people, worship God; you have no other deity except Him. Will you not fear Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We sent Nuh unto his people, and he said: O my people! worship Allah; for you there is no god but he; will ye not then fear Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Noah to his people, and he said, ‘O my people! Worship Allah! You have no other god besides Him. Will you not then be wary [of Him]?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Further, We sent a long line of prophets for your instruction). We sent Noah to his people: He said, \"O my people! worship Allah! Ye have no other god but Him. Will ye not fear (Him)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nuh (Noah) to his people, and he said: \"O my people! Worship Allah! You have no other Ilah (God) but Him (Islamic Monotheism). Will you not then be afraid (of Him i.e. of His Punishment because of worshipping others besides Him)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his nation. 'Worship Allah, my nation' he said, 'for you have no god except He. Will you not be cautious'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He said, “O my people, worship God, you have no deity other than Him. Will you not take heed?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had certainly sent Noah to his people, and he said, \"O my people, worship Allah; you have no deity other than Him; then will you not fear Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:23] And verily We sent Noah to his people, and he said, ‘O my people, worship God, obey God and affirm His Oneness. You have no [other] god besides Him (ghayruhu is the subject of mā, ‘no’; the preceding [min ilāhin, ‘god’] is the predicate, the min being extra). Will you not then fear?’ His punishment in worshipping [gods] other than Him?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We verily sent Noah unto his folk, and he said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other god save Him) save the One in whom I command you to believe. (Will ye not ward off (evil)) the worship of other than Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فأوحينا إليه أن اصنع } فلك الحكمة العملية والشريعة النبوية { بأعيننا } على محافظتنا إياك عن الزلل في العمل { ووحينا } بالعلم والإلهام { فإذا جاء أمرنا } بإهلاك القوى البدنية والنفوس المنغمسة المادية { وفار } تنور البدن باستيلاء المواد الفاسدة والأخلاط الرديئة { فاسلك فيها من كل زوجين } أي: من كل شيء صنفين من الصور الكلية والجزئية أعني صورتين اثنتين إحداهما كلية نوعية والأخرى جزئية شخصية { وأهلك } من القوى الروحانية والنفوس المجرّدة الإنسانية ممن تشرّع بشريعتك { إلا من سبق عليه القول } بإهلاكه من زوجتك النفس الحيوانية والطبيعة الجسمانية { ولا تخاطبنى فى الذين ظلموا } من القوى النفسانية والنفوس المنغمسة الهيولانية بالاستيلاء على القوى الروحانية والنفوس المجرّدة الإنسانية وغصب مناصبهم { إنهم مغرقون } في البحر الهيولاني\n { فإذا استويت } بالاستقامة في السير إلى الله\n فاتّصف بصفات الله التي هي الحمد القلبي على نعمة الإنجاء من ظلمة الجنود الشيطانية { وقل ربّ أنزلني منزلاً مباركاً } هو مقام القلب الذي بارك الله فيه بالجمع بين العالمين وإدراك المعاني الكلية والجزئية وأمنه من طوفان بحر الهيولى وطغيان مائه { إنّ في ذلك لآيات } دلائل ومشاهدات لأولي الألباب { وإن كنا } ممتحنين إياهم ببليّات صفات النفوس والتجريد عنها بالرياضة\n أو ممتحنين العقلاء بالاعتبار بأحوالهم عند الكشف عن حالاتهم وحكاياتهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n شرع في توبيخ من يكفر بها ولم يؤد حق شكرها فقال: { وَلَقَدْ أَرْسَلْنَا } من مقام لطفنا وجودنا { نُوحاً إِلَىٰ قَوْمِهِ } حين انحرفوا عن جادة الاعتدال وانصرفوا عن الاستقامة { فَقَالَ } على مقتضى وحينا أياه منادياً إياه ليقلبوا إليه على مقتضى شفقة النبوة والرسالة وعطف الهدايا والإرشاد: { يٰقَوْمِ } أضافهم إلى نفسه إمحاضاً للنصح وإظهاراً لكمال الإشفاف { ٱعْبُدُواْ ٱللَّهَ } الواحد الأحد الصمد الذي\n[الإخلاص: 3-4] واعلموا أنه { مَا لَكُمْ مِّنْ إِلَـٰهٍ } يعبد بالحق ويستحق بالعبادة { غَيْرُهُ أَ } تتخذون إلهاً سواه { فَلاَ تَتَّقُونَ } [المؤمنون: 23] وتحذرون عن بطشه وانتقامه بأنواع العذاب والنكال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ذكر في الحاشية وجوهاً من المناسبة\n فقال: لمّا استطرد ذكر الفلك ناسب ذكر نوح إثره\n لقوله: اصنع الفلك\n وأيضاً: هو أبو البشر الثاني\n فَذُكِرَ كما ذكر أولاً آدم\n في ذكر خلق الإنسان\n وأيضاً في ذكر نجاة المؤمنين وفلاحهم\n فناسب صدر السورة\n وهلاك الكافر وهو ضد المؤمن\n كما صرح بذلك في قوله في آخرها: إنه لا يفلح الكافرون\n وفي النجاة في الفلك مناسبة للنعم المقررة قبل ذكره\n هـ\n وإن كنا لمبتلين: \" إنْ \": مخففة\n واسمها: ضمير الشأن\n واللام فارقة\n يقول الحق جل جلاله: { ولقد أرسلنا }: وتالله لقد أرسلنا { نوحاً إلى قومه } \n وقد مرّ في الأعراف نسبه وكيفية بعثته\n { فقال } لقومه حين أُرسل إليهم\n متعطفاً عليهم\n ومستميلاً لهم إلى الحق: { يا قوم اعبدوا الله } وحده إذ العبادة مع الإشراك لا عبرة بها\n فلذلك لم يقيدها هنا\n وقيدها في هود\n بقوله:\n[هود: 26] { ما لكم من إلهٍ غيرهُ } أي: ما لكم من الوجود إله يستحق أن يُعبد غيره\n فالرفع على المحل\n والجر على اللفظ\n { أفلا تتقون } أفلا تخافون عقوبة الله\n الذي هو ربكم وخالقكم\n إذا عبدتم غيره مما ليس من استحقاق العبادة في شيء\n أو: أفلا تخافون عذابه الذي يستوجبه ما أنتم عليه\n كما يُفصح عنه قوله تعالى:\n[الأعراف: 59]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:59",
      "similarity": 0.7574581338624075
    },
    {
      "verse": "11:25",
      "similarity": 0.6475142449497786
    },
    {
      "verse": "26:105",
      "similarity": 0.6287768701308393
    },
    {
      "verse": "26:106",
      "similarity": 0.6119492959939737
    },
    {
      "verse": "23:32",
      "similarity": 0.5648177498007193
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/23:23.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/23:23.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/23:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}