{
  "chapter": "المؤمنون",
  "text": "وعليها وعلى الفلك تحملون",
  "translations": [
    {
      "translation": "And you are carried on them and on boats.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and are carried on them and also on ships.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are carried by the animals on land and by the ships in the sea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you are carried on them and on the ship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on them, and on ships you are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on them and on the ships you are borne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and upon them, and on the ships, you are borne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on them and on the ship ye are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you ride on them as you do in ships.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on them and on the ship ye are borne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you are carried on them and on ships.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on them, as well as in ships, ye ride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on them, and on ships you are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and upon them and on the ships you are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on them, and on the ships, you are transported.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And upon them and on ships you are carried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:22] And on them, the camels, and on ships you are carried.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And on them) and on camels, on land (and on the ship) in the sea (you are carried) you travel.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجلمة { عَلَيْهَا } أي: على الأنعام في البر { وَعَلَى ٱلْفُلْكِ } في البحر { تُحْمَلُونَ } [المؤمنون: 22]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومنها تأكلون } أي: من لحومها، { وعليها } أي: على الأنعام في البر، { وعلى الفُلك } في البحر { تُحملون } في أسفاركم ومتاجركم، والمراد بالأنعام في الحمل الإبل لأنها هي المحمول عليها في البر، فهي سفائن العرب، كما قال ذو الرمة:\n\nيريد ناقته\n والله تعالى أعلم\n الإشارة: ولقد خلقنا فوق قلوبكم سبعة حجب، فمن خَرقَها أفضى إلى فضاء شهود ذاتنا وأنوار صفاتنا، وهي حجاب المعاصي والذنوب، وحجاب النقائص والعيوب، وحجاب الغفلات، وحجاب العوائد والشهوات، وحجاب الوقوف مع حلاوة المعاملات، وحجاب الوقوف مع الكرامات والمقامات، وحجاب حس الكائنات، فمن خرق هذه الحجب بالتوبة والتزكية واليقظة والعفة والرياضة، والأنس بالله والغيبة عما سواه، ارتفعت عنه الحجب، ووصل إلى المحبوب\n قال الورتجبي: أوضح سبع طرائق لنا إلى أنوار صفاته السبعة\n هـ\n وقال القشيري: الحق - سبحانه - لا يستتر من رؤيته مُدْرَكٌ، ولا تخفى عليه من مخلوقاته خافية، وإنما الحُجُبُ على أبصارِ الخَلْق وبصائرهم، والعادةُ جاريةٌ أنه لا يخلق لنا الإدراك لِمَا وراء الحُجُب، ولذلك أدخِلَت الغفلةُ القلوبَ، واستولى عليها الذهول، سدَّت بصائرها، وغيبت فهومها، ففوقها حجب ظاهِرة وباطنة ففي الظاهر: السموات حجبٌ تحول بيننا وبين المنازل العالية وعلى القلوب أغشية وأغطية، كالشهوة والأمنية، والإرادات الشاغلة والغفلة المتراكمة\n ثم ذكر أن طرائق المريدين الفَتْرَة، وطرائق الزاهدين ترك عُروق الرغبة\n قال: وأما العارفون فربما تظلهم في بعض أحيانهم وقفةٌ في تضاعيف سيرهم إلى ساحات الحقائق، فيصيرون موقوفين ريثما يتفضّلُ الحقُّ - سبحانه - عليهم بكفاية ذلك، فيجدون نفاذاً، ويدفع عنهم ما عاقهم من الطرائق، وفي جميع ذلك فالحق - سبحانه - غير تاركٍ للعبد ولا غافلٍ عن الخلق\n هـ\n وقوله: { وما كنا عن الخلق غافلين } أي: وما كنا غافلين عن إرسال من يخرجهم من تلك الحجب القهرية، بل بعثنا الرسل، وفي أثرهم العارفين الربانيين، يُخرجون من تعلق بهم من تلك الطرائق، ويوصلونهم إلى بحر الحقائق\n وأنزلنا من سماء الغيوب ماء العلم اللدني، فأسكناه في أرض النفوس والقلوب، بقدر ما سبق لكل قلب منيب، وإناعلى ذهاب به من القلوب والصدور لقادرون\n\n\nولذلك كان العارفون لا يزول اضطرارهم، ولا يكون مع غير الله قرارهم، فأنشأنا بذلك العلم في قلوب العارفين جنات المعارف من نخيل الأذواق والوجدان، وأعناب خمرة العيان، لكم فيها فواكه كثيرة، أي: تمتع كثير بلذة الشهود، ومنها تتقوت أرواحكم وأسراركم، وشجرة المعرفة تخرج من القلوب الصافية، التي هي محل المناجاة، كطور موسى، أي: تنبت فيها ويخرج أغصانها إلى ظاهر الجوارح، تنبت في القلب بدهن الذوق والوجد، وصبغ للآكلين، أي: المريدين الآكلين من تلك الشجرة، فتصبغ قلوبهم بالمعرفة واليقين\n وقوله تعالى: { وإن لكم في الأنعام لعبرة } ، قال القشيري: الإشارة فيه: أنّ الكدوراتِ الناجمةَ المتراكمةَ لا عِبْرَةَ بها ولا مبالاة، فإنَّ اللَّبنَ الخالص السائغَ يخرجُ من أخلاف الإبل والأنعام، من بين ما ينطوي حواياها عليها من الوحشة، ولكنه صافٍ لم يؤثر فيها بُحكم الجِوار، والصفا يوجد أكثره في عين الكُدروة إذ الحقيقة لا يتعلق بها حق ولا باطل\n ومَنْ أَشرف على سِرِّ التوحيد تحقَّقَ بأنَّ ظهور جميع الحدثان من التقدير، فتسْقُط عنه كلفة التمييز فالأسرارُ عند ذلك تصفو، والوقت لصاحبه لا يجفو، ولكم فيها منافع لازمةٌ لكم، ومتعدية منكم إلى كلِّ متصلٍ بكم\n انتهى على لحن فيه، فتأمله\n ولما ذكرهم بالنعم ذكر من قابلها بالكفران فهلك\n",
      "translations": []
    }
  ]
}