{
  "chapter": "المؤمنون",
  "text": "فارسلنا فيهم رسولا منهم ان اعبدوا۟ الله ما لكم من اله غيره افلا تتقون",
  "translations": [
    {
      "translation": "and sent a Messenger to them from themselves: 'Worship Allah. You have no god other than Him! So will you not have taqwa?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent to them an apostle from among them (who said): \"Worship God, for you have no other god but He. Will you not take heed and fear God?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We sent among them a Messenger from among themselves, saying: \"Serve Allah; you have no god other than He. Do you have no fear?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent to them a Messenger from among their own people who told them, \"Worship God; He is your only Lord. Will you then not have fear of Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We sent among them a Noble Messenger from among them (saying), “Worship Allah, you do not have any other God except Him; so do you not fear?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent to them a Messenger from among themselves (saying): \"Worship Allah! You have no other God but Him. Will you not then have Taqwa\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We sent among them an apostle from among them, saying: Serve Allah, you have no god other than Him; will you not then guard (against evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We sent amongst them a Messenger of themselves, saying, 'Serve God! You have no god other than He. Will you not be godfearing?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we sent among them a messenger of their own, saying: Serve Allah, Ye have no other Allah save Him. Will ye not ward off (evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and sent a messenger to them from among themselves: \"Worship God alone. You have no deity other than Him. Will you not then fear God?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent amongst them an apostle from amongst themselves, saying: worship Allah, for you there is no god but he; will ye then not fear Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We sent them an apostle from among themselves, saying, ‘Worship Allah! You have no other god besides Him. Will you not then be wary [of Him]?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent to them a messenger from among themselves, (saying), \"Worship Allah! ye have no other god but Him. Will ye not fear (Him)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent to them a Messenger from among themselves (saying): \"Worship Allah! You have no other Ilah (God) but Him. Will you not then be afraid (of Him i.e. of His Punishment because of worshipping others besides Him)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We sent to them a Messenger from themselves, saying: 'Worship Allah, for you have no god except He. Will you not be cautious'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent among them a messenger from themselves: “Serve God. You have no god other than Him. Will you not be cautious?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent among them a messenger from themselves, [saying], \"Worship Allah; you have no deity other than Him; then will you not fear Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:32] And We sent among them a messenger of their own, namely, Hūd, saying, ‘Worship God! You have no other god besides Him. Will you not then be wary?’, of His punishment and become believers?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We sent among them) and We sent to them (a messenger of their own) of their own lineage (saying: Serve Allah) saying: declare Allah's divine Oneness. (Ye have no other god save Him) you have no other god except the One in Whom I command you to believe. (Will ye not ward off (evil)) the worship of other than Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَرْسَلْنَا فِيهِمْ رَسُولاً } ناشئاً { مِّنْهُمْ } ابتلاءً لهم واختباراً لمن اعتبر منهم، فقال على مقتضى وحينا وإلهامنا إياه: { أَنِ ٱعْبُدُواْ ٱللَّهَ } الواحد الأحد، المستقل بالألوهية والوجود، واعلموا أنه { مَا لَكُمْ مِّنْ إِلَـٰهٍ } يُعبد له ويُرجع إليه { غَيْرُهُ أَ } تتخذون إلهاً غيره وتعبدون له ظلماً وزوراً، وتتضرعون نحوه في الوقائع والخطوب { فَلاَ تَتَّقُونَ } [المؤمنون: 32] عن غضبه، ولا تخافون عن قهره وانتقامه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأرسلنا فيهم } ، الإرسال يُعَدّى بإلى، ولم يُعَدَّ بها هنا وفي قوله:\n\n[الرعد: 30]،\n\n[الأعراف: 94] لأن الأمة والقرية جعلت موضعاً للإرسال، إيذاناً بأن المرسَل إليهم لم يأتهم من غير مكانهم، بل إنما نشأ بين أظهرهم، كما ينبىء عنه قوله: { رسولاً منهم } أي: من جملتهم نسباً، وهو: هود أو صالح، فإنهما - عليهما السلام - كانا منهم\n قائلاً لهم: { أنِ اعبدوا الله ما لكم من إلهٍ غيرهُ أفلا تتقون } عذابه، الذي يقتضيه ما أنتم عليه من الشرك والمعاصي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:23",
      "similarity": 0.5648177498007194
    },
    {
      "verse": "71:3",
      "similarity": 0.4615354195759747
    },
    {
      "verse": "23:87",
      "similarity": 0.39928860142020456
    },
    {
      "verse": "37:124",
      "similarity": 0.3939453138557512
    },
    {
      "verse": "26:75",
      "similarity": 0.3879211019648152
    }
  ]
}