{
  "chapter": "المؤمنون",
  "text": "ان هو الا رجل افترى على الله كذبا وما نحن له بمؤمنين",
  "translations": [
    {
      "translation": "He is just a man who invents a lie about God; we cannot believe in him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This man has forged a mere lie in the name of Allah and we shall never believe what he says.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is only a man who invents lies against God, so have no faith in him\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“He is just a man who has fabricated a lie against Allah, and we are not going to believe him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is only a man who has invented a lie against Allah, and we are not going to believe in him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is naught but a man who has forged a lie against Allah, and we are not going to believe in him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is naught but a man who has forged against God a lie, and we will not believe him.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is only a man who hath invented a lie about Allah. We are not going to put faith in him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is only a man who has invented a lie about God, and we are not going to believe him!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is but a man who hath fabricated against God a lie, and in him we are not going to be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is just a man who has fabricated a lie against Allah, and we will not believe in him.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is only a man who invents a lie against Allah, but we are not the ones to believe in him!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is only a man who has invented a lie against Allah, but we are not going to believe in him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is nothing but a man who has forged against Allah a lie, we will never believe him'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is nothing but a man, making up lies about God. We have no faith in him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is not but a man who has invented a lie about Allah, and we will not believe him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:38] He is, the Messenger is, just a man who has invented a lie against God, and we will not believe in him’, we will [not] accept the truth of resurrection after death.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is only a man) they mean the Messenger is only a man (who hath invented a lie about Allah) in that which he says. (We are not going to put faith in him) we are not going to believe what he says.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنْ هُوَ } أي: ما هو المدعى الكاذب { إِلاَّ رَجُلٌ ٱفتَرَىٰ } ونسب { عَلَىٰ ٱللَّهِ كَذِباً } ومراءً عنه أنه أرسلني الله وأوصاني بكذا وكذا، وما هي إلا مختراعاتُ اخترعها ن تلقاء نفسه { وَ } بالجملة: { مَا نَحْنُ لَهُ بِمُؤْمِنِينَ } [المؤمنون: 38] بمجرد هذه الدعوى، وإن أثبتها أيضاً؛ إذ هو بشرُ مثلنا ولا رسالةَ للبشر من الله إلى البشر\n\n\n\n\nوبعد يأسه من إيمانهم أخذ في الدعاء عليهم، مشتكياً إلى الله؛ حيث { قَالَ رَبِّ ٱنْصُرْنِي بِمَا كَذَّبُونِ } [المؤمنون: 39] أي: عذِّبهم بتكذيبهم إياي؛ إذ تكذيبي مسلتزم لتكذيبك يا ربي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}