{
  "chapter": "المؤمنون",
  "text": "وقال الملا من قومه الذين كفروا۟ وكذبوا۟ بلقاء الءاخرة واترفنهم فى الحيوة الدنيا ما هذا الا بشر مثلكم ياكل مما تاكلون منه ويشرب مما تشربون",
  "translations": [
    {
      "translation": "The ruling circle of his people - those who were kafir and denied the encounter of the Next World and whom We had given opulence in this world - said, 'This is nothing but a human being like yourselves, who eats what you eat and drinks what you drink.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of the people who did not believe and denied the life to come, though We had given them good things of this life to enjoy, (said): \"He is only a mortal like you. He eats as you do, and drinks as you drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The notables among his people who had refused to believe and who denied the meeting of the Hereafter, and those whom We had endowed with ease and comfort in this life, cried out: \"This is no other than a mortal like yourselves who eats what you eat and drinks what you drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A group of his people who disbelieved him and had called the Day of Judgment a lie and whom We had made prosperous in this life, said, \"He is a mere mortal like you. He eats and drinks as you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said the leaders of his people, who disbelieved and denied the confronting of the Hereafter – and We had given them comfort in the worldly life – that, “He is nothing but a human like you, he eats from what you eat and drinks from what you drink.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the chiefs of his people who disbelieved and denied the meeting in the Hereafter, and whom We had given the luxuries and comforts of worldly life, said: \"He is no more than a human being like you, he eats of that which you eat, and drinks of what you drink.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the chiefs of his people who disbelieved and called the meeting of the hereafter a lie, and whom We had given plenty to enjoy in this world's life, said: This is nothing but a mortal like yourselves, eating of what you eat from and drinking of what you drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the Council of the unbelievers of his people, who cried lies to the encounter of the world to come, and to whom We had given ease in the present' life, 'This is naught but a mortal like yourselves, who eats of what you eat and drinks of what you drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the chieftains of his folk, who disbelieved and denied the meeting of the Hereafter, and whom We had made soft in the life of the world, said: This is only a mortal like you, who eateth of that whereof ye eat and drinketh of that ye drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the leaders of his people who denied the truth and denied the Meeting in the Hereafter, because We had granted them ease and plenty in their worldly life, said, \"This is only a human being like yourselves, he eats what you eat, and drinks what you drink,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said the chiefs of those who disbelieved among his people and belied the meeting of the Hereafter and whom We had luxuriated in the life of the World: this is no other than a human being like unto you: he eateth of that whereof ye eat, and he drinketh of that which ye drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the elite of his people, who were faithless and who denied the encounter of the Hereafter and whom We had given affluence in the life of the world: ‘This is just a human being like yourselves: he eats what you eat, and drinks what you drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the chiefs of his people, who disbelieved and denied the Meeting in the Hereafter, and on whom We had bestowed the good things of this life, said: \"He is no more than a man like yourselves: he eats of that of which ye eat, and drinks of what ye drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the chiefs of his people, who disbelieved and denied the Meeting in the Hereafter, and to whom We had given the luxuries and comforts of this life, said: \"He is no more than a human being like you, he eats of that which you eat, and drinks of what you drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelieving assembly of his nation, who belied the encounter of the Everlasting Life, and on whom We had bestowed ease in this life, said: 'This is but a human like yourselves; he eats of what you eat and drinks of what you drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the dignitaries of his people, those who disbelieved and denied the meeting of the Hereafter, and We had indulged them in the present life, said, “This is nothing but a human like you; he eats what you eat, and he drinks what you drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the eminent among his people who disbelieved and denied the meeting of the Hereafter while We had given them luxury in the worldly life said, \"This is not but a man like yourselves. He eats of that from which you eat and drinks of what you drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:33] The council of his people, who disbelieved and denied the encounter of the Hereafter, [they denied] that they will end up thereat, and whom We had given affluence, whom We had provided with comforts, in the life of this world, said: ‘This is only a human being like you: he eats what you eat and drinks what you drink.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the chieftains of his folk) of the folk of the messenger, (who disbelieved and denied the meeting of the Hereafter) and disbelieved in resurrection after death, (and whom We had made soft) whom We blessed with wealth and offspring (in the life of the world, said: This) i.e. this Messenger (is only a mortal) a human being (like you, who eateth of that whereof you eat) who eats as you eat (and drinketh of that ye drink) and drinks as you do.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما بلّغهم الرسول الموحي به { قَالَ ٱلْمَلأُ } أي: الأشراف { مِن } قومه عتواً واستكباراً لضعفاء العوام\n وهم { قَوْمِهِ ٱلَّذِينَ كَفَرُواْ } بالله باتخاذ الأصنام آلهةً وأنكروا وحدة الإله { وَكَذَّبُواْ بِلِقَآءِ ٱلآخِرَةِ } ويوم الجزاء وجميع المواعيد الموعودة فيها { وَ } مع كفرهم وشركهم\n وإنكارهم بالنشأة الأخرى { أَتْرَفْنَاهُمْ } بوفور نعمنا إياهم { فِي ٱلْحَيـاةِ ٱلدُّنْيَا } إمهالاً لهم: { مَا هَـٰذَا } المدَّعي الكاذب { إِلاَّ بَشَرٌ مِّثْلُكُمْ } لا مزيةَ له عليكم { يَأْكُلُ مِمَّا تَأْكُلُونَ مِنْهُ وَيَشْرَبُ مِمَّا تَشْرَبُونَ } [المؤمنون: 33]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقال الملأُ من قومه } \n ذكر مقال قوم هود\n في جوابه\n في الأعراف وهود بغير \" واو \" لأنه على تقدير سؤال سائل\n قال: فما قال قومه؟ فقيل: قالوا: كيت وكيت\n وهنا مع الواو لأنه عطفٌ لما قالوه على ما قاله الرسول ومعناه: حكاية قولهم الباطل إثر حكاية قول الرسول الحق\n وليس بجواب للنبي متصل بكلامه\n وجيء بالفاء في قصة نوح عليه السلام لأنه جواب لقوله\n واقعٌ عَقِبَه\n\n أي: وقال الأشراف من قومه { الذين كفروا } \n وُصفوا بالكفر ذَماً لهم\n وتنبيهاً على غُلوِّهم فيه\n { وكذَّبوا بلقاء الآخرة } أي: بلقاء ما فيها من الحساب والثواب والعقاب وغير ذلك\n أو بمعادهم إلى الحياة الثانية\n { وأترفناهم }: نَعَّمناهم { في الحياة الدنيا } بكثرة الأموال والأولاد\n أي: قالوا لأتباعهم\n مُضلين لهم: { ما هذا } النبي { إلا بشرٌ مثلُكم } في الصفة والأحوال\n والاحتياج إلى القِوام\n ولم يقولوا: مثلنا تهويناً لأمره عليه السلام\n ثم فسر المثلية بقوله: { يأكل مما تأكلون منه ويشرب مما تشربون } أي: منه\n فحذف لدلالة ما قبله عليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:45",
      "similarity": 0.666950697559841
    },
    {
      "verse": "34:34",
      "similarity": 0.6457815932003953
    },
    {
      "verse": "11:116",
      "similarity": 0.45086183570621485
    },
    {
      "verse": "17:16",
      "similarity": 0.44300883575786565
    },
    {
      "verse": "23:64",
      "similarity": 0.3481560951295119
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/23:33.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/23:33.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}