{
  "chapter": "المؤمنون",
  "text": "ان فى ذلك لءايت وان كنا لمبتلين",
  "translations": [
    {
      "translation": "There are Signs in that. We are always putting people to the test.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There were surely signs in this; We will surely put you to the test.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are great Signs in this story; and surely We do put people to test.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this story there is enough evidence (of the Truth); thus do We try (mankind)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, surely in this are signs and indeed surely, We were examining.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in this, there are indeed Ayat, for sure We are ever putting (men) to the test.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely there are signs in this, and most surely We are ever trying (men).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in that are signs, and surely We put to the test.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! herein verily are portents, for lo! We are ever putting (mankind) to the test.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely there are clear signs in that. In this way We put people to the test.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in that are signs; verily We have ever been provers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are indeed signs in this; and indeed, We have been testing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in this there are Signs (for men to understand); (thus) do We try (men).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in this [what We did as regards drowning of the people of Nuh (Noah)], there are indeed Ayat (proofs, evidences, lessons, signs, etc. for men to understand), for sure We are ever putting (men) to the test.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, in that are signs, and surely We will put (nations) to the test.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in that are signs. We are always testing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in that are signs, and indeed, We are ever testing [Our servants].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:30] Surely in that, mentioned matter of Noah, the ship and the destruction of the disbelievers, there are signs, indicators of God’s power, exalted be He, and indeed (wa-in, in has been softened in place of the hardened form, its subject being the pronoun of the matter) We were putting to the test, [indeed We were] trying the people of Noah by sending him [as God’s messenger] to them and [by] his admonitions [to them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Herein) in that which We did to them (verily are portents) are signs and admonitions for the people of Mecca in order for them to emulate, (for lo! We are ever putting (mankind) to the test) with misfortunes; 376 and it is also said that this means: with punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ فِي ذٰلِكَ } المذكور من قصة نوحٍ مع قومه ونجاته وإهلاكهم، و تعليم صنع السفينة عليه، وإخراج الماء من التنور المعهود، وإحاطته على وجه الأرض كلها، ونجاة من كان في سفينته وغير ذلك من الأمور البديعة { لآيَاتٍ } دلائلَ واضحات على كمال قدرتنا وإرادتنا واختبارنا في عموم أفعالنا على المعتبرين المتأملين في بدائع الأمور وغرائبه، الناظرين بعيون العبرة والاستبصار في حدوث هذه الوقائع الهائلة { وَإِن كُنَّا لَمُبْتَلِينَ } [المؤمنون: 30] أي: أن الشأن والأمر أنَّا بإحداث هذه الحوادث مع قوم نوح لمختبرون مجرَّبون عموم عبادنا؛ لننظر من يعتبر ويتعظ بها منهم، وما هي إلا تذكرة وتذكير منا إياهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقل ربِّ أنزلني } في السفينة، أو منها { مُنْزَلاً مباركاً } أي: إنزالاً مباركاً، أو موضع إنزال يستتبع خيراً كثيراً، { وأنت خير المُنزِلين } خير من ينزل في كل خير، أُمر عليه السلام بأن يشفع دعاءه بما يطابقه من ثنائه عليه تعالى، توسلاً به إلى إجابة دعائه، فالبركة في السفينة: النجاة فيها، وبعد الخروج منها: كثرة النسل وتتابع الخيرات، { إِنَّ في ذلك } فيما فعل بنوح وقومه { لآياتِ }: لعبراً ومواعظ، { وإن كنا } أي: وإن الشأن والقصة كنا { لمبتلين }: مُصيبين قوم نوح ببلاء عظيم وعقاب شديد، أو: مختبرين بهذه الآيات عبادنا، لننظر من يعتبر ويذكر، كقوله:\n\n[القمر: 15]\n والله تعالى أعلم\n الإشارة: تقدمت إشارة هذه القصة مراراً بتكررها، وفيها تسلية لمن أوذي من الأولياء بقول قبيح أو فعل ذميم\n وقال القشيري في قوله: { وقل رب أنزلني منزلاً مباركاً }: الإنزال المبارك: أن تكون بالله ولله على شهود الله، من غير غفلة عن الله، ولا مخالفة لأمر الله\n هـ\n ثمَّ ذكر قصة هودٍِ أو صالح\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:33",
      "similarity": 0.8842051631968965
    },
    {
      "verse": "37:106",
      "similarity": 0.8811256026773285
    },
    {
      "verse": "86:9",
      "similarity": 0.6462208748957262
    },
    {
      "verse": "18:7",
      "similarity": 0.5974772338671743
    },
    {
      "verse": "67:2",
      "similarity": 0.5836136209932683
    }
  ]
}