{
  "chapter": "المؤمنون",
  "text": "فقالوا۟ انؤمن لبشرين مثلنا وقومهما لنا عبدون",
  "translations": [
    {
      "translation": "They said, 'What! Should we have iman in two human beings like ourselves when their people are our slaves?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said: \"Should we believe in two men like yourselves, whose people are our subjects?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Shall we put faith in two mortals like ourselves when their people are slaves to us?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Should we believe in two mere mortals who are like ourselves and whose people are our slaves?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They therefore said, “Shall we believe in two humans like ourselves, whereas their nation is servile to us?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Shall we believe in two men like ourselves, and their people are obedient to us with humility!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: What! shall we believe in two mortals like ourselves while their people serve us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they said, 'What, shall we believe two mortals like ourselves, whose people are our servants?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said: Shall we put faith in two mortals like ourselves, and whose folk are servile unto us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Are we to believe in two human beings like ourselves, while their people are subject to us?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they said: shall we believe In two human beings like unto us, while their nation are to us slaves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Shall we believe two humans like ourselves, while their people are our slaves?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Shall we believe in two men like ourselves? And their people are subject to us!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Shall we believe in two men like ourselves, and their people are obedient to us with humility (and we use them to serve us as we like).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What' they said, 'are we to believe in two mortals like us, whose nation are our worshipers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Are we to believe in two mortals like us, and their people are our slaves?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Should we believe two men like ourselves while their people are for us in servitude?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:47] And they said, ‘Shall we believe two humans like ourselves, while their people are servile to us?’, obedient and submissive.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they said: Shall we put faith in two mortals) two human beings, meaning Moses and Aaron (like ourselves, and whose folk are servile unto us) while their people are our obedient servants?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَوْمُهُمَا لَنَا عَابِدُونَ } معناه مُطيعونَ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And both of their peoples will serve Us} - meaning they will obey Us.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوترقى أمر فرعون في الاستكبار إلى أن ادعى الربوبية والألوهية لنفسه { فَقَالُوۤاْ } بعدما سمعوا منهما ما سمعوا من الإيمان بالله، والدعوة إلى توحيده، والإتيان بالأعمال الصالحة، والامتثال بالأوامر والاجتناب عن النواهي المنزلة في التوراة متشاورين بينهم مستبعدين عن أمرهما منهمكين معهما مستهزئين: { أَنُؤْمِنُ لِبَشَرَيْنِ } ونقبل منهما قولهما مع أنهما { مِثْلِنَا } في البشرية، ولا مزيةَ لهما علينا بالمال والكمال { وَ } لا بالنسب؛ إذ { قَوْمُهُمَا } الذين انتشأ منهم { لَنَا عَابِدُونَ } [المؤمنون: 47] إلى الآن ونحن أربابهم مسلطون عليهم، فكيف نؤمن ونقاد لهما بلا شرفهما حسباً ونسباً؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n تكبراً وترفعاً، { وكانوا قوماً عالين }: متكبرين، متمردين، { فقالوا } ، فيما بينهم، على طريق المناصحة: { أنؤمن لبشَرَيْنِ مثلنا } ، \" مثل \" و \" غير \" يوصف بها الإثنان والجمع والمذكر والمؤنث، والبشر يطلق على الواحد، كقوله:\n\n[مريم: 17]، وعلى الجمع، كقوله:\n\n[مريم: 26]، وأراد به هنا الواحد، فثناه، أي: كيف نؤمن لبشرين مثلنا في العجز والافتقار، { وقومهما لنا عابدون } أي: خادمون منقادون لنا كالعبيد، وكأنهم قصدوا بذلك التعريض بهما - عليهما السلام - وحط رتبتهما العلية عن منصب الرسالة من وجه آخر غير البشرية، بناء على زعمهم الفاسد، من قياس الرئاسة الدينية على الرئاسات الدنيوية، الدائرة على التقدم في نيل الحظوظ الدنيوية، من المال والجاه، كدأب قريش، حيث قالوا:\n\n[الأحقاف: 11]\n\n\n[الزخرف: 31]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:15",
      "similarity": 0.5484739023182114
    },
    {
      "verse": "26:154",
      "similarity": 0.5462866637455022
    },
    {
      "verse": "27:2",
      "similarity": 0.5130860203716879
    },
    {
      "verse": "11:2",
      "similarity": 0.49090117521876286
    },
    {
      "verse": "26:186",
      "similarity": 0.4726728800446791
    }
  ]
}