{
  "chapter": "المؤمنون",
  "text": "ثم ارسلنا رسلنا تترا كل ما جاء امة رسولها كذبوه فاتبعنا بعضهم بعضا وجعلنهم احاديث فبعدا لقوم لا يؤمنون",
  "translations": [
    {
      "translation": "Then We sent Our apostles one after the other. Every time an apostle came to a people they denied him. So We made one follow the other (to its doom), and turned them into bygone tales. Cursed be the people who do not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Our Messengers in succession. Whenever a Messenger came to his people they rejected him, calling him a liar. Thereupon, We made each people to follow the other (to its doom), reducing them to mere tales (of the past). Scourged be the people who do not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Our messengers one after the other but whenever a Messenger would come to a nation, its people would call him a liar and We would destroy one nation after the other, thus, only their stories were left behind them. God keeps the unbelievers far away from His Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then sent our Noble Messengers, one after another; whenever a nation’s Noble Messenger came to it they denied him, We therefore united the succeeding with the old, and made them history; so far removed be the people who do not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Our Messengers in succession. Every time there came to a nation their Messenger, they denied him; so, We made them follow one another, and We made them as Ahadith. So, away with a people who believe not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Our apostles one after another; whenever there came to a people their apostle, they called him a liar, so We made some of them follow others and We made them stories; so away with a people who do not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then sent We Our Messengers successively; whenever its Messenger came to a nation they cried him lies, so We caused some of them to follow others, and We made them as but tales; so away with a people who do not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent our messengers one after another. Whenever its messenger came unto a nation they denied him; so We caused them to follow one another (to disaster) and We made them bywords. A far removal for folk who believe not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We sent Our messengers in succession. Every time their messenger came to a people, they rejected him. So We destroyed them one after the other, and let them become mere tales. So away with the people who will not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter We sent Our apostles, successively. So oft as there came unto a community their apostle, they belied him, so We made them follow one anot her, and We made them bywords: so away with a people who believe not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Our apostles successively. Whenever there came to a nation its apostle, they impugned him, so We made them follow one another [to extinction] and We turned them into folktales. So away with the faithless lot!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then sent We our messengers in succession: every time there came to a people their messenger, they accused him of falsehood: so We made them follow each other (in punishment): We made them as a tale (that is told): So away with a people that will not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Our Messengers in succession, every time there came to a nation their Messenger, they denied him, so We made them follow one another (to destruction), and We made them as Ahadith (the true stories for mankind to learn a lesson from them). So away with a people who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Our Messengers in succession. Yet whenever its Messenger came to a nation they belied him, so We made them follow others, and We made them but as tales, so begone the nation who did not believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Our messengers in succession. Every time a messenger came to his community, they called him a liar. So We made them follow one another, and made them history. So away with a people who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Our messengers in succession. Every time there came to a nation its messenger, they denied him, so We made them follow one another [to destruction], and We made them narrations. So away with a people who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:44] Then sent We Our messengers successively (read tatran or tatrā: one following the other, with a long interval between every two). Whenever there came to a community (jā’a ummatan: read pronouncing both hamzas, or without pronouncing the second one between it and the wāw [vowel]) its messenger they denied him; so We made them follow one another, to destruction, and We turned them into folktales. So away with a people who do not believe!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We sent our messengers one after another. Whenever its messenger came unto a nation they denied him) they denied that messenger; (so We caused them to follow one another (to disaster)) with chastisement (and We made them bywords) We made them the talk of their time. (A far removal) what a disappointment for failing to obtain Allah's mercy (for folk who believe not!) for people who disbelieve in Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلْنَاهُمْ أَحَادِيثَ } معناه مَثَلٌ يُتَمثلُ بهم في الشّرِ\n ولا يقالُ ذلك فِي الخَيرِ\n\n\n\n\nوقوله تعالى: { تَتْرَا } معناه تتابعُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما انقرضوا { أَرْسَلْنَا رُسُلَنَا } على المنحرفين عن جادة توحيدنا، المنصرفين عن مقتضى سنتنا { تَتْرَا } متواترة متتاليةً بلا تخلل فترةٍ بينهم، فصار الأمر بينهم { كُلَّ مَا جَآءَ أُمَّةً رَّسُولُهَا } لإصلاح حالهم واعتدال خلافتهم وأعمالهم { كَذَّبُوهُ } وأنكروا له وظهروا عليه بالمقاتلة والمشاجرة، فأهلكناهم واستأصلناهم بسبب تكذيبهم وإنكارهم { فَأَتْبَعْنَا بَعْضَهُمْ بَعْضاً } بالهلاك؛ أي: أهلكناهم متتابعةً بعضهم بعد بعضٍ إلى أن طهرنا الأرض عن خبثهم وفسادهم { وَجَعَلْنَاهُمْ أَحَادِيثَ } أي: حكاياتٍ وقصصاً يُسمر بهم، ويَعتبر المتعبرون عما جرى عليهم، ويقولون في حقهم ب عدما سمعوا قصصهم معتبرين: { فَبُعْداً } أي: طرداً وحرامناً ومقتاً وخذلاناً { لِّقَوْمٍ لاَّ يُؤْمِنُونَ } [المؤمنون: 44] بتوحيد الله ولا يصدقون رسله، وجميعَ ما جاءوا به من عنده سبحانه من المعتقدات المتعلقة بالنشأتين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم أرسلنا رسلَنا } ، عطف على \" أنشأنا \" ، على معنى أن إرسالهم متراخ عن إنشاء القرون المذكورة، وما بينهما اعتراض، والمعنى: ثم أنشأنا من بعدهم قروناً آخرين، قد أرسلنا إلى كل قرن منهم رسولاً خاصاً به، والفصل بين الجملتين بالجملة المتعرضة الناطقة بعدم تقدم الأمم من أجلها المضروب لهلاكهم للمسارعة إلى بيان هلاكهم على وجهٍ إجمالي\n وقوله: { تَتْرَى } أي: متواترين واحداً بعد واحد، أو متتابعين يتبع بعضهم بعضاً، { كلما جاء أمةً رسولها كذبوه } ، الرسول يلابس المرسِل والمرسلَ إليه، والإضافة تكون بالملابسة، فأضافهم أولاً إلى نون العظمة، وهنا إلى المرسل إليهم للإشعار بكمال شناعتهم وضلالتهم، حيث كذبت كلُّ أمةٍ رسولها المعين لها، وعبَّر عن التبليغ بالمجيء للإيذان بأنهم كذبوه في الملاقاة الأولى، { فأتبعنا بعضَهم بعضاً } في الهلاك، كما تبع بعضهم بعضاً في الكفر والتكذيب، الذي هو سبب الهلاك، { وجعلناهم أحاديثَ } أخبار، يُسمر بها ويُتعجب منها، أي: لم يبق منهم إلا حكايات يعتبر بها المعتبرون، والأحاديث يكون اسم جمع للحديث، ومنه: أحاديث النبي - عليه الصلاة والسلام - ويكون جمعاً للأحدوثة، وهي ما يتحدث بها الناس تلهياً وتعجباً، وهو المراد هنا { فبعداً لقوم لا يؤمنون } به وبرسله اقتصر هنا على عدم إيمانهم وأما القرون الأولى فحيث نقل عنهم ما مرَّ من العتو وتجاوز الحد في الكفر والعدوان وصفهم بالظلم\n والله تعالى أعلم وأحكم\n الإشارة: كل ما حكى الله تعالى عن القرون الماضية والأمم السابقة، فالمراد ترهيب هذه الأمة المحمدية، وإزعاجٌ لها عن أسباب الهلاك، وإنهاض لها إلى العمل الصالح، لتكون أحاديث حِساناً بين الأمم، فكل إنسان ينبغي له أن يجتهد في تحصيل الكمالات العلمية والعملية، ليكون حديثاً حسناً لمن بعده، كما قال القائل:\n\nوقال آخر:\n",
      "translations": []
    }
  ]
}