{
  "chapter": "المؤمنون",
  "text": "فاخذتهم الصيحة بالحق فجعلنهم غثاء فبعدا للقوم الظلمين",
  "translations": [
    {
      "translation": "The Great Blast seized hold of them inexorably and We turned them into dirty scum. Away with the people of the wrongdoers!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they were rightly seized by a mighty blast; and We turned them into mouldy rubbish: A good riddance of the wicked people!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then a mighty blast quite justly overtook them, and We reduced them to a rubble. So away with the wrong-doing folk!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A blast struck them for a just cause, and We made them look like withered leaves. God keeps the unjust people away from His mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the true Scream seized them – We therefore made them like rotten hay; so away with the unjust people!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, the Sayhah overtook them in truth, and We made them as rubbish of dead plants. So, away with the people who are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the punishment overtook them in justice, and We made them as rubbish; so away with the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Cry seized them justly, and We made them as scum; so away with the people of the evildoers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the (Awful) Cry overtook them rightfully, and We made them like as wreckage (that a torrent hurleth). A far removal for wrongdoing folk!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The blast justly struck them and We reduced them to rubble. Away with such wicked people!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the shout laid hold of them in truth, and We made them a refuse; so away with the wrong-doing people!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the Cry seized them justly and We turned them into a scum. So away with the wrongdoing lot!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Blast overtook them with justice, and We made them as rubbish of dead leaves (floating on the stream of Time)! So away with the people who do wrong!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So As-Saihah (torment - awful cry, etc.) overtook them with justice, and We made them as rubbish of dead plants. So away with the people who are Zalimun (polytheists, wrong-doers, disbelievers in the Oneness of Allah, disobedient to His Messengers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Cry seized them in justice and We made them withered. So begone with the harmdoing nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Blast struck them, justifiably, and We turned them into scum. So away with the wicked people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the shriek seized them in truth, and We made them as [plant] stubble. Then away with the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:41] So the Cry, the Cry of chastisement and destruction, seized them rightfully, and they died, and We made them as husks (ghuthā’ is desiccated vegetation, in other words, We transformed them into similarly desiccated [worthless] things). So a far removal, from mercy, for the evildoing folk, the denying [folk].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So the (Awful) Cry overtook them rightfully) i.e. the punishment, which is the cry of Gabriel, seized them, (and We made them) when the chastisement stopped (like a wreckage (that a torrent hurls). A far removal) an utter destruction and disappointment for failing to obtain Allah's mercy (for wrong-doing folk!) for the disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَخَذَتْهُمُ ٱلصَّيْحَةُ } الهائلة من جانب السماء بغتةً، قيل: صاح عليهم جبريل عليه السلام صيحةً هائلة، بعدما تعلق إرادته الله بإهلاكهم ملتبساً { بِٱلْحَقِّ } أي: بالعذاب الثابت المحقق الواجب وقوعه { فَجَعَلْنَاهُمْ } وصيرنا أجسادهم { غُثَآءً } أي: كالغثاء الذي يسيل به الماء، وهو الزبد والحشائش التي يذهب بها الماء { فَبُعْداً لِّلْقَوْمِ ٱلظَّالِمِينَ } [المؤمنون: 41] أي: بعدما صاروا كذلك، قيل في حقهم: بَعُد بعداً وطرداً للقوم اللظالمين الخارجين عن مقتضى أوامر الله ونواهيه، النازلة منه سبحانه على ألسنة أنبيائه ورسله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأخذتهم الصيحةُ } ، لعلهم، حين اصابتهم الريح العقيم، أُصيبوا في تضاعيفها بصيحة هائلة من صوته\n أو يراد بها: صرير الريح وصوته\n وقد رُوي أن شَدَّاداً حين أتم بناء إرم، سار إليها بأهله، فلما دنا منها بعث الله عليهم صيحة من السماء، فهلكوا، وقيل: الصيحة: العذاب المصطلِم، قال الشاعر:\n\nوإذ قلنا: هم قوم صالح، فالصيحة صيحة جبريل عليه السلام، صاح عليهم فدمرهم\n وقوله: { بالحق } أي: بالعدل من الله، يقال: فلان يقضي بالحق، أي بالعدل، أو: أخذتهم بالحق، أي: بالأمر الثابت الذي لا دفاع له، { فجعلناهم غُثاء } أي: كغثاء السيل، وهو ما يحمله من الورق والحشيش، شبههم في دمارهم بالغثاء، وهو ما يرميه السيل، من حيث أنهم مَرْمِي بهم في كل جانب وسَهْب\n { فبُعداً }: فهلاكاً، يقال بَعُدَ بُعْداً، أي: هلك هلاكاً، وهو من المصادر المنصوبة بأفعال لا تظهر أفعالها، أي: فسحقاً { للقوم الظالمين } ، وهو إخبار، أو دعاء، واللام لبيان من دُعي عليه بالبُعد، كقوله:\n\n[يوسف: 23]\n والله تعالى أعلم\n الإشارة: من عادة الحق - سبحانه -، إذا أكب الناس على دنياهم، واتخذوا إلههم هواهم، بعث من يذكرهم بالله، فيقول لهم: اعبدوا الله، ما لكم من إله غيره، أي: أفردوه بالمحبة، واقصدوه بالوجهة، فما عبدَ الله من عبد هواه، فيقول المترفون، وهم المنهمكون في الغفلة، المحجوبون بالنعمة عن المنعم، الذين اتسعت دائرة حسهم: ما هذا الذي يعظكم، ويريد أن يخرجكم عن عوائدكم، ألا بشر مثلكم، يأكل مما تأكلون، ويشرب مما تشربون، وما دَروا أنَّ وصف البشرية لا ينافي وجود الخصوصية، فإذا تمادوا في غفلتهم، وأيس من هدايتهم، ربما دعا عليهم، فأصبحوا نادمين، حين لا ينفعهم الندم، وذلك عند نزول هواجم الحِمَامِ\n وبالله التوفيق\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "87:5",
      "similarity": 0.628453087368051
    },
    {
      "verse": "50:42",
      "similarity": 0.23489771655794361
    },
    {
      "verse": "15:83",
      "similarity": 0.23211251841097305
    },
    {
      "verse": "15:73",
      "similarity": 0.22095298965654034
    },
    {
      "verse": "36:49",
      "similarity": 0.21178419407829516
    }
  ]
}