{
  "chapter": "المؤمنون",
  "text": "ولقد ءاتينا موسى الكتب لعلهم يهتدون",
  "translations": [
    {
      "translation": "And We gave the Book to Moses so that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book that people might be guided by it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave the Book to Moses so that perhaps they may have guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Moosa the Book, that they may attain guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa the Scripture, that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave Musa the Book that they may follow a right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book, that haply they would be guided;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We verily gave Moses the Scripture, that haply they might go aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Book so that they might be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed unto Musa the Book, that haply they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We gave Moses the Book so that they might be guided,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book, in order that they might receive guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Musa (Moses) the Scripture, that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book, in order that they might be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Scripture, that they may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We certainly gave Moses the Scripture that perhaps they would be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:49] And verily We gave Moses the Scripture, the Torah, that perhaps they, his people, the Children of Israel, might be guided, thereby from error — he [Moses] was given it [the Scripture] after the destruction of Pharaoh and his folk all at once.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And we verily gave Moses the Scripture) the Torah, (that haply they might go aright) that haply they might be led to guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل { لَقَدْ آتَيْنَا مُوسَىٰ } من كمال جودنا ولطفنا معه { ٱلْكِتَابَ } أي: التوراة الجامع لإصلاح الظاهر والباطن { لَعَلَّهُمْ } أي: قوم موسى { يَهْتَدُونَ } [المؤمنون: 49] به إلى مقر التوحيد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولقد آتينا } بعد إهلاكهم، وإنجاء بني إسرائيل من مِلكِهم واسترقاقهم، { موسى الكتابَ }: التوراة، ولَمَّا نزلت لإرشاد قومه جُعلوا كأنهم أوتوها، فقيل: { لعلهم يهتدون } إلى الحق بالعمل بما من الشرائع والأحكام، وقيل: على حذف مضاف، أي: آتينا قوم موسى، كقوله:\n\n[يونس: 83]، أي: من آل فرعون وملئهم\n والله تعالى أعلم\n الإشارة: كل من طُرد وأُبعد عن ساحة رحمة الله تعالى والوصول إليه، فإنما سببه التكبر والعلو، وكل من قرب ووصل إلى الله فإنما سببه التواضع والحنو، ولذلك ورد:\n\n\n\n \" لا يَدْخُلُ الجَنَّةَ مَنْ كان في قَلْبِه مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ \" \n\nوحقيقة الكِبرِ: بَطَرُ الحَقِّ وغَمْطُ النَّاسِ، أي: إنكار الحق واحتقار الناس، وفي مدح التواضع والخمول ما لا يخفى\n فمن تواضع، دون قدره، رَفَعَهُ الله فوق قدره، فالتواضع مصيدة الشرف، به يصطاد وينال، ومن أوصاف أهل الجنة: \" كل ضعيف مستضعف، لو أقسم على الله لأبره في قسمه \" ، إلى غير ذلك من الأخبار\n وكل من أنكر على أهل الخصوصية فسببه إما الحسد، أو الجهل بأن الخصوصية لا تنافي أوصاف البشرية، أو قياس الرئاسة الباطنية الدينية على الرئاسة الدنيوية، فأسقط من لا رئاسة له في الظاهر ولا جاه، أو لعدم ظهور الكرامة، وهي غير مطلوبة عند المحققين\n والله تعالى أعلم\n ثم ذكر عيسى عليه السلام\n",
      "translations": []
    }
  ]
}