{
  "chapter": "المؤمنون",
  "text": "وان هذه امتكم امة وحدة وانا۠ ربكم فاتقون",
  "translations": [
    {
      "translation": "This faith of yours is a single faith and I am your Lord, so have taqwa of Me.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily this your order is one order, and I am your Lord, so fear Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This community of yours is one community, and I am your Lord; so hold Me alone in fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your religion is one and I am your Lord. Have fear of Me\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And indeed this religion of yours is one religion only and I am your Lord, therefore fear Me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, this your religion is one religion, and I am your Lord, so have Taqwa.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely this your religion is one religion and I am your Lord, therefore be careful (of your duty) to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely this community of yours is one community, and I am your Lord; so fear Me.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! this your religion is one religion and I am your Lord, so keep your duty unto Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your religion is but one religion -- and I am your only Lord, therefore, fear Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily this religion of yours is one religion, and I am your Lord, so fear Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed this community of yours is one community, and I am your Lord, so be wary of Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily this Brotherhood of yours is a single Brotherhood, and I am your Lord and Cherisher: therefore fear Me (and no other).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily! This your religion (of Islamic Monotheism) is one religion, and I am your Lord, so keep your duty to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your nation is but one nation, and I am your Lord, therefore fear Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This nation of yours is one nation, and I am your Lord, so fear Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed this, your religion, is one religion, and I am your Lord, so fear Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:52] And know, that this, creed of Islam, is your community, your religion, O you being addressed, that is, you must adhere to it as, one community — a necessary state [of affairs] (a variant reading [for anna, ‘that’] has the softened form [in]; a variant has inna, ‘truly’, indicating the beginning of [an independent] new sentence) and I am your Lord, so fear Me’, so be fearful of Me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِنَّ هَذِهِ أُمَّتُكُمْ أُمَّةً وَاحِدَةً وَأَنَا رَبُّكُمْ فَاتَّقُونِ (52)يجوز أن تكون الواو عاطفة على جملة { يا أيها الرسل كلوا من الطيبات } \\[ المؤمنون : 51 \\] الخ ، فيكون هذا مما قيل للرسل . والتقدير : وقلنا لهم { إن هذه أمتكم أمة واحدة } الآية . ويجوز أن تكون عطفاً على قصص الإرسال المبدوءة من قوله : { ولقد أرسلنا نوحاً إلى قومه } \\[ المؤمنون : 23 \\] لأن تلك القصص إنما قصت عليهم ليهتدوا بها إلى أن شأن الرسل منذ ابتداء الرسالة هو الدعوة إلى توحيد الله بالإلهيَّة . وعلى هذا الوجه يكون سياقها كسياق آية سورة الأنبياء ( 92 ) { إن هذه أمتكم أمة واحدة } الآية .وفي هذه الآية ثلاث قراءات بخلاف آية سورة الأنبياء . فتلك اتفق القراء على قراءتها بكسر همزة ( إن ) . فأما هذه الآية فقرأ الجمهور { وأنّ } بفتح الهمزة وتشديد النون ، فيجوز أن تكون خطاباً للرسل وأن تكون خطاباً للمقصودين بالنذارة على الوجهين وفتح الهمزة بتقدير لام كي متعلقة بقوله : { فاتقون } عند من لا يرى وجود الفاء فيه مانعاً من تقديم معموله ، أو متعلقة بمحذوف دل عليه { فاتقون } عند من يمنع تقديم المعمول على العامل المقترن بالفاء ، كما تقدم في قوله تعالى : { فإياي فارهبون } في سورة النحل ( 51 ) .والمعنى عليه : ولكون دينكم ديناً واحداً لا يتعدد فيه المعبود . وكوني ربكم فاتَّقون ولا تشركوا بي غيري ، خطاباً للرسل والمراد أممهم . أو خطاباً لمن خاطبهم القرآن .وقرأه عاصم وحمزة والكسائي وخلف بكسر همزة ( إنّ ) وتشديد النون ، فكسر همزة ( إن ) إما لأنها واقعة في حكاية القول على الوجه الأول ، وإمَّا لأنها مستأنفة على الوجه الثاني . والمعنى كما تقدم في معنى قراءة الجمهور .وقرأ ابن عامر بفتح الهمزة وتخفيف النون على أنها مخففة من ( أنّ ) المفتوحة واسمها ضمير شأن محذوف وخبرها الجملة التي بعدها . ومعناه كمعنى قراءة الجمهور سواء .واسم الإشارة مراد به شريعة كل من الأنبياء أو شريعة الإسلام على الوجهين في المخاطب بهذه الآية .وتأكيد الكلام بحرف ( إن ) على القراءات كلها للرد على المشركين من أمم الرسل أو المشركين المخاطبين بالقرآن .وتقدم تفسير نظيرها في سورة الأنبياء ، إلا أن الواقع هنا { فاتقون } وهناك { فاعبدون } \\[ الأنبياء : 92 \\] فيجوز أن الله أمرهم بالعبادة وبالتقوى ولكن حكى في كل سورة أمراً من الأمرين ، ويجوز أن يكون الأمران وقعا في خطاب واحد ، فاقتصر على بعضه في سورة الأنبياء وذكر معظمه في سورة المؤمنين بحسب ما اقتضاه مقام الحكاية في كلتا السورتين . ويحتمل أن يكون كل أمر من الأمرين : الأمر بالعبادة والأمر بالتقوى . قد وقع في خطاب مستقل تماثَل بعضُه وزاد الآخر عليه بحسب ما اقتضاه مقام الخطاب من قصد إبلاغه للأمم كما في سورة الأنبياء ، أو من قصد اختصاص الرسل كما في سورة المؤمنين . ويرجح هذا أنه قد ذكر في سورة المؤمنين خطاب الرسل بالصراحة .وأيّاً مَّا كان من الاحتمالين فوجه ذلك أن آية سورة الأنبياء لم تذكر فيها رسالات الرسل إلى أقوامهم بالتوحيد عدا رسالة إبراهيم في قوله : { ولقد آتينا إبراهيم رشده } \\[ الأنبياء : 51 \\] ثم جاء ذكر غيره من الرسل والأنبياء مع الثناء عليهم وطال البعد بين ذلك وبين قصة إبراهيم فكان الأمر بعبادة الله تعالى ، أي إفراده بالعبادة الذي هو المعنى الذي اتحدت فيه الأديان . أولى هنالك لأن المقصود من ذلك الأمر أن يبلغ إلى أقوامهم ، فكان ذكر الأمر بالعبادة أولى بالمقام في تلك السورة لأنه الذي حظُّ الأمم منه أكثر . إذ الأنبياء والرسل لم يكونوا بخلاف ذلك قط فلا يقصد أمر الأنبياء بذلك إذ يصير من تحصيل الحاصل إلا إذا أريد به الأمر بالدوام .وأما آية هذه السورة فقد جاءت بعد ذكر ما أرسل به الرسل إلى أقوامهم من التوحيد وإبطال الشرك فكان حظ الرسل من ذلك أكثر كما يقتضيه افتتاح الخطاب ب { يا أيها الرسل } \\[ المؤمنون : 51 \\] فكان ذكر الأمر بالتقوى هنا أنسب بالمقام لأن التقوى لا حد لها ، فالرسل مأمورون بها وبالازدياد منها كما قال تعالى في حق نبيّه { يا أيها المزمل قم الليل إلا قليلاً نصفه أو انقص منه قليلاً أو زد عليه } \\[ المزمل : 1 4 \\] ثم قال في حق الأمة { فاقرأوا ما تيسر من القرآن } \\[ المزمل : 20 \\] الآية . وقد مضى في تفسير سورة الأنبياء شيء من الإشارة إلى هذا ولكن ما ذكرناه هنا أبسط فضُمَّه إليه وعوّل عليه .وقد فات في سورة الأنبياء ( 92 ) أن نبين عربية قوله تعالى : { إن هذه أمتكم أمة واحدة } فوجب أن نشبع القول فيه هنا . فالإشارة بقوله { هذه } إلى أمر مستحضر في الذهن بيّنه الخبر والحال ولذلك أنث اسم الإشارة ، أي هذه الشريعة التي أوحينا إليك هي شريعتك . ومعنى هذا الإخبار أنك تلتزمها ولا تنقص منها ولا تغير منها شيئاً . ولأجل هذا المراد جعل الخبر ما حقه أن يكون بياناً لاسم الإشارة لأنه لم يقصد به بيان اسم الإشارة بل قصد به الإخبار عن اسم الإشارة لإفادة الاتحاد بين مدلولي اسم الإشارة وخبره فيفيد أنه هو هو لا يغير عن حاله .قال الزجاج : ومثل هذه الحال من لطيف النحو وغامضه إذ لا تجوز إلا حيث يعرف الخبر . ففي قولك : هذا زيد قائماً ، لا يقال إلا لمن يعرفه فيفيده قيامَه . ولو لم يكن كذلك لزم أن لا يكون زيداً عند عدم القيام وليس بصحيح .وبهذا يعلم أن ليس المقصود من الإخبار عن اسم الإشارة حقيقته بل الخبر مستعمل مجازاً في معنى التحريض والملازمة ، وهو يشبه لازم الفائدة وإن لم يقع في أمثلتهم . ومنه قوله تعالى : { وهذا بعلي شيخا } \\[ هود : 72 \\] فإن سارّة قد علمت أن الملائكة عرفوا أن إبراهيم بعلها إذ قد بشروها بإسحاق . وإنما المعنى : وهذا الذي ترونه هو بعلي الذي يُترقب منه النسل المبشرَّ به ، أي حاله ينافي البشارة ، ولذلك يتبع مثل هذا التركيب بحال تبين المقصود من الإخبار كما في هذه الآية . وقد تقدم ذكر لطيفة في تلك الآية .\n\n",
      "translations": [
        {
          "translation": "(And lo! this your religion is one religion) and your belief is one chosen belief (and I am your Lord) One sole Lord who honoured you with it, (so keep your duty unto Me) so obey Me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إذا علمتم أن مناط أمركم في عملكم المقرِّبة إلى ربكم على وجه الإخلاص والخضوع\n فعليكم بأجمعكم أن تداوموا وتلازموا عليها { إِنَّ هَـٰذِهِ } الطريقة المعهودة المذكورة لكم من ربكم { أُمَّتُكُمْ } أي: قدوتكم وقبلتكم\n موصلةُ إلى توحيد ربكم لذلك صارت { أُمَّةً وَاحِدَةً } لا تعددَّ فيها ولا اختلافَ أصلاً\n وإن كانت جهاتها مختلفةً متعددةً بحسب اختلاف الشرائع والأديان على مقتضى الأعصار والأزمان { وَأَنَاْ رَبُّكُمْ } الواحد الأحد الصمد الفرد الوتر\n الذي لا أكون عرضةً للتعدد والكثرة أصلاً { فَٱتَّقُونِ } [المؤمنون: 52] عن أخذي وبطشي ومتقضيات جلالي وقهري\n إذ لا ملجأ لكم غيري\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فما بالك بغيرهم ممن ألهته النعم عن شهود المنعم وشكره؟! { وإن هذه أمتكم } أي: ملتكم وشريعتكم التي أنتم عليها { أمةً واحدة } أي: ملة واحدة\n متحدة في أصول الشرائع\n التي لا تُبدل بتبدل الأعصار\n وهو التوحيد وما يتبعه من أصول العقائد\n { وأنا ربكم } من غير أن يكون لي شريك في الربوبية\n { فاتقون }: فخافوا عتابي في مخالفتكم أمري\n أو في شق العصا\n والمخالفة بالإخلال بمواجب ما ذكر من اختصاص الربوبية بي\n والخطاب للرسل والأمم جميعاً\n على أن الأمر في حق الرسل للتهييج\n وفي حق الأمم للتحذير\n قيل: وجاء هنا: \" فاتقون \" \n الذي هو أبلغ في التخويف والتحذير من قوله في الأنبياء:\n[الأنبياء: 92] لأن هذه جاءت عقب إهلاك طوائف كثيرين\n وفي الأنبياء\n وإن تقدمت أيضاً قصة نوح وما قبلها\n فإنه جاء بعدها ما يدل على الإحسان واللطف التام\n في قصة أيوب ويونس وزكريا ومريم\n فناسب الأمر بالعبادة لمن هذه صفته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:92",
      "similarity": 0.8788863834376494
    },
    {
      "verse": "37:4",
      "similarity": 0.6138021253271476
    },
    {
      "verse": "2:163",
      "similarity": 0.5453971589268969
    },
    {
      "verse": "42:8",
      "similarity": 0.4502064802215014
    },
    {
      "verse": "16:93",
      "similarity": 0.4499815232487288
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/023052.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/023052.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}