{
  "chapter": "المؤمنون",
  "text": "وجعلنا ابن مريم وامه ءاية وءاوينهما الى ربوة ذات قرار ومعين",
  "translations": [
    {
      "translation": "And We made the son of Maryam and his mother a Sign and gave them shelter on a mountainside where there was a meadow and a flowing spring.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the son of Mary and his mother a sign, and gave them shelter on an elevated ground, sequestered, watered by a spring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made Mary's son, and his mother, a Sign, and We gave them refuge on a lofty ground, a peaceful site with springs flowing in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the son of Mary and his mother a miracle and settled them on a high land, quite secure and watered by a spring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the son of Maryam (Prophet Eisa) and his mother a sign, and We gave them shelter on a height, a place to stay and visible springs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the son of Maryam and his mother as a sign, and We gave them refuge on a Rabwah, Dhat Qarar, and Ma`in.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the son of Marium and his mother a sign, and We gave them a shelter on a lofty ground having meadows and springs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We made Mary's son, and his mother, to be a sign, and gave them refuge upon a height, where was a hollow and a spring:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the son of Mary and his mother a portent, and We gave them refuge on a height, a place of flocks and watersprings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the son of Mary and his mother a sign and gave them shelter on a peaceful hillside watered by a fresh spring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the son of Maryam and his mother a sign; and We sheltered the twain on a height: a quiet abode and running water.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We made the son of Mary and his mother a sign, and sheltered them in a level highland with flowing water.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the son of Mary and his mother as a Sign: We gave them both shelter on high ground, affording rest and security and furnished with springs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the son of Maryam (Mary) and his mother as a sign, And We gave them refuge on high ground, a place of rest, security and flowing streams.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the son of Mary and his mother a sign, and gave them a refuge on a hillside where there was a hollow and a spring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made Mary’s son and his mother a sign, and We sheltered them on high ground with security and flowing springs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the son of Mary and his mother a sign and sheltered them within a high ground having level [areas] and flowing water.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:50] And We made the son of Mary, Jesus, and his mother a sign — He did not say ‘two signs’ because the same sign is in both of them: his being born without [his mother’s having] a male spouse. And We gave them refuge on a height (rabwa), a highland — in this case [either] the Holy House [of Jerusalem], Damascus or Palestine, all of which are [alternative] opinions — level (dhāt qarār), an flat [high-] land on which its inhabitants are able to settle (yastaqirru), and watered by springs, running water, over ground, which the eyes can see.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We made the son of Mary) i.e. Jesus (and his mother a portent) a sign and admonition: a son without a father and a pregnancy without physical contact, (and We gave them refuge on a height) on an elevated location, (a place of flocks and water springs) the reference here is to Damascus.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَآوَيْنَاهُمَآ إِلَىٰ رَبْوَةٍ ذَاتِ قَرَارٍ وَمَعِينٍ } معناه ضَمَمناهُما يعني عِيسى وأُمهُ عليهما السلام\n ورُبْوَةٌ: مكانٌ مرتفعٌ\n ويقال رَبْوةٌ بالفتح والمَعينُ: المَاء الظاهرُ وذَلِكَ بدِمشق\n ويقال: بمِصر\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد انقضاء زمن موسى وانقراض أعدائه { جَعَلْنَا ٱبْنَ مَرْيَمَ } عيسى صلوات الرحمن عليه { وَأُمَّهُ }\n رضي الله عنها\n أي: كل واحدٍ منهما { آيَةً } دالةً على كمال قدرتنا وبدائع حكمتنا وغرائب صنعنا وقدرتنا، جعلنا لعيسى من الخوارق والمعجزات ما لايخفى، ولمريم أيضاً من الكرامات والإرهاصات الخارقة للعادة منها: الحمل بلا مسيس زوج، وسقوطُ الثمرة من النخلة اليابسة لأجلها في محل الشتاء، وحضورُ أنواع الأطعمة والفواكه عندها حال كونها في المحراب والأبواب مغلقة عليه مع أنها ما تشِبَّه بأطعمة الدنيا وفواكهها، وغيرُ ذلك من الإرهاصات الغريبة\n\n\n\n\n{ وَ } بعدما أخرجهما الجاهلون عن منزلهما { آوَيْنَاهُمَآ } أي: أرجعناهما { إِلَىٰ رَبْوَةٍ ذَاتِ قَرَارٍ وَمَعِينٍ } [المؤمنونن: 50] أي: إلى مكانٍ مرتفعٍ من الأ { ض، كثيرِ المأكل والمشارب يتنعم ويترفه ساكنوها فيها بلا ترددٍ واضطرابٍ في أمر المعاش، قيل: هي بيت المقدس أو دمشق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وجعلنا ابنَ مريَم وأمه آيةً } دالة على كمال قدرتنا بولادته منها من غير مسيس بشر، ووحَّدها لأن الأعجوبة فيهما واحدة\n أو المراد: وجعلنا ابن مريم آية وأمه آية، فحذفت الأولى لدلالة الثانية عليها، أي: وجعلنا ابن مريم وحده، من غير أن يكون له أب، آية، وأمه، من حيث أنها وَلدت من غير ذَكَر، آية، وتقديمه عليه السلام لأصالته فيما ذَكَر من كونه آية كما أن تقديم أمه في قوله تعالى:\n",
      "translations": []
    }
  ]
}