{
  "chapter": "المؤمنون",
  "text": "فتقطعوا۟ امرهم بينهم زبرا كل حزبۭ بما لديهم فرحون",
  "translations": [
    {
      "translation": "But they disagreed and split up, dividing into sects, each party exulting in what it had.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But then they divided up their order into different creeds, each section rejoicing in what it had come to have.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But people later cut up their religion into bits, each group rejoicing in what they have.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people divided themselves into many sects, each with their own book and each happy with whatever they had.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their nations broke their tasks into pieces; every group happy with what it has.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they have broken their religion among them into sects, each group rejoicing in what is with it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they cut off their religion among themselves into sects, each part rejoicing in that which is with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they split in their affair between them into sects, each party rejoicing in what is with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they (mankind) have broken their religion among them into sects, each group rejoicing in its tenets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they divided themselves into factions, each rejoicing in what they had.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they cut their affair among them in regard to the Scriptures: each band in that which is with them rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they fragmented their religion among themselves, each party boasting about what it had.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But people have cut off their affair (of unity), between them, into sects: each party rejoices in that which is with itself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they (men) have broken their religion among them into sects, each group rejoicing in its belief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they have split their affairs between themselves into sects, each rejoicing in what it has.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they tore themselves into sects; each party happy with what they have.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the people divided their religion among them into sects - each faction, in what it has, rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:53] But they, the followers, split into sects regarding their affair, their religion (zuburan, ‘sects’, is a circumstantial qualifier of the subject of the verb taqatta‘ū, ‘they split’), in other words, [they became] opposing parties, the likes of the Jews and the Christians and others, each party rejoicing in, exultant with, what they had, that is, with the religion they had.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But they (mankind) have broken their religion among them into sects) so they split among themselves with regard to religion into different groups: groups of Jews, Christians, idolaters and Magians, (each sect) the adherents of each religion and sect (rejoicing in its tenets) being impressed with what they have.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَيْنَهُمْ زُبُراً } معناه قِطعٌ\n وزُبَرٌ معناه قِطعةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومع ذلك { فَتَقَطَّعُوۤاْ أَمْرَهُمْ بَيْنَهُمْ } أي: دينهم الواحد وملتهم الواحدة { زُبُراً } قِطعاً مختلفةً وأحزاباً متفاوتةً ومِلَلاً متخالفةً، يدعي كل منهم حقية دينه وملته، فصار { كُلُّ حِزْبٍ } منهم { بِمَا لَدَيْهِمْ } من الدين والملة { فَرِحُونَ } [المؤمنون: 53] مسرورون معجَبون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { فتقطَّعوا أمرهم } أي: فتفرقوا في أمر دينهم مع اتحاده، وجعلوه قطعاً متفرقة، وأدياناً مختلفة، { بينهم زُبراً } أي: قطعاً - جمع زَبور، بمعنى الفرقة، ويؤيده قراءة من قرأ: زُبَراً بفتح الباء، جمع زُبْرة كغُرْفة، أي: قطعاً مختلفة، كلٌّ ينتحل كتاباً، وقيل: جمع زَبور، بمعنى كتاب، أي: كل فريق يزعم أن له كتاباً يتمسك به\n\n\nوعن الحسن: قطعوا كتاب الله قطعاً وحرَّفوه، والأول أقرب، أي: تفرقوا في أصل الدين فرقاً، وتحزبوا أحزاباً، { كل حزب } من أولئك المتحزبين { بما لديهم } من الدين الذي اختاروه، أو من الهوى والرأي، { فَرِحُون }: مُعجبُون، يعتقدون أنه الحق",
      "translations": []
    }
  ]
}