{
  "chapter": "المؤمنون",
  "text": "ان الذين هم من خشية ربهم مشفقون",
  "translations": [
    {
      "translation": "Surely those who live in awe of their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who stand in awe for fear of their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who are, out of fear of Him, humble before their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who are overwhelmed due to the fear of their Lord –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who live in awe for fear of their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they who from fear of their Lord are cautious,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who tremble in fear of their Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who go in awe for fear of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who tremble with fear of their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who for fear of their Lord are in awe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who are apprehensive for the fear of their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who live in awe for fear of their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! Those who live in awe for fear of their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who tremble in fear of their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, from awe of their Lord, are fearful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they who are apprehensive from fear of their Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:57] Surely those who, for fear of their Lord, are apprehensive, are fearful of His chastisement,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah clarified to whom He hastens with good things in the life of this world, saying: (Lo! those who go in awe for fear of their Lord) of their Lord's chastisement; for these We hasten with good things;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ هُم مِّنْ خَشْيةِ رَبِّهِمْ مُّشْفِقُونَ } [المؤمنون: 57] خائفون حذرون متحرزون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقال في الحاشية: لمّا ذكر تعالى غفلةَ الكفار ووعيدهم، عقَّب ذلك بوصف المؤمنين بضد ذلك ويقينهم بالرُّجْعَى، وإشفاقهم من جلال الحق وقهره\nهـ\n يقول الحق جل جلاله: { إن الذين هم من خشية ربهم مشفقون } أي: من عذابه خائفون حذرون، { والذين هم بآيات ربهم } المنصوبة والمُنَزَّلة، يؤمنون بتصديق مدلولها، وبكتب الله كلها، لا يُفرقون بين كتبه، كالذين تقطعوا أمرهم بينهم - وهم أهل الكتاب وغيرهم، { والذين هم بربهم لا يشركون } شركاً جلياً ولا خفياً، بخلاف مشركي العرب والعجم\n { والذين يُؤتون ما آتَوْا } أي: يعطون ما أعطوا من الزكوات والصدقات\n وقرئ: يأَتُونَ مَا أَتَواْ بالقصر، أي: يفعلون من الطاعات، { وقلوبهم وَجِلةٌ }: خائفة ألاَّ تُقبل منهم لتقصيرهم بأن لا يقع على الوجه اللائق، فيُؤخذوا به ويُحرموا ثوابه لأنهم { إلى ربهم راجعون } فيعاتبهم، أو من مرجعهم إليه، وهو يعلم ما يحيق عليهم، والمصولات الأربعة عبارة عن طائفة واحدة متصفة بما ذكر، في حَيِّزِ صِلاتِهَا من الأوصاف الأربعة، لا عن طوائف، كل واحدة منها متصفة بواحد من الأوصاف المذكورة، كأنه قيل: إن الذين هم من خشية ربهم مشفقون، وبآيات ربهم يؤمنون\n\n\n إلخ\n وإنما كرر الموصول إيذاناً باستقلال كل واحد من تلك الصفات بفضيلة باهرة على حِيالها، وتنزيلاً لاستقلالها منزلة استقلال الموصوف بها، وخبر \" إنّ \": { أولئك يسارعون } ، أشار إليهم بالجمع اعتبار اتصافهم بتلك النعوت، مع أنَّ الموصول واقع على الجمع\n ومعنى البُعد للإشعار ببُعد رُتبتهم في الفضل، أي: أولئك المنعوتون بتلك النعوت الجليلة يسرعون { في الخيرات } أي: يرغبون في الطاعات أشد الرغبة، فيبادرون إليها\n أويسارعون في نيل الخيرات العاجلة والآجلة الموعودة على الأعمال الصالحات كما في قوله تعالى:\n\n[آل عمران: 148]، وقوله:\n\n[النحل: 122]، فقد أثبت لهم ما نفى عن أضدادهم، غير أنه غيّر الأسلوب، حيث لم يقل: أولئك نسارع لهم في الخيرات بل أسند المسارعة إليهم إيماءاً إلى كمال استحقاقهم نيل الخيرات لمحاسن الأعمال\n وإيثار كلمة \" في \" ،عن كلمة \" إلى \" إيذانا بأنهم مُتَقلِّبون في فنون الخيرات، لا أنهم خارجون عنها متوجهون إليها، كما في قوله تعالى:\n\n[آل عمران: 133] الآية\n { وهم لهم } أي: لأجل نيل تلك الخيرات، { سابقون } الناس إلى الطاعات، أو: وهم إياها سابقون، واللام زائدة لتقوية العامل، كقوله: { وهم لها عاملون } أي: ينالونها قبل الآخرة، فتُعجل لهم في الدنيا، وعن ابن عباس: { هم لها سابقون } أي: سبقت لهم من الله السعادة، فلذلك سارعوا في الخيرات\n هـ\n فهو إشارة إلى تيسير كلِّ لما خُلِق له، وأنه يَسَّرهمُ القدرُ لما وصفهم به من الخير، كما أن الكفار أُمدوا بما يدعو للغفلة والإعجاب، مما هو استدراج ومكر من حيث لا يشعرون\n\n\nقال تعالى: { ولا نُكلِف نفساً إلا وُسْعَها } أي: طاقتها، فهو تحريض على تحصيل ما وُصف به السابقون من فعل الطاعات المؤدي إلى نيل الخيرات ببيان سهولته، وأنه غير خارج عن حد الوسع والطاقة، أي: عادتنا جارية بأنْ لا نكلف نفساً من النفوس إلا ما في طاقتها، فإن لم يبلغوا في فعل الطاعة مراتب السابقين، فلا عليهم، بعد أن يبذلوا طاقتهم ويستفرغوا وسعهم\n { ولدينا كتابٌ } أي: صحائف الأعمال التي يرونها عند الحساب، حسبما يُعرب عنه قوله: { ينطِق بالحق } ، كقوله:\n\n[الجاثية: 29] أي: عندنا كتاب أثبت فيه أعمال كل أحد على ما هو عليه، أو أعمال السابقين والمقتصدين جميعاً، وقوله: بالحق: يتعلق بينطق، أي: يُظهر الحق المطابق للواقع على ما هو عليه، أو يظهره للسامع، فيظهر هناك جلائل أعمالهم ودقائقها، ويرتب عليها أجزيتها،إن خيراً فخير، وإن شراً فشرٌ، وقيل: المراد بالكتاب: اللوح المحفوظ، وهو مناسب لتفسير ابن عباس بسبق السعادة، وقوله: { وهم لا يظلمون } ، بيان لفضله تعالى وعدله في الجزاء، إثر بيان لطفه في التكليف وكتب الأعمال، أي: لا يظلمون في الجزاء بنقص الثواب أو بزيادة عذاب، بل يُجزون بقدر أعمالهم التي كُلّفوها، ونطقت بها صحائف أعمالهم، أو: لا يُظلمون بتكليف ما لا وسع فيه، أو: لا ينقصون مما سبق لهم في اللوح المحفوظ شيئاً، والله تعالى أعلم\n الإشارة: ذكر في هذه الآية أربعة أوصاف من أوصاف المقربين، أولها: الخوف والإشفاق من الطرد والإبعاد، والثاني: الإيمان الذي لا يبقى معه شك ولا وَهْم، بما تضمنته الآيات التنزيلية من الوعد والإيعاد، والثالث: التوحيد الذي لا يبقى معه شرك جلي ولا خفي، والرابع: السخاء والكرم، مع رؤية التقصير فيما يعطي\n فمن جمع هذه الخصال كان من السابقين في الخيرات ويُسارع لهم في تعجيل الخيرات، وكل ذلك بقدر ما يطيق العبد، مع بذل المجهود في فعل الخيرات\n قال في الحاشية: والمسارعة إلى الخيرات إنما هو بقطع الشرور وأول الشرور: حب الدنيا لأنها مزرعة الشيطان، فمن طلبها وعمرها فهو حراثه وعبده، وشر من الشيطان من يُعين الشيطان على عمارة داره، وما ذلك إلا أنه لم يهتم بأمر معاده ومنقلبه، لما جرى عليه في السابقة من الحكم، ولا كذلك من وصفه في الإشفاق من المؤمنين إجلالاً لربهم، ورجوعاً لحكمه فيهم غيباً، فلا يأمنون مكره بحال، ولا يركنون إلى أعمال، بل عمدتهم ربهم ورحمته في كل حال\n والله أعلم\n والحاصل: أنهم مع كونهم يخشون ربهم ويؤمنون بآياته، ولا يشركون به شيئاً، ويودون طاعته، يخافون عدم قبوله لهم عند الرجوع إليه، ولقائهم له لأنه يفعل ما يشاء، ويحكم ما يريد، وأحكامه لا تعلل، ومن استغرق فيه لم يقف مع وعده\n\n\nهـ\n قوله: \" ومن استغرق فيه لم يقف مع وعده \" ، أي: لأنه قد يرتب ذلك على شروط أخفاها عنه، ليدوم خوفه واضطراره، ولذلك كان العارف لا يزول اضطراره، وليس خوف العارف من السابقة ولا من الخاتمة لأنه شغله استغراقه في الحق والغيبة فيه عن الشعور بالسابقة واللاحقة، إنما خوفه من الإبعاد بعد التقريب، أو الافتراق بعد الجمع، وهذا أيضاً قبل التمكين، وإلا فالكريم إذا أعطى لا يرجع\n والله تعالى أعلم\n ثمَّ ذكر من اتصف بضد الأوصاف المتقدمة\n",
      "translations": []
    }
  ]
}