{
  "chapter": "المؤمنون",
  "text": "ايحسبون انما نمدهم به من مال وبنين",
  "translations": [
    {
      "translation": "Do they imagine that, in the wealth and children We extend to them,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think that by increasing their wealth and children\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they fancy that Our continuing to give them wealth and children (means) that\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think that We are helping them by giving them children and property?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they assume that the wealth and sons which We provide them –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think that in wealth and children with which We prolong them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think that by what We aid them with of wealth and children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do they think that We succour them with of wealth and children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think they that in the wealth and sons wherewith We provide them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they imagine that the wealth and children We have provided\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deem they that in the wealth and sons wherewith We enlarge them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they suppose that whatever aid We provide them in regard to wealth and children [is because]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think that because We have granted them abundance of wealth and sons,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think that We enlarge them in wealth and children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think that in giving them wealth and children\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they assume that, in furnishing them with wealth and children.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they think that what We extend to them of wealth and children\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:55] Do they suppose that in the wealth and children with which We provide them, in the life of this world,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Think they) do the adherents of these sects think (that in the wealth and sons wherewith We provide them) in the life of this world,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَيَحْسَبُونَ } ويعتقدون أولئك الضالون المنهمكون في بحر الغفلة والضلال { أَنَّمَا نُمِدُّهُمْ بِهِ } ونعطيهم إمداداً لهم وإعانةً عليهم { مِن مَّالٍ } ملهٍ لنفوسهم ومشغلٍ لقلوبهم { وَبَنِينَ } [المؤمنون: 55] يستعبدون نفوسهم ويسترقون أعناقهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أيحسبون أنما نُمِدُّهم به } أي: نعطيهم إياه ونجعله مدداً لهم، { من مالٍ وبنين } \" من \": بيان، أي: أيظنون أن الذي نمدهم به من الأموال والبنين، { نُسارعُ لهم } بذلك { في الخيرات بل لا يشعرون } أنه استدراج، قيل: استدراك لقوله: { أيحسبون } أي: بل هم أشباه البهائم، لا شعور لهم حتى يتأملوا في ذلك، هل هو استدراج أو مسارعة في الخيرات؟ وحاصل المعنى: أن هذا الإمداد ليس إلا استدراجاً لهم إلى المعاصي، وهم يحسبونه مسارعة لهم في الخيرات، ومعاملة لهم بالثواب، جزاء على حسن صنيعهم\n وهذه الآية حجة على المعتزلة في مسألة الأصلح لأنهم يقولون: إن الله - تعالى - لا يفعل بأحد من الخلق إلا ما هو أصلح له في الدين، وقد أخبر أن ذلك لا خير لهم فيه ولا صلاح، والله تعالى أعلم\n الإشارة: تناول الطيبات وما تشتهيه النفس من أنواع الملذوذات، مباح في الشرع قديماً وحديثاً، إن كان من وجه مباح وقارنه الشكر لأن الحق تعالى ما خلق ذلك إلا لعباده ليشكروه ويحمدوه، ويتذكروا بذلك نعيم الجنان، الذي لا يفنى ولا يزول، وما هذا النعيم الدنيوي إلا أنموذج من نعيم الآخرة، قال تعالى:\n\n[التوبة: 38]\n هذا باعتبار عامة المسلمين، وأما الخاصة من العُبَّاد والزهاد والمريدين السائرين، فهم يجتنبون ما تجنح إليه النفس، ويتعلق به القلب خوفاً من الإشتغال بذلك عن العبادة أو السير لأن القلب إذا توجه لأمر أعرض عن الآخر، فإذا توجه إلى طلب الشهوات أعرض عن الله، وتَفَتَّر عن السير، وتَكَبَّل عن النهوض إلى الحضرة\n ولذلك قال في الحِكَم: \" كيف يشرق قلب: صُورُ الأكوان منطبعة في مرآته؟ أم كيف يرحل إلى الله وهو مُكَبَّل بشهواته؟ أم كيف يدخل حضرة الله وهو لم يتطهر من جنابة غفلاته؟ أم كيف يرجو أن يفهم دقائق الأسرار وهو لم يتب من هفواته؟ \" وقال بعضهم: لَدغُ الزنابير على الأجسام المَقرحة، أيسر من لدغ الشهوات على القلوب المتوجهة\n\n\nهـ\n وأما خاصة الخاصة وهم العارفون المتمكنون، فهم مع مولاهم، يأخذون من يده ما يعطيهم لأن قلوبهم قد استغرقتها الأنوار، فلم يبق فيها متسع للأغيار، قد تهذبت نفوسهم، واطمأنت بالله قلوبهم، فلا تلتفت إلى غير مولاها\n وبالله التوفيق\n وقوله تعالى: { فتقطعوا أمرهم بينهم\n\n\n } إلخ، الاختلاف، إن كان التوحيد وما يرجع إليه من أصول العقائد، فهو مذموم، وهو الذي نعاه الله على الكفرة المتحزبة، وأمَّا إن كان في الفروع فهو مشروع، كاختلاف الشرائع والمذاهب، ولذلك قال - عليه الصلاة والسلام-:\n\n \" اختلاف أمتي رحمة \" \n\n، وقال بعض الصوفية: ما زالت الصوفية بخير ما تنافروا، فإن توافقوا فلا خير فيهم\nهـ\n والمراد بالتنافر - في حقهم - التناصح، وإنكار بعضهم على بعض إذا رأى من أحد عيباً، فإن سكتوا عن بعضهم، وتوافقوا على مساوئ بعضهم بعضاً، فلا خير فيهم، وأما قلوبهم فهي متوافقة مؤتلفة\n وقوله تعالى: { كل حزب بما لديهم فرحون } ، أما أهل الحق فهم فرحون لسلوكهم على المنهاج المستقيم، المُفضي إلى رضوان الله ورحمته، وأما أهل الباطل فزين لهم الشيطان أعمالهم ليتمكنوا من التقرر عليه حتى ينفذ مراد الله فيهم، ولو تحققوا أنهم على باطل لم يمكن قرارهم عليه، فتبطل حكمته وقهريته، وكل من أقامه الحق - تعالى - في حرفة أو خُطة، زينها الله - تعالى - في قلبه حتى يقوم بها، وكذلك أهل الأسباب من أرباب الدليل والبرهان، مع أهل التجريد من أهل الشهود والعيان، لو علموا بمقام أهل العيان ما أقاموا في الأسباب، ولتجردوا كلهم، فتبطل الحكمة الإلهية\n وكان إبراهيم بن أدهم رضي الله عنه يقول: لو يعلم الملوك ما نحن فيه لجالدونا عليه بالسيوف: فسبحان من قرَّب قوماً وأبعد قوما، { وهم يحسبون أنهم يُحسنون صُنعا }\n والله تعالى أعلم وأحكم\n ثمَّ ذكر أهل التقرب إثر بيان أهل البعد\n",
      "translations": []
    }
  ]
}