{
  "chapter": "المؤمنون",
  "text": "افلم يدبروا۟ القول ام جاءهم ما لم يات ءاباءهم الاولين",
  "translations": [
    {
      "translation": "Why did they not think over the message? Or has something come to them which had not come to their fathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they never ponder over this Word (of God)? Or has he (to wit, the Messenger) brought something the like of which did not come to their forefathers of yore?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Was it that you did not give any thought to it (the Quran)? Was it different from what was revealed to your fathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered the matter, or did that come to them, which did not come to their forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered over the Word, or has there come to them what had not come to their fathers of old\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it then that they do not ponder over what is said, or is it that there has come to them that which did not come to their fathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered the saying, or came there upon them that which came not upon their fathers, the ancients?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered the Word, or hath that come unto them which came not unto their fathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered over the word of God? Has something come to them that did not come to their forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pondered they not over the Word? or came there unto them that which came not unto their fathers ancient?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not contemplated the Discourse, or has anything come to them [in it] that did not come to their forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not ponder over the Word (of Allah), or has anything (new) come to them that did not come to their fathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered over the Word (of Allah, i.e. what is sent down to the Prophet SAW), or has there come to them what had not come to their fathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they not think upon the saying? Or, did anything come upon them that had not come upon their ancient forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered the Word? Or has there come to them what came not to their forefathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then have they not reflected over the Qur'an, or has there come to them that which had not come to their forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:68] God, exalted be He, says: Have they not contemplated (yaddabbarū should actually be yatadabbarū, but the tā’ has been assimilated with the dāl) the discourse, namely, the Qur’ān that is proof of the Prophet’s sincerity, or has there come upon them that which has not come upon their forefathers?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they not pondered the Word) have they not reflected upon the Qur'an and that which it contains of threats, (or hath that come unto them) upon the people of Mecca, of safety and freedom from obligation (which came not unto their fathers of old?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومع استكبارهم واستهزائكم بنا وبآياتنا وبرسلنا على أبلغ الوجوده وأشدها، تستنصرون منا وتستغيثون إلينا؟ { أَ } ينكر المشركون القرآن، ويستكبرون به عناداً ومكابرة { فَلَمْ يَدَّبَّرُواْ } ولم يتأملوا حق التأمل { ٱلْقَوْلَ } أي: المقولَ والمسموعَ؛ ليظهر لهم إعجازه، ويتضح عندهم فصاحته وبلاغته الخارجة عن طور العقل وطوق البشر كي لا يبادروا إلى إنكاره وتكذيبه، بل يصدقوه ويؤمنوا له وبمن جاء به\n\n\n\n\n{ أَمْ جَآءَهُمْ } أي: بل يعلمون لو تأملوا أنه جاءهم من الله كتابُ يخصلهم من العذاب الأخروي لو امتثلوا بما فيه مع أنه { مَّا لَمْ يَأْتِ } أي: كتابهم هذا شيءُ لم يأت مثله { آبَآءَهُمُ ٱلأَوَّلِينَ } [المؤمنون: 68] حتى يتأملوا فيه، ويؤمنوا له فيخلصوا من العذاب، فهؤلاء الحمقى الهلكى، المنهمكون في الغيّ والضلال، ويفوِّتون على أنفسهم الإيمان به والهداية بامتثال ما فيه، حتى يستحقوا الخلاص والنجاة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الهمزة للإنكار، والفاء للعطف على محذوف، أي: أَفعلوا ما فعلوا من النكوص والاستكبار فلم يتدبروا القرآن، و \" أم \": منقطعة، فيها معنى الإضراب والتوبيخ في الجميع\n يقول الحق جل جلاله: { أَفَلَمْ يدّبروا القولَ } يتدبروا القرآن ليعرفوا، بما فيه من إعجاز النظم وصحة المدلول، والإخبار عن المغيبات الماضية والمستقبلة، أنه الحق، فيؤمنوا به، ويُذعنوا لمن جاء به، { أم جاءهم } بل أَجاءهم من الكتاب { ما لم يأتِ آباءهم الأولين } ، حتى استبعدوه واستبدعوه، فوقعوا فيما وقعوا فيه من الكفر والضلال، { أم لم يعرفوا رسولهم } أي: بل ألم يعرفوه - عليه الصلاة والسلام - بالأمانة والصدق، وحسن الأخلاق، وكمال العلم من غير تعلم ولا مدارسة، وغير ذلك مما حازه من الكمالات اللائقة بالأنبياء قبله، بل عرفوه بذلك { فهم له منكِرون } بغياً وحسداً",
      "translations": []
    }
  ]
}