{
  "chapter": "المؤمنون",
  "text": "ولا نكلف نفسا الا وسعها ولدينا كتب ينطق بالحق وهم لا يظلمون",
  "translations": [
    {
      "translation": "We do not impose on any self any more than it can stand. With Us there is a Book which speaks the truth. They will not be wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not burden a soul beyond capacity, for We have a record that tells the truth. No wrong will be done to any one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not lay a burden on anyone beyond his capacity. We have a Book with Us that speaks the truth (about everyone); and they shall in no wise be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not impose on any soul what is beyond its capacity. We have the Book which speaks the truth and no injustice will be done to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We do not burden any soul beyond its capacity, and with Us is a Book* that speaks the truth, and they will not be wronged. (* The preserved tablet or the record of one’s deeds.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We task not any person except according to his capacity, and with Us is a Record which speaks the truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We do not lay on any soul a burden except to the extent of its ability, and with Us is a book which speaks the truth, and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We charge not any soul save to its capacity, and with Us is a Book speaking truth, and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we task not any soul beyond its scope, and with Us is a Record which speaketh the truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We charge no soul with more than it can bear. We have a record which clearly shows the truth and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We task not any soul except according to its capacity, and with Us is a book speaking with truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We task no soul except according to its capacity, and with Us is a book that speaks the truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On no soul do We place a burden greater than it can bear: before Us is a record which clearly shows the truth: they will never be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We tax not any person except according to his capacity, and with Us is a Record which speaks the truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We charge no soul with more than it can bear. We have a Book with Us which speaks the truth, and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We never burden any soul beyond its capacity. And with Us is a record that tells the truth, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We charge no soul except [with that within] its capacity, and with Us is a record which speaks with truth; and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:62] And We do not task any soul beyond its capacity, what it can bear — thus he who is not able to pray standing, let him pray sitting down and he who is not able to fast, let him eat; and with Us is a Record that speaks the truth, regarding what it [a soul] has done — and this [Record] is the Preserved Tablet (al-lawh al-mahfūz), wherein deeds are written down; and they, namely, the souls in their acts, will not be wronged, in a single thing thereof, and so nothing is diminished of the reward for good deeds, nor is anything [extra] added to the evil deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And We task not any soul) with works (beyond its scope) beyond its capability, (and with Us is a Record) this is the Record of the recording angels (al-hafazah) who record people's good and bad works (which speaketh the Truth) they will testify truthfully and fairly, (and they will not be wronged) their good deeds will not be diminished and their bad works will not be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولا نُكلف نفساً إلاّ وُسعها } أي: لا نكلف كل أحد بمقامات السابقين فإنها مقامات لا يبلغها إلا الأفراد كما قيل: جلّ جناب الحق أن يكون شريعة لكل وارد\n أو يطلع عليه إلا واحد بعد واحد\n بل كل مكلف بما يقتضيه استعداده بهويته من كماله اللائق به\n وهو غاية وسعه\n { ولدينا كتاب } هو اللوح المحفوظ أو أمّ الكتاب { يَنْطق بمراتب استعداد كل نفس وحدود كمالاتها وغاياتها\n وما هو حق كل منها { وهم لا يظلمون } بمنعهم عنه وحرمانهم إذا جاهدوا فيه وسعوا في طلبه بالرياضة\n بل يعطى كل ما أمكنه الوصول إليه وما يشتاقه في السلوك إليه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها المكلفون بأنواع التكاليف المصفية لظواهركم وبواطنكم { لاَ نُكَلِّفُ } ولا نحتمِّل { نَفْساً إِلاَّ وُسْعَهَا } أي: مقدار وسعِها وطاقتِها على ما هو مقتضى استعداداتهم وقابليتهم\n وكيف نكلفهم بما لا طاقة لهم { وَلَدَيْنَا كِتَابٌ } جامعُ لجميع أحوال ما حدث وكان\n ويحدث ويكون\n وهو لوحُ قضائنا وحضرةُ علمنا مع أنه { يَنطِقُ بِٱلْحَقِّ } السويّّ الثابت المطابق للواقع بلا إفراط وتفريط { وَهُمْ لاَ يُظْلَمُونَ } [المؤمنون: 62] بزيادة العذاب ونقصان الثواب\n بل كل منهم مجزيُ بمقتضى ما ثبت فيه\n\nوالكفار من غاية انهماكهم في الغفلة والضلال ينكرون لكتابنا الجامع لجميع الكوائن والفواسد الناطق بالحق المطابق للواقع { بَلْ قُلُوبُهُمْ } التي جبلت وعاءً للإيمان والتصديق { فِي غَمْرَةٍ } أي: غطاءٍ وغشاوةٍ { مِّنْ هَـٰذَا } الطريق الذي يترتب عليه الفلاح والفوز بالنجاح",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقال تعالى: { ولا نُكلِف نفساً إلا وُسْعَها } أي: طاقتها\n فهو تحريض على تحصيل ما وُصف به السابقون من فعل الطاعات المؤدي إلى نيل الخيرات ببيان سهولته\n وأنه غير خارج عن حد الوسع والطاقة\n أي: عادتنا جارية بأنْ لا نكلف نفساً من النفوس إلا ما في طاقتها\n فإن لم يبلغوا في فعل الطاعة مراتب السابقين\n فلا عليهم\n بعد أن يبذلوا طاقتهم ويستفرغوا وسعهم\n { ولدينا كتابٌ } أي: صحائف الأعمال التي يرونها عند الحساب\n حسبما يُعرب عنه قوله: { ينطِق بالحق } \n كقوله:\n[الجاثية: 29] أي: عندنا كتاب أثبت فيه أعمال كل أحد على ما هو عليه\n أو أعمال السابقين والمقتصدين جميعاً\n وقوله: بالحق: يتعلق بينطق\n أي: يُظهر الحق المطابق للواقع على ما هو عليه\n أو يظهره للسامع\n فيظهر هناك جلائل أعمالهم ودقائقها\n ويرتب عليها أجزيتها\nإن خيراً فخير\n وإن شراً فشرٌ\n وقيل: المراد بالكتاب: اللوح المحفوظ\n وهو مناسب لتفسير ابن عباس بسبق السعادة\n وقوله: { وهم لا يظلمون } \n بيان لفضله تعالى وعدله في الجزاء\n إثر بيان لطفه في التكليف وكتب الأعمال\n أي: لا يظلمون في الجزاء بنقص الثواب أو بزيادة عذاب\n بل يُجزون بقدر أعمالهم التي كُلّفوها\n ونطقت بها صحائف أعمالهم\n أو: لا يُظلمون بتكليف ما لا وسع فيه\n أو: لا ينقصون مما سبق لهم في اللوح المحفوظ شيئاً\n والله تعالى أعلم\n الإشارة: ذكر في هذه الآية أربعة أوصاف من أوصاف المقربين\n أولها: الخوف والإشفاق من الطرد والإبعاد\n والثاني: الإيمان الذي لا يبقى معه شك ولا وَهْم\n بما تضمنته الآيات التنزيلية من الوعد والإيعاد\n والثالث: التوحيد الذي لا يبقى معه شرك جلي ولا خفي\n والرابع: السخاء والكرم\n مع رؤية التقصير فيما يعطي\n فمن جمع هذه الخصال كان من السابقين في الخيرات ويُسارع لهم في تعجيل الخيرات\n وكل ذلك بقدر ما يطيق العبد\n مع بذل المجهود في فعل الخيرات\n قال في الحاشية: والمسارعة إلى الخيرات إنما هو بقطع الشرور وأول الشرور: حب الدنيا لأنها مزرعة الشيطان\n فمن طلبها وعمرها فهو حراثه وعبده\n وشر من الشيطان من يُعين الشيطان على عمارة داره\n وما ذلك إلا أنه لم يهتم بأمر معاده ومنقلبه\n لما جرى عليه في السابقة من الحكم\n ولا كذلك من وصفه في الإشفاق من المؤمنين إجلالاً لربهم\n ورجوعاً لحكمه فيهم غيباً\n فلا يأمنون مكره بحال\n ولا يركنون إلى أعمال\n بل عمدتهم ربهم ورحمته في كل حال\n والله أعلم\n والحاصل: أنهم مع كونهم يخشون ربهم ويؤمنون بآياته\n ولا يشركون به شيئاً\n ويودون طاعته\n يخافون عدم قبوله لهم عند الرجوع إليه\n ولقائهم له لأنه يفعل ما يشاء\n ويحكم ما يريد\n وأحكامه لا تعلل\n ومن استغرق فيه لم يقف مع وعده\n\nهـ\n قوله: \" ومن استغرق فيه لم يقف مع وعده \" \n أي: لأنه قد يرتب ذلك على شروط أخفاها عنه\n ليدوم خوفه واضطراره\n ولذلك كان العارف لا يزول اضطراره\n وليس خوف العارف من السابقة ولا من الخاتمة لأنه شغله استغراقه في الحق والغيبة فيه عن الشعور بالسابقة واللاحقة\n إنما خوفه من الإبعاد بعد التقريب\n أو الافتراق بعد الجمع\n وهذا أيضاً قبل التمكين\n وإلا فالكريم إذا أعطى لا يرجع\n والله تعالى أعلم\n ثمَّ ذكر من اتصف بضد الأوصاف المتقدمة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:42",
      "similarity": 0.6350631947203147
    },
    {
      "verse": "38:86",
      "similarity": 0.5425183720764097
    },
    {
      "verse": "65:7",
      "similarity": 0.5122375442242998
    },
    {
      "verse": "37:92",
      "similarity": 0.44881802333960047
    },
    {
      "verse": "51:23",
      "similarity": 0.4455051417787689
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/023062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/023062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}