{
  "chapter": "المؤمنون",
  "text": "مستكبرين به سمرا تهجرون",
  "translations": [
    {
      "translation": "Insolently, treating them like tales told at night.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "behaving arrogantly, and making fun, and talking nonsense (about the Book in your nightly chats).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and arrogantly mocked and reviled them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Priding yourself in serving the Sacred Mosque; at night you utter indecent stories in it, while discarding the truth.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In pride, talking evil about it by night.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In arrogance; talking nonsense about the Quran, and left him like one telling fables by night.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "waxing proud against it, talking foolish talk by night.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In scorn thereof. Nightly did ye rave together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in arrogance, as if you were abandoning a story-teller.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stiff-necked, discoursing thereof by night, reviling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "being disdainful of it, talking nonsense in your nightly sessions.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In arrogance: talking nonsense about the (Qur'an), like one telling fables by night.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In pride (they Quraish pagans and polytheists of Makkah used to feel proud that they are the dwellers of Makkah sanctuary Haram), talking evil about it (the Quran) by night.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "being proud against it, talking foolishness by night.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Arrogant towards it—talked nonsense about it—disregarded it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In arrogance regarding it, conversing by night, speaking evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:67] disdainful, of [embracing] faith, because of it, that is, because of the [Sacred] House or the [Meccan] Sanctuary and their being inhabitants thereof, secure, in contrast to [the situation with] all [other] peoples in their hometowns, while in [your] night sessions (sāmiran is a circumstantial qualifier,) in other words, they come together to converse at night around the [Sacred] House, you talked nonsense’ ([if read as] tahjurūna, the third form [from hajara] means [while] ‘you disregarded’ the Qur’ān; [but if read] as the fourth form [tuhjirūna, from ahjara] it means [while] ‘you speak falsehood’ about the Prophet and the Qur’ān).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(In scorn thereof) feeling haughty because of the Holy House, claiming that you are its guardians. (Nightly did you rave together) you cursed Muhammad (pbuh) his Companions and the Qur'an in your nightly gatherings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَامِراً تَهْجُرُونَ } يقال إن قُريشاً كَانتْ تَسمرُ بالليلِ عندَ البَيتِ ولاَ تَطوف بهِ، تَفتخرُ بهِ\n وتُهجِّرون: معناه تَقولون الهُجرَ للنبي صلى الله عليه وعلى آلهِ وسلم\n وهو القَولُ بالقَبيحِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nحال كونكم { مُسْتَكْبِرِينَ بِهِ } أي: بالكتاب والآيات المندرجة فيه إلى حيث لا تذكرونه { سَامِراً } أيضاً؛ أي: حاكياً به في الليل على ما هو عادتكم وسنتُكم المستمرة بينكم؛ إذ كنتم تسمرون حول البيت في خلال الليل، سيما بالأحاديث الحديثة الجديدة بل { تَهْجُرُونَ } [المؤمنون: 67] وتتركون السمرَ به مطلقاًن حتى لا تسمعوا ذكر الآيات والكتاب أصلاً، فكيف ما فيه من الأوامر والنواهي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والمعنى: أنهم يستكبرون بسبب المسجد الحرام لأنهم أهله وأهل ولايته، وكانوا يقولون: لا يظهر علينا أحد لأنا أهل الحرم، وقيل: تتعلق بالباء بقوله: { سامراً } أي: تسمرون بذكر القرآن والطعن فيه، وكانوا يجتمعون حول البيت يسمرون، وكان عامة سمرهم ذكر القرآن والطعن فيه، وفي النبي صلى الله عليه وسلم الذي جاء به، و \" سامراً \": مفرد بمعنى الجمع، وقرئ سُمَّاراً، { تهجرون } ، إما من الهَجر بالفتح، بمعنى الهذيان، أي: تهذون في شأن القرآن كما يهذو الحالم أو السكران\n\n\nأو من الترك، أي: تتركونه وتفرون منه، أو تهجرون النبي صلى الله عليه وسلم والمؤمنين، أو من \" الهجر \" بالضم، وهو الفحش، ويؤيده قراءة من قرأ: \" تُهجِرون \" ، من أهجر في منطقة: إذا أفحش\n والله تعالى أعلم\n الإشارة: من كان قلبه في غمرة حظوظه وهواه، عاكفاً على جمع دنياه، لا يطمع في دخول حضرة مولاه، ولو صلى وصام ألف سنة\n قال القشيري: لا يَصلُحُ لهذا الشأنِ إلا من كان فارغاً من الأعمال كلها، لا شغلَ له في شأن الدنيا والآخرة، فأمَّا من شُغل بدنياه، وعلى قلبه حديثٌ من عقباه، فليس له نصيبٌ من حديث مولاه\n هـ\n وفي الحديث:\n\n \" نِعْمَتَانِ مَغْبُونٌ فِيهمَا كَثِيرٌ مِنَ الناس: الِّصحَّةُ والفَرَاغُ \"\n \n\nثمَّ أمر بالتدبر والنظر لعلة يقع التيقظ\n\n",
      "translations": []
    }
  ]
}