{
  "chapter": "المؤمنون",
  "text": "والذين يؤتون ما ءاتوا۟ وقلوبهم وجلة انهم الى ربهم رجعون",
  "translations": [
    {
      "translation": "those who give what they have given, their hearts fearful of their return to their Lord,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who give whatsoever they give (in His way), and their hearts tremble with fear that they have to go back to their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who give, whatever they give in charity, with their hearts trembling at the thought that they are destined to return to their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who spend their property for the cause of God, and whose hearts are afraid of their return\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who give what they give and their hearts fear for they have to return to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who give that which they give with their hearts full of fear, because they are sure to return to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who give what they give (in alms) while their hearts are full of fear that to their Lord they must return,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those who give what they give, their hearts quaking that they are returning to their Lord --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who give that which they give with hearts afraid because they are about to return unto their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those who give to others what has been bestowed upon them with their hearts trembling at the thought that they must return to their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who give whatsoever they give, while their hearts are anxious that unto their Lord they are to be retutners\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who give whatever they give while their hearts tremble with awe that they are going to return to their Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who dispense their charity with their hearts full of fear, because they will return to their Lord;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who give that (their charity) which they give (and also do other good deeds) with their hearts full of fear (whether their alms and charities, etc., have been accepted or not), because they are sure to return to their Lord (for reckoning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who give what they give, with their hearts quaking, that they will return to their Lord:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who give what they give, while their hearts quake, knowing that to their Lord they will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they who give what they give while their hearts are fearful because they will be returning to their Lord -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:60] and who give what they give, of voluntary alms and righteous deeds, while their hearts tremble [with awe], fearful lest it not be accepted from them, because (the particle lām, ‘for’, is taken as implied before annahum, ‘that they’) they are going to return to their Lord —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who give that which they give) of their wealth for alms and spend of it in the way of Allah; and it is said that this means: those who do what they do of righteous deeds (with hearts afraid because they are about to return unto their Lord) in the Hereafter, fearing that perhaps their works will not be accepted,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ يُؤْتُونَ مَآ آتَواْ } من الأعمال والصدقات ومطلق الحسنات { وَّقُلُوبُهُمْ } في حال إتيانها { وَجِلَةٌ } خائفةُ مستوحشةُ بسبب { أَنَّهُمْ إِلَىٰ رَبِّهِمْ رَاجِعُونَ } [المؤمنون: 60] بهذه الأعمال والحسنات، هل يقبل منهم أو يرد عليهم، وهم دائاً بين الخوف والرجاء خائفون عن قهره، راجون من لطفه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:52",
      "similarity": 0.8949092886957541
    },
    {
      "verse": "8:2",
      "similarity": 0.8466439896270336
    },
    {
      "verse": "22:35",
      "similarity": 0.8285377502330449
    },
    {
      "verse": "15:53",
      "similarity": 0.7798334386055705
    },
    {
      "verse": "2:46",
      "similarity": 0.11117055769140245
    }
  ]
}