{
  "chapter": "المؤمنون",
  "text": "بل قلوبهم فى غمرة من هذا ولهم اعمل من دون ذلك هم لها عملون",
  "translations": [
    {
      "translation": "However, their hearts are overwhelmed by ignorance about this matter and they do other things as well.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet their hearts are oblivious of this; and besides, they are busy with other things,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, their hearts are lost in ignorance of all this; and their deeds too vary from the way (mentioned above). They will persist in these deeds\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, the hearts of the unbelievers are in the dark because of their ignorance of real virtue; they act against it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the contrary, their hearts are in neglect of this and their works are different than those of the believers, the works that they are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but their hearts are covered from this, and they have other deeds, besides which they are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, their hearts are in overwhelming ignorance with respect to it and they have besides this other deeds which they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but their hearts are in perplexity as to this, and they have deeds besides that that they are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but their hearts are in ignorance of this (Qur'an), and they have other works, besides, which they are doing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their hearts are heedless of this. Moreover, there are other deeds besides this which they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! their hearts are in bewilderment in respect thereof, and they have works beside that, of which they are workers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, their hearts are in a stupor in regard to this, and there are other deeds besides which they perpetrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their hearts are in confused ignorance of this; and there are, besides that, deeds of theirs, which they will (continue) to do,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but their hearts are covered (blind) from understanding this (the Quran), and they have other (evil) deeds, besides, which they are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their hearts are in ignorance of this (Koran); and they have deeds besides that which they are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their hearts are puzzled because of this; and they have deeds that do not conform to this, which they continue to perpetrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But their hearts are covered with confusion over this, and they have [evil] deeds besides disbelief which they are doing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:63] Nay, but their hearts, that is, [the hearts of] the disbelievers, are in ignorance of this, Qur’ān, and they have other deeds which they will perpetrate besides, the ones mentioned, against the believers, and they will therefore be chastised for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but their hearts) the hearts of the people of Mecca: i.e. Abu Jahl and his host (are in ignorance) and heedlessness (of this) Qur'an, (and they have other works) decreed upon them, (besides) besides that which you enjoin them of good works, (which they are doing) in the life of this world until their appointed time comes, Muhammad;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { بل } قلوب المحجوبين { في غمرة } غشاوات الهيولى وغفلة غامرة { من هذا } السبق وطلب الحق { ولهم أعمال } على خلاف ذلك موجبة للبعد عن هذا الباب تكاثف الحجاب\n أي: كما أن أعمال السابقين موجبة للترقي في التنوّر كشف الغطاء والوصول إلى الحق\n فأعمالهم موجبة للتسفل والتكدّر وغلظ الحجاب والطرد عن باب الحق لكونها في طلب الدنيا وشهواتها وهوى النفس ولذاتها\n { هم لها عاملون } دائبون عليها مواظبون\n وكلما سمعوا ذكر الآيات والكمالات ازدادوا عتوّاً وانهماكاً في الغيّ\n واستكباراً وتعمقاً في الباطل\n وهو النكوص على الأعقاب إلى مهاوي جحيم الطبيعة\n ولما أبطلوا استعداداتهم وأطفؤوا أنوارها بالرين والطبع على مقتضى قوى النفس والطبع واشتدّ احتجابهم بالغواشي الهيولانية والهيئات الظلمانية عن نور الهدى والعقل\n لم يمكنهم تدبر القول ولم يفهموا حقائق التوحيد والعدل\n فنسبوه إلى الجنة ولم يعرفوه للتقابل بين النور والظلمة والتضادّ بين الباطل والحق وأنكروه وكرهوا الحق الذي جاء به\n { ولو اتّبع الحق } الذي هو التوحيد والعدل\n أيّ الدعوة إلى الذات والصفات { أهواءهم } المتفرّقة في الباطل\n الناشئة من النفوس الظالمة\n المظلمة\n المحتجبة بالكثرة عن الوحدة لصار باطلاً لانعدام العدل الذي قامت به السموات والأرض والتوحيد الذي قامت به الذوات المجرّدة\n إذ بالوحدة بقاء حقائق الأشياء\n وبظلها الذي هو العدل ونظام الكثرات قوام الأرض والسماء فلزم فساد الكل\n الصراط المستقيم الذي يدعوهم إليه هو طريق التوحيد المستلزم لحصول العدالة في النفس ووجود المحبة في القلب وشهود الوحدة في الروح\n والذين يحتجبون عن عالم النور بالظلمات وعن العقل بالحس وعن القدس بالرجس إنما هم منهمكون في الظلم والبغضاء والعداوة والركون إلى الكثرة\n فلا جرم أنهم عن الصراط ناكبون منحرفون إلى ضدّه\n فهو في واد وهم في واد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهو طريق التوحيد والتصديق { وَلَهُمْ أَعْمَالٌ } طالحةُ على مقتضى أهويتهم الفاسدة وآرائهم الباطلة { مِّن دُونِ ذٰلِكَ } الأمر الذي تعبدنا بها عبادنا على ألسنة رسلنا { هُمْ لَهَا عَامِلُونَ } [المؤمنون: 63] وإليها متوجهون دائماً\n وعن طريق الحق وسبيل التوحيد ناكبون منصرفون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" بل \" إضراب عما قبله من أوصاف المؤمنين\n وانتقال إلى أضدادهم من الكافرين\n والضمير للكفرة\n و \" حتى \": ابتدائية مختصة بالدخول على الجُمل\n يقول الحق جل جلاله: { بل قلوبُهم } أي: الكفرة المستدرج بهم\n وهم لا يشعرون\n { في غَمْرَةٍ } في غفلة غامرة لها\n مما عليه هؤلاء الموصوفون بما تقدم من الخشية وما بعده\n أو مما بيَّن في القرآن من أن لديه كتاباً ينطق بالحق\n ويُظهر لهم أعمالهم السيئة على رؤوس الأشهاد\n فيُفضحون بها\n كما ينبئ عنه ما بعده من قوله { قد كانت آياتي تتلى عليكم\n\n }\n { ولهم أعمال من دون ذلك } أي: ولهم أعمال خبيثة كثيرة\n متجاوزة لذلك الذي وصف به المؤمنون\n من الأعمال الصالحات\n وهي فنون كفرهم ومعاصيهم\n { هم لها عاملون } \n وعليها مقيمون\n مستمرون عليها\n حتى يأخذهم الله بالعذاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:54",
      "similarity": 0.8472320307189132
    },
    {
      "verse": "6:93",
      "similarity": 0.6548986007876507
    },
    {
      "verse": "51:11",
      "similarity": 0.4861890640793375
    },
    {
      "verse": "31:11",
      "similarity": 0.10937395558974132
    },
    {
      "verse": "40:74",
      "similarity": 0.10431054679700083
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/023063.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/023063.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}