{
  "chapter": "المؤمنون",
  "text": "افلم يدبروا۟ القول ام جاءهم ما لم يات ءاباءهم الاولين",
  "translations": [
    {
      "translation": "Do they not ponder these words? Has anything come to them that did not come to their ancestors the previous peoples?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not think over the message? Or has something come to them which had not come to their fathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they never ponder over this Word (of God)? Or has he (to wit, the Messenger) brought something the like of which did not come to their forefathers of yore?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Was it that you did not give any thought to it (the Quran)? Was it different from what was revealed to your fathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered the matter, or did that come to them, which did not come to their forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered over the Word, or has there come to them what had not come to their fathers of old\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it then that they do not ponder over what is said, or is it that there has come to them that which did not come to their fathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered the saying, or came there upon them that which came not upon their fathers, the ancients?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered the Word, or hath that come unto them which came not unto their fathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered over the word of God? Has something come to them that did not come to their forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pondered they not over the Word? or came there unto them that which came not unto their fathers ancient?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not contemplated the Discourse, or has anything come to them [in it] that did not come to their forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not ponder over the Word (of Allah), or has anything (new) come to them that did not come to their fathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered over the Word (of Allah, i.e. what is sent down to the Prophet SAW), or has there come to them what had not come to their fathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they not think upon the saying? Or, did anything come upon them that had not come upon their ancient forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered the Word? Or has there come to them what came not to their forefathers of old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then have they not reflected over the Qur'an, or has there come to them that which had not come to their forefathers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:68] God, exalted be He, says: Have they not contemplated (yaddabbarū should actually be yatadabbarū, but the tā’ has been assimilated with the dāl) the discourse, namely, the Qur’ān that is proof of the Prophet’s sincerity, or has there come upon them that which has not come upon their forefathers?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَفَلَمْ يَدَّبَّرُوا الْقَوْلَ أَمْ جَاءَهُمْ مَا لَمْ يَأْتِ آَبَاءَهُمُ الْأَوَّلِينَ (68) الفاء لتفريع الكلام على الكلام السابق وهو قوله { بل قلوبهم في غمرة من هذا } إلى قوله { سامراً تهجرون } \\[ المؤمنون : 63 67 \\] . وهذا التفريع معترض بين جملة { بل قلوبهم في غمرة من هذا } وجملة { ولو رحمناهم وكشفنا ما بهم من ضر للجوا في طغيانهم يعمهون } \\[ المؤمنون : 75 \\] .والمفرع استفهامات عن سبب إعراضهم واستمرار قلوبهم في غمرة إلى أن يحل بهم العذاب الموعودونه .وهذه الاستفهامات مستعملة في التخطئة على طريقة المجاز المرسل لأن اتضاح الخطأ يستلزم الشك في صدوره عن العقلاء فيقتضي ذلك الشك السؤال عن وقوعه من العقلاء .ومآل معاني هذه الاستفهامات أنها إحصاء لمثار ضلالهم وخطئهم ولذلك خصت بذكر أمور من هذا القبيل . وكذلك احتجاج عليهم وقطع لمعذرتهم وإيقاظ لهم بأن صفات الرسول كلها دالة على صدقه .فالاستفهام الأول : عن عدم تدبرهم فيما يتلى عليهم من القرآن وهو المقصود بالقول أي الكلام ، قال تعالى : { أفلا يتدبرون القرآن } \\[ النساء : 82 \\] . والتدبر : إعمال النظر العقلي في دلالات الدلائل على ما نصبت له . وأصله أنه من النظر في دُبُر الأمر ، أي فيما لا يظهر منه للمتأمل بادىء ذي بدء . وقد تقدم عند قوله تعالى : { أفلا يتدبرون القرآن ولو كان من عند غير الله لوَجدوا فيه اختلافاً كثيراً } في سورة النساء ( 82 ) .والمعنى : أنهم لو تدبروا قول القرآن لعلموا أنه الحق بدلالة إعجازه وبصحة أغراضه ، فما كان استمرار عنادهم إلا لأنهم لم يدبروا القول . وهذا أحد العلل التي غمرت بهم في الكفر .\n\n",
      "translations": [
        {
          "translation": "(Have they not pondered the Word) have they not reflected upon the Qur'an and that which it contains of threats, (or hath that come unto them) upon the people of Mecca, of safety and freedom from obligation (which came not unto their fathers of old?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويستكبرون به عناداً ومكابرة { فَلَمْ يَدَّبَّرُواْ } ولم يتأملوا حق التأمل { ٱلْقَوْلَ } أي: المقولَ والمسموعَ\n ليظهر لهم إعجازه\n ويتضح عندهم فصاحته وبلاغته الخارجة عن طور العقل وطوق البشر كي لا يبادروا إلى إنكاره وتكذيبه\n بل يصدقوه ويؤمنوا له وبمن جاء به\n\n\n{ أَمْ جَآءَهُمْ } أي: بل يعلمون لو تأملوا أنه جاءهم من الله كتابُ يخصلهم من العذاب الأخروي لو امتثلوا بما فيه مع أنه { مَّا لَمْ يَأْتِ } أي: كتابهم هذا شيءُ لم يأت مثله { آبَآءَهُمُ ٱلأَوَّلِينَ } [المؤمنون: 68] حتى يتأملوا فيه\n ويؤمنوا له فيخلصوا من العذاب\n فهؤلاء الحمقى الهلكى\n المنهمكون في الغيّ والضلال\n ويفوِّتون على أنفسهم الإيمان به والهداية بامتثال ما فيه\n حتى يستحقوا الخلاص والنجاة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الهمزة للإنكار\n والفاء للعطف على محذوف\n أي: أَفعلوا ما فعلوا من النكوص والاستكبار فلم يتدبروا القرآن\n و \" أم \": منقطعة\n فيها معنى الإضراب والتوبيخ في الجميع\n يقول الحق جل جلاله: { أَفَلَمْ يدّبروا القولَ } يتدبروا القرآن ليعرفوا\n بما فيه من إعجاز النظم وصحة المدلول\n والإخبار عن المغيبات الماضية والمستقبلة\n أنه الحق\n فيؤمنوا به\n ويُذعنوا لمن جاء به\n { أم جاءهم } بل أَجاءهم من الكتاب { ما لم يأتِ آباءهم الأولين } \n حتى استبعدوه واستبدعوه\n فوقعوا فيما وقعوا فيه من الكفر والضلال",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:5",
      "similarity": 0.5223763955579122
    },
    {
      "verse": "37:90",
      "similarity": 0.5020905439402457
    },
    {
      "verse": "37:17",
      "similarity": 0.49380820410445114
    },
    {
      "verse": "56:48",
      "similarity": 0.49380820410445114
    },
    {
      "verse": "74:23",
      "similarity": 0.4801790555218103
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/023068.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/023068.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:68.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}