{
  "chapter": "المؤمنون",
  "text": "قد كانت ءايتى تتلى عليكم فكنتم على اعقبكم تنكصون",
  "translations": [
    {
      "translation": "My Signs were recited to you and you turned round on your heels,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For when My revelations were read out to you, you turned back on your heels and fled\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Signs were rehearsed to you and you turned back on your heels and took to flight,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our revelations had certainly been recited to you, but you turned your backs to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“My verses were recited to you, so you used to turn back on your heels.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed My Ayat used to be recited to you, but you used to turn back on your heels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My communications were indeed recited to you, but you used to turn back on your heels,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My signs were recited to you, but upon your heels you withdrew,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My revelations were recited unto you, but ye used to turn back on your heels,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My revelations were recited to you, but you turned your backs\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely My signs have been rehearsed unto you, and upon your heel ye were wont to draw back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly My signs used to be recited to you, but you used to take to your heels,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Signs used to be rehearsed to you, but ye used to turn back on your heels-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed My Verses used to be recited to you, but you used to turn back on your heels (denying them, and with hatred to listen to them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My verses were recited to you, but you turned upon your heels,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Verses were recited to you, but you turned back on your heels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My verses had already been recited to you, but you were turning back on your heels\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:66] Verily My signs, in the Qur’ān, used to be recited to you, but you used to take to your heels, falling back in retreat,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَدْ كَانَتْ آَيَاتِي تُتْلَى عَلَيْكُمْ فَكُنْتُمْ عَلَى أَعْقَابِكُمْ تَنْكِصُونَ (66) ويجوز أن يكون المراد بالمترفين جميع المشركين فتكون الإضافة بيانية ويكون ذكر المترفين تهويلاً في التهديد تذكيراً لهم بأن العذاب يزيل عنهم ترفهم؛ فقد كان أهل مكة في ترف ودعة إذ كانوا سالمين من غارات الأقوام لأنهم أهل الحرم الآمن وكانوا تُجْبَى إليهم ثمرات كل شيء وكانوا مكرَّمين لدى جميع القبائل ، قال الأخطل :فأما الناس ما حاشا قريشاً ... فإنا نحن أفضلهم فعالاوكانت أرزاقهم تأتيهم من كل مكان قال تعالى :{ الذي أطعمهم من جوع وآمنهم من خوف } \\[ قريش : 4 \\] ، فيكون المعنى : حتى إذا أخذناهم وهم في ترفهم ، كقوله : { وذرني والمكَذِّبين أولي النعمة ومَهِّلْهم قليلاً } \\[ المزمل : 11 \\] .ويجوز أن يكون المراد حلول العذاب بالمترفين خاصة ، أي بسادتهم وصناديدهم وهو عذاب السيف يوم بدر فإنه قتل يومئذ كبراء قريش وهم أصحاب القليب . قال شداد ابن الأسود :وماذا بالقليب قليب بدر ... من الشيزى تزيَّن بالسناموماذا بالقليب قليب بدر ... من القينات والشَّرب الكرام يعني ما ضمنه القليب من رجال كانت سجاياهم الإطعام والطرب واللذات .وضمير { إذا هم يجأرون } على هذا الوجه عائد إلى غير المترفين لأن المترفين قد هلكوا فالبقية يجأرون من التلهف على ما أصاب قومهم والإشفاق أن يستمر القتل في سائرهم فهم يجأرون كلما صرع واحد من سادتهم ولأن أهل مكة عجبوا من تلك المصيبة ورَثَوا أمواتهم بالمراثي والنياحات .ثم الظاهر أن المراد من هذا العذاب عذاب يحل بهم في المستقبل بعد نزول هذه الآية التي هي مكية فيتعين أن هذا عذاب مسبوق بعذاب حل بهم قبله كما يقتضيه قوله تعالى بعد { ولقد أخذناهم بالعذاب } \\[ المؤمنون : 76 \\] الآية . ولذا فالعذاب المذكور هنا عذاب هُددوا به ، وهو إما عذاب الجوع الثاني الذي أصاب أهل مكة بدعوة النبي صلى الله عليه وسلم بعد هجرته . ذلك أنه لما أسلم ثمامة بن أُثال الحنفي عقب سرية خالد بن الوليد إلى بني كلب التي أخذ فيها ثمامة أسيراً وأسلم فمنع صدور الميرة من أرض قومه باليمامة إلى أهل مكة وكانت اليمامة مصدر أقواتهم حتى سميت ريف أهل مكة فأصابهم جوع حتى أكلوا العِلهِز والجيف سبع سنين ، وإما عذاب السيف الذي حل بهم يوم بدر .\n\n",
      "translations": [
        {
          "translation": "(My revelations) the Qur'an (were recited) and shown (unto you, but ye used to turn back on your heels) to your initial religion,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَكُنتُمْ عَلَىٰ أَعْقَابِكُمْ تَنكِصُونَ } معناه تَرجَعُون على أعقابِكم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {So you were on the brink of a pit of the Fire, and He saved you from it} - meaning, you were about to return to your own destruction.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { قَدْ كَانَتْ آيَاتِي } الدالةُ على عظمة ذاتي وعلوٍّ شأني وشدةِ سلطنتي وسطوتي { تُتْلَىٰ عَلَيْكُمْ } تلييناً لقلوبكم وإصلاحاً لعيوبكم { فَكُنتُمْ } من شدة عتوكم واستكباركم { عَلَىٰ أَعْقَابِكُمْ تَنكِصُونَ } [المؤمنون: 66] وترجعون رجوع القهقرى\n منصرفين عن سماعها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فكنتم على أعقابكم تَنكصُونَ } أي: ترجعون القهقرى\n وتعرضون عن سماعها أشد الإعراض فضلاً عن تصديقها والعمل بها والنكوص: الرجوع القهقرى وهي أقبح المشية لأنه لا يرى ما وراءه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:48",
      "similarity": 0.7275646042458077
    },
    {
      "verse": "23:105",
      "similarity": 0.07181835031391046
    },
    {
      "verse": "2:252",
      "similarity": 0.06728728417241446
    },
    {
      "verse": "3:164",
      "similarity": 0.06720459814010037
    },
    {
      "verse": "3:58",
      "similarity": 0.0671245760282452
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/023066.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/023066.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:66.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}