{
  "chapter": "المؤمنون",
  "text": "ام لم يعرفوا۟ رسولهم فهم له منكرون",
  "translations": [
    {
      "translation": "Or is it that they do not recognise their Messenger and therefore do not acknowledge him?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did they not recognise their apostle, and rejected him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that they were unaware of their Messenger and were therefore repelled by him for he was a stranger to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did you not recognize your Messenger and, thus, denied him (Muhammad)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that they did not recognise their Noble Messenger, therefore they consider him alien?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that they did not recognize their Messenger so they deny him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that they have not recognized their Apostle, so that they deny him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did they not recognise their Messenger and so denied him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or know they not their messenger, and so reject him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they not recognize their Messenger, and so deny him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, is it that they recognised not their apostle, and so of him they become deniers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it that they do not recognize their apostle, and so they deny him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they not recognise their Messenger, that they deny him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that they did not recognize their Messenger (Muhammad SAW) so they deny him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, is it because they do not recognize their Messenger that they denied him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that they did not recognize their messenger, so they are denying him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did they not know their Messenger, so they are toward him disacknowledging?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:69] Or is it that they do not recognise their [own] Messenger and so they reject him?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمْ لَمْ يَعْرِفُوا رَسُولَهُمْ فَهُمْ لَهُ مُنْكِرُونَ (69) والاستفهام الثاني : هو المقدر بعد ( أم ) وقوله : { أم لم يعرفوا رسولهم } . ف ( أم ) حرف إضراب انتقالي من استفهام إلى غيره وهي ( أم ) المنقطعة بمعنى ( بل ) ويلزمها تقدير استفهام بعدها لا محالة . فقوله { جاءهم ما لم يأت آباءهم } تقديره : بل أجاءهم . والمجيء مجاز في الإخبار والتبليغ ، وكذلك الإتيان .و ( ما ) الموصولة صادقة على دين . والمعنى : أجاءهم دين لم يأت آباءهم الأولين وهو الدين الداعي إلى توحيد الإله وإثبات البعث ، ولذلك كانوا يقولون : { إنا وجدنا آباءنا على أمة وإنا على آثارهم مهتدون } \\[ الزخرف : 22 \\] . ولهذا قال الله تعالى { وكذلك ما أرسلنا من قبلك في قرية من نذير إلا قال مترفوها إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون قل أو لو جئتكم بأهدى مما وجدتم عليه آباءكم قالوا إنا بما أرسلتم به كافرون } \\[ الزخرف : 23 ، 24 \\] .ثم إنه إن كان المراد ظاهر معنى الصلة وهي { ما لم يأت آباءهم الأولين } من أن الدين الذي جاءهم لا عهد لهم به ، تعين أن يكون في الكلام تهكم بهم إذ قد أنكروا ديناً جاءهم ولم يسبق مجيئه لآباءهم . ووجه التهكُّم أن شأن كل رسول جاء بدين أن يكون دينه أُنُفا ولو كان للقوم مثله لكان مجيئه تحصيل حاصل .وإن كان المراد من الصلة أنه مخالف لما كان عليه آباؤهم لأن ذلك من معنى : لم يأت آباءهم ، كان الكلام مجرد تغليط ، أي لا اتجاه لكفرهم به لأنه مخالف لما كان عليه آباؤهم إذ لا يكون الدين إلا مخالفاً للضلالة ويكون في معنى قوله تعالى : { أم آتيناهم كتاباً من قبله فهم به مستمسكون بل قالوا إنا وجدنا آباءنا على أمة وإنا على آثارهم مهتدون } \\[ الزخرف : 21 ، 22 \\] . وأما الاستفهام الثالث : المقدر بعد ( أم ) الثانية في قوله : { أم لم يعرفوا رسولهم } فهو استفهام عن عدم معرفتهم الرسول بناء على أن عدم المعرفة به هو أحد احتمالين في شأنهم إذ لا يخلون عن أحدهما ، فأما كونهم يعرفونه فهو المظنون بهم فكان الأجدر بالاستفهام هو عدم معرفتهم به إذ تفرض كما يفرض الشيء المرجوح لأنه محل الاستغراب المستلزم للتغليط؛ فإن رميهم الرسول بالكذب وبالسحر والشعر يناسب أن لا يكونوا يعرفونه من قبل ، إذ العارف بالمرء لا يصفه بما هو منه بريء ، ولذلك تفرع على عدم معرفتهم إنكارهم إياه ، أي إنكارهم صفاته الكاملة .فتعليق ضمير ذاتتِ الرسول ب { منكرون } هو من باب إسناد الحكم إلى الذات والمراد صفاتها مثل { حرمت عليكم أمهاتكم } \\[ النساء : 23 \\] . وهذه الصفات هي الصدق والنزاهة عن السحر وأنه ليس في عداد الشعراء .ولله در أبي طالب في قوله: ... لقد علموا أن ابننا لا مكذَّبٌلدينا ولا يعزى لقول الأباطل ... وقال تعالى فيما أمر به رسوله { فقد لبثتُ فيكم عُمُرا من قبله ( أي القرآن ) { أفلا تعقلون } \\[ يونس : 16 \\] .ولما كان البشر قد يعرض له ما يسلب خصاله وهو اختلال عقله عطف على { أم لم يعرفوا رسولهم } قوله { أم يقولون به جنة } ، وهو الاستفهام الرابع ، أي ألعلهم ادعوا أن رسولهم الذي يعرفونه قد أصيب بجنون فانقلب صدقه كذباً .والجِنّة : الجنون ، وهو الخلل العقلي الذي يصيب الإنسان ، كانوا يعتقدون أنه من مس الجن .والجِنّة يطلق على الجنِّ وهو المخلوقات المستترة عن أبصارنا كما في قوله : { من الجِنّة والناس } \\[ الناس : 6 \\] . ويطلق الجِنة على الداء اللاحق من إصابة الجن وصاحبه مجنون ، وهو المراد هنا بدليل باء الملابسة . وتقدم عند قوله تعالى { أولم يتفكروا ما بصاحبهم من جنة } في سورة الأعراف ( 184 ) . وهم لم يظنوا به الجنون ولكنهم كانوا يقولونه بألسنتهم بهتاناً . وليس القول بألسنتهم هو مصب الاستفهام . ثم قد نُقض ما تسبب على ما اختلقوه فجيء بحرف الإضراب في الخبر في معنى الاستدراك وهو ( بل ) .والحق : الثابت في الواقع ونفس الأمر ، يكون في الذوات وأوصافها . وفي الأجناس ، وفي المعاني ، وفي الأخبار . فهو ضد الكذب وضد السحر وضد الشعر ، فما جاءهم به النبي صلى الله عليه وسلم من الأخبار والأوامر والنواهي كله ملابس للحق ، فبطل بهذا ما قالوه في القرآن وفي الرسول عليه الصلاة والسلام مقالة من لم يتدبروا القرآن ومن لم يراعوا إلا موافقة ما كان عليه آباؤهم الأولون ومن لم يعرفوا حال رسولهم الذي هو من أنفسهم ومقالة من يرمي بالبهتان فنسبوا الصادق إلى التلبيس والتغليط .فالحق الذي جاءهم به النبي أوله إثبات الوحدانية لله تعالى وإثبات البعث وما يتبع ذلك من الشرائع النازلة بمكة ، كالأمر بالصلاة والزكاة وصلة الرحم ، والاعتراف للفاضل بفضله . وزجر الخبيث عن خبثه ، وأخوة المسلمين ، بعضهم لبعض ، والمساواة بينهم في الحق . ومنع الفواحش من الزنى وقتل الأنفس ووأْد البنات والاعتداء وأكل الأموال بالباطل وإهانة اليتيم والمسكين . ونحو ذلك من إبطال ما كان عليه أمر الجاهلية من العدوان . والخلافة التي نشأوا عليها من عهد قديم . فكل ما جاء به الرسول يومئذ هو الموافق لمقتضى نظام العمران الذي خلق الله عليه العالم فهو الحق كما قال { ما خلقناهما إلا بالحق } \\[ الدخان : 39 \\] . ولما كان قول الكاذب وقول المجنون المختص بهذا الذي لا يشاركهما فيه العقلاء والصادقون غير جاريين على هذا الحق كان إثبات أن ما جاء به الرسول حقٌّ نقضاً لإنكارهم صدقه . ولقولهم هو مجنون كان ما بعد ( بل ) نقضاً لقولهم .\n\n",
      "translations": [
        {
          "translation": "Or know they not their messenger) the lineage of their Messenger, (and so reject him) and so deny him?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ لَمْ يَعْرِفُواْ رَسُولَهُمْ } أي: بل لم يعرفوا من شدة شكيمتهم وبغضهم علوَّ شأن رسولهم\n وسموَّ برهاه\n وكمالَ عقله ورشده\n واعتدال أخلاقه وأطواره\n وإيفاءَه العهود والأمانات { فَهُمْ لَهُ مُنكِرُونَ } [المؤمنون: 69] للجهل والعناد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم لم يعرفوا رسولهم } أي: بل ألم يعرفوه - عليه الصلاة والسلام - بالأمانة والصدق\n وحسن الأخلاق\n وكمال العلم من غير تعلم ولا مدارسة\n وغير ذلك مما حازه من الكمالات اللائقة بالأنبياء قبله\n بل عرفوه بذلك { فهم له منكِرون } بغياً وحسداً\n { أم يقولون جِنَّة } جنون\n وليس كذلك لأنهم يعلمون أنه أرجحهم عقلاً\n وأثقبهم ذهناً\n وأتقنهم رأياً\n وأوفرهم رزانة\n ولقد شهد له بذلك كل من رآه من الأعداء والأحباب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:83",
      "similarity": 0.7129931716218301
    },
    {
      "verse": "15:62",
      "similarity": 0.6200980336450306
    },
    {
      "verse": "40:81",
      "similarity": 0.6067212204974054
    },
    {
      "verse": "54:6",
      "similarity": 0.529549689093966
    },
    {
      "verse": "12:58",
      "similarity": 0.5273509803512558
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/023069.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/023069.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:69.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}