{
  "chapter": "المؤمنون",
  "text": "ولقد اخذنهم بالعذاب فما استكانوا۟ لربهم وما يتضرعون",
  "translations": [
    {
      "translation": "We seized them with the punishment, but they did not go low before their Lord; nor will they humble themselves",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had seized them with the punishment, but they did not bow before their Lord nor turned to Him in humility,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are such) that We seized them with chastisement (and yet) they did not humble themselves before their Lord, nor do they entreat\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We struck them with torment, but they did not submit themselves to their Lord, nor did they make themselves humble\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We grasped them with punishment, so neither did they submit themselves to their Lord, nor do they cry humbly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We seized them with punishment, but they humbled not themselves to their Lord, nor did they invoke with submission to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And already We overtook them with chastisement, but they were not submissive to their Lord, nor do they humble themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We already seized them with the chastisement, yet they abased not themselves to their Lord nor were they humble;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Already have We grasped them with punishment, but they humble not themselves unto their Lord, nor do they pray,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We seized them with the punishment, but they did not surrender to their Lord, nor will they humble themselves\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We took hold of them with the torment, yet they humbled not themselves to their Lord, nor did they entreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have already seized them with punishment, yet they did not humble themselves before their Lord, nor will they entreat [Him for mercy]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We inflicted Punishment on them, but they humbled not themselves to their Lord, nor do they submissively entreat (Him)!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We seized them with punishment, but they humbled not themselves to their Lord, nor did they invoke (Allah) with submission to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Already We have seized them with the punishment, but they neither humbled themselves to their Lord, nor did they beseech Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have already gripped them with suffering, but they did not surrender to their Lord, nor did they humble themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had gripped them with suffering [as a warning], but they did not yield to their Lord, nor did they humbly supplicate, [and will continue thus]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:76] And We have already seized them with chastisement, [with] hunger, yet they did not humble themselves to their Lord, nor did they devote themselves to prayer, [nor] did they seek [the pleasure of] God through supplication.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Already have We grasped them with punishment) with hunger and drought, (but they humble not themselves unto their Lord) but they did not submit themselves to their Lord by professing Allah's divine Oneness, (nor do they pray) nor do they believe,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يعمهون وقد جربناهم مراراً، فإنا { لَقَدْ أَخَذْنَاهُمْ بِٱلْعَذَابِ } أي: الجدب والقحط أو بالقتل يوم بدر { فَمَا ٱسْتَكَانُواْ } وما تلذذوا وتواضعا { لِرَبِّهِمْ } من كما عتوهم وعنادهم { وَمَا يَتَضَرَّعُونَ } [المؤمنون: 76] إليه استكباراً بل هم على إصرارهم دائماً كلما أخذناهم وكشفنا عنهم، أصروا وازدادوا على استكبارهم وإصرارهم، ولم يرجعوا إلينا مخصلين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولقد أخذناهم بالعذاب } ، وهو ما أصابهم يوم بدر من القتل والأسر، وهو قوله - تعالى - في الدخان\n\n[الدخان: 16]\n { فما استكانُوا لربهم } بذلك، أي: لم يخضعوا ولم يتذللوا\n و \" استكانوا \": افتعل من السكون، والألف زائدة، أو استفعل من الكون، أي: انتقل من كون إلى كون، كاستحال، إذا انتقل من حالٍ إلى حال لأن الخاضع ينتقل من كون إلى كون { وما يتضرعون } أي: وليس من حالهم التضرع إليه تعالى، وعبَّر بالمضارع، ليدل على الاستمرار، أي: ليس شأنهم التضرع في هذه الحالة وغيرها، أو: فما استكانوا فيما مضى، وما يتضرعون فيما ينزل بهم في المستقبل، والمعنى: تالله لقد أخذناهم بالعذاب، وقتلناهم بالسيوف، وما جرى عليهم يوم بدر من قتل صناديدهم، فما وُجدت، بعد ذلك، منهم استكانة ولا تضرع\n\n",
      "translations": []
    }
  ]
}