{
  "chapter": "المؤمنون",
  "text": "وان الذين لا يؤمنون بالءاخرة عن الصرط لنكبون",
  "translations": [
    {
      "translation": "But those who do not have iman in the akhira recoil from the path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe not in the Hereafter turn away from the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but those who do not believe in the Hereafter are ever prone to deviate from the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but those who disbelieve the life hereafter deviate from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed those who do not believe in the Hereafter are deviated from the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, those who believe not in the Hereafter are indeed deviating far astray from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely those who do not believe in the hereafter are deviating from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and surely they that believe not in the world to come are deviating from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! those who believe not in the Hereafter are indeed astray from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who do not believe in the Hereafter have indeed deviated from that path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily those who believe not in the Hereafter are from the path deviating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those who do not believe in the Hereafter surely deviate from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily those who believe not in the Hereafter are deviating from that Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, those who believe not in the Hereafter are indeed deviating far astray from the Path (true religion Islamic Monotheism).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but those who disbelieve in the Everlasting Life deviate from the Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who do not believe in the Hereafter are swerving from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But indeed, those who do not believe in the Hereafter are deviating from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:74] And truly those who do not believe in the Hereafter, in resurrection, reward and punishment, deviate, swerve away, from the path, that is, the route [to salvation].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! those who believe not in the Hereafter) those who do not believe in resurrection after death (are indeed astray from the path) from Allah's religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَنِ ٱلصِّرَاطِ لَنَاكِبُونَ } معناه لَمايلونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {on the path we will walk} - means that they will not deviate from it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنَّ ٱلَّذِينَ لاَ يُؤْمِنُونَ } ولا يصدقون { بِٱلآخِرَةِ } التي فيها انتقاد الأعمال والأحوال وال عرض على ذي العظمة والجلال { عَنِ ٱلصِّرَاطِ } الذي هو سبب اعتدالهم وإخلاصهم فيها { لَنَاكِبُونَ } [المؤمنون: 74] عادلون مائلون، لذلك لم يقبلوا منكما جئتَ به عند ربك؛ إذ خوف الآخرة من أقوى قوائم الإيمان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n } إلى هنا، وبيَّن انتفاءها، ولم يبق إلا كراهة الحق وعدم الفطنة أو العناد أو المكابرة، { وإنَّ الذين لا يؤمنون بالآخرة عن الصراط } عن طريق الحق { لناكِبُون } أي: لعَادلون عن هذا الصراط المذكور، وهو الصراط المستقيم، وصفهم بعدم الإيمان بالآخرة، تشنيعاً لهم بما هم عليه من الانهماك في الدنيا، وزعمهم ألاَّ حياة إلاَّ حياة الدنيا، وإشعاراً بعِلّيّة الحُكم فإن الإيمان بالآخرة وخوف ما فيها من الدواهي من أمور الدعاوي إلى طلب الحق وسلوك سبيله\n والله تعالى أعلم\n الإشارة: كل من أنكر على أهل الخصوصية، ولم يعرف خصوصيتهم فسببه ثلاثة أمور: إما أنه لم يصحبهم ولم يتدبر ما يقولون، ولا ما يأمرون به وينهون عنه، وإنما يرميهم رجماً بالغيب، وإما أنه حسدهم وخاف على جاهه أن يتنقل لغيره، وإما أنهم أتوا بخرق عوائد النفوس التي لم تكن لآبائهم الأولين، فقالوا: { إِنَّا وَجَدْنَا ءَابَآءَنَا عَلَى أُمَّةٍ وَإِنَّا عَلَى ءَاثَارِهِمِ مُّقْتَدُونَ } ، وإنما جاءهم بالحق، وأكثرهم للحق كارهون، وكيف تُخرق للعبد العوائد، وهو لم يخرق من نفسه العوائد؟\n\n\n{ وَلَوِ اْتَّبَعَ اْلحَقُّ أَهْوَاءَهُمْ } ، بأن كانت التربية على طريق العوائد، والاستمرار معها لفسد النظام، ولبقي الكون كله ظلمة لجميع الأنام إذ لا يمكن أن يصير الكون نوراً، بظهور الحق فيه، إلا بخرق عوائد النفوس، وإخراجها عن هواها، فحينئذٍ تخرق له ظلمة الكَون، فيفضي إلى شهود المكَوّن، بل أتيناهم بذكرهم أي: بشرفهم، بمعرفة الحق على نعت العيان، وهم عن ذكرهم معرضون حيث انهمكوا في عوائدهم، ولم يقبلوا من يخرجهم عنها ويعرفهم بالله لله، من غير خراج ولا طمع\n قال تعالى لنبيه - عليه الصلاة والسلام -: { أَمْ تَسْئَلُهُمْ خَرْجاً فَخَرَاجُ رَبِّكَ خَيْرٌ }\n قال القشيري: أي: إنَّكَ لا تُطالبهم على تبليغ الرسالة بأجرة، ولا بإعطاءِ عِوَض، حتى تكون في موضع التهمة فيما تأتيهم به من الشريعة، أم لعلك تريد أن يَعْقدُوا لك الرئاسة، ثم قال: والذي لَكَ من الله - سبحانه - من جزيل الثواب، وحسن المآب، يُغْنيك عن التصدي لنيلِ ما يكون في حصوله منهم مطمع\n هذه كانت سُنَّة الأنبياء والمرسلين - عليهم السلام - عملوا لله فلم يطلبوا عليه أجراً من غير الله، والعلماء ورثة الأنبياء في التنزه من التَّدَنُّس بالأطماع، والأكل بالدين، فإنه ربا مُضِرٌّ بالإيمان، إن كان العملُ لله فالأجر مُنتظرٌ من الله، وهو موعودٌ مِن قبل الله\n هـ\n وراجع ما تقدم في سورة هود فإنه أوفى من هذا\n وقوله تعالى: { وَإِنَّكَ لَتَدْعُوهُمْ إِلَى صِرَطٍ مُّسْتَقِيمٍ } ، وهو طريق الوصول إلى شهود الذات الأقدس، من طريق التربية، التي هي مخالفة الهوى والخروج عن العوائد\n وقال القشيري: الصراطُ المستقيمُ: هو شهودُ الحقِّ بنعت الإنفراد في جميع الأشياء، والإيجاف، والاستسلام لقضايا الإلزام، بمواطأة القلب من غير استكراها الحُكمْ\n هـ\n وقال الورتجبي عن بعضهم: لولا أن الله - تعالى - أمر بمخالفة النفوس ومباينتها، لاتَّبع الخلق أهواءهم في شهوات النفوس، ولو فعلوا ذلك لضلوا عن طريق العبودية، وتركوا أوامر الله، وأعرضوا عن طاعته، ولزموا المخالفة، ألا ترى الله يقول: { ولو اتبع الحق أهواءهم لفسدت السموات والأرض ومن فيهن }\n ثم بيَّن سبحانه أن حبيبه - عليه الصلاة والسلام - يدعوهم إلى تلك المشاهدة بقوله: { وَإِنَّكَ لَتَدْعُوهُمْ إِلَى صِرَاطٍ مُّسْتَقِيمٍ } أي: مما أوضحه أنوار جماله وشاهَدْتَه، وهي طريق معرفته في قلوب الصِّدّيقين للأرواح القدسية\n وتلك الطريقة منتهاها المحبة، وبدايتها الأسوة والمتابعة لقوله:\n\n\n\n[آل عمران: 31]\n هـ\n قلت: المراد بالمحبة محبة الحق لعبده بدليل الآية التي ذكر\n وقال ابن عطاء: إنك لتحملهم على مسالك الوصول، وليس كل أحد يصلح لذلك السلوك، ولا يوفق له إلا أهل الإستقامة، وهم الذين استقاموا مع الله ولم يطلبوا معه سواه، ولم يروا لأنفسهم درجة ولا مقاماً\n هـ\n قوله تعالى: { وإن الذين لا يؤمنون بالآخرة } أي: لا يؤمنون بالحياة الآخرة، وهي حياة النفوس بالمعرفة العيانية، بعد موتها بالجهل والوقوف مع الحس والعوائد، ممن لا يصدق بهذه الحياة، وأنكر وجود من يوصل إليها عن طريق الحق الموصلة إليه، لناكبون، فهم في الحيرة والتلف تائهون، عائذاً بالله من ذلك\n ثمَّ ذكر انهما كهم في الغفلة لسبق القضاء عليهم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:15",
      "similarity": 0.8316490124265145
    },
    {
      "verse": "23:73",
      "similarity": 0.08244981768819416
    },
    {
      "verse": "6:153",
      "similarity": 0.08168049991957205
    },
    {
      "verse": "4:68",
      "similarity": 0.0811720229490029
    },
    {
      "verse": "3:51",
      "similarity": 0.08090891122432334
    }
  ]
}