{
  "chapter": "المؤمنون",
  "text": "ام تسـلهم خرجا فخراج ربك خير وهو خير الرزقين",
  "translations": [
    {
      "translation": "Are you asking them for payment? Your Lord's payment is better. He is the Best of Providers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you ask of them any tribute? In that case the tribute of your Lord is better, for He is the best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you asking them for something? What Allah has given you is the best. He is the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Do they disbelieve because) you asked them for payment? The reward that you will receive from your Lord is the best. He is the best Provider.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you (O dear Prophet Mohammed – peace and blessings be upon him) ask any fee from them? So the reward of your Lord is the best; and He is the Best Provider of Sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that you ask them for some Kharj But the recompense of your Lord is better, and He is the Best of those who give sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that you ask them a recompense? But the recompense of your Lord is best, and He is the best of those who provide sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or dost thou ask them for tribute? Yet the tribute of thy Lord is better, and He is the best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or dost thou ask of them (O Muhammad) any tribute? But the bounty of thy Lord is better, for He is Best of all who make provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are you asking them for any reward? But the reward of your Lord is the best, for He is the Best of Providers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, is it that thou askest of them any maintenance? The maintenance of thy Lord is better, and He is the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you ask a recompense from them? Your Lord’s recompense is better, and He is the best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that thou askest them for some recompense? But the recompense of thy Lord is best: He is the Best of those who give sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that you (O Muhammad SAW) ask them for some wages? But the recompense of your Lord is better, and He is the Best of those who give sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do you ask a tribute from them? Your Lord's tribute is better. He is the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are you asking them for a payment? The revenue from your Lord is better, and He is the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you, [O Muhammad], ask them for payment? But the reward of your Lord is best, and He is the best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:72] Or do you ask them for any recompense?, any remuneration, in return for the faith that you have brought them? Yet the recompense of your Lord is, His remuneration, His reward and His provision [are], better (one reading has kharjan, ‘recompense’, in both instances [sc. kharjan fa-kharju]; another has kharājan in both [sc. kharājan fa-kharāju]) and He is the best of providers, the best of givers and remunerators.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or dost thou ask of them) or do you ask, Muhammad, the people of Mecca (any tribute) some payment, and this is why they are not responding? (But! the bounty of your Lord) in Paradise (is better) is better than what they have in the life of this world, (for He is best of all who make provision) in this world and in the next.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَمْ تَسْأَلُهُمْ خَرْجاً } معناه غَلَّةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - exalted be He - {Or do you ask them for a fee}, its meaning is a fine.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ تَسْأَلُهُمْ } أي: أيظنون ويعتقدون أنك يا أكمل الرسل تطلب لأداء الرسالة وتبليغها علهيم { خَرْجاً } جُعْلاً وإجراءُ لذلك انصرفوا عنك وعن دينك وكتابك؟! { فَخَرَاجُ رَبِّكَ } الذي ربَّاك بأنواع النعم الصوري والمعنوي\n وأجره لك بأعظم المثوبات وأعلى الدرجات { خَيْرٌ } لك من جُعْلهم { وَ } إن نسبوك إلى الفقر والفاقة قل { هُوَ } سبحانه { خَيْرُ ٱلرَّازِقِينَ } [المؤمنون: 72] لو فُرضَ رازق سواه\n مع أنه لا رازقُ إلا هو\n\n\n{ وَ } بالجملة: هم منحرفون في أنفسهم عن جادة التوحيد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم تسألُهُم خَرْجاً } ، هذا انتقال من توبيخهم بما ذكر من قولهم: { أم يقولون به جِنَّة } ، إلى التوبيخ بوجه آخر، كأنه قال: أم يزعمون أنك تسألهم عن أداء الرسالة { خَرْجا } أي: جُعلاً، فيتهمونك، أو يثقل عليهم فلذلك لا يؤمنون، { فخراجُ ربك خيرٌ } أي: رزقه في الدنيا، وثوابه في الآخرة، خير لك من ذلك لدوامه وكثرته، أي: لا تسألهم ذلك فإن ما رزقك الله في الدنيا والعقبى خير لك من ذلك وفي التعرض لعنوان الربوبية، مع الإضافة إلى ضميره - عليه الصلاة والسلام -، من تعليل الحكم وتشريفه صلى الله عليه وسلم ما لا يخفى\n والخَرْج والخراج واحد، وهو: الأجر المأخوذ على العمل، ويطلق على الغلة والضريبة كخراج العبد والأرض، وقال النضر بن شُميل: سألت أبا عمرو بن العلاء عن الفرق بين الخراج والخَرْج، فقال: الخراج ما لزمك، والخرج مَا تَبَرَّعْتَ به، وقيل: الخرج أخص من الخراج لأنَّ الخراج يطلق على كل ما يستفيده المرء من غلة، أو أجرة، أو زكاة، والخرج خاص بالأجرة، وفي الخراج إشعار بالكثرة، فلذلك عبَّر به في جانبه - تعالى - والمعنى: أم تسألهم، على هدايتك لهم، قليلاً من عطاء الخلق، فالكثير من عطاء الخالق خير، { وهو خير الرازقين }: أفضل المعطين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:41",
      "similarity": 0.3543150870919602
    },
    {
      "verse": "10:31",
      "similarity": 0.3378405331140167
    },
    {
      "verse": "78:1",
      "similarity": 0.3308345980362599
    },
    {
      "verse": "56:82",
      "similarity": 0.32643077722156905
    },
    {
      "verse": "15:92",
      "similarity": 0.3228917747679255
    }
  ]
}