{
  "chapter": "المؤمنون",
  "text": "ولو اتبع الحق اهواءهم لفسدت السموت والارض ومن فيهن بل اتينهم بذكرهم فهم عن ذكرهم معرضون",
  "translations": [
    {
      "translation": "If the truth were to follow their whims and desires, the heavens and the earth and everyone in them would have been brought to ruin. No indeed! We have given them their Reminder, but they have turned away from it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had truth been subject to their whims the heavens and the earth and all those within them would have been depraved. In fact We had sent them their reminder, but they turned away from good advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were the Truth to follow their desires, the order of the heavens and the earth and those who dwell in them would have been ruined. Nay, the fact is that We have brought to them their own remembrance; and yet it is from their own remembrance that they are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the truth followed their desires, the heavens and the earth and all that is in them would have been destroyed. We sent them the Quran but they ignored it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had the Truth followed their desires, then indeed the heavens and the earth and all those who are in them would be destroyed; in fact We brought to them a thing in which lay their repute, so they are turned away from their own repute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Al-Haqq had followed their desires, verily, the heavens and the earth, and whosoever is therein would have been corrupted! Nay, We have brought them their reminder, but they turn away from their reminder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And should the truth follow their low desires, surely the heavens and the earth and all those who are therein would have perished. Nay! We have brought to them their reminder, but from their reminder they turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the truth followed their caprices, the heavens and the earth and whosoever in them is had surely corrupted. Nay, We brought them their Remembrance, but from their Remembrance they turned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the Truth had followed their desires, verily the heavens and the earth and whosoever is therein had been corrupted. Nay, We have brought them their Reminder, but from their Reminder they now turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If truth had followed their whims and desires, heavens and earth and all that lives in them would have been brought to ruin. Rather We have brought them their Reminder. Yet they keep avoiding their Reminder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were the truth to follow their desires there would have been corrupted the heavens and the earth and whatsoever is therein. Aye! We have come to them with their admonition; so it is from their admonition that they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the truth followed their desires, the heavens and the earth would have surely fallen apart [along] with those who are in them. Indeed, We have brought them their Reminder, but they are disregardful of their Reminder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the Truth had been in accord with their desires, truly the heavens and the earth, and all beings therein would have been in confusion and corruption! Nay, We have sent them their admonition, but they turn away from their admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the truth had been in accordance with their desires, verily, the heavens and the earth, and whosoever is therein would have been corrupted! Nay, We have brought them their reminder, but they turn away from their reminder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the truth followed their fancies, the heavens, the earth, and all who live in them would have surely been corrupted. No, We brought them theirRemembrance; but from their Remembrance they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the truth conformed to their desires, the heavens, the earth, and everyone in them would have gone to ruin. In fact, We have given them their message, but they keep avoiding their message.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if the Truth had followed their inclinations, the heavens and the earth and whoever is in them would have been ruined. Rather, We have brought them their message, but they, from their message, are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:71] And if the truth, namely, the Qur’ān, had followed their desires, and come to them with [mention of] what they fancied in the way of God having a partner and a child, may God be exalted above such [associations], indeed the heavens and the earth and whoever is in them would have been corrupted, they [the heavens and the earth] would have deviated from their observed order, because contradictions would ensue, as is usually the case, when there is more than one ruler. Nay, We have brought them their Remembrance, namely, the Qur’ān, in which they are remembered and honoured, but they are disregardful of their [own] Remembrance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if the Truth had followed their desires) if it was according to their whims such that there is a deity in the heavens and a deity in the earth, (verily the heavens and the earth and whosoever is therein) of created 380 beings (had been corrupted. Nay, We have brought them their Reminder) We sent Gabriel to their Prophet with the Qur'an wherein lies their glory and honour, (but from their Reminder) but from their glory and honour (they now turn away) they disbelieve.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَوِ ٱتَّبَعَ ٱلْحَقُّ أَهْوَآءَهُمْ } فالحقُّ: الله عزَّ وجلَّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوِ ٱتَّبَعَ ٱلْحَقُّ } والوحي { أَهْوَآءَهُمْ } الباطلةَ وآراءَهم الفاسدةَ { لَفَسَدَتِ ٱلسَّمَٰوَٰتُ وَٱلأَرْضُ وَمَن فِيهِنَّ } من ذوي الشعور والإدراك، المتوجهين نحو الحق طوعاً؛ من شؤم أعمالهم وسوء أفعالهم وقبح أخلاقهم وأطوارهم، لذلك ما آتيناهم وأوحيناه على رسولهم ما هو مشتهى نفوسِهم ومقتضى أهوائهم { بَلْ أَتَيْنَاهُمْ بِذِكْرِهِمْ } وتذكيرهم، بذكرُ ماه هو الأصلح بحالهم والأليق بشأنهم من الأوامر والنواهي، والوعد الوعيد، والإنذار والتبشير، والعبر والأمثال، والقصص والآثار { فَهُمْ } من غاية عمههم وسكرتهم { عَن ذِكْرِهِمْ } المصلح لحالهم، المنجي لنفوسهم من الوبال والنكال { مُّعْرِضُونَ } [المؤمنون: 71] منصرفون عنه عتواً واستكباراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولو اتبع الحقُّ أهواءهم } بأن كان في الواقع آلهة شتى { لفسدتِ السمواتُ والأرضُ ومن فيهن } كما تقدم في قوله:\n\n[الأنبياء: 22]، فالاتباع هنا مجاز، أي: لو جاء الوحي على ما يشتهون لفسدت السموات، فالحق هنا هو المذكور في قوله: { بل جاءهم بالحق وأكثرهم للحق كارهون } ، والمعنى: لو كان ما كرهوه من الحق، الذي من جملته ما جاء به النبي صلى الله عليه وسلم، موافقاً لأهوائهم الباطلة لفسد نظام العالم، وتخصيص العقلاء بالذكر حيث عبَّر بمن لأنَّ غيرهم تبع\n { بل أتيناهم بذكْرهم }: بشرفهم، وهو القرآن الذي فيه فخرهم وشرفهم، كما قال تعالى:\n\n[الزخرف: 44] لأن الرسول منهم، والقرآن لغتهم، أو بتذكيرهم ووعظهم، أو بالذكر الذي كانوا يتمنونه، ويقولون:\n\n[الصافات: 168]، { فهم عن ذِكْرِهم معرضون } أي: فهم، بما فعلوا من النكوص، عن فخرهم وشرفهم معرضون، وهذا مما جُبِلَتْ عليه النفوس الأَمّارة الإعراض عما فيه خيرها، والرغبة فيما فيه هلاكها، إلا من عصم الله، وفي إسناد الإتيان إلى نون العظمة، بعد إسناده إلى ضميره عليه الصلاة والسلام، ومن التنويه بشأن النبي صلى الله عليه وسلم ما لا يخفى\n انظر أبا السعود",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:29",
      "similarity": 0.49484914361978216
    },
    {
      "verse": "2:145",
      "similarity": 0.413101335100957
    },
    {
      "verse": "101:9",
      "similarity": 0.3960050687106885
    },
    {
      "verse": "54:3",
      "similarity": 0.386336008423275
    },
    {
      "verse": "47:14",
      "similarity": 0.3849147626503033
    }
  ]
}