{
  "chapter": "المؤمنون",
  "text": "حتى اذا فتحنا عليهم بابا ذا عذاب شديد اذا هم فيه مبلسون",
  "translations": [
    {
      "translation": "until We open to them a gate to a harsh punishment in which they will at once be crushed by despair.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that when at last We open up the gate of severe punishment on them they will be overwhelmed with despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until We opened upon them the door of a severe chastisement. Then lo, in this state they become utterly despaired of any good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until We opened the gate of greater torment (death) and they suddenly found themselves in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the extent that when We opened the gate of a severe punishment for them, they thereupon lie despairingly in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when We open for them the gate of severe punishment, then lo! they will be plunged in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when We open upon them a door of severe chastisement, lo! they are in despair at it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until, when We open against them a door of terrible chastisement, lo, they are sore confounded at it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when We open for them the gate of extreme punishment, behold! they are aghast thereat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until We open before them a gate of harsh punishment and then they will be dumbfounded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when we shall open upon them a portal of severe torment, and lo! thereat they are desparing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "until We open on them the gate of a severe punishment, whereupon they will be despondent in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until We open on them a gate leading to a severe Punishment: then Lo! they will be plunged in despair therein!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when We open for them the gate of severe punishment, then lo! They will be plunged into destruction with deep regrets, sorrows and in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when We opened on them a gate of severe punishment, they utterly despaired.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when We have opened before them a gate of intense agony, at once they will despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when We have opened before them a door of severe punishment, immediately they will be therein in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:77] Until (hattā is for inceptiveness), when We opened on them the gate of a severe chastisement, namely, the day of Badr, slaying [them], behold! they are aghast thereat, despairing of anything good.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Until) give them respite, Muhammad, until (when We open for them the gate of extreme punishment) i.e. of hunger, (behold! they are aghast thereat) they despair of all goodness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ حَتَّىٰ إِذَا فَتَحْنَا عَلَيْهِمْ بَاباً } من البلاء والعناء { ذَا عَذَابٍ شَدِيدٍ } وهو القحط المفرط؛ إذ هو من أصعب العقوبات وأسوئها { إِذَا هُمْ فِيهِ مُبْلِسُونَ } [المؤمنون: 77] متحسرون آيسون من كل خيرٍ، ومع ذلك لم يتوجهوا إلينا ولم يتضرعوا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ حتى إذا فتحنا عليهم باباً ذا عذابٍ شديد } ، وهو عذاب الآخرة، { إذا هم فيه مبلسون }: متحيرون آيسون من كل خير، وهذا هو الصواب من حمل العذاب على عذاب الآخرة، بدليل وصفه بالشدة والإياس\n والله تعالى أعلم\n الإشارة: أهل الغفلة والبُعد لا يرجعون إلى الله في السراء ولا في الضراء لانهماكهم في الغفلة والقساوة، وأهل اليقظة يرجعون إلى الله في السراء والضراء، في السراء بالحمد والشكر، وفي الضراء بالصبر والرضا والتسليم، مع التضرع والابتهال عبوديةً، والمقتصدون يرجعون إليه - تعالى - في الضراء، ويغفلون عن الشكر في السراء، والأول ظالم لنفسه، والثاني سابق، والثالث مقتصد\n وبالله التوفيق\n ثم ذكر دلائل قدرته تعالى - وفي ضمنه استدعاؤهم إلى الرجوع لله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:49",
      "similarity": 0.7800768289050992
    },
    {
      "verse": "6:44",
      "similarity": 0.7431820086919986
    },
    {
      "verse": "30:12",
      "similarity": 0.7330741489138456
    },
    {
      "verse": "43:75",
      "similarity": 0.4776282781806038
    },
    {
      "verse": "78:19",
      "similarity": 0.3790906783324277
    }
  ]
}