{
  "chapter": "المؤمنون",
  "text": "لقد وعدنا نحن وءاباؤنا هذا من قبل ان هذا الا اسطير الاولين",
  "translations": [
    {
      "translation": "We and our forefathers were promised this before. This is nothing but the myths of previous peoples!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We and our fathers were promised this before; it is nothing but ancient lore!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We were promised such things and so were our forefathers before us. All these are no more than tales of the past.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our fathers and we have been given such promises before. These are no more than ancient legends.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Indeed this promise was given to us and before us to our forefathers – this is nothing but stories of earlier people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this we have been promised -- we and our fathers before! This is only (from) tales of the ancients!\") Allah's saying:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly we are promised this, and (so were) our fathers aforetime; this is naught but stories of those of old.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We and our fathers have been promised this before; this is naught but the fairy-tales of the ancients.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We were already promised this, we and our forefathers. Lo! this is naught but fables of the men of old.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We and our forefathers were promised this before. This is nothing but fables of the ancients.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly this we have been promised--we and our fathers-- aforetime: naught is this but the fables of the ancients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, we and our fathers were promised this before. [But] these are nothing but myths of the ancients.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such things have been promised to us and to our fathers before! they are nothing but tales of the ancients!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this we have been promised, we and our fathers before (us)! This is only the tales of the ancients!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We and our fathers have been promised this before. It is but of the ancients' fictitious tales'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We were promised this before—we and our ancestors—these are nothing but legends of the ancients.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have been promised this, we and our forefathers, before; this is not but legends of the former peoples.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:83] Already We and our fathers have been promised this, resurrection after death, before: these are nothing but the fables, the lies, of the ancients’, [mere] jokes and strange tales (asātīr, the plural of ustūra).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We were already promised this) which you are promising us, Muhammad, (we and our forefathers) before us, were also promised the same. (Lo! This) that which you are saying to us, Muhammad, (is naught but fables) the mere talk and lies (of the men of old.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنا { لَقَدْ وُعِدْنَا نَحْنُ } على لسان من جاءنا بادعاء الرسالة والنبوة { وَ } قد وعد أيضاً { آبَآؤُنَا هَـٰذَا } الموعود المخصوص على لسان من جاء بهم { مِن قَبْلُ } وهلم جراً\n مع أنا ولا هم لم نرَ من علامات صدقها وأمارات وقوعها شيئاً أصلاً\n\n\nوبالجملة { إِنْ هَـٰذَآ } أي: ما هذا الوعد الموعود والقول المعهود\n وهو أنكم\n[سبأ: 7] { إِلاَّ أَسَاطِيرُ ٱلأَوَّلِينَ } [الأنبياء 83] أي: أباطيلهم وأكاذيبهم التي سطروها في دواوينهم وكتبهم على وجه السمرة والمخادعة لضفاء الأنام\n\n\nوبعدما بالغوا في الإنكار على البعث والإعادة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:68",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "52:2",
      "similarity": 0.749969054730633
    },
    {
      "verse": "68:15",
      "similarity": 0.7324298853177088
    },
    {
      "verse": "83:13",
      "similarity": 0.7324298853177088
    },
    {
      "verse": "8:31",
      "similarity": 0.7142832963575376
    }
  ]
}