{
  "chapter": "المؤمنون",
  "text": "قل منۢ بيده ملكوت كل شىء وهو يجير ولا يجار عليه ان كنتم تعلمون",
  "translations": [
    {
      "translation": "Say: 'In whose hand is the dominion over everything, He who gives protection and from whom no ection can be given, if you have any knowledge?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Whose is the sovereignty over all things, who protects, and against whom there is no protection? {Answer) if you have knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: \"Say, if you indeed know, to whom belongs the dominion over all things; (Who is it) that grants asylum, but against Whom no asylum is available?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, \"If you have any knowledge, in whose hands is the ownership of all things? Who is the one who gives protection and yet He Himself is never protected?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “In Whose hand is the control over all things, and He provides refuge, and none can provide refuge against Him, if you know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"In Whose Hand is the sovereignty of everything And He protects, while against Whom there is no protector, if you know\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who is it in Whose hand is the kingdom of all things and Who gives succor, but against Him Succor is not given, if you do but know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'In whose hand is the dominion of everything, protecting and Himself unprotected, if you have knowledge?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: In Whose hand is the dominion over all things and He protecteth, while against Him there is no protection, if ye have knowledge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"In whose hands lies sovereignty over all things, protecting all, while none can seek protection against Him? Tell me, if you have any knowledge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saythou: in whose hands is the governance of everything, and who sheltereth but from whom none is sheltered, if ye know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘In whose hand is the dominion of all things, and who gives shelter and no shelter can be provided from Him, if you know?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is it in whose hands is the governance of all things,- who protects (all), but is not protected (of any)? (say) if ye know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say \"In Whose Hand is the sovereignty of everything (i.e. treasures of each and everything)? And He protects (all), while against Whom there is no protector, (i.e. if Allah saves anyone none can punish or harm him, and if Allah punishes or harms anyone none can save him), if you know.\" [Tafsir Al-Qurtubi, Vol. 12, Page 145]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'In whose Hands is the Kingdom of all things, He protects, and none protects against Him, if you have knowledge'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “In whose hand is the dominion of all things, and He protects and cannot be protected from, if you happen to know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"In whose hand is the realm of all things - and He protects while none can protect against Him - if you should know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:88] Say: ‘In whose hand is the dominion, the possession, of all things (the [final] tā’ [in malakūt] is hyperbolic), and who protects, while from Him there is no protection, if you know?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) also to them, Muhammad: (In Whose hand is the dominion over all things) in Whose hand is the store of all things (and He protecteth) and He judges, (while against Him there is no protection) while no judgement can be made upon him; it is also said that this means: He protects people from His chastisement but none can protect others from His chastisement, (if ye have knowledge?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل بعدما تأكدا إلزامهم وإفحامهم كلاماً جلياً شاملاً لجميع مقدورات الله ومراداته: { مَن بِيَدِهِ } وقبضةِ قدرته وحوله وقوته { مَلَكُوتُ كُلِّ شَيْءٍ } وملكُه يتصرف فيه حسب إرادته واختياره على سبيل الاستقلال { وَ } من { هُوَ يُجْيِرُ } يغيث ويعين الملهوفَ المضطرَ إذا دعاه { وَلاَ يُجَارُ } ويُنصر { عَلَيْهِ } لأنه سبحانه يعلو ولا يُعلى عليه\n أخبروني { إِن كُنتُمْ تَعْلَمُونَ } [المؤمنون: 88] أي: من ذوي الخبرة والشعور\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { وهو يُجير } أي: يغيث\n يقال: أجرت فلاناً على فلان: إذا أغثته منه\n يعني: وهو يغيث من شاء ممن شاء\n { ولا يُجار عليه }: ولا يغيث أحد عليه\n أي: لا يمنع أحدٌ أحداً بالنصر عليه\n { إن كنتم تعلمون } شيئاً ما\n أو تعلمون ذلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:28",
      "similarity": 0.719523051165861
    },
    {
      "verse": "9:6",
      "similarity": 0.6920804184867079
    },
    {
      "verse": "46:31",
      "similarity": 0.6482959240496478
    },
    {
      "verse": "16:9",
      "similarity": 0.4934257103421712
    },
    {
      "verse": "72:22",
      "similarity": 0.4693739439215497
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/23:88.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/23:88.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:88.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}