{
  "chapter": "المؤمنون",
  "text": "وهو الذى يحى ويميت وله اختلف اليل والنهار افلا تعقلون",
  "translations": [
    {
      "translation": "It is He who gives life and causes to die and His is the alternation of the night and day. So will you not your intellect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who gives you life and death, and His the alternation of night and day. Even then you do not understand,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who gives life and causes death, and He holds mastery over the alternation of night and day. Do you not understand this?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who gives life and causes death and it is He who alternates night and day. Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who gives life and causes death, and for Him are the alternations of night and day; so do you not have sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who gives life and causes death, and His is the alternation of night and day. Will you not then understand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who gives life and causes death, and (in) His (control) is the alternation of the night and the day; do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who gives life, and makes to die, and to Him belongs the alternation of night and day; what, will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who giveth life and causeth death, and His is the difference of night and day. Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the One who gives life and causes death and He controls the alternation of night and day. Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who quickeneth and causeth to die, and His is the alternation of night and day; will ye not then reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who gives life and brings death, and due to Him is the alternation of day and night. Do you not exercise your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who gives life and death, and to Him (is due) the alternation of Night and Day: will ye not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who gives life and causes death, and His is the alternation of night and day. Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who revives and makes to die, and to Him belong the alternation of the night and the day. Will you not understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who gives life and brings death, and to Him is the alternation of night and day. Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who gives life and causes death, and His is the alternation of the night and the day. Then will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:80] And He it is Who gives life, by breathing the Spirit into the embryo (mudgha), and brings death, and due to Him is the alternation of night and day, in darkness and brightness, [and through] increase and diminution. Will you not then comprehend?, His handiwork, exalted be He, and so reflect?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَهُوَ الَّذِي يُحْيِي وَيُمِيتُ وَلَهُ اخْتِلَافُ اللَّيْلِ وَالنَّهَارِ أَفَلَا تَعْقِلُونَ (80)هو من أسلوب { وهو الذي أنشأ لكم السمع } \\[ المؤمنون : 78 \\] وأعقب ذكر الحشر بذكر الإحياء لأن البعث إحياء إدماجاً للاستدلال على إمكان البعث في الاستدلال على عموم التصرف في العالم .وأما ذكر الإماتة فلمناسبة التضاد ، ولأن فيها دلالة على عظيم القدرة والقهر . ولما كان من الإحياء خلْق الإيقاظ ومن الإماتة خلق النوم كما قال تعالى : { الله يتوفى الأنفس حين موتها } \\[ الزمر : 42 \\] الآية عطف على ذلك أن بقدرته اختلاف الليل والنهار لتلك المناسبة ، ولأن في تصريف الليل والنهار دلالة على عظيم القدرة ، والعلم دلالة على الانفراد بصفات الإلهية وعلى وقوع البعث كما قال تعالى : { كما بدأكم تعودون } \\[ الأعراف : 29 \\] .واللام في { له اختلاف الليل والنهار } للملك ، أي بقدرته تصريف الليل والنهار ، فالنهار يناسب الحياة ولذلك يسمى الهبوب في النهار بعثاً ، والليلُ يناسب الموت ولذلك سمى الله النوم وفاةً في قوله : { وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار ثم يبعثكم فيه } \\[ الأنعام : 60 \\] .وتقديم المجرور للقصر ، أي له اختلاف الليل والنهار لا لغيره ، أي فغيره لا تحق له الإلهية .ولما كانت هذه الأدلة تفيد من نظر فيها علماً بأن الإله واحد وأن البعث واقع وكان المقصودون بالخطاب قد أشركوا به ولم يهتدوا بهذه الأدلة جُعلوا بمنزلة غير العقلاء فأنكر عليهم عدم العقل بالاستفهام الإنكاري المفرع على الأدلة الأربعة بالفاء في قوله { أفلا تعقلون } .وهذا تذييل راجع إلى قوله { وإليه تحشرون } \\[ المؤمنون : 79 \\] وما بعده .\n\n",
      "translations": [
        {
          "translation": "(And He it is Who giveth life) upon resurrection (and causes death) in the life of this world, (and His is the difference of night and day) He changes the day and the night; He makes them come and go, increase and decrease in length; the brightness of day and darkness of night-all these are a sign that Allah will bring the dead back to life. (Have ye then no sense) do you then not believe in resurrection after death? 381\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ضوءاً وظلمةً { أَفَلاَ } تتفكرون وتتأملون أيها المجبولون على التفكر والتدبر حتى { تَعْقِلُونَ } [المؤمنون: 80] وتدركون كيفيفة ظهور الحق وإظهاره مظاهر أسمائه الحسنى وصفاته العليا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أفلا تعقلون } فتعرفون بالنظر والتأمل أن الكل منا\n وأن قدرتنا تعم جميع الممكنات\n التي من جملتها البعث والحساب\n وقُرئ \" يعقلون \" بالغيب\n على الالتفات لحكاية سوء حال المخاطبين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:138",
      "similarity": 0.6881635871968783
    },
    {
      "verse": "45:5",
      "similarity": 0.6050187134081365
    },
    {
      "verse": "57:17",
      "similarity": 0.5334881698879983
    },
    {
      "verse": "10:6",
      "similarity": 0.5245913983326741
    },
    {
      "verse": "25:62",
      "similarity": 0.47057209942250205
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/023080.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/023080.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/23:80.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}