{
  "chapter": "المؤمنون",
  "text": "قل من رب السموت السبع ورب العرش العظيم",
  "translations": [
    {
      "translation": "Say: \"Then who is the Lord of the seven skies? And who is the Lord of the mighty Throne?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: \"Who is the Lord of the seven heavens, the Lord of the Great Throne?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, \"Who is the Lord of the seven heavens and the Great Throne?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who is the Lord of the seven heavens, and the Lord of the Tremendous Throne?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is (the) Lord of the seven heavens, and (the) Lord of the Great Throne\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who is the Lord of the seven heavens and the Lord of the mighty dominion?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who is the Lord of the seven heavens and the Lord of the mighty Throne?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who is Lord of the seven heavens, and Lord of the Tremendous Throne?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who is the Lord of the seven heavens, and of the Glorious Throne?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: who is Lord of the seven heavens and Lord of the mighty throne?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Who is the Lord of the seven heavens and the Lord of the Great Throne?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is the Lord of the seven heavens, and the Lord of the Throne (of Glory) Supreme?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is (the) Lord of the seven heavens, and (the) Lord of the Great Throne?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who is the Lord of the seven heavens, and of the Great Throne'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who is the Lord of the seven heavens, and Lord of the Splendid Throne?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who is Lord of the seven heavens and Lord of the Great Throne?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:86] Say: ‘Who is the Lord of the seven heavens and the Lord of the Great Throne?’, that is, the throne (kursī).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) also to them, Muhammad: (Who is Lord of the seven heavens, and Lord of the Tremendous Throne?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم أيضاًُ إلزاماً وتبكيتاً: { مَن رَّبُّ ٱلسَّمَٰوَٰتِ ٱلسَّبْعِ } الشدائد المطبقات المزيَّنات بالكواكب { وَرَبُّ ٱلْعَرْشِ ٱلْعَظِيمِ } [المؤمنون: 86] المحيط بالكل المسيِّر لها على وجه السرعة التامة والحركة الشديدة بلا تخللِ سكونٍ أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل من ربُّ السموات السبع وربُّ العرش العظيم } ، أعيد الرب تنويهاً لشأن العرش، ورفعاً لمحله لئلا يكون تبعاً للسموات والأرض، وجوداً وذكراً، ولقد روعي في الأمر بالسؤال الترقي من الأدنى إلى الأعلى، فإن سألتهم سيقولون لله أي: هي لله، كقولك: مَن رب هذا الدار؟ فتقول: هي لفلان، وقال الشاعر:\n\nوقال الأخَفش: اللام زائدة، أي: هو الله، وبعدمه قرأ أهل البصرة، فيه وفيما بعده، واتفقوا على إثباته في الأول، ليطابق السؤال، فإن أجابوا بذلك { فقل أفلا تتقون } أي: أتعلمون ذلك، ولا تتقون عذابه في كفركم وجحودكم قدرته على البعث؟ { قل من بيده ملكوت كل شيء } أي: التصرف التام في كل شيء بقهره وسلطانه، فالملكوت، في أصل اللغة، مبالغة في الملك، زيدت الواو والتاء للمبالغة، كالجبروت مبالغةً في الجبر، وفي عرف الصوفية، الملكوت: ما بطن من أسرار المعاني القائمة بالأواني، أو نقول: ما غاب في عالم الشهادة من أسرار الذات، فحس الأواني مُلك، ومعانيها ملكوت، والجبروت: ما خرج عن دائرة الأكوان من بحر الأسرار، الفائض بأنوار الملكوت، وهذه أسماء لمسمى واحد، وهو بحر الوحدة",
      "translations": []
    }
  ]
}