{
  "chapter": "المؤمنون",
  "text": "ما اتخذ الله من ولد وما كان معه من اله اذا لذهب كل الهۭ بما خلق ولعلا بعضهم على بعض سبحن الله عما يصفون",
  "translations": [
    {
      "translation": "Allah has no son and there is no other god accompanying Him, for then each god would have gone off with what he created and one of them would have been exalted above the other. Glory be to Allah above what they describe,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not begotten a son, nor is there any god besides Him. Had this been so, each god would have taken away what he had created with him, and some would have risen over the others. God is much too glorious for what they attribute (to Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did Allah take unto Himself any son, nor is there any god other than He. (Had there been any other gods) each god would have taken his creatures away with him, and each would have rushed to overpower the other. Glory be to Allah from all that they characterize Him with!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has never given birth to a son and there is no other god besides Him. If there were, each god would have taken away his creatures and claimed superiority over the others. God is too exalted to be as they believe Him to be.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not chosen any child, nor any other God along with Him – were it so, each God would have taken away its creation, and each one would certainly wish superiority over the other; Purity is to Allah above all the matters they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No son (or offspring) did Allah beget, nor is there any god along with Him. (If there had been many gods), then each god would have taken away what he had created, and some would have tried to overcome others! Glorified be Allah above all that they attribute to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did Allah take to Himself a son, and never was there with him any (other) god-- in that case would each god have certainly taken away what he created, and some of them would certainly have overpowered others; glory be to Allah above what they describe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not taken to Himself any son, nor is there any god with Him; for then each god would have taken off that he created and some of them would have risen up over others; glory to be God, beyond that they describe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath not chosen any son, nor is there any god along with Him; else would each god have assuredly championed that which he created, and some of them would assuredly have overcome others. Glorified be Allah above all that they allege.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not taken to Himself a son, nor is there any other deity besides Him; otherwise, each god would have walked away with what he had created. They would surely have tried to overcome one another. Glory be to God, above all that they ascribe to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath not betaken to Himself any son, and there is not along Him any god; else each god would have gone off with that which he had created, and one of them would have exalted himself above the others. Hallowed be Allah above that which they ascribe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not taken any offspring, neither is there any god besides Him, for then each god would take away what he created, and some of them would surely rise up against others. Clear is Allah of what they allege!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No son did Allah beget, nor is there any god along with Him: (if there were many gods), behold, each god would have taken away what he had created, and some would have lorded it over others! Glory to Allah! (He is free) from the (sort of) things they attribute to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No son (or offspring or children) did Allah beget, nor is there any ilah (god) along with Him; (if there had been many gods), behold, each god would have taken away what he had created, and some would have tried to overcome others! Glorified be Allah above all that they attribute to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not taken to Himself any son, there is no other god with Him. Were this otherwise each god would have taken that which he created, and some ofthem would have risen above others; Exalted is Allah beyond that they describe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has never begotten a son, nor is there any god besides Him. Otherwise, each god would have taken away what it has created, and some of them would have gained supremacy over others. Glory be to God, far beyond what they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not taken any son, nor has there ever been with Him any deity. [If there had been], then each deity would have taken what it created, and some of them would have sought to overcome others. Exalted is Allah above what they describe [concerning Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:91] God has not taken any son, nor is there any god along with Him; for then, that is, if there were a god along with Him, each god would have taken away what he created, he would have made it exclusively his and prevented the other [god] from having any mastery over it; and some of them would surely rise up against others, in challenge, just as the kings of this world are wont to do. Glorified be God — an exaltation of Him — above what they ascribe, to Him, of what has been mentioned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "382 (Allah hath not chosen any son) from the Children of Adam nor are the angels His daughters, (nor is there any God along with Him) as partner; (else would) if the case was as they claim then (each God have assuredly championed that which he created) each god would take for himself that which he created, (and some of them would assuredly have overcome others. Glorified be Allah) Allah exonerated Himself (above all that they allege) of all their lies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن جملة ما تنسبون إلى الله سبحانه افتراءً ومراءً: إثبات الولد له سبحانه مع أنه { مَا ٱتَّخَذَ ٱللَّهُ } الواحد الأحد الذي شأ\nه ووصفُه أنه:\n[الإخلاص: 3-4] { مِن وَلَدٍ } إذ هو من خواص الأجسام ولوازم الإمكان\n وهو سبحانه منزهُ عنهما\n\n\n{ وَ } من جملة أكاذيبهم البالطة أيضاً: إثبات الشريك له سبحانه مع أنه { مَا كَانَ } أي: ما صحَّ وجاز أن يكون { مَعَهُ مِنْ إِلَـهٍ } شريكاً يُعبد بالحق مثله\n ويستحق بالعبادة اسحتقاقاً ذاتياً ووضعياً كما هو شأنه سبحانه { إِذاً } أي: حين كان الإله الواجب الوجود المستحق للعبادة متعدداً كما زعم أولئك المبطلون { لَّذَهَبَ } وتميز { كُلُّ إِلَـٰهٍ بِمَا خَلَقَ } أوجد وأظهر\n فيكون مَلْك كلٍ منهما ممتازاً عن الآخر\n وإذا كان الإله متعدداً أو المملكة ممتازةُ\n لأمكن التغالب والتحارب ألبتة { وَلَعَلاَ } أي: غلب وارتفع { بَعْضُهُمْ عَلَىٰ بَعْضٍ } هم بالقدرة والاستيلاء\n فاحتل النظام المشاهد المحسوس\n ولم يبقَ له انتظامُ وقيامُ { سُبْحَانَ ٱللَّهِ } وتعالى ذاته { عَمَّا يَصِفُونَ } [المؤمنون: 91] به أولئك الجاهلون الغافلون عن علوِّ شأ\nه من إثبات الولد له والشريك مع تعاليه\n وتنزهه في ذاته عنهما وعن أمثالهما\n\n\nوكيف يكون له ولد ومعه شريك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:159",
      "similarity": 0.6833248986827973
    },
    {
      "verse": "37:180",
      "similarity": 0.6547476647093431
    },
    {
      "verse": "43:82",
      "similarity": 0.5930221015580646
    },
    {
      "verse": "21:22",
      "similarity": 0.5542505298955381
    },
    {
      "verse": "21:112",
      "similarity": 0.42611854722101716
    }
  ]
}