{
  "chapter": "المؤمنون",
  "text": "وانا على ان نريك ما نعدهم لقدرون",
  "translations": [
    {
      "translation": "We are certainly capable of letting you see what We have promised them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have certainly the power to make you see what We have promised them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We are able to show you what We warn them against.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have the Power to strike them with torment before your very eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We are Able to show you the promise they are given.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We are able to show you that with which We have threatened them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely We are well able to make you see what We threaten them with.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly, We are able to show thee that We promise them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We are Able to show thee that which We have promised them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly have the power to show you what they have been warned about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily to shew them that wherewith We threaten them We are surely Able.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are indeed able to show you what We promise them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We are certainly able to show thee (in fulfilment) that against which they are warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We are Able to show you (O Muhammad SAW) that with which We have threatened them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We are able to show you that which We promised them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are surely Able to show you what We promise them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We are able to show you what We have promised them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:95] And truly We are able to show you what We promise them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We are Able to show thee) Muhammad (that which We have promised them) of torment on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } قال سبحانه: { إِنَّا عَلَىٰ أَن نُّرِيَكَ مَا نَعِدُهُمْ } من العذاب { لَقَادِرُونَ } [المؤمنون: 95] يعني: إنا قادرون على أن نريك العذاب الموعود إياهم في هذه النشأة، لكنا نؤخرهم ونمهلهم رجاءَ أن يؤمن بعضهم، أو يحصل منهم المؤمنون من نسلهم وذرياتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { وإِنا على أن نُّرِيَكَ ما نَعِدُهم } من العذاب { لقادرون } ، ولكنا نؤخره لعلمنا بأن بعضهم، أو بعض أعقابهم، سيؤمنون، أو: لأنا لا نعذبهم وأنت فيهم، وقيل: قد أراهم ذلك، وهو ما أصابهم يومَ بدر وفتح ومكة، وهو بعيد لأن المبادر أن يكون ما استحقوه من العذاب الموعود عذاباً هائلاً مستأصلاً لا يظهر على يديه صلى الله عليه وسلم للحكمة الداعية إليه، وكانوا يضحكون، استهزاءً بهذا الوعد، وإنكاراً له، فقال لنبيه - عليه الصلاة والسلام -: { ادفع بالتي هي أحسنُ السيئةَ } أي: ادفع الخصلة السيئة بالخصلة التي هي أحسن، وهو الصفح عنها والإحسان في مقابلتها، لكن بحيث لا يؤدي إلى وَهَنٍ في الدين وإهانةٍ له\n وقيل: السيئة: الشرك، والتي هي أحسن: كلمة التوحيد، وقيل: السيئة: المنكر، والتي هي أحسن: النهي عنه، وقيل: هي منسوخة بآية السيف، وقيل: محكمة إذ المداراة مأمور بها\n قال ابن عطية: أمر بمكارم الأخلاق، وما كان منها بهذا المعنى، فهو محكم باق في الأمة أبداً، وما كان بمعنى المواعدة فمنسوخ بآية القتال\n هـ\n وهذا التركيب أبلغ من \" ادفع بالحسنة السيئة \" لما فيه من التنصيص على التفضيل، وتقديم الجار والمجرور على المفعول للاهتمام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:42",
      "similarity": 0.7538482293818918
    },
    {
      "verse": "77:22",
      "similarity": 0.48329652301056136
    },
    {
      "verse": "85:2",
      "similarity": 0.47278523289612123
    },
    {
      "verse": "86:8",
      "similarity": 0.4674412855314192
    },
    {
      "verse": "51:5",
      "similarity": 0.4660507556701212
    }
  ]
}