{
  "chapter": "المؤمنون",
  "text": "قل رب اما ترينى ما يوعدون",
  "translations": [
    {
      "translation": "Say: 'My Lord, if You let me see what they have been promised,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O Lord, if I am made to see what has been promised them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pray, (O Muhammad): \"My Lord, if You should bring the scourge of which they had been warned in my presence,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Lord, if you will afflict them with punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pray, “My Lord! If You show me the promise they are given,”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"My Lord! If You would show me that with which they are threatened, \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O my Lord! if Thou shouldst make me see what they are threatened with:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O my Lord, if Thou shouldst show me that they are promised,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: My Lord! If Thou shouldst show me that which they are promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pray, \"Lord, if you would show me that [the punishment] of which they have been warned,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou; my Lord! if Thou wilt shew me that wherewith they are threatened.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘My Lord! If You should show me what they are promised,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O my Lord! if Thou wilt show me (in my lifetime) that which they are warned against,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \" My Lord! If You would show me that with which they are threatened (torment),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Lord, if You should show me that which they are promised,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “My Lord, if You would show me what they are promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"My Lord, if You should show me that which they are promised,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:93] Say: ‘My Lord! If (immā, this contains an assimilation of the conditional particle in with the extra mā) You should show me what they are promised, in the way of chastisement, that it is true, by their being slain at Badr,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (My Lord!) my Lord! (If Thou shouldst show me that which they are promised) of chastisement,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } يا أكمل الرسل مستعيذاً بالله من شر ما سيلحق لأولئك المعاندين المبطلين: { رَّبِّ } يا من رباني بمزيد اللطف والإحسان { إِمَّا تُرِيَنِّي } أي: أن تحققَ وتقررَ عنك يا مولاي إراءتك إياي { مَا يُوعَدُونَ } [المؤمنون: 93] أولئك المسرفون المشركون من أشد العذاب والنكال في العاجل والآجل؛ ليكون بسبب عبرتي وتذكيري من أحوالهم\n\n\n\n\n{ رَبِّ فَلاَ تَجْعَلْنِي فِي ٱلْقَوْمِ ٱلظَّالِمِينَ } [المؤمنون: 94] مقارناً لهم معدوداً من عدادهم ملحقاً بي ما سيلحقهم من أنواع العذاب الصوري والمعنوي، الدنيوي والأخروي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { قل ربّ إِما تُرِيَنَّي } أي: إذا كان لا بد أن تريني ما يوعدون من العذاب المستأصل في الدنيا أو عذاب الآخرة، { ربِّ فلا تجعلني في القوم الظالمين } أي: قريباً لهم فيما هم فيه من العذاب، وفيه إيذان بفظاعة ما وُعدوه من العذاب، وأنه يجب أن يستعيذ منه مَن لا يكاد أن يحيق به، وردٍّ لإنكارهم إياه واستعجالهم على طريقة الاستهزاء، وقيل: أمر به صلى الله عليه وسلم هضماً لنفسه، وقيل: إن شؤم الكفرة قد يحيق بمن وراءهم كقوله تعالى:\n\n[الأنفال: 25] إلخ، ورُوي عن الحسن أنه - تعالى - أخبر نبيه صلى الله عليه وسلم بأن في أمته نقمة، ولم يطلعه على وقتها، فأمر بهذا الدعاء ويجوز أن يسأل النبيُّ المعصوم ربه ما علم أنه يفعله، وأن يستعيذ به مما علم أنه لا يفعله إظهاراً للعبودية وتواضعاً لربه\n والفاء: جواب \" إما \" الشرطية، أي: إن نزلت بهم النقمة فاجعلني خارجاً عنهم، وتكرير النداء، وتصدير كل من الشرط والجزاء به - أي: بالدعاء - لإبراز كمال الضراعة والابتهال",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:115",
      "similarity": 0.7673777895186942
    },
    {
      "verse": "76:3",
      "similarity": 0.7304115708643271
    },
    {
      "verse": "20:65",
      "similarity": 0.7295253736841605
    },
    {
      "verse": "40:77",
      "similarity": 0.7164810427500704
    },
    {
      "verse": "10:46",
      "similarity": 0.6967409530256474
    }
  ]
}