{
  "chapter": "المؤمنون",
  "text": "حتى اذا جاء احدهم الموت قال رب ارجعون",
  "translations": [
    {
      "translation": "When death comes to one of them, he says, 'My Lord, send me back again.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(But the unbelievers will persist) until when death comes to one of them he will say: \"O Lord, send me back again\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They shall persist in their deeds) until when death comes to anyone of them he will say: \"My Lord, send me back to the world\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When death approaches one of the unbelievers, he says, \"Lord, send me back again\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when death comes to one* of them, he says, “O my Lord, send me back!” (The disbelievers)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when death comes to one of them, he says: \"My Lord! Send me back,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when death overtakes one of them, he says: Send me back, my Lord, send me back;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when death comes to one of them, he says, 'My Lord, return me;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when death cometh unto one of them, he saith: My Lord! Send me back,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When death comes to any of them, he says, \"My Lord, send me back\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "lt ceaseth not until when death cometh to one of them, and he saith: my Lord! send me back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When death comes to one of them, he says, ‘My Lord! Take me back,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(In Falsehood will they be) Until, when death comes to one of them, he says: \"O my Lord! send me back (to life),-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when death comes to one of them (those who join partners with Allah), he says: \"My Lord! Send me back,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when death comes to one of them he says: 'My Lord, let me go back,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when death comes to one of them, he says, “My Lord, send me back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[For such is the state of the disbelievers], until, when death comes to one of them, he says, \"My Lord, send me back\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[23:99] Until (hattā is for inceptiveness) when death comes to one of them, and he sees his place in the Fire and his [would-be] place in Paradise, had he been a believer, he says, ‘My Lord! Send me back (arji‘ūn, the plural [person] is [used] to indicate the gravity [of the plea]),\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Until, when death) the angels of death and his helpers (cometh unto one of them) i.e. the disbelievers of Mecca, (he saith: My Lord! Send me back) to the life of the world,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومصرون على ما هم عليه من الشرك والكفر { حَتَّىٰ إِذَا جَآءَ أَحَدَهُمُ ٱلْمَوْتُ } وعاين من أمارات النشأة الأخرى\n تنبيه حينئذٍ يقبح صنائعه التي أتى بها في النشأة الأولى { قَالَ } حينئذٍ متضرعاً إلى الله نادماً متمنياً متحسراً: { رَبِّ ٱرْجِعُونِ } [المؤمنون: 99] بفضلك وجودك إلى النشأة الأولى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولا تزال الكفرة تصف الحق بما لا يليق به من الشرك، { حتى إذا جاء أحدَهم الموتُ } أي: لا يزالون مشركين حتى يموتوا، فحتى، هنا، ابتدائية، دخلت على جملة الشرط، وهي متعلقة بيصفون، وما بينهما اعتراض مؤكد للإغضاء، لكن لا بمعنى أنه العامل فيه لفساد المعنى، بل بمعنى أنه معمول لمحذوف دل عليه ذلك، أي: تنزيهاً له تعالى عما يصفون، ويستمرون على الوصف المذكور، حتى إذا جاء أحداً منهم الموت الذي لا مرد له، وظهرت له أحوال الآخرة، { قال } تحسراً على ما فَرَّطَ فيه من الإيمان والطاعة: { ربِّ ارجعون } أي: ردني إلى الدنيا، والواو لتعظيم المخاطب، كخطاب الملوك، { لعلي أعملُ صالحاً فيما تركت } أي: في الإيمان الذي تركته، أو في الموضع الذي تركت فيه الإيمان والطاعة وهو الدنيا لأنه ترك الدنيا وصار إلى العقبى\n قال قتادة: ما تمنى أن يرجع إلى أهل ولا عشيرة، ولكن ليتدارك ما فرط\n وعنه، صلى الله عليه وسلم أنه قال:\n\n \" إِذَا عَايَنَ المؤمن المَلائِكَةَ قَالُوا له: نُرجِعُكَ إلى الدُّنْيا؟ فَيَقُولُ: إِلَى دارِ الهُمومِ والأحْزانِ؟ بَلْ قُدُوماً إلى اللهِ تبارك، وتعالى، وأمَّا الكافر فَيقُولُ: ارجعون لعلي أعملَ صالحاً\n\n\n \" \n\nوقال القرطبي: ليس سؤالُ الرجعة مختصاً بالكافر، فقد يسألها المؤمن، كما في آخر سورة المنافقين، ودلت الآية على أن أحداً لا يموت حتى يعرف: أهو من أولياء الله أم من أعداء الله، ولولا ذلك لما سأل الرجعة، فيعلم ذلك قبل نزول الموت وذواقه\n هـ\n قال المحشي الفاسي: ولعل محمل الحديث في المؤمن الكامل غير المقصِّر، والآية في غيره\n والله أعلم\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:56",
      "similarity": 0.4842360711621078
    },
    {
      "verse": "112:1",
      "similarity": 0.4458129566677628
    },
    {
      "verse": "24:28",
      "similarity": 0.44341620155590555
    },
    {
      "verse": "74:35",
      "similarity": 0.386624866901891
    },
    {
      "verse": "96:8",
      "similarity": 0.3851206633567633
    }
  ]
}