{
  "chapter": "النور",
  "text": "لولا اذ سمعتموه ظن المؤمنون والمؤمنت بانفسهم خيرا وقالوا۟ هذا افك مبين",
  "translations": [
    {
      "translation": "Why, when you heard it, did you not, as men and women of the muminun, instinctively think good thoughts and say, 'This is obviously a lie'?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did the faithful men and women not think well of their people when they heard this, and said: \"This is a clear lie?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you heard of it, why didn't the Believing men and the Believing women have a good opinion of themselves, and why did they not say, \"This is a manifest slander?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that on your hearing this report, the believing men and woman among you had a favorable attitude towards it, and had said, \"This report is clearly false\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why was it not that the believing men and women, when you heard it, thought good of their own people, and had said, “This is a clear accusation”?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why then, did not the believers, men and women, when you heard it, think good of their own people and say: \"This is an obvious lie\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did not the believing men and the believing women, when you heard it, think well of their own people, and say: This is an evident falsehood?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, when you heard it, did the believing men and women not of their own account think good thoughts, and say, 'This is a manifest calumny'?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did not the believers, men and women, when ye heard it, think good of their own own folk, and say: It is a manifest untruth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you heard of it, why did not the believing men and believing women think well of their own people, and say, \"This is a manifest slander?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore, when ye heard it, did not the believing men and believing women imagine best of their own people and say: this is a calumny manifest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you [first] heard about it, why did not the faithful, men and women, think well of their folks, and say, ‘This is an obvious calumny’?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did not the believers - men and women - when ye heard of the affair,- put the best construction on it in their own minds and say, \"This (charge) is an obvious lie\"?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why then, did not the believers, men and women, when you heard it (the slander) think good of their own people and say: \"This (charge) is an obvious lie?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had you heard it, and the believing men and women, thought good thoughts about one another said: 'This is a clear falsehood'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, when you heard about it, the believing men and women did not think well of one another, and say, “This is an obvious lie”?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, when you heard it, did not the believing men and believing women think good of one another and say, \"This is an obvious falsehood\"?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:12] Why, when you [first] heard about it, did the believing men and women not think good of themselves, that is, [why did] some [not] think good of others, and say, ‘This is a manifest calumny?’, [this is] a patent lie? (there is a shift here in the address from the second to the third person), in other words, [why did] you [not] assume [good of them], O band [of believers] and say:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Why did not the believers, men and women, when you heard it) i.e. the slander of 'A'ishah and Safwan, (think good of their own folk) think good of 'A'ishah as they would think good of their mothers; (and say: It) their slander (is a manifest untruth) is a manifest lie?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ظَنَّ ٱلْمُؤْمِنُونَ وَٱلْمُؤْمِنَاتُ بِأَنْفُسِهِمْ خَيْراً } معناه أهل دِينِهِم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"The believing men and women have good in themselves\" means that the people of their religion are good.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n حيث قال: { لَّوْلاۤ إِذْ سَمِعْتُمُوهُ } أي: الإفكَ أيها الآفكومن لم تظنوا بالمذروفيْن خيراً كما { ظَنَّ ٱلْمُؤْمِنُونَ وَٱلْمُؤْمِنَاتُ بِأَنْفُسِهِمْ خَيْراً وَ } لَمْ تقولوا كما { قَالُواْ } أي: المؤمنون: { هَـٰذَآ إِفْكٌ مُّبِينٌ } [النور: 12] وكذبُ عظيمُ وفريةُ بلا مريةٍ\n إذ ساحة عصمتها وطهارة ذيلها ونجابة طينتها أجلُّ وأعلى من أن يُفْترى عليها أمثال هذه المفتريات الباطلة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال ابن هشام: وقد يلي حرف التخصيص اسم معلق بفعل\n إما بمضمر\n نحو: \" فهَلاَّ بكْراً تُلاعِبُها وتُلاعِبُك \" أي: فهلا تزوجت\n أو مؤخراً نحو: لولا إذ سمعتموه قلتم\n\n أي: فهلا قلتم إذ سمعتموه\n هـ\n وإليه أشار في الخلاصة بقوله:\nيقول الحق جل جلاله: { لولا إذْ سمعتموه } أي: الإفك { ظنَّ المؤمنون والمؤمناتُ بأنفسهم خيراً } بالذين هم منهم لأن المؤمنين كنفس واحدة\n كقوله:\n[الحجرات: 11] أي: هلا ظنوا بإخوانهم خيراً: عَفَافاً وصلاحاً\n وذلك نحو ما يُروى عن عمر رضي الله عنه قال لرسول الله صلى الله عليه وسلم: أنا قاطع بكذب المنافقين لأن الله تعالى عصمك عن وقوع الذباب على جلدك\n لئلا يقع على النجاسات فَتُلَطَّخَ بها\n فإذا عصمك من ذلك فكيف لا يعصمك من صحبة من تكون ملطخة بهذه الفاحشة‍‍!\n وقال عثمان رضي الله عنه: ما أوقع ظلك على الأرض لئلا يضع إنسان قدمه عليه فلَمَّا لم يُمكِّن أحداً من وضع القدم على ظلك\n فكيف يُمكِّن أحداً من تلويث عرض زوجتك!\n وكذا قال عليّ رضي الله عنه: إن جبريل أخبرك أنَّ على نَعْلِك قذراً\n وأمرك بإخراج النعل عن رجلك\n بسبب ما التصق به من القذر\n فكيف لا يأمرك بإخراجها\n على تقدير أن تكون متلطخة بشيء من الفواحش؟ قال النسفي\n وروي أن أبا أيوب الأنصاري قال لامرأته: ألا ترين ما يقال في عائشة؟ فقالت: لو كُنْتَ بدل صفوان أَكُنْتَ تخُون رسول الله صلى الله عليه وسلم؟ فقال: لا\n قالت: ولو كنتُ أنا بدل عائشة مَا خُنْتُ رسول الله\n فعائشة خير مني\n وصفوان خير منك\n وفي رواية ابن إسحاق: قالت زوجة أبي أيوب لأبي أيوب: ألا تسمع ما يقول الناس في عائشة؟ قال: بلى\n وذلك الكذب\n أَكُنْتِ فاعلة ذلك يا أم أيوب؟ قالت: لا والله\n فقال: عائشة خير منك\n سبحان الله\n هذا بهتان عظيم\n فنزل: { لَّوْلاَ إِذْ سَمِعْتُمُوهُ }\n\n\n الآية\n وإنما عدل عن الخطاب إلى الغيبة\n وعن الضمير الظاهر\n ولم يقل: ظننتم بأنفسكم خيراً\n وقلتم ليبالغ في التوبيخ بطرق الالتفات\n وليدل التصريح بلفظ الإيمان على أن المؤمن لا يسيء الظن بأحد من المؤمنين\n { وقالوا } عند سماع هذه الفرية: { هذا إفكٌ مبين } كذب ظاهر لا يليق بمنصب الصدّيقة بنت الصدّيق\n { لولا جاؤوا عليه بأربعةِ شهداءَ } هلاَّ جاء الخائضون بأربعة شهداء على ما قالوا { فإِذْ لم يأتوا بالشهداءَ } \n ولم يقل: \" بهم \" لزيادة التقرير",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:9",
      "similarity": 0.5295521820301495
    },
    {
      "verse": "37:86",
      "similarity": 0.47407812985529996
    },
    {
      "verse": "46:28",
      "similarity": 0.46766103562456757
    },
    {
      "verse": "46:22",
      "similarity": 0.45658726767371577
    },
    {
      "verse": "46:11",
      "similarity": 0.4526195211027585
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/24:12.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/24:12.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/24:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}