{
  "chapter": "النور",
  "text": "اذ تلقونه بالسنتكم وتقولون بافواهكم ما ليس لكم به علم وتحسبونه هينا وهو عند الله عظيم",
  "translations": [
    {
      "translation": "You were bandying it about on your tongues, your mouths uttering something about which you had no knowledge. You considered it to be a trivial matter, but, in Allah's sight, it is immense.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you talked about it and said what you did not know, and took it lightly -- though in the sight of God it was serious --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Just think how erroneous you were,) when you passed this lie on from one tongue to the other and uttered with your mouths that of which you had no knowledge. You took it as a trifling matter whereas it was a grave offence in the sight of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your tongues moved and your mouths spoke of something of which you had no knowledge. You thought it to be a trivial matter, while in the eyes of God it is blasphemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you rumoured with your tongues after hearing such matters, and uttered with your mouths about which you had no knowledge, and you considered it light; and that, in the sight of Allah, is very great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were propagating it with your tongues, and uttering with your mouths that whereof you had no knowledge, you counted it a little thing, while with Allah it was very great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you received it with your tongues and spoke with your mouths what you had no knowledge of, and you deemed it an easy matter while with Allah it was grievous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you received it on your tongues, and were speaking with your mouths that whereof you had no knowledge, and reckoned it a light thing, and with God it was a mighty thing --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye welcomed it with your tongues, and uttered with your mouths that whereof ye had no knowledge, ye counted it a trifle. In the sight of Allah it is very great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were spreading it with your tongues and saying with your mouths things of which you had no knowledge, you considered it to be a trivial matter, but, in God's sight, it was very serious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye were publishing it with your tongues and saying that with your mouths of which ye had no knowledge. Ye deemed it light, and it was with Allah mighty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when you were receiving it on your tongues, and were mouthing something of which you had no knowledge, supposing it to be a light matter, while it was a grave [matter] with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, ye received it on your tongues, and said out of your mouths things of which ye had no knowledge; and ye thought it to be a light matter, while it was most serious in the sight of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were propagating it with your tongues, and uttering with your mouths that whereof you had no knowledge, you counted it a little thing, while with Allah it was very great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You carried with your tongues and uttered with your mouths what you did not know. You have thought it a trifle, but before Allah it was a mighty thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you rumored it with your tongues, and spoke with your mouths what you had no knowledge of, and you considered it trivial; but according to God, it is serious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you received it with your tongues and said with your mouths that of which you had no knowledge and thought it was insignificant while it was, in the sight of Allah, tremendous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:15] when you were receiving it [welcomingly] with your tongues, that is to say, [when] you were reporting it one from the other (one of the two letters tā’ has been omitted from the verb [tatalaqqawnahu, ‘you were receiving it’]; idh, ‘when’, is dependent because of massakum, ‘befallen you’, or afadtum, ‘engaged in’) and were uttering with your mouths that whereof you had no knowledge, supposing it to be a light matter, a sinless [act], while with God it was grave, in sinfulness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When ye welcomed it with your tongues) when you related the slander to each other, (and uttered with your mouths that whereof ye had no knowledge) proof or clarification, (ye counted it) i.e. the slander of 'A'ishah (a trifle) an insignificant sin. (In the sight of Allah it is very great) in terms of punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ تَلَقَّوْنَهُ بِأَلْسِنَتِكُمْ } معناه تَقبلُونهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when you receive it with your tongues, accept it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِذْ تَلَقَّوْنَهُ } مع نهاية كراهته وسماجته { بِأَلْسِنَتِكُمْ } سائلاً بعضُكم بعضاً متلقياً على قبوله وسماعه { وَتَقُولُونَ بِأَفْوَاهِكُمْ مَّا لَّيْسَ لَكُمْ بِهِ عِلْمٌ } لا ظنُ ولا يقينُ بل جهلُ وتخمينُ\n { وَ } مع عظم هذا الجرم عند الله { تَحْسَبُونَهُ } أيها الحمقى المسرفون { هَيِّناً } سهلاً يسيراً\n لا يترتب عليه شيءُ من العذاب والعقاب { وَ } الحال أنه { هُوَ } أي: رمي تلك البريئة العفيفة { عِندَ ٱللَّهِ } المطلع لعفتها وعصمتها { عَظِيمٌ } [النور: 15] فظيعُ في غاية العظمة والفظاعة\n مستجلبُ لأنواع العذاب وأشد النكال\n إذ الافتراء بآحاد الناس يوجب أشدَّ العذاب وأسوأ العقاب\n فكيف بأفضلهم وأشرفهم!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إذْ تلقَّوْنه } أي: لمسكم العذاب العظيم وقت تلقيه إياكم من المخترعين له، يقال: تلقى القول، وتلقنه، وتلقفه، بمعنى واحد، غير أن التلفق: فيه معنى الخطف والأخذ بسرعة، أي: إذ تأخذونه { بألسنتكم } بأن يقول بعضُكم لبعض: هل بلغك حديث عائشة، حتى شاع فيما بينكم وانتشر، فلم يبق بيت ولا نادٍ إلا طار فيه\n { وتقولون بأفواهكم ما ليس لكم به علمٌ } أي: قولاً لا حقيقة له، وقيّده بالأفواه، مع أن الكلام لا يكون إلا بالفم لأن الشيء المعلوم يكون في القلب، ثم يترجم عنه اللسان، وهذا الإفك ليس إلا قولاً يدور فيه الأفواه، من غير ترجمة عن علم به في القلب\n { وتحسبونه هيِّناً } أي: وتظنون أن خوضكم في عائشة سَهْلٌ لا تبعة فيه، { وهو عند الله عظيم } أي: والحال أنه عند الله كبير، لا يُقادر قدره في استجلاب العذاب\n جزع بعض الصالحين عند الموت، فقيل له في ذلك، فقال: أخاف ذنباً لم يكن مني على بال، وهو عند الله عظيم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:5",
      "similarity": 0.48676670058432414
    },
    {
      "verse": "3:167",
      "similarity": 0.3526944852927689
    },
    {
      "verse": "36:65",
      "similarity": 0.3276008116981454
    },
    {
      "verse": "13:14",
      "similarity": 0.31967243858553895
    },
    {
      "verse": "26:84",
      "similarity": 0.319494527656054
    }
  ]
}