{
  "chapter": "النور",
  "text": "لولا جاءو عليه باربعة شهداء فاذ لم ياتوا۟ بالشهداء فاو۟لئك عند الله هم الكذبون",
  "translations": [
    {
      "translation": "Why did they not produce four witnesses to it? Since they did not bring four witnesses, in Allah's sight, they are liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not bring four witnesses (in support of their charge)? And since they did not bring the four witnesses they are themselves liars in the sight of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did the slanderers not bring four witnesses (to prove their charge)? Now that they have not brought witnesses, they themselves are liars in the sight of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that they had brought four witness to testify to their report. Since they brought none, they are liars before God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not bring four witnesses upon it? Since they did not bring witnesses, they themselves are liars before Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not produce four witnesses against him Since they have not produced witnesses! Then with Allah, they are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not bring four witnesses of it? But as they have not brought witnesses they are liars before Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not bring four witnesses against it? But since they did not bring the witnesses, in God's sight they are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not produce four witnesses? Since they produce not witnesses, they verily are liars in the sight of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not produce four witnesses? If they could not produce any witnesses, they were indeed liars in the sight of God!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore did they not bring four witnesses thereof? Then when they brought not the witnesses, those! with Allah they are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not bring four witnesses to it? So when they could not bring the witnesses, they are liars in Allah’s sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not bring four witnesses to prove it? When they have not brought the witnesses, such men, in the sight of Allah, (stand forth) themselves as liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not produce four witnesses? Since they (the slanderers) have not produced witnesses! Then with Allah they are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, did they not bring four witnesses against it? But since they did not bring the witnesses, before Allah they are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they not bring four witnesses to testify to it? If they fail to bring the witnesses, then in God’s sight, they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did they [who slandered] not produce for it four witnesses? And when they do not produce the witnesses, then it is they, in the sight of Allah, who are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:13] Why did they, that is, this band [of accusers], not produce four witnesses to it?, who had witnessed it. And since they did not produce the witnesses, those, in God’s sight, in His judgement, they are liars, in this [matter].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَوْلَا جَاءُوا عَلَيْهِ بِأَرْبَعَةِ شُهَدَاءَ فَإِذْ لَمْ يَأْتُوا بِالشُّهَدَاءِ فَأُولَئِكَ عِنْدَ اللَّهِ هُمُ الْكَاذِبُونَ (13)استئناف ثان لتوبيخ العُصبة الذين جاءوا بالإفك وذم لهم . و ( لولا) هذه مثل ( لولا) السابقة بمعنى ( هلا) .والمعنى : أن الذي يخبر خبراً عن غير مشاهدة يجب أن يستند في خبره إلى إخبار مشاهد ، ويجب كون المشاهدين المخبرين عدداً يفيد خبرهم الصدق في مثل الخبر الذي أخبروا به؛ فالذين جاءوا بالإفك اختلقوه من سوء ظنونهم فلم يستندوا إلى مشاهدة ما أخبروا به ولا إلى شهادة من شاهدوه ممن يقبل مثلهم فكان خبرهم إفكاً . وهذا مستند إلى الحكم المتقرر من قبل في أول السورة بقوله تعالى : { والذين يرمون المحصنات ثم لم يأتوا بأربعة شهداء فاجلدوهم ثمانين جلدة } \\[ النور : 4 \\] فقد علمت أن أول سورة النور نزل أواخر سنة اثنتين أو أوائل سنة ثلاث قبل استشهاد مرثد بن أبي مرثد .وصيغة الحصر في قوله : { فأولئك عند الله هم الكاذبون } للمبالغة كأن كذبهم لقوته وشناعته لا يعد غيرهم من الكاذبين كاذباً فكأنهم انحصرت فيهم ماهية الموصوفين بالكذب .واسم الإشارة لزيادة تمييزهم بهذه الصفة ليحذر الناس أمثالهم .والتقييد بقوله : { عند الله } لزيادة تحقيق كذبهم ، أي هو كذب في علم الله فإن علم الله لا يكون إلا موافقاً لنفس الأمر . وليس المراد ما ذكره كثير من المفسرين أن معنى { عند الله } في شرعه لأن ذلك يصيره قيداً للاحتراز . فيصير المعنى : هم الكاذبون في إجراء أحكام الشريعة . وهذا ينافي غرض الكلام ويجافي ما اقترن به من تأكيد وصفهم بالكذب؛ على أن كون ذلك هو شرع الله معلوم من قوله : { والذين يرمون المحصنات ثم لم يأتوا بأربعة شهداء فاجلودهم ثمانين جلدة } \\[ النور : 4 \\] إلى قوله : { فأولئك عند الله هم الكاذبون } . فمسألة الأخذ بالظاهر في إجراء الأحكام الشرعية مسألة أخرى لا تؤخذ من هذه الآية .\n\n",
      "translations": [
        {
          "translation": "(Why did they not produce four witnesses) four, upright witnesses to support their claim? (Since they produce not witnesses) four witnesses, (they verily are liars in the sight of Allah).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nعصمنا الله عما لا يرضى منه سبحانه { لَّوْلاَ جَآءُوا } أي: الآفكون المسرفون وأتوا { عَلَيْهِ } أي: على إفكهم هذا { بِأَرْبَعَةِ شُهَدَآءَ } عدولاً لصدقوا فيما قالوا { فَإِذْ لَمْ يَأْتُواْ بِالشُّهَدَآءِ } الأربع العدول { فَأُوْلَـٰئِكَ } الآفكون المفترون { عِندَ ٱللَّهِ } المطلع لضمائرهم { هُمُ ٱلْكَاذِبُونَ } [النور: 13] المقصورون على الكذب\n يجازيهم سبحانه على مقتضى ما افتروا من الكذب والبهتان\n سيما مع أهل البيت\n أهل العصمة والكرامة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأولئك } الخائضون { عند الله } أي: في حُكمه وشرعه { هم الكاذبون } الكاملون في الكذب\n المستحقون لإطلاق هذا الاسم عليهم دون غيرهم\n والله تعالى أعلم\n\nالإشارة: حُسن الظن بعباد الله من أفضل الخصال عند الله\n ولا سيما ما فيه حرمة من حُرَم الله\n قال القشيري على الآية: عاتبهم على المبادرة إلى الاعتراض وتَرْكِ الإعراضِ عن حُرمة بيت نبيهم\n ثم قال: وسبيلُ المؤمن ألا يستصغر في الوفاق طاعة\n ولا في الخلاف زَلَّةً\n فإِنَّ تعظيمَ الأمْرِ بتعظيم الآمرِ\n وإن الله لينتقم لأوليائه ما لا ينتقم لنفسه\n ولا سيما ما تعلق به حق الرسول - عليه الصلاة والسلام - فذلك أعظم عند الله\n ولذلك بالغ في التوبيخ على ما أقدموا عليه\n مما تأذى به الرسول\n وقلوب آل الصدِّيق\n وقلوب المخلصين من المؤمنين\n هـ\n ثم قال تعالى: { وَلَوْلاَ فَضْلُ ٱللَّهِ عَلَيْكُمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:51",
      "similarity": 0.48382086808978464
    },
    {
      "verse": "4:15",
      "similarity": 0.36995573782401725
    },
    {
      "verse": "24:6",
      "similarity": 0.35685323255833706
    },
    {
      "verse": "24:8",
      "similarity": 0.33533712726735526
    },
    {
      "verse": "29:50",
      "similarity": 0.3026230993989347
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024013.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024013.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}