{
  "chapter": "النور",
  "text": "ويبين الله لكم الءايت والله عليم حكيم",
  "translations": [
    {
      "translation": "Allah makes the Signs clear to you and Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God explains His commands to you clearly, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah makes His Revelations clear to you, and He is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God explains to you His revelations. He is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah clearly explains the verses for you; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah makes the Ayat plain to you, and Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah makes clear to you the communications; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God makes clear to you the signs; and God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He expoundeth unto you the revelations. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God explains the commandments to you. God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah expoundeth unto you the revelations and Allah is Knowing, wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah clarifies the signs for you, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah makes the Signs plain to you: for Allah is full of knowledge and wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah makes the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) plain to you, and Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah makes plain to you His verses, and Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God explains the Verses to you. God is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah makes clear to you the verses, and Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:18]   And God clarifies for you the signs, through commands and prohibitions, and God is Knower, of what He enjoins and what He prohibits, Wise, therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He expoundeth unto you His revelations) detailing the commands and prohibitions. (Allah is Knower) He knows what you say, (Wise) regarding the legal punishments He imposes on you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد صدور أمثال هذه الخرافات من أهل السرف والإفساد { يُبَيِّنُ ٱللَّهُ } المدبر { لَكُمُ ٱلآيَاتِ } الدالة على الصفح والإعراض عن أمثال هذه الافتراءات الهاتكة لأستار محارم الله، سيما مع أكرم عترة حبيبه { وَٱللَّهُ } المصلح لأحوالكم { عَلِيمٌ } بما في ضمائركم وخواطركم { حَكِيمٌ } [النور: 18] في إزالة ما يضركم ويغويكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويُبيِّن الله لكم الآياتِ } الدالة على الشرائع ومحاسن الأدب، دلالة واضحة لتتعظوا وتتأدبوا، أي: ينزلها كذلك ظاهرة مبينة، { والله عليمٌ حكيمٌ } عليم بأحوال مخلوقاته، حكيم في جميع تدابيره وأفعاله، فَأَنَّى يصحُّ ما قيل في حرمة من اصطفاه لرسالته، وبعثه إلى كافة الخلق، ليرشدهم إلى الحق، ويزكيهم ويطهرهم تطهيراً؟ والله تعالى أعلم\n الإشارة: الكلام في الأولياء سم قاتل لأن الله ينتصر لأوليائه لا محالة، فمنهم من ينتصر لهم في الدنيا بإنزال البلايا والمحن في بدنه أو ولده أو ماله، ومنهم من يؤخر عقوبته إلى الآخرة، وهو أقبح\n ومنهم من تكون عقوبته دينية قلبية كقساوة القلب وجمود العين، وتعويق عن الطاعة، ووقوع في ذنب، أو فترة في همة، أو سلب لذاذة خدمة أو معرفة، وهذه أقبح العقوبة، والعياذ بالله\n ثم أوعد من كان يشيع حديث الإفك، فقال: { إِنَّ ٱلَّذِينَ يُحِبُّونَ أَن تَشِيعَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:1",
      "similarity": 0.6314875031096583
    },
    {
      "verse": "31:2",
      "similarity": 0.6314875031096583
    },
    {
      "verse": "43:84",
      "similarity": 0.5824344284163592
    },
    {
      "verse": "76:30",
      "similarity": 0.5611342122613194
    },
    {
      "verse": "51:30",
      "similarity": 0.5513314466547957
    }
  ]
}