{
  "chapter": "النور",
  "text": "ان الذين يحبون ان تشيع الفحشة فى الذين ءامنوا۟ لهم عذاب اليم فى الدنيا والءاخرة والله يعلم وانتم لا تعلمون",
  "translations": [
    {
      "translation": "People who love to see filth being spread about concerning those who have iman will have a painful punishment both in this world and the Next World. Allah knows and you do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is painful punishment in this world and the next for those who like that immorality should spread among the believers, for God knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those, who like that indecency should spread among the Believers, they deserve a painful punishment in this world and in the Hereafter, for Allah knows and you do not know (its consequences).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who like to publicize indecency among the believers will face painful torment in this world and in the life to come. God knows what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who wish that slander should spread among the Muslims – for them is a painful punishment in this world and in the Hereafter; and Allah knows, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who like that Fahishah should be circulated among those who believe, they will have a painful torment in this world and in the Hereafter. And Allah knows and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who love that scandal should circulate respecting those who believe, they shall have a grievous chastisement in this world and the hereafter; and Allah knows, while you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who love that indecency should be spread abroad concerning them that believe -- there awaits them a painful chastisement in the present world and the world to come; and God knows, and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who love that slander should be spread concerning those who believe, theirs will be a painful punishment in the world and the Hereafter. Allah knoweth. Ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who desire that indecencies should spread among the believers, will have a painful chastisement in this world and the Hereafter. God knows, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who love that in decency should be propagated regarding those who believe, for them shall be a torment afflictive in the world and the Hereafter. And Allah knoweth, and ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who want indecency to spread among the faithful—there is a painful punishment for them in the world and the Hereafter, and Allah knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who love (to see) scandal published broadcast among the Believers, will have a grievous Penalty in this life and in the Hereafter: Allah knows, and ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who like that (the crime of) illegal sexual intercourse should be propagated among those who believe, they will have a painful torment in this world and in the Hereafter. And Allah knows and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who love that indecency should be broadcast about those who believe theirs is a painful punishment in this world and in the Everlasting Life. Allah knows, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who love to see immorality spread among the believers—for them is a painful punishment, in this life and in the Hereafter. God knows, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who like that immorality should be spread [or publicized] among those who have believed will have a painful punishment in this world and the Hereafter. And Allah knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:19] Truly those who love that indecency should be spread, by the tongue, concerning those who believe, by its being associated with them — and the ones [meant] are the band — theirs will be a painful chastisement in the life of this world, by way of the prescribed [legal] punishment for [false] accusation, and the Hereafter, by way of the Fire, as is God’s due, and God knows, that such [indecency] does not apply in their case, and you, O band [of accusers], as regards the calumny of which you spoke, do not know, whether such [indecency] took place among them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Those) i.e. 'Abdullah Ibn Ubayy and his host (who love that slander should be spread) appear (concerning those who believe) 'A'ishah and Safwan, (theirs will be a painful punishment) by being flogged (in the world and the Hereafter) by being thrown in hell, especially 'Abdullah Ibn Ubayy. (Allah knoweth) that 'A'ishah and Safwan did not commit adultery. (Ye know not) this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تذكيراً لعموم عباده: { إِنَّ } المفسدين المسرفين { ٱلَّذِينَ يُحِبُّونَ } من خبث بواطنهم { أَن تَشِيعَ } تظهر وتنتشر { ٱلْفَاحِشَةُ } الخصلة المذمومة عقلاً وشرعاً { فِي ٱلَّذِينَ آمَنُواْ } أي: بين عموم المؤمنين { لَهُمْ } جزاءً لإشاعتهم وإذاعتم { عَذَابٌ أَلِيمٌ } مؤلمُ مفزعُ { فِي ٱلدُّنْيَا } بالجلد { وَٱلآخِرَةِ } بالنار المحرق الملتهب { وَٱللَّهُ } المطلع لجميع ما جرى في الغيب والشهادة { يَعْلَمُ } قبحَ ما في الإشاعة والإذاعة { وَأَنْتُمْ لاَ تَعْلَمُونَ } [النور: 19] قبحها لذلك تحبون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { إن الذين يُحبون } يريدون { أن تشيعَ الفاحشةُ } أي: تنتشر الخصلة المفرطة في القبح\n وهو الرمي بالزنا\n أو نفس الزنا\n والمراد بشيوعها: شيوع خبرها\n أي: يحبون شيوعها ويتصدون مع ذلك لإشاعتها\n وإنما لم يصرح به اكتفاء بذكر المحبة فإنها مستلزمة له لا محالة\n وهم: عبد الله بن أبيّ وأصحابه ومن تبعهم\n { لهم عذابٌ أليم في الدنيا } بالحدّ والفضيحة والتكذيب\n ولقد ضرب صلى الله عليه وسلم الحدّ كل من رمى عائشة\n وتقدم الخلاف في ابن أُبي\n فقيل: حدَّه\n وقيل: تركه استئلافاً له\n { و } لهم العذاب في { الآخرة } بالنار وغيرها\n إن لم يتوبوا\n { والله يعلم } جميع الأمور\n التي من جملتها: المحبة المذكورة\n { وأنتم لا تعلمون } ما يعلمه تعالى\n بل إنما يعلمون ما ظهر من الأقوال والأفعال المحسوسة\n فابنوا أمركم على ما تعلمونه\n وعاقبوا في الدنيا على ما تشاهدونه من الأحوال الظاهرة\n والله يتولى السرائر\n فيعاقب في الآخرة على ما تُكنه الصدور",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:10",
      "similarity": 0.6319175059552876
    },
    {
      "verse": "37:83",
      "similarity": 0.6318851056924513
    },
    {
      "verse": "54:51",
      "similarity": 0.5926277035680223
    },
    {
      "verse": "6:159",
      "similarity": 0.5428179593965221
    },
    {
      "verse": "30:32",
      "similarity": 0.39910264690445796
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}