{
  "chapter": "النور",
  "text": "ولولا اذ سمعتموه قلتم ما يكون لنا ان نتكلم بهذا سبحنك هذا بهتن عظيم",
  "translations": [
    {
      "translation": "Why did you not say when you heard it: \"It is not for us to speak of it? God preserve us, it is a great calumny!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why did you not, as soon as you heard of it, say, \"It is not proper for us to utter such a thing? Glory be to Allah! This is a great slander.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that on hearing this report, you had said, \"We have nothing to say about it. God forbid! It is a serious accusation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why was it not that, when you heard it, you would have said, “It does not befit us to speak regarding this; Purity is to You, O Allah – this is a great accusation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why did you not, when you heard it, say: \"It is not right for us to speak of this. Glory be to You (O Allah)! This is a great lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why did you not, when you heard it, say: It does not beseem us that we should talk of it; glory be to Thee! this is a great calumny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why, when you heard it, did you not say, 'It is not for us to speak about this; glory be to Thee! This is a mighty calumny'?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefor, when ye heard it, said ye not: It is not for us to speak of this. Glory be to Thee (O Allah)! This is awful calumny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you heard it, why did you not say, \"It is not right for us to speak of this. God forbid! This is a monstrous slander.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wherefore, when ye heard it, did ye not say: it is not for us to speak thereof, hallowed be Thou! that is a slander mighty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why did you not, when you heard it, say, ‘It is not for us to say such a thing. [O Allah!] You are immaculate! This is a monstrous calumny!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why did ye not, when ye heard it, say? - \"It is not right of us to speak of this: Glory to Allah! this is a most serious slander!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why did you not, when you heard it, say? \"It is not right for us to speak of this. Glory be to You (O Allah) this is a great lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you heard it, why did you not say: 'It is not right for us to speak of this. Exaltations to You! This is a mighty slander'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you heard it, you should have said, “It is not for us to repeat this. By Your glory, this is a serious slander.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why, when you heard it, did you not say, \"It is not for us to speak of this. Exalted are You, [O Allah]; this is a great slander\"?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:16] And why, when you heard it, did you not say, ‘It is not for us to speak about this. Glory be to You! — this [exclamation] here is meant to indicate amazement — This is an awful calumny?’, [an awful] lie?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Wherefore, when ye heard it) i.e. the slander of 'A'ishah and Safwan, (said ye not: It is not for us to speak of this) we are not permitted to speak about this lie. (Glory be to Thee (0 Allah); This is awful calumny) this is a great lie. 387\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُلْتُمْ مَّا يَكُونُ لَنَآ أَن نَّتَكَلَّمَ بِهَـٰذَا } معناه ما يَنبغي لَنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْلاۤ إِذْ سَمِعْتُمُوهُ } أولاً أيها الآفكون المفترون { قُلْتُمْ مَّا يَكُونُ } أي: ما يصح ويجوز { لَنَآ أَن نَّتَكَلَّمَ بِهَـٰذَا } الفحش الباطل الكذب الصريح العاطل { سُبْحَانَكَ } نقدسك وننزهك من أن تمكِّن أحداً يفعل، ويقول في حق حليلة حبيبك صلى الله عليه وسلم أمثال هذا الافتراء؛ إذ { هَـٰذَا بُهْتَانٌ عَظِيمٌ } [النور: 16] تبهتُ، وتحيرُ منه العقول، وتضطرب الأسماع، وتتقلقل القلوب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولولا إذْ سَمِعْتُموه } من المخترعين والشائعين له { قُلتم ما يكونُ لنا } ما يمكننا { أن نتكلَّمَ بهذا } ، وما ينبغي أن يصدر عنا، وتوسيط الظروف بين \" لولا \" و \" قلتم \" إشارة إلى أنه كان الواجب أن يُبادروا بإنكار هذا الكلام في أول وقت سمعوه، فلما تأخر الإنكار وبَّخهم عليه، فكان ذكرُ الوقت أَهَمَّ، فقدّم، والمعنى: هلاَّ قُلتم إذ سمعتم الإفك: ما يصح لنا أن نتكلم بهذا، { سبحانك } تنزيهاً لك، وهو تعجبٌ مِنْ عِظَمِ ما فاهوا به\n ومعنى التعجب في كلمة التسبيح: أن الأصل أن يسبح الله عند رؤية العجيب من صنائعه تعالى، ثم كثر حتى استعمل في كل متعجب منه\n أو: تنزيهاً لك أن يكون في حرم نبيك فاجرة، { هذا بهتانٌ عظيم } لعظمة المبهوت عليه، واستحالة صدقه، فإنَّ حقارة الذنوب وعظمتها باعتبار متعلقاتها\n وقال فيما تقدم:\n\n[النور: 12]\n ويجوز أن يكونوا أُمروا بهما معاً، مبالغة في التبري",
      "translations": []
    }
  ]
}