{
  "chapter": "النور",
  "text": "سورة انزلنها وفرضنها وانزلنا فيها ءايتۭ بينت لعلكم تذكرون",
  "translations": [
    {
      "translation": "A sura We have sent down and imposed. We have sent down Clear Signs in it so that hopefully you will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "WE HAVE REVEALED this Surah and made it obligatory as We have sent down clear injunctions in it that you may be warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Surah which We have sent down and We have made it mandatory, and We have sent down clear Commandments in it so that you may learn lessons.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a chapter which We have revealed to you and made obligatory for you to follow its guidance. We have revealed clear verses in it so that perhaps you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a chapter which We have sent down and decreed its commands, and in which We have sent down clear verses, in order that you may ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Surah which We have sent down and which We have enjoined (Faradnaha), and in it We have revealed manifest Ayat, that you may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) a chapter which We have revealed and made obligatory and in which We have revealed clear communications that you may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sura that We have sent down and appointed; and We have sent down in it signs, clear signs, that haply you will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Here is) a surah which We have revealed and enjoined, and wherein We have revealed plain tokens, that haply ye may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a chapter which We have revealed and which We have made obligatory; We have sent down clear revelations in it, so that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a chapter which We have sent down, and which We have ordained; and therein We have sent down revelations manifest, that haply ye may be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] a surah which We have sent down and prescribed, and We have sent down in it manifest signs so that you may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sura which We have sent down and which We have ordained in it have We sent down Clear Signs, in order that ye may receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) a Surah (chapter of the Quran) which We have sent down and which We have enjoined, (ordained its legal laws) and in it We have revealed manifest Ayat (proofs, evidences, verses, lessons, signs, revelations lawful and unlawful things, and set boundries of Islamic Religion), that you may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a chapter which We have sent down and appointed; and in it We have sent down clear verses in order that you will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A chapter that We have revealed, and made obligatory, and revealed in it clear Verses, that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] a surah which We have sent down and made [that within it] obligatory and revealed therein verses of clear evidence that you might remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:1] This is, a sūra which We have revealed and prescribed (read faradnāhā, or [the intensive form] farradnāhā, on account of the large number of prescriptions contained in it) and wherein We have revealed manifest signs, [signs] containing clear indications, that perhaps you might remember (tadhakkarūna: the second tā’ [of tatadhakkarūna] has been assimilated with the dhāl), that you might be admonished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "385 And from his own narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying ((Here is) a surah which We have revealed): '((Here is) a surah which We have revealed) He says: We sent Gabriel with it (and enjoined) We exposited in it the lawful and the unlawful, (and wherein We have revealed plain tokens) containing commands and prohibitions, obligations and legal punishments, (that haply ye may take heed) that you may take admonition in the commands and prohibitions, so do not suspend the application of legal punishments.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ الذين جاؤوا بالإفك } إلى قوله: { لهم مغفرة ورزق كريم } إنما عظم أمر الإفك وغلظ في الوعيد عليه بما لم يغلظ في غيره من المعاصي\n وبالغ في العقاب عليه بما لم يبالغ فيه في باب الزنا وقتل النفس المحرّمة لأن عظم الرذيلة وكبر المعصية إنما يكون على حسب القوّة التي هي مصدرها\n وتتفاوت حال الرذائل في حجب صاحبها عن الحضرة الإلهية والأنوار القدسيّة وتوريطه في المهالك الهيولانية والمهاوي الظلمانية على حسب تفاوت مباديها\n فكلما كانت القوة التي هي مصدرها ومبدؤها أشرف\n كانت الرذيلة الصادرة منها أردأ وبالعكس\n لأن الرذيلة ما تقابل الفضيلة\n فلما كانت الفضيلة أشرف كان ما يقابلها من الرذيلة أخسّ\n والإفك رذيلة القوّة الناطقة التي هي أشرف القوى الإنسانية\n والزنا رذيلة القوّة الشهوانية\n والقتل رذيلة القوة الغضبية فبحسب شرف الأولى على الباقيتين تزداد رداءة رذيلتها\n وذلك أن الإنسان إنما يكون بالأولى إنساناً وترقيه إلى العالم العلوي\n وتوجهه إلى الجناب الإلهي\n وتحصيله للمعارف والكمالات\n واكتسابه للخيرات والسعادات\n إنما يكون بها\n فإذا فسدت بغلبة الشيطنة عليها واحتجب عن النور باستيلاء الظلمة\n حصلت الشقاوة العظمى وحقّت العقوبة بالنار وهو الرين والحجاب الكلي لقوله:\n[المطففين\n الآيات:14-15] ولهذا وجب خلود العقاب ودوام العذاب بفساد الاعتقاد دون فساد الأعمال\n[النساء\n الآية:48]\n وأما الباقيتان فرذيلة كل منهما إنما تعود بظهورها على النطقية الملكية ثم ربما محيت بانقهارها وتسخرها لها عند سكون هيجانها وفتور سلطانها باستيلاء غلبة النور وتسلّطها عليها بالطبع\n كحال النفس اللوّامة عند التوبة والندامة\n وربما بقيت بالإصرار وترك الاستغفار\n وفي الحالين لا تبلغ رذيلتهما مقام السرّ ومحل الحضور ومناجاة الربّ\n ولا تتجاوز حدّ الصدر\n ولا تصير الفطرة بها محجوبة الحقيقة منكوسة بخلاف تلك\n ألا ترى أن الشيطنة المغوية للآدمي أبعد عن الحضرة الإلهية من السبعية والبهيمية وأبعد بما لا يقدر قدره؟ فالإنسان برسوخ رذيلة النطقية يصير شيطاناً\n وبرسوخ الرذيلتين الأخريين يصير حيواناً كالبهيمة أو السبع وكل حيوان أرجى صلاحاً وأقرب فلاحاً من الشيطان ولهذا قال تعالى:\n[الشعراء\n الآيات:221-222]\n ونهى ها هنا عن اتباع خطوات الشيطان\n فإنّ ارتكاب مثل هذه الفواحش لا يكون إلا بمتابعته ومطاوعته وصاحبه يكون من جنوده وأتباعه\n فيكون أخسّ منه وأذلّ\n محروماً من فضل الله الذي هو نور هدايته\n محجوباً من رحمته التي هي إفاضة كمال وسعادة\n ملعوناً في الدنيا والآخرة\n ممقوتاً من الله والملائكة\n تشهد عليه جوارحه بتبدّل صورها وتشوّه منظرها\n خبيث الذات والنفس\n متورّطاً في الرجس\n فإنّ مثل هذه الخبائث لا تصدر إلا من الخبيثين\n كما قال تعالى: { الخبيثات للخبيثين } وأما الطيبون المتنزهون عن الرذائل\n فإنما تصدر عنهم الطيبات والفضائل { لهم مغفرة } بستر الأنوار الإلهية صفات نفوسهم { ورزق كريم } من المعاني والمعارف الواردة على قلوبهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nهذه { سُورَةٌ } عظيمةُ\n وسِفرُ جليلُ\n وآياتُ كريمةُ { أَنزَلْنَاهَا } من مقام جودنا\n وفضلنا عليك يا أكمل الرسل تأييداً لنبوتك ورسالتك\n وترويجاً لدينك وملكتك { وَفَرَضْنَاهَا } أي: أوجبنا الأحكام التي ذُكرتُ فيها\n وقدّرنا الحدود المقررة في ضمنها\n ألزمناها على من تبعك من المؤمنين تهذيباً لظوهرهم وبواطنهم { وَ } مع ذلك { أَنزَلْنَا فِيهَآ آيَاتٍ } عظام دالة على وحدى ذاتنا\n وكمال قدرتنا على الإنعام والانتقام مع كونها { بَيِّنَاتٍ } واضحات الدلالات { لَّعَلَّكُمْ تَذَكَّرُونَ } [النور: 1] وتتعظون\n فتتركون ما يوجب مقتكم وهلاككم\n وتتوجهون إلى ما جُبلتم لأجله\n\n\nثم أخذ سبحانه بتطهير المؤمنين عن أفحش الفواحش وأقبح الآثام\n فقال: { ٱلزَّانِيَةُ وَٱلزَّانِي } أي: حكمهما وحدهما فيما فرضناهما\n وتلوناها عليكم أيها المؤمنين الجَلد\n قدَّم سبحانه الزانية\n لأن وقوع الزنا في الأغلب من جانبهن\n ومن غرض نفوسهن\n وزينتهن على الرجال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" سورة \": خبر\n أي: هذه سورة\n وأشير لها\n مع عدم تقدم ذكره لأنها في حكم الحاضر المشاهدَ\n وقرئ بالنصب على الاشتغال\n وجملة: أنزلناها\n وما عطف عليه: صفة لسورة\n مؤكد لما أفاده التنكير من الفخامة\n والزانية: مبتدأ\n والخبر فاجلدوا\n ودخلت الفاء لتضمن المبتدأ معنى الشرط إذ اللام موصولة\n أي: والتي زنت والذي زنى فاجلدوا\n هذا مذهب المبرد وغيره\n والاختيار عند سيبويه: الرفع على الابتداء\n والخبر: محذوف\n أي: فيما فرض عليكم\n أو: مما يُتلى عليكم: حكم الزانية والزاني\n وقدَّم الزانية لأنها الأصل في الفعل\n والداعية فيها أوفر\n ولولا تمكينها منه لم يقع\n وقيل: لمّا كان وجود الزنى في النساء أكثر\n بخلاف السرقة\n ففي الرجال أكثر\n قَدَّم الحق تعالى الأكثر فيهما\n يقول الحق جل جلاله: هذه { سورةٌ } \n وهي الجامعة لآيات\n بفاتحة لها وخاتمة\n مشتقة من سور البلد\n من نعت تلك السورة: { أنزلناها } عليك\n { وفرضْنَاها } أي: فرضنا الأحكام التي فيها\n وأصل الفرض: القطع\n أي: جعلناها مقطوعاً بها قطعَ إيجاب\n وقرأ المكي وأبو عمرو: بالتشديد للمبالغة في الإيجاب وتوكيده\n أو: لأن فيها فرائض شتى\n أو لكثرة المفروض عليهم من السلف ومن بعدهم\n { وأنزلنا فيها } أي: في تضاعيفها { آيات بينات } أي: دلائل واضحات لوضوح دلالتها على أحكامها لا على معانيها فإنها كسائر السور\n وتكرير أنزلنا\n مع أن جميع الآيات عين السورة لاستقلالها بعنوان رائق دَاع إلى تخصيص إنزالها بالذكر إبانة لخطرها\n ورفعاً لقدرها\n كقوله تعالى:\n[هود: 58]\n بعد قوله: { نَجَّيْنَا هُوداً وَالَّذِينَ ءامَنُواْ مَعَهُ }\n { لعلكم تذكَّرون } أي: لكي تتعظوا فتعملوا بموجبها عند وقوع الحوادث الداعية إلى إجراء أحكامها\n وفيه إيذان بأن حقها أن تكون على بالٍ منهم\n بحيث متى مست الحاجة إليها استحضروها\n ثم شرع في تفصيل أحكامها\n فقال: { الزانيةُ والزاني فاجلدوا كلَّ واحد منهما مائةَ جلدةٍ } إذا كانا حُرَّيْن\n بالغين\n غَيْر مُحْصَنَيْنِ\n وألا تكون المرأة مكرَهة\n وظاهر الآية: عموم المحصن وغيره\n ثم نسخ بالسُنة المشهورة\n وقد رجم - عليه الصلاة والسلام - مَاعزاً وغيره\n وعن علي رضي الله عنه: جلدتهما بكتاب الله\n ورجمتهما بسنة رسول الله صلى الله عليه وسلم\n وقيل نسخ بآية منسوخة التلاوة\n وهي: الشيخ والشيخة إذا زنيا فارجموهما أَلْبَتَّةَ نكالاً من الله والله عزيز حكيم\n ويأباه ما رُوي عن علي رضي الله عنه\n هـ\n قاله أبو السعود\n وشرط الإحصان: العقل\n والحرية\n والإسلام\n والبلوغ\n والتزوج بنكاح صحيح\n ودخول معتبر\n وفي التعبير بالجلد\n دون الضرب إشارة إلى أنه لا يبالغ إلى أن يصلَ أثرُ الضرب إلى اللحم\n ولكن يخفف حتى يكون حد ألمه الجِلد الظاهر\n والخطاب للأئمة لأن إقامة الحدود من الدِّين\n وهو على الكل\n إلا أنه لا يمكن الاجتماع\n فيقوم الإمام مقامهم\n وزاد مالك والشافعي مع الجلد: تغريب عام\n أخذاً بالحديث الصحيح\n\nوقال أبو حنيفة: إنه منسوخ بالآية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "66:2",
      "similarity": 0.5107202763326727
    },
    {
      "verse": "28:85",
      "similarity": 0.4998993530610064
    },
    {
      "verse": "9:124",
      "similarity": 0.4923854713239589
    },
    {
      "verse": "4:118",
      "similarity": 0.47187290466346343
    },
    {
      "verse": "2:23",
      "similarity": 0.45583951754741353
    }
  ]
}