{
  "chapter": "النور",
  "text": "ولولا فضل الله عليكم ورحمته فى الدنيا والءاخرة لمسكم فى ما افضتم فيه عذاب عظيم",
  "translations": [
    {
      "translation": "Were it not for Allah's favour to you and His mercy, both in this world and the Next World, a terrible punishment would have afflicted you for your plunging headlong into it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for the grace of God and His mercy upon you in this world and the next, you would have suffered a great affliction for the false accusation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for Allah's grace and mercy towards you in this world and in the Hereafter, a painful scourge would have visited you because of the things in which you were involved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for the favors and mercy of God upon you, in this world and in the life to come, a great torment would strike you for your involvement in this false report.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were it not for Allah’s munificence and His mercy upon you in the world and in the Hereafter, a terrible punishment would have reached you for the discussions you fell into.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for the grace of Allah and His mercy unto you in this world and in the Hereafter, a great torment would have touched you for that whereof you had spoken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were it not for Allah's grace upon you and His mercy in this world and the hereafter, a grievous chastisement would certainly have touched you on account of the discourse which you entered into.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for God's bounty to you and His mercy in the present world and the world to come there would have visited you for your mutterings a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for the grace of Allah and His mercy unto you in the world and the Hereafter an awful doom had overtaken you for that whereof ye murmured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for the grace of God and His mercy on you in this world and the Hereafter, a terrible punishment would have afflicted you for your plunging headlong into slander.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there not been Allah's grace upon you and His mercy in the World and the Hereafter, surely there would have touched you for that whcrein ye had rushed, torment mighty--\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for Allah’s grace and His mercy upon you in this world and the Hereafter, there would have befallen you a great punishment for what you ventured into,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for the grace and mercy of Allah on you, in this world and the Hereafter, a grievous penalty would have seized you in that ye rushed glibly into this affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for the Grace of Allah and His Mercy unto you in this world and in the Hereafter, a great torment would have touched you for that whereof you had spoken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for the bounty of Allah and His Mercy towards you in this life and in the Everlasting Life you would have been sternly punished for that which you were involved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for God’s favor upon you, and His mercy, in this world and the Hereafter, you would have suffered a great punishment for what you have ventured into.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it had not been for the favor of Allah upon you and His mercy in this world and the Hereafter, you would have been touched for that [lie] in which you were involved by a great punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:14] And were it not for God’s bounty to you and His mercy in the life of this world and the Hereafter there would have befallen you, for what you, O band [of accusers], engaged in, [for] what you indulged in, an awful chastisement, in the Hereafter;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah revealed the following about those who did not slander 'A'ishah but talked about the slander: (Had it not been for the grace of Allah and His mercy unto you in the world and the Hereafter an awful doom had overtaken you) chastisement would have seized you in this worldly life and in the Hereafter (for that whereof you murmured) for the slanderous accusation which you repeated.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي مَآ أَفَضْتُمْ } معناه خِضتُمْ فِيهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"In what you have gone forth [to battle]\" - its meaning is that you have gone forth into it [i.e., the battle].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْلاَ فَضْلُ ٱللَّهِ عَلَيْكُمْ } أيها الباهتون\n المفترون بتوفيكم على الإنابة والرجوع عن هذه الفرية العظيمة { وَرَحْمَتُهُ } الشاملة لكم { فِي ٱلدُّنْيَا وَٱلآخِرَةِ لَمَسَّكُمْ فِي مَآ أَفَضْتُمْ فِيهِ } وخضتم في إشاعته وإذاعته { عَذَابٌ عَظِيمٌ } [النور: 14] عاجلاً وآجلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: لولا هنا: امتناعية بخلاف المتقدمة فإنها تحضيضية، وإذ سمعتموه: معمول لقُلتم، وإذْ تلقونه: ظرف لمسَّكم\n يقول الحق جل جلاله: { ولولا فضلُ الله عليكم } أيها السامعون { ورحمتُهُ في الدنيا } من فنون النِعَم، التي من جملتها: الإمهال والتوبة، { و } في { الآخرةِ } من ضروب الآلاء، التي من جملتها: العفو والمغفرة، { لمسَّكم } عاجلاً { فيما أفَضْتُم } أي: بسبب ما خضتم { فيه } من حديث الإفك { عذابٌ عظيمٌ } يُستحقر دونه التوبيخ والجَلْدُ، يقال أفاض في الحديث، وفاض، واندفع: إذا خاض فيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:199",
      "similarity": 0.6938486781052461
    },
    {
      "verse": "46:8",
      "similarity": 0.6340921807831127
    },
    {
      "verse": "7:50",
      "similarity": 0.6132020504823287
    },
    {
      "verse": "2:198",
      "similarity": 0.5811826213272099
    },
    {
      "verse": "8:68",
      "similarity": 0.3180777653697999
    }
  ]
}