{
  "chapter": "النور",
  "text": "يوم تشهد عليهم السنتهم وايديهم وارجلهم بما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "on the Day when their tongues and hands and feet will testify against them about what they were doing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day their tongues and hands and feet bear witness to what they had done,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They should not forget the Day when their own tongues and their own hands and test will bear testimony in regard to their misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the day when their tongues, hands, and feet will testify to what they had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when their tongues and their hands and their feet will testify against them, regarding what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when their tongues, their hands, and their legs will bear witness against them as to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when their tongues and their hands and their feet shall bear witness against them as to what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the day when their tongues, their hands and their feet shall testify against them touching that they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when their tongues and their hands and their feet testify against them as to what they used to do,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when their own tongues, hands and feet shall bear witness against them about what they did,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day whereon their tongues and their hands and their feet will bear witness against them regarding that which they were wont to work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the day when witness shall be given against them by their tongues, their hands, and their feet concerning what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when their tongues, their hands, and their feet will bear witness against them as to their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when their tongues, their hands, and their legs or feet will bear witness against them as to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when their tongues, hands and feet shall testify against them concerning what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when their tongues, and their hands, and their feet will testify against them regarding what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On a Day when their tongues, their hands and their feet will bear witness against them as to what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:24] on the day (yawma is in the accusative because of the [implicit sense of] ‘permanence’ to which lahum, ‘for them’, is semantically connected) when their tongues and their hands and their feet shall testify against them (read [feminine person] tashhadu or [masculine person] yashhadu, ‘testify’) concerning what they used to do, in terms of speech and action — this [day] is the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ (24) والظرف في قوله : { يوم تشهد عليهم } متعلق بما تعلق به الظرف المجعول خبراً للمبتدأ في قوله : { ولهم عذاب عظيم } . وذكر شهادة ألسنتهم وأيديهم وأرجلهم للتهويل عليهم لعلهم يتقون ذلك الموقف فيتوبون .وشهادة الأعضاء على صاحبها من أحوال حساب الكفار .وتخصيص هذه الأعضاء بالذكر مع أن الشهادة تكون من جميع الجسد كما قال تعالى : { وقالوا لجلودهم لِمَ شهدتم علينا } \\[ فصلت : 21 \\] لأن لهذه الأعضاء عملاً في رمي المحصنات فهم ينطقون بالقذف ويشيرون بالأيدي إلى المقذوفات ويسعون بأرجلهم إلى مجالس الناس لإبلاغ القذف .وقرأ حمزة والكسائي وخلف { يشهد عليهم } بالتحتية ، وذلك وجه في الفعل المسند إلى ضمير جمع تكسير .وقوله : { يومئذٍ يوفيهم الله دينهم } استئناف بياني لأن ذكر شهادة الأعضاء يثير سؤالاً عن آثار تلك الشهادة فيجاب بأن أثرها أن يجازيهم الله على ما شهدت به أعضاؤهم عليهم . فدينهم جزاؤهم كما في قوله : { ملك يوم الدين } \\[ الفاتحة : 4 \\] .و { الحقَّ } نعت للدين ، أي الجزاء العادل الذي لا ظلم فيه فوصف بالمصدر للمبالغة .وقوله : { ويعلمون أن الله هو الحق المبين } أي ينكشف للناس أن الله الحق . ووصف الله بأنه { الحق } وصف بالمصدر لإفادة تحقق اتصافه بالحق ، كقول الخنساء: ... ترتع ما رتعت حتى إذا ادَّكرتفإنما هي إقبال وإدبار ... وصفة الله بأنه { الحق } بمعنيين :أولهما : بمعنى الثابت الحاق ، وذلك لأن وجوده واجب فذاته حق متحققة لم يسبق عليها عدم ولا انتفاء فلا يقبل إمكان العدم .وعلى هذا المعنى في اسمه تعالى : { الحق } اقتصر الغزالي في «شرح الأسماء الحسنى» .وثانيهما : معنى أنه ذو الحق ، أي العدل وهو الذي يناسب وقوع الوصف بعد قوله : { دينهم الحق } . وبه فسر صاحب «الكشاف» فيحتمل أنه أراد تفسير معنى الحق هنا ، أي وصف الله بالمصدر وليس مراده تفسيرَ الاسم . ويحتمل إرادة الإخبار عن الله بأنه صاحب هذا الاسم وهذا الذي درج عليه ابن برّجان الإشبيلي في كتابه «شرح الأسماء الحسنى» والقرطبي في «التفسير» .و { الحق } من أسماء الله الحسنى . ولما وصف بالمصدر زيد وصف المصدر ب { المبين } . والمبين : اسم فاعل من أبان الذي يستعمل متعدياً بمعنى أظهر على أصل معنى إفادة الهمزة التعدية ، ويستعمل بمعنى بان ، أي ظهر على اعتبار الهمزة زائدة ، فلك أن تجعله وصفاً ل { الحق } بمعنى العدل كما صرح به في «الكشاف» ، أي الحق الواضح . ولك أن تجعله وصفاً لله تعالى بمعنى أن الله مبيَّن وهاد . وإلى هذا نحا القرطبي وابن برَّجان ، فقد أثبتا في عداد أسمائه تعالى اسم { المبين } .فإن كان وصف الله ب { الحق } بالمعنى المصدري فالحصر المستفاد من ضمير الفصل ادعائي لعدم الاعداد ب { الحق } الذي يصدر من غيره من الحاكمين لأنه وإن يصادف المحز فهو مع ذلك معرض للزوال وللتقصير وللخطأ فكأنه ليس بحق أو ليس بمبين . وإن كان الخبر عن الله بأنه { الحق } بالمعنى الاسمي لله تعالى فالحصر حقيقي إذ ليس اسم الحق مسمى به غير ذات الله تعالى ، فالمعنى : أن الله هو صاحب هذا الاسم كقوله تعالى : { هل تعلم له سميّاً } \\[ مريم : 65 \\] . وعلى هذين الوجهين يجري الكلام في وصَفه تعالى ب { المبين } .ومعنى كونهم يعلمون أن الله هو الحق المبين : أنهم يتحققون ذلك يومئذ بعلم قطعي لا يقبل الخفاء ولا التردد وإن كانوا عالمين ذلك من قبل لأن الكلام جار في موعظة المؤمنين؛ ولكن نزل علمهم المحتاج للنظر والمعرض للخفاء والغفلة منزلة عدم العلم .\n\n",
      "translations": [
        {
          "translation": "(On the day) which is the Day of Judgement (when their tongues and their hands and their feet testify against them) against what 'Abdullah Ibn Ubayy and his host said and did (as to what they used to do) in the life of this world,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتذكيراً لمن اعتبر منهم من المؤمنين { يَوْمَ تَشْهَدُ عَلَيْهِمْ } بإلهام الله وإعلامه { أَلْسِنَتُهُمْ } وتقر بما صدر عنها من الكذب والافتراء\n ورمي المحصنات\n وقذف العفائف عمداً بلا علم لهم ولا شعور بحالهن { وَأَيْدِيهِمْ } لما افترقوا من الأخذ والإعطاء لا على الوجه المشروع { وَأَرْجُلُهُمْ } بالسعي والتردد إلى ما يرضى منه سبحانه ولا رسوله ولا المؤمنون\n وبالجملة: يقر كل من أعضائهم وجوارحهم { بِمَا كَانُواْ يَعْمَلُونَ } [النور: 24] ويكتسبون من المعاصي والآثام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:84",
      "similarity": 0.5982845657983696
    },
    {
      "verse": "14:4",
      "similarity": 0.5336082675972528
    },
    {
      "verse": "44:58",
      "similarity": 0.5245234207279695
    },
    {
      "verse": "26:195",
      "similarity": 0.48958440874024695
    },
    {
      "verse": "19:50",
      "similarity": 0.4216992228789638
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}