{
  "chapter": "النور",
  "text": "ليس عليكم جناح ان تدخلوا۟ بيوتا غير مسكونة فيها متع لكم والله يعلم ما تبدون وما تكتمون",
  "translations": [
    {
      "translation": "There is nothing wrong in your entering houses where no one lives and where there is some service for you. Allah knows what you divulge and what you conceal.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no harm in going into uninhabited houses where there is some convenience for you, as God has knowledge of what you hide and what you disclose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is, however, no harm if you enter houses which are not dwelling places, but contain something useful for you; Allah knows what you disclose and what you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no harm for you to enter uninhabited houses where you have some goods. God knows whatever you reveal or hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin upon you to enter houses not made especially for someone’s habitation, and you have permission for its use; and Allah knows what you disclose and what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin on you that you enter houses uninhabited, you have any interest in them. And Allah has knowledge of what you reveal and what you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no sin in you that you enter uninhabited houses wherein you have your necessaries; and Allah knows what you do openly and what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no fault in you that you enter houses uninhabited wherein enjoyment is for you. God knows what you reveal and what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is) no sin for you to enter uninhabited houses wherein is comfort for you. Allah knoweth what ye proclaim and what ye hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is nothing wrong in your entering uninhabited houses if that serves a useful purpose: God knows all that you do openly, and all that you would conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No fault it is upon you that ye enter houses uninhabited wherein there is some property for you; and Allah knoweth that which you disclose and that which ye hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be no sin upon you in entering [without announcing] uninhabited houses wherein you have goods belonging to you. Allah knows whatever you disclose and whatever you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no fault on your part to enter houses not used for living in, which serve some (other) use for you: And Allah has knowledge of what ye reveal and what ye conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin on you that you enter (without taking permission) houses uninhabited (i.e. not possessed by anybody), (when) you have any interest in them. And Allah has knowledge of what you reveal and what you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no fault in you that you enter uninhabited houses wherein there is benefit for you. Allah knows what you reveal and what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on you for entering uninhabited houses, in which are belongings of yours. God knows what you reveal and what you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame upon you for entering houses not inhabited in which there is convenience for you. And Allah knows what you reveal and what you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:29] You would not be at fault if you enter [without permission] uninhabited houses wherein is comfort, some benefit, for you, in the way of finding shelter and so on, as in the case of travellers inns and charitable hostels. And God knows what you disclose, [what] you do openly, and what you hide, what you do secretly when entering houses other than your own, be it for a righteous purpose or otherwise. It will be mentioned shortly that they should bid themselves peace when entering their own houses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah gave them leave to enter houses which are not theirs-it is here a question of the inns which are usually found in the roads-saying: ((It is) no sin) there is no constraint (for you to enter uninhabited houses) houses which do not have known inhabitants, such as inns and hostels (wherein is comfort for you) where you can find some benefit, against cold in the winter and heat in the summer (Allah knoweth what ye proclaim) of asking permission and invoking greetings of peace (and what ye hide) of giving a response and permission.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَّيْسَ عَلَيْكُمْ جُنَاحٌ } أي: ضيق ومنع { أَن تَدْخُلُواْ بُيُوتاً غَيْرَ مَسْكُونَةٍ } مع أن { فِيهَا مَتَاعٌ لَّكُمْ } تستأجرونها أو تستعيرونها للادخار والاستخزان\n { وَ } بالجملة: { ٱللَّهُ } المطلع لضمائر عباده { يَعْلَمُ } منكم { مَا تُبْدُونَ } وتظهرون { وَمَا تَكْتُمُونَ } [النور: 29] وتخفون\n يجازيكم على مقتضى علمه\n\n\nثم أمر سبحانه لحيبيه بتذكير عباده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ليس عليكم جُنَاحٌ } في { أن تدخلوا بيوتاً غير مسكونةٍ } أي: غير موضوعة لسكنى طائفة مخصوصة\n بل يتمتع بها مَنْ يُضطر إليها\n من غير أن يتخذها مسكناً كالرُّبَطِ\n والخانات\n والحمامات\n وحوانيت التجار\n\n{ فيها متاعٌ لكم } أي: منفعة كاستكنانٍ من الحر والبرد\n وإيواء الرجال والسلع\n والشراء والبيع\n والاغتسال\n وغير ذلك\n فلا بأس بدخولها بغير استئذان\n روي أن أبا بكر رضي الله عنه قال: يا رسول الله\n إن الله قد أنزل عليك آية في الاستئذان\n وإنا لنختلِفُ في تجارتنا إلى هذه الخانات\n فلا ندخلها إلا بإذن؟ فنزلت\n وقيل: هي الخرابات\n يُتَبَرَّزُ فيها\n ويقضون فيها حاجتهم من البول وغيره\n والظاهر: أنها من جملة ما ينتظم في البيوت\n لا أنها المرادة فقط\n { والله يعلم ما تُبدون وما تكتمون } \n وعيد لمن يدخل مدخلاً من هذه المداخل لفسادٍ أو اطلاعٍ على عورات\n والله تعالى أعلم\n الإشارة: التصوف كله آداب\n حتى قال بعضهم: اجعل عملك مِلْحاً وأدبك دقيقاً\n فيتأدبون بالسُنَّة في حركاتهم وسكناتهم\n ودخولهم وخروجهم\n فهم أَولى بالأدب\n فيستأذنون كما أمر الله عند دخول منزلهم برفع صوتهم بذكر الله\n أو بالتسبيح\n أو بالسلام قبل الدخول\n وكذا عند دخول منزل غيرهم\n أو منزل بعضهم بعضاً\n وأما مع الشيخ: فالأدب هو الصبر حتى يخرج\n تأدباً بقوله تعالى:\n[الحجرات: 5]\n فلا يقرعون بابه\n ولا يطلبون خروجه إلا لضرورة فادحة\n ولمّا كان الاستئذان إنما شرع من أجل النظر\n أمر بغض البصر\n فقال: { قُلْ لِّلْمُؤْمِنِينَ يَغُضُّواْ مِنْ أَبْصَارِهِمْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:99",
      "similarity": 0.5786211553860947
    },
    {
      "verse": "2:33",
      "similarity": 0.4679988002852036
    },
    {
      "verse": "5:61",
      "similarity": 0.4390172454096546
    },
    {
      "verse": "2:159",
      "similarity": 0.3464151398470194
    },
    {
      "verse": "2:146",
      "similarity": 0.34593908335192974
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/24:29.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/24:29.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}