{
  "chapter": "النور",
  "text": "الخبيثت للخبيثين والخبيثون للخبيثت والطيبت للطيبين والطيبون للطيبت او۟لئك مبرءون مما يقولون لهم مغفرة ورزق كريم",
  "translations": [
    {
      "translation": "Corrupt women are for corrupt men and corrupt men are for corrupt women, Good women are for good and generous provision.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bad women deserve bad men, and bad men are for bad women; but good women are for good men, and good men for good women, for they are innocent of what people say. There is forgiveness for them and a gracious provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Impure women are for impure men and impure men for impure women, and pure women are for pure men and pure men for pure women. They are free from those scandals which the slanderers utter. There is forgiveness for them and honourable provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indecent woman are for indecent men and indecent men are for indecent woman. Decent women are for decent men and decent men are for decent women. The decent people are innocent of what people allege. They will receive mercy and honorable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vile women for vile men, and vile men for vile women; and virtuous women for virtuous men, and virtuous men for virtuous women; such are innocent of what these people say; for them are forgiveness, and an honourable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bad statements are for bad people and bad people for bad statements. Good statements are for good people and good people for good statements: such are innocent of (every) bad statement which they say; for them is forgiveness, and honored provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unclean things are for unclean ones and unclean ones are for unclean things, and the good things are for good ones and the good ones are for good things; these are free from what they say; they shall have forgiveness and an honorable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corrupt women for corrupt men, and corrupt men for corrupt women; good women for good men, and good men for good women -- these are declared quit of what they say; theirs shall be forgiveness and generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vile women are for vile men, and vile men for vile women. Good women are for good men, and good men for good women; such are innocent of that which people say: For them is pardon and a bountiful provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Corrupt women are for corrupt men, and corrupt men are for corrupt women; good women are for good men and good men are for good women. The latter are absolved from anything they may say; forgiveness and an honourable provision await them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vile women are for vile men, and vile men are for vile women, and clean women are for Clean men, and clean men are for clean women; these are quit of that which the people say: for them is forgiveness and a provision honoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vicious women are for vicious men, and vicious men for vicious women. Good women are for good men, and good men for good women. These are absolved of what they say [about them]. For them is forgiveness and a noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Women impure are for men impure, and men impure for women impure and women of purity are for men of purity, and men of purity are for women of purity: these are not affected by what people say: for them there is forgiveness, and a provision honourable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bad statements are for bad people (or bad women for bad men) and bad people for bad statements (or bad men for bad women). Good statements are for good people (or good women for good men) and good people for good statements (or good men for good women), such (good people) are innocent of (each and every) bad statement which they say, for them is Forgiveness, and Rizqun Karim (generous provision i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil women for evil men, and evil men for evil women; good women for good men, and good men for good women these are clear of what has been said; for them is forgiveness, and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bad women are for bad men, and bad men are for bad women, and good women are for good men, and good men are for good women. Those are acquitted of what they say. There is forgiveness for them, and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil words are for evil men, and evil men are [subjected] to evil words. And good words are for good men, and good men are [an object] of good words. Those [good people] are declared innocent of what the slanderers say. For them is forgiveness and noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:26] Vile women, and [vile] words, are for vile men, and vile men for vile women, and the mentioned [vile words]. Good women, and as mentioned [good words], are for good men, and good men for good women, and the mentioned [good words], that is to say, what suits something vile is its like, and what suits something good is its like — such, good men and women, the like of ‘Ā’isha and Safwān, are absolved of what they say, [what] the corrupt men and women [say] about them. For them, for good men and women, will be forgiveness and a glorious provision, in Paradise. ‘Ā’isha felt honoured by some of the things [mentioned] in this [verse], namely, that she was created ‘a good woman’ and was promised ‘forgiveness and a glorious provision’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالْخَبِيثَاتُ لِلْخَبِيثِينَ وَالْخَبِيثُونَ لِلْخَبِيثَاتِ وَالطَّيِّبَاتُ لِلطَّيِّبِينَ وَالطَّيِّبُونَ لِلطَّيِّبَاتِ أُولَئِكَ مُبَرَّءُونَ مِمَّا يَقُولُونَ لَهُمْ مَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ (26)بعد أن برأ الله عائشة رضي الله عنها مما قال عصبة الإفك ففضحهم بأنهم ما جاؤا إلا بسيء الظن واختلاق القذف وتوعدهم وهددهم ثم تاب على الذين تابوا أنحى عليهم ثانية ببراءة رسول الله صلى الله عليه وسلم من أن تكون له أزواج خبيثات لأن عصمته وكرامته على الله يأبى الله معها أن تكون أزواجه غير طيبات . فمكانة الرسول صلى الله عليه وسلم كافية في الدلالة على براءة زوجه وطهارة أزواجه كلهن . وهذا من الاستدلال على حال الشيء بحال مقارنه ومماثله . وفي هذا تعريض بالذين اختلقوا الإفك بأن ما أفكوه لا يليق مثله إلا بأزواجهم ، فقوله : { الخبيثات للخبيثين } تعريض بالمنافقين المختلقين للإفك .والابتداء بذكر { الخبيثات } لأن غرض الكلام الاستدلال على براءة عائشة وبقية أمهات المؤمنين . واللام في قوله : { للخبيثين } لام الاستحقاق . والخبيثات والخبيثون والطيبات والطيبون أوصاف جرت على موصوفات محذوفة يدل عليها السياق . والتقدير في الجميع : الأزواج .وعطف { والخبيثون للخبيثات } إطناب لمزيد العناية بتقرير هذا الحكم ولتكون الجملة بمنزلة المثل مستقلة بدلالتها على الحكم وليكون الاستدلال على حال القرين بحال مقارنه حاصلاً من أي جانب ابتدأه السامع .وذكر { والطيبات للطيبين والطيبون للطيبات } إطناب أيضاً للدلالة على أن المقارنة دليل على حال القرينين في الخير أيضاً .وعطف { والطيبون للطيبات } كعطف { والخبيثون للخبيثات } .وتقدم الكلام على الخبيث والطيب عند قوله تعالى : { ليميز الله الخبيث من الطيب } في سورة الأنفال ( 37) وقوله : { قال رب هب لي من لدنك ذرية طيبة } في سورة آل عمران ( 38) وقوله : { ويحرّم عليهم الخبائث } في سورة الأعراف ( 157) .وغلب ضمير التذكير في قوله : { مبرءون } وهذه قضية كلية ولذلك حق لها أن تجري مجرى المثل وجعلت في آخر القصة كالتذييل .والمراد بالخبث : خبث الصفات الإنسانية كالفواحش . وكذلك المراد بالطيب : زكاء الصفات الإنسانية من الفضائل المعروفة في البشر فليس الكفر من الخبث ولكنه من متمماته . وكذلك الإيمان من مكملات الطيب فلذلك لم يكن كفر امرأة نوح وامرأة لوط ناقضاً لعموم قوله : { الخبيثات للخبيثين } فإن المراد بقوله تعالى : { كانتا تحت عبدين من عبادنا صالحين فخانتاهما } \\[ التحريم : 10 \\] أنهما خانتا زوجيهما بإبطان الكفر . ويدل لذلك مقابلة حالهما بحال امرأة فرعون { إذ قالت رب ابْننِ لي عندك بيتاً في الجنة } إلى قوله : { ونجني من القوم الظالمين } \\[ التحريم : 11 \\] .والعدول عن التعبير عن الإفك باسمه إلى { ما يقولون } إلى أنه لا يعدو كونه قولاً ، أي أنه غير مطابق للواقع كقوله تعالى : { ونرثه ما يقول } \\[ مريم : 80 \\] لأنه لا مال له ولا ولد في الآخرة .والرزق الكريم : نعيم الجنة . وتقدم أن الكريم هو النفيس في جنسه عند قوله : { درجات عند ربهم ومغفرة ورزق كريم } في سورة الأنفال ( 4) .وبهذه الآيات انتهت زواجر قصة الإفك .\n\n",
      "translations": [
        {
          "translation": "He also revealed about them: (Vile women) those who are vile in their speech and deeds (are for vile men) they deserve vile men, (and vile men for vile women) they deserve one another. (Good women) good women in their speech and deeds (are for good men) they deserve them, (and good men for good women) they deserve one another; it is also said that this means: good women, i.e. 'A'ishah, are for good men, i.e. the Prophet (pbuh); (such) 'A'ishah and Safwan (are innocent of that which people say) they are innocent of people's slander: (For them is pardon) their sins are pardoned in the life of this world (and a bountiful provision) in Paradise. He says: when any man or woman are praised, and they deserve such a praise, then whatever they are praised with is true. And when a vile man or woman are mentioned with ill, and they deserve such an ill mention, then they deserve being mentioned in an ill manner.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n كما بينها سبحانه بقوله: { ٱلْخَبِيثَاتُ } من النساء المطعونات بأنواع الرذائل\n المنحرفات عن جادة السلام والطهارة { لِلْخَبِيثِينَ } كذلك من الرجال\n يعني: لا يتزوجهن غير الخبيثين بحكم المناسبة { وَ } كذا { ٱلْخَبِيثُونَ } من الرجال { لِلْخَبِيثَاتِ } من النساء\n كلُ لنظيرتها بحكم المصلحة الإلهية\n\n\n{ وَ } كذا { ٱلطَّيِّبَاتُ } الطاهرات العفائف المحصنات { لِلطَّيِّبِينَ } أيضاً كذلك { وَ } كذا { ٱلطَّيِّبُونَ } المستقيمون على جادة التوحيد والعدالة { لِلْطَّيِّبَاتِ } أيضاً كذلك\n إذ كلُ يميل بالطبع إلى شاكلته بالميل المعني الموضوع بالوضع الإلهي\n ومتى ثبت هذا الحكم\n وتبين هذه المناسبات بتبيين الله { أُوْلَـٰئِكَ } العفائف المطهرون الطيبون { مُبَرَّءُونَ } منزَّهون { مِمَّا يَقُولُونَ } أولئك الرماة المفترون والطغاة الخبيثون المنحرفون عن طريق احلق\n الناكبون عن صراطٍ مستقيم\n ولبراءتهم ونزاهتهم { لَهُم مَّغْفِرَةٌ } وعفوٌ من الله المطَّلعِ لبراءتهم الشاهدِ عليها { وَرِزْقٌ كَرِيمٌ } [النور: 26] وهو الرزق الصوري والمعنوي\n الذي يتلذذون به الجنة عند كشف الغطاء ورفع الحجب\n\nاللهم ارزقنا بلطفك من الرزق الكريم\n واجعلنا بجودك من ورثة جنة النعيم\n\n\nثم لما كان أمثال هذه الهذيانات الباطلة\n والمفتريات العاطلة من نتائج الخلطة والاستئناس مع أصحاب الغفلة\n وكشف الحجب\n والأستار الواقعة بين ذوي القدور والاعتبار وأولي الخطر الكبار إلى من هو من السلفة الساقطين المنحطين من درجة أرباب الاستبصار\n\n\nأشار سبحانه إلى أن الاختلاط الاستئناس بين المؤمنين\n لا بدَّ وأن يكون مسبوقاً بالاستئذان والاسترخاص\n حتى لا يؤدي إلى أمثال هذه الخرافات\n فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم محافظة المحبة والإخلاص بينكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { الخبيثاتُ } من النساء { للخبيثين } من الرجال، { والخبيثون } من الرجال { للخبيثات } من النساء. وهذه قاعدة السنة الإلهية، أن الله تعالى يسوق الأهل للأهل، فمن كان خبيثاً فاسقاً يُزوجه الله للخبيثة الفاسقة مثله، ومن كان طيباً عفيفاً رزقه الله طيبة مثله. وهو معنى قوله تعالى: { والطيباتُ } من النساء { للطيبين } من الرجال { والطيبون } من الرجال، { للطيباتِ } من النساء، فهذا هو الغالب. وحيث كان - عليه الصلاة والسلام - أطيب الأطيبين، وخيرة الأولين والآخرين، تبين كون الصديقة - رضي الله عنها - من أطيب الطيبات، واتضح بطلان ما قيل فيها من الخرافات، حسبما نطق به قوله تعالى: { أولئك مبرؤون مما يقولون } ، على أن الإشارة إلى أهل البيت، المنتظمين في سلك الصِّدِّيقِيَّةِ انتظاماً أولياً، وقيل: إلى رسول الله صلى الله عليه وسلم والصدِّيقة وصفوان، وما في اسم الإشارة من معنى البُعد، للإيذان بعلو رتبة المشار إليهم، وبُعْدِ منزلتهم في الفضل، أي: أولئك الموصوفون بعلو الشأن: مبرؤون مما يقوله أهله الإفك في حقهم من الأكاذيب الباطلة. وقيل: الخبيثات من القول تقال للخبيثين من الرجال والنساء، أي: لائقة بهم، لا ينبغي أن تقال إلا لهم. والخبيثون من الفريقين أَحِقَّاءُ بأن يُقَالَ في حقهم خبائث القول. والطيبات من الكلم للطيبين من الفريقين، مختصة بهم، وهم أحقاء بأن يقال في شأنهم طيبات الكلم. { أولئك } الطيبون { مبرؤون } مما يقول الخبيثون في حقهم. فمآله تنزيه الصديقة أيضاً. وقيل: الخبيثات من القول لا تصدر إلا من الخبيثين، والطيبات من الكلمات لا تصدر إلا من الطيبين، وهم مبرؤون مما يقوله أهل الخبث، لا يقع ذلك منهم أَلْبَتَّةَ، { لهم مغفرة } لما لا يخلو عنه البشر من الذنب، { ورزق كريم } هو نعيم الجنان. دخل ابن عباس رضي الله عنه على عائشة - رضي الله عنها - في مرضها، وهي خائفة من القدوم على الله عز وجل، فقال: لا تخافي، فإنك لا تقدمين إلا على مغفرة ورزق كريم، وتلى الآية، فغشي عليها: فرحاً بما تلا. وقالت رضي الله عنها -: قد أُعْطِيت تسعاً ما أُعْطِيَتْهُنَّ امرأة: نزل جبريل بصورتي في راحته، حين أمر- عليه الصلاة والسلام - أن يتزوجني، وتزوجني بكراً، وما تزوج بكراً غيري، وتوفي - عليه الصلاة والسلام - ورأسه في حِجْري، وقبره في بيتي، وينزل عليه الوحي وأنا في لحافه، وأنا ابنة خليفته وصديقه، ونزل عذري من السماء، وخُلقت طيبة عند طيب، ووُعدت مغفرةً ورزقاً كريماً. الإشارة: الأخلاق الخبيثة مثل الكبر، والعجب، والرياء، والسمعة، والحقد، والحسد، وحب الجاه والمال، للخبيثين، والخبيثون للخبيثات، فهم متصفون بها، وهي لازمة لهم، إلا أن يَصْحُبوا أهل الصفاء والتطهير، فيتطهرون بإذن الله، والأخلاق الطيبات كالتواضع، والإخلاص، وسلامة الصدور، والزهد، والورع، والسخاء، والكرم، وغير ذلك من الأخلاق الطيبة، للطيبين، والرجال الطيبون للأخلاق الطيبات. أولئك مبرؤون مما يقول أهل الإنكار فيهم، لهم مغفرة ستر لعيوبهم، ورزق كريم لأرواحهم من قوت اليقين، وشهود رب العالمين. وبالله التوفيق. ولمّا كان سبب الافك هو تهمة الخلوة، أمر بالاستئذان، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تَدْخُلُواْ بُيُوتاً... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:100",
      "similarity": 0.49531598581332903
    },
    {
      "verse": "21:74",
      "similarity": 0.49502415015894996
    },
    {
      "verse": "12:53",
      "similarity": 0.32248149090371925
    },
    {
      "verse": "10:41",
      "similarity": 0.3125299207152197
    },
    {
      "verse": "3:179",
      "similarity": 0.3101263763670626
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}