{
  "chapter": "النور",
  "text": "ولا ياتل او۟لوا۟ الفضل منكم والسعة ان يؤتوا۟ او۟لى القربى والمسكين والمهجرين فى سبيل الله وليعفوا۟ وليصفحوا۟ الا تحبون ان يغفر الله لكم والله غفور رحيم",
  "translations": [
    {
      "translation": "Those of you possessing affluence and ample wealth should not make oaths that they will not give to their relatives and the very poor and those who have made hijra in the way of Allah. They should rather pardon and overlook. Would you not love Allah to forgive you? Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those who are men of plenty and means among you swear that they will not give to their relatives and the poor and those who leave their homes in the service of God. They should forgive and overlook (their failings). Would you not like God to forgive you? And God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those among you, who are bountiful and persons of means, should not swear on oath that they would withhold their help from their relatives, the indigent and those who have left their homes for the cause of Allah: they should forgive and forbear. Do you not wish that Allah should forgive you? and Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The well-to-do and the rich among you should not fail to give to relatives, the destitute, and Emigrants for the cause of God. Be considerate and forgiving. Do you not want God to forgive you? God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And may not those who possess superiority (in wealth) among you and possess capacity, swear not to give to the relatives and to the needy, and to immigrants in Allah's cause; and they should forgive and forbear; do you not like that Allah may forgive you? And Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those among you who are blessed with graces and wealth swear not to give to their kinsmen, the poor, and those who left their homes for Allah's cause. Let them pardon and forgive. Do you not love that Allah should forgive you And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those of you who possess grace and abundance swear against giving to the near of kin and the poor and those who have fled in Allah's way, and they should pardon and turn away. Do you not love that Allah should forgive you? And Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those of you who possess bounty and plenty swear off giving kinsmen and the poor and those who emigrate in the way of God; but let them pardon and forgive. Do you not wish that God should forgive you? God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those who possess dignity and ease among you swear not to give to the near of kin and to the needy, and to fugitives for the cause of Allah. Let them forgive and show indulgence. Yearn ye not that Allah may forgive you? Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those who are possessed of means and plenty among you resolve to withhold their bounty from their kindred and the needy and those who have migrated from their homes in the cause of God. Let them forgive and overlook. Do you not wish God to forgive you? God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not the owners of affluence and amplitude among you swear off from giving unto the kindred and the needy and the emigrants in the way of Allah; let them pardon and overlook. Love ye not that Allah should forgive you And Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The well-off and the opulent among you should not vow that they will not give [any longer] to the relatives and the needy, and to those who have migrated in the way of Allah, and let them excuse and forbear. Do you not love that Allah should forgive you? Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not those among you who are endued with grace and amplitude of means resolve by oath against helping their kinsmen, those in want, and those who have left their homes in Allah's cause: let them forgive and overlook, do you not wish that Allah should forgive you? For Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those among you who are blessed with graces and wealth swear not to give (any sort of help) to their kinsmen, Al-Masakin (the poor), and those who left their homes for Allah's Cause. Let them pardon and forgive. Do you not love that Allah should forgive you? And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let those of you who possess bounty and plenty swear not to give kinsmen, and the poor, and those who emigrate in the way of Allah. Let them pardon and forgive. Do you not yearn that Allah forgives you? And Allah is the Forgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who have affluence and means should not refuse to give to the relatives, and the needy, and the emigrants for the sake of God. And let them pardon, and let them overlook. Do you not love for God to pardon you? God is All-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not those of virtue among you and wealth swear not to give [aid] to their relatives and the needy and the emigrants for the cause of Allah, and let them pardon and overlook. Would you not like that Allah should forgive you? And Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:22] And do not let those of you who possess bounty, the wealthy, and the affluent swear not to give to the near of kin and the poor and those who emigrate in the way of God — this was revealed regarding Abū Bakr who swore to provide no more for Mistah, his maternal cousin, a destitute Emigrant who had fought at [the battle of] Badr, because of his involvement in the calumny, when thitherto he had provided for him. And [it was revealed also regarding] certain Companions who swore not to give voluntary alms to those who had participated in [spreading] the calumny in any way. Let them forgive and excuse, them in this matter. Do you not love that God should forgive you? And God is Forgiving, Merciful, to believers. Abū Bakr said: ‘Indeed. I would love that God forgive me’, and he restored [thereafter] to Mistah what he used to expend on him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then revealed the following about Abu Bakr when he swore that he will not spend on his relatives, Mistah and others, because they talked about the slandering of 'A'ishah: (And let not those who possess dignity) through their spending (and ease) due to their wealth (among you swear not to give to the near of kin) Mistah was his maternal cousin (and to the needy) beside being his cousin, Mistah was also poor, (and to fugitives for the cause of Allah) and to the Immigrants for the sake of Allah, for Mistah was also an Immigrant. (Let them forgive and show indulgence. Yearn ye not that Allah may forgive you) do you not want, Abu Bakr, that Allah forgive you? (Allah is Forgiving, Merciful) towards the person who repents. When he heard this, Abu Bakr said: \"I do indeed, my Lord!\" and so after the revelation of this verse, he showed kindness to his relatives and helped them financially.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ يَأْتَلِ } معناه يَحلِفُ من [آليتُ]\n ويأتلُ: معناه لا يالُ أي لا يُقصِّرُ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And let them not make [false] oaths} [means that] He forbids taking [false] oaths from [others].\n\n\nHe does not give up; this means that he does not falter or give in.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وقال: { لاَ يَأْتَلِ } أي: لا يحلف ولا يقصر { أُوْلُواْ ٱلْفَضْلِ مِنكُمْ } في الدين { وَ } أولوا { ٱلسَّعَةِ } في الرزق { أَن يُؤْتُوۤاْ } أي: من ألاَّ يؤتوا أو على ألاَّ يؤتوا { أُوْلِي ٱلْقُرْبَىٰ } أي: الفقراء الذين ينتمون إليكم إيها المؤمنون بالقرابة { وَٱلْمَسَاكِينَ } الفاقدين لقوت يومهم\n ولا سيما الفقراء { وَٱلْمُهَاجِرِينَ فِي سَبِيلِ ٱللَّهِ } الباذلين أرواحَهم في ترويج دينه\n بسبب أنهم خاضوا في معصية الإفك والافتراء\n وجاءوا ببهتانٍ عظيمٍ\n وأحبوا أن يشيعوه\n ويتقولوا به ظلماً وزوراً\n\n\n{ وَ } بعد نزول آيات البرءاة\n والتنزيه في شأن العفيفة - رضي الله تعالى عنها - { لْيَعْفُواْ } أي: جملة المؤمنين عن ذوب القاذفين بعدما تابوا وندموا\n وقَبِل الله سبحانه منه توبتهم { وَلْيَصْفَحُوۤاْ } وليعرضوا عن جريمتهم\n ويصافحوا معهم\n وليعطوا لهم ما أعطوهم قبل { أَلاَ تُحِبُّونَ } أيها المقذوفون المطهرون البريئون { أَن يَغْفِرَ ٱللَّهُ لَكُمْ } زلتكم وذنوبكم بسبب عفوكم عنهم\n وصفحكم عما جاءوا به افتراءً { وَٱللَّهُ } المنتقم المجازي لعباده { غَفُورٌ } لهم يغفر زلتهم وذنوبهم بسبب عفوهم جرائم إخوانهم { رَّحِيمٌ } [النور: 22] يرحمهم تفضلاً عليهم وامتناناً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهذا الكلام مقدمة لقوله: { ولا يأْتَل } ، من قولك: أليت: إذا حلفت، أي: لاَ يَحْلِفْ { أولو الفضل منكم } أي: في الدين، وكفى به دليلاً على فضل الصِّدِيقِ رضي الله عنه، { والسَّعَةِ }\n أي: والسعة في المال { أن يُؤتوا } أي: لا يحلف على ألا يُعطوا { أولي القربى والمساكين والمهاجرين في سبيلِ الله } كمسطح، فإنه كان ابن خالته، وكان من فقراء المهاجرين\n وهذه الأوصاف هي لموصوف واحد، جيء بها، بطريق العطف تنبيهاً على أن كلاًّ منها علة مستقلة لا ستحقاقه الإيتاء\n وحذف المفعول الثاني لظهوره، أي: على ألاّ يؤتوهم شيئاً، { وليعفُوا } عما فرط منهم { وليصفحُوا } بالإغضاء عنه، فالعفو: التستر، والصفح: الإعراض، أي: وليتجاوزوا عن الجفاء، وليُعرضوا عن العقوبة\n { ألا تُحبُّون أن يغفر الله لكم }؟ فلتفعلوا ما تحبون أن يُفْعَلَ بكم وبهم، مع كثرة خطاياهم، { والله غفور رحيم } مبالغ في المغفرة والرحمة، مع كثرة ذنوب العباد، فتأدبوا بآداب الله، واعفوا، وارحموا\n ولما قرأها النبي صلى الله عليه وسلم على أبي بكر رضي الله عنه قال: بل أُحب أن يغفر الله لي\n ورد إلى مسطح نفقته، وقال: والله لا أنزعها منه أبداً\n وبالله التوفيق\n الإشارة: كل ما يصد عن مكارم الأخلاق كالحلم، والصبر، والعفو، والكرم، والإغضاء، وغير ذلك من الكمالات، فهو من خطوات الشيطان، تجب مجانبته، فإن الشيطان لا يأمر إلا بالفحشاء والمنكر كالغضب، والانتصار، والحمية، والحقد، والشح، والبخل، وغير ذلك من المساوئ، ولا طريق إلى الدواء من تلك المساوئ إلا بالرجوع إلى الله والاضطرار له، والتعلق بأذيال فضله وكرمه\n\n\nولولا فضل الله عليكم ورحمته ما زكى منكم من أحد أبداً، فإذا تعلق بالله، واضطر إليه اضطرار الظمآن إلى الماء طهَّره الله وزكاه، إما بلا سبب، أو بأن يلقيه إلى شيخ كامل، يُربيه ويهذبه بإذن الله، وهذا هو الكثير، والكل منه وإليه\n قال الورتجبي قوله تعالى: { ولولا فضل الله عليكم رحمته\n\n\n } إلخ: بيّن أن تطهير العباد من الذنوب لا يكون إلا بفضله السابق وعنايته الأزلية، كيف يزكي العِلَلَ ما يكون عللاً، فالمعلول لا يُطَهِّرُ، والمعلول أفعال الحدثان على كل صنف، ولطف القديم له استحقاق ذهاب العلل بوصوله\n قال السياري: قال الله: { ولولا فضل الله عليكم } ، ولم يقل: لولا عبادتكم وصلاتكم وجهادكم وحسن قيامكم بأمر الله ما نجا منكم أحد ليعلم أن العبادات، وإن كثرت، فإنها من نتائج الفضل\n هـ\n قال في الحاشية: وظهر لي أن الآية مقدمة لما ندب إليه الصدِّيق بقوله: { ولا يأتل أولو الفضل منكم } ، ففيه إشارة إلى أن فضله وزكاته فضل من الله عليه، وعنايةٌ سابقةٌ، وهي سبب حِفْظِهِ وتحليه بِخِلَعِ كوامل الأوصاف، فليشهدْ ذلك، ولا يأتل على من لم يجد ذلك، حتى وقع فيما وقع من القذف، بل يعذره، ويرى مِنَّةَ الله عليه في كونه نَزَّهَهُ بعنايته من الوقوع في مثل ذلك، مع كون المحل قابلاً، ولكن الله خَصَّصَهُ\n هـ\n قال الورتجبي على قوله: { ولا يأتل\n\n\n } إلخ: في الآية بيانُ وتأديبُ الله للشيوخ والأكابر ألاَّ يهجروا صاحب العثرات والزلات، من المريدين، ويتخلقوا بخلق الله، حيث يغفر الذنوب العظامَ ولا يبالي، وأَعْلَمَهُمْ الاّ يَكُفُّوا أعطافهم عنهم\n ثم قال: فَإنَّ مَنْ لَهُ اسْتِعْدَادٌ لا يَحْتَجِبُ بِعَوَارِضِ البَشَرِيَّةِ عَنْ أَحْكَامِ الطَّرِيقَةِ أبَداً\n هـ\n ثم ذكر وبال القاذفين لعائشة - رضي الله عنها - أو لغيرها، فقال: { إِنَّ ٱلَّذِينَ يَرْمُونَ ٱلْمُحْصَنَاتِ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:14",
      "similarity": 0.5803786295772035
    },
    {
      "verse": "43:89",
      "similarity": 0.5380912308961122
    },
    {
      "verse": "43:5",
      "similarity": 0.5103271332921084
    },
    {
      "verse": "15:85",
      "similarity": 0.4619954024702836
    },
    {
      "verse": "2:109",
      "similarity": 0.393872191808323
    }
  ]
}