{
  "chapter": "النور",
  "text": "ان الذين يرمون المحصنت الغفلت المؤمنت لعنوا۟ فى الدنيا والءاخرة ولهم عذاب عظيم",
  "translations": [
    {
      "translation": "Those who accuse women who are chaste, but who are careless and yet have iman, are cursed both in this world and the Next World, and they will have a terrible punishment",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who blaspheme unsuspecting chaste believing women will be cursed in this world and the next; and for them there will be severe punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who charge with slander those Believing women, who are chaste but simple souls, are accursed in this world and in the Hereafter: there is a great punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who slander the unaware but chaste and believing women (of committing unlawful carnal relations) are condemned in this life and in the life hereafter. They will suffer a great punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who accuse the innocent virtuous, believing women – upon them is a curse in this world and in the Hereafter; and for them is a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who accuse chaste believing women, who never even think of anything touching their chastity and are good believers -- are cursed in this life and in the Hereafter, and for them will be a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who accuse chaste believing women, unaware (of the evil), are cursed in this world and the hereafter, and they shall have a grievous chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who cast it up on women in wedlock that are heedless but believing shall be accursed in the present world and the world to come; and there awaits them a mighty chastisement\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! as for those who traduce virtuous, believing women (who are) careless, cursed are they in the world and the Hereafter. Theirs will be an awful doom\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, those who accuse chaste, unwary, believing women are cursed in this world and the Hereafter. For them awaits a terrible chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "verily those who accuse chaste. unknowing, - believing women, shall be cursed in the world and the Hereafter; and for them shall be a torment mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who accuse chaste and unwary faithful women shall be cursed in this world and the Hereafter, and there shall be a great punishment for them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who slander chaste women, indiscreet but believing, are cursed in this life and in the Hereafter: for them is a grievous Penalty,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who accuse chaste women, who never even think of anything touching their chastity and are good believers, are cursed in this life and in the Hereafter, and for them will be a great torment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who defame chaste, unsuspecting, believing women, shall be cursed in this world and in the Everlasting Life, and for them there is a mightypunishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who slander honorable, innocent, believing women are cursed in this life and in the Hereafter. They will have a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who [falsely] accuse chaste, unaware and believing women are cursed in this world and the Hereafter; and they will have a great punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:23] Truly those who make accusations, of fornication, against honourably married, chaste, women who are unaware, of indecent acts — since it would never occur to them to commit such [acts] — who believe, in God and His Messenger, shall be cursed in this world and the Hereafter; and there will be an awful chastisement for them\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ الَّذِينَ يَرْمُونَ الْمُحْصَنَاتِ الْغَافِلَاتِ الْمُؤْمِنَاتِ لُعِنُوا فِي الدُّنْيَا وَالْآَخِرَةِ وَلَهُمْ عَذَابٌ عَظِيمٌ (23) جملة : { إن الذين يرمون المحصنات } استئناف بعد استئناف قوله : { إن الذين يحبون أن تشيع الفاحشة في الذين آمنوا } \\[ النور : 19 \\] والكل تفصيل للموعظة التي في قوله : { يعظكم الله أن تعودوا لمثله أبداً إن كنتم مؤمنين } \\[ النور : 17 \\] ؛ فابتدىء بوعيد العود إلى محبة ذلك وثُني بوعيد العود إلى إشاعة القالة ، فالمضارع في قوله : { يرمون } للاستقبال . وإنما لم تعطف هذه الجملة لوقوع الفصل بينها وبين التي تناسبها بالآيات النازلة بينهما من قوله : { يا أيها الذين آمنوا لا تتبعوا خطوات الشيطان } \\[ النور : 21 \\] .واسم الموصول ظاهر في إرادة جماعة وهم عبد الله بن أبي بن سلول ومن معه .و { الغافلات } هن اللاتي لا علم لهن بما رُمين به . وهذا كناية عن عدم وقوعهن فيما رُمين به لأن الذي يفعل الشيء لا يكون غافلاً عنه فالمعنى : إن الذين يرمون المحصنات كذباً عليهن ، فلا تحسب المرادَ الغافلات عن قول الناس فيهن . وذكر وصف { المؤمنات } لتشنيع قذف الذين يقذفونهن كذباً لأن وصف الإيمان وازع لهن عن الخنى .وقوله : { لعنوا } إخبار عن لعن الله إياهم بما قدَّر لهم من الإثم وما شَرع لهم .واللعن : في الدنيا التفسيق ، وسلب أهلية الشهادة ، واستيحاش المؤمنين منهم ، وحد القذف ، واللعن في الآخرة : الإبعاد من رحمة الله .والعذاب العظيم : عذاب جهنم فلا جدوى في الإطالة بذكر مسألة جواز لعن المسلم المعيّن هنا ولا في أن المقصود بها من كان من الكفرة .\n\n",
      "translations": [
        {
          "translation": "Allah then revealed the following about 'Abdullah Ibn Ubayy and his host who slandered 'A'ishah and Safwan: (Lo! as for those who traduce) accusing them of adultery (virtuous) and free, (believing) they believe in Allah's divine Oneness (women) i.e. 'A'ishah ((who are) careless) who are chaste and exonerated from adultery, (cursed are they) they should be punished (in the world) by flogging them (and the Hereafter) by casting them in the Fire. The reference here is to 'Abdullah Ibn Ubayy. (Theirs) the reference here is to 'Abdullah ibn Ubayy and his host (will be an awful doom) more severe than the chastisement they will be exposed to in this worldly life. 388\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nرُوي أنه صلى الله عليه وسلم قرأها على أبي بكر رضي عنه\n فقال: بلى أحب\n وأعاد إلى مسطح - هو أحد القاذفني الآفكين - وهو ابن خالته فقيرُ ليس له شيء ينفقه على نفسه\n لأنه ينفق عليه دائماً\n\n\nثم قال سبحانه تذكيراً لعموم عباده\n ونهياً لهم عن الرمي بالزنا مطلقاً: { إِنَّ } المسرفين { ٱلَّذِينَ يَرْمُونَ } بالزنا { ٱلْمُحْصَنَاتِ } المتعففات\n والمستحفظات لحدود الله { ٱلْغَافِلاَتِ } البرئيات المنزهَات عما رُموا به أولئك الغفلة الجهلة ظلماً وزوراً { ٱلْمُؤْمِناتِ } بالله\n وبما جاء من عنده من الحدود والأحكام الجارية على ألسنة رسله\n وبيوم الجزاء المعدّ للكشفش والتفضيح { لُعِنُواْ } وطُردوا عن روح الله وسعة رحمته\n لقصدهم عرض العفائف\n وهتك أستارهن\n وطعنهم فيهن افتراءً ومراءً { فِي ٱلدُّنْيَا } بإجراء الحد وأنواع الطرد والشتم\n ورد شهادتهم مدة حياتهم { وَٱلآخِرَةِ } بأنواع العذاب والنكال\n\n\n{ وَ } بالجملة: { لَهُمْ } بسبب قبح صنيعهم وسوء فعالهم { عَذَابٌ عَظِيمٌ } [النور: 23] لا عذاب أعظم منه\n لعظم جرمهم وعصيانهم\n\n\nاذكر لهم يا أكمل الرسل توبيخاً لهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" يوم تشهد \": ظرف للاستقرار\n في \" لهم \" \n أو: معمول لا ذكر\n يقول الحق جل جلاله: { إن الذين يرمون } يقذفون { المحصَنَاتِ } العفائف مِمَا رُمين به من الفاحشة\n { الغافلاتِ } عنها على الإطلاق\n بحيث لم يخطر ببالهن شيء منها ولا من مقدماتها\n أو السليمات الصدور\n النقيات القلوب\n اللاتي ليس فيهن دهاء ولا مكر لأنهن لم يُجربن الأمور\n { المؤمنات } المتصفات بالإيمان بكل ما يجب الإيمان به\n إيماناً حقيقياً لا يُخالجه شيء مما يكدره\n عن ابن عباس: هنّ أزواج النبي صلى الله عليه وسلم\n وقيل: جميع المؤمنات إذ العبرة بعموم اللفظ لا بخصوص السبب\n وقيل: أريدت عائشة وحدها\n وإنما جمع لأن من قذف واحدة من أزواج النبي صلى الله عليه وسلم فكأنه قذفهنّ\n ثم ذكر الوعيد\n فقال: { لُعِنُوا في الدنيا والآخرة } \n حيث يلعنهم اللاعنون من المؤمنين والملائكة أبداً\n { ولهم } مع ذلك { عذابٌ عظيم } \n هائل لا يُقادَرُ قَدْرُهُ لعظم ما اقترفوه من الجناية\n إن لم يتوبوا\n فيعذبون\n { يوم تشهدُ عليهم ألسنتُهم وأيديهم وأرجلُهم بما كانوا يعملون } أي: بما أَفكوا وبَهَتُوا { يومئذٍ يُوفّيهم الله دينَهُم } أي: يوم تشهد جوارحُهم بأعمالهم القبيحة يُوفيهم الله جزاءهم { الحقَّ } أي: الثابت الذي يحق أن يثبت لهم لا محالة\n أو الذي هم أهله\n والحق: صفة لدينهم\n أو لله\n ونصب على المدح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:17",
      "similarity": 0.5584026871150436
    },
    {
      "verse": "24:4",
      "similarity": 0.5516769349584435
    },
    {
      "verse": "24:6",
      "similarity": 0.5229422516582374
    },
    {
      "verse": "77:32",
      "similarity": 0.49383550007554455
    },
    {
      "verse": "4:112",
      "similarity": 0.38773225444301085
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}