{
  "chapter": "النور",
  "text": "الزانية والزانى فاجلدوا۟ كل وحد منهما ما۟ئة جلدة ولا تاخذكم بهما رافة فى دين الله ان كنتم تؤمنون بالله واليوم الءاخر وليشهد عذابهما طائفة من المؤمنين",
  "translations": [
    {
      "translation": "The adulteress and adulterer should be flogged a hundred lashes each, and no pity for them should deter you from the law of God, if you believe in God and the Last Day; and the punishment should be witnessed by a body of believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The woman and the man guilty of fornication, flog each one of them with a hundred stripes - and let not any pity for them restrain you in regard to a matter prescribed by Allah, if you believe in Allah and the Last Day, and let, some of the believers witness the punishment inflicted on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Flog the fornicatress and the fornicator with a hundred lashes each. Let there be no reluctance in enforcing the laws of God, if you have faith in God and the Day of Judgment. Let it take place in the presence of a group of believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulteress and the adulterer – punish each one of them with a hundred lashes; and may you not have pity on them in the religion to Allah, if you believe in Allah and the Last Day; and a group of believers must witness their punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Zaniyah and the Zani, flog each of them with a hundred stripes. Let not pity withhold you in their case, in a punishment prescribed by Allah, if you believe in Allah and the Last Day. And let a party of the believers witness their punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) the fornicatress and the fornicator, flog each of them, (giving) a hundred stripes, and let not pity for them detain you in the matter of obedience to Allah, if you believe in Allah and the last day, and let a party of believers witness their chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fornicatress and the fornicator -- scourge each one of them a hundred stripes, and in the matter of God's religion let no tenderness for them seize you if you believe in God and the Last Day; and let a party of the believers witness their chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulterer and the adulteress, scourge ye each one of them (with) a hundred stripes. And let not pity for the twain withhold you from obedience to Allah, if ye believe in Allah and the Last Day. And let a party of believers witness their punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Flog the adulteress and the adulterer, each one of them, with a hundred lashes. Let no pity for them cause you to disobey God, if you truly believe in God and the Last Day; and let their punishment be witnessed by a number of believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulteress and the adulterer: scourge each one of the twain with a hundred stripes. And let not tenderness rake hold of you in regarad to the twain in the law of Allah, if ye have come to believe in Allah and the Last Day. And let witness this torment a band of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the fornicatress and the fornicator, strike each of them a hundred lashes, and let not pity for them overcome you in Allah’s law, if you believe in Allah and the Last Day, and let their punishment be witnessed by a group of the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The woman and the man guilty of adultery or fornication,- flog each of them with a hundred stripes: Let not compassion move you in their case, in a matter prescribed by Allah, if ye believe in Allah and the Last Day: and let a party of the Believers witness their punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The woman and the man guilty of illegal sexual intercourse, flog each of them with a hundred stripes. Let not pity withhold you in their case, in a punishment prescribed by Allah, if you believe in Allah and the Last Day. And let a party of the believers witness their punishment. (This punishment is for unmarried persons guilty of the above crime but if married persons commit it, the punishment is to stone them to death, according to Allah's Law).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall lash the fornicatress and the fornicator each with a hundred lashes. In the religion of Allah, let no tenderness for them seize you if you believe in Allah and the Last Day; and let their punishment be witnessed by a party of believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulteress and the adulterer—whip each one of them a hundred lashes, and let no pity towards them overcome you regarding God’s Law, if you believe in God and the Last Day. And let a group of believers witness their punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The [unmarried] woman or [unmarried] man found guilty of sexual intercourse - lash each one of them with a hundred lashes, and do not be taken by pity for them in the religion of Allah, if you should believe in Allah and the Last Day. And let a group of the believers witness their punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:2] As for the fornicatress and the fornicator, that is, of those not in wedlock — because those [in wedlock] are stoned according to the Sunna (the al [in al-zāniya, ‘the fornicatress’, and al-zānī, ‘the fornicator’] according to some mentioned [opinions] is a relative [particle]; the clause [al-zāniyatu wa’l-zānī] is a subject, and because of its similarity to a conditional, the fā’ has been inserted into the predicate, which is [the following, fa’jlidū]): strike each of them a hundred lashes, [a hundred] strikes (one says jaladahu to mean daraba jildahu, ‘he struck him on the skin’). According to the Sunna, in addition to this [punishment] there is also banishment for a whole year. The slave, however, receives half of the mentioned [punishment]. And do not let any pity for them overcome you in God’s religion, that is to say, in [the fulfilment of] His rulings, by disregarding any part of their prescribed punishment, if you believe in God and the Last Day, namely, the Day of Resurrection: in this [statement] there is an incitement to [abide by] what was [mentioned] before the conditional [above] and it also constitutes the response to the latter, or [at least is] an indication of the response to it. And let their punishment, the flogging, be witnessed by a group of the believers — some say [that this should be a group of] three; some say four, as in the number of witnesses testifying to an act of fornication.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The adulterer and the adulteress) who are unmarried and have not been married before, (scourge ye each one of them (with) a hundred stripes) flog each one of them a hundred times. (And let not pity for the twain) for applying the legal punishment (withhold you from obedience to Allah) withhold you from executing Allah's legal ruling on them, (if ye believe in Allah and the Last Day) in resurrection after death. (And let a party of believers) one man, two or more so that the punishment is preserved (witness their punishment) witness the execution of the punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحدّثنا أبو حعفر\n قال: حدّثنا علي بن أحمد\n قال حدّثنا عطاءُ بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ\n في قوله تعالى: { وَلاَ تَأْخُذْكُمْ بِهِمَا رَأْفَةٌ فِي دِينِ ٱللَّهِ } معناه رحمةٌ فِي تَركِ الضَّربِ\n\n\n\n\nوقوله تعالى: { طَآئِفَةٌ مِّنَ ٱلْمُؤْمِنِينَ } معناه رجلٌ فَما فَوقهُ إلى الألفِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أخذ سبحانه بتطهير المؤمنين عن أفحش الفواحش وأقبح الآثام، فقال: { ٱلزَّانِيَةُ وَٱلزَّانِي } أي: حكمهما وحدهما فيما فرضناهما، وتلوناها عليكم أيها المؤمنين الجَلد، قدَّم سبحانه الزانية؛ لأن وقوع الزنا في الأغلب من جانبهن، ومن غرض نفوسهن، وزينتهن على الرجال، وإذا سمعتم أيها الحكام الحدودَ والحُكمَ فيهما { فَٱجْلِدُواْ } بعدما ثبت الزنا بينما، وهما غير محصنين؛ إذ حكم المحصن مطلقاً بالإجماع رجمُ كل منهما إن كانا محصنين، ورجم أحدهما إن كان الآخر غير محصن\n\n\n\n\nوالمحصن هو: المسلم الحر العاقل البالغ الذي وقع منه الوقاع بنكاحٍ صحيح { كُلَّ وَاحِدٍ مِّنْهُمَا مِئَةَ جَلْدَةٍ } أي: مائة ضربةٍ بسوطٍ مؤلمةٍ مجلدةٍ أشدَّ إيلامٍ بدل ضرباتٍ استلذَّ بها حال الوقاع\n\n\n\n\nوزاد الإمام الشاافعي - رحمه الله - على جلد المائة تغريبَ العام؛ إذ هو أحوطُ وأَدخلُ في الانزجار، لقوله صلى الله عليه وسلم:\n\n \" البِكْرُ بِالبِكْرِ جَلْدُ مِائة وَتَعْرِيْبُ عَامْ \"\n \n\n \n\n{ وَلاَ تَأْخُذْكُمْ } أيها الحكام وقت إجرائكم الحدودَ والأحكامَ { بِهِمَا رَأْفَةٌ } رقةُ ومرحمةُ تضيّعون بها حكمة الحد؛ إذ لا رأفة { فِي دِينِ ٱللَّهِ } وتفيِيذ أحكامه وحدودِه الموضوعة فيه { إِن كُنتُمْ } أيها لاحكام المقيمون للأحكام والحدود { تُؤْمِنُونَ بِٱللَّهِ } وبجميع ما جاء به من عنده من الأوامر والنواهي، وجميع الحدود الموضوعة من عنده { وَٱلْيَوْمِ ٱلآخِرِ } الذي فيه تبلى السرائر وتكشف الضمائر، فلكم أن تقيموا حدود الله على الوجه الذي أُمرت به؛ لئلا تؤاخذوا في يوم الجزاء\n\n\n\n\n{ وَ } بعدما قصدتم أيها الحكام إجراء الحد عليهما { لْيَشْهَدْ } أي: ليحضر وليبصر { عَذَابَهُمَا طَآئِفَةٌ } أي: جميعٌ حثيرُ { مِّنَ ٱلْمُؤْمِنِينَ } [النور: 2] المعتبرين تفيضيحاً لهما، وتشهيراً لأمرهما؛ لينزجرا مما جرى عليهما مَن في قلبه ميلُ إلى أمثا ما أَتَيَا به من الفعلة القبيحة والديدنة الشنيعة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تأخذكم بهما رأفةٌ } أي: رحمة ورقة\n وفيها لغات: السكونُ، والفتح مع القصر والمد، كالنشأة والنشاءة، وقيل: الرأفة في دفع المكروه، والرحمة في إيصال المحبوب\n { في دين الله } أي: طاعته وإقامة حدوده، والمعنى: أن الواجب على المؤمنين أن يتصلبوا في دين الله، ولا يأخذهم اللين حتى يتركوا حدود الله\n { إن كنتم تؤمنون بالله واليوم الآخر } ، هو من باب التهييج، وإلهاب الغضب لله، ولدينه، فإن الإيمان يقتضي الجد في طاعته، والاجتهاد في إجراء أحكامه\n وذكر اليوم الآخر لتذكير ما فيه العقاب في مقابلة المسامحة\n وجواب الشرط: مضمر، أي: إن كنتم تؤمنون بالله فاجلدوا ولا تعطلوا الحد\n قيل لأبي مجلز في هذه الآية: والله إنا لنرحمهم أن يُجلَدَ الرجل أو تُقطع يده، فقال: إنما ذلك في السلطان، ليس له أن يدعهم رحمة لهم\n وجَلَدَ ابن عمر جارية، فقال للجلاد: ظهرَها ورجليها وأسفلها، وخفّف، فقيل له: أين قوله: { ولا تأخذكم بهما رأفة }\n\n\n؟ فقال: أأقتلها؟، إنَّ الله أمرني أن أضربها وأأدبها، ولم يأمرني أن أقتلها\n هـ\n ويجرد للجلد إلا ما يستر العورة\n { وليشهدْ عذابَهما } أي: وليحضر موضع حدِّهما { طائفةٌ من المؤمنين } زيادة في التنكيل، فإن التفضيح قد ينكل أكثر من التعذيب\n قال بعض العلماء: ينبغي أن يقام بين يدي الحكام، ولا يقيمه إلا فضلاء الناس وخيارهم لأنه قيام بقاعدة شرعية، وقُربة تعبدية، يجب المحافظة على فعلها، وقدرها، ومحلها، وحالها، بحيث لا يتعذر شيء من شروطها وحرمتها، فإن دم المسلم وحرمته عظيمة، فيجب مراعاته بكل ما أمكن، فلا يقصر عن الحد، ولا يزاد عليه\n ويطلب الاعتدال في السوط، فلا يكون ليناً جداً، ولا يابساً جداً، وكذلك في الضرب، فلا يرفع يده حتى يرى إبطه، ولا يخفف فيه جداً، بل يتوسط بحيث يؤلمه ولا يضره\n وتسمية الحدّ عذاباً دليل على أنه عقوبة وكفارة\n و \" الطائفة \": فرقة، يمكن أن تكون حافة حول الشيء، من الطوْف، وهو الإدارة، وأقلها: ثلاثة، وقيل: أربعة إلى أربعين\n وعن الحسن: عشرة، والمراد: جمع يحصل به التشهير\n والله تعالى أعلم\n الإشارة: التقوى أساس الطريق، وبها يقع السير إلى عين التحقيق\n فمن لا تقوى له لا طريق له، ومن لا طريق له لا سير له، ومن لا سيرله لا وصول له\n وأعظم ما يتَقي العبدُ شهوةَ الفروج، فهي أعظم الفتن وأقبح المحن، وقد قال عليه الصلاة والسلام:\n\n \" ما تَرَكْتُ بَعْدِي أضَرّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ \" \n\nأو كما قال صلى الله عليه وسلم\n وعن حذيفة رضي الله عنه قال رسول الله صلى الله عليه وسلم:\n\n\n\n \" يا معشر الناس اتقوا الزنا، فإن فيه ستَّ خصال: ثلاثاً في الدنيا، وثلاثاً في الآخرة: فأما اللاتي في الدنيا فيُذهب البهاء، ويورثُ الفقرَ، وينْقُصُ العمرَ، وأما اللاتي في الآخرة فيوجب السخطَة وسوءَ الحسابِ والخلودَ إلى النار \" \n\nوالمراد بنقص العمر: قلة بركته، وبالخلود: طول المكث\n وفي حديث آخر:\n\n \" إن أهل النار ليتأذون من نتن فروج الزناة والزواني \" \n\n، وعن أنس رضي الله عنه قال: قال النبي صلى الله عليه وسلم:\n\n \" إن أعمال أمتي تُعرض عليَّ في كل جمعة مرتين، فاشتد غضب الله على الزناة \" \n\nوقال وهب بن منبه: مكتوب في التوراة: الزاني لا يموت حتى يفتقر، والقواد لا يموت حتى يعمى\n وفي بعض الأخبار القدسية: \" يقول الله عز وجل: أنا الله لا إله إلا أنا، خلقت مكة بيدي، أُغني الحاج ولو بعد حين، وأُفقر الزاني ولو بعد حين \" هذا وباله في الدنيا والآخرة، وأما في عالم البرزخ فتُجعل أرواحهم في تنور من نار، فإذا اشتعلت عَلَوْا مع النار، وإذا خمدت سقطوا إلى أسفلها، هكذا حتى تقوم الساعة، كما في حديث البخاري\n وقال ابن رشد: ليس بعد الشرك أقبح من الزنا لِما فيه من هتك الأعراض واختلاط الأنساب، ومن تاب فإن الله يتوب على من تاب\n وبالله التوفيق\n وقوله تعالى: { ولا تأخذكم بهما رأفة في دين الله }: قال في الإحياء: في الحديث:\n\n \" خيار أمتي أَحِدَّاؤُهَا \" \n\nيعني: في الدين قال تعالى: { ولا تأخذكم بهما رأفة } ، فالغيرة على الحُرَمِ، والغضب لله وعلى النفس، بكفها عن شهوتها وهواها، محمود، وفَقْدُ ذلك: مذمومٌ\n هـ\n وبالله التوفيق\n ثم نهى عن نكاح الزواني فقال: { ٱلزَّانِي لاَ يَنكِحُ إِلاَّ زَانِيَةً\n\n\n }\n",
      "translations": []
    }
  ]
}