{
  "chapter": "النور",
  "text": "فان لم تجدوا۟ فيها احدا فلا تدخلوها حتى يؤذن لكم وان قيل لكم ارجعوا۟ فارجعوا۟ هو ازكى لكم والله بما تعملون عليم",
  "translations": [
    {
      "translation": "And if you find no one at home do not go in until permission has been granted you. And if you are told to go away then go away. That is purer for you. Allah knows what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you find that no one is in, then do not enter unless you have received permission. If you are asked to go away, turn back. That is proper for you. God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, if you do not find anyone therein, do not enter until you have been given permission, and if you are told to go back, you should go back. This is a purer way for you; and Allah has full knowledge of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not find anyone therein, do not enter until you are given permission. If you are told to go away, do so; this is more decent of you. God knows all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not find anyone in them, even then do not enter without the permission of their owners; and if it is said to you, “Go away” then go away – this is much purer for you; and Allah knows your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you find no one therein, still enter not until permission has been given. And if you are asked to go back, go back, for it is purer for you. And Allah is All-Knower of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do not find any one therein, then do not enter them until permission is given to you; and if it is said to you: Go back, then go back; this is purer for you; and Allah is Cognizant of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you find not anyone therein, enter it not until leave is given to you. And if you are told, 'Return,' return; that is purer for you; and God knows the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye find no-one therein, still enter not until permission hath been given. And if it be said unto you: Go away again, then go away, for it is purer for you. Allah knoweth what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you find no one at home, do not go in until permission has been granted you. If you are told to go away, then go away. That is more proper for you. God knows well what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if ye find no one therein, enter not until leave hath been given you. And if it iaid unto you go back, then go back. It is Cleaner for you, and Allah is of that which ye work knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do not find anyone in them, do not enter them until you are given permission. And if you are told: ‘Turn back,’ then do turn back. That is more decent for you. Allah knows best what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye find no one in the house, enter not until permission is given to you: if ye are asked to go back, go back: that makes for greater purity for yourselves: and Allah knows well all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you find no one therein, still, enter not until permission has been given. And if you are asked to go back, go back, for it is purer for you, and Allah is All-Knower of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not find anyone there, do not enter it until permission is given to you. And if you are told 'Return', so return, that is purer for you; and Allah knows the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you find no one in them, do not enter them until you are given permission. And if it is said to you, “Turn back,” then turn back. That is more proper for you. God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not find anyone therein, do not enter them until permission has been given you. And if it is said to you, \"Go back,\" then go back; it is purer for you. And Allah is Knowing of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:28] And if you do not find anyone in them, to give you permission, [still] do not enter them until permission has been given to you. And if it is said to you, when you are seeking permission, ‘Go away,’ then go away, for this, going away, is purer, that is, better, for you, than sitting [and waiting] at the doorstep. And God knows what you do, whether you enter with permission or without it, and He will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if ye find no one therein) in the houses to give you permission to enter, (still enter not until permission hath been given) to enter. (And if it be said unto you: Go away again) and if you are told not to enter, (then go away) and remain not standing at the door of people's houses, (for it is purer for you) for it is better for you than to remain standing at the doors of people's houses. (Allah knoweth what ye do) of asking permission and other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن لَّمْ تَجِدُواْ فِيهَآ } أي: في البيوت { أَحَداً } تستأذنون منه { فَلاَ تَدْخُلُوهَا } لئلا تُتهموا بأنواع التهمة بل اصبروا { حَتَّىٰ يُؤْذَنَ لَكُمْ } أي: لا تدخلوا حتى تجدوا من يأذن لكم { وَ } بعدما وجدتم { إِن قِيلَ لَكُمْ ٱرْجِعُواْ } فالوقت لا يسع بالدخول { فَٱرْجِعُواْ } على الفور بلا تفحصٍ، وتفتيشٍ عن أسبابه على وجه الإلحاح والاقتراح حخغ يفعله جهلة الناس\n\n\n\n\n{ هُوَ } أي: الرجوع بلا تفتيش { أَزْكَىٰ لَكُمْ } وأظهر لنفوسكم من الإلحاح { وَٱللَّهُ } المدبر لمصالحكم { بِمَا تَعْمَلُونَ } وتأملون في نفوسكم { عَلِيمٌ } [النور: 28] يجازيكم على مقتضى علمه وخبرته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإن لم تجدوا فيها } في البيوت { أحداً } ممن يستحق الإذن، من الرجال البالغين وأما النساء والولدان فوجودهم وعدمهم سواء، { فلا تدخلوها } ، على أن مدلول الآية هو النهي عن دخول البيوت الخالية لما فيه من الاطلاع على ما يعتاد الناس إخفاءه، وأما حرمة دخول ما فيه النساء والولدان فمن باب الأولى لما فيه الاطلاع على الحريم وعورات النساء\n فإن لم يُؤذن لكم فلا تدخلوا، واصبروا { حتى يُؤْذَنَ لكم } من جهة من يملك الإذن، أو: فإن لم تجدوا فيها أحداً من أهلها، ولكم فيها حاجة فلا تدخلوها إلا بإذن أهلها لأن التصرف في ملك الغير لا بد أن يكون برضاه\n { وإن قيل لكم ارجِعُوا } أي: إذا كان فيها قوم، وقالوا: ارجعوا { فارجعوا } ولا تُلحُّوا في طلب الإذن، ولا تقِفُوا بالأبواب، ولا تخرقوا الحجاب لأن هذا مما يُوجب الكراهية والعداوة، وإذا نهى عن ذلك لأدائه إلى الكراهية وجب الانتهاء عن كل ما أدى إليها من قرع الباب بعنف، والتصييح بصاحب الدار، وغير ذلك\n وعن أبي عبيد: \" ما قرعت باباً على عالم قط \"\n فالرجوع { هو أزْكَى لكمْ } أي: أطيب لكم وأطهر لِمَا فيه من سلامة الصدور والبُعد عن الريبة، والوقوفُ على الأبواب من دنس الدناءة والرذالة\n { والله بما تعملون عليم } فيعلم ما تأتون وما تذرون مما كلفتموه، فيجازيكم عليه\n وهو وعيد للمخاطبين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:99",
      "similarity": 0.44341620155590555
    },
    {
      "verse": "2:110",
      "similarity": 0.3715406933397937
    },
    {
      "verse": "80:7",
      "similarity": 0.3473231880895548
    },
    {
      "verse": "41:7",
      "similarity": 0.32574071632204166
    },
    {
      "verse": "2:151",
      "similarity": 0.3183196006564613
    }
  ]
}