{
  "chapter": "النور",
  "text": "يومئذ يوفيهم الله دينهم الحق ويعلمون ان الله هو الحق المبين",
  "translations": [
    {
      "translation": "On that Day Allah will pay them in full what is due to them, and they will know that Allah is the Clear Truth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will pay them on that day their just due in full, and they will come to know that God is the tangible Reality.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day Allah will give them the full recompense they deserve, and they will realize that Allah is the very Truth, Who makes the Truth manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day God will give them due recompense and they will know that God is the Supreme Judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day Allah will give them their true punishment, and they will know that Allah only is the Clear Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day Allah will pay them the recompense of their deeds in full, and they will know that Allah, He is the Manifest Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day Allah will pay back to them in full their just reward, and they shall know that Allah is the evident Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon that day God will pay them in full their just due, and they shall know that God is the manifest Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day Allah will pay them their just due, and they will know that Allah, He is the Manifest Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on that Day God will justly requite them, and they will realize that God is the truth, that makes all things manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day Allah shall pay them in full their recompense, and they shall know that Allah! He is the True, the Manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, Allah will pay them in full their due recompense, and they shall know that Allah is the Manifest Reality.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day Allah will pay them back (all) their just dues, and they will realise that Allah is the (very) Truth, that makes all things manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day Allah will pay them the recompense of their deeds in full, and they will know that Allah, He is the Manifest Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon that Day Allah will pay them their due in full, and they will know that Allah is the clear truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, God will pay them their account in full, and they will know that God is the Evident Reality.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day, Allah will pay them in full their deserved recompense, and they will know that it is Allah who is the perfect in justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:25] On that day God will pay them in full their just due, He will requite them with the requital they deserve, and   they shall know that God is the Manifest Truth, since He will have realised for them that requital of His whereof they had been in doubt. Among such [people] is ‘Abd Allāh b. Ubayy. The ‘honourable women’ mentioned above are the Prophet’s (s) wives, regarding whom no repentance has been mentioned [as being possible] in the case of their being falsely accused; those women regarding whom repentance has been mentioned, however, at the beginning of the sūra [verses 4-5], in the case of their being falsely accused, are women other these [wives of the Prophet].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On that day) the Day of Judgement (Allah will pay them their just due) he will fairly requite them for their works, (and they will know that Allah, He is the Manifest Truth) they will know that what Allah said in the life of this world is true.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَوْمَئِذٍ يُوَفِّيهِمُ ٱللَّهُ } المجازي لأعمالهم { دِينَهُمُ } وجزائهم { ٱلْحَقَّ } أي: ما يستحقون من الجزاء بلا زيادة ونقصان عدلاً منه سبحانه { وَ } حنيئذٍ { يَعْلَمُونَ } يقيناً { أَنَّ ٱللَّهَ } القادر على الإنعام والانتقام { هُوَ ٱلْحَقُّ } المقصور على التحقق والثبوت بالقسط والعدل { ٱلْمُبِينُ } [النور: 25] الظاهر ألوهيته وربوبيته على الوجه الأقسط الأعدل الأقوم، بلا ميلٍ منه وانحرافٍ عن جادة الاستقامة والعدل الحقيقي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يوم تشهدُ عليهم ألسنتُهم وأيديهم وأرجلُهم بما كانوا يعملون } أي: بما أَفكوا وبَهَتُوا { يومئذٍ يُوفّيهم الله دينَهُم } أي: يوم تشهد جوارحُهم بأعمالهم القبيحة يُوفيهم الله جزاءهم { الحقَّ } أي: الثابت الذي يحق أن يثبت لهم لا محالة، أو الذي هم أهله، والحق: صفة لدينهم، أو لله، ونصب على المدح\n { ويَعْلَمُونَ } عند ذلك { أن الله هو الحقُّ } الثابت الواجب الوجود { المبين } الظاهر البين لارتفاع الشكوك، وحصول العلم الضروري لارتفاع الغطاء بظهور ما كان وعداً غيباً\n ولم يُغَلِظِ الله تعالى في القرآن في شيء من المعاصي تَغْلِيظَهُ في إفك عائشة - رضي الله عنها - فأوجز في ذلك وأَشْبَعَ، وفَصَّل، وأَجَمَلَ، وأَكَّدَ، وكَرَّرَ، وما ذلك إلا لأمر عظيم\n وعن ابن عباس رضي الله عنه: من أذنب ذنباً وتاب قُبلت توبته، إلا مَن خاض في أمر عائشة - رضي الله عنها، وهذا منه مبالغةً وتعظيم لأمر الإفك، وقد برّأ الله تعالى أربعة برّأ يوسف بشاهدٍ من أهلها، وموسى عليه السلام من قول اليهود فيه: أنه آدر، بالحجر الذي ذهب بثوبه، ومريم بنطق ولدها، وعائشة بهذه الآي العظام في كتابه المعجز، المتلوّ على وجود الدهر، بهذه المبالغات\n فانظر: كم بينها وبين تبرئة أولئك؟‍! وما ذلك إلا لإظهار علوّ منزلة رسوله، والتنبيه على إنَافَةِ محله صلى الله عليه وسلم\n وقد رام بعضُ النصارى الطَّعْنَ على المسلمين بقضية الإفك، فقال: كيف تبقى زوجة نبيكم، مع رجل أجنبي؟ فقال له من كان يناظره من العلماء: قد برأها من برأ أُمَّ نبيكم فبُهت الذي كفر\n والله تعالى أعلم\n الإشارة: قد مدح الله تعالى أزواج النبي صلى الله عليه وسلم بثلاثة أوصاف، هي من أكمل الأوصاف: العفة، والتغافل، وتحقيق الإيمان أما العفة: فهي حفظ القلب من دخول الهوى، والجوارح من معاصي المولى، وأما التغافل: فهو الغيبة عما سوى الله، والتغافل عن مساوئِ الناس\n\n\nوفي الحديث:\n\n \" المؤمن ثلثاه تغافل \" \n\n، وقال أيضاً صلى الله عليه وسلم:\n\n \" المؤمنُ غِرٌّ كَرِيمٌ، والمنافقُ خَبٌّ لَئِيمٌ \" \n\nوأما تحقيق الإيمان فيكون بالتفكر والاعتبار، وبصحبة الصالحين الأبرار، ثم يصير الإيمان ضرورياً بصحبة العارفين الكبار\n قال القشيري: قوله تعالى: { ويعلمون أن الله هو الحق المبين }: تصير المعارف ضروريةً، فيجدون المعافاة في النظر والتذكر، ويستريح القلبُ من وَصْفَيْ تَرَدُّدِه وتَغيُّرِه، باستغنائه ببَصرِه عن تبصره\n ويقال: لا يشهدون هذا إلا بالحق، فهم قائمون بالحق للحق مع الحق، يُبدي لهم أسرارَ التوحيد وحقائقه، فيكون القائمَ فيهم والآخذَ لهم عنهم، من غير أن يردهم عليهم\n هـ\n وبالله التوفيق\n ثم برهن على نزاهة أهل البيت النبوي بقوله: { ٱلْخَبِيثَاتُ لِلْخَبِيثِينَ وَٱلْخَبِيثُونَ لِلْخَبِيثَاتِ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:46",
      "similarity": 0.45976581967187136
    },
    {
      "verse": "83:11",
      "similarity": 0.4545867612082446
    },
    {
      "verse": "1:4",
      "similarity": 0.45448021270885797
    },
    {
      "verse": "53:41",
      "similarity": 0.44816182369675484
    },
    {
      "verse": "56:56",
      "similarity": 0.4410001874430088
    }
  ]
}