{
  "chapter": "النور",
  "text": "ولقد انزلنا اليكم ءايت مبينت ومثلا من الذين خلوا۟ من قبلكم وموعظة للمتقين",
  "translations": [
    {
      "translation": "We have sent down Clear Signs to you and the example of those who passed away before you and an admonition for those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down clear instructions to you, and illustrations from (the accounts) of those who have gone before you, and a warning for those who take heed for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down to you Revelations giving clear guidance and cited examples of the peoples who went before you to serve as warning and We have imparted admonitions for the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed to you illustrious revelations, stories of the past generations, and good advice for the pious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have sent down towards you clear verses, and some account of those who preceded you, and advice for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have sent down for you Ayat that make things plain, and the example of those who passed away before you, and an admonition for those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have sent to you clear communications and a description of those who have passed away before you, and an admonition to those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We have sent down to you signs making all clear, and an example of those who passed away before you, and an admonition for the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We have sent down for you revelations that make plain, and the example of those who passed away before you. An admonition unto those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down clear revelations to you and the example of those who passed away before you and an admonition for the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have sent down unto you revelations illuminating and a similitude for those who passed away before you and an exhortation unto the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have sent down to you manifest signs and a description of those who passed before you, and an advice for the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have already sent down to you verses making things clear, an illustration from (the story of) people who passed away before you, and an admonition for those who fear (Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have sent down for you Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) that make things plain, and the example of those who passed away before you, and an admonition for those who are Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We have sent down to you clarifying verses, and an example of those who passed away before you and admonition to the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down to you clarifying revelations, and examples of those who passed on before you, and advice for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly sent down to you distinct verses and examples from those who passed on before you and an admonition for those who fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:34] And verily We have revealed to you clear verses (read mubayyanāt or mubayyināt), in this sūra, [verses] in which [if read mubayyanāt] what is mentioned is [already] clear, or which [if read mubayyināt] are clarificatory of [that which is mentioned], and an example, a curious tale, namely, that of ‘Ā’isha, of those who passed away before you, that is to say, of their kind of example, that is, [an example] of their curious tales, such as the tales of Joseph and Mary, and an admonition for those who fear God, in what He, exalted be He, has said: And do not let any pity for them overcome you in God’s religion [verse 2, above]; and, Why, when you [first] heard about it, did the believing men [and women] not think [good of themselves]… to the end [of verse 12, above]; and, And why, when you heard it, did you not say … to the end [of verse  , above]; and, God admonishes you lest you should ever repeat [the like of it] … to the end [of verse 17, above]. This [admonition] is specifically for ‘those who fear God’ because they are the ones to benefit from such [an admonition].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We have sent down for you revelations that make plain) He says: We have sent Gabriel to your prophets with revelations that make plain the lawful and the unlawful, the commands and the prohibitions of adultery and indecencies, (and the example of those who passed away before you) the trait of those who passed away from among the believers and disbelievers. (An admonition) a prohibition (unto those who ward off (evil)) adultery and indecencies. 390\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَ } أوضحناها لكم بأن أورنا فيها { مَثَلاً مِّنَ } أحوال الظلمة { ٱلَّذِينَ خَلَوْاْ } ومضَوا { مِن قَبْلِكُمْ } لتعتبروا مما جرى عليهم من سوء صنيعهم { وَ } ليكون قصصُهم { مَوْعِظَةً } وتذكيراً { لِّلْمُتَّقِينَ } [النور: 34] منكم المحترزين من بطشنا وانتقامنا\n ومع ذلك لم تعتبروا ولم تنزجروا\n فتستحقوا أشد العذاب وأسوأ العقاب مثلهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n واحتياجهن إلى المغفرة المنبئة عن سابقة الإثم: إما اعتبار أنهن - وإن كن مُكْرَهَاتٍ - لا يخلون في تضاعيف الزنا من شائبة مطاوعة ما، بحكم الجِبِلَّةِ البشرية، وإما لغاية تهويل أمر الزنا، وحث المكرهات على التثبت في التجافي عنه، والتشديد في تحذير المكرِهِينَ ببيان أنهن حَيْثُ كُنَّ عُرْضَةً للعقوبة، لولا أن تداركهن المغفرة، الرحمة، مع قيام العذر في حقهن، فما بالك بحال من يكرههن في استحقاق العقاب؟ { ولقد أنزلنا إليكم آياتٍ مُبَيِّنَاتٍ } مُو ضِّحَات، أو: واضحات المعنى، والمراد: الآيات التي بُينت في هذه السورة، وأوضحت معاني الأحكام والحدود\n وهو كلام مستأنف جيء به في تضاعيف ما ورد من الآيات السابقة واللاحقة لبيان جلالة شأنها، المقتضي للإقبال الكلي على العمل بمضمونها\n وصُدر بِالْقَسَمِ الذي تُعرب عنه اللام لإبراز كمال العناية بشأنها\n أي: والله، لقد أنزلنا إليكم، في هذه السورة الكريمة، آيات مبينات لكل ما لكم حاجة إلى بيانه من الحدود وسائر الأحكام، وإسناد البيان إليها: مجازي، أو: آيات واضحات تصدقها الكتب القدسية والعقول السليمة، على أن \" مُبَيِّنات \" ، مِنْ بيَّن، بمعنى تبين، كقولهم في المثل: \" قد بيَّن الصبح لذي عينين \" ، أي: تبين\n ومن قرأها بالبناء للمفعول، فمعناه: قد بيَّن الله فيها الأحكام والحدود\n { ومثلاً من الذين خَلَوا مِن قبلكم } أي: وأنزلنا مثلاً من أمثال مَنْ قَبْلَكُم، من القصص العجيبة، والأمثال المضروبة لهم في الكتب السابقة، والكلمات الجارية على ألسنة الأنبياء والحكماء، فتنتظم قصة عائشة - رضي الله عنها - المحاكية لقصة يوسف عليه السلام وقصة مَرْيَمَ، وسائر الأمثال الواردة في السورة الكريمة، انتظاماً واضحاً\n وتخصيص الآيات البينات بالسوابق، وحمل المثل على قصة عائشة المحاكية لقصة يوسف ومريم، يأباه تعقيب الكلام بما سيأتي من التمثيلات\n { و } أنزلنا { موعظةً للمتقين } يتعظون بها، وينزجرون عما لا ينبغي من المحرمات والمكروهات وسائر ما يخُل بمحاسن الآداب، والمراد: ما وعظ به من الآيات والمثل، مثل قوله:\n\n[النور: 2]، و\n\n[النور: 12] إلخ،\n\n[النور:17]\n وتخصيص المتقين لأنهم المنتفعون بها، المغتنمون لآثارها، المقتسبون لأنوارها، ومدار العطف هو التَّغَايُرُ العنواني المُنَزَّلُ مَنْزِلَةَ التغايُرِ الذاتي\n وقد خصَّت الآيات بما بيّن الأحكامَ والحدودَ، والموعظة بما وعظ به من قوله: { ولا تأخذكم\n\n\n } إلى آخر ما تقدم\n\n\nوقيل: المراد بالآيات المبينات والمثل والموعظة: جميع ما في القرآن المجيد من الأمثال والمواعظ والله تعالى أعلم\n الإشارة: كل من أمر بالمعصية ودلَّ عليها، أو رضي فعلها، فهو شريك الفاعل في الوزر، أو أعظم\n وكل من أمر بالطاعة ودلّ عليها فهو شريك الفاعل في الثواب، أو أعظم\n وفي الأثر:\n\n \" الدَّالُّ عَلَى الخَيْرِ كَفَاعِلِه \"\n \n\nقال القشيري: حامِلُ العاصي على زَلَّته، والداعي له إلى عَثْرَته، والمُعِينُ له على مخالفته، تتضاعف عليه العقوبة، وله من الوِزْرِ أكثرُ من غيره، وعكسه لو كان الأمر في الطاعة والإعانة على العبادة\n هـ\n ومن هذا القبيل: تعليم العلم لمن تحقق أنه يطلب به رئاسةً أو جاهاً، أو تَوَصُّلاً إلى الدنيا المذمومة، أو عَلِمَ منه قصداً فاسداً، فإن تحقق ذلك وعَلِمَه، فهو مُعين له على المعصية، كمن يعطي سيفاً لمن يقطع به الطريق على المسلمين\n والله تعالى أعلم\n ثم إن أنوار الشريعة وهي أحكام المعاملة الظاهرة تهدي إلى أنوار الطريقة وهي أحكام المعاملة الباطنة وأنوار الطريقة تهدي إلى أنوار الحقيقة وأنوار الحقيقة تصير الكون كله نوراً كما قال تعالى: { ٱللَّهُ نُورُ ٱلسَّمَاوَاتِ وَٱلأَرْضِ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:138",
      "similarity": 0.5931115481657473
    },
    {
      "verse": "10:102",
      "similarity": 0.5121711214888391
    },
    {
      "verse": "26:136",
      "similarity": 0.479624502862744
    },
    {
      "verse": "84:4",
      "similarity": 0.4774874839732263
    },
    {
      "verse": "24:17",
      "similarity": 0.4598802489537483
    }
  ]
}