{
  "chapter": "النور",
  "text": "رجال لا تلهيهم تجرة ولا بيع عن ذكر الله واقام الصلوة وايتاء الزكوة يخافون يوما تتقلب فيه القلوب والابصر",
  "translations": [
    {
      "translation": "not distracted by trade or commerce from the remembrance of Allah and the establishment of salat and the payment of zakat; fearing a day when all hearts and eyes will be in turmoil -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By men not distracted from the remembrance of God either by trade and commerce or buying and selling, who stand by their devotional obligations and pay the zakat, who fear the day when hearts and eyes would flutter with trepidation\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as are not diverted by trade and merchandise from remembering Him and from establishing Salat and paying Zakat, for they fear the Day when the hearts will be overturned and the eyes will become petrified.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by people, who can neither be diverted by merchandise nor bargaining from worshipping God, saying their prayers and paying religious tax. They do these things, for they are afraid of the day when all hearts and eyes will undergo terrible unrest and crisis.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Are) Those men, whom neither any bargain nor any trade distracts from the Remembrance of Allah and from establishing the prayer and from paying the charity – they fear the day when the hearts and the eyes will be overturned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men whom neither trade nor business diverts from the remembrance of Allah nor from performing the Salah nor from giving the Zakah. They fear a Day when hearts and eyes will be overturned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men whom neither merchandise nor selling diverts from the remembrance of Allah and the keeping up of prayer and the giving of poor-rate; they fear a day in which the hearts and eyes shall turn about;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "are men whom neither commerce nor trafficking diverts from the remembrance of God and to perform the prayer, and to pay the alms, fearing a day when hearts and eyes shall be turned about,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men whom neither merchandise nor sale beguileth from remembrance of Allah and constancy in prayer and paying to the poor their due; who fear a day when hearts and eyeballs will be overturned;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "people who are not distracted by trade or commerce from the remembrance of God and the observance of prayer and the payment of the zakat -- fearing a Day when hearts and eyes will be convulsed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men whom neither trafficking nor bargaining diverteth from the remembrance of Allah and the establishment of the prayer and the giving of the poor-rate, fearing a Day whereon upset will be the hearts and sights.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by men whom neither trade nor bargaining distracts from the remembrance of Allah and the maintenance of prayer and the giving of zakat. They are fearful of a day wherein the hearts and the sights will be transformed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By men whom neither traffic nor merchandise can divert from the Remembrance of Allah, nor from regular Prayer, nor from the practice of regular Charity: Their (only) fear is for the Day when hearts and eyes will be transformed (in a world wholly new),-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men whom neither trade nor sale diverts them from the Remembrance of Allah (with heart and tongue), nor from performing As-Salat (Iqamat-as-Salat), nor from giving the Zakat. They fear a Day when hearts and eyes will be overturned (from the horror of the torment of the Day of Resurrection).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "are men who exalt Him there, whom neither trade nor sale can divert from the remembrance of Allah, and establish the prayers, and pay the obligatorycharity; fearing a Day when hearts and eyes shall be turned about,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By men who neither trading nor commerce distracts them from God’s remembrance, and from performing the prayers, and from giving alms. They fear a Day when hearts and sights are overturned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Are] men whom neither commerce nor sale distracts from the remembrance of Allah and performance of prayer and giving of zakah. They fear a Day in which the hearts and eyes will [fearfully] turn about -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:37] men (rijālun, the subject of the verb yusabbihu, ‘make glorifications’; if [the passive is] read, yusabbahu, ‘glorifications are made’, it [rijālun, ‘men’] substitutes for the [impersonal] subject of lahu, ‘to Him’, so that rijālun, ‘men’, is the subject of an implied verb in response to an implied question as if one had asked: who makes glorifications to Him?) whom neither trading, purchase, nor sale distracts from the remembrance of God and the observance of prayer (the [final] hā’ of iqāmat, ‘the observance’, has been omitted to facilitate [the reading]) and payment of the alms. They fear a day when hearts and eyes will be tossed about, in fear, the hearts [tossed about] between [the hope of] deliverance and [the fear of] destruction, and the eyes to the right and to the left [out of anxiety] — this is the Day of Resurrection;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Men whom neither merchandise) which may bring them profit (nor) hand to hand (sale beguileth) preoccupies (from remembrance of Allah) from the obedience of Allah; it is also said that this means: from performing the five daily prayers (and constancy in prayer) the performance of the five daily prayers with their required ritual ablution, bowings, prostrations and that which is enjoined in their prescribed times (and paying) from their wealth (to the poor their due; who fear a day) who fear the chastisement of the Day of Judgement (when hearts and eyeballs will be overturned) changing from state to state, such that sometimes they are aware and sometimes they are not; 391\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ولا بيع أنفسهم وأموالهم بأن لهم الجنة في جهادهم عن ذكر الذات { وإقام } صلاة الشهود في الفناء { وإيتاء } زكاة الإرشاد والتكميل حال البقاء { يخافون يوماً تتقلّب فيه القلوب } إلى الأسرار { والأبصار } إلى البصائر\n بل تتقلب حقائقها بأن تفنى وتوجد بالحق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رِجَالٌ } كمَّل مخلصون منجذبون نحو الحق\n مشمرون ذيل هممهم لسلوك طريق الفناء\n منقطعون عن الدنيا وما فيها\n بحيث { لاَّ تُلْهِيهِمْ } وتشغلهم { تِجَارَةٌ } وأرباح متعلقة بالأمور الدنيوية أو الأخروية { وَلاَ بَيْعٌ } أيضاً كذلك { عَن ذِكْرِ ٱللَّهِ } والتوجه نحو جنابه\n والعكوف على بابه { وَإِقَامِ ٱلصَّلاَةِ } ودوام الميل والمناجاة معه { وَإِيتَآءِ ٱلزَّكَـاةِ } إي: إنفاقُ ما في أيديهم خالصاً لطلب المرضاة\n ومع ذلك { يَخَافُونَ يَوْماً } أي: عذاب يوم القيامة\n وما لحق فيها من النكال\n إذ من شدة هولها { تَتَقَلَّبُ } أي: تتلقلق وتضطرب { فِيهِ ٱلْقُلُوبُ } تدهش فيه { وَٱلأَبْصَارُ } [النور: 37]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا بيعٌ } في الحضر\n { عن ذكر الله } باللسان والقلب\n وقيل: التجارة: الشراء\n أي: لا يشغلهم شراء ولا بيع عن ذكر الله\n والجملة صفة لرجال\n مؤكدة لما أفاده التنكير من الفخامة\n مفيدة لكمال تَبَتُّلِهِمْ إلى الله تعالى\n واستغراقهم فيما حكى عنهم من التسبيح من غير صارف يلويهم ولا عاطف يثنيهم\n وتخصيصُ التِّجَارَةِ بالذكر لكونها أقوى الصوارف عندهم وأشهرها\n أي: لا يشغلهم نوع من أنواع التجارة\n ولا فرد من أفراد البياعات\n وإن كان في غاية الربح\n وإفراده بالذكر\n مع اندراجه تحت التجارة لأنه ألهى لأن ربحه متيقن ناجز في الغالب\n وما عداه متوقع في ثاني الحال\n { و } لا يشغلهم ذلك أيضاً عن { إِقامِ الصلاةِ } أي: إقامتها لمواقيتها من غير تأخير\n وأصله: وإقامة\n فأسقطت التاء المعوضة عن العين الساقطة بالإعلال\n وعوض عنها الإضافة\n فأقيمت الإضافة مقام التاء\n { وإِيتاء الزكاة } أي: وعن إيتاء الزكاة\n وذكرها\n وإن لم يكن مما تفعل في البيوت\n لكونها قرينتها لا تفارق إقامة الصلاة في عامة المواضع\n مع ما فيه من التنبيه على أن مَحَاسِنَ أعمالهم غَيْرُ مُنْحَصِرَةٍ فيما يقع في المساجد\n والمعنى: لا تجارة لهم حتى تلهيهم\n أو يبيعون ويشترون ويذكرون الله مع ذلك\n لا يشغلهم عن ذكر الله شيء\n وإذا حضرت الصلاة قاموا إليها مسرعين\n\n{ يخافون يوماً } أي: يوم القيامة { تتقلَّبُ فيه القلوبُ } أي: تضطرب وتتغير من الهول والفزع\n وتبلغ إلى الحناجر\n { و } تتقلب { الأبصارُ } بالشخوص أو الزرقة\n أو تتقلب القلوب إلى الإيمان بعد الكفران\n والأبصار إلى العيان بعد النكران\n كقوله:\n[ق: 22]\n يفعلون ذلك الاستغراق في التسبيح والذكر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "62:11",
      "similarity": 0.532295174105544
    },
    {
      "verse": "4:29",
      "similarity": 0.4363324123760703
    },
    {
      "verse": "61:10",
      "similarity": 0.375717096117923
    },
    {
      "verse": "62:9",
      "similarity": 0.37382384958404047
    },
    {
      "verse": "14:31",
      "similarity": 0.3282128061231489
    }
  ]
}