{
  "chapter": "النور",
  "text": "الله نور السموت والارض مثل نوره كمشكوة فيها مصباح المصباح فى زجاجة الزجاجة كانها كوكب درى يوقد من شجرة مبركة زيتونة لا شرقية ولا غربية يكاد زيتها يضىء ولو لم تمسسه نار نور على نور يهدى الله لنوره من يشاء ويضرب الله الامثل للناس والله بكل شىء عليم",
  "translations": [
    {
      "translation": "Allah is the Light of the heavens and the earth. The metaphor of His Light is that of a niche in which is a lamp, the lamp inside a glass, the glass like a brilliant star, lit from a blessed tree, an olive, neither of the east nor of the west, its oil all but giving off light even if no fire touches it. Light upon Light. Allah guides to His Light whoever He wills and Allah makes metaphors for mankind and Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the light of the heavens and the earth. The semblance of His light is that of a niche in which is a lamp, the flame within a glass, the glass a glittering star as it were, lit with the oil of a blessed tree, the olive, neither of the East nor of the West, whose oil appears to light up even though fire touches it not, -- light upon light. God guides to His light whom He will. So does God advance precepts of wisdom for men, for God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the light of the heavens and the earth: His light (in the universe) may be likened (to the light of) a lamp in a niche: the lamp is in a glass shade: the glass shade is like a glittering star and lamp is lit with the olive oil of a blessed tree which is neither eastern nor western: its oil is (so fine) as if it were going to shine forth by itself though no fire touched it (as though all the means of increasing) light upon light (were provided); Allah guides to His light whomever He wills. He cites parables to make the Message clear to the people; He has perfect knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the light of the heavens and the earth. A metaphor for His light is a niche in which there is a lamp placed in a glass. The glass is like a shining star which is lit from a blessed olive tree that is neither eastern nor western. Its oil almost lights up even though it has not been touched by the fire. It is light upon light. God guides to His light whomever He wants. God uses various metaphors. He has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Light of the heavens and the earth; the example of His light is like a niche in which is a lamp; the lamp is in a glass; the glass is as if it were a star shining like a pearl, kindled by the blessed olive tree, neither of the east nor of the west – it is close that the oil itself get ablaze although the fire does not touch it; light upon light; Allah guides towards His light whomever He wills; and Allah illustrates examples for mankind; and Allah knows everything. (The Holy Prophet is a light from Allah)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Light of the heavens and the earth. The parable of His Light is as a niche and within it a lamp: the lamp is in a glass, the glass as it were a star Durriyyun, lit from a blessed tree, an olive, neither of the east nor of the west, whose oil would almost glow forth, though no fire touched it. Light upon Light! Allah guides to His Light whom He wills. And Allah sets forth parables for mankind, and Allah is All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the light of the heavens and the earth; a likeness of His light is as a niche in which is a lamp, the lamp is in a glass, (and) the glass is as it were a brightly shining star, lit from a blessed olive-tree, neither eastern nor western, the oil whereof almost gives light though fire touch it not-- light upon light-- Allah guides to His light whom He pleases, and Allah sets forth parables for men, and Allah is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the Light of the heavens and the earth; the likeness of His Light is as a niche wherein is a lamp (the lamp in a glass, the glass as it were a glittering star) kindled from a Blessed Tree, an olive that is neither of the East nor of the West whose oil wellnigh would shine, even if no fire touched it; Light upon Light; (God guides to His Light whom He will.) (And God strikes similitudes for men, and God has knowledge of everything.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Light of the heavens and the earth. The similitude of His light is as a niche wherein is a lamp. The lamp is in a glass. The glass is as it were a shining star. (This lamp is) kindled from a blessed tree, an olive neither of the East nor of the West, whose oil would almost glow forth (of itself) though no fire touched it. Light upon light. Allah guideth unto His light whom He will. And Allah speaketh to mankind in allegories, for Allah is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the light of the heavens and the earth. His light may be compared to a niche containing a lamp, the lamp inside a crystal of star-like brilliance lit from a blessed olive tree, neither of the east nor of the west. The [luminous] oil is as if ready to burn without even touching it. Light upon light; God guides to His light whom He will. God draws such comparisons for mankind; God has full knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the light of the heavens and the earth: the likeness of His light is as a niche wherein is a lamp; the lamp is in glass; the glass is as though it were a star brilliant; lit from a tree blest, an olive, neither in the east nor in the west; well-nigh its oil would glow forth even though fire touch it not. light upon light. Allah guideth unto His light whomsoever He will: And Allah propoundeth similitudes for mankind: verily Allah is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Light of the heavens and the earth. The parable of His Light is a niche wherein is a lamp—the lamp is in a glass, the glass as it were a glittering star—lit from a blessed olive tree, neither eastern nor western, whose oil almost lights up, though fire should not touch it. Light upon light. Allah guides to His Light whomever He wishes. Allah draws parables for mankind, and Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Light of the heavens and the earth. The Parable of His Light is as if there were a Niche and within it a Lamp: the Lamp enclosed in Glass: the glass as it were a brilliant star: Lit from a blessed Tree, an Olive, neither of the east nor of the west, whose oil is well-nigh luminous, though fire scarce touched it: Light upon Light! Allah doth guide whom He will to His Light: Allah doth set forth Parables for men: and Allah doth know all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Light of the heavens and the earth. The parable of His Light is as (if there were) a niche and within it a lamp, the lamp is in glass, the glass as it were a brilliant star, lit from a blessed tree, an olive, neither of the east (i.e. neither it gets sun-rays only in the morning) nor of the west (i.e. nor it gets sun-rays only in the afternoon, but it is exposed to the sun all day long), whose oil would almost glow forth (of itself), though no fire touched it. Light upon Light! Allah guides to His Light whom He wills. And Allah sets forth parables for mankind, and Allah is All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Lighter of the heavens and the earth. The example of His Light is like a tube, in which there is a wick. The wick is in a lamp and the lamp is as a glittering planet kindled from a Blessed Tree, an olive that is neither of the East nor of the West. Its oil would almost shine forth though no fire touched it. Light upon light; Allah guides to His Light whom He will. Allah strikes parables for people. Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the Light of the heavens and the earth. The allegory of His light is that of a pillar on which is a lamp. The lamp is within a glass. The glass is like a brilliant planet, fueled by a blessed tree, an olive tree, neither eastern nor western. Its oil would almost illuminate, even if no fire has touched it. Light upon Light. God guides to His light whomever He wills. God thus cites the parables for the people. God is cognizant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Light of the heavens and the earth. The example of His light is like a niche within which is a lamp, the lamp is within glass, the glass as if it were a pearly [white] star lit from [the oil of] a blessed olive tree, neither of the east nor of the west, whose oil would almost glow even if untouched by fire. Light upon light. Allah guides to His light whom He wills. And Allah presents examples for the people, and Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:35] God is the Light of the heavens and the earth, in other words, He illumines both of them with the sun and the moon. The likeness of His Light, that is, the description of it [as it resides] in the heart of a believer, is as a niche wherein is a lamp. The lamp is in a glass — this [glass] is the [case for the] lantern and the misbāh is the torch, that is, the wick that is lit; al-mishkāt is a recess that does not penetrate [to the other side], in other words, the tube inside the lantern, the glass, with the light inside it [is], as it were a glittering star, that is, a light-giving [star] (read dirrī’un or durrī’un, derived from al-dar‘, ‘to repel’, because it repels darkness; or read durriyyun, derived from al-durr, ‘pearls’) kindled, is this lamp (read past tense tawaqqada; a variant reading has the imperfect tense of awqada, in the passive voice: yūqadu; another reading has tūqadu, in which case the reference is to al-zujāja, ‘the glass’) from, the oil of, a Blessed Tree, an olive neither of the east nor of the west, but in between the two, so that no harmful cold or heat affects it; whose oil would almost glow forth [of itself], though no fire touched it, because of [the extent of] its purity. Light, by Him, upon light, by fire; the light of God is His guidance of the believer, light upon the light of faith. God guides to His Light, that is, [to] the religion of Islam, whom He will. And God strikes, He illustrates, similitudes for men, by approximating [such similitudes] to their comprehension, so that they might take heed and believe; and God is Knower of all things, including [knowledge of] how to strike similitudes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the honour and blessings that He had bestowed upon the believers, saying: (Allah is the Light of the heavens and the earth) He is the guide of the dwellers of the heaves and earth. Guidance from Allah is of two types: clarification and making things known; it is also said that the verse means: Allah is the embellisher of the heavens by means of the stars and the embellisher of the earth by means of plants and water; it is also said that this means: Allah enlightens the hearts of the believers among the dwellers of the heavens and the earth. (The similitude of His light) the light of the believers; it is also said that this means: the light of Allah in the heart of the believer (is as a niche wherein is a lamp. The lamp is in a glass) made of gems. (The glass is as it were a shining star) one of the following five planets: Mercury, Jupiter, Venus, Mars and Saturn. All these planets are luminous. ((This lamp is) kindled from a blessed tree) from the oil of a blessed tree, (an olive neither of the East nor of the West) in an open space, not touched by the shade of the East nor by the shade of the West; it is also said that this means: in a location which is untouched by the sun when it rises and when it sets, (whose oil) the oil of the tree (would almost glow forth (of itself)) from behind its rind (though no fire touched it. Light upon light) the lamp emits light and the glass emits light and the oil emits light, (Allah guideth unto His light) Allah honours with knowledge; it is also said that this means: Allah honours with His religion (whom He will) whoever deserves it; it is also said that the verse means: the likeness of the light of Muhammad in the loins of his forefathers is like this, up to Allah's saying (... kindled from a blessed tree). He says: the light of Muhammad in Abraham was an upright religion (olive tree), and Abraham was neither Jew nor Christian (neither of the East nor of the West), the works of Abraham would almost glow forth in the loins of his forefathers like this (would almost glow forth (of itself)), up until Allah's saying (kindled from a blessed tree) He says: as if it is the light of Muhammad (pbuh) and if Abraham was not a prophet, he would still have this light (though no fire touched it); it is also said that the latter passage means: Had Allah not honoured Abraham, he would not have had this light; it is also said: if Allah had not honoured His believing servant with this light, he would not have had it. (And Allah speaketh to mankind in allegories) in this way does Allah show to people the trait of knowledge, (for Allah is knower of all things) regarding the honour He bestows upon His servants. Allah struck this similitude of knowledge and clarified its benefit and its praiseworthiness in order that they give thanks to it. Allah says here that just as one uses a lamp to find his way in the dark, so is the light of knowledge used for one's guidance; and just as one uses the stars and planets to find one's way in the darkness of the seas and land, one also uses the light of knowledge for guidance in the darkness of disbelief and idolatry; and just as the oil of a lamp is taken from the blessed olive tree, so too is knowledge from Allah, Exalted is He, for His servant; and just as the olive tree is neither from the East nor from the West, so too is the believer an upright Muslim, neither Jew nor Christian; and just as the oil of the olive tree would almost glow forth of itself even when no fire touches it, so too the faith of the believer is praiseworthy even when there are no virtuous works to accompany it; and just as the niche and the glass and the lamp are light upon light, so too is knowledge light, and the heart of the believer is light and his chest is light and his incoming is light and his outgoing is light: light upon light; and Allah honours with this light whomever He wills. Such is Allah's description of knowledge.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱللَّهُ نُورُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناه نور السَّمواتُ والأَرضِ { مَثَلُ نُورِهِ [كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ] } يعني محمداً صلى الله عليهِ وعَلَى آله وسلَّمَ\n ويقال المؤمنُ\n والمِشكاةُ: الكُوةُ في الحَائطِ التي لا منفذَ لَها بلسانِ الحَبشةِ\n والمِصباحُ: السِّراجُ\n\n\n\n\nوقوله تعالى: { كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ } وهي من النُّجومِ التي تَجري\n والدُّرِّيُّ: المضيءُ - والجمعُ: الدراريّ - مشددٌ غَير مَهموزٍ، وقد يُهمزُ\n ويقال الدُّريُ: الضخمُ الحسنُ البراقُ\n ويقال الدّرِّيءُ: الطَّالِع ويُقرأ دُري بضم الدال وغير مهموز يَنسبهُ إلى الله عزّ وجلّ\n\n\n\n\nوقوله تعالى: { يُوقَدُ مِن شَجَرَةٍ مُّبَارَكَةٍ زَيْتُونَةٍ لاَّ شَرْقِيَّةٍ وَلاَ غَرْبِيَّةٍ } معناه وسطُ البَحرِ لا يُصيبُها شَرقٌ ولاَ غَربٌ\n وهي من أجودِ الشّجرِ\n ويقالُ: لا يَسترُها من الشَّمسِ جَبلٌ ولا وادٍ، إذا طَلعتْ، وإذَا غَرَبتْ ويقالُ: هي الضاحيةُ التي تَشْرُقُ عَليها الشَّمسُ وتَغْرُبُ\n وزيتُها هو أجودُ الزّيتِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Allah is the light of the heavens and the earth\" - the meaning of the heavens and the earth being like His light - [like a lamp in it is a lantern] - refers to Muhammad (peace and blessings of Allah be upon him and his family).\n The believer is said\n\n\nAnd the {mishkat}: the {kootah} in the wall that has no opening for the Habasha's tongue.\n\n\nAnd the lamp: the lamp-post\n\n\nAnd His saying, {as if it were a planet moving swiftly} refers to the stars that move swiftly.\n The father of the lamp is the light - and the plural is the lamps - stressed and not important, and may be stressed\n\n\nThe durri is said to be large, beautiful, and bright.\n\n\nAnd it is said that the darriyy is the one who {attains} and is read as duri with the damma and not muhmuz, attributing it to Allah, Most High and Most Glorious.\n\n\nAnd His saying, {from a blessed olive tree neither of the east nor of the west} means in the middle of the sea, neither east nor west can reach it.\n\n\nIt is one of the best trees.\n It is said: Neither a mountain nor a valley hides her from the sun when it rises and sets. {It is said:} It is the dawn that the sun rises over and sets.\n\n\nAnd her oil is the best of oils.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ الله نور السماوات والأرض } النور هو الذي يظهر بذاته وتظهر الأشياء به، وهو مطلقاً اسم من أسماء الله تعالى باعتبار شدّة ظهوره وظهور الأشياء به، كما قيل:\nولما وجد بوجوده، وظهر بظهوره، كان نور السموات والأرض، أي: مظهر سموات الأرواح وأرض الأجساد وهو الوجود المطلق الذي وجد به ما وجد من الموجودات والإضاءة { مثل نوره } صفة وجوده وظهوره في العالمين بظهورها به كمثل { مشكاة فيها مصباح } وهي إشارة إلى الجسد لظلمته في نفسه وتنوّره بنور الروح الذي أشير إليه بالمصباح وتشبكه بشباك الحواس وتلألؤ النور من خلالها كحال المشكاة مع المصباح. والزجاجة إشارة إلى القلب المتنوّر بالروح المنوّر لما عداه بالإشراق عليه، تنور القنديل كله بالشعلة وتنويره لغيره. وشبّه الزجاجة بالكوكب الدريّ لبساطتها وفرط نوريتها وعلوّ مكانها وكثر شعاعها كما هو الحال في القلب. والشجرة التي توقد منها هذه الزجاجة هي النفس القدسية المزكاة، الصافية، شبّهت بها لتشعب فروعها وتفنن قواها، نابتة من أرض الجسد ومتعالية أغصانها في قضاء القلب إلى سماء الروح، وصفت بالبركة لكثرة فوائدها ومنافعها من ثمرات الأخلاق والأعمال والمدركات وشدّة نمائها بالترقي في الكمالات وحصول سعادة الدارين، وكمال العالمين بها، وتوقف ظهور الأنوار والأسرار والمعارف والحقائق والمقامات والمكاسب والأحوال والمواهب عليها، وخصّت بالزيتونة لكون مدركاتها جزئية مقارنة لنوء اللواحق المادية كالزيتون، فإنه ليس كله لبّاً، ولوفور قلّة استعدادها للاشتعال والاستضاءة بنور نار العقل الفعال، الواصل إليها بواسطة الروح والقلب كوفور الدهنية القابلة لاشتعال الزيتون. ومعنى كونها { لا شرقية ولا غربية } إنها متوسطة بين غرب عالم الأجساد الذي هو موضع غروب النور وبروزه عن الحجاب النوراني لكونها ألطف وأنور من الجسد وأكثف من الروح. { يكاد } زيت استعدادها من النور القدسي الفطري الكامن فيها، يضيء بالخروج إلى الفعل والوصول إلى الكمال بنفسه، فتشرق { ولو لم تمسسه نار } العقل الفعال. ولم يتصل به نور روح القدس لقوّة استعداده وفرط صفائه { نور على نور } أي: هذا المشرق بالإضاءة من الكمال الحاصل نور زائد على نور الاستعداد الثابت المشرق في الأصل كأنه نور متضاعف { يهدي الله لنوره } الظاهر بذاته المظهر لغيره، بالتوفيع والهداية { من يشاء } من أهل العناية ليفوز بالسعادة { والله بكل شيء عليم } يعلم الأمثال وتطبيقها، ويكشف لأوليائه تحقيقها.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا تنزجرون عن قهر الله أيها الغافلون\n ولا تخافون عن بشطه أيها الضالون\n أما تستحيون منه سبحانه مع حضوره وشهوده في جميع الأماكن\n وظهور نوره في عموم الآفاق والأنفس غيباً وشهادة\n ظاهراً وباطناً\n أزلاً وأبداً\n أولاً وآخراً\n صورةً ومعنىً\n\n\nوكيف تتركون حدوده وتخرجون عن مقتضى أوامره ونواهيه في كتبه المنزلة على رسله أيها الجاهلون المسرفونن\n إذ { ٱللَّهُ } المتجلي بأسمائه الحسنى وصفاته العليا { نُورُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: مظهرهما وموجدهما\n وموجدُ ما ظهر بينهما وفيهما وعليهما من كتم العدم\n بلا سبق مادةٍ ومدةٍ بامتداد أظلال أسمائه وآثار صفاته عليهما { مَثَلُ نُورِهِ } أي: ظهور أنواع وجوده من هياكل الهويات وشباك العكوس والتعينات { كَمِشْكَاةٍ } وهي كوةُ تُوضع فيه القناديل المسرجة\n وهي مثال الأشكال والمظاهر والتعينات المنعكسة من أشعة الأسماء والصفات الإلهية المتشعشعة المتجلية بالتجليات الحبية على مقتضى الذات { فِيهَا مِصْبَاحٌ } وهي مثال نور الوجود الإلهي\n المضيء بنفسه وذاته\n ومن كمال شروقه وبروقه ولمعانه تخطف الأبصار وتكمل المدارك والأنظار\n لذلك احتجب { ٱلْمِصْبَاحُ } المذكمور أولاً { فِي زُجَاجَةٍ } صافيةٍ عن كدر التعينات ورين التعلقات\n وهي مثال الأسماء والصفات المنبسطة أظلالها على صفائح الأكوان\n\n\nومن كمال اللطافة والصفاء\n هذه { ٱلزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ } في غاية الإضاءة والإنارة\n يتلألأ ويتشعشع بصفاته الذاتية ولطافته الجبلية\n لأنه { يُوقَدُ } ويسرج بدهن إليهي متخذ { مِن شَجَرَةٍ مُّبَارَكَةٍ } كثيرة الخير والبركة لمن استظل تحتها\n وهي شجرة الوجود الممتدة أظلالها على صفائح عموم ما ظهر وبطن من المظاهر والموجودات الغير المحصورة { زَيْتُونَةٍ } كثيرة النفع والخير\n إذ الوجود خيرُ محض ونفعُ صرفُ لا شرَّ يه ولا ضررَ أصلاً { لاَّ شَرْقِيَّةٍ وَلاَ غَرْبِيَّةٍ } أي: معتدلةُ في نفسها\n خارجةُ عن الجهات كلَّها غيرُ محاطةٍ بها\n\n\nومن كمال صفائها ولطافتها { يَكَادُ زَيْتُهَا } بإضاءتها الذاتية\n وإشراقها العينية { يُضِيۤءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ } هي التجلي الحبي الشوقي\n والمحبة الخالصة والعشق الإلهي\n\n\nوبالجملة: نور الوجود الإلهي { نُّورٌ عَلَىٰ نُورٍ } لا يدركه\n ولا يتميز\n ولا يطلع عليه أحدُ من مظاهره ومصنوعاته\n بلا توفيقٍ منه سبحانه وجذبٍ من جانبه\n بل { يَهْدِي ٱللَّهُ } الهادي لعباده إلى صفاء توحيده { لِنُورِهِ } أي: ضياءِ وجودِه وسعة رحمته وَجُوده { مَن يَشَآءُ } من عباده من جذبه الحق نحو جنابه\n ووفَّقه الوصول إلى فناء بابه\n\n\n{ وَ } للتنبيه إلى هذا المقام والإشارة إلى هذا المرام\n و { يَضْرِبُ ٱللَّهُ } المطلع لاستعدادات عباده { ٱلأَمْثَالَ } المنبهة والأشياء المثيرة { لِلنَّاسِ } المجبولين على فطرة التوحيد لهم\n لعلهم يتفطنون على ما جبلوا لأجله ويتنبهوا على مبدئهم ومَعادهم { وَٱللَّهُ } المحيط بالآفاق والأنفس إحاطة حضورٍ وشهودٍ { بِكُلِّ شَيْءٍ } مما جرى في مملكة عموم المظاهر والمصنوعات { عَلَيِمٌ } [النور: 35] لا يغيب عن عمله شيء\n\nولهذا التفطن والتذكر يتوجه المخلصون المنجذبون نحو الحق { فِي بُيُوتٍ } معدةٍ للتوجه مع أنه { أَذِنَ ٱللَّهُ } الهادي لعباده إلى توحيده { أَن تُرْفَعَ } بناؤها وتُعظَّم غاية التعظيم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { الله نورُ السموات والأرض } أي: منور أهلهما [بنور الإسلام والإيمان لأهل الإيمان]، وبنور الإحسان لأهل الإحسان، فحقيقة النور: هو الذي تنكشف به الأشياء على ما هي عليه، حسية أو معنوية، والمراد هنا: المعنوية بدليل قوله { يهدي الله لنُوره من يشاء } ، فإن انكشف به أحكام العبودية، باعتبار المعاملة الظاهرة، يُسمّى: نُورُ الإسلام، وإن انكشف به أوصاف الذات العلية وكمالاتها، من طريق البرهان، يُسمى: نُور الإيمان، وإن انكشف به حقيقة الذات وأسرارها، من طريق العيان، يُسمى: نور الإحسان. فالأول: يشبه نور النجوم، والثاني: نور القمر، والثالث نور الشمس، ولذلك تقول الصوفية: نجوم الإسلام، وقمر الإيمان، وشمس العرفان. ثم ضرب المثل لذلك النور، حين يقذفه في قلب المؤمن، فقال { مَثَلُ نُورِهِ } أي: صفة نوره العجيبة في قلب المؤمن - كما هي قراءة ابن مسعود - { كمشكاةٍ } أي: كَصِفَةِ مِشْكَاةٍ، وهي الكُوَّةُ في الجدار غير النافذة لأن المصباح فيها يكون نوره مجموعاً، فيكون أزهر وأنور، { فيها مصباح } أي: سراج ضخم ثاقب، { المصباحُ في زجاجة } أي: في قنديل من زجاج صافٍ أزهر، { الزجاجةُ } من شدة صفائها { كأنها كوكب دُرِّيِّ } بضم الدال وتشديد الراء، منسوب إلى الدر لفرط ضيائه وصفائه، وبالكسر والهمز: \" أبو عمرو \" على أنه يدْرأ الظلام بضوئه. وبالضم والهمز: أبو بكر وحمزة، شبهه بأحد الكواكب الدراري، كالمشتري والزهرة ونحوهما. { تَوَقَدُ } بالتخفيف والتأنيث، أي: الزجاجة، أو { يُوقَدُ } بالتخفيف والغيب، أو: { تَوَقَّدَ } بالتشديد، أي: المصباح { من شجرةٍ } أي من زيت شجرة الزيتون، أي: رويت فتيلته من زيت { شجرةٍ مباركةٍ } كثيرة المنافع، أو: لأنها تنبت في الأرض التي بارك فيها للعالمين، وهي الشام، وقيل: بارك فيها سبعون نبياً، منهم إبراهيم عليه السلام. { زيتونةٍ }: بدلٌ من { شجرة } ، من نعتها { لا شرقيةٍ ولا غربيةٍ } أي: ليست شرقية فقط، لا تُصيبها الشمس إلا في حالة الشروق، ولا غربية، لا تصيبها إلا في حال الغروب، بل هي شرقية غربية، تصيبها الشمس بالغداة والعشي، فهو أَنْضَرُ لها، وأجود لزيتونها. وقيل: ليست من المشرق ولا من المغرب، بل في الوسط منه، وهو الشام، وأجودُ الزيتونِ زيتون الشام. { يكادُ زيتُها يٌضيءُ ولو لم تمسسه نارٌ } هو في الصفاء والإنارة بحيث يكاد يضيء بنفسه من غير مسَاس نَارٍ أصلاً. { نورٌ على نورٍ } أي: نور المصباح متضاعف على نور الزيت الصافي، فهذا مثال النور الذي يقذفه الله في قلب المؤمن فالمشكاة هو الصدر،والمصباح نور الإيمان أو الإسلام أو الإحسان، على ما تقدم، والزجاجة هو القلب الصافي، ولذلك شبهه بالكوكب الدُرّيّ، والزيت هو العِلْمُ النافع الذي يقوي اليقين. ولذلك وصفه بالصفاء والإنارة.\nيكاد صاحبه تشرق عليه أنوار الحقائق، ولو لم يمسسه علمها. { نورٌ على نورٍ } أي نور الإيمان مُضَافٌ إلى نور الإسلام، أو نور الإحسان مضاف إلى نور الإيمان والإسلام. { يهدي الله لنوره } أي: لهذا النور الباهر { من يشاء } من عباده إما بإلهام أو بواسطة تعليم. وفيه إيذان بأن مناط هذه الهداية إنما هي بمشيئته تعالى، وأن الأسباب لا تأثير لها. { ويضرب الله الأمثالَ للناس } تقريباً للفهم، لأنه إبراز للمعقول في هيئة المحسوس { والله بكل شيءٍعليمٌ } ، معقولاً كان أو محسوساً، فيبين الأشياء بما يمكن أن تُعْلَم به. والله تعالى أعلم. الإشارة: اعلم أن الكون كله من عرشه إلى فرشه قطْعةٌ من نور الحق، وسر من أسرار ذاته، مُلْكٌ، وباطنه ملكوت فائض من بحر الجبروت، فالكائنات كلها: الله نُورُها وسرُّها، وهو القائم بها. ولا يفهم هذا إلا أهل الفناء من العارفين بالله، وحسبُ من لم يبلغ مقامهم التسليم لما رمزوا إليه، وتحققوه ذوقاً وكشفاً. ثم ضرب الحقُّ تعالى مثلاً لنوره الفائض من بحر جبروته، فقال: { مثل نوره } الظاهر، الذي تجلى به في عالم الشهادة، { كمشكاة فيها مصباح } أي: كطاقة انفتحت من بحر اللّطَافَةِ الكَنْزِيَّةِ، خرج منها نور كثيف كالمصباح، فالكون كله مِصْبَاحُ نورٍ، انفجر من نور النور، ومن ذلك المصباح تفرعت الكائنات، فهي كلها نور فائض من بحر نوره اللطيف، ثم جعل الحق تعالى يصف ذلك المصباح في توقده وتوهجه بقوله: { المصباح في زجاجة الزجاجة كأنها كوكب دُري... } إلخ. فالآية كلها من تتمة التمثيل. وقوله تعالى: { ولو لم تمسسه نار } قيل: الإشارة فيه إلى استغناء العبد في تلك الحالة عن الاستمداد إلا من رب العزة، فيستغني عن الوسائط. وقوله تعالى: { نورٌ على نور } أي: نور ملكوته على نور جبروته، { يهدي الله لنوره } أي: لشهود نوره، أو لمعرفة نوره، { من يشاء } من خواص أحبابه، كأنبيائه وأوليائه، فمن لم يشهد هذا النور، ولم يعرفه، لا خصوصية له يتميز بها عن العوام، فهو من عامة أهل اليمين، ولو كثر علمه وعمله إذ لا عبرة بالعلم والعمل مع الحِجَاب. وفي الحكَم: \" الكائن في الكون، ولم تفتح له ميادين الغيوب، مسجون بمحيطاته، محصور في هيكل ذاته \" ، والمحجوب برؤية الأكوان من جملة العوام عند أهل العيان، ينسحب عليه معنى المثال الآتي في ضد هذا بقوله: أو كظلمات... إلخ. وفي الحِكَم: \" الكون كله ظلمة، وإنما أناره ظهورُ الحَقِّ فيه، فمن رأى الكون ولم يشهده فيه، أو عنده، أو قبله أو بعده، فقد أعوزه وجود الأنوار، وحجبت عنه شموس المعارف بسُحب الآثار \". فالكون عند أهل العيان كله نور، وعند أهل الحجاب كله ظلمة، وهو محيط بهم، فالظلمة محيطة بهم، وقد ألف الغزالي في هذه الآية كتابه: مشكاة الأنوار، وكلامه فيه يدور على أن معنى اسمه تعالى \" النور \": يرجع إلى ما ثبتت به الأشياء وظهرت من العدم، ولذلك قال قائلهم:\nوفي لطائف المنن: الله نور السموات والأرض نور سموات الأرواح بمشاهدته، ونور أرض النفوس بمطالعته وخدمته، وجعل قلوب أوليائه مَجْلاَةً لذاته ولظهور صفاته، أظهرهم ليظهر فيهم خصوصاً، وهو الظاهر في كل شيء عموماً، ظهر فيهم بأنواره وأسراره، كما ظهر فيهم، وفيما عداهم بقدرته واقتداره. هـ. ثم ذكر محل ظهور ذلك المصباح، فقال: { فِي بُيُوتٍ أَذِنَ ٱللَّهُ أَن تُرْفَعَ وَيُذْكَرَ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:86",
      "similarity": 0.22054047822691417
    },
    {
      "verse": "58:1",
      "similarity": 0.21837557115879158
    },
    {
      "verse": "2:17",
      "similarity": 0.18695410998067882
    },
    {
      "verse": "71:11",
      "similarity": 0.1791954889641356
    },
    {
      "verse": "11:52",
      "similarity": 0.17413572457754092
    }
  ]
}