{
  "chapter": "النور",
  "text": "الزانى لا ينكح الا زانية او مشركة والزانية لا ينكحها الا زان او مشرك وحرم ذلك على المؤمنين",
  "translations": [
    {
      "translation": "A man who has fornicated may only marry a woman who has fornicated or a woman of the idolaters. A woman who has fornicated may only marry a man who has fornicated or a man of the idolaters. Doing such a thing is haram for the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulterer can marry no one but an adulteress or his partner (in the act), and the adulteress cannot marry any but an adulterer or her partner (in the act). This is forbidden the believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A man guilty of adultery (or fornication) shall not marry any but the woman guilty of the same or a mushrik woman, and none shall marry a woman guilty of adultery (or fornication) but the man guilty of the same or a mushrik man: such marriages are forbidden to true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one should marry a fornicator except a fornicatress or a pagan woman. No one should marry a fornicatress except a fornicator or a pagan man. Such (marriage) is unlawful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulterer shall not marry except an adulteress or a polytheist woman, and none shall marry an adulteress except an adulterer or a polytheist; and this is forbidden for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Zani marries not but a Zaniyah or a Mushrikah; and the Zaniyah, none marries her except a Zani or a Mushrik. Such a thing is forbidden to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fornicator shall not marry any but a fornicatress or idolatress, and (as for) the fornicatress, none shall marry her but a fornicator or an idolater; and it is forbidden to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fornicator shall marry none but a fornicatress or an idolatress, and the fornicatress -- none shall marry her but a fornicator or an idolator; that is forbidden to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulterer shall not marry save an adulteress or an idolatress, and the adulteress none shall marry save an adulterer or an idolater. All that is forbidden unto believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulterer shall marry only an adulteress or a polytheist woman, and an adulteress shall marry only an adulterer or a polytheist man; such marriages are forbidden for believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulterer weddeth not but an adulteress or an associatoress: and the adulteress! --none weddeth her save an adulterer or an associator; and that is forbidden unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fornicator will not marry anyone but a fornicatress or an idolatress, and the fornicatress will be married by none except a fornicator or an idolater, and that is forbidden to the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let no man guilty of adultery or fornication marry and but a woman similarly guilty, or an Unbeliever: nor let any but such a man or an Unbeliever marry such a woman: to the Believers such a thing is forbidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulterer marries not but an adulteress or a Mushrikah and the adulteress none marries her except an adulterer or a Muskrik [and that means that the man who agrees to marry (have a sexual relation with) a Mushrikah (female polytheist, pagan or idolatress) or a prostitute, then surely he is either an adulterer, or a Mushrik (polytheist, pagan or idolater, etc.) And the woman who agrees to marry (have a sexual relation with) a Mushrik (polytheist, pagan or idolater) or an adulterer, then she is either a prostitute or a Mushrikah (female polytheist, pagan, or idolatress, etc.)]. Such a thing is forbidden to the believers (of Islamic Monotheism).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fornicator shall marry none but a fornicatress or an idolatress; and the fornicatress none shall marry her but a fornicator or an idolater; that is forbidden to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The adulterer shall marry none but an adulteress or an idolatress; and the adulteress shall marry none but an adulterer or an idolater. That has been prohibited for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fornicator does not marry except a [female] fornicator or polytheist, and none marries her except a fornicator or a polytheist, and that has been made unlawful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:3] The fornicator shall not marry anyone but a fornicatress or an idolatress, and the fornicatress shall be married by none except a fornicator or an idolator, in other words, what is suitable for each of the two [for the purposes of marriage] is the above-mentioned; and that, namely, marrying of fornicators, is forbidden to believers, who are better [than those]. This was revealed when the poor among the Emigrants resolved to marry the wealthy whores of the idolaters, so that they [the women] would provide for them. Thus it is said that the prohibition applies specifically to them; but it is also said to apply in general; but it was abrogated by God’s words: Marry off the spouseless among you [Q. 24:32].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The adulterer) from the people of the Book who admits his crime (shall not marry save an adulteress) from the slaves of the people of the Book (or an idolatress) from the slaves of the Arab idolaters, (and the adulteress none shall marry save an adulterer) from the people of the Book (or an idolater) from the Arab idolaters. (All that) marrying the slaves of the people of the Book and the slaves of Arab idolaters (is forbidden unto believers) this verse was revealed about a group among the Companions of the Prophet (pbuh) who wanted to marry some slaves from the people of the Book and Arab idolaters in Medina. These slaves were known adulteresses but these prophetic Companions wanted to marry them in order to win them over. When this verse was revealed they refrained from marrying them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يَنكِحُ إِلاَّ زَانِيَةً } معناه لا يَزني إلاَّ بِزانيةٍ\n\n\n\n\nوقوله تعالى: { وَحُرِّمَ ذٰلِكَ عَلَى ٱلْمُؤْمِنِينَ } يعني الزِّنا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He shall not marry except a zaniyyah,\" its meaning is that he shall not marry except with a woman who is unchaste.\n\n\nAnd the saying of Allah, {And that is forbidden to the believers}, means adultery.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويميل إلى عورات المسلمين بلا رخصةٍ شرعيةٍ تعدياً عن حدود الله وهتكاً لستره { لاَ يَنكِحُ } إن نَكح { إِلاَّ زَانِيَةً } مثله مناسبةً له ومشاكلةً إياه\n إذ الجنسية علة التضام والألفة { أَوْ مُشْرِكَةً } هي أخسُّ وأخبثُ وأشدُّ قبحاً وشناعةً { وَٱلزَّانِيَةُ } الراغبة للأجانب\n المائلةُ إليهم بلا طريقٍ شرعي { لاَ يَنكِحُهَآ } أيضاً { إِلاَّ زَانٍ } كذلك لكمال الملائمة والمشابهة { أَوْ مُشْرِكٌ } هو أخبثُ وأقبحُ { وَحُرِّمَ ذٰلِكَ } الفعلُ القبيح\n والخصلةُ الذميمةُ الشنيعة { عَلَى ٱلْمُؤْمِنِينَ } [النور: 3] الموقنين المخصلين من أرباب العزائم\n ونهيُ على أهل الرخص منهم نهياً واصلاً إلى حد النفي والحرمة\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: من شأن { الزاني } الخبيث: أنه لا يرغب إلا في زانية خبيثة من شكله، أو في مشركة، والخبيثة المسافحة لا يرغب فيها إلا من هو من شكلها، من الفسقة أو المشركين، وهذا حُكْمٌ جار على الغالب المعتاد، جيء به لزجر المؤمنين عن نكاح الزواني، بعد زجرهم عن الزنا بهن إذ الزنا عديل الشرك في القبح، كما أن الإيمان قرين العفاف والتحصن، وهو نظير قوله:\n[النور: 26]. روي أن المهاجرين لَمَّا قدموا المدينة، وكان فيهم من ليس له مال ولا أهل، وبالمدينة نساء بغايا مُسافِحَات، يُكرين أنفسهن وهُنَّ أخْصَبُ أهل المدينة، رغب بعضُ الفقراء في نكاحهن لحسنهن، ولينفقوا عليهم من كَسْبِهِنّ، فاستأذنوا النبي صلى الله عليه وسلم فنزلت، فنفرهم الله تعالى عنه، وبيَّن أنه من أفعال الزناة وخصائص المشركين، فلا تحوموا حوله لئلا تنتظموا في سلكهم وتَتَّسِمُوا بسمتهم. قيل: كان نكاح الزانية محرماً في أول الإسلام، ثم نسخ بقوله:\n[النور: 32]. وقيل: المراد بالنكاح: الوطء، أي: الزاني لا يزني إلا بزانية مثله، وهو بعيد، أو باطل. وسُئل رسولُ الله صلى الله عليه وسلم عمن زنا بامرأة ثم تزوجها. فقال:\n \" أَوَّلُهُ سِفَاحٌ، وآخره نكاح والحرام لا يُحرم الحلال \". \nومعنى الجملة الأولى: وصفُ الزاني بكونه غير راغب في العفائف، ولكن في الفواجر. ومعنى الثانية: وصف الزانية بكونها غير مرغوب فيها للأعفاء، ولكن الزناة، وهما معنيان مختلفان. وقدّم الزاني هنا، بخلاف ما تقدم في الجلد لأن تلك الآية سيقت لعقوبتهما على ما جنيا، والمرأة هي المادة التي منها نشأت تلك الجناية، كما تقدم، وأما هنا فمسوقة لذكر النكاح، والرجل اصل فيه. ثم ذكر الحُكْم فقال: { وحُرِّم ذلك على المؤمنين } أي: نكاح الزواني بقصد التكسب، أو: للجمال لما في ذلك من التشبه بالفساق وحضور مواضع التهمة، والتعرض لسوء المقالة والغيبة والطعن في النسب، وغير ذلك من المفاسد التي لا تكاد تليق بأحد من الأداني والأراذل، فكيف بالمؤمنين والأفاضل؟، ولذلك عبّر عن التنزيه بالتحريم، مبالغة في الزجر، وقيل: النفي بمعنى النهي، وقرئ به. والتحريم: إما على حقيقته، ثم نسخ بقوله:\n[النور: 32] إلخ، أو: مخصوص بسبب النزول. والله تعالى أعلم. الإشارة: الصحبة لها تأثير في الأصل والفرع، فيحصل الشرف أو السقوط بصحبة أهل الشرف أو الأراذل، وفي ذلك يقول القائل:\nفالمرء على دين خليله، ومن تحقق بحالة لا يخلو حاضروه منها، والحكم للغالب، فإن كان النورُ قوياً غلب الظلمةَ، وإن كانت الظلمة قوية غلبت النور، وصيرته ظلمة، ولذلك نهى الله تعالى عن نكاح الزواني، فإنه وإن كان نور الزوج غالباً - إذا كان ذا نور - فإن العِرْقَ نَزَّاعٌ، فيسرى ذلك في الفروع، فلا تكاد تجد أولاد أهل الزنا إلا زناة، ولا أولاد أهل العفة إلا أعِفَّاء،\n\n[الأعراف:58]. وفي الحديث:\n \" إياكم وخَضْرَاءَ الدِّمَنِ، قيل: وما خضراء الدمن يا رسول الله؟ قال: المرأة الحسناء في المنبت السوء \" \nقال ابن السكيت: شبهها بالبقلة الخضراء في دِمْنَةِ أرض خبيثة لأن الأصل الخبيث يحن إلى أصله، فتجيء أولادها لأصلها في الغالب. فيجيب على اللبيب - إن ساعفته الأقدار - أن يختار لزراعته الأرض الطيبة، وهي الأصل الطيب، لتكون الفروع طيبة. وفي الحديث:\n \" تخيَّرُوا لنطفكم ولا تضعوها إلاّ في الأَكْفَاءِ \" \nهـ. وبالله التوفيق. ثمَّ ذكر حدَّ القذف، فقال: { وَٱلَّذِينَ يَرْمُونَ ٱلْمُحْصَنَاتِ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:68",
      "similarity": 0.7552729951681919
    },
    {
      "verse": "17:32",
      "similarity": 0.7255479902969879
    },
    {
      "verse": "24:2",
      "similarity": 0.44994347676988017
    },
    {
      "verse": "60:12",
      "similarity": 0.42023512780902045
    },
    {
      "verse": "2:230",
      "similarity": 0.19918409382764052
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}