{
  "chapter": "النور",
  "text": "ليجزيهم الله احسن ما عملوا۟ ويزيدهم من فضله والله يرزق من يشاء بغير حساب",
  "translations": [
    {
      "translation": "so that Allah can reward them for the best of what they did and give them more from His unbounded favour. Allah provides for anyone He wills without reckoning.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That God may reward them for the best of their deeds, and bestow more on them of His bounty, for God gives whom He please without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And they behave like this) so that Allah may reward them for their excellent deeds and, in addition to it, show His favour to them out of His bounty: Allah provides without stint for anyone He pleases.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They worship Him) so that God will reward their best deeds and give them more through His favors. God gives sustenance to whomever He wants without account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that Allah may reward them for their best deeds and by His munificence, bestow upon them an increased reward; and Allah gives sustenance to whomever He wills, without account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward them according to the best of their deeds, and add even more for them out of His grace. And Allah provides without measure to whom He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may give them the best reward of what they have done, and give them more out of His grace; and Allah gives sustenance to whom He pleases without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that God may recompense them for their fairest works and give them increase of His bounty; and God provides whomsoever He will, without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward them with the best of what they did, and increase reward for them of His bounty. Allah giveth blessings without stint to whom He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that God may reward them according to the best of their deeds and give them more out of His bounty. God provides for whoever He wills without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may recompense them the best for that which they worked and may increase unto them of His grace, and Allah provideth for whomsoever He will without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that Allah may reward them by the best of what they have done, and enhance them out of His grace, and Allah provides for whomever He wishes without any reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward them according to the best of their deeds, and add even more for them out of His Grace: for Allah doth provide for those whom He will, without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward them according to the best of their deeds, and add even more for them out of His Grace. And Allah provides without measure to whom He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that Allah will recompense them for the finest deeds they did and increase them from His bounty. Allah provides without measure to whom He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will reward them according to the best of what they did, and He will increase them from His bounty. God provides for whomever He wills without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may reward them [according to] the best of what they did and increase them from His bounty. And Allah gives provision to whom He wills without account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:38] so that God may reward them for the best of what they did, that is, [reward them] the reward for it (ahsana means husna), and give them more out of His bounty; and God provides whomever He will without [any] reckoning (one says [of someone] yunfiqu bi-ghayri hisābin, to mean that such [a person] is so generous that it is as though he does not [need to] reckon what he spends).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا عَمِلُوا وَيَزِيدَهُمْ مِنْ فَضْلِهِ وَاللَّهُ يَرْزُقُ مَنْ يَشَاءُ بِغَيْرِ حِسَابٍ (38)ويتعلق قوله : { ليجزيهم الله أحسن ما عملوا } ب { يخافون } ، أي كان خوفهم سبباً للجزاء على أعمالهم الناشئة عن ذلك الخوف .والزيادة : من فضله هي زيادة أجر الرهبان إن آمنوا بمحمد صلى الله عليه وسلم حينما تبلغهم دعوته لما في الحديث الصحيح : « أن لهم أجرين » أو هي زيادة فضل الصلاة في المساجد إن كان المراد بالبيوت مساجد الإسلام .وجملة : { والله يرزق من يشاء بغير حساب } تذييل لجملة : { ليجزيهم الله } . وقد حصل التذييل لما في قوله : { من يشاء } من العموم ، أي وهم ممن يشاء الله لهم الزيادة .والحساب هنا بمعنى التحديد كما في قوله : { إن الله يرزق من يشاء بغير حساب } في سورة آل عمران ( 37) . وأما قوله : { جزاء من ربك عطاء حساباً } \\[ النبأ : 36 \\] فهو بمعنى التعيين والإعداد للاهتمام بهم . والتجارة : جلب السلع للربح في بيعها ، والبيع أعم وهو أن يبيع أحد ما يحتاج إلى ثمنه .وقرأ الجمهور : { يسبح } بكسر الموحدة بالبناء للفاعل و { رجال } فاعله . وقرأ ابن عامر وأبو بكر عن عاصم بفتح الموحدة على البناء للمجهول فيكون نائب الفاعل أحد المجرورات الثلاثة وهي { له فيها بالغدو } ويكون { رجال } فاعلاً بفعل محذوف من جملة هي استئناف . ودل على المحذوف قوله : { يسبّح } كأنه قيل : من يسبحه؟ فقيل : يُسبح له رجال . على نحو قول نهشل بن حَريّ يرثي أخاه يزيد :لِيُبْكِ يزيدُ ضارعٌ لخصومة ... ومختبطٌ مما تُطيح الطوائحوجملة : { لا تلهيهم تجارة } وجملة : { يخافون } صفتان ل { رجال } ، أي لا يشغلهم ذلك عن أداء ما وجب عليهم من خوف الله { وإقام الصلاة } الخ وهذا تعريض بالمنافقين .و { إقام } مصدر على وزن الإفعال . وهو معتل العين فاستحق نقل حركة عينه إلى الساكن الصحيح قبله وانقلاب حرف العلة ألفاً إلا أن الغالب في نظائره أن يقترن آخره بهاء تأنيث نحو إدامة واستقامة . وجاء مصدر { إقام } غير مقترن بالهاء في بعض المواضع كما هنا . وتقدم معنى إقامة الصلاة في صدر سورة البقرة ( 3) .وانتصب { يوماً } من قوله : { يخافون يوماً } على المفعول به لا على الظرف بتقدير مضاف ، أي يخافون أهواله .وتقلّب القلوب والأبصار : اضطرابها عن مواضعها من الخوف والوجل كما يتقلب المرء في مكانه . وقد تقدم في قوله تعالى : { ونقلب أفئدتهم وأبصارهم } في سورة الأنعام ( 110) . والمقصود من خوفه : العمل لما فيه الفلاح يومئذٍ كما يدل عليه قوله : { ليجزيهم الله أحسن ما عملوا } . لمّا جرى ذكر أعمال المتقين من المؤمنين وجزائهم عليها بقوله تعالى : { يسبح له فيها بالغدو والآصال رجال }\n\n",
      "translations": [
        {
          "translation": "(That Allah may reward them with the best of what they did) in the life of this world, (and increase reward for them of His bounty) for each one nine rewards. (Allah giveth blessings without stint to whom He will) He gives to whom He will without measure, or count or ever reminding them of what He gives them as a favour.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n كما قال: \" كنت سمعه وبصره \" من ظهور البقية وبقاء الأنية { ليجزيهم الله } بالوجود الحقانيّ { أحسن ما عملوا } من جنات الأفعال والنفوس والأعمال { ويزيدهم من فضله } من جنات القلوب والصفات { والله يرزق من يشاء } من جنات الأرواح والمشاهدات { بغير حساب } لكونه أكثر من أن يحصى ويُقَاس",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكذل ذلك { لِيَجْزِيَهُمُ ٱللَّهُ } المجازي لما صرد عنهم { أَحْسَنَ مَا عَمِلُواْ } بأحسن الجزاء { وَيَزِيدَهُمْ مِّن فَضْلِهِ } امتناناً عليهم { وَٱللَّهُ } المتفضل لخواص عباده { يَرْزُقُ مَن يَشَآءُ } منهم من الرزق المعنوي الحقيقي { بِغَيْرِ حِسَابٍ } [النور: 38] أي: بلا مقابلةِ عملٍ منهم\n ومعاضوة إحسانٍ من جانبهم\n بل من محض الفضل والجود\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n مع الخوف { ليجزيهم الله أحسنَ ما عَمِلُوا } أي: أحسن جزاء أعمالهم\n حسبما وعدهم بمقابلة حسنة بعشر أمثالها إلى سبع مائة ضعف\n { ويزيدَهُم من فَضْلِه } أي: يتفضل عليهم بأشياء وعدهم بها\n لم تخطر على بال كالنظر إلى وجهه\n وزيادة كشف ذاته\n فهو كقوله:\n[يونس: 26]\n { والله يرزق من يشاء بغير حساب } أي: يثيب من يشاء ثواباً لا يدخل تحت حساب الخلق\n و \" مَنْ \": واقعة على من ذُكِرَتْ أوصافهم الجميلة\n كأنه قيل: والله يرزقهم بغير حساب\n ووضعه موضع ضميرهم للتنبيه على أن مناط الرزق المذكور مَحْضُ مشيئتِه تعالى\n لا أعمالهم المحكية\n ويحتمل أن يريد بالرزق ما يرزقهم في الدنيا مما يقوم بأمرهم\n حين تَبتَّلُوا إلى العبادة\n يرزقهم الله من حيث لا يحتسبون\n من غير حَصْرٍ ولا عد\n والله تعالى أعلم\n الإشارة: البيوت التي أَذِنَ الله أن تُرفع هي القلوب\n التي هي معدن الأسرار ومحل مصابيح الأنوار\n ورفعها: صونها من الأغيار\n وتطهيرها من لوث الأكدار\n وبُعدها من جيفة الدنيا\n التي هي مجمع الخبائث والأشرار\n ليُذكَرَ فيها اسم الله\n كثيراً\n على نعت الحضور والاستهتار\n وإنما يمكن ذلك من أهل التجريد والانقطاع إلى الله\n الذين لا تلهيهم تجارة ولا بيع عن ذكر الله\n يخافون يوماً تتقلب فيه القلوب عن حضرة الله\n والأبصار عن شهود الله\n وذلك بشؤم الغفلة في الدنيا عن الله\n والقيام بحقوق الله\n ليجزيهم الله أحسن ما عملوا\n في جنة الزخارف\n ويزيدهم من فضله التَّنَزُّهَ في جنة المعارف\n والله يرزق من العلوم والمعارف من يشاء بغير حساب\n ثم ذكر ضد أهل النور وهم أهل الظلمة فقال: { وَٱلَّذِينَ كَفَرُوۤاْ أَعْمَالُهُمْ كَسَرَابٍ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:26",
      "similarity": 0.40903795380140817
    },
    {
      "verse": "30:45",
      "similarity": 0.38983211312007887
    },
    {
      "verse": "40:40",
      "similarity": 0.3886583179470353
    },
    {
      "verse": "35:30",
      "similarity": 0.38144840448622125
    },
    {
      "verse": "53:31",
      "similarity": 0.3666504722035178
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}