{
  "chapter": "النور",
  "text": "وقل للمؤمنت يغضضن من ابصرهن ويحفظن فروجهن ولا يبدين زينتهن الا ما ظهر منها وليضربن بخمرهن على جيوبهن ولا يبدين زينتهن الا لبعولتهن او ءابائهن او ءاباء بعولتهن او ابنائهن او ابناء بعولتهن او اخونهن او بنى اخونهن او بنى اخوتهن او نسائهن او ما ملكت ايمنهن او التبعين غير او۟لى الاربة من الرجال او الطفل الذين لم يظهروا۟ على عورت النساء ولا يضربن بارجلهن ليعلم ما يخفين من زينتهن وتوبوا۟ الى الله جميعا ايه المؤمنون لعلكم تفلحون",
  "translations": [
    {
      "translation": "Say to the mumin women that they should lower their eyes and guard their private parts and not display their adornments - except for what normally shows - and draw their head-coverings across their breasts. They should only display their adornments to their husbands or their fathers or their husbands' fathers, or their sons or their husbands' sons or their brothers or their brothers' sons or their sisters' sons or other women or those they own as slaves or their male attendants who have no sexual desire or children who still have no awareness of women's private parts. Nor should they stamp their feet so that their hidden ornaments are known. Turn to Allah every one of you, muminun, so that hopefully you will have success.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the believing women to lower their eyes, guard their private parts, and not display their charms except what is apparent outwardly, and cover their bosoms with their veils and not to show their finery except to their husbands or their fathers or fathers-in-law, their sons or step-sons, brothers, or their brothers' and sisters' sons, or their women attendants or captives, or male attendants who do not have any need (for women), or boys not yet aware of sex. They should not walk stamping their feet lest they make known what they hide of their Ornaments. O believers, turn to God, every one of you, so that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, enjoin the Believing women to restrain their gaze and guard their private parts. and not to display their adornment except that which is displayed of itself, and to draw their veils over their bosoms and not to display their adornment except before their husbands, their fathers, the fathers of their husbands, their sons and the sons of their husbands (from other wives), their brothers, their brothers' sons, their sisters' sons, their female associates and those in their possession and male attendants incapable of sex desire and those boys who have not yet attained knowledge of sex matters concerning women; also forbid them to stamp their feet on the ground lest their hidden ornaments should be displayed. O Believers, turn all together towards Allah: it is expected that you will attain true success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the believing woman to cast down their eyes, guard their chastity, and not to show off their beauty except what is permitted by the law. Let them cover their breasts with their veils. They must not show off their beauty to anyone other than their husbands, father, father-in-laws, sons, step-sons, brothers, sons of brothers and sisters, women of their kind, their slaves, immature male servants, or immature boys. They must not stamp their feet to show off their hidden ornaments. All of you believers, turn to God in repentance so that perhaps you will have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And command the Muslim women to keep their gaze low and to protect their chastity, and not to reveal their adornment except what is apparent, and to keep the cover wrapped over their bosoms; and not to reveal their adornment except to their own husbands or fathers or husbands’ fathers, or their sons or their husbands’ sons, or their brothers or their brothers’ sons or sisters’ sons, or women of their religion, or the bondwomen they possess, or male servants provided they do not have manliness, or such children who do not know of women’s nakedness, and not to stamp their feet on the ground in order that their hidden adornment be known; and O Muslims, all of you turn in repentance together towards Allah, in the hope of attaining success. (It is incumbent upon women to cover themselves properly.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And tell the believing women to lower their gaze, and protect their private parts and not to show off their adornment except that which is apparent, and to draw their veils all over their Juyub and not to reveal their adornment except to their husbands, or their fathers, or their husband's fathers, or their sons, or their husband's sons, or their brothers or their brother's sons, or their sister's sons, or their women, or their right hand possessions, or the Tabi`in among men who do not have desire, or children who are not aware of the nakedness of women. And let them not stamp their feet so as to reveal what they hide of their adornment. And all of you beg Allah to forgive you all, O believers, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say to the believing women that they cast down their looks and guard their private parts and do not display their ornaments except what appears thereof, and let them wear their head-coverings over their bosoms, and not display their ornaments except to their husbands or their fathers, or the fathers of their husbands, or their sons, or the sons of their husbands, or their brothers, or their brothers' sons, or their sisters' sons, or their women, or those whom their right hands possess, or the male servants not having need (of women), or the children who have not attained knowledge of what is hidden of women; and let them not strike their feet so that what they hide of their ornaments may be known; and turn to Allah all of you, O believers! so that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say to the believing women, that they cast down their eyes' and guard their private parts, and reveal not their adornment save such as is outward; and let them cast their veils over their bosoms, and not reveal their adornment save to their husbands, or their fathers, or their husbands' fathers, or their sons, or their husbands' sons, or their brothers, or their brothers' sons, or their sisters' sons, or their women, or what their right hands own, or such men as attend them, not having sexual desire, or children who have not yet attained knowledge of women's private parts; nor let them stamp their feet, so that their hidden ornament may be known. And turn all together to God, O you believers; haply so you will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And tell the believing women to lower their gaze and be modest, and to display of their adornment only that which is apparent, and to draw their veils over their bosoms, and not to reveal their adornment save to their own husbands or fathers or husbands' fathers, or their sons or their husbands' sons, or their brothers or their brothers' sons or sisters' sons, or their women, or their slaves, or male attendants who lack vigour, or children who know naught of women's nakedness. And let them not stamp their feet so as to reveal what they hide of their adornment. And turn unto Allah together, O believers, in order that ye may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to believing women that they should lower their gaze and remain chaste and not to reveal their adornments -- save what is normally apparent thereof, and they should fold their shawls over their bosoms. They can only reveal their adornments to their husbands or their fathers or their husbands' fathers, or their sons or their husbands' sons or their brothers or their brothers' sons or their sisters' sons or maidservants or those whom their right hands possess or their male attendants who have no sexual desire or children who still have no carnal knowledge of women. Nor should they swing their legs to draw attention to their hidden ornaments. Believers, turn to God, every one of you, so that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say thou unto the believing women that they shall lower their sights and guard their private parts and shall not disclose their adornment except that which appeareth thereof; and they shall draw their scarves over their bosoms; and shall not disclose their adornment except unto their husbands or their fathers or their husbands fathers or their sons or their husbands sons or their brothers or their brothers sons or their sisters sons or their Women or those whom their right hands own or male followers wanting in sex desire or children not acquainted with the privy parts of women; and they Shall not strike their feet so that there be known that which they hide of their adornment. And turn penitently unto Allah ye all, O ye believers, haply ye may thrive!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And tell the faithful women to cast down their looks and to guard their private parts, and not to display their charms, beyond what is [acceptably] visible, and let them draw their scarfs over their bosoms, and not display their charms except to their husbands, or their fathers, or their husband’s fathers, or their sons, or their husband’s sons, or their brothers, or their brothers’ sons, or their sisters’ sons, or their women, or their slave girls, or male dependants lacking [sexual] desire, or children who are not yet conscious of female sexuality. And let them not thump their feet to make known their hidden ornaments. Rally to Allah in repentance, O faithful, so that you may be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say to the believing women that they should lower their gaze and guard their modesty; that they should not display their beauty and ornaments except what (must ordinarily) appear thereof; that they should draw their veils over their bosoms and not display their beauty except to their husbands, their fathers, their husband's fathers, their sons, their husbands' sons, their brothers or their brothers' sons, or their sisters' sons, or their women, or the slaves whom their right hands possess, or male servants free of physical needs, or small children who have no sense of the shame of sex; and that they should not strike their feet in order to draw attention to their hidden ornaments. And O ye Believers! turn ye all together towards Allah, that ye may attain Bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And tell the believing women to lower their gaze (from looking at forbidden things), and protect their private parts (from illegal sexual acts, etc.) and not to show off their adornment except only that which is apparent (like palms of hands or one eye or both eyes for necessity to see the way, or outer dress like veil, gloves, head-cover, apron, etc.), and to draw their veils all over Juyubihinna (i.e. their bodies, faces, necks and bosoms, etc.) and not to reveal their adornment except to their husbands, their fathers, their husband's fathers, their sons, their husband's sons, their brothers or their brother's sons, or their sister's sons, or their (Muslim) women (i.e. their sisters in Islam), or the (female) slaves whom their right hands possess, or old male servants who lack vigour, or small children who have no sense of the shame of sex. And let them not stamp their feet so as to reveal what they hide of their adornment. And all of you beg Allah to forgive you all, O believers, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say to the believing women, that they lower their gaze cast down their eyes and guard their chastity, and do not reveal their adornment except that which is outward (face and hands); and let them draw their veils over their neck, and not reveal their adornment except to their husbands, or their fathers, or their husbands' fathers, or their sons, or their husbands' sons, or their brothers, or their brothers' sons, or their sisters' sons, or their women, or what their right hands own, or such male attendants having no sexual desire, or children who have not yet attained knowledge of women's private parts; nor let them stamp their feet, so that their hidden ornament is known. And, O believers turn to Allah all together, in order that you prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And tell the believing women to restrain their looks, and to guard their privates, and not display their beauty except what is apparent thereof, and to draw their coverings over their breasts, and not expose their beauty except to their husbands, their fathers, their husbands' fathers, their sons, their husbands' sons, their brothers, their brothers' sons, their sisters' sons, their women, what their right hands possess, their male attendants who have no sexual desires, or children who are not yet aware of the nakedness of women. And they should not strike their feet to draw attention to their hidden beauty. And repent to God, all of you believers, so that you may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And tell the believing women to reduce [some] of their vision and guard their private parts and not expose their adornment except that which [necessarily] appears thereof and to wrap [a portion of] their headcovers over their chests and not expose their adornment except to their husbands, their fathers, their husbands' fathers, their sons, their husbands' sons, their brothers, their brothers' sons, their sisters' sons, their women, that which their right hands possess, or those male attendants having no physical desire, or children who are not yet aware of the private aspects of women. And let them not stamp their feet to make known what they conceal of their adornment. And turn to Allah in repentance, all of you, O believers, that you might succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:31] And tell believing women to lower their gaze, away from what is not lawful for them to look at, and to guard their private parts, from what is not lawful for them to do with them, and not to display their adornment except for what is apparent, namely, the face and the hands, which may be seen by a stranger, when there is no danger of [either or both falling into] temptation — this being one of two opinions. The second [of these] is that [even] this is forbidden because there is a presumption that these [parts] will cause temptation — and this is the preferred opinion, if one must settle this topic [with a definitive opinion]; and   let them draw their veils over their bosoms, that is, let them cover up their heads, necks and chests with veils, and not reveal their, hidden, adornment, namely, all that is other than the face and the hands, except to their husbands (bu‘ūl is the plural form of ba‘l, ‘male spouse’) or their fathers, or their husbands’ fathers, or their sons, or their husbands’ sons, or their brothers, or their brothers’ sons, or their sisters’ sons, or their women, or what their right hands own, all of whom are permitted to look thereat, except for the part from the navel down to the knees, which is unlawful for any other than their husbands to see; ‘their women’, however, excludes disbelieving women, for it is not permitted for Muslim women to reveal themselves to these; ‘what their right hands own’ comprises slaves; or such men who are dependant, on what food may be left over, not (ghayri, read as an adjective, or read ghayra as an exceptive) possessing any sexual desire, [not] those men who are in [sexual] need of women, so for example those whose male member cannot become erect; or children who are not yet aware of women’s private parts, in [the context of] sexual intercourse, and so to these they may reveal themselves except for that part from the navel to the knees. And do not let them thump with their feet to make known their hidden ornaments, as in a rattling anklet [and the like]. And rally to God in repentance, O believers, [repenting] of the occasions on which you may have looked at what is forbidden [to look at] of such [parts] and otherwise, so that you might be prosperous, [so that you might] be saved from such [sinful acts] when your repentance thereof is accepted — in this verse the prevalent address is to males over females.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And tell the believing women) Muhammad (to lower their gaze) from men, that which is unlawful as far as men are concerned (and be modest) and be chaste, (and to display of their adornment) their bracelets and ornamented belts (only that which is apparent) of their clothes, (and to draw their veils over their bosoms) and they should tie that; and then Allah mentioned the adornment again, and said: (and not to reveal their adornment) their bracelets and ornamented belts and other things (save to their own husbands or fathers) blood fathers or stepfathers (or husbands fathers, or their sons) real sons or milk sons (or their husbands' sons) from other women, (or their brothers) their milk brothers or blood brothers (or their brothers' sons) their real sons or stepsons (or sisters sons) their real sons or milk sons, (or their women) i.e. Muslim women who belong to their own religion, because it is unlawful for Jewish, Christian or Magian women to see them without their clothes on, (or their slaves) female slaves, not male slaves, (or male attendants who lack vigour) or male attendants who belong to their husbands who have no desire for women: i.e. eunuchs and elderly men, (or children who know naught of women's nakedness) children who are too young to sleep with women and do not understand what goes on between men and women, such as these can see the adornment of women without there being any doubt. (And let them not stamp their feet) their anklets (so as to reveal what they hide of their adornment) so that strange men know what they hide of their adornment. (And turn unto Allah together) and repent of all sins whether great or small, (0 believers, in order that ye may succeed) in order that you escape Allah's wrath and chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ آبَآءِ بُعُولَتِهِنَّ } معناه أزواجُهُنّ\n\n\n\n\nوقوله تعالى: { أُوْلِي ٱلإِرْبَةِ مِنَ ٱلرِّجَالِ } معناه أُولي الحَاجةِ إِلى النِكاحِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقُل } أيضاً يا أكمل الرسل { لِّلْمُؤْمِنَاتِ } المقيمات لحدود الله، المتحفظات لمحارمه: { يَغْضُضْنَ } وينقصن { مِنْ أَبْصَارِهِنَّ } ويقصرن نظرهن إلى أزواجهن، { وَيَحْفَظْنَ فُرُوجَهُنَّ } من الميل إلى المحارم، ولهن ألاَّ يعرضن نفوسهن إلى غاير أزوجهن، { وَلاَ يُبْدِينَ } ويظهرن { زِينَتَهُنَّ } لغيرهن { إِلاَّ مَا ظَهَرَ مِنْهَا } ما ظهر من الثياب التي يلبسونهن، { وَ } من غاية تسترهم وتحفظهم { لْيَضْرِبْنَ } ويسترن { بِخُمُرِهِنَّ } ومقانعهن { عَلَىٰ جُيُوبِهِنَّ } أي: نحورهن وصدورهن مبالغةً في التستر والتحفظ\n\n\n\n\n{ وَ } الجملة: { لاَ يُبْدِينَ زِينَتَهُنَّ } أي: التي يتزيَّن بها لازدياد الحسن { إِلاَّ لِبُعُولَتِهِنَّ } أي: لأزاجهن الزينةُ إنما هي لأجلهم { أَوْ آبَآئِهِنَّ } إذ هم الأولياء لهن { أَوْ آبَآءِ بُعُولَتِهِنَّ } لحفظهم محارم أبنائهم { أَوْ أَبْنَآئِهِنَّ } لأنهم أُمناء على أمهاتهم { أَوْ أَبْنَآءِ بُعُولَتِهِنَّ } لأنهم حافظون حمية آبائهم ومحارمهم { أَوْ إِخْوَانِهِنَّ } لأنهم أحفظُ عليهن منهن؛ لخوف لحوق العار حميةً وغيرةً { أَوْ بَنِيۤ إِخْوَانِهِنَّ } إذ هم كآبائهم في محافظتهن { أَوْ بَنِي أَخَوَاتِهِنَّ } لأن نسبتهم إليهن كنسبتهم إلى آمهاتهم { أَوْ نِسَآئِهِنَّ } أي: المسلمات مطلقاً؛ إذ لا يتصور منهم الضرر سوى السحاقة، والضرر والإيمان يمنع عنهما { أَوْ مَا مَلَكَتْ أَيْمَانُهُنَّ } إذ الاحتراز عنه حرجٌ؛ لأنهم من أهل الخدمة { أَوِ ٱلتَّابِعِينَ غَيْرِ أُوْلِي ٱلإِرْبَةِ } أي: الحاجة والشهوة { مِنَ ٱلرِّجَالِ } الهرم الذين لا يبقى منهم الشهوة { أَوِ ٱلطِّفْلِ ٱلَّذِينَ لَمْ يَظْهَرُواْ عَلَىٰ عَوْرَاتِ ٱلنِّسَآءِ } لعدم بلوغهم وقت الحلم وثوران الشهرة\n\n\n\n\n{ وَ } أيضاً قل لهن: { لاَ يَضْرِبْنَ بِأَرْجُلِهِنَّ } على عادة الجهال من التبختر والرقص { لِيُعْلَمَ } ويظهر { مَا يُخْفِينَ مِن زِينَتِهِنَّ وَ } بالجملة: { تُوبُوۤاْ } رجالاً ونساءً { إِلَى ٱللَّهِ } المبدئِ المبدعِ لكم من كتم العدم { جَمِيعاً أَيُّهَ ٱلْمُؤْمِنُونَ } بتحيد الله المصدقون لكتبه ورسله { لَعَلَّكُمْ تُفْلِحُونَ } [النور: 31] وتفوزون بالفلاح والنجاح عند الملك التواب الفتاح\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقُلْ للمؤمنات يَغْضُضْنَ من أبصارهن } بالتستر والتصون عن الزنا، فلا تنظر إلى ما لا يحل لهن النظر إليه من عورات الرجال والنساء، وهي من الرجل: ما عدا الوجه والأطراف، ومن النساء: ما بين السرة والركبة، فلا يحل للمرأة أن تنظر إلى الرجل ما سوى الوجه والأطراف، أو بشهوة\n وقيل: إن حصل الأمن من الشهوة جاز، وعليه يحمل نظر عائشة إلى الحبشة\n { وَيَحْفَظْنَ فُروجَهُنَّ } من الزنا والمساحقة\n وإنما قدّم غض البصر على حفظ الفروج لأن النظر بريد الزنا، ورائد الفجور، فَبَذْرُ الهوى طُمُوحُ العَيْنِ\n { ولا يُبدينَ زينتَهُن } كالحُلي، والكحل، والخِصاب، والمراد بالزينة: مَوَاضِعُها، فلا يحل للمرأة أن تظهر مواضع الزينة، كانت مُتَحَلِّيَةً بها أم لا، وهي: الرأس، والأُذن، والعنق، والصدر، والعضدان، والذراع، والساق\n والزينة هي: الإكليل، والقرط، والقلادة، والوِشاح، والدملج، والسوار والخلخال\n\n\n{ إلا ما ظهرَ منها } إلا ما جرت العادة بإظهارها، وهو الوجه والكفان، إلا لخوف الفتنة، زاد أبو حنيفة: والقدمين، ففي ستر هذه حرج فإن المرأة لا تجد بُدّاً من مزاولة الأشياء بيديها، ومن الحاجة إلى كشف وجهها، خصوصاً في الشهادة والمحاكمة والنكاح، وتضطر إلى المشي في الطرقات، وظهور قدميها، ولا سيما الفقيرات منهن\n قاله النسفي\n { وليَضْرِبْنَ بخُمُرِهنَّ على جُيُوبهنَّ } أي: وَلْيَضَعْنَ خُمُرَهنَّ، جمع خمار، وهو ما يستر الرأس، { على جيوبهن } ، وهو شَقُّ القميص من ناحية الصدر، وكانت النساء على عادة الجاهلية يَسْدِلْنَ خُمُرَهُنَّ مِنْ خَلْفِهِنَّ، فتبدو نحورُهن وقلائدهُن من جيوبهن، وكانت واسعةً، يبدو منها صدورهن وما حواليها، فأُمِرْنَ بإسدال خُمُرِهن على جيوبهن ستراً لما يبدو منها\n وقد ضمَّنَ الضَّرْبَ معنى الإلقاء والوضع، فَعُدِّيَ بعلى\n { ولا يُبدين زينتهنَّ } أي: مواضع الزينة الباطنة كالصدر، والرأس، ونحوهما، كرره: ليستثني منه ما رخص فيه، وهو قوله: { إلا لِبُعُولَتِهِنَّ } لأزواجهن، فإنهم المقصودون بالزينة\n ولهم أن ينظروا إلى جميع بدنهن حتى الفرج، { أو آبائِهنَّ } ، ويدخل فيهم الأجداد، { أو آباء بُعُولَتِهنَّ } فقد صاروا محارم، { أو أبنائهن } ، ويدخل فيهم الأحفاد، { أو أبناء بُعولتِهِنَّ } لأنهم صاروا محارم أيضاً، { أو إِخوانهن } الشقائق، أو لأب، أو لأم، { أو بني إخوانهن أو بني أخَوَاتِهِنَّ } وإن سفلوا، ويدخل سائر المحارم، كالأعمام، والأخوال، وغيرهم لكثرة المخالطة وقلة توقع الفتنة من قِبلَهِم، فإن تحققت حيل بينهم، وعدم ذكر الأعمام والأخوال، لأن الأحوط أن يُسْتَرْنَ عنهم حذراً من أن يَصِفُوهُنَّ لأبنائهم، { أو نسائهنّ } يعني جميع المؤمنات فكأنه قال: أو صنفهن ويخرج من ذلك نساء الكفار لئلا يَصفْنَهُنَّ إلى الرجال، { أو ما ملكت أيمانُهنّ } ، يعني: الإماء المؤمنات أو الكتابيات، وأما العبيد ففيهم ثلاثة أقوال: منع رؤيتهم لسيدتهم، وهو قول الشافعي، والجواز، وهو قول ابن عباس وعائشة، والجواز بشرط أن يكون العبد وَغْداً، وهو قول مالك\n قال البيضاوي: رُوي أنه - عليه الصلاة والسلام - أتى فَاطِمَةَ بعبد، وَهَبَهُ لها، وعليها ثوب إذا قَنَّعَتْ به رأسها لم يبلغ رجليها، وإذا غطّت رجليها لم يبلغ رأسها، فقال - عليه الصلاة والسلام:\n\n \" إنه ليس عليك بأسٌ، إنما هو أبوكِ وغلامُك \" \n\n، فانظر من أخرجه\n واختلف: هل يجوز أن يراها عبد زوجها، وعبد الأجنبي، أم لا؟ على قولين\n { أو التابعين غير أُولِي الإرْبة من الرجالِ } أي: الذين يتبعونكم ليصيبوا من فضل طعامكم، أو لخدمة، أو لشيء يُعْطَاهُ، كالوكيل والمتصرف\n وقال بعضهم: هو الذي يتبعك وَهَمُّهُ بَطْنُهُ، ويشترط ألا تكون له إِربةٌ، أي: حاجة وشهوة إلى النساء كالخَصِيِّ، والمُخَنَّثِ، والشيخ الهَرِم، والأحمق، فلا تجوز رؤيتهم إلا باجتماع الشرطين: أن يكونوا تابعين، ولا إربة لهم في النساء\n { أو الطفل الذين لم يَظْهَرُوا على عَوْرَاتِ النساء } ، أراد بالطفل: الجنس، ولذلك وصفه بالجمع، ويقال فيه: \" طفل \" ما لم يراهق الحلُمُ\n\n\nويظهروا معناه: يطلعون بالوطء على عورات النساء، مِنْ: ظهر على كذا: إذا قوي عليه، فمعناه: الذين لم يطيقوا وطء النساء، أو: لا يدرون ما عورات النساء؟\n { ولاَ يضْربنَ بأرجُلهنَّ ليُعْلَم ما يُخفين من زِينَتِهِنَّ } ، كانت المرأة تضرب برجلها الأرض ليسمع قعقعة خلخالها، فيعلم أنها ذات خُلْخال، فنُهين عن ذلك إذ سَمَاعُ صَوْتِ الزينة كإظهارها، فيورث ميل الرجال إليهن\n ويوهم أن لهن ميلاً إليهم\n قال الزجاج: سماع صوت الزينة أشد تحريكاً للشهوة من إبدائها\n هـ\n الإشارة: غض البصر عما تُكره رؤيته: من أسباب جمع القلب على الله وتربية الإيمان\n وفي الحديث:\n\n \" من غض بصره عن محارم الله، عوضه الله إيماناً يجد حلاوته في قلبه \" \n\nوفي إرسال البصر: مِنْ تشتيت القلب، وتفريق الهم، ما لا يخفى، وفي ذلك يقول الشاعر:\n\nفالعباد والزهاد يغضون بصرهم عن بهجة الدنيا، والعارفون يغضون بصرهم عن رؤية السِّوَى، فلا يرون إلا تجليات المولى\n قال الشبلي: { قٌل لِلمُؤمِنِينَ يَغُضُّوا مِنْ أَبْصَارِهِمْ } أي: أبصار الرؤوس عن المحارم، وأبصار القلوب عما سِوَى الله\n هـ\n وقوله تعالى: { ولا يبدين زينتهن إلا ما ظهر منها } ، قال بعضهم: لا يجوز كل ما يستدعي فِتْنَةً للغير من إظهار حال مع الله،مما هو زينة السريرة، فلا يظهر شيئاً من ذلك إلا لأهله، إلا إذا ظهر عليه شيئ من غير إظهار منه، ولا قصدَ غير صالح\n هـ\n فلا يجوز إظهار العلوم التي يفتتن بها الناس من حقائق أسرار التوحيد، ولا من الأحوال التي تُنكرها الشريعة، فَيُوقِعُ النَّاسَ في غيبته\n وأما قَضِيَّةُ لِصَّ الحَمَّامِ فحال غالبة لا يقتدى بها\n والله تعالى أعلم\n ثم أمر بالتوبة لأن النظر لا يسلم منه أحد في الغالب\n فقال: {\n\n\nوَتُوبُوۤاْ إِلَى ٱللَّهِ جَمِيعاً أَيُّهَ ٱلْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ } [آية: 31] يقول الحق جل جلاله: { وتوبوا إلى الله جميعاً أَيُّه المؤمنون } إذ لا يكاد يخلو أحدكم من تفريط، وَلاَ سيما في الكف عن الشهوات، وقيل: توبوا مما كنتم تفعلونه في الجاهلية، فإنه، وإن جُبّ بالإسلام، لكن يجب الندم عليه، والعزم على الكف عنه، كلما يُتَذَكَّرُ، ويَخْطِرُ بالبال\n وفي تكرير الخطاب بقوله: { أيه المؤمنون }: تأكيد للإيجاب، وإيذان بأن وصف الإيمان موجب للامتثال، حَتْماً\n قيل: أحوج الناس إلى التوبة من توهم أنه ليس له حاجة إلى التوبة\n وظاهر الآية: أن العصيان لا ينافي الإيمان، فبادروا بالتوبة { لعلكم تفلحون } تفوزون بسعادة الدارين\n وبالله التوفيق\n الإشارة: التوبة أساس الطريق، ومنها السير إلى عين التحقيق، فَمَنْ لاَ تَوْبَةَ لَهُ لا سَيْرَ لَهُ، كمن يبني على غير أساس\n والتوبة يَحْتَاجُ إليها المبتدىء والمتوسط والمنتهي، فتوبة المبتدىء من المعاصي والذنوب، وتوبة السائر: من الغفلة ولوث العيوب، وتوبة المنتهي: من النظر إلى سوى علام الغيوب\n\n\nقال ابن جزي: التوبة واجبة على كل مكلف، بدليل الكتاب والسنة وإجماع الأمة\n وفرائضها ثلاثة: الندم على الذنب من حيث عُصِيَ به ذو الجلال، لا من حيث أضر ببدن أو مال\n والإقلاع عن الذنب في أول أوقات الإمكان، من غير تأخير ولا توان، والعزم ألا يعود إليها أبداً\n ومهما قضى الله عليه بالعود، أحْدَثَ عَزْماً مُجَدَّداً\n وآدابها ثلاث: الاعتراف بالذنب، مقروناً بالانكسار، والإكثار من التضرع والاستغفار، والإكثار من الحسنات لمحو ما تقدم من الأوزار\n ومراتبها سبع: فتوبة الكفار من الكفر، وتوبة المُخَلِّطِينَ من الذنوب الكبائر، وتوبة العدول من الصغائر، وتوبة العابدين من الفترات، وتوبة السالكين من عِلَلِ القلوب والآفات، وتوبة أهل الورع من الشبهات، وتوبة أهل المشاهدة من الغفلات\n والبواعث على التوبة سبعة: خوف العقاب، ورجاء الثواب، والخجل من الحساب، ومحبة الحبيب، ومراقبة الرقيب، وتعظيم المقام، وشكر الإنعام\n هـ\n ثم أمر بالنكاح، لأنه أغض للبصر، فقال: { وَأَنْكِحُواْ ٱلأَيَامَىٰ مِنْكُمْ وَٱلصَّالِحِينَ\n\n\n }\n",
      "translations": []
    }
  ]
}