{
  "chapter": "النور",
  "text": "قل للمؤمنين يغضوا۟ من ابصرهم ويحفظوا۟ فروجهم ذلك ازكى لهم ان الله خبيرۢ بما يصنعون",
  "translations": [
    {
      "translation": "Say to the muminun that they should lower their eyes and guard their private parts. That is purer for them. Allah is aware of what they do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the believing men to lower their eyes and guard their private parts. There is for them goodness in this. God is aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O Prophet, enjoin the Believing men to restrain their gaze and guard their private parts. This is a more righteous way for them: Allah has knowledge of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell the believing men to cast down their eyes and guard their carnal desires; this will make them more pure. God is certainly aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Command the Muslim men to keep their gaze low and to protect their private organs; that is much purer for them; indeed Allah is Aware of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the believing men to lower their gaze, and protect their private parts. That is purer for them. Verily, Allah is All-Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the believing men that they cast down their looks and guard their private parts; that is purer for them; surely Allah is Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the believers, that they cast down their eyes and guard their private parts; that is purer for them. God is aware of the things they work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the believing men to lower their gaze and be modest. That is purer for them. Lo! Allah is aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell believing men to lower their gaze and remain chaste. That is purer for them. God is aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou unto the believers that they shall lower their sights and guard their private parts, that is cleaner for them; verlly Allah is Aware of that which they perform.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the faithful men to cast down their looks and to guard their private parts. That is more decent for them. Allah is indeed well aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the believing men that they should lower their gaze and guard their modesty: that will make for greater purity for them: And Allah is well acquainted with all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the believing men to lower their gaze (from looking at forbidden things), and protect their private parts (from illegal sexual acts, etc.). That is purer for them. Verily, Allah is All-Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the believers they should lower their gaze and guard their private parts that is purer for them. Allah is Aware of the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the believing men to restrain their looks, and to guard their privates. That is purer for them. God is cognizant of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the believing men to reduce [some] of their vision and guard their private parts. That is purer for them. Indeed, Allah is Acquainted with what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:30] Tell believing men to lower their gaze, from what is unlawful for them to look at (min [of min absārihim, ‘their gaze’] is extra) and to guard their private parts, from doing with them what is unlawful [for them to do]. That is purer, in other words, better, for them. Truly God is Aware of what they do, with their gazes and private parts, and He will requite them for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ لِلْمُؤْمِنِينَ يَغُضُّوا مِنْ أَبْصَارِهِمْ وَيَحْفَظُوا فُرُوجَهُمْ ذَلِكَ أَزْكَى لَهُمْ إِنَّ اللَّهَ خَبِيرٌ بِمَا يَصْنَعُونَ (30) أعقب حكم الاستئذان ببيان آداب ما تقتضيه المجالسة بعد الدخول وهو أن لا يكون الداخل إلى البيت محدقاً بصره إلى امرأة فيه بل إذا جالسته المرأة غض بصره واقتصر على الكلام ولا ينظر إليها إلا النظر الذي يعسر صرفه .ولما كان الغض التام لا يمكن جيء في الآية بحرف { من } الذي هو للتبعيض إيماء إلى ذلك إذ من المفهوم أن المأمور بالغض فيه هو ما لا يليق تحديق النظر إليه وذلك يتذكره المسلم من استحضاره أحكام الحلال والحرام في هذا الشأن فيعلم أن غض البصر مراتب : منه واجب ومنه دون ذلك ، فيشمل غض البصر عما اعتاد الناس كراهية التحقق فيه كالنظر إلى خبايا المنازل ، بخلاف ما ليس كذلك فقد جاء في حديث عمر بن الخطاب حين دخل مشربة النبي صلى الله عليه وسلم « فرفعت بصري إلى السقف فرأيت أهَبَةً معلقة » .وقال النبي صلى الله عليه وسلم لعلي : « لا تتبع النظرة النظرة فإنما لك الأولى وليست لك الثانية » .وفي هذا الأمر بالغض أدب شرعي عظيم في مباعدة النفس عن التطلع إلى ما عسى أن يوقعها في الحرام أو ما عسى أن يكلفها صبراً شديداً عليها .والغض : صرف المرء بصره عن التحديق وتثبيت النظر . ويكون من الحياء كما قال عنترة: ... وأغض طرفي حين تبدو جارتيحتى يواري جارتي مأواها ... ويكون من مذلة كما قال جرير: ... فغض الطرف إنك من نميرومادة الغض تفيد معنى الخفض والنقص .والأمر بحفظ الفروج عقب الأمر بالغض من الأبصار لأن النظر رائد الزنى . فلما كان ذريعة له قصد المتذرع إليه بالحفظ تنبيهاً على المبالغة في غض الأبصار في محاسن النساء . فالمراد بحفظ الفروج حفظها من أن تباشر غير ما أباحه الدين .واسم الإشارة إلى المذكور ، أي ذلك المذكور من غض الأبصار وحفظ الفروج .واسم التفضيل بقوله : { أزكى } مسلوب المفاضلة . والمراد تقوية تلك التزكية لأن ذلك جنة من ارتكاب ذنوب عظيمة .وذيل بجملة : { إن الله خبير بما يصنعون } لأنه كناية عن جزاء ما يتضمنه الأمر من الغض والحفظ لأن المقصد من الأمر الامتثال .\n\n",
      "translations": [
        {
          "translation": "Allah then commanded them to protect their gaze and chastity, saying: (Tell the believing men) Muhammad (to lower their gaze) from that which is unlawful (and be modest) and also refrain from unlawful sexual intercourse. (That) protecting their gaze and chastity (is purer for them) is better and more akin to righteousness as far as they are concerned. (Lo! Allah is Aware of what they do) of good and evil. 389\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتهذيب أخلاقهم سيما في حفظ المحارم والحدود فقال: { قُلْ } يا أكمل الرسل { لِّلْمُؤْمِنِينَ } المصدقين بحدود الله\n الممتثلين بأوامره { يَغُضُّواْ } وينقصوا { مِنْ أَبْصَارِهِمْ } مطلقاً دائماً حتى لا يقع نظرهم بغتةً إلى المحرمات\n بل لهم أن يديموا النظر إلى الطريق الذي مشوا عليها\n حتى يَسلَموا من شرور أمارتهم وصَولة جنود الشهوات عليهم\n\n\n{ وَ } قل لهم أيضاً: { يَحْفَظُواْ فُرُوجَهُمْ } عن أمارات الزنا\n وعلامات السفاح ومقدماته\n ويتقوا عن مواضع التهم ومظانِّ الرمي والقذف مطلقاً { ذٰلِكَ } الغضُّ والحفظُ { أَزْكَىٰ لَهُمْ } وأطهرُ لنفوسهم { إِنَّ ٱللَّهَ } الرقيبَ على جميع حالاتهم { خَبِيرٌ بِمَا يَصْنَعُونَ } [النور: 30] من التفكر والترامز\n وإجالة النظر\n وتحريك سائر الأعضاء نحو ما يشتهون من المحرمات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { قل للمؤمنين } \n ويندرج فيهم المستأذنون بعد دخولهم البيوت اندراجاً أوَّلِيّاً\n أي: قل لهم: { يغضُّوا مِنْ أبصارهم } \n و \" مِن \": للتبعيض\n والمراد: غض البصر عما يحرم\n والاقتصار على ما يحل\n ووجه المرأة وكفاها ليس بعورة\n إلا خوف الفتنة\n فيحل للرجل الصالح أن يرى وجه الأجنبية بغير شهوة\n وفي الموطأ: هل تأكل المرأة مع غير ذي محرم\n أو مع غلامها؟ قال مالك: لا بأس بذلك\n على وجه ما يُعرف للمرأة أن تأكل معه من الرجال\n وقد تأكل المرأة مع زوجها ومع غيره ممن يؤاكله\n هـ\n وقال ابن القطان: فيه إباحة إبداء المرأة وجهها ويديها للأجنبي\n إذ لا يتصور الأكل إلا هكذا\n وقد أبقاه الباجِي على ظاهره وقال عياض: ليس بواجب أن تستر المرأة وجهها وإنما ذلك استحباب أو سنَّة لها\n وعلى الرجل غض بصره\n ثم قال في الإكمال: ولا خلاف أن فرض ستر الوجه مما اختص به أزواج النبي صلى الله عليه وسلم\n هـ\n { و } قل لهم أيضاً: { يحفظوا فُرُوجَهُم } \n إلا على أزواجهم\n أو ما ملكت أيمانهم\n وتقييد الغض بمن التبعيضية\n دون حفظ الفروج لِما في النظر من السَّعَة\n فيجوز النظر إلى وجه الأجنبية وكفيها وقدميها\n وإلى رأس المحارم والصدور والساقين والعضدين\n قاله النسفي\n قلت: ومذهب مالك: حرمة نظر الساقين والعضدين من المحرَم\n فإن تعذر التحرر مِنْهُ\n كشغل البنات في الدار\n باديات الأرجلِ\n فليتمسك بقول الحنفي\n إن لم يقدر على غض بصره\n قاله شيخنا الجنوي\n { ذلك أَزْكَى لهم } أي: أطهر لهم من دَنَسِ الإثم أو الريبة\n { إن الله خبير بما يصنعون } \n وفيه ترغيب وترهيب\n يعني: أنه خبير بأحوالهم وأفعالهم\n فكيف يجيلون أبصارهم\n وهو يعلم خائنة الأعين وما تُخفي الصدور؟! فعليهم\n إذا عرفوا ذلك\n أن يكونوا منه على حَذر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:5",
      "similarity": 0.43386331982064236
    },
    {
      "verse": "70:29",
      "similarity": 0.43386331982064236
    },
    {
      "verse": "31:19",
      "similarity": 0.3726190825025718
    },
    {
      "verse": "77:9",
      "similarity": 0.36875582987834254
    },
    {
      "verse": "49:3",
      "similarity": 0.3410216654760441
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024030.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024030.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}