{
  "chapter": "النور",
  "text": "وليستعفف الذين لا يجدون نكاحا حتى يغنيهم الله من فضله والذين يبتغون الكتب مما ملكت ايمنكم فكاتبوهم ان علمتم فيهم خيرا وءاتوهم من مال الله الذى ءاتىكم ولا تكرهوا۟ فتيتكم على البغاء ان اردن تحصنا لتبتغوا۟ عرض الحيوة الدنيا ومن يكرههن فان الله منۢ بعد اكرههن غفور رحيم",
  "translations": [
    {
      "translation": "Those who cannot afford to marry should abstain from what is unlawful until God enriches them by His grace. And free those slaves you possess who wish to buy their freedom after a written undertaking, if you know they have some goodness, and give them out of the riches God has given you. Do not force your maids to prostitution if they wish to lead married lives, in order to get the benefits of this world. But if someone forces them, surely God (will forgive them) after their forced helplessness, for He is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those, who cannot find a match, should observe continence till Allah provides them with means out of His bounty And if those who are in your possession, ask for a deed of emancipation, execute the deed of emancipation with them, provided that you find some good in them; and give them something out of the means Allah has given you. And do not force your slave-girls into prostitution for your own worldly gains when they themselves want to keep chaste; and if anyone forces them into it, after such a compulsion Allah will be forgiving and merciful for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those who cannot find someone to marry maintain chastity until God makes them rich through His favors. Let the slaves who want to buy their freedom have an agreement with you in writing if you find them to be virtuous. Give them money out of God's property which He has given to you. Do not force your girls into prostitution to make money if they want to be chaste. If they have been compelled to do so, God will be All-merciful and All-forgiving to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who do not have the means to get married must keep chaste till Allah provides them the resources by His munificence; and the bondwomen in your possession who, in order to earn something, seek a letter of freedom from you – then write it for them if you consider some goodness in them; and help them in their cause with Allah’s wealth which He has bestowed upon you; and do not force your bondwomen into the dirty profession, while they wish to save themselves, in order to earn some riches of the worldly life; and if one forces them then indeed Allah, upon their remaining compelled, is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those who find not the financial means for marriage keep themselves chaste, until Allah enriches them of His bounty. And such of your servants as seek a writing (of emancipation), give them such writing, if you find that there is good and honesty in them. And give them something (yourselves) out of the wealth of Allah which He has bestowed upon you. And force not your slave-girls to prostitution, if they desire chastity, in order that you may make a gain in the goods of this worldly life. But if anyone compels them, then after such compulsion, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those who do not find the means to marry keep chaste until Allah makes them free from want out of His grace. And (as for) those who ask for a writing from among those whom your right hands possess, give them the writing if you know any good in them, and give them of the wealth of Allah which He has given you; and do not compel your slave girls to prostitution, when they desire to keep chaste, in order to seek the frail good of this world's life; and whoever compels them, then surely after their compulsion Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those who find not the means to marry be abstinent till God enriches them of His bounty. Those your right hands own who seek emancipation, contract with them accordingly, if you know some good in them; and give them of the wealth of God that He has given you. And constrain not your slave-girls to prostitution, if they desire to live in chastity, that you may seek the chance goods of the present life. Whosoever constrains them, surely God, after their being constrained, is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those who cannot find a match keep chaste till Allah give them independence by His grace. And such of your slaves as seek a writing (of emancipation), write it for them if ye are aware of aught of good in them, and bestow upon them of the wealth of Allah which He hath bestowed upon you. Force not your slave-girls to whoredom that ye may seek enjoyment of the life of the world, if they would preserve their chastity. And if one force them, then (unto them), after their compulsion, lo! Allah will be Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not have the means to marry should keep themselves chaste until God grants them enough out of His bounty. If any of your slaves desire a deed of freedom, write it out for them, if you find any promise in them, and give them some of the wealth God has given you. Do not force your [slave] maids into prostitution, in order to enrich yourself, when they wish to preserve their chastity. Yet if anyone forces them, once they have been forced, God will be forgiving and merciful to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who find not means to marry shall restrain themselves until Allah enricheth them of His grace. And from among those whom your right hands own those who seek a writing- write it for them if ye know in them any good, and vouchsafe unto them of the wealth of Allah which He hath vouchsafed unto you. And constrain not your bedmaids to harlotry if they would live chastely, in order that ye may seek the chance gain of the life of the world. And whosoever will constrain them, then verily Allah is--after their constraint--Forgiving, Mercifu1.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who cannot afford marriage should be continent until Allah enriches them out of His grace. As for those who seek an emancipation deal from among your slaves, make such a deal with them if you know any good in them, and give them out of the wealth of Allah which He has given you. Do not compel your female slaves to prostitution when they desire to be chaste, seeking the transitory wares of the life of this world. Should anyone compel them, Allah will be forgiving and merciful to them following their compulsion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those who find not the wherewithal for marriage keep themselves chaste, until Allah gives them means out of His grace. And if any of your slaves ask for a deed in writing (to enable them to earn their freedom for a certain sum), give them such a deed if ye know any good in them: yea, give them something yourselves out of the means which Allah has given to you. But force not your maids to prostitution when they desire chastity, in order that ye may make a gain in the goods of this life. But if anyone compels them, yet, after such compulsion, is Allah, Oft-Forgiving, Most Merciful (to them),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those who find not the financial means for marriage keep themselves chaste, until Allah enriches them of His Bounty. And such of your slaves as seek a writing (of emancipation), give them such writing, if you know that they are good and trustworthy. And give them something yourselves out of the wealth of Allah which He has bestowed upon you. And force not your maids to prostitution, if they desire chastity, in order that you may make a gain in the (perishable) goods of this worldly life. But if anyone compels them (to prostitution), then after such compulsion, Allah is Oft-Forgiving, Most Merciful (to those women, i.e. He will forgive them because they have been forced to do this evil action unwillingly).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those who do not find the means to marry be abstinent until Allah enriches them of His bounty. Those your right hand owns who seek their freedom, make a contract with them accordingly if you know some good in them, and give them from the wealth of Allah that He has given you. Do not force your slavegirls into prostitution in order to seek worldly gain for they wish to preserve their chastity. Whosoever compels them, surely Allah, after their being compelled, is the Forgiver (to the girls), the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those who do not find the means to marry abstain, until God enriches them from His bounty. If any of your servants wish to be freed, grant them their wish, if you recognize some good in them. And give them of God’s wealth which he has given you. And do not compel your girls to prostitution, seeking the materials of this life, if they desire to remain chaste. Should anyone compel them—after their compulsion, God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But let them who find not [the means for] marriage abstain [from sexual relations] until Allah enriches them from His bounty. And those who seek a contract [for eventual emancipation] from among whom your right hands possess - then make a contract with them if you know there is within them goodness and give them from the wealth of Allah which He has given you. And do not compel your slave girls to prostitution, if they desire chastity, to seek [thereby] the temporary interests of worldly life. And if someone should compel them, then indeed, Allah is [to them], after their compulsion, Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:33] And let those who cannot find the means to marry be continent, [those who do not have] the bridal money or the means for financial support needed for marriage, [let them restrain themselves] from fornication, until God enriches them, [until] He improves their means, out of His bounty, and they marry. And those who seek a written contract [of emancipation], from among those whom your right hand owns, of male slaves and female slaves, contract with them accordingly, if you know in them any good, such as trustworthiness and the ability to earn [income] in order to fulfil the amount stated in the written contract, which might be worded for example thus: ‘I contract you for [the amount of] two thousand to be paid over a period of two months, at one thousand a month, and if you fulfill this, you are a free man’, and the other would say, ‘I accept’; and give them — this is a command for the [slaves’] owners — out of the wealth of God which He has given you, in the measure that will help them to fulfill their commitment to you (the action of ītā’, ‘giving’, here suggests that some of the amount to which they have committed themselves should be waived). And do not compel your slave-girls, your handmaidens, to prostitution, fornication, when they desire to be chaste, to abstain therefrom (this ‘desire’ is the cause of the [act of] ‘compulsion’, so that the statement is not properly a conditional), that you may seek, through such compulsion, the transient things of the life of this world — this was revealed regarding ‘Abd Allāh b. Ubayy, who used to force his slave-girls to earn money through fornication. And should anyone compel them, then surely God, after their compulsion, will be Forgiving, to these [slave-girls], Merciful, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And let those who cannot find a match) those who are unable to marry (keep chaste till Allah give them independence by His grace) until Allah gives them sufficiency from His provision. This was revealed about Huwaytib Ibn 'Abd al-'Uzza who refused to agree to give one of his slaves a chance to buy out his freedom. (And such of your slaves as seek a writing (of emancipation)) to buy out their freedom, (write it for them if ye are aware of aught of good in them) if you know they are righteous and keep their promise, (and bestow upon them) upon all people (of the wealth of Allah which He hath bestowed upon you) so that they can make an agreement for their emancipation; it is also said that here the master is encouraged to forgive a third of what has been agreed upon with his slave who wants to buy out his freedom. Then the following was revealed about 'Abdullah Ibn Ubayy and his host because they used to force their female slaves to commit adultery in order to earn money from them and have more slaves as result of the children they bore as a consequence, and so Allah forbade them from doing this and made such an act forbidden: (Force not your slave girls to whoredom that ye may seek enjoyment of the life of the world) from what they earn from working as prostitutes and also from the children they give birth to, (if they would preserve their chastity) if they want to remain chaste. (And if one force them) and if one force these slave girl to commit adultery, (then (unto them), after their compulsion) and repentance, (Lo! Allah will be Forgiving) He forgives them, (Merciful) and He will show mercy towards them after they die.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تُكْرِهُواْ فَتَيَاتِكُمْ عَلَى ٱلْبِغَآءِ } والبِغَاءُ: الزّنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلْيَسْتَعْفِفِ } أي: ليجتهد في العفة، وتسكين الشهوة للفقراء { ٱلَّذِينَ لاَ يَجِدُونَ نِكَاحاً } أي: أسبابه وصداقه، وليصبروا بمشاق العزوبة { حَتَّىٰ يُغْنِيَهُمُ ٱللَّهُ } المصلحُ لأحوالهم { مِن فَضْلِهِ } وسعة جوده، فيجدون ما يتزوجون به\n\n\n\n\nثم أشار سبحانه إلى عتق الموالي، وتخليصهم من ربقة الرق وعروة العبودية طلباً لمرضاة الله وعتقاً من عذابه، فقال: { وَٱلَّذِينَ يَبْتَغُونَ } أي: العبيد الذي يطلبون { الْكِتَابَ } أي: الكتابة المتضمنة لعتقهم، وخلاصهم عن الرق بعدما أدوا المبلغ المعهود ا لذي يكاتب عليها، وهم { مِمَّا مَلَكَتْ أَيْمَانُكُمْ } أيها الموالي سواء كانوا عبيداً أو إماءاً، قناً أو مدبراً أو مستولدة، يطلبون منكم أن تعتقوهم على مالٍ تكتسبون لهم؛ ليؤدوا إليكم منجماً، وبعدما أدوا ما تكتبون لهم صاروا أحراراً معتقين { فَكَاتِبُوهُمْ } واعتقوهم على جُعلٍ { إِنْ عَلِمْتُمْ فِيهِمْ خَيْراً } أي: علمتم وتفرستم فيهم بعدما فككتم رقابهم يكونوا صلحاء أمناء مؤمنين لا يُرجى منهم الشر والفساد { وَ } بعد عقدهم الكتابة { آتُوهُمْ } أيها المسلمون { مِّن مَّالِ ٱللَّهِ ٱلَّذِيۤ آتَاكُمْ } من فضله تفكيكاً لرقابهم عن مذلة الرق وهوان العبودية\n\n\n\n\nثم أشار سبحانه إلى حسن المعاشرة مع المماليك، ورعاية غبطتهم، ومحافظة الحدود بينهم؛ بحيث لا يُكرهونهم إلى ما لا يصلح لهم شرعاً وعادةً بل عقلاً ومروءةً، سيما إ ذا استحصنوا وتحفظوا، فقال على سبيل المبالغة في النهي: { وَلاَ تُكْرِهُواْ } أيها السادة المسلمون { فَتَيَاتِكُمْ } أي: شوابً جواريكم { عَلَى ٱلْبِغَآءِ } أي: الزنا مطلقاً سيما { إِنْ أَرَدْنَ تَحَصُّناً } وتحفظاً عن البغي مع قلة عقلهن ورشدهن، فأنتم أحق بحفظهن وحصنهن مما لا يرتضيه العقل والشرع، ولا تنصرفوا أيها الولاة عن مقتضى العقل والشرع { لِّتَبْتَغُواْ عَرَضَ ٱلْحَيَاةِ ٱلدُّنْيَا } وتطلبوا متاعها الفاني وحطامها الدني الزائل { وَمَن يُكْرِههُنَّ } سيما بعد نزول الزاجر { فَإِنَّ ٱللَّهَ } المنتقم لعصة عباده، سيما الظالم الخارج عن حدوده { مِن بَعْدِ إِكْرَاهِهِنَّ } أي: من بعد إكارههم لهن { غَفُورٌ } يغفر لهن { رَّحِيمٌ } [النور: 33] يرحمن عليهن إن كنّ مخلصات في التحصن، ويعاقب على المكرهِين أشد العقاب ويعذبهم أسوأ العذاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { ولْيَسْتَعْفِفِ الذين لا يجدون نكاحاً } أي: ليجتهد في العفة عن الزنا وقمع الشهوة من لم يجد الاستطاعة على النكاح من المهر والنفقة، { حتى يُغْنِيَهُم الله من فضلِهِ } حتى يقدرهم الله على المهر والنفقة، قال عليه الصلاة والسلام:\n\n \" يا معشر الشباب، من استطاع منكم الباءة فليتزوج فإنه أغضُّ للبصر، وأحصنُ للفرج، ومن لم يستطع فعليه بالصوم فإنه له وجَاءٌ \" \n\n، فانظر كيف رتَّب الحق تعالى هذه الأمور؟ أَمَرَ، أولاً، بما يَعْصِمُ من الفتنة، ويُبعد عن مواقعة المعصية، وهو غض البصر، ثم بالنكاح المُحَصَّنِ للدين، المغني عن الحرام، ثم بعزف النفس الأمارة بالسوء عن الطموح إلى الشهوة، عند العجز عن النكاح، إلى أن يقدر عليه\n وبالله التوفيق\n الإشارة: الأرواح والقلوب والنفوس لا يظهر نِتَاجُها حتى ينعقد النكاح بينها وبين شيخ كامل، فإذا انعقدت الصحبة بينها وبين الشيخ، قذف نطفة المعرفة في الروح أو القلب أو النفس، ثم يربيها في مشيمة الهِمَّة، ثم في حَضَانة الحفظ والرعاية، فَيَظْهَرُ منها نِتاجُ اليقين والعلوم والأسرار والمعارف، وأما إن بقيت أيامَى لا زوج لها، فلا مطمع في نِتَاجها، قال تعالى: { وأَنْكِحوا الأيامى منكم } ، وهي الأرواح، والصالحين من قلوبكم، ونفوسكم، إن يكونوا فقراء من اليقين، والمعرفة بالله، يغُنهم الله من فضله بمعرفته، والله واسع عليم، وليتعفف، عن المناكر، الذين لا يجدون من يأخذ بيدهم، حتى يغنيهم الله من فضله بالسقوط على شيخ كامل فإنه من فضل الله ومنته، لا يسقط عليه إلا من اضْطُرَّ إليه، وصَدَقَ الطلبَ في الوصول إليه\n\n\nوبالله التوفيق\n ولما أمر بتزوج العبيد، أمر بمكاتبتهم، فقال:  {\n\n\n وَٱلَّذِينَ يَبْتَغُونَ الْكِتَابَ مِمَّا مَلَكَتْ أَيْمَانُكُمْ فَكَاتِبُوهُمْ إِنْ عَلِمُتُمْ فِيهِمْ خَيْراً وَآتُوهُمْ مِّن مَّالِ ٱللَّهِ ٱلَّذِىۤ آتَاكُمْ\n\n\n }\n قلت: الكتاب هنا: مصدر، بمعنى الكتابة\n وهي: مقاطعة العبد على مال مُنَجَّمٍ، فإذا أداه خرج حراً، وإن عجز، ولو عن نصف درهم، بقي رقيقاً\n يقول الحق جل جلاله: { والذين يَبْتَغُون الكتابَ } أي: والمماليك الذين يطلبون الكتابة { مما ملكتْ أيمانُكم } من عبيدكم { فكاتِبُوهُم } ، والأمر للندب، عند مالك والجمهور، وقال الظاهرية وغيرهم: على الوجوب، وهو ظاهر قول عمر رضي الله عنه لأنس بن مالك، حين سأله مملوكه سيرين الكتابة، فأبى عليه أنس، فقال له عمر: لتكاتبنه، أَوْ لأُوجِعَنَّكَ بالدِّرَّةِ\n وإنما حمله مالك على الندب لأن الكتابة كالبيع، فكما لا يجبر على البيع لا يجبر عليها\n واختلف: هل يُجْبِرُ السيدُ عَبْدَهُ عليها، أم لا؟ قولان في المذهب\n ونزلت الآية بسبب حُوَيْطب بن عبد العُزَّى، سأل مولاه أن يكاتبه، فأبى عليه\n وحكمها عام، فأمر الله سادات العبيد أن يُكاتبوهم إذا طلبوا الكتابة\n والكتابة: أن يقول لمملوكه: كاتبتك على كذا، فإن أدى ذلك عُتِقَ، ومعناه: كتبت لك على نفسي أن تُعْتَقَ مني إذا وَفَّيْتَ المال، وكتبتَ لي على نفسك أن تفي بذلك\n وتجوز حَالَّةً، وتسمى: القطاعة، ومُنَجَّمَةً وَغَيْرَ مُنَجَّمَةٍ\n وقوله تعالى: { إنْ علمتمْ فيهم خيراً } ، أي: قدرة على الكسب، وأمانة وديانة، والنَّدْبِيَّةُ متعلقة بهذا الشرط، فالخير هنا: القوة على الأداء بأي وجه كان، وقيل: هو المال الذي يؤدي منه كتابته، من غير أن يسأل أموال الناس، وقيل: الصلاح في الدين\n { وآتوهم من مال الله الذي آتاكم } ، هذا أمر بإعانَةِ المكاتب على كتابته، واخْتُلِف: مَنِ المُخَاطَبُ بذلك؟ فقيل: هو خطاب للناس أجمعين، وقيل: للولاة، والأمر على هذين القولين للندب، وقيل: للسادات المُكَاتِبينَ، وهو على هذا القول، ندب عند مالك، ووجوب عند الشافعي\n فإن كان الأمر للناس، فالمعنى: أن يعطوهم صدقة من أموالهم، وإن كان للولاة: فيعطوهم من الزكوات أو من بيت المال، وإن كان للسادات فَيَحُطُّوا عنهم من كتابتهم، وقيل: يعطوهم من أموالهم، من غير الكتابة، وعلى القول بالحط من الكتابة اختلف في مقدار ما يُحَطُّ، فقيل: الربع، وروي ذلك عن رسول الله صلى الله عليه وسلم، وقيل الثلث، وقال مالك: لا حد في ذلك، بل أقل ما يطلق عليه شيء، إلا أن الشافعي يجبره على ذلك، ولا يجبره مالك\n\n\nوزمان الحط عنه في آخر الكتابة عند مالك، وقيل: في أول نَجْمٍ\n قاله ابن جزي\n الإشارة: العبيد على أربعة أقسام: عَبْدٌ قِنُّ مقتنى للخدمة، وعبد مأذون له في التجارة، وعبد مُكَاتبٌ، وعبد آبق\n فمثال الأول، وهو العبد القن: أهل الخدمة، وهم العباد والزهاد، أقامهم الحق تعالى لخدمته، وقَوَّاهُمُ على دوام معاملته، أهل الصيام والقيام، وأهل السياحة والهيام\n ومثال الثاني، وهو المأذون له: العارفون بالله، يتصرفون في ملك سيدهم بالله، خلفاء رسول الله صلى الله عليه وسلم، يحكمون بحكم الله ويأخذون من الله ويدفعون إلى الله، يأخذون النصيب من كل شيء، ولا يُؤْخَذُ من نصيبهم شيء، قد سخرّ لهم كل شيء، ولم يُسَخَّرُوا لشيء، سُلَِطُوا على كل شيء، ولم يُسَلَّطْ عليهم شيء، يخالطون الناس بجسمهم، ويباينونهم بسرهم، فالدنيا سوق تجارتهم، والمعرفة رأس بضاعتهم، والعدل في الغضب والرضا مِيزانُهم، والقصد في الفقر والغنى عُنْوانهم، والعلم بالله مفزعهم ومنجاهم، والقرآن كتاب الإذن من مولاهم، والفهم عن الله مرجعهم ومأواهم\n ومثال الثالث، وهو المُكَاتَب: الصالحون من المؤمنين يعملون على فك رقبتهم من النار، فإذا أدوا ما فرض عليهم حررهم بعد موتهم، وأسكنهم فسيح جنانه\n ومثال الآبق: هم العصاة والفجار، استمروا على عصيانهم، حتى قدموا على الملك الجبار، فهم تحت حكم المشيئة، إن شاء عفا عنهم، وإن شاء عاقبهم\n والله تعالى أعلم\n ولما أمر بتزويج الإماء نهى عن إكراههن على الزنا، فقال: {\n\n\n وَلاَ تُكْرِهُواْ فَتَيَاتِكُمْ عَلَى ٱلْبِغَآءِ إِنْ أَرَدْنَ تَحَصُّناً لِّتَبْتَغُواْ عَرَضَ ٱلْحَيَاةِ ٱلدُّنْيَا وَمَن يُكْرِههُنَّ فِإِنَّ ٱللَّهِ مِن بَعْدِ إِكْرَاهِهِنَّ غَفُورٌ رَّحِيمٌ وَلَقَدْ أَنْزَلْنَآ إِلَيْكُمْ آيَاتٍ مُّبَيِّنَاتٍ وَمَثَلاً مِّنَ ٱلَّذِينَ خَلَوْاْ مِن قَبْلِكُمْ وَمَوْعِظَةً لِّلْمُتَّقِينَ } [آية: 33-34]\n يقول الحق جل جلاله: { ولا تُكْرهُوا فتياتكم } أي: إِمَاءَكُمْ، يقال للعبد: فتى، وللأمة: فتاة\n والجمع: فتيات، { على البغاء } أي: الزنا، وهو خاص بزنا النساء\n كان لابن أُبيِّ ست جوار: مُعَاذَة، ومُسَيْكَة، وأميمة، وعَمْرَة، وأَرْوَى، وقُتَيْلَة، وكان يكرههن، ويضرب عليهن الضرائب لذلك، فشكتِ ثنتان منهن إلى رسول الله صلى الله عليه وسلم، فنزلت الآية\n وقوله تعالى: { إِنْ أَرَدْنَ تَحَصُّناً } أي: تعففاً، ليس قيداً في النهي عن الإكراه، بل جرى على سبب النزول، فالإكراه: إنما يُتَصَوَّرُ مع إرادة التَّحَصُّنِ لأن المطيعة لا تسمى مكرهة، ثم خصوص السبب لا يُوجب تخصيص الحُكم على صورة السبب، فلا يختص النهي عن الإكراه بإرادة التعفف، وكذلك الأمر بالزنا، والإذن فيه لا يُبَاحُ ولا يجوز شيء من ذلك للسيد، وما يقبض من تلك الناحية سُحْتٌ وربا\n وفيه توبيخ للموالي لأن الإماء إذا رغبن في التحصن فأنتم أولى بذلك، ثم علل الإكراه بقوله: { لتبتغوا عَرَض الحياةِ الدنيا } أي: لتبتغوا بإكراهن على الزنا أجورهن وأولادهن، جيءَ به تشنيعاً لهم على ما هم عليه من أحمال الوزر الكبير لأجل النزر الحقير، أي: لا تفعلوا ذلك لطلب المتاع السريع الزوال، الوشيك الاضمحلال\n\n\n{ ومن يُكْرِههُنَّ } على ما ذُكِرَ من البغاء، { فإن الله من بعد إكرَاهِهِنَّ غفورٌ } لهن { رحيمٌ } بهن، وفي مصحف ابن مسعود كذلك\n وكان الحسن يقول: لهن والله\n وقيل: للسيد إذا تاب",
      "translations": []
    }
  ]
}