{
  "chapter": "النور",
  "text": "والذين كفروا۟ اعملهم كسرابۭ بقيعة يحسبه الظمـان ماء حتى اذا جاءه لم يجده شيـا ووجد الله عنده فوفىه حسابه والله سريع الحساب",
  "translations": [
    {
      "translation": "But the actions of those who are kafir are like a mirage in the desert. A thirsty man thinks it is water but when he reaches it, he finds it to be nothing at all, but he finds Allah there. He will pay him his account in full. Allah is swift at reckoning.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, their deeds are like a mirage in the desert which the thirsty takes for water till he reaches it to find that there was nothing, and finds God with him who settles his account, for God is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the other hand,) the deeds of those who disbelieved, maybe likened to a mirage in a waterless desert, which the thirsty one took for water; but when he reached there he found nothing to drink; nay, he found there Allah Who settled his full account, and Allah is very swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The deeds of the unbelievers are like a mirage which a thirsty man thinks is water until he goes near and finds nothing. Instead he finds God who gives him his due recompense. God's reckoning is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved – their deeds are like a mirage in the wasteland, so the thirsty may believe it to be water; to the extent that when he came close to it, he found it is nothing and found Allah close to him, so He filled his account; and Allah is Swift At Taking Account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieved, their deeds are like a mirage in a Qi`ah. The thirsty one thinks it to be water until he comes up to it, he finds it to be nothing; but he finds Allah with him, Who will pay him his due. And Allah is swift in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who disbelieve, their deeds are like the mirage in a desert, which the thirsty man deems to be water; until when he comes to it he finds it to be naught, and there he finds Allah, so He pays back to him his reckoning in full; and Allah is quick in reckoning;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the unbelievers, their works are as a mirage in a spacious plain which the man athirst supposes to be water, till, when he comes to it, he finds it is nothing; there indeed he finds God, and He pays him his account in full; (and God is swift at the reckoning.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, their deeds are as a mirage in a desert. The thirsty one supposeth it to be water till he cometh unto it and findeth it naught, and findeth, in the place thereof, Allah Who payeth him his due; and Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who deny the truth, their works are like a mirage in a desert. The thirsty traveller thinks it to be water, but when he comes near, he finds it to be nothing. He finds God there, who pays him his account in full. God is swift in His reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve--their works are like a mirage in a desert which the thirsty deemeth to be water, until when he cometh thereto he findeth not aught, and findeth Allahs with himself, and He payeth him his account in full; and Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the faithless, their works are like a mirage in a plain, which the thirsty man supposes to be water. When he comes to it, he finds it to be nothing; but there he finds Allah, who will pay him his full account, and Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Unbelievers,- their deeds are like a mirage in sandy deserts, which the man parched with thirst mistakes for water; until when he comes up to it, he finds it to be nothing: But he finds Allah (ever) with him, and Allah will pay him his account: and Allah is swift in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, their deeds are like a mirage in a desert. The thirsty one thinks it to be water, until he comes up to it, he finds it to be nothing, but he finds Allah with him, Who will pay him his due (Hell). And Allah is Swift in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, their works are like a mirage in the wilderness. The thirsty person thinks it is water, but when he comes near he finds that it is nothing. He finds Allah there, who pays him his account in full. Allah is Swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, their works are like a mirage in a desert. The thirsty assumes it is to be water. Until, when he has reached it, he finds it to be nothing, but there he finds God, Who settles his account in full. God is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieved - their deeds are like a mirage in a lowland which a thirsty one thinks is water until, when he comes to it, he finds it is nothing but finds Allah before Him, and He will pay him in full his due; and Allah is swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:39] And as for those who disbelieve, their works are like a mirage in a plain (qī‘a is the plural of qā‘, that is to say, fulāt, ‘an open space’). [A mirage is] a kind of radiation which one might observe therein at midday during extreme heat, resembling running water — which the thirsty man supposes to be water until he comes to it and finds it to be nothing, like what he had supposed. Likewise is [the case of] the disbeliever who supposes that his deeds, such as some voluntary alms, will benefit him; but when he dies and comes before his Lord he will not find his deed, in other words, it will be of no benefit to him; and he finds God   there, namely, in the place of his deeds, Who pays him his account in full, that is, He requites him for it in this world; and God is swift at reckoning, that is, at requiting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for those who disbelieve) in Muhammad (pbuh) and in the Qur'an, (their deeds) the similitude of their works in the Hereafter (are as a mirage in a desert. The thirsty one supposeth it to be water) from far (till he cometh unto it and flndeth it naught) he finds that it is not water; similarly, the disbeliever will not find any reward for his works in the Hereafter, (and finds, in the place thereof, Allah) and he finds with Allah the punishment for the sins he committed; it is also said that this means: and finds Allah ready to chastise him, (Who payeth him his due) Who inflict on him his punishment; (and Allah is swift at reckoning) Allah is severe in His punishment; it is also said that this means: when Allah takes people to task His reckoning is swift.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَسَرَابٍ بِقِيعَةٍ } والسَّرابُ: يَكونُ نِصفَ النَّهارِ\n والقِيعةُ والقَاعُ واحدٌ\n وهو المُستوى من الأَرضِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Kasara bin qi'ah} - and the half is the half of the day.\n\n\nThe roof and the ceiling are one.\n\n\nAnd it is the level of the earth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والذين كفروا } حجبوا عن الدين { أعمالهم } التي يعملونها رجاء الثواب { كسراب بقيعة } لكونها صادرة عن هيئات خالية قائمة بساهرة نفس حيوانية { يحسبه الظمآن ماء } أي: يتوهمها صاحبها المؤمل لثوابها أموراً باقية لذيذة دائمة مطابقة لما توهمه { حتى إذا جاءه } في القيامة الصغرى { لم يجده } شيئاً موجوداً\n بل خالياً\n فاسداً\n وظناً كاذباً\n كما قال تعالى:\n[الفرقان\n الآية:23]\n { ووجد الله عنده } أي: وجد ملائكة الله من زبانية القوى والنفوس السماوية والأرضية عند ذلك التخيّل الموهوم يقودونه إلى نيران الحرمان وخزي الخسران\n ويوفونه ما يناسب اعتقاده الفاسد وعمله الباطل من حميم الجهل وغساق الظلمة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته المستمرة: { وَٱلَّذِينَ كَفَرُوۤاْ } ستروا الحق\n وأنكروا عليه\n وأظهروا الباطل ظلماً وزوراً\n ووجوه عناداً ومكابرةً لذلك صارت { أَعْمَالُهُمْ } التي خيلوها صالحةً مستجلبةً لأنواع النفع في يوم الجزاء على عكس أعمال المؤمنين { كَسَرَابٍ } أي: كمثلٍ سرابٍ يلمع ويبرق { بِقِيعَةٍ } أي: باديةٍ وصحراءٍ { يَحْسَبُهُ } ويظنه { ٱلظَّمْآنُ } من بعيد { مَآءً } مُسكناً للعطش\n مبرِّداً للأكباد\n\n\nفلما رآه سارع إليه\n وسعى نحوه سريعاً { حَتَّىٰ إِذَا جَآءَهُ } بعد تعبٍ كثيرٍ وعناسْ مفرطٍ مؤملاً الوصول إلى الماء { لَمْ يَجِدْهُ } ماءً بل لم يجد { شَيْئاً } آخرَ متأصلاً في الوجود سوى العكوس التي تتراءى كالماء في البريق واللمعان من تقلب الحدقة\n وتشتت البال واضطراب الحواس باستيلاء العطش المفرط وحرارة الأكباد\n { وَ } بعدما آيس من نفع أعماله { وَجَدَ ٱللَّهَ } الرقيبَ عليه في جميع أحواله\n محاسباً إياه عما صدر عنه { عِندَهُ فَوَفَّـٰهُ حِسَابَهُ } على الوجه الأقسط الأعدل بلا زيادةٍ ولا نقصاٍ { وَٱللَّهُ } المطلعُ على جميع ما جرى على عباه في جميع شئوهم وتطوراتهم { سَرِيعُ ٱلْحِسَابِ } [النور: 39] يحاسبهم\n ويجازيهم على مقتضى علمه وخبرته\n بلا فوت شيءٍ مما صدر عنهم عدلاً منه سبحانه\n\n\n{ أَوْ } مثل أعمال الكفرة في عدم النفع والخير { كَظُلُمَاتٍ } أي: كمثل أصحاب ظلمات الليل الواقعة لهم { فِي بَحْرٍ لُّجِّيٍّ } أي: عميقٍ غائرٍ منسوبٍ إلى اللجّ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" كسراب \": خبر الثاني\n وهو: ما يُرى في الفلوات من لمعان الشمس وقت الظهيرة\n يسرب على وجه الأرض\n فَيُظَنُّ أنه ماء يجري\n وبقيعة: متعلق بمحذوف\n صفة لسراب\n أي: كائن بأرض قيعة\n أي: منبسطة\n و سحاب ظلمات: مَنْ جَرَّها: فبالإضافة\n ومن رفعها: فخبر\n أي: هي ظلمات\n يقول الحق جل جلاله: في بيان أعمال الكفرة وظلمة قلوبهم\n بعد بيان حَالِ المؤمنين وأنوار قلوبهم: { والذين كفروا أعمالُهم } التي هي من أبواب البر\n كصلة الرحم\n وفك العُنَاةِ\n وسقاية الحاج\n وعمارة البيت\n وإغاثة الملهوف\n وَقِرَى الأضياف\n ونحوها\n مما لَوْ قارنه الإيمان لاستوجب الثواب\n مثاله: { كسراب } كفضاء بقيعَةٍ بأرض منبسطة\n { يَحْسَبُهُ الظمآنُ ماءً حتى إذا جاءه لم يجِدْه شيئاً } أي: لم يجده كما ظنه ورجاه\n بل خاب مطمعه ومسعاه\n { ووجدَ الله عنده } أي: وجد جزاء الله\n أو حُكمه\n عند عمله\n أو عند جزائه\n { فوفَّاه حسابَه } أي: أعطاه جزاءه كله وافياً\n وإنما وحّد\n بعد تقديم الجمع\n حملاً على كل واحد من الكفار\n { والله سريعُ الحساب } يحاسب العباد في ساعة لأنه لا يحتاج إلى عد وعقد\n ولا يشغله حساب عن حساب\n أو قَرِيبٌ حسابُه لأنَّ كل آتٍ قريبٌ\n شبه ما يعمله الكفرة من البر\n الذي يعتقد أنه ينفعه يوم القيامة وينجيه من عذاب الله\n ثم يخيب في العاقبة أَملُهُ\n ويلقى خلاف ما قدّر\n بسراب يراه الكافر بالساهرة\n وقد غلبه عطش يوم القيامة\n فيحسبه ماء\n فيأتيه\n فلا يجد ما رجاه\n ويجد زبانية الله\n فيأخذونه إلى جهنم\n فيسقونه الحميم والغساق\n قيل: هم الذين قال الله فيهم:\n[الغاشية: 3]\n\n[الكهف: 104]\n قيل: نزلت في عتبة بن ربيعة بن أمية\n كان ترهب في الجاهلية ولبس المسوح\n والتمس الدين\n فلما جاء الإسلام كفر\n هـ\n ثم ضرب مثلاً لأعمالهم في الدنيا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:119",
      "similarity": 0.39380522207163704
    },
    {
      "verse": "20:106",
      "similarity": 0.365490491942546
    },
    {
      "verse": "78:20",
      "similarity": 0.32752301724176563
    },
    {
      "verse": "13:10",
      "similarity": 0.30914226372770226
    },
    {
      "verse": "18:61",
      "similarity": 0.285041678612935
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/24:39.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/24:39.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/24:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}