{
  "chapter": "النور",
  "text": "فى بيوت اذن الله ان ترفع ويذكر فيها اسمه يسبح له فيها بالغدو والءاصال",
  "translations": [
    {
      "translation": "In houses which Allah has permitted to be built and in which His name is remembered, there are men who proclaim His glory morning and evening,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The light is lit) in houses of worship which God has allowed to be raised, and His name remembered in them. His praises are sung there morning and evening,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Those who obtain guidance to His light are found) in the houses which He has enjoined to raise up and to mention His name therein. In them such people glorify Him morning and evening\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This niche) is in the houses that God has declared to be highly respected and His Name be mentioned therein in glory in the morning and evening\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the houses (mosques) which Allah has commanded to erect and in which His name is taken – praising Allah in them at morn and evening,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In houses which Allah has ordered to be raised, in them His Name is remembered. Therein glorify Him in the mornings and in the evenings,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In houses which Allah has permitted to be exalted and that His name may be remembered in them; there glorify Him therein in the mornings and the evenings,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in temples God has allowed to be raised up, and His Name to be commemorated therein; therein glorifying Him, in the mornings and the evenings,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This lamp is found) in houses which Allah hath allowed to be exalted and that His name shall be remembered therein. Therein do offer praise to Him at morn and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They worship] in the houses which God has allowed to be raised for the remembrance of His name, morning and evening,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They worship in houses which Allah has bidden to be exalted and His name to be remembered therein; they hallow Him therein in mornings and evenings-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In houses Allah has allowed to be raised and wherein His Name is celebrated; He is glorified therein, morning and evening,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Lit is such a Light) in houses, which Allah hath permitted to be raised to honour; for the celebration, in them, of His name: In them is He glorified in the mornings and in the evenings, (again and again),-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In houses (mosques), which Allah has ordered to be raised (to be cleaned, and to be honoured), in them His Name is glorified in the mornings and in the afternoons or the evenings,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In houses which Allah has allowed to be raised up, and His Name to be remembered therein. In the morning and evening\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In houses which God has permitted to be raised, and His name is celebrated therein. He is glorified therein, morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Such niches are] in mosques which Allah has ordered to be raised and that His name be mentioned therein; exalting Him within them in the morning and the evenings\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:36] In houses (fī buyūtin is semantically connected to yusabbihu, ‘glorify’, that will follow) [whose status] God has allowed to be raised, [houses He has allowed] to be venerated, and wherein His Name is remembered, through the affirmation of His Oneness, therein [they] make glorifications (read yusabbahu, ‘glorifications are made’, or yusabbihu, meaning ‘[therein] pray’) to Him in the mornings (al-ghuduww is a verbal noun, meaning al-ghadawāt, ‘the early mornings’) and the evenings, the darkness, after sunset,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((This lamp is found) in houses) these lamps are hung in houses (which Allah hath allowed) which Allah has commanded (to be exalted) to be built; the reference here is to mosques (and that His Name) His divine Oneness (shall be remembered therein) in the mosques. (Therein) in the mosques (do offer praise to Him) pray to Him (at morn) the Fajr prayer (and evening) the prayers of Zuhr, 'Asr, Maghrib and 'Isha'.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولهذا التفطن والتذكر يتوجه المخلصون المنجذبون نحو الحق { فِي بُيُوتٍ } معدةٍ للتوجه مع أنه { أَذِنَ ٱللَّهُ } الهادي لعباده إلى توحيده { أَن تُرْفَعَ } بناؤها وتُعظَّم غاية التعظيم، { وَيُذْكَرَ فِيهَا } أي: في تلك البيوت والمساجد { ٱسْمُهُ } الذي هو كلمة توحيده وتقدسيه، ولهذا { يُسَبِّحُ لَهُ } أي: الله طلباً لمرضاته لا لغرضٍ دنيويٍ أو أخرويٍ { فِيهَا } أي: في تلك البيوت المذكورة دائماً { بِٱلْغُدُوِّ وَٱلآصَالِ } [النور: 36] أي: في جميع آناء الأيام والليالي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: في بيوت: يتعلق بمشكاة، أي: كائنة في بيوت، أو توقد، أو يسبح، أي: يسبح له رجال في بيوت، وفيه تكرير لزيادة التأكيد، نحو: زيد في الدار جالس فيها، أو بمحذوف، أي: سبّحوا في بيوت\n وأَذِنَ: نَعْتٌ له\n يقول الحق جل جلاله: وذلك النور الذي في المشكاة يكون { في بيوتٍ أَذن الله أن ترفع } ، وهي المساجد والزوايا المُعدَّة لذكر الله والصلاة وتلاوة القرآن\n ورفعها: تعظيمها\n أي: التي أمر الله بتعظيمها كتطهيرها من الخبث، وتنقيتها من القذى، وتعليق القناديل ونصب الشموع، ويزاد التعظيم في شهر رمضان\n ومن تعظيمها: غلقها في غير أوقات الصلاة، وقيل المراد برفعها: بناؤها، كقوله تعالى:\n\n[النازعات:27 - 28]\n\n[البقرة:127]، والأول أصح\n { و } أَذِنَ أيضاً أن { يُذْكَرَ فيها اسمُه } ، وهو عام في جميع الذِّكْر، مفرداً أو جماعة، ويدخل فيه تلاوة القرآن\n { يُسَبِّحُ له فيها بالغُدوّ والآصال } أي: يصلي له فيها بالغداة: صلاة الفجر، والآصال: صلاة الظهر والعصر والعِشَاءين\n وإنما وَحَّد الغدو لأن صلاته صلاة واحدة، وفي الآصال صلوات، وهو جمع أصيل، وفاعل \" يُسَبِّحُ \": رجال\n ومن قرأ بفتح الباء، فأسنده إلى أحد الظروف الثلاثة، أعني: له فيها بالغدو",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:15",
      "similarity": 0.6706947523085781
    },
    {
      "verse": "7:205",
      "similarity": 0.5088349736122989
    },
    {
      "verse": "33:42",
      "similarity": 0.5036558216504398
    },
    {
      "verse": "76:25",
      "similarity": 0.4857912670115845
    },
    {
      "verse": "37:64",
      "similarity": 0.4660259046472053
    }
  ]
}