{
  "chapter": "النور",
  "text": "الم تر ان الله يزجى سحابا ثم يؤلف بينه ثم يجعله ركاما فترى الودق يخرج من خلله وينزل من السماء من جبال فيها منۢ برد فيصيب به من يشاء ويصرفه عن من يشاء يكاد سنا برقه يذهب بالابصر",
  "translations": [
    {
      "translation": "Do you not see that Allah propels the clouds then makes them coalesce then heaps them up, and then you see the rain come pouring out of the middle of them? And He sends down mountains from the sky with hail inside them, striking with it anyone He wills and averting it from anyone He wills. The brightness of His lightning almost blinds the sight.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that God drives the clouds, then joins them together and puts them fold on fold. Then you see the rain fall through them; and He sends down hail from the sky where there are mountains of it, and strikes those with it whom He will, and wards it off from whomsoever He please. His lightning could snatch away their eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not observe that Allah makes the cloud move gently then joins its pieces together: then gathers it into a mass of thick cloud: then you see that rain-drops fall down from its midst: and He sends down hail out of the high up mountains in the heaven: then He smites with it whom He wills and turns it away from whom He pleases: then a flash of lightning from it dazzles the eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that God moves the clouds gently, brings them together, piles them up, and then you can see the rain coming from them. He sends down hailstones from the mountains in the sky. With them He strikes or protects from them whomever He wants. The lightening can almost take away the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that Allah slowly transports the clouds, then gathers them together, then heaps them together, so you see the rain coming forth from between them? And from the sky He sends down hail from the mountains of ice, then sends them upon whomever He wills, and averts them from whomever He wills; it is close that the flash of its lightning take away the eyesight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah drives the clouds gently, then joins them together, then makes them into a heap of layers, and you see the rain come forth from between them; and He sends down from the sky, from mountains in it of ice, and strikes therewith whom He wills, and averts it from whom He wills. The vivid flash of its (clouds) lightning nearly blinds the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah drives along the clouds, then gathers them together, then piles them up, so that you see the rain coming forth from their midst? And He sends down of the clouds that are (like) mountains wherein is hail, afflicting therewith whom He pleases and turning it away from whom He pleases; the flash of His lightning almost takes away the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "hast thou not seen how God drives the clouds, then composes them, then converts them into a mass, then thou seest the rain issuing out of the midst of them? And He sends down out of heaven mountains, wherein is hail, so that He smites whom He will with it, and turns it aside from whom He will; wellnigh the gleam of His lightning snatches away the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how Allah wafteth the clouds, then gathereth them, then maketh them layers, and thou seest the rain come forth from between them; He sendeth down from the heaven mountains wherein is hail, and smiteth therewith whom He will, and averteth it from whom He will. The flashing of His lightning all but snatcheth away the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how God drives the clouds, then joins them together, then piles them into layers and then you see the rain pour from their midst? He sends down from the skies mountainous masses [of clouds] charged with hail, and He makes it fall on whom He will, and turns it away from whom He pleases. The flash of His lightning may well-nigh take away the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not that Allah driveth a cloud along, then combineth it, then maketh it a heap, and then thou beholdest the fine rain come forth from the interstices thereof? And He sendeth down from the heaven mountains wherein is hail, then afflicteth therewith whomsoever He will, and averteth it from whomsoever He will: wellnigh the flash of His lightening taketh away the sights.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded that Allah drives the clouds, then He composes them, then He piles them up, whereat you see the rain issuing from its midst? And He sends down hail from the sky, out of the mountains that are in it, and He strikes with it whomever He wishes, and turns it away from whomever He wishes. The brilliance of its lightening almost takes away the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not that Allah makes the clouds move gently, then joins them together, then makes them into a heap? - then wilt thou see rain issue forth from their midst. And He sends down from the sky mountain masses (of clouds) wherein is hail: He strikes therewith whom He pleases and He turns it away from whom He pleases, the vivid flash of His lightning well-nigh blinds the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah drives the clouds gently, then joins them together, then makes them into a heap of layers, and you see the rain comes forth from between them. And He sends down from the sky hail (like) mountains, (or there are in the heaven mountains of hail from where He sends down hail), and strike therewith whom He will, and averts it from whom He wills. The vivid flash of its (clouds) lightning nearly blinds the sight. [Tafsir At-Tabari].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how Allah drives the clouds, then gathers them and converts them into a mass, then you see rain coming from the midst of them? And He sends down out of heaven mountains in which there is hail, pelting with it whom He will, and turning it away from whom He will. The flash of its lightning almost snatches away the sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how God propels the clouds, then brings them together, then piles them into a heap, and you see rain drops emerging from its midst? How He brings down loads of hail from the sky, striking with it whomever He wills, and diverting it from whomever He wills? The flash of its lightening almost snatches the sight away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah drives clouds? Then He brings them together, then He makes them into a mass, and you see the rain emerge from within it. And He sends down from the sky, mountains [of clouds] within which is hail, and He strikes with it whom He wills and averts it from whom He wills. The flash of its lightening almost takes away the eyesight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:43] Have you not seen how God drives the clouds, moves them along gently, then composes them, joining some with others and making scattered pieces as one, then piles them up, some on top of others, whereat you see the rain issuing from the midst of them, [from specific] outlets in them? And He sends down from the heaven out of the mountains (min jibālin: min is extra) that are therein, in the heaven (fīhā substitutes [for mina’l-samā’i, ‘from the heaven’] with the repetition of a genitive preposition) hail, that is, [He sends down] some [hail], and smites with it whom He will and turns it away from whom He will. The brilliance of its lightning, its flashing, would almost take away the eyes, that look at it, in other words, [it would almost] snatching them away.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not seen) have you not been informed, Muhammad, in the Qur'an about (how Allah wafteth) drives about (the clouds, then gatherth them) then brings the clouds together, (then maketh them layers, and thou seest the rain come forth from between them) from between the clouds; (He sendeth down from the heaven mountains wherein is hail) He says: He sends down hail from mountains in heaven, (and smiteth therewith) and with hail He punishes (whom He will, and averteth it) and averts its punishment (from whom He will. The flashing of His lightning) the light emanating from lightning in the clouds (all but snatcheth away the sight) from the intensity of its light.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلَمْ تَرَ أَنَّ ٱللَّهَ يُزْجِي سَحَاباً } معناه يَسوقُ { ثُمَّ يَجْعَلُهُ رُكَاماً } معناه مُتراكمٌ بَعضُهُ على بعضٍ\n\n\n\n\nوقوله تعالى: { فَتَرَى ٱلْوَدْقَ يَخْرُجُ مِنْ خِلاَلِهِ } والوَدَقُ: المَطرُ وخلالُهُ: بينَ السَّحابِ\n\n\n\n\nوقوله تعالى: { سَنَا بَرْقِهِ } معناه ضَوءُ بَرقهِ\n\n",
      "translations": [
        {
          "translation": "\n\nDid you not see that Allah drives clouds? Then He makes them into a mass, then you see the rain come out of it.\n\n\nAnd the saying of Allah, \"You will see the rain coming out of the clouds,\" and the rain is the rain and its midst is between the clouds.\n\n\nAnd His saying, {We will show them Our signs in the universe and in themselves} [means that] His light will appear to them in the universe and in their hearts.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ألم تر أن الله يزجي } برياح النفخات والإرادات سحاب العقل فروعاً منتزعة من الصور الجزئية ثم يؤلف فيه على ضروب المتألفات المنتجة { ثم يجعله ركاماً } حججاً وبراهين { فترى } ودق النتائج والعلوم اليقينية { يخرج من خلاله وينزل من } سماء الروح من جبال أنوار السكينة واليقين الموجبة للوقار والطمأنينة والاستقرار { فيها } أي في تلك الجبال من برد الحقائق والمعارف الكشفية والمعاني الذوقية، أو من جبال في السماء وهي معادن العلوم والكشوف وأنواعها، فإنّ لكل علم وصنعة معدناً في الروح ثابتاً فيه بحسب الفطرة، يفيض منه ذلك العلم، ولهذا يتأتى لبعضهم بعض العلوم بالسهولة دون بعض، ويتأتى لبعضهم أكثرها ولا يتأتى لبعضهم شيء منها، وكل ميسر لما خلق له، أي: ينزل من سماء الروح من الجبال التي فيها برد المعارف والحقائق { فيصيب به من يشاء } من القوى الروحانية { ويصرفه عمن يشاء } من القوى النفسانية والنفوس المحجوبة\n { يكاد سنا برقه } أي: ضوء بوارق ذلك البرد، وهو ما يقدّمه من الأنوار الملتمعة التي لا تلبث ولا تستقرّ بل تلمع وتخفى إلى أن تصير متمكنة تذهب بأبصار البصائر حيرة ودهشاً، وكلما زاد ازدادت تحيراً، ولهذا قال عليه السلام:\n\n \" ربّ زدني تحيّراً \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي { أَنَّ ٱللَّهَ } المتكفلَ لأرزاق عباده كيف { يُزْجِي } ويسوق أجزاء الأبخرة والأدخنة إلى فوقٍ متفرقةً؛ ليجعله { سَحَاباً } هامراً { ثُمَّ يُؤَلِّفُ } ويركب { بَيْنَهُ } أي: بين أجزاء السحاب { ثُمَّ يَجْعَلُهُ رُكَاماً } متراكماً متكاشفاً متصلاً؛ ليكوّن منه مياهً كثيرةً، ثم يُجعل له فتوقاً ومنافذَ { فَتَرَى } أيها الناظر المعتبر { ٱلْوَدْقَ } أي: المطر المتقاطر { يَخْرُجُ مِنْ خِلاَلِهِ } وفتوقه غايةً منه سبحانه لمن في حوزته فضلُه وجودُه { وَ } كذا { يُنَزِّلُ مِنَ } جانب { ٱلسَّمَآءِ مِن جِبَالٍ فِيهَا } يعني: من قطعِ سحابٍ متراكمٍ في الجو على هيئة الجبال الرواسي { مِن بَرَدٍ } متكونٍ من الأبخرة والأدخنة الواصلة إلى الطقبة الزمهريرية من الهواء وصولاً تاماً، إلى حيث انجمدت انجماداً صلباً كالحجر من كمال البرودة، فيُنزل منها إظهاراً لقهره سبحانه، وتنبيهاً على صَولة سطوة صفاته الجلالية { فَيُصِيبُ بِهِ } سبحانه { مَن يَشَآءُ } من عباده ممن سبق القهرُ والغضبُ منه سبحانه يمقتضى جلاله سبحانه { وَيَصْرِفُهُ } أي: يصرف شره { عَن مَّن يَشَآءُ } من أهل العناية على مقتضى لطفه وجماله\n\n\n\n\nومن أمارات غضب الله وقهره: إنه { يَكَادُ } ويقرب { سَنَا بَرْقِهِ } اللامعِ؛ أي: ضوئهِ الحاصلِ منه في كمال الظلمة حالة الاصطكاك { يَذْهَبُ بِٱلأَبْصَارِ } [النور: 43] الناظرة نحوه، ويختطفها بحدوث الضد من الضد فجأة، وذلك من الأسباب التافهة التامة لتفريق البصر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ألم ترَ أن الله يُزْجِي } أي: يسوق، برفق وسهولة، { سَحَاباً }: جمع سحابة، { ثم يُؤلِّف بينه } أي: يضم بعضه إلى بعض، { ثم يجعله رُكاماً } متراكماً بعضه فوق بعض، { فَتَرى الوَدْقَ }: المطر، { يخرجُ من خِلالِه } من فُتُوقِهِ ووسطه، جمع خَلل، كجبال وجبل، وقيل: مفرد، كحجاب وحجاز\n قال القشيري: ترتفع بقدرته بُخَارَاتُ البحر، فيتصعد، بتسييره وتقديره، إلى الهواء، وهو السحاب، ثم يديره إلى سَمْتِ يريد أن ينزل به المطر، ثم ينزل ما في السحاب من ماء البحر، قطرة قطرة، ويكون الماء، حين حصوله في بخارات البحر، غير عذب، فيقلبه عذباً، ويَسُحُّهُ السحابُ سَكْباً، فيوصل إلى كلِّ موضع قَدْراً يكون له مُراداً معلوماً، لا بالجهدِ مِنَ المخلوقين يُمْسَكُ عن المواضع الذي عليه ينزله، ولا بالحيلة يُسْتَنْزلُ على المكانِ الذي لا يُمْطِره\n هـ\n قلت: وهذا أحد الأقوال في حقيقة المطر، والمشهور عند أهل السنة: أن الله تعالى يُنْشِىءُ السحاب بقدرته، ويخلق فيه الماء بحكمته، وينزله حيث شاء\n ثم قال تعالى: { ويُنزِّل من السماء من جبالٍ فيها من بَرَدٍ } ، \" مِنْ \" الأولى: لابتداء الغاية، والثانية: بدل من الأولى، والثالثة: لبيان الجنس، أي: يُنَزِّل البَرَد، وهو الثلج المكور، من السماء، أي: الغمام العلوي، فكل ما علاك سماء، من جبال فيها كائنة من البَرَد، ولا غرابة في أن الله يخلق في السماء جِبَالَ بَرَدٍ كما خلق في الأرض جبال حجر\n قال ابن جزي: قيل: إن الجبال هنا حقيقة، وإن الله جعل في السماء جبالاً من بَرَد، وقيل: إنه مجاز، كقولك: عند فلان جبال من مال أو عِلم، أي: هن في الكثرة مثل الجبال\n هـ\n وأصله لابن عطية\n وقال الشيخ أبو زيد الثعالبي: حَمْلُ اللفظ على حقيقته أولى، إن لم يمنع من ذلك مانع\n هـ\n يعني: ولا مانع هنا، فيحمل على ظاهره، وإن الله خلق جبال بَرد في السماء\n وقال الهروي عن ابن عرفة - يعنى اللغوي -: سمعت أحمد بن يحيى يقول: فيه قولان: أحدهما: وينزل من السماء بَرَدَاً من جبال في السماء من برد والآخر: وينزل من السماء أمثال الجبال من البَرَد\n ويقال: إنما سمي برَدَاً لأنه يَبْرُدُ وجه الأرض أي: يُقشره\n هـ\n قال البيضاوي: إن الأبخرة إذا تصاعدت ولم يتخللها حرارة، فبلغت الطبقة الباردة من الهواء، وقوي البرد هناك، اجتمع وصار سحاباً، فإن لم يشتد البرد تقاطر مطراً، وإن اشتد، فإن وصل إلى الأجزاء البخارية قبل اجتماعها، نزل ثلجاً، وإلاّ نزل بَرَداً، وقد يبرد الهواء برداً مفرطاً فينقبض، وينعقد سحاباً، وينزل منه المطر أو الثلج\n وكل ذلك لا بد وأن يُسْنَدَ إلى إرادة الواجب الحكيم لقيام الدليل على أنها الموجبة لاختصاص الحوادث بمحالِّها وأوقاتها، وإليه أشار بقوله: { فيُصيبُ به من يشاء ويصْرِفُهُ عمن يشاء } والضمير للبرَد\n\n\nهـ\n أي: فيصيب بذلك البَرَد من يشاء أن يصيبه به، فيناله ما ناله من ضرره في بدنه وماله من زرع أو غيره\n { ويَصْرِفُه عمن يشاء } أن يصرفه عنه، فينجو من غائلته\n { يكاد سَنَا بَرْقِهِ } أي: ضوء برق السحاب، الموصوف بما مر من الإزجاء والتآلف\n وإضافة البرق إليه، قبل الإخبار بوجوده، فيه إيذان بظهور أمره واستغنائه عن التصريح به\n وقيل: الضمير للسماء، وهو أقرب، أي: يكاد ضوء برق السماء، ويحتمل أن يعود على \" الله \" تعالى لتقدم ذكره، أي: يكاد ضوء برقه تعالى { يذهب بالأبصار } ، أي: يخطفها من فرط الإضاءة، وسرعة ورودها، ولو عند إغماضها\n { يُقلِّبُ الله الليلَ والنهارَ } أي: يصرفهما بالتعاقب، فيأتي هذا بعد هذا، أو بنقصِ أحدهما وزيادة الآخر، أو بتغيير أحوالهما بالحر والبرد وغيرهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:48",
      "similarity": 0.4468630488137503
    },
    {
      "verse": "52:44",
      "similarity": 0.31696279262567345
    },
    {
      "verse": "17:66",
      "similarity": 0.2801706602085336
    },
    {
      "verse": "12:88",
      "similarity": 0.25289256280324557
    },
    {
      "verse": "8:37",
      "similarity": 0.24878278619458027
    }
  ]
}