{
  "chapter": "النور",
  "text": "الم تر ان الله يسبح له من فى السموت والارض والطير صفت كل قد علم صلاته وتسبيحه والله عليمۢ بما يفعلون",
  "translations": [
    {
      "translation": "Do you not see that everyone in the heavens and earth glorifies Allah, as do the birds with their outspread wings? Each one knows its prayer and glorification. Allah knows what they do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that all those who are in the heavens and the earth, and the birds on the wing, sing the praises of God. Each one knows its obligations and its duties, and God knows whatever they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not observe that all those who are in the heavens and the earth, and the birds with outspread wings, glorify Allah? Each one knows the mode of its prayer and glorification, and Allah has full knowledge of all they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered that all that is between the heavens and the earth glorifies God and that the birds spread their wings in the air to glorify God? He knows everyone's prayers and praising; God has absolute knowledge of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that all those who are in the heavens and the earth praise Allah, and the birds with their wings spread (also praise Him)? Each one has learnt its prayers and its words of praise; and Allah knows their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not that Allah, He it is Whom glorify whosoever is in the heavens and the earth, and the birds with wings outspread Of each one He knows indeed his Salah and his glorification; and Allah is All-Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah is He Whom do glorify all those who are in the heavens and the earth, and the (very) birds with expanded wings? He knows the prayer of each one and its glorification, and Allah is Cognizant of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how that whatsoever is in the heavens and in the earth extols God, and the birds spreading their wings? Each -- He knows its prayer and its extolling; and God knows the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen that Allah, He it is Whom all who are in the heavens and the earth praise, and the birds in their flight? Of each He knoweth verily the worship and the praise; and Allah is Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Prophet], do you not see that all those who are in the heavens and on earth praise God, as do the birds with wings outstretched? Each knows his own mode of prayer and glorification: God has full knowledge of all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not that Allah --those hallow Him whosoever is in the heavens and the earth and the birds with wings outspread? Surely each one knoweth his prayer and his hallowing; and Allah is the Knower of that which they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded that Allah is glorified by everyone in the heavens and the earth, and the birds spreading their wings. Each knows his prayer and glorification, and Allah knows best what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not that it is Allah Whose praises all beings in the heavens and on earth do celebrate, and the birds (of the air) with wings outspread? Each one knows its own (mode of) prayer and praise. And Allah knows well all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See you not (O Muhammad SAW) that Allah, He it is Whom glorify whosoever is in the heavens and the earth, and the birds with wings out-spread (in their flight). Of each one He (Allah) knows indeed his Salat (prayer) and his glorification, [or everyone knows his Salat (prayer) and his glorification], and Allah is All-Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how Allah is exalted by those in the heavens and earth, and the birds with outspread wings? He knows its prayers and its exaltations and Allah has knowledge of the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not realize that God is glorified by whatever is in the heavens and the earth, and even by the birds in formation? Each knows its prayer and its manner of praise. God knows well what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that Allah is exalted by whomever is within the heavens and the earth and [by] the birds with wings spread [in flight]? Each [of them] has known his [means of] prayer and exalting [Him], and Allah is Knowing of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:41] Have you not seen that God is glorified by all who are in the heavens and the earth, prayer being one form of glorification, and the birds (tayr is the plural of tā’ir), between the heaven and the earth, spreading their wings? (sāffātin is a circumstantial qualifier). Of each [one of them] He, God, verily knows its prayer and its glorification; and God knows what they do — the statement is predominantly directed to rational beings.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not seen) have you not been informed, Muhammad, in the Qur'an (that Allah, He it is Whom all who are in the heavens) of angels (and the earth) of believers (praise) pray to; (and the birds) they praise Him (in their flight) spreading their wings? (Of each) one of them (He knoweth verily the worship) who prays to Him (and the praise) who praises His hymn; it is also said that this means: He knows the prayer of the one who prays to Him and the praises of the one who praises Him; (and Allah is Aware of what they do) of good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } ولم تعلم أيها المعتبر الرائي { أَنَّ ٱللَّهَ } المتوحدَ برداء العظمة والكبرياء، المستقل بالوجود الحقيقي بكمال اللطف والجود { يُسَبِّحُ لَهُ } ويقدسه سبحانه عن جميع ما لا يليق بشأنه عن شوب النقص وسمات الحدوث والإمكان، جميعُ { مَن فِي ٱلسَّمَٰوَٰتِ } من المجبولين على المعرفة المتوجهين نحو المبدع طوعاً { وَ } جميع من في { ٱلأَرْضِ } أيضاً كذلك { وَ } كذا { ٱلطَّيْرُ صَآفَّاتٍ } باسطاتٍ أجنحتهن في الجو { كُلٌّ } أي: كل واحدٍ من المسبحين السماويين والأرضيين والهوائيين { قَدْ عَلِمَ } وأشعر { صَلاَتَهُ } وميله إلى ربه الذي أوجده وأظهره { وَتَسْبِيحَهُ } الذي سبَّح ونزه به مبدعاً عما لا يليق بجنابه { وَٱللَّهُ } المتجلي بأسمائه الحسنى وصفاته العليا { عَلِيمٌ } بعلمه الحضوري { بِمَا يَفْعَلُونَ } [النور: 41] أي: بحميع ما صدر عنهم من التوجه والتسبيح، وإخلاصهم فيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:165",
      "similarity": 0.6298125157678486
    },
    {
      "verse": "37:1",
      "similarity": 0.6292026172655044
    },
    {
      "verse": "89:22",
      "similarity": 0.6059960839481668
    },
    {
      "verse": "67:19",
      "similarity": 0.5052902415945562
    },
    {
      "verse": "78:38",
      "similarity": 0.4901854193980318
    }
  ]
}