{
  "chapter": "النور",
  "text": "يقلب الله اليل والنهار ان فى ذلك لعبرة لاو۟لى الابصر",
  "translations": [
    {
      "translation": "Allah revolves night and day. There is surely a lesson in that for people with inner sight.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who alternates night and day. There is surely a lesson in this for men of sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He alternates the day and the night: there is indeed a lesson in it for those who have observing eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God alternates the night and the day. In this there is a lesson for the people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah alternates the day and the night; indeed in this is a lesson for those who can perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah causes the night and the day to succeed each other. Truly, in this is indeed a lesson for those who have insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah turns over the night and the day; most surely there is a lesson in this for those who have sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God turns about the day and the night; surely in that is a lesson for those who have eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah causeth the revolution of the day and the night. Lo! herein is indeed a lesson for those who see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God alternates the night and the day -- truly, in this there is a lesson for men of insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah turneth the night and the day over and over; verily therein is a lesson for men of insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah alternates the night and the day. There is indeed a lesson in that for those who have insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who alternates the Night and the Day: verily in these things is an instructive example for those who have vision!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah causes the night and the day to succeed each other (i.e. if the day is gone, the night comes, and if the night is gone, the day comes, and so on). Truly, in these things is indeed a lesson for those who have insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah turns about the night and the day (to succeed one another); surely, in this there is a lesson for those who have eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God alternates the night and the day. In that is a lesson for those who have insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah alternates the night and the day. Indeed in that is a lesson for those who have vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:44] God alternates the night and the day, that is, He brings one in place of the other. Surely in that, alternation, there is a lesson, an indication, for those who see, those possessing insight, [an indication] of God’s power, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "392 (Allah causeth the revolution of the day and the night) He takes away the night and brings in its stead the day and takes away the day and brings in its stead the night; this is what is meant by their revolution. (Lo! Herein) in the alternation of day and night which I have mentioned (is indeed a lesson) a sign (for those who see) in relation to matters of religion; it is also said that this means: those who see with their eyes.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يخطف الأبصار حين { يُقَلِّبُ ٱللَّهُ } المحوِّل للأحوال فيه { ٱللَّيْلَ وَٱلنَّهَارَ } بغتةً بلا تراخٍ ومهلةٍ إظهاراً لكمال قدرته، واختباره واستقلاله بالتصرف في مظاهره ومصنوعاته { إِنَّ فِي ذٰلِكَ } التبديل والقلب وإحداث الضد من الضد بغتةً { لَعِبْرَةً لأُوْلِي ٱلأَبْصَارِ } [النور: 44] المنكشفين بوحدة الواجب وصفاته الذاتية التي هي منشأ جميع ما ظهر وبطن من الكوائن والفواسد بإرادته واختياره، المستدلين من آثار أوصافه وأسمائه بعلو شأنه وسمو برهانه، المتيقنين بوحدة ذاته وتنزهه عن وصمة الكثرة والشركة مطلقاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إن في ذلك } ، الإشارة إلى ما فصل آنفاً، أي: إن في إزجاء السحاب، وإنزال الودق، وتقليب الليل والنهار، { لعبرةً } لَدَلاَلَةً واضحة على وجود الصانع القديم، القائم بالأشياء، والمدبر لها بقدرته وحكمته، { لأُولي الأبصار } لذوي العقول الصافية\n وهذا من تعدد الدلائل على ظهور نوره تعالى في الكائنات، حيث ذكر تسبيح مَنْ في السموات والأرض ما يطير بينهما وخضوعهم له، وتسخير السحاب وإنزال الأمطار، وتقليب الليل والنهار، إلى غير ذلك من لوامح الأنوار\n والله تعالى أعلم وأحكم\n الإشارة: ألم تر أن الله يُزجي سحابَ الواردات الإلهية، تحمل العلوم اللدنية، ثم يُؤلف بينه حتى يكون قوياً، يُقتطع به صاحبه عن حسه، ويغيبه عن أمسه ورسمه، فترى أمطار العلوم اللدنية، والأسرار الربانية، والفتوحات العرفانية، تخرج من خلاله، أي: من قلب العارف، وهي نتائج الواردات وثمراتها\n وفي الحِكَم: \" لا تزكين وارداً لم تعلم ثمرته، فليس المراد من السحابة الأمطار، وإنما المراد منها وجود الأثمار \"\n وينزل من سماء الأرواح من جبالِ عقولٍ، فيها علم الرسوم الظاهرة، فيصيب به من يشاء، ممن أريد لحمل الشرائع والقيام بها، ويصرفه عمن يشاء، ممن أريد أن يكون من عامة الناس، أو من خاصتهم\n إن هبت عليه رياح الحقائق، فأمطرت على قلبه العلوم الغيبية فأغنته عن العلوم الرسمية، يكاد سنا برقه الساطع لقلوب أوليائه، وهو سطوع أنوار الملكوت وأسرار الجبروت، فإنها تكون أولاً كالبرق، تلمع وتخفي، ثم يتصل ورودها وشروقها، فتكون متصلة البروق دائمة الشروق، نهار بلا ليل، واتصال بلا انفصال، ووصال بلا انقطاع\n وفي ذلك يقول القائل:\n\nيقلب الله ليل القبض على نهار البسط، ونهار البسط على ليل القبض، حتى يتصل النهار بالخروج عنهما، ليكون لله، لاشيء دونه\n وبالله التوفيق\n ولمّا ذكر التجليات العلوية ذكر التجليات السفلية فقال: { وَٱللَّهُ خَلَقَ كُلَّ دَآبَّةٍ مِّن مَّآءٍ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:26",
      "similarity": 0.7673242440427724
    },
    {
      "verse": "23:21",
      "similarity": 0.5699121486900606
    },
    {
      "verse": "12:111",
      "similarity": 0.48237110585030835
    },
    {
      "verse": "3:13",
      "similarity": 0.46167270771290625
    },
    {
      "verse": "40:61",
      "similarity": 0.2986938264811834
    }
  ]
}