{
  "chapter": "النور",
  "text": "واذا دعوا۟ الى الله ورسوله ليحكم بينهم اذا فريق منهم معرضون",
  "translations": [
    {
      "translation": "When they are summoned to Allah and His Messenger, so that he can judge between them, a group of them immediately turn away.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are called to God and His Prophet, that he may judge between them, a section of them turns away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are called to Allah and His Messenger so that the Messenger may judge between them, a party of them turns away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are called to God and His Messenger so that they will judge among them, suddenly, some of them turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when called towards Allah and His Noble Messenger in order that the Noble Messenger may judge between them, thereupon a group among them turns away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are called to Allah and His Messenger, to judge between them, lo! a party of them refuses and turns away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are called to Allah and His Apostle that he may judge between them, lo! a party of them turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are called to God and His Messenger that he may judge between them, lo, a party of them are swerving aside;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they appeal unto Allah and His messenger to judge between them, lo! a faction of them are averse;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they are called to God and His Messenger so that he may judge between them, some of them turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are called to Allah and His apostle that he may judge between them, lo! a party of them are averters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are summoned to Allah and His Apostle that He may judge between them, behold, a part of them turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are summoned to Allah and His messenger, in order that He may judge between them, behold some of them decline (to come).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are called to Allah (i.e. His Words, the Quran) and His Messenger (SAW), to judge between them, lo! a party of them refuse (to come) and turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are called to Allah and His Messenger so that he judges between them, a party of them swerve away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are called to God and His Messenger, in order to judge between them, some of them refuse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are called to [the words of] Allah and His Messenger to judge between them, at once a party of them turns aside [in refusal].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:48] And when they are summoned to God and His Messenger, who conveys His words, that he may judge between them, behold, a party of them are averse, to come to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِذَا دُعُوا إِلَى اللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ إِذَا فَرِيقٌ مِنْهُمْ مُعْرِضُونَ (48) فالضمير في قوله : { وإذا دعوا } عائد إلى معاد ضمير { يقولون } . وإسناد فعل { دعوا } إلى جميعهم وإن كان المعرضون فريقاً منهم لا جميعهم للإشارة إلى أنهم سواء في التهيؤ إلى الإعراض ولكنهم لا يظهرونه إلا عندما تحل بهم النوازل فالمعرضون هم الذين حلت بهم الخصومات .وقد شملت الآية نفراً من المنافقين كانوا حلت بهم خصومات فأبوا حكم النبي صلى الله عليه وسلم قبل أن يحكم عليهم أو بعدما حكم عليهم فلم يُرضهم حكمه ، فروى المفسرون أن بشْراً أحد الأوس أو الخزرج تخاصم إلى النبي صلى الله عليه وسلم مع يهودي فلما حكم النبي لليهودي لم يرض بشر بحكمه ودعاه إلى الحكم عند كعب بن الأشرف اليهودي فأبى اليهودي وتساوقا إلى عمر بن الخطاب فقصّا عليه القضية فلما علم عمر أن بشْراً لم يرض بحكم النبي قال لهما : مكانكما حتى آتيكما .ودخل بيته فأخرج سيفه وضرب بشراً بالسيف فقتله . فروي أن النبي صلى الله عليه وسلم لقب عمر يومئذٍ الفاروق لأنه فرق بين الحق والباطل ، أي فرق بينهما بالمشاهدة . وقيل : إن أحد المنافقين اسمه المغيرة بن وائل من الأوس من بني أمية بن زيد الأوسي تخاصم مع علي بن أبي طالب في أرض اقتسماها ثم كره أمية القسم الذي أخذه فرام نقض القسمة وأبى علي نقضها ودعاه إلى الحكومة لدى النبي صلى الله عليه وسلم فقال المغيرة : أما محمد فلست آتية لأنه يُبغضني وأنا أخاف أن يحيف علي . فنزلت هذه الآية . وتقدم ذلك عند قوله تعالى : { ألم تر إلى الذين يزعمون أنهم آمنوا بما أنزل إليك } الآية في سورة النساء ( 60) .ومن سماجة الأخبار ما نقله الطبرسي الشيعي في تفسيره المسمى «مجمع البيان» عن البلخي أنه كانت بين علي وعثمان منازعة في أرض اشتراها من علي فخرجت فيها أحجار وأراد ردها بالعيب فلم يأخذها فقال : بيني وبينك رسول الله . فقال له الحكم بن أبي العاص إن حاكمته إلى ابن عمه يحكمْ له فلا تحاكمه إليه . فنزلت الآيات . وهذا لم يروه أحد من ثقات المفسرين ولا أشك في أنه مما اعتيد إلصاقه ببني أمية من تلقاء المشوهين لدولتهم تطلعا للفتنة ، والحكم بن أبي العاص أسلم يوم الفتح وسكن المدينة وهل يظن به أن يقول مثل هذه المقالة بين مسلميْن .وإنما جعل الدعاء إلى الله ورسوله كليهما مع أنهم دعوا إلى رسول الله صلى الله عليه وسلم لأن حكم الرسول حكم الله لأنه لا يحكم إلا عن وحي . ولهذا الاعتبار أفرد الضمير في قوله : { ليحكم } العائد إلى أقرب مذكور ولم يقل : ليحكما .\n\n",
      "translations": [
        {
          "translation": "(And when they appeal unto Allah) when they are called to the Book of Allah (and His messenger to judge between them) by Allah's Book, (lo! a faction of them are averse) from the Book of Allah and the judgement of the Messenger;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف كانوا مؤمنين أولئك المنافقون مع أنهمن { إِذَا دُعُوۤاْ إِلَى ٱللَّهِ } المصلح لأحوال عباده { وَرَسُولِهِ } المستخلفِ منه سبحانه النائبِ عنه بإذنه { لِيَحْكُمَ بَيْنَهُمْ } ويقطع نزاعهم { إِذَا فَرِيقٌ مِّنْهُمْ مُّعْرِضُونَ } [النور: 48] أي: فأجاءوا إلى الانصراف عن حكم الله وحكم رسوله بعدما دُعوا إلى رسوله إن كان الحكم عليهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا دُعُوا إلى الله ورسولِه } أي: إلى رسول الله صلى الله عليه وسلم لأن حُكمَه حكمُ الله\n { ليَحْكُمَ بينهم } أي: ليحكم الرسول بينهم لأنه المباشر للحُكم حقيقة\n وإن كان ذلك حكم الله في الحقيقة لأنه خليفته\n وذكر الله تعالى لتفخيم شأنه عليه\n والإيذان بجلالة قدره عنده\n فإذا دُعُوا إلى التحاكم بينهم { إذا فريقٌ منهم مُعْرِضون } أي: فاجأ فريق منهم الإعراض عن المحاكمة إليه صلى الله عليه وسلم لكون الحق عليهم\n وقد علموا أنه صلى الله عليه وسلم يحكم بالحق على من كان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:23",
      "similarity": 0.5897147782183015
    },
    {
      "verse": "44:4",
      "similarity": 0.522586483436394
    },
    {
      "verse": "77:4",
      "similarity": 0.4613869951669488
    },
    {
      "verse": "98:4",
      "similarity": 0.4228291940115393
    },
    {
      "verse": "38:68",
      "similarity": 0.4203840093392823
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024048.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024048.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:48.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}