{
  "chapter": "النور",
  "text": "لقد انزلنا ءايت مبينت والله يهدى من يشاء الى صرط مستقيم",
  "translations": [
    {
      "translation": "We have sent down Signs making things clear. Allah guides whoever He wills to a straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have surely sent down clear signs. It is God who guides whom He will to the path that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down Revelations that make the reality quite plain; however, Allah guides to the straight path whomsoever He pleases.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed illustrious revelations. God guides to the right path whomever He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed sent down clear verses; and Allah may guide whomever He wills to the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed sent down manifest Ayat. And Allah guides whom He wills to the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have revealed clear communications, and Allah guides whom He pleases to the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We have sent down signs making all clear; God guides whomsoever He will to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We have sent down revelations and explained them. Allah guideth whom He will unto a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down revelations clearly showing the truth. God guides whom He wills to the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly We have sent down revelations illuminating: and Allah guideth whomsoever He listeth unto a path straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have sent down illuminating signs, and Allah guides whomever He wishes to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed sent down signs that make things manifest: and Allah guides whom He wills to a way that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed sent down (in this Quran) manifest Ayat (proofs, evidences, verses, lessons, signs, revelations, lawful and unlawful things, and the set boundries of Islamic religion, etc. that make things clear showing the Right Path of Allah). And Allah guides whom He wills to a Straight Path (i.e. to Allah's religion of Islamic Monotheism).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down clarifying verses. Allah guides whom He will to a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent down enlightening revelations, and God guides whomever He wills to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have certainly sent down distinct verses. And Allah guides whom He wills to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:46] And verily We have revealed manifest signs, namely, the Qur’ān; and God guides whomever He will to a straight path, [a straight] route, and that is the religion of Islam.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily We have sent down revelations and explained them) He says: We sent Gabriel with revelations expositing the commands and prohibitions. (Allah guideth) to His religion (whom He will) and honours whoever deserves it (unto a straight path) an established religion with which He is pleased: i.e. Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سحبانه تحريكاً لحمية عباده، وتشديداً لبنيان اعتقاداتهم بالله وتوحيده وأسمائه وصفاته: { لَّقَدْ أَنزَلْنَآ } من مقام جودنا، ولطفنا إليكم إيها المحبوسون في مضيق الإمكان، المقيدون بسلاسل الكفران والعصيان { آيَاتٍ مُّبَيِّنَاتٍ } موضحاتٍ مفصلاتٍ لتوحيدنا وصفاتنا وقدرتنا على الإنعام والانتقام، لعلكم تتفطنون منها إلى علو شأننا وكمال سطوتنا وسلطاننا، مع أن أكثركم لا تتفطنون ولا تتنبهون؛ لانهماككم في بحر الغفلة والضلالة، { وَٱللَّهُ } الهادي لعباده { يَهْدِي } بفضله { مَن يَشَآءُ } هدايته منهم { إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } [النور: 46] موصلٍ إلى كعبة توحيده بلا عوج وانحراف\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:68",
      "similarity": 0.7884926784300709
    },
    {
      "verse": "37:118",
      "similarity": 0.7797590468861568
    },
    {
      "verse": "1:6",
      "similarity": 0.7759621238377502
    },
    {
      "verse": "36:4",
      "similarity": 0.7019844385200439
    },
    {
      "verse": "23:73",
      "similarity": 0.6902305607587884
    }
  ]
}