{
  "chapter": "النور",
  "text": "والله خلق كل دابة من ماء فمنهم من يمشى على بطنه ومنهم من يمشى على رجلين ومنهم من يمشى على اربع يخلق الله ما يشاء ان الله على كل شىء قدير",
  "translations": [
    {
      "translation": "Allah created every animal from water. Some of them go on their bellies, some of them on two legs, and some on four. Allah creates whatever He wills. Allah has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God created every moving thing from water: One crawls on its belly, one walks on two legs, another moves on four. God creates whatsoever He will. Indeed God has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah created every creature from a sort of water: of them some one crawls upon its belly: another walks on two legs and still another on four; Allah creates whatever He wills for He has power over everything\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has created every living being from water: Some of them creep on their bellies; some walk on two feet and some of them walk on four legs. God creates whatever He wants. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah created every animal on earth, from water; so among them is a kind that moves upon its belly; and among them is a kind that moves upon two legs; and among them a kind that moves upon four legs; Allah creates whatever He wills; indeed Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has created every moving creature from water. Of them there are some that creep on their bellies, and some that walk on two legs, and some that walk on four. Allah creates what He wills. Verily, Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has created from water every living creature: so of them is that which walks upon its belly, and of them is that which walks upon two feet, and of them is that which walks upon four; Allah creates what He pleases; surely Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has created every beast of water, and some of them go upon their bellies, and some of them go upon two feet, and some of them go upon four; God creates whatever He will; God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath created every animal of water. Of them is (a kind) that goeth upon its belly and (a kind) that goeth upon two legs and (a kind) that goeth upon four. Allah createth what He will. Lo! Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God created every creature from water. Some crawl upon their bellies, others walk on two legs, and others walk on four. God creates what He pleases. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath created every moving creature of water; of them is one that walketh upon his belly. and of them is one that walketh upon its two feet; and of them is one that walketh upon four. Allah createth whatsoever He listeth; verily Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah created every animal from water. Among them are some that creep upon their bellies, and among them are some that walk on two feet, and among them are some that walk on four. Allah creates whatever He wishes. Indeed Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has created every animal from water: of them there are some that creep on their bellies; some that walk on two legs; and some that walk on four. Allah creates what He wills for verily Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has created every moving (living) creature from water. Of them there are some that creep on their bellies, some that walk on two legs, and some that walk on four. Allah creates what He wills. Verily! Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah created everything that walks from water. Some creep upon their bellies, others walk on two feet, and others walk on four. Allah creates whatever He will. Allah is Powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God created every living creature from water. Some of them crawl on their bellies, and some walk on two feet, and others walk on four. God creates whatever He wills. God is Capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has created every [living] creature from water. And of them are those that move on their bellies, and of them are those that walk on two legs, and of them are those that walk on four. Allah creates what He wills. Indeed, Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:45] And God has created every beast, that is, [every] animal, from fluid, [from] a sperm-drop. Among them are some that creep upon their bellies, such as snakes and reptiles, and among them are some that walk on two feet, such as human beings and birds, and among them are some that walk on four, such as [four-legged] beasts and cattle. God creates whatever He will. Truly God has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath created every animal) on the face of the earth (of water) from the water of the male and female. (Of them is (a kind) that goeth upon its belly) like the snake and similar animals (and (a kind) that goeth upon two legs) like human beings and those that are similar to them (and (a kind) that goeth upon four) beasts. (Allah createth what He will) as He wills. (Lo! Allah is Able to do all things) whether this concerns creation or other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والله خلق كل دابة } من أصناف دواب الدواعي التي تدبّ في أراضي النفوس وتبعثها إلى الأفعال { من ماء } مخصوص\n أي: علم مناسب لتلك الداعية المتولدة منه\n فإن منشأ كل داعية إدراك مخصوص\n { فمنهم من يمشي على بطنه } ويزحف في الطبيعة\n ويحدث الأعمال البدنية الطبيعية { ومنهم من يمشي على رجلين } من الدواعي الإنسانية فيحدث الأعمال الإنسانية والكمالات العملية { ومنهم من يمشي على أربع } من الدواعي الحيوانية فيبعث على الأعمال السبعية والبهيمية { يخلق الله ما يشاء } من هذه الدواعي من منشأ قدرته الباهرة\n الكاملة في إنشاء الأعمال ويهدي من يشاء بالآيات السابقة المذكورة من الحكم والمعاني والمعارف والحقائق من منشأ حكمته البالغة التامة في إظهار العلوم والأحوال إلى صراط التوحيد الموصوف بالاستقامة إليه { ويقولون آمنا بالله وبالرسول } أي: يدّعون التوحيد جمعاً وتفصيلاً والعمل بمقتضاه { ثم يتولى فريق منهم } بترك العمل بمقتضى الجمع والتفصيل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱللَّهُ } المتوحد بذاته المعتزز بكمال أسمائه وصفاته { خَلَقَ } أي: أظهر وقدَّر { كُلَّ دَآبَّةٍ } تتحرك على الأرض { مِّن مَّآءٍ } وهو العنصر الأصلي لوجود الحيوانات\n هو مبدأ حركاتهم ومنشأ إحساساتهم وإدراكاتهم\n لذلك خُصََّ بالذكر بين العناصر وإن كانت مركبةً من جميعها { فَمِنْهُمْ } أي: من الدواب\n ذكرَ الضمير وجمعها جمع العقلاء على سبيل التغليب\n لأن العقلاء منها { مَّن يَمْشِي } ويزحف { عَلَىٰ بَطْنِهِ } بلا آلةِ المشي كالحية { وَمِنهُمْ مَّن يَمْشِي عَلَىٰ رِجْلَيْنِ } كالطير والإنسان { وَمِنْهُمْ مَّن يَمْشِي عَلَىٰ أَرْبَعٍ } كالمنعم والوحش\n\n\nوبالجملة: { يَخْلُقُ ٱللَّهُ } المقتدر على الخلق والإيجاد { مَا يَشَآءُ } من الموجودات والخلوقات إرادةً واختياراً { إِنَّ ٱللَّهَ } المتصفَ بصفات الكمال { عَلَىٰ كُلِّ شَيْءٍ } داخلٍ في حيطة علمه { قَدِيرٌ } [النور: 45] بإيجاده وإظهاره في فضاء العيان بلا قتور وقصورٍ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { والله خلقَ كلَّ دابةٍ } أي: خلق كل حيوان يدب على وجه الأرض { من ماء } من نوع من الماء مختص بتلك الدابة، وهو جزء مادته عند الأطباء، أو: من ماء مخصوص، وهو النطفة، ثم خالف بين المخلوقات من تلك النطفة، فمنها أناسي، ومنها بهائم، ومنها هوام وسباع، وهو كقوله:\n[الرعد: 4] وهذا دليل على أن لها خالقاً مدبراً، وإلاَّ لم تختلف لاتفاق الأصل، وإنما عَرَّفَ الماء في قوله:\n[الأنبياء:30] ونكّره هنا لأن المقصود ثمَّة أن أجناس الحيوان مخلوقة من جنس الماء، وأنه هو الأصل، وإن تخللت بينه وبينها وسائط، وأما هنا فالمراد نوع منه. قالوا: إن أول ما خلق الله الماء، فخلق منه النار والريح والطين، فخلق من النار الجن، ومن الريح الملائكة، ومن الطين آدم ودواب الأرض. قاله النسفي. وعلى الثاني: تكون الآية أغلبية لأن مِن الحيواناتِ من يتولد من غير نطفة، كالدود والبَعُوضِ وغيرهما. ثم فصّل أحوالهم بقوله: { فمنهم من يمشي على بطنه } كالحية والحوت، وتسمية حركتها مشياً، مع كونها زحفاً، استعارة، كما يقال في الشيء المستمر: قد مشى هذا الأمر على هذا النمط، او على طريق المشاكلة لذكر الزاحف مع الماشين. { ومنهم من يمشي على رِجْلين } كالإنسان والطير، { ومنهم من يمشي على أربع } كالبهائم والوحش. وعدم التعرض لما يمشي على أكثر من أربع كالعناكب ونحوها من الحشرات لعدم الاعتداد بها، لقلتها. وتذكير الضمير في منهم لتغليب العقلاء، وكذلك التعبير بكلمة مَن. وقدَّم ما هو أغرق في القدرة، وهو الماشي بغير آلة، ثم الماشي على رجلين، ثم الماشي على أربع. { يَخْلُقُ الله ما يشاء } مما ذكر ومما لم يذكر، بَسيطاً أو مركباً، على ما يشاء من الصور والأعضاء والهيئات والطبائع والقوى والأفاعيل، مع اتحاد العنصر { إنَّ الله على كل شيء قدير } فيفعل ما يشاء كما يشاء. وإظهار الاسم الجليل في الموضعين في موضع الإضمار لتفخيم شأن الخلق المذكور، والإيذان بأنه من أحكام الألوهية. والله تعالى أعلم. الإشارة: أظهر الحق تعالى الأشياء من الماء، وأظهر الماء من نور القبضة، وأظهر القبضة من بحر سر الذات. أو تقول: أظهر الماء من نور الملكوت، وأبرز نور الملكوت من بحر الجبروت، وبحر الجبروت هو بحر أسرار الذات الأزلية، فالكل منه وإليه، ولا شيء معه، فتنوعت أنوار التجليات، وتعددت أسماؤها بتعدد فروعها، والمتجلي واحد، كما قال صاحب العينية:\nولا يفهم هذا إلا من هداه الله لمعرفته، كما قال: { لَّقَدْ أَنزَلْنَآ آيَاتٍ مُّبَيِّنَاتٍ وَٱللَّهُ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:49",
      "similarity": 0.34176132410929644
    },
    {
      "verse": "8:55",
      "similarity": 0.32848561391019254
    },
    {
      "verse": "42:29",
      "similarity": 0.3238618967351167
    },
    {
      "verse": "24:13",
      "similarity": 0.2902077519695347
    },
    {
      "verse": "57:3",
      "similarity": 0.27950768846156915
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/24:45.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/24:45.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}