{
  "chapter": "النور",
  "text": "او كظلمت فى بحر لجى يغشىه موج من فوقه موج من فوقه سحاب ظلمتۢ بعضها فوق بعض اذا اخرج يده لم يكد يرىها ومن لم يجعل الله له نورا فما له من نور",
  "translations": [
    {
      "translation": "Or they are like the darkness of a fathomless sea which is covered by waves above which are waves above which are clouds, layers of darkness, one upon the other. If he puts out his hand, he can scarcely see it. Those Allah gives no light to, they have no light.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like darkness in a wide, wide sea, waves surging upon waves, with clouds overhanging, darkness on darkness. If you stretch your hand, you could hardly see it. For him whom God does not give any light, there is no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (their efforts may be likened to those of a man trying to swim in) a deep dark ocean, covered with billows, one over the other, and above it a cloud: darkness upon darkness: so much so that if he stretches out his hand, he cannot see it. There is no light for the one whom Allah does not give light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or it (the deeds of the unbelievers) are like the darkness of a deep, stormy sea with layers of giant waves, covered by dark clouds. It is darkness upon darkness whereby even if one stretches out his hands he can not see them. One can have no light unless God gives him light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like realms of darkness on a deep sea, which is covered by a wave, the wave covered by another wave, and above it is a cloud; layers of darkness upon darkness; if he removes his hand it does not seem visible; and the one to whom Allah does not provide light – there is no light for him anywhere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like the darkness in a vast deep sea, overwhelmed with waves topped by waves, topped by dark clouds, (layers of) darkness upon darkness: if a man stretches out his hand, he can hardly see it! And he for whom Allah has not appointed light, for him there is no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like utter darkness in the deep sea: there covers it a wave above which is another wave, above which is a cloud, (layers of) utter darkness one above another; when he holds out his hand, he is almost unable to see it; and to whomsoever Allah does not give light, he has no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or they are as shadows upon a sea obscure covered by a billow above which is a billow above which are clouds, shadows piled one upon another; when he puts forth his hand, wellnigh he cannot see it. And to whomsoever God assigns no light, no light has he.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or as darkness on a vast, abysmal sea. There covereth him a wave, above which is a wave, above which is a cloud. Layer upon layer of darkness. When he holdeth out his hand he scarce can see it. And he for whom Allah hath not appointed light, for him there is no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like darkness on a deep ocean covered by waves billowing over waves and overcast with clouds: darkness upon darkness. If he stretches out his hand, he can scarcely see it. Indeed, the man from whom God withholds His light shall find no light at all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, like the darknesses in a sea deep; there covereth it a wave from above it, a wave from above it, above which is a cloud: darknesses one above anot her: when he putteth out his hand well-nigh he seeth it not. And upto whomsoever Allah shall not appoint a light, his shall be no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like the manifold darkness in a deep sea, covered by billow upon billow, overcast by clouds; manifold [layers of] darkness, one on top of another: when he brings out his hand, he can hardly see it. One whom Allah has not granted any light has no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (the Unbelievers' state) is like the depths of darkness in a vast deep ocean, overwhelmed with billow topped by billow, topped by (dark) clouds: depths of darkness, one above another: if a man stretches out his hands, he can hardly see it! for any to whom Allah giveth not light, there is no light!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or [the state of a disbeliever] is like the darkness in a vast deep sea, overwhelmed with a great wave topped by a great wave, topped by dark clouds, darkness, one above another, if a man stretches out his hand, he can hardly see it! And he for whom Allah has not appointed light, for him there is no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, they are like darkness upon a deep sea covered with a wave above which is another wave, above which are clouds, darkness piled one upon the other; when he stretches out his hand he can scarcely see it. Indeed, to whomsoever Allah assigns no light, he shall have no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like utter darkness in a vast ocean, covered by waves, above which are waves, above which is fog. Darkness upon darkness. If he brings out his hand, he will hardly see it. He to whom God has not granted a light has no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or [they are] like darknesses within an unfathomable sea which is covered by waves, upon which are waves, over which are clouds - darknesses, some of them upon others. When one puts out his hand [therein], he can hardly see it. And he to whom Allah has not granted light - for him there is no light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:40] Or, [it is that] those who disbelieve, their evil deeds are, as the manifold darkness on a deep sea, covered by a billow, above which, that is, [above which] billow, there is [another] billow, above which, second billow, there are clouds, these being the, manifold [layers of] darkness, one on top of another, the darkness of the sea, the darkness of the first billow, the darkness of the second together with the darkness of the clouds. When he, an observer, holds out his hand, in such layers of darkness, he can scarcely see it, in other words, he would not [even] come close to seeing it. And he whom God has not granted any light has no light, that is to say, he whom God does not guide cannot be guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or as darkness on a vast, abysmal sea) He says: the similitude of denial in the heart of the disbeliever is like darkness in the depth of a very deep sea. (There covereth him a wave, above which is a wave) another wave, (above which is a cloud) likewise, the heart of the disbeliever, like the denial in his heart, is similar to the darkness of the bottom of the sea; and his heart is like a deep sea; and his chest is like a huge wave, and his works are like a useless cloud, because Allah sealed the disbelievers hearts and hearings and sights. (Layer upon layer of darkness. When he holdeth out his hand he scarce can see it) from intense darkness; likewise, the disbeliever does not see the Truth and guidance because of the intense darkness of his heart. (And he for whom Allah hath not appointed light) knowledge in this worldly life, (for him there is no light) he has no knowledge in the Hereafter; it is also said that this means: the one whom Allah has not honoured with faith in the life of this world, Allah will not honour with faith in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَحْرٍ لُّجِّيٍّ } مضافٌ إلى اللُّجةِ\n وهوَ مُعظمِ البَحرِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"a lujjīyyin sea,\" is added to [the sea's] lujjah.\n\n\nAnd he is the vastness of the ocean.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { أو كظلمات } في بحر الهيولى اللجيّ العميق الغامر لجثة كل نفس جاهلة\n محجوبة بهيئات بدنية\n الغامس لكل ما يتعلق به من القوى النفسانية { يغشاه موج } الطبيعة الجسمانية { من فوقه } موج النفس النباتية { من فوقه } سحاب النفس الحيوانية وهيئاتها الظلمانية { ظلمات } متراكمة { بعضها فوق بعض إذا أخرج } المحجوب بها\n المنغمسن المحبوس فيها { يده } القوة العاقلة النظرية بالفكر { لم يكد يراها } لظلمتها وعمى بصيرة صاحبها وعدم اهتدائه إلى شيء\n وكيف يرى الأعمى الشيء الأسود في الليل البهيم؟\n { ومن لم يجعل الله له نوراً } بإشراق أنوار الروح عليه من التأييد القدسيّ والمدد العقلي { فما له من نور } \n { ألم تر أنّ الله يسبح له من في } عالم سماوات الأرواح بالتقديس وإظهار صفاته الجمالية { ومن في } عالم أراضي الأجساد بالتحميد والتعظيم وإظهار صفاته الجلالية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهو معظم الماء { يَغْشَاهُ } أي: يغطي البحر ويعلو عليه { مَوْجٌ } هائلُ { مِّن فَوْقِهِ } أي: فوق الموج الأول { مَوْجٌ } آخرُ أهولُ منه هكذا\n أي: أمواجُ متراكمةُ مترادفةُ بعضها فوق بعض على التوالي والتتالي مع أنه { مِّن فَوْقِهِ } أي: فوق الموج المظلم { سَحَابٌ } كثيفُ أظلمُ منه\n\nوبالجملة: تلك الأمواج والسحب { ظُلُمَاتٌ } متراكمة مترادفة { بَعْضُهَا فَوْقَ بَعْضٍ } بحيث { إِذَآ أَخْرَجَ } من قوع فيها { يَدَهُ } حذاء بصره اختباراً لنظره { لَمْ يَكَدْ يَرَاهَا } أي: لم يقرب أن يراها بالقوة فكيف بالفعل؟! هكذا أعمال الكفرة المتوغلين في بحر الغفلة والضلال\n والمغشّاة بالأمواج المتراكمة من الظلم والطغيان والغيّ والعدوان\n من فوقه السحب الكثيفة والحجب الغليظة من الجهل بالله\n والتعامي عن مطالعة آياته الدالة على توحيده واتصافه بالأوصاف الذاتية\n وملاحظة آثاره البديعة وصنائعه العجيبة الغريبة\n\n\nوهم من غاية انهماكهم في ظلمات غفلاتهم وجهالاتهم\n وكمال غيّهم وضلالهم: إذا أمعنوا نظرهم إلى مشاهدة ما في نفوسهم من غرائب صنع الله لم يقربوا أن يكونوا مترصدين للوقوف عليها\n فكيف الشهود والاطلاع بها؟! { وَ } بالجملة: { مَن لَّمْ يَجْعَلِ ٱللَّهُ } الهادي لعباده إلى زلال توحيده { لَهُ نُوراً } من جذبةٍ وتوفيقٍ يهدي به التائهين إلى مقصد توحيده { فَمَا لَهُ } من نفسه وبمجرد كسبه وسعيه { مِن نُورٍ } [النور: 40] يرشده إليه سبحانه\n ويوصله إلى فضاء توحيده\n\n\nهب لنا منك نوراً نهتدي به إلى ما جُبلنا لأجله بفضلك وجودنا يا ذا الطول العظيم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { أوْ كظلماتٍ } \n \" أو \": للتنويع\n { في بحرٍ لجيِّ } عميق كثير الماء\n منسوب إلى اللج\n وهو معظم ماء البحر\n { يغشاه } أي: يغشى البحر\n أو مَن فيه\n أي: يعلوه ويغطيه بالكلية\n { موجٌ } هو ما ارتفع من الماء\n { من فوقه موجٌ } أي: من فوق الموج موج آخر\n { من فوقه سَحَابٌ } من فوق الموج الأعلى سحاب\n { ظلماتٌ } أي: هذه ظلمات ظلمة السحاب\n وظلمة الأمواج وظلمة البحر\n { بعضُها فوق بعض } ظلمة الموج على ظلمة البحر\n وظلمة الموج على ظلمة الموج الأسفل\n وظلمة السحاب على الموج\n وهذا أعظمُ للخوف وأقربُ للعطب\n لأنه يغطي النجوم التي يهتدي بها ويشتد معه الريح والمطر\n وذلك يؤكد التلف\n { إذا أخرج يده } أي: الواقع فيه\n أو مَن ابْتُلِيَ بها\n { لم يكد يراها } مبالغة في \" لم يرها \" \n أي: لم يقرب أن يراها\n فضلاً عن أن يراها\n\nشبّه أعمالهم\n في ظلمتها وسوادها لكونها باطلة\n وخلوها عن نور الحق\n بظلماتٍ متراكمة من لج البحر والأمواج والسحاب\n قال ابن جُزَيّ: لما ذكر حال المؤمنين عَقَّبَ ذلك بمثالين لأعمال الكفار الأول: يقتضي حال أعمالهم في الآخرة\n وأنها لا تنفعهم\n بل يضمحل ثوابها كما يضمحل السراب\n والثاني: يقتضي حال أعمالهم في الدنيا\n وأنها في غاية الفساد والضلال\n كالظلمة التي بعضها فوق بعض\n ثم قال: وفي وصف هذه الظلمات مبالغة\n كما أن في وصف النور المذكور قبلها مبالغة\n هـ\n وقوله: لما ذكر حال المؤمنين\n يعني بقوله: { رجال لا تلهيهم\n\n } إلخ\n الله بقوله: { يهدي الله لنوره من يشاء } \n وقيل: كلا المثالين في الآخرة\n يخيبون من نفعها\n ويخوضون في بحر ظلمتها\n { ومن لم يجعل الله له نوراً } في قلبه\n من نور توحيده ومعرفته\n { فما له من نورٍ } أي: من لم يشأ الله أن يهديه لنوره: لم يهتد\n وفي الحديث:\n \" خلق الله الخلق في ظلمة\n ثم رش عليها من نوره\n فمن أصابه ذلك النور اهتدى\n ومن أخطأه ضل \" \n\n وينبغي للقارئ عند هذه الآية أن يقول: اللهمَّ اجعلْ في قلبي نوراً\n وفي سمعي نوراً\n وفي بصري نوراً\n وعن يميني نوراً\n وعن شمالي نوراً\n ومن فوقي نوراً\n ومن تحتي نوراً\n واجعلني نوراً\n وأعظم لي نوراً\n كما في الحديث في غير هذا المحل\n الإشارة: كل من لم يتحقق بمقام الإخلاص كانت أعماله كسرابٍ بقيعة\n يحسبه الظمآنُ ماء\n حتى إذا جاءه لم يجده شيئاً\n ووجد الله عنده\n فوفاه حسابه\n أي: يناقشه فيما أراد بعمله\n وأهل التوحيد الخاص: الوجود كله\n عندهم\n كالسراب\n يحسبه الناظر إليه شيئاً\n حتى إذا جاءه بفكرته لم يجده شيئاً\n ووجد الله عنده وحده\n وفيه يقول الشاعر:\nومثال من عكف على دنياه\n واتخذ إلهه هواه\n كذي ظلمات في بحر لجي\n وهو بحر الهوى\n يغشاه موج الجهل والمخالفات\n من فوقه موج الحظوظ والشهوات\n من فوقه سحاب أثر الكائنات\n أو: يغشاه موج الغفلات\n من فوقه موج العادات\n من فوقه سحاب الكائنات\n ظلمات بعضها فوق بعض من حب الدنيا\n وحب الجاه\n وحب الرئاسة\n إذا أخرج يد فكرته لم يكد يراها\n وقال بعضهم: الدنيا كلها بحر لُجَي\n والناس مغروقون فيه\n إلا مَنْ عَصَمَ الله\n وساحله الموت\n فمن لعبت به أمواج الهوى والحظوظ\n فليأوي إلى سفينة الزهد والورع\n وليتمسك برئيس عارف بأهوال البحر\n وهم العارفون بالله\n فإنه ينجو من أهوالها\n ومن أخطأ هذا غرق في تيارها\n ولعبت به أمواج حظوظها وشهواتها\n فكان من الهالكين\n نسأل الله الحفظ بمنِّه وكرمه\n ثم ذكر علامات وجود ذلك النور المتقدم في أهل السماوات والأرض فقال: { أَلَمْ تَرَ أَنَّ ٱللَّهَ يُسَبِّحُ لَهُ مَن فِي\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:75",
      "similarity": 0.42362491046406947
    },
    {
      "verse": "67:21",
      "similarity": 0.421140230377966
    },
    {
      "verse": "18:99",
      "similarity": 0.3480183477447959
    },
    {
      "verse": "11:42",
      "similarity": 0.30056408792372963
    },
    {
      "verse": "11:43",
      "similarity": 0.2982023060940811
    }
  ]
}