{
  "chapter": "النور",
  "text": "يايها الذين ءامنوا۟ ليستـذنكم الذين ملكت ايمنكم والذين لم يبلغوا۟ الحلم منكم ثلث مرت من قبل صلوة الفجر وحين تضعون ثيابكم من الظهيرة ومنۢ بعد صلوة العشاء ثلث عورت لكم ليس عليكم ولا عليهم جناحۢ بعدهن طوفون عليكم بعضكم على بعض كذلك يبين الله لكم الءايت والله عليم حكيم",
  "translations": [
    {
      "translation": "You who have iman! those you own as slaves and those of you who have not yet reached puberty should ask your permission to enter at three times: before the Dawn Prayer, when you have undressed at noon, and after the Salat al-'lsha' - three times of nakedness for you. There is nothing wrong for you or them at other times in moving around among yourselves from one to another. In this way Allah makes the Signs clear to you. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, let your dependants and those who have not yet reached the age of puberty, ask permission (to enter your presence) on three occasions: Before the early morning prayer; when you disrobe for the mid-day siesta; and after prayer at night. These are the three occasions of dishabille for you. There is no harm if you or they visit one another at other times (without permission). God thus explains things to you clearly, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, your slaves and those of your children, who have not yet become sex conscious, must ask your permission before coming in to see you on three occasions: before the Fajr Prayer and at noon when you put off your clothes and after the `Isha' Prayer. These are your three times of privacy. There is no sin for you or for them if they come without permission at other times than these, for you have to visit: ne another over and over again. In this way Allah makes His Comm andments clear to you for He is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, your slaves and the immature people must ask your permission three times a day before entering your house: before the morning prayer, at noon time and after the late evening prayer; these are most private times. After your permission has been granted, there is no harm if they come into your presence from time to time. This is how God explains His revelations to you. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! The slaves you possess and those among you who have not attained adulthood, must seek your permission on three occasions; before the dawn prayer, and when you remove your garments in the afternoon, and after the night prayer; these three times are of privacy for you; other than these three times, it is no sin for you or for them; moving about around you and among each other; and this is how Allah explains the verses for you; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Let your slaves and slave-girls, and those among you who have not come to the age of puberty ask your permission on three occasions: before the Fajr prayer, and while you put off your clothes during the afternoon, and after the `Isha' prayer. (These) three (times) are of privacy for you; other than these times there is no sin on you or on them to move about, attending to each other. Thus Allah makes clear the Ayat to you. And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! let those whom your right hands possess and those of you who have not attained to puberty ask permission of you three times; before the morning prayer, and when you put off your clothes at midday in summer, and after the prayer of the nightfall; these are three times of privacy for you; neither is it a sin for you nor for them besides these, some of you must go round about (waiting) upon others; thus does Allah make clear to you the communications, and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, let those your right hands own and those of you who have not reached puberty ask leave of you three times -- before the prayer of dawn, and when you put off your garments at the noon, and after the evening prayer -- three times of nakedness for you. There is no fault in you or them, apart from these, that you go about one to the other. So God makes clear to you the signs; and God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Let your slaves, and those of you who have not come to puberty, ask leave of you at three times (before they come into your presence): Before the prayer of dawn, and when ye lay aside your raiment for the heat of noon, and after the prayer of night. Three times of privacy for you. It is no sin for them or for you at other times, when some of you go round attendant upon others (if they come into your presence without leave). Thus Allah maketh clear the revelations for you. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, let [even] those whom you rightfully possess, and those who are under age ask your leave on three occasions when they come in to see you: before the morning prayer, when you have taken off your garments in the heat of noon, and after the evening prayer. These are the three occasions for your privacy. At other times, there is nothing blameworthy if you or they go around visiting one another. Thus God makes clear to you His revelations: God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! let those whom your right hands own and those of you who have not attained puberty ask leave of you three times before the dawn prayer, and when ye lay aside your garments noonday, and after the night-prayer: three at times of privacy for you. NO fault there is upon you or upon them beyond these times going round upon you, some of you upon some others. In this wise Allah expoundeth unto you the commandments; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Your slaves and any of you who have not yet reached puberty should seek your permission three times: before the dawn prayer, and when you put off your garments at noon, and after the night prayer. These are three times of privacy for you. Apart from these, it is not sinful of you or them to frequent one another [freely]. Thus does Allah clarify the signs for you, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! let those whom your right hands possess, and the (children) among you who have not come of age ask your permission (before they come to your presence), on three occasions: before morning prayer; the while ye doff your clothes for the noonday heat; and after the late-night prayer: these are your three times of undress: outside those times it is not wrong for you or for them to move about attending to each other: Thus does Allah make clear the Signs to you: for Allah is full of knowledge and wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Let your legal slaves and slave-girls, and those among you who have not come to the age of puberty ask your permission (before they come to your presence) on three occasions; before Fajr (morning) prayer, and while you put off your clothes for the noonday (rest), and after the 'Isha' (late-night) prayer. (These) three times are of privacy for you, other than these times there is no sin on you or on them to move about, attending (helping) you each other. Thus Allah makes clear the Ayat (the Verses of this Quran, showing proofs for the legal aspects of permission for visits, etc.) to you. And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, let those your right hand owns and those who have not come of age ask permission of you three times before the dawn prayer, when you put aside your garments, in the heat of noon, and after the night prayer. These are the three occasions of privacy. There is no fault in you or them, apart from these, that they go about you, you are of each other. As such Allah makes plain to you His verses, Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Permission must be requested by your servants and those of you who have not reached puberty. On three occasions: before the Dawn Prayer, and at noon when you change your clothes, and after the Evening Prayer. These are three occasions of privacy for you. At other times, it is not wrong for you or them to intermingle with one another. God thus clarifies the revelations for you. God is Knowledgeable and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, let those whom your right hands possess and those who have not [yet] reached puberty among you ask permission of you [before entering] at three times: before the dawn prayer and when you put aside your clothing [for rest] at noon and after the night prayer. [These are] three times of privacy for you. There is no blame upon you nor upon them beyond these [periods], for they continually circulate among you - some of you, among others. Thus does Allah make clear to you the verses; and Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:58] O you who believe, let those whom your right hands own, of male slaves and female slaves, and those of you who have not reached puberty, from among the free men, and who have not become [sexually] aware of women, ask leave of you three times: at three times [of the day]: before the dawn prayer, and when you put off your garments at noon, and after the night prayer. [These are] three periods of privacy for you (read thalāthu [‘awrātin lakum] with nominative inflection as the predicate of an implied subject followed by a genitive annexation, with the annexed term standing in place thereof [of the predicate], in other words [the implied predicate followed by the annexation is] hiya awqāt, ‘these are times of …’; or read thalātha [‘awrātin lakum] in the accusative, the implication being that awqāta is itself in the accusative as a substitute for the [syntactical] status of what precedes it, in place of which stands the annexed term). It is because clothes are taken off that private parts are revealed during such [periods]. Neither you nor they, namely, slaves and young boys, would be at fault, in entering upon you without asking leave, at other times, that is, after the three times of day [specified]; they frequent you, to provide service, [as] some of you [do] with others (this sentence corroborates the preceding one). So, just as He has clarified what has been mentioned, God clarifies for you the signs, the rulings; and God is Knower, of the affairs of His creatures, Wise, in what He has ordained for them. It is said that the ‘permission’ verse (āyat al-isti’idhān) was abrogated; but it is also said that it was not [abrogated], but that people thought little of neglecting to seek permission [in such situations].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then the following was revealed when 'Umar said: \"I wish that Allah forbids our children and servants from entering in on us except with permission at three times when we are likely to be exposed\": (0 ye who believe) in Muhammad (pbuh) and in the Qur'an! (Let your slaves) young slaves, (and those of you who have not come to puberty) among those who are not slaves, (ask leave of you) to enter in on you (at three times: Before the prayer of dawn) from the time of dawn until the beginning of Fajr prayer, (and when ye lay aside your raiment for the heat of noon) for the time of the siesta until the prayer of Zuhr, (and after the 394 prayer of night) and after the 'Isha' prayer to the break of dawn. (Three times of privacy for you). Then Allah gave them dispensation to enter without permission, saying: (It is no sin for them) for the children or young slaves, excepting from this older slaves, (or for you) for the masters of the house (at other times) other than those three times of privacy, (when some of you go round) to serve (attendant upon others) you and them can enter in on each other without permission. As for older children and older slaves they have to ask permission at all times before entering in on their parents or masters. (Thus Allah maketh clear the revelations for you) He explains the commands and prohibitions just as He explained this. (Allah is Knower) He knows what is good for you, (Wise) He decreed that young children and slaves ask permission in those three times of privacy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ليقبلوا إلى امتثال ما نودوا فقال: { يٰأَيُّهَا ٱلَّذِينَ ءَامَنُواْ } من آداب المصاحبة والإخاء هذا { لِيَسْتَأْذِنكُمُ } بالدخول على بيوتكم\n ويسترخص منكم أيها المؤمنون خدمتكم { ٱلَّذِينَ مَلَكَتْ أَيْمَـٰنُكُمْ } سواءً كانوا عبيداً أو إماءً\n وأنتم رجالُ أو نساءُ\n ذكرَ الضمير على سبيل التغليب { وَ } كذا الصبيان { ٱلَّذِينَ لَمْ يَبْلُغُواْ ٱلْحُلُمَ مِنكُمْ } أي: لم يبلغوا وقت الحلم\n خُصَّ بالذكر\n لكونه أقوى أسباب البلوغ إلى وقت التكليف { ثَلاَثَ مَرَّاتٍ } يعني: ليستأذنكم الخَدَمةُ والصبيانُ في ثلاثة أوقات دخولهم:\n\nأحدها: { مِّن قَبْلِ صَـلَٰوةِ ٱلْفَجْرِ } إذ هو وقت الانخلاع\n والتجرد عن ثياب النوم\n والدخول فيه منهي\n\n\n{ وَ } ثانيها: { حِينَ تَضَعُونَ ثِيَـٰبَكُمْ مِّنَ ٱلظَّهِيرَةِ } للاستراحة والقيلولة\n\n\n{ وَ } ثالثها: { مِن بَعْدِ صَلَٰوةِ ٱلْعِشَآءِ } وقت التجرد عن الثياب للنوم\n والأوقاتُ المذكورةُ { ثَلاَثُ عَوْرَاتٍ لَّكُمْ } لا بدَّ من تحفظكم فيها عما يشوشكم\n ويطلع على سركم { لَيْسَ عَلَيْكُمْ وَلاَ عَلَيْهِمْ جُنَاحٌ } ضيقُ ومنعُ { بَعْدَهُنَّ } أي: بعد الأوقات الثلاث لو دخلوا عليكم بلا إذن منكم\n إذ هم خَدَمةُ { طَوَٰفُونَ عَلَيْكُمْ } ليخدموكم\n إذ جُبلتم على أن يظاهر { بَعْضُكُمْ عَلَىٰ بَعْضٍ كَذَلِكَ } أي: مثل ما ذكر { يُبَيِّنُ ٱللَّهُ } المدبرُ لمصالحكم { لَكُمُ ٱلأَيَـٰتِ } الدالةَ على آداب المصاحبة والمؤانسة\n { وَٱللَّهُ } المطلعُ لأحوال عباده { عَلِيمٌ } بمصالحهم ومفاسدهم { حَكِيمٌ } [النور: 58] في ضبطها وحفظها\n بحيث لا يختل أمر النظام المتعارف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { يا أيها الذين آمنوا } ، ويدخل فيه النساء، { لِيَسْتَأْذِنكُمُ الذين ملكت أيمانُكُم } من العبيد والإماء، { والذين لم يبلغوا الحُلُمَ منكم } أي: والأطفال الذين لم يحتلموا من الأحرار، { ثلاثَ مراتٍ } في اليوم والليلة، وهي { من قبلِ صلاة الفجر } لأنه وقت القيام من المضاجع، وطرح ما ينام فيه من الثياب، ولبس ثياب اليقظة، وربما يجدهم في هذا الوقت نائمين متجردين، { وحين تضعون ثيابكم من الظهيرة } وهي نصف النهار في القيظ لأنها وقت وضع الثياب للقيلولة، { ومن بعد صلاةِ العشاء } لأنه وقت التجرد من ثياب اليقظة، والالتحاف بثياب النوم\n هي { ثلاثُ عوراتٍ لكم } ، ومن نصبه فَبَدلٌ من { ثلاث مرات } أي: أوقاتُ ثلاثِ عوراتٍ، وسمى كل واحد من هذه الأوقات عورة لأن الإنسان يختل تستره فيها، والعورة: الخلل، ومنه سمي الأعور لاختلاف عينه\n رُوي أن غلاماً لأسماء بنت أبي مرثد دخل عليها في وقت كَرِهَتْهُ، فنزلت\n وقيل: أرسل رسول الله صلى الله عليه وسلم مُدْلِجَ بنَ عَمرو الأنصاري، وكان غلاماً، وقت الظهيرة، ليدعو عُمر رضي الله عنه، فدخل عليه وهو نائم قد انكشف عنه ثوبه، فقال عمر رضي الله عنه: لوددت أن الله تعالى نهى عن الدخول في هذه الساعات إلا بإذن، فانطلق إلى النبي صلى الله عليه وسلم، فوجده وقد نزلت عليه هذه الآية\n والأمر، قيل: للوجوب، وقيل: للندب\n ثم عذرهم في ترك الاستئذان في غير هذه الأوقات، فقال: { ليس عليكم ولا عليهم جُناح بعدهنّ } أي: لا إثم عليكم ولا على المذكورين من المماليك والغلمان في الدخول بغير استئذان بعد كل واحدة من تلك العورات الثلاث، أي: في الأزمنة التي بين هذه العورات الثلاث\n ثم بيّن العلة في ترك الاستئذان في هذه الأوقات بقوله: { طوَّافون } أي: هم { طوَّافون عليكم } لحاجة البيت والخدمة، { بعضُكم على بعضٍ } أي: بعضكم طائف على بعض، أو يطوف على بعض، والجملة: إما بدل مما قبلها، أوبيان، يعني: أنكم محتاجون إلى المخالطة والمداخلة، يطوفون عليكم للخدمة وتطوفون عليهم للاستخدام، فلو جزم الأمر بالاستئذان في كل وقت لأفضى إلى الحرج، وهو مدفوع بالنص، { كذلك يبين الله لكم الآيات } أي: كما بيّن الاستئذان، يبين لكم غيره من الآيات التي تحتاجون إلى بيانها، { والله عليمٌ } بمصالح عبادة، { حكيم } فيما دَبَّرَ وحكم به",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:13",
      "similarity": 0.3105043107777924
    },
    {
      "verse": "30:18",
      "similarity": 0.2353663286748671
    },
    {
      "verse": "24:31",
      "similarity": 0.2310871999242896
    },
    {
      "verse": "5:101",
      "similarity": 0.16935134183630576
    },
    {
      "verse": "24:60",
      "similarity": 0.16498477421527954
    }
  ]
}