{
  "chapter": "النور",
  "text": "انما كان قول المؤمنين اذا دعوا۟ الى الله ورسوله ليحكم بينهم ان يقولوا۟ سمعنا واطعنا واو۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "The reply of the muminun when they are summoned to Allah and His Messenger so that he can judge between them, is to say, 'We hear and we obey.' They are ones who are successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The answer of the believers when they are called to God and His Apostle that he may judge between them, is: \"We hear and obey.\" And they are the ones who will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As regards the Believers, when they are called towards Allah and His Messenger so that the Messenger may judge between them, they say, \"We have heard and obeyed\"; such are the people who attain true success,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the believers are called to God and His Messenger to be judged, their only words are, \"We have listened and obeyed.\" They will have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The saying of the Muslims when they are called towards Allah and His Noble Messenger in order that the Noble Messenger judge between them is that they submit, “We hear and we obey”; and it is they who have attained the goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only saying of the faithful believers, when they are called to Allah and His Messenger, to judge between them, is that they say: \"We hear and we obey.\" And such are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The response of the believers, when they are invited to Allah and His Apostle that he may judge between them, is only to say: We hear and we obey; and these it is that are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that the believers say, when they are called to God and His Messenger, that he may judge between them, is that they say, 'We hear, and we obey'; those -- they are the prosperers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The saying of (all true) believers when they appeal unto Allah and His messenger to judge between them is only that they say: We hear and we obey. And such are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The response of the believers, when they are called to God and His Messenger in order that he may judge between them, is only, \"We hear and we obey.\" It is they who will prosper:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "-The only saying of the believers when they were called to Allah and His apostle thathe might judge between them was that they said: We hear and we obey. And these! they are the very ones blissful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the response of the faithful, when they are summoned to Allah and His Apostle that He may judge between them, is to say, ‘We hear and obey.’ It is they who are the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The answer of the Believers, when summoned to Allah and His Messenger, in order that He may judge between them, is no other than this: they say, \"We hear and we obey\": it is such as these that will attain felicity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only saying of the faithful believers, when they are called to Allah (His Words, the Quran) and His Messenger (SAW), to judge between them, is that they say: \"We hear and we obey.\" And such are the prosperous ones (who will live forever in Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the believers are called to Allah and His Messenger, in order that he judges between them, their reply is: 'We hear and obey' Such are theprosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The response of the believers, when they are called to God and His Messenger in order to judge between them, is to say, “We hear and we obey.” These are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only statement of the [true] believers when they are called to Allah and His Messenger to judge between them is that they say, \"We hear and we obey.\" And those are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:51] All that the believers say, when they are summoned to God and His Messenger, that he may judge between them, is that they say, in other words, the saying that befits them is [to say]: ‘We hear and we obey’, by responding [to the summons]. And those, then, are the successful, the ones who will be saved.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّمَا كَانَ قَوْلَ الْمُؤْمِنِينَ إِذَا دُعُوا إِلَى اللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ أَنْ يَقُولُوا سَمِعْنَا وَأَطَعْنَا وَأُولَئِكَ هُمُ الْمُفْلِحُونَ (51)استئناف بياني لأن الإخبار عن الذين يعرضون عندما يدعون إلى الحكومة بأنهم ليسوا بالمؤمنين في حين أنهم يظهرون الإيمان يثير سؤال سائل عن الفاصل الذي يميز بين المؤمن الحق وبين الذي يرائي بإيمانه في حين يُدعى إلى الحكومة عند رسول الله صلى الله عليه وسلم فيقتضي أن يبين للسائل الفرق بين الحالين لئلا يلتبس عنده الإيمان المزور بالإيمان الصادق ، فقد كان المنافقون يموهون بأن إعراض من أعرض منهم عن التحاكم عند رسول الله ليس لتزلزل في إيمانه بصدق الرسول ولكنه إعراض لمراعاة أعراض من العلائق الدنيوية كقول بشْر : إن الرسول يُبغضني . فبيّن الله بطلان ذلك بأن المؤمن لا يرتاب في عدل الرسول وعدم مصانعته .وقد أفاد هذا الاستئناف أيضاً الثناء على المؤمنين الأحقاء بضد ما كان ذماً للمنافقين . وذلك من مناسبات هذا الاستئناف على عادة القرآن في إرداف التوبيخ بالترغيب والوعيد بالوعد والنذارة بالبشارة والذم بالثناء .وجيء بصيغة الحصر ب { إنما } لدفع أن يكون مخالف هذه الحالة في شيء من الإيمان وإن قال بلسانه إنه مؤمن ، فهذا القصر إضافي ، أي هذا قول المؤمنين الصادقين في إيمانهم لا كقول الذين أعرضوا عن حكم الرسول حين قالوا : { آمنا بالله وبالرسول وأطعنا } \\[ النور : 47 \\] فلما دعوا إلى حكم الرسول عصوا أمره فإن إعراضهم نقيض الطاعة ، وسيأتي بيانه قريباً . وليس قصراً حقيقياً لأن أقوال المؤمنين حين يدعون إلى رسول الله صلى الله عليه وسلم ليحكم بينهم غير منحصرة في قول : { سمعنا وأطعنا } ولا في مرادفه ، فلعل منهم من يزيد على ذلك .وفي «الموطأ» من حديث زيد بن خالد الجهني : \" أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم فقال أحدهما : يا رسول الله اقض بيننا بكتاب الله ( يعني وهو يريد أن رسول الله يقضي له كما وقع التصريح في رواية الليث بن سعد في «البخاري» أن رجلاً من الأعراب أتى رسول الله فقال : أنشدك بالله إلا قضيت لي بكتاب الله) . وقال الآخر وهو أفقههما : أجل يا رسول الله فاقض بيننا بكتاب الله وأذن لي أن أتكلم ( يريد لا تقض له علي فأذَنْ لي أن أبين) فقال رسول الله تكلم . . \" الخ .وليس المراد بقول { سمعنا وأطعنا } خصوص هذين اللفظين بل المراد لفظهما أو مرادفهما للتسامح في مفعول فعل القول أن لا يحكى بلفظه كما هو مشهور . وإنما خص هذان اللفظان بالذكر هنا من أجل أنهما كلمة مشهورة تقال في مثل هذه الحالة وهي مما جرى مجرى المثل كما يقال أيضاً «سمع وطاعة» بالرفع و«سمعاً وطاعة» بالنصب ، وقد تقدم الكلام على ذلك عند قوله تعالى : { ولو أنهم قالوا سمعنا وأطعنا }في سورة \\[ النساء : 46 \\] . وفي حديث أبي هريرة : « قال النبي للأنصار : تكفوننا المؤونة ونَشْرِكُكم في الثمرة . فقال الأنصار : سمعنا وأطعنا » . و { قول المؤمنين } خبر { كان } و { أن يقولوا } هو اسم { كان } وقدم خبر كان على اسمها متابعة للاستعمال العربي لأنهم إذا جاؤوا بعد { كان } بأن والفعل لم يجيئوا بالخبر إلا مقدماً على الاسم نظراً إلى كون المصدر المنسبك من أن والفعل أعرفَ من المصدر الصريح ، ولم يجيئوا بالخبر إلا مقدماً كراهية توالي أداتين وهما : { كان } و { أن } . ونظائر هذا الاستعمال كثيرة في القرآن . وتقدم عند قوله تعالى : { وما كان قولهم إلا أن قالوا ربنا اغفر لنا ذنوبنا } في سورة \\[ آل عمران : 147 \\] .وجيء في وصف المؤمنين بالفلاح بمثل التركيب الذي وصف به المنافقون بالظلم بصيغة القصر المؤكد ليكون الثناء على المؤمنين ضداً لمذمة المنافقين تاماً .واعلم أن القصر المستفاد من { إنما } هنا قصر إفراد لأحد نوعي القول . فالمقصود منه الثناء على المؤمنين برسوخ إيمانهم وثبات طاعتهم في المنشط والمكره . وفيه تعريض بالمنافقين إذ يقولون كلمة الطاعة ثم ينقضونها بضدها من كلمات الإعراض والارتياب . ونظير هذه الآية في طريق قصر ب ( إلاّ) قوله تعالى : { وما كان قولهم إلا أن قالوا ربنا اغفر لنا ذنوبنا } في سورة \\[ آل عمران : 147 \\] .\n\n",
      "translations": [
        {
          "translation": "Allah then mentioned what the sincere believers say, saying: (The saying of (all true) believers) such as 'Uthman who said to 'AN: \"rather, I will come with you to the Prophet (pbuh) and I will accept his judgement whatever it is\", and so Allah praised him for saying so, (when they appeal unto Allah) when they are called to the Book of Allah (and His messenger) and to the wont of His Messenger (to judge) for the Prophet to judge (between them) by Allah's Book (is only that they say: We hear and we obey) what we have been commanded with. (And such are the successful) such are the ones, i.e. 'Uthman Ibn 'Affan, who will escape Allah's wrath and chastisement. 393\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته المستمرة: { إِنَّمَا كَانَ قَوْلَ ٱلْمُؤْمِنِينَ } المخلصين على عكس المنافقين والمترددين { إِذَا دُعُوۤاْ } عند النزاع والمخاصمة { إِلَى ٱللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ } ويزيل شبههم { أَن يَقُولُواْ } طائعين راغبين: { سَمِعْنَا وَأَطَعْنَا } بلا مطلٍ وتسويفٍ\n رضينا بما حكمنا الله ورسوله { وَأُوْلَـٰئِكَ } السعداء المقبولون عند الله ورسوله { هُمُ ٱلْمُفْلِحُونَ } [النور: 51] الفائزون بالفلاح\n المقصورون على الصلاح والنجاح\n ولا يتحولون عنه بل يزادون عليه تفضلاً وامتناناً\n\n\n{ وَ } كيف لا يزادون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قول: خَبَرُ \" كَانَ \" مُقَدَّمٌ\n وأن يقولوا: اسمها مؤخر\n وقرأ الحسن: بالرفع على الاسمية\n والأول: أرجح صنَاعةً\n والثاني: أظهر دلالة\n وأكثر إفادة\n انظر أبا السعود\n يقول الحق جل جلاله: { إِنما كان قَوْلَ المؤمنين } الصادر عنهم { إذا دُعُوا إلى الله ورسولِه ليحكم } الرسولُ صلى الله عليه وسلم { بينهم } وبين خصومهم\n سواء كانوا منهم أو من غيرهم\n { أن يقولوا سمعنا } قوله\n { وأطعنا } أمره\n { وأولئك هم المفلحون } الفائزون بكل مطلب\n الناجون من كل مهرب\n والإشارة إلى المؤمنين باعتبار صدور القول المذكور عنهم\n وما فيه من البُعد\n للإشعار بعلو رتبتهم\n وبُعد منزلتهم في الفضل\n أي: أولئك المنعوتون بتلك النعوت الجميلة هم الفائزون بكل مطلوب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:1",
      "similarity": 0.5563579881575882
    },
    {
      "verse": "2:5",
      "similarity": 0.5346844384633636
    },
    {
      "verse": "31:5",
      "similarity": 0.5346844384633636
    },
    {
      "verse": "10:69",
      "similarity": 0.45645554108350334
    },
    {
      "verse": "87:14",
      "similarity": 0.44506971763749
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}