{
  "chapter": "النور",
  "text": "وعد الله الذين ءامنوا۟ منكم وعملوا۟ الصلحت ليستخلفنهم فى الارض كما استخلف الذين من قبلهم وليمكنن لهم دينهم الذى ارتضى لهم وليبدلنهم منۢ بعد خوفهم امنا يعبدوننى لا يشركون بى شيـا ومن كفر بعد ذلك فاو۟لئك هم الفسقون",
  "translations": [
    {
      "translation": "Allah has promised those of you who have iman and do right actions that He will make them successors in the land as He made those before them successors, and will firmly establish for them their deen with which He is pleased and give them, in place of their fear, security. 'They worship Me, not associating anything with",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised to make those of you who believe and do the right, leaders in the land, as He had made those before them, and will establish their faith which He has chosen for them and change their fear into security. They will worship Me and not associate any one with Me. But those who disbelieve after this will be reprobates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised to those among you who believe and do righteous deeds, that He will make them successors in the land just as He made those who passed away before them, and that He will establish their religion, which He has approved for them, on strong foundations and will change their (present) state of fear into peace and security. Let them worship Me and associate none with Me; and the one who disbelieves after this,\" shall be of those who are perverse transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised the righteously striving believers to appoint them as His deputies on earth, as He had appointed those who lived before. He will make the religion that He has chosen for them to stand supreme. He will replace their fear with peace and security so that they will worship God alone and consider no one equal to Him. Whoever becomes an unbeliever after this will be a sinful person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those among you who believe and do good deeds, that He will certainly give them the Caliphate in the earth the way He gave to those before them; and that He will certainly establish for them their religion which He has chosen for them, and will turn their prior fear into peace; they must worship Me and not ascribe anything as a partner to Me; and whoever is ungrateful after this – it is they who are the disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those among you who believe and do righteous good deeds, that He will certainly grant them succession in the land, as He granted it to those before them, and that He will grant them the authority to practise their religion which He has chosen for them. And He will surely give them in exchange a safe security after their fear if they worship Me and do not associate anything with Me. But whoever disbelieved after this, they are the rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised to those of you who believe and do good that He will most certainly make them rulers in the earth as He made rulers those before them, and that He will most certainly establish for them their religion which He has chosen for them, and that He will most certainly, after their fear, give them security in exchange; they shall serve Me, not associating aught with Me; and whoever is ungrateful after this, these it is who are the. transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised those of you who believe and do righteous deeds that He will surely make you successors in the land, even as He made those who were before them successors, and that He will surely establish their religion for them that He has approved. for them, and will give them in exchange, after their fear, security: 'They shall serve Me, not associating with Me anything.' Whoso disbelieves after that, those - they are the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath promised such of you as believe and do good work that He will surely make them to succeed (the present rulers) in the earth even as He caused those who were before them to succeed (others); and that He will surely establish for them their religion which He hath approved for them, and will give them in exchange safety after their fear. They serve Me. They ascribe no thing as partner unto Me. Those who disbelieve henceforth, they are the miscreants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised to those among you who believe and do good works that He will surely grant them power in the land as He granted to those who were before them; and that He will surely establish for them their religion which He has chosen for them. He will cause their state of fear to be replaced by a sense of security. Let them worship Me and associate no other with Me. Whoever still chooses to deny the truth is truly rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath promised those of you who believe and work the righteous works that he shall make them successors on the earth even as He had made those before them successors, and that he shall surely establish for them their religion which He hath approved for them, and that he shall surely exchange unto them after their fear a security, provided they worship Me, associating not aught with Me; and whosoever will disbelieve thereafter, then those! they are the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those of you who have faith and do righteous deeds that He will surely make them successors in the earth, just as He made those who were before them successors, and He will surely establish for them their religion which He has approved for them, and that He will surely change their state to security after their fear, while they worship Me, not ascribing any partners to Me. Whoever is ungrateful after that—it is they who are the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised, to those among you who believe and work righteous deeds, that He will, of a surety, grant them in the land, inheritance (of power), as He granted it to those before them; that He will establish in authority their religion - the one which He has chosen for them; and that He will change (their state), after the fear in which they (lived), to one of security and peace: 'They will worship Me (alone) and not associate aught with Me. 'If any do reject Faith after this, they are rebellious and wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those among you who believe, and do righteous good deeds, that He will certainly grant them succession to (the present rulers) in the earth, as He granted it to those before them, and that He will grant them the authority to practise their religion, that which He has chosen for them (i.e. Islam). And He will surely give them in exchange a safe security after their fear (provided) they (believers) worship Me and do not associate anything (in worship) with Me. But whoever disbelieved after this, they are the Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those of you who believe and do good works that He will indeed make them successors in the land as He made those who were before them successors, and that He will indeed establish their religion for them; that which He has approved for them, and will exchange safety for them after their fear. They worship Me and associate nothing with Me. After that, those who disbelieve are the impious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised those of you who believe and do righteous deeds, that He will make them successors on earth, as He made those before them successors, and He will establish for them their religion—which He has approved for them—and He will substitute security in place of their fear. They worship Me, never associating anything with Me. But whoever disbelieves after that—these are the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those who have believed among you and done righteous deeds that He will surely grant them succession [to authority] upon the earth just as He granted it to those before them and that He will surely establish for them [therein] their religion which He has preferred for them and that He will surely substitute for them, after their fear, security, [for] they worship Me, not associating anything with Me. But whoever disbelieves after that - then those are the defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:55] God has promised those of you who believe and perform righteous deeds that He will surely make them successors in the earth, in place of the disbelievers, just as He made those, Children of Israel, who were before them successors, in place of the [ruling] tyrants ([the verb may be] read as active istakhlafa, ‘He made [them] successors’, or as passive istukhlifa, ‘were made successors’) and He will surely establish for them their religion which He has approved for them, namely, [the religion of] Islam, by making it prevail over all religions and enrich them throughout the land, so that they become masters thereof, and that He will give them in exchange (read wa-la-yubdilannahum or wa-la-yubaddilannahum) after their fear, of disbelievers, security. And God fulfilled His promise to them in the way mentioned, and He praises them with His words: ‘They worship Me, without associating anything with Me’ (ya‘budūnanī lā yushrikūna bī shay’an is   an [independent] new sentence, standing as a justification [for His promise]). And whoever is ungrateful after that, bestowal of grace, from among them, [whoever is ungrateful] for it, those, they are the immoral. The first to show ingratitude for that [grace of God] were the murderers of ‘Uthmān [b. ‘Affān], may God be pleased with him, and they began to kill one another [henceforth] after having been brothers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath promised such of you) Companions of Muhammad (pbuh) (as believe and do good works) between themselves and their Lord (that He will surely make them to succeed (the present rulers) in the earth (to succeed others)) some of them in succession to others (even as He caused those who were before them) among the Children of Israel: Joshua ben Nun, Caleb ben Jephunneh; it is also said that this means: We shall make them dwell in the land of Mecca as We made those before them, among the Children of Israel, dwell in their land after the destruction of their enemy; (and that He will surely establish for them) He will make triumph (their religion which He hath approved for them) and has chosen for them, (and will give them in exchange) of Mecca (safety) following the destruction of their enemy (after their fear) of the enemy. (They serve Me) in order that they worship Me in Mecca. (They ascribe no thing) no idol (as partner unto Me. Those who disbelieve henceforth) after victory and change of fortune, (they are the miscreants) the disobedient.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وجميعِ الأمور الأخروية { وَ } مع الإيمان والإعان { عَمِلُواْ ٱلصَّالِحَاتِ } المقبولةِ عند الله\n المرضية له على مقتضى ما أوحاه على رسوله وأنزله في كتابه\n وأقسم سبحانه بنفسه تأكيداً لوعده { لَيَسْتَخْلِفَنَّهُمْ } وليجعلنهم خلفاء { فِي ٱلأَرْضِ } التي استولى عليها الكفرة { كَمَا ٱسْتَخْلَفَ ٱلَّذِينَ } آمنوا { مِن قَبْلِهِمْ } يعني: بني إسرائيل استخلفهم على بلاد العمالقة والفراعنة وأرض الشام والفرس\n { وَ } بعد استخلافهم { لَيُمَكِّنَنَّ } ويقررن { لَهُمْ دِينَهُمُ ٱلَّذِي ٱرْتَضَىٰ لَهُمْ } وهو دين الإسلام\n المبني على صرافة التوحيد الذاتي المستلزم لتوحيد الصفات والأفعال\n\n\nوليشيعن ويذيعن دينهم هذا إلى جميع الأقطار والأنحاء { وَلَيُبَدِّلَنَّهُمْ } ويحولن حالهم { مِّن بَعْدِ خَوْفِهِمْ } الناشئ من تمويهات متخيلتهم ووساوس متوهمتهم { أَمْناً } نشأ من اليقين الحقي المثمرِ لكمال الاطمئنان والوقار\n وبعدما حصل لهم مرتبة الفناء في ذاتي\n حصل لهم البقاء ببقائي\n فحينئذٍ { يَعْبُدُونَنِي } مخلصين حيث { لاَ يُشْرِكُونَ بِي شَيْئاً } من مظاهري ومصنوعاتي بتسويلات شياطين الخيالات والأوهام { وَمَن كَفَرَ } أي: ارتد ورجع { بَعْدَ ذٰلِكَ } أي: بعد نفي الخواطر والأوهام المضلةِ عن سواء السبيل { فَأُوْلَـٰئِكَ } المردودون المطرودون عن ساحة عز الحضور والقبول { هُمُ ٱلْفَاسِقُونَ } [النور: 55] الخاسرون المقصورون على الخروج والخسران عن مقتضى اليقين العلمي والعيني والحقي\n\n[الزمر: 15]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: ليستخلفنهم: جواب لقسم مضمر\n أو تنزيل وعْده تعالى منزلة القسم\n و كما: الكاف: محلها النصب على المصدر التشبيهي\n أي: استخلافاً كائناً كاستخلافه مَنْ قَبْلَهُمْ\n و ما: مصدرية\n و يعبدونني: حال من الموصول الأول\n مقيدة للوعد بالثبات على التوحيد\n أو استئنافٌ ببيان مقتضى الاستخلاف\n و لا يشركون: حال من واو يعبدونني\n يقول الحق جل جلاله: { وعد الله الذين آمنوا منكم } أي: كل من اتصف بالإيمان بعد الكفر من أي طائفة كان\n وفي أي وقت وجد\n لا من آمن من المنافقين فقط\n ولا من آمن بعد نزول الآية الكريمة\n بحسب ظهور الوعد الكريم\n و من: للبيان\n وقيل: للتبعيض\n ويراد المهاجرون فقط\n { وعملوا } مع الإيمان الأعمال { الصالحات } \n وتوسيط المجرور بين المَعْطُوفَيْنِ لإظهار أصالة الإيمان وعراقته في استتباع الآثار والأحكام\n والإيذان بكونه أول ما يطلب منهم\n وأهم ما يجب عليهم\n وأما تأخيره في قوله:\n[الفتح: 29] فإن الضمير للذين آمنوا معه صلى الله عليه وسلم فلا ريب أنهم جامعون بين الإيمان والأعمال الصالحة\n مثابون عليها\n فلا بد من ورود بيانهم بعد نعوتهم الجليلة بكمالها\n ثم ذكر الموعود به\n فقال: { لَيستخلفنَّهم في الأرض } أي: لَيجعلهم خلفاء متصرفين فيها تصرف الملوك في مماليكهم\n والمراد بالأرض: أرض الكفار كلها\n لقوله عليه الصلاة والسلام:\n \" ليدخلن هذا الدين ما دخل الليل والنهار \" \n\n { كما استخلف الذين مِن قبلهم } كبني إسرائيل\n استخلفهم الله في مصر والشام\n بعد إهلاك فرعون والجبابرة\n ومَنْ قَبْلَهم مِن الأمم المؤمنة التي استخلفهم الله في أرض من أهلكه الله بكفره\n كما قال تعالى:\n[إبراهيم: 13]\n { وليُمَكِّنَنَّ لهم دينَهم }: عطف على { ليستخلفنهم } \n داخل معه في سلك الجواب\n وتأخيره عنه مع كونه أصل الرغائب الموعودة وأعظمها لأن النفوس إلى الحظوظ العاجلة أميل\n فَتصْدير المواعد بها في الاستمالة أدخل\n والمعنى: ليجعل دينهم ثابتاً متمكناً مقرراً لا يتبدل ولا يتغير\n ولا تنسخ أحكامه إلى يوم القيامة\n ثم وصف بقوله: { الذي ارتضى لهم } \n وهو دين الإسلام\n وصفه بالارتضاء تأليفاً ومزيدَ ترغيب فيه وفضْلَ تثبيت عليه\n { وليُبدِّلنهُمْ } بالتشديد والتخفيف من الإبدال\n { من بعد خوفهم } من الأعداء { أمناً }\n نزلتْ حيث كان أصحاب رسول الله صلى الله عليه وسلم قبل الهجرة عشر سنين\n أو أكثر\n خائفين\n ولَمَّا هاجروا كانوا بالمدينة يُصْبِحُون في السلاح ويُمْسُون فيه\n حتى قال رجل: ما يأتي علينا يوم نأمن فيه\n ونضع السلاح\n فلما نزلت\n قال عليه الصلاة والسلام:\n \" لا تصبرون إلا يسيراً حتى يَجْلِسَ الرجل منكم في الملأِ العظيم\n مُحْتبياً\n ليس معه حديدة \" \n\n فأنجز الله وعده\n فأمِنُوا\n وأظهرهم على جزيرة العرب\n وفتح لهم بلاد المشرق والمغرب\n ومزقوا ملك الأكاسرة\n وملكوا خزائنهم\n واستولوا على الدنيا بحذافيرها\n\nوفيه من الإخبار بالغيب ما لا يخفى\n وقيل: الخوف والأمن في الآخرة\n ثم مدحهم بالإخلاص فقال: { يعبدونني } وحدي\n { لا يُشركون بي شيئاً } أي: حال كونهم موحدين غير مشركين بي شيئاً من الأشياء\n شركاً جلياً ولا خفياً لرسوخ محبتهم\n فلا يُحبون معه غيره\n { ومن كَفَر بعد ذلك } أي: بعد الوعد الكريم\n كفرانَ النعمة\n أو الرجوع عن الإيمان\n كما فعل أهلُ الردة\n { فأولئك هم الفاسقون } الكاملون في الفسق\n حيث كفروا تلك النعمة بعد ظهور عزها وأنوارها\n قيل: أول من كفر هذه النعمة قتلةُ عثمان رضي الله عنه فاقتتلوا بعد ما كانوا إخواناً\n والآية أوضح دليل على صحة خلافة الخلفاء الراشدين لأن المستخلَفين الذين آمنوا وعملوا الصالحات على ما ينبغي هم الخلفاء - رضي الله عنهم -\n ولمّا كان كفر من كفر بعد الوعد إنما كان بمعنى بمنع الزكاة\n قرَنَه مع الصلاة في الأمر به فقال: { وأقيموا الصلاة وآتوا الزكاةَ } فمن فرّق بينهما فقد كفر\n وكان من الفاسقين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:21",
      "similarity": 0.41914043727583755
    },
    {
      "verse": "81:20",
      "similarity": 0.36721833665040077
    },
    {
      "verse": "18:84",
      "similarity": 0.3587791065066064
    },
    {
      "verse": "8:71",
      "similarity": 0.3499466051959049
    },
    {
      "verse": "22:41",
      "similarity": 0.34690564104578364
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024055.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024055.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}