{
  "chapter": "النور",
  "text": "الا الذين تابوا۟ منۢ بعد ذلك واصلحوا۟ فان الله غفور رحيم",
  "translations": [
    {
      "translation": "except for those who after that make tawba and put things right. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent after this and reform; and God is surely forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who repent and reform themselves; Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except that of those who afterwards repent and reform themselves; God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent after this and reform themselves; so indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent thereafter and do righteous deeds; (for such) verily, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent after this and act aright, for surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save such as repent thereafter and make amends; surely God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those who afterward repent and make amends. (For such) lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save those who afterwards repent and make amends, for truly God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Excepting those who thereafter shall repent and make amends. Verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "excepting those who repent after that and reform, for Allah is indeed all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless they repent thereafter and mend (their conduct); for Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent thereafter and do righteous deeds, (for such) verily, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those among them that afterwards repent and mend their ways. Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent afterwards, and reform; for God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent thereafter and reform, for indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:5] except those who repent thereafter and make amends, in their deeds, for God is indeed Forgiving, of their [unsubstantiated] accusations, Merciful, to them, in inspiring them to make repentance whereby their immorality is curbed and their testimony becomes [once again] acceptable — some say, however, that it can never be accepted [thereafter], if the proviso is taken to refer to the last clause.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِلَّا الَّذِينَ تَابُوا مِنْ بَعْدِ ذَلِكَ وَأَصْلَحُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (5)والاستثناء في قوله : { إلا الذين تابوا } حقه أن يعود إلى جميع ما تقدم قبله كما هو شأن الاستثناء عند الجمهور إلا أنه هنا راجع إلى خصوص عدم قبول شهادتهم وإثبات فسقهم وغير راجع إلى إقامة الحد ، بقرينة قوله : { من بعد ذلك } ، أي بعد أن تحققت الأحكام الثلاثة فالحد قد فات على أنه قد علم من استقراء الشريعة أن الحدود الشرعية لا تسقطها توبة مقترف موجبها وقال أبو حنيفة وجماعة : الاستثناء يرجع إلى الجملة الأخيرة جرياً على أصله في عود الاستثناء الوارد بعد جمل متعاطفة .والتوبة : الإقلاع والندم وظهور عزمه على أن لا يعود لمثل ذلك . وقد تقدم ذكر التوبة في سورة النساء ( 17) عند قوله تعالى : { إنما التوبة على الله } الآيات . وليس من شرط التوبة أن يكذب نفسه فيما قذف به عند الجمهور ، وهو قول مالك ، لأنه قد يكون صادقاً ولكنه عجز عن إثبات ذلك بأربعة شهداء على الصفة المعلومة ، فتوبته أن يصلح ويحسن حاله ويتثبت في أمره . وقال قوم : لا تعتبر توبته حتى يكذب نفسه . وهذا قول عمر بن الخطاب والشعبي ، ولم يقبل عمر شهادة أبي بكرة لأنه أبى أن يكذب نفسه فيما رمى به المغيرة بن شعبة . وقبل من بعد شهادة شبل بن معبد ونافع بن كلدة لأنهما أكذبا أنفسهما في تلك القضية وكان عمر قد حد ثلاثتهم حد القذف .ومعنى أصلحوا } فعلوا الصلاح ، أي صاروا صالحين . فمفعول الفعل محذوف دل عليه السياق ، أي أصلحوا أنفسهم باجتناب ما نهوا عنه ، وقد تقدم عند قوله تعالى : { قالوا إنما نحن مصلحون } \\[ البقرة : 11 \\] ، وقوله : { إلا الذين تابوا وأصلحوا وبينوا } في سورة البقرة ( 160) .وفرع فإن الله غفور رحيم } على ما يقتضيه الاستثناء من معنى : فاقبلوا شهادتهم واغفروا لهم ما سلف فإن الله غفور رحيم ، أي فإن الله أمر بالمغفرة لهم لأنه غفور رحيم ، كما قال في آية البقرة ( 160) : { إلا الذين تابوا وأصلحوا وبينوا فأولئك أتوب عليهم وأنا التواب الرحيم . } وإنما صرح في آية البقرة بما قدر نظيره هنا لأن المقام هنالك مقام إطناب لشدة الاهتمام بأمرهم إذ ثابوا إلى الإيمان والإصلاح وبيان ما أنزل إليهم من الهدى بعدما كتموه وكتمه سلفهم .وظاهر الآية يقتضي أن حد القذف حق لله تعالى ، وهو قول أبي حنيفة . وقال مالك والشافعي : حق للمقذوف . ويترتب على الخلاف سقوطه بالعفو من المقذوف .وهذه الآية أصل في حد الفرية والقذف الذي كان أول ظهوره في رمي المحصنات بالزنى . فكل رمي بما فيه معرة موجب للحد بالإجماع المستند للقياس .\n\n",
      "translations": [
        {
          "translation": "(Save those who afterward repent) after their slander (and make amends) between themselves and their Lord. ((For such) lo! Allah is Forgiving) He forgives whoever repents, (Merciful) He bestows mercy upon whoever dies repentant. This verse was revealed about 'Abdullah Ibn Ubayy and his host.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ ٱلَّذِينَ تَابُواْ } منهم ورجعوا { مِن بَعْدِ ذٰلِكَ } الرمي والافتراء { وَأَصْلَحُواْ } ما أفسدوا على نفوسهم بالتوبة والندامة عن ظهر القلب { فَإِنَّ ٱللَّهَ } المطلع لضمائرهم { غَفُورٌ } يعفو عنهم ويستر زلتهم { رَّحِيمٌ } [النور: 5] يرحمهم\n ويقبل توبتهم إن أخلصوا فيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا الذين تابوا من بعد ذلك } القذف\n { وأَصلحوا } أحوالهم\n فهو استثناء من الفاسقين\n بدليل قوله: { فإن الله غفور رحيم } أي: يغفر ذنوبهم ويرحمهم\n ولا ينظمهم في سلك الفاسقين\n فعلى هذا لا تُقبل شهادته مطلقاً فيما حدّ فيه وفي غيره لأن رد شهادته وُصلت بالأبد\n وأما توبته فإنما تنفعه فيما بينه وبين الله\n وبه قال أبو حنيفة وأصحابه\n وهو قول ابن عباس وشريح والنخعي\n وقيل: الاستثناء راجع لقوله: { ولا تقبلوا لهم شهادة } \n فإذا تاب وأصلح قبلت شهادته مطلقاً لأنه زال عنه اسم الفسق\n والأبد عبارة عن مدة كونه فاسقاً\n فينتهي بالتوبة\n وبه قال الشافعي وأصحابه\n وهو قول الشعبي ومسروق وابن جبير وعطاء وسليمان بن يسار\n\nوفصل مالك\n فقال: لا تجوز فيما حدّ فيه\n ولو تاب\n وتجوز فيما سواه\n وكأنه جمع بين القولين\n والله تعالى أعلم\n الإشارة: الغض عن مساوئ الناس من أفضل القرب\n وهو من شيم ذوي الألباب\n وبه السلامة من الهلاك والعطَب\n والتعرض لمساوئهم من أعظم الذنوب\n وأقبح العيوب\n ولله در القائل:\nفالمتوجه إلى الله لا يشتغل بغير مولاه\n ولا يرى في المملكة سواه\n يذكر الله على الأشياء\n فتنقلب نوراً لحسن ظنه بالله\n ويلتمس المعاذر لعباد الله لكمال حسن ظنه بهم\n وبالله التوفيق\n ثم تكلم على من رمى زوجته وبه يقع اللعان\n فقال: { وَٱلَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ وَلَمْ يَكُنْ لَّهُمْ شُهَدَآءُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:89",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "5:39",
      "similarity": 0.8959514943081229
    },
    {
      "verse": "2:160",
      "similarity": 0.7926187234081722
    },
    {
      "verse": "9:27",
      "similarity": 0.7905518061380128
    },
    {
      "verse": "5:74",
      "similarity": 0.7094882385129258
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}