{
  "chapter": "النور",
  "text": "افى قلوبهم مرض ام ارتابوا۟ ام يخافون ان يحيف الله عليهم ورسوله بل او۟لئك هم الظلمون",
  "translations": [
    {
      "translation": "Is there a sickness in their hearts or do they have misgivings or do they fear that Allah and His",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there a malady in their hearts, or they are deluded, or afraid that God and His Prophet would be unjust in dealing with them? Not so; they are themselves unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are their hearts afflicted with the disease (of hypocrisy)? Or, are they in doubt? Or, do they fear that Allah and His Messenger will be unjust to them? In fact, they themselves are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are their hearts sick? Do they have doubts or are they afraid that God and His Messenger may do injustice to them? In fact, they, themselves, are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are their hearts diseased, or do they have doubts, or do they fear that Allah and His Noble Messenger will oppress them? In fact they themselves are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there a disease in their hearts Or do they doubt or fear lest Allah and His Messenger should wrong them in judgement. Nay, it is they themselves who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there in their hearts a disease, or are they in doubt, or do they fear that Allah and His Apostle will act wrongfully towards them? Nay! they themselves are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, is there sickness in their hearts, or are they in doubt, or do they fear that God may be unjust towards them and His Messenger? Nay, but those -- they are the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there in their hearts a disease, or have they doubts, or fear they lest Allah and His messenger should wrong them in judgment? Nay, but such are evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there a sickness in their hearts, or are they full of doubt? Or do they fear that God and His Messenger will be unjust to them? The truth is that they themselves are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is in their hearts a disease? or doubt they? or fear they that Allah shall misjudge them, as also His apostle? Aye! these are the very wrong-doers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there a sickness in their hearts? Do they have doubts, or fear that Allah and His Apostle will be unjust to them? Indeed, it is they who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it that there is a disease in their hearts? or do they doubt, or are they in fear, that Allah and His Messenger will deal unjustly with them? Nay, it is they themselves who do wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there a disease in their hearts? Or do they doubt or fear lest Allah and His Messenger (SAW) should wrong them in judgement. Nay, it is they themselves who are the Zalimun (polytheists, hypocrites and wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there a sickness in their hearts, or, are they in doubt? Do they fear that Allah and His Messenger will be unjust? No, but those they are the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there sickness in their hearts? Or are they suspicious? Or do they fear that God may do them injustice? Or His Messenger? In fact, they themselves are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there disease in their hearts? Or have they doubted? Or do they fear that Allah will be unjust to them, or His Messenger? Rather, it is they who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:50] Is there a sickness, disbelief, in their hearts? Or are they in doubt, are they uncertain of his prophethood, or do they fear that God and His Messenger will be unjust to them?, in judgement, in other words, that they will be wronged therein? No! Rather, those, they are the wrongdoers, for shunning him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is there in their hearts a disease) doubt and hypocrisy, (or have they doubts) concerning Allah and His Messenger, (or fear they lest Allah and His messenger should wrong them in judgement? Nay, but such are evil-doers) who harm themselves and are further hypocrites.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والميل إلى اليقين والعرفان { أَمِ ٱرْتَابُوۤاْ } وترددوا في عدالة الله ورسوله { أَمْ يَخَافُونَ } من سوء ظنونهم { أَن يَحِيفَ } ويميل { ٱللَّهُ } المستوي على القسط والعدل { عَلَيْهِمْ وَرَسُولُهُ } المتخلقُ بأخلاقه ظلماً\n بأن أجازوا الظلم على الله ورسوله { بَلْ } الحق أنه لا شكل في عدالة الله ورسله\n ولا يُنسب الحيف والميل إليهما أصلاً\n فتعين أنه { أُوْلَـٰئِكَ } البعداء عن ساحة القبول { هُمُ ٱلظَّالِمُونَ } [النور: 50] المقصورون على الخروج عن حد الاعتدال\n المائلون عن الصراط المستقيم لمرض قلوبهم وخبثِ طينتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم ارْتابُوا } في نبوته صلى الله عليه وسلم\n { أم يخافون أن يَحِيفَ } أن يجور { الله عليهم ورسولهُ } فيحكم بينهم بغير الحق\n قسَّم الحق تعالى الأمر في صدود المنافقين عن حكومته - عليه الصلاة والسلام - إذا كان الحق عليهم ثلاث: بأن يكونوا مرضى القلوب منافقين أو مرتابين في أمر نبوته\n أو خائفين الحيف في قضائه\n ثم أبطل الكل بقوله: { بل أولئك هم الظالمون } \n أما الأولان فلأنه لو كان شيء منهما لأعرضوا عنه\n عند كون الحق لهم لتحقق نفاقهم وارتيابهم\n وأما الثالث فلمعرفتهم بأحواله صلى الله عليه وسلم في الأمان والثبات على الحق\n فهم لا يشكون أنه لا يحيف بل لأنهم هم الظالمون\n يريدون أن يظلِمُوا من له الحق عليهم\n ويتم لهم جحودهم\n فيأبَوْن المحاكمة إليه - عليه الصلاة والسلام - لأنه صلى الله عليه وسلم يقضي عليهم بالحق الصريح\n المؤيد بالوحي الصحيح\n\nالإشارة: ترى فريقاً من الناس يدّعون الإيمان والطاعة والمحبة\n ونفوسهم غالبة عليهم\n فإذا دُعُوا إلى من يحكم بينهم وبينها\n بأن يأمرهم بمجاهدتها أو قتلها إذا فريق منهم معرضون\n وإن يكن لهم الحق\n بأن وجدوا من يدلهم على البقاء مع عوائدها وشهواتها\n يأتوا إليه مذعنين\n أفي قلوبهم شك ووَهْم\n أم ارتابوا في وجود الطبيب\n أم يخافون أن يحيف الله عليهم؟ بأن يدلهم على من يتعبهم ولا يبرئهم\n حتى حسَّنوا الظن به والتجأوا إليه\n فلا يدلهم إلا على من يوصلهم إليه\n بل أولئك هم الظالمون لنفوسهم\n حيث حرموها الوصول\n وتركوها في أودية الشكوك والخواطر تجول\n قال الورتجبي: { وإذا دُعُوا إلى الله ورسوله } أي: دُعوا إلى مشاهدة الله بنعت المحبة والمعرفة\n وعبوديته بنعت الإخلاص\n ودُعُوا إلى رسوله بالمتابعة والموافقة في الشريعة والطريقة\n هـ\n ثم ذكر الفريق الثاني وهم المخلصون فقال: { إِنَّمَا كَانَ قَوْلَ ٱلْمُؤْمِنِينَ إِذَا دُعُوۤاْ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:31",
      "similarity": 0.11201292667986035
    },
    {
      "verse": "33:12",
      "similarity": 0.08675838334244343
    },
    {
      "verse": "2:10",
      "similarity": 0.08511250669777008
    },
    {
      "verse": "8:49",
      "similarity": 0.08369663208534459
    },
    {
      "verse": "47:20",
      "similarity": 0.07779858138701357
    }
  ]
}