{
  "chapter": "النور",
  "text": "واقيموا۟ الصلوة وءاتوا۟ الزكوة واطيعوا۟ الرسول لعلكم ترحمون",
  "translations": [
    {
      "translation": "Establish salat and pay zakat and obey the Messenger so that hopefully mercy will be shown to you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So observe your devotional obligations, pay the zakat, and obey the Apostle so that you may be shown mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, establish Salat, pay the Zakat dues and obey the Messenger; it is expected that you will be shown mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be steadfast in prayer, pay the religious tax and obey the Messenger so that perhaps you will receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep the prayer established and pay the obligatory charity and obey the Noble Messenger, in the hope of attaining mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform the Salah, and give the Zakah and obey the Messenger that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep up prayer and pay the poor-rate and obey the Apostle, so that mercy may be shown to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perform the prayer, and pay the alms, and obey the Messenger -- haply so you will find mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish worship and pay the poor-due and obey the messenger, that haply ye may find mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Attend to your prayers and pay the zakat and obey the Messenger, so that you may be shown mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And establish the prayer and give the poor-rate and obey the apostle, haply ye may be shewn mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maintain the prayer and give the zakat, and obey the Apostle so that you may receive [Allah’s] mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So establish regular Prayer and give regular Charity; and obey the Messenger; that ye may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform As-Salat (Iqamat-as-Salat), and give Zakat and obey the Messenger (Muhammad SAW) that you may receive mercy (from Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish the prayers, pay the charity, and obey the Messenger, in order to have mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pray regularly, and give regular charity, and obey the Messenger, so that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And establish prayer and give zakah and obey the Messenger - that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:56] And establish prayer and pay the alms, and obey the Messenger, that perhaps you may find mercy, that is to say, [do so] hoping for mercy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Establish worship) perform the five daily prayers (and pay the poor-due) from your wealth (and obey the messenger) in his judgement, (that haply ye may find mercy) and not be punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما جعلتم التوحيد الذاتي قبلة مقصدكم أيها المحمديون { أَقِيمُواْ ٱلصَّـلاَةَ } المثمرةَ المورثةَ لكم كمالَ الشوق المحبةَ نحو الحق دائماً { وَآتُواْ ٱلزَّكَـاةَ } المطهرةَ لنفوسكم عن الميل إلى ما سواه { وَأَطِيعُواْ ٱلرَّسُولَ } المرشدَ لكم إلى طريق التوحيد { لَعَلَّكُمْ تُرْحَمُونَ } [النور: 56] وتفوزون بما لا عينُ رأت ولا أذنُ سمعت ولا خطر على قلب بشر\n\n\n\n\nحققنا بما أنت راضٍ عنا يا خير الناصرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأطيعوا الرسولَ } فيما دعاكم إليه وأمركم به، ومن جملة ما أمر به: طاعة أمرائه وخلفائه لقوله: \" عليكم بسنتي، وسنَّة الخلفاء الراشدين من بعدي، عَضُّوا عليها بالنواجذ \" ، فمن امتنع من دفع الزكاة لخليفته - كما فعل أهل الردة - فقد كفر، ومن أداها إليه كما أمره الله فقد استوجب الرحمة، لقوله: { لعلكم تُرحمون } أي: لكي تُرحموا، فإنها من مُسْتَجلبَاتِ الرحمة\n والله تعالى أعلم\n الإشارة: سنة الله تعالى في خواصه: أن يُسلط عليهم في بدايتهم الخَلْقَ، فينُزل بهم الذلَ والفقرَ والخوفَ من الرجوع عن الطريق، ثم يُعزهم، ويُمكن لهم دينهم الذي ارتضى لهم، ويبدلهم من بعد خوفهم أمناً، كما قال الشاذلي رضي الله عنه: اللهم إن القوم قد حكمت عليهم بالذل حتى عزوا\n\n\n إلخ كلامه\n قال القشيري: وفي الآية إشارة إلى أئمة الدين، الذين هم أركان السُنَّة ودعائم الإسلام، الناصحون لعباد الله، الهادون من يسترشد في الله\n ثم قال: فأما حُفاظ الدين فهم الأئمة والعلماء الناصحون لدين الله، وهم أصناف: قومٌ هم حفَّاظُ أخبار الرسول صلى الله عليه وسلم، وحُفّاظُ القرآن، وهم بمنزلة الخزنة، وقوم هم علماء الأصول، الرادُّون على أهلِ العناد، وأصحاب الابتداع، بواضح الأدلة، وهم بطارِقَةُ الإسلام وشجعانُه، وقوم وهم الفقهاء المرجوعُ إليهم في علوم الشريعة وفي العبادات وكيفية المعاملات، وهم من الدين بمنزلة الوكلاء والمتصرفين في المُلْك، وآخرون هم أهل المعرفة وأصحاب الحقائق، وهم في الدِّين كخواص الملك وأعيان مجلس السلطان وأرباب الأسرار، الذين لا يبرحون في عالي مجلس السلطان، فالدين معمورٌ بهؤلاء على اختلافهم إلى يوم القيامة\n هـ\n تقدم ومثله في قوله:\n\n[التوبة: 122]\n والله تعالى أعلم\n ثم ذكر الفريق الثالث، وهم الكفرة ظاهراً وباطناً، فقال: { لاَ تَحْسَبَنَّ ٱلَّذِينَ كَفَرُواْ مُعْجِزِينَ\n\n\n }\n",
      "translations": []
    }
  ]
}