{
  "chapter": "النور",
  "text": "قل اطيعوا۟ الله واطيعوا۟ الرسول فان تولوا۟ فانما عليه ما حمل وعليكم ما حملتم وان تطيعوه تهتدوا۟ وما على الرسول الا البلغ المبين",
  "translations": [
    {
      "translation": "Say: 'Obey Allah and obey the Messenger. Then if they turn away he is only responsible for what he is charged with and you are responsible for what you are charged with. If you obey him. you will be guided.' The",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Obey God and obey the Apostle. If you turn away, then for him is his duty to fulfil, and for you the burden that you carry; yet if you obey him you will be rightly guided. The duty of the Messenger is to convey the message clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Obey Allah and obey the Messenger, but if you turn away, you should note it well that the Messenger is responsible for the duty entrusted to him and you are responsible for the duty entrusted to you. If you obey him, you will be rightly guided, for the responsibility of the Messenger is only to convey the Message clearly to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"Obey God and His Messenger. If you turn away, the Messenger and the people will each be responsible for their own obligations. If you follow the Messenger, you will have the right guidance. The responsibility of the Messenger is only to preach.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Obey Allah and obey the Noble Messenger; so if you turn away, then the Noble Messenger is bound only for what is obligatory upon him, and upon you is the duty placed upon you”; and if you obey the Noble Messenger, you will attain guidance; and the Noble Messenger is not liable except to plainly convey.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Obey Allah and obey the Messenger, but if you turn away, he is only responsible for the duty placed on him and you for that placed on you. If you obey him, you shall be on the right guidance. The Messenger's duty is only to convey (the Message) in a clear way.\") Allah says about the hypocrites who had promised the Messenger and sworn that if he were to command them to go out for battle, they would go:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Obey Allah and obey the Apostle; but if you turn back, then on him rests that which is imposed on him and on you rests that which is imposed on you; and if you obey him, you are on the right way; and nothing rests on the Apostle but clear delivering (of the message).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Obey God, and obey the Messenger; then, if you turn away, only upon him rests what is laid on him, and upon you rests what is laid on you. If you obey him, you will be guided. It is only for the Messenger to deliver the manifest Message.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Obey Allah and obey the messenger. But if ye turn away, then (it is) for him (to do) only that wherewith he hath been charged, and for you (to do) only that wherewith ye have been charged. If ye obey him, ye will go aright. But the messenger hath no other charge than to convey (the message) plainly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and obey the Messenger. If you turn away, then he is responsible for what he is charged with and you are responsible for what you are charged with. If you obey him, you will be rightly guided. The Messenger is responsible only for delivering the message clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: obey Allah and obey the apostle; then if ye turn away, upon him is only that wherewith he hath been laid upon, and upon you is that wherewith ye have been laid upon; if ye obey him, ye will be guided; and naught is upon the apostle except the preaching plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Obey Allah, and obey the Apostle.’ But if you turn your backs, [you should know that] he is only responsible for his burden and you are responsible for your own burden, and if you obey him, you will be guided, and the Apostle’s duty is only to communicate in clear terms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Obey Allah, and obey the Messenger: but if ye turn away, he is only responsible for the duty placed on him and ye for that placed on you. If ye obey him, ye shall be on right guidance. The Messenger's duty is only to preach the clear (Message).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Obey Allah and obey the Messenger, but if you turn away, he (Messenger Muhammad SAW) is only responsible for the duty placed on him (i.e. to convey Allah's Message) and you for that placed on you. If you obey him, you shall be on the right guidance. The Messenger's duty is only to convey (the message) in a clear way (i.e. to preach in a plain way).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Obey Allah and obey the Messenger. If you turn away, upon him only rests what is laid upon him, and upon you rests what is laid on you. If you obey him, you shall be guided. It is only for the Messenger to deliver a clear message'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Obey God and obey the Messenger.” But if they turn away, then he is responsible for his obligations, and you are responsible for your obligations. And if you obey him, you will be guided. It is only incumbent on the Messenger to deliver the Clarifying Message.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Obey Allah and obey the Messenger; but if you turn away - then upon him is only that [duty] with which he has been charged, and upon you is that with which you have been charged. And if you obey him, you will be [rightly] guided. And there is not upon the Messenger except the [responsibility for] clear notification.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:54] Say: ‘Obey God, and obey the Messenger.’ But if you turn away, from obedience to him (tawallaw, ‘you turn away’: one of the two tā’ letters [in tatawallaw] has been omitted; an address to them), [know that] he is only responsible for that with which he has been charged, of conveying [the Message], and you are responsible for that with which you have been charged, of obedience to him. And if you obey him, you will be [rightly] guided. And the Messenger’s duty is only to convey [the Message] clearly’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to 'Uthman: (Obey Allah) regarding the obligations (and obey the messenger) in his wont and judgement. (But if you turn away) but if they turn away from obeying both, (then (it is) for him (to do) only that wherewith he hath been charged) what he has been commanded to convey, (and for you (to do) only that wherewith you have been charged) what you have been commanded to respond. (If ye obey him) if you obey Allah in that which He commands you, (ye will go aright) and avoid error. (But the messenger hath no other charge than to convey (the message) plainly) from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل للناس على سبيل التبليغ العام، والراسلة المطلقة: { أَطِيعُواْ ٱللَّهَ } المظهرَ لكم من كتم العدم، وانقادوا لجميع أوامره ونواهيه { وَأَطِيعُواْ ٱلرَّسُولَ } المبعوثَ إليكم، وصدِّقوه في جميع ما جاء به من عند ربكم { فَإِن تَوَلَّوْاْ } وانصرفوا بعدما بلغتَ رسالتك حق التبليغ { فَإِنَّمَا عَلَيْهِ } أي: على سيدنا محمد صلى الله عليه وسلم جزاء { مَا حُمِّلَ } من التبليغ وإظهارِ الدعوة وتبيينِ الرسالة، { وَعَلَيْكُمْ } أيها السامعون جزاء { مَّا حُمِّلْتُمْ } من الامتثال والانقياد { وَ } اعلموا أيها المتوجهون نحو الحق { إِن تُطِيعُوهُ } أي: الرسولَ، وتصدقوا قوله، وتعلموا على مقتضى ما أُمرتم على لسانه { تَهْتَدُواْ } إلى معرفة ربكم وتفوزوا بتوحيده، { وَ } إن لم تطيعوا له، وتهتدوا إلى ما ُجبلتم لأجله { مَا عَلَى ٱلرَّسُولِ } المأمور بالدعوة والتبليغ { إِلاَّ ٱلْبَلاَغُ ٱلْمُبِينُ } [النور: 54] الظاهرُ الواضحُ؛ لئلا يشتبه عليكم أمر الدين، فإن امتثلتم بما سمتعتم منه فزتم، وإن توليتم فعليكم الوزر والوبال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل أطيعوا الله وأطيعوا الرسولَ } ، أُمِر - عليه الصلاة والسلام - بتبليغ ما خاطبهم الله به، وصرف الكلام عن الغيبة إلى الخطاب، وهو أبلغ في تبكيتهم، { فإِن تولَّوا } - بحذف إحدى التاءين بدليل قوله: { وعليكم } أي: فإن تُعرضوا عن الطاعة إثر ما أمرتكم بها { فإِنما عليه ما حُمِّلَ } من التبليغ وقد بلَّغَ، { وعليكم ما حُمِّلتم } من التلقي بالقبول والإذعان\n والمعنى: فإن تعرضوا عن الإيمان فما ضررتم إلا أنفسكم، فإن الرسول ليس عليه إلا ما حمله الله تعالى من أداء الرسالة، فإذا أدى فقد خرج عن عهدة تكليفه\n\n\nوأما أنتم فعليكم ما كلفتم، أي: ما أمرتم به من الطاعة والإذعان، فإن لم تفعلوا وتوليتم فقد عرَّضتم نفوسكم لسخط الله وعقوبته\n قال القشيري: قل يا محمد: أطيعوا الله، فإن أجابوا، سعدوا في الدارين، وإنما أحسنوا لأنفسهم\n وإن تولوا فما أضروا إلا بأنفسهم، ويكون اللوم في المستقبل عليهم، وسوف يلقون سوء عواقبهم\n هـ\n { وإن تُطيعوه } فيما أمركم به من الهدى { تهتدوا } إلى الحق، الذي هو المقصد الأصلي الموصل إلى كل خير، والمنجي من كل شر، { وما على الرسول إلا البلاغُ المبين } الموضح لكل ما يحتاج إلى الإيضاح، أو: البيِّن الوضوح لكونه مقروناً بالآيات والمعجزات المتواترة\n والجملة مقررة لما قبلها من أن غائلة التولي وفائدة الإطاعة مقصورتان عليهم\n واللام: إما للجنس المنتظم فيه - عليه الصلاة والسلام - انتظاماً أولياً، أو للعهد، أي: ما على جنس الرسول كائناً من كان، أو ما عليه - عليه الصلاة والسلام - إلا التبليغ الواضح\n وبالله التوفيق\n الإشارة: ترى بعض الناس يُقسمون بالله جهد أَيْمَانهم: لئن ظهر شيخ التربية وأمرهم بالخروج عن أموالهم وأنفسهم ليخرجن، فلما ظهر تولوا وأعرضوا، فيقال لهم: فإن تولوا فإنما عليه ما حُمِّل من الدلالة على الله، والتعريف به، وعليكم ما حُملتم من الدخول تحت تربيته، وإن تُطيعوه تهتدوا إلى معرفة الله بالعيان، وما على الرسول إلا البلاغ المبين\n ثم وعد أهل الإخلاص بالنصر والتمكين، فقال: { وَعَدَ ٱللَّهُ ٱلَّذِينَ آمَنُواْ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:12",
      "similarity": 0.7284270568510738
    },
    {
      "verse": "16:82",
      "similarity": 0.5547155354280303
    },
    {
      "verse": "36:17",
      "similarity": 0.4821663267473943
    },
    {
      "verse": "5:92",
      "similarity": 0.46271924407139703
    },
    {
      "verse": "29:18",
      "similarity": 0.4391222864642722
    }
  ]
}