{
  "chapter": "النور",
  "text": "ومن يطع الله ورسوله ويخش الله ويتقه فاو۟لئك هم الفائزون",
  "translations": [
    {
      "translation": "All who obey Allah and His Messenger and have awe of Allah and taqwa of Him, they are the ones who are victorious.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever obeys God and His Prophet, fears God and does his duty to Him, will surely find success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and only those attain true success who obey Allah and His Messenger and fear Allah and refrain from His disobedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who obey God and His Messenger, who are humble before Him, and who have fear of Him will, certainly, be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever obeys the command of Allah and His Noble Messenger, and fears Allah, and practices piety – so it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever obeys Allah and His Messenger, fears Allah, and has Taqwa of Him, such are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who obeys Allah and His Apostle, and fears Allah, and is careful of (his duty to) Him, these it is that are the achievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso obeys God and His Messenger, and fears God and has awe of Him, those -- they are the triumphant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who obeyeth Allah and His messenger, and feareth Allah, and keepeth duty (unto Him): such indeed are the victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who obey God and His Messenger, and fear God, and are mindful of their duty to Him, are the ones who will triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever obeyeth Allah and His apostle, and dreadeth Allah and feareth him-these! they are the achievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever obeys Allah and His Apostle, and fears Allah and is wary of Him—it is they who will be the triumphant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is such as obey Allah and His Messenger, and fear Allah and do right, that will win (in the end),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever obeys Allah and His Messenger (SAW), fears Allah, and keeps his duty (to Him), such are the successful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who obey Allah and His Messenger, and fear Allah, and have awe of Him, shall be the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever obeys God and His Messenger, and fears God, and is conscious of Him—these are the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever obeys Allah and His Messenger and fears Allah and is conscious of Him - it is those who are the attainers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:52] And he who obeys God and His Messenger, and fears God and fears Him (read yattaqh or yattaqhi), by being obedient to Him, those, they are the winners, of Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And Allah also revealed about 'Uthman Ibn 'Affan when he said: \"0 Messenger of Allah! If you so wish, I will give up all my wealth\" and so Allah said: (He who obeyeth Allah and His messenger) in His judgement, (and feareth Allah) in that which has passed, (and keepeth duty (unto Him)) in the future: (such indeed are the victorious) they have gained Paradise and are saved from the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { مَن يُطِعِ ٱللَّهَ } حق إطاعته وينقاد { وَرَسُولَهُ } حق الانقياد والاتِّباع { وَيَخْشَ ٱللَّهَ } المنتقمَ فيما صدر عنه\n ومضى عليه من الذنوب بعدما تاب وندم { وَيَتَّقْهِ } عنه سبحانه فيما بقي من عمره { فَأُوْلَـٰئِكَ } المطيعون المنقادون بالله ورسوله\n الخاشعون المخبتون المتقون { هُمُ } المتقون { ٱلْفَآئِزُون } [النور: 52] بالمثوبة العظمى والدرجة العليا عند الله\n[يونس: 62]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن يُطع الله ورسولَه } ، هذا استئناف جيء به لتقرير ما قبله من حسن حال المؤمنين، وترغيب مَن عَدَاهم في الانتظام في سلكهم، أي: ومن يُطع الله ورسوله، كائناً من كان، فيما أمَرَا به من الأحكام الشرعية اللازمة والمتعدية، وقيل: من يطع الله في فرائضه، ورسولَهُ في سننه\n { ويَخْشَ الله } على ما مضى من ذنوبه، { ويتَّقه } فيما يستقبل من عمره، { فأولئك } الموصوفون بما ذكر من الطاعة والخشية، والاتقاء، { هم الفائزون } بالنعيم المقيم، لاَ مَنْ عَدَاهُم\n وعن بعض الملوك: أنه سأل عن آية كافية، فتُليت عليه هذه الآية\n وهي جامعة لأسباب الفوز\n قال القرطبي: ذكر أسلم: أن عمر بينما هو قائم في مسجده صلى الله عليه وسلم فإذا رجل من دهاقين الروم قائم على رأسه، وهو يقول: أشهد أن لا إله إلا الله، وأشهد أن محمداً رسول الله، فقال له عمر: ما شأنك؟ قال: أسلمت، قال: ألهذا سبب؟ قال: نعم إني قرأت التوراة والزبور والإنجيل، وكثيراً من كتب الأنبياء، فسمعت أسيراً يقرأ آية من القرآن، جمع فيها كل ما في الكتب المتقدمة، فعلمت أنه من عند الله، فأسلمت\n قال: ما هذه الآية؟ قال قوله تعالى: { ومن يُطع الله } في الفرائض، { ورسولَه } في السنن، { ويَخْشَ الله } فيما مضى من عمره، { ويتَّقه } فيما بقي، { فاولئك هم الفائزون } والفائز: من نجا من النار واُدْخِل الجنة، فقال عمر: قال النبي صلى الله عليه وسلم:\n\n \" أُعطيتُ جوامع الكلم \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:31",
      "similarity": 0.678532344241346
    },
    {
      "verse": "37:60",
      "similarity": 0.5931350312277017
    },
    {
      "verse": "40:9",
      "similarity": 0.5817651198308627
    },
    {
      "verse": "44:57",
      "similarity": 0.5573473426655775
    },
    {
      "verse": "33:71",
      "similarity": 0.545615746760745
    }
  ]
}