{
  "chapter": "النور",
  "text": "واقسموا۟ بالله جهد ايمنهم لئن امرتهم ليخرجن قل لا تقسموا۟ طاعة معروفة ان الله خبيرۢ بما تعملون",
  "translations": [
    {
      "translation": "They have sworn by Allah with their most earnest oaths that if you give them the command, they will go out. Say: 'Do not swear. Honourable obedience is enough. Allah is aware of what you do.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear solemnly by God: \"If you command us we shall go forth.\" Say: \"Do not swear. What is wanted is obedience, as should be. God is certainly aware of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the hypocrites) solemnly swear by Allah and say, \"If you order us, we will leave our homes.\" Say to them, \"Do not swear oaths for your `obedience' is well known; Allah is fully aware of what you are doing. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They strongly swear by God that they would march to fight (for the cause of God) if you were to order them to. Tell them, \"You do not need to swear; fighting for the cause of God is a virtuous deed and God is Well Aware of what you do\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swore by Allah most vehemently in their oaths that if you order them, they will go forth to holy war; say, “Do not swear; obedience according to the law is required; indeed Allah knows what you do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah their strongest oaths that if only you would order them, they would leave. Say: \"Swear you not; obedience is known. Verily, Allah knows well what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah with the most energetic of their oaths that if you command them they would certainly go forth. Say: Swear not; reasonable obedience (is desired); surely Allah is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have sworn by God the most earnest oaths, if thou commandest them they will go forth. Say: 'Do not swear; honourable obedience is sufficient. Surely God is aware of the things you do.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah solemnly that, if thou order them, they will go forth. Say: Swear not; known obedience (is better). Lo! Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear firm oaths by God that if you command them to march forth, they will obey you. Say, \"Do not swear: your obedience, not your oaths, will count. God is well aware of all your actions.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah with their solemn oaths that, if thou commandest them they will surely go forth. Say thou: swear not, obedience is recognize! verily Allah is Aware of that which ye Work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah with solemn oaths that if you order them they will surely march out. Say, ‘Do not swear! Honourable obedience [is all that is expected of you]. Allah is indeed well aware of what you do.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear their strongest oaths by Allah that, if only thou wouldst command them, they would leave (their homes). Say: \"Swear ye not; Obedience is (more) reasonable; verily, Allah is well acquainted with all that ye do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah their strongest oaths, that if only you would order them, they would leave (their homes for fighting in Allah's Cause). Say: \"Swear you not; (this) obedience (of yours) is known (to be false). Verily, Allah knows well what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah in the most earnest oaths, that if you order them, they would go forth. Say: 'Do not swear, known obedience (is better). Allah is Aware of the things you do'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by God with their solemn oaths, that if you commanded them, they would mobilize. Say, “Do not swear. Obedience will be recognized. God is experienced with what you do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah their strongest oaths that if you ordered them, they would go forth [in Allah 's cause]. Say, \"Do not swear. [Such] obedience is known. Indeed, Allah is Acquainted with that which you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:53] And they swear by God solemn oaths that if you order them, to [participate in the] struggle, they will surely go forth. Say, to them: ‘Do not swear! Acknowledged obedience, to the Prophet is better than the oaths to which you are not true. Surely God is Aware of what you do’, when you say you will obey but act otherwise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They swear by Allah solemnly) 'Uthman swore solemnly by Allah (that, if thou order them, they will go forth) he will give up all his wealth. (Say) to them, Muhammad: (Swear not; known obedience (is better)) if you do so it is a known obedience, but you should obey Allah in relation to that which you have been commanded. (Lo! Allah is Informed of what ye do) of good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَّ تُقْسِمُواْ } معناه لا تَحلِفوا\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, “Do not { swear }” its meaning is “Do not covenant.”",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من خباثة بواطنهم أهل الشرك والشقاق\n وشدة شيكمتهم ونفاقهم معك يا أكمل الرسل: { أَقْسَمُواْ بِٱللَّهِ } تروجياً لنفاقهم وتغريراً للمؤمنين { جَهْدَ أَيْمَانِهِمْ } وغاية حلفهم\n مبالغين فيها\n مغلظين منكرين للامتناع عن حكم الرسول بقولهم\n واللهِ { لَئِنْ أَمَرْتَهُمْ } يا أكمل الرسل\n أي: المنافقين بالخروج عن الديار\n والجلاء عن الوطن { لَيَخْرُجُنَّ } عنها بلا مطلٍ وتسويفٍ\n ممتثلين أمرك\n فيكف يتأتى منا الامتناع عن حكمك وما هو إلا من غاية تلبيسهم ونافقهم\n\n\n{ قُل } لهم يا أكمل الرسل بعدما تيقنتَ نفاقَهم بالهامٍ منا إليك ووحي: { لاَّ تُقْسِمُواْ } بالله أيها المسرفون المفرطون\n ولا تبالغوا في الحلف الكاذب\n فإن المطلوب منكم { طَاعَةٌ مَّعْرُوفَةٌ } مشهورةُ بين الناس بلا إتيان مخالفةٍ منكم ظاهراً\n وأمَّا أمر بواطنكم وقلوبكم فسَّرُّه عند الله { إِنَّ ٱللَّهَ } المطلعَ لسرائركم وضمائركم { خَبِيرٌ بِمَا تَعْمَلُونَ } [النور: 53] وتقصدون في نفوسكم\n يجازيكم على مقتضى خبرته\n\n\n{ قُلْ } يا أكمل الرسل للناس على سبيل التبليغ العام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جهد: مصدر مؤكد لفعله\n الذي هو حيز النصب على الحال\n من فاعل \" أقسموا \" \n ومعنى جَهْدِ اليمين: بلوغ غايتها بطريق الإستعارة\n من قولهم: جهد نفسه: إذا بلغ أقصى وسعها وطاقتها\n وأصل أقسم جهد اليمين: أقسم بجهدِ اليمين جَهداً\n فحذف الفعل وقدم المصدر\n فوضع موضعه مضافاً إلى المفعول\n كقوله:\n[محمد: 5] وحكم هذا المنصوب حكم الحال\n كأنه قال: أقسموا جاهدين أيمانهم\n وطاعة: مبتدأ حذف خبره\n أي: طاعة معروفة أولى من تسويفكم\n أو: خبر عن محذوف\n أي: الذي يطلب منكم طاعة معروفة\n يقول الحق جل جلاله: { وأَقْسَموا } أي: المنافقون { بالله جَهْدَ أَيمانهم } أي: بلغوا فيها غاية وسعهم\n بأن حلفوا بالله\n وعن ابن عباس رضي الله عنه: من حلف بالله فقد جهد يمينه\n { لئن أمرتهم ليخرجُنَّ } أي: قالوا: لئن أمرنا محمد بالخروج للغزو\n أو من ديارنا وأموالنا\n لخرجنا\n وحيث كانت مقالتهم هذه كاذبة ويمينهم فاجرة أمر عليه الصلاة والسلام - بردها حيث قيل: { قل لا تُقسموا } أي: قل رداً عليهم\n وزجراً عن التفوه بها: لا تحلفوا وأنتم كاذبون\n { طاعةٌ معروفة } \n تعليل للنهي\n أي: لا تُقسموا على ما تدعون من الطاعة لأن طاعتكم طاعة نفاقية\n معروفة بالنفاق\n واقعة باللسان فقط من غير مواطأة للقلب\n وإنما عبّر عنها بمعروفة للإيذان بأن كونها نفاقية مشهور معروف لكل أحد\n وحملها على الطاعة الحقيقية\n على حذف المبتدأ أو الخبر\n مما لا يساعده المقام\n انظر أبا السعود\n قال القشيري: طاعة في الوقت أولى من تسويفٍ في الوعد\n ولا تعِدُوا بما هو معلوم أنكم لا تفوا به\n هـ\n وقال النسفي: طاعة معروفة أمثل وأولى بكم من هذه الأيمان الفاجرة\n أو: الذي يطلب منكم طاعة معروفة معلومة لا يُشك فيها ولا يُرتاب\n كطاعة الخُلص من المؤمنين\n لا أيمان تقسمونها بأفواهكم\n وقلوبُكُم على خلافها\n هـ\n { إن الله خبير بما تعملون } من الأعمال الظاهرة والباطنة\n التي من جملتها ما تظهرونه من الأكاذيب المؤكدة بالأيمان الفاجرة\n وما تضمرونه في قلوبكم من الكفر والنفاق\n والعزيمة على مخادعة المؤمنين\n وغيرها من فنون الفساد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:109",
      "similarity": 0.6334589760564061
    },
    {
      "verse": "16:38",
      "similarity": 0.48657164361353145
    },
    {
      "verse": "5:53",
      "similarity": 0.47993653048267376
    },
    {
      "verse": "35:42",
      "similarity": 0.4735316911274839
    },
    {
      "verse": "47:31",
      "similarity": 0.4322880413180809
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/24:53.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/24:53.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:53.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}