{
  "chapter": "النور",
  "text": "واذا بلغ الاطفل منكم الحلم فليستـذنوا۟ كما استـذن الذين من قبلهم كذلك يبين الله لكم ءايته والله عليم حكيم",
  "translations": [
    {
      "translation": "Once your children have reached puberty, they should ask your permission to enter as those before them also asked permission. In this way Allah makes His Signs clear to you. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your children have reached the age of puberty, they should similarly ask your leave (for entering) as others did before them. God thus clearly explains His commands to you, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your children have grown sex conscious, they should receive your permission for this just as their elders get permission. In this way Allah makes His Revelations plain to you for He is All-Knowing, AllWise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your children become mature, they must ask your permission before entering your house, as the rest of the mature people do. Thus does God explain to you His revelations. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the boys among you reach adulthood, then they too must seek permission like those before them had sought; this is how Allah explains His verses for you; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the children among you come to puberty, then let them (also) ask for permission, as those senior to them (in age) ask permission. Thus Allah makes clear His Ayat for you. And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the children among you have attained to puberty, let them seek permission as those before them sought permission; thus does Allah make clear to you His communications, and Allah is knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your children reach puberty, let them ask leave, as those before them asked leave. So God makes clear to you His signs; and God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the children among you come to puberty then let them ask leave even as those before them used to ask it. Thus Allah maketh clear His revelations for you. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your children have reached the age of puberty, let them still ask permission as their elders do. Thus God expounds to you His revelations: God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the children among you attain puberty, then let them ask leave even as those before them asked leave. In this wise Allah expoundeth unto you His commandments; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your children reach puberty, let them ask permission [at all times] just as those [who grew up] before them asked permission. Thus does Allah clarify His signs for you, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the children among you come of age, let them (also) ask for permission, as do those senior to them (in age): Thus does Allah make clear His Signs to you: for Allah is full of knowledge and wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the children among you come to puberty, then let them (also) ask for permission, as those senior to them (in age). Thus Allah makes clear His Ayat (Commandments and legal obligations) for you. And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when children reach the age of puberty, let them ask permission as those before them asked permission. As such Allah makes clear to you His verses. Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the children among you reach puberty, they must ask permission, as those before them asked permission. God thus clarifies His revelations for you. God is Knowledgeable and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the children among you reach puberty, let them ask permission [at all times] as those before them have done. Thus does Allah make clear to you His verses; and Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:59] And when the children among you, O free men, reach puberty, let them seek permission, at all times, just as those, [now] older free men, sought permission before them. So God clarifies His signs for you, and God is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned only older children and slaves, saying: (And when the children among you come to puberty) whether they are your own children or your slaves (then let them ask leave) at all times (even as those before them) of their brothers who were mentioned before (used to ask it. Thus Allah maketh clear His revelations) His commands and prohibitions as He explained this (for you. Allah is knower) He knows what is good for you, (Wise) He decreed that older people must ask permission at all times.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كذا { إِذَا بَلَغَ ٱلأَطْفَالُ مِنكُمُ ٱلْحُلُمَ } وظهر منهم أمارات الميل والشهوة سواء كانوا ذكوراً أم إناث { فَلْيَسْتَأْذِنُواْ كَمَا ٱسْتَأْذَنَ ٱلَّذِينَ مِن قَبْلِهِمْ } من الأحرار البالغين\n إذ هم حينئذ دخلوا في حكمهم بعد الحلم { كَذٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمْ آيَاتِهِ } الدالةَ على آداب خلطتكم وحسن معاشرتكم { وَٱللَّهُ } المصلحُ لأحوال عباده { عَلِيمٌ } بما في ضمائرهم من المنكرات { حَكِيمٌ } [النور: 59] في دفعها قبل وقوعها\n\n\n{ وَٱلْقَوَاعِدُ مِنَ } عجائز { ٱلنِّسَآءِ ٱلَّلاَتِي } قعدن عن الحيض والحبل وشهوة الوقاع مطلقاً إلى حيث { لاَ يَرْجُونَ نِكَاحاً } وزواجاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا بلغ الأطفالُ منكم } أي: الأحرار دون المماليك { الحُلُمَ } أي: الاحتلام\n وهو البلوغ\n وأرادوا الدخول عليكم { فَلْيَستأذِنوا } في جميع الأوقات\n قال القرطبي: لم يقل: { فليستأذنوكم } \n وقال في الأولى: { ليستأذنكم } لأن الأطفال غير مخاطبين ولا متعبَدين\n هـ\n قلت: فالمخاطبون في الأولى هم الأولياء بتعليمهم الاستئذان وإيصائهم به\n وهنا صاروا بالغين\n فأمرهم بالاستئذان { كما استأذن الذين من قبلهم } أي: الذين بلغوا الحُلُم مِن قبلهم\n وهم الرجال المذكورون في قوله:\n\n[النور: 27] الآية\n والمعنى: أن الأطفال مأذون لهم في الدخول بغير إذن\n إلا في العورات الثلاث\n فإذا اعتاد الأطفال ذلك ثم بلغوا الحُلُمَ وَجَبَ أن يُفطَمُوا عن تلك العادة\n ويُحملوا على أن يَسْتَأْذِنوا في جميع الأوقات\n كالرجال الكبار الذين لم يعتادوا الدخول عليكم إلا بإذن\n والناس عن هذه غافلون\n عن ابن عباس رضي الله عنه: ثلاث آيات جحدهن الناس: الإذن كله\n وقوله:\n[الحجرات: 13]\n وقوله:\n[النساء: 8]\n وعن سعيد بن جبير: يقولون: إنها منسوخة\n والله ما هي بمنسوخة\n وعن ابن عباس أيضاً قال: إنما أُمروا بها حين لم يكن للبيوت الستر\n فلما وجدوا ذلك استغنوا عن الاستئذان\n وعن أبي محمد مكي: هذا الأمر إنما كان من الله للمؤمنين إذ كانت البيوت بغير أبواب\n قلت: أما باعتبار الأجانب فالأبواب تكفي\n وأما باعتبار المماليك والأطفال الذين يلجون الدار من غير حَجْرٍ فلا تكفي الأبواب في حقهم\n فلا بد من الاستئذان كما في الآية\n { كذلك } أي: مثل ذلك البيان العجيب { يُبين الله لكم آياته }\n قال ابْنُ عرفة: قال قبل هذه وبعدها: الآيات\n وفي هذه: آياته لوجهين\n الأول: هذه خاصة بالأطفال\n وما قبلَها عامة في العبيد والأطفال\n فأطلقت الآية\n ولم تقيد بالإضافة\n وهذه خاصة\n فعبّر عنها بلفظ خاص\n الثاني: أن الخطاب بما هنا للبالغين\n فأسند فيه الحكم إلى الله تعالى\n تخويفاً لهم وتشديداً عليهم\n هـ\n والمتبادر أنه تفنن\n قاله المحشي الفاسي\n { والله عليمٌ حكيم } فيما أمر ودبر\n الإشارة: إنما أمر الله بالاستئذان لئلا يُكشف السر إلى غير أهله غَيْرَةً منه تعالى على كشف أسرار عباده\n وإذا كان غار على كشف سر عبد\n فَغَيْرَتُهُ على كشف أسرار ذاته أولى وأحرى\n فيجب كتم أسرار الذات عن غير أهله\n وكل من خصه الله بسر وجب كتمه إلا على من هو أهل له\n وهو من أَعْطَى نفسه وماله\n وباعهما لله تعالى\n وكل من أُطْلِعَ على سر من أسرار الله أو قضاء من قضائه\n ثم استشرف أن يُعْلِم الناس بذلك فهو كذاب\n وفي الحِكَم: \" استشرافك أن يعلم الخلق بخصوصِيَّتِكَ دليل على عدم صدقك في عبوديتك \"\n وبالله التوفيق\n ثم رخّص للعجائز في عدم التستر من الرجال فقال: { وَٱلْقَوَاعِدُ مِنَ ٱلنِّسَآءِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:67",
      "similarity": 0.4280222168543075
    },
    {
      "verse": "22:59",
      "similarity": 0.2426812603985567
    },
    {
      "verse": "52:32",
      "similarity": 0.23025796322649997
    },
    {
      "verse": "37:101",
      "similarity": 0.20766714875905465
    },
    {
      "verse": "2:263",
      "similarity": 0.2043286602707915
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/24:59.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/24:59.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/24:59.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}