{
  "chapter": "النور",
  "text": "والذين يرمون ازوجهم ولم يكن لهم شهداء الا انفسهم فشهدة احدهم اربع شهدتۭ بالله انه لمن الصدقين",
  "translations": [
    {
      "translation": "Those who make an accusation against their wives and have no witnesses except themselves, such people should testify four times by Allah that they are telling the truth",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accuse their wives and do not have any witnesses except themselves, should swear four times in the name of God, the testimony of each such person being that he is speaking the truth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who accuse their own wives but have no witness except themselves, the evidence of one of them is that he shall swear four times by Allah and declare that he is true (in his charge).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accuse their spouses of committing adultery but have no witness except themselves, should testify four times saying, \"God is my witness that I am telling the truth\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accuse their wives and do not have witnesses except their own statements – for such the testimony is that he bear the testimony four times by the name of Allah that he is truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for those who accuse their wives, but have no witnesses except themselves, let the testimony of one of them be four testimonies by Allah that he is one of those who speak the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who accuse their wives and have no witnesses except themselves, the evidence of one of these (should be taken) four times, bearing Allah to witness that he is most surely of the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who cast it up on their wives having no witnesses except themselves, the testimony of one of them shall be to testify by God four times that he is of the truthful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who accuse their wives but have no witnesses except themselves; let the testimony of one of them be four testimonies, (swearing) by Allah that he is of those who speak the truth;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who accuses his wife and has no witnesses except himself shall swear four times by God that his charge is true,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who accuse their wives and there are not for them witnesses except themselves, the testimony of one of them shall be four testimonies by Allah: that verily he is of the truth-tellers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who accuse their wives [of adultery], but have no witnesses except themselves, the testimony of such a man shall be a fourfold testimony [sworn] by Allah that he is indeed stating the truth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for those who launch a charge against their spouses, and have (in support) no evidence but their own,- their solitary evidence (can be received) if they bear witness four times (with an oath) by Allah that they are solemnly telling the truth;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for those who accuse their wives, but have no witnesses except themselves, let the testimony of one of them be four testimonies (i.e. testifies four times) by Allah that he is one of those who speak the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accuse their wives and have no witnesses except themselves, let them testify by swearing by Allah four times that he is of the truthful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who accuse their own spouses, but have no witnesses except themselves, the testimony of one of them is equivalent to four testimonies, if he swears by God that he is truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accuse their wives [of adultery] and have no witnesses except themselves - then the witness of one of them [shall be] four testimonies [swearing] by Allah that indeed, he is of the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:6] And those who accuse their wives, of fornication, but have no witnesses, to [substantiate] this, except themselves — which happened with some Companions — then the testimony of one of them (fa-shahādatu ahadihim, the subject) shall be to testify [swearing] by God four times (araba‘a shahādātin, is in the accusative as a verbal noun) that he is indeed being truthful, in accusing his wife of committing fornication,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for those who accuse their wives) of committing adultery (but have no witnesses) for their accusation (except themselves; let the testimony of one of them be four testimonies, (swearing) by Allah) other than Whom there is no god (that he is of those who speak the Truth) about his accusation of his wife;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ } بالزنا { وَلَمْ يَكُنْ لَّهُمْ شُهَدَآءُ } حضراءُ عندهم { إِلاَّ أَنفُسُهُمْ } أي: غير أنفسهم { فَشَهَادَةُ أَحَدِهِمْ } صارت وتقاوت { أَرْبَعُ شَهَادَاتٍ } في إسقاط حدِّ القذف عنهم منزلةَ أربع شهاداتٍ مؤدياتٍ { بِٱللَّهِ } متعلقات بهذا المدعى\n وهي { إِنَّهُ } أي: الزوج المدعي { لَمِنَ ٱلصَّادِقِينَ } [النور: 6] في دعوى الزنا بلا افتراءٍ منه ومراءٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: إلا أنفسهم: بدل من شهداء\n أو صفة له\n على أن إلا بمعنى غير\n و فشهادة: مبتدأ\n والخبر محذوف\n أي: واجبة\n أو: تدرأ عنه العذاب\n أو: خبر عن محذوف\n أي: فالواجب شهادة أحدهم\n وأنَّ\n في الموضعين: مخففة\n وَمَنْ شَدَّدَ فعلى الأصل\n والخامسة: مبتدأ و أنَّ غَضَبَ: خبر\n وقرأ حفص بالنصب\n أي: ويشهد الشهادة الخامسة\n يقول الحق جل جلاله: { والذين يرمون أزواجهم } أي: يقذفون زوجاتهم بالزنا\n { ولم يكن لهم شهداءُ } أي: لم يكن لهم على تصديق قولهم من يشهد لهم به { إلا أنفسهُمُ } \n جُعِلوا من جملة الشهداء إيذاناً بعدم قبول قولهم بالمرة\n { فشهادةُ أحدهم } أي: فالواجب شهادة أحدهم { أربعُ شهادات بالله } يقول أشهد بالله { إنه لمن الصادقين } فيما رماها به من الزنا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:17",
      "similarity": 0.6507839329172377
    },
    {
      "verse": "77:32",
      "similarity": 0.5576129282511373
    },
    {
      "verse": "24:4",
      "similarity": 0.5366597113491525
    },
    {
      "verse": "24:23",
      "similarity": 0.5229422516582374
    },
    {
      "verse": "4:112",
      "similarity": 0.4290512010864506
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/24:6.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/24:6.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}