{
  "chapter": "النور",
  "text": "ليس على الاعمى حرج ولا على الاعرج حرج ولا على المريض حرج ولا على انفسكم ان تاكلوا۟ منۢ بيوتكم او بيوت ءابائكم او بيوت امهتكم او بيوت اخونكم او بيوت اخوتكم او بيوت اعممكم او بيوت عمتكم او بيوت اخولكم او بيوت خلتكم او ما ملكتم مفاتحه او صديقكم ليس عليكم جناح ان تاكلوا۟ جميعا او اشتاتا فاذا دخلتم بيوتا فسلموا۟ على انفسكم تحية من عند الله مبركة طيبة كذلك يبين الله لكم الءايت لعلكم تعقلون",
  "translations": [
    {
      "translation": "There is no objection to the blind, no objection to the lame, no objection to the sick nor to yourselves if you eat in your own houses or your fathers' houses or your mothers' houses or your brothers' houses or your sisters' houses or the houses of your paternal uncles or paternal aunts or the houses of your maternal uncles or maternal aunts or places to which you own the keys or those of your friends. There is nothing wrong in your eating together or eating separately. And when you enter houses greet one another with a greeting from Allah, blessed and good. In this way Allah makes the Signs clear to you so that hopefully you will use your intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no harm if the blind, the lame, the sick, or you yourselves, eat in your own houses or the houses of your fathers, mothers, or your brothers' houses, or those of your sisters, or your fathers' brothers' or sisters', or your mothers' brothers' or sisters', or in the houses whose care is entrusted to you, or the houses of your friends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no harm if a blind or a lame or a sick person (takes a meal at another's house): nor is there any harm for yourselves if you take meals at your own houses or at the houses of your fathers and grandfathers or at the houses of your mothers and grandmothers or at your brothers' houses or at your sisters' houses or at the houses of your paternal uncles or at the houses of your paternal aunts or at the houses of your maternal uncles or at the houses of your maternal aunts or from the houses whose keys are in your possession or at the houses of your friends. There is no harm if you take your meals together or separately; however, when you enter the houses, you should send greetings of peace on your people, for the prayer of greetings prescribed by Allah is blessed and pure. Thus Allah makes His Revelation's clear to you. It is expected that you will use your common sense to grasp these.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no sin for the blind, the lame, the sick ones, and yourselves to eat at your own homes, or the homes of your father, mothers, brothers, sisters, your paternal and maternal uncles, aunts, or at the homes of your friend, and the homes with which you are entrusted. It makes no difference whether you eat all together or one person at a time. When you enter a house, say the blessed greeting which God has instructed you to say. Thus does God explain to you His revelations so that perhaps you will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no restriction upon the blind nor any restraint upon the lame nor any constraint upon the sick nor on any among you if you eat from your houses, or the houses of your fathers, or the houses of your mothers, or the houses of your brothers, or the houses of your sisters, or the houses of your fathers’ brothers, or the houses of your fathers’ sisters, or the houses of your mothers’ brothers, or the houses of your mothers’ sisters, or from the houses you are entrusted the keys of, or from the house of a friend – there is no blame upon you if you eat together or apart; therefore when you enter the houses, say greetings to your people – the excellent prayer at the time of meeting, from Allah, blessed and pure; this is how Allah explains the verses to you in order that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no restriction on the blind, nor any restriction on the lame, nor any restriction on the sick, nor on yourselves, if you eat from your houses, or the houses of your fathers, or the houses of your mothers, or the houses of your brothers, or the houses of your sisters, or the houses of your father's brothers, or the houses of your father's sisters, or the houses of your mother's brothers, or the houses of your mother's sisters, or (from that) whereof you hold keys, or (from the house) of a friend. No sin on you whether you eat together or apart. But when you enter the houses, greet one another with a greeting from Allah, blessed and good. Thus Allah makes clear the Ayat to you that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on the blind man, nor is there blame on the lame, nor is there blame on the sick, nor on yourselves that you eat from your houses, or your fathers' houses or your mothers' houses, or your brothers' houses, or your sisters' houses, or your paternal uncles' houses, or your paternal aunts' houses, or your maternal uncles' houses, or your maternal aunts' houses, or what you possess the keys of, or your friends' (houses). It is no sin in you that you eat together or separately. So when you enter houses, greet your people with a salutation from Allah, blessed (and) goodly; thus does Allah make clear to you the communications that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no fault in the blind, and there is no fault in the lame, and there is no fault in the sick, neither in yourselves, that you eat of your houses, or your fathers' houses, or your mothers' houses, or your brothers' houses, or your sisters' houses, or the houses of your uncles or your aunts paternal, or the houses of your uncles or your aunts maternal, or that whereof you own the keys, or of your friend; there is no fault in you that you eat all together, or in groups separately. But when you enter houses, greet one another with a greeting from God, blessed and good. So God makes clear to you the signs; haply you will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No blame is there upon the blind nor any blame upon the lame nor any blame upon the sick nor on yourselves if ye eat from your houses, or the houses of your fathers, or the houses of your mothers, or the houses of your brothers, or the houses of your sisters, or the houses of your fathers' brothers, or the houses of your fathers' sisters, or the houses of your mothers' brothers, or the houses of your mothers' sisters, or (from that) whereof ye hold the keys, or (from the house) of a friend. No sin shall it be for you whether ye eat together or apart. But when ye enter houses, salute one another with a greeting from Allah, blessed and sweet. Thus Allah maketh clear His revelations for you, that haply ye may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no harm if the blind, the lame, the sick or you yourselves eat in your own houses, or in the houses of your fathers, or mothers, or brothers, or sisters, or paternal uncles, or paternal aunts, or maternal uncles, or maternal aunts, or in those that you are in charge of or in the house of a friend. There is no objection to your eating together or separately. But when you enter houses, salute one another with a greeting of peace, a greeting from your Lord full of blessings and purity. Thus does God expound to you His commandments, so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No restriction is there upon the blind, nor is there the restriction upon a lame, nor is there a restriction upon the sick. nor upon yourselves that ye eat in your houses or the houses of your fathers or the houses of your mothers or the houses of your brothers or the houses of your sisters or the houses of your fathers brothers or the houses of your fathers sisters or the houses of your mothers brothers or the houses of your mothers sisters or from that house where of ye own the keys or from the house of a friend. No fault is there upon you whether ye eat together or in separate groups, Then when ye enter houses, salute each other with a greeting from before Allah, blest and goodly. Thus Allah expoundeth unto you the revelations, haply ye may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame upon the blind, nor any blame upon the lame, nor any blame upon the sick, nor upon yourselves if you eat from your own houses, or your fathers’ houses, or your mothers’ houses, or your brothers’ houses, or your sisters’ houses, or the houses of your paternal uncles, or the houses of your paternal aunts, or the houses of your maternal uncles, or the houses of your maternal aunts, or those whose keys are in your possession, or those of your friends. There will be no blame on you whether you eat together or separately. So when you enter houses, greet yourselves with a salutation from Allah, blessed and good. Thus does Allah clarify His signs for you so that you may exercise your reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no fault in the blind nor in one born lame, nor in one afflicted with illness, nor in yourselves, that ye should eat in your own houses, or those of your fathers, or your mothers, or your brothers, or your sisters, or your father's brothers or your father's sisters, or your mother's brothers, or your mother's sisters, or in houses of which the keys are in your possession, or in the house of a sincere friend of yours: there is no blame on you, whether ye eat in company or separately. But if ye enter houses, salute each other - a greeting of blessing and purity as from Allah. Thus does Allah make clear the signs to you: that ye may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no restriction on the blind, nor any restriction on the lame, nor any restriction on the sick, nor on yourselves, if you eat from your houses, or the houses of your fathers, or the houses of your mothers, or the houses of your brothers, or the houses of your sisters, or the houses of your father's brothers, or the houses of your father's sisters, or the houses of your mother's brothers, or the houses of your mother's sisters, or (from that) whereof you hold keys, or (from the house) of a friend. No sin on you whether you eat together or apart. But when you enter the houses, greet one another with a greeting from Allah (i.e. say: As-Salamu 'Alaikum - peace be on you) blessed and good. Thus Allah makes clear the Ayat (these Verses or your religious symbols and signs, etc.) to you that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be no fault for the blind, the lame, the sick and yourselves to eat from your houses. Nor the houses of your fathers', your mothers', your brothers', your sisters', your paternal uncles, your paternal aunts, your maternal uncles, your maternal aunts or in houses the keys of which you own, or in those of your friend, there is no fault in you that you all eat together, or separately. When you enter houses, greet (with peace) one another with a salutation from Allah, blessed and good. As such Allah makes clear to you His verses so that you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on the blind, nor any blame on the lame, nor any blame on the sick, nor on yourselves for eating at your homes, or your fathers’ homes, or your mothers’ homes, or your brothers’ homes, or your sisters’ homes, or the homes of your paternal uncles, or the homes of your paternal aunts, or the homes of your maternal uncles, or the homes of your maternal aunts, or those whose keys you own, or the homes of your friends. You commit no wrong by eating together or separately. But when you enter any home, greet one another with a greeting from God, blessed and good. God thus explains the revelations for you, so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not upon the blind [any] constraint nor upon the lame constraint nor upon the ill constraint nor upon yourselves when you eat from your [own] houses or the houses of your fathers or the houses of your mothers or the houses of your brothers or the houses of your sisters or the houses of your father's brothers or the houses of your father's sisters or the houses of your mother's brothers or the houses of your mother's sisters or [from houses] whose keys you possess or [from the house] of your friend. There is no blame upon you whether you eat together or separately. But when you enter houses, give greetings of peace upon each other - a greeting from Allah, blessed and good. Thus does Allah make clear to you the verses [of ordinance] that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:61] There is no blame upon the blind, nor any blame upon the lame, nor any blame upon the sick, that they be one’s table companions, nor, any blame, upon yourselves if you eat from your own houses, that is, [from] the houses of your offspring, or your fathers’ houses, or your mothers’ houses, or your brothers’ houses, or your sisters’ houses, or the houses of your paternal uncles or the houses of your paternal aunts, or the   houses of your maternal uncles or the houses of your maternal aunts, or [from] that whereof you hold the keys, [from] that which you safeguard on behalf of others, or [from] those of your [faithful] friends (sadīq is [so called] because he is ‘faithful’ (sadaqa) to you in his affection). In other words: one is permitted to eat from the houses of those mentioned, even if they are not present, provided that they consent to it. You would not be at fault whether you eat together, in a group, or separately, individually (ashtāt is the plural of shatt). This was revealed concerning those who felt inhibited about eating alone and [who] when they could not find a table companion they would refrain from eating. But when you enter houses, that are yours, [houses] wherein there is no one, bid peace to yourselves, say, ‘Peace be upon us and upon God’s righteous servants’, for the angels will return your greeting; and if there is family therein bid peace to them, with a salutation (tahiyyatan is the verbal noun from hayyā, ‘he saluted’) from God, blessed and good, and for which one is rewarded. So God clarifies the signs for you, that is to say, He sets out for you in detail the [ritual] ceremonies of your religion, that perhaps you might comprehend, in order for you to understand this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then revealed the following when the believers found it hard to eat with each other for fear of transgressing, because of Allah's saying (And eat not up your property among yourselves in vanity), and so Allah gave them dispensation to eat with each other saying: (No blame is there upon the blind) He says: there is no sin for the one who eats with the blind (nor any blame upon the lame) and there is no sin for the one who eats with the lame (nor any blame upon the sick) and there is no sin for the one who eats with the sick (nor on yourselves) a sin (if ye eat from your houses) from the houses of your children without asking permission but with moderation, (or the houses of your fathers, or the houses of your mothers, or the houses of your brothers) whether blood brothers, half brothers or milk brothers, (or the houses of your sisters) whether blood sisters, half sisters or milk sisters, (or the houses of your fathers' brothers, or the houses of your fathers' sisters, or the houses of your mothers' brothers, or the houses of your mothers' sisters, or (from that) whereof ye hold the keys) from that of which you hold the stores of what you have of wealth, i.e. male and female slaves, (or (from the house) of a friend) this was revealed about Malik Ibn Zayd and al-Harth Ibn 'Ammar who were friends. (No sin shall it be for you whether ye eat together) in moderation (or apart) and in this are included the blind, the lame, the sick and other categories of people. (But when ye enter houses) i.e. your houses or mosques and find no one there, (salute one another) say: \"peace be upon us from our Lord\" (with a greeting from Allah) as an honour from Allah to you, (blessed) with reward (and sweet) with forgiveness. (Thus Allah maketh clear His revelations) He exposits the commands and prohibitions just as He exposited this (for you, that haply ye may understand) what you have been commanded with.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ عَلَى ٱلْمَرِيضِ حَرَجٌ } معناه إِثمٌ\n وأصلُهُ الضِّيقُ\n\n\n\n\nوقوله تعالى: { أَوْ مَا مَلَكْتُمْ مَّفَاتِحهُ } معناه إنفاذهُ وإخراجه\n\n\n\n\nوقوله تعالى: { جَمِيعاً أَوْ أَشْتَاتاً } معناه مُتفرقونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"There is no blame on the sick,\" means that it is a sin.\n\n\nAnd its source is constriction.\n\nAnd His saying - {Exalted is He}, {Or what you own of keys} - its meaning is the implementation and the outcome.\n\n\nThe phrase {jamīʿan aw ash-shubhātan} in the Quran means \"dispersed\" or \"scattered\".",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما كانت العرب يتحرّجون عن مصاحبة ذوي العاهات\n والمؤاكلة معهم استقذاراً\n وكانوا أيضاً يتحرّجون من البيوتات المذكورة تعظماً واستبكاراً\n بل يعدونه عاراً\n ويستنكفون منه\n ردَّ الله عليهم ونفى الحرج\n فقالِ: { لَّيْسَ عَلَى ٱلأَعْمَىٰ حَرَجٌ } أن يأكل مع البصراء { وَلاَ عَلَى ٱلأَعْرَجِ حَرَجٌ } أن يأكل مع السويِّ السالم\n ويجلس معه { وَلاَ عَلَى ٱلْمَرِيضِ حَرَجٌ } أن يأكلش مع الأصحاء { وَلاَ } حرجَ أيضاَ { عَلَىٰ أَنفُسِكُمْ } في أكلكم مطلقاً سواءً { أَن تَأْكُلُواْ مِن بُيُوتِكُمْ } وعند أهليكم ومحارمكم\n سواءً كان من أكسابكم وأكساب أولادكم { أَوْ بُيُوتِ ءَابَآئِكُمْ } وأجدادكم\n لأنهم مستخلِفون لكم { أَوْ بُيُوتِ أُمَّهَٰتِكُمْ } لأن بينكم وبينهن مناسبة الكلية والجزئية { أَوْ بُيُوتِ إِخْوَٰنِكُمْ أَوْ بُيُوتِ أَخَوَٰتِكُمْ } لا شتراككم معهم في المنشأ { أَوْ بُيُوتِ أَعْمَٰمِكُمْ أَوْ بُيُوتِ عَمَّٰتِكُمْ } لاشتراك آبائكم معهم في المنشأ { أَوْ بُيُوتِ أَخْوَٰلِكُمْ أَوْ بُيُوتِ خَٰلَٰتِكُمْ } لاشتراك أمهاتكم معهم في المنشأ\n\n\n{ أَوْ } بيوت { مَا مَلَكْتُمْ مَّفَاتِحهُ } يعني: بيوت عبيدكم التي أنتم أسبابُ لإنشائها سواءُ كانوا معتَقين أم لا\n والتعبير عنهم بما: للتمليك والرّية { أَوْ } بيوت { صَدِيقِكُمْ } بالمناسبة المعنوية التي هي أقوى من القرابة النَّسَبية الصورية\n كل ذلك المذكور مسبوقُ بالإذن والرضا والتبسط والنشاط من أصحاب البيوتات\n\n\nثم أشار سبحانه إلى أدب المؤاكلة فقال: { لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَأْكُلُواْ جَمِيعاً } مجتمعين في إناءٍ واحدٍ يأكل بعضكم سؤر بعض\n إذ هو أدخل في التأليف والتحابب { أَوْ أَشْتَاتاً } متفرقين كلُّ في إناءٍ\n وهذا أدخل في التزكية والنظافة { فَإِذَا دَخَلْتُمْ بُيُوتاً } أي: كلُ منكم بيتاً من البيوت التي رُخِّصتم بالأكل منها { فَسَلِّمُواْ عَلَىٰ أَنفُسِكُمْ } أي: فابدؤوا بالسلام على أهلها\n لأنهم منكم ديناً وقرابةً\n حتى صار سلامكم إياهم { تَحِيَّةً } وزيادة حياةٍ لهم { مِّنْ عِندِ ٱللَّهِ } تفضلاً عليهم وإحساناً { مُبَٰرَكَةً } كثيرةَ الخير والبركة النازلة من عده على أهلها { طَيِّبَةً } خالصةً صافيةً عن كدر النفاق وأثر الخلاف والشقاق { كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلأيَٰتِ } الدالة على آداب أثر الخلاف والشقاق { لَعَلَّكُمْ تَعْقِلُونَ } [النور: 61] رجاء أن تتفطنوا منها إلى أحوالكم في النشأة الأخرى\n فتزوَّدوا فيها لأجلها\n\n\nثم أشار سبحانه إلى محافظة الآداب مع رسول الله صلى الله عليه وسلم\n ورعاية حقوقه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "{ لَّيْسَ عَلَى ٱلأَعْمَىٰ حَرَجٌ وَلاَ عَلَى ٱلأَعْرَجِ حَرَجٌ وَلاَ عَلَى ٱلْمَرِيضِ حَرَجٌ وَلاَ عَلَىٰ أَنفُسِكُمْ أَن تَأْكُلُواْ مِن بُيُوتِكُمْ أَوْ بُيُوتِ آبَآئِكُمْ أَوْ بُيُوتِ أُمَّهَاتِكُمْ أَوْ بُيُوتِ إِخْوَانِكُمْ أَوْ بُيُوتِ أَخَوَاتِكُمْ أَوْ بُيُوتِ أَعْمَامِكُمْ أَوْ بُيُوتِ عَمَّاتِكُمْ أَوْ بُيُوتِ أَخْوَالِكُمْ أَوْ بُيُوتِ خَالاَتِكُمْ أَوْ مَا مَلَكْتُمْ مَّفَاتِحهُ أَوْ صَدِيقِكُمْ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَأْكُلُواْ جَمِيعاً أَوْ أَشْتَاتاً... }  يقول الحق جل جلاله: { ليس على الأعمى حَرَجٌ } في الدخول من غير استئذان لأنه لا يتوقع منه نظر لما يكره. وكذلك لا حرج عليه فيما لا قدرة له عليه من الجهاد وغيره، ثم استطرد من شاركه في مطلق العذر فقال: { ولا على الأعْرج حَرَجٌ } فيما لا يقدر عليه من الجهاد وغيره، { ولا على المريض حرج } في ذلك. وقال سعيد بن المُسَيِّب: كان المسلمون إذا خرجوا إلى الغزو وضعوا مفاتيح بيوتهم عند الأعمى والأعرج والمريض وعند أقاربهم، ويأذنونهم أن يأكلوا من بيوتهم، فكانوا يتحرجون من ذلك، ويقولون: نخشى أن تكون نفوسهم غير طيبة بذلك، فنزلت الآية، رُخْصَةً لهم. وقيل: كانوا يتحرجون من ذلك ويقولون: نخشى أن تكون نفوسهم غير طيبة بذلك فنزلت الآية رُخْصَةً لهم وقيل: كانوا يتحرجون من الأكل معهم لأن الأعمى لا يبصر الطيب من الطعام، والأعرج لا يستطيع المزاحمة عليه، والمريض لا يستطيع استيفاءه. هـ. { ولا على أنفسكم } أي: لا حرج عليكم { أن تأكلوا من بيوتكم } أي: البيت الذي فيه أهل بيتكم أزواجكم وعيالكم، فإذا كان للزوجة أو للولد هناك شيء منسوب إليهما فلا بأس للرجل بأكله لأن الزوجين صارا كنفس واحدة، فصار بيت المرأة بيت الزوج. وقيل: المراد ببيوتكم: بيوت أولادكم، فجعل بيوت أولادهم بيوتهم لأن ولد الرجل من كسبه، وماله كمالِه، لقوله عليه الصلاة والسلام:\n \" أنت ومالك لأبيك \" \n، ولذلك لم يذكر الأولاد في الآية لاندراجهم في بيوتكم. ولا حرج عليكم أيضاً أن تأكلوا من { بيوت آبائكم أو بيوتِ أمهاتكم أو بيوتِ إخوانكم } الذكور { أو بيوت أَخَواتكم } النساء، { أو بيوت أعمامكم أو بيوت عمَّاتكم أو بيوتِ أخوالكم أو بيوت خالاتكم } لأن الإذن من هؤلاء ثابت دلالة. واختلف العلماء في إباحة الأكل من هذه البيوت المذكورة، فقيل: إنه منسوخ وإنه لا يجوز الأكل من بيت أحد إلا بإذنه، والناسخ:\n[البقرة: 188]، وقوله عليه الصلاة والسلام-:\n \" لاَيَحِلُّ مَالُ امْرِىءٍ مسلم إلا عن طِيبِ نَفْسٍ \" \nوقيل: محكمة ومعناها: إذا أذنوا في ذلك، وقيل: ولو بغير إذن، والتحقيق: هو التفصيل: فمن عُلم منه طيب نفسه وفرحُه بذلك بقرينةٍ: حَلَّ أَكْلُ مَالِهِ، ومَنْ لاَ فلا. { أو ما ملكتم مَّفَاتحه } قال ابن عباس: وهو وكيل الرجل وقيّمه في ضَيْعَتِهِ وماشيته، له أن يأكل من ثمرة ضيعته، ويشرب مِنْ لبن ماشيته.\nوالمراد بملك المفاتيح: كَوْنُها في يده وتحت حَوْزِهِ. وقيّده ابن العربي بما إذا لم تكن له أجرة، وإن كانت له أجرة على فعله حَرُمَ، يعني: إلا إذا علم طيب نَفْسٍ صاحبه فيدخل في الصديق. وقيل: أريد به بيت عَبْدهِ لأن العبد وما في يده لمولاه. { أو صَدِيقِكُمْ } أي: أو بيوت أصدقائكم، والصديق يكون واحداً وجمعاً، وهو من يصدقك في مودته وتصدقه في مودتك، يُؤلمه ما يؤلمك ما يؤلمه، ويسرك ما يسره كذلك. وكان الرجل من السلف يدخل دار صديقه وهو غائب، فيسأل جاريته كيسَهُ فيأخذ ما شاء، فإذا حضر مولاها أعتقها سروراً بذلك، فأما الآن فقد غلب الشحّ فلا يأكل إلا بإذن. قاله النسفي. { ليس عليكم جناحٌ أن تأكلوا جميعاً }: مجتمعين { أو أشتاتاً }: متفرقين، جمع شَتّ، نزلت في بني ليث بن عمرو، كانوا يتحرّجُون أن يأكل الرجل وحده، فربما قعد منتظراً نهاره إلى الليل، فإذا لم يجد من يؤاكله من الضيفان أكَل أكْل ضرورة. وقيل: في قوم من الأنصار كانوا إذا نزل بهم ضيف لا يأكلون إلا مع ضيفهم، فرخص لهم أن يأكلوا كيف شاؤوا. وقيل: في قوم تحرجوا من الاجتماع على الطعام لاختلاف الناس في الأكل، وزيادة بعضهم على بعض، فخيّرهم. وقيل: كان الغني منهم إذا دخل على الفقير من ذوي قرابته وصداقته، ودعاه إلى الطعام، فيقول: إني أتحرج أن آكل معك، وأنا غني وأنت فقير، فأباح لهم ذلك. والله تعالى أعلم. الإشارة: ليس على من عَمِيَتْ بصيرتُه، فلم ير إلا الكون حَرج في أن يقف مع رُخَصِ الشريعة، ويتناول كل ما يشتهيه نفسه، مما أباحته الشريعة، من غير تورع ولا توقف ولا تبصر. وكذلك المريضَ القلب بالخواطر والأوهام، ومن عَرجت فكرته عن شهود الملكوت، فلا بأس لهؤلاء الضعفاء أن يقفوا مع العوائد والأسباب، ويتناولوا كل ما أباحته ظواهر الشريعة، وأما الأقوياء فلا يأخذون إلا ما تحققوا حِلِّيَّتَهُ، وفهموا عن الله في أخذه وتركه، لفتح بصيرتهم وشدة تبصُّرهم. وقال الورتجبي في قوله: { ليس على الأعمى حرج }: عماه الحقيقي ألا يطيق أن ينظر بطونَ الأزل والغيبَ وغيبَ الغيب. وهذا من قوله - عليه الصلاة والسلام - في وصف جمال الحق سبحانه:\n \" حجابه النور، لو كشفه لأحرقت سُبُحَاتُ وَجْهِه ما انتهى إليه بَصَرُهُ مِنْ خلْقِهِ \" \nفجعله معذوراً ألا يدرك حق الحقيقة وحقيقة الحق إذ يستحيل الحَدَثُ أن يحيط بالقدم إن كان واجباً معرفة الكل من حيث الحقوق لا من حيث التوحيد. هـ ومراده ببطون الأزل: تجلياته تعالى، البارزة من وسط بحر جبروته الغيبي، وهي المراد بالغيب وغيب الغيب، فالأكوان كلها برزت من بحر الذات الأزلية والكنز الغيبي، لكنها، لما تجلت، كستها رداء الكبرياء، فمن فتحت بصيرته رأى الحق تعالى فيها، أو قبلها، أو معها، ومن عميت بصيرته لم ير إلا حس الأكوان الظُّلْمَانِيَّةِ.\nوالله تعالى أعلم. ومذهب الصوفية في تناول متاع بعضهم بعضاً هو ما قال القائل: \" نَحْنُ: لاَ مَالٌ مَقْسُومٌ، وَلاَ سِرٌّ مَكْتُومٌ، فَتَرِكَتُهُمْ لاَ تُقْسَمُ أبداً \". دخل الجنيد بَيْتَ بَعْضِ إخوانه، فوجد زوجته، فقال: هل عندك شيء نطعم به الفقراء؟ فأشارت إلى وعاء فيه تمر، لا يملك غيره، فأفرغه على رأسه، فأكلوا، وأخذوا ما بقي، فلما جاء زوجها ذكرت له ذلك، فقال: الآن علمت أنه يُحبني.  ثم أمر بالسلام بعد الاستئذان، فقال: {...فَإِذَا دَخَلْتُمْ بُيُوتاً فَسَلِّمُواْ عَلَىٰ أَنفُسِكُمْ تَحِيَّةً مِّنْ عِندِ ٱللَّهِ مُبَارَكَةً طَيِّبَةً كَذَلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلآيَاتِ لَعَلَّكُمْ تَعْقِلُونَ }  يقول الحق جل جلاله: { فَإِذَا دخلتم بيوتاً } من البيوت المذكورة أو غيرها بعد الإذن، { فسَلّمُوا على أنفسكم } أي: فابدأوا بالسلام على أهلها، الذين هم منكم، الذين هم بمنزلة أنفسكم لما بينكم وبينهم من القرابة الدينية أو النَّسَبِيَّةِ. أو بيوتاً فارغة، أو مسجداً، بأن تقولوا: السلام عليكم، أو السلام علينا وعلى عباد الله الصالحين، إن كانت خاوية. { تحيةً } ، مَنْ نَصَبَ فعلى المصدر لِسلِّمُوا لأنها في معنى تسليماً، { من عند الله } أي: بأمره مشروعه من لدنه، أو لأنها طلب للسلامة، وهي بيد الله، { مباركةً }: مستتبعة لزيادة الخير والثواب ودوامهما، { طيبةً }: تطيب بها نفس المستمع. وعن أنس رضي الله عنه أنه - عليه الصلاة والسلام - قال:\n \" من لقيت أحداً من أمتي فسلم عليه، يَطُلْ عُمْرُكَ. وإذا دخلت بيتك فسلم عليهم يكْثُرُ خَيْرُ بَيْتِك، وصل صلاة الضحى فإنها صلاة الأبرار الأوابين \". \n{ كذلك يُبين الله لكم الآيات } ، تكرير لتأكيد الأحكام المختتمة وتفخيمها، { لعلكم تعقلون }: لكي تعقلوا ما في تضاعيفها من الشرائع والأحكام، وتعملوا بموجبها، فتفوزوا بسعادة الدارين. والله تعالى أعلم. الإشارة: السلام على النفس: هو طلب الأمان لها ومنها، فإذا سَلِمَت النفس من موجات الغضب من الله، سَلِمَ صاحبها منها، قال القشيري: السلامُ: الأمانُ، فسبيل المؤمن إذا دخل بيتاً أن يُسلِّمَ مِنَ الله على نَفْسه، يعني: بأن يقول السلام علينا وعلى عباد الله الصالحين، وأن يطلب السلامة والأمان من الله تعالى، لِتسْلَمَ نَفْسُه من الإقدام على ما لا يرضي الله، إذ لا يحل لمُسلم أن يفْتُرَ لحظة عن الاستجارة بالله، بأن لا يرفع عنه ظل عصمته بإدامة حِفظهِ من الاتصاف بمكروه الشرع. هـ. ولما تكلم عن الاستئذان في الدخول، تكلم عن الاستئذان في الخروج، إذا كان مع كبر القوم، فقال: { إِنَّمَا ٱلْمُؤْمِنُونَ ٱلَّذِينَ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:23",
      "similarity": 0.4814094899954368
    },
    {
      "verse": "33:50",
      "similarity": 0.4794123858310726
    },
    {
      "verse": "48:17",
      "similarity": 0.3662644068016746
    },
    {
      "verse": "92:4",
      "similarity": 0.2665225206509645
    },
    {
      "verse": "99:6",
      "similarity": 0.26636335141988404
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024061.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024061.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:61.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}