{
  "chapter": "النور",
  "text": "انما المؤمنون الذين ءامنوا۟ بالله ورسوله واذا كانوا۟ معه على امر جامع لم يذهبوا۟ حتى يستـذنوه ان الذين يستـذنونك او۟لئك الذين يؤمنون بالله ورسوله فاذا استـذنوك لبعض شانهم فاذن لمن شئت منهم واستغفر لهم الله ان الله غفور رحيم",
  "translations": [
    {
      "translation": "The muminun are those who have iman in Allah and His Messenger and who, when they are with him on a matter of common concern, do not leave until they have asked him for permission. Those people who ask you for permission are the ones who truly have iman in Allah and His Messenger. If they ask your permission to attend to their own affairs, give permission to any of them you please; and ask Allah's forgiveness for them. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no harm in your eating together or separately. But when you enter the houses, salute the inmates with a greeting in the name of God, invoking blessings and good health. That is how God explains things to you clearly so that you may understand. They alone are true believers who believe in God and His Apostle, and when they are with him on a matter of common concern, do not depart without obtaining his leave. Surely those who ask leave of you are the ones who believe in God and His Apostle. Therefore when they ask leave of you for personal business give leave to those you please, and seek God's forgiveness for them. Surely God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "True Believers are those who sincerely believe in Allah and His Messenger and who do not leave him without permission when they are with the Messenger for some common good; only those who ask your permission sincerely believe in Allah and His Messenger. Therefore, when they ask your permission for a private business, you may give permission to whomever you like, and ask Allah's forgiveness for such people: Allah is indeed Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true believers are those who have faith in God and His Messenger and when they are dealing with the Messenger in important matters, they do not leave without his permission. (Muhammad), those who ask your permission believe in God and His Messenger. When they ask your leave to attend to their affairs, you may give permission to anyone of them you choose and ask forgiveness for them from God. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who accept faith in Allah and His Noble Messenger and when they are present with the Noble Messenger upon being gathered for some task, do not go away until they have taken his permission; indeed those who seek your permission, are those who believe in Allah and His Noble Messenger; so if they seek your permission for some affair of theirs, give the permission to whomever you wish among them, and seek Allah’s forgiveness for them; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who believe in Allah and His Messenger; and when they are with him on some common matter, they go not away until they have asked his permission. Verily, those who ask your permission, those are they who (really) believe in Allah and His Messenger. So if they ask your permission for some affairs of theirs, give permission to whom you will of them, and ask Allah for their forgiveness. Truly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those are believers who believe in Allah and His Apostle, and when they are with him on a momentous affair they go not away until they have asked his permission; surely they who ask your permission are they who believe in Allah and His Apostle; so when they ask your permission for some affair of theirs, give permission to whom you please of them and ask forgiveness for them from Allah; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those only are believers, who believe in God and His Messenger and who, when they are with him upon a common matter, go not away until they ask his leave. Surely those who ask thy leave -- those are they that believe in God and His Messenger; so, when they ask thy leave for some affair of their own, give leave to whom thou wilt of them, and ask God's forgiveness for them; surely God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They only are the true believers who believe in Allah and His messenger and, when they are with him on some common errand, go not away until they have asked leave of him. Lo! those who ask leave of thee, those are they who believe in Allah and His messenger. So, if they ask thy leave for some affair of theirs, give leave to whom thou wilt of them, and ask for them forgiveness of Allah. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They only are true believers who believe in God and His Messenger. When they are with him on some matter of common concern, they should not depart until they have asked him for permission to do so. Those who ask you for such permission are the ones who truly believe in God and His Messenger. When they ask you for permission to attend to some affair of their own, then grant it to whoever you please and seek forgiveness from God for them. God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are those alone who have believed in Allah and His apostle, and when they are with him on some affair collecting People together they depart not Until they have asked his leave. Verily those who ask thy leave, those are they who believe in Allah and His apostle. So if they ask thy leave for some business of theirs, give thou leave unto whomsoever of them thou wilt, and ask thou forgiveness of Allah for them. Verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the faithful are those who have faith in Allah and His Apostle, and when they are with him in a collective affair, they do not leave until they have sought his permission. Indeed those who seek your permission are those who have faith in Allah and His Apostle. So when they seek your permission for some of theirs [private] work, give permission to whomever of them you wish and plead with Allah to forgive them. Indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those are believers, who believe in Allah and His Messenger: when they are with him on a matter requiring collective action, they do not depart until they have asked for his leave; those who ask for thy leave are those who believe in Allah and His Messenger; so when they ask for thy leave, for some business of theirs, give leave to those of them whom thou wilt, and ask Allah for their forgiveness: for Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true believers are only those, who believe in (the Oneness of) Allah and His Messenger (Muhammad SAW), and when they are with him on some common matter, they go not away until they have asked his permission. Verily! Those who ask your permission, those are they who (really) believe in Allah and His Messenger. So if they ask your permission for some affairs of theirs, give permission to whom you will of them, and ask Allah for their forgiveness. Truly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who believe in Allah and His Messenger, and who, when gathered with him upon a common matter do not depart till they have asked his permission. Surely, those who ask your permission are those who believe in Allah and His Messenger. When they ask your permission for some of their affairs, grant it to whomever you please and ask Allah for forgiveness for them; Allah is the Forgiver, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are those who believe in God and His Messenger, and when they are with him for a matter of common interest, they do not leave until they have asked him for permission. Those who ask your permission are those who believe in God and His Messenger. So when they ask your permission to attend to some affair of theirs, give permission to any of them you wish, and ask God’s forgiveness for them. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who believe in Allah and His Messenger and, when they are [meeting] with him for a matter of common interest, do not depart until they have asked his permission. Indeed, those who ask your permission, [O Muhammad] - those are the ones who believe in Allah and His Messenger. So when they ask your permission for something of their affairs, then give permission to whom you will among them and ask forgiveness for them of Allah. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:62] Only they are believers who believe in God and His Messenger and who, when they are with him, namely, the Messenger, in a collective affair, such as [during] the Friday sermon, do not leave, when they have an excuse, until they have asked leave of him. Truly those who ask leave of you — it is they who believe in God and His Messenger. So when they ask leave of you for some affair, [some] matter, of theirs, give permission to whom you will of them, to leave, and ask God to forgive them. Truly God is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They only are the true believers who believe in Allah and His messenger) privately and in the open (and, when they are with him) with the Prophet (pbuh) (on some common errand) on Friday or in a military expedition, (go not away) from the mosque or from the military expedition (until they have asked leave of him) ask permission from the Prophet (pbuh). (Lo! those who ask leave of thee) Muhammad to return from the battle of Tabuk; this refers to 'Umar Ibn al-Khattab who asked the Prophet (pbuh) to give him leave to return to Medina because of an ailment which visited him, (those are they who believe in Allah and 395 His messenger) in private and openly. (So, if they ask thy leave) so if sincere believers ask you, Muhammad, (for some affair of theirs) for a need of theirs, (give leave to whom thou wilt of them) of the sincere believers, (and ask for them forgiveness of Allah) regarding that for which they have gone. (Lo! Allah is Forgiving) He forgives the one who repents, (Merciful) He shows mercy towards the one who dies repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وكمال الإطاعة والانقياد إليه فقال: { إِنَّمَا ٱلْمُؤْمِنُونَ } الموحدون الكاملون\n المنكشفون بسرائر التوحيد الذاتي هم { ٱلَّذِينَ آمَنُواْ بِٱللَّهِ } الجامع لجميع الأسماء والصفات المنسوبة إلى الذات الأحدية { وَرَسُولِهِ } الجامع لجميع مراتب المظاهر والمصنوعات\n لا يخرج عن حيطة مرتبته الجامعة الكاملة مرتبةُ من المراتب أصلاً { وَ } بعدما عرفتم جمعيته { إِذَا كَانُواْ } مجتمعين { مَعَهُ } صلى الله عليه وسلم { عَلَىٰ أَمْرٍ جَامِعٍ } أي: أمرٍ مشروطٍ حصولهُ بالاجتماع والاقتحام كالزحف والجهاد والجُمَع والأعياد { لَّمْ يَذْهَبُواْ } ولم ينصرفوا من عنده صلى الله عليه وسلم { حَتَّىٰ يَسْتَأْذِنُوهُ } بالانفضاض والانصراف\n وإن كنتم مضطرين إلى الإياب والذهاب\n\nثم كرر سبحانه أمر الاستئذان على وجه أبلغ تأكيداً ومبالغةً\n فقال مخاطباً لحبيبه صلى الله عليه وسلم: { إِنَّ ٱلَّذِينَ يَسْتَأْذِنُونَكَ } في الذهاب والانصراف محافظة على الأدب { أُوْلَـٰئِكَ } السعداء المستأذنون هم { ٱلَّذِينَ يُؤْمِنُونَ } حقاً { بِٱللَّهِ وَرَسُولِهِ } ويراعون الأدب معهما من صفاء بواطنهم وخلوص طوياتهم { فَإِذَا ٱسْتَأْذَنُوكَ } يا أكمل الرسل بعد اضطرارهم { لِبَعْضِ شَأْنِهِمْ } وأمرهم المتعلق بمعاشهم { فَأْذَن لِّمَن شِئْتَ مِنْهُمْ } أي: أنت مخير في إذنهم بعد اضطرارهم { وَ } بعدما أذنتَ لهم { ٱسْتَغْفِرْ لَهُمُ ٱللَّهَ } من ذنبهم الذي اختاروا من أمر الدنيا على أمر العقبى\n واستأذنوا له واهتموا لشأنه { إِنَّ ٱللَّهَ } المطلع لاستعدادات عباده { غَفُورٌ } يغفر لهم أمثال هذه الفرطات الاضطرارية { رَّحِيمٌ } [النور: 62] مشفقُ حينئذٍ عليهم بعدما ندموا في نفوسهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { إِنما المؤمنون الذين آمنوا بالله ورسوله } ، إنما ذكر الإيمان بالله ورسوله في حيز الصلة للموصول الواقع خبراً للمبتدأ، مع تضمنه له تقريراً لِمَا قبله، وتمهيداً لما بعده، وإيذاناً بأن ما بعده حقيق بأن يُجْعَلَ قريناً للإيمان بهما ومنتظماً في سلكه. { وإذا كانوا معه على أمرٍ جامعٍ }: عَطْفٌ على آمنوا، دَاخِلٌ في حيز الصلة، أي: إنما الكاملون في الإيمان: الذين آمنوا بالله ورسوله عن صميم قلوبهم، وأطاعوه في جميع الأحكام والأحوال المطردة الوقوع، والأحوال الواقعة بحسب الاتفاق، كما إذا كانوا معه - عليه الصلاة والسلام - على أمر مُهم يجب الاجتماع في شأنه كالجمعة والأعياد، والجهاد، وتدريب الحروب، وغيرها من الأمور الداعية إلى الاجتماع، { لم يذهبوا حتى يستأذنوه } ، ويأذن لهم، ولو كان الأمر يقوم بدونهم، ليتميز المخلص من المنافق، فإن دَيْدنه التسلل للفرار، ولتعظيم الجرم لما في الذهاب بغير إذنه صلى الله عليه وسلم من الخيانة. وَلَمَّا أراد الحقُّ تعالى أَنْ يُرِيَهُمْ عِظَمَ الجنايةِ في ذهاب الذاهب عن مجلس رسول الله صلى الله عليه وسلم بغير إذنه، إذا كانوا معه على أمر جامع، جعل ترك ذهابهم والصبر معه، حتى يأذن لهم: ثالث الإيمان، وجعل الإيمان برسوله كالسبب له، والبساط لذكره، وذلك مع تصدير الجملة بـ \" إنما، ثم عقبة بما يزيده توكيداً وتشديداً حيث أعاده على أسلوب آخر فقال: { إن الذين يستأذنونك أولئك الذين يؤمنون بالله ورسوله } ، فقضَى بأن المستأذنين هم المؤمنون خاصة. وفي \" أولئك \": من تفخيم المستأذنين، ما لا يخفى، { فإذا استأذنوك } في الانصراف { لبعض شأنهم } أي: أمرهم المهم وخطْبهم الملم. { فَأَذَنْ لِمَنِ شئْتَ منهم } لما علمت في ذلك من مصلحة وحكمة. وهذا بيان لما هو وظيفة صلى الله عليه وسلم في هذا الباب، إثر بيان ما هو وظيفة المؤمنين، وأن الإذن منه - عليه الصلاة والسلام - ليس بأمر محتوم، بل هو مفوّض إلى رأيه عليه الصلاة والسلام، وفيه مِنْ رَفْع شأنه صلى الله عليه وسلم ما لا يخفى. والفاء: لترتيب ما بعدها على ما قبلها، أي: بعدما تحقق أن الكاملين في الإيمان هو المستأذِنُون. { فإذا استأذنوك لبعض شأنهم فَأْذَنْ لمن شئتَ منهم واستغفر لهم الله } ، فإن الاستئذان، وإن كان لعذر، فقد لا يخلو من شائبة تقديم أمر الدنيا على أمر الآخرة، ففيه دليل على أن الصبر وترك الاستئذان أفضل. { إن الله غفور رحيم } مبالغ في غفران فَرَطَاتِ العِبَاد، وفيه إفاضة آثار الرحمة عليهم. وما ذكره الحق تعالى في شأن الصحابة مع الرسول - عليه الصلاة والسلام - في شأن الاستئذان ينبغي أن يكون كذلك مع أئمتهم ومقدّميهم في العلم والدين، لا يتفرقون عنهم إلا بإذن.\nوالآية نزلت في الخندق، كان المنافقون يرجعون إلى منازلهم من غير استئذان، فنزلت. وبقي حكمها عاماً إلى يوم القيامة. والله تعالى أعلم. الإشارة: من آداب الفقراء مع شيخهم ألا يتحركوا لأمر إلا بإذنه، أما أهل البدايات فيستأذنون في الجليل والحقير، كقضية الفقير الذي وجد بَعْضَ البَاقِلاَّءِ - أي: الفول - في الطريق، فأتى بها إلى الشيخ، فقال: يا سيدي ما نفعل به؟ فقال: اتركه، حتى تفطر عليه، فقال بعض الحاضرين: يستأذنك في الباقلاء؟ فقال: لو خالفني في أمر لم يفلح أبداً. وأما أهل النهايات الذين عرفوا الطريق، واستشرفوا على عين التحقيق، وحصلوا على مقام الفهم عن الله، فلا يستأذنون إلا في الأمر المهم كالتزوج، والحج، ونحوهما. وَصَبْرُهُ حتى يأمره الشيخ بذلك أولى، فالمريد بقدر ما يترك تدبيره مع الشيخ، ويتحقق بالتفويض معه قبل الوصول، كذلك يتركه ويتحقق تفويضه مع الله بعد الوصول. فالأدب مع الشيخ هو الأدب مع الله، لكن لما كان من شأن العبد الجهل بالله وسوء الأدب معه أمره بالتحكيم لغيره من جنسه، فإذا حكم جنسه على نفسه قبل المعرفة حكم الله على نفسه بعد المعرفة. والتحكيم في غاية الصعوبة على النفس، لا يرضاها إلا من سبقت له الهداية، وجذبته جواذب العناية، أعني الدخول تحت الشيخ وتحكيمَه على نفسه، حتى لا يتحرك إلا بإذنه، فهذا سبب الوصول إلى مقام الشهود والعيان، فإذا فعل المريد شيئاً من غير استئذان فليتب وليطلب من الشيخ الاستغفار له. وينبغي للشيخ أن يقبل العذر ويسامح ويستغفر له، لقوله تعالى: { واستغفر لهم الله إن الله غفور رحيم } ، فالخليفة لرسول الله قائم مقامه، ونائب عنه في رتبة التربية. والله تعالى أعلم. ثم نهاهم عن التساهل في ترك الاستئذان، فقال: { لاَّ تَجْعَلُواْ دُعَآءَ ٱلرَّسُولِ بَيْنَكُمْ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:29",
      "similarity": 0.8173696309088644
    },
    {
      "verse": "80:37",
      "similarity": 0.779006750139971
    },
    {
      "verse": "10:61",
      "similarity": 0.35490519824031946
    },
    {
      "verse": "23:91",
      "similarity": 0.16636287768251146
    },
    {
      "verse": "4:133",
      "similarity": 0.1292215275331684
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/024062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/024062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/24:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}