{
  "chapter": "النور",
  "text": "لا تجعلوا۟ دعاء الرسول بينكم كدعاء بعضكم بعضا قد يعلم الله الذين يتسللون منكم لواذا فليحذر الذين يخالفون عن امره ان تصيبهم فتنة او يصيبهم عذاب اليم",
  "translations": [
    {
      "translation": "Do not consider your being summoned by the Apostle to be like your summoning one another. God knows those of you who go away surreptitiously. So let those who act in contravention of his command take heed lest a trial should befall them or a grievous punishment come upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, do not consider the summoning by the Messenger like the summoning among you by one another. Allah knows well those of you who steal away, concealing themselves behind others. Let those who disobey the order of the Messenger beware lest they should be involved in some affliction, or are visited by a woeful scourge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not address the Messenger as you would call each other. God knows those who secretly walk away from you and hide themselves. Those who oppose the Messengers should beware, lest some trouble or a painful torment should befall them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not presume among yourselves the calling of the Noble Messenger equal to your calling one another; Allah knows those among you who sneak away by some pretext; so those who go against the orders of the Noble Messenger must fear that a calamity may strike them or a painful punishment befall them. (To honour the Holy Prophet – peace and blessings be upon him – is part of faith. To disrespect him is blasphemy.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make not the calling of the Messenger among you as your calling one of another. Allah knows those of you who slip away under shelter. And let those beware who oppose the Messenger's commandment, lest some Fitnah should befall them or a painful torment be inflicted on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not hold the Apostle's calling (you) among you to be like your calling one to the other; Allah indeed knows those who steal away from among you, concealing themselves; therefore let those beware who go against his order lest a trial afflict them or there befall them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make not the calling of the Messenger among yourselves like your calling one of another. God knows those of you who slip away surreptitiously; so let those who go against His command beware, lest a trial befall them, or there befall them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make not the calling of the messenger among you as your calling one of another. Allah knoweth those of you who steal away, hiding themselves. And let those who conspire to evade orders beware lest grief or painful punishment befall them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not treat being called by the Messenger like being called by one another. God knows those of you who slip away on some pretext. Let those who go against his order beware lest some affliction befall them or they receive a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Place not the apostle's calling among you on the same footing as your calling of each other. Of a surety Allah knoweth those who slip away privately; let therefore those who oppose His commandment beware lest there befall them a trial or there befall them a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not consider the Apostle’s summons amongst you to be like your summoning one another. Allah certainly knows those of you who slip away shielding one another. Those who disobey his orders should beware lest an affliction should visit them or a painful punishment should befall them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deem not the summons of the Messenger among yourselves like the summons of one of you to another: Allah doth know those of you who slip away under shelter of some excuse: then let those beware who withstand the Messenger's order, lest some trial befall them, or a grievous penalty be inflicted on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make not the calling of the Messenger (Muhammad SAW) among you as your calling of one another. Allah knows those of you who slip away under shelter (of some excuse without taking the permission to leave, from the Messenger SAW). And let those who oppose the Messenger's (Muhammad SAW) commandment (i.e. his Sunnah legal ways, orders, acts of worship, statements, etc.) (among the sects) beware, lest some Fitnah (disbelief, trials, afflictions, earthquakes, killing, overpowered by a tyrant, etc.) befall them or a painful torment be inflicted on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make the calling of the Messenger among yourselves like your calling to one another. Allah knows those of you who slip away surreptitiously, so let those who disobey His command beware, lest they are struck by sedition, or, they are stricken with a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not address the Messenger in the same manner you address one another. God knows those of you who slip away using flimsy excuses. So let those who oppose his orders beware, lest an ordeal strikes them, or a painful punishment befalls them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make [your] calling of the Messenger among yourselves as the call of one of you to another. Already Allah knows those of you who slip away, concealed by others. So let those beware who dissent from the Prophet's order, lest fitnah strike them or a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[24:63] Do not, among yourselves, consider the calling of the Messenger to be like your calling of one another, by saying, ‘O Muhammad!’ (s), but say, ‘O Prophet of God’, or, ‘O Messenger of God!’ gently, respectfully and in a low voice. Verily God knows those of you who slip away surreptitiously, that is, those who leave the mosque secretly during the sermon without asking leave, hiding behind something (qad, ‘verily’, is for confirmation). So let those who contravene His command, that is, God’s command, or that of His Messenger, beware lest an ordeal, a trial, befall them, or there befall them a painful chastisement, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Make not the calling of the messenger among you) i.e. do not call the Prophet (pbuh) by his name saying: Muhammad, (as your calling one of another) by name. You should rather respect him, show deference towards him and honour him by saying: \"O Prophet of Allah\", \"0 Messenger of Allah\", \"0 Abu'l-Qasim\": (Allah knoweth those of you who steal away) from the mosque, (hiding themselves) the hypocrites used to leave the mosque without permission when no one could see them. (And let those who conspire to evade orders) the orders of the Messenger of Allah (pbuh); it is also said that this means: the orders of Allah (beware lest grief) a calamity (or painful punishment) beating (befall them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَدْ يَعْلَمُ ٱللَّهُ ٱلَّذِينَ يَتَسَلَّلُونَ مِنكُمْ لِوَاذاً } معناه استِتَارٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن جملة الآداب التي وجبت عليكم رعايتها ومحافظتها بالنسبة إلى رسول الله صلى الله عليه وسلم { لاَّ تَجْعَلُواْ دُعَآءَ ٱلرَّسُولِ } ونداءه { بَيْنَكُمْ } بين أظهركم { كَدُعَآءِ بَعْضِكُمْ بَعْضاً } بالاسم واللقب فقط لا ضميمةٍ تدل على تعظيمه وتوقيره، بل قولوا له وقت ندائه: يا نبي الله؛ أو: يا خير خلق الله، أو: يا أكرم الخلق على الله، وأمثالها\n\n\n\n\nأو لا تجعلوا دعاءه ومناجاته مع الله، ورفع حاجاته صلى الله عليه وسلم إليه سبحانه في الإجابة والقبول كدعاء بعضكم بعضاً، فإن قبل مرة ردَّ أخرى بل ردَّ مراراً كثيرة، فإن دعاءه صلى الله عليه وسلم لا يرد عند الله أصلاً، أولاً تقيسوا نداءه إليكم في الوقائع والأمور كدعاء بعضكم بعضاً، فإن تجيبوا مرة وتردوا أخرى، بل عليكم أن تبادروا الإجابة ندائه صلى الله عليه وسلم سمعاً وطاعةً بلا مطلٍ وتسويفٍ، وخافضين أصواتكم حين إجابته مسرعين إليها بالآلات والجوارح، ساعين إلى إنجاح سؤله ومطلوبه صلى الله عليه وسلم\n\n\n\n\nثم أشار سبحانه إلى توبيخ المنافقين وتقريعهم حيث قال: { قَدْ يَعْلَمُ ٱللَّهُ } المطلع على سرائر عباده بمقتضى علمه الحضوري كيدَ المنافقين { ٱلَّذِينَ يَتَسَلَّلُونَ مِنكُمْ } أي: يخرجون قليلاً قليلاً من جمعكم أيها المؤمنون { لِوَاذاً } أي: حال كونهم ملاوذين ملتجئين بغيرهم بأن يستر بعضهم خلف بعض، وحتى يخرج بلا إذنٍ ورخصةٍ منه صلى الله عليه وسلم { فَلْيَحْذَرِ } أولئك الماكرون المخادعون { ٱلَّذِينَ يُخَالِفُونَ } وينصرفون { عَنْ أَمْرِهِ } سبحانه وأمر رسوله صلى الله عليه وسلم بلا رخصةٍ { أَن تُصِيبَهُمْ } في الدنيا { فِتْنَةٌ } أي: مصيبةُ ومحنةُ عظيمةُ مثل القتل والنهب الأسر وأنواع البليات { أَوْ يُصِيبَهُمْ } في الآخرة { عَذَابٌ أَلِيمٌ } [النور: 63] لا عذاب أشدَّ منه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { لا تجعلوا دُعاءَ الرسولِ بينكم كدُعَاءِ بعضِكم بعضاً } أي: إذا احتاج الرسول صلى الله عليه وسلم إلى اجتماعكم لأمر جامع، فدعَاكم، فلا تتفرقوا عنه إلا بإذنه، ولا تقيسوا دعاءه إياكم على دعاء بعضكم بعضاً، ورجوعكم عن المجمع بغير إذن الراعي لأن أمره - عليه الصلاة والسلام - وشأنه ليس كشأنكم: أو: لا تجعلوا دعاء الرسول على أحد، كدعاء بعضكم على بعضاً، فإنَّ غضبه عليه ليس كغضبكم لأن غضبه غضب الله، ودعاءه مستجاب\n وهذا يناسب ما قبله من جهة التحذير عن ترك الاستئذان، فإنَّ من رجع بغير استئذان معرض لغضبه - عليه الصلاة والسلام - ودعائه عليه\n أو: لا تجعلوا نداءه صلى الله عليه وسلم كنداء بعضكم بعضاً كندائه باسمه، ورفع الصوت عليه، وندائه من وراء الحُجرات، ولكن بلَقَبه المعظم يا رسول الله، يا نبي الله، مع غاية التوقير والتفخيم والتواضع وخفض الصوت\n قال القشيري: أي: عَظِّموه في الخطاب، واحفظوا حرمته وخدمته في الأدب، وعانقوا طاعته على مراعاة الهيبة والتوقير\n هـ\n فالإضافة، على الأوليْن: للفاعل، وعلى الثالث للمفعول، لكنه بعيد من المناسبة لما قبله ولما بعده في قوله: { قد يعلم الله الذين يتسللون } أي: يخرجون قليلاً قليلاً على خِفْيَةٍ منكم، { لِوَاذاً } أي: ملاوذين، بأن يستتر بعضهم ببعض حتى يخرج، أو يلوذ بمن يخرج بالإذن إراءة أنه من أتباعه\n أو مصدر، أي: يلوذون لواذاً\n واللواذ: الملاوذة، وهي التعلق بالغير، وهو أن يلوذ هذا بهذا في أمر، أي: يتسللون عن الجماعة خفية، على سبيل الملاوذة واستتار بعضهم ببعض\n ثم هددهم على المخالفة بقوله: { فليحذرِ الذين يُخالفون عن أمره } أي: الذين يصدون عن أمره، يقال: خالفه إلى الأمر: إذا ذهب إلى دونه، ومنه:\n\n[هود: 88]، وخالفه عن الأمر: إذا صد عنه\n والضمير: إما لله سبحانه، أو للرسول عليه الصلاة والسلام -، وهو أنسب لأنه المقصود بالذكر\n والمعنى: فليحذر الذين يخالفون عن طاعته ودينه وسنَّته، { أن تُصيبَهم فتنةٌ } محنة في الدنيا كقتل أو زلازل وأهوال، أو تسليط جائر، أو عدو، أو قسوة قلب\n أو كثرة دنيا استدراجاً وفتنة\n قال القشيري: سعادة الدارين في متابعة السُّنَّة، وشقاوتهما في مخالفتها، ومما يصيب من خالفها: سقوط حشمة الدين عن القلب\n هـ\n { أو يُصيبهم عذابٌ أليم } في الآخرة\n والآية تدل على أن الأمر للإيجاب، وكلمة \" أو \": لمنع الخلو، دون منع الجمع\n وإعادة الفعل صريحاً للاعتناء بالتهديد والتحذير\n { أَلاَ إنَّ لله ما في السمواتِ والأرضِ } من الموجودات، خلقاً وملكاً وتصرفاً، وإيجاداً وإعداماً، بَدْءاً وإعادةً، و \" ألاَ \": تنبيه على أن يخالفوا من له ما في السموات والأرض\n\n",
      "translations": []
    }
  ]
}