{
  "chapter": "الفرقان",
  "text": "اذا راتهم من مكانۭ بعيد سمعوا۟ لها تغيظا وزفيرا",
  "translations": [
    {
      "translation": "When it sees them coming from a long way off, they will hear it seething and rasping.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When (Hell) appears to them from a distance they will hear it raging and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it will see them from afar, they will hear the sounds of its raging and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if they were to see [this fire] from a distant place, they would only listen to its raging and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it will see them from afar, they will hear its raging and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it sees them from a far place, they will hear its raging and its roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it shall come into their sight from a distant place, they shall hear its vehement raging and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it sees them from a far place, they shall hear its bubbling and sighing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it seeth them from afar, they hear the crackling and the roar thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it sees them from afar, they will hear its raging and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it beholdeth them from afar, they shall hear it raging and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it sights them from a distant place, they will hear it raging and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it sees them from a place far off, they will hear its fury and its ranging sigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it (Hell) sees them from a far place, they will hear its raging and its roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it sees them from a far off place, they shall hear it raging and sighing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it sees them from a distant place, they will hear it raging and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Hellfire sees them from a distant place, they will hear its fury and roaring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:12] When it sees them from a distant place, they will hear it raging, boiling like an enraged person when his heart boils with anger, and roaring, [producing] a powerful noise. Alternatively, what is meant by their ‘hearing it raging’ is their vision of it and awareness of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِذَا رَأَتْهُمْ مِنْ مَكَانٍ بَعِيدٍ سَمِعُوا لَهَا تَغَيُّظًا وَزَفِيرًا (12) تخلص من اليأس من اقتناعهم إلى وصف السعير الذي أعد لهم ، وأجري على السعير ضمير { رأتهم } بالتأنيث لتأويل السعير بجهنم إذ هو علم عليها بالغلبة كما تقدم .وإسناد الرؤية إلى النار استعارة والمعنى : إذا سيقوا إليها فكانوا من النار بمكان ما يرى الرائي من وصل إليه سمعوا لها تغيظاً وزفيراً من مكان بعيد ، ويجوز أن يكون معنى : { رأتهم } رآهم ملائكتها أطلقوا منافذها فانطلقت ألسنتها بأصوات اللهيب كأصوات المتغيظ وزفيره فيكون إسناد الرؤية إلى جهنم مجازاً عقلياً .والتغيظ : شدة الغيظ . والغيظ : الغضب الشديد ، وتقدم عند قوله : { عضوا عليكم الأنامل من الغيظ } في سورة آل عمران )119 ). فصيغة التفعل هنا الموضوعة في الأصل لتكلف الفعل مستعملة مجازاً في قوته لأن المتكلف لفعل يأتي به كأشد ما يكون .والمراد به هنا صوت المتغيظ ، بقرينة تعلقه بفعل : { سمعوا } فهو تشبيه بليغ .والزفير : امتداد النفَس من شدة الغيظ وضيق الصدر ، أي صوتاً كالزفير فهو تشبيه بليغ أيضاً . ويجوز أن يكون الله قد خلق لجهنم إدراكاً للمرئيات بحيث تشتد أحوالها عند انطباع المرئيات فيها فتضطرب وتفيض وتتهيأ لالتهام بعثها فتحصل منها أصوات التغيظ والزفير فيكون إسناد الرؤية والتغيظ والزفير حقيقة ، وأمور العالم الأخرى لا تقاس على الأحوال المتعارفة في الدنيا .وعلى هذين الاحتمالين يحمل ما ورد في القرآن والحديث نحو قوله تعالى : { يوم نقول لجهنم هل امتلأت وتقول هل من مزيد } \\[ ق : 30 \\] ، وقول النبي صلى الله عليه وسلم \" اشتكت النار إلى ربها فقالت يا رب أكل بعضي بعضاً ، فأذن لها بنفسين نفس في الصيف ونفس في الشتاء \" رواه في «الموطأ» : زاد في رواية مسلم : \" فما ترون من شدة البرد فذلك من زمهريرها وما ترون من شدة الحر فهو من سَمُومها \"وجُعل إزجاؤهم إلى النار من مكان بعيد زيادة في الكناية بهم لأن بعد المكان يقتضي زيادة المشقة إلى الوصول ويقتضي طول الرعب مما سمعوا .ووصف وصولهم إلى جهنم من مكان بعيد ووضعهم فيها بقوله : { وإذا ألقوا منها مكاناً ضيقاً مقرَّنين دعوا هنالك ثبوراً } فصيغ نظمه في صورة توصيف ضجيج أهل النار من قوله : { دعوا هنالك ثبوراً } ، وأدمج في خلال ذلك وصف داخل جهنم ووصف وضع المشركين فيها بقوله : { مكاناً ضيقاً } وقوله : { مقرنين } تفنناً في أسلوب الكلام .\n\n",
      "translations": [
        {
          "translation": "(When it) the Fire (seeth them from afar) from a distance of 500 years, (they bear the cracking) the exasperation which is akin to that of human beings (and the roar) similar to the braying of a donkey (thereof) coming from the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بحيث { إِذَا رَأَتْهُمْ مِّن مَّكَانٍ بَعِيدٍ } يعني: إذا كانوا بمرأى العين منها مع أنهم بعيدون منها بمسافة طويلة { سَمِعُواْ لَهَا } مع بُعدها { تَغَيُّظاً } أي: صوتاً كصوت المغتاظ من شدة تلهبها وغليانها { وَزَفِيراً } [الفرقان: 12] أيضاً كزفرة المغتاظ\n والزفير في الأصل: ترديد النَّفَس حتى تنتفخ الضلوع\n يعني: من شدة غيظها لهم تغلي وتلتهب تلهباً شديداً\n وتردد نفسها ترديداً بليغاً حتى يردوا فيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إذا رَأَتْهُم } أي: النار\n أي: قابلتهم { من مكان بعيد } بأن كانت منهم بمرأى للناظرين في البُعد\n كقوله صلى الله عليه وسلم في شأن المؤمن والكافر:\n \" لا تترآءى نَاراهُما \" \n\n أي: لا يتقاربان بحيث تكون إحداهما بمرأى من الأخرى\n { سمعوا لها تغيُّظاً وزفيراً } أي: سمعوا صوت غليانها\n شُبه ذلك بصوت المتغيظ والزفير\n وهو صوت من جوفه\n ولا يبعد أن يخلق الله فيها الإدراك فتتغيظ وتزفر\n وقيل: إن ذلك من زبانيتها\n نُسب إليها\n وهو بعيد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:100",
      "similarity": 0.8574865664529115
    },
    {
      "verse": "11:106",
      "similarity": 0.47824201666883476
    },
    {
      "verse": "26:55",
      "similarity": 0.363976263684588
    },
    {
      "verse": "9:15",
      "similarity": 0.33467610743356085
    },
    {
      "verse": "33:25",
      "similarity": 0.2666371780137459
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/025012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/025012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}