{
  "chapter": "الفرقان",
  "text": "لهم فيها ما يشاءون خلدين كان على ربك وعدا مسـولا",
  "translations": [
    {
      "translation": "They will have in it whatever they want timelessly, for ever. It is a binding promise of your Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will they have whatever they wish, and there abide for ever.\" This is a promise incumbent on your Lord which will certainly be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "wherein they will get everything they desire and wherein they will dwell for ever. This is a promise which your Lord has taken upon Himself to fulfil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein they will eternally have whatever they want. This is a binding promise from your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“In it for them is all that they may desire, abiding in it for ever; a promise incumbent upon your Lord, that is prayed for.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them there will be therein all that they desire, and they will abide (therein forever). It is upon your Lord a Wa`dan Mas'ula.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have therein what they desire abiding (in it); it is a promise which it is proper to be prayed for from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein they shall have what they will dwelling forever; it is a promise binding upon thy Lord, and of Him to be required.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein abiding, they have all that they desire. It is for thy Lord a promise that must be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abiding there forever, they shall find in it all that they desire. This is a binding promise which your Lord has made.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Theirs therein shall be all that they wish for, as abiders; a promise from thy Lord to be asked for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they will have whatever they wish, abiding [forever]—a promise [much] besought, [binding] on your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them there will be therein all that they wish for: they will dwell (there) for aye: A promise to be prayed for from thy Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them there will be therein all that they desire, and they will abide (there forever). It is a promise binding upon your Lord that must be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Living there for ever, they shall find in it all that they desire. That is a promise binding upon your Lord, and to be asked of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have therein whatever they desire, forever. That is upon your Lord a binding promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them therein is whatever they wish, [while] abiding eternally. It is ever upon your Lord a promise [worthy to be] requested.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:16] In it they shall have what they wish, abiding [therein] — an irrevocable state — it, the promise to them of what is mentioned, is a promise binding on your Lord, [a promise] much besought, requested by those who have been promised it [as is clear from the following]: Our Lord, grant us what You have promised us through Your messengers [Q. 3:194], or requested on their behalf by the angels [who say]: Our Lord, and admit them into the Gardens of Eden which You have promised them [Q. 40:8].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therein) in the Garden (abiding) never to die or come out, (they have all that they desire) and wish. (It is for thy Lord a promise that must be fulfilled) they asked Him and He gave them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n حال كونهم { خالدين } لا يفنون، ولا يفنى ما هم فيه، { كان على ربك وعداً مسؤولاً } أي: موعوداً حقيقياً بأن يُسْأَلَ ويُطلب لكونه مما يتنافس فيه المتنافسون، أو: مسؤولاً لا يسأله الناس في دعائهم، بقولهم:\n\n\n\n[آل عمرآن: 194] أو: تسأله الملائكة بقولهم:\n\n[غافر: 8] وما في \" على \" من معنى الوجوب، لامتناع الخُلْفِ في عده تعالى، فكأنه أوجبه على نفسه تفضيلاً وإحساناً\n وفي التعرض لعنوان الربوبية مع الإضافة إلى ضميره صلى الله عليه وسلم من تشريفه والإشعار بأنه صلى الله عليه وسلم هو أول الفائزين بمغانم هذا الوعد الكريم ما لا يخفى\n قاله أبو السعود\n الإشارة: تبارك الذي إن شاء جعل ذلك خيراً من ذلك، وهي جنة المعارف المعجلة، تجري من تحتها أنهار العلوم وفيض المواهب، ويجعل لك قصوراً تنزل فيها، ثم ترحل عنها، وهي منازل السائرين ومقامات المقربين، إلى أن تسكن في محل الشهود والعيان، وهو العكوف في حضرة الإحسان\n بل كذَّبوا بالساعة، أي: من تنكب عن هذا الخير الجسيم، إنما سببه أنه فعل فِعْل من يُكذب بالساعة من الانهماك في الدنيا، والاشتغال بها عن زاد الآخرة\n وأَعتدنا لمن فعل ذلك سعيراً، أي: إحراقاً للقلب بالتعب، والحرص، والجزع والهلع، والإقبال على الدنيا، إذا قابلتهم من مكان بعيد سمعوا لها تَغَيُّظاً وزفيراً غيظاً على طلابها، حيث آثروها على ما فيه رضا مولاها، وإذا ألقوا في أشغالها، وضاق عليهم الزمان في إداركها، دعَوا بالويل والثبور، وذلك عند معاينة أعلام الموت، والرحيل إلى القبور، ولا ينفعهم ذلك\n قل: أذلك خير أم جنة الخلد؟ وهي جنة المعارف التي وُعد المتقون لكل ما سوى الله كانت لهم جزاء على مجاهدتهم وصَبْرهم، ومصيراً يصيرون إليها بأرواحهم وأسرارهم\n لهم فيها ما يشاؤون لكونهم حينئذٍ أمرهم بأمر الله، كان على ربك وعداً مسؤولاً، أي: مطلوباً للعارفين والسائرين\n وبالله التوفيق\n ثمَّ شرح ما يلقى أهل التكذيب من الهول والفظاعة، فقال: { وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُونَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:9",
      "similarity": 0.5479496852982041
    },
    {
      "verse": "78:1",
      "similarity": 0.3930204282540693
    },
    {
      "verse": "74:40",
      "similarity": 0.37727374299226457
    },
    {
      "verse": "26:109",
      "similarity": 0.3670039532750024
    },
    {
      "verse": "26:127",
      "similarity": 0.3670039532750024
    }
  ]
}