{
  "chapter": "الفرقان",
  "text": "واذا القوا۟ منها مكانا ضيقا مقرنين دعوا۟ هنالك ثبورا",
  "translations": [
    {
      "translation": "When they are flung into a narrow place in it, shackled together in chains, they will cry out there for destruction.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are cast within a narrow space of it chained together, they would plead for death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are chained together and flung into a narrow space therein, they will begin to call for death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are thrown, bound, into a narrow place therein, then only will they wish for their death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are thrown into a narrow place in it, bound in chains, they will pray for death in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they shall be thrown into a narrow place thereof, chained together, they will exclaim therein for destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are cast into a narrow place in it, bound, they shall there call out for destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are cast, coupled in fetters, into a narrow place of that Fire, they will call out there for destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are flung into a narrow place thereof, chained together, they pray for destruction there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are thrown into a narrow space, chained together, they will plead for death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are flung into a strait place thereof, bound Up, they shall call therein unto death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are cast into a narrow place in it, bound together [in chains], they will pray for [their own] annihilation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are cast, bound together into a constricted place therein, they will plead for destruction there and then!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they shall be thrown into a narrow place thereof, chained together, they will exclaim therein for destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when, chained in (iron) fetters, they are cast into some narrow space of the Fire, they will call out for destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are thrown into it, into a tight place, shackled, they will plead there for death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are thrown into a narrow place therein bound in chains, they will cry out thereupon for destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:13] And when they are flung into a narrow place thereof (read dayyiqan or dayqan, ‘narrow’, such that it constricts them; minhā, ‘thereof’, is a circumstantial qualifier referring to makānan, ‘place’, because it is actually an adjectival qualification of it) bound together, shackled, with their hands bound to their necks in chains (the use of the intensive form muqarranīna [as opposed to muqranīna] is meant to indicate a large number), they will at that point pray for [their own] annihilation, and it will be said to them:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they are flung into a narrow place) the narrowness of an arrowhead (thereof) in the Fire, (chained together) chained with the satans, (they pray for destruction there) at that point, in despair they pray.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { دَعَوْاْ هُنَالِكَ ثُبُوراً } معناه هَلكةً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Leave them there to perish\" [Qur'an 4:137] means destruction.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإَذَآ أُلْقُواْ مِنْهَا } أي: من النار { مَكَاناً } أي: في مكان من أمكنتها صار { ضَيِّقاً } لهم تشدد العذاب عليهم؛ بحيث صار كل منهم من ضيق { مُّقَرَّنِينَ } قرنت أيديهم إلى أعناقهم بالسلاسل والأغلال { دَعَوْاْ } وتمنوا من شدة حزنهم وكربهم { هُنَالِكَ ثُبُوراً } [الفرقان: 13] هلاكاً وويلاً، قائلين صائحين: واثبوراه! واويلاه! تعال تعال! وهذا وقت حلولك ونزولك، ويقال لهم حينئذ: { لاَّ تَدْعُواْ ٱلْيَوْمَ } أيها الجاهلون { ثُبُوراً وَاحِداً وَٱدْعُواْ ثُبُوراً كَثِيراً } [الفرقان: 14] إذ أنواع العذاب تتجدد عليكم دائماً، فاطلبوا الكل منها ثبوراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا أُلْقُوا منها } من النار { مكاناً ضَيِّقاً } أي: في مكان ضيق لأن الكرب يعظم مع الضيق، كما أن الروح يعظم مع السعة، وهو السر في وصف الجنة بأن عرضها السموات والأرض\n وعن ابن عباس وابن عمر - رضي الله عنهما -: تضيق جهنم عليهم، كما يضيق الزجُّ على الرمح\n\n\nوسئل النبي صلى الله عليه وسلم عن ذلك فقال:\n\n \" والذي نفسي بيده إنهم ليُستكرهون في النار كما يُستكره الوتد في الحائط \" \n\nحال كونهم { مُقرّنين } أي: مسلسلين، أي: مقرونين في السلاسل، قُرنت أيديهم إلى أعناقهم في الأغلال\n أو: يقرن مع كل كافر شيطانه في سلسة، وفي أرجلهم الأصفاد\n فإذا أُلقوا في الضيق، على هذا الوصف، { دَعَوا هنالك } أي: في ذلك المكان الهائل والحالة الفظيعة، { ثُبُوراً } أي: هلاكاً، بأن يقولوا: واثبوراه هذا حينُك فتعال، فيتمنون الهلاك ليستريحوا، فيقال لهم: { لا تدعوا اليوم ثُبوراً واحداً وادعوا ثُبوراً كثيراً } أي: لا تدعوا بالهلاك على أنفسكم مرة واحدة، ودعاءً واحداً، بل ادعوا دعاء متعدداً بأدعية كثيرة، فإن ما أنتم عليه من العذاب لغاية شدته وطول مدته، مستوجب لتكرر الدعاء في كل أوان\n وهو يدل على فظاعة العذاب وهوله\n وأما ما قيل من أن المعنى: إنكم وقعتم فيما ليس ثبوركم فيه واحداً، وإنما هو ثبور كثير، إما لأن العذاب أنواع وألوان، كل نوع منها ثبور لشدته وفظاعته، أو: لأنهم كلما نضجت جلودهم بُدلوا غيرها، فلا غاية لها، فلا يلائم المقام\n انظر أبا السعود\n وعن أنس رضي الله عنه قال: قال النبي صلى الله عليه وسلم:\n\n \" أولُ من يُكْسَى حُلَّةً من النار إبليسُ، فيضعُها على حاجبيه، ويسحبُها من خلفه، وذُريتُهُ من بعده، وهو يقول: يا ثُبُوراه، وهم يجاوبونه: يا ثُبُورهم، حتى يَقِفُوا على النار، فيقال لهم: لا تدعوا ثبوراً واحداً\n\n\n \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:14",
      "similarity": 0.6632253954455475
    },
    {
      "verse": "84:11",
      "similarity": 0.6629579927206515
    },
    {
      "verse": "17:102",
      "similarity": 0.6225029490763812
    },
    {
      "verse": "18:44",
      "similarity": 0.3310112448424915
    },
    {
      "verse": "7:119",
      "similarity": 0.30928143015126036
    }
  ]
}