{
  "chapter": "الفرقان",
  "text": "فقد كذبوكم بما تقولون فما تستطيعون صرفا ولا نصرا ومن يظلم منكم نذقه عذابا كبيرا",
  "translations": [
    {
      "translation": "So now they have disowned you for what you said, and they cannot avert it or give you any help. As for anyone among you who has done wrong, We will make him suffer great punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The idolaters will be told): \"Your gods have refuted your assertion. You can neither avert (your doom) nor receive any help. We shall make the wicked among you taste of severe punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus will your gods deny alI that you are professing today. Then you shall neither be able to repel your punishment nor shall get any help from anywhere; and whoso is guilty. of iniquity'' among you, We shall make him taste a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say (to the idolaters), \"Your idols have rejected your faith. You cannot avoid their rejection nor can you find any help. Anyone of you who commits injustice will be made to suffer a great torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So the deities have belied what you state – so now you can neither avert the punishment nor help yourself; and whoever among you is unjust, We shall make him taste a terrible punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus they will deny you in what you say; then you can neither avert nor find help. And whoever among you does wrong, We shall make him taste a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they shall indeed give you the lie in what you say, then you shall not be able to ward off or help, and whoever among you is unjust, We will make him taste a great chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Remembrance, and were a people corrupt.' So they cried lies touching the things you say, and you can neither turn it aside, nor find any help. Whosoever of you does evil, We shall let him taste a great chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus they will give you the lie regarding what ye say, then ye can neither avert (the doom) nor obtain help. And whoso among you doeth wrong, We shall make him taste great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[God will say], \"Now, they have given the lie to all your assertions, and you can neither ward off [your punishment] nor obtain any help.\" For, whoever of you has committed evil, shall be caused by Us to taste great suffering!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So now they belie you in that which ye said; so ye are not able to obtain diversion nor help. And who soever of you doth wrong, him We shall make taste a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they will certainly impugn you in what you say, and you will neither be able to circumvent [punishment] nor find help, and whoever of you does wrong, We shall make him taste a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah will say): \"Now have they proved you liars in what ye say: so ye cannot avert (your penalty) nor (get) help.\" And whoever among you does wrong, him shall We cause to taste of a grievous Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus they (false gods all deities other than Allah) will give you (polytheists) the lie regarding what you say (that they are gods besides Allah), then you can neither avert (the punishment), nor get help. And whoever among you does wrong (i.e. sets up rivals to Allah), We shall make him taste a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they belie what you say, and you can neither turn it aside, nor find any help. Those of you who have done evil, We let them taste a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have denied you because of what you say; so you can neither avert, nor help. Whoever among you commits injustice, We will make him taste a grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they will deny you, [disbelievers], in what you say, and you cannot avert [punishment] or [find] help. And whoever commits injustice among you - We will make him taste a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:19] Thus they will deny you, that is, the ones who were worshipped denied those who worshipped [them], in what you allege, namely, that they are gods, and they will neither be able to (read yastatī‘ūna, or [second person plural] tastatī‘ūna) in other words, neither they nor you will be able to, circumvent, ward off the chastisement from you, nor help, nor protect you from it. And whoever of you does evil, [whoever] ascribes partners to God, We shall make him taste an awful, a severe, chastisement, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus they will give you the lie regarding what ye say, then ye) i.e. the disbelievers (can neither avert) avert the angels, and it is said this means: avert the idols from testifying against them or avert the chastisement from themselves (nor obtain help) backup. (And whoso among you doeth wrong) whoever among you, Muslims, disbelieves; it is also said that this means: whosever of you, disbelievers, remains firm in his disbelief, (We shall make him taste great torment) in the Fire. 398\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قيل للمشركين من قِبل الحق: { فَقَدْ كَذَّبُوكُمْ } آلهتكم أيها الضالون { بِمَا تَقُولُونَ } أنهم آلهتنا، أو بما يقولون هؤلاء وأضلونا، أو بقولكم: هؤلاء شفعاؤنا { فَمَا تَسْتَطِيعُونَ } أي: فالآن ظهر ولاح أن آلهتكم وشفعاءكم لا يقدرون { صَرْفاً } من عذابنا شيئاً { وَلاَ } يقدرون أيضاً { نَصْراً } لكم؛ لتصرفوا عذابنا عن نفوسكم بمعاونتهم، ولا شفاعة عندنا؛ لتخفيف العذاب عنكم { وَ } بالجملة: { مَن يَظْلِم مِّنكُمْ } أيها لامشركون نفسه باتخاذ غيرنا إلهاً عناداً ومكابرة، ولم يتب عن ذلك حتى خرج من الدنيا عليه { نُذِقْهُ } الأمر؛ أي: يوم الجزاء { عَذَاباً كَبِيراً } [الفرقان: 19] لا عذاب أكبر منه\n\n\n\n\nثم أشار سبحانه إلى تسلية حبيبه صلى الله عليه وسلم عما عيره الجهلة المستهزئون معه بقولهم:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nثم يقال للكافر بطريق الالتفات: { فقد كَذَّبوكم بما تقولون } ، وهو احتجاج من الله تعالى على العبدة مبالغة في تقريعهم وتبكيتهم على تقدير قول مرتب على الجواب، أي: فقال الله جل جلاله عند ذلك للعبدة: فقد كذبكم المعبودون أيها الكفرة، { بما تقولون } أي: في قولكم: هؤلاء أضلونا\n والباء بمعنى \" في \" ، وعن قنبل: بالياء، والمعنى: فقد كذبوكم بقولهم: { سُبْحَانَكَ مَا كَانَ يَنبَغِي لَنَآ أَن نَّتَّخِذَ مِن دُونِكَ مِنْ أَوْلِيَآءَ } ، والباء حينئذٍ كقولك: كتبت بالقلم\n { فما يستطيعون } فما يملكون { صَرْفاً } دفعاً للعذاب عنكم { ولا نصراً } أي: فرداً من أفراد النصر\n والمعنى: فما تستطيع آلهتكم أن يصرفوا عنكم العذاب أو ينصروكم\n وعن حفص بالتاء، أي: فما تستطيعون أنتم أيها الكفرة صرفاً للعذاب عنكم، ولا نصر أنفسكم\n ثم خاطب المكلَّفين على العموم فقال: { ومن يَظْلِمْ منكم } يشرك بدليل قوله:\n\n[لقمان: 13] لأن الظلم: وضع الشيء في غير محله، ومن جعل المخلوق شريكاً لخالقه فقد ظلم ظلماً عظيماً\n أي: ومن يظلم منكم أيها المكلفون، كدأب هؤلاء الكفرة، حيث ركبوا متن المكابرة والعناد، واستمروا على الملاججة والفساد، { نُذقْهُ } في الآخرة { عذاباً كبيراً } لا يقادر قدره، وهو الخلود في النار، والعياذ بالله\n الإشارة: كل من عشق شيئاً وأحبه من دون الله فهو عابد له، فرداً أو متعدداً، فيُحشر معه يوم القيامة، فيقال لهم: أأنتم أضللتم عبادي هؤلاء، أم هم ضلوا السبيل؟ فيتبرؤون منهم، ويقولون: بل متعتهم بالدنيا، وألهيتهم عن الذكر والتفكر والاعتبار، أو عن الشهود والاستبصار، حتى نسوا ذكر الله وكانوا قوماً بوراً\n وقد ورد: أن الدنيا تُبعث يوم القيامة على هيئة عجوز شمطاء زرقاء، فتنادي: أين أولادي؟ فيجمعون لها كرهاً، فتقدمهم، فتوردهم النار\n وقوله تعالى: { ومن يظلم منكم } أي: يخرج عن حد الاستقامة في العبودية، وشهود عظمة الربوبية، نُذقه عذاباً كبيراً، وهو ضرب الحجاب على سبيل الدوام، إلا وقتاً مخصوصاً مع العوام\n وبالله التوفيق\n ثمَّ أجاب الحق تعالى عن قول الكفرة { مَالِ هَـٰذَا ٱلرَّسُولِ يَأْكُلُ ٱلطَّعَامَ } إلخ، فقال: { وَمَآ أَرْسَلْنَا قَبْلَكَ مِنَ ٱلْمُرْسَلِينَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:47",
      "similarity": 0.45049472505467747
    },
    {
      "verse": "6:16",
      "similarity": 0.42360840694555835
    },
    {
      "verse": "18:54",
      "similarity": 0.36999785659755435
    },
    {
      "verse": "12:34",
      "similarity": 0.3571631168216449
    },
    {
      "verse": "46:27",
      "similarity": 0.3437323492894313
    }
  ]
}