{
  "chapter": "الفرقان",
  "text": "ويوم يحشرهم وما يعبدون من دون الله فيقول ءانتم اضللتم عبادى هؤلاء ام هم ضلوا۟ السبيل",
  "translations": [
    {
      "translation": "On the Day We gather them together, and those they worship besides Allah, and say, 'Did you misguide these slaves of Mine or did they stray from the way of their own accord?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day He will gather them together along with those they worshipped other than God, He will ask them: \"Did you lure these creatures of Mine away, or did they themselves go astray?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that Day (your Lord will gather these people together as well as their deities, whom they worship besides AIlah. Then He will ask them, \"Did you mislead these servants of Mine, or did they themselves go astray?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the unbelievers and whatever they had been worshipping besides God will be resurrected, He will ask the idols, \"Did you mislead My servants or did they themselves go astray from the right path?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when He will assemble them and all what they worship instead of Allah – then will say to those deities, “Did you mislead my bondmen or did they themselves forget the path?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when He will gather them together and that which they worship besides Allah. He will say: \"Was it you who misled these My servants or did they stray from the path\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when He shall gather them, and whatever they served besides Allah, He shall say: Was it you who led astray these My servants, or did they themselves go astray from the path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when He shall muster them and that they serve, apart from God, and He shall say, 'Was it you that led these My servants astray, or did they themselves err from the way?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when He will assemble them and that which they worship instead of Allah and will say: Was it ye who misled these my slaves or did they (themselves) wander from the way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day He gathers them all together with those they worship besides Him, He will say, \"Was it you who misled My servants, or did they stray away by themselves?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Dav whereon He will gather them and that v; hich they worship beside Allah and will say. are ye the ones who sent astray these My bondmen; or strayed they themselves from the way!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day that He will muster them and those whom they worship besides Allah, He will say, ‘Was it you who led astray these servants of Mine, or did they themselves stray from the way?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day He will gather them together as well as those whom they worship besides Allah, He will ask: \"Was it ye who let these My servants astray, or did they stray from the Path themselves?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when He will gather them together and that which they worship besides Allah [idols, angels, pious men, saints, 'Iesa (Jesus) - son of Maryam (Mary), etc.]. He will say: \"Was it you who misled these My slaves or did they (themselves) stray from the (Right) Path?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He gathers them with all that they worship, other than Allah, He will say: 'Was it you who misled My worshipers, or did they themselves go astray'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He gathers them, and what they worshiped besides God, He will say, “Was it you who misled these servants of Mine, or was it they who lost the way?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] the Day He will gather them and that which they worship besides Allah and will say, \"Did you mislead these, My servants, or did they [themselves] stray from the way?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:17] And on the day when He will assemble them (yahshuruhum; a variant reading has nahshuruhum, ‘We assemble them’) and that which they worship besides God, that is, other than Him, such as the angels, Jesus, Ezra and the jinn, and will say, exalted be He, (fa-yaqūlu; a variant has fa-naqūlu, and We shall say’) to those who were worshipped, as a way of establishing the argument against the worshippers [of the former]: ‘Was it you (read a-antum pronouncing both hamzas, or by substituting the second one with an alif, or not pronouncing this [last] and inserting an alif between the one not pronounced and the former, or without [such an insertion]) who misled these servants of Mine, causing them to fall into error by commanding them to worship you, or did they go astray from the way?, the path of truth, by themselves?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And on the day) which is the Day of Judgement (when He will assemble them) i.e. those who worship idols (and that which they worship instead of Allah) of idols (and will say) Allah will say to the idols; and it is said: He will say to the angels: (Was it ye who misled these my slaves) from My obedience and commanded them to worship you (or did they (themselves) wander from the way) and worshipped you out of their own whims?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وحذِّرهم { يَوْمَ يَحْشُرُهُمْ } ونبعثهم للعرض والجزاء { وَ } نحشر أيضاً { مَا يَعْبُدُونَ مِن دُونِ ٱللَّهِ } الواحد الأحد الصمد\n أي: آلهتهم الذين يعبدونهم كعبادة الله\n كالملائكة وعزير وعيسى والجن والكواكب والأصنام\n عبَّر سبحانه عن آلهتهم بـ (ما)\n مع أن بعضهم عقلاء لعموم (ما)\n أي: إنها تستعمل في عاقل وغيره\n أو للتغليب\n أو باعتبار ما يعتقدون ويتخذون آلهة من تلقاء نفوسهم\n لا حقيقة لها سوى الاعتبار\n لأنهم لا يرضون باتخاذهم\n وبعدما حشر الآلهة ومتخذوهم مجتميعن { فَيَقُولُ } الله سبحانه مستفهماً للآلهة على سبيل التوبيخ والتبكيت لمتخذيهم: { أَأَنتُمْ أَضْلَلْتُمْ عِبَادِي هَؤُلاَءِ أَمْ هُمْ ضَلُّوا ٱلسَّبِيلَ } [الفرقان: 17] عن عبادتي\n ودعوتموهم إلى عبادة نفوسكم مدعين أنتم الشركة معي؟",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" اتخذ \" قد يتعدى إلى مفعول واحد\n كقوله:\n[الأنبياء: 8]\n وقد يتعدى إلى مفعولين\n كقوله:\n[النساء: 125] فقرأ الجمهور: أن نَتَّخِذَ بالبناء لفاعل\n وقرأ الحسن وأبو جعفر بالبناء للمفعول\n فالقراءة الأولى على تعديته لواحد\n والثانية على تعديته لاثنين\n فالأول: الضمير في نتخذ\n والثاني: من أولياء\n و مِن: للتبعيض\n أي: ما ينبغي لنا أن نتخذ بعضَ أولياءٍ من دونك لأن \" من \" لا تزاد في المفعول الثاني\n بل في الأول\n تقول: ما اتخذت من أحد وليّاً\n ولا تقول: ما اتخذت أحداً من ولي\n وأنكر القراءة أبو عمرُو بن العلاء وغيره\n وهو محجوج لأن قراءة أبي جعفر من المتواتر\n يقول الحق جل جلاله: { و } اذكر { يوم نحشرهم } \n أو: يوم يحشرهم الله جميعاً للبعث والحساب\n يكون ما لا تفي به العبارة من الأهوال الفظيعة والأحوال الغريبة\n فيحشرهم { وما يعبدون من دون الله } من الملائكة والمسيح وعزير\n وعن الكلبي: الأصنام يُنطقها الله\n وقيل: عام في الجميع\n وما: يتناول العقلاء وغيرهم لأنه أريد به الوصف\n كأنه قيل: ومعبودهم\n { فيقول } الحق جل جلاله للمعبودين\n إثر حشر الكل تقريعاً للعَبَدة وتبكيتاً: { أأنتم أَضْلَلْتُمْ عبادِي هؤلاء } \n بأن دعوتموهم إلى عبادتكم\n { أم هم ضلُّوا السبيل } أي: عن السبيل بأنفسهم بإخلالهم بالنظر الصحيح\n وإعراضهم عن الرشد\n وتقديم الضميريْن على الفعلين بحيث لم يقل: أضللتم عبادي هؤلاء أم ضلوا السبيل لأن السؤال ليس عن نفس الفعل\n وإنما هو عن متوليه والمتصدي له\n فلا بد من ذكره\n وإيلائه حرف الاستفهام ليعلم أنه المسؤول عنه\n وفائدة سؤالهم\n مع علمه تعالى بالمسؤول عنه لأن يجيبوا بما أجابوا به حتى يُبكت عبدتهم بتكذيبهم إياهم\n فتزيد حسرتهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:22",
      "similarity": 0.49955551754176797
    },
    {
      "verse": "46:6",
      "similarity": 0.4896633765104639
    },
    {
      "verse": "15:25",
      "similarity": 0.48442455450419275
    },
    {
      "verse": "34:40",
      "similarity": 0.4435121556131858
    },
    {
      "verse": "25:34",
      "similarity": 0.4395539529669314
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/25:17.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/25:17.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}