{
  "chapter": "الفرقان",
  "text": "تبارك الذى نزل الفرقان على عبده ليكون للعلمين نذيرا",
  "translations": [
    {
      "translation": "Blessed be He who has sent down the Furqan to His slave so that he can be a warner to all beings;",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "BLESSED IS HE who revealed the Criterion (of right and wrong) to His votary that it may be a warning for the world, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Highly blessed is He, Who has sent down Al-Furqan, to His servant so that it may be a warner to all mankind:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who has revealed the criteria (for discerning truth from falsehood) to His servant so that He could warn mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most Auspicious is He Who has sent down the Furqan (the Criterion – the Holy Qur’an) upon His chosen bondman for him to be a Herald of Warning to the entire world. (Prophet Mohammed – peace and blessings be upon him – is the Prophet towards all mankind.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He Who sent down (Nazzala) the criterion to His servant that he may be a warner to all nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He Who sent down the Furqan upon His servant that he may be a warner to the nations;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He who has sent down the Salvation upon His servant, that he may be a warner to all beings;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He Who hath revealed unto His slave the Criterion (of right and wrong), that he may be a warner to the peoples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He who has revealed the criterion [the Quran] to His servant that he may warn the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blest be He who hath revealed the Criterion unto His bondman thathe may be unto the worlds a warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who sent down the Criterion to His servant that he may be a warner to all the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who sent down the criterion to His servant, that it may be an admonition to all creatures;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He Who sent down the criterion (of right and wrong, i.e. this Quran) to His slave (Muhammad SAW) that he may be a warner to the 'Alamin (mankind and jinns).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who has sent down the Criterion to His worshiper (Prophet Muhammad), that he is a warner to all mankind;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who sent down the Criterion upon His servant, to be a warning to humanity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who sent down the Criterion upon His Servant that he may be to the worlds a warner -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:1] Blessed, exalted, is He Who revealed the Criterion (al-furqān), the Qur’ān — called thus [al-furqān] because it has discriminated (faraqa) between truth and falsehood — to His servant, Muhammad (s), that he may be to all the worlds, [to] mankind and the jinn, but not the angels, a warner, a threatening of God’s chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (Blessed is): '(Blessed is) He says: He is the Possessor of grace; it is also said that this means: He is exalted and transcendent above and exonerated from having a son or partner (He Who hath revealed unto His slave) Muhammad (pbuh) (the Criterion (of right and wrong)) He Who sent Gabriel with the Qur'an, (that he) Muhammad (pbuh) (may be a warner) a Messenger warning by the Qur'an (to the peoples) the jinn and human beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ تبارك الذي } أي: تكاثر خير الذي { نزّل الفرقان } وتزايد\n لأن إنزال الفرقان هو إظهار العقل الفرقاني المخصوص بعبده المخصوص به بانفراده من جملة العالمين بالاستعداد الكامل الذي لم يكن لأحد مثله\n فيكون عقله الفرقاني هو العقل المحيط المسمى عقل الكل\n الجامع لكمالات جميع العقول\n وذلك إنما يكون بظهوره تعالى في مظهره المحمدي بجميع صفاته المفيض بها على جميع الخلائق على اختلاف استعداداتهم\n وذلك الظهور هو تكثر الخير وتزايده الذي لم يمكن أزيد ولا أكثر منه\n ولذلك قال: { ليكون للعالمين نذيراً } أي: على العموم\n فإن كل نبيّ غيره كانت رسالته مخصوصة بمن ناسب استعداده من الخلائق\n ورسالته عليه السلام عامة للكل\n وهو بعينه معنى ختم النبوّة ومن هذا تبين كون أمتة خير الأمم\n { الذي له مُلْك السماوات والأرض } يقهرهما تحت ملكوته\n أوجد كل شيء موسوماً\n يتعين بسمة الإمكان",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تَبَارَكَ } تعاظم وتعالى ذاته سبحانه من أن يحيط بمنافعه وكثرة خيراته وبركاته عقول مظاهره ومصنوعاته\n حتى يعدوها بألسنتهم\n ويعبروا عنها بأفواههم حالاً ومقالاً { ٱلَّذِي نَزَّلَ } بمقتضى جوده الواسع وكرمه الكامل { ٱلْفُرْقَانَ } الجامع لفوائد الكتب السالفة مع زوائد خلت عنها تلك الكتب تفضلاً وامتناناً\n ومزيد اهتمام { عَلَىٰ } شأن { عَبْدِهِ } صلى الله عليه وسلم بعدما هيأه لقبوله\n وأعدَّه لنزوله\n ورباه أربعين سنة تتميماً لأمر المناسبة المعنوية وتحصيلاتها\n حتى يستحق ويستعد للإلهام والوحي\n وإنما أنزل هذا { لِيَكُونَ لِلْعَالَمِينَ } أي: كافة المخلوقين على فطرة التكليف\n وعامة المجبولين على استعدد المعرفة { نَذِيراً } [الفرقان: 1] ينذرهم ويحذرهم عما يضرهم\n ويغويهم عن صراط الحق وطريق توحيده عناية منه سبحانه إياهم\n ومرشداً لهم إلى مبدئهم\n\n\nوكيف لا يرشدهم سبحانه وهو { ٱلَّذِي لَهُ مُلْكُ ٱلسَّمَٰوَٰتِ } أي: عالم الأسماء والصفات المعبر عنها بالعلويات { وَٱلأَرْضِ } أي: الطبائع السفلية القابلة للانعكاس من العلويات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { تبارك } أي: تكاثر خيره وتزايد\n أو: دام واتصل\n وهي كلمة تعظيم لم تستعمل إلا لله\n والمستعمل منها الماضي فقط\n والتفاعل فيها للمبالغة\n ومعناها راجع إلى ما يفيض سبحانه على مخلوقاته من فنون الخيرات\n التي من جملتها: تنزيل القرآن\n المنطوي على جميع الخيرات الدينية والدنيوية\n أي:تعاظم { الذي نَزَّلَ الفرقانَ } أي: القرآن\n مصدر فرق بين اثنين\n إذا فصل بينهما\n سمي به القرآن لفصله بين الحق والباطل\n والحلال والحرام\n أو: لأنه لم ينزل جملة\n ولكن مفروقاً مفصولاً بين أجزائه شيئاً فشيئاً\n ألا ترى إلى قوله:\n[الإسراء: 106]\n أنزله { على عبده } محمد صلى الله عليه وسلم\n وإيراده - عليه الصلاة والسلام - بذلك العنوان لتشريفه\n والإيذان بكونه في أقصى مراتب العبودية\n والتنبيه على أن الرسل لا يكون إلا عبداً للمُرسل رداً على النصارى\n أنزله { ليكون } العبد المنزل عليه\n أو الفرقان { للعالمين } من الثقلين\n زاد بعضهم: والملائكة أرسل إليهم ليتأدبوا بأدبه\n حيث لم يقف مع مقام ولا حال\n ويقتبسوا من أنواره\n وهو حكمة الإسرار\n وقيل: حتى إلى الحيوانات والجمادات\n أُمرت بطاعته فيما يأمرها به\n وبتعظيمه - عليه الصلاة والسلام - وهذا كله داخل في العالمين لأن ما سوى الله كله عالم كما تقدم في الفاتحة\n وعموم الرسالة من خصائصه - عليه الصلاة والسلام -\n { نذيراً } أي: مخوِّفاً\n وعدم التعرض للتبشير لأن الكلام مسوق لأحوال الكفرة\n ولا بشارة لهم\n { الذي له مُلكُ السموات والأرضِ } أي: له\n خاصةً\n دون غيره\n لا استقلالاً ولا اشتراكاً\n فالقهرية لازمة لهما\n المستلزمة للقدرة التامة والتصرف الكلي\n إيجاداً وإعداماً\n وإحياءً وإماتةً\n وأمراً ونهياً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:3",
      "similarity": 0.7108340343684152
    },
    {
      "verse": "23:29",
      "similarity": 0.6401990018210256
    },
    {
      "verse": "6:155",
      "similarity": 0.5333653883012618
    },
    {
      "verse": "67:1",
      "similarity": 0.5139920688208652
    },
    {
      "verse": "21:50",
      "similarity": 0.5079330965858856
    }
  ]
}