{
  "chapter": "الفرقان",
  "text": "قل اذلك خير ام جنة الخلد التى وعد المتقون كانت لهم جزاء ومصيرا",
  "translations": [
    {
      "translation": "Say: 'Is that better, or the Garden of Eternal Life which has been promised to those who have taqwa? That is their recompense and destination.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: \"Is this better or a garden for everlasting abode which has been promised the pious and devout? It would be their guerdon and their destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them \"Is this (Fire) better or the everlasting Garden which has been promised to the God-fearing righteous people?\" which will be the recompense of their good deeds and the final destination of their journey\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Is what you want better or the eternal garden promised to the pious ones as their reward and dwelling?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Is this better or the Everlasting Gardens which are promised to those who fear? That is their reward and their outcome.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Is that better or the Paradise of Eternity which is promised to those who have Taqwa\" It will be theirs as a reward and final destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Is this better or the abiding garden which those who guard (against evil) are promised? That shall be a reward and a resort for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Is that better, or the Garden of Eternity, that is promised to the godfearing, and is their recompense and homecoming?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Is that (doom) better or the Garden of Immortality which is promised unto those who ward off (evil)? It will be their reward and journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Which is better, this or the Paradise of immortality which the righteous have been promised? It is their recompense and their destination.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: in that better or Garden of Abidence that hath been promised to the God-fearing! It shall be theirs as a recompense and a retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Is that better, or the everlasting paradise promised to the Godwary, which will be their reward and destination?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Is that best, or the eternal garden, promised to the righteous? for them, that is a reward as well as a goal (of attainment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: (O Muhammad SAW) \"Is that (torment) better or the Paradise of Eternity promised to the Muttaqun (pious and righteous persons - see V. 2:2)?\" It will be theirs as a reward and as a final destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Is that better, or the Garden of Eternity which the cautious have been promised? It is their recompense and their arrival'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Is this better, or the Garden of Eternity promised to the righteous? It is for them a reward and a destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Is that better or the Garden of Eternity which is promised to the righteous? It will be for them a reward and destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:15] Say: ‘Is that, which is mentioned of the threat of chastisement and the description of the Fire, better, or the Garden of Immortality which has been promised to the God-fearing, which will be, in God’s knowledge, exalted be He, their requital, [their] reward, and journey’s end?’, [their] place of return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca, Abu Jahl and his host: (Is that (doom)) are destruction and fire which I mentioned to you (better or the Garden of Immortality) for Muhammad and his Companions (which is promised unto those who ward off (evil)) disbelief, idolatry and indecencies? (It) the Garden of Immortality (will be their reward and journey's end) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل موبخاً عليهم\n ومعيراً بعدما بيَّنت لهم منقلبهم ومثواهم في الآخرة { أَذٰلِكَ } السعير الذي سمعتم وصفه\n أو المعنى: أذلك الجنة التي إمِلتم من جنات الدنيا ومنتزهاتها { خَيْرٌ } مرجعاً ومصيراً { أَمْ جَنَّةُ ٱلْخُلْدِ } المؤبد المخلد أهلها فيها بلا تبديل وتغيير { ٱلَّتِي وُعِدَ ٱلْمُتَّقُونَ } بدخولها حتى { كَانَتْ لَهُمْ جَزَآءً } لأعمالهم الصالحة التي أتوا بها في النشأة الأولى\n وصارت بدلاً من مستلذاتها الفانية { وَمَصِيراً } [الفرقان: 15] أي: مرجعاً ومنقلباً لهم بعدما خرجوا من الدنيا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ قل } لهم يا محمد تقريعاً لهم وتهكماً بهم\n وتحسراً على ما فاتهم: { أذلك خيرٌ } \n والإشارة إلى السعير\n باعتبار اتصافها بما فُصِّل من الأحوال الهائلة\n وما فيه من معنى البُعد لكونها في الغاية القاصية من الهول والفظاعة\n أي: قل لهم أذلك الذي ذكر من السعير\n التي أعدت لمن كذب بالساعة\n وشأنها كيت وكيت خير { أم جنةُ الخُلد التي وُعِدَ المتقون } أي: وعدها الله المتقين؟ وإنما قال: \" أذلك خير \" \n ولا خير في النار تهكماً بهم\n كما تقدم\n وإضافة الجنة إلى الخلد للمدح\n وقيل: للتميز عن جنات الدنيا\n والمراد بالمتقين: المتصفون بمطلق التقوى\n لا بغايتها\n { كانت } تلك الجنة { لهم } في علم الله تعالى\n أو في اللوح\n { جزاءً } على أعمالهم\n { ومصيراً } يصيرون إليه بعد الموت\n { لهم فيها ما يشاؤون } من فنون الملاذ والمشتهيات\n وأنواع النعيم والخيرات\n كقوله تعالى:\n[الزخرف: 71]\n ولعل كل فريق منهم يقنع بما أتيح له من درجات النعيم\n ولا تمتد أعناق همهم إلى ما فوق ذلك من المراتب العالية\n فلا يلزم الحرمان\n ولا تساوى أهل الجنان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:10",
      "similarity": 0.5345855058231572
    },
    {
      "verse": "24:42",
      "similarity": 0.5040167950696218
    },
    {
      "verse": "50:43",
      "similarity": 0.49089311374209504
    },
    {
      "verse": "67:6",
      "similarity": 0.4442460838972552
    },
    {
      "verse": "46:14",
      "similarity": 0.41036446111339314
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/25:15.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/25:15.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/25:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}