{
  "chapter": "الفرقان",
  "text": "قالوا۟ سبحنك ما كان ينۢبغى لنا ان نتخذ من دونك من اولياء ولكن متعتهم وءاباءهم حتى نسوا۟ الذكر وكانوا۟ قومۢا بورا",
  "translations": [
    {
      "translation": "they will say, 'Glory be to You! It would not have been fitting for us to have taken any protectors apart from You. But You let them and their fathers enjoy themselves so that they forgot the Reminder. They were people devoid of good.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will answer: \"Glory to You. It was not worthy of us to seek any protector other than You. But You allowed them and their fathers a life of ease until they turned oblivious of the Reminder. They were a people impenitent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will answer, \"Glory be to Thee! We dared not take anyguardian besides Thee: (they were misled because) Thou didst give them and their forefathers all the good things of life till they forgot the Admonition, and incurred the punishment. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will reply, \"Lord, You alone deserve all glory! We were not supposed to choose any guardian other than you. Since you have been benevolent to these people and their fathers, they forgot Your guidance and, thus, became subject to perdition.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will submit, “Purity is to You – it was not rightful for us to appoint any Master besides You; but You gave them and their forefathers usage to the extent that they forgot Your Remembrance; and they were indeed the people who destroy themselves.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Glorified be You! It was not for us to take any Awliya' besides You, but You gave them and their fathers comfort till they forgot the warning, and became a lost people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: Glory be to Thee; it was not beseeming for us that we should take any guardians besides Thee, but Thou didst make them and their fathers to enjoy until they forsook the reminder, and they were a people in perdition,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall 'Glory be to Thee! It did not behove us to take unto say, ourselves protectors apart from Thee; but Thou gavest them and their fathers enjoyment of days, until they forgot\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: Be Thou Glorified! it was not for us to choose any protecting friends beside thee; but Thou didst give them and their fathers ease till they forgot the warning and became lost folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will answer, \"Hallowed be You! It was not proper for us to choose any guardian other than You. But You gave them and their fathers the comforts of this life, so that they forgot Your reminder and thus brought destruction upon themselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say; hallowed be Thou! it behoved us not that we should take beside Thee any patron, but Thou allovvedest them and their fathers enjoyment Until they forgat the admonition, and they were a people doomed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘Immaculate are You! It does not behoove us to take any wali in Your stead! But You provided for them and their fathers until they forgot the Reminder, and they were a ruined lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Glory to Thee! not meet was it for us that we should take for protectors others besides Thee: But Thou didst bestow, on them and their fathers, good things (in life), until they forgot the Message: for they were a people (worthless and) lost.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Glorified be You! It was not for us to take any Auliya' (Protectors, Helpers, etc.) besides You, but You gave them and their fathers comfort till they forgot the warning, and became a lost people (doomed to total loss).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will answer: 'Exaltations to You. We should not have taken others for a guardian, but You gave them and their fathers enjoyment until they forgot Your Remembrance and they were a destroyed nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “Glory be to You. It was not for us to take any lords besides You. But you gave them enjoyments, and their ancestors, until they forgot the Message, and became ruined people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Exalted are You! It was not for us to take besides You any allies. But You provided comforts for them and their fathers until they forgot the message and became a people ruined.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:18] They will say, ‘Glory be to You — exalted be You above what does not befit You! It was not, it would [not] have been right, for us to take any guardians besides You, that is, other than You (min awliyā’a, the first direct object, the min being extra, [added] to emphasise the negation; the preceding [min dūnika, ‘besides You’] is the second [direct object]). So how can we command that we be worshipped? But You gave them and their fathers, before them, ease [of living], by granting [them] long life and abundant provision, until   they forgot the Remembrance, [until] they became remiss about admonitions and belief in the Qur’ān, and became a lost folk’, [a folk] destroyed. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالُوا سُبْحَانَكَ مَا كَانَ يَنْبَغِي لَنَا أَنْ نَتَّخِذَ مِنْ دُونِكَ مِنْ أَوْلِيَاءَ وَلَكِنْ مَتَّعْتَهُمْ وَآَبَاءَهُمْ حَتَّى نَسُوا الذِّكْرَ وَكَانُوا قَوْمًا بُورًا (18)وقولهم : { سبحانك } كلمة تنزيه كني بها عن التعجب من قول فظيع . كقول الأعشى :قد قلت لما جاءني فخره ... سبحان من علقمة الفاخروتقدم في سورة النور )16 ): { سبحانك هذا بهتان عظيم } واعلم أن ظاهر ضمير نحشرهم } أن يعود على المشركين الذين قرعتهم الآية بالوعيد وهم الذين قالوا : { مال هذا الرسول يأكل الطعام } إلى قوله : { مسحوراً } \\[ الفرقان : 7 ، 8 \\] ؛ لكن ما يقتضيه وصفهم ب { الظالمون } والإخبار عنهم بأنهم كذبوا بالساعة وما يقتضيه ظاهر الموصول في قوله : { لمن كذب بالساعة } \\[ الفرقان : 11 \\] من شمول كل من تحقق فيه مضمون الصلة ، كل ذلك يقتضي أن يكون ضمير { نحشرهم } عائداً إلى { من كذب بالساعة } فيشمل المشركين الموجودين في وقت نزول الآية ومن انقرض منهم بعد بلوغ الدعوة المحمدية ومن سيأتي بعدهم من المشركين .ووصف العباد هنا تسجيل على المشركين بالعبودية وتعريض بكفرانهم حقها .والإشارة إليهم لتمييزهم من بين بقية العباد .وهذا أصل في أداء الشهادة على عين المشهود عليه لدى القاضي .وإسناد القول إلى ما يُعبدون من دون الله يقتضي أن الله يجعل في الأصنام نطقاً يسمعه عبدتها ، أما غير الأصنام ممن عبد من العقلاء فالقول فيهم ظاهر .وإعادة فعل { ضلوا } في قوله : { أم هم ضلوا السبيل } ليجري على ضميرهم مسند فعلي فيفيد التقوّي في نسبة الضلال إليهم . والمعنى : أم هم ضلوا من تلقاء أنفسهم دون تضليل منكم . وحق الفعل أن يعدى ب )عن )ولكنه عدي بنفسه لتضمنه معنى )أخطؤوا )، أو على نزع الخافض .و { سبحانك } تعظيم لله تعالى في مقام الاعتراف بأنهم ينزهون الله عن أن يدّعوا لأنفسهم مشاركته في الإلهية .ومعنى : { ما كان ينبغي لنا } ما يطاوعنا طلب أن نتخذ عبدة لأن )انبغى )مطاوع )بغاه )إذا طلبه . فالمعنى : لا يمكن لنا اتخاذنا أولياء ، أي عباداً ، قال تعالى : { وهب لي ملكاً لا ينبغي لأحد من بعدي } \\[ ص : 35 \\] . وقد تقدم في قوله تعالى : { وما ينبغي للرحمن أن يتخذ ولداً } في سورة مريم )92 ). وهو هنا كناية عن انتفاء طلبهم هذا الاتخاذ انتفاء شديداً ، أي نتبرأ من ذلك ، لأن نفي )كان )وجعل المطلوب نفيه خبراً عن )كان )أقوى في النفي ولذلك يسمى جحوداً . والخبر مستعمل في لازم فائدته ، أي نعلم أنه لا ينبغي لنا فكيف نحاوله .)ومن )في قوله : { من دونك } للابتداء لأن أصل )دون )أنه اسم للمكان ، ويقدر مضاف محذوف يضاف إليه )دون )نحو : جلست دون ، أي دون مكانه ، فموقع )من )هنا موقع الحال من { أولياء } . وأصلها صفة ل { أولياء } فلما قدمت الصفة على الموصوف صارت حالاً . والمعنى : لا نتخذ أولياء لنا موصوفين بأنهم من جانب دون جانبك ، أي أنهم لا يعترفون لك بالوحدانية في الإلهية فهم يشركون معك في الإلهية .وعن ابن جني : أن )من )هنا زائدة . وأجاز زيادة )من )في المفعول .و )من )في قوله : { من أولياء } مزيدة لتأكيد عموم النفي ، أي استغراقه لأنه نكرة في سياق النفي .والأولياء : جمع الولي بمعنى التابع في الولاء فإن الولي يرادف المولى فيصدق على كلا طرفي الولاء ، أي على السيد والعبد ، أو الناصر والمنصور . والمراد هنا : الوليّ التابع كما في قوله : { فتكون للشيطان ولياً } في سورة مريم )45 )، أي لا نطلب من الناس أن يكونوا عابدين لنا .وقرأ الجمهور { نتخذ } بالبناء للفاعل . وقرأه أبو جعفر { نتخذ } بضم النون وفتح الخاء على البناء للمفعول ، أي أن يتخذنا الناس أولياء لهم من دونك . فموقع { من دونك } موقع الحال من ضمير { نتخذ } . والمعنى عليه : أنهم يتبرَّؤون من أن يدعوا الناس لعبادتهم ، وهذا تسفيه للذين عبدوهم ونسبوا إليهم موالاتهم .والمعنى لا نتخذ من يوالينا دونك ، أي من يعبدنا دونك .والاستدراك الذي أفاده )لكن )ناشىء عن التبريء من أن يكونوا هم المضلين لهم بتعقيبه ببيان سبب ضلالهم لئلا يتوهم أن تبرئة أنفسهم من إضلالهم يرفع تبعة الضلال عن الضالين . والمقصود بالاستدراك ما بعد )حتى )وهو { نسوا الذكر } . وأما ما قبلها فقد أدمج بين حرف الاستدراك ومدخوله ما يسجل عليهم فظاعة ضلالهم بأنهم قَابَلوا رحمةَ الله ونعمتَه عليهم وعلى آبائهم بالكفران ، فالخبر عن الله بأنه متّع الضالين وآباءهم مستعمل في الثناء على الله بسعة الرحمة ، وفي الإنكار على المشركين مقابلة النعمة بالكفران غضباً عليهم .وجعل نسيانهم الذكر غاية للتمتيع للإيماء إلى أن ذلك التمتيع أفضى إلى الكفران لخبث نفوسهم فهو كجَوْد في أرضضٍ سبخةٍ قال تعالى : { وتجعلون رزقكم أنكم تكذبون } \\[ الواقعة : 82 \\] .والتعرض إلى تمتيع آبائهم هنا مع أن نسيان الذكر إنما حصل من المشركين الذين بلغتهم الدعوة المحمدية ونسوا الذكر ، أي القرآن ، هو زيادة تعظيم نعمة التمتيع عليهم بأنها نعمة متأثلة تليدة ، مع الإشارة إلى أن كفران النعمة قد انجرّ لهم من آبائهم الذين سنّوا لهم عبادة الأصنام . ففيه تعريض بشناعة الإشراك ولو قبل مجيء الرسول صلى الله عليه وسلموبهذا يظهر أن ضمير { نسوا } وضمير { كانوا } عائدان إلى الظالمين المكذبين بالإسلام دون آبائهم لأن الآباء لم يسمعوا الذكر .والنسيان مستعمل في الإعراض عن عمد على وجه الاستعارة لأنه إعراض يشبه النسيان في كونه عن غير تأمل ولا بصيرة . وتقدم في قوله تعالى : { وتنسون ما تشركون } في سورة الأنعام )41 ).والذكر : القرآن لأنهُ يُتذكر به الحق ، وقد تقدم في قوله تعالى : { وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون } في سورة الحجر )6 ).والبور : جمع بائر كالعُوذ جمع عائذ ، والبائر : هو الذي أصابه البوار ، أي الهلاك . وتقدم في قوله تعالى : { وأحلوا قومهم دار البوار } \\[ إبراهيم : 28 \\] أي الموت . وقد استعير البور لشدة سوء الحالة بناء على العرف الذي يعد الهلاك آخر ما يبلغ إليه الحي من سوء الحال كما قال تعالى : { يُهلكون أنفسهم } \\[ التوبة : 42 \\] ، أي سوء حالهم في نفس الأمر و هم عنه غافلون . وقيل : البوار الفساد في لغة الأزد وأنه وما اشتق منه مما جاء في القرآن بغير لغة مضر .واجتلاب فعل )كان )وبناء { بوراً } على { قوماً } دون أن يقال : حتى نسوا الذكر وباروا للدلالة على تمكن البوار منهم بما تقتضيه )كان )من تمكن معنى الخبر ، وما يقتضيه )قوماً )من كون البوار من مقومات قوميتهم كما تقدم عند قوله تعالى : { لآيات لقوم يعقلون } في سورة البقرة )164 ).\n\n",
      "translations": [
        {
          "translation": "(They) the idols (will say: Be Thou glorified) they exonerated Him! (It was not for us) we had no right (to choose) to worship (any protecting friends beside Thee) as lords; it is also said that this means: they said, i.e. the angels, glory be to You! We were not permitted to worship any lords besides You, so how could we have command them to worship us? (but Thou didst give them and their fathers) before them (ease) You gave them a reprieve in their state of disbelief (till they forgot the warning) until they shunned professing Your divine Oneness and refrained from worshipping you (and became lost folk) doomed for destruction and whose hearts became evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَّتَّعْتَهُمْ وَآبَآءَهُمْ } يعني أخَّرتهُم\n\n\n\n\nوقوله تعالى: { وَكَانُواْ قَوْماً بُوراً } معناه هَلكى\n والجمعُ من الذكرِ والأُنثى بُورٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {You have enjoyed them and their fathers} means that He has given them enjoyment and pleasure.\n\n\nAnd they were a perishing people.\n\n\nThe male and female camel is called a 'burun.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } أي: الآلهة مبرئين نفوسهم عن هذه الجرأة والجريمة العظيمة\n منزهين ذاته سبحانه عن وهم المشاركة والمماثلة والكفاءة مطلقاً: { سُبْحَانَكَ } ننزهك ونقدس ذاتك يا ربنا عن توهم الشركة في ألوهيتك وربوبيتك\n بل في وجودك وتحققك { مَا كَانَ يَنبَغِي لَنَآ } ويصح منَّا { أَن نَّتَّخِذَ مِن دُونِكَ مِنْ أَوْلِيَآءَ } فكيف يليق بنا أن ندعي الولاية لأنفسنا دونك والاشتراك معك\n مع أنَّا لا وجود لنا إلا منك\n ولا رجوع لنا إلا إليك\n وأنت يا ربنا تعلم منَّا ما في ضمائرنا وأسرارنا واستعداداتنا ونياتنا في جميع شئوننا وقابلياتنا\n وأنت تعلم أيضاً منا يا مولانا لا علم لنا باتخاذهم أولياء\n ولا إضلال وتقرير من قَبَلنا إياهم { وَلَـٰكِن مَّتَّعْتَهُمْ } أنت بمقتضى فضلك وجودك بأنواع النعم وأصناف الكرم { وَ } كذا متعت { آبَآءَهُمْ } كذلك\n وأمهلتهم زماناً مترفهين مستكبرين { حَتَّىٰ نَسُواْ ٱلذِّكْرَ } أي: ذكر المنعِم\n وغفلوا عن شكر نعمه\n واتخذوا على مقتضى أهويتهم الفاسدة وآرائهم الباطلة أرباباً من دونك وعبدوها كعبادتك عتواً واستكباراً { وَ } بالجملة: هم { كَانُواْ } مقدَّرين مثبتين في لوح قضائك { قَوْماً بُوراً } [الفرقان: 18] هالكين في تيه الغفلة والضلال\n من أصحاب الشقاوة الأزلية الأبدية لا يُرجى منهم السعادة أصلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا } في الجواب: { سبحانك } تعجيباً مما قيل\n لأنهم إما ملائكة معصومون\n أو جمادات لا تنطق ولا قدرة لها على شيء\n أو: قصدوا به تنزيهه عن الأنداد\n ثم قالوا: { ما كان ينبغي لنا } أي: ما صح وما استقام لنا { أن نتخذ من دونك } أي: متجاوزين إياك\n { من أولياء } نعبدهم لِمَا قام بنا من الحالة المنافية له\n فَأَنَّى يُتَصَوَّرُ أن نحمل غيرنا على أن يتخذوا غيرك\n فضلاً أن يتخذونا أولياء\n أو: ما كان يصح لنا أن نتولى أحداً دونك فكيف يصح لنا أن نحمل غيرنا أن يتولونا دونك حتى يتخذونا أرباباً من دونك\n { ولكن متَّعتهم وآباءهم } بالأموال والأولاد وطول العمر\n فاستغرقوا في الشهوات\n وانهمكوا فيها { حتى نَسُوا الذّكر } أي: غفلوا عن ذكرك\n وعن الإيمان بك\n واتباع شرائعك فجعلوا أسباب الهداية من النعم والعوافي ذريعة إلى الغواية\n { وكانوا }  في قضائك وعلمك الأزلي\n { قوماً بوراً } هالكين\n جمع: بائر\n كعائذ وعوذ\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:28",
      "similarity": 0.6668871934969787
    },
    {
      "verse": "48:12",
      "similarity": 0.6356719914600892
    },
    {
      "verse": "35:10",
      "similarity": 0.5045448524953915
    },
    {
      "verse": "35:29",
      "similarity": 0.48906250790742783
    },
    {
      "verse": "23:110",
      "similarity": 0.17859239519547465
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/025018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/025018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}