{
  "chapter": "الفرقان",
  "text": "بل كذبوا۟ بالساعة واعتدنا لمن كذب بالساعة سعيرا",
  "translations": [
    {
      "translation": "But instead, they deny the Hour; and We have prepared a Searing Blaze for those who deny the Hour.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they reject the Hour as untrue. We have prepared a Fire for those who deny the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fact of the matter is that these people have denied \"the Hour\", --And for the one who denies the coming of the Hour, We have prepared a blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They deny the Hour of Doom so We have prepared for them a burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact they deny the Last Day; and We have kept prepared a blazing fire for those who deny the Last Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they deny the Hour, and for those who deny the Hour, We have prepared a flaming Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they reject the hour, and We have prepared a burning fire for him who rejects the hour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they cry lies to the Hour; and We have prepared for him who cries lies to the Hour a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they deny (the coming of) the Hour, and for those who deny (the coming of) the Hour We have prepared a flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They deny the Hour. For those who deny that Hour, We have prepared a blazing fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! they belie the Hour; and We have gotten ready for him who belieth the Hour a Flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they deny the Hour, and We have prepared a Blaze for those who deny the Hour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay they deny the hour (of the judgment to come): but We have prepared a blazing fire for such as deny the hour:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they deny the Hour (the Day of Resurrection), and for those who deny the Hour, We have prepared a flaming Fire (i.e. Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, they belied the Hour. We have prepared for him who belied the Hour a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, they have denied the Hour, and We have prepared for those who deny the Hour a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they have denied the Hour, and We have prepared for those who deny the Hour a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:11] Nay, but they deny the [coming of the] Hour, the Resurrection, and We have prepared for those who deny the Hour a blaze (sa‘īr), a fire that has been set ablaze (musa‘‘ara), in other words, an intense [fire].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but they deny the Hour) they deny the coming of the Hour, (and for those who deny (the coming of) 397 the Hour We have prepared a Flame) the Fire and its fuel.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ كَذَّبُواْ بِٱلسَّاعَةِ } الموعودة المعهودة\n وجميع ما يترتب عليها من المثوبات والدرجات العلية والدركات الهوية\n إذ نظرهم مقصور على هذا الأرذل الأدنى { وَ } ولهذا { أَعْتَدْنَا } وهيأنا بمقتضى قهرنا وجلالنا { لِمَن كَذَّبَ بِٱلسَّاعَةِ } وبالأمور الموعودة فيها { سَعِيراً } [الفرقان: 11] أي: ناراً مستعرة ملتهبة في غاية التلهب والاشتعال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم أضرب عن توبيخهم بحكاية جناياتهم السابقة، وانتقل إلى توبيخهم بحكاية جناية أخرى، فقال: { بل كذَّبوا بالساعة } أي: بل أتوا بأعجب من ذلك كله، وهو تكذيبهم بالساعة\n ويحتمل أن يكون متصلاً بما قبله، كأنه قال: بل كذبوا بالساعة، وكيف يلتفتون إلى هذا الجواب، وكيف يصدقون بتعجيل مثل ما وعدك في الآخرة، وهم لا يؤمنون بها؟ ثم تخلص إلى وبال من كذَّب بها فقال: { وأعتدنا لمن كَذَّبَ بالساعة سعيراً } أي: وهيأنا للمكذبين بها ناراً شديدة الإسعار، أي: الاشتعال\n ووضع الموصول موضع ضمير \" هم \" ، أو لكل من كذب بها كائناً من كان، ويدخلون هم في زمرتهم دخولاً أولياً\n ووضع الساعة موضع ضميرها للمبالغة في التشنيع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:13",
      "similarity": 0.8376357566463278
    },
    {
      "verse": "67:5",
      "similarity": 0.5567662682704272
    },
    {
      "verse": "17:10",
      "similarity": 0.530757797440207
    },
    {
      "verse": "4:151",
      "similarity": 0.48061281036176673
    },
    {
      "verse": "18:102",
      "similarity": 0.47161810949551214
    }
  ]
}