{
  "chapter": "الفرقان",
  "text": "تبارك الذى ان شاء جعل لك خيرا من ذلك جنت تجرى من تحتها الانهر ويجعل لك قصورۢا",
  "translations": [
    {
      "translation": "Blessed be He who, if He wishes, will grant you better than that: Gardens with rivers flowing under them; and He will grant you Palaces.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He who, if He pleased, could give you better than that, -- gardens with rivers flowing by; and make palaces for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Highly blessed is He, Who, if He wills, could give you much more and better things than what they propose for you: (Not one but) many gardens, beneath which rivers flow; and big castles:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who could give you palaces and gardens wherein streams would flow, far better than what they want you to have.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most Auspicious is He Who, if He wills, may make it much better for you – Gardens beneath which rivers flow, and may create high palaces for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He Who, if He wills, will assign you better than (all) that -- Gardens under which rivers flow and will assign you palaces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He Who, if He please, will give you what is better than this, gardens beneath which rivers flow, and He will give you palaces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He who, if He will, shall assign to them better than that -- gardens underneath which rivers flow, and he shall assign to thee palaces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He Who, if He will, will assign thee better than (all) that - Gardens underneath which rivers flow - and will assign thee mansions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who, if He please, can give you better things than that; gardens watered by flowing streams, and palaces too.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blest is He Who, if He willed, shall appoint for them something better than that: gardens whereunder the rivers flow, and appoint for them palaces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who will grant you better than that if He wishes—gardens with streams running in them, and He will make for you palaces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who, if that were His will, could give thee better (things) than those,- Gardens beneath which rivers flow; and He could give thee palaces (secure to dwell in).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He Who, if He will, will assign you better than (all) that, - Gardens under which rivers flow (Paradise) and will assign you palaces (i.e. in Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He who, if He wills, can assign you better things than these; gardens underneath which rivers flow, and He shall assign for you palaces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who, if He wills, can provide you with better than that—gardens beneath which rivers flow—and He will give you palaces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who, if He willed, could have made for you [something] better than that - gardens beneath which rivers flow - and could make for you palaces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:10] Blessed is He, abundant is the good of God, Who, if He will, will give you better than that, treasure or orchard which they mentioned — gardens underneath which rivers flow, in this world, for He has already willed to give him such things in the Hereafter, and will give (read apocopated form wa-yaj‘al) you palaces, as well (a variant reading [of the apocopated yaj‘al] is yaj‘alu, ‘He will give’, beginning a new sentence).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Blessed is He) He says: Exalted is He (Who, if He will) and He does will, (will assign you better than (all) that) than all what they said. (Gardens) in the Hereafter (underneath which) beneath its trees and habitations (rivers) of wine, water, honey and milk (flow, and will assign you mansions) and He has indeed assigned you in Paradise mansions of gold and silver which are better for you than that which they say; and it is also said that this means: if Allah wills, he will assign to you in this worldly life that which they requested of you: mansions and gardens, i.e. He will make you conquer towers and townships, in the East and the West, in spite of the disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تَبَارَكَ } وتعالى ربك { ٱلَّذِيۤ } رباك بأنواع الكرامات الخارقة للعادات الشاملة لأصناف السعادات المعدة لأرباب الشهود والمكاشفات، وبالمعجزات الباهرة الدالة على صدقك في جميع ما جئت به من قبل ربك من الآيات البينات، وأنواع الخيرات والبركات { إِن شَآءَ } ربك وتعلقت مشيئته وإرادته { جَعَلَ لَكَ } يا أكمل الرسل في النشأة الأولى أيضاً { خَيْراً } وأحسن { مِّن ذٰلِكَ } أي: مما قالوه وأملوه تهكماً واستهزاءً، ولكن أخَّره إلى النشأة الأخرى؛ إذ هي خير وأبقى، والتنعم فيها ألذ وأولى؛ إذ هي مؤبدة مخلدة بلا انقطاع ولا انصرام\n\n\n\n\nثم بيَّن سبحانه ما هيأ لحيبيه صلى الله عليه وسلم فيها وأعد له من { جَنَّاتٍ } منتزهات العلم والعين و الحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أي: أنهار المعارف والحقائق المتجددة بتجددات التجليات الإلهية على مقتضى الكمالات الأسمائية والصفاتية { وَيَجْعَل لَّكَ } أيضاً فيها { قُصُوراً } [الفرقان: 10] عاليات متعاليات عن مدارك ذوي الإدراكات مما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر، وهم من قصور نظرهم وعمى بصرهم وقلوبهم في هذه النشأة لا يلتفتون إلى أمثال هذه الكرامات العليّة الأخروية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جنات: بدل من خيراً، و يجعل، من جزمه عطفه على محل جواب الشرط، ومن رفعه فعلى الاستئناف، أي: وهو يجعل لك قصوراً، ويجوز عطفه على الجواب لأن الشرط إذا كان ماضياً جاز في الجواب الرفع والجزم، كما هو مقرر في محله\n يقول الحق جل جلاله: { تبارك } أي: تكاثر وتزايد خيره { الذي إن شاء جَعَلَ لك } في الدنيا { خيراً } لك { من ذلك } الذي اقترحوه من أن يكون لك جنة تأكل منها بأن يجعل لك مثل ما وعدك في الجنة، { جناتٍ تجري من تحتها الأنهارُ } ، فإنه خير من جنة واحدة من غير أنهار، كما اقترحوا، { ويجعل لك قصوراً } وغرفاً في الدنيا، كقصور الآخرة، لكن لم يشأ ذلك لأن الدنيا لا تسع ما يعطيه لخواص أحبابه في الآخرة لأنها ضيقة الزمان والمكان\n وعدم التعرض لجواب الاقتراحين الأولين، وهو إنزال الملك وإلقاء الكنز لظهور بطلانهما ومنافاتهما للحكمة التشريعية، وإنما الذي له وجه في الجملة وهو الاقتراح الأخير فإنه غير مناف للحكمة بالكلية، فإن بعض الأنبياء - عليهم السلام - قد أُتوا مع النبوة مُلكاً عظيماً، لكنه نادر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:202",
      "similarity": 0.47337750991954197
    },
    {
      "verse": "37:48",
      "similarity": 0.46766843652752277
    },
    {
      "verse": "4:101",
      "similarity": 0.46301931446209227
    },
    {
      "verse": "38:52",
      "similarity": 0.4347570239478619
    },
    {
      "verse": "77:32",
      "similarity": 0.39910950233349674
    }
  ]
}