{
  "chapter": "الفرقان",
  "text": "وقال الذين لا يرجون لقاءنا لولا انزل علينا الملئكة او نرى ربنا لقد استكبروا۟ فى انفسهم وعتو عتوا كبيرا",
  "translations": [
    {
      "translation": "Those who do not expect to meet Us say, 'Why have angels not been sent down to us? Why do we not see our Lord?' They have become arrogant about themselves and are excessively insolent.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not hope to meet Us say: \"Why are no angels sent down to us, or why do we not see our Lord?\" They are full of self-conceit and behave with intense arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those people, who have no fear of coming before Us, say, \"Why should not the angels be sent down to us? Or else we should see our Lord. \" Great arrogance have they assumed in regard to themselves, and have transgressed all limits in their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have no desire to meet Us have said, \"Would that the angels had been sent to us or that we could see our Lord.\" They are really filled with pride and have committed the greatest and worst kind of rebellion and hostility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who do not expect to meet Us said, “Why were the angels not sent down to us or we been able to see our Lord?” Indeed they thought too highly of themselves and they turned extremely rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who expect not a meeting with Us said: \"Why are not the angels sent down to us, or why do we not see our Lord\" Indeed they think too highly of themselves, and are scornful with great pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who do not hope for Our meeting, say: Why have not angels been sent down upon us, or (why) do we not see our Lord? Now certainly they are too proud of themselves and have revolted in great revolt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say those who look not to encounter Us, 'Why have the angels not been sent down on us, or why see we not our Lord?' Waxed proud they have within them, and become greatly disdainful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who look not for a meeting with Us say: Why are angels not sent down unto us and (Why) do we not see our Lord! Assuredly they think too highly of themselves and are scornful with great pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not expect a meeting with Us say, \"Why are angels not sent down to us?\" Or \"Why do we not see our Lord?\" Surely, they are too proud of themselves and have greatly exceeded all bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who fear not the meeting with Usl say: wherefore are not angels sent down unto us or wherefore we see not our Lord! Assuredly they have proven stiff-necked in their souls and have exceeded the bounds with excess great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not expect to encounter Us say, ‘Why have angels not been sent down to us, or why do we not see our Lord?’ Certainly, they are full of arrogance within their souls and have become terribly defiant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such as fear not the meeting with Us (for Judgment) say: \"Why are not the angels sent down to us, or (why) do we not see our Lord?\" Indeed they have an arrogant conceit of themselves, and mighty is the insolence of their impiety!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who expect not for a Meeting with Us (i.e. those who deny the Day of Resurrection and the life of the Hereafter), say: \"Why are not the angels sent down to us, or why do we not see our Lord?\" Indeed they think too highly of themselves, and are scornful with great pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not hope to meet Us ask: 'Why have no angels been sent to us? Why can we not see our Lord' How proud they are within themselves, and have become greatly disdainful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not expect to meet Us say, “If only the angels were sent down to us, or we could see our Lord.” They have grown arrogant within themselves, and have become excessively defiant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who do not expect the meeting with Us say, \"Why were not angels sent down to us, or [why] do we [not] see our Lord?\" They have certainly become arrogant within themselves and [become] insolent with great insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:21] And those who do not expect to encounter Us, [those] who have no fear of the Resurrection, say, ‘Why have the angels not been sent down to us, to act as messengers to us, or why do we not see our Lord?’, so that we might be informed [by Him] that Muhammad (s) is [truly] His Messenger? God, exalted be He, says: Assuredly they are full of arrogance within their souls and have become terribly insolent, in demanding to see God, exalted be He, in this world (read ‘utuwwan, ‘insolence’ with the wāw, according to the original root form, as opposed to ‘itiyyan with the [yā’] substitution as in [sūrat] Maryam [Q. 19:8]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who look not for a meeting with Us) those who do not believe in resurrection after death, i.e. Abu Jahl and his host (say: Why are angels not sent down unto us) to inform us that Allah sent you to us (and (why) do we not see our Lord) to ask Him about you? (Assuredly they think too highly of themselves) to simply believe; it is also said that this means: they think too highly of themselves when they ask to see Allah, (and are scornful with great pride) refusing to believe; it is also said that they dared to ask for a tremendous thing when they asked for the angels to come to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَالَ ٱلَّذِينَ لاَ يَرْجُونَ لِقَآءَنَا } معناه لا يَخافُون لِقاءَنا\n\n\n\n\nوقوله تعالى: { لَوْلاَ أُنْزِلَ عَلَيْنَا ٱلْمَلاَئِكَةُ أَوْ نَرَىٰ رَبَّنَا } يَقولون ألا أنزل علينا الملائكةُ\n أو نرى ربَّنَا كما لو قالتْ بنو إسرائيل لموسى عليه السّلامُ:\n",
      "translations": [
        {
          "translation": " And those who do not expect to meet Us say, \"Do not { } fear Allah.\"\n\nAnd His saying - Exalted is He - { Had not angels been sent down to us, or had we seen our Lord } they say, \"Why were not the angels sent down to us, or why did we not see our Lord?\"\n Or do we see our Lord as if the children of Israel said to Moses, peace be upon him:",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة جدالهم وعنادهم: { قَالَ } الكافرون الجاحدون { ٱلَّذِينَ لاَ يَرْجُونَ لِقَآءَنَا } أي: لا يؤملون لقيانا\n ولا يخافون منَّا لإنكارهم بنا وبوعدنا يوم الجزاء: لو كان محمد صلى الله عليه وسلم رسولاً مؤيداً من عند الله { لَوْلاَ } أي: هلا { أُنْزِلَ عَلَيْنَا ٱلْمَلاَئِكَةُ } المصدقون لرسالته\n ليخبرونا بصدقه في دعواه { أَوْ } هلا { نَرَىٰ رَبَّنَا } الذي يدعونا إليه معاينة\n فيخبرنا ربنا بصدق رسوله حتى نصدقه بلا تردد\n وقال سبحانه في ردهم مقسماً على سبيل التعجب والاستغراب: والله { لَقَدِ ٱسْتَكْبَرُواْ فِيۤ أَنفُسِهِمْ } أولئك المسرفون المفرطون بقولهم هذا مكابرة\n حيث طلبوا من الله ما لا يسع لخُلَّص عباده من ذوي النفوس القدسية { وَعَتَوْا } بإخطار هذه المطلب العظيم في خواطرهم\n وإن صدر عنهم هذا تهكماً واستهزاءً { عُتُوّاً كَبِيراً } [الفرقان: 21] فاستحقوا بذلك أكبر ال عذاب وأصعب النكال والوبال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وقال: عطف على: وقالوا مال هذا الرسول\n\n\n إلخ، ووضع الموصول موضع الضمير للتنبيه بما في حيز الصلة على أن ما حكي عنهم مِنَ الشناعة بحيث لا يصدر ممن يعتقد المصير إلى الله - عز وجل -\n يقول الحق جل جلاله: { وقال الذين لا يرجون لقاءنا } أي: لا يتوقعون الرجوع إلينا بالبعث، أو حسابنا المؤدي إلى سوء العذاب، الذي تستوجبه مقالاتهم الشنيعة\n والحاصل: أنهم يُنكرون البعث بالكلية، فأطلق الرجاء على التوقع\n وقيل: لا يخافون لقاءنا لأن الرجاء في لغة تهامة: الخوف، قالوا: { لولا } هلا { أنزل علينا الملائكةُ } رسلاً دون البشر، أو: يشهدون بنبوة محمد ودعوى رسالته، { أو نرى ربَّنا } جهرة، فيخبرنا برسالته، ويأمرنا باتباعه، وإنما قالوا ذلك عناداً وعتواً\n قال تعالى: { لقد استكبروا في أنفسهم } أي: أضمروا الاستكبار، وهو الكفر والعناد في قلوبهم، أو: عظموا في أنفسهم حتى اجترؤوا على التفوه بمثل هذه العظيمة الشنعاء، { وعَتَواْ } أي تجاوزوا الحد في الظلم والطغيان { عُتواً كبيراً } بالغاً أقصى غاياته، أي: إنهم لم يجترئوا على هذا القول العظيم إلا لأنهم بلغوا غاية الاستكبار، وأقصى العتو، حتى أمَّلوا نيل المشاهدة والمعاينة والمفاوضة التي اختص بها أكابر الرسل وخاصة الأولياء، بعد تطهير النفوس وتصفية القلوب والأرواح\n وهذا كقولهم:\n\n[الإسراء: 90] إلى قوله:\n\n[الإسراء: 92]\n ولم يكتفوا بما رأوا من المعجزات القاهرة فذهبوا في الاقتراح كل مذهب، حتى منَّتهم أنفسهم الخبيثة أمالي سُدت دونها مطامع النفوس القدسية\n واللام: جواب قسم محذوف، أي: والله لقد استكبروا\n\n الآية\n وفيه من الدلالة على قُبح ما هم عليه، والإشعار بالتعجب من استكبارهم وعتوهم، ما لا يخفى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:44",
      "similarity": 0.5150707351415932
    },
    {
      "verse": "19:69",
      "similarity": 0.46397421421420887
    },
    {
      "verse": "65:8",
      "similarity": 0.41761979975769686
    },
    {
      "verse": "19:8",
      "similarity": 0.40469795666464053
    },
    {
      "verse": "7:77",
      "similarity": 0.3676954178139558
    }
  ]
}