{
  "chapter": "الفرقان",
  "text": "لقد اضلنى عن الذكر بعد اذ جاءنى وكان الشيطن للانسن خذولا",
  "translations": [
    {
      "translation": "He led me astray from the Warning after it had come to me. Satan always betrays man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For it was he, who had deluded me to reject the Admonition which had come to me. Satan has proved very treacherous to man. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He led me away from the true guidance after it had come to us. Satan is a traitor to people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“He indeed led me astray from the advice that had come to me”; and Satan deserts man, leaving him unaided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He indeed led me astray from the Reminder after it had come to me. And Shaytan is to man ever a deserter.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly he led me astray from the reminder after it had come to me; and the Shaitan fails to aid man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He indeed led me astray from the Remembrance, after it had come to me; Satan is ever a forsaker of men.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He verily led me astray from the Reminder after it had reached me. Satan was ever man's deserter in the hour of need.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he made me forgetful of the warning after it had reached me. Satan is man's great betrayer.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly he misled me from the admonition after it had come unto ine. Verily the Satan is ever unto man a betrayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly he led me astray from the Reminder after it had come to me, and Satan is a deserter of man.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He did lead me astray from the Message (of Allah) after it had come to me! Ah! the Evil One is but a traitor to man!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He indeed led me astray from the Reminder (this Quran) after it had come to me. And Shaitan (Satan) is ever a deserter to man in the hour of need.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He led me astray from the Remembrance after it had reached me, satan is ever the foresaker of humans'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He led me away from the Message after it had come to me; for Satan has always been a betrayer of man.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He led me away from the remembrance after it had come to me. And ever is Satan, to man, a deserter.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:29] Verily he has led me astray from the Remembrance, namely, the Qur’ān, after it had come to me, by causing me to recant my belief in it. God, exalted be He, says: And Satan is ever a deserter of, the disbelieving, man’, abandoning him and dissociating from him in [times of] tribulation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He verily led me astray from the Reminder) from Allah's divine Oneness and obedience (after it had reached me) after Muhammad (pbuh) reached me with Allah's divine Oneness. (Satan was ever man's deserter in the hour of need) he lets him down at the time of need.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nذلك المغوي { لَّقَدْ أَضَلَّنِي عَنِ ٱلذِّكْرِ } أي: عن ذكر الله ذكر رسوله ومصاحبة المؤمنين { بَعْدَ إِذْ جَآءَنِي } واختلط معي، وصار صديقي وخليلي، بل صار شيطاناً فوسوس عليَّ، وأعرضني عن طريق الحق { وَكَانَ ٱلشَّيْطَانُ } المضلُّ المغوي سواء كان جِنّاً أو إنساً أو نفساً { لِلإِنْسَانِ } المجبول على الغفلة والنسيان { خَذُولاً } [الفرقان: 29] يخذله ويحرمه عن الجنان، ويسوقه إلى دركات النيران بأنواع الخيبة والحرمان، ونعوذ بك يا ذا الفضل والإحسان من شرِّ الشيطانز\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكان الشيطانُ للإِنسان خذولاً } أي: مبالغاً في الخذلان، حيث يواليه من يؤديه إلى الهلاك، ثم يتركه ولا ينفعه، وهو الحامل له على مخاللة المضِل ومخالفة الرسل\n وقيل: المراد به خليله أُبيّ، وسماه شيطاناً لأنه أضله كما يضله الشيطان\n والله تعالى أعلم\n\n\nالإشارة: في الآية تحريض على محبة الرسول صلى الله عليه وسلم وشد اليد علىالتمسك بسنته، والاهتداء بهديه، واتباع ما جاء به، قبل أن تقول: يا ليتني أتخذت مع الرسول سبيلاً\n وفيها أيضاً: الترغيب في صحبة الأبرار، والترهيب من صحبة الفجار، وأنشد بعض الحكماء:\n\nوقال آخر:\n\nوفي حديث أبي موسى رضي الله عنه صلى الله عليه وسلم قال:\n\n \" مثل الجليس الصَّالح مَثَلُ العَطَّارِ، إنْ لَمْ يُحْذِكَ مِنْ عِطْره يَعْلق بك مِنْ رِيحِه\n ومَثَل الجَلِيس السُّوء مَثَلُ الكِيِر، إن لم يَحْرِق ثِيابَكَ يَعْلق بك مِن رِيحِه \" \n\nوقال في الحِكَم: \" لا تصحب من لا يُنْهِضُكَ حاله، ولا يَدُلُّكَ على الله مَقَالُهُ \"\n فإنهاض الحال هو ذكر الله عند رؤيته، والانحياش إليه بالقلب عند صحبته\n ودلالة المقال على الله هو زجه في الحضرة بلا تعب، بان يرفع بينه وبين ربه الحُجُبَ، ويقول له: ها أنت وربك\n وهذه حال الصوفية العارفين بالله، وقد وصفهم بعض العلماء، فقال: الصوفي من لا يعرف في الدارين أحداً غير الله، ولا يشهد مع الله سوى الله، قد سخر له كل شيء، ولم يُسخر هو لشيء، يسلط على كل شيء، ولم يسلط عليه شيء، يأخذ النصيب من كل شيء، ولم يأخذ النصيب منه شيء، يصفو به كدر كُلِّ شيء، ولا يكدر صَفْوَه شيء، قد أشغله واحد على كل شيء، وكفاه واحد من كل شيء\nهـ\n قال في التنبيه: وبصحبة أمثال هؤلاء يحصل للمريد من المزيد مالا يحصل له بغيرها من فنون المجاهدات وأنواع المكابدات، حتى يبلغ بذلك إلى أمر لا يسعه عقل عاقل، ولا يحيط به عالم ناقل\nهـ\n وفي شانهم أيضاً قال صاحب العينية رضي الله عنه:\n\nوقال الجنيد رضي الله عنه: إذا أراد الله بالمريد خيراً ألقاه إلى الصوفية، ومنعه صحبة القراء\n وقال سهل رضي الله عنه: احذر صحبة ثلاثة من أصناف الناس: الجبابرة الغافلين، والقراء المداهنين، والمتصوفة الجاهلين\n هـ\n وقال حمدون القصار رضي الله عنه: اصحب الصوفية فإن للقبح عندهم وجوهاً من المعاذير، وليس للحُسْنِ عندهم كبير موقع يعظمونك به إشارة إلى أن العجب بالعمل منفي في صحبتهم\n\n\nوقال سيدنا علي رضي الله عنه: شر الأصدقاء: من أحوجك إلى المداراة، وألجأك إلى الاعتذار\n\n\nوقال أيضاً: شر الأصدقاء من تُكُلِّف له\n هـ\n وليوسف بن الحسين الداراني رضي الله عنه:\n\nوالحاصل من هذا أن صحبة الصوفية هي التي يحصل بها كمال الانتفاع للصاحب، دون من عداهم من المنسوبين إلى الدين والعلم لأنهم خُصوا من حقائق التوحيد والمعرفة بخصائص، لم يساهمهم فيها أحد سواهم\n وسريان ذلك من الصاحب إلى المصحوب هو غاية الأمل والمطلوب، فقد قيل: مَنْ تَحَقَّقَ بِحَالَةٍ لَمْ يَخْلُ حَاضِرُوهُ مِنْهَا\n انتهى من التنبيه\n وبالله التوفيق\n ولما رأى صلى الله عليه وسلم إعراض قومه عنه، شكى لربه، فقال: { وَقَالَ ٱلرَّسُولُ يٰرَبِّ\n\n\n }\n",
      "translations": []
    }
  ]
}