{
  "chapter": "الفرقان",
  "text": "الملك يومئذ الحق للرحمن وكان يوما على الكفرين عسيرا",
  "translations": [
    {
      "translation": "The Kingdom that Day will belong in truth to the All-Merciful. It will be a hard Day for the kafirun,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The real sovereignty will belong to Ar-Rahman. How grievous will be the day for the infidels!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The real Kingdom on that Day will belong only to the Merciful, and it will be a very hard Day for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the Absolute kingdom will belong to the Beneficent God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true kingship on that day belongs to the Most Gracious; and that is hard for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sovereignty on that Day will be the true (sovereignty) of the Most Gracious, and it will be a hard Day for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The kingdom on that day shall rightly belong to the Beneficent Allah, and a hard day shall it be for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Kingdom that day, the true Kingdom, shall belong to the All-merciful and it shall be a day harsh for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sovereignty on that day will be the True (Sovereignty) belonging to the Beneficent One, and it will be a hard day for disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "true sovereignty on that Day will belong to the Gracious One, and it will be a hard Day for those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dominion on that Day rhall is; be the true dominion, of the Compassionate, l and it shall be anday upon the infidels hard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on that day true sovereignty will belong to the All-beneficent, and it will be a hard day for the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day, the dominion as of right and truth, shall be (wholly) for (Allah) Most Merciful: it will be a Day of dire difficulty for the misbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sovereignty on that Day will be the true (sovereignty), belonging to the Most Beneficent (Allah), and it will be a hard Day for the disbelievers (those who disbelieve in the Oneness of Allah Islamic Monotheism).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the true Kingdom on that Day shall belong to the Merciful a harsh day for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, true sovereignty will belong to the Merciful, and it will be a difficult Day for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "True sovereignty, that Day, is for the Most Merciful. And it will be upon the disbelievers a difficult Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:26] true Sovereignty on that day will belong to the Compassionate One, with no one else sharing it with Him, and it, that day, will be a hard day for the disbelievers, in contrast to the believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The Sovereignty) judgement (on that day will be the True (Sovereignty)) justice (belonging to the Beneficent One, and it will be a hard day for disbelievers) the hardship of that Day is very severe on them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَلَى ٱلْكَافِرِينَ عَسِيراً } معناه صَعبٌ شَديدٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nحنيئذ نودي من وراء سرادقات العز والجلال: { ٱلْمُلْكُ } المطلق والاستيلاء التام والسلطنة الغالية { يَوْمَئِذٍ ٱلْحَقُّ } الثابت اللائق، والمثبت على ما ينبغي ويليق { لِلرَّحْمَـٰنِ } المستوي على عروش ذرائر الأكوان بعموم الرحمة وشمول الفضل والامتنان، بلا تقدير مكيال وميزان من زمان أو مكان { وَكَانَ } ذلك اليوم والشأن { يَوْماً } وشأناً { عَلَى ٱلْكَافِرِينَ } الساترين بغيوم هوياتهم الباطلة هوية الحق الظاهر في الآفاق والأنفس { عَسِيراً } [الفرقان: 26] في غاية العسر والشدة، وعلى الموحدين الواصلين إلى مرتبة الفناء، الفانين في الله، الباقين ببقائه يسيراً في غاية اليسر والسهولة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n رُوي أن السموات تنشق سماءً سماءً، وتنزل ملائكة كل سماء في ذلك الغمام، وفي أيديها صحائف أعمال العباد، فيفصل الله بين خلقه، ولذلك قال: { الملكُ يومئذٍ الحقُّ للرحمن } أي: السلطنة القاهرة، والاستيلاء العام، الثابت الذي لا زوال له أصلاً، هو للرحمن وحده لأن كل ملْك يزول يومئذٍ، ولا يبقى إلا ملكه\n وفائدة التقييد، مع أن الملك لله في الدنيا والآخرة لأن في الدنيا قد تظهر صورة الملك للمخلوق مجازاً، ويكون له تصرف صوري، بخلاف يوم القيامة، ينقطع فيه الدعاوي، ويظهر الملك لله الواحد القهار، { وكان يوماً على الكافرين عسيراً } أي: وكان ذلك اليوم، مع كون الملك للمبالغ في الرحمة، { عسيراً } أي: صعباً، شديداً على النفوس بالنسبة للكافرين، وأما على المؤمنين فيكون يسيراً، بفضل الله تعالى\n وقد جاء في الحديث: أنه يهون يوم القيامة على المؤمنين حتى يكون أخف عليهم من صلاة مكتوبة، صلَّوْهَا في الدنيا\n ففي حديث أبي سعد الخِدري حيث قال رسول الله صلى الله عليه وسلم: { في يوم كان مقداره خمسين ألف سنة } ، قلت: يا رسول الله، ما أطول هذا اليوم؟ فقال صلى الله عليه وسلم:\n\n \" والذي نفسي بيده إِنَّهُ ليُخَفَّفُ على المؤمِنِ حتى يكونَ أخفَّ عليه من صلاةٍ مكتوبة، يصليها في الدنيا \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:9",
      "similarity": 0.9083349369439773
    },
    {
      "verse": "94:6",
      "similarity": 0.7548230209528027
    },
    {
      "verse": "94:5",
      "similarity": 0.7532468283349507
    },
    {
      "verse": "92:10",
      "similarity": 0.7493917431554673
    },
    {
      "verse": "2:280",
      "similarity": 0.6810456833950029
    }
  ]
}