{
  "chapter": "الفرقان",
  "text": "ويوم يعض الظالم على يديه يقول يليتنى اتخذت مع الرسول سبيلا",
  "translations": [
    {
      "translation": "the Day when a wrongdoer will bite his hands and say, 'Alas for me! If only I had gone the way of the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sinner will then bite his hand and say: \"Would that I had taken the road with the Prophet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unjust man will bite at his hand and say, \"Would that I had stood by the Messenger!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be a hard day for the unbelievers. It will be a day when the unjust will bite their fingers, (regretfully) saying, \"Would that we had followed the path of the Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day when the unjust will gnaw his hands, saying, “Alas, if only I had chosen a way along with the (Noble) Messenger (of Allah)!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day when the wrongdoer will bite at his hands, he will say: \"Oh! Would that I had taken a path with the Messenger.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the day when the unjust one shall bite his hands saying: O! would that I had taken a way with the Apostle\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day the evildoer shall bite his hands, saying, 'Would that I had taken a way along with the Messenger!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the wrong-doer gnaweth his hands, he will say: Ah, would that I had chosen a way together with the messenger (of Allah)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, the wrongdoer will bite his hands and say, \"Would that I had walked in the Messenger's path!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the wrong-doer shall gnaw his hands saying: would that had taken with the apostle a way!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be a day when the wrongdoer will bite his hands, saying, ‘I wish I had followed the Apostle’s way!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day that the wrong-doer will bite at his hands, he will say, \"Oh! would that I had taken a (straight) path with the Messenger!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) the Day when the Zalim (wrong-doer, oppressor, polytheist, etc.) will bite at his hands, he will say: \"Oh! Would that I had taken a path with the Messenger (Muhammad SAW).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon that Day the harmdoer shall bite his hands, and say: 'Would that I had taken a Path with the Messenger!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, the wrongdoer will bite his hands, and say, “If only I had followed the way with the Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day the wrongdoer will bite on his hands [in regret] he will say, \"Oh, I wish I had taken with the Messenger a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:27] And [it will be] a day when the wrongdoer, the idolater, ‘Uqba b. Abī Mu‘ayt — who had uttered the two-part profession [‘there is no god but God, Muhammad (s) is His Messenger’] but retracted it in order to please Ubayy b. Khalaf — will bite his hands, in regret and anguish on the Day of Resurrection, saying, ‘O (yā is for drawing attention) would that I had followed a way with the Messenger!, Muhammad (s), a route to guidance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "399 (On the day when the wrong-doer) the disbeliever, i.e. 'Uqbah Ibn Ma'it (gnaweth his hands) his fingers, (he will say: Ah, would that I had chosen a way together with the messenger (of Allah)) would that I had chosen, and were upright in following the religion of the Prophet!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يٰلَيْتَنِي ٱتَّخَذْتُ مَعَ ٱلرَّسُولِ سَبِيلاً } معناه سَببٌ ووُصْلَةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Would that I had taken a path with the Messenger,\" means both a cause and a connection.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nتثبيت فؤاده عليه السلام بالقرآن هو أنه لما ردّ في مقام البقاء بعد الفناء إلى حجاب القلب لهداية الخلق كان قد يظهر نفسه وقتاً غبّ وقت على قلبه بصفاتها، ويحدث له التلوين بسببها كما ذكر في قوله:\n\n[الحج، الآية:52]، وفي قوله:\n\n[عبس، الآية:1] فكان يتداركه الله تعالى بإنزال الوحي والجذبة ويؤدّبه ويعاتبه فيرجع إليه في كل حال ويتوب، كما قال عليه السلام:\n\n \" أدّبني ربّي فأحسن تأديبي \" \n\nوقال صلى الله عليه وسلم:\n\n \" إنه ليغان على قلبي وإني لأستغفر الله في اليوم سبعين مرة \" \n\nحتى يتمكن ويستقيم\n وكان سبب ظهور ابتلاء الله تعالى إياه بالدعوة لإيذاء الناس إياه وعداوتهم ومناصبتهم له، والحكمة في الابتلاء أمران، أحدهما: راجع إليه، وهو أن يظهر نفسه بجميع صفاتها في مقابلة استيلاء الأعداء المختلفين في النفوس وصفاتها واستعداداتها ومراتبها فيؤدّبه الله بحكمة وجود كل صفة وفضيلة كل قوة، فيحصل له جميع مكارم الأخلاق وكمالات جميع الأنبياء كما قال عليه السلام:\n\n \" بُعِثت لأتمم مكارم الأخلاق، وأوتيت جوامع الكلم \"\n \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل لمن ظلمك وأساء الأدب معك\n وأراد مقتك وطردك بغياً عليك واستكباراً { يَوْمَ يَعَضُّ ٱلظَّالِمُ } الجاحد الخارج عن مقتضى الأدب مع الله ورسوله { عَلَىٰ يَدَيْهِ } تحسراً على تفريطه وإفراطه في العتو والاستكبار\n والجحود والإنكار { يَقُولُ } حينئذٍ متحسراً متمنياً: { يٰلَيْتَنِي ٱتَّخَذْتُ مَعَ ٱلرَّسُولِ } الهادي إلى سواء السبيل { سَبِيلاً } [الفرقان: 27] يوصلني إلى منهج الرشاد\n وينجِّني عن هذا العذاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ و } اذكر أيضاً { يوم يَعَضُّ الظالمُ على يديه } ندماً وتحسراً، فعض اليد والأنامل: كناية عن شدة الغيظ والحسرة لأنها من روادفها، فتذكر المرادفة ويراد بها المردوف، فيرتفع الكلام بذلك في طبقة الفصاحة، ويجد السامع في نفسه من الروعة ما لا يجده عند اللفظ المكنى عنه\n والمراد بالظالم: إما عُقبةَ بْن أَبِي مُعيط، وكان خليلاً لأُبَيّ بن خلف وكان عقبة يكثر مجالسة النبي صلى الله عليه وسلم، فقدم من سفر وصنع طعاماً، فدعا إليه أشرف قومه، ودعا النبي صلى الله عليه وسلم، فلما قُرِّب الطعام، قال النبي صلى لله عليه وسلم:\n\n \" ما أنا بآكل من طعام، حتى تشهد أن لا إله إلا الله، وأني رسول الله \" \n\nفقال عقُبة: أشهد أن لا إله إلا الله، وأن محمداً رسول الله\n\n\nفأكل النبي صلى الله عليه وسلم طَعَامه، وكان أُبي بن خلف غائباً فلما أُخبر، قال له: صَبأتَ يا عُقبة؟ فقال: لاَ، والله ما صبأتُ، ولكن دخل عليّ رجل فأَبَى أن يأكُلَ من طَعَامِي إلا أن أشهد له، فاسْتَحْيَيْتُ أَنْ يخرج من بيتي ولم يطعم، فَشَهِدْتُ لَهُ، فطعم، فقال: ما أنا بالذي أرضى عنك أبداً، حتى تأتيه فَتبْزُق في وَجْهِهِ، وتَطَأَ عُنقه، فَوَجَدَهُ صلى الله عليه وسلم سَاجِداً، فَفعَل ذَلِكَ، وأخذ رَحِم دابته فألقاها بين كتفيه، فقال النبي صلى الله عليه وسلم:\n\n \" لا ألْقَاكَ خَارجاً من مَكَّةَ إلا عَلَوْتُ رأسَكَ بالسيفِ \" \n\nفقُتِلَ عُقبةُ يَوْمَ بَدْرٍ صبراً\n وأما أُبيُّ فقتله النبي صلى الله عليه وسلم بيده، يوم أُحُد، في المبارزة، طعنه في عنقه، فمات بمكة\n وعن الضحاك: لما بَصَقَ عقبة - بأمر أبي - في وجه النبي صلى الله عليه وسلم، رجع بُصَاقُهُ في وجهه، وشوى وجهه وشفتيه، حتى أثر في وجهه وأحرق خديه، فلم يزل في وجهه حتى قتل، وقتله علي ببدر بأمره صلى الله عليه وسلم بقتله\n هـ\n وقال الشعبي: كان عُقْبَةُ بن أبي معيط خليلاً لأُبَي بن خلف، فأسلم عقبة، فقال أُبيّ: وجهي من وجهك حرام، أنْ تابعت محمداً، فارتدَّ لرضا صاحبه، فنزلت الآية\n هـ\n وإمَّا جنس الظالم، ويدخل عقبة فيه دخولاً أولياً\n { يقول يا ليتني } ، الياء لمجرد التنبيه، من غير تعيين المنبّه، أو: المنبه محذوف، أي: يا هؤلاء { ليتني اتخذت } في الدنيا { مع الرسول } محمد صلى الله عليه وسلم { سبيلاً } أي: طريقاً مُنجياً من هذه الورطات، وهي طريق الإسلام، ولم أكن ضالاً، أو: طريقاً إلى الجنة، { يا وَيْلَتَي } ، بقلب ياء المتكلم ألفاً، كما في صَحَارَى وعذارَى\n وقرئ بالياء على الأصل، أي: يا هَلَكَتِي، تَعَاليّ هذا أَوَانَكِ، { ليتني لم أتخذ فلاناً خليلاً } ، فلان: كناية عن الإعلام، فإن أريد بالظالم عقبة، فالمعنى: لم أتخذ أبيّاً خليلاً، فكنى عن اسمه، وإن أريد به الجنس، فهو كناية عن علم كل من يضله، كائناً من كان، من شياطين الإنس والجن\n وقيل: هو كناية عن الشيطان\n ثم قال: { لقد أضلني عن الذِّكْرِ } عن ذكر الله، أو: القرآن، أو: الإيمان، أو موعظة الرسول صلى الله عليه وسلم، أو كلمة الشهادة\n وتصديره بلام القسم للمبالغة في بيان خطئه، وإظهار ندمه وحسرته، أي: والله لقد أضلني عن الذكر { بعد إِذا جاءني } من الله، وتمكنت منه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:119",
      "similarity": 0.5512302549476242
    },
    {
      "verse": "33:66",
      "similarity": 0.22045799012500958
    },
    {
      "verse": "36:26",
      "similarity": 0.2141134100530486
    },
    {
      "verse": "69:27",
      "similarity": 0.21207952379405742
    },
    {
      "verse": "89:24",
      "similarity": 0.2104772840812191
    }
  ]
}