{
  "chapter": "الفرقان",
  "text": "الذى له ملك السموت والارض ولم يتخذ ولدا ولم يكن له شريك فى الملك وخلق كل شىء فقدره تقديرا",
  "translations": [
    {
      "translation": "He to whom the kingdom of the heavens and the earth belongs. He does not have a son and He has no partner in the Kingdom. He created everything and determined it most exactly.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He to whom belongs the kingdom of the heavens and the earth, who has neither begotten a son nor has He a partner in His kingdom, (who) created everything and determined its exact measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He to Whom belongs the Sovereignty of the heavens and the earth: Who has begotten no son: Who has no partner in His Sovereignty: Who created each and every thing and then ordained its destiny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs the kingdom of the heavens and the earth. He has not begotten any sons, nor does He have any partner in His kingdom. He has created all things with precisely accurate planning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The One to Whom belongs the kingship of the heavens and of the earth, and has not chosen a child, and has no partner in His kingship, and He has created everything and kept it in proper measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He to Whom belongs the dominion of the heavens and the earth, and Who has begotten no son and for Whom there is no partner in the dominion. He has created everything, and has measured it exactly according to its due measurements.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He, Whose is the kingdom of the heavens and the earth, and Who did not take to Himself a son, and Who has no associate in the kingdom, and Who created everything, then ordained for it a measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to whom belongs the Kingdom of the heavens and the earth; and He has not taken to Him a son, and He has no associate in the Kingdom; and He created every thing, then He ordained it very exactly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He unto Whom belongeth the Sovereignty of the heavens and the earth, He hath chosen no son nor hath He any partner in the Sovereignty. He hath created everything and hath meted out for it a measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sovereign of the heavens and the earth, who has begotten no children and who has no partner in His sovereignty, it is He who has created all things and measured them out precisely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He whose is the dominion of the heavens and the earth, and who hath not taken a son, and for whom there is not an associate in the dominion, and who hath created everything, and measured it according to a measurement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He, to whom belongs the sovereignty of the heavens and the earth, and who did not take any offspring, nor has He any partner in sovereignty, and He created everything and determined it in a precise measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He to whom belongs the dominion of the heavens and the earth: no son has He begotten, nor has He a partner in His dominion: it is He who created all things, and ordered them in due proportions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He to Whom belongs the dominion of the heavens and the earth, and Who has begotten no son (children or offspring) and for Whom there is no partner in the dominion. He has created everything, and has measured it exactly according to its due measurements.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to whom the Kingdom of the heavens and the earth belongs, who has not taken a son, nor does He have an associate in the Kingdom, and He created everything, then He ordained it very precisely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He to whom belongs the kingdom of the heavens and the earth, who took to Himself no son, who never had a partner in His kingship; who created everything and determined its measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He to whom belongs the dominion of the heavens and the earth and who has not taken a son and has not had a partner in dominion and has created each thing and determined it with [precise] determination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:2] He to Whom belongs the kingdom of the heavens and the earth, and Who has not taken a son, nor has He any partner in sovereignty; and He created everything, which was meant to be created, and then determined it in a precise measure, He fashioned it in a balanced form.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He unto Whom belongeth the Sovereignty) the storehouses (of the heavens) rain (and the earth) vegetation. (He hath chosen no son) as claimed by the Jews and Christians (nor hath He any partner in the sovereignty) as claimed by the Arab idolaters. (He hath created everything) that which they worship and that which they do not worship (and hath meted out for it a measure) their lifespan, provision and works are all in a specific measure; it is also said that this means: He decreed for each male a female.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ويشهد عليه بالعدم { فقدّره تقديراً } على قدر قبول بعض صفاته ومظهرية بعض كمالاته دون بعض\n أي: هيأ استعداداتهم لما شاء من كمالاتهم التي هي صفاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فلا يضره كثرة الأسماء والصفات وحدوث العكوس والتعينات حسب الشئون والتجليات الإلهية وحدته الذاتية وانفراده الحقيقي { وَ } لهذا { لَمْ يَتَّخِذْ } سبحانه { وَلَداً } حتى يتكثر { وَلَمْ يَكُن لَّهُ شَرِيكٌ } في وجوده وملكه حتى ينازع ويتضرر\n بل له التصرف بالاستقلال والاختيار بلا مزاحمة العكوس والأظلال الهالكة في صرافة وحدته الذاتة وشمس ذاته { فِي المُلْكِ وَخَلَقَ كُلَّ شَيْءٍ } ظهر حسب تجاليته على مقتضى أسمائه وصفاته\n\n\nوبعدما أظهر ما أظهر { فَقَدَّرَهُ تَقْدِيراً } [الفرقان: 2] بديعاً\n ودبر أمره تدبيراً محكماً عجيباً بأن وفق بعضهم لاختراع أنواع الصنائع والحرفة البديعة والإدراكات الكاملة والتدبيرات الغريبة المتعلقة بتمدنهم لمعاشهم\n وجعل بعضهم آلة للبعَ\n وبعضهم مالكاً\n وبعضهم مملوكاً\n وأزواجاً وأصنافاً مؤتلفة وفرقاً وأضراباً مختلفة\n وأنواعاً متفاوتة إلى ما شاء الله\n[المدثر: 31] كل ذلك ليتعاونوا ويتظاهروا\n واختلطوا وامتزجوا إلى أن اعتدلوا وانتظموا\n وصاروا مؤتمنين مؤتلفين مؤانسين\n محتاجين كل منهم بمعاونة الآخر\n\n\nوإنما فعل سبحانه ما فعل\n ليظهر كمالاته المندرجة في وحدة ذاته\n ويظهر سلطان الوحدة الذاتية بظهور ضده\n وبعدما بلغ الكثرة غايتها انتهت إلى الوحدة أيضاً كما بدأت منها وانتشأت عنها\n فحينئذٍ اتصل الأولُ بالآخر والظاهرُ بالباطن\n واتحد الأزلُ والأبدُ\n وارتفع الكثرة والعدد\n ولم يبقَ إلا الله الواحد الأحد الصمد\n[الإخلاص: 3-4]\n\n\n{ وَ } كيف لا يقدر سبحانه أمر عباده بإنزال الكتب\n وإرسال الرسل المرشدين لهم إلى توحيده بعدما تاهوا في بيداء الكثرة والضلال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولم يتخذ ولداً } كما زعم اليهود والنصارى في عزير والمسيح - عليهما السلام -\n { ولم يكن له شريك في المُلْك } كما زعمت الثنوية القائلون بتعدد الآلهة\n والرد في نحورهم\n { وخَلَقَ كلَّ شيء } أي: أحدث كل شيء وحده\n لا كما تقول المجوس والثنوية من النور والظلمة\n أي: أظهر كل شيء { فقدَّره } أي: فهيأه لِمَا أراد به من الخصائص والأفعال اللائقة به\n { تقديراً } بديعاً\n لا يقادر قدره\n ولا يُبلغ كنهه كتهيئة الإنسان للفهم والإدراك\n والنظر والتدبير في أمور المعاش والمعاد\n واستنباط الصنائع المتنوعة\n والدلائل المختلفة\n على وجود الصانع\n أو: فقدَّره للبقاء إلى أبد معلوم\n وأيّاً ما كان\n فالجملة تعليل لما قبلها\n فإن خلقه تعالى لجميع الأشياء على ذلك الشكل البديع والنظام الرائق\n وكل ما سواه تحت قهره وسلطانه\n كيف يتوهم أنه ولد الله سبحانه\n أو شريكٌ له في ملكه\n تعالى الله عن ذلك علواً كبيراً\n الإشارة: عبّر بالعبودية في التنزيل والإسراء إشارة إلى أن كل من تحقق بالعبودية الكاملة له حفظ من تنزيل الفرقان على قلبه\n حتى يفرق بين الحق والباطل\n وحظ من الإسراء بروحه إلى عالم الملكوت والجبروت\n حتى يعاين عجائب أسرار ربه\n\nوما منع الناس من تنزل العلوم اللدنية على قلوبهم\n ومن العروج بروحهم\n إلا عدم التحقق بالعبودية الكاملة لربهم\n حتى يكون مع مراده\n لا مع مرادهم\n لا يريدون إلا ما أراد\n ولا يشتهون إلا ما يقضي\n قد تحرروا من رقِّ الأشياء\n واتحدت عبوديتهم للواحد الأعلى\n فإذا كانوا كذلك صاروا خلفاء الأنبياء\n يُعرج بأرواحهم\n ويُوحى إلى قلوبهم ما يفرقون به من الحق والباطل\n ليكونوا نُذراً لعالمي زمانه قال تعالى:\n[فاطر: 24]\n وبالله التوفيق\n ثم ردّ على أهل الشرك\n فقال: { وَٱتَّخَذُواْ مِن دُونِهِ آلِهَةً\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:120",
      "similarity": 0.5884326635820352
    },
    {
      "verse": "3:189",
      "similarity": 0.5799600473186112
    },
    {
      "verse": "5:40",
      "similarity": 0.5479850714719066
    },
    {
      "verse": "57:2",
      "similarity": 0.505238878850255
    },
    {
      "verse": "54:49",
      "similarity": 0.4618501360913793
    }
  ]
}