{
  "chapter": "الفرقان",
  "text": "اصحب الجنة يومئذ خير مستقرا واحسن مقيلا",
  "translations": [
    {
      "translation": "The Companions of the Garden on that Day will have better lodging and a better resting-place,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The inmates of Paradise will have a better abode that day, and a better resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the contrary) only those who have deserved the Garden, will have a good abode on that Day and a cool place for midday rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dwellers of Paradise on that day will have the best residence and resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for the People of the Garden on that day is a better destination and account, and a better place of afternoon rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dwellers of Paradise will, on that Day, have the best abode, and have the fairest of places for repose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dwellers of the garden shall on that day be in a better abiding-place and a better resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The inhabitants of Paradise that day, better shall be their lodging, fairer their resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have earned the Garden on that day will be better in their home and happier in their place of noonday rest;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The inhabitants of the Garden will have the best residence and the finest lodging on that Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fellows of the Garden shall be on that Day in a goodly abode and a gocdly re pose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day the inhabitants of paradise will be in the best abode and an excellent resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Companions of the Garden will be well, that Day, in their abode, and have the fairest of places for repose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dwellers of Paradise (i.e. those who deserved it through their Faith and righteousness) will, on that Day, have the best abode, and have the fairest of places for repose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, the companions of Paradise (will have) a better abode and a finer restingplace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The companions of Paradise on that Day will be better lodged, and more fairly accommodated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The companions of Paradise, that Day, are [in] a better settlement and better resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:24] Those who will be the inhabitants of Paradise on that day, the Day of Resurrection, will be in a [far] better abode, than are the disbelievers in this world, and a [far] better resting place, than theirs [the latter’s]; in other words, a [better] place for qā’ila, which is a rest taken during midday during hot days. From this [last interpretation of maqīlan] it has been inferred that the Reckoning will be concluded in half a day, as is stated in one hadīth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who have earned the Garden) Muhammad (pbuh) and his Companions (on that day) the Day of Judgement (will be better in their home) abode (and happier in their place of noonday rest) better and happier than the homes and places of Abu Jahl and their hosts;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوأما { أَصْحَابُ ٱلْجَنَّةِ } المتصفون بالإيمان والتوحيد\n وتصديق الكتب والرسل\n الممتثلون بالأوامر والنواهي على مقتضى ما بلَّغهم الرسل وبيَّن له فهم { يَوْمَئِذٍ خَيْرٌ مُّسْتَقَرّاً } أي: من جهة مكان يستقرون عليه\n ويتوطنون فيه { وَأَحْسَنُ مَقِيلاً } [الفرقان: 24] يستريحون\n ويستروحون فيه مع الحور والغلمان\n\n\nيومئذ يتلذذون أو هم { يَوْمَئِذٍ } [الفرقان: 24] أي: يوم انقطاع السلوك\n وانكشاف السُّدل والأغطية المانعة من الشهود { خَيْرٌ مُّسْتَقَرّاً } [الفرقان: 24] من جهة استقرارهم في مقر التوحيد\n آمنين عن وساوس الأوهام والخيالات الباطلة { وَأَحْسَنُ مَقِيلاً } [الفرقان: 24] يستريحون فيه بلا مقتضيات القوى والآلات البشرية المنخلعين عن لوازم ناسوتهم مطلقاً\n مشرفين بخلع من قبل اللأهوت وحضرة الرحموت\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  ثم ذكر ضدهم، فقال: { أصحابُ الجنة يومئذٍ خيرٌ مُستقراً } أي: مكاناً يستقرون فيه، والمستقر: المكان الذي يستقر فيه في أكثر الأوقات، للتجالس والتحادث، { وأحسن مَقِيلاً }: مكاناً يأوون إليه للاسترواح إلى أزواجهم\n ولا نوم في الجنة، ولكنه سمي مكان استرواحهم إلى أزواجهم الحور مقبلاً على طريق التشبيه\n ورُوي أنه يفرغ من الحساب في نصف ذلك اليوم، فيقيل أهل الجنة في الجنة، وأهل النار في النار\n وقال سعيد الصواف: بلغني أن يوم القيامة يقصر على المؤمنين، حتى يكون ما بين العصر إلى غروب الشمس، إنهم ليقيلون في رياض الجنة حتى يفرغ من حساب الناس\n وقرأ هذه الآية\n هـ\n وأما الكافر فيطول عليه، كما قال تعالى:\n\n[المعارج: 4]\n قال أبو السعود: وفي وصفه بزيادة الحسن، مع حصول الخيرية، رمز إلى أنه مزين بفنون الزين والزخارف\n والتفضيل المعتبر فيهما: إما لإرادة الزيادة على الإطلاق، أي: هم في أقصى ما يكون من خيرية المستقر وحسن المقيل، وأما بالإضافة إلى ما للكفرة المتنعمين في الدنيا، أو إلى ما لهم في الآخرة، بطريق التهكم بهم، كما مرّ في قوله: { أذلك خير\n\n\n\n\n } الآية\nهـ\n الإشارة: هؤلاء طلبوا الرؤية قبل إِبَّانِهَا وتحصيل شروطها، وهي الإيمان بالله، والإخلاص، والخضوع لمن يدل على الله، وذل النفس وتصغيرها في طلب الله\n ولذلك قال تعالى في وصفهم - الذي منعهم من شهوده تعالى: { لقد استكبروا في أنفسهم وعَتَوْا عتواً كبيراً } أي: ولو صغروا في أنفسهم، وخضعوا خضوعاً كبيراً لحصل لهم ما طلبوا، ولبُشروا بما أملوا، وفي ذلك يقول الشاعر:\n\nوقيل لأبي يزيد رضي الله عنه، حين قام يصلي بالليل: يا أبا يزيد، خزائننا معمورة بالخدمة، ائتنا من كُوّة الذل والافتقار\n وقال الشيخ عبد القادر الجيلاني رضي الله عنه: أتيت الأبواب كلها فوجدت عليها الزحام، فأتيت باب الذل والفقر فوجدته خالياً، فدخلت وقلت: هلموا إلى ربكم\n أو كما قال\n وفي قوله تعالى: { وَقَدِمْنَا إِلَى مَا عَمِلُواْ مِنْ عَمَلٍ\n\n\n } الخ، الترغيب في الإخلاص الموجب لقبول الأعمال، والترهيب من الرياء والعجب، الموجبان لإحباط الأعمال\n وفي حديث معاذ عنه صلى الله عليه وسلم: \" إن الله خلق سبعة أملاك قبل خلق السموات، ووكل كل مَلَكٍ بباب من أبواب السماء، فتصعد الحَفَظَةُ بعمل العبد إلى السماء الأولى فيقول المَلَكُ: ردوه، واضربوا به وجهه إنَّ صاحبه كان يغتاب الناس، تم تصعد الحفظة بعمل العبد إلى السماء الثانية، فيقول الملك: ردوه إنه كان يفتخر على الناس في مجالسهم ثم تصعد الحفظة بعمل العبد إلى السماء الثالثة فيقول الملك: ردوه إنه كان يتكبر على الناس في مجالسهم ثم تصعد الحفظة بعمل العبد إلى السماء الخامسة فيقول الملك: ردوه إنه كان يحسد الناس ويقع فيهم، ثم تصعد الحفظة إلى السماء السادسة، فيقول الملك: ردوه إنه كان لا يرحم إنساناً قط بل كان يشمت بمن وقع في بلاء أنا ملك الرحمة أمرني ألا يجاوزني عمله\n ثم تصعد الحفظة إلى السماء السابعة فيقول الملك: ردوه إنه كان يحب الظهور والرفعة عند الناس، ثم تصعد الحفظة بعمل العبد من صلاة، وذكر، وتفكر، وحسن خلق، فيقفون بين يدي الله، ويشهدون له بالصلاح، فيقول الرب جل جلاله: أنتم الحفظة على عمل عبدي، وأنا الرقيب على قلبه، إنه لم يُرِدْنِي بهذا العمل، أراد به غيري، فعليه لعنتي، ثم تلعنه الملائكة والسموات\n وانتهى باختصار، وخرجه المنذري\n وتكلم في وضعه\n وبالله التوفيق\n ثم ذكر موطناً آخر لرؤية الملائكة على نمط ما تقدّم، فقال: { وَيَوْمَ تَشَقَّقُ ٱلسَّمَآءُ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:4",
      "similarity": 0.8440778985147446
    },
    {
      "verse": "75:12",
      "similarity": 0.11070435339931933
    },
    {
      "verse": "25:76",
      "similarity": 0.1082570189126021
    },
    {
      "verse": "25:66",
      "similarity": 0.09129894461803725
    },
    {
      "verse": "40:64",
      "similarity": 0.09005271625873208
    }
  ]
}