{
  "chapter": "الفرقان",
  "text": "وعادا وثمودا۟ واصحب الرس وقرونۢا بين ذلك كثيرا",
  "translations": [
    {
      "translation": "The same goes for 'Ad and Thamud and the Companions of the Well and many generations in between.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) 'Ad, Thamud and the people of ar-Rass, and many generations in between them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise were destroyed the `Ad and the Thamud and the people of the Rass, and many a generation in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To each of the tribes of Ad, Thamud, the settlers around the well and many generations in between\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the tribes of A’ad and the Thamud, and the people of the Wells, and many a generation between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (also) `Ad and Thamud, and the Dwellers of Ar-Rass, and many generations in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ad and Samood and the dwellers of the Rass and many generations between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ad, and Thamood, and the men of Er-Rass, and between that generations a many,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (the tribes of) A'ad and Thamud, and the dwellers in Ar-Rass, and many generations in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to  'Ad, and Thamud, and the people of al-Rass, and as We did for the many a generation between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the 'Aad and the Thamud and the dwellers of the pass and generations in-between many.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ‘Ad and Thamud, and the people of Rass, and many generations between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As also 'Ad and Thamud, and the Companions of the Rass, and many a generation between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (also) 'Ad and Thamud, and the dwellers of Ar-Rass, and many generations in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "also to Aad and Thamood and the nation of ErRass and many generations in between;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Aad, and Thamood, and the inhabitants of Arras, and many generations in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [We destroyed] 'Aad and Thamud and the companions of the well and many generations between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:38] And, mention, ‘Ād, the people of Hūd, and Thamūd, the people of Sālih, and the dwellers at al-Rass (al-rass) — the name of a ‘well’; their prophet is said to have been Shu‘ayb; although some say it was someone else. [The story is that] they had been sitting around it [on one occasion] when it collapsed beneath them [burying them] together with their dwellings. And many generations, peoples, in between, that is, between [the people of] ‘Ād and the dwellers at al-Rass.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (the tribes of) 'Aad) and We destroyed the people of Hud (and Thamud) the people of Salih, (and the dwellers in Ar-Rass) the people of Shu'ayb, (and many generations in between) We destroyed them all, even though We have not mentioned them by name.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَصْحَابَ ٱلرَّسِّ } معناه المَعدنُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } دمرنا أيضاً { عَاداً وَثَمُودَاْ } يعني: قوم هود وصالح على المكذبين بتكذيبهم إياهما، وإنكارهم على ما ظهرا عليه من الدعوة إلى طريق الحق { وَ } كذا دمرنا { أَصْحَابَ ٱلرَّسِّ } أيضاً بتكذيبهم رسولهم\n\n\n\n\nقيل: كانوا يعبدون الأصنام، فأرسل الله سبحانه إليهم شعيباً عليه السلام فكذبوه، وهم يسكنون حينئذٍ حول الرسل، وهو البئر الغير المطوية فانهارت، فخسفت بهم وبدارهم\n\n\n\n\nوقيل: الرسل قرية بفلج اليمامة، كان فيها بقايا ثمود، فبعث الله إليهم نبياً فقتلوه فهلكوا\n\n\n\n\nوقيل: أصحاب الرس هي أصحاب الأخدود، وقيل: هو بئر بأنطاكية، قتلوا فيها حبيب النجار\n\n\n\n\nوقيل: هم أصحاب حنظلة بن صفوان النبي عليه السلام، ابتلاهم الله بطيرٍ عظيمٍ كان فيها من كل لونٍ، وسموها عنقاء؛ لطول عنقها، وكانت تسكن جبلهم الذي يقال له: فتخ أو دمخ، وتنقض على صبيانهم فتخطفهم إذا أعوزها الصيد؛ فلذلك سميت مغرَّباً، فدعا عليها حنظلة عليه السلام فأصابتها الصاعقة، ثمَّ إنهم كذبوا حنظلة فقتلوه، فأُهلكوا لذلك\n\n\n\n\nوقيل: قوم قتلوا نبيهم، فرسُوه؛ أي: دسوه في بئر\n\n\n\n\n{ وَ } بالجملة: دمرنا بواسطة تكذيب رسلنا { قُرُوناً } أُخر؛ أي: أهل قرون وأعصارٍ، قيل: القرن أربعون سنة، وقيل: مائة وعشرون سنة { بَيْنَ ذَلِكَ } المذكور من الأمم الهالكة { كَثِيراً } [الفرقان: 38] لا يعلم عددها إلا الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } دمرنا أيضاً { عاداً وثموداً } ، وقد تقدم في الأعراف، وهو كيفية تدميرهم\n { وأصحابَ الرَّسّ } ، هم قوم شعيب قال ابن عباس: أصحاب الرسّ: أصحاب البئر\n قال وهب: كانوا أهل بئر، قعوداً عليها، وأصحابَ مواشي، وكانوا يعبدون الأصنام، فأرسل الله إليهم شعيباً، فآذوه، وتمادوا في طغيانهم فبينما هم حول البئر - والبئر في وسط منازلهم - انهارت بهم وبديارهم، فهلكوا جميعاً\n وقال قتادة: الرسُّ: قرية بفَلْح اليمامة، قتلوا نبيّهم فأهلكهم الله\n وقيل: هم بقية قوم هود وقوم صالح، وهو أصحاب البئر، التي قال:\n\n[الحج: 45]\n وقال سعيد بن جبير وغيره: قوم كان لهم نبي، يقال له: حنظلة بن صفوان، وكان بأرضهم جبل، يقال له: فتخ، مَصْعَدُه في السماء ميل، وكانت العنقاء تنتابه، وهي كأعظم ما يكون من الطير، وفيها من كل لون - وسموها العنقاء لطول عنقها - وكانت تنقض على الطير فتأكلها، فجاعت ذات يوم، فانقضت على صبي فذهبت به، - وسميت عنقاء مغرب لأنها تُغّرِّبُ ما تأكله عن أهله فتأكله - ثم انقضت على جارية قد ترعرعت، فأخذتها فطارت بها، فشكوا إلى نبيهم، فقال: اللهم خذها واقطع نسلها، فأصابتها صاعقة، فاحترقت، فلم يُر لها أثر، فصارت مثلاً عند العرب\n ثم إنهم قتلوا نبيهم فأهلكم الله\n وقال مقاتل والسدي: هم أصحاب بئر إنطاكية، وتسمى الرس، قتلوا فيها حبيباً النجار، فنُسبوا إليها، وهم الذين ذُكروا في يس\n وقيل هم أصحاب الأخدود الذين حفروه، والرسُّ في كلام العرب: كل محفور مثل البئر، والقبر، والمعدن، وغير ذلك، وجمعها: رساس\n وقال عكرمة: هم قوم رسّوا نبيهم في بئر\n قال النبي صلى الله عليه وسلم: \" إن أول الناس مِمَّنْ يدخل الجنة عبد أسود، وذلك أن الله تعالى بَعَثَ نَبِياً إلى قَرْيَةٍ، فَلَمْ يُؤْمِنْ بِهِ إلا ذلِكَ الأَسْوَد، فحَفَرَ أَهْلُ القَرْيَةِ بِئْراً وأَلْقوا فِيها نبيهم، وأطْبقُوا عَلَيْهَا بحَجر ضخْم، فكَانَ العَبْدُ يَحْتَطِب على ظهره، ويبيعه، ويأتيه بطعامه، فيعينه الله تعالى على رفع تلك الصخرة حتى يُدليه إليْهِ\n\n\nفبينما هو يحْتَطِبُ ذَات يَوْمٍ إذا نام فَضَرَبَ على أذنهِ سَبْعَ سِنينَ ثم جاء بطَعَامه إلى البئر فلم يَجِده\n وكان قومُه قد بدا لهم فاسْتَخْرجُوه وآمَنُوا بِهِ، ومات ذلك النبي، فقال - عليه الصلاة والسلام -:\n\n \" إنَّ ذَلِكَ الأسْوَدَ لأوَّلُ مَنْ يَدْخُلُ الجَنَّة \" \n\n، يعني من قومه\n هـ\n وهؤلاء آمنوا فلا يصح حمل الآية عليها، إلا أن يكون أحدثوا شيئاً بعد نبيهم، فدمرهم الله\n وقال جعفر بن محمد عن أبيه: أن أصحاب الرسّ: السحّاقات، قال أنس: قال النبي صلى الله عليه وسلم:\n\n \" إِنَّ مِنْ أَشْراطِ السَّاعَةِ أن يستكفي الرجالُ بالرجالِ، والنساءُ بالنساءِ \" \n\n، وذلك السحاق، ويقال له أيضاً: المساحقة، وهو حرام بالإجماع\n وسبب ظهوره: أن قوماً أحدثوا فاحشة اللواط، حتى استغنوا عن النساء، فبقيت النساء معطلة، فجاءتهن شيطانة في صورة إمرأة، وهي الوَلِهات بنت إبليس، فشهَّت إلى النساء ركوب بعضهن بعضاً، وعلمتهن كيف يصنعن ذلك، فسلط عليهم صاعقة من أول الليل، وخسفاً من آخر الليل، وصيحة مع الشمس، فلم يبق منهم بقية\n هـ\n { وقُُروناً } أي: دمرنا أهل قرون\n والقرن سبعون سنة، وقيل: أقل، وقيل: أكثر، { بين ذلك } أي: بين ذلك المذكور من الأمم والطوائف، { كثيراً } ، لا يعلم عددها إلا العليمُ الخبير، { وكلاً } من الأمم المذكورين قد { ضربنا له الأمثالَ } أي: بيَّنا له القصص العجيبة، الزاجرة عما هم عليه من الكفر والمعاصي، بواسطة الرسل",
      "translations": []
    }
  ]
}