{
  "chapter": "الفرقان",
  "text": "وكذلك جعلنا لكل نبى عدوا من المجرمين وكفى بربك هاديا ونصيرا",
  "translations": [
    {
      "translation": "In this way We have assigned to every Prophet an enemy from among the evildoers. But your Lord is a sufficient guide and helper.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We keep opponents among the sinners for every apostle; yet your Lord is sufficient as a guide and helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Muhammad, in this very way We have made the criminals the enemies of every Prophet, but your Lord suffices for you as your Guide and Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, from the sinful people We made enemies for every Prophet. Your Lord is a Sufficient Guide and Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how We had appointed guilty people as enemies to every Prophet; and Allah is Sufficient, to guide and to aid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We made for every Prophet an enemy among the criminals. But sufficient is your Lord as a Guide and Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We made for every prophet an enemy from among the sinners and sufficient is your Lord as a Guide and a Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so We have appointed to every Prophet an enemy among the sinners; but thy Lord suffices as a guide and as a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so have We appointed unto every prophet an opponent from among the guilty; but Allah sufficeth for a Guide and Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "thus did We assign to every prophet an enemy from among the sinners; your Lord is sufficient as a guide and a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even scals We appointed unto every prophet an enemy from among the culprits. And thine Lord sufficeth as GUide and Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how for every prophet We assigned an enemy from among the guilty, and your Lord suffices as helper and guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We made for every prophet an enemy among the sinners: but enough is thy Lord to guide and to help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We made for every Prophet an enemy among the Mujrimun (disbelievers, polytheists, criminals, etc.). But Sufficient is your Lord as a Guide and Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every Prophet We have appointed an enemy among the harmdoers; your Lord is Sufficient for you, a Guide and a Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, to every prophet We assign enemies from among the wicked. But your Lord suffices as a Guide and Savior.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We made for every prophet an enemy from among the criminals. But sufficient is your Lord as a guide and a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:31] God, exalted be He, says: So, just as We have appointed for you enemies from among the idolaters of your people, We have appointed to every prophet, before you, an enemy from among the guilty, the idolaters — so be steadfast as they were; but your Lord suffices as a Guide, for you, and a Helper, to bring you victory over your enemies.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Even so) just as We have appointed Abu Jahl as your enemy (have We appointed unto every Prophet) before you (an opponent from among the guilty) from the idolaters of his people; (but Allah sufficeth for a Guide) a Preserver (and Helper) and Defender against what they plot against you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { كَذَلِكَ } أي: مثل ما جعلنا لك يا أكمل الرسل أعداءً منكرين مكذبين { جَعَلْنَا } أيضاً { لِكُلِّ نَبِيٍّ } من الأنبياء الماضين { عَدُوّاً مِّنَ ٱلْمُجْرِمِينَ } المنكرين المكذبين لهم\n ويسيئون الأدب معهم ويطعنون بكتبهم\n ولا ينصرونهم ولا يروجون دينهم ولا يقبلون منهم قولهم\n وليس هذا مخصوصاً بك و بدينك وكتباك { وَ } بالجملة: لا تحزن عليهم\n إذ { كَفَىٰ بِرَبِّكَ } أي: كفى ربك لك { هَادِياً } يرشدك إلى مقصدك\n ويغلبك على عدوك { وَنَصِيراً } [الفرقان: 31] حسيباً يكفيك مؤونة شرورهم وعداوتهم وإنكارهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكفى بربك هادياً ونصيراً } \n وهو وعد كريم بالهداية له إلى مطالبه\n والنصر على أعدائه\n أي: كفاك مالِكُ أمرِك ومُبَلغك إلى غاية الكمال\n هادياً إلى ما يوصلك إلى غاية الغايات\n التي من جملتها: تبليغ الكتاب\n وإجراء أحكامه إلي يوم القيامة\n أو: وكفى بربك هادياً لك إلى طريق قهرهم والانتصار منهم\n وناصراً لك عليهم\n والعدو: يجوز أن يكون واحداً وجمعاً\n والباء زائدة\n و { هادياً ونصيراً }: تمييزان\n والله تعالى أعلم\n الإشارة: من السنة التي أجراها الله تعالى في خواصه: أن يكون جيرانهم وأقاربهم أزهد الناس فيهم\n وأقواهم عليهم\n وأعدى الناس إليهم\n وفي الأثر:\n \" أزْهَدُ النَّاس في العَالِم جِيرانُهُ \" \nفلا ينتفع بالولي\n في الغالب\n إلا أبعدُ الناس منه\n وقلَّ أن تجد ولياً عُمِّرَ سُوقُهُ في بلده\n فالهجرة سنة ماضية\n ولن تسجد لسنة الله تبديلاً\n وكما جعل لكل نبي عدواً جعل لكل ولي عدواً\n فلا بد للولي أن يبقى له من يحركه إلى ربه بالإذاية والتحريش\n إما من جيرانه\n أو من نسائه وأولاده ليكون سيره بين جلاله وجماله\n وكفى بربك هادياً ونصيراً\n ثم ذكر اقتراحهم الخاص في القرآن\n بعد أن ذكر اقتراحهم الخاص به عليه الصلاة والسلام\n فقال: { وَقَالَ ٱلَّذِينَ كَفَرُواْ لَوْلاَ نُزِّلَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:45",
      "similarity": 0.6881538688163881
    },
    {
      "verse": "4:70",
      "similarity": 0.5019552360063773
    },
    {
      "verse": "33:3",
      "similarity": 0.46189598144533356
    },
    {
      "verse": "48:28",
      "similarity": 0.45149067149940075
    },
    {
      "verse": "4:132",
      "similarity": 0.45059180654596614
    }
  ]
}