{
  "chapter": "الفرقان",
  "text": "الذين يحشرون على وجوههم الى جهنم او۟لئك شر مكانا واضل سبيلا",
  "translations": [
    {
      "translation": "Those who will be pushed faces forward into Hell will be in a worse position, farther away from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who are going to be driven to Hell upon their faces, have taken an utterly wrong stand and their way is most erroneous!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be driven headlong into hell will have a terrible dwelling; they have certainly gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be dragged on their faces towards hell – theirs is the worst destination and they are the most astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered to Hell on their faces, such will be in an evil state, and most astray from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who shall be gathered upon their faces to hell, they are in a worse plight and straying farther away from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who shall be mustered to Gehenna upon their faces -- they shall be worse in place, and gone further astray from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered on their faces unto hell: such are worse in plight and further from the right road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be dragged headlong into Hell shall have an evil place to dwell in, for they have strayed far from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who shall be gathered prone on their faces unto Hell-- those shall be worst in respect of place and the most astray in respect of path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be mustered [fallen] on their faces toward hell, they are the worse situated and further astray from the [right] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered to Hell (prone) on their faces,- they will be in an evil plight, and, as to Path, most astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered to Hell (prone) on their faces, such will be in an evil state, and most astray from the (Straight) Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered into Gehenna (Hell) upon their faces shall be in the worst in place, and have gone further astray from the Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are herded into Hell on their faces—those are in a worse position, and further astray from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ones who are gathered on their faces to Hell - those are the worst in position and farthest astray in [their] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:34] They are, those who will be gathered on their faces, that is, [those who] will be driven [as cattle], toward Hell: they will be in the worst place, namely, Hell, and furthest astray from the way, [they will be] on a path of error worse than that of others; and this [path] is their disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who will be gathered) will be dragged (on their faces unto hell) i.e. Abu Jahl and his host: (such are worse in plight) they have a worse abode in the Hereafter and worse works in this worldly life (and further from the right road) from the Truth and guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يتأتى منهم المعارضة والمجادلة معك يا أكمل الرسل مع تأييدنا إياك في النشأة الأولى والأخرى، وهم في الدنيا مقهورون مغلوبون، وفي الآخرة { ٱلَّذِينَ يُحْشَرُونَ } ويُسحبون { عَلَىٰ وُجُوهِهِمْ إِلَىٰ جَهَنَّمَ } البعد والخذلان، وجحيم الطرد والحرمان، وبالجملة: { أُوْلَـٰئِكَ } الأشقياء المردودون عن شرف القبول { شَرٌّ مَّكَاناً } ومصيراً { وَأَضَلُّ سَبِيلاً } [الفرقان: 34] وأخطأ طريقاً، اهدنا بفضلك سواء سبيلك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر مآل الكفرة المقترحين لهذه الشُّبَهِ، فقال: { الذين يُحشرون على وجوههم إلى جهنم } أي: يُحشرون كائنين على وجوههم، يُسبحون عليها، ويجرون إلى جهنم\n وقيل: مقلوبين وجوههم إلى قفاهم، وأرجلُهم فوق، { أؤلئك شرٌّ مكاناً } أي: مكانة ومنزلة، أو: مسكناً ومنزلاً، { وأضلُّ سبيلا } وأخطأ طريقاً\n ونزلت الآية لَمَّا قالوا: إن أصحاب محمد شر خلق الله وأضل الناس طريقاً\n وقيل: المعنى: إن حاملكم على هذه السؤالات اعتقادُكُمَ أن محمداً ضال، ومكانه حقير، ولو نظرتم إلى ما يؤول إليه أمركم، لعلمتم أنكم شر منه مكاناً، وأضل سبيلاً\n والله تعالى أعلم\n الإشارة: تثبيت القلوب على الإيمان، وتربية اليقين، يكون بصحبة الأبرار ورؤية العارفين الكبار، والترقي في معاريج التوحيد، إلى أن يفضي إلى مقام العيان، يكون بعقد الصحبة مع أهل التربية، وخدمتهم وتعظيمهم، حتى يوصلوه إلى ربه\n ومن شأنهم أن الله يدافع عنهم، ويجيب من سألهم تشغيباً، فيلهمهم الجواب، فضلاً منه، فلا يُسألون عن شيء إلا جاءهم بالحق وأحسن تفسيراً، ثم هدد من صغَّرهم وحقَّر شأنهم بقوله: { الذين يُحشرون\n\n\n } الآية\n والله تعالى أعلم\n ثم ردّ على من طلب انزال القرآن جملة بكون كتاب التوراة نزل جملة، ومع ذلك كفروا به، فقال: { وَلَقَدْ آتَيْنَا مُوسَى ٱلْكِتَابَ\n\n\n }\n",
      "translations": []
    }
  ]
}