{
  "chapter": "الفرقان",
  "text": "ولا ياتونك بمثل الا جئنك بالحق واحسن تفسيرا",
  "translations": [
    {
      "translation": "Every time they come to you with a difficult point, We bring you the truth and the best of explanations.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not an example they advance to which We do not give you a right answer and a better explanation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (there is another wisdom in this: whenever they brought to you an odd thing (or a strange question), We sent its right answer to you in time and explained it all in the best manner,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will support you with the Truth and the best interpretation whenever the infidels argue against you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will never bring you an example, but We shall bring you a true narration and better than it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no example or parable do they bring, but We reveal to you the truth, and the better explanation thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they shall not bring to you any argument, but We have brought to you (one) with truth and best in significance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They bring not to thee any similitude but that We bring thee the truth, and better in exposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they bring thee no similitude but We bring thee the Truth (as against it), and better (than their similitude) as argument.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every time they raise an objection, We will bring you the truth and the best of explanations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they come not unto thee with a similitude but We bring thee the truth and an excellent interpretation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not bring you any representation but that We bring you the truth [in reply to them] and the best exposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no question do they bring to thee but We reveal to thee the truth and the best explanation (thereof).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no example or similitude do they bring (to oppose or to find fault in you or in this Quran), but We reveal to you the truth (against that similitude or example), and the better explanation thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not bring to you any parable but that which We bring to you is the truth and better in explanation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever argument they come to you with, We provide you with the truth, and a better exposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they do not come to you with an argument except that We bring you the truth and the best explanation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:33]   And they do not bring you any similitude, to invalidate your mission, but that We bring you the truth, that refutes it, and [what is] better [as] exposition, explanation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they bring thee) Muhammad (no similitude) no description, proof or explanation (but We bring thee the Truth) with a description, exposition and proof that contradict their proof (and better (than their similitude) as argument) and better explanation and proof than their proof.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nومن هذا تبين معنى قوله: { ولا يأتونك بمثل } أي: صفة عجيبة { إلا جئناك بالحق } الذي يقمع باطل تلك الصفة كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً من جملة حِكمة إنزاله منجماً: إنه { لاَ يَأْتُونَكَ بِمَثَلٍ } عجيب غريب يضربون لك جدلاً ومكابرةً في وقت من الأوقات، وحال من الحالات على تفاوت طبقاتهم { إِلاَّ جِئْنَاكَ بِٱلْحَقِّ } أي: جئناك بالمثل الحق على طريق البرهان تأييداً لك وترويجاً لأمرك ودينك أوضح بياناً مما جاءوا به { وَأَحْسَنَ تَفْسِيراً } [الفرقان: 33] وتبييناً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ولا يأتونك بمَثَلٍ } بسؤال عجيب من سؤالاتهم الباطلة، واقتراحاتهم الفاسدة الخارجة عن دائرة العقول، الجارية لذلك مجرى الأمثال، { إلا جئناك بالحقِّ } إلا أتيناك بالجواب الحق الذي لا محيد عنه، الذي ينحى عليه بالإبطال ويحسم مادة القيل والقال، كما مر من الأجوبة الحقية، القالعة لعروق أسئلتهم الشنيعة، الدامغة لها بالكلية\n وجئناك بأحسن { تفسيراً } أي: بيانأ وتفصيلاً، بمعنى أنه في غاية ما يكون من الحسن في حد ذاته، لا أن ما يأتون به حَسَنٌ، وهذا أحسن منه، وإنما المعنى: لا يسألونك عن شيء غريب إلا جئناك بما يبطله وما يكشف معناه، ويفسره غاية التفسير",
      "translations": []
    }
  ]
}