{
  "chapter": "الفرقان",
  "text": "وقال الرسول يرب ان قومى اتخذوا۟ هذا القرءان مهجورا",
  "translations": [
    {
      "translation": "The Messenger says, 'My Lord, my people treat this Qur'an as something to be ignored.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The prophet will say: \"O my Lord, my people had fettered the Qur'an.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Messenger will say, \"O my Lord, my people had made this Qur'an the object of their ridicule.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messengers will say, \"Lord, my people had abandoned this Quran.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Noble Messenger submitted, “O my Lord – indeed my people took this Qur’an as worthy of being abandoned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Messenger will say: \"O my Lord! Verily, my people deserted this Qur'an.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Apostle cried out: O my Lord! surely my people have treated this Quran as a forsaken thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger says, 'O my Lord, behold, my people have taken this Koran as a thing to be shunned.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the messenger saith: O my Lord! Lo! mine own folk make this Qur'an of no account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger will say, \"Lord, my people did indeed discard the Quran,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Apostle will say: my lord! verily my people too k this Qur'an as a thing to be shunned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Apostle will say, ‘O my Lord! Indeed my people consigned this Quran to oblivion.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Messenger will say: \"O my Lord! Truly my people took this Qur'an for just foolish nonsense.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Messenger (Muhammad SAW) will say: \"O my Lord! Verily, my people deserted this Quran (neither listened to it, nor acted on its laws and orders).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger says: 'O my Lord, my people have taken this Koran while deserting it'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Messenger will say, “My Lord, my people have abandoned this Quran.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Messenger has said, \"O my Lord, indeed my people have taken this Qur'an as [a thing] abandoned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:30] And the Messenger, Muhammad (s), says, ‘O my Lord, lo! my people, the [tribe of] Quraysh, consider this Qur’ān as something to be shunned’, to be disregarded.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the messenger) Muhammad (pbuh) (saith: my Lord! Lo! mine own folk make this Qur'an of no account) they speak ill of it, they do not believe in it and do not act upon its teachings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما طعنوا في القرآن كثيراً، ونبذوه وراء ظهورهم نبذاً يسيراً بلا التفات لهم إليه وإلى ما فيه من الأوامر والنواهي { قَالَ ٱلرَّسُولُ } مشتكياً إلى الله مناجياً: { يٰرَبِّ إِنَّ قَوْمِي } الذي بعثتني إليهم؛ لأهديهم وأرشدهم إلى توحيدك، وأبني لهم حدود ما أنزلت إليَّ من الكتاب المعجز الجامع لجميع ما في الكتب السالفة، المشتمل على جميع المعارف والحقائق والحِكم، والأحكام المتعلقة بالتدين والتخلق في طريق توحيدك وتفريدك وتقديسك، مع أن هؤلاء الجهلة المسرفين { ٱتَّخَذُواْ هَـٰذَا ٱلْقُرْآنَ } مع سطوع برهانه، وقواطع حججه وتبيانه { مَهْجُوراً } [الفرقان: 30] متروكاً لا يلتفتون إليه ولا يسترشدون منه، ولا يتوجهون نحوهن بل يقدحون فيه ويكذبون، وينسبون إليه ما لا يليق بشأنهز\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وقال الرسول: عطف على: وقال الذين لا يرجون\n\n، وما بينهما: اعتراض لبيان قبح ما قالوا، وما يحيق بهم في الآخرة من الأهوال والخطوب\n يقول الحق جل جلاله: { وقال الرسولُ } محمد صلى الله عليه وسلم، وإيراده بعنوان الرسالة للرد في نحورهم، حيث كان ما حكي عنهم قدحاً في رسالته صلى الله عليه وسلم، أي: قال، إثر ما شاهد منهم من غاية العتو ونهاية الطغيان، شاكياً إلى ربه - عز وجل:- { يا ربِّ إِن قومي } ، يعني: قريشاً الذي حكى عنهم ما تقدم من الشنائع، { اتخذوا هذا القرآنَ } ، الذي من جملته الآيات الناطقة بما يحيق بهم في الآخرة من فنون العقاب، { مهجوراً } أي: متروكاً بالكلية، فلم يؤمنوا به ويرفعوا إليه رأساً، ولم يتأثروا بوعظه ووعيده، وهو من الهجران، وفيه تلويح بأن حق المؤمن أن يكون كثيرَ التعاهد للقرآن لئلا يندرج تحت ظاهر النظم الكريم\n قال أنس: قال النبي صلى الله عليه وسلم:\n\n \" مَنْ تَعَلَّم القُرْآن فعلَّقَ مُصحفاً لَمْ يتعَاهَدْهُ، وَلَمْ يَنْظُرْ فيه، جَاءَ يَوْمَ الْقِيَامَةِ مُتعَلِّقاً بِهِ، يَقُولُ: يَا رَبَّ العَالمينَ عَبْدُكَ هذَا اتَّخَذَنِي مَهْجُوراً، اقْضِ بَيْنِي وبَيْنَهُ \"\n \n\nوقيل: هو من هجر إذا هذى، أي: قالوا فيه أقاويل باطلة، كالسحر، ونحوه، أو: بأن هجروا فيه إذا سمعوه، كقولهم:\n\n[فصلت: 26] أي: مهجوراً فيه\n وفيه من التحذير والتخويف ما لا يخفى، فإن الأنبياء - عليهم السلام - إذا شكوا إلى الله تعالى قومهم عجَّل لهم العذاب، ولم يُنظروا\n ثم أقبل عليه مسلياً، وواعداً لنصره عليهم، فقال: { وكذلك جعلنا لكل نبي عدواً من المجرمين } فتسلّ بهم، واقْتَدِ بمن قبلك من الأنبياء، فَمِنْ هنا سَاروا\n أي: كما جعلنا لك أعداء من المشركين، يقولون ما يقولون، ويفعلون ما يفعلون من الأباطيل، جعلنا لكل نبي من الأنبياء، الذين هم أصحاب الشرائع والدعوة إليها، عدواً من مجرمي قومِهم، فاصبر كما صبروا فإن الله ناصرك كما نصرهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:26",
      "similarity": 0.49498925922836945
    },
    {
      "verse": "22:58",
      "similarity": 0.4691850317148876
    },
    {
      "verse": "16:110",
      "similarity": 0.4339057874921669
    },
    {
      "verse": "8:75",
      "similarity": 0.42078002363116834
    },
    {
      "verse": "2:218",
      "similarity": 0.4129041882764258
    }
  ]
}