{
  "chapter": "الفرقان",
  "text": "وقوم نوح لما كذبوا۟ الرسل اغرقنهم وجعلنهم للناس ءاية واعتدنا للظلمين عذابا اليما",
  "translations": [
    {
      "translation": "We had drowned the people of Noah when they had accused the apostles of lies, and turned them into an example for men. We have prepared a painful punishment for the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The same was the case with the people of Noah when they charged the Messenger with imposture: We drowned them and made them a sign of warning for entire mankind, and We have prepared a painful chastisement for the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We drowned the people of Noah because of their rejection of the Messengers and made them evidence of the Truth for mankind. We have prepared a painful torment for the unjust ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Nooh – when they denied the Noble Messengers, We drowned them and made them a sign for mankind; and We have kept prepared a painful punishment for the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Nuh's people, when they denied the Messengers, We drowned them, and We made them as a sign for mankind. And We have prepared a painful torment for the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Nuh, when they rejected the apostles, We drowned them, and made them a sign for men, and We have prepared a painful punishment for the unjust;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Noah, when they cried lies to the Messengers, We drowned them, and made them to be a sign to mankind; and We have prepared for the evildoers a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Noah's folk, when they denied the messengers, We drowned them and made of them a portent for mankind. We have prepared a painful doom for evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We drowned the people of Noah also when they rejected their messengers and We made them an example to all mankind. We have prepared a painful punishment for the wrongdoers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Nuh! When they belied the apostles We drowned them, and made them a sign unto mankind. And We have gotten ready unto the wrong-doers a torment afflictive,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Noah’s people, We drowned them when they impugned the apostles, and We made them a sign for mankind, and We have prepared for the wrongdoers a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Noah,- when they rejected the messengers, We drowned them, and We made them as a Sign for mankind; and We have prepared for (all) wrong-doers a grievous Penalty;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Nuh's (Noah) people, when they denied the Messengers We drowned them, and We made them as a sign for mankind. And We have prepared a painful torment for the Zalimun (polytheists and wrong-doers, etc).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The nation of Noah, We drowned them when they belied their Messenger, and made of them a sign to the nation. For the harmdoers We have prepared a painful punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Noah: when they rejected the messengers, We drowned them, and made them a lesson for mankind. We have prepared for the wrongdoers a painful retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Noah - when they denied the messengers, We drowned them, and We made them for mankind a sign. And We have prepared for the wrongdoers a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:37] And, mention, the people of Noah, when they denied the messengers, in denying Noah — it is as though he were many messengers given the length of time he remained among them; or [it is thus expressed in the plural] because to deny him is [equivalent] to denying all the other messengers, for they all came with the same [Message concerning] affirmation of God’s Oneness — We drowned them (this is the response to lammā, ‘when’) and made them a sign, a lesson, for mankind, thereafter, and We have prepared, in the Hereafter, for the evildoers, the disbelievers, a painful chastisement, in addition to what [chastisement] may befall them in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Noah's folk) and We destroyed the people of Noah, (when they denied the messengers) i.e. Noah and the rest of messengers, (We drowned them) by means of the flood (and made of them a portent for mankind) We made them an admonition for other people so that they do not follow their example. (We have prepared a painful doom) in the Fire (for evil-doers) for the idolaters, the idolaters of Mecca.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كذا دمرنا { قَوْمَ نُوحٍ لَّمَّا كَذَّبُواْ ٱلرُّسُلَ } أي: حين كذبوا نوحاً ومن مضى قبلهم من الأنبياء؛ إذ أمرهم نوح بتصديقهم والإيمان بهم فكذبوا بهم تبعاً؛ لذلك { أَغْرَقْنَاهُمْ } بالطوفان { وَجَعَلْنَاهُمْ } أي: جعلنا إغراقنا إياهم بالمرة { لِلنَّاسِ } المعتبرين من أمثال هذه الوقائع { آيَةً } علامة وعبرة تعتبرون منها وتستوحشون، وتحسنون الأدب مع الله ورسوله خوفاً من بطشه وانتقامه { وَ } كيف لا يخافون من أخذنا وبطشنا؛ إذ { أَعْتَدْنَا } وهيأنا { لِلظَّالِمِينَ } الخارجين عن مقتضى حدودنا { عَذَاباً أَلِيماً } [الفرقان: 37] مؤلماً أشد إيلام، وانتقمنا منهم أصعب انتقام؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وقوم: منصوب بمضمر يدل عليه دمرناهم، أي: ودمرنا قوم نوح، و عاداً وثموداً: عطف على قوم نوح\n يقول الحق جل جلاله: { و } دمرنا أيضاً { قومَ نوحٍ } ، وذلك أنهم { لمَّا كذَّبوا الرسلَ } نوحاً، ومن قبله شَيْثاً وإدريس، أو: لأن تكذيبهم لواحد تكذيب للجميع لاتِّفَاقِهمْ على التوحيد والإسلام، { أغرقناهم } بالطوفان، { وجعلناهم } أي: وجعلنا إغراقهم أو قصتهم { للناس آية }: عبرة يعتبر بها كل من يشاهدها أو يسمعها\n { وأَعْتَدنا } هيأنا { للظالمين } أي: لهم\n وأظهر في موضع الإضمار للإيذان بتجاوزهم الحد في الظلم، أو لكل ظالم ظلم شرك، فيدخل كل من شاركهم، كقريش وغيرهم، أي: هيأنا { عذاباً أليماً } ، أي: النار المؤبدة عليهم",
      "translations": []
    }
  ]
}