{
  "chapter": "الفرقان",
  "text": "الذين يحشرون على وجوههم الى جهنم او۟لئك شر مكانا واضل سبيلا",
  "translations": [
    {
      "translation": "Those who are herded headlong into Hell, such people are in the worst position. They are the most",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be pushed faces forward into Hell will be in a worse position, farther away from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who are going to be driven to Hell upon their faces, have taken an utterly wrong stand and their way is most erroneous!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be driven headlong into hell will have a terrible dwelling; they have certainly gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be dragged on their faces towards hell – theirs is the worst destination and they are the most astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered to Hell on their faces, such will be in an evil state, and most astray from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who shall be gathered upon their faces to hell, they are in a worse plight and straying farther away from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who shall be mustered to Gehenna upon their faces -- they shall be worse in place, and gone further astray from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered on their faces unto hell: such are worse in plight and further from the right road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be dragged headlong into Hell shall have an evil place to dwell in, for they have strayed far from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who shall be gathered prone on their faces unto Hell-- those shall be worst in respect of place and the most astray in respect of path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be mustered [fallen] on their faces toward hell, they are the worse situated and further astray from the [right] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered to Hell (prone) on their faces,- they will be in an evil plight, and, as to Path, most astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered to Hell (prone) on their faces, such will be in an evil state, and most astray from the (Straight) Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will be gathered into Gehenna (Hell) upon their faces shall be in the worst in place, and have gone further astray from the Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are herded into Hell on their faces—those are in a worse position, and further astray from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ones who are gathered on their faces to Hell - those are the worst in position and farthest astray in [their] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:34] They are, those who will be gathered on their faces, that is, [those who] will be driven [as cattle], toward Hell: they will be in the worst place, namely, Hell, and furthest astray from the way, [they will be] on a path of error worse than that of others; and this [path] is their disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who will be gathered) will be dragged (on their faces unto hell) i.e. Abu Jahl and his host: (such are worse in plight) they have a worse abode in the Hereafter and worse works in this worldly life (and further from the right road) from the Truth and guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { الذين يحشرون على وجوههم } لشدة ميل نفوسهم لى الجهة السفلية فتنكست فطرتهم فبعثوا على صور وجوهها إلى الأرض يسحبون إلى نار الطبع { أولئك شرّ مكاناً } من أن يقبلوا الحق الدامغ لباطل صفاتهم { وأضلّ سبيلاً } من أن يهتدوا إلى صفات الله تعالى التي هي تفسير صفاتهم وكشفها\n { أرأيت من اتخذ إلهه هواه } كل محجوب بشيء واقف معه\n فهو محبّ له\n مجانس لذلك الشيء\n فهو في الحقيقة عابد لهواه بعبادته لذلك المحبوب\n والباعث لهواه على محبة غير الله هو الشيطان\n فمحبّ كل شيء غير الله لا لله وبغير محبة الله عابد له ولهواه وللشيطان متعدد المعبود متفرق الوجهة\n أبعدَ ذلك { تكون عليه وكيلاً } بدعوته إلى التوحيد وقد كان في غاية البعد محجوباً بظلّ من ظلاله\n { ألم تر إلى ربّك كيف مدّ الظل } بالوجود الإضافي\n اعلم أن ماهيات الأشياء وحقائق الأعيان هي ظل الحق وصفة عالمية الوجود المطلق\n فمدها إظهارها باسمه النور الذي هو الوجود الظاهر الخارجي الذي يظهر به كل شيء ويبرز كتم العدم إلى فضاء الوجود أي الإضافي { ولو شاء لجعله ساكناً } أي: ثابتاً في العدم الذي هو خزانة وجوده\n أي: أمّ الكتاب واللوح المحفوظ الثابث وجود كل شيء فيهما في الباطن وحقيقته لا العدم الصرف بمعنى اللاشيء فإنه لا يقبل الوجود أصلاً\n وما ليس له وجود في الباطن وخزانة علم الحق وغيبه لم يمكن وجوده أصلاً في الظاهر\n والإيجاد والإعدام ليس إلا إظهار ما هو ثابت في الغيب وإخفاؤه فحسب وهو الظاهر والباطن وهو بكل شيء عليم { ثم جعلنا } شمس العقل { عليه } أي: الظل { دليلاً } يهدي إلى أن حقيقته غير وجوده وإلا فلا مغايرة بينهما في الخارج فلا يوجد إلا الوجود فحسب\n إذ لو يمكن وجوده لما كان شيئاً فلا يدلّ على كونه شيئاً غير الوجود إلى العقل { ثم قبضناه إلينا } بإفنائه { قبضاً يسيراً } لأن كل ما يفنى من الموجودات في كل وقت فهو يسير بالقياس إلى ما سبق\n وسيظهر كل مقبوض عما قليل في مظهر آخر\n والقبض دليل على أن الإفناء ليس إعداماً محضاً بل هو منع عن الانتشار في قبضته التي هي العقل الحافظ لصورته وحقيقته أزلاً وأبداً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وفي الآخرة { ٱلَّذِينَ يُحْشَرُونَ } ويُسحبون { عَلَىٰ وُجُوهِهِمْ إِلَىٰ جَهَنَّمَ } البعد والخذلان\n وجحيم الطرد والحرمان\n وبالجملة: { أُوْلَـٰئِكَ } الأشقياء المردودون عن شرف القبول { شَرٌّ مَّكَاناً } ومصيراً { وَأَضَلُّ سَبِيلاً } [الفرقان: 34] وأخطأ طريقاً\n اهدنا بفضلك سواء سبيلك\n\n\nثمَّ أخذ سبحانه في تعداد المنكرين الخارجين على رسل الله\n المكذِّبين لهم\n المسيئين الأدب معهم\n وما جرى عليهم بسوء صنيعهم من أنواع العقوبات والنكبات\n فقال: { وَلَقَدْ آتَيْنَا مُوسَى ٱلْكِتَابَ } أي: التوراة المشتملة على الأحكام\n ليبين للأنام ما فيها من الأوامر والنواهي المصفية للنفوس المنغمسة بالمعاصي والآثام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { الذين يُحشرون على وجوههم إلى جهنم } أي: يُحشرون كائنين على وجوههم\n يُسبحون عليها\n ويجرون إلى جهنم\n وقيل: مقلوبين وجوههم إلى قفاهم\n وأرجلُهم فوق\n { أؤلئك شرٌّ مكاناً } أي: مكانة ومنزلة\n أو: مسكناً ومنزلاً\n { وأضلُّ سبيلا } وأخطأ طريقاً\n ونزلت الآية لَمَّا قالوا: إن أصحاب محمد شر خلق الله وأضل الناس طريقاً\n وقيل: المعنى: إن حاملكم على هذه السؤالات اعتقادُكُمَ أن محمداً ضال\n ومكانه حقير\n ولو نظرتم إلى ما يؤول إليه أمركم\n لعلمتم أنكم شر منه مكاناً\n وأضل سبيلاً\n والله تعالى أعلم\n الإشارة: تثبيت القلوب على الإيمان\n وتربية اليقين\n يكون بصحبة الأبرار ورؤية العارفين الكبار\n والترقي في معاريج التوحيد\n إلى أن يفضي إلى مقام العيان\n يكون بعقد الصحبة مع أهل التربية\n وخدمتهم وتعظيمهم\n حتى يوصلوه إلى ربه\n ومن شأنهم أن الله يدافع عنهم\n ويجيب من سألهم تشغيباً\n فيلهمهم الجواب\n فضلاً منه\n فلا يُسألون عن شيء إلا جاءهم بالحق وأحسن تفسيراً\n ثم هدد من صغَّرهم وحقَّر شأنهم بقوله: { الذين يُحشرون\n\n\n } الآية\n والله تعالى أعلم\n ثم ردّ على من طلب انزال القرآن جملة بكون كتاب التوراة نزل جملة\n ومع ذلك كفروا به\n فقال: { وَلَقَدْ آتَيْنَا مُوسَى ٱلْكِتَابَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "113:2",
      "similarity": 0.47690668129249836
    },
    {
      "verse": "25:17",
      "similarity": 0.4395539529669314
    },
    {
      "verse": "98:6",
      "similarity": 0.42940086526528237
    },
    {
      "verse": "17:11",
      "similarity": 0.3975045482708766
    },
    {
      "verse": "38:62",
      "similarity": 0.38899274960537
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/025034.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/025034.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}