{
  "chapter": "الفرقان",
  "text": "واتخذوا۟ من دونه ءالهة لا يخلقون شيـا وهم يخلقون ولا يملكون لانفسهم ضرا ولا نفعا ولا يملكون موتا ولا حيوة ولا نشورا",
  "translations": [
    {
      "translation": "But they have adopted gods apart from Him which do not create anything but are themselves created. They have no power to harm or help themselves. They have no power over death or life or resurrection.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they choose apart from Him gods who have not created any thing and have themselves been created, who possess no power over their loss or gain, or their death or life or being raised to life again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet the people have set up, besides Him, deities, who do not create anything but are themselves created: who can neither harm nor help even themselves: who have no power over life or death, nor can they raise up the dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they have chosen for themselves other deities besides Him, who do not create anything but rather are themselves created, who have no power over their own benefits, or trouble, and who have no control over life, death, and resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And people have appointed other Gods besides Him, those who do not create anything but are themselves created, and those who do not have the power to harm or benefit themselves, and who do not have any authority over death or life nor over resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they have taken besides Him other gods who created nothing but are themselves created, and possess neither harm nor benefit for themselves, and possess no power (of causing) death, nor (of giving) life, nor of raising the dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have taken besides Him gods, who do not create anything while they are themselves created, and they control not for themselves any harm or profit, and they control not death nor life, nor raising (the dead) to life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they have taken to them gods, apart from Him, that create nothing and themselves are created, and have no power to hurt or profit themselves, no power of death or life or raising up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they choose beside Him other gods who create naught but are themselves created, and possess not hurt nor profit for themselves, and possess not death nor life, nor power to raise the dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they have taken, besides Him, deities who create nothing and are themselves created, and who have no power to harm, or benefit themselves and who control neither death, nor life, nor resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have taken beside Him gods creating not aught and are themselves created, owning for themselves neither hurt nor benefit, and owning not death nor life nor resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they have taken gods besides Him who create nothing and have themselves been created, and who have no control over their own harm or benefit and have no control over [their own] death, life, or resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet have they taken, besides him, gods that can create nothing but are themselves created; that have no control of hurt or good to themselves; nor can they control death nor life nor resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they have taken besides Him other aliha (gods) that created nothing but are themselves created, and possess neither hurt nor benefit for themselves, and possess no power (of causing) death, nor (of giving) life, nor of raising the dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they worship, other than Him, gods which cannot create anything and were themselves created. They own neither harm nor benefit for themselves, neither do they own death nor life, nor a resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And yet, instead of Him, they produce for themselves gods that create nothing, but are themselves created; that have no power to harm or benefit themselves; and no power over life, death, or resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they have taken besides Him gods which create nothing, while they are created, and possess not for themselves any harm or benefit and possess not [power to cause] death or life or resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:3] Yet they, the disbelievers, have taken besides Him, that is, [besides] God, in other words, other than Him, gods, from among the idols, who create nothing but have themselves been created, and who possess no harm for themselves, that is, [the power] to repel it, nor any benefit, that is, [the power] to attract it, nor do they possess [any power over] death or life, that is, [nor do they have the power] to make a person die or to give him life, or resurrection, that is, [nor do they have power] to raise the dead.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَاتَّخَذُوا مِنْ دُونِهِ آَلِهَةً لَا يَخْلُقُونَ شَيْئًا وَهُمْ يُخْلَقُونَ وَلَا يَمْلِكُونَ لِأَنْفُسِهِمْ ضَرًّا وَلَا نَفْعًا وَلَا يَمْلِكُونَ مَوْتًا وَلَا حَيَاةً وَلَا نُشُورًا (3)استطراد لانتهاز الفرصة لوصف ضلال أهل الشرك وسفالة تفكيرهم ، فهو عطف على جملة : { الذي له ملك السماوات والأرض } \\[ الفرقان : 2 \\] وما تلاها مما هو استدلال على انفراده تعالى بالإلهية ، وأردفت بقوله : { وخلق كل شيء } \\[ الفرقان : 2 \\] الشامل لكون ما اتخذوه من الآلهة مخلوقات فكان ما تقدم مهيئاً للتعجيب من اتخاذ المشركين آلهة دون ذلك الإله المنعوت بصفات الكمال والجلال .فالخبر غير مقصود به الإفادة بل هو للتعجيب من حالهم كيف قابلوا نعمة إنزال الفرقان بالجحد والطغيان وكيف أشركوا بالذي تلك صفاته آلهةً أخرى صفاتهم على الضد من صفات من أشركوهم به ، وإلا فإن اتخاذ المشركين آلهة أمر معلوم لهم وللمؤمنين فلا يقصد إفادتهم لحكم الخبر .وبين قوله : { ولم يتخذ ولداً } \\[ الفرقان : 2 \\] وقوله : { واتخذوا من دونه آلهة } محسن الطباق .وضمير : { اتخذوا } عائد إلى المشركين ولم يسبق لهم ذكر في الكلام وإنما هم معروفون في مثل هذا المقام وخاصة من قوله : { ولم يكن له شريك في الملك } \\[ الفرقان : 2 \\] .وجملة : { لا يخلقون شيئاً } مقابلة جملة { الذي له ملك السماوات والأرض } \\[ الفرقان : 2 \\] .وجملة : { وهم يخلقون } مقابلة جملة : { ولم يتخذ ولداً } \\[ الفرقان : 2 \\] لأن ولد الخالق يجب أن يكون متولداً منه فلا يكون مخلوقاً .وجملة : { ولا يملكون لأنفسهم ضراً ولا نفعاً } مقابلة جملة : { ولم يكن له شريك في الملك } \\[ الفرقان : 2 \\] لأن الشركة في الملك تقتضي الشركة في التصرف .وضمير : { لأنفسهم } يجوز أن يعود إلى { آلهة } أي لا تقدر الأصنام ونحوها على ضر أنفسهم ولا على نفعهم . ويجوز أن يعود إلى ما عاد إليه ضمير { واتخذوا } أي لا تقدر الأصنام على نفع الذين عبدوهم ولا على ضرهم .واعلم أن { ضراً ولا نفعاً } هنا جرى مجرى المثل لقصد الإحاطة بالأحوال ، فكأنه قيل : لا يملكون التصرف بحال من الأحوال . وهذا نظير أن يقال : شرقاً وغرباً ، وليلاً ونهاراً . وبذلك يندفع ما يشكل في بادىء الرأي من وجه نفي قدرتهم على إضرار أنفسهم بأنه لا تتعلق إرادة أحد بضر نفسه ، وبذلك أيضاً لا يتطلب وجه لتقديم الضر على النفع ، لأن المقام يقتضي التسوية في تقديم أحد الأمرين ، فالمتكلم مخير في ذلك والمخالفة بين الآيات في تقديم أحد الأمرين مجرد تفنّن .والمجرور في { لأنفسهم } متعلق ب { يملكون } .والضَّر بفتح الضاد مصدر ضرَّه ، إذا أصابه بمكروه . وقد تقدم نظيره في قوله تعالى : { قل لا أملك لنفسي ضراً ولا نفعاً إلا ما شاء الله } في سورة يونس )49 ).وجملة : { ولا يملكون موتاً ولا حياة ولا نشوراً } مقابلة جملة { وخلق كل شيء فقدره تقديراً } \\[ الفرقان : 2 \\] لأن أعظم مظاهر تقدير الخلق هو مظهر الحياة والموت ، وذلك من المشاهدات . وأما قوله : { ولا نشوراً } فهو تكميل لقرع المشركين نفاة البعث لأن نفي أن يكون الآلهة يملكون نشوراً يقتضي إثبات حقيقة النشور في نفس الأمر إذ الأكثر في كلام العرب أن نفي الشيء يقتضي تحقق ماهيته .وأما نحو قول امرىء القيس :على لاحب لا يهتدي بمناره ... يريد لا منار فيه . وقول ابن أحمر :لا تُفزع الأرنبَ أهوالُها ... ولا ترى الضبّ بها ينجحرأراد : أنها لا أرنب فيها ولا ضب . فهو من قبيل التلميح .ذُكر في هذه الآية من أقوالهم المقابلة للجمل الموصوف بها الله تعالى اهتماماً بإبطال كفرهم المتعلق بصفات الله لأن ذلك أصل الكفر ومادته .واعلم أن معنى : { وهم يخلقون } وهم يُصنعون ، أي يصنعهم الصانعون لأن أصنامهم كلها حجارة منحوتة فقد قومتها الصنعة ، فأطلق الخلق على التشكيل والنحت من فعل الناس ، وإن كان الخلق شاع في الإيجاد بعد العدم؛ إما اعتباراً بأصل مادة الخلق وهو تقدير مقدار الجلد قبل فريه كما قال زهير :ولأنت تفري ما خلقت وبع ... ضُ الناس يخلق ثم لا يفريفأطلق الخلق على النحت؛ إما على سبيل المجاز المرسل ، وإما مشاكلة لقوله : { لا يخلقون شيئاً } .والمِلك في قوله : { لا يملكون } مستعمل في معنى القدرة والاستطاعة كما تقدم في قوله تعالى : { قل فمن يملك من الله شيئاً إن أراد أن يهلك المسيح ابن مريم } في سورة العقود )17 )، وقوله فيها : { قل أتعبدون من دون الله ما لا يملك لكم ضراً ولا نفعاً } \\[ المائدة : 76 \\] ، أي من لا يقدر على ضركم ولا نفعكم . فقوله هنا : { لأنفسهم } متعلق ب { يملكون } ، واللام فيه لام التعليل ، أي لا يملكون لأجل أنفسهم ، أي لفائدتها .ثم إن المراد ب { أنفسهم } يجوز أن يكون الجمع فيه باعتبار التوزيع على الآحاد المفادة بضمير { يملكون } ، أي لا يملك كل واحد لنفسه ضراً ولا نفعاً ، ويكون المراد بالضر دفعه على تقدير مضاف دل عليه المقام لأن الشخص لا يتعلق غرضه بضر نفسه حتى يقرَع بأنه عاجز عن ضر نفسه .وتنكير { موتاً و حياة } في سياق النفي للعموم ، أي موت أحد من الناس ولا حياته .والنشور : الإحياء بعد الموت . وأصله نشر الشيء المطوي .\n\n",
      "translations": [
        {
          "translation": "(Yet they) the disbelievers of Mecca: Abu Jahl and his host (choose) to worship (beside Him) beside Allah (other gods who create naught) who are unable to create anything (but are themselves created) while their deities, i.e. idols, are created and carved, (and possess) the idols (not hurt) driving away harm (nor profit) nor obtaining profit (for themselves) or for anyone else, (and possess not death) they have no ability to 396 diminish one's life (nor life) nor to increase one's life; it is also said that this means: they are unable to create a sperm drop nor to place therein the spirit, (nor power to raise the dead) after they die.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدثنا علب بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السلام في قوله تعالى: { وَلاَ يَمْلِكُونَ مَوْتاً وَلاَ حَيَـاةً وَلاَ نُشُوراً } معناه إحياءٌ بعدَ المَوتِ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: \"We were told by 'Alb ibn Ahmad...\n\n\nHe said: We were told by `Ata' ibn al-Sa'ib from Abu Khalid from Zayd ibn `Ali, peace be upon them, regarding the words of God Almighty, \"They do not possess death or life or resurrection\": that this means life after death.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنهم { ٱتَّخَذُواْ مِن دُونِهِ } سبحانه { آلِهَةً } يعدونها كعبادته\n مع أن آلهتهم الباطلة { لاَّ يَخْلُقُونَ } ولا يوجدون ويظهرون { شَيْئاً } من المخلوقات حتى يستحقوا الألوهية والعبادة\n مع أن من شأن الإله الخلق والإيجاد حتى يستحق للتوجه والرجوع إليه\n بل { وَهُمْ } في أنفسهم { يُخْلَقُونَ } أي: مخلوقون مقدورون لا قادرون خالقون\n بل { وَ } هم مرادون\n والمخلوقات التي هي الجمادات\n إذ { لاَ يَمْلِكُونَ لأَنْفُسِهِمْ } أيضاً { ضَرّاً } أي: إماتة لأحدٍ { وَلاَ نَفْعاً } اي: جلب نفع إليها { وَلاَ يَمْلِكُونَ } أيضاً { مَوْتاً } أي: إماتة لأحد { وَلاَ حَيَـاةً } أي: أحياءً له { وَلاَ نُشُوراً } [الفرقان: 3] أي: بعثاً وحشراً بعد الموت للجزاء\n ومن كان وصفه هذا كيف تتأتى منه الألوهية والربوبية المقتضية للعبودية؟!",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { واتخذوا } أي: الكفار المدرجون تحت العالمين المنذَرين، اتخذوا لأنفسهم { من دونه } تعالى { آلهة } أصناماً، يعبدونها ويستعينون بها، وهم { لا يَخْلُقُون شيئاً } أي: لا يقدرون على خلق شيء من الأشياء، { وهم يخْلَقُون } كسائر المخلوقات. والمعنى أنهم آثروا على عبادة من هو منفرد بالألوهية والخلق، والملك والتقدير، عباداً عجزة، لا يقدرون على خلق شيء، وهم مخلوقون ومصورون. { ولا يملكون لأنفسهم ضَراً ولا نفعاً } أي: لا يستطيعون لأنفسهم دفع ضر عنها، ولا جلب نفع لها. وهذا بيان لغاية عجزهم وضعفهم فإن بعض المخلوقين ربما يملك دفع ضر وجلب نفع في الجملة، وهؤلاء لا يقدرون على شيء البتة، فكيف يملكون نفع مَنْ عبدَهم، أو ضرر من لم يعبدهم؟‍! { ولا يملكون موتاً } أي: إماتة { ولا حياةً } أي: إحياء { ولا نشوراً } بعثاً بعد الموت، أي: لا يقدرون على إماتة حي، ولا نفخ الروح في ميت، ولا بعث للحساب والعقاب. والإله يجب أن يكون قادراً على جميع ذلك. وفي إيذان بغاية جهلهم، وسخافة عقولهم، كأنهم غير عارفين بانتفاء ما نُفي عن آلهتهم مما ذكر، مفتقرون إلى التصريح لهم بها. والله تعالى أعلم. الإشارة: كل من ركن إلى غير الله، أو مال بمحبته إلى شيء سواه، فقد اتخذ من دونه إلهاً يعبده من دون الله. وكل من رفع حاجته إلى غير مولاه، فقد خاب مطلبه ومسعاه لأنه تعلق بعاجز ضعيف، لا يقدر على نفع نفسه، فكيف ينفع غيره؟ وفي الحِكَمِ: \" لا ترفعن إلى غيره حاجة هو موردها عليك، فكيف ترفع إلى غيره ما كان هو له واضعاً؟‍! من لا يستطيع أن يرفع حاجته عن نفسه، فكيف يكون لها عن غيره رافعاً؟ \". قال بعض الحكماء: من اعتمد على غير الله فهو في غرور لأن الغرور ما لا يدوم، ولا يدوم شيء سواه، وهو الدائم القديم، لم يزل ولا يزال، وعطاؤه وفضله دائمان، فلا تعتمد إلا على من يدوم عليك منه الفضل والعطاء، في كل نفس وحين وأوان وزمان. هـ. وقال وهب بن منبه: أوحى الله تعالى إلى داود: يا داود أما وعزتي وجلالي وعظمتي لا ينتصر بي عبد من عبادي دُون خلقي، أعلم ذلك من نيته، فتكيده السموات السبع ومن فيهن، والأرضون السبع ومن فيهن، وإلا جعلت له منهن فرجاً ومخرجاً. أما وعزتي وجلالي لا يعتصم عبد من عبادي بمخلوق دوني، أعلم ذلك من نيته، إلا قطعت أسباب السموات من يده، وأسخت الأرض من تحته، ولا أبالي في وادٍ هلك. هـ. وبالله التوفيق. ولما ذكر شأن الفرقان، ذكر من طعن فيه وفيمن نزل عليه، فقال: { وَقَالَ ٱلَّذِينَ كَفَرُوۤاْ إِنْ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:35",
      "similarity": 0.5838348461108915
    },
    {
      "verse": "21:21",
      "similarity": 0.5714968469072332
    },
    {
      "verse": "77:3",
      "similarity": 0.5663572216497584
    },
    {
      "verse": "80:22",
      "similarity": 0.5650795925364114
    },
    {
      "verse": "5:76",
      "similarity": 0.5150879992150182
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/025003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/025003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}