{
  "chapter": "الفرقان",
  "text": "وهو الذى جعل لكم اليل لباسا والنوم سباتا وجعل النهار نشورا",
  "translations": [
    {
      "translation": "It is He who made the night a cloak for you and sleep a rest, and He made the day a time for rising.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the night a covering for you; and made sleep for rest, the day for rising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is Allah Who has ordained the night as a garment for you, and the sleep as a repose of death, and the day as the time of return to life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made the night as a covering for you, sleep as a rest for you, and the day for you to rise again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who made the night a veil for you, and the sleep a rest, and made the day for getting up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who makes the night a covering for you, and the sleep (as) a repose, and makes the day Nushur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who made the night a covering for you, and the sleep a rest, and He made the day to rise up again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who appointed the night for you to be a garment and sleep for a rest, and day He appointed for a rising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who maketh night a covering for you, and sleep repose, and maketh day a resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the night a mantle for you, and sleep for repose; and made the day a time for rising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who hath made for you the night a covering, and the sleep; repose, and hath made the day a resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made for you the night as a covering and sleep for rest and He made the day a recall to life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who makes the Night as a Robe for you, and Sleep as Repose, and makes the Day (as it were) a Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who makes the night a covering for you, and the sleep (as) repose, and makes the day Nushur (i.e. getting up and going about here and there for daily work, etc. after one's sleep at night or like resurrection after one's death).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has appointed the night a mantle for you and sleep for a rest. The day He has appointed for rising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who made the night a covering for you, and sleep for rest; and He made the day a revival.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who has made the night for you as clothing and sleep [a means for] rest and has made the day a resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:47] And He it is Who made for you the night as a garment, veiling [you] like a garment, and sleep for repose, rest for bodies through the [temporary] cessation of labour, and He made the day for rising, [a time] in which all rise to seek their livelihood and so on.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He it is Who maketh night a covering for you) which covers everything, (and sleep repose) for your bodies, (and maketh day a resurrection) a pursuit for your livelihood.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُوَ الَّذِي جَعَلَ لَكُمُ ٱلَّيلَ لِبَاساً وَٱلنَّوْمَ سُبَاتاً } قال: زيد بن علي عليهما السّلامُ واللِّباسُ: السَّكنُ\n والسُّباتُ: السَّاكنُ\n وقال: هو الحسنُ الجَميلُ!\n\n\n\n\nوقوله تعالى: { وَجَعَلَ ٱلنَّهَارَ نُشُوراً } معناه يَنْشُرُ فيهِ خَلقُ الله تعالى فِي مَعائِشهم وحوائِجهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وهو الذي جعل لكم } ليل ظلمة النفس { لباساً } يغشاكم بالاستيلاء عن مشاهدة الحق وصفاته والذات وظلالها فتحتجبون يوم الغفلة في الحياة الدنيا { سباتاً } تسبتون بها عن الحياة الحقيقية السرمدية كما قال عليه السلام:\n\n \" الناس نيام فإذا ماتوا انتبهوا \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ تنزل سبحانه عن خطاب حبيبه صلى الله عليه وسلم في المعارف الحقائق المتعلقة بالوحدة الذاتية السارية في الأكوان، وكيفية ارتباط الأكوان عليها غلى مخاطبة العوام ومقتضى استعداداتهم وقابلياتهم فقال: وكيف تغفلون عن مبدعكم ومظهركم أيها الغافلون؟! { وَهُوَ الَّذِي جَعَلَ لَكُمُ ٱلَّيلَ لِبَاساً } تسترون بظلمته عن أعين الناس؛ لئلا يطلع بعضكم على مقابح بعض { وَ } جعل { ٱلنَّوْمَ } فيه { سُبَاتاً } راحة للأبدان بعد قطع المشاغل وقضاء الأوطار المتعلقة بالنهار { وَجَعَلَ ٱلنَّهَارَ نُشُوراً } [الفرقان: 47] تنتشرون في أقطار الأرض؛ لطلب المعاش، كل ذلك بتقدير الله وتدبيره وإصلاحه لأمور عباده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو الذي جعلَ لكم الليلَ لباساً } أي: جعل الظلام الساتر كاللباس { والنوم سباتاً } أي: راحة لأبدانكم، وقطعاً لأعمالكم\n والسبت: القطع، والنائم مسبوت لأنه انقطع عمله وحركته، وقيل السبات: الموت، والميت مسبوت لأنه مقطوع الحياة، كقوله:\n\n[الأنعام: 60]\n ويعضده ذكر النشور في مقابلته بقوله: { وجعل النهار نُشُوراً } أي: ذا نشور، أي: انبعاث من النوم، كنشور الميت، أو: ينشر فيه الخلق للمعاش\n وهذه الآية، مع دلالتها على قدرته تعالى، فيها إظهار لنعمته تعالى لأن في الاحتجاب بستر الليل فوائد دينية ودنيوية، وفي النوم واليقظة - المشبهين بالموت والبعث - عبرة للمعتبرين\n قال لقمان لابنه: كما تنام فتوقظ، كذلك تموت فتنشر\n { وهو الذي أرسل الرياحَ } ، وعن المكي بالإفراد، { نشراً }: جمع نشور، أي: أرسلها للسحاب حتى تسوقها إلى حيث أراد تعالى أن تمطر، { بين يدي رحمته } أي: أرسلها قدام المطر، لأنه ريح، ثم سحاب، ثم مطر\n وقرأ عاصم الباء، أي: مبشرات بالمطر",
      "translations": []
    }
  ]
}