{
  "chapter": "الفرقان",
  "text": "الم تر الى ربك كيف مد الظل ولو شاء لجعله ساكنا ثم جعلنا الشمس عليه دليلا",
  "translations": [
    {
      "translation": "Do you not see how your Lord stretches out shadows? If He had wished He could have made them stationary. Then We appoint the sun to be the pointer to them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how your Lord lengthens out the shadow? He could have kept it motionless if He liked. Yet We make the sun its pilot to show the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how your Lord lengthens out the shadow? Had He willed, He would have made it constant, but We have made the sun its pilot;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen that your Lord increases the shadow. Had He wanted He would have made it stationary], and has made the sun their guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet, did you not see your Lord, how He spread the shade? And if He willed, He could have made it still; then We made the sun a proof upon it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how your Lord spread the shadow. If He willed, He could have made it still -- but We have made the sun its guide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered (the work of) your Lord, how He extends the shade? And if He had pleased He would certainly have made it stationary; then We have made the sun an indication of it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded thy Lord, how He has stretched out the shadow? Had He willed, He would have made it still. Then We appointed the sun, to be a guide to it;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how thy Lord hath spread the shade - And if He willed He could have made it still - then We have made the sun its pilot;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how your Lord lengthens the shadows? Had He pleased, He could have made them constant; then We placed the sun as an indicator for them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not observed thine lord-how He hath stretched out the shadow? And if He had willed He would have made it still. Then We have made the sun for it an indication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded how your Lord spreads the twilight? (Had He wished He would have made it stand still.) Then We made the sun a beacon for it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not turned thy vision to thy Lord?- How He doth prolong the shadow! If He willed, He could make it stationary! then do We make the sun its guide;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how your Lord spread the shadow. If He willed, He could have made it still then We have made the sun its guide [i.e. after the sunrise, it (the shadow) squeezes and vanishes at midnoon and then again appears in the afternoon with the decline of the sun, and had there been no sun light, there would have been no shadow].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how your Lord stretches the shadow? Had it been His will, He could have made it constant. Then He appointed the sun to be a guide to it;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see how your Lord extends the shadow? Had He willed, He could have made it still. And We made the sun a pointer to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered your Lord - how He extends the shadow, and if He willed, He could have made it stationary? Then We made the sun for it an indication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:45] Have you not seen, contemplated, the work of, your Lord, how He extends the [twilight] shadow?, from the point of daybreak to the point of sunrise. For had He, your Lord, willed, He would have made it still, everpresent so that it does not disappear with the rising of the sun. Then We made the sun an indicator of it, [of] the shadow; were it not for the sun the shadow would not have been known.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ وَلَوْ شَاءَ لَجَعَلَهُ سَاكِنًا ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيلًا (45)\n\n",
      "translations": [
        {
          "translation": "(Hast thou not seen how thy Lord hath spread the shade) after sunrise and before sunset, from the East to 401 the West. (And if He willed He could have made it) i.e. the shade (still) with no sun, (then We have made the sun its) the shade's (pilot) wherever one finds the sun one expects to find the shade before that; it is also said that this means: a guide which comes after it;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلَمْ تَرَ إِلَىٰ رَبِّكَ كَيْفَ مَدَّ ٱلظِّلَّ } معناه ما بينَ طُلُوعِ الفجرِ إلى طُلُوعِ الشَّمسِ\n\n\n\n\nوقوله تعالى: { وَلَوْ شَآءَ لَجَعَلَهُ سَاكِناً } معناه جَعلَ النَّهارَ كُلّهُ ظِلاًّ\n ويقال: دائمٌ { ثُمَّ جَعَلْنَا ٱلشَّمْسَ عَلَيْهِ دَلِيلاً } معناه على الظّلِ\n\n\n\n\nوقوله تعالى: { أَلَمْ تَرَ } معناه ألَمْ تَعلمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allaah: {Have you not seen to your Lord, how He has extended the shade?} Its meaning is from the time of the dawn until the sun rises.\n\nAnd if Allah had willed, He could have made it (the day) still, { وَلَوْ شَآءَ لَجَعَلَهُ سَاكِناً } meaning He could have made the whole day darkness.\n\n\nIt is said: \"Always { then We made the sun a sign for it }\" meaning over the shade.\n\nAnd His saying, {Have you not seen} [means] have you not known.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ أمثال هذه الخطابات لا يسع في سمع غيره صلى الله عليه وسلم: { أَلَمْ تَرَ } أيها المسترشد البصير\n والمستكشف الخبير { إِلَىٰ رَبِّكَ } أي: مربيك الذي رباك بأنواع الكمالات وأرفع الدرجات { كَيْفَ مَدَّ ٱلظِّلَّ } أي: كيف بسط أظلال أوصافه وأسمائه\n وعكوس شئونه وتطوراته على مرايا الإعدام القابلة\n فيتراءى\n أي: حسب اقتضاء أسمائه الحسنى وصفاته العليا ما لا يتناهى من الصور العجيبة والهياكل الغريبة حتى يتوهم المحجوبون أنها موجودات حقيقة متأصلة الوجود\n مستقلة في الآثار المترتبة عليها\n\n\nثمَّ افترقوا\n فذهب قوم إلى أنها موجودات متأصلة مستقلة بأنفسها\n مستغنية عن فاعل خارجي يؤثر فيها\n وهم الدهريون الجاهلون\n القائلون بأن الطبيعة تكفي في تكوّن الأشياء\n وإذا وجدت الشرائط وارتفعت الموانع تكوَّن الشيء ألتة بلا احتياج إلى فاعل خارجي مؤثر في وجوده\n ولم يتفطنوا أولئك الحمقى أن هذه الصور باقية على عدماتها الأصلية\n ما شمت رائحة من الوجود سوى أن ظل الوجود انبسط عليها\n\nوآخر إلى أنها موجودات حقيقية قديمات بأنواع لها صور ومواد قديمة محتاجة إلى فاعل خارجي مؤثر موجب بمقارنة الصور للمادة\n وهذا مذهب الحكماء\n وهؤلاء الهلكى القاصرو عن درك الحق أيضاً لم يتنبهوا ألاَّ قديم في الوجود إلا الله الواحد القهار للسوى والأغيار مطلقاً\n\n\nوآخر إلى أنها موجودات حقيقية أبدعها الله تعالى من العدم بمقتضى علمه وقدرته وإرادته و اختياره بلا وجوب شيء عليه في إيجادها\n وبلا سبق مادة ومدة عليها\n وهذا مذهب جمهور المتكلمين\n وهؤلاء أيضاً لم يتنبهوا أن العدم لا يقبل الوجود أصلاً\n كما أن الوجود لا يقبل العدم أصلاً\n إذ بينهما تضاد حقيقي لا يتصف أحدهما بالآخر مطلقاً\n\n\nومنشأ توهم هؤلاء الفرق الثلاث اقتصار نظرهم على الصور المرئية ظاهراً وغفلتهم عن ذي الصورة التي هي عكوس وأظلال وآثار له\n ولو علموا ارتباط هذه الصور بذي الصورة\n وكوشفوا بوحدة الوجود\n وشهدوا ألاَّ موجود إلا الله الواحد القهار لجميع الأغيار لم يبقَ لهم شائبة شك في عدمية هذه الصورة المرئية\n كما لا شك لهم في عدمية الصور المرئية في المرايا والأظلال\n ومن لم يجعل الله له نوراً فما له نور\n\n\n{ وَلَوْ شَآءَ } وأراد سبحانه عدم انبساط عكس وجوده وانبعاث العدم على صرافته\n ولم يجعل مرآة الكمالات وجوده ولم يلتفت إليها\n ولم ينحل عليها { لَجَعَلَهُ سَاكِناً } اي: جعل ظل وجوده مقبوضاً غير مبسوط\n لفني العالم دفعةً ألبتة { ثُمَّ } أوضحنا هذا المد والبسط بمثال واضح من جملة المحسوسات عنايةً منا لعبادنا بأن { جَعَلْنَا ٱلشَّمْسَ } في إضاءتها وإشراقها\n وانبساط نورها وشعاعها على ظلمة الليل المشابهة بالعدم { عَلَيْهِ } أي: على بسط الوجود على مرايا الأعدام { دَلِيلاً } [الفرقان: 45] مثالاً موضحاً واضحاً لكيفية امتداد أظلال الوجود وانعكاسها من العدم\n وذلك أن الشمس إذا أخذت في الإشراق\n وبسطت على النور والآفاق\n استنار العالم بعدما كان مظلماً\n وإذا قبضت عاد على ظلمته الأصلية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ألم تَر } يامحمد { إلى رَبّكَ } أي: ألم تنظر إلى بديع صنع ربك ودلائل قدرته وتوحيده\n والتعرض لعنوان الربوبية\n مع الإضافة إلى ضميره - عليه الصلاة والسلام -\n لتشريفه وتبجيله\n وللإيذان بأن ما يعقبه من آثار قدرته ورحمته\n { كيف مَدَّ الظِّلَّ } أي: بسطه حتى عمَّ الأرض\n وذلك من حين طلوع الفجر إلى وقت طلوع الشمس\n في قول الجمهور لأنه ظل ممدود\n لا شمس معه ولا ظلمة\n فهو شبيه بظل الجنة\n وقيل: مد ظل الأشياء الشاخصة أول النهار من شجر\n أو مدر\n أو إنسان\n ثم قبضها وردها إلى المشرق\n { ولو شاء لجعله ساكناً } أي: دائماً لا يزول ولا تُذهبه الشمس\n أو: لا ينتقص بسيرها\n { ثم جعلنا الشمسَ عليه } أي: على الظل { دليلاً } \n لأنه بالشمس يُعرف الظل\n فلولا طلوعها وظهورها ما عرف الظل\n ولا ظهر له أثر\n فالأشياء تُعرف بأضدادها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:10",
      "similarity": 0.43510783668479425
    },
    {
      "verse": "56:30",
      "similarity": 0.38931483943632517
    },
    {
      "verse": "20:120",
      "similarity": 0.3375074388611927
    },
    {
      "verse": "28:12",
      "similarity": 0.3094902183022185
    },
    {
      "verse": "20:40",
      "similarity": 0.2448014211239958
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/025045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/025045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}