{
  "chapter": "الفرقان",
  "text": "لنحى به بلدة ميتا ونسقيه مما خلقنا انعما واناسى كثيرا",
  "translations": [
    {
      "translation": "so that by it We can bring a dead land to life and give drink to many of the animals and people We created.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To quicken a region that was dead, and to give it as drink to animals We have created and to men in plenty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may revive the dead land, and quench the thirst of many of His creatures from among beasts and men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to revive the barren land and provide water for many creatures, cattle, and people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that We may revive a dead city with it, and give it to the many beasts and men that We have created, to drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We may give life thereby to a dead land, and We give to drink thereof many of the cattle and men that We have created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We may give life thereby to a dead land and give it for drink, out of what We have created, to cattle and many people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that We might revive a dead land, and give to drink of it, of that We created, cattle and men a many.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We may give life thereby to a dead land, and We give many beasts and men that We have created to drink thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that We may bring life to a dead land; and slake the thirst of Our creation; cattle and men, in great numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We may quicken thereby a dead land, and We give drink thereof to that which We have created of cattle and human beings many.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "with which We revive a dead country and provide water to many of the cattle and humans We have created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That with it We may give life to a dead land, and slake the thirst of things We have created,- cattle and men in great numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We may give life thereby to a dead land, and We give to drink thereof many of the cattle and men that We had created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so, that with it We revive dead lands and provide drink for the cattle and the human We created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To revive dead lands thereby, and to provide drink for the multitude of animals and humans We created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We may bring to life thereby a dead land and give it as drink to those We created of numerous livestock and men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:49]   with which We revive a dead land (read maytan, in the softened form, equally valid for the masculine and the feminine, but in the masculine [here] because of the [masculine] noun indicating ‘place’ [implicit therein]) and We give it, the water, as drink to the many cattle, camels, cows and sheep, and humans We have created (anāsiyy is the plural of insān: properly it [the plural] should be anāsīn but the [final] nūn has been replaced with a yā’, with which the [other] yā’ has been assimilated; or it [anāsiyy] is [simply] the plural of insiyy).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلِنُحْيِيَ بِهِ بَلْدَةً مَيْتًا وَنُسْقِيَهُ مِمَّا خَلَقْنَا أَنْعَامًا وَأَنَاسِيَّ كَثِيرًا (49) والبلدة : الأرض . ووصفها بالحياة والموت مجازان للري والجفاف لأن ري الأرض ينشأ عنه النبات وهو يشبه الحي ، وجفاف الأرض يجفّ به النبات فيشبه الميّت .ولماء المطر خاصية الإحياء لكل أرض لأنه لخلّوه من الجراثيم ومن بعض الأجزاء المعدنية والترابية التي تشتمل عليها مياه العيون ومياه الأنهار والأودية كان صالحاً بكل أرض وبكل نبات على اختلاف طباع الأرضين والمنابت .والبلدة : البلد . والبلد يذكر ويؤنث مثل كثير من أسماء أجناس البقاع كما قالوا : دار ودَارة . : ووصفت البلدة بميت ، وهو وصف مذكر لتأويل { بلدة } بمعنى مكان لقصد التخفيف . وقال في «الكشاف» ما معناه : إنه لما دل على المبالغة في الاتصاف بالموت ولم يكن جارياً على أمثلة المبالغة نزّل منزلة الاسم الجامد )أي فلم يغير ). وأحسن من هذا أنه أريد به اسم الميت ، ووصف البلدة به وصف على معنى التشبيه البليغ .وفي قوله { لنحي به بلدة ميتاً } إيماء إلى تقريب إمكان البعث .و { نُسقيه } بضم النون مضارع أسقى مثل الذي بفتح النون فقيل هما لغتان يقال : أسقى وسَقى . قال تعالى : { قالتا لا نَسقي } \\[ القصص : 23 \\] بفتح النون . وقيل : سقى : أعطى الشراب ، وأسقى : هيَّأ الماء للشرب . وهذا القول أسدّ لأن الفروق بين معاني الألفاظ من محاسن اللغة فيكون المعنى هيَّأناه لشرب الأنعام والأناسي فكل من احتاج للشرب شرب منه سواء من شرب ومن لم يشرب .و { أنعاماً } مفعول ثان ل { نسقيه } . وقوله : { مما خلقنا } حال من { أنعاماً وأناسي } . و )مِن )تبعيضية . و )مَا )موصولة ، أي بعض ما خلقناه ، والموصول للإيماء إلى علة الخبر ، أي نسقيهم لأنهم مخلوقات . ففائدة هذا الحال الإشارة إلى رحمة الله بها لأنها خلقه . وفيه إشارة إلى أن أنواعاً أخرى من الخلائق تُسقى بماء السماء ، ولكن الاقتصار على ذكر الأنعام والأناسي لأنهما موقع المنة ، فالأنعام بها صلاح حال البَادين بألبانها وأصوافها وأشعارها ولُحومها ، وهي تشرب من مياه المطر من الأحواض والغدران .والأناسيّ : جمع إنسيّ ، وهو مرادف إنسان . فالياء فيه ليست للنسب . وجُمع على فَعالِيّ مثل كُرسي وكَراسِي .ولو كانت ياؤه نَسب لَجُمع على أنَاسِيَةٍ كما قالوا : صيرفي وصيارفة . ووصف الأناسيّ ب { كثيراً } لأن بعض الأناسيّ لا يشربون من ماء السماء وهم الذين يشربون من مياه الأنهار كالنيل والفرات ، والآبار والصهاريج ، ولذلك وصف العرب بأنهم بنو ماء السماء . فالمنة أخص بهم ، قال زيادة الحارثي :ونحن بنو ماء السماء فلا نرى ... لأنفسنا من دون مملكةٍ قصراًوفي أحاديث ذكر هاجر زوج إبراهيم عليه السلام قال أبو هريرة « فتلك أمّكم يا بني ماءِ السماء » يعني العرب . وماء المطر لنقاوته التي ذكرناها صالح بأمعاء كل الناس وكل الأنعام دون بعض مياه العيون والأنهار .ووصف أناسي وهو جمع بكثير وهو مفرد لأن فعيلاً قد يراد به المتعدد مثل رفيق وكذلك قليل قال تعالى : { واذكروا إذ كنتم قليلاً } \\[ الأعراف : 86 \\] .وتقديم ذكر الأنعام على الأناسيّ اقتضاه نسج الكلام على طريقة الأحكام في تعقيبه بقوله : { ولقد صرفناه بينهم ليذكروا } ، ولو قدم ذكر { أناسيَّ } لتفكك النظم . ولم يقدم ذكر الناس في قوله تعالى : { متاعاً لكم ولأنعامكم } في سورة النازعات )33 )لانتفاء الداعي للتقديم فجاء على أصل الترتيب .وضمير صرفناه } عائد إلى { ماء طهوراً } . والتصريف : التغيير . والمراد هنا تغيير أحوال الماء ، أي مقاديره ومواقعه .وتوكيد الجملة بلام القسم و )قد )لتحقيق التعليل لأن تصرف المطر محقق لا يحتاج إلى التأكيد وإنما الشيء الذي لم يكن لهم علم به هو أن من حكمة تصريفه بين الناس أن يذكُروا نعمة الله تعالى عليهم مع نزوله عليهم وفي حالة إمساكه عنهم ، لأن كثيراً من الناس لا يقدُر قدرَ النعمة إلا عند فقدها فيعلموا أن الله هو الربّ الواحد المختار في خلق الأسباب والمسببات وقد كانوا لا يتدبرون حكمة الخالق ويسندون الآثار إلى مؤثرات وهمية أو صورية .ولما كان التذكر شاملاً لشكر المنعم عليهم بإصابة المطر ولتفطن المحرومين إلى سبب حرمانهم إياه لعلهم يستغفرون ، جيء في التعليل بفعل { ليذكروا } ليكون علة لحالتي التصريف بينهم .وقوله : { فأبى أكثر الناس إلا كفوراً } تركيب جرى بمادّته وهيئته مجرى المَثَل في الإخبار عن تصميم المخبر عنه على ما بعد حرف الاستثناء ، وذلك يقتضي وجود الصارف عن المستثنى ، أي فصمموا على الكفور لا يرجعون عنه لأن الاستثناء من عموم أشياء مبهمة جعلت كلها مما تعلق به الإباء كأنّ الآبين قد عرضت عليهم من الناس أو من خواطرهم أمورٌ وراجعوا فلم يقبلوا منها إلا الكُفور ، وإن لم يكن هنالك عَرض ولا إباء ، ومنه قوله تعالى في سورة براءة : )32 ){ ويأبى الله إلاّ أن يُتِمّ نورَه } ؛ ألاَ ترى أن ذلك استعمل هنا في مقام معارضة المشركين للتوحيد وفي سورة براءة في مقام معارضة أهل الكتاب للإسلام . وشدّةُ الفريقين في كفرهم معلومة مكشوفة ولم يُستعمل في قوله تعالى في سورة الصّفّ : )8 ):\n\n",
      "translations": [
        {
          "translation": "(That We may give life thereby to a dead land) a land that has no vegetation, (and We give many beasts and men that We have created to drink thereof.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ونُسْقِيَهُ } أي: ذلك الماء الطهور\n عند جريانه في الأودية\n أو اجتماعه في الآبار والحياض\n { مما خلقنا أنعاماً وأَنَاسِيَّ كثيراً } أي: نسقي ذلك بهائم وناساً كثيراً\n والأناسي: جمع أُنْسِيّ\n ككرسي وكراسي\n وقيل: جمع إنسان\n وأصله: أناسين\n وأبدلت النون ياءً\n وأدغمت التي قبلها فيها\n وقدَّم إحياء الأرض على سقي الأنعام والأناسي لأن حياتها سبب لحياتهما\n وتخصيص الأنعام من بين سائر الحيوان لأن عامة منافع الإنسان متعلقة بها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:11",
      "similarity": 0.6011858026622348
    },
    {
      "verse": "89:8",
      "similarity": 0.5731926469234595
    },
    {
      "verse": "95:3",
      "similarity": 0.5606088149731773
    },
    {
      "verse": "90:2",
      "similarity": 0.5060777419127321
    },
    {
      "verse": "89:11",
      "similarity": 0.49911984452674674
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/025049.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/025049.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}