{
  "chapter": "الفرقان",
  "text": "وقال الذين كفروا۟ ان هذا الا افك افترىه واعانه عليه قوم ءاخرون فقد جاءو ظلما وزورا",
  "translations": [
    {
      "translation": "Those who are kafir say, 'This is nothing but a lie he has invented and other people have helped him to do it. They have brought injustice and falsehood.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet the unbelievers say: \"This is nothing but a lie he has concocted in which others have aided him.\" They have come down to mischief and lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have rejected the Message of the Prophet, say, \"This (Al-Furgan) is a forgery which this man himself has devised, and some others have helped him at it. \" What a cruel injustice and an impudent lie!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, \"This (Quran) is no more than a slanderous statement which he (Muhammad), with the help of some other people, has falsely invented.\" Certainly, this statement is unjust and sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said, “This is nothing but a slur he has fabricated and others have helped him upon it”; so indeed the disbelievers have stooped to injustice and lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: \"This is nothing but a lie that he has invented, and others have helped him in it.\" In fact, they have produced an unjust wrong and a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: This is nothing but a lie which he has forged, and other people have helped him at it; so indeed they have done injustice and (uttered) a falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, 'This is naught but a calumny he has forged, and other folk have helped him to it.' So they have committed wrong and falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: This is naught but a lie that he hath invented, and other folk have helped him with it, so that they have produced a slander and a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth say, \"This is only a forgery of his own invention in which others have helped him.\" What they say is unjust and false.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve, say. this is naught but a falsehood thathe hath fabricated and there have assisted him therein other people. so surelythey have aimed at a wrong and a fraud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say, ‘This is nothing but a lie that he has fabricated, and other people have abetted him in it.’ Thus they have certainly come out with wrongdoing and falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the misbelievers say: \"Naught is this but a lie which he has forged, and others have helped him at it.\" In truth it is they who have put forward an iniquity and a falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: \"This (the Quran) is nothing but a lie that he (Muhammad SAW) has invented, and others have helped him at it, so that they have produced an unjust wrong (thing) and a lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: 'This is but a falsehood he has forged? another nation has helped him' So they have come with wrong and falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say, “This is nothing but a lie that he made up, and others have helped him at it.” They have committed an injustice and a perjury.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say, \"This [Qur'an] is not except a falsehood he invented, and another people assisted him in it.\" But they have committed an injustice and a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:4] And those who disbelieve say, ‘This, Qur’ān, is nothing but a calumny, a lie, that he, Muhammad (s), has invented, and other folk have helped him with it’, who [according to the disbelievers] were from among the People of the Scripture. God, exalted be He, says: Verily thus they have committed wrong and [spoken] falsehood, [they have come with] disbelief and mendacity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَقَالَ الَّذِينَ كَفَرُوا إِنْ هَذَا إِلَّا إِفْكٌ افْتَرَاهُ وَأَعَانَهُ عَلَيْهِ قَوْمٌ آَخَرُونَ فَقَدْ جَاءُوا ظُلْمًا وَزُورًا (4)انتقال من ذكر كفرهم في أفعالهم إلى ذكر كفرهم بأقوالهم الباطلة .والإظهار هنا لإفادة أن مضمون الصلة هو علة قولهم هذا ، أي ما جرأهم على هذا البهتان إلا إشراكهم وتصلبهم فيه ، وليس ذلك لشبهة تبعثهم على هذه المقالة لانتفاء شبهة ذلك ، بخلاف ما حكي آنفاً من كفرهم بالله فإنهم تلقوه من آبائهم ، فالوصف الذي أجري عليهم هنا مناسب لمقالتهم لأنها أصل كفرهم .وهذه الجملة مقابلة جملة : { تبارك الذي نزل الفرقان على عبده } \\[ الفرقان : 1 \\] فهي المقصود من افتتاح الكلام كما آذنت بذلك فاتحة السورة . وإنما أخرت هذه الجملة التي تقابل الجملة الأولى مع أن مقتضى ظاهر المقابلة أن تذكر هذه الجملة قبل جملة : { واتخذوا من دونه آلهة } \\[ الفرقان : 3 \\] اهتماماً بإبطال الكفر المتعلق بصفات الله كما تقدم آنفاً .والقصر المشتمل عليه كلامهم المستفاد من )إنْ )النافية و )إلاّ )قصر قلب؛ زعموا به رد دعوى أن القرآن منزل من عند الله .وممن قال هذه المقابلة النضر بن الحارث ، وعبد الله بن أمية ، ونوفل بن خويلد . فإسناد هذا القول إلى جميع الكفار لأنه واقع بين ظهرانيهم وكلهم يتناقلونه . وهذه طريقة مألوفة في نسبة أمر إلى القبيلة كما يقال : بنو أسد قتلوا حجراً .واسم الإشارة إلى القرآن حكاية لقولهم حين يسمعون آيات القرآن .والضمير المرفوع في { افتراه } عائد إلى الرسول صلى الله عليه وسلم المعلوم من قوله : { على عبده } \\[ الفرقان : 1 \\] .والإفك : الكذب . وتقدم عند قوله تعالى : { إن الذين جاءو بالإفك } في سورة النور )11 ). والإفتراء : اختلاق الأخبار ، أي ابتكارها وهو الكذب عن عمد ، وتقدم في قوله : { ولكن الذين كفروا يفترون على الله الكذب } في سورة العقود )103 ).{ وأعانه عليه } أي على ما يقوله من القرآن قوم آخرون لقنوه بعض ما يقوله ، وأرادوا بالقوم الآخرين اليهود . روي هذا التفسير عن مجاهد وعن ابن عباس : أشاروا إلى عبيد أربعة كانوا للعرب من الفرس وهم : عدّاس مولى حويطب بن عبد العزى ، ويسار أبو فكيهة الرومي مولى العلاء بن الحضرمي ، وفي «سيرة ابن هشام» أنه مولى صفوان بن أمية بن محرِّث ، وجبر مولى عامر . وكان هؤلاء من موالي قريش بمكة ممن دانوا بالنصرانية وكانوا يعرفون شيئاً من التوراة والإنجيل ثم أسلموا ، وقد مر ذلك في سورة النحل ، فزعم المشركون أن الرسول صلى الله عليه وسلم كان يتردد إلى هؤلاء سراً ويستمد منهم أخبار ما في التوراة والإنجيل .والقصر المستفاد من قوله : { إن هذا إلا إفك افتراه وأعانه عليه قوم آخرون } متسلط على كلتا الجملتين ، أي لا يخلو هذا القرآن من مجموع الأمرين ، هما : أن يكون افترى بعضه من نفسه ، وأعانه قوم على بعضه .وفرع على حكاية قولهم هذا ظهور أنهم ارتكبوا بقولهم ظلماً وزوراً لأنهم حين قالوا ذلك ظهر أن قولهم زور وظلم لأنه اختلاق واعتداء .و { جاءو } مستعمل في معنى )عملوا )وهو مجاز في العناية بالعمل والقصد إليه لأن من اهتم بتحصيل شيء مشى إليه ، وبهذا الاستعمال صح تعديته إلى مفعول كما في هذه الآية .والظلم : الاعتداء بغير حق بقول أو فعل قال تعالى : { قال لقد ظلمك بسؤال نعجتك إلى نعاجه } \\[ ص : 24 \\] وتقدم في قوله : { ومن أظلم ممن منع مساجد الله } في سورة البقرة )114 ). والظلم الذي أتوه هو نسبتهم الرسول إلى الاختلاق فإنه اعتداء على حقه الذي هو الصدق .والزور : الكذب ، وأحسن ما قيل في الزور : إنه الكذب المحسَّن المموَّه بحيث يشتبه بالصدق .وكون قولهم ذلك كذباً ظاهر لمخالفته الواقع فالقرآن ليس فيه شيء من الإفك ، والذين زعموهم معينين عليه لا يستطيع واحد منهم أن يأتي بكلام عربي بالغ غاية البلاغة ومرتق إلى حد الإعجاز ، وإذا كان لبعضهم معرفة ببعض أخبار الرسل فما هي إلا معرفة ضئيلة غير محققة كشأن معرفة العامة والدهماء .\n\n",
      "translations": [
        {
          "translation": "(Those who disbelieve) the disbelievers of Mecca (say: This) Qur'an (is naught but a lie that he hath invented) that Muhammad (pbuh) has invented, (and other folk) Jabr, Yasar and Fukayhah al-Rumi (have helped him with it) to invent it, (so that they have produced a slander and a lie.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنْ هَـٰذَا إِلاَّ إِفْكٌ ٱفْتَرَاهُ } فالإفكُ: البُهتانُ\n وافتراه: معناه: اختلقَهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {This is nothing but a fabrication that you have made up} - so the fabrication is the lie.\n\n\nHe created it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قل أنزله الذي يعلم } الغيب المخفي عن المجحوبين في العالمين { إنه كان غفوراً } يستر صفات النفوس الحاجبة للغيوب بأنوار صفاته { رحيماً } يفيض الكمالات على القلوب عند صفائها بحسب الاستعدادات\n ومن غفرانه ورحمته هذا الإنزال الذي تشّكون فيه أيها المحجوبون { بل كذّبوا } بالقيامة الكبرى\n وذلك التكذيب إنما يكون لفرط الاحتجاب أو نقصان الاستعداد\n وكلاهما يوجب التعذيب بالعذاب لاستيلاء نيران الطبيعة الجسمانية والهيئات الهيولانية على النفوس الظلمانية بالضرورة وتأثير زبانية النفوس السماوية والأرضية فيها التي إذا قابلتهم باستعداد قبول تأثيرها وقهرها من بعيد لكونها تكون في الجهة السفلية ظهر لهم آثار قهرها وتسلط غضب تأثيرها\n { وإذا ألقوا } من جملة أماكن نار الطبيعة الحرمانية { مكاناً ضيقاً } يحبسها في برزخ يناسب هيئاتها مقدّر بقدر استعدادها { مقرّنين } بسلاسل محبة السفلانيات وهوى الشهوات\n تمنعها عن الحركة في تحصيل المرادات وأغلال صور هيولانية مانعة لأطرافها وآلاتها عن مباشرة الحركات في طلب الشهوات\n ومقرّنين بما يجانسهم من الشياطين المغوية إياهم عن سبيل الرشاد والداعية لهم إلى الضلال { دعوا هنالك ثبوراً } بتمني الموت والتحسر على الفوت\n لكونهم من الشدة فيما يتمنى فيه الموت\n { قل أذلك خير أم جنّة } عالم القدس الموعودة للمجرّدين عن ملابس الأبدان وصفات النفوس { لهم فيها ما يشاؤون } من اللذات الروحانية أبداً سرمداً { وما يعبدون } عامّ لكل معبود سوى الله\n والقول إنما يكون بلسان الحال لأن كل شيء سوى الإنسان المحجوب شاهد بوجوده ووجده بالله تعالى ووحدانيته\n مسبّح له بإظهار خاصيته وكماله\n مطيع له فيما أراد الله من أفعاله\n وذلك معنى قوله: { سبحانك ما كان ينبغي لنا أن نتخذ من دونك من أولياء } فحالهم ناطقة بنفي الضلال عن نفسهم في إثبات الضلال للواقفين معهم\n المحجوبين بهم بسبب الانهماك في اللذّات الحسيّة والاشتغال بالطيبات الدنيوية الموجبة للغفلة ونسيان الذكر والبور الهلكى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أنزلنا القرآن الفرقان على عبدنا\n ليهدي التائهين بيداء الغفلة والضلال { قَالَ ٱلَّذِينَ كَفَرُوۤاْ } بالله\n وأعرضوا عما جاء من عنده\n ولتكميل الناقصين: { إِنْ هَـٰذَا } أي: ما هذا الذي جاء به هذا المدعي { إِلاَّ إِفْكٌ } كذب يصرف عن الحق ويلبس الباطل بصورته\n لأنه { ٱفْتَرَاهُ } أي: اختلقه عن عمدٍ\n ونسبه إلى الوحي تغريراً وترويجاً لأمره { وَ } مع ذلك { أَعَانَهُ عَلَيْهِ } ولقَّن له فحواه { قَوْمٌ آخَرُونَ } وهم أحبار اليهود\n وبعدما سمع فحواه منهم\n عبر عنه بلفظ فصيح\n وأفرغه في قالب بليغ\n فأتى به على الناس\n ولقبه الفرقان المعجز\n والقرآن البرهان المثبت المنزل عليه من ربه بطريق الوحي والإلهام\n ترويجاً لمفترياته وتقريراً للناس على قبولها { فَقَدْ جَآءُوا } أي: أولئك المسرفون المفرطون بجعل القرآن الفرقان المعجز - لفظاً ومعنى - إفكاً صرفاً وافتراءً محضاً { ظُلْماً } خروجاً فاحشاً عن حد الاعتدال { وَزُوراً } [الفرقان: 4] قولاً كذباً\n وبهتاناً ظاهراً متجاوزاً ع الحد\n مسقطاً للمروءة سقوطاً تاماً\n إذ نسبة هذا الكتاب الذي\n[فصلت: 42] إلى أمثال هذه الخرافات التي جاءوا بها أولئك الجهلة بشأنه في غاية الظلم والزور ونهاية المراء والغرور\n\n\n{ وَقَالُوۤاْ } أيضاً في حق هذا الكتاب ما هو أفحش منه\n وأبعد من شأنه بمراحل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وقال الذين كفروا } أي: تمردوا في الكفر والطغيان\n قيل: هم النضر بن الحارث\n وعبد الله بن أمية\n ونوفل بن خويلد\n ومن ضاهاهم\n وقيل: النضر فقط\n والجمع لمشايعة الباقين له في ذلك\n قالوا: { إنْ هذا } ما هذا القرآن { إلا إفكٌ } كذب مصروف عن وجهه { افتراه } اختلقه واخترعه محمد من عند نفسه\n { وأعانة عليه } أي: على اختلاقه { قومٌ آخرون } \n يعنون: اليهود\n بأن يلقوا إليه أخبار الأمم الدارسة\n وهو يعبر عنها بعبارته\n وقيل: هم عدَّاس\n ويسار\n وأبو فكيهة الرومي\n كان لهم علم التوراة والإنجيل\n ويحتمل: وأعانه على إظهاره وإشاعته قوم آخرون\n ممن أسلم معه صلى الله عليه وسلم\n قال تعالى: { فقد جاؤوا } \n وأتوا { ظُلماً } أو: بظلم\n فقد تستعمل جاء بمعنى فعل\n فتتعدى تعديته\n أو بحرف الجر\n والتنوين للتفخيم\n أي: جاؤوا ظلماً هائلاً عظيماً حيث جعلوا الحق البيِّن\n الذي لا يأتيه الباطل من بين يديه ولا من خلفه\n إفكاً مفترى من قول البشر\n وجعلوا العربي الفصيح يتلقى من العجمي الرومي\n وهو من جهة نظمه الفائق وطرازه الرائق لو اجتمعت الإنس والجن على مباراته لعجزوا عن مثل آية من آياته\n ومن جهة اشتماله على الحكم العجيبة\n المستتْبعة للسعادات الدينية والدنيوية\n والأمور الغيبية\n بحيث لا يناله عقول البشر\n ولا تفي بفهمه الفهوم\n ولو استعملوا غاية القوى والقدر\n { و } أتوا أيضاً { زُوراً } أي: كذباً كثيراً\n لا يُبْلَغُ غايتُه حيث نسبوا إليه صلى الله عليه وسلم ما هو بريء منه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "58:2",
      "similarity": 0.5399265542196832
    },
    {
      "verse": "102:2",
      "similarity": 0.5241031961957527
    },
    {
      "verse": "25:72",
      "similarity": 0.5077363376315855
    },
    {
      "verse": "2:153",
      "similarity": 0.40533581529879475
    },
    {
      "verse": "1:5",
      "similarity": 0.3833510586353109
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/025004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/025004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}