{
  "chapter": "الفرقان",
  "text": "ان كاد ليضلنا عن ءالهتنا لولا ان صبرنا عليها وسوف يعلمون حين يرون العذاب من اضل سبيلا",
  "translations": [
    {
      "translation": "He might almost have misled us from our gods had we not stuck to them steadfastly!' They will soon know, when they see the punishment, whose way is the most misguided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He would have surely turned us away from our gods if we had not adhered to them.\" They will know soon who is farther away from the path when they see the punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He had almost led us astray from our gods, had we not remained firm in our faith with regard to them. \" The time is not far when they will see the torment and realize who had strayed far from the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had we not been steadfast he would almost have led us astray from our gods.\" On facing torment they will soon know who had really gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Possibly he would have misled us away from our Gods had we not been firm upon them”; soon they will know, when they see the punishment, who was astray from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He would have nearly misled us from our gods, had it not been that we were patient and constant in their worship!\" And they will know, when they see the torment, who it is that is most astray from the path!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He had well-nigh led us astray from our gods had we not adhered to them patiently! And they will know, when they see the punishment, who is straying farther off from the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wellnigh he had led us astray from our gods, but that we kept steadfast to them.' Assuredly they shall know, when they see the chastisement, who is further astray from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He would have led us far away from our gods if we had not been staunch to them. They will know, when they behold the doom, who is more astray as to the road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, he would well-nigh have led us astray from our deities, had we not been [so] steadfastly attached to them!\" When they behold the punishment, they shall realize who strayed furthest from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Well nigh he had led us astray from our gods if we had not persevered towards them. Presently they shall know, When they behold the torment, who, more astray in respect of path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed he was about to lead us astray from our gods, had we not stood firm by them.’ Soon they will know, when they sight the punishment, who is further astray from the [right] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He indeed would well-nigh have misled us from our gods, had it not been that we were constant to them!\" - Soon will they know, when they see the Penalty, who it is that is most misled in Path!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He would have nearly misled us from our aliha (gods), had it not been that we were patient and constant in their worship!\" And they will know when they see the torment, who it is that is most astray from the (Right) Path!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He would have mislead us from our gods, if we had not been steadfast to them' But they shall know who is further astray from the Path when they see the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“He nearly led us away from our gods, had we not patiently adhered to them.” But they will know, when they witness the torment, who is further away from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He almost would have misled us from our gods had we not been steadfast in [worship of] them.\" But they are going to know, when they see the punishment, who is farthest astray in [his] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:42] Indeed (in, softened in place of the hardened form, with its subject omitted, namely, innahu) he was about to lead us astray, turn us away, from our gods, had we not stood by them’, he would have turned us away from them. God, exalted be He, says: And soon they will know, when they behold the chastisement, with their own eyes in the Hereafter, who is further astray from the way, who is further upon the path of error: they or the believers?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He would have led us far away from our gods) from the worship of our deities (if we had not been staunch to them) if we had not been staunch in worshipping them. (They will know) this is a threat to them from Allah, (when they behold the doom, who is more astray as to the road) as to Religion and proof.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن كمال جده وجهده في أمره ونهاية مبالغته في السعي والاجتهاد { إِن كَادَ لَيُضِلُّنَا } أي: إنه قرُب\n ليضلنا ويصرفنا { عَنْ آلِهَتِنَا لَوْلاَ أَن صَبْرَنَا } أي: ثبتنا ومكَّنا ووطنا نفوسنا { عَلَيْهَا } لصرفنا عن آلهتنا\n أي: على عبادة آلهتنا\n وأضلنا عن طريق عبادتهم\n لسعيه التام وجده البليغ في ترويج دينه وإثبات دعواه\n وكثرة إظهار ما يخيل له أن حجج ومعجزات وكمال فصاحةٍ في تبيينها\n وبالجملة: لولا صبرنا وثباتنا على ديننا لضللنا عن آلهتنا بإضلاله\n قال سبحانه رداً عليهم على سبيل التهديد والتوبيخ: { وَسَوْفَ يَعْلَمُونَ } أولئك الحمقى الجاهلون { حِينَ يَرَوْنَ ٱلْعَذَابَ } النازل عليهم { مَنْ أَضَلُّ سَبِيلاً } [الفرقان: 42] وأخطأ طريقاً\n وأسوأ حالاً ومآلاً\n أنتم أيها الجاهلون المصرون على الجهل والعناد\n أم المؤمنون؟",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لولا أن صبرنا عليها } لصرفنا عنها\n وهو دليل على مجاهدة الرسول صلى الله عليه وسلم في دعوتهم\n وإظهار المعجزات لهم\n حتى شارفوا أن يتركوا دينهم إلى دين الإسلام\n لولا فرط لجاجهم وتقليدهم\n قال تعالى: { وسوف يعلمون حين يَرَوْن العذابَ } الذي يستوجبه كفرهم وعنادهم\n { من أضلُّ سبيلاً } \n وأخطأ طريقاً\n وفيه ما لا يخفى من الوعيد والتنبيه على أنه تعالى يُمهل ولا يهمل\n { أرأيتَ من اتخذ إلهَهُ هَواهُ } أي: أطاع هواه فيما يذر ويفعل\n فصار معبوده هواه\n يقول لرسول الله صلى الله عليه وسلم: هذا الذي لا يرى معبوده إلا هواه\n كيف تستطيع أن تدعوه إلى الهدى وتهديه إليها؟ يُروى أن الواحد من أهل الجاهلية كان يعبد الحجر\n فإذا مر بحجر أحسن منه تركه وَعَبَد الثاني\n وقال الحسن: هو في كل متبع هواه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:218",
      "similarity": 0.3688011539241379
    },
    {
      "verse": "52:48",
      "similarity": 0.35092653932171536
    },
    {
      "verse": "37:178",
      "similarity": 0.3434812223123447
    },
    {
      "verse": "37:174",
      "similarity": 0.3407372915955652
    },
    {
      "verse": "38:88",
      "similarity": 0.33078862954814864
    }
  ]
}