{
  "chapter": "الفرقان",
  "text": "وقال الذين كفروا۟ ان هذا الا افك افترىه واعانه عليه قوم ءاخرون فقد جاءو ظلما وزورا",
  "translations": [
    {
      "translation": "Yet the unbelievers say: \"This is nothing but a lie he has concocted in which others have aided him.\" They have come down to mischief and lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have rejected the Message of the Prophet, say, \"This (Al-Furgan) is a forgery which this man himself has devised, and some others have helped him at it. \" What a cruel injustice and an impudent lie!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, \"This (Quran) is no more than a slanderous statement which he (Muhammad), with the help of some other people, has falsely invented.\" Certainly, this statement is unjust and sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelievers said, “This is nothing but a slur he has fabricated and others have helped him upon it”; so indeed the disbelievers have stooped to injustice and lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: \"This is nothing but a lie that he has invented, and others have helped him in it.\" In fact, they have produced an unjust wrong and a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say: This is nothing but a lie which he has forged, and other people have helped him at it; so indeed they have done injustice and (uttered) a falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say, 'This is naught but a calumny he has forged, and other folk have helped him to it.' So they have committed wrong and falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: This is naught but a lie that he hath invented, and other folk have helped him with it, so that they have produced a slander and a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth say, \"This is only a forgery of his own invention in which others have helped him.\" What they say is unjust and false.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve, say. this is naught but a falsehood thathe hath fabricated and there have assisted him therein other people. so surelythey have aimed at a wrong and a fraud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless say, ‘This is nothing but a lie that he has fabricated, and other people have abetted him in it.’ Thus they have certainly come out with wrongdoing and falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the misbelievers say: \"Naught is this but a lie which he has forged, and others have helped him at it.\" In truth it is they who have put forward an iniquity and a falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say: \"This (the Quran) is nothing but a lie that he (Muhammad SAW) has invented, and others have helped him at it, so that they have produced an unjust wrong (thing) and a lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers say: 'This is but a falsehood he has forged? another nation has helped him' So they have come with wrong and falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve say, “This is nothing but a lie that he made up, and others have helped him at it.” They have committed an injustice and a perjury.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve say, \"This [Qur'an] is not except a falsehood he invented, and another people assisted him in it.\" But they have committed an injustice and a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:4] And those who disbelieve say, ‘This, Qur’ān, is nothing but a calumny, a lie, that he, Muhammad (s), has invented, and other folk have helped him with it’, who [according to the disbelievers] were from among the People of the Scripture. God, exalted be He, says: Verily thus they have committed wrong and [spoken] falsehood, [they have come with] disbelief and mendacity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who disbelieve) the disbelievers of Mecca (say: This) Qur'an (is naught but a lie that he hath invented) that Muhammad (pbuh) has invented, (and other folk) Jabr, Yasar and Fukayhah al-Rumi (have helped him with it) to invent it, (so that they have produced a slander and a lie.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنْ هَـٰذَا إِلاَّ إِفْكٌ ٱفْتَرَاهُ } فالإفكُ: البُهتانُ\n وافتراه: معناه: اختلقَهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أنزلنا القرآن الفرقان على عبدنا؛ ليهدي التائهين بيداء الغفلة والضلال { قَالَ ٱلَّذِينَ كَفَرُوۤاْ } بالله، وأعرضوا عما جاء من عنده، ولتكميل الناقصين: { إِنْ هَـٰذَا } أي: ما هذا الذي جاء به هذا المدعي { إِلاَّ إِفْكٌ } كذب يصرف عن الحق ويلبس الباطل بصورته؛ لأنه { ٱفْتَرَاهُ } أي: اختلقه عن عمدٍ، ونسبه إلى الوحي تغريراً وترويجاً لأمره { وَ } مع ذلك { أَعَانَهُ عَلَيْهِ } ولقَّن له فحواه { قَوْمٌ آخَرُونَ } وهم أحبار اليهود، وبعدما سمع فحواه منهم، عبر عنه بلفظ فصيح، وأفرغه في قالب بليغ، فأتى به على الناس، ولقبه الفرقان المعجز، والقرآن البرهان المثبت المنزل عليه من ربه بطريق الوحي والإلهام؛ ترويجاً لمفترياته وتقريراً للناس على قبولها { فَقَدْ جَآءُوا } أي: أولئك المسرفون المفرطون بجعل القرآن الفرقان المعجز - لفظاً ومعنى - إفكاً صرفاً وافتراءً محضاً { ظُلْماً } خروجاً فاحشاً عن حد الاعتدال { وَزُوراً } [الفرقان: 4] قولاً كذباً، وبهتاناً ظاهراً متجاوزاً ع الحد، مسقطاً للمروءة سقوطاً تاماً؛ إذ نسبة هذا الكتاب الذي\n\n[فصلت: 42] إلى أمثال هذه الخرافات التي جاءوا بها أولئك الجهلة بشأنه في غاية الظلم والزور ونهاية المراء والغرور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وقال الذين كفروا } أي: تمردوا في الكفر والطغيان\n قيل: هم النضر بن الحارث، وعبد الله بن أمية، ونوفل بن خويلد، ومن ضاهاهم\n وقيل: النضر فقط، والجمع لمشايعة الباقين له في ذلك\n قالوا: { إنْ هذا } ما هذا القرآن { إلا إفكٌ } كذب مصروف عن وجهه { افتراه } اختلقه واخترعه محمد من عند نفسه، { وأعانة عليه } أي: على اختلاقه { قومٌ آخرون } ، يعنون: اليهود، بأن يلقوا إليه أخبار الأمم الدارسة، وهو يعبر عنها بعبارته\n وقيل: هم عدَّاس، ويسار، وأبو فكيهة الرومي، كان لهم علم التوراة والإنجيل\n ويحتمل: وأعانه على إظهاره وإشاعته قوم آخرون، ممن أسلم معه صلى الله عليه وسلم\n قال تعالى: { فقد جاؤوا } ، وأتوا { ظُلماً } أو: بظلم، فقد تستعمل جاء بمعنى فعل، فتتعدى تعديته، أو بحرف الجر، والتنوين للتفخيم، أي: جاؤوا ظلماً هائلاً عظيماً حيث جعلوا الحق البيِّن، الذي لا يأتيه الباطل من بين يديه ولا من خلفه، إفكاً مفترى من قول البشر، وجعلوا العربي الفصيح يتلقى من العجمي الرومي، وهو من جهة نظمه الفائق وطرازه الرائق لو اجتمعت الإنس والجن على مباراته لعجزوا عن مثل آية من آياته\n ومن جهة اشتماله على الحكم العجيبة، المستتْبعة للسعادات الدينية والدنيوية، والأمور الغيبية، بحيث لا يناله عقول البشر، ولا تفي بفهمه الفهوم، ولو استعملوا غاية القوى والقدر\n { و } أتوا أيضاً { زُوراً } أي: كذباً كثيراً، لا يُبْلَغُ غايتُه حيث نسبوا إليه صلى الله عليه وسلم ما هو بريء منه",
      "translations": []
    }
  ]
}