{
  "chapter": "الفرقان",
  "text": "وقالوا۟ اسطير الاولين اكتتبها فهى تملى عليه بكرة واصيلا",
  "translations": [
    {
      "translation": "And they say: \"These are fables of antiquity he has invented, which are dictated to him morning and evening.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"These things are the writings of the ancients which he has got copied down for himself, and then these are recited to him in the morning and evening.''\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have also said, \"It, (the Quran), is only ancient legends, which were written down while they were dictated to him in the mornings and the evenings\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “These are stories of the former people, which he has written down, so they are read to him morning and evening.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Tales of the ancients which he has written down, and they are dictated to him morning and afternoon. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: The stories of the ancients-- he has got them written-- so these are read out to him morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'Fairy-tales of the ancients that he has had written down, so that they are recited to him at the dawn and in the evening.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Fables of the men of old which he hath had written down so that they are dictated to him morn and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"It is just fables of the ancients, which he has had written down. They are dictated to him morning and evening.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: fables of the ancients which he hath had written down, so they are dictated unto him, morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘He has taken down myths of the ancients, and they are dictated to him morning and evening.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Tales of the ancients, which he has caused to be written: and they are dictated before him morning and evening.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Tales of the ancients, which he has written down, and they are dictated to him morning and afternoon.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'He has written tales of the ancients, they are recited to him at dawn and at the evening'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Tales of the ancients; he wrote them down; they are dictated to him morning and evening.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Legends of the former peoples which he has written down, and they are dictated to him morning and afternoon.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:5] And they say, that it [the Qur’ān] is also, ‘Fables, their lies (asātir is the plural of ustūra) of the ancients which he has had written down, that he has had someone from among those people copy it down for him, so that they are read to him, for him to memorise, morning and evening’. God, exalted be He, responds to them saying:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And they) al-Nadr Ibn al-Harth and his host (say: Fables of the men of old) this Qur'an is nothing but the tales and lies of the people of old (which he hath had written down) which Muhammad (pbuh) copied from Jabr and Yasar (so that they are dictated to him) to Muhammad (pbuh) (morn and evening) in the morning and the evening.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَهِيَ تُمْلَىٰ عَلَيْهِ } معناه هي تُقرأ عليهِ { بُكْرَةً } يعني صلاةَ الغَداةِ { وَأَصِيلاً } يعني صلاةَ العصرِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالُوۤاْ } أيضاً في حق هذا الكتاب ما هو أفحش منه، وأبعد من شأنه بمراحل، وهو: إنه { أَسَاطِيرُ ٱلأَوَّلِينَ } أكاذيب سطرها المتقدمون فيما مضى، وهو { ٱكْتَتَبَهَا } أي: استنسخها من حَبْر، وكتبها له كاتب، وبعدما أخذ سوداها { فَهِيَ } الأساطير المذكورة { تُمْلَىٰ } وتُقرأ { عَلَيْهِ } أي: على محمد صلى الله عليه وسلم { بُكْرَةً وَأَصِيلاً } [الفرقان: 5] أي: غداةً وعشياً على سبيل التكرار ليحفظها؛ إذ هو أمي لا يقدر على أن يكرر من الكتاب، وبعدما حفظها، قرأها على الناس مدعياً أنها موحى من عند الله، أنزلها عليه ملك سماوي اسمه جبرائيل، أو تُملى عليه على سبيل التعليم ليكتب لنفسه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا أساطيرُ الأولين } أي: هو أحاديث المتقدمين، وما سطروه من خرافاتهم كرُستم وغيره\n جمع أسطار، أو أسطورة، { اكتتبها } كتبها لنفسه، أو: استكتبتها فكُتبت له، { فهي تُملى عليه } أي: تُلقى عليه من كتابه { بكرةً }: أول النهار { وأصيلاً } آخره، فيحفظ ما يتلى ثم يتلوه علينا\n انظر هذه الجرأة العظيمة، قاتلهم الله، أنى يؤفكون؟",
      "translations": []
    }
  ]
}