{
  "chapter": "الفرقان",
  "text": "وهو الذى خلق من الماء بشرا فجعله نسبا وصهرا وكان ربك قديرا",
  "translations": [
    {
      "translation": "And it is He who created human beings from water and then gave them relations by blood and marriage. Your Lord is Ail-Powerful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created man from water, then gave him consanguinity and affinity. Your Lord is omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He, Who created man from water: then from him He caused two kinds of kindred, by blood and by marriage: your Lord is AI I-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created the human being from water to have relationships of both lineage and wedlock. Your Lord has all power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who created man from water, then appointed relatives and in-laws for him; and your Lord is All Able.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has created man from water, and has appointed for him kindred by blood, and kindred by marriage. And your Lord is Ever All-Powerful to do what He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has created man from the water, then He has made for him blood relationship and marriage relationship, and your Lord is powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who created of water a mortal, and made him kindred of blood and marriage; thy Lord is All-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who hath created man from water, and hath appointed for him kindred by blood and kindred by marriage; for thy Lord is ever Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created human beings from water and He has granted them the ties of blood as well as marriage. Your Lord is all powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who hath created man from water, and then made for him kinship by blood and marriage. And thy Lord is ever potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the human being from water, then invested him with ties of blood and marriage, and your Lord is all-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has created man from water: then has He established relationships of lineage and marriage: for thy Lord has power (over all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has created man from water, and has appointed for him kindred by blood, and kindred by marriage. And your Lord is Ever All-Powerful to do what He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who created the human from water and gave him kindred of blood and of marriage. Your Lord is the Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who, from fluid, created the human being. Then He made relationships through marriage and mating. Your Lord is Omnipotent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who has created from water a human being and made him [a relative by] lineage and marriage. And ever is your Lord competent [concerning creation].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:54] And He it is Who created man from water, [He created] from a sperm-drop a human being, and made for him ties of blood and ties of marriage, whether it be a male or a female, they marry for the purposes of procreation. For your Lord is ever Powerful, with the power to do whatever He will.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He it is Who hath created man from water) from the water of the male and female, (and hath appointed for him kindred by blood) who are unmarriageable (and kindred by marriage) who are marriageable, whether they are relatives or not; (for thy Lord is) in relation to the lawful and the unlawful which He created (ever Powerful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَجَعَلَهُ نَسَباً وَصِهْراً } فالنَّسبُ: الرِضاعُ والصَّهرُ: الخِتونةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف تنكرون أيها المنكرون سريان وحدته الذاتية على صفائح مظاهره { هُوَ ٱلَّذِي خَلَقَ } أي: أظهر وأوجد تنبيهاً لعباده على سر توحيده { مِنَ ٱلْمَآءِ } أي: من نقطة النطفة { بَشَراً } سوياً ذا أجزاء مختلفة طبعاً وشكلاً، صلابةً وليناً، قوةً وضعفاً، رقةً وغلظاً، إلى غير ذلك من الصفات المتقابلة والأجزاء المتفاوتة التي عجزت عن تشريح جزءٍ من أجزاء شخص من أشخاص نوع الإنسان فحول الحكماء، مع وفور دواعيهم لكشفها إلى حيث تاهوا وتحيروا عن ضبط ما فيه من الامتزاجات والارتباطات، فكيف عن جميع أجزائه؟! وبعدما قدَّره سبحانه، وسوَّاه بكمال قدرته وقوته، ووفور حكمته قسَّمه قسمين { فَجَعَلَهُ نَسَباً } أي: جعل قسماً منه ذكراً ذا نسب ونسل ينسب إليه من يخلفه من أولاده الحاصلة من نطفة\n\n\n\n\n{ وَ } جعل قسماً آخر منه { صِهْراً } أي: أنثى يصاهر بها؛ أي: يختلط ويمتزج الذكر معها؛ إبقاءً للنوع وتتميماً لبقائه على سبيل التناسل والتوالد إلى ما شاء الله { وَ } بالجملة: { كَانَ رَبُّكَ } الذي رباك يا أكمل الرسل على كمال الذكاء والفطنة في فهم سرائر توحيده، ورقائق تجلياته الجلالية والجمالية { قَدِيراً } [الفرقان: 54] على ما شاء وأراد بلا فتور وقصور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر دليلاً آخر، فقال: { وهو الذي خلقَ من الماءِ } أي: النطفة { بَشَراً } إنساناً { فجعله نسباً وصِهْراً }\n قسم البشر قسمين: ذوي نسب، أي ذكوراً، ينسب إليهم، فيقال: فلان ابن فلان\n وذوات صهر، أي: إناثاً يصاهر بهن، فهو كقوله:\n\n[القيامة: 39]\n قال ابن جزي: والنسب: أن يجتمع إنسان مع آخر في أب أو أمّ، قَرُبَ ذلك أو بَعُدَ\n والصهر: هو الاختلاط بالتناكح\n هـ\n وعن علي رضي الله عنه: النسب ما لا يحل نكاحه، والصهر: ما يحل نكاحه\n وعن الضحاك ومقاتل: النسب سبعة، والصهر خمسة، ثم قرأ هذه الآية:\n\n[النساء: 23]\n فالسبعة الأولى: نسب، والباقي: صهر\n هـ\n والأصح أن التسعة نسب، والباقي صهر\n { وكان ربك قديراً } حيث خلق من النطفة الواحدة بشراً ذا نوعين، ذكراً وأنثى، أو: حيث خلق من مادة واحدة بشراً ذا أعضاء مختلفةٍ وطباعٍ متباعدة، وجعله قسمين متقابلين ذكراً وأنثى",
      "translations": []
    }
  ]
}