{
  "chapter": "الفرقان",
  "text": "وهو الذى مرج البحرين هذا عذب فرات وهذا ملح اجاج وجعل بينهما برزخا وحجرا محجورا",
  "translations": [
    {
      "translation": "It is He who has unloosed both seas - the one sweet and refreshing, the other salty and bitter - and put a dividing line between them, an uncrossable barrier.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made two bodies of water flow side by side, one fresh (and) sweet, the other brine (and) bitter, and has placed an interstice, a barrier between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He, Who has let loose the two seas, one palatable and sweet, the other bitter and saltish, and there is a partition between them, which is an insurmountable barrier.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has joined the two seas; one palatable and sweet, the other bitterly salty and has established a barrier between them as a partition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who caused the two joint seas to flow- one is palatable, very sweet, and the other is salty, very bitter; and kept a veil between them and a preventing barrier.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has let free the two seas, this is palatable and sweet, and that is salty and bitter; and He has set a barrier and a complete partition between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has made two seas to flow freely, the one sweet that subdues thirst by its sweetness, and the other salt that burns by its saltness; and between the two He has made a barrier and inviolable obstruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who let forth the two seas, this one Sweet, grateful to taste, and this salt, bitter to the tongue, and He set between them a barrier, and a ban forbidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who hath given independence to the two seas (though they meet); one palatable, sweet, and the other saltish, bitter; and hath set a bar and a forbidding ban between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who released the two bodies of flowing water, one sweet and fresh and the other salty and bitter, and set up an insurmountable barrier between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who hath mixed the two seas: this, sweet ond thirst quenching; that, saltish ond bitter; and hath placed between the twain a barrier and a great partition complete.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who merged the two seas: this one sweet and agreeable, and that one briny and bitter, and between the two He set a barrier and a forbidding hindrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has let free the two bodies of flowing water: One palatable and sweet, and the other salt and bitter; yet has He made a barrier between them, a partition that is forbidden to be passed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has let free the two seas (kinds of water), one palatable and sweet, and the other salt and bitter, and He has set a barrier and a complete partition between them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who let forth the two seas, this one is palatably sweet and this salt, a bitter taste, and He set a barrier between them, and a refuge which is forbidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who merged the two seas; this one fresh and sweet, and that one salty and bitter; and He placed between them a barrier, and an impassable boundary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who has released [simultaneously] the two seas, one fresh and sweet and one salty and bitter, and He placed between them a barrier and prohibiting partition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:53] And He it is Who merged the two seas: letting them [flow] one adjacent to the other: this one palatable, sweet, and the other saltish, bitter; and He set between the two an isthmus, so that the one does not mix with the other, and a forbidding ban, a shield that prevents the two from becoming mixed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He it is Who hath given independence to the two seas (though they meet); one palatable, sweet, and the other saltish, bitter; and hath set a bar) a barrier between the sweet and the salty (and a forbidding ban between them) preventing either one from transgressing against the other, such as to make the taste of either of them change.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُوَ ٱلَّذِي مَرَجَ ٱلْبَحْرَيْنِ } معناه خَلاَّهُما فاختلطَا والمَريجُ: المُختلطُ\n\n\n\n\nوقوله تعالى: { وَجَعَلَ بَيْنَهُمَا بَرْزَخاً وَحِجْراً مَّحْجُوراً } والبَرزخُ: المَجلسُ\n وقال: الأجلُ\n وقال البَرزخُ: عَرضُ الأَرضِ\n والحِجرُ المَحجورِ: الحاجِزُ لئلا يَختلطَ المِلحُ بالعَذبِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } قله لهم تنبيهاً عليهم: كيف تغفلون عن ربكم وعن دينه الموضوع فيكم إصلاحاً لحالكم؟! { هُوَ ٱلَّذِي مَرَجَ ٱلْبَحْرَيْنِ } أي: التوحيد والشرك كلاهما متجاورين متلاصقين، مع أنه { هَـٰذَا } أي: التوحيد { عَذْبٌ فُرَاتٌ } سائغ شرابه للمتعطشين بزلاله { وَهَـٰذَا } أي: الشرك والكفر { مِلْحٌ أُجَاجٌ } أي: مالح في كمال الملوحة إلى حيث يقطع أمعاء شاربيه { وَ } من كمال لطف الله على عباده { جَعَلَ } سبحانه دين الإسلام والشريعة الموضوعة؛ للضبط { بَيْنَهُمَا } أي: بين التوحيد والشرك { بَرْزَخاً } مانعاً عن التصاقهما واتصالهما { وَ } جعله { حِجْراً مَّحْجُوراً } [الفرقان: 53] أي: حداً محدوداً، مانعاً عن امتزاجهما واختلاطهما\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أصل المرج: الخلط والإرسال، ومنه قوله تعالى:\n\n[ق: 5]، وقوله صلى الله عليه وسلم:\n\n \" كيف بك يا عبدَ اللهِ إذا كنت في حُثَالةٍ من الناس، قد مرجتْ عهودهُمْ وأماناتهمْ، وصاروا هكذا، وشَبَّكَ بين أصابعه \"\n \n\nيقال: مرج دابته وأمرجتها: إذا أرسلتها في المرعى\n ومنه قيل للروضة: مرج\n يقول الحق جل جلاله: { وهو الذي مَرَجَ البحرين } أي: أرسلهما، وخَلاَّهُمَا متجاورَيْن متلاصقَيْن غير متمازجَيْن\n { هذا عذبٌ فُرَاتٌ } أي شديد العذوبة، قامع للعطش لعذوبته، أي: برودته، { وهذا مِلْحٌ أُجاجٌ }: بليغ الملوحة، أو هذا عذب لا ملوحة فيه، وهذا ملح لا عذوبة فيه، مع اتحاد جنسهما، { وجعل بينهما برزخاً } حائلاً بقدرته، يفصل بينهما ويمنعهما التمازج لئلا يختلطا، { وحِجْراً محجوراً } أي: وستراً ممنوعاً عن الأعين، كقوله:\n\n[الإسراء: 45]، أي: جعل بينهما حاجزاً خفياً لئلا يغلب أحدهما الآخر، أو: سداً ممنوعاً يمنعهما فلا يبغيان، ولا يفسد الملحُ العذبَ، ولو خَلاَّ الله تعالى البحر الملح، ولم يلجمه بقدرته، لفاض على الدنيا، واختلط مع العذب وأفسده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:12",
      "similarity": 0.5113427026834955
    },
    {
      "verse": "55:20",
      "similarity": 0.31841450990196873
    },
    {
      "verse": "56:70",
      "similarity": 0.3156231857331946
    },
    {
      "verse": "23:100",
      "similarity": 0.2983738927350465
    },
    {
      "verse": "77:27",
      "similarity": 0.20869564032165758
    }
  ]
}