{
  "chapter": "الفرقان",
  "text": "وتوكل على الحى الذى لا يموت وسبح بحمده وكفى به بذنوب عباده خبيرا",
  "translations": [
    {
      "translation": "Put your trust in the Living who does not die and glorify Him with praise. He is well aware of the wrong actions of His slaves:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have trust in God the Living, who will never die, and sing His hallelujas; for He is well aware of the sins of His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Muhammad trust in that Allah Who is Ever-Living and will never die' Glorify Him with His praise, for He alone is sufficient to be aware of the sins of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also trust in the Living One who never dies and glorify Him with His praise. He has sufficient knowledge of the sins of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And trust the Living One Who will never die, and praising Him proclaim His Purity; and He is Sufficient upon the sins of His bondmen, All Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in the Ever Living One Who dies not, and glorify His praises, and sufficient is He as the All-Knower of the sins of His servants,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rely on the Ever-living Who dies not, and celebrate His praise; and Sufficient is He as being aware of the faults of His servants,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put thy trust in the Living God, the Undying, and proclaim His praise. Sufficiently is He aware of His servants sins\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And trust thou in the Living One Who dieth not, and hymn His praise. He sufficeth as the Knower of His bondmen's sins,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your trust in the One who is the Ever-Living [God], who never dies, and glorify Him with His praise. He is fully aware of the sins of His servants;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And trust thou in the Living One who dieth not, and hallow His praise; it sufficeth that he of the sins of His bondmen is Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your trust in the Living One who does not die, and celebrate His praise. He suffices as one all-aware of the sins of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put thy trust in Him Who lives and dies not; and celebrate his praise; and enough is He to be acquainted with the faults of His servants;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust (O Muhammad SAW) in the Ever Living One Who dies not, and glorify His Praises, and Sufficient is He as the All-Knower of the sins of His slaves;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your trust in the All Living who never dies, and exalt with His praise, He is sufficiently aware of His worshipers' sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in the Living, the One who never dies; and celebrate His praise. He suffices as the All-Informed Knower of the faults of His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rely upon the Ever-Living who does not die, and exalt [Allah] with His praise. And sufficient is He to be, with the sins of His servants, Acquainted -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:58] And put your trust in the Living One Who does not die, and make glorifications, ensconced, in His praise, in other words, say: subhāna’Llāhi wa’l-hamdu li’Llāh, ‘Glory be to God and praise be to God’. And He suffices as One Aware, as Knower, of the sins of His servants (khabīran, ‘One Aware’, is semantically connected to bi-dhunūbi, ‘of the sins’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And trust thou) Muhammad (in the Living One Who dieth not) and do not trust in those living who die such as Abu Talib or Khadijah, nor trust yet in the dead who have no movement, (and hymn His praise) and pray by His command. (He sufficeth as the Knower of His bondmen's sins) He is aware of the sins of His bondmen,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَوَكَّلْ عَلَى ٱلْحَيِّ ٱلَّذِي لاَ يَمُوتُ } معناه على الحَيّ البَاقِي الذي لا يَفنى\n\n\n\n\nوقوله تعالى: { وَكَفَىٰ بِهِ بِذُنُوبِ عِبَادِهِ خَبِيراً } معناه عَليمٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd trust in the Ever-Living One who does not die.\n\n\nAnd His saying, \"He is sufficient for the sins of His servants,\" means that He is knowledgeable.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وتوكل على الحيّ الذي لا يموت } أي: شاهد موت الكل وعدم حراكهم بذواتهم، كما قال:\n\n[الزمر، الآية:30] فإنهم لا يتحركون إلا بدواع أوجدها الله تعالى فيهم بفناء أفعالك وأفعال الكل في أفعال الحق ورفع حجبها عن أفعاله إذ مقام التوكل هو الفناء في الأفعال\n وبيّن بقوله: { عَلَى ٱلْحَيِّ ٱلَّذِي لاَ يَمُوتُ } إن منشأ التوكل شهود صفة حياته التي بها يحيا كل حيّ لأن من يموت لا يكون حيّاً بالذات وبالترقي عن مقام فناء الأفعال إلى الفناء في صفة الحياة يصح مقام التوكل كما قالت المتصوفة: لا يمكن تصحيح كل مقام إلا بالترقي إلى المقام الذي فوقه، وإذا كان كل حيّ يموت إنما يحيا بحي الذات الذي حياته عين ذاته فبه يتحرك، فلا تبال بأفعالهم فإنهم لو اجتمعوا بأسرهم على أن يضّروك بشيء لم يضروك إلا بما كتب الله عليك، على ما ورد في الحديث\n { وسبّح بحمده } ونزهه بتجرّدك عن صفاتك ومحوها في صفاته عن أن تكون لغيره صفة مستقلّة تكون مصدراً لفعله ملتبساً بحمده، أي: متّصفاً بصفاته، فإن الحمد الحقيقي هو الاتصاف بصفاته الكمالية التي هو بها حميد وذلك هو تصحيح مقام التوكل وتحقيقه بنفي الصفات التي هي مبادىء الأفعال من الغير، وإذا تجرّدت عن صفاتك بالاتصاف بصفاته شاهدت إحاطة علمه بالكل، فاكتفيت به عن سؤاله في دفع جناياتهم عنك وجزاء إيذائهم لك، وشاهدت قدرته على مجازاتهم، كما قال إبراهيم عليه السلام: \" حسبي من سؤالي علمه بحالي \"",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن انصرفوا عنك وأعرضوا عن هدايتك وإرشادك\n وقصدوا تعنتك وقتلك عداوناً وظلماً\n فلا تبالِ يا أكمل الرسل بهم وبشأنهم ولا تحزن عن أمرهم\n بل { تَوَكَّلْ } في مقابلتهم ومقاوتهم { عَلَى ٱلْحَيِّ } القيوم { ٱلَّذِي لاَ يَمُوتُ } أي: لا يعرضه الموت والفناء { وَسَبِّحْ } ربك ونزهه عما لا يليق بشأنه مقارناً تسبيحك { بِحَمْدِهِ } على آلائه ونعمائه الفائضة عليك على التعاقب والتوالي\n سيما على ما اصطفاك من بيت البرايا\n وأعطاك الرئاسة والسيادة على كافة الأنام\n والرسالة على قاطبة الأمم\n بلغ ما أنزل إليك ولا تفرح من إيمانهم\n ولا تحزن على كفرهم وطغيانهم { وَ } اعلموا أنه { كَفَىٰ بِهِ } أي: كفى الله سبحانه عالماً { بِذُنُوبِ عِبَادِهِ } ما ظهر منهم وما سيظهر\n وما بطن في استعداداتهم\n وكن في قابلياتهم { خَبِيراً } [الفرقان: 58] مطلعاً بصيراً على وجه الحضور والشهود لا يعزب عن حيطة حضرة علمه شيء منها\n مجازياً قديراً\n ومنتقماً عزيزاً يجازيهم بقدرته على مقتضى اطلاعه وخبرته\n\n\nوكيف لا يعلم ويطلع سبحانه بجميع ما ظهر وبطن\n وهو { ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أبدعهما وأظهرما { وَمَا بَيْنَهُمَا } من كتم العدم بلا سبق الهيولي والزمان { فِي سِتَّةِ أَيَّامٍ } أي: على عدد الجهات والأقطار المحفوفة بجميع الكوائن والفواسد { ثُمَّ } بعدما كمل ترتيبها على أبلغ نظام { ٱسْتَوَىٰ } وتمكن وانبسط { عَلَى ٱلْعَرْشِ } أي: على عروش جميع المظاهر بالاستيلاء التام والبسطة العامة { ٱلرَّحْمَـٰنُ } الذي وسعت رحمته كل ما ظهر وبطن\n غيباً وشهادة\n\n\n{ فَسْئَلْ بِهِ } أي: بما ذكر من خبرة الله وإحاطة علمه وقدرته وإظهاره ما ظهر وبطن عيناً وشهادةً\n وإحاطته واستيلائه على عروش الرحمن بالرحمة العامة { خَبِيراً } [الفرقان: 59] ذا خبرة يخبرك بصدقها من أرباب القلوب الواصلين إلى مرتبة الكشف وعموم الشهود ممن سبقت لهم العناية الأزلية\n والجذبة الجالية الغالبة من قبل الحق\n المفنية لهم عن أنانياتهم\n المبقية لهم ببقاء الحق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وتوكَّلْ على الحيّ الذي لا يموتُ } في الاستكفاء عن شرورهم، والاغتناء عن أجورهم، أي: ثق به فإنه يكفيك عن الطمع فيمن يموت، فلا تطلب على تبليغك من مخلوق أجراً، فإن الله كافيك\n قرأها بعض الصالحين فقال: لا يصح لذي عقل أن يثق بعدها بمخلوق\n { وسَبَّحْ } أي: ونزهه أن يكل إلى غيره مَنْ تَوَكَّلَ عليه، { بحمده } أي: بتوفيقه الذي يوجب الحمد، أو: قل سبحان الله وبحمده، أو: نزهه عن صفات النقصان، مثنياً عليه بنعوت الكمال، طالباً لمزيد الإنعام، { وكفى به بذنوب عباده خبيراً } أي: كفى الله خبيراً بذنوب عباده، ما ظهر منها وما بطن، يعني: أنه خبير بأحوالهم، كافٍ في جزاء أعمالهم\n { الذي خلق السموات والأرضَ وما بينهما في ستة أيام } أي: في مدة مقدارها ستة أيام إذْ لم يكن ليل ولا نهار\n وعن مجاهد: أولها يوم الأحد، وآخرها يوم الجمعة، وإنما خلقها في هذه المدة، وهو قادر على خلقها في لحظة، تعليماً لخلقه الرفق والتثبت",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:3",
      "similarity": 0.5163061867877478
    },
    {
      "verse": "17:96",
      "similarity": 0.5104459235100488
    },
    {
      "verse": "4:132",
      "similarity": 0.494057375115679
    },
    {
      "verse": "17:17",
      "similarity": 0.4675568030119988
    },
    {
      "verse": "17:65",
      "similarity": 0.4556538873469066
    }
  ]
}