{
  "chapter": "الفرقان",
  "text": "فلا تطع الكفرين وجهدهم به جهادا كبيرا",
  "translations": [
    {
      "translation": "So do not obey the kafirun but use this to battle against them with all your might.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not listen to unbelievers, and strive against them with greater effort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, O Prophet, do not yield to the disbelievers, but wage a Jihad against them with this Qur'an.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not yield to the unbelievers but launch a great campaign against them with the help of the Quran.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not listen to the disbelievers and, with this Qur’an, fight a great war against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So obey not the disbelievers, but strive against them with the utmost endeavor with it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not follow the unbelievers, and strive against them a mighty striving with it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So obey not the unbelievers, but struggle with them thereby mightily.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So obey not the disbelievers, but strive against them herewith with a great endeavour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so do not yield to those who deny the truth, but strive with the utmost strenuousness by means of this [Quran, to convey its message to them].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Se obey not thou the infidels, but strive against them therewith with a great striving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not obey the faithless, but wage a great jihad against them with it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore listen not to the Unbelievers, but strive against them with the utmost strenuousness, with the (Qur'an).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So obey not the disbelievers, but strive against them (by preaching) with the utmost endeavour, with it (the Quran).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not obey the unbelievers, but struggle mightily with it (the Koran).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not obey the disbelievers, but strive against them with it, a mighty struggle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not obey the disbelievers, and strive against them with the Qur'an a great striving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:52] So do not obey the disbelievers, in their desires, but struggle against them therewith, that is, through [adherence to] the Qur’ān, with a great endeavour.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So obey not the disbelievers) Abu Jahl and his host regarding hat which they ask of you, (but strive against them herewith) by means of the Qur'an (with a great endeavour) by the sword.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الفرقان: 1] لتستوجب بذلك الدرجة القصوى، وتفضل على سائر الرسل والأنبياء، { فلا تُطع الكافرين } فيما يدعونك إليه من موافقتهم ومداهنتهم\n وكما آثرْتُك على جميع الأنبياء فآثر رضاي على جميع الأهواء، وكأنه نهى للرسول صلى الله عليه وسلم عن المداراة معهم، والتقصير في الدعوة لئلا تغلبه الشفقة عن مقابلتهم بصريح الحق\n قال القشيري: { فلا تُطع الكافرين } أي: كُنْ قائماً بحقِّنا، من غير أن يكون منك جنوحٌ إلى غيرنا، أو مبالاةٌ بسوانا، فإنا نَعْصِمُكَ بكل وجهٍ، ولا نرفع عنكَ ظِلَّ عنايتنا بحالٍ\n هـ\n { وجاهِدْهُمْ به } أي: بالقرآن بأن تقرأ عليهم ما فيه من الزواجر والقوارع والمواعظ، وذكر أحوال الأمم الهالكة، { جهاداً كبيراً } عظيماً موقعه عند الله لما يتحمل فيه من المشاق، فإن دعوة كُلِّ العالمين، على الوجه المذكور، جهاد كبير، أو: جاهدهم به بالشدة والعنف من غير مداراة ولا ملاينة، فَكِبَرُ الجهادِ هو ملابسته بالشدة والعنف، كقوله:\n\n[التوبة: 73]\n والله تعالى أعلم\n الإشارة: الإنذار والوعظ بالمقال مع الهمة والحال عزيز الوجود، فقلَّ أن يجتمع منهم، في العصر الواحد، ثلاثة أو أربعة في الإقليم الكبير لأن الله تعالى لم يشأ ذلك بحكمته، قال تعالى: { ولو شئنا لبعثنا في كل قرية نذيراً } ، وكلما قَلَّ عددهم، وعظُم الانتفاع بهم، عظُم قدرهم، فينبغي للمذكِّر أن يُذكِّر كلاًّ بما يليق به، فأهل العصيان ينبغي له أن يشدد في الإنذار، ولا يداريهم ولا يداهنهم\n وأهل الطاعة ينبغي له أن يُبشِّرهم ويسهل الأمر عليهم، وقد قال صلى الله عليه وسلم:\n\n \" يَسِّروا ولا تُعَسِّروا، وبَشِّروا ولا تُنَفِّرُوا \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:6",
      "similarity": 0.5767183158918863
    },
    {
      "verse": "29:69",
      "similarity": 0.5358699395385789
    },
    {
      "verse": "61:11",
      "similarity": 0.5060894349379925
    },
    {
      "verse": "9:44",
      "similarity": 0.49251810147632896
    },
    {
      "verse": "3:142",
      "similarity": 0.437648417603665
    }
  ]
}