{
  "chapter": "الفرقان",
  "text": "الذى خلق السموت والارض وما بينهما فى ستة ايام ثم استوى على العرش الرحمن فسـل به خبيرا",
  "translations": [
    {
      "translation": "He who created the heavens and the earth and everything in between them in six days, and then established Himself firmly on the Throne; the All-Merciful - ask anyone who is informed about Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth and all that lies between them in six spans then assumed His authority. He is the benevolent: Ask those who are well-informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In six days He created the earth and the heavens and all that is between them; then He established Himself on the \"Throne\" (of the Kingdom of the uriverse). (He is) the Merciful: as to His Glory, ask the one who knows.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth and all that is between them in six days and then He established His domination over the Throne. He is the Beneficent God. Refer to Him as the final authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The One Who created the heavens and the earth and all that is between them in six days, then befitting His Majesty, established Himself upon the Throne (of control); the Most Gracious – therefore ask the one who knows, concerning Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the heavens and the earth and all that is between them in six Days. Then He rose over (Istawa) the Throne. The Most Gracious! Ask Him, as He is the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the heavens and the earth and what is between them in six periods, and He is firmly established on the throne of authority; the Beneficent Allah, so ask respecting it one aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who created the heavens and the earth, and what between them is, in six days, then sat Himself upon the Throne, the All-compassionate: ask any informed of Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the heavens and the earth and all that is between them in six Days, then He mounted the Throne. The Beneficent! Ask anyone informed concerning Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is He who created the heavens and the earth and all that is between them in six Days [periods], then settled Himself on the throne -- the Gracious One. Ask any informed person about Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the heavens and the earth and whatsoever is in- between them in six days, then He established Himself on the Throne -the Compassionate! so, concernin Him, ask any one informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He, who created the heavens and the earth and whatever is between them in six days, and then settled on the Throne, the All-beneficent; so ask someone who is well aware about Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He Who created the heavens and the earth and all that is between, in six days, and is firmly established on the Throne (of Authority): Allah Most Gracious: ask thou, then, about Him of any acquainted (with such things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the heavens and the earth and all that is between them in six Days. Then He Istawa (rose over) the Throne (in a manner that suits His Majesty). The Most Beneficent (Allah)! Ask Him (O Prophet Muhammad SAW), (concerning His Qualities, His rising over His Throne, His creations, etc.), as He is Al-Khabir (The All-Knower of everything i.e. Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is) He who, in six days created the heavens and the earth and all that lies between them, and then He willed to the Throne. The Merciful; ask about Him from he who knows Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who created the heavens and the earth and everything between them in six days, then settled on the Throne. The Most Merciful. Ask about Him a well-informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who created the heavens and the earth and what is between them in six days and then established Himself above the Throne - the Most Merciful, so ask about Him one well informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:59] He it is, Who created the heavens and the earth and all that is between them in six days, of the [length of the] days of this world, since there was no sun at that point — had He willed He could have created them in an instant, but His not having done so is because He will to teach His creatures to be circumspect — then presided upon the Throne (al-‘arsh in the [classical] language is the seat on which a king sits) the Compassionate One (al-rahmānu substitutes for the subject of [the verb] istawā, ‘presided’) a presiding befitting of Him; so ask, O man, about Him, about the Compassionate One, anyone who is well aware, to inform you about His attributes!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who created the heavens and the earth and all that is between them) of created beings and marvels (in six Days) of the beginning of creation, the length of each day was 1,000 years of the days that you count presently; the first day was Sunday and the last day Friday, (then He mounted the Throne. The Beneficent! Ask any one informed concerning Him) ask those who possess knowledge about Allah, and they will inform you!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَسْئَلْ بِهِ خَبِيراً } معناه مَن ذَا الذي أَخبركَ بشيءٍ كما أَخبُرُكَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {So ask the knowledgeable about Him} - its meaning is: Who told you about Him as He has told you?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ثم استوى على } عرش القلب المحمدي في السابع الذي هو يوم الجمعة\n أي: يوم اجتماع جميع الأوصاف والأسماء فيه\n وذلك هو معنى الاستواء في الاستقامة بالظهور التامّ والفيض العام الذي هو الرحمة الرحمانية ولهذا جعل فاعل الاستواء اسم الرحمن دون اسم آخر إذ لا يكون الاستواء بمعنى الظهور التام إلا به\n ويمكن أن تؤوّل الأيام بالشهور الستة التي يتمّ فيها خلق سموات أرواح الجنين وأرض جسده وما بينهما من القوى والاستواء بالظهور التام على عرش قلبه الذي كان على ماء النطفة قبل خلقه ما خلق في الشهر السابع الذي أنشأه فيه خلقاً آخر بحصوله إنساناً\n والرحمانية بعموم فيضه المعنويّ والصوريّ من قلبه إلى جميع أجزاء وجوده { فاسئل به خبيراً } اسأل عارفاً به يخبرك بحاله واسأله في حالة كونه عالماً بكل شيء",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم استوى على العرش } استواء يليق به\n { الرحمنُ } أي: هو الرحمن\n أو: فاعل استوى\n أي: استوى الرحمن\n برحمانيته على العرش وما احتوى عليه\n وراجع ما تقدم في الأعراف { فاسألْ به خبيراً } أي: سل عنه رجلاً عارفاً خبيراً به\n يُخبرك برحمانيته\n وكانوا ينكرون اسم الرحمن\n ويقولون: لا نعرف الرحمن إلا الذي باليمامة\n يعنون: مسيلمة الكذاب\n وكان يقال له: رحمن اليمامة غُلُوًّا فيه\n فأمر نبيه أن يسأل من له خبرة وعلم بالكتب المتقدمة عن اسم الرحمن\n فإنه مذكور في الكتب المتقدمة\n قال شيخ شيوخنا سيدي عبد الرحمن العارف: والظاهر: أن الخبير هو الله\n أي: أسأل الله الخبير بالأشياء\n الأعلم بخفاياها\n والتقدير: فسل بسؤالك إياه خبيراً\n وإنما استظهرنا هذا القول لأن المأمور بالسؤال الرسول صلى الله عليه وسلم\n وَتَجِلُّ رتبته عن سؤال غير ربه\n والمراد: فسل الله الخبير بالرحمن ووصفه\n انظر تمام كلامه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:4",
      "similarity": 0.808915105096803
    },
    {
      "verse": "10:3",
      "similarity": 0.7413409176098051
    },
    {
      "verse": "11:7",
      "similarity": 0.6798018895106508
    },
    {
      "verse": "57:4",
      "similarity": 0.526142309947897
    },
    {
      "verse": "58:4",
      "similarity": 0.3818182163776163
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/25:59.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/25:59.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/25:59.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}