{
  "chapter": "الفرقان",
  "text": "قل انزله الذى يعلم السر فى السموت والارض انه كان غفورا رحيما",
  "translations": [
    {
      "translation": "Say: 'The One Who sent it down is He Who knows all hidden secrets in the heavens and earth . He is Ever-Forgiving, Most Merciful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He who knows the secrets of the heavens and the earth has revealed it to me; and He is surely forgiving and kind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Muhammad, say to them, \"This has been sent down by Him, Who knows the secret of the heavens and the earth.\" The fact is that He is very Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"The One who knows all the secrets of the heavens and the earth has revealed it; He is All-forgiving and All-merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “It is sent down by Him Who knows all the secrets of the heavens and the earth; indeed He Oft Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It has been sent down by Him Who knows the secret of the heavens and the earth. Truly, He is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He has revealed it Who knows the secret in the heavens and the earth; surely He is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He sent it down, who knows the secret in the heavens and earth; He is All-forgiving, All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them, O Muhammad): He who knoweth the secret of the heavens and the earth hath revealed it. Lo! He ever is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"It has been revealed by Him who knows every secret that is in the heavens and on the earth. Truly, He is most forgiving and most merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou; He hath sent it down Who knoweth the secret of the heavens and the earth; verily He is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘It has been sent down by Him who knows the hidden in the heavens and the earth. Indeed He is all-forgiving, all-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The (Qur'an) was sent down by Him who knows the mystery (that is) in the heavens and the earth: verily He is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It (this Quran) has been sent down by Him (Allah) (the Real Lord of the heavens and earth) Who knows the secret of the heavens and the earth. Truly, He is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It was sent down by Him who knows the secrets of heavens and earth. He is Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “It was revealed by He who knows the Secret in the heavens and the earth. He is always Forgiving and Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"It has been revealed by He who knows [every] secret within the heavens and the earth. Indeed, He is ever Forgiving and Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:6] Say: ‘It has been revealed by Him Who knows the secret, the Unseen, of the heavens and the earth. Truly He is ever Forgiving, of believers, Merciful’, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (He Who knoweth the secret of the heavens and the earth has revealed it) i.e. He sent Gabriel with the Qur'an. (Lo! He ever is Forgiving) He forgives those who repent among them, (Merciful) He shows mercy towards those who die in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل بعما سمعت مقالهم، وتفرست حالهم في العتو وأنواع الإنكار والفساد: { أَنزَلَهُ } أي: الفرقان عليَّ مع أني أمي كما اعترفتم، لا قدرة لي على الإملاء فكيف على الإنشاء العليم؟! { ٱلَّذِي يَعْلَمُ } بعلمه الحضوري { ٱلسِّرَّ } المكنون والحكمة الكامنة { فِي } أشكال { ٱلسَّمَاوَاتِ وَ } أقطار { ٱلأَرْضِ } ولهذا أعجزكم بكلامه هذا عن آخركم مع أنكم من ذوي اللسن والفصاحة، وأعلى طلبقات البلاغة والبراعة، فعجزتم عن معارضته؛ ومع ذلك ما تستحيون أيها المسرفون المفرطون نسبتم إليه ما هو بريء عنه، بنسبتكم هذه استوجبتم العذاب والعقاب عاجلاً وآجلاً، إلا أنه سبحانه أمهلكم رجاء أن تتنبهوا بسوء صنيعكم هذا، فترجعوا إليه سبحانه تائبين نامين، فيغفر لكم ما تقدم من ذنوبكم، ويرحمكم بقبول توبتكم { إِنَّهُ } سبحانه في ذاته { كَانَ غَفُوراً }  للأوابين التوابين { رَّحِيماً } [الفرقان: 6] للمتندمين المخلصين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل } يا محمد: { أنزله الذي يعلم السرَّ في السمواتِ والأرضِ } أي: يعلم كل سر خفي في السماوات والأرض، يعني: أن القرآن، لما اشتمل على علم الغيوب، التي يستحيل عادة أن يعلمها محمد صلى الله عليه وسلم من غير تعلم إلهي، دلَّ على أنه من عند علام الغيوب، أي: ليس ذلك مما يُفْتَرَى ويختلق، بإعانة قوم، وكتابة آخرين من الاحاديث والأساطير المتقدمة، بل هو أمر سماوي، أنزله الذي لا يعزب عن علمه شيء، أودع فيه فنون الحِكَم والأحكام، على وجه بديع، لا تحوم حوله الأفهام، حيث أعجزكم قاطبة بفصاحته وبلاغته، وأخبركم بأمور مغيبات، وأسرار مكنونات، لا يهتدي إليها ولا يوقف عليها إلا بتوقيف العليم الخبير، ثم جعلتموه إفكاً مفترى، واستوجبتم بذلك أن يصبَّ عليكم العذاب صباً، لولا حِلمه ورحمته، { إنه كان غفوراً رحيماً } فأمهلكم، ولم يعاجلكم بالعقوبة\n\n\nوهو تعليل لما هو المشاهد من تأخير العقوبة عنهم، أي: كان أزلاً وأبداً مستمراً على المغفرة والرحمة، فلذلك لم يعاجلكم بالعقوبة على ما تقولون في حقه وفي حق رسوله، مع كمال اقتداره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:13",
      "similarity": 0.6373871500155252
    },
    {
      "verse": "37:44",
      "similarity": 0.6326133516075266
    },
    {
      "verse": "84:9",
      "similarity": 0.54811980200461
    },
    {
      "verse": "86:9",
      "similarity": 0.4689223699131011
    },
    {
      "verse": "9:78",
      "similarity": 0.46411689939227124
    }
  ]
}