{
  "chapter": "الفرقان",
  "text": "وهو الذى جعل اليل والنهار خلفة لمن اراد ان يذكر او اراد شكورا",
  "translations": [
    {
      "translation": "It is He who made night and day succeed each other for those who want to pay heed or to give thanks.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the night and day an alternation for him who cares to reflect and be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who caused the night and the day to succeed each other so that everyone who desires may learn a lesson or become grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made the night and the day, one proceeding the other, for whoever wants to take heed or give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who created the alternation of the night and day for one who wishes to remember or intends to give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has put the night and the day in succession (Khilfatan), for such who desires to remember or desires to show his gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who made the night and the day to follow each other for him who desires to be mindful or desires to be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who made the night and day a succession for whom He desires to remember or He desires to be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who hath appointed night and day in succession, for him who desireth to remember, or desireth thankfulness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is He who has made night and day succeed each other, a sign for those who would take heed and would be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who hath appointed the night and the day a succession, for him who desireth to consider or desireth to be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the night and the day alternate for someone who desires to take admonition, or desires to give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who made the Night and the Day to follow each other: for such as have the will to celebrate His praises or to show their gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has put the night and the day in succession, for such who desires to remember or desires to show his gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made the night and day follow each other for those whom He desires to remember or He desires to be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who made the night and the day alternate—for whoever desires to reflect, or desires to show gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who has made the night and the day in succession for whoever desires to remember or desires gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:62] And He it is Who made the night and day [to appear] in succession, that is, one succeeding the other, for him who desires to remember (read yadhdhakkara or yadhkura, as before [Q. 25:50]) — so that if he misses [the opportunity to do] some good during the one, he can do it during the other; or desires to be thankful, for the graces of his Lord to him during both [of these periods].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَهُوَ الَّذِي جَعَلَ اللَّيْلَ وَالنَّهَارَ خِلْفَةً لِمَنْ أَرَادَ أَنْ يَذَّكَّرَ أَوْ أَرَادَ شُكُورًا (62)الاستدلال هذا بما في الليل والنّهار من اختلاف الحال بين ظلمة ونور ، وبرد وحر ، مما يكون بعضه أليق ببعض الناس من بعض ببعض آخر ، وهذا مخالف للاستدلال الذي في قوله { وهو الذي جعل لكم الليل لباساً والنوم سباتاً وجعل النهار نشوراً } \\[ الفرقان : 47 \\] ، فهذه دلالة أخرى ونعمة أخرى والحِكَم في المخلوقات كثيرة .والقصر هنا قصر حقيقي وليس إضافياً فلذلك لا يراد به الرد على المشركين بخلاف صيغ القصر السابقة من قوله { وهو الذي جعل لكم الليل لباساً إلى قوله وكان ربك قديراً } \\[ الفرقان : 47 54 \\] .والخِلفة بكسر الخاء وسكون اللام : اسم لما يَخلف غيره في بعض ما يصلح له . صيغ هذا الاسم على زنة فِعْلة لأنه في الأصل ذو خلفة ، أي صاحب حالة خلف فيها غيره ثم شاع استعماله فصار اسماً ، قال زهير :بها العين والآرام يَمشِينَ خِلفَةً ... وأطلاؤها ينهَضْن من كل مُجْثَمأي يمشي سرب ويخلفه سرب آخر ثم يتعاقب هكذا . فالمعنى : جعل الليل خلفة والنهارَ خلفة : أي كلَّ واحد منهما خِلفة عن الآخر ، أي فيما يعمل فيها من التدبر في أدلة العقيدة والتعبد والتذكر .واللام في { لمن أراد أن يذكر } لام التعليل وهي متعلقة ب { جعل } ، فأفاد ذلك أن هذا الجعل نافع من أراد أن يذّكر أو أراد شُكوراً .والتذكر : تفعّل من الذِكر ، أي تكلف الذكر . والذكر جاء في القرآن بمعنى التأمل في أدلة الدين ، وجاء بمعنى : تذكر فائت أو منسي ، ويجمع المعنيين استظهار ما احتجب عن الفكر .والشكور : بضم الشين مصدر مرادف الشكر ، والشكر : عرفانُ إحسان المحسن . والمراد به هنا العبادة لأنها شكر لله تعالى .فتفيد الآية معنى : لينظرَ في اختلافهما المتفكر فيعلم أن لا بدّ لانتقالهما من حال إلى حال مؤثر حكيم فيستدل بذلك على توحيد الخالق ويعلم أنه عظيم القدرة فيوقن بأنه لا يستحق غيره الإلهية ، وليشكر الشاكر على ما في اختلاف الليل والنهار من نعم عظيمة منها ما ذكر في قوله تعالى : { وهو الذي جعل لكم الليل لباساً والنوم سباتاً وجعل النهار نشوراً } \\[ الفرقان : 47 \\] فيكثر الشاكرون على اختلاف أحوالهم ومناسباتهم ، وتفيد معنى : ليتداركَ الناسِي ما فاته في الليل بسبب غلبة النوم أو التعب فيقضيَه في النهار أو ما شغله عنه شواغل العمل في النهار فيقضيه بالليل عند التفرغ فلا يرزؤه ذلك ثواب أعماله . روي أن عمر بن الخطاب أطال صلاة الضحى يوماً فقيل له : صنعت شيئاً لم تكن تصنعه؟ فقال : إنه بَقي عليَّ من وردي شيء فأحببت أن أقضيه وتلا قوله تعالى : { وهو الذي جعل الليل والنهار خلفة } الآية . ولمن أراد أن يتقرب إلى الله شكراً له بصلاة أو صيام فيكون الليل أسعد ببعض ذلك والنهار أسعد ببعض ، فهذا مفاد عظيم في إيجاز بديع .وجيء في جانب المتذكرين بقوله { أن يذكر } لدلالة المضارع على التجدد . واقتصر في جانب الشاكرين على المصدر بقوله { أو أراد شكوراً } لأن الشكر يحصل دفعة . ولأجل الاختلاف بين النظمين أعيد فعل { أراد } إذ لا يلتئم عطف { شكوراً } على { أن يذكر } .وقرأ الجمهور { أن يذَّكر } بتشديد الذال مفتوحة ، وأصله : يتذكر فأدغمت التاء في الذال لتقاربهما . وقرأ حمزة وخلف { أن يَذْكُر } بسكون الذال وضم الكاف وهو بمعنى المشدّد إلاّ أن المشدّد أشدّ عملاً ، وكِلا العملين يستدركان في الليل والنهار .\n\n",
      "translations": [
        {
          "translation": "(And He it is Who hath appointed night and day in succession) to each other, (for him who desireth to remember) to take admonition in their succession, (or desireth thankfulness) or desires to do righteous works, whatever he left undone at night he does it during the day, and whatever he left undone during the day he does it at night.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُوَ ٱلَّذِي جَعَلَ ٱلَّيلَ وَٱلنَّهَارَ خِلْفَةً } معناه يَجيءُ اللّيلُ بعدَ النَّهارِ، ويجيُ النَّهارُ بعدَ اللّيلِ، يَخلفُ هَذا هذا، ويَخلف هذا هذا\n معناه إن فاتكَ عَملُ النَّهارِ فَفَكرتَهُ بالليلِ فَعملتَهُ أجزاكَ\n وقال: الخِلفةُ: هي الأبيضُ والأسودُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He is the one who made the night and the day succeed each other\" means that the night comes after the day and the day comes after the night, one succeeding the other.\n\n\nThis means that if you miss an opportunity during the day, you can make up for it at night.\n And he said: \"The Khilafah is the white and the black.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ليكون مرصداً وميقاتاً { لِّمَنْ أَرَادَ أَن يَذَّكَّرَ } ويتذكر آلاء الله المتوالية المتتالية عليه\n الفائضة من عنده على تعاقب الأوقات والساعات { أَوْ أَرَادَ شُكُوراً } [الفرقان: 62] أي: أراد يشكر على نعمائه الواصلة إليه في خلالهما",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فإن الله تعالى جعل الليل والنهار خلفة { لمن أراد أن يذَّكَّر }\n هـ\n أي: يتذكر آلاء الله - عز وجل -\n ويتفكر في بدائع صنعه فيعلم أنه لا بد له من صانع حكيم\n وقرأ حمزة وخلف: \" يَذْكُرَ \" أي: يذكر الله في قضاء ما فاته في أحدهما\n { أو أراد شكوراً } أي: شكر نعمة ربه عليه فيهما\n فيجتهد في عمارتهما بالطاعة شكراً\n وبالله التوفيق\n الإشارة: تبارك الذي جعل في سماء القلوب أو الأرواح بروجاً منازل ينزلها السائر\n ثم يرحل عنها\n وهي مقامات اليقين كالخوف\n والرجاء\n والورع\n والزهد\n والصبر\n والشكر\n والرضا\n والتسليم\n والمحبة\n والمراقبة\n والمشاهدة\n والمعاينة\n وجعل فيها سراجاً\n أي: شمس العرفان لأهل الإحسان\n وقمراً منيراً\n وهو توحيد البرهان لأهل الإيمان\n وهو الذي جعل ليل القبض ونهار البسط خِلْفةً\n يخلف أحدهما الآخر\n لمن أراد أن يذكر في ليل القبض\n ويشكر في نهار البسط\n والله تعالى أعلم\n ثم ذكر أهل الذكر والشكر\n فقال: { وَعِبَادُ ٱلرَّحْمَـٰنِ ٱلَّذِينَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:6",
      "similarity": 0.5273151900748883
    },
    {
      "verse": "28:73",
      "similarity": 0.5179183090471088
    },
    {
      "verse": "40:61",
      "similarity": 0.48619686632587544
    },
    {
      "verse": "23:80",
      "similarity": 0.47057209942250205
    },
    {
      "verse": "71:5",
      "similarity": 0.4453770863554828
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/025062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/025062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}