{
  "chapter": "الفرقان",
  "text": "واذا قيل لهم اسجدوا۟ للرحمن قالوا۟ وما الرحمن انسجد لما تامرنا وزادهم نفورا",
  "translations": [
    {
      "translation": "When they are told to prostrate to the All-Merciful, they say, 'And what is the All-Merciful? Are we to prostrate to something you command us to?' And it merely makes them run away all the more.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you say to them: \"Bow before Ar-Rahman,\" they say: \"What is Ar-Rahman? Should we adore whoever you ask us to?\" And their aversion increases further.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them. \"Prostrate yourselves before the Merciful,\" they retort, \"What is the Merciful? Would you have us prostrate ourselves before whomsoever you will?\" And this invitation only helps to increase their hatred all the more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told to prostrate themselves before the Beneficent God, they say, \"Who is the Beneficent God? Why should we prostrate ourselves before the one whom you have commanded us to?\" This only increases their rebelliousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Prostrate to the Most Gracious” – they say, “And what is the Most Gracious? Shall we prostrate to whatever you command us?” And this command only increases the hatred in them. (Command of Prostration # 7)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Prostrate yourselves to Ar-Rahman!\" They say: \"And what is Ar-Rahman Shall we fall down in prostration to that which you command us\" And it increases in them only aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: Prostrate to the Beneficent Allah, they say: And what is the Allah of beneficence? Shall we prostrate to what you bid us? And it adds to their aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they are told, 'Bow yourselves to the All-merciful,' they say, 'And what is the All-merciful? Shall we bow ourselves to what thou biddest us?' And it increases them in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: Prostrate to the Beneficent! they say: And what is the Beneficent? Are we to prostrate to whatever thou (Muhammad) biddest us? And it increaseth aversion in them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"Prostrate yourselves before the Gracious One,\" they ask, \"Who is this Gracious One? Shall we prostrate ourselves before whatever you will?\" This increases their aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: prostrate yourselves unto the Compassionate, they say: and what is the Compassionate? Shall we prostrate ourselves unto that which thou commandest us? And it increaseth in them aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told: ‘Prostrate yourselves before the All-beneficent,’ they say, ‘What is ‘‘the All-beneficent’’? Shall we prostrate ourselves before whatever you bid us?’ And it increases their aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them, \"Prostrate to (Allah) Most Gracious!\", they say, \"And what is (Allah) Most Gracious? Shall we prostrate to that which thou commandest us?\" And it increases their flight (from the Truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Prostrate to the Most Beneficent (Allah)! They say: \"And what is the Most Beneficent? Shall we fall down in prostration to that which you (O Muhammad SAW) command us?\" And it increases in them only aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Prostrate yourselves before the Merciful', they ask: 'And what is the Merciful? Shall we prostrate ourselves to whatever you bid us' And it increases their aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Bow down to the Merciful,” they say, “And what is the Merciful? Are we to bow down to whatever you command us?” And it increases their aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Prostrate to the Most Merciful,\" they say, \"And what is the Most Merciful? Should we prostrate to that which you order us?\" And it increases them in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:60] And when it is said to them, to the disbelievers of Mecca, ‘Prostrate yourselves before the Compassionate One’, they say, ‘And what is the Compassionate One? Should we prostrate ourselves to whatever you bid us’ (ta’murunā; or read ya’murunā, ‘[whatever] he bids us’) — [in both cases] the one bidding is Muhammad (s) — when we do not know who He is? No! And it, this that is said to them, increases their aversion, to faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when it is said unto them) to the people of Mecca: (Adore the Beneficent) submit to the Beneficent through the profession of Allah's divine Oneness! (they say: And what is the Beneficent) we do not know anyone with this name except Musaylimah the liar? (Are we to adore whatever thou (Muhammad) biddest us) a manifest lie? (And it) i.e. the mention of the Beneficent; and it is said: the mention of the Qur'an; and it is said the call of the Prophet (pbuh) (increaseth aversion in them) from faith.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وإذا قيل لهم اسجدوا } أي: إذا أمرتهم بالفناء في جميع صفاته وطاعته بها أنكروا ولم يمتثلوا أمرك لقصور استعدادهم عن قبول هذا الفيض وعدم معرفتهم لهذا الاسم لعدم احتظائهم من جميع الصفات أو وجود احتجابهم عنها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مع ظهور استيلاء الحق وانبساطه على عروش ذرائر الأكوان { إِذَا قِيلَ لَهُمُ } على سبيل الإيقاظ عن نعاس النسيان\n والتنبيه عن نومة الحرمان: { ٱسْجُدُواْ لِلرَّحْمَـٰنِ } المظهر لكم من كتم العدم بسعة رحمته وجوده { قَالُواْ } منكرين له مع كمال ظهوره مستفهمين على سبيل الاستغراب والاستعباد: { وَمَا ٱلرَّحْمَـٰنُ } الذي تدعوننا إلى سجوده؟ أتوا بالسؤال بلفظة (ما) من كمال نكارته عندهم وشدة إنكارهم عليه\n قائلين: { أَنَسْجُدُ لِمَا تَأْمُرُنَا } أي: لكل شيء تأمرنا بسجوده أنت من تلقاء نفسك { وَزَادَهُمْ نُفُوراً } [الفرقان: 60] أي: ما زاد دعوتك إياهم وإرشادك لهم إلا نفوراً عن الحق و طريق توحيده\n لخبث طينتهم وشدة شكيمتهم\n وكمال غيهم وقسوتهم\n\n\nوكيف تنفرون وتنصرفون هؤلاء الجاهلون الغافلون عن سجوده سبحانه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِذا قيل لهم } أي: إذا قال محمد للمشركين: { اسجدوا للرحمن } صَلّوا له\n أو: اخضعوا\n { قالوا وما الرحمنُ } أي: لا نعرف الرحمن فنسجد له\n قالوا ذلك: إما لأنهم ما كانوا يطلقونه على الله تعالى\n أو لأنهم ظنوا أن المراد به غيره تعالى\n { أنسجُدُ لما تأمرنا } أي: للذي تأمرنا بالسجود له\n أو لأمرك بالسجود له من غير علم منا به\n وهو منهم عناد لأن معناه في اللغة: ذو الرحمة التي لا غاية لها لأن فَعْلاَنَ يدل على المبالغة\n وهم من أهل اللغة\n { وزادهم نُفُوراً } أي: زادهم الأمر بالسجود للرحمن تباعداً عن الإيمان ونفوراً عنه\n وبالله التوفيق\n الإشارة: قد تقدم الكلام على التوكل في مواضع\n وللقشيري هنا كلام\n وملخصه باختصار: أن التوكل: تفويضُ الأمر إلى الله سبحانه\n وأصله: عِلْمُ العبدِ بأنَّ الحادثاتِ كلّها حاصِلةٌ من الله\n ولا يقدر أحدٌ على إيجاد شيء أو دفعه\n فإذا عَرَفَ العبدُ هذا\n وعلم أن مراد الله لا يرتفع ولا يدفع\n حصل له التوكل\n\nوهذا القدر فرض\n وهو من شرائط الإيمان\n قال الله تعالى:\n[المائدة: 23]\n وما زاد على هذا القَدْرِ من سكون القلب\n وطمأنينته\n وزوال الانزعاج والاضطراب\n فهو من أحوال التوكل ومقاماته فالناس في الاكتفاء والسكون على أقسام ودرجات\n فأول رتبة فيه: أن يكتفي بما في يده\n ولا يطلب الزيادة عليه\n ويستريح قلبه من طلب الزيادة\n وتسمى هذه الحالة: القناعة\n فيقنع بالحاصل\n ولا يستزيد ما ليس بحاصل - يعني: مع وجود الأسباب - ثم بعد هذا سكون القلب في حال عَدَمِ الأسباب\n وهو مقام التجريد\n وهم متباينون في الرتبة: واحد يكتفي بوعده\n لأنه صَدَّقَهَ في ضمانه\n فسكن قلبه عند فقد الأسباب ثقةً منه بوعد ربه\n وقد قيل: إن التوكل: سكون القلب بضمان الربِّ\n ويقال: سكون الجأش في طلب المعاش\n ويقال: الاكتفاء بوعده عند عدم نَقْدِه\n وألطف من هذا أن يكتفي بِعلْمِ الله\n فيشتغل بمولاه\n ولا يلتفت إلى إنجاز وعد ولا ضمان\n فيكِلُ أمره إلى الله\n وهذه حالة التسليم\n وفوق هذه: التفويض\n وهو أن يَكِلَ أمرَه إليه\n ولا يختار حالاً على حال\n فيشتغل بمولاه ويغيب عن نفسه وعن كل ما سواه\n يعلم أنه مملوكٌ لسيِّده\n والسيَّدُ أولى من العبد بنفسه\n فإذا ارتقى عن هذه الحالة وَجَدَ الراحة في المنْع\n ويستعذب ما يستقبله من الرَّدِّ\n فهي رتبة الرضا\n ويحصل له في هذه الحالة\n من فوائد الرضا ومطالعته\n ما لا يحصل لمن دونه من الحلاوة في وجود المقصود\n وبعد هذا: الموافقة وهو ألا يجد الراحة في المنع ولا في العطاء\n وإنما يجد حلاوة نسيم القُرب\n وزوائد الأنس بنسيان كل أرَبٍ\n فكما أن حلاوة الطاعات تتصاغر عند بَرْدٍ الرضا - ويعدُّون ذلك حجاباً - كذلك أهل الأُنْسِ بالله يَعدُّون الوقوف مع حلاوة الرضا والاشتغال بلطائفه نقصاناً وحجاباً\n ثم بعد هذا استيلاءُ سلطان الحقيقة\n بما يأخذ العبد عن جملته بالكلية\n فيُعبر عن هذه الحالة بالخمود\n والاستهلاك\n والوجود\n والاصطلام\n والفناء - وهذا هو عين التوحيد الخاص - فعند ذلك لا أنس\n ولا هيبة\n ولا لذة\n ولا راحة\n ولا وحشة\n ولا آفة\n يعني: غيب المقامات بلذاتها وراحتها\n عند تحقق الفناء\n ثم قال: هذا بيان ترتيبهم\n فأمّا ما دون ذلك فالإخبار عن أحوال المتوكلين\n على تباين شرفهم\n يختلف على حسب اختلاف حالهم\n انتهى بالمعنى\n وقال أيضاً: ويقال: التوكل في الأسباب الدنيوية ينتهي إلى حدّ\n وأما التوكل على الله في إصلاح آخرته: فهو أشدُّ غموضاً وأكثرُ خفاء\n فالواجب\n في الأسباب الدنيوية\n أن يكون السكونُ عند طلبها غالباً\n والحركةُ تكون ضرورةً\n وأما في أمر الآخرةِ وما يتعلق بالطاعةِ\n فالواجبُ البِدار والجدُّ والانكماشُ\n والخروجُ عن أوطان الكسل\n وترك الجنوح إلى الفشل\n\nوالذي يوصف بالتواني في العبادات والتباطؤِ في تلافي ما ضيَّعَه من إرضاء الخصوم\n والقيام بحقِّ الواجبات\n ثم يعتقد في نفسه أنه متوكِّلٌ على الله\n فهو متمن معلول الحال\n ممكورٌ مُسْتَدْرَج\n بل يجب أن يبذل جهدَه\n ويستفرغ وسعَه\n ثم بعد ذلك لا يعتمد على طاعته\n ولا يستند إلى سكونه وحركته\n ويتبرأ من حَوْلِه وقوَّتِه\n ثم يُحسن الظنّ بربِّه\n ومع حُسْنِ ظنه بِرَبِّه لا ينبغي أن يخلوَ من مخافته\n اللهم إلا أن يَغْلِبَ على قلبه ما يشغله في الحال من كشوفات الحقائق عن الفكرة في العواقب فإن ذلك - إذا حَصَلَ - فالوقت غالبٌ\n وهو أحد ما قيل في قولهم: الوقت سيف\n هـ\n ثم ذكر أوصاف الرحمن الذي نفر المشركون عن الخضوع له ما يبيّن عظمته وكبريائه ونفوذ قدرته المستوجبة للخضوع والانقياد له رداً على امتناع الكفرة منه فقال: { تَبَارَكَ ٱلَّذِي جَعَلَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:41",
      "similarity": 0.6571045970440575
    },
    {
      "verse": "35:42",
      "similarity": 0.5096584432373898
    },
    {
      "verse": "9:39",
      "similarity": 0.5033585302055388
    },
    {
      "verse": "72:1",
      "similarity": 0.5008103701312662
    },
    {
      "verse": "9:38",
      "similarity": 0.4607358340683567
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/25:60.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/25:60.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:60.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}