{
  "chapter": "الفرقان",
  "text": "والذين لا يدعون مع الله الها ءاخر ولا يقتلون النفس التى حرم الله الا بالحق ولا يزنون ومن يفعل ذلك يلق اثاما",
  "translations": [
    {
      "translation": "Who do not invoke any god apart from God, who do not take a life which God has forbidden except for a cause that is just, and do not fornicate -- and any one who does so will be punished for the crime,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who do not invoke any god but Allah nor kill a soul, which Allah has forbidden, unjustly, nor commit adultery. -He who does this shall be punished for his sin,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who do not worship idols besides God, nor without a just cause murder a soul to whom God has granted amnesty, who do not commit fornication, for those who do so have committed a sin\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who do not worship any other deity along with Allah, and do not unjustly kill any living thing which Allah has forbidden, nor commit adultery; and whoever does this will receive punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who invoke not any other god along with Allah, nor kill such person as Allah has forbidden, except for just cause, nor commit illegal sexual intercourse -- and whoever does this shall receive Athama.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they who do not call upon another god with Allah and do not slay the soul, which Allah has forbidden except in the requirements of justice, and (who) do not commit fornication and he who does this shall find a requital of sin;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who call not upon another god with God, nor slay the soul God has forbidden except by right, neither fornicate, for whosoever does that shall meet the price\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who cry not unto any other god along with Allah, nor take the life which Allah hath forbidden save in (course of) justice, nor commit adultery - and whoso doeth this shall pay the penalty;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who never invoke any other deity besides God, nor take a life which God has made sacred, except with the right to do so, nor commit adultery. Anyone who does that shall face punishment:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who call not unto anot her god along with Allah and slay not any soul which Allah hath forbidden, save in justification, and commit not fornication. And Whosoever shall do this, Shall incur the meed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not invoke another deity besides Allah, and do not kill a soul [whose life] Allah has made inviolable, except with due cause, and do not commit fornication. (Whoever does that shall encounter its retribution,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who invoke not, with Allah, any other god, nor slay such life as Allah has made sacred except for just cause, nor commit fornication; - and any that does this (not only) meets punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who invoke not any other ilah (god) along with Allah, nor kill such life as Allah has forbidden, except for just cause, nor commit illegal sexual intercourse and whoever does this shall receive the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who do not call upon another god with Allah, nor slay the soul which Allah has forbidden except by right; who do not fornicate, for he who does this shall face punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who do not implore besides God any other god, and do not kill the soul which God has made sacred—except in the pursuit of justice—and do not commit adultery. Whoever does that will face penalties.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who do not invoke with Allah another deity or kill the soul which Allah has forbidden [to be killed], except by right, and do not commit unlawful sexual intercourse. And whoever should do that will meet a penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:68] and [those] who do not call on another god along with God, nor slay the soul which God has forbidden, that it be slain, except with due cause, and who do not commit fornication — for whoever does that, namely, [whoever does] one of these three things, shall meet with retribution;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who cry not unto) worship not (any other god along with Allah) among the idols, (nor take the life which Allah hath forbidden) to kill nor declare it lawful to be killed (save in (course of) justice) through stoning, retaliation or apostasy, (nor commit adultery) nor deem adultery lawful (and whoso doeth this) i.e. deem it lawful (shall pay the penalty) a valley in the Fire; and it is said: a well in the Fire;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَن يَفْعَلْ ذٰلِكَ يَلْقَ أَثَاماً } والآثامُ: وادٍ في جَهنَّمَ والآثامُ: الجَزاءُ\n والآثامُ: العِقابُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: هم الموحدون { ٱلَّذِينَ لاَ يَدْعُونَ مَعَ ٱللَّهِ } الواحد الأحد، المستقل بالألوهية والربوبية { إِلَـٰهًا آخَرَ } يستحق للعبودية مثله { وَ } من جملة خصائلهم الحميدة: إنهم { لاَ يَقْتُلُونَ } بحال من الأحوال { ٱلنَّفْسَ ٱلَّتِي حَرَّمَ ٱللَّهُ } الحكيم المتقن في أفعاله وأحكامه قتلها؛ إذ كل نفس من النفوس البشرية إنما وضعت وبنيت بيتاً لله،، مهبطاً معه ولوحيه وإلهامه، محلاً لحلول سلطان وحدته الذاتية ومجلى لظهور أسمائه الحسنى وصفاته العليا العظمى الكاملة، فلا يصح هدم بيته وتخريب بنائه { إِلاَّ بِٱلْحَقِّ } أي: بالرخصة الشرعية الموضوعة بوضع الله سبحانه حدّاً وقصاصاً\n\n\n\n\n{ وَ } من جملة أخلاقهم الحميدة: إنهم { لاَ يَزْنُونَ } عدواناً وعدولاً عن مقتضى الحد الشرعي و الوضع الإلهي في حفظ النسب عن اختلاط النطف؛ إذ هي من أخس المحرمات وأفحش المحظورات؛ لذلك عقَّبه سبحانه بالوعيد الهائل، فقال: { وَمَن يَفْعَلْ ذٰلِكَ } أي: الزنا التي هي الفعلة الشنيعة، والديدنة القبيحة المتناهية في القبح والشناعة المستكرهة عند الطباع السليمة، المسقطة للمروءة والعدالة { يَلْقَ } يوم الجزاء { أَثَاماً } [الفرقان: 68] أي: جزاء مسمى بالأثام مبالغةً وتأكيداً، كأن اسم الإثم موضوع له حقيقةً وهي جامع لجميع ما يطلق عليه اسم الإثم ادعاءً لذلك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والذين لا يدعون مع الله إلهاً آخر } أي: لا يشركون بالله شيئاً، { ولا يقتلون النفسَ التي حرَّم الله } قتلها { إلا بالحق } بقَوَدٍ، أو رَجْمٍ، أو شِرْكٍ، أو سعي في الأرض بالفساد، { ولا يزنون } أي: لا يفعلون من هذه العظائم القبيحة التي جمعهن الكفرة شيئاً، حيث كانوا مع إشراكهم به - سبحانه - مداومين على قتل النفوس المحرمة، التي من جملتها المؤودة، مُنْكَبِّينَ على الزنا، لا يرعوون عنه أصلاً، فنفَى هذه الكبائر عن عباده الصالحين تعريضاً بما كان عليه أعداؤهم من قريش وغيره، كأنه قيل: والذين طهرهم الله مما أنتم عليه\n وعن ابن مسعود رضي الله عنه:\n\n \" قُلْتُ: يا رَسُولَ الله، أيُّ الذَّنْبِ أعْظَمُ؟ قال: أنْ تَجْعَلَ لله نداً وَهُوَ خَلَقَكَ، قلت: ثُمَّ أيُّ؟ قال: أنْ تَقْتلَ وَلَدَكَ خَشْيَةَ أنْ يُطْعَمَ مَعَكَ، قُلْتُ: ثمَّ أيُّ؟ قال: أنْ تُزَانِي بحَلِيلَة جَارِكَ \" \n\nفنزلت الآية تصديقاً لذلك\n الإشارة: قد تضمنت الآية أربعة أصناف من الناس على سبيل التدلي الأول: الأولياء العارفون بالله، أهل التربية النبوية، ومن تعلق بهم من أهل التهذيب والتأديب، وإليهم أشار بقوله: { وعباد الرحمن\n\n } إلخ، وفيهم قال النبي صلى الله عليه وسلم:\n\n \" رأيت أقواماً من أمتي، ما خُلقوا بعد، وسيكونون فيما بعد اليوم، أُحبهم ويحبونني، ويتناصحون ويتباذلون، ويمشون بنور الله في الناس رويداً، في خفية وتقى، يَسلمون من الناس، ويسلم الناسُ منهم بصبرهم وحلمهم، قلوبهم بذلك إليه يَرْجِعُون، ومساجدهم بصلاتهم يعمرون، يرحمون ضعيفهم، ويجلون كبيرهم، ويتواسَوْن بينهم، يعود غنيهُم على فقيرهم، وقويُهم على ضعيفهم، يعودون مرضاهم، ويشهدون جنائزهم \" \n\nفقال رجل من القوم: يرفقون برقيقهم؟ فالتفت إليه النبي صلى الله عليه وسلم فقال:\n\n \" كلا لا رقيق لهم، وهم خدام أنفسهم، هم أكرم على الله تعالى من أن يوسع عليهم لهوان الدنيا عند ربهم\n \" \n\nثم تلى النبي صلى الله عليه وسلم: { وعباد الرحمن الذين يمشون على الأرض هوناً\n\n\n\n\n } الآية\n رواه أبو برزة الأسلمي، عنه صلى الله عليه وسلم\n الثاني: العباد والزهاد أهل الجد والاجتهاد، أهل الصيام والقيام، الذين يبيتون لربهم سجداً وقياماً، أقامهم الحق تعالى لخدمته، كما أقام الأولين لمحبته ومعرفته\n الثالث: الصالحون والأبرار، الذين يعبدون الله طمعاً في الجنة وخوفاً من النار، ومن كان منهم له مال أنفقه في سبيل الله، من غير سرف ولا إقتار\n الرابع: عامة الموحدّين من أهل اليمين، المجتنبون لكبائر الذنوب، المسارعون بالتوبة إلى علام الغيوب\n والله تعالى أعلم\n ثم أشار إلى وبال من فعل شيئاً من ذلك ولم يتب، فقال: {\n\n\n وَمَن يَفْعَلْ ذٰلِكَ يَلْقَ أَثَاماً يُضَاعَفْ لَهُ ٱلْعَذَابُ يَوْمَ ٱلْقِيامَةِ وَيَخْلُدْ فِيهِ مُهَاناً إِلاَّ مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلاً صَالِحاً فَأُوْلَـٰئِكَ يُبَدِّلُ ٱللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ وَكَانَ ٱللَّهُ غَفُوراً رَّحِيماً وَمَن تَابَ وَعَمِلَ صَالِحاً فَإِنَّهُ يَتُوبُ إِلَى ٱللَّهِ مَتاباً }\n قلت: يُضاعفْ ويخلُدْ: بدل من يَلْقَ بدل كل من كل، عند الأزهري لأن لُقِيّ الآثام هي مضاعفة العذاب، وبدل اشتمال، عند المرادي\n ومن رفعهما: فعلى الاستئناف\n يقول الحق جل جلاله: { ومن يَفْعَلْ ذلك } أي: ما ذكر، كما هو دأب الكفرة المذكورين، { يَلْقَ } في الآخرة { أثاماً } وهو جزاء الآثام، كالوبال والنكال وزْناً ومعنى، { يُضاعَفْ له العذابُ يومَ القيامة } أضعافاً كثيرة، كما يضاعف للمؤمنين جزاء أعمالهم كذلك، { ويخْلُدْ فيه } أي: في ذلك العذاب المضاعف، { مهاناً } ذليلاً حقيراً، جامعاً للعذاب الجسماني والروحاني",
      "translations": []
    }
  ]
}