{
  "chapter": "الفرقان",
  "text": "تبارك الذى جعل فى السماء بروجا وجعل فيها سرجا وقمرا منيرا",
  "translations": [
    {
      "translation": "Blessed be He who placed constellations in the sky and put a blazing lamp and shining moon among them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who placed in the heavens constellations of stars, and placed a burning lamp in it and the luminous moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Highly blessed is He, Who has made fortified spheres in the heavens and has set in it a \"lamp\" and a shining moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who has established constellations in the sky and made therein a lamp and a shining moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most Auspicious is He Who created lofty towers in the sky and placed a lamp in it, and the luminous moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He Who has placed in the heaven Al-Buruj, and has placed therein a great lamp, and a moon giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He Who made the constellations in the heavens and made therein a lamp and a shining moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He who has set in heaven constellations, and has set among them a lamp, and an illuminating moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He Who hath placed in the heaven mansions of the stars, and hath placed therein a great lamp and a moon giving light!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is He who put constellations in the heavens, a radiant lamp and an illuminating moon --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blest be He Who hath placed big stars in the heaven, and hath placed therein a lamp and a moon enlightening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who appointed houses in the sky and set in it a lamp and a shining moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He Who made constellations in the skies, and placed therein a Lamp and a Moon giving light;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He Who has placed in the heaven big stars, and has placed therein a great lamp (sun), and a moon giving light.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He who has set the constellations in the heaven, and set amongst them a sun, and an illuminating moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who placed constellations in the sky, and placed in it a lamp, and an illuminating moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He who has placed in the sky great stars and placed therein a [burning] lamp and luminous moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:61] God, exalted be He, says: Blessed, magnified, is He Who has placed in the heaven constellations, twelve [of them]: Aries, Taurus, Gemini, Cancer, Leo, Virgo (al-sunbula), Libra, Scorpio, Sagittarius, Capricorn, Aquarius and Pisces. They are the mansions for the seven orbiting planets: Mars rules Aries and Scorpio, Venus: Taurus and Libra, Mercury: Gemini and Virgo, the Moon: Cancer, the Sun: Leo, Jupiter: Sagittarius and Pisces, and Saturn: Capricorn and Aquarius; and has, also, placed in it a lamp, namely, the sun, and a shining moon (a variant reading [for sirājan, ‘sun’] has the plural surujan, which would mean ‘luminous stars’). The moon is singled out for mention because of its particular merit.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Blessed be He) He is the Possessor of grace He (Who hath placed in the heaven mansions of the stars) and it is said that this means: mansions, (and hath placed therein) in the heaven (a great lamp) the sun shining during the day for the children of Adam (and a moon giving light) to the Children of Adam during the night!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلَّذِي جَعَلَ فِي ٱلسَّمَآءِ بُرُوجاً } معناه قصورٌ فِي السَّماءِ فيها حَرسٌ\n وقال البُروجُ: النُّجومُ العظامُ\n\n\n\n\nوقوله تعالى: { وَجَعَلَ فِيهَا سِرَاجاً } معناه شمسٌ وضياءٌ\n وسِراجٌ: معناه نُجومٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {He who made in the heaven} means high towers in the heaven, in which there is a guard.\n\n\nAnd the stars said: \"The great stars.\"\n\n\nAnd His words, {And He made in it a lamp}, mean the sun and light.\n\n\nThe word \"wisrāj\" refers to stars.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف تنفرون وتنصرفون هؤلاء الجاهلون الغافلون عن سجوده سبحانه، مع أنه { تَبَارَكَ } وتعالى عن شأنه، عن أن ينصرف عنه وينفر منه أحد من عباده، مع كثرة خيراته وبركاته عليهم؛ لأنه { ٱلَّذِي جَعَلَ فِي ٱلسَّمَآءِ } أي: العلويات { بُرُوجاً } لتكون منازل للكواكب المدبرة للأمور الأرضية { وَ } بعدما هيأها سبحانه على أبلغ النظام { جَعَلَ فِيهَا سِرَاجاً } أي: شمساً دائرة من برج إلى برج { وَقَمَراً مُّنِيراً } [الفرقان: 61] منقلباً من منزل إلى منزل من المنازل المذكورة؛ ليحصل من دورها وانقلابها الفصول الأربعة المصلِحة لأحوال ما في السفليات من المواليد الثلاثة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { تبارك } أي: تعاظم { الذي جعل في السماء بُروجاً } وهي البروج الاثنا عشر: الحَمَل، والثور، والجوزاء، والسرطان، والأسد، والسنبلة، والميزان، والعقرب، والقوس، والجدي، والدلو، والحوت\n وهي منازل الكواكب السبعة السيارة، لكل كوكب بيتان، يقوي حاله فيهما، وللشمس بيت، وللقمر بيت، فالحمل والعقرب بيتا المريخ، والثور والميزان بيتا الزهرة، والجوزاء والسنبلة بيتا عطارد، والسرطان بيت القمر، والأسد بيت الشمس، والقوس والحوت بيتا المشتري، والجدي والدلو بيتا زُحل\n وهذه البروج مقسومة على الطبائع الأربع ليصيب كل واحدة منها ثلاثة بروج، فالحمل والأسد والقوس مثلثة نارية، والثور والسنبلة والجدي مثلثة أرضية، والجوزاء والميزان والدلو مثلثة هوائية، والسرطان والعقرب والحوت مثلثة مائية\n سميت بالبروج التي هي القصور العالية لأنها، لهذه الكواكب، كالمنازل الرفيعة لسكانها\n واعتبر بزيادة ابحر عند زيادة القمر ونقصه عند نقصه، فإن بيت القمر - وهو السرطان - مائي، وذلك من إمداد الأسماء لا بالطبع\n وتذكر: \" وبالاسم الذي وضعته على الليل فَأَظْلَمَ\n\n\n \" إلخ\n قاله في الحاشية\n واشتقاق البروج من التبرج، الذي هو الظهور لظهورها، ولذلك قال الحسن وقتادة ومجاهد: البروج: النجوم الكبار لظُهورها\n { وجعل فيها سِرَاجاً } أي: الشمس، لقوله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:16",
      "similarity": 0.7195245596467504
    },
    {
      "verse": "33:46",
      "similarity": 0.6602670648847416
    },
    {
      "verse": "85:1",
      "similarity": 0.5021673205295651
    },
    {
      "verse": "15:16",
      "similarity": 0.4906192670607748
    },
    {
      "verse": "33:33",
      "similarity": 0.33695747492094985
    }
  ]
}