{
  "chapter": "الفرقان",
  "text": "الا من تاب وءامن وعمل عملا صلحا فاو۟لئك يبدل الله سيـاتهم حسنت وكان الله غفورا رحيما",
  "translations": [
    {
      "translation": "except for those who make tawba and have iman and act rightly: Allah will transform the wrong actions of such people into good - Allah is Ever-Forgiving, Most Merciful -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and come to believe and do the right, for whom God will turn evil into goodness, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except the one who may have repented (after those sins) and have believed and done righteous works, for then Allah will change his evil deeds into good deeds, and He is very Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But only those who repent and believe and act righteously will have their sins replaced by virtue; God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except one who repents and accepts faith and does good deeds – so Allah will turn their evil deeds into virtues; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and believe, and do righteous deeds; for those, Allah will change their sins into good deeds, and Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except him who repents and believes and does a good deed; so these are they of whom Allah changes the evil deeds to good ones; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save him who repents, and believes, and does righteous work -- those, God will change their evil deeds into good deeds, for God is ever All-forgiving, All-compassionate;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save him who repenteth and believeth and doth righteous work; as for such, Allah will change their evil deeds to good deeds. Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except for those who repent and believe and do good deeds. God will change the evil deeds of such people into good ones: He is most forgiving and most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save him who repenteth and believeth and worketh righteous work. Then these! for them Allah shall change their vices into virtues. Verily Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who repent, attain faith, and act righteously. For such, Allah will replace their misdeeds with good deeds, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless he repents, believes, and works righteous deeds, for Allah will change the evil of such persons into good, and Allah is Oft-Forgiving, Most Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and believe (in Islamic Monotheism), and do righteous deeds, for those, Allah will change their sins into good deeds, and Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except he who repents and believes and does good works those, Allah will change their evil deeds into good deeds; Allah is ever Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent, and believe, and do good deeds. These—God will replace their bad deeds with good deeds. God is ever Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent, believe and do righteous work. For them Allah will replace their evil deeds with good. And ever is Allah Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:70] except for him who repents, and believes, and acts righteously, from among them, for such, God will replace their, mentioned, evil deeds with good deeds, in the Hereafter, for God is ever Forgiving, Merciful, that is, He is ever possessed of such attributes;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِلَّا مَنْ تَابَ وَآَمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا (70)الاستثناء من العموم الذي أفادته { مَن } الشرطية في قوله : { ومَن يفعل ذلك } \\[ الفرقان : 68 \\] . والتقدير : إلاّ مَن تاب فلا يضاعف له العذاب ولا يخلد فيه ، وهذا تطمين لنفوس فريق من المؤمنين الذين قد كانوا تلبسوا بخصال أهل الشرك ثم تابوا عنها بسبب توبتهم من الشرك ، وإلا فليس في دعوتهم مع الله إلهاً آخر بعد العنوان عنهم بأنهم عباد الرحمن ثناءٌ زائد .وفي «صحيح مسلم» : عن ابن عباس «أن ناساً من أهل الشرك قَتلوا فأكثروا وزَنَوا فأكثروا ، فأتوا محمداً صلى الله عليه وسلم فقالوا : إن الذي تقول وتدعو إليه لَحسن لو تخبرنا أن لما عملنا كفارةً فنزلت : { والذين لا يدعون مع الله إلهاً آخر } \\[ الفرقان : 68 \\] الآية ، والمعنى : أنه يعفى عنه من عذاب الذنوب التي تاب منها ، ولا يخطر بالبال أنه يعذب عذاباً غير مضاعف وغيرَ مخلَّد فيه ، لأن ذلك ليس من مجاري الاستعمال العربي بل الأصل في ارتفاع الشيء المقيَّد أن يقصد منه رفعه بأسره لا رفع قيوده ، إلاّ بقرينة .والتوبة : الإقلاع عن الذنب ، والندمُ على ما فرط ، والعزم على أن لا يعود إلى الذنب ، وإذْ كان فيما سَبق ذكرُ الشرك فالتوبة هنا التلبس بالإيمان ، والإيمان بعد الكفر يوجب عدم المؤاخدة كما اقترفه المشرك في مدة شركه كما في الحديث \" الإسلام يجُبّ ما قبله \" ، ولذلك فعطف { وآمن } على { من تاب } للتنويه بالإيمان ، وليبنى عليه قوله : { وعمل عملاً صالحاً } وهو شرائع الإسلام تحريضاً على الصالحات وإيماء إلى أنها لا يعتد بها إلا مع الإيمان كما قال تعالى في سورة البلد )17 ){ ثم كان من الذين آمنوا } ، وقال في عكسه { والذين كفروا أعمالهم كسراب بقيعة يحسبه الظمآن ماء حتى إذا جاءه لم يجده شيئاً } \\[ النور : 39 \\] .وقتل النفس الواقع في مدة الشرك يجبُّه إيمان القاتل لأجل مزية الإيمان ، والإسلام يجُبّ ما قبله بلا خلاف ، وإنما الخلاف الواقع بين السلف في صحة توبة القاتل إنما هو في المؤمن القاتل مؤمناً متعمداً . ولما كان مما تشمله هذه الآية لأن سياقها في الثناء على المؤمنين فقد دلت الآية على أن التوبة تمحو آثام كل ذنب من هذه الذنوب المعدودة ومنها قتل النفس بدون حقّ وهو المعروف من عمومات الكتاب والسنة . وقد تقدم ذلك مفصلاً في سورة النساء )93 )عند قوله تعالى : { ومَن يقتُل مؤمناً متعمّداً } الآية .وفُرع على الاستثناء الذين تابوا وآمنوا وعملوا عَملاً صالحاً أنهم يبدل الله سيئاتهم حسنات ، وهو كلام مسوق لبيان فضل التوبة المذكورة التي هي الإيمان بعد الشرك لأن من تاب } مستثنى مِن { مَنْ يَفْعَلْ ذلك } \\[ الفرقان : 68 \\] فتعيّن أن السيئات المضافة إليهم هي السيئات المعروفة ، أي التي تقدم ذكرها ، الواقعةُ منهم في زمن شركهم .والتبديل : جعل شيء بَدَلاً عن شيء آخر ، وتقدم عند قوله تعالى : { ثم بَدَّلْنا مكان السيئة الحسنة } في سورة الأعراف )95 )، أي يجعل الله لهم حسنات كثيرة عوضاً عن تلك السيئات التي اقترفوها قبل التوبة وهذا التبديل جاء مجملاً وهو تبديل يكون له أثر في الآخرة بأن يعوضهم عن جزاء السيئات ثوابَ حسنات أضدادِ تلك السيئات ، وهذا لفضل الإيمان بالنسبة للشرك ولفضل التوبة بالنسبة للآثام الصادرة من المسلمين .وبه يظهر موقع اسم الإشارة في قوله : فأولئك } المفيد التنبيه على أنهم أحرياء بما أخبر عنهم به بعد اسم الإشارة لأجل ما ذكر من الأوصاف قبل اسم الإشارة ، أي فأولئك التائبون المُؤمنون العاملون الصالحات في الإيمان يبدّل الله عقاب سيئاتهم التي اقترفوها من الشرك والقتل والزنا بثواب . ولم تتعرض الآية لمقدار الثواب وهو موكول إلى فضل الله ، ولذلك عُقب هذا بقوله : { وكان الله غفوراً رحيماً } المقتضي أنه عظيم المغفرة .\n\n",
      "translations": [
        {
          "translation": "Save him who repenteth) from his disbelief (and believeth) in Allah (and doth righteous work) sincerely after he accepts faith; (as for such, Allah will change their evil deeds to good deeds) Allah will change them from the state of disbelief to the state of faith, from disobedience to obedience, from the worship of idols to His worship, and from evil to goodness. (Allah is ever Forgiving) He forgives whoever repents, (Merciful) He shows mercy towards whoever dies in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأُوْلَـٰئِكَ يُبَدِّلُ ٱللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ } معناه يَجعلَ ذَلكَ فِي الدّنيا بالشّركِ إيماناً وإخلاصاً\n وبالسَّيءِ مَن العَملِ، الصَّالحَ منهُ\n وبالفجورِ عَفافاً وإحصاناً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"God will replace their bad deeds with good\" means that He will make that in this life, with faith and sincerity.\n {And} {in the bad} {of the work}, {the good} {from it}\n\n\nAnd with purity and chastity.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إلا من تاب } رجع إلى الله وتنصل عن المعاصي فبدّل الشرك بالإيمان واستبدل الرذائل بالفضائل { فأولئك يبدل الله سيئاتهم حسنات } بمحو الهيئات عن نفوسهم وإثبات هذه { وكان الله غفوراً } يستر صفات نفوسهم بنوره { رحيماً } يفيض عليهم الكمالات بوجوده\n وهذه هي التوبة الحقيقية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ مَن تَابَ } عما جرى عليه من سوء القضاء\n ورجع إلى الله نادماً عن فعله خائباً خاسراً\n مستحيياً من الله\n خائفاً عن بطشه\n مكذباً لنفسه\n معيراً عليها\n متأوهاً متحسراً عما صدر عنه { وَ } مع ذلك { آمَنَ } بتوحيد الله\n وأكَّد توبته بتجديد الإيمان المقارن بالإخلاص الصائن للمؤمنين عن ارتكاب المحظورات المنافية للإيمان\n وبالجملة: جدد إيمانه معتقداً أه حين صدر عنه لم يكن مؤمناً { وَ } مع التوبة وتجديد الإيمان { عَمِلَ عَمَلاً صَالِحاً } منبئاً عن إخلاصه في إيمانه وتوبته\n مشعراً على يقينه ومعرفته\n\n\n{ فَأُوْلَـٰئِكَ } السعداء التائبون الآيبون المقبولون\n هم الذين { يُبَدِّلُ ٱللَّهُ } الحكيم المصلح لأحوال عباده بعدما وقفهم على التوبة الخالصة والإنابة الصحيحة الوثيقة { سَيِّئَاتِهِمْ } التي أتوا بها قبل التوبة { حَسَنَاتٍ } بعدها\n بأن يمحو سبحانه بفضله معاصيهم المثبتة في صحائف أعمالهم قبل إنابتهم\n ويثبت بدلها حسنات بعدما { وَكَانَ ٱللَّهُ } المطلع لسرائر عباده وإخلاصهم { غَفُوراً } لهم\n متجاورزاً عن ذنوبهم وإن عظمت بعدما جاءوا بالتوبة الخالصة { رَّحِيماً } [الفرقان: 70] يقبل توبتهم ويغفو زلتهم\n\n\n{ وَ } بالجملة: { مَن تَابَ } ورجع إلى الله نادماً عما مضى عليه من المعاصي { وَعَمِلَ } عملاً { صَالِحاً } تلافياً لما فات من الطاعات والحسنات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا من تابَ } من الشرك\n { وآمن } بمحمد صلى الله عليه وسلم\n { وعَمِلَ عملاً صالحاً } بعد توبته { فأولئك يُبَدِّلُ الله سيئاتهم حسناتٍ } أي: يوفقهم للمحاسن بعد القبائح\n فيوفقهم للإيمان بعد الشرك\n ولقتل الكافر بعد قتل المؤمن\n وللعفة بعد الزنا\n أو: يمحوها بالتوبة\n ويثبت مكانها الحسنات\n ولم يُرد أن السيئة بعينها تصير حسنة\n ولكن يمحوها ويعوض منها حسنة\n وعنه صلى الله عليه وسلم أنه قال:\n \" لَيَتَمَنَّيَنَّ أقوامٌ أنهم أكثروا من السيئات\n قيل: من؟ قال: الذين يُبدل الله سيئاتهم حسنات \" \n{ وكان الله غفوراً } للسيئات\n { رحيماً } يُبَدِّلُها حسنات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:11",
      "similarity": 0.7089675163206255
    },
    {
      "verse": "3:89",
      "similarity": 0.5733571594687904
    },
    {
      "verse": "24:5",
      "similarity": 0.5733571594687904
    },
    {
      "verse": "7:153",
      "similarity": 0.5701670499589977
    },
    {
      "verse": "20:82",
      "similarity": 0.5355493431601142
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/025070.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/025070.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/25:70.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}