{
  "chapter": "الفرقان",
  "text": "وقالوا۟ مال هذا الرسول ياكل الطعام ويمشى فى الاسواق لولا انزل اليه ملك فيكون معه نذيرا",
  "translations": [
    {
      "translation": "They say, 'What is the matter with this Messenger, that he eats food and walks in the market-place? Why has an angel not been sent down to him so that it can be a warner along with him?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they say: \"What sort of prophet is this who eats food and walks the market places? Why was no angel sent to him to act as admonisher with him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"What sort of a Messenger is he that he eats food and moves about in the streets? Why has not an angel been sent down to accompany him and threaten (the disbelievers)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Why does this Messenger eat food, and walk in the streets? Why has not an angel been sent to him so that they could preach the message together?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “What is the matter with this (Noble) Messenger, that he eats food and walks in the markets? Why was not an angel sent down along with him, to give warning along with him?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Why does this Messenger eat food, and walk about in the markets. Why is not an angel sent down to him to be a warner with him\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: What is the matter with this Apostle that he eats food and goes about in the markets; why has not an angel been sent down to him, so that he should have been a warner with him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say, 'What ails this Messenger that he eats food, and goes in the markets? Why has an angel not been sent down to him, to be a warner with him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: What aileth this messenger (of Allah) that he eateth food and walketh in the markets? Why is not an angel sent down unto him, to be a warner with him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"What kind of a messenger is this who eats food and walks about in the market-places? Why has no angel been sent down with him to warn us?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: what aileth this apostle: he eateth food and walketh about the market-places: wherefore is not an angel sent down unto him, so thathe may be along with him a warner '\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, ‘What sort of apostle is this who eats food and walks in the marketplaces? Why has not an angel been sent down to him so as to be a warner along with him?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"What sort of a messenger is this, who eats food, and walks through the streets? Why has not an angel been sent down to him to give admonition with him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Why does this Messenger (Muhammad SAW) eat food, and walk about in the markets (like ourselves). Why is not an angel sent down to him to be a warner with him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say: 'How is it that this Messenger eats food and walks about the markets? Why has no angel been sent down with him to warn us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “What sort of messenger is this, who eats food, and walks in the marketplaces? If only an angel was sent down with him, to be alongside him a warner.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"What is this messenger that eats food and walks in the markets? Why was there not sent down to him an angel so he would be with him a warner?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:7] And they also say, ‘What is it with this Messenger that he eats food and walks about in the marketplaces? Why has an angel not been sent down to him so as to be a warner along with him?, and confirm his truthfulness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say) Abu Jahl and his host, al-Nadr and his host, and Umayyah Ibn Khalaf and his host say: (What aileth this messenger (of Allah) that he eateth food) like we do (and walketh in the markets) and goes to the markets and walks there as we do? (Why is not an angel sent down unto him, to be a warner with him) to help and inform him of the evil things which are planned against him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَقَالُواْ } مستهزئين متهكمين: { مَالِ هَـٰذَا ٱلرَّسُولِ } يدعي الرسالة والنبوة مع أنه لا يتميز عن العوام { يَأْكُلُ ٱلطَّعَامَ } كما نأكل { وَيَمْشِي فِي ٱلأَسْوَاقِ } لضبط أمور معاشه كما نمشي\n فما مزيته علينا وامتيازه عنا حتى يكون رسولاً؟ وإن كان صادقاً في دعوى نزول الملك إليه بالوحي { لَوْلاۤ أُنزِلَ إِلَيْهِ مَلَكٌ } ظاهراً بلا سترة حتى نراه ونعاين به\n ونؤمن له بلا ترددٍ { فَيَكُونَ مَعَهُ نَذِيراً } [الفرقان: 7] أي: يكون الملك المنزل ردءاً له في إنذارنا وتبليغ الدعوة إلينا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر طعنهم فيمن نُزل عليه، فقال: { وقالوا مَالِ هذا الرسولِ } وقعت اللام في المصحف مفصولة عن الهاء، وخط المصحف سُنّة لا يغير\n وتسميتهم إياه بالرسول سخرية منهم، كأنهم قالوا: أي شيء لهذا الزاعم أنه رسول يأكل الطعام كما تأكلون، ويمشي في الأسواق لابتغاء الأرزاق كما تمشون، أي: إن صح ما يدعيه فما له لم يخالف حالنا؟! { لولا أُنزل إليه ملَكَ } على صورته { فيكون معه نذيراً } ، وهذا منهم تنزل عن اقتراح كونه صلى الله عليه وسلم ملكاً مستغنياً عن المادة الحسية، إلى اقتراح أن يكون معه ملك يُصدقه، ويكون ردءاً له في الإنذار، ويُعبر عنه، ويفسر ما يقوله للعامة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:20",
      "similarity": 0.7460868982207084
    },
    {
      "verse": "50:21",
      "similarity": 0.488399786972552
    },
    {
      "verse": "75:30",
      "similarity": 0.48229510486997457
    },
    {
      "verse": "68:42",
      "similarity": 0.3797989128888638
    },
    {
      "verse": "8:6",
      "similarity": 0.3665906555469533
    }
  ]
}