{
  "chapter": "الفرقان",
  "text": "والذين يقولون ربنا هب لنا من ازوجنا وذريتنا قرة اعين واجعلنا للمتقين اماما",
  "translations": [
    {
      "translation": "those who say, 'Our Lord, give us joy in our wives and children and make us a good example for those who have taqwa';",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who say: \"O Lord, give us comfort in our spouses and children, and make us paragons of those who follow the straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who pray, \"Our Lord, bless us with wives and children, who may be the comfort of our eyes, and make us leaders of the righteous. \" -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They pray, \"Lord, let our spouses and children be the delight of our eyes and ourselves examples for the pious ones.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who submit, “Our Lord, soothe our eyes with our wives and our children, and make us leaders of the pious.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who say: \"Our Lord! Bestow on us from our wives and our offspring the comfort of our eyes, and make us leaders of those who have Taqwa.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they who say: O our Lord! grant us in our wives and our offspring the joy of our eyes, and make us guides to those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who say, 'Our Lord, give us refreshment of our wives and seed, and make us a model to the godfearing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who say: Our Lord! Vouchsafe us comfort of our wives and of our offspring, and make us patterns for (all) those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who say, \"Lord, grant us joy in our wives and children and make us a model for the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who say: our Lord bestow on us coolness of eyes from our wives and our offspring, and make us unto the God-fearing a pattern.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who say, ‘Our Lord! Give us joy and comfort in our spouses and offspring, and make us imams of the Godwary.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who pray, \"Our Lord! Grant unto us wives and offspring who will be the comfort of our eyes, and give us (the grace) to lead the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who say: \"Our Lord! Bestow on us from our wives and our offspring who will be the comfort of our eyes, and make us leaders for the Muttaqun\" (pious - see V. 2:2 and the footnote of V. 3:164).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say: 'Lord give us of our wives and children what pleases our eyes and make us leaders to the fearful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who say, “Our Lord, grant us delight in our spouses and our children, and make us a good example for the righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who say, \"Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:74] and those who say, ‘Our Lord! Grant us in our spouses and our offspring (read plural dhurriyyātinā or singular dhurriyyatinā) a joyful sight, for us, so that we see them obedient to You, and make us paragons, of   virtue, for the God-fearing’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And who say: Our Lord!) our Lord! (Vouchsafe us comfort of our wives and of our offspring) make our wives and offspring righteous so that we may find comfort in them, (and make us patterns for (all) those who ward off (evil)) make us righteous so that they emulate us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ } معناه مُطيعونَ لَكَ يَعبِدُونَكَ فيُحسنون عِبادَتَكَ، ولا يَجرّونَ علينا الجَرائرَ\n\n\n\n\nوقوله تعالى: { وَٱجْعَلْنَا لِلْمُتَّقِينَ إِمَاماً } معناه أَئمةٌ فِي الخَيرِ يُقتدى بِنا\n وقال مِثالٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Our Lord, grant us from our spouses and our offspring a coolness of the eyes} [means] those who obey you, who worship you, and who do not incur sin upon us.\n\nAnd His saying, {And make us leaders for the righteous}, its meaning is Imams in good, who are followed by us.\n\n\nAnd he said, \"For example,\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nثم وصف طلبهم للترقي عن مقام القلب إلى مرتبة السابقين والاستعانة بالله عن تلوين النفس وصفاتها لينخرطوا في سلك المقرّبين بقوله: { والذين يقولون ربنا هب لنا من } أزواج نفوسنا وذريّات قوانا ما تقرّ به أعيننا من طاعاتهم وانقيادهم خاضعين، وتنوّرهم بنور القلب مخبتين غير طالبين للاستعلاء والترفع والاستكبار والتجبر { واجعلنا للمتقين } أي: المجرّدين { إماماً } بالوصول إلى مقام السابقين { أولئك يجزون } غرفة الفردوس وجنة الروح بصبرهم مع الله وفي الله عن غيره { ويلقون فيها تحية } خلود حياة { وسلاماً } سلامة وبراءة عن الآفات، أي: يحييهم الله بإبقائهم سرمداً ببقائه ويسلمهم بإيتائهم كماله كما قيل:\n\n[الأحزاب، الآية: 44]، وقال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ يَقُولُونَ } داعين مناجين متضرعين قائلين: { رَبَّنَا } يا من ربانا على فطرة التوحيد والإيقان { هَبْ لَنَا } بفضلك\n وسعة لطفك وجودك من في حوزتنا وجوارنا { مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ } أي: أجعلهم بحيث تقر وتتنور عيوننا برؤيتكم من كمال صلاحهم وسدادهم\n ممتثلين بأوامرك\n مجتنبين عن نواهيك { وَ } بعدما وهبتنا يا مولانا ولأهلينا ما تقر به عيوننا من الاتقاء عن محارمك والامتثال بأوامرك\n و { ٱجْعَلْنَا } بلطفك { لِلْمُتَّقِينَ } المحترزين الحذرين عن محارمك ومنهياتك { إِمَاماً } [الفرقان: 74] مقتدى بهم\n نرشدهم إلى طريق توحيدك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والذين يقولون ربنا هَبْ لنا من أزواجنا } ، \" من \": للبيان، كأنه قيل: هب لنا قرة أعين، ثم بُينت القرة وفُسرت بقوله: { من أزواجنا وذرياتنا } والمعنى: أن يجعلهم الله لهم قرة أعين بأن يروا منهم من الطاعة والإحسان وما تقر به العين\n أو للابتداء، أي: هب لنا من جهتهم ما تقر به العين، من طاعة أو صلاح\n { و } هب لنا أيضاً من { ذرياتنا قُرةَ أعيُن } بتوفيقهم للطاعة، ومبادرتهم للفضائل والكمالات، فإن المؤمن إذا ساعده أهله في طاعة الله تعالى وشاركوه فيها يسر قلبه، وتقر عينه بما شاهده من مقاربتهم له في الدين، ويكون ذلك سبباً في لحوقهم به في الجنة، حسبما وعد به قوله تعالى:\n\n[الطور: 21]\n وإنما قال: \" أعين \" بلفظ القلة، دون عيون لأن المراد أعين المتقين، وهي قليلة بالإضافة إلى أعين غيرهم\n والمعنى: أنهم سألوا ربهم يرزقهم أزواجاً وأعقاباً، عُمَّالاً لله، يسرون بمكانهم، وتقر بهم عيونهم، قيل: ليس شيء أقر لعين المؤمن من أن يرى زوجته وأولاده مطيعين لله\n وعن ابن عباس: هو الولد إذا رآه يكتب الفقه\n { واجعلنا للمتقين إماماً } أي: أئمة يقتدى بنا في الدين، فاكتفى بالواحد لدلالته على الجنس، أو: واجعل كل واحد منا إماماً أي: من أولادنا إماماً\n والظاهر: أن صدور هذا الدعاء منهم كان بطريق الانفراد إذ يتعذر اجتماعهم في دعاء واحد\n وإنما كانت عبارة كل واحد منهم عند الدعاء: واجعلني للمتقين إماماً، غير أنه حكيت عبارة الكل بصيغة المتكلم مع الغير قصداً إلى الإيجاز، كقوله تعالى:\n\n[المؤمنون: 51]\n وأبقى إماماً على حاله من الانفراد\n قيل: وفي الآية دليل على أن الرئاسة في الدين ينبغي أن تُطلب ويُرغب فيها، إذا كان القصد نفع عباد الله دون حظ نفساني\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:100",
      "similarity": 0.46642687108419995
    },
    {
      "verse": "38:35",
      "similarity": 0.4071834104175799
    },
    {
      "verse": "29:27",
      "similarity": 0.39351244705754707
    },
    {
      "verse": "19:50",
      "similarity": 0.3721666579768354
    },
    {
      "verse": "13:38",
      "similarity": 0.3632755614825103
    }
  ]
}