{
  "chapter": "الفرقان",
  "text": "الا من تاب وءامن وعمل عملا صلحا فاو۟لئك يبدل الله سيـاتهم حسنت وكان الله غفورا رحيما",
  "translations": [
    {
      "translation": "except for those who make tawba and have iman and act rightly: Allah will transform the wrong actions of such people into good - Allah is Ever-Forgiving, Most Merciful -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and come to believe and do the right, for whom God will turn evil into goodness, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except the one who may have repented (after those sins) and have believed and done righteous works, for then Allah will change his evil deeds into good deeds, and He is very Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But only those who repent and believe and act righteously will have their sins replaced by virtue; God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except one who repents and accepts faith and does good deeds – so Allah will turn their evil deeds into virtues; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and believe, and do righteous deeds; for those, Allah will change their sins into good deeds, and Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except him who repents and believes and does a good deed; so these are they of whom Allah changes the evil deeds to good ones; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save him who repents, and believes, and does righteous work -- those, God will change their evil deeds into good deeds, for God is ever All-forgiving, All-compassionate;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save him who repenteth and believeth and doth righteous work; as for such, Allah will change their evil deeds to good deeds. Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except for those who repent and believe and do good deeds. God will change the evil deeds of such people into good ones: He is most forgiving and most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save him who repenteth and believeth and worketh righteous work. Then these! for them Allah shall change their vices into virtues. Verily Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who repent, attain faith, and act righteously. For such, Allah will replace their misdeeds with good deeds, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless he repents, believes, and works righteous deeds, for Allah will change the evil of such persons into good, and Allah is Oft-Forgiving, Most Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and believe (in Islamic Monotheism), and do righteous deeds, for those, Allah will change their sins into good deeds, and Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except he who repents and believes and does good works those, Allah will change their evil deeds into good deeds; Allah is ever Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent, and believe, and do good deeds. These—God will replace their bad deeds with good deeds. God is ever Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent, believe and do righteous work. For them Allah will replace their evil deeds with good. And ever is Allah Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:70] except for him who repents, and believes, and acts righteously, from among them, for such, God will replace their, mentioned, evil deeds with good deeds, in the Hereafter, for God is ever Forgiving, Merciful, that is, He is ever possessed of such attributes;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Save him who repenteth) from his disbelief (and believeth) in Allah (and doth righteous work) sincerely after he accepts faith; (as for such, Allah will change their evil deeds to good deeds) Allah will change them from the state of disbelief to the state of faith, from disobedience to obedience, from the worship of idols to His worship, and from evil to goodness. (Allah is ever Forgiving) He forgives whoever repents, (Merciful) He shows mercy towards whoever dies in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأُوْلَـٰئِكَ يُبَدِّلُ ٱللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ } معناه يَجعلَ ذَلكَ فِي الدّنيا بالشّركِ إيماناً وإخلاصاً\n وبالسَّيءِ مَن العَملِ، الصَّالحَ منهُ\n وبالفجورِ عَفافاً وإحصاناً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"God will replace their bad deeds with good\" means that He will make that in this life, with faith and sincerity.\n {And} {in the bad} {of the work}, {the good} {from it}\n\n\nAnd with purity and chastity.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ مَن تَابَ } عما جرى عليه من سوء القضاء، ورجع إلى الله نادماً عن فعله خائباً خاسراً، مستحيياً من الله، خائفاً عن بطشه، مكذباً لنفسه، معيراً عليها، متأوهاً متحسراً عما صدر عنه { وَ } مع ذلك { آمَنَ } بتوحيد الله، وأكَّد توبته بتجديد الإيمان المقارن بالإخلاص الصائن للمؤمنين عن ارتكاب المحظورات المنافية للإيمان، وبالجملة: جدد إيمانه معتقداً أه حين صدر عنه لم يكن مؤمناً { وَ } مع التوبة وتجديد الإيمان { عَمِلَ عَمَلاً صَالِحاً } منبئاً عن إخلاصه في إيمانه وتوبته، مشعراً على يقينه ومعرفته\n\n\n\n\n{ فَأُوْلَـٰئِكَ } السعداء التائبون الآيبون المقبولون، هم الذين { يُبَدِّلُ ٱللَّهُ } الحكيم المصلح لأحوال عباده بعدما وقفهم على التوبة الخالصة والإنابة الصحيحة الوثيقة { سَيِّئَاتِهِمْ } التي أتوا بها قبل التوبة { حَسَنَاتٍ } بعدها، بأن يمحو سبحانه بفضله معاصيهم المثبتة في صحائف أعمالهم قبل إنابتهم، ويثبت بدلها حسنات بعدما { وَكَانَ ٱللَّهُ } المطلع لسرائر عباده وإخلاصهم { غَفُوراً } لهم، متجاورزاً عن ذنوبهم وإن عظمت بعدما جاءوا بالتوبة الخالصة { رَّحِيماً } [الفرقان: 70] يقبل توبتهم ويغفو زلتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا من تابَ } من الشرك، { وآمن } بمحمد صلى الله عليه وسلم، { وعَمِلَ عملاً صالحاً } بعد توبته { فأولئك يُبَدِّلُ الله سيئاتهم حسناتٍ } أي: يوفقهم للمحاسن بعد القبائح، فيوفقهم للإيمان بعد الشرك، ولقتل الكافر بعد قتل المؤمن، وللعفة بعد الزنا، أو: يمحوها بالتوبة، ويثبت مكانها الحسنات\n ولم يُرد أن السيئة بعينها تصير حسنة، ولكن يمحوها ويعوض منها حسنة\n وعنه صلى الله عليه وسلم أنه قال:\n\n \" لَيَتَمَنَّيَنَّ أقوامٌ أنهم أكثروا من السيئات، قيل: من؟ قال: الذين يُبدل الله سيئاتهم حسنات \" \n\n{ وكان الله غفوراً } للسيئات، { رحيماً } يُبَدِّلُها حسنات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:11",
      "similarity": 0.7089675163206255
    },
    {
      "verse": "3:89",
      "similarity": 0.5733571594687904
    },
    {
      "verse": "24:5",
      "similarity": 0.5733571594687904
    },
    {
      "verse": "7:153",
      "similarity": 0.5701670499589977
    },
    {
      "verse": "20:82",
      "similarity": 0.5355493431601142
    }
  ]
}