{
  "chapter": "الفرقان",
  "text": "او يلقى اليه كنز او تكون له جنة ياكل منها وقال الظلمون ان تتبعون الا رجلا مسحورا",
  "translations": [
    {
      "translation": "Why has treasure not been showered down on him? Why does he not have a garden to give him food?' The wrongdoers say, 'You are merely following a man who is bewitched.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or a treasure should have been given to him, or he should have had an orchard from which he could eat.\" And these wicked people say: \"You only follow a man ensorcelled.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or why has not at least a treasure been sent down for him or a garden given to him for (easy) sustenance?\" And the wicked people say, \"You are following a man bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why has a treasure not been laid out for him or a garden from which he could eat been given to him.\" The unjust ones say, \"You are merely following a bewitched person\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Or that he should have obtained a hidden treasure, or should have had a garden from which to eat”; and the unjust said, “You do not follow but a man under a magic spell.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (why) has not a treasure been granted to him, or why has he not a garden whereof he may eat\" And the wrongdoers say: \"You follow none but a man bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (why is not) a treasure sent down to him, or he is made to have a garden from which he should eat? And the unjust say: You do not follow any but a man deprived of reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or why is not a treasure thrown to him, or why has he not a Garden to eat of?' The evildoers say, 'You are only following a man bewitched!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (why is not) treasure thrown down unto him, or why hath he not a paradise from whence to eat? And the evil-doers say: Ye are but following a man bewitched.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or a treasure should have been sent down to him, or he should have had a garden from which to eat.\" The wrongdoers say, \"You are surely following a man who is bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, whereforeis not there cast down unto him a treasure or he has a garden whereof he may eat! And the wrong-doeray: ye follow only a man bewitched.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, ‘[Why is not] a treasure thrown to him, or [why does] he [not] have a garden from which he may eat?’ And the wrongdoers say, ‘You are just following a bewitched man.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (Why) has not a treasure been bestowed on him, or why has he (not) a garden for enjoyment?\" The wicked say: \"Ye follow none other than a man bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (why) has not a treasure been granted to him, or why has he not a garden whereof he may eat?\" And the Zalimun (polytheists and wrong-doers, etc.) say: \"You follow none but a man bewitched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, why has no treasure been thrown to him, or a garden for him to eat from' And the harmdoers say: 'The man you follow is surely bewitched'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, “If only a treasure was dropped on him.” Or, “If only he had a garden from which he eats.” The evildoers also say, “You are following but a man under spell.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or [why is not] a treasure presented to him [from heaven], or does he [not] have a garden from which he eats?\" And the wrongdoers say, \"You follow not but a man affected by magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:8] Or a treasure thrown down to him, from the heaven, for him to spend from so as not to be in need of walking through the marketplaces in order to earn his livelihood. Or he has a garden, an orchard, for him to eat from?’, that is, [to eat] from its fruits and satisfy himself therewith (a variant reading [for ya’kulu, ‘for him to eat’] has na’kulu, ‘for us to eat’) and thus possess because of that [garden] an advantage over us. The wrongdoers, namely, the disbelievers, say, to the believers: ‘You are just following a man bewitched!’, one duped, his mind overcome. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or (why is not) a treasure thrown down unto him) for him to use, (or why hath he not a Paradise) a garden (from whence to eat) and be full? (And the evil-doers) the idolaters: Abu Jahl, al-Nadr and Umayyah and their hosts (say: Ye are but following a man) Muhammad (bewitched) who is possessed and mad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوْ } هلا { يُلْقَىٰ إِلَيْهِ } من قبل ربه { كَنْزٌ } فيستغني به عن الخلق، فتتبعه طعماً للأحاسن { أَوْ } هلا { تَكُونُ لَهُ جَنَّةٌ } موهوبة له من ربه فيها أنواع الثمرات والفواكه { يَأْكُلُ مِنْهَا } رغداً ويترفه بها أمداً، وبالجملة: ما له هذا ولا ذاك ولا ذلك، فمن أين نصدق برسالته، وبأي شيء نعتقده نبياً؟ { وَ } بعدما بالغوا في قدحه وإنكاره وأفرطوا في استهزائه وسوء الأدب معه صلى الله عليه وسلم، وبالجملة: { قَالَ ٱلظَّالِمُونَ } المنكرون المستكبرون على سبيل الذب، والإعراض لضعفاء الأنام عن متابعته صلى الله عليه وسلم: لو صدقتم أيها الناس وآمنتم به من أنكم سمعتم أنه لا مزية له عليكم، ولا امتياز بينه وبينكم { إِن تَتَّبِعُونَ } أي: ما تتبعون حينئذ، وتؤمنون { إِلاَّ رَجُلاً مَّسْحُوراً } [الفرقان: 8] مجنوناً سُحر له، فجُنَّ واختل عقله وكلَّ فهمه، لذلك تكلم بكلام المجانين، فعجز عن معارضته العقلاء؛ إذ العقل قاصر عن مموهات الوهم وتسويلات الخيال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أو يُلْقَى إليه كنزٌ } من السماء، يستغني به عن طلب المعاش معنا، { أو تكونُ له جنةٌ } بستان { يأكل منها } كالأغنياء المياسير\n والحاصل: أنهم أول مرة ادعوا أن الرسول لا يكون إلا كالملائكة، مستغنياً عن الطعام والشراب، وتعجبوا من كون الرسول بشراً، ثم تنزلوا إلى اقتراح أن يكون إنساناً معه ملك يُصدقه ويعينه على الإنذار، ثم تنزلوا إلى اقتراح أن يكون معه كنز، يستظهر به على نوائبه، ثم تنزلوا إلى اقتراح أن يكون رجلاً له بستان يأكل منه، كالمياسير، أو نأكل نحن منه، على قراءة حمزة والكسائي\n قال تعالى: { وقال الظالمون } وهم الكفرة القائلون ما تقدم، غير أنه وضع الظاهر موضع المضمر، تسجيلاً عليهم بالظلم وتجاوز الحد فيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:58",
      "similarity": 0.7435926341397503
    },
    {
      "verse": "11:12",
      "similarity": 0.4990598058173469
    },
    {
      "verse": "9:34",
      "similarity": 0.34928845820683013
    },
    {
      "verse": "17:47",
      "similarity": 0.3220681891184457
    },
    {
      "verse": "18:82",
      "similarity": 0.3141051662178602
    }
  ]
}