{
  "chapter": "الفرقان",
  "text": "انظر كيف ضربوا۟ لك الامثل فضلوا۟ فلا يستطيعون سبيلا",
  "translations": [
    {
      "translation": "See how they make comparative judgements about you. They are misguided and cannot find the way.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just see what comparisons they bring up for you! They are lost and cannot find the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just see what strange arguments they bring forward with regard to you! They have gone so far astray that they cannot charge any thing against you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look at their various views about you! They have gone astray and are not able to find the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him) see how they invent examples for you – they have therefore gone astray, unable find a road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how they coin similitudes for you, so they have gone astray, and they cannot find a path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See what likenesses do they apply to you, so they have gone astray, therefore they shall not be able to find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, how they strike similitudes for thee, and go astray, and are unable to find a way!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how they coin similitudes for thee, so that they are all astray and cannot find a road!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe what kind of things they attribute to you. They have surely gone astray and cannot find the right way again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold how they propound similitudes for thee! so they have strayed and cannot find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look, how they coin epithets for you; so they go astray, and cannot find the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See what kinds of comparisons they make for thee! But they have gone astray, and never a way will they be able to find!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how they coin similitudes for you, so they have gone astray, and they cannot find a (Right) Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See how they strike examples for you, surely they have gone astray and are unable to find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look how they invent examples for you. They have gone astray, and cannot find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look how they strike for you comparisons; but they have strayed, so they cannot [find] a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[25:9] See how they strike similitudes for you, of [the fact that the Prophet is] a person bewitched and one in need of something to expend [from] and of an angel to help him carry out the task [of delivering the Message], so that they go astray, thereby from guidance, and are unable to find a way, a means thereto [to guidance].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(See how they coin similitudes for thee) see how they explain things to you and call you names: magician, fortune teller, liar, poet, and madman; it is also said that this means: see how they liken you to a bewitched person, (so that they are all astray) their scheming went amiss and they fell in error (and cannot find a road) they cannot find a way out of what they said about you, nor do they have any proof about what they say about you!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱنظُرْ } يا أكمل الرسل { كَيْفَ ضَرَبُواْ لَكَ ٱلأَمْثَالَ } هؤلاء الضُلاَّال بعدما عجزوا عن معارضتك، وتاهوا في كمال رشدك وهدايتك، وكيف توغلوا في الحيرة عن مدركاتك، حتى تشبثوا بأمثال هذه الخرافات والهذايانات البعيدة عن علو شأنك وسمو رتبتك وبرهانك، وبالجلمة: { فَضَلُّواْ } وتحيروا، وانسحرت عقولهم عن الوصول إلى كمال مدركاتك وأنواع هداياتك { فَلاَ يَسْتَطِيعُونَ سَبِيلاً } [الفرقان: 9] إليها لتعاليها عن مداركهم وعقولهم، فنسبوك إلى ما لا يليق بجنابك عناداً واستكباراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهم كفار قريش، أي: قالوا للمؤمنين: { إن تتبعون } ما تتبعون { إلا رجلاً مسحوراً } قد سُحر فغلب على عقله، { انظر كيف ضربوا لك الأمثال } أي: انظر كيف قالوا في حقك تلك الأقاويل العجيبة، الخارجة عن العقول، الجارية لغرابتها، مجرى الأمثال، واخترعوا لك تلك الصفات والأحوال الشاذة، البعيدة عن الوقوع؟! { فضلّوا } عن طريق الجادة { فلا يستطيعون سبيلاً } فلا يجدون طريقاً إليه، أو: فلا يجدون سبيلاً إلى القدح في نبوتك، بأن يجدوا قولاً يستقرون عليه، أو: فضلّوا عن الحق ضلالاً مبيناً، فلا يجدون طريقاً موصلاً إليه، فإن من اعتاد استعمال هذه الأباطيل لا يكاد يهتدي إلى استعمال المقدمات الموصلة إلى الرشد والصواب\n وبالله التوفيق\n الإشارة: تكذيب الصادقين سُنَّة ماضية، فإن سمع أهل الإنكار منهم علوماً وأسراراً قالوا: ليست من فيضه، إنما نقلها عن غيره، وأعانه على إظهارها قومٌ آخرون، قل: أنزلها على قلوبهم الذي يعلم السر في السماوات والأرض، أنه كان غفوراً رحيماً، حيث ستر وصفهم بوصفه ونعتهم بنعته، فوصلهم بما منه إليهم، لا بما منهم إليه\n وقوله تعالى: { مال هذا الرسول يأكل الطعام ويمشي في الأسواق } ، أنكروا وجود الخصوصية مع وصف البشرية، ولا يلزم من وجود الخصوصية عدم وصف البشرية، كما تقدم مراراً\n والله تعالى أعلم\n ثم ردَّ الله تعالى عليهم، فقال: { تَبَارَكَ ٱلَّذِيۤ إِن شَآءَ جَعَلَ لَكَ خَيْراً\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:48",
      "similarity": 1.0
    },
    {
      "verse": "16:74",
      "similarity": 0.5529774839682318
    },
    {
      "verse": "14:45",
      "similarity": 0.5310209131540907
    },
    {
      "verse": "6:24",
      "similarity": 0.42301127516095777
    },
    {
      "verse": "29:43",
      "similarity": 0.42213530093940116
    }
  ]
}