{
  "chapter": "الشعراء",
  "text": "وما اسـلكم عليه من اجر ان اجرى الا على رب العلمين",
  "translations": [
    {
      "translation": "I do not ask any recompense of you for this. My reward is due from none but the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I ask of you no reward. My reward is with none but the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not ask for any payment for my preaching. I shall receive my reward from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I do not ask from you any fee for it; my reward is only upon the Lord Of The Creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No reward do I ask of you for it; my reward is only from the Lord of Al-`Alamin.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not ask you any reward for it; my reward is only with the Lord of the worlds:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I ask of you no wage for this; my wage falls only upon the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I ask of you no wage therefor; my wage is the concern only of the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For this I demand no recompense from you; my reward is only with the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I ask of you no hire therefor; MY hire is but with the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not ask you any reward for it; my reward lies only with the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No reward do I ask of you for it: my reward is only from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No reward do I ask of you for it (my Message of Islamic Monotheism), my reward is only from the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For this I ask of you no wage; my wage falls only upon the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I ask of you no payment for it. My payment is only from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not ask you for it any payment. My payment is only from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:145] I do not ask of you any reward for this; for my reward lies only with the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And I ask of you no wage) no payment or provision (therefore) in exchange for the profession of Allah's divine Oneness; (my wage) my reward (is the concern only of the Lord of the Worlds.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلمواأني { مَآ أَسْأَلُكُمْ عَلَيْهِ } أي: على تذكيري { مِنْ أَجْرٍ إِنْ أَجْرِيَ إِلاَّ عَلَىٰ رَبِّ ٱلْعَالَمِينَ } [الشعراء: 145] وهو سبحانه اختارني للبعثة والرسالة، واصطفاني لحمل وحيه، فأرجوا من فضله وسعة جوده أن يفيض عليَّ من معارفه وحقائقه إلى حيث اضمحل هويتي الباطلة في هوية الحق، وتلاشى تعيناتي بالفناء فيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}