{
  "chapter": "الشعراء",
  "text": "قالوا۟ لئن لم تنته ينوح لتكونن من المرجومين",
  "translations": [
    {
      "translation": "They said, 'Nuh, if you do not desist you will be stoned.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"If you do not desist, O Noah, you will be stoned to death.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Noah! If you do not desist, you will certainly become one of the accursed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Noah, if you do not desist, you will, certainly, be stoned to death.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Nooh, if you do not desist you will surely be stoned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"If you cease not, O Nuh you will surely be among those stoned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: If you desist not, O Nuh, you shall most certainly be of those stoned to death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'If thou givest not over, Noah, thou shalt assuredly be one of the stoned.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: If thou cease not, O Noah, thou wilt surely be among those stoned (to death).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Noah, if you do not desist, you will be stoned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: if thou desistest not, thou shalt surely be of those stoned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Noah, if you do not desist, you will certainly be stoned [to death].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"If thou desist not, O Noah! thou shalt be stoned (to death).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"If you cease not, O Nuh (Noah)! You will surely be among those stoned (to death).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah' they replied, 'if you do not desist you shall be of those stoned'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “If you do not refrain, O Noah, you will be stoned.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"If you do not desist, O Noah, you will surely be of those who are stoned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:116] They said, ‘Lo! if you do not desist, O Noah, from what you say to us, you will assuredly be among those assailed’, with stones or curses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: If thou cease not) from what you are saying, (O Noah, thou wilt surely be among those stoned (to death)) we will kill you just as we killed the strangers who believed in you. 415\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعوا منه ما سمعوا من عدم مبالاته بهم وثباتهم، وعدم رعاية جانبهم وغبطتهم { قَالُواْ } من فرط عتوهم واستكبارهم: { لَئِنْ لَّمْ تَنْتَهِ يٰنُوحُ } عن دعوتك وادعائك هذا، أو لم تترك هذياناتك التي جئت بها من تلقاء نفسك افتراءً ومراءً { لَتَكُونَنَّ } بإصرارك عليها { مِنَ ٱلْمَرْجُومِينَ } [الشعراء: 116] المقتولين بالحجارة زجراً وقهراً، فارجع إلى حالك، وتب من هذياناتك؛ حتى لانقتلك بأقبح الوجوه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا لئن لم تَنْته يا نوحُ } عما تقول { لتكوننَّ من المرجومين } من المقتولين بالحجارة\n قالوه في آخر أمره\n { قال ربِّ إنَّ قومي كذَّبونِ } تمادوا على تكذيبي، وأصروا عليه، بعد ما دعوتهم هذه الأزمنة المتطاولة، فلم يزدهم دعائي إلا فِراراً، وليس هذا من قبيل الإخبار لأن الله لا يخفى عليه شيء، وإنما هو تضرع وابتهال، بدليل قوله: { فافتحْ بيني وبينهم فتحاً } أي: احكم بيني وبينهم بما يستحقه كل واحد منا، وهذه حكاية إجمالية، قد فصلت في سورة نوح { وَنَجِّنِي وَمَن مَّعِيَ مِنَ الْمُؤْمِنِين } من شرهم، أو من شؤم عملهم\n { فأنجيناه ومن معه } حسب دعائه { في الفلك المشحون } المملوء بهم وبما لا بد لهم منه\n { ثم أغرقنا بَعْدُ } أي: بعد إنجائهم { الباقين } من قومه، { إنَّ فِي ذَلِكَ لآيَةً وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ } الممتنع القاهر بإهانة من جحد وأصر\n والله تعالى أعلم\n الإشارة: قال القشيري: أخبر عن كل واحد من الأنبياء بقوله: { وما أسألكم عليه من أجر } ليَعْلَمَ الكافةُ أنه من عَمِلَ له فلا ينبغي أن يطلب الأجر من غيره، ففي هذا تنبيهٌ للعلماء - الذين هم ورثة الأنبياء - أن يتأدبوا بآدابهم، وألاّ يطلبوا من الناس شيئاً في بَثِّ علومهم، ولا يرتفقون منهم بتعليمهم، والتذكير لهم، ومن ارتفق من المستمعين في بث فائدة يذكرها من الدين، يَعِظُ بها المسلمين، فلا بارك الله للمسلمين فيما يَسْمعون منه، ولا للعلماءِ أيضاً بركةٌ فيما منهم يأخذون، فيبيعون دينَهم بَعَرَضٍ يسيرٍ، ثم لا بَركضةَ لهم فيه، إذ لا يتقربون به إلى الله، ولا ينتفعون به، ويَحْصُلون على سخط من الله\n هـ\n قلت: أما ما يأخذه العالم من الأحباس فلا يدخل في هذا إذ ليس فيه تكلف من أحد، وكذلك ما يأخذه الواعظ على وجه الزيارة والهدية، من غير استشراف نفسٍ ولا طمعٍ ولا تكلفٍ\n والله تعالى أعلم\n ثم ذكر قصة هود عليه السلام، فقال: { كَذَّبَتْ عَادٌ\n\n\n }\n",
      "translations": []
    }
  ]
}