{
  "chapter": "الشعراء",
  "text": "فكذبوه فاهلكنهم ان فى ذلك لءاية وما كان اكثرهم مؤمنين",
  "translations": [
    {
      "translation": "So they denied him and We destroyed them. There is certainly a Sign in that, yet most of them are not",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they accused him of lies; so We annihilated them. Verily there is a sign in this, but most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eventually they gave the lie to him and We destroyed them. Surely there is a Sign in this, but most of them would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this there is evidence (of the Truth), yet most of them do not have any faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In response they denied him – We therefore destroyed them; indeed in this is a sign; and most of them were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they denied him, and We destroyed them. Verily, in this is indeed a sign, yet most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they gave him the lie, then We destroyed them. Most surely there is a sign in this, but most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they cried him lies; then We destroyed them. Surely in that is a sign, yet most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they denied him; therefor We destroyed them. Lo! herein is indeed a portent, yet most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they rejected him; and We destroyed them. There is certainly a sign in that; but most of them would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they belied him; so We destroyed them. Verily herein is a sign, yet most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they impugned him, whereupon We destroyed them. There is indeed a sign in that; but most of them do not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they rejected him, and We destroyed them. Verily in this is a Sign: but most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they belied him, and We destroyed them. Verily! In this is indeed a sign, yet most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they belied him, so We destroyed them. Surely, in that there is a sign; yet most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they denied him, and We destroyed them. Surely in this is a sign, but most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they denied him, so We destroyed them. Indeed in that is a sign, but most of them were not to be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:139] So they denied him, concerning the chastisement, whereupon We destroyed them, in this world with the [barren] wind [cf. Q. 51:41]. Surely in that there is a sign; but most of them are not believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "417 (And they denied him) they disbelieved in his message and in what he said to them; (therefore We destroyed them) by the wind. (Lo! Herein) in that which We did to them (is indeed a portent) a sign and an admonition to those who came after them, (yet most of them are not believers) they were not believers and most of them were disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبالجملة: لم يقبلوا منه دعوته، ولم يصدقوا قوله: { فَكَذَّبُوهُ } تكذيباً شديداً، وصاروا بسبب تكذيبهم إياه، وإنكارهم عليه مستحقين لقهرنا وغضبنا { فَأَهْلَكْنَاهُمْ } من كمال غيرتنا، واستأصلناهم بمقتضى قدرتنا { إِنَّ فِي ذَلِكَ } الإهلاك والاستئصال { لآيَةً } دالة على استقلالنا واستيلائنا بالسلطنة القاهرة على مظاهرنا ومربوباتنا { وَ } لكن { مَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ } [الشعراء: 139] بنا وبأسمائنا، وأوصافنا الكاملة الشاملة آثارها لعموم المظاهر والمصنوعات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}