{
  "chapter": "الشعراء",
  "text": "ويضيق صدرى ولا ينطلق لسانى فارسل الى هرون",
  "translations": [
    {
      "translation": "and that my breast will be constricted and that my tongue will not be free, so send Harun as a Messenger as well.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My heart is constrained, my tongue falters, so delegate Aaron;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My breast is constricted and my tongue is not fluent, so endow Messengership on Aaron.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I feel nervous and my tongue is not fluent, so send Aaron with me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I feel hesitant, and my tongue does not speak fast, therefore make Haroon also a Noble Messenger.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my breast straitens, and my tongue expresses not well. So send for Harun.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by breast straitens, and my tongue is not eloquent, therefore send Thou to Haroun (to help me);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and my breast will be straitened, and my tongue will not be loosed; so send to Aaron.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I shall be embarrassed, and my tongue will not speak plainly, therefor send for Aaron (to help me).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and \"my breast is straitened and my tongue is not fluent; so send Aaron as well;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my breast straiteneth, and my tongue moveth not quickly: so send for Harun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and I will become upset and my tongue will fail me. So send for Aaron [to join me].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My breast will be straitened. And my speech may not go (smoothly): so send unto Aaron.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And my breast straitens, and my tongue expresses not well. So send for Harun (Aaron) (to come along with me).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and my chest will become constricted and my tongue will not be loosed (in my speech), therefore, send to Aaron.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I become stressed, and my tongue is not fluent, so send Aaron too.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that my breast will tighten and my tongue will not be fluent, so send for Aaron.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:13] and that anguish will constrain my breast, because of their denial of me, and that my tongue will not utter clearly, to deliver the Message, because of the knot in it. So give the Mission to, my brother, Aaron, alongside me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَيَضِيقُ صَدْرِي وَلَا يَنْطَلِقُ لِسَانِي فَأَرْسِلْ إِلَى هَارُونَ (13) و { يضيق صدري } قرأه الجمهور بالرفع فهو عطف على { أخاف } أو تكون الواو للحال فتكون حالاً مقدرة ، أي والحال يضيق ساعتئذ صدري من عدم اهتدائهم .والضَيق : ضد السعة ، وهو هنا مستعار للغضب والكمد لأن من يعتريه ذلك يحصل له انفعال وينشأ عنه انضغاط الأعصاب في الصدر والقلب من تأثير الإدراك الخاص على جمع الأعصاب الكائن بالدماغ الذي هو المُدرك فيحس بشبه امتلاء في الصدر . وقد تقدم عند قوله تعالى : { يجعلُ صدرَه ضيّقاً حرجاً } \\[ الأنعام : 125 \\] وقوله : { وضائق به صدرُك } في سورة هود ( 12 ) . والمعنى : أنه يأسف ويكمد لتكذيبهم إياه ويجيش في نفسه روم إقناعهم بصدقه ، وتلك الخواطر إذا خطرت في العقل نشأ منها إعداد البراهين ، وفي ذلك الإعداد تكلّف وتعب للفكر فإذا أبانها أحس بارتياح وبشبه السعة في الصدر فسمى ذلك شرحاً للصدر ، ولذلك سأله موسى في الآية الأخرى قال : { ربّ اشرح لي صدري } \\[ طه : 25 \\] .والانطلاق حقيقته مطاوع أطلقه إذا أرسله ولم يحبسه فهو حقيقة في الذهاب . واستعير هنا لفصاحة اللسان وبيانه في الكلام ، أي ينحبس لساني فلا يبين عند إرادة المحاجة والاستدلاللِ وعطفه على { يضيق صدري ينبىء بأنه أراد بضيق الصدر تكاثر خواطر الاستدلال ، في نفسه على الذين كذبوه ليقنعهم بصدقه حتى يحسّ كأن صدره قد امتلأ ، والشأن أن ذلك ينقُص شيئاً بعد شيء بمقدار ما يفصح عنه صاحبه من إبلاغه إلى السامعين ، فإذا كانت في لسانه حبسة وعِيٌّ بقيت الخواطر متلجلجة في صدره . والمعنى : ويضيق صدري حين يكذبونني ولا ينطلق لساني .وقرأ الجمهور : يضيقُ . . . ولا ينطلقُ } مرفوعين عطفاً على { أخاف } ولذلك حقّقه بحرف التأكيد لأنه أيقن بحصول ذلك لأنه جبلي عند تلقي التكذيب ، ولأن أمانة الرسالة والحرص على تنفيذ مراد الله يحدث ذلك في نفسه لا محالة ، وإذ قد كان انحباس لسانه يقيناً عنده لأنه كان كذلك من أجل ذلك التيقن كان فعلا { يضيق . . . ولا ينطلق } معطوفين على ما هو محقق عنده وهو حصول الخوف من التكذيب ، ولم يكونا معطوفين على { يكذبون } المخوف منه المتوقع على أن كونه محقق الحصول يجعله أحرى من المتوقع .وقرأ يعقوب { ويضيقَ . . . ولا ينطلقَ } بنصب الفعلين عطفاً على { يكذبون } ، أي يتوقع أن يضيقَ صدره ولا ينطلقَ لسانُه . قيل كانت بموسى حُبسة في لسانه إذا تكلم . وقد تقدم في سورة طَه وسيجيء في سورة الزخرف .وليس القصد من هذا الكلام التنصل من الاضطلاع بهذا التكليف العظيم ولكن القصد تمهيد ما فرعه عليه من طلب تشريك أخيه هارون معه لأنه أقدر منه على الاستدلال والخطابة كما قال في الآية الأخرى { وأخي هارون هو أفصح مني لساناً فأرسله معي } \\[ القصص : 34 \\] . فقوله هنا { فأرسل إلى هارون } مُجمل يبيّنه ما في الآية الأخرى فيعلم أن في الكلام هنا إيجازاً . وأنه ليس المراد : فأرسل إلى هارون عِوَضاً عني .وإنما سأل الله الإرسالَ إلى هارون ولم يسأله أن يكلّم هارون كما كلّمه هو لأن هارون كان بعيداً عن مكان المناجاة . والمعنى : فأرسل مَلَكاً بالوحي إلى هارون أن يكون معي .وقوله : { ولهم عليَّ ذنب فأخاف أن يقتلون } تعريض بسؤال النصر والتأييد وأن يكفيه شرّ عدوّه حتى يؤدي ما عهد الله إليه على أكمل وجه . وهذا كقول النبي صلى الله عليه وسلم يوم بدر : « اللهم إني أسألك نصرك ووعدَك اللهم إن شئت لم تعبد في الأرض »والذنب : الجُرم ومخالفة الواجب في قوانينهم . وأطلق الذنب على المؤاخذة فإن الذي لهم عليه هو حقّ المطالبة بدم القتيل الذي وكزه موسى فقضَى عليه ، وتوعده القبط إن ظفروا به ليقتلوه فخرج من مصر خائفاً ، وكان ذلك سببَ توجهه إلى بلاد مَدْيَن . وسمّاه ذَنْباً بحسب ما في شرع القبط ، فإنه لم يكن يومئذ شرع إلهي في أحكام قتل النفس . ويصح أن يكون سمّاه ذنباً لأن قتل أحد في غير قصاص ولا دفاع عن نفس المُدافع يعتبر جرماً في قوانين جماعات البشر من عهد قتل أحد ابني آدم أخاه ، وقد قال في سورة القصص ( 15 ، 16 ) { قال هذا من عمل الشيطان إنه عَدوّ مُضِلّ مبين قال ربّ إنّي ظلمتُ نفسي فاغفر لي } وأيًّا مَّا كان فهو جعله ذنباً لهم عليه .\n\n",
      "translations": [
        {
          "translation": "(And I shall be embarrassed) because of their denial; it is also said that this means: and my heart will shrink from delivering the message, (and my tongue will not speak plainly) out of awe of him, (therefore send for Aaron (to help me)) send Aaron with me to support me; it is also said that this means: send Gabriel to Aaron so that he helps me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويضيق صدري } لعدم اقتداري على قهرهم وعلمي بامتناعهم عن قبول الأوامر الشرعية والأسرار الوحيية وما يكون خارجاً عن طور الفكر والعقل لتدربهم بذلك وتفرعنهم باستبدادهم { ولا ينطلق لساني } معهم في هذه المعاني لكونها على خلاف ما تعوّدوا به ونشؤوا عليه من الحكم العملية الداعية إلى مراعاة التعديل في الأخلاق دون الفناء بالإطلاق { فأرسل إلى هارون } العقل ليؤدّبهم بالمعقول ويسوسهم بما يسهل قبولهم له من رعاية مصلحة الدارين واختيار سعادة المنزلين فتلين عريكتهم وتضعف شكيمتهم بمداراته ورفقه وموافقته لهم بعلمه وحلمه { ولهم عليّ ذنب } بقتلي جبار الشهوة { فأخاف } إن دعوتهم إلى التوحيد وأمرتهم بالتجريد وترك الحظوظ والاقتصار على الحقوق { أن يقتلون } بالاستيلاء والغلبة\n وهذا صورة حال من احتجبت نفسه بالحكمة ولم يتألف بعد طريق الوحدة مع قوّة استعداده وعدم وقوفه مع ما نال من كمال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأخي أولى بالمظاهرة والمعاونة { فَأَرْسِلْ } بمقتضى فضلك وجودك حامل وحيك { إِلَىٰ هَارُونَ } [الشعراء: 13] أخي\n وأمره أن يشركه في أمري\n حتى نذهب إلى فرعون ونبلغ رسالتك إياه\n\n\n{ وَ } لا سيما { لَهُمْ } أي: لقوم فرعون { عَلَيَّ ذَنبٌ } عظيم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأرسلْ إلى هارون } أخي\n أي: أرسل جبريلَ إليه\n ليكون نبياً معي\n أَتَقَوَّى به على تبليغ الرسالة\n وكان هارون بمصر حين بُعث موسى بجبل الطور\n وليس هذا من التعلل والتوقف في الأمر\n وإنما هو استدعاء لما يُعينه على الامتثال\n وتمهيد عذره\n ثم قال: { ولهم عليّ ذنبٌ } أي: تبعة ذنب بقتل القبطيّ\n فحذف المضاف\n أو: سمّي تبعة الذنب ذنباً\n كما يُسَمَّى جزاء السيئة سيئة\n وتسميته ذنباً بحسب زعمهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:97",
      "similarity": 0.5847334004813617
    },
    {
      "verse": "27:70",
      "similarity": 0.4152395206174694
    },
    {
      "verse": "16:127",
      "similarity": 0.4019059113737026
    },
    {
      "verse": "11:12",
      "similarity": 0.3420630284492189
    },
    {
      "verse": "7:122",
      "similarity": 0.32379805450074506
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/026013.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/026013.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/26:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}