{
  "chapter": "الشعراء",
  "text": "وما اسـلكم عليه من اجر ان اجرى الا على رب العلمين",
  "translations": [
    {
      "translation": "I do not ask you for any wage for it. My wage is the responsibility of no one but the Lord of all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I ask no recompense of you for it. My reward is due from none but the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I seek of you no reward for this: my reward is with none except the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I ask no payment from you for my preaching. The Lord of the Universe will give me my reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I do not ask from you any fee for it; my reward is only upon the Lord Of The Creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No reward do I ask of you for it; my reward is only from the Lord of all that exists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not ask you any reward for it; my reward is only with the Lord of the worlds:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I ask of you no wage for this; my wage falls only upon the Lord of all Being;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I ask of you no wage therefor; my wage is the concern only of the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I ask of you no recompense for it, for my only reward is with the Lord of the Universe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I ask of you no hire therefor; my hire is but with the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not ask you any reward for it; my reward lies only with the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No reward do I ask of you for it: my reward is only from the Lord of the Worlds:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No reward do I ask of you for it (my Message of Islamic Monotheism), my reward is only from the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For this I ask of you no wage, for my wage falls only on the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I ask of you no payment for this. My payment is only from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do not ask you for it any payment. My payment is only from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:109] I do not ask of you any reward for it, for delivering it; for my reward lies only with the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And I ask of you no wage) no provision (therefore) in exchange for the profession of Allah's divine Oneness; (my wage) my provision (is the concern only of the Lord of the Worlds.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أني { مَآ أَسْأَلُكُمْ } وأطلب منكم { عَلَيْهِ } أي: على إرشادي وتكميلي وإصلاحي لكم ما أفسدتم على أنفسكم من الأخلاق والأعمال { مِنْ أَجْرٍ } جعل ومال كما يسأل المتشيخة - خذلهم الله - من مريديهم ومحبيهم، بل { إِنْ أَجْرِيَ } أي: ما أجري { إِلاَّ عَلَىٰ رَبِّ ٱلْعَالَمِينَ } [الشعراء: 109] فإنه سبحانه أرسلني إليكم، وأمرني بتبليغ ما أُوحي إليَّ إليكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما أسألكم عليه } أي: على ما أنا مُتصدٍ له من الدعاء والنصح، { من أجرٍ } أصلاً { إنْ أجريَ } فيما أتولاه { إلا على ربِّ العالمين } لا أطمع في غيره، { فاتقوا الله وأطيعون } ، الفاء لترتيب ما بعدها على ما قبلها من تنزيهه عليه السلام عن الطمع، كما أن نظيرتها السابقة لترتيب ما بعدها على أمانته\n والتكرير للتأكيد، والتنبيه على أن كلا منهما مستقل في إيجاب التقوى والطاعة، فكيف إذا اجتمعا؟ كأنه قال: إذا عرفتم رسالتي وأمانتي فاتقوا الله وأطيعون",
      "translations": []
    }
  ]
}