{
  "chapter": "الشعراء",
  "text": "اذ قال لهم اخوهم صلح الا تتقون",
  "translations": [
    {
      "translation": "when their brother Salih said to them, 'Will you not have taqwa?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their brother Saleh said to them: \"Will you not take heed?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall when their brother Salih said to them: \"Have you no fear?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their brother Salih asked them, \"Why do you not fear God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their fellowman Saleh said to them, “Do you not fear?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their brother Salih said to them: \"Will you not have Taqwa\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their brother Salih said to them: Will you not guard (against evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when their brother Salih said to them, 'Will you not be godfearing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their brother Salih said unto them: Will ye not ward off (evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their brother Salih said to them, \"Will you not fear God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their brother Salih said unto them: fear ye not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when Salih, their brother, said to them, ‘Will you not be wary [of Allah]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, their brother Salih said to them: \"Will you not fear (Allah)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their brother Salih (Saleh) said to them: \"Will you not fear Allah and obey Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their brother Salih said to them: 'Will you not be cautious?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their brother Saleh said to them, “Do you not fear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their brother Salih said to them, \"Will you not fear Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:142] when Sālih, their brother, said to them, ‘Will you fear God?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When their brother) their Prophet (Salih said unto them: Will ye not ward off (evil)) the worship of other than Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِذْ قَالَ لَهُمْ أَخُوهُمْ صَالِحٌ } المصلح لأحوالهم حين لاح عليهم علامات الإعراض عن الله، والانحراف عن جادة توحيده: { أَلا تَتَّقُونَ } [الشعراء: 142] عن قهر الله، فتخرجون عن حدوده\n\n\n\n\n{ إِنِّي لَكُمْ رَسُولٌ أَمِينٌ } [الشعراء: 143] أنبهكم على ما يصلح حالكم، وأجنِّبكم عمَّا يفسدكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { كَذَّبَتْ ثمودُ المرسَلين إذ قال لهم أخوهم } نسباً، { صالحٌ ألا تتقون } الله تعالى، فتوحدونه، { إني لكم رسولٌ أمين }: مشهور فيكم بالأمانة، { فاتقوا الله وأطيعون وما أسألكم عليه من أجر إن أجري إلا على ربِّ العالمين أَتُتْركون فيما ها هنا آمنين } أي: أتطمعون أن تتركوا فيما ها هنا من النعمة والتَّرَفُّهِ، آمنين من عقاب الله وعذابه، وأنتم على كفركم وشرككم، كلا، والله لنختبرنكم ببعث الرسول، فإن كفرتم عاجلتكم بالعقوبة\n ثم فسّر ما هم فيه من النعمة بقوله: { في جناتٍ وعيونٍ وزروعٍ ونخلٍ } هو دخل فيما قبله، وخصه بالذكر شرفاً له\n أو: في جنات بلا نخل، { طَلْعُهَا هَضِيمٌ } ، والطلع: عنقود التمر في أول نباته، باقياً في غلافه\n والهضيم: اللطيف اللين للطف الثمر، أو: لأن النخل أنثى وطلع الأنثى ألطف، أو: لنضجه، كأنه: قيل: ونخل قد أرطب ثمره\n قال ابن عباس: إذا أينع فهو هضيم\n وقال أيضاً: هضيم: طيب، وقال الزجاج: هو الذي رطبه بغير نوى، أو: دَانٍ من الأرض، قريب التناول\n { وتَنْحِتُون } أي: تنقبون { من الجبال بيوتاً فارِهين } حال من الواو، أي: حاذقين، أو: ناشطين، أو: أقوياء، وقيل: أَشِرينَ بَطِرِينَ\n قيل: كانوا في زمن الشتاء يسكنون الجبال، وفي زمن الربيع والصيف ينزلون بمواشيهم إلى الريف ومكان الخصب\n { فاتقوا الله وأطيعون ولا تُطيعوا أمرَ المسرفين } الكافرين المجاوزين الحد في الكفر والطغيان، أي: لا تنقادوا لأمرهم، ولا تتبعوا رأيهم، وهم { الذين يُفسدون في الأرض } بالإسراف بالكفر والمعاصي، { ولا يُصلحُونَ } بالإيمان والطاعة\n والمعنى: أن فسادهم خالص، لا يشوبه شيء من الصلاح، كما تكون حال بعض المفسدين مخلوطة ببعض الصلاح\n { قََاُلوا إِنَّما أَنتَ مِنَ الْمُسَحِّرِينَ } الذين سُحِرُووا، حتى غَلَبَ على عقلهم السحرُ { وما أنت إلا بشرٌ مثلنا فأتِ بآيةٍ إن كنت من الصادقين } في دعوى الرسالة، { قال هذه ناقةٌ } ، قالها بعدما أخرجها الله تعالى من الصخرة بدعائه عليه السلام، { لها شِرْبٌ } نصيب من الماء، فلا تُزاحموها فيه، { ولكم شِرْبُ يومٍ مَعْلومٍ } لا تزاحمكم فيه\n رُوي أنهم قالوا: نُريد ناقة عُشَرَاءَ، تخرج من هذه الصخرة، فتلد سَقْباً - والسقب: ولد الناقة - فقعد صالح يتفكر، فقال له جبريل عليه السلام: صَلِّ ركعتين، وسَلْ رَبَّك الناقة، ففعل، فخرجت الناقة، ونتجت سقباً مثلها في العِظم، وصدرها ستون ذراعاً - أي: طولها - وإذا كان يوم شربها شربت ماءهم كله، وإذا كان يوم شربهم لا تشرب فيه\n { ولا تَمَسُّوها بِسُوءٍ } بضرب، أو عقر، أو غير ذلك، { فيأخذَكم عذابُ يومٍ عظيم } ، وصف اليوم بالعظم لعظم ما يحل فيه، وهو أبلغ من تعظيم العذاب، { فعقروها } عَقَرَها \" قَدَّار \" ، وأسند العقر إلى جميعهم لأنهم راضون به\n\n\nرُوي أن عاقرها قال: لا أعقرها حتى ترضوا أجمعين\n وكانوا يدخلون على المرأة في خدرها، فيقولون: أترضين بعقر الناقة؟ فتقول: نعم، وكذلك صبيانهم، { فأصبحوا نادمين } على عقرها خوفاً من نزول العذاب بهم، لا ندم توبة لأنهم طلبوا صالحاً ليقتلوه لَمَّا أيقنوا بالعذاب، وندموا حين لا ينفع الندم، وذلك حين مُعَايَنَةِ العذاب\n { فأخذهم العذابُ } أي: صيحة جبريل، فتقطعت قلوبهم، { فأصبحوا في ديارهم جاثمين }: ميتين، صغيرهم وكبيرهم، { إنّ في ذلك لآية وما كان أكثرهم مؤمنين }\n رُوي أنه أسلم منهم ألفان وثلاثمائة رجل وامرأة\n وقيل: كانوا أربعة آلاف، وقال كعب: كان قوم صالح اثني عشر ألفاً، من سوى النساء والذرية\n ولقد كان قوم عاد مثلهم ست مرات\n قاله القرطبي: قيل: في نفي الإيمان عن أكثرهم إيماءٌ إلى أنه لو آمن أكثرهم أو: شطرهم لما أُخذوا بالعذاب، وأن قريشاً إنما عُصموا من تعجيل العذاب ببركة من آمن منهم\n وعلى أن كان زائدةٌ يكون الضمير لقريش، كما تقدم\n { وإن ربك لهو العزيز الرحيم }\n الإشارة: قوله: { أَتُتركون فيما ها هنا آمنين } أنكر عليهم ركونهم إلى الدنيا وزخارفها الغرارة، واطمئنانهم إليها، وهو غرور وحمق إذ الدنيا كسحابة الصيف، تظل ساعة ثم ترتحل، فالدنيا عرض حائل، وظل آفل، فالكيِّس من أعرض عنها، وتوجه بكليته إلى مولاه، صبر قليلاً وربح كثيراً، والأحمق من وقع في شبكتها، حتى اختطفته منيته، وفي الحديث:\n\n \" الدُّنْيَا دَارُ مَنْ لا دَارَ لَهُ، ومالُ من لا مَالَ له، لَهَا يجمعُ من لا عقل له، وعليها يُعادي من لا علم عنده \"\n \n\nثم ذكر قصة لوط عليه السلام، فقال: { كَذَّبَتْ قَوْمُ لُوطٍ\n\n\n }\n\n",
      "translations": []
    }
  ]
}