{
  "chapter": "الشعراء",
  "text": "قال الم نربك فينا وليدا ولبثت فينا من عمرك سنين",
  "translations": [
    {
      "translation": "(The Pharaoh) said: \"Did we not bring you up as a child? And you lived a number of years of your life with us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said: \"Did we not bring you up among us when you were a child?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh said, \"Did we not bring you up in our home as an infant and did you not live with us for many years\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Firaun, “Did we do not raise you amongst us, as a child? And you spent many years of your life among us!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Fir`awn) said (to Musa): \"Did we not bring you up among us as a child And you did dwell many years of your life with us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Firon) said: Did we not bring you up as a child among us, and you tarried among us for (many) years of your life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Did we not raise thee amongst us as a child? Didst thou not tarry among us years of thy life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Pharaoh) said (unto Moses): Did we not rear thee among us as a child? And thou didst dwell many years of thy life among us,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said to Moses, \"Did we not bring you up among us as a child? And you spent several years of your life with us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fir'awn said: brought we not thee up amongst us as a child? And thou tarriedst amongst us for many years of thy life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [i.e. Pharaoh] said, ‘Did we not rear you as a child among us, and did you not stay with us for years of your life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Pharaoh) said: \"Did we not cherish thee as a child among us, and didst thou not stay in our midst many years of thy life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Fir'aun (Pharaoh)] said [to Musa (Moses)]: \"Did we not bring you up among us as a child? And you did dwell many years of your life with us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Pharaoh) said (to Moses): 'Did We not bring you up when you were a child? And have you not spent years of your life amongst us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Did we not raise you among us as a child, and you stayed among us for many of your years?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Pharaoh] said, \"Did we not raise you among us as a child, and you remained among us for years of your life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:18] He, Pharaoh, said, to Moses, ‘Did we not rear you among us, in our homes, as a child?, as an infant, only recently born but weaned, and did you not stay with us for years of your life?, for thirty years — he would dress from Pharaoh’s clothes and ride chariots of his, and was referred to as Pharaoh’s son.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said): Pharaoh looked at Moses and said: (Did we not rear thee among us as a child?) Moses (And thou didst dwell many years of your life among us) and stayed with us for 30 years,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } في جوابهما مخاطباً لموسى؛ إذ هو أصل في الرسالة، معاتباً عليه، متهمكاً موبخاً: { أَلَمْ نُرَبِّكَ فِينَا } زماناً يا موسى حين كنت { وَلِيداً } لا متعهد لك سوانا { وَلَبِثْتَ فِينَا } بعدما كبرت إلى حيث مضى { مِنْ عُمُرِكَ سِنِينَ } [الشعراء: 18]\n\n\n\n\nقيل: لبث فيهم ثلاثين، ثمَّ خرج إلى مدين عشر سنين، ثمَّ عاد عليهم إلى التوحيد ثلاثين سنة، ثمَّ بقي بعد غرقهم خمسين سنة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: لما أتى موسى وهارونُ فرعونَ وبلَّغا الرسالة، { قال } له: { ألم نُربِّك\n\n\n } إلخ، رُوي أنهما أتيا بابه فلم يُؤذن لهما سنة، حتى قال البواب: إن هنا إنساناً يزعم أنه رسول رب العالمين، فقال: ائذن له، لعلنا نضحك منه، فأَذِن، فدخل، فأدى الرسالة، فعرفه فرعونُ، فقال له: { ألم نُربِّك فينا } في حِجْرنا ومنازلنا، { وليداً } أي طفلاً\n عبّر عنه بذلك لقُرب عهده بالولادة\n وهذه من فرعون معارضة لقول موسى عليه السلام: { إنا رسول رب العالمين } ، بنسبته تربيته إليه وليداً\n ولذلك تجاهل بقوله: { وما ربُّ العالمين } ، وصرح بالجهل بعد ذلك بقوله: { لئن اتخذت إلهاً غيري\n\n\n } إلخ، { ولبثتَ فينا من عُمُرِكَ سنين } قيل: لبث فيهم ثلاثين سنة، ثم خرج إلى مدين، وأقام به عشر سنين، ثم عاد يدعوهم إلى الله - عز وجل - ثلاثين سنة، ثم بقي بعد الغرق خمسين، وقيل: قتل القبطي وهو ابن ثنتي عشرة سنة، وفرّ منهم على إثر ذلك\n والله أعلم",
      "translations": []
    }
  ]
}