{
  "chapter": "الشعراء",
  "text": "قال رب السموت والارض وما بينهما ان كنتم موقنين",
  "translations": [
    {
      "translation": "(Moses) said: \"The Lord of the heavens and the earth and all that lies between them, if you can believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses answered: \"The Lord of the heavens and the earth and of all that is between them, if you were only to believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses replied, \"The Lord of the heavens and the earth and all that is between them, if you want to be certain\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moosa, “Lord of the heavens and the earth and all that is between them; if you believe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Musa) said: \"The Lord of the heavens and the earth, and all that is between them, if you seek to be convinced with certainty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: The Lord of the heavens and the earth and what is between them, if you would be sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'The Lord of the heavens and earth, and what between them is, if you have faith.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: Lord of the heavens and the earth and all that is between them, if ye had but sure belief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"Lord of the heavens and the earth and all that is between them, if only you would be convinced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Lord of the heavens and the earth and whatsoever is in-between, if ye seek to be convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘The Lord of the heavens and the earth and whatever is between them,—should you have conviction.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: \"The Lord and Cherisher of the heavens and the earth, and all between,- if ye want to be quite sure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa (Moses) said: \"Lord of the heavens and the earth, and all that is between them, if you seek to be convinced with certainty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He' (Moses) replied: 'is the Lord of the heavens and the earth and all that is between them, if you believe'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “The Lord of the heavens and the earth, and everything between them, if you are aware.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Moses] said, \"The Lord of the heavens and earth and that between them, if you should be convinced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:24] He said, ‘The Lord of the heavens and the earth and all that is between them, in other words, the Creator of [all] that — should you have conviction’, that He, exalted be He, is their Creator, then believe in Him alone.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Moses) said: Lord of the heavens and the earth) the Lord of the Worlds is the Lord of the heavens and the earth (and all that is between them) of created beings and marvels, (if ye had but sure belief) that Allah has created them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } موسى في جوابه منبهاً له على ظهوره سبحانه في الآفاق: هو { رَبُّ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: موجدهما ومظهرهما من كتم العدم { وَمَا } حدث { بَيْنَهُمَآ } من الكوائن والفواسد { إِن كُنتُمْ مُّوقِنِينَ } [الشعراء: 24] أي: من ذوي الإيقان والعرفان بحقائق المحدثات المبدعة من كتم العدم بلا سبق مادة وزمان، بل بامتداد أضلال الأسماء والصفات الإلهية على مرايا الإعدام بمقتضى التجليات الحبية المنتشئة من الذات الأحدية وإلاَّ فلا يمكن تعريفه بإيراد الأجناس والفصول؛ إذ هو سبحانه منزه عن الاشتراك والامتياز؛ إذ هو الواحد من كل الوجوه، المستقل بوجوب الوجود والتحقق مع امتناع غيره مطلقاً، لا يمكن أن يقومه جنس، ويميزه فصل حتى يركب له حدٌّ أو رسم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو: فما صفته، أو حقيقته؟ { قال } موسى: هو { ربُّ السمواتِ والأرضِ وما بينهما } أي: ما بين الجنسين، { إن كنتم موقنين } أي: إن كنتم موقنين بالأشياء، محققين لها، علمتم ذلك، أو: إن كنتم موقنين شيئاً من الأشياء، فهذا أولى بالإيقان لظهور دليله وإنارة برهانه",
      "translations": []
    }
  ]
}