{
  "chapter": "الشعراء",
  "text": "وتوكل على العزيز الرحيم",
  "translations": [
    {
      "translation": "Put your trust in the Almighty, the Most Merciful,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have trust in the Mighty, the Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in Him Who is Immensely Mighty, Most Compassionate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have trust in the Majestic and All-merciful God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rely upon (Allah) the Almighty, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in the All-Mighty, the Most Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rely on the Mighty, the Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put thy trust in the All-mighty, the All-compassionate\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put thy trust in the Mighty, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your trust in the Mighty One, the Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rely thou upon the Mighty, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in the All-mighty, the All-merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put thy trust on the Exalted in Might, the Merciful,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in the All-Mighty, the Most Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Put your trust in the Almighty, the Most Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And put your trust in the Almighty, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rely upon the Exalted in Might, the Merciful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:217] And put your trust (wa-tawakkal, or read fa-tawakkal, ‘then put your trust’) in the Mighty, the Merciful, God, in other words, entrust Him with all your affairs,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And put thy trust in the Mighty) in His retribution against His enemies, (the Merciful) towards you and all believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن عادوك وعاندوا معك إلى أن قصدوا منك { تَوكَّلْ } في دفعهم وكفاية مؤنتهم { عَلَى ٱلْعَزِيزِ } الغالب لقهر الأعداء، الغالب على غضبهم وانتقامهم بأنواع البلاء { ٱلرَّحِيمِ } [الشعراء: 217] على الأولياء، ينصرهم على أعدائهم، ويدفع عنهم شرورهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وتوكل على العزيز الرحيم } أي: على الذي يقهر أعداءك بعزته وينصرك عليهم برحمته، فإنه يكفيك شر من يعاديك\n { الذي يراك حين تقومُ } للتهجد، { و } يرى { تقلُّبَكَ في الساجدين } في المصلين\n أتبع كونه رحيماً برسوله ما هو من أسباب الرحمة، وهو ذكر ما كان يفعله في جوف الليل، من قيامه للتهجد، وتقلبه في تصفح أحوال المُتَهَجِّدِينَ، ليطلع عليهم من حيث لا يشعرون\n وقيل: معناه: ويراك حين تقوم للصلاة بالناس جماعة، وتقلبك في الساجدين: تصرفه فيما بينهم، بقيامه وركوعه وسجوده وقعوده إذا أمهم\n وعن مقاتل: أنه سأل أبا حنيفة: هل تجد الصلاة بالجماعة في القرآن؟ فقال: لا يحضرني، فتلا له هذه الآية\n وقيل: تقلبه في أصلاب الرجال\n ورُوي عنه صلى الله عليه وسلم في الآية أنه قال:\n\n \" من نبي إلى نبي حتى أخرجتك نبياً \"\n \n\n \n\n{ إنه هو السميعُ } لما تقول، { العليمُ } بما تنويه وتعمله\n هَوَّنَ عليه مشاقّ العبادة، حيث أخبره برؤيته له، إذ لا مشقّة على من يعْلَم أنه يعمل بمرأى من مولاه، وهو كقوله في الحديث القدسي:\n\n \" بعيني ما يتحمل المتحملون من أجلي \" \n\nوالله تعالى أعلم\n الإشارة: ينبغي لمن أُهِّلَ للوعظ والتذكير أن يبدأ بالأقرب فالأقرب، ولو علم أنه لا ينتفع به إلا النزر القليل\n فمن تبعه على مذهبه فَلْيُلِنْ له جانبه وليتواضع له، ومن أعرض عنه واشتغل بهواه فليتبرأ من فعله، ولا ينساه من نصحه، ولذلك قال تعالى: { فإن عصوك فقل إني بريءٌ مما تعملون } ، ولم يقل: \" منكم \" ، وهذا مذهب الجمهور وأن الأخ إذا زلّ إنما يُبغض عمله فقط\n وعن بعض الصحابة - وقد قيل له في أخيه، فقال: إنما أبغض عمله، وإلا فهو أخي، وذُكر مثل ذلك عن أبي الدرداء\n وأن الأخ في الله لا يُبغض لزلته، ولا يترك لشيء من الأشياء، وإنما يبغض عمله، ووافقه على ذلك سلمان، وتابعهما عمر، وخالف في ذلك أبو ذر، فقال: إذا وقعت المخالفة، وانقلب عما كان عليه، فَأَبْغِضْهُ مِنْ حَيْثُ أحببتَهُ\n قال صاحب القوت: وأبو ذر صاحب شدائد، وعزائم، وهذا من عزائمه وشدائده\n هـ\n وهذا في المؤمن بدليل قول أبي الدرداء: الأخ في الله لا يبغض لزلة\n وأما الكافر فصريح آياته:\n\n[الممتحنة: 4]، ونحوها\n وحديث ابن عمر وتبرئه من نفاة القدر - كما في مسلم - موجب للبراءة، وليس لكون حكم الأصول أشد من الفروع\n وذكر في الإحياء تأكيد الإعراض عمن يتعدى أذاه لغيره بظلم، أو غصب، أو غيبة، أو نميمة، أو شهادة زور لأن المعصية شديدة فيما يرجع لأذى الخلق\n هـ\n من الحاشية\n قوله تعالى: { فتوكل على العزيز الرحيم } ، قيل: التوكل: تفويض الرجل أمره إلى من يملك أمره، ويقدر على نفعه وضره، وهو الله وحده، والمتوكل من إذا دهمه أمرٌ لم يحاولْ دفعه عن نفسه بما هو معصية\n وقال الجنيد رضي الله عنه: التوكل أن تقبل بالكلية على ربك، وتُعرض بالكلية عمن دونه فإنَّ حاجتك إنما هي إليه في الدارين\n هـ\n قال القشيري: { وتقلبك في الساجدين } من أصحابك، ويقال: تقلبك في أصلاب آبائك من المسلمين، الذين عرفوا الله، فسجدوا له، دون من لم يعرفه\n هـ\n وفي القوت: قيل: وتقلبك في أصلاب الأنبياء - عليهم السلام، يقلبك في صلب نبي بعد نبي، حتى أخرجك من ذرية أسماعيل، وروينا معنى ذلك عن رسول الله صلى الله عليه وسلم، والحاصل: أنه من ذرية الأنبياء والمؤمنين الساجدين في الجملة، ولا يقتضي كل فرد من الأفراد\n هـ\n ثم ذكر قوله: { وما تنزّلت به الشياطين } ، فقال: { هَلْ أُنَبِّئُكُمْ عَلَىٰ مَن تَنَزَّلُ\n\n\n }\n",
      "translations": []
    }
  ]
}