{
  "chapter": "الشعراء",
  "text": "الا الذين ءامنوا۟ وعملوا۟ الصلحت وذكروا۟ الله كثيرا وانتصروا۟ منۢ بعد ما ظلموا۟ وسيعلم الذين ظلموا۟ اى منقلب ينقلبون",
  "translations": [
    {
      "translation": "except those who have iman and do right actions and remember Allah repeatedly and defend themselves after they have been wronged? Those who do wrong will soon know the kind of reversal they will receive!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe and do the right, and remember God a great deal, who retaliate only when they have been wronged. Yet the oppressors will now come to know through what reversals they will be overthrown!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who believed and acted righteously and remembered Allah much, and when they themselves were subjected to wrong, they exacted retribution no more than to the extent of the wrong? Soon will the wrong-doers know the end that they shall reach.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteously striving believers among them who remember God very often and use their talent to seek help after they have been wronged are the exceptional. The unjust will soon know how terrible their end will be.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believed and did good deeds, and profusely remembered Allah, and took revenge after they had been wronged*; and soon the unjust will come to know upon which side they will be overturned**. (* The Muslim poets who praise Allah and the Prophet. ** The disbelievers will be punished.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe and do righteous deeds, and remember Allah much and vindicate themselves after they have been wronged. And those who do wrong will come to know by what overturning they will be overturned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe and do good and remember Allah much, and defend themselves after they are oppressed; and they who act unjustly shall know to what final place of turning they shall turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those that believe, and do righteous deeds, and remember God oft, and help themselves after being wronged; and those who do wrong shall surely know by what overturning they will he overturned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those who believe and do good works, and remember Allah much, and vindicate themselves after they have been wronged. Those who do wrong will come to know by what a (great) reverse they will be overturned!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not so the true believers who do good works and remember God with fervour and defend themselves only after they are wronged. The wrongdoers will soon know how evil a turn their affairs will take.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those who believed and worked righteous works and remembered Allah much, and vindicated themselves after they had been wronged. And anon those who do wrong shall come to know with what a translating they shall be translated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Barring those who have faith, do righteous deeds, and remember Allah much often, and vindicate themselves after they have been wronged. And the wrongdoers will soon know at what goal they will end up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe, work righteousness, engage much in the remembrance of Allah, and defend themselves only after they are unjustly attacked. And soon will the unjust assailants know what vicissitudes their affairs will take!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe (in the Oneness of Allah Islamic Monotheism), and do righteous deeds, and remember Allah much, and reply back (in poetry) to the unjust poetry (which the pagan poets utter against the Muslims). And those who do wrong will come to know by what overturning they will be overturned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who believe, and do good works and remember Allah in abundance and became victorious after they had been wronged. The wrongdoers will surely know which turn they will be returning to (Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who believe, and do good deeds, and remember God frequently, and defend themselves after they are wronged. As for those who do wrong, they will know by what overturning they will be overturned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those [poets] who believe and do righteous deeds and remember Allah often and defend [the Muslims] after they were wronged. And those who have wronged are going to know to what [kind of] return they will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:227] Save those, poets, who believe and perform righteous deeds and remember God frequently, in other words, [those whom] poetry does not distract from the remembrance [of God], and vindicate themselves, by lampooning the disbelievers, after they have been wronged, by the disbelievers’ reviling of them [as belonging] together with all believers — such [individuals] are not reprehensible. God, exalted be He, says: God does not like the utterance of evil words out loud, unless a person has been wronged [Q. 4:148]; He, exalted be He, also says: so whoever commits aggression against you, commit aggression against him in the manner that he committed against you [Q. 2:194]; and those, poets and others, who are wrongdoers will soon know the reversal, the return, with which they will meet, [by which] they will return, after death. Meccan; it consists of 93, 94, or 95 verses revealed after sūrat al-Shu‘arā’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Save those who believe) in Muhammad (pbuh) and in the Qur'an, like Hassan Ibn Thabit and his fellow believing poets (and do good works) between them and their Lord, (and remember Allah much) in their poetry, (and vindicate themselves) through Muhammad (pbuh) and his Companions by answering back the disbelievers (after they have been wronged) after being satirized by the disbelievers. (Those who do wrong) those who satirized the Prophet (pbuh) and his Companions (will come to know by what a (great) reverse they will be overturned!) what kind of destination they will return to in the Hereafter, i.e. the Fire, if they do not believe. And Allah knows best the secrets of His Book'. And of the surah in which the Ants are mentioned, which is all Meccan and consists of 94 verses, 1,149 words and 4,767 letters: Surah 27: The Ants (al-Naml) And of the surah in which the Ants are mentioned, which is all Meccan and consists of 94 verses, 1,149 words and 4,767 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وذكروا الله كثيراً } أي: كان ذكر الله وتلاوة القرآن أغلب عليهم من الشعر\n وإذا قالوا الشعر قالوا في توحيد الله والثناء عليه\n والحكمة والموعظة\n والزهد والأدب\n ومدح الرسول صلى الله عليه وسلم والأولياء\n وأحق الخلق بالهجاء من كَذَّبَ رسولَ الله صلى الله عليه وسلم وهجاه\n وعن كعب بن مالك: أن رسول الله صلى الله عليه وسلم قال:\n \" أهْجُهُمْ\n فَوَالذِي نَفْسِي بِيَدِهِ لَهُو أشدُّ عَلَيْهِمْ مِن رَشْقِ النَّبْلِ \" \n\n وكان يقول لحسّان:\n \" قل\n وروح القدس معك \"\n \n{ وانتصروا من بعد ما ظُلِمُوا } أي: ردوا على المشركين\n الذين هجوا النبي صلى الله عليه وسلم والمؤمنين\n وروي أنه لما نزلت الآية: جاء حسان\n وكعب بن مالك\n وعبد الله بن رواحة\n يبكون\n فقالوا يا رسول الله: أنزل الله تعالى هذه الآية\n وهو يعلم أنا شعراء؟ فقال:\n \" اقرؤوا ما بعدها: { إلا الذين آمنوا\n\n\n } هم أنتم وانتصروا\n هم أنتم \"\n \nومرَّ عمر رضي الله عنه وحسان رضي الله عنه ينشد الشعر في المسجد\n فَلَحَظَ إليه\n فقال: كنتُ أُنْشِدُ فيه\n وفيه من هو خير منك\n ثم التفت إلى أبي هريرة\n فقال: أَنْشُدُكَ بالله\n أسمعت النبي صلى الله عليه وسلم يقول:\n \" أجبْ عني\n اللهم أيِّدْه بروح القدس \" \nقال: اللهم نعم\n  { وَسَيَعْلَمُ الَّذِين ظَلَمُوا أيَّ مُنَقلَبٍ يَنقَلِبُونَ } أيَّ مرجع يرجعون إليه\n وهو تهديد شديد\n ووعيد أكيد لما في { سيعلم } من تهويل متعلقة\n وفي { الذين ظلموا } من الإطلاق والتعميم\n\nوفي { أي منقلب ينقلبون } من الإبهام والتهويل\n وتلاها أبو بكر لعمر رضي الله عنه حين عهد إليه\n وكان السلف يتواعظون بها\n و المعنى: سيعلم أهل الظلم ما تكون عاقبتهم\n حين يقدمون عليَّ وأيَّ منقلب ينقلبون حين يفدون إليّ\n اللهم ثبت أقدامنا على المنهاج القويم\n حين نلقاك يا أرحم الراحمين\n  الإشارة: هل أنبئكم على قَلْبِ مَنْ تَنَزَّلَتْ الشياطينُ\n وسكنت فيه\n تنزل على قلب كل أفاك أثيم\n خارب من النور\n محشو بالوسواس والخواطر\n يلقون السمع إلى هرج الدنيا وأخبارها\n وهو سبب فتنتها فإن القلب إذا غاب عن أخبار الدنيا وأهلها\n سكن فيه النور وتأنس بالله\n وإذا سكن إلى أخبار الدنيا وأهلها سكنت في الظلمة\n وتأنس بالخلق\n وغاب عن الحق\n ولذلك قيل: ينبغي للمؤمن أن يكون كالفكرون إذا كان وحده انبسط\n وإذا رأى أحداً أدخل رأسه معه وأكثر ما يسمع من هرج الدنيا كذب وإليه الإشارة بقوله: { وأكثرهم كاذبون } \n ومن جملة ما يفسد القلب: تولهه بالشعر\n وفي الحديث:\n \" لأنْ يمتلىءَ جوفُ أحدِكُم قَيْحَاً خيرٌ له من أن يَمْتَلِىءَ شِعْراً \" \nأو كما قال صلى الله عليه وسلم\n إلا من كان شعره في توحيد الله\n أو في الطريق\n كالزهد في الدنيا\n والترهيب من الركون إليها\n والزجر عن الاغترار بزخارفها الغرارة\n والافتتان بملاذها الفانية\n وغير ذلك\n أو في مدح النبي صلى الله عليه وسلم\n والمشايخ الموصلين إليه تعالى\n بشرط أن يكون الغالب عليه ذكر الله\n وقوله تعالى: { وانتصروا من بعدها ظلموا } \n أي: جاروا على نفوسهم بعدما جارت عليهم\n وقهروها بعد ما قَهَرَتْهُمْ\n { وسيعلم الذين ظلموا أي منقلب ينقلبون } قال ابن عطاء: سيعلم المعرض عنا ما فاته منا\n هـ\n وفي الحكم: \" ماذا فقد مَنْ وَجَدَكَ\n وما الذي وجد مَنْ فَقَدَكَ؟ لقد خاب من رضي دونك بدلاً\n ولقد خسر من بغى عنك مُتَحَولاً\n كيف يُرْجَى سِوَاك وأنت ما قَطَعْتَ الإحسانَ\n أم كيف يطلب من غيرك وأنت ما بدلت عادة الامتنان؟ \" وبالله التوفيق\n وهو الهادي إلى سواء الطريق\n وصلى الله على سيدنا محمد وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:41",
      "similarity": 0.3926565601138392
    },
    {
      "verse": "33:41",
      "similarity": 0.37205624003613924
    },
    {
      "verse": "23:85",
      "similarity": 0.34221040391510177
    },
    {
      "verse": "19:96",
      "similarity": 0.3346438076037814
    },
    {
      "verse": "41:46",
      "similarity": 0.3099530186757598
    }
  ]
}