{
  "chapter": "الشعراء",
  "text": "افرءيت ان متعنهم سنين",
  "translations": [
    {
      "translation": "Do you think, if We let them enjoy themselves for years",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just think: If We let them enjoy (the good things of life) for a few years more,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you consider that if We were to let them enjoy life for many years\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not see that even if We give them respite for years\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore observe, that if We give them some comforts for some years, –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think, if We do let them enjoy for years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you then considered if We let them enjoy themselves for years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What thinkest thou? If We give them enjoyment of days for many years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou then seen, if We content them for (long) years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Think! If We let them enjoy life for some years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou? - if We let them enjoy for years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell me, should We let them enjoy for some years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou? If We do let them enjoy (this life) for a few years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell Me, if We do let them enjoy for years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do you see? If We gave them enjoyment for years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you considered: if We let them enjoy themselves for some years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then have you considered if We gave them enjoyment for years\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:205] Consider [this] then — inform Me: If We were to let them enjoy [life] for [many] years,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou then seen) O Muhammad, (We content them for (long) years) in their state of disbelief,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَفَرَأَيْتَ } وعلمت أيها الرائي الخبير { إِن } أملهنا في الدنيا زماناً طويلاً بأن { مَّتَّعْنَاهُمْ سِنِينَ } [الشعراء: 205] فيها تمتيعاً بليغاً، ورفهناهم ترفيهاً بديعاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أفرأيتَ } أي: أخبرني\n ولما كانت الرؤية من أقوى أسباب الإخبار بالشيء وأشهرها شاع استعمال \" أرأيت \" في معنى أخبرني\n والخطاب لكل من يسمع، أي: أخبرني أيها السامع: { إن متعناهم } إن متعنا هؤلاء الكفرة { سنينَ } متطاولة بطول الأعمار وطيب المعاش، ثم جاءهم ما كانوا يُوعدون } من العذاب، { ما أغنى عنهم } أي: أيُّ سيء أو أيُّ إغناء أغنى عنهم { ما كانوا يُمَتَّعُونَ } أي: كونهم متمتعين ذلك التمتع المديد، أيُّ شيء أغنى في دفع العذاب، وما: مصدرية، أو: ما كانوا يتمتعون به من متاع الحياة الدنيا، على أنها موصولة، حذف عائدها، وأيا ما كان فالاستفهام للإنكار والنفي\n وقيل: ما: نافية، أي: لم يغن عنهم تمتعهم المتطاول في دفع العذاب\n والأول أرجح\n { وما أهلكنا من قريةٍ } من القرى المهلكةَ، { إلا لها مُنْذِرُون } قد أنذروا أهلها لتقوم الحجة عليهم، { ذِكْرَى } أي: تذكرة، وهو مصد منذرون لأن أنذر وذكر متقاربان، كأنه قيل: لها مُذكرون تذكرة\n أو مفعول له، أي: ينذرونهم لأجل التذكرة والموعظة، أو خبر، أي: هذه ذكرى، أو يكون ذكرى متعلقة بأهلكنا مفعولاً له،والمعنى: وما أهلكنا من أهل قرية ظالمين إلا بعد ما ألزمناهم الحجة، بإرسال المنذرين إليهم ليكون إهلاكهم تذكرة وعبرة لغيرهم، فلا يعصون مثل عصيانهم، { وما كنا ظالمين } فنهلك قوماً غير ظالمين، أو قبل إنذارهم\n والتعبير عن ذلك بنفي الظالمية مع أن إهلاكهم قبل الإنذار ليس بظلم إذ لا يجب عليه تعالى شيء - كما تقرر من قاعدة أهل السنة - لبيان كمال نزاهته تعالى عن ذلك، وتحقيقاً لكمال عدله\n والله تعالى أعلم\n الإشارة: يقول الحق جل جلاله، في جانب أهل البطالة والغفلة: أفرأيت إن متعناهم سنين بالأموال والنساء والبنين، فاشتغلوا بجمع الأموال والدثور، وبناء الغرف وتشييد القصور،ثم جاءهم ما كانوا يوعدون من الموت، والرحيل من الأوطان، ومفارقة الأحباب والعشائر والإخوان، أيُّ شيء أغنى عنهم ما كانوا يتمتعون به، من لذيذ المآكل والمشارب، ومفاخر الملابس والمراكب، هيهات هيهات، قد انقطعت اللذات، وفنيت الشهوات، وما بقي إلا الحسرات، فتأمل أيها العبد فيما مضى من عمرك، فما بقي في يدك منه إلا ما كان في طاعة مولاك، من ذكرٍ،، أو تلاوةٍ، أو صلاةٍ، أو صيام، أو علم نافع، أو تعليم، أو فكرة، أو شهود، وما سوى ذلك بطالة وخسران، فالوقت الذي تصرفه في طاعة مولاك ذخائره موجودة، وكنوزه مَذْخُورة، والوقت الذي تصرفه في هوى نفسك ضائع، تجيد حسرته يوم القيامة، ففي الحديث:\n\n\n\n \" ليس يتحسر أهل الجنة إلا على ساعة مضت لهم، لم يذكروا الله تعالى فيها \" \n\nقال يحيى بن معاذ: أشد الناس عذاباً يوم القيامة من اغتر بحياته والْتَذَّ بمراداته، وسكن إلى مألوفاته، والله تعالى يقول: { أفرأيت إن متعناهم سنين\n\n\n } الآية\n وعن ميمون بن مهران: أنه لقي الحسن في الطواف، وكان يتمنى لقاءه، فقال له: عِظني، فلم يزده على تلاوة هذه الآية، فقال: لقد وَعظت فأبلغت\n وعن عمر بن العزيز رضي الله عنه: أنه كان يقرؤها عند جلوسه ليحكم بين الناس\n هـ\n وبالله التوفيق\n ثم تمَّم قوله: { وإنّه لتنزيل ربّ العالمين } ، بقوله: { وَمَا تَنَزَّلَتْ بِهِ\n\n\n }\n",
      "translations": []
    }
  ]
}