{
  "chapter": "الشعراء",
  "text": "لا يؤمنون به حتى يروا۟ العذاب الاليم",
  "translations": [
    {
      "translation": "They will not believe it until they behold the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it until they clearly see the grievous chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it until they suffer the painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it to the extent that they see the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it until they see the painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it until they see the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who will not believe in it, until they see the painful chastisement\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it till they behold the painful doom,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they will not believe in it until they see the grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe therein until they behold the torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they do not believe in it until they sight the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it until they see the grievous Penalty;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it until they see the painful torment;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they shall not believe in it until they see the painful punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it until they witness the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not believe in it until they see the painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:201] They will not believe in it until they behold the painful chastisement,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They will not believe in it) so that they do not believe in Muhammad (pbuh) or in the Qur'an (till they behold the painful doom,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { لا يؤمنون } توضيح وتقرير لما قبله\n ويجوز أن يكون حالاً، أي: سلكناه فيها غير مؤمنين به، أو: مثل ذلك السلك البديع سلكناه، أي: أدخلنا القرآن في قلوب المجرمين، ففهموا معانيه، وعرفوا فصاحته وبلاغته، وأنه خارج عن القوة البشرية، من حَيْثُ النَّظْم المعجز والأخبار الغيبية\n وقد انضم إليه اتفاق علماء أهل الكتاب على اتفاقه لما في أيديهم من الكتب السماوية\n ومع ذلك { لا يؤمنون به } ، ولا يتأثرون بأمثال تلك الأمور الداعية إلى الإيمان، بل يستمرون على ما هم عليه، { حتى يَرَوُا العذابَ الأليم } الملجئ إلى الإيمان، حين لا ينفعهم الإيمان، { فيأتيهم بَغْتَةً } فجأة في الدنيا والآخرة { وهم لا يشعرون } بإتيانه، { فيقولون هل نحن مُنْظَرُون } مُؤَخَّرُون ساعة\n\n\nقالوه تَحَسُّراً على ما فات من الإيمان، وتمنياً للإمهال لتلافي ما فرضوه\n والله تعالى أعلم\n الإشارة: إذا تطهر القلب من الأكدار والأغيار، وملئ بالمعارف والأسرار، كان مَهْبِطاً لوحي الإلهام ووحي الإعلام، ومحلاً لتنزل الملائكة الكرام، إذ كل ما أعطى للرسول كان لوارثه الحقيق منه شِرْبٌ ونصيب ليكون من الواعظين بلسان عربي مبين، يُفصح عن جواهر الحقائق، ويواقيت العلوم، وما ينطق به من العلوم يكون موافقاً لما في زُبُر الأولين، وإن كان أمياً لأن علوم الأذواق لا تختلف\n أو لم يكن لهم آية على ولايته أن يعلمه علماء أهل فنه من المحققين\n وقال الورتجبي على هذه الآية: أخبر الله سبحانه أن قلب محمد صلى الله عليه وسلم محل نزول كلامه الأزلي لأنه مصفى من جميع الحدثان، بتجلي مشاهدة الرحمن، فكان قلبه ـ عليه الصلاة والسلام ـ صَدَف لآلِئَ خطابِ الحق، يسْبَح في بحار الكرم، فيتلقف كلام الحق من الحق بلا واسطة، وذلك سر عجيب وعلم غريب لأنه يجمع كلام الحق وما اتصل به، وكلامه لم ينفصل عنه، وكيف تفارق الصفات الذات، لكن أبقى في قلبه ظاهره وعلمه وسره، فجبريل ـ عليه السلام ـ في البين: واسطة لجهة الحرمة، وذكر ذلك بقوله: { نزل به الروح الأمين على قلبك\n\n\n } لأن القلب معدن الإلهام والوحي والكلام والرؤية والعرفان، به يحفظ الكلام\n وفائدة ذلك: الإعلام بسر وجود الإنسان، وأنه ليس شيء يليق بالخطاب ونزول الأنباء إلا قلبه، وكل قلب مسدود بعوارض البشرية لا يسمع خطاب الحق، ولا يرى جمال الحق\n قال أبو بكر بن طاهر: ما أنزله على جبريل جعله محلاً للإنذار، لا التحقيق، والحقيقة هو ما تلقفه من الحق، فلم يخبر عنه، ولم يشرف عليه خلق من الجن والإنس والملائكة لأنه ما أطاق ذلك أحد سواه\n وما أنزل جبريل جعله للخلق، فقال: { لتكون من المنذرين } بما نزل به جبريل على قلبك المتحقق، فإنك متحقق بما كافحناك به، وخاطبناك على مقامٍ لو شاهدك فيه جبريل لاحترق\n هـ\n على تصحيف في النسخة\n وبالله التوفيق\n ثم هددّهم بنزول العذاب، فقال: { أَفَبِعَذَابِنَا\n\n\n\n }\n",
      "translations": []
    }
  ]
}