{
  "chapter": "الشعراء",
  "text": "قال رب المشرق والمغرب وما بينهما ان كنتم تعقلون",
  "translations": [
    {
      "translation": "He said, 'The Lord of the East and the West and everything between them if you used your intellect.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: \"The Lord of the East and the Lord of the West and all that lies between them, if you have sense.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses continued: \"(He is) the Lord of the east and the west, and all between them. If you only had any understanding!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses continued, \"He is the Lord of the East and West and all that is between them, if only you would think\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “The Lord of the East and the West and all that is between them; if you have sense.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Musa) said: \"Lord of the east and the west, and all that is between them, if you did but understand!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: The Lord of the east and the west and what is between them, if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'The Lord of the East and West, and what between them is, if you have understanding,'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Lord of the East and the West and all that is between them, if ye did but understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said, \"He is the Lord of the East and the West, and all that lies between them, if only you could understand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Lord of the east and the west and whatsoever is in-between, if ye understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘The Lord of the east and the west and whatever is between them—should you exercise your reason.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said: \"Lord of the East and the West, and all between! if ye only had sense!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa (Moses) said: \"Lord of the east and the west, and all that is between them, if you did but understand!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Lord of the East and the West' said he (Moses), 'and all that is between them, if you could understand'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Lord of the East and the West, and everything between them, if you understand.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Moses] said, \"Lord of the east and the west and that between them, if you were to reason.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:28] He, Moses, said, ‘The Lord of the east and the west and all that is between them — should you comprehend,’, that He is such [a Lord] then believe in Him alone.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Moses said: (Lord of the East) He is the Lord of the East (and the West) and the Lord of the West (and all that is between them, if ye did but understand) if you did but believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما لم تنبهوا بالتنبيهات المذكورة، بل ازدادوا إنكاراً فوق إنكار إلى حيث نسبوه إلى الخبط الجنون { قَالَ } موسى كلاماً جملياً كلياً، مشتملاً على جميع الأمور المنبهة: هو سبحانه { رَبُّ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ وَمَا بَيْنَهُمَآ } أي: مشرق الشمس ومديرها كل يوم بمدار مخصوص، ومغيبها كذلك تتميماً وتدبيراً لمصالح عباده وجميع حوائجهم المتعلقة لمعاشهم على الوجه الأحكم الأبلغ، الأعدل بلا فوت شيء منها { إِن كُنتُمْ تَعْقِلُونَ } [الشعراء: 28] وتطرحون عقولكم إلى التأمل والنظر في عجائب مصنوعاته وغرائب مخترعاته، وكيفية تدبيراته في إبدائه وإنشائه، وإبقائه، وإفنائه، وفي جميع الأمور المتعلقة بألوهيته وربوبيته\n\n\n\n\nإن اجهدتم حق السعي والجهد في شأنه لاهتديتم إلى وحدة ذاته، ووجوب وجوده واستقلاله في التصرف في مظاهره ومصنوعاته، فحينئذٍ لم يبقَ لكم شائبة شكٍ فيه سبحانه حتى تحتاجوا إلى السؤال والكشف عن جنابه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } فرعونُ: { إنّ رَسُولَكُمْ الذي أُرْسِلَ إِليكُمْ لمجنون } حيث يزعم أن في الوجود ألهاً غيري، أو: حيث لا يطابق جوابه سؤالي لأني أسأله عن الحقيقة وهو يجيبني بالخاصية، { قال } موسى عليه السلام: { ربُّ المشرق والمغرب وما بينهما إن كنتم تعقلون } فتستدلون بما أقول حتى تعرفوا ربكم\n وهذا غاية الإرشاد، حيث عمم أولاً بخلق السموات والأرض وما بينهما، ثم خصص من العام أنفسهم وآباءهم لأنّ أقرب المنظور فيه من العاقل نفسه، ومن ولد منه، وما شاهد من أحواله، من وقت ميلاده إلى وفاته، ثم خصّص المشرق والمغرب لأن طلوع الشمس من أحد الخافقين وغروبهما في الآخر، على تقدير مستقيم وحساب مستوٍ، من أقوى الدلائل على وحدانية الربوبية، ووجوب وجودها\n أو: تقول: لما سأله عن ماهية الربوبية جهلاً فأجابه، بالخاصية، { قال ألا تستمعون }؟ فعاد موسى إلى مثل قوله، فجنّنه فرعون، زاعماً أنه حائد عن الجواب، فعاد ثالثاً مبيناً أن الواجب الوجود، الفردَ الصمد، لا يدرك بالكُنْهِ، إنما يعرف بالصفات، وما عرفه بالذات إلا خواص الخواص، فالسؤال عن الذات من أمثاله جهل وحمق\n ولذلك قال: { إن كنتم تعقلون } ، أي: إن كان لكم عقل علمتم أنه لا يمكن أن تعرفوه إلا بهذا الطريق\n\n\nقال ابن جزيّ: إن قيل: كيف قال أولاُ: { إن كنتم موقنين } ، ثم قال آخراً: { إن كنتم تعقلون }؟ فالجواب: أنه لاَيَنَ أولاً طمعاً في إيمانهم، فلما رأى منهم العناد والمغالطة وبخهم بقوله \" إن كنتم تعقلون \" ، وجعل ذلك في مقابلة قول فرعون: { إن رسولكم الذي أُرسل إليكم لمجنون }\n هـ\n ولما تجبر فرعون وبهت { قال لَئِنِ اتَّخَذْتَ إلهاً غيري لأَجعلنَك من المسجونين } ، أي: لأجعلنك واحداً ممن عرفت حالهم في سجوني، وكان من عادته أن يأخذ من يرى سجنه، فيطرحه في هوّة ذاهبة في الأرض، بعيدة العمق، فرداً، لا ينظر فيها ولا يسمع، وكان ذلك أشدّ من القتل\n ولو قال: لأسجننك، لم يؤد هذا المعنى، وإن كان أخصر\n قاله النسفي\n الإشارة: التربية لها حق يراعي ويجب شكرها، ولا فرق بين تربية البشرية والروحانية\n قال القشيري: لم يجحد موسى حقَّ التربية والإحسانَ إليه في الظاهر، ولكن بَيَّنَ أنه إذا أمر الله بشيءٍ وَجَبَ اتباعُ أمره، وإذا كانت تربية المخلوقين تُوجب حقاً، فتربية الله أولى بأن يعَظِّمَ العبدُ قَدْرَها\n هـ\n فكل من أحسن إلى بشريتك بشيء وجب عليه شكره بالإحسان إليه، ولو بالدعاء، وكل من أحسن إلى روحانيتك بالعلم أو بالمعرفة، وجب عليك خدمته وتعظيمه، وإنكار ذلك بسبب المقت والطرد، والعياذ بالله\n وقول فرعون: { وما رب العالمين }: سؤال عن حقيقة الذات، ومعرفة الكنه متعذرة إذ ليس كمثله شيء، وأقرب ما يجاب به قوله تعالى:\n\n[الحديد: 3] فهذه الأسماء الأربعة أحاطت بالذات في الجملة، ولم تترك منها شيئاً، والإحاطة بالكنه متعذرة، ولو وقعت الإحاطة لم يبق للعارفين تَرَق، مع أن ترقيهم في كشوفات الذات لا ينقطع أبداً، في هذه الدار الفانية، وفي تلك الدار الباقية\n وبالله التوفيق\n ثم ذكر معجزة العصا وما يتبعها، فقال: { قَالَ أَوَلَوْ جِئْتُكَ\n\n\n }\n",
      "translations": []
    }
  ]
}