{
  "chapter": "الشعراء",
  "text": "فلا تدع مع الله الها ءاخر فتكون من المعذبين",
  "translations": [
    {
      "translation": "So call on no other god but God, lest you are condemned to torment;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not call any other god beside Allah lest you become of those who will be punished,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), do not worship anything besides God lest you suffer the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore do not worship another deity along with Allah, for you will be punished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, invoke not with Allah another god lest you should be among those who receive punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So call not upon another god with Allah, lest you be of those who are punished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So call thou not upon another god with God, lest thou shouldst be one of those that are chastised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor invoke not with Allah another god, lest thou be one of the doomed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not call on any deity besides God, lest you incur His punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So call not thou unto anot her god along with Allah, lest thou be of the doomed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not invoke any god besides Allah, lest you should be among the punished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So call not on any other god with Allah, or thou wilt be among those under the Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So invoke not with Allah another ilah (god) lest you be among those who receive punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not call upon another god with Allah, lest you should be one of those who are punished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not pray to another god with God, else you will be of those tormented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not invoke with Allah another deity and [thus] be among the punished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:213] So do not invoke any other god with God, lest you be among the chastised — if you were to do what they call you to.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore invoke not) worship not (with Allah another god) among the idols, (lest thou be one of the doomed) in the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فلا تدع مع الله إلهاً آخر } أي: لا تلتفت إلى وجود الغير بظهور النفس ولا تحتجب في الدعوة بالكثرة عن الوحدة { فتكون من المعذّبين } بإلقاء الشياطين وإن امتنع تنزّلهم بالموافقة والمراقبة كقوله:\n\n[الحج، الآية:52]، فإنه لا يأمن في الإنذار والنزول إلى مبالغ عقول المنذرين ونفوسهم إلقاءهم وإن أمن تنزّلهم ومصاحبتهم وإغواءهم عند التلقي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفقال مخاطباً لحبيبه صلى الله عليه وسلم، ناهياً له عن التوجه والالتفات نحو الغير مطلقاً: { فَلاَ تَدْعُ مَعَ ٱللَّهِ } الأحد الفرد الصمد، المستقل بالألوهية والربوبية { إِلَـٰهاً آخَرَ } من مظاهره ومصنوعاته؛ إذ الكل في حيطة أوصافه وأسمائه لا وجود لها لذاتها، بل إنما هي عكوس وأظلال للأسماء والصفات الإلهية { فَتَكُونَ } أنت بجمعيتك وكمالك لو دعوت، واتخذت إلهاً آخر صرت { مِنَ ٱلْمُعَذَّبِينَ } [الشعراء: 113] بأنواع التعذيبات الصورية والمعنوية والعقلية والحسية، الجسمانية والروحانية\n\n\nإنما خاطب سبحانه حبيبه صلى الله عليه وسلم بهذا الخطاب الهائل، عاتيه بهذا العتاب الهائب؛ ليتنبه المؤمنون، ويتفطنوا بكمال غيرة الله المتفرد المتوحد، القهار للأغيار مطلقاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}