{
  "chapter": "الشعراء",
  "text": "فالقوا۟ حبالهم وعصيهم وقالوا۟ بعزة فرعون انا لنحن الغلبون",
  "translations": [
    {
      "translation": "They threw down their ropes and staffs and said, 'By the might of Pharaoh we are the winners.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they cast their ropes and rods, and said: \"By the glory of Pharaoh, we shall be victorious.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon they threw down their ropes and their rods, and said: \"By the glory of Pharaoh, we shall prevail.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they cast down their ropes and staffs saying, \"By the honor of the Pharaoh we shall certainly become the winners\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they threw down their ropes and their staves and exclaimed, “By the honour of Firaun, indeed victory is ours!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, they threw their ropes and their sticks, and said: \"By the might of Fir`awn, it is we who will certainly win!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they cast down their cords and their rods and said: By Firon's power, we shall most surely be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they cast their ropes and their staffs, and said, 'By the might of Pharaoh we shall be the victors.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they threw down their cords and their staves and said: By Pharaoh's might, lo! we verily are the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they cast down their ropes and staffs, and said, \"By Pharaoh's honour, we shall surely win.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they cast their cords and their staves, and said: by the might of Fir'awn, verily we! we shall be the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they threw down their sticks and ropes, and said, ‘By the might of Pharaoh, we shall surely be victorious!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they threw their ropes and their rods, and said: \"By the might of Pharaoh, it is we who will certainly win!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they threw their ropes and their sticks, and said: \"By the might of Fir'aun (Pharaoh), it is we who will certainly win!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they cast their ropes and staffs, saying: 'By Pharaoh's might, we shall be the victors'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they threw their ropes and their sticks, and said, “By the majesty of Pharaoh, we will be the winners.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they threw their ropes and their staffs and said, \"By the might of Pharaoh, indeed it is we who are predominant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:44] So they cast their ropes and their staffs, and said, ‘By the power of Pharaoh we shall surely be the victors!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then they threw down their cords and their staves) 72 ropes and 72 staffs (and said) i.e. the wizards said: (By Pharaoh's might, lo! we verily are the winners) against Moses. 409\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَلْقَوْاْ حِبَالَهُمْ وَعِصِيَّهُمْ } التي احتالوا فيها بأنواع الحيل { وَقَالُواْ } حين إلقائها مقسما: { بِعِزَّةِ فِرْعَونَ } وسطوته وجلاله { إِنَّا لَنَحْنُ ٱلْغَالِبُونَ } [الشعراء: 44] المقصورون على الغلبة على موسى وأخيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n لم يُرد به الأمر بالسحر والتمويه، بل الإذن في تقديم ما هم فاعلوه البتة توسلاً به إلى إظهار الحق وإبطال الباطل، { فَأَلْقَواْ حِبَالَهم وعِصِيَّهُم } ، وكانوا سبعين ألف حبل وسبعين ألف عصاً\n وقيل: كانت الحبال اثنين وسبعين، وكذا العصِيِّ\n { وقالوا } بعد الإلقاء، لما رأوها تتحرك وتقبل وتُدبر: { بعزَّةِ فرعونَ إنا لنحن الغالبون } ، قالوا ذلك لفرط اعتقادهم في أنفسهم، وإتيانهم بأقصى ما يمكن أن يؤتى به من السحر، أقسموا بعزته وقوته، وهو من أيمان الجاهلية\n والله تعالى أعلم\n الإشارة: السحر على قسمين: سحر القلوب إلى حضرة الحق، وسحر النفوس إلى عالم الخلق، أو: إلى عالم الخيال\n فالأول: من شأن العارفين بالله، الداعين إلى الله، فهم يسحرون قلوب من أتى إليهم إلى حضرة القدس، ومحل الأنس، فيقال في شأنهم: فجمع السحرة بقلوبهم، إلى ميقات يوم معلوم، وهو يوم الفتح والتمكين، أو يوم النفحات، عند اتفاق جمعهم في مكان معلوم\n وقيل للناس، وهم عوام الناس: هل أنتم مجتمعون لتفيقوا من سكرتكم، وتتيقظوا من نوم غفلتكم، لعنا نتبع السحرة إن كانوا هم الغالبين، ولا شك في غلبتهم ونصرهم لقوله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:66",
      "similarity": 0.6846332744212449
    },
    {
      "verse": "50:16",
      "similarity": 0.4060194461642425
    },
    {
      "verse": "3:112",
      "similarity": 0.3442972423748275
    },
    {
      "verse": "7:113",
      "similarity": 0.2608535113227347
    },
    {
      "verse": "26:41",
      "similarity": 0.25642155711973363
    }
  ]
}