{
  "chapter": "الشعراء",
  "text": "ان نشا ننزل عليهم من السماء ءاية فظلت اعنقهم لها خضعين",
  "translations": [
    {
      "translation": "If We wished We could send down a Sign to them from heaven, before which their heads would be bowed low in subjection.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We could send down from the heavens a sign to them if We pleased, before which their heads would remain bowed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We can send down a Sign to them from heaven, so their necks will be humbled to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We wanted, We would have sent them a miracle from the sky to make their heads hang down in submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We can send down on them a sign from the sky so that their leaders would remain bowed before it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We could send down to them from the heaven a sign, to which they would bend their necks in humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We please, We should send down upon them a sign from the heaven so that their necks should stoop to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We shall send down on them out of heaven a sign, so their necks will stay humbled to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We can send down on them from the sky a portent so that their necks would remain bowed before it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if We had so willed, We could have sent down to them a sign from the heavens so that their heads would be bowed down before it in utter humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We list, We can send down unto them a sign from the heaven so that their necks would became to it submissive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We wish We will send down to them a sign from the sky before which their heads will remain bowed in humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If (such) were Our Will, We could send down to them from the sky a Sign, to which they would bend their necks in humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We could send down to them from the heaven a sign, to which they would bend their necks in humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We can send down on them a sign from heaven before which their necks will remain humbled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We can send down upon them a sign from heaven, at which their necks will stay bent in humility.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We willed, We could send down to them from the sky a sign for which their necks would remain humbled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:4] If We will We will send down to them a sign from the heaven before which their necks will remain (fa-zallat, [although grammatically in the past tense] is being used in the sense of the imperfect tense) bowed in humility, and they will believe (since ‘necks’ are described as ‘bowed in humility’, [a status] which in fact refers to those who possess them, the adjectival form [khādi‘ūn, ‘bowed in humility’] used therein is the one [normally] used for rational beings).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنْ نَشَأْ نُنَزِّلْ عَلَيْهِمْ مِنَ السَّمَاءِ آَيَةً فَظَلَّتْ أَعْنَاقُهُمْ لَهَا خَاضِعِينَ (4)استئناف بياني ناشىء عن قوله : { أن لا يكونوا مؤمنين } \\[ الشعراء : 3 \\] لأن التسلية على عدم إيمانهم تثير في النفس سؤالاً عن إمهالهم دون عقوبة ليؤمنوا ، كما قال موسى { ربّنا إنك آتيت فرعون وملأه زينةً وأموالاً في الحياة الدنيا ربّنا ليَضِلّوا عن سَبيلك ربّنا اطمِسْ على أموالهم واشدُدْ على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم } \\[ يونس : 88 \\] ، فأجيب بأن الله قادر على ذلك ، فهذا الاستئناف اعتراض بين الجملتين المعطوفة إحداهما على الأخرى .ومفعول { نشأ } محذوف يدل عليه جواب الشرط على الطريقة الغالبة في حذف مفعول فعل المشيئة . والتقدير : إن نشأ تنزيلَ آية ملجئة ننزلها .وجيء بحرف { إنْ } الذي الغالب فيه أن يشعر بعدم الجزم بوقوع الشرط للإشعار بأن ذلك لا يشاؤه الله لحكمة اقتضت أن لا يشاءه .ومعنى انتفاء هذه المشيئة أن الحكمة الإلهية اقتضت أن يحصل الإيمان عن نظر واختيار لأن ذلك أجدى لانتشار سمعة الإسلام في مبدإ ظهوره . فالمراد بالآية العلامة التي تدل على تهديدهم بالإهلاك تهديداً محسوساً بأن تظهر لهم بوارق تنذر باقتراب عذاب . وهذا من معنى قوله تعالى : { وإن كان كَبُر عليك إعراضُهم فإن استطعتَ أن تَبْتَغِيَ نَفَقاً في الأرض أو سُلّماً في السماء فتأتيهم بآية } \\[ الأنعام : 35 \\] ، وليس المراد آيات القرآن وذلك أنهم لم يقتنعوا بآيات القرآن .وجعل تنزيل الآية من السماء حينئذ أوضح وأشدّ تخويفاً لقلّة العهد بأمثالها ولتوقع كل من تحت السماء أن تصيبه . فإن قلت : لماذا لم يُرِهِمْ آية كما أُرِي بنو إسرائيل نَتْقَ الجبل فوقهم كأنه ظُلَّةٌ؟ قلت : كان بنو إسرائيل مؤمنين بموسى وما جاء به فلم يكن إظهار الآيات لهم لإلجائهم على الإيمان ولكنه كان لزيادة تثبيتهم كما قال إبراهيم { أرني كيف تحيي الموتى } \\[ البقرة : 260 \\] .وفرّع على تنزيل الآية ما هو في معنى الصفة لها وهو جملة { فظلت أعناقهم لها خاضعين } بفاء التعقيب .وعطف { فظلت } وهو ماض على المضارع قوله : { ننزل } لأن المعطوف عليه جواب شرط ، فللمعطوف حكم جواب الشرط فاستوى فيه صيغة المضارع وصيغة الماضي لأن أداة الشرط تخلص الماضي للاستقبال؛ ألا ترى أنه لو قيل : إن شئنا نزّلنا أو إن نَشأ نَزَّلنا ، لكان سواء إذ التحقيق أنه لا مانع من اختلاف فعلي الشرط والجزاء بالمضارَعيَّة والماضوية ، على أن المعطوفات يتّسع فيها ما لا يُتّسع في المعطوف عليها لقاعدة : أن يغتفر في الثواني ما لا يغتفر في الأوائل ، كما في القاعدة الثامنة من الباب الثامن من «مغني اللبيب» ، غير أن هذا الاختلاف بين الفعلين لا يخلو من خصوصية في كلام البليغ وخاصة في الكلام المعجز ، وهي هنا أمران : التفنّن بين الصيغتين ، وتقريبُ زَمن مضي المعقب بالفاء من زمن حصول الجزاء بحيث يكون حصول خضوعهم للآية بمنزلة حصول تنزيلها فيتمّ ذلك سريعاً حتى يخيّل لهم من سُرعة حصوله أنه أمر مضى فلذلك قال : { فظلت } ولم يقل : فتظل .وهذا قريب من استعمال الماضي في قوله تعالى : { أتى أمر الله فلا تستعجلوه } \\[ النحل : 1 \\] وكلاهما للتهديد ، ونظيره لقصد التشويق : قد قامت الصلاة .والخضوع : التطامن والتواضع . ويستعمل في الانقياد مجازاً لأن الانقياد من أسباب الخضوع . وإسناد الخضوع إلى الأعناق مجاز عقلي ، وفيه تمثيل لحال المنقادين الخائفين الأذلّة بحال الخاضعين الذين يتّقون أن تصيبهم قاصمة على رؤوسهم فهم يطأطئون رؤوسهم وينحنون اتقاء المصيبة النازلة بهم .والأعناق : جمع عُنُق بضمتين وقد تسكن النون وهو الرقبة ، وهو مؤنث . وقيل : المضموم النون مؤنث ، والساكن النون مذكر .ولما كانت الأعناق هي مظهر الخضوع أُسند الخضوع إليها وهو في الحقيقة مما يسند إلى أصحابها ومنه قوله تعالى : { وخَشَعَت الأصواتُ للرحمن } \\[ طه : 108 \\] أي أهل الأصوات بأصواتهم كقول الأعشى :( كذلكَ فافعَلْ ما حييتَ إذَا شتوا ) ... وأقْدم إذا ما أعينُ الناس تَفْرَقفأسند الفَرق إلى العيون على سبيل المجاز العقلي لأن الأعين سبب الفرق عند رؤية الأشياء المخيفة . ومنه قوله تعالى : { سحَرُوا أعينَ الناس } \\[ الأعراف : 116 \\] وإنما سحَروا الناس سحراً ناشئاً عن رؤية شعوذة السحر بأعينهم ، مع ما يزيد به قوله : «ظلت أعناقهم لها خاضعين» من الإشارة إلى تمثيل حالهم ، ومقتضى الظاهر فظلوا لها خاضعين بأعناقهم .وفي إجراء ضمير العقلاء في قوله : { خاضعين } على الأعناق تجريد للمجاز العقلي في إسناد { خاضعين إلى أعناقهم } لأن مقتضى الجري على وتيرة المجاز أن يقال لها : خاضعة ، وذلك خضوع من توقع لحاق العذاب النازل . وعن مجاهد : أن الأعناق هنا جمع عُنُق بضمتين يطلق على سيد القوم ورئيسهم كما يطلق عليه رأس القوم وصدر القوم ، أي فظلت سادتهم ، يعني الذين أغرَوْهم بالكفر خاضعين ، فيكون الكلام تهديداً لزعمائهم الذين زيَّنوا لهم الاستمرار على الكفر ، وهو تفسير ضعيف . وعن ابن زيد والأخفش : الأعناق الجماعات واحدها عُنُق بضمتين جماعة الناس ، أي فظلّوا خاضعين جماعات جماعات ، وهذا أضعف من سابقه .ومن بدع التفاسير وركيكها ما نسبه الثعلبي إلى ابن عباس أنه قال : نزلت هذه الآية فينا وفي بني أمية فتذل لنا أعناقهم بعد صعوبة ويلحقهم هوانٌ بعد عِزّة ، وهذا من تحريف كلم القرآن عن مواضعه ونحاشي ابن عباس رضي الله عنه أن يقوله وهو الذي دعا له رسول الله صلى الله عليه وسلم بأن يُعلّمه التأويل . وهذا من موضوعات دعاة المُسَوِّدة مثل أبي مسلم الخراساني وكم لهم في الموضوعات من اختلاق ، والقرآن أجلّ من أن يتعرض لهذه السفاسف .وقرأ الجمهور : { ننزّل } بالتشديد في الزاي وفتح النون الثانية . وقرأ ابن كثير وأبو عمرو ويعقوب بضم النون الثانية وتخفيف الزاي .\n\n",
      "translations": [
        {
          "translation": "(If We will, We can send down on them from the sky a portent) a sign (so that their necks would remain bowed before it) in humiliation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَظَلَّتْ أَعْنَاقُهُمْ لَهَا خَاضِعِينَ } معناهُ تُكتَبُ أذلاّء\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Then their necks will remain bowed to her in submission} means that their necks will be humbled before her.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن نشأ ننزّل عليهم من السماء } من العالم العلوي بتأييدنا لك قهراً فتخضع أعناقهم له\n منقادين\n مسلمين\n مستسلمين ظاهراً\n وإن لم يدخل الإيمان في قلوبهم كما كان يوم الفتح أي: امتنع إيمانهم لأنه أمر قلبي سيظهر إسلامهم بالقهر والإلجاء والاضطرار\n { وإذ نادى ربّك موسى } القلب المهذب بالحكمة العملية\n المدرب بالعلوم العقلية\n المشوّق بذكر الأنوار القدسية والكمالات الأنسية\n ووصف المفارقات والمجردات إلى الحضرة الإلهية الغالب على القوّة الشهوانية بالسعي في طلب الأرزاق الروحانية من المعارف اليقينية والمعاني الحقيقية بعد قتل جبار الشهوة الذي كان يجبر لفرعون النفس الأمّارة وفراره من استيلائها إلى مدين مدينة العلم من الأفق الروحاني ووصوله إلى خدمة شعيب الروح في مقام السرّ الذي هو محل المكالمة والمناجاة بالسير العقلي بطريق الحكمة\n واكتساب الأخلاق بالتعديل قبل السلوك في الله بطريق التوحيد والرياضة بالترك والتجريد مع بقاء النفس المتقوية بالعلم والمعرفة\n المتزينة بالفضيلة والمتبجحة بزينتها وكمالها\n الطاغية بظهورها على أشرف أحوالها\n المنازعة ربّها صفة العظمة والكبرياء\n المعجبة بالبهجة والبهاء لاحتجابها بأنائيتها وانتحالها كمال الحق برؤيته لها\n فكانت شرّ الناس كما قال عليه الصلاة والصلاة:\n \" شرّ الناس من قامت القيامة عليه وهو حيّ ولو ماتت \" \nثم قامت القيامة عليها لكانت خير الناس\n { إن ائت القوم الظالمين } من القوى النفسانية الفرعونية العانية لفرعون النفس الأمّارة\n المتخذة لها ربّاً\n الواضعة كمال الحق موضع كمالها وهو أفحش الظلم { ألا يتّقون } قهري وبأسي بتدميرهم وإفنائهم { أخاف أن يكذبون } في دعوتي إلى التوحيد ولم يطيعوني في الرياضة والترك والتجريد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { إِن } أي: إن تعلق إرادتنا ومشيئتنا لإيمانهم { نَّشَأْ نُنَزِّلْ عَلَيْهِمْ مِّنَ ٱلسَّمَآءِ آيَةً } ملجئة لهم إلى الإيمان والتصديق { فَظَلَّتْ أَعْنَاقُهُمْ } أي: صارت حين نزول الآية الملجئة أعناقهم التي هي أسباب كبرهم وخيلائهم من كمال الإطاعة والانقياد { لَهَا } أي: للآية الملجئة النازلة { خَاضِعِينَ } [الشعراء: 4] منكوسين منكسرين منخفضين\n بحيث لا يتأتى لهم الإعراض عنها والتكذيب بها أصلاً\n\n\n{ وَ } متى لم تتعلق مشيئتنا لم يؤمنوا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فظلَّتْ أعناقُهم لها خاضعين } منقادين\n والأصل: فظلوا لها خاضعين\n فأقمحت الأعناق لزيادة التقرير ببيان موضع الخضوع\n وترك الخبر على حاله من جمع العقلاء\n وقيل: لمَّا وصفت الأعناق بصفة العقلاء أجريت مجراهم\n كقوله تعالى:\n[يوسف: 4]\n وقيل المراد بالأعناق: الرؤساء ومقدمو الجماعة\n وقيل: الجماعة\n من قولهم: جاءنا عنق من الناس\n أي: فوج\n وقرئ: خاضعة\n على الأصل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:32",
      "similarity": 0.7314353786718794
    },
    {
      "verse": "13:5",
      "similarity": 0.20876878817145755
    },
    {
      "verse": "17:13",
      "similarity": 0.2052469493175754
    },
    {
      "verse": "17:29",
      "similarity": 0.20112610635926723
    },
    {
      "verse": "38:33",
      "similarity": 0.17784339021460396
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/026004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/026004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/26:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}