{
  "chapter": "الشعراء",
  "text": "قال ءامنتم له قبل ان ءاذن لكم انه لكبيركم الذى علمكم السحر فلسوف تعلمون لاقطعن ايديكم وارجلكم من خلف ولاصلبنكم اجمعين",
  "translations": [
    {
      "translation": "He said, 'Have you had iman in him before I authorised you? He is your chief who taught you magic. But you will soon know! I will cut off your alternate hands and feet and I will crucify every one of you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said (the Pharaoh): \"You have come to believe in him before I gave you leave. He is surely your chief, who taught you magic. You will soon come to know: I will have your hands and feet cut off on alternate sides, and have every one of you crucified.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said: \"You accepted the word of Moses even before I granted you the leave to do so. Surely he is your chief who has taught you magic. Soon shall you come to know. I shall cut off your hands and feet on opposite sides and shall crucify all of you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pharaoh said, \"You believed without my permission? He seems to be your chief who has taught you magic. But you will soon know (the result of what you have done).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Firaun, “You accepted faith in him before I permitted you! He is indeed your leader who taught you magic; so now you will come to know; I swear, I will certainly cut off your hands and your feet from alternate sides, and crucify all of you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"You have believed in him before I give you leave. Surely, he indeed is your chief, who has taught you magic! So verily, you shall come to know. Verily, I will cut off your hands and your feet on opposite sides, and I will crucify you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he: You believe in him before I give you permission; most surely he is the chief of you who taught you the magic, so you shall know: certainly I will cut off your hands and your feet on opposite sides, and certainly I will crucify you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Pharaoh, 'You have believed him before I gave you leave. Why, he is the chief of you, the same that taught you sorcery; now you shall know! I shall assuredly cut off alternately your hands and feet, then I shall crucify you all together.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Pharaoh) said: Ye put your faith in him before I give you leave. Lo! he doubtless is your chief who taught you magic! But verily ye shall come to know. Verily I will cut off your hands and your feet alternately, and verily I will crucify you every one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh said, \"Have you come to believe in him, before I have given you permission? He is surely your master who has taught you magic. But you shall see. I will cut off your hands and feet on alternate sides and crucify you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fir'awn said: ye believed in him ere I gave you leave. Verily he is your chief who hath taught you magic, so ye shall surely come to know. Surely I shall cut off your hands and feet on opposite sides and surely I shall crucify you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [i.e. Pharaoh] said, ‘Do you profess faith in Him before I should permit you? He is indeed your chief who has taught you magic! Soon you will know! I will cut off your hands and feet from opposite sides, and I will crucify you all.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said (Pharaoh): \"Believe ye in Him before I give you permission? surely he is your leader, who has taught you sorcery! but soon shall ye know! Be sure I will cut off your hands and your feet on opposite sides, and I will cause you all to die on the cross!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Fir'aun (Pharaoh)] said: \"You have believed in him before I give you leave. Surely, he indeed is your chief, who has taught you magic! So verily, you shall come to know. Verily, I will cut off your hands and your feet on opposite sides, and I will crucify you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Pharaoh) said: 'You have believed him before I have given you permission. He is the chief of you who has taught you sorcery. But you shall know. I will surely cut off on opposite sides a hand and a foot, and crucify you all.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Did you believe in Him before I have given you permission? He must be your chief, who taught you magic. You will soon know. I will cut off your hands and feet on opposite sides, and I will crucify you all.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Pharaoh] said, \"You believed Moses before I gave you permission. Indeed, he is your leader who has taught you magic, but you are going to know. I will surely cut off your hands and your feet on opposite sides, and I will surely crucify you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:49] Pharaoh said, ‘Do you believe (a-āmantum, read pronouncing both hamzas or replacing the second one with an alif) him, Moses, though I have not given you leave? He is indeed your chief, the one who has taught you sorcery — so that he only taught you some [tricks] and then surpassed you with others. Soon you will know, what I will do with you! I will assuredly cut off your hands and legs on opposite sides — in other words, the right hand of each one together with his left leg — then I shall surely crucify you all.’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Pharaoh) said, You put your faith in him) you believed in him (before I give you leave) I commanded you to do so. (Lo! He) i.e. Moses (doubtless is your chief) your master wizard (who taught you magic! But verily ye shall come to know) what I will do to you. (Verily I will cut off your hands and your feet alternately) the right hand with the left leg, (and verily I will crucify you everyone) on the bank of the river of Egypt.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّهُ لَكَبِيرُكُمُ ٱلَّذِي عَلَّمَكُمُ ٱلسِّحْرَ } أَراد بهِ موسى إنهُ هو الذي عَلَّمهُم السِّحرَ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Indeed, it is your Lord who has taught you magic}, [means that] Moses intended that he is the one who taught them magic.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما رأى فرعون منهم ما رآى { قَالَ } مهدداً متوعداً إياهم: { آمَنتُمْ لَهُ } أي: صدقتم موسى بغتةً\n وآمنتم لإلهه { قَبْلَ أَنْ آذَنَ لَكُمْ } بتصديقه\n فقد لاح { إِنَّهُ لَكَبِيرُكُمُ } ومعلمكم { ٱلَّذِي عَلَّمَكُمُ ٱلسِّحْرَ } اتفقتهم مه في الخلوة\n لتفضحونا على رءوس الملأ { فَلَسَوْفَ تَعْلَمُونَ } أيها المفسدون أنَّا أقدر على الانتقام والتعذيب أم رب موسى؟! { لأُقَطِّعَنَّ } أولاً { أَيْدِيَكُمْ وَأَرْجُلَكُمْ مِّنْ خِلاَفٍ } متبادلتين { وَلأُصَلِّبَنَّكُمْ } بعد ذلك على رءوس الأشهاد { أَجْمَعِينَ } [الشعراء: 49] بجمعكم هذا\n ليعتبر من حالكم من في قلبه خلافنا ونفاقنا\n\n\nوبعدما سمعوا تهديده ووعيده { قَالُواْ } منقطعين نحو الحق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم هَدَّدَهُم بقوله: { لأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلافٍ } \n يداً من جهة ورجلاً من أخرى\n أو: من أجل خلافٍ ظهر منكم\n { وَلأُصَلِّبَنَّكُمْ أَجْمَعِينَ } قيل: إنه فعل ذلك\n ورُوي عن ابن عباس وغيره\n وقيل: إنه لم يقدر على ذلك\n لقوله تعالى:\n[القصص: 35]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:124",
      "similarity": 0.847439653682878
    },
    {
      "verse": "86:7",
      "similarity": 0.5612218183290074
    },
    {
      "verse": "20:71",
      "similarity": 0.4973178648168586
    },
    {
      "verse": "4:157",
      "similarity": 0.3335729168242455
    },
    {
      "verse": "12:41",
      "similarity": 0.28254406057020137
    }
  ]
}