{
  "chapter": "الشعراء",
  "text": "وما ياتيهم من ذكر من الرحمن محدث الا كانوا۟ عنه معرضين",
  "translations": [
    {
      "translation": "But no fresh reminder from the All-Merciful reaches them without their turning away from it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never does a new reminder come to them from Ar-Rahman but they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never does there come to them an admonition from the Merciful Lord but they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a new message comes to them from the Beneficent God, they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never does a new advice come to them from the Most Gracious, but they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never comes there unto them a Reminder as a recent revelation from the Most Gracious, but they turn away therefrom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there does not come to them a new reminder from the Beneficent Allah but they turn aside from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But never fresh remembrance comes to them from the All-merciful, except they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never cometh there unto them a fresh reminder from the Beneficent One, but they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever there comes to them any fresh warning from the Merciful, they always turn their backs on it:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there cometh not unto them any fresh admonition from the Compassionate but they are wont to be there from backsliders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There does not come to them any new reminder from the All-beneficent but that they disregard it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there comes not to them a newly-revealed Message from (Allah) Most Gracious, but they turn away therefrom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never comes there unto them a Reminder as a recent revelation from the Most Beneficent (Allah), but they turn away therefrom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A fresh remembrance has never come to them from the Merciful, except they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No fresh reminder comes to them from the Most Merciful, but they turn their backs at it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no revelation comes to them anew from the Most Merciful except that they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:5] And there would never come to them from the Compassionate One any remembrance, any [revelation from the] Qur’ān, that is new (muhdathin, is an explicative adjective) but that they used to disregard it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنَ الرَّحْمَنِ مُحْدَثٍ إِلَّا كَانُوا عَنْهُ مُعْرِضِينَ (5)عطف على جملة : { لعلك باخع نفسك ألا يكونوا مؤمنين } \\[ الشعراء : 3 \\] أي هذه شنشنتهم فلا تأسف لعدم إيمانهم بآيات الكتاب المبين ، وما يجيئهم منها من بعدُ فسيعرضون عنه لأنهم عُرفوا بالإعراض .والمضارعُ هنا لإفادة التجدد والاستمرار . فالذكر هو القرآن لأنه تذكير للناس بالأدلة . وقد تقدم وجه تسميته ذكراً عند قوله تعالى : { وقالوا يأيها الذي نزل عليه الذكر إنك لمجنون } في سورة الحجر ( 6 ) .والمحدَث : الجديد ، أي من ذكر بعدَ ذكر يُذكّرهم بما أنزل من القرآن من قبله فالمعنى المستفاد من وصفه بالمحدث غير المعنى المستفاد من إسناد صيغة المضارع في قوله : { ما يأتيهم من ذكر } . فأفاد الأمران أنه ذكر متجدّد مستمر وأن بعضه يعقب بعضاً ويؤيده . وقد تقدم في سورة الأنبياء ( 2 ، 3 ) قوله : { ما يأتيهم من ذكر من ربّهم محدَث إلاّ استمعوه وهم يلْعَبون لاهية قلوبهم }وذكر اسم الرحمن هنا دون وصف الرّب كما في سورة الأنبياء لأن السياق هنا لتسلية النبي على إعراض قومه فكان في وصف مُؤْتي الذكر بالرحمن تشنيع لحال المعرضين وتعريض لغباوتهم أن يُعرضوا عمَّا هو رحمة لهم ، فإذا كانوا لا يدركون صلاحهم فلا تَذهبْ نفسُك حسراتتٍ على قوم أضاعوا نفعهم وأنت قد أرشدتهم إليه وذكرتهم ، كما قال المثل : لا يحزنك دم هراقه أهله وقال النابغة :فإن تغلب شقاوتكم عليكم ... فإني في صلاحكم سعَيْتُوفي الإتيان بفعل كانوا } وخبره دون أن يقال : إلا أعرضوا ، إفادةُ أن إعراضهم راسخ فيهم وأنه قديم مستمرّ إذ أخبر عنهم قبل ذلك بقوله : { أن لا يكونوا مؤمنين } \\[ الشعراء : 3 \\] ، فانتفاء كون إيمانهم واقعاً هو إعراض منهم عن دعوة الرسول التي طريقها الذكر بالقرآن فإذا أتاهم ذكر بعد الذكر الذي لم يؤمنوا بسببه وجدهم على إعراضهم القديم .و { مِن } في قوله : { من ذكر } مؤكدة لعموم نفي الأحوال .و { مِن } التي في قوله : { من الرحمن } ابتدائية .والاستثناء من أحوال عامة ، فجملة : { كانوا عنه معرضين } في موضع الحال من ضمير { يأتيهم من ذكر } . وتقدم المجرور لرعاية الفاصلة .\n\n",
      "translations": [
        {
          "translation": "(Never cometh there unto them a fresh) i.e. fresh in its coming, in succession (reminder) never did Gabriel bring revelation of the Qur'an to their Prophet (from the Beneficent One, but they turn away from it) except that they disbelieved in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { مَا يَأْتِيهِم مِّن ذِكْرٍ } أي: عظةٍ وتذكيرٍ نازلٍ { مِّنَ } قِبَل { ٱلرَّحْمَـٰنِ } تفضلاً عليهم { مُحْدَثٍ } مستبدعٍ على مقتضى الأعصار والأزمان\n لإصلاح نفوس أهلها من المفاسد والضلال { إِلاَّ كَانُواْ عَنْهُ } أي: عن الذكر المحدث { مُعْرِضِينَ } [الشعراء: 5] منصرفين\n لعدم تعلق مشيئتنا بقبولهم\n بل إنما إرسلنا يا أكمل الرسل إليهم\n وأمرنا بدعوتهم و تبليغهم\n ليتعظ ويتذكر منهم ممن سبقت له العناية الأزلية من خلَّص عبادنا\n وتعلقت إرادتنا بهدايتهم ورشدهم في أصل فطرتهم واستعدادهم\n وبعدما بلغت إليهم الذكر والعظة المهذِّبة لقلوبهم عن رين الكفر والشرك العارض لهم من قبل آبائهم وأسلافهم سمعوا سمع قبولٍ ورضاءٍ\n إذ كل ميسر\n موفق لما خلق له\n\n\nوأمَّا المجبولون على فطرة الشقاوة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما يأتيهم من ذِكْرٍ من الرحمنِ مُحْدَثٍ إلا كانوا عنه معرضين } \n هذا بيان لشدة شكيمتهم وعدم ارعوائهم عما كانوا عليه من الكفر والتكذيب لصرف رسوله صلى الله عليه وسلم عن الحرص على إسلامهم\n وقطع رجائه فيهم على الجملة\n قال القشيري: أي: ما نُجَدِّد لهم شَرْعاً\n أو نرسل رسولاً إلا أعرضوا عما دلّ برهانه عليه\n وقابلوه بالتكذيب\n فلو أنهم أنعموا النظرَ في آياتهم\n لا تضح لهم صدقهم\n ولكن المقسوم من الخذلان في سابق الحُكْمِ يمنعهم من الإيمان والتصديق\n هـ\n والتعرض لعنوان الرحمة لتغليظ شناعتهم\n وتهويل جنايتهم فإن الإعراض عما يأتيهم من جنابه عز وجل على الإطلاق شنيع قبيح\n وعما يأتيهم بموجب الرحمة\n لمحض منفعتهم\n أشنع وأقبح\n أي: ما يأتيهم من موعظة من المواعظ القرآنية أو من طائفة نازلة من القرآن تُذكّرهم أكمل تذكير وتنبهُهم من الغفلة أتم تنبيه\n بمقتضى رحمته الواسعة\n إلا جددوا إعراضاً عنه على وجه التكذيب والاستهزاء إصراراً على ما كانوا عليه من الكفر والضلال\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:50",
      "similarity": 0.5947744277075715
    },
    {
      "verse": "52:34",
      "similarity": 0.5944531592095887
    },
    {
      "verse": "18:70",
      "similarity": 0.5796857690614202
    },
    {
      "verse": "20:9",
      "similarity": 0.5675529350638405
    },
    {
      "verse": "79:15",
      "similarity": 0.5645499450417019
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/026005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/026005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/26:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}