{
  "chapter": "الشعراء",
  "text": "فاتبعوهم مشرقين",
  "translations": [
    {
      "translation": "So they pursued them towards the east.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At sunrise they set off in pursuit of them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus we let the Israelites inherit them all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the Firaun’s people followed them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, they pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they followed them at the sunrise;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they overtook them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pharaoh and his people pursued them at sunrise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At sunrise, they followed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:60]   Then they pursued them, they caught them up, at sunrise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they overtook them at sunrise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَتْبَعُوهُم مُّشْرِقِينَ } أي مُصْبِحِينَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما اجتمع الجيش من أطراف المدائن، وازدحموا على باب فرعون خرجوا خلفهم مسرعين { فَأَتْبَعُوهُم مُّشْرِقِينَ } [الشعراء: 60] أي: وقت طلوع الشمس من المشرق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { فأَتْبَعُوهم } أي: فأتبع فرعونُ وقومُه بني إسرائيل، أي: لحقوا بهم، وقرئ بشد التاء، على الأصل، { مُشْرِقين } داخلين في وقت شروق الشمس، أي: طلوعها، { فلما تراءى الجمعان } أي: تقابلا، بحيث يرى كلُّ فريقٍ صاحبَه، أي: بنو إسرائيل والقبط، { قال أصحابُ موسى إنا لمدْرَكون } أي: قرب أن يلحقنا عدونا، وأمامنا البحر، { قال } موسى عليه السلام ثقة بوعد ربه: { كلاَّ } ارتدعوا عن سوء الظن بالله، فلن يُدرككم أبداً، { إنَّ معي ربي سيهدين } أي: سيهديني طريق النجاة منهم\n رُوي أن موسى عليه السلام لما انتهى إلى البحر هاجت الريح، والبحر يرمي بموج مثل الجبال، فقال يُوشع عليه السلام: يا كليم الله، أين أُمرتَ، فقد غَشِيَنَا فرعونُ، والبحرُ أمامنا؟ قال عليه السلام: ها هنا، فخاض يُوشع الماء، وضرب موسى بعصاه البحر، فكان ما كان، وقال الذي كان يكتم إيمانه يا مكلم الله أين أُمرتَ؟ قال: ها هنا\n فكبح فرسَه بلجامه، ثم أقحمه البحر، فرسب في الماء، وذهب القومُ يصنعون مثل ذلك، فلم يقدروا، فجعل موسى لا يدري كيف يصنع؟ فأوحى الله إليه: { أن اضرب بعصاك البحر } ، فضربه، فانفلق، فإذا الرجل واقف على فرسه، لم يبتلَّ لِبْدُه ولا سَرْجه\n وقال محمد بن حمزة: لما انتهى موسى إلى البحر، دعا، فقال: يا من كان قبل كل شيء، والمكوّن لكلّ شيء، والكائن بعد كلِّ شيء، اجعل لنا مخرجاً، فأوحى الله إليه: أن اضرب بعصاك البحر، وذلك قوله تعالى: { فأوحينا إلى موسى أن اضرب بعصاك البحرَ } أي: القلزم، أو النيل، { فانفلق } أي: فضرب فانفلق وانشقَّ فصار اثني عشر فرقاً على عدد الأسباط\n { فكان كلُّ فِرْقٍ } أي: جزء من الماء { كالطَّوْدِ }: كالجبل المنطاد في السماء { العظيم } ، وبين تلك الجبال من الماء مسالك، بأن صار الماء مكفوفاً كالجامد، وما بينها يَبَس، فدخل كل سبط في شعْبٍ منها\n { وأَزْلَفْنَا } أي: قَرَّبْنَا { ثَمَّ الآخرين } أي: فرعون وقومه، حتى دخلوا على أثرهم مداخلهم، { وأنجينا موسى ومَن معه أجمعين } من الغرق بحفظ البحر على تلك الهيئة، حتى عبروه، { ثُمَّ أغرقنا الآخرين } بإطباقه عليهم\n قال النسفي: وفيه إبطالُ القول بتأثير الكواكب في الآجال وغيرها من الحوادث، فإنهم اجتمعوا في الهلاك، على اختلاف طوالعهم\n رُوي أن جبريل عليه السلام كان بين بني إسرائيل وبين آل فرعون، فكان يقول لبني إسرائيل: ليلحق آخركم بأولكم، ويستقبل القبط فيقول: رويدكم، ليلحَق آخركم\n هـ\n { إنَّ في ذلك لآيةً } أي: في جميع ما فصّل مما صدر عن موسى عليه السلام، وما ظهر على يديه من المعجزات القاهرة، وفيما فعل فرعونُ وقومه من الأفعال والأقوال، وما فُعل بهم من العذاب والنكال، لعبرة عظيمة، لا تكاد تُوصف، موجبة لأن يعتبر المعتبرون، ويقيسوا شأن النبي صلى الله عليه وسلم بشأن موسى عليه السلام، وحال أنفسهم بحال أولئك المهلكين، ويجتنبوا تعاطي ما كانوا يتعاطونه من الكفر والمعاصي ومخالفة الرسول، فيؤمنوا بالله تعالى ويطيعوا رسوله، كي لا يحل بهم ما حلّ بأولئك، أو: إن فيما فُصل من القصة من حيث حكايته عليه السلام إياها على ما هي عليه، من غير أن يسمعها من أحد، لآية عظيمة دالة على ان ذلك بطريق الوحي الصادق، موجبة للإيمان بالله تعالى، وتصديق من جاء بها وطاعته\n\n\n{ وما كان أكثرُهُم مؤمنين } أي: وما كان اكثر هؤلاء المكذبين الذين سمعوا قِصَصهم منه - عليه الصلاة والسلام - مؤمنين، فلم يقيسوا حاله صلى الله عليه وسلم بحال موسى، وحال أنفسهم بحال أولئك المهلَكين، ولم يتدبروا في حكايته صلى الله عليه وسلم لقصتهم من غير أن يسمعها من أحد، مع كونه أمياً لا يقرأ، وكل من الطريقين مما يؤدي إلى الإيمان، قطعاً لانهماكهم في الغفلة، فكان على هذا، زائدة، كما هو رأي سيبوبه، فيكون قوله تعالى:\n\n[يوسف: 103] وهو إخبار منه تعالى بعدم إيمانهم في المستقبل، أو: وما كان أكثر أهل مصر مؤمنين بموسى عليه السلام، قال مقاتل: لم يؤمن من أهل مصر غير رجل وامرأتين حزيقل المؤمن من آل فرعون، وآسية امرأة فرعون، ومريم بنت ياموشى، التي دَلَّتْ على عظام يوسف\n هـ\n { وإن ربك لهو العزيز } الغالب على كل ما يريد من الأمور، التي من جملتها: الانتقام من المكذبين، { الرحيم } البالغ في الرحمة، ولذلك أمهلهم ولم يعاجل عقوبتهم، أو: العزيز بالانتقام من أعدائه، الرحيم بالانتصار لأوليائه\n جعلنا الله من خاصتهم بمنِّه وكرمه، آمين\n الإشارة: قوله تعالى: { إن معي ربي سيهدين }: اعلم أن المعية تختلف باختلاف المقام، فالمعية، باعتبار عامة الخلق، تكون بالإحاطة والقهرية والعلم والإقتدار، وباعتبار الخاصة تكون بالحفظ والرعاية والنصر والمعونة\n فمن تحقق أن الله معه بعلمه وحفظه ورعايته اكتفى بعلمه، وفوض الأمر إلى سيده، وكلما قوي التفويض والتسليم دلّ على رفع المقام، ولذلك فضَّل ما حكاه الحق تعالى عن حبيبه بقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:5",
      "similarity": 0.8785313289124759
    },
    {
      "verse": "55:17",
      "similarity": 0.6363517586718834
    },
    {
      "verse": "15:73",
      "similarity": 0.5751293139711053
    },
    {
      "verse": "73:9",
      "similarity": 0.5678652769601495
    },
    {
      "verse": "26:28",
      "similarity": 0.5599020350436039
    }
  ]
}