{
  "chapter": "الشعراء",
  "text": "فلما ترءا الجمعان قال اصحب موسى انا لمدركون",
  "translations": [
    {
      "translation": "When the two forces drew within seeing distance of each other, the people of Moses said: \"We shall certainly be overtaken.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when the groups came face to face, the companions of Moses cried out: \"We are overtaken!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Pharaoh pursued them at sunrise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the two groups saw each other, those with Moosa said, “They have caught us.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the two hosts saw each other, the companions of Musa said: \"We are sure to be overtaken.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the two hosts saw each other, the companions of Musa cried out: Most surely we are being overtaken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, when the two hosts sighted each other, the companions of Moses said, 'We are overtaken!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the two hosts saw each other, those with Moses said: Lo! we are indeed caught.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when the two groups saw each other, Moses' companions said, \"We are sure to be overtaken.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the two parties saw each other, the companions of Musa said: verily we are overtaken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the two hosts sighted each other, the companions of Moses said, ‘Indeed we have been caught up.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the two bodies saw each other, the people of Moses said: \"We are sure to be overtaken.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the two hosts saw each other, the companions of Musa (Moses) said: \"We are sure to be overtaken.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the two hosts came in view of each other, Moses' companions said: 'We have been reached'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the two groups sighted each other, the followers of Moses said, “We are being overtaken.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the two companies saw one another, the companions of Moses said, \"Indeed, we are to be overtaken!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:61] And when the two hosts sighted each other, the companions of Moses said, ‘We have been caught!’, Pharaoh’s hosts have caught us up and we have no power against them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when the two hosts) the group of Moses and that of Pharaoh (saw each other, those with Moses said: Lo! we are indeed caught) Moses, they have caught up with us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nفلما أتبعهم فرعون النفس في التلوينات حاشراً جنوده من مدائن طبائع الأعضاء، حاذراً من ذهاب رياسته وملكه، ممتلئاً من غيظ تسلّط القلب واتباعه واستيلائه على مملكته وأعوانه، فكادوا أن يظفروا بهم، ضرب موسى القلب بأمر الحق عند تقابلهما وتعارضهما بعصا القوة القدسية البحر الهيولاني فانفلق إلى الحقوق والحظوظ ونجا موسى وقومه بطريق التجريد وأخرج أعداءهم بالمنع عن الحظوظ والإجبار على الحقوق من جنات اللذات النفسانية وعيون أذواقها وأهوائها وكنوز مدخراتها وأسبابها ومقام الركون إلى مشتهياتها إلى أن خرج موسى وأهله من البحر بالمفارقة وغرق فرعون النفس وقومه أجمعون\n { ما تعبدون } كل من عكف على شيء يهواه ويحبّه ويتولاه فهو عابد له، محجوب به عن ربّه، موقوف معه عن كماله، وذلك عدوّ الموحد، إذ الغير لا يوجد عنده إلا في التوهم\n فالباعث على عبادته الشيطان والغالب على عابده الظلم والعدوان، ولا يضرّ غير الحق في شهوده ولا ينفع ولا يبصر بنفسه ولا يسمع لأنه يشهد الحق قائماً على كل نفس بما تفعل وأيدي الأفعال كلها في حضرة أسمائه منه تصدر، كما قال عليه السلام: { الذي خلقني فهو يهدين }  { والذي هو يطعمني ويسقين } إلى آخره، فهو الخالق والهادي والمُطْعِم والساقي والمُمْرِض والشافي والمميت والمحيي، ويقرّر هذا المعنى قوله:\n\n[الشعراء، الآيات:92 - 93] إلى قوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا تَرَاءَى ٱلْجَمْعَانِ } أي: تقاربا إلى أن رأى كل من الجمعين صاحبه { قَالَ أَصْحَابُ مُوسَىٰ } مشتكين إليه، ميئوسين من الحياة بعدما رأوا من خلفهم جيشاً لا يُعدّ ولا يُحصى، وعن أمامهم البحر الذي لا يمكن العبور عنه: { إِنَّا لَمُدْرَكُونَ } [الشعراء: 61] ملحقون، يلحقنا العدو الآن وبعد فناؤنا في البحر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}