{
  "chapter": "الشعراء",
  "text": "قال هل يسمعونكم اذ تدعون",
  "translations": [
    {
      "translation": "He said, 'Do they hear you when you call",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Abraham) asked: \"Do they hear when you call them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He asked: \"Do they hear you when you call them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"We worship idols and shall continue to worship them\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Do they hear you when you call?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Do they hear you when you call\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Do they hear you when you call?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'Do they hear you when you call,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Do they hear you when ye cry?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He asked, \"Do they hear you when you call to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: hearken they unto you when ye cry?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Do they hear you when you call them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Do they listen to you when ye call (on them)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Do they hear you, when you call (on them)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they hear you when you call on them' He asked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Do they hear you when you pray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Do they hear you when you supplicate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:72] He said, ‘Do they hear you when you supplicate?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said) Abraham said to them: (Do they hear you when ye cry) do these deities answer you when you call upon them?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ هَلْ يَسْمَعُونَكُمْ } ويجيبون دعوتكم { إِذْ تَدْعُونَ } [الشعراء: 72] إليها في السراء والضرء؟! { أَوْ يَنفَعُونَكُمْ } ويثيبونكم؛ جزاءً لطاعتكم وعبادتكم { أَوْ يَضُرُّونَ } [الشعراء: 73] لكم إن أعرضتم وانصرفتم عن عبادتهم؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } إبراهيمُ عليه السلام: { هل يسمعونكم إذ تَدْعون } أي: هل يسمعون دعاءكم حين تدعونهم، على حذف مضاف، { أو ينفعونكم } إن عبدتموها، { أو يَضُرُّونَ } أو يضرونكم إن تركتم عبادتها إذ لا بد للعبادة من جلب نفع أو دفع ضر؟ { قالوا بل وجدنا آباءنا كذلك يفعلون } فاقتدينا بهم\n اعترفوا بأن أصنامهم بمعزل عما ذكر من السمع، والمنفعة، والمضرة بالمرة\n واضطروا إلى إظهار أنهم لا سند لهم سوى التقليد الرديء\n { قال } إبراهيم: { أفرأيتم ما كنتم تعبدون } أي: أنظرتم وأبصرتم وتأملتم فعلمتم ما كنتم تعبدون { أنتم وآباؤكم الأقدمون } حق الإبصار، أو حق العلم، { فإنهم عدو لي } أي: فاعلموا أنهم أعداء لي، لا أحبهم ولا يحبونني، أو: لو عبدتموهم لكانوا أعداء لي يوم القيامة، كقوله:\n\n[مريم: 82]، وقال الفراء: هو من المقلوب، أي: فإني عدو لهم، والعدو يجيء بمعنى الواحد والجماعة لأنه فَعُولٌ، كصبور\n وفي قوله: { عدو لي } ، دون \" لكم \" زيادةُ نصحٍ، لكونه أدعى لهم إلى القبول، ولو قال: فإنهم عدو لكم، لم يكن بتلك المثابة، ولم يقبلوه، { إلا ربِّ العالمين }: استثناء منقطع، أي: لكن رب العالمين ليس كذلك، بل هو حبيب لي\n وأجاز الزَّجَّاجُ أن يكون متصلاً، على أن الضمير لكل معبود، وكان من آبائهم من عَبَد الله تعالى، وهم أيضاً كانوا يعبدون الله مع أصنامهم\n ثم وصف الربّ تعالى قوله: { الذي خلقني } بالتكوين في القرار المكين، { فهو يَهدين } وحده إلى كل ما يُهمني ويُصلحني من أمور الدين والدنيا، هداية متصلة بحين الخلق ونفخ الروح، متجددة على الاستمرار، كما ينبئ عنه صيغة المضارع\n وعبَّر بالاستقبال، مع سبق الهداية في الأزل لأن المراد ما ينشأ عنها، وهو الاهتداء لما هو الأهم والأفضل والأتم والأكمل، أو: والذي خلقني لأسباب خدمته فهو يهدين إلى آداب خُلَّتِهِ\n\n\nولما كان الخلق لا يمكن أن يدعيه أحد لم يؤكد فيه بهو، بخلاف الهداية والإطعام والسقي، فإنه يكون على سبيل المجاز من المخلوقين، ولذلك أكده بهو ليخصه به تعالى\n { والذي هو يُطعمني } لا غيره، أصناف الإطعام إلى مُولي الإنعام لأن الركون إلى الأسباب عادة الأَنْعام\n { و } هو أيضاً الذي { يسقين } أي: يرويني بمائه\n وتكرير الموصول في المواضع الثلاثة للإيذان بأن كل واحدة من تلك الصلات نعت جليل له تعالى، مستقل في استيجاب الحكم\n { وإِذا مرضت فهو يَشْفين }: عطف على { يُطعمني ويسقين } ، ونظم معهما في سلك الصلة بموصول واحد لأن الصحة والمرض من متبوعات الأكل والشرب في العادة، غالباً\n وقال في الحاشية: ثم ذكر بعد نعمة الخلق والهداية ما تدوم به الحياة وتستمر، وهو الغذاء والشراب، ولمَّا كان ذلك مبنياُ على غلبة إحدى الكيفيات على الآخر، بزيادة الغذاء أو نقصانه، فيحدث بعد ذلك مرض، ذكر نعمته بإزالة ما حدث من السقم\n هـ\n ونسبة المرض إلى نفسه والشفاء إلى الله تعالى، مع أنهما منه تعالى لمراعاة حسن الأدب، كما قال الخضر عليه السلام:\n\n[الكهف: 79]،\n\n[الكهف: 82]\n { والذي يُميتني ثم يُحيينِ } ، ولم يقل: وإذا مت لأن الإماتة والإحياء من خصائصه تعالى\n وأيضاً: الموت والإحياء من كمال الكمال لأنه الخروج من سجن الدنيا إلى السرور والهناء، أو: الخروج من دار البلاء والفناء إلى دار الهناء والبقاء\n { والذي أَطْمَعُ أَنْ يَغْفَر لي } أي: في مغفرته لي { خطيئتي يومَ الدين } ، ذكره عليه السلام هضماً لنفسه، وتعليماً للأمة أن يجتنبوا المعاصي، ويكونوا على حذر منها، وطلب مغفرته لما يفرط منهم\n وقال أبو عثمان: أخرج سؤاله على حد الأدب، لم يحكم على ربه بالمغفرة، ولكنه طَمِعَ طَمَعَ العبيد في مواليهم، وإن لم يكونوا يستحقون عليهم شيئاً إذ العبد لا يستحق على مولاه شيئاً، وما يأتيه يأتيه من فضل مولاه\n هـ\n وقيل: أشار إلى قوله:\n\n[الصافات: 89]\n\n[الأنبياء: 63] وقوله في سارّة: \" هي أختي \" حذراً من الجبار\n وفيه نظر لأنها مع كونها معاريض، لا من قبيل الخطايا المفتقرة إلى الاستغفار إنما صدرت عنه عليه السلام بعد هذه المقالة الجارية بينه وبين قومه في أول أمره\n وتعليق مغفرة الخطيئة بيوم الدين، مع كونها إنما تُغفر في الدنيا لأن أثرها إنما يظهر يومئذٍ، ولأن في ذلك تهويلاً له، وإشارة إلى قوع الجزاء فيه، إن لم يغفر\n والله تعالى أعلم\n الإشارة: ينبغي لك أيها العبد أن تكون إبراهيمياً حنيفياً، فتنبذ جميعَ الأرباب، وتعادي كل من يشغلك عن محبة الحبيب، من العشائر والأصحاب، وتقول لمن عكف على متابعة هواه، ولزم الحرص على جمع دنياه، هو ومن تقدمه: أفرأيتم ما كنتم تعبدون، أنتم وآباؤكم الأقدمون، فإنهم عدو لي إلا رب العالمين، الذي خلقني لعبوديته، فهو يهدين إلى معرفته، والذي هو يطعمني طعم الإيمان واليقين والإحسان، ويسقيني من شراب خمرة العيان، وإذا مرضتُ بالذنوب فهو يشفين بالتوبة، أو: مرضت بشيء من العيوب فهو يشفين بالتطهير منها\n\n\nأو: إذا مرضت برؤية السِّوى، فهو يشفين بالغيبة عنه، والذي أطمع أن يطهرني من البقايا، ويجعلني من المقربين يوم الدين\n وقال ذو النون رضي الله عنه: يطعمني طعام المعرفة، ويسقيني شرا ب المحبة، ثم قال:\n\nوقال الشيخ أبو يزيد البسطامي رضي الله عنه: إن لله شراباً، يقال له: شراب المحبة، ادخره لأفاضل عباده، فإذا شربوا سكروا، وإذا سكروا طاشوا، وإذا طاشوا طاروا وصلوا، وإذا وصلوا اتصلوا، فهم في مقعد صدق عند مليك مقتدر\n هـ\n قلت: شراب المحبة هو خمرة الفناء والغيبة في الله، بدليل قول ابن الفارض رضي الله عنه\n\n\nوقال الجنيد رضي الله عنه: يُحشر الناس يوم القيامة عراة، إلا من لبس ثياب التقوى، وجياعاً إلا من أكل طعام المعرفة، وعطاشاً إلا من شرب شراب المحبة\n هـ\n وقد يستغني صاحب طعام المعرفة وشراب المحبة عن الطعام والشراب الحسيين، كما قال صلى الله عليه وسلم، حين كان يواصل:\n\n \" إني أبَيتُ عند ربي يُطعمني ويسقين \"\n \n\nقال أبو الوراق في قوله تعالى: { الذي هو يُطعمني ويسقين } أي: يُطعمني بلا طعام، ويسقيني بلا شراب\n قال: ويدل عليه حديث السَّقَّاء في عهد النبي صلى الله عليه وسلم حيث سمع النبي صلى الله عليه وسلم يقرأ ثلاثة أيام: { وما من دابة في الأرض إلا على الله رزقها } ، فرمى بِقِرْبَتِهِ، فأتاه آتٍ في منامه بقدح من شراب الجنة، فسقاه، قال أنس: فعاش بعد ذلك نيفاً وعشرين سنة، ولم يأكل ولم يشرب على شهوة\n هـ\n وكان عبد الرحمن بن أبي نعيم لا يأكل في الشهر إلا مرة، فأدخله الحجاج بيتاً، وأغلق عليه بابه، ثم فتحه بعد خمسة عشر يوماً، ولم يشك أنه مات، فوجده قائماً يُصلي، فقال: يا فاسق، تصلي بغير وضوء؟ فقال: إنما يحتاج الوضوء من يأكل ويشرب، وأنا على الطهارة التي أدخلتني عليها\n هـ\n ومكث سفيان الثوري بمكة دهراً، وكان يَسفُّ من السبت إلى السبت كفاً من الرمل\n هـ\n وهذا من باب الكرامة، فلا يجب طردها، وقد تكون بالرياضة، وطريق المعرفة لا تتوقف على هذا\n والله تعالى أعلم\n ثم ذكر دعاء إبراهيم، فقال: { رَبِّ هَبْ لِي حُكْماً\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:203",
      "similarity": 0.49656729175834247
    },
    {
      "verse": "26:39",
      "similarity": 0.46793225861583476
    },
    {
      "verse": "34:17",
      "similarity": 0.41458165099470107
    },
    {
      "verse": "55:60",
      "similarity": 0.4084524519396235
    },
    {
      "verse": "79:18",
      "similarity": 0.39575557221518415
    }
  ]
}