{
  "chapter": "الشعراء",
  "text": "اولم يروا۟ الى الارض كم انۢبتنا فيها من كل زوج كريم",
  "translations": [
    {
      "translation": "Have they not looked at the earth and seen how We have made every sort of beneficial species grow in it?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see the earth, how We grow all kinds of noble things upon it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not look at the earth, how We caused a variety of fine vegetation to grow from it (in abundance)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the earth in which We have made gracious plants grow?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the earth, that how many honourable pairs We have created in it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not observe the earth -- how much of every good kind We cause to grow therein\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see the earth, how many of every noble kind We have caused to grow in it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not regarded the earth, how many therein We have caused to grow of every generous kind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the earth, how much of every fruitful kind We make to grow therein?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see the earth, and what beneficial kinds of things We have caused to grow in it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe they not the earth, how much We make to grow therein of every fruitful kind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded the earth, how many of every splendid kind [of vegetation] We have caused to grow in it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not look at the earth,- how many noble things of all kinds We have produced therein?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not observe the earth, how much of every good kind We cause to grow therein?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the earth, how many We caused to grow in it every generous kind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen the earth, and how many beautiful pairs We produced therein?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not look at the earth - how much We have produced therein from every noble kind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:7] Have they not contemplated, observed, the earth, how many We have caused to grow therein, in other words, [We have caused to grow therein] many, of every splendid kind [of vegetation], [of every] fair species.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they) the disbelievers of Mecca (not seen the earth, how much of every fruitful kind We make to grow therein?)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف ينكرون بآياتنا الدالة على كمال قدرتنا وحكمتنا، أولئك المعرضون عناداً ومكابرةً؟! { أَوَلَمْ يَرَوْاْ } ولم ينظروا ويتفكروا حتى يعتبروا، مع أنهم من أهل النظر والاعتبار { إِلَى } عجائب { ٱلأَرْضِ } اليابسة الجامدة { كَمْ أَنبَتْنَا } من كمال قدرتنا ووفور حكمتنا { فِيهَا مِن كُلِّ زَوْجٍ } أجناس كثيرة من النباتات والحيوانات والمعادن و غير ذلك مما لا اطلاع لهم عليه؛ إذ ما يعلم جنود ربك إلا هو، { كَرِيمٍ } [الشعراء: 7] كلها ذوي الكرامات و البركات، والمنافع والخيرات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الهمزة: للإنكار التوبيخي، والواو: للعطف على مقدر يقتضيه المقام، أي: أَفعلوا ما فعلوا من الإعراض والتكذيب، ولم ينظروا إلى عجائب الأرض\n\n إلخ\n وكم: خبرية منصوبة بما بعدها على المفعولية\n يقول الحق جل جلاله: { أوَ لَم يروا } أي: ينظروا { إلى } عجائب { الأرض كم أنبتنا فيها من كل زوج كريم } أي: من كل صنف محمود كثير المنفعة، يأكل منه الناس والأنعام\n وتخصيص النبات بالذكر، دون ما عداه من الأصناف لاختصاصه بالدلالة على القدرة والنعمة معاً\n ويحتمل أن يراد به جميع أصناف النبات نافعها وضارها، ويكون وصف الكل بالكرم للتنبيه على أنه تعالى ما أنبت شيئاً إلا وفيه فائدة، إما وحده، أو بانضمامه إلى غيره، كما نطق به قوله تعالى:\n\n[البقرة: 29] فإن الحكيم لا يكاد يفعل فعلاً إلا وفيه حكمة بالغة، وإن غفل عنه الغافلون، ولم يتوصل إلى معرفة كنهه العاقلون\n وفائدة الجمع بين كلمتي الكثرة والإحاطة، وهما \" كم \" و \" كلّ \" أنّ كلمة \" كلّ \" تدل على الإحاطة بأزواج النبات على سبيل التفصيل، و \" كم \" تدل على أنَّ هذا المحاط متكاثر، مفرط الكثرة، وبه نبّه على كمال قدرته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:36",
      "similarity": 0.5504573643103265
    },
    {
      "verse": "71:17",
      "similarity": 0.4891064388380816
    },
    {
      "verse": "43:6",
      "similarity": 0.4686363904321093
    },
    {
      "verse": "36:31",
      "similarity": 0.4445218986157695
    },
    {
      "verse": "80:27",
      "similarity": 0.44237067374412875
    }
  ]
}