{
  "chapter": "الشعراء",
  "text": "ان فى ذلك لءاية وما كان اكثرهم مؤمنين",
  "translations": [
    {
      "translation": "There is certainly a Sign in that, yet most of them are not muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily there are signs in this; yet many of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely there is a Sign in this, but most of them would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this there is, certainly, evidence (of the Truth). But most of them have no faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in this is a sign; and most of them will not accept faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in this is an Ayah, yet most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely there is a sign in that, but most of them will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in that is a sign, yet most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! herein is indeed a portent; yet most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in this there is a sign, yet most of them would not believe:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily therein is a sign; yet most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is indeed a sign in that; but most of them do not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in this is a Sign: but most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in this is an Ayah (proof or sign), yet most of them (polytheists, pagans, etc., who do not believe in Resurrection) are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, in this there is a sign yet most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in this is a sign, but most of them are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in that is a sign, but most of them were not to be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:8] Surely in that there is a sign, an indication of the perfection of His power, exalted be He; but most of them, in God’s knowledge, are not believers (kāna here according to Sībawayhi is extra).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Herein) in the different kinds of fruit (is indeed a portent) a sign and an admonition; (yet most of them are not believers) they were not believers, and all of them were disbelievers, i.e. those who perished at Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لكن { مَا كَانَ } وثبت { أَكْثَرُهُمْ } أي: أكثر الناس { مُّؤْمِنِينَ } [الشعراء: 8] موفقين على الإيمان والتوحيد في علم الله ولوح قضائه\n لذلك لم يؤمنوا بالآيات العظام\n ولم يستدلوا منها إلى وجود الصانع الحكيم العلام القدوس السلام\n المنزَّه ذاته عن طريان التقضي والانصرام\n\n\n{ وَ } إن كذبوك يا أكمل الرسل بما جئت من الآيات العظام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إنَّ في ذلك } الإنبات، أو: كل صنف من تلك الأصناف { لآيةً } عظيمة دالة على كمال قدرته، وسعة علمه وحكمته، ونهاية رحمته الموجبة للإيمان، الوازعة عن الكفر والطغيان\n { وما كان أكثرُهُم } أي: أكثر قومه - عليه الصلاة والسلام - { مؤمنين } في علم الله تعالى وقضائه، حيث عَلِمَ أنهم سيصرفون عنه، ولا يتدبرون في هذه الآيات العظام\n وقال سيبويه: \" كان \": صلة، والمعنى: وما أكثرهم مؤمنين، وهو الأنسب بمقام عتوهم وغلوهم في المكابرة والعناد، مع تعاضد موجبات الإيمان من جهته تعالى\n وأما نسبة كفرهم إلى علمه تعالى وقضائه فربما يتوهم أنهم معذورون فيه بحسب الظاهر لأن التفريق بين القدرة والحكمة، اللتين هما محل التحقيق والتشريع، قد خفي على مهرة العلماء، فضلاً عن غيرهم\n فالحكم بزيادة \" كان \" أقرب كأنه قيل: إن في ذلك لآية باهرة موجبة للإيمان، وما أكثرهم مؤمنين مع ذلك لغاية عتوهم وعنادهم\n ونسبة عدم الإيمان إلى أكثرهم لأن منهم من سبق له أنه يؤمن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:67",
      "similarity": 1.0
    },
    {
      "verse": "26:103",
      "similarity": 1.0
    },
    {
      "verse": "26:121",
      "similarity": 1.0
    },
    {
      "verse": "26:174",
      "similarity": 1.0
    },
    {
      "verse": "26:190",
      "similarity": 1.0
    }
  ]
}