{
  "chapter": "الشعراء",
  "text": "رب هب لى حكما والحقنى بالصلحين",
  "translations": [
    {
      "translation": "O Lord, give me wisdom and admit me among the righteous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And then Abraham prayed): \"My Lord, endow me with knowledge and wisdom and join me with the righteous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, grant me authority. Join me to the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“My Lord, bestow me the command and join me with those who deserve your proximity.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Bestow Hukm on me, and join me with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord: Grant me wisdom, and join me with the good\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, give me Judgment, and join me with the righteous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Vouchsafe me wisdom and unite me to the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, bestow wisdom upon me; unite me with the righteous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! bestow on me wisdom and join me with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘My Lord! Grant me [unerring] judgement, and unite me with the Righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord! bestow wisdom on me, and join me with the righteous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Bestow Hukman (religious knowledge, right judgement of the affairs and Prophethood) on me, and join me with the righteous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, give me judgment, and join me with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“My Lord! Grant me wisdom, and include me with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And he said], \"My Lord, grant me authority and join me with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:83] My Lord! Grant me [unerring] judgement, knowledge, and unite me with the righteous, the prophets.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(My Lord! Vouchsafe me wisdom) understanding and knowledge (and unite me to the righteous) to my forefathers, the messengers, in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رَبِّ } يا من رباني بلطفك، وهداني إلى توحيدك { هَبْ لِي حُكْماً } يقيناً عليماً وعينياً؛ حتى أستحق أن تفيض عليَّ اليقين الحقي الذي صرت به مستحقاً لمرتبة الخلة والخلافة { وَأَلْحِقْنِي } بعدما وهبت لي من حِكمك وأحكامك ومعارفك ما قدرت لي { بِٱلصَّالِحِينَ } [الشعراء: 83] المرضيين عندك، المقبولين في حضرتك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: حاكياً عن خليله إبراهيم عليه السلام: { ربِّ هبْ لي حُكماً } أي: حكمة، أو حُكماً بين الناس، أو نبوة لأن النبي ذو حُكم بين عباد الله\n { وألحِقْني بالصالحين } أي: الأنبياء، الذين صلحوا لحمل أعباء النبوة والرسالة، وصلحت سرائرهم للحضرة، ولقد أجابه بقوله: { وإنه في الآخرة لمن الصالحين }\n { واجعل لي لسانَ صدقٍ في الآخرين } أي: ثناءً حسناً، وذكراً جميلاً في الأمم التي تجيء بعدي، فأُعطي ذلك، فكل أهل دين يتولونه ويثنون عليه، ووضَعَ اللسانَ موضعَ القول لأن القول يكون به\n أو: واجعلني على طريق قويم، وحال مُرضي، يُقتدى بي فيهما، ويُحمد أثري بعد موتي، كما قيل:\n\nوقد تحقق له جميع ذلك، وخصوصاً في هذه الأمة، حتى أنه مذكور ومقرون في كل صلاة على النبي صلى الله عليه وسلم، وقال بعضهم: سأل أن يجعله صالحاً، بحيث إذا أثنى عليه من بعده لم يكن كاذباً\n وقيل: سأل الإمامة في التوحيد والدين، وقد أجيب بقوله:\n\n[البقرة: 124]\n { وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ } أي: اجعلني وارثاً من ورثة جنة النعيم، أي: الباقين فيها، { واغفرْ لأبي } ، أي: اجعله أهلاً للمغفرة، بإعطاء الإسلام { إنه كان من الضالين }: الكافرين، أو: اغفر له على حاله\n وكان قبل النهي\n { ولا تُخزني يوم يُبعثون } أي: لا تُهنِّي يوم يبعثون\n الضمير للعباد لأنه معلوم، أو: للضالين، أي: لا تخزني في أبي يوم البعث، وهذا من جملة الاستغفار لأبيه، وكان قبل النهي عنه، أي: لا تُهِنِّي، { يوم لا ينفعُ مالٌ ولا بنونَ } ، أي: لا ينفع فيه مال، وإن كان مصروفاً في وجوه البر، ولا بنون، وإن كانوا صُلحاء متأهلين للشفاعة، { إلا من أتى الله بقلبٍ سليمٍ } من الكفر والنفاق فإنه ينفعه ماله المصروف في طاعة الله، ويشفع فيه بنوه، إن تأهلوا للشفاعة، بأن أَدَّبَهُمْ ودرَّجهم إلى اكتساب الكمالات والفضائل\n وقال ابنُ المسيَبِ: القلب السليم هو قلب المؤمن فإن قلب الكافر والمنافق مريض قال الله تعالى:\n\n[البقرة: 10]\n وقال أبو عثمان: هو القلب الخالي من البدعة، المطمئن على السنة\n وقال الحسن بن الفضل: سليم من آفات المال، والبنين والله تعالى أعلم\n الإشارة: قد استعمل إبراهيم عليه السلام الأدب، الذي هو عمدة الصوفية، حيث قدّم الثناء قبل الطلب، وهو مأخوذ من ترتيب فاتحة الكتاب\n وقوله تعالى: { ربِّ هبْ لي حُكماً }: قال القشيري: أي: على نفسي أولاً، فإن من لا حُكْم له على نَفْسِه لا حُكْمَ له على غيره، { وألحقني بالصالحين } بالقيام بحقك، دون الرجوع إلى طلب الاستقلال لنفسي دون حقك\n هـ\n\n\nومما اصطلحت عليه الصوفية أن الصالحين: من صلحت ظواهرهم، وتطهرت قلوبهم من الأمراض\n وفوقهم الأولياء، وهم من كُشف عنهم الحجاب، وأفضوا إلى الشهود والعيان، وفوقهم درجة النبوة والرسالة، فقول الخليل { وألحقني بالصالحين } ، وكذلك قال الصدِّيق، هو تنزل وتواضع ليعرف جلالة قدر الصالحين، فما بالك بمن فوقهم! فهو كقول نبينا صلى الله عليه وسلم:\n\n \" اللهُمَّ أحينِي مِسْكيناً، وأمِتْنِي مِسْكيناً واحْشُرني في زُمْرة المسَاكين \" \n\nأي: اجعل المساكين هم قرابتي، المحدقون بي في المحشر، فقد عَرَّف صلى الله عليه وسلم بفضيلة المساكين، وعظَّم جاههم، بطلبه أن يكونوا في كفالته، لا أنه في كفالتهم، وكذلك الخليل والصدِّيق، عَرَّفا بفضيلة الصالحين من أهل الإسلام، أو أنهما طلبا اللحوق بهم\n وقوله تعالى: { واجعل لي لسانَ صدْقٍ في الآخرين } كل من اخلص وجهه لله، وتخلصت سريرته مما سوى الله، وكان إبراهيمياً حنيفياً، جعل الله له لسان صدق فيمن يأتي بعده، وحسن الثناء عليه في حياته وبعد مماته، لقوله صلى الله عليه وسلم:\n\n \" إذا أحب الله عبداً نادى جبريل: إن الله يُحب فلاناً فَأَحِبَّهُ، فَيُحِبُّهُ جبريل، ثم ينادي جبريل في أهل السموات: إن الله يحب فلاناً فأحِبُّوه، فيحبُّه أهل السماء، ثم يُوضَع له القَبُول في الأرض \" \n\nأو كما قال صلى الله عليه وسلم\n وقوله تعالى: { واغفر لأبي\n\n\n } إلخ\n قال القشيري: هذا عند العلماء: إنما قاله قبل يأسه من إيمانه، وعن أهل الإشارة: ذكره في وقت غَلَبَةِ البَسْط، وتجاوز ذلك عنه، وليس إجابةُ العبد واجبةً عليه في كل شيء، وأكثر ما فيه: أنه لا يجيبه في ذلك، ثم لهم أسوة في ذكر أمثال هذا الخطاب، وهذا لا يهتدي إليه كلُّ أحدٍ\n هـ\n قال المحشي: وينظر لما قاله العلماء، وبه الفتوى، قوله:\n\n[التوبة: 114]، وينظر للسان الإشارة شفاعته له يوم القيامة، وتكلمه فيه بقوله: وأيُّ خِزْيٍ أعظم من كون أبي في النار\n\n\n الحديث، وكذا قوله:\n\n[إبراهيم: 36]، وجاء ذلك من استغراقه في بحر الرحمة، على سعة العلم، ومثله استغفار نبينا صلى الله عليه وسلم لابن أُبَيّ، وصلاته عليه، وانظر الطيبي في آية:\n\n[غافر: 7]\n هـ\n وقوله تعالى: { إلا من أتى الله بقلب سليم } ، أظهر ما قيل في القلب السليم: أنه السالم من الشكوك والأوهام، والخواطر الردية، ومن الأمراض القلبية، ولا يتحقق له هذا إلا بصحبة شيخ كامل، يُخرجه من الأوصاف البشرية، إلى الأوصاف الروحانية، ويحققه بالحضرة القدسية، وإلا بقي مريضاً، حتى يلقى الله بقلب سقيم\n وفي الإحياء: السعادة منوطة بسلامة القلب من عوارض الدنيا، والجودُ بالمال من عوارض الدنيا، فشرط القلب أن يكون سليماً بينهما، أي: لا يكون ملتفتاً إلى المال، ولا يكون حريصاً على إمساكه ولا حريصاً على إنفاقه فإن الحريصَ على الإنفاق مصروفُ القلب إلى الإنفاق، كما أن الحريص على الإمساك مصروف القلب إلى الإمساك\n وكان كمال القلب أن يصفو من الوصفين جميعاً\n وقال الداراني: القلب السليم هو الذي ليس فيه غير الله تعالى\n هـ\n وقال الجنيد رضي الله عنه: السليم في اللغة: اللديغ، فمعناه: كاللديغ من خوف الله تعالى\n هـ\n وبالله التوفيق\n ثم ذكر هول ذلك اليوم، فقال: { وَأُزْلِفَتِ ٱلْجَنَّةُ\n\n\n }\n",
      "translations": []
    }
  ]
}