{
  "chapter": "الشعراء",
  "text": "وقيل لهم اين ما كنتم تعبدون",
  "translations": [
    {
      "translation": "They will be asked, 'Where are those you used to worship besides Allah?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be asked: \"Where are those you worshipped\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they will be asked: \"Where are the gods that you worshipped\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who will be asked, \"What did you worship\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said to them, “Where are those whom you used to worship?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said to them: \"Where are those that you used to worship.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it shall be said to them: Where are those that you used to worship;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be said to them, 'Where is that you were serving\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said unto them: Where is (all) that ye used to worship\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they will be asked, \"Where are those whom you worshipped\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it shall be said unto them where is that which ye were wont to worship?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they shall be told: ‘Where is that which you used to worship\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it shall be said to them: 'Where are the (gods) ye worshipped-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said to them: \"Where are those (the false gods whom you used to set up as rivals with Allah) that you used to worship\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be said to them: 'Where is that you worshipped,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said to them, “Where are those you used to worship?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said to them, \"Where are those you used to worship\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[26:92] And it will be said to them, ‘Where is that which you used to worship\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And it will be said unto them) it will be said to the idol worshippers: (Where is (all) that ye used to worship) of idols in the life of the world, 413\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقِيلَ لَهُمْ } حين ظهرت الجحيم عليهم، ويتفطنون أنهم مسوقون إليها صاغرين مهانين: { أَيْنَ مَا كُنتُمْ تَعْبُدُونَ } [الشعراء: 92] أي: أين الآلهة الباطلة التي عبدتم لها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أي: صُرِعُوا منكبين في الجحيم على وجوههم، { هم } أي: آلهتهم { والغاوون } أي: الذين كانوا يعبدونهم\n وفي تأخير ذكرهم عن ذكر آلهتهم رمز إلى أنهم مُؤَخِّرُونَ عنها في الكبكبة ليشاهدوا سوء حالها، فيزدادوا غماً على غم، { وجنودُ إبليسَ } أي: يكبكبون معهم { أجمعون } ، وهو شياطينه الذين كانوا يقوونهم ويوسوسونهم، ويُسَوِّلُونَ لهم ما هم عليه من عبادة الأصنام، وسائر فنون الكفر والمعاصي، أو:متبعوه من عصاة الجن والإنس ليجتمعوا في العذاب، حسبما كانوا مجتمعين فيما يوجبه\n { قالوا } أي: العبدة { وهم فيها يختصمون } أي: قالوا معترفين بخطئهم في انهماكهم في الضلالة متحسرين، والحال: أنهم في الجحيم بصدد الاختصام مع من معهم من المذكورين فيجوز أن يُنطق الله الأصنامَ حتى يصح منها التخاصم والتقاول، ويجوز أن يجري ذلك بين العصاة والشياطين\n قالوا: { تالله إنْ كُنَّا لفي ضَلاَل مُبِين } أي: إن الشأن كنا في ضلال واضح، لا خفاء فيه، { إذ نسويكم } نَعْدِلُكُم { بربِّ العالمين } فنعبدُكم معه، أي: تالله لقد كنا في ضلال فاحش وقت تسْويتنا إياكم أيها الأصنام، في استحقاق العبادة، برب العالمين، الذي أنتم أدنى مخلوقاته، وأذلهم وأعجزهم، { وما أضَلَّنا إلا المجرمون } أي: رؤساؤهم، الذين أضلوهم، وإبليس وجنوده، ومن سنَّ الشرك\n وليس المراد قصر الإضلال على المجرمين دون من عداهم، بل قصر ضلالهم على كونه بسبب إضلالهم، من غير أن يستقلوا به، وهذا كقولهم:\n\n[الأحزاب: 67]\n وعن السُّدِّي: هم الأولون الذين اقتدوا بهم\n وأيّا ما كان ففيه التعريض للذين قالوا: { بل وجدنا آباءنا كذلك يفعلون }\n ثم قالوا: { فما لنا من شافعين } كما للمؤمنين من الملائكة والأنبياء - عليهم السلام - وغيرهم ممن أُهِّلَ للشفاعة\n { ولا صديقٍ حميم } كما لهم أصدقاء إذ لا يتصادق في الآخرة إلا المؤمنون، وأما الكفار فبينهم التعادي كما يأتي في الآية\n\n\nأو: ما لنا من شافعين، ولا صديق من الذين كنا نعدهم شفعاء وأصدقاء لأنهم كانوا يعتقدون أن أصنامهم تشفع لهم عند الله، وكان له أصدقاء من شياطين الإنس، فلم ينفعهم شيء من ذلك\n وجمع الشفعاء ووحّد الصديق لكثرة الشفعاء\n وأما الصديق، وهو الصادق في ودادك، الذي يهمه ما أهمك، ويسره ما أسرك، فقليل، وسئل حكيم عن الصديق، فقال: اسم لا معنى له، أي: لا وجود له، والبركة لا تنقطع\n قال القشيري: في الخبر: يجيء يوم القيامة عَبْدٌ فيُحاسَبُ، فتستوي حسناتُه وسيئاته، ويحتاج إلى حسنة واحدة يرْضى عنه خصومه، فيقول الله سبحانه له: عبدي يقيت لك حسنةٌ، إن كانت أَدْخَلْتُك الجنةََ، انْظُرْ، وتَطَلَّبْ من الناس لعلَّ أحداً يهبها لَكَ\n فيأتي الصفين، فيطلب من أبيه، ثم من أمه، ثم من أصحابه، فلا يجيبه أحدٌ إلا بقوله: أنا اليومَ فقيرٌ إلى حسنةٍ واحدة، فيرجع إلى مكانه، فيسأله الحقُّ - سبحانه: ما جئتَ به؟ فيقول: يا ربِّ لم يُعْطِني أحد حسنةً، فيقول الله تعالى: عبدي\n\n\n ألم يكن لك صديق؟ فيتذكر العبدُ، ويقول فلان كان صديقاً لي فيك، فيأتيه ويدل الحق عليه، فيكلِّمه، فيقول: بل لي عباداتٌ كثيرة، فإن قَبِلَها الله مني فقد وهبتُها لك، فيُسَرُّ ويجيء إلى موضعه، فيخبر بذلك ربَّه تعالى فيقول قد قَبِلتُها منه ولم أنقص من حقِّه شيئاً وقد غفرت لك وله - فهذا معناه\n هـ\n ونقل القرطبي عن الحسن قال: ما اجتمع ملأ على ذكر الله، فيهم عبد من أهل الجنة، إلا شفَّعه الله فيهم، وإن أهل الإيمان ليشفع بعضهم في بعض، وهم عند الله شافعون مشفعون\n هـ\n ثم قالوا: { فلو أن لنا كرةً } أي: رجعة إلى الدنيا { فنكون من المؤمنين } ، وجواب { لو } التَّمْنِيَةِ: محذوف، أي: لفعلنا كيت وكيت إذ \" لو \" ، في مثل هذا، للتمني، أي: فليت لنا كرة فنكون من المؤمنين\n { إن في ذلك } أي: فيما ذكر من الأنباء العجيبة كقصة إبراهيم مع قومه، وما ترتب على ذلك من الوعد والوعيد، { لآيةً } عظيمة، موجبة للزجر عن عبادة الأصنام، لا سيما لأهل مكة، الذين يدَّعون أنهم على ملة إبراهيم عليه السلام، أو: إن في ذكر نبأه، وتلاوته عليهم، على ما هو عليه، من غير أن تسمعه من أحد، لآية عظيمة دالة على أن ما نتلوه عليهم وحْيٌ صادق، نازل من جهته تعالى، موجبة للإيمان به، { وَمَا كَانَ أَكْثَرهُمُ مُّؤْمِنِينَ } أي: وما أكثر هؤلاء، الذين تتلو عليهم هذه الأنباء، مؤمنين، بل هم مُصِرُّون على ما كانوا عليه من الكفر والضلال\n ولا يحسن رجوعه لقوم إبراهيم، على أن { كان } أصلية لأنه لم يؤمن من قومه إلا لوط فقط\n { وإِن ربك لهو العزيزُ الرحيمُ } أي: هو القادر على تعجيل العقوبة لقومك، ولكنه يمهلهم بحلمه ورحمته ليؤمن بعض منهم أو من ذريتهم\n\n\nوبالله التوفيق\n الإشارة: وأُزلفت جنة المعارف للمتقين السِّوى، وبرزت جحيم القطيعة للغاوين، المتبعين الهوى\n وفي الحِكَم: \" لا يُخَافُ أن تلتبس الطرقُ عليك، إنما يُخَافُ من غلبة الهوى عليك \" وقيل لأهل الهوى: أين ما كنتم تعبدون من دون الله، من الحاملين لكم على البقاء مع الحظوظ والشهوات، هل ينصروكم أو ينتصرون؟ فكُبكبوا في الحضيض الأسفل، هم والغاوون لهم، الذين منعوهم من الدخول في حضرة الأولياء، وجنود إبليس أجمعون\n قالوا - وهم في غم الحجاب ونار القطيهة يختصمون -: تالله إن كنا لفي ضلال مبين، إذ نسويكم برب العالمين في المحبة والميل، وما أضلنا إلا المجرمون، الذين حكموا بقطع التربية على الدوام، وسدوا الباب في وجوه الرجال، فما لنا من شافعين، ولا صديق حميم، يشفع لنا حتى نلتحق بالمقربين\n هيات لا يكون اللحوق بهم إلا بالدخول معهم، في مقام المجاهدة في دار الدنيا، ثم يتمنون الرجوع ليُصدِّقوا بهم، وينخرطوا في سلكهم، فلا يجدون له سبيلاً\n وبالله التوفيق\n ثم ذكر قصة نوح عليه السلام، فقال: { كَذَّبَتْ قَوْمُ نُوحٍ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:73",
      "similarity": 0.8836579992809207
    },
    {
      "verse": "81:26",
      "similarity": 0.8080900202940596
    },
    {
      "verse": "2:148",
      "similarity": 0.5635934203182846
    },
    {
      "verse": "28:62",
      "similarity": 0.5264096760815392
    },
    {
      "verse": "28:74",
      "similarity": 0.5264096760815392
    }
  ]
}