{
  "chapter": "النمل",
  "text": "فتبسم ضاحكا من قولها وقال رب اوزعنى ان اشكر نعمتك التى انعمت على وعلى ولدى وان اعمل صلحا ترضىه وادخلنى برحمتك فى عبادك الصلحين",
  "translations": [
    {
      "translation": "He smiled, laughing at its words, and said, 'My Lord, keep me thankful for the blessing You have bestowed on me and on my parents, and keep me acting rightly, pleasing You, and admit me, by Your mercy, among Your slaves who are righteous.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Solomon) smiled, amused at her speech, and said: \"O Lord grant me that I should be grateful for the favours You have bestowed on me and my parents, and do good things of Your pleasing; and admit me among Your righteous devotees by Your grace.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Smiling at the ant's utterance, Solomon burst into laughter and said: \"My Lord! Hold me under (Your) control that I may render thanks for the favour which You have bestowed on me and on my parents, and that I may act righteously in a manner that would please You. Include me, out of Your Mercy, among Your righteous servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Solomon) smiled at the ant's remarks and said, \"Lord, inspire me to thank you for Your favors to me and my parents and to act righteously so as to please you. Admit me, by your mercy into the company of Your righteous servants\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He therefore smiled beamingly at her speech*, and submitted, “My Lord, bestow me guidance so that I thank you for the favour which You bestowed upon me and my parents, and so that I may perform the good deeds which please You, and by Your mercy include me among Your bondmen who are worthy of Your proximity.” (Prophet Sulaiman heard the voice of the she ant from far away.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he (Sulayman) smiled, amused at her speech and said: \"My Lord! Grant me the power and ability that I may be grateful for Your favors which You have bestowed on me and on my parents, and that I may do righteous good deeds that will please You, and admit me by Your mercy among Your righteous servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he smiled, wondering at her word, and said: My Lord! grant me that I should be grateful for Thy favor which Thou hast bestowed on me and on my parents, and that I should do good such as Thou art pleased with, and make me enter, by Thy mercy, into Thy servants, the good ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he smiled, laughing at its words, and he said, 'My Lord, dispose me that I may be thankful for Thy blessing wherewith Thou hast blessed me and my father and mother, and that I may do righteousness well-pleasing to Thee; and do Thou admit me, by Thy mercy, amongst Thy righteous servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (Solomon) smiled, laughing at her speech, and said: My Lord, arouse me to be thankful for Thy favour wherewith Thou hast favoured me and my parents, and to do good that shall be pleasing unto Thee, and include me in (the number of) Thy righteous slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Solomon smiled broadly at its words and said, \"Lord, inspire me to be thankful for the blessings You have granted me and my parents, and to do good deeds that please You; and include me, by Your grace, among Your righteous servants!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he smiled, amused at her speech, and said: my Lord! arouse me that I should be thankful for Thy favour wherewith Thou hast favoured me and my parents, and that I should work righteously pleasing Thee, and out of Thy mercy enter me among Thine righteous bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereat he smiled, amused at its words, and he said, ‘My Lord! Inspire me to give thanks for Your blessing with which You have blessed me and my parents, and that I may do righteous deeds which please You, and admit me, by Your mercy, among Your righteous servants.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he smiled, amused at her speech; and he said: \"O my Lord! so order me that I may be grateful for Thy favours, which thou hast bestowed on me and on my parents, and that I may work the righteousness that will please Thee: And admit me, by Thy Grace, to the ranks of Thy righteous Servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he [Sulaiman (Solomon)] smiled, amused at her speech and said: \"My Lord! Inspire and bestow upon me the power and ability that I may be grateful for Your Favours which You have bestowed on me and on my parents, and that I may do righteous good deeds that will please You, and admit me by Your Mercy among Your righteous slaves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He smiled, and laughed at its words, and said: 'My Lord, inspire me that I should be thankful for Your blessing with which You have blessed me and my parents, and that I may do good works that will please You. Admit me, by Your Mercy, among Your righteous worshipers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He smiled and laughed at her words, and said, “My Lord, direct me to be thankful for the blessings you have bestowed upon me and upon my parents, and to do good works that please You. And admit me, by Your grace, into the company of Your virtuous servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So [Solomon] smiled, amused at her speech, and said, \"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:19] Whereat he, Solomon, smiled (fa-tabassama, the beginning [of the sentence]) amused (dāhikan, the end [of the sentence]) at its words, which he had heard from three miles away and which was carried to him by the winds. When he was on the verge of [entering] their valley, he [Solomon] made his hosts halt until they [the ants] had entered their dwellings — on this journey his hosts consisted of cavalry and infantry. And he said, ‘My Lord, inspire me to be thankful for Your grace with which You have favoured me and my parents, and to do good that will please You, and include me, by Your mercy, among Your righteous servants’, the prophets and saints.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (Solomon) smiled, laughing) in amazement (at her speech) because he heard her speech while his army did not, (and said: My Lord, arouse me) inspire in me (to be thankful for Thy favour wherewith Thou hast favoured me) you have blessed me with the profession of Allah's divine Oneness (and my parents) 427 whom you also blessed with the profession of Allah's divine Oneness, (and to do good) in all sincerity (that shall be pleasing unto Thee) that you would accept (and include me in (the number of) Thy righteous slaves) and include me with Your righteous slaves in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْزِعْنِيۤ } معناه سَدِّدنِي للشّكرِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Guide me,\" means: Make me firm in thankfulness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وهذا هو السير الحكمي باكتساب الملكات الفاضلة وتعديل الأخلاق وإلا لما بقيت للنملة الكبرى ولصغارها عين ولا أثر في الفناء بتجليات الصفات { فتبسّم ضاحكاً من قولها } أي: استبشروا بزوال الملكات الرديئة وحصول الملكات الفاضلة ودعا ربّه بالتوفيق لشكر هذه النعمة التي أنعم بها عليه بالاتصاف بصفاته وأفعاله والفناء عن أفعال نفسه وصفاتها\n وعلى والديه\n أي: الروح والنفس بكمال الأول وتنوّره وقبول الثانية وتأثرها بقوله: { ربّ أوزعني أن أشكر نعمتك التي أنعمت عليّ وعلى والديّ وأن أعمل صالحاً ترضاه } بالاستقامة في القيام بحقوق تجليات صفاتك والعبادات القلبية لوجهك ونور ذاتك { وأدخلني برحمتك في عبادك الصالحين } أي: بكمال ذاتك في زمرة الكمل الذين هم سبب صلاح العالم وكمال الخلق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمع سليمان عليه السلام من النملة ما سمع { فَتَبَسَّمَ } تبسماً ظاهراً إلى أن صار { ضَاحِكاً } متعجباً { مِّن قَوْلِهَا } المشتمل على أنواع التدابير والخيرات من حسن المعاشرة مع الجيران\n وآداب المصاحبة مع الإخوان\n والتحذير عن مظان المهالك والمتالف قبل الوقوع فيها وغير ذلك\n\n\n{ وَ } بعدما اطلع سليمان على قولها وغرضها توجه نحو الحق عادّاً على نفسه جلائل نعم الله وآلائه\n حيث { قَالَ } حينئذٍ مناجياً إليه سبحانه: { رَبِّ } يا من رباني بأنواع الخيرات والكرامات التي ما أعطاها أحداً من خلقه { أَوْزِعْنِيۤ أَنْ أَشْكُرَ نِعْمَتَكَ ٱلَّتِيۤ أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ } ووفقني على أن أؤدي حقوقها على الوجه الذي ينبغي ويليق بشأنك وشأنها\n ولا يتأتى مني هذا إلا بتوفيقك وتيسيرك\n وفقني على إتمامها وتكميلها\n\n\n{ وَ } يسير علي { أَنْ أَعْمَلَ } في مدة حياتي عملاً { صَالِحاً تَرْضَاهُ } أي: مقبولاً عندك\n مرضياً لك { وَ } بعدما توفيتني { أَدْخِلْنِي بِرَحْمَتِكَ } وسعة فضلك وجودك { فِي } زمرة { عِبَادِكَ ٱلصَّالِحِينَ } [النمل: 19] المرضيين عندك\n المقبولين دونك\n وعندني من عدادهم\n واحشرني من زمرتهم\n إنك على ما تشاء قدير\n وبرجاء المؤملين جدير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ فتبسم ضاحكاً } \n معجباً { من قولها } ومِن حَذَرِها\n واهتدائها لمصالحها\n ونُصحها للنمل\n وفرحاً بظهور عدله\n والتبسم: ابتداء الضحك\n وأكثر الضحك الأنبياء التبسّم\n أي: فتبسم ابتداء\n ضاحكاً انتهاء\n { وقال ربِّ أوزعني } \n الإيزاع في الأصل: الكف\n أي: كُفَّني عن كل شيء إلا عن شكر نعمتك\n ويطلق على الإلهام\n أي: ألهمني { أن أشكرَ نعمتك التي أنعمتَ عليَّ } من النبوة والمُلك والعلم\n { وعلى والديَّ } لأن الإنعام على الوالدين إنعام على الولد\n { و } ألهمني { أن أعمل صالحاً ترضاه } في بقية عمري\n { وأدخِلْني برحمتك } أي: وأدخلني الجنة برحمتك\n لا بصالح عملي إذ لا يدخل الجنة إلا برحمتك كما في الحديث\n { في عبادك الصالحين } أي: في جملة أنبيائك المرسلين\n الذين صلحوا لحضرتك\n أو: مع عبادك الصالحين\n رُوي أن النملة أحست بصوت الجنود\n ولم تعلم أنهم في الهواء فأمر سليمان عليه السلام الريح\n فوقفت لئلا يذعرن\n حتى دخلن مساكنهن\n ثم دعا بالدعوة\n قاله النسفي\n الإشارة: من أقبل بكليته على مولاه\n وأطاعه في كل شيء\n سخرت له الأكوان\n وأطاعته في كل شيء\n ومن أعرض عن مولاه أعرض عنه كلُّ شيء\n وصعب عليه كلُّ شيء\n \" أنت مع الأكوان ما لم تشهد المكون\n فإذا شهدته كانت الأكوانُ معك \"\n فإذا سخرت له الأشياء\n وزهد فيها\n وأعرض عنها\n واختار مقام العبودية\n ارتفع قدره\n ولم ينقص منه شيئاً\n كحال نبينا - عليه السلام -\n ومن سخرت له الأشياء\n ونظر إليها\n انتقص قدره\n وإن كان كريماً على الله\n ولذلك ورد في الخبر أن سليمان عليه السلام: هو آخر من يدخل الجنة من الأنبياء\n ذكره في القوت\n وذكر فيه أيضاً: أن سليمان عليه السلام لَبِسَ ذات يوماً ثياباً رفيعة\n ثم ركب على سريره\n فحملته الريح\n وسارت به\n فنظر إلى عطفيه نظرة\n فأنزلته إلى الأرض\n فقال لها: لِمَ أنزلتني ولَمْ آمرك؟ فقالت له: نطعيك إذا أطعت الله\n ونعصيك إذا عصيته\n فاستغفر وتاب\n فحملته\n وهذا مما يعتب علىالمقربين لِكِبر مقامهم\n فكل نعيم في الدنيا ينقص في الآخرة\n والله تعالى أعلم\n ثم قال تعالى: { وَتَفَقَّدَ ٱلطَّيْرَ فَقَالَ مَالِيَ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:15",
      "similarity": 0.25263881075716965
    },
    {
      "verse": "41:19",
      "similarity": 0.2468516117871385
    },
    {
      "verse": "27:17",
      "similarity": 0.22914090409558763
    },
    {
      "verse": "27:83",
      "similarity": 0.22061085593607307
    },
    {
      "verse": "83:34",
      "similarity": 0.13673475987312347
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}