{
  "chapter": "النمل",
  "text": "والق عصاك فلما رءاها تهتز كانها جان ولى مدبرا ولم يعقب يموسى لا تخف انى لا يخاف لدى المرسلون",
  "translations": [
    {
      "translation": "Throw down your staff.' Then when he saw it slithering like a snake he turned and fled and did not turn back again. 'Have no fear, Musa. In My Presence the Messengers have no fear -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down your staff.\" When he saw it wriggling like a serpent he turned his back and fled without turning (to look). \"O Moses,\" (said the voice), \"be not fearful. Surely those sent as messengers do not fear in My presence,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now cast your rod!\" But when he saw the rod writhing as though it were a serpent, he turned his back in retreat and did not even look behind. \"O Moses, have no fear. Messengers have no fear in My presence,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down your staff.\" When Moses saw his staff on the ground moving like a living creature, he stepped back and did not come forward again. The Lord said,\"Moses, do not be afraid. Messengers do not become afraid in My presence\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And put down your staff”; so when he saw it writhing like a serpent, he turned moving away without looking back; We said, “O Moosa, do not fear; indeed the Noble Messengers do not fear in My presence.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And throw down your stick!\" But when he saw it moving as if it were a snake, he turned in flight, and did not look back. (It was said:) \"O Musa! Fear not: verily, the Messengers fear not in front of Me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cast down your staff. So when he saw it in motion as if it were a serpent, he turned back retreating and did not return: O Musa! fear not; surely the apostles shall not fear in My presence;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cast down thy staff.' And when he saw it quivering like a serpent he turned about, retreating, and turned not back. 'Moses, fear not; surely the Envoys do not fear in My presence,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And throw down thy staff! But when he saw it writhing as it were a demon, he turned to flee headlong; (but it was said unto him): O Moses! Fear not! the emissaries fear not in My presence,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down your staff.\" But when he saw it moving like a snake, he turned and fled. \"Moses, do not be afraid! The messengers need have no fear in My presence;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cast thou down thy staff. Then when he saw it wriggling as though it were a serpent, he turned in flight and looked not back. O Musa! fear thou not; verily in My presence the sent ones fear not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Throw down your staff!’ When he saw it wriggling, as if it were a snake, he turned his back [to flee], without looking back. ‘O Moses! ‘Do not be afraid. Indeed the apostles are not afraid before Me,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now do thou throw thy rod!\" But when he saw it moving (of its own accord) as if it had been a snake, he turned back in retreat, and retraced not his steps: \"O Moses!\" (it was said), \"Fear not: truly, in My presence, those called as messengers have no fear,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And throw down your stick!\" But when he saw it moving as if it were a snake, he turned in flight, and did not look back. (It was said): \"O Musa (Moses)! Fear not, verily! The Messengers fear not in front of Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cast down your staff' And when he saw it writhing like a serpent, he turned about retreating, and did not turn back. 'Moses, do not fear, indeed theMessengers do not fear (when they are) with Me,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw down your staff.” But when he saw it quivering, as though it were a demon, he turned around not looking back. “O Moses, do not fear; the messengers do not fear in My presence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [he was told], \"Throw down your staff.\" But when he saw it writhing as if it were a snake, he turned in flight and did not return. [Allah said], \"O Moses, fear not. Indeed, in My presence the messengers do not fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:10] Throw down your staff’, and he threw it down. And when he saw it wriggling, moving, like a serpent, a slender snake, he turned his back in flight and did not come back. God, exalted be He, says: ‘O Moses, do not fear, it. Surely in My presence, before Me, the messengers do not fear, any snake or otherwise,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And throw down thy staff) from your hand! And he threw it, (But when he saw it writhing) moving (as it were a demon) like a serpent which is neither big nor small, (he turned to flee headlong) from it and did not 426 look back out of fear; but Allah said to him: (0 Moses! Fear not! Lo! the emissaries fear not in My presence,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَأَنَّهَا جَآنٌّ } وهي جِنسٌ من الحَياتِ\n\n\n\n\nوقوله تعالى: { وَلَمْ يُعَقِّبْ } معناه لم يَرجِعْ\n وقال لَم يَلتَفِتْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {as if it were a life}, and it is a kind of life.\n And his saying, \"And he will not be punished\" - its meaning is that he will not return [to Allah].\n\n\nAnd he said, \"He did not turn away.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أي: خلفاً عن الضبط بالرياضة وأرسلها ولا تمنعها عن الحركة فإنها تنوّرت { فلما رآها } تضطرب وتتحرّك { كأنها } حيّة غالبة بالظهور { ولى } إلى جناب الحق { مُدْبِراً } خوف ظهور النفس { ولم يعقب } أي: لم يرجع وبقي مشتغلاً بتدارك البقية { لا تخف } من استيلاء النفس وظهور الحجاب\n فإن النفس إذا حييت بعد موتها بالإرادة وفنائها بالرياضة إن استقلت بنفسها واستبدت بأمر كانت حجاباً وابتلاء\n وإذا تحرّكت بأمري حيّة بنور الروح والمحبة الحقانية لا بهواها لم تكن حجاباً { إني لا يخاف لديّ المرسلون } الذين أرسلتهم بالبقاء بعد الفناء وأحييت نفوسهم بحياتي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n قال له آمراً: { أَلْقِ عَصَاكَ } التي أخذتها بيدك على الأرض\n لترى من عجائب صنعتنا وغرائب حكمتنا ما ترى\n حتى تتنبه من تبدل صورتها وسيرتها إلى سر سريان وحدتنا الذاتية في المظاهر كلها\n فألقاها على الفور فإذا هي حي تسعى { فَلَمَّا رَآهَا } موسى\n أي: العصا { تَهْتَزُّ } وتتحرك { كَأَنَّهَا جَآنٌّ } أي: حية صغيرة سريعة السير { وَلَّىٰ }  وانصرف منها موسى { مُدْبِراً } خائفاً هائباً\n قلقاً حائراً من أمرها\n\n{ وَلَمْ يُعَقِّبْ } أي: لم يرجع إليها ليأخذها\n هيبةً وخوفاً قلنا منادين\n ليقبل: { يٰمُوسَىٰ لاَ تَخَفْ } من عصاك\n وستعود إلى سيرتها الأصلية { إِنِّي } من كمال مرحتمي وإشفاقي على خلَّ عبادي { لاَ يَخَافُ لَدَيَّ } أحد من أوليائي سيما { ٱلْمُرْسَلُونَ } [النمل: 10] منهم\n المختارون للرسالة والتشريع العام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وألقِ عصاك } لتعلم معجزتها\n فتأنس بها\n وهو عطف على بُورك أي: نودي أن بورك وأنْ ألق عصاك\n والمعنى: قيل له: بورك من في النار\n وقيل له: أَلقِ عصاك\n { فلما رآها تهتزُّ } تتحرك يميناً وشمالاً\n { كأنها جانٌّ } حية صغيرة { وَلَّى } موسى { مُدْبِراً } أي: أدبر عنها\n وجعلها تلي ظهره\n خوفاً من وثوب الحية عليه\n { ولم يُعقِّبْ } لم يرجع على عقبيه\n من: عقّب المقاتل: إذا كرّ بعد الفر\n\nوالخوف من الشيء المكروه أمر طبيعي\n لا يتخلف\n وليس في طوق البشر\n قال له تعالى: { يا موسى لا تخفْ } من غيري\n ثقة بي\n أو: لا تخف مطلقاً { إني لايخاف لَدَيَّ المرسلون } أي: لا يخاف المرسلون عند خطابي إياهم\n فإنهم مستغرقون في شهود الحق\n لا يخطر ببالهم خوف ولا غيره\n وأما في غير أحوال الوحي فهم أشد الناس خوفاً منه سبحانه\n أو: لا يخافون من غيري\n لأنهم لديَّ في حفظي ورعايتي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:31",
      "similarity": 0.9349618436226343
    },
    {
      "verse": "41:39",
      "similarity": 0.48364191366033316
    },
    {
      "verse": "26:44",
      "similarity": 0.2377031111235761
    },
    {
      "verse": "26:45",
      "similarity": 0.21355970631823346
    },
    {
      "verse": "7:117",
      "similarity": 0.2101204494419694
    }
  ]
}