{
  "chapter": "النمل",
  "text": "حتى اذا اتوا۟ على واد النمل قالت نملة يايها النمل ادخلوا۟ مسكنكم لا يحطمنكم سليمن وجنوده وهم لا يشعرون",
  "translations": [
    {
      "translation": "Then, when they reached the Valley of the Ants, an ant said, 'Ants! enter your dwellings so that Sulayman and his troops do not crush you unwittingly.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till they reached the Valley of Naml. Said the lady of Naml: \"O Naml, go into your dwellings lest Solomon and his hordes should crush you unawares.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Solomon was once on the move with them) until when they reached a valley of ants one of the ants said: \"O ants, get into your holes, lest Solomon and his hosts crush you (under their feet) without even knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they arrived in the valley of the ants, one ant said to the others, \"Enter your dwellings lest you be carelessly crushed by Soloman and his army.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they came to the valley of the ants, a she ant exclaimed, “O ants, enter your houses – may not Sulaiman and his armies crush you, unknowingly.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they came to the valley of the ants, one of the ants said: \"O ants! Enter your dwellings, lest Sulayman and his armies should crush you, while they perceive not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they came to the valley of the Naml, a Namlite said: O Naml! enter your houses, (that) Sulaiman and his hosts may not crush you while they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "till, when they came on the Valley of Ants, an ant said, 'Ants, enter your dwelling-places, lest Solomon and his hosts crush you, being unaware!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they reached the Valley of the Ants, an ant exclaimed: O ants! Enter your dwellings lest Solomon and his armies crush you, unperceiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they came to the Valley of the Ants, one ant said, \"Ants! Go into your dwellings, in case Solomon and his hosts inadvertently crush you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they came unto the valley of the ants, an ant said: O ants! enter Your habitations lest Sulaiman and his hosts crush you while they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they came to the Valley of Ants, an ant said, ‘O ants! Enter your dwellings, lest Solomon and his hosts should trample on you while they are unaware.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At length, when they came to a (lowly) valley of ants, one of the ants said: \"O ye ants, get into your habitations, lest Solomon and his hosts crush you (under foot) without knowing it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they came to the valley of the ants, one of the ants said: \"O ants! Enter your dwellings, lest Sulaiman (Solomon) and his hosts crush you, while they perceive not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they came to the Valley of the Ants, an ant said: 'Ants, go into your dwellings lest Solomon and his army should, unknowingly, crush you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they came upon the Valley of Ants, an ant said, “O ants! Go into your nests, lest Solomon and his troops crush you without noticing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they came upon the valley of the ants, an ant said, \"O ants, enter your dwellings that you not be crushed by Solomon and his soldiers while they perceive not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:18] When they came to the Valley of the Ants — which is [located] either in Tā’if or in Syria, and whose ants are either small or large — an ant, the queen ant, who had seen Solomon’s hosts, said, ‘O ants, enter your dwellings, lest Solomon and his hosts crush you while they are unaware!’ — the ants are likened to rational beings in their use of the latter’s speech.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Till, when they reached the Valley of the Ants) in Historic Syria, (an ant exclaimed: ants! Enter your dwellings lest Solomon and his armies crush you) step on you, (unperceiving) unaware of you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ } معناه لا يَكْسُرنَّكُمْ\n\n",
      "translations": [
        {
          "translation": " And His saying - be glorified - {… will not break you into pieces}, means: will not crush you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكان عليه السلام مع جنوده على الوجه الذي ذكر { حَتَّىٰ إِذَآ أَتَوْا عَلَىٰ وَادِ ٱلنَّمْلِ } هو وادٍ بالشام كثير النمل؛ لذلك سميت به { قَالَتْ نَمْلَةٌ } بعدما رأت سواد العسكر، و أشعرت بعبورهم على الوادي منادية لإخوانها، صائحة عليهم، صارخة: { يٰأَيُّهَا ٱلنَّمْلُ } الضعيف النحيف { ٱدْخُلُواْ مَسَاكِنَكُمْ } مسرعين متحرزين، ولا تقفوا في الصحراء حتى { لاَ يَحْطِمَنَّكُمْ } ولا يطأنكم { وَهُمْ } بحوافر خيولهم { سُلَيْمَانُ وَجُنُودُهُ } وإن كانوا من أرباب البر والتقوى، محترزين عن أمثال هذا الظلم الصريح إلاَّ أنهم { لاَ يَشْعُرُونَ } [النمل: 18] بكم؛ لصغركم وحقارتكم فيطئوكم بلا شعور وإدراك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قالت نملة }: التاء للوحدة، لا للتأنيث\n قال الرضي: تكون التاء للفرق بين المذكر والمؤنث، وتكون لآحاد الجنس، كنحلة ونحل، وثمرة وثمر، وبطة وبط، ونملة ونمل، فيجوز أن تكون النملة مذكراً، والتاء للوحدة، وأنث الفعل باعتبار تأنيث اللفظ\n هـ\n مختصراً\n ولا يحطمنكم: يحتمل أن يكون جواباً للأمر، أو: نهياً بدلاً من الأمر لتقارب المعنى لأن الأمر بالشيء نهي عن ضده\n والضد ينشأ عنه الحطْم، فلا: ناهية، ومثله الحديث:\n\n \" فليُمسك بِنَصَالها، لا يعقر مسلماً \" \n\nهـ\n يقول الحق جل جلاله: { وحُشِرَ لسليمانَ } أي: جُمع له { جنودُهُ من الجنِ والإِنس والطيرِ } بمباشرة مخاطبيه، فإنهم رؤساء مملكته، وعظماء دولته، من الثقلين وغيرهم\n وتقديم الجن على الإنس للإيذان بكمال قوة ملكه وعزة سلطانه لأن الجن طائفة عاتية، وقبيلة طاغية، ماردة، بعيدة من الحشر والتسخير، { فهم يُوزَعون } أي: يحبس أوائلهم على أواخرهم، أي: يوقف سلاف العسكر حتى يلحقهم الثواني، فيكونوا مجتمعين، لا يختلف منهم أحد، وذلك لكثرة العظمة والقهرية\n قال قتادة: فكان لكل صنف منهم وزعة\n أو: لترتيب الصفوف، كما هو المعتاد في العساكر\n والوزع: المنع، ومنه قول الحسن البصري، حين ولي القضاء: لا بد للحاكم من وزعة أي: شُرط يمنعون الناس من الظلم\n وتخصيص حبس أوائلهم بالذكر دون سوق أواخرهم مع أن التلاحق يحصل بذلك أيضاً: لأن أواخرهم غير قادرين على ما يقدر عليه أوائلهم من السير السريع، وهذا إن لم يكن سيرهم بتسيير الريح في الجو\n قال محمد بن كعب: كان عسكر سليمان مائة فرسخ، خمسة وعشرون للجن، وخمسة وعشرون للإنس، وخمسة وعشرون للطير، وخمسة وعشرون للوحش\n وكان له ألف بيت من قوارير على الخشب، فيها ثلاثمائة منكوحة، وسبعمائة سرية\n وقد نسجت له الجن بساطاً من ذهب وإبريسم، فرسخاً في فرسخ، وكان يوضع منبره في وسطه، وهو من ذهب، فيقعد عليه، وحوله ستمائة ألف كرسي من ذهب وفضة، فتقعد الأنبياء - عليهم السلام - على كراسي الذهب، والعلماء على كراسي الفضة، وحولهم الناس، وحول الناس الجن والشياطين، وتظله الطير بأجنحتها، حتى لا تقع عليه الشمس، وترفع ريح الصبا البساط، فتسير به مسيرة شهر، من الصباح إلى الرواح\n ورُوي أنه كان يأمر الريح العاصف تحمله، ويأمر الرخاء تُسيِّره، فأوحى الله تعالى إليه، وهو يسير بين السماء والأرض: إني زدت في ملكك أنه لا يتكلم أحد بشيء إلا ألقته الريح في سمعك\n قال وهب: حدثني أبي: أن سليمان مرّ بحرّاثٍ، فقال: لقد أُوتي آلَ داود مُلكاً عظيماً، فالتفت ونزل إلى الحرّاث، فقال: إني سمعت قولك، وإنما مشيت إليك لئلا تتمنى ما لا تقدر عليه، لتسبيحة واحدة يقبلها الله منك خير لك مما أوتي آلُ داود\n\n\nهـ\n { حتى إذا أتوا على وادِ النمل } أي: فساروا حتى بلغوا وداي النمل، وهو واد بالشام، كثير النمل، قاله مقاتل\n أو: بالطائف، قاله كعب\n وقيل: هو واد يسكنه الجن، والنمل مراكبهم\n وعدي الفعل بـ \" على \" لأن إتيانهم كان من فوق، فأتى بحرف الاستعلاء\n ولعلهم أرادوا أن ينزلوا بأعلى الوادي إذ حينئذٍ يخافهم من في الأرض، لا عند سيرهم في الهواء\n وجواب إذ قوله: { قالت نملة } ، وكأنها لما رأتهم متوجهين إلى الوادي فرّت منهم، فصاحت صيحة، فنبهت بها ما بحضرتها من النمل\n قال كعب: مرّ سليمان عليه السلام بوادي السدير، من أودية الطائف، فأتى على واد النمل، فقالت نملة، وهي تمشي، وكانت عرجاء تتكاوس، مثل الذئب في العِظَم\n قال الضحاك: كان اسم تلك النملة طاحية، وقيل: منذرة، وقيل: جرمي\n وقال نوف الحميري: كان نمل وادي سليمان أمثال الذباب\n وعن قتادة: أنه دخل الكوفة، فالتف عليه الناس، فقال: سلوني عما شئتم، فسأله أبو حنيفة، وهو شاب، عن نملة سليمان، أكان ذكراً أو أنثى؟ فأفحم، فقال أبو حنيفة: كانت أنثى، فقيل له: بم عرفت؟ فقال: قوله تعالى: { قالت نملة } ولو كان ذكراً لقال: قال نملة\n هـ\n قلت: وهو غير صحيح لِمَا تقدم عن الرضي\n { قالت نملةٌ يا أيها النمل ادخلوا مساكنكم } لم يقل: ادخلن لأنه لَمَّا جعلها قائلة،والنمل مقولاً لهم، كما يكون من العقلاء، أجرى خطابهن مجرى ذوي العقل، { لا يَحْطِمَنَّكُمْ } لا يكسرنّكم\n والحطم: الكسر، وهو في الظاهر نهى لسليمان عن الحطم، وفي الحقيقة نهى لهم عن البروز والوقوف على طريقه، نحو: لا أرينك ها هنا، أي: لا تتعرضوا فيكسرنكم { سليمانُ وجنودُه } ، وقيل: أراد: لا يحطمنكم جنود سليمان، فجاء بما هو أبلغ\n { وهم لا يشعرون } لا يعلمون بمكانكم، أي: لو شعروا ما فعلوا\n قالت ذلك على وجه العذر، واصفةً سليمان وجنوده بالعدل، فحمل الريح قولها إلى سليمان على ثلاثة أميال\n رُوي أن سليمان قال لها: لم حذرت النمل، أَخفتِ ظلمي؟ أما عَلِمتِ أني نبي عدل، فلِمَ قُلتِ: { لا يحطمنكم سليمان وجنوده }؟ فقالت: أما سمعتَ قولي: { وهم لا يشعرون } ، مع أني لم أُرد حَطْم النفوس، وإنما أردت حطم القلوب، خشيتُ أن يتمنينَّ ما أُعطيتَ، ويشغلن بالنظر إليك عن التسبيح، فقال لها سليمان: عظيني، فقالت: هل علمتِ لِمَ سُمي أبوك داود؟ قال: لا، قالت: لأنه داوى جرحَه\n هل تدري لِمَ سميت سليمان؟ قال: لا، قالت: لأنك سليم، ما ركنت إلى ما أوتيت، لسلامة صدرك، وأنَى لك أن تلحق أباك\n ثم قالت: اتدري لِمَ سخر الله لك الريح؟ قال: لا، قالت: أخبرك الله أن الدنيا كلها ريح\n قال ابن عباس: ومن هنا \" نهى النبي صلى الله عليه وسلم عن قتل أربعة من الدواب: الهدهد، والصُّرد، والنحلة، والنملة \"\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:119",
      "similarity": 0.47328183456496703
    },
    {
      "verse": "104:5",
      "similarity": 0.29420001951858776
    },
    {
      "verse": "104:4",
      "similarity": 0.28245304245724157
    },
    {
      "verse": "56:65",
      "similarity": 0.27874208402339606
    },
    {
      "verse": "9:121",
      "similarity": 0.15669080107636493
    }
  ]
}