{
  "chapter": "النمل",
  "text": "ولقد ءاتينا داود وسليمن علما وقالا الحمد لله الذى فضلنا على كثير من عباده المؤمنين",
  "translations": [
    {
      "translation": "We gave David and Solomon knowledge; and they said: \"All praise be to God who has favoured us over many of His creatures who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the other hand), We granted knowledge to David and Solomon and they said: \"All praise be to Allah Who has exalted us above many of His believing servants!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave knowledge to David and Soloman. They said, \"It is only God who deserves all praise. He has exalted us above many of His believing servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We indeed bestowed great knowledge to Dawud and Sulaiman; and they both said, “All praise is to Allah, Who bestowed us superiority over many of His believing bondmen.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave knowledge to Dawud and Sulayman, and they both said: \"All praise be to Allah, Who has preferred us above many of His believing servants!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We gave knowledge to Dawood and Sulaiman, and they both said: Praise be to Allah, Who has made us to excel many of His believing servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave David and Solomon knowledge and they said, 'Praise belongs to God who has preferred us over many of His believing servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We verily gave knowledge unto David and Solomon, and they said: Praise be to Allah, Who hath preferred us above many of His believing slaves!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We bestowed knowledge on David and Solomon and they both said, \"Praise be to God who has exalted us above many of His believing servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed unto Daud and Sulaiman a knowledge, and the twain said: praise unto Allah Who hath preferred us above many of His believing bondmen!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, We gave knowledge to David and Solomon, and they said, ‘All praise belongs to Allah, who granted us an advantage over many of His faithful servants.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave (in the past) knowledge to David and Solomon: And they both said: \"Praise be to Allah, Who has favoured us above many of his servants who believe!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave knowledge to Dawud (David) and Sulaiman (Solomon), and they both said: \"All the praises and thanks be to Allah, Who has preferred us above many of His believing slaves!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave knowledge to David and Solomon. They said: 'Praise be to Allah who has preferred us above many of His believing worshipers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave David and Solomon knowledge. They said, “Praise God, who has favored us over many of His believing servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We had certainly given to David and Solomon knowledge, and they said, \"Praise [is due] to Allah, who has favored us over many of His believing servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:15] And verily We gave David and Solomon, his son, knowledge, of rendering [decisive] judgement between people, and [knowledge] of the speech of birds and of other things, and they said, giving thanks to God, ‘Praise be to God Who has favoured us, with prophethood and the disposal of jinn, humans and devils [to our service], over many of His believing servants’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We verily gave knowledge) and understanding through prophethood and judgeship (unto David) the son of Jesse (and Solomon) the son of David, (and they said) both of them: (Praise be to Allah) thanks and gratitude to Allah, (Who hath preferred us) through knowledge and prophethood (above many of His believing slaves!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من سعة جودنا، وعموم فيضنا وفضلنا { لَقَدْ آتَيْنَا } وأعطينا { دَاوُودَ وَ } إبنه { سُلَيْمَانَ عِلْماً } متعلقاً بالحكم والأحكام، وعموم تدبيرات الأنام، وضبط أحوالهم وأوضاعهم المتداولة بينهم من الإنصاف والانتصاف وإقامة الحدود، وسد الثغور وغيرها من الأمور المتعلقة بضبط المملكة\n\n\n\n\n{ وَقَالاَ } بعدما آرادا أن يشكرا الله، ويؤديا حقوق نعمه الجليلة، ومنحه الفائضة الجزيلة: { ٱلْحَمْدُ } والمنة، والثناء التام الناشىء من عموم الألسنة، وجميع الجوارح الممنونة من نعمه، المغمورة بموائد لطفه وكرمه { لِلَّهِ } الواحد الأحد الصمد، المستحق لعموم المحامد والأثنية الصادرة من ذرائر الأكوان طوعاً { ٱلَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٍ مِّنْ عِبَادِهِ ٱلْمُؤْمِنِينَ } [النمل: 15] له، الموحدين بذاته، المصدقين لأنبيائه ورسله وكتبه، وخصصنا من بينهم بمزيد الكرامة المتعلقة برئاسة الدارين، وسيادة النشأتين، وحكومة الثقلين، والحكمة المتقنة المتعلقة بمرتبتي الناسوت واللاهوت، وحضرة الرحموت والجبروت\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ولقد آتينا داودَ وسليمانَ عِلماً } أي: أعطينا كل واحد منهما طائفة خاصة به من علم الشرائع والأحكام، وغير ذلك مما يختص به كل واحد منهما، كصنعة الدروع، ومنطق الطير\n أو: علماً لدُنِيا\n { وقالا } أي: كل واحد منهما، شكراً لما أُوتيه من العلم: { الحمدُ لله الذي فضَّلنا } بما آتانا من العلم { على كثيرٍ من عباده المؤمنين }\n قال النسفي: وهنا محذوف، ليصلح عطف الواو عليه، ولولا تقدير المحذوف لكان الوجه: الفاء، كقولك: أعطيته فشكر، وتقديره: آتيناهما علماً، فعملا به، وعرفا حق النعمة فيه، وقالا: { الحمد لله الذي فضَّلنا على كثير }\n والكثير المفضّل عليه: من لم يؤت علماً أو: من لم يؤت مثل علمهما\n وفيه: أنهما فُضّلا على كثير وفضل عليهما كثير\n وفي الآية دليلٌ على شرف العلم، وتقدم حملته وأهله، وأن نعمة العلم من أجلّ النعم، وأن من أوتيه فقد أُوتي فضلاً على كثير من عباده، وما سماهم رسول الله صلى الله عليه وسلم ورثة الأنبياء إلا لمداناتهم في الشرف والمنزلة لأنهم القوّام بما بُعِثُوا من أجله\n وفيها: أنه يلزمهم لهذه النعمة الفاضلة أن يحمدوا الله تعالى على ما أوتوه، وأن يعتقدَ العالم أنه إذا فُضّل على كثير فقد فُضّل عليه مثلهم\n وما أحسن قول عمر رضي الله عنه: كلّ الناس أفقه من عمر\n هـ\n والعلماء على قسمين: علماء بالله وعلماء بأحكام الله\n فالعلماء بالله هم العارفون به، أهل الشهود والعيان\n وهم أهل علم الباطن، أعني علم القلوب، والعلماء بأحكام الله هم علماء الشرائع والنوازل\n وحيث انتهت درجة العلماء بأحكام الله ابتدئت درجة العلماء بالله\n فنهاية علماء الظاهر بداية علماء الباطن لأن علم أهل الظاهر جله ظني، وعلم أهل الباطن عياني، ذوقي، وليس الخبر كالعيان، مع ما فاقوهم به من المجاهدة والمكابدة، ومقاساة مخالفة النفوس، وقطع المقامات، حتى ماتوا موتات، ثم حييت أرواحهم، فشاهدوا من الأنوار والأسرار ما تعجز عنه العقول، وتكلّ عنه النقول",
      "translations": []
    }
  ]
}