{
  "chapter": "النمل",
  "text": "الا من ظلم ثم بدل حسنۢا بعد سوء فانى غفور رحيم",
  "translations": [
    {
      "translation": "except for one who did wrong and then changed evil into good - for I am Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who do some wrong but afterwards do good to make up for the wrong. And I am forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except he who has committed some wrong. But if he substitutes good in place of evil, I am Most Forgiving, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only the unjust become afraid in My presence. Even to these people who replace their bad deeds by good ones, I am All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Except the one* who does injustice and then after evil changes it for virtue – then indeed I am Oft Forgiving, Most Merciful.” (Other than the Prophets.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except him who has done wrong and afterwards has changed evil for good; then surely, I am Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither he who has been unjust, then he does good instead after evil, for surely I am the Forgiving, the Merciful:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save him who has done evil, then; after evil, has changed into good; All-forgiving am I, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save him who hath done wrong and afterward hath changed evil for good. And lo! I am Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as for those who do wrong and then do good after evil, I am most forgiving, most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Excepting any who may have done wrong and thereafter changeth evil for good then verily I am Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor those who do wrong and then make up for [their] fault with goodness, for indeed I am all-forgiving, all-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if any have done wrong and have thereafter substituted good to take the place of evil, truly, I am Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except him who has done wrong and afterwards has changed evil for good, then surely, I am Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except he who has done evil, then, after evil, has changed into good. I am the Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever has done wrong, and then substituted goodness in place of evil. I am Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Otherwise, he who wrongs, then substitutes good after evil - indeed, I am Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:11] except him who has wronged, his soul, but then changed [his wrong] for good — he [then] performs [good deeds] — after [having done] evil, in other words, [he has] repented, then truly I am Forgiving, Merciful, I will accept his repentance and forgive him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Save him who hath done wrong and afterward hath changed evil for good. And lo! I am Forgiving) I forgive the one who repents, (Merciful) I show mercy towards he who dies in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ مَن ظَلَمَ } من المرسلين بارتكاب ذنب صدر منه، لا عن عمد { ثُمَّ بَدَّلَ } وتدارك ذنبه { حُسْناً } بالتوبة والندامة { بَعْدَ سُوۤءٍ } صدر منه { فَإِنِّي غَفُورٌ } لهم أغفر لهم، وأعفو عن زلتهم { رَّحِيمٌ } [النمل: 11] أرحمهم وأقبل توبتهم بعدما صدرت عن خلوص طويتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا من ظَلَمَ } أي: لكن من ظلَم مِن غيرهم لأن الأنبياء لا يَظلمون قط، فهو استثناء منقطع، استدرك به ما عسى يختلج في العقل، من نفي الخوف عن كلهم، مع أن منهم من فرطت منه صغيرة مما يجوز صدوره عن الأنبياء - عليهم السلام - كما فرط من آدم، وموسى، وداود، وسليمان - عليهم السلام - فحسنات الأبرار سيئات المقربين\n وقد قصد به التعريض بما وقع من موسى - عليه السلام - ومن وكزه القبطيّ\n وسماها ظلماً، كقوله عليه السلام في سورة القصص:\n\n[القصص: 16]\n قال في الحاشية الفاسية: والظاهر في الاستثناء كونه متصلاً، وأطلق الظلم باعتبار منصب النبوة، وإشفاقهم مما لا يشفق منه غيرهم، كما اتفق لموسى في مدافعة القبطي عن الإسرائيلي، مع أن إغاثة المظلوم مشروعة عموماً، ولكن لَمَّا لم يُؤذَن له خصوصاً عُد ذلك ظلماً وذنباً\n وأما ما سرى من القتل فلم يقصده، وإنما اتفق من غير قصد\n هـ\n قوله: { ثم بدّلَ حُسْناً بعد سُوءٍ } أي: أتبع زلته حسنة محلها، كالتوبة وشبهها، { فإني غفور رحيمٌ } أقبل توبته، وأغفر حوبته، وأرحمه، فأحقق أمنيَّته\n والله تعالى أعلم\n الإشارة: تقدم بعض إشارة الآية في سورة طه\n وقوله تعالى: { أن بورك من في النار\n\n\n } تقدم قول ابن عباس وغيره: أن المراد بمن في النار: نور الحق تعالى\n قال بعض العلماء: كانت النار نوره تعالى، وإنما ذكره بلفظ النار لأن موسى حسبه ناراً، والعرب تضع أحدهما موضع الآخر\n هـ\n ومنه حديث:\n\n \" حجُابه النار، لو كشفه لأحرقت سُبُحاتُ وجهه كلَّ شيء أدركه بصره \" \n\n، أي: حجابه النور الذي تجلى به في مظاهر خلقه، فالأواني حجب للمعاني، والمعاني هي أنوارالملكوت، الساترة لأسرار الجبروت، السارية في الأشياء\n وقال سعيد بن جبير: هي النار بعينها، وهي إحدى حجب الله تعالى\n ثم استدل بالحديث: \" حجابة النار \" ومعنى كلامه: أن الله تعالى احتجت في مظاهر تجلياته، وهي كثيرة، ومن جملتها النار، فهي إحدى الحجب التي احتجب الحق تعالى بها، وإليه أشار ابن وفا بقوله\n\nولا يفهم هذا إلا أهل الفناء في الذات، العارفون بالله، وحسب من لم يبلغ مقامهم التسليم لِما رمزوا إليه، وإلا وقع الإنكار على أولياء الله بالجهل، والعياذ بالله\n ثم ذكر معجزة اليد، فقال: { وَأَدْخِلْ يَدَكَ فِي جَيْبِكَ تَخْرُجْ\n\n\n }\n",
      "translations": []
    }
  ]
}