{
  "chapter": "النمل",
  "text": "وورث سليمن داود وقال يايها الناس علمنا منطق الطير واوتينا من كل شىء ان هذا لهو الفضل المبين",
  "translations": [
    {
      "translation": "Sulayman was Dawud's heir. He said, 'Mankind! we have been taught the speech of birds and we have been given everything. This is indeed clear favour.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Solomon was heir to David, and he said: \"O people, we have been taught the language of Tair, and have been given of everything. This is a clear favour indeed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Solomon succeeded David and said: \"O people, we have been taught the speech of birds and we have been endowed with all kinds of things. Surely this is a conspicuous favour (from Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Solomon became the heir to David. He said, \"People, we have been taught the language of the birds and have been granted a share of everything. This indeed is a manifest favor (from God)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Sulaiman became Dawud’s heir; and he said, “O people, we have indeed been taught the language of birds, and have been given from all things; this surely is a manifest favour.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Sulayman inherited from Dawud. He said: \"O mankind! We have been taught the language of birds, and we have been given from everything. This, verily, is an evident grace.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Sulaiman was Dawood's heir, and he said: O men! we have been taught the language of birds, and we have been given all things; most surely this is manifest grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Solomon was David's heir, and he said, 'Men, we have been taught the speech of the birds, and we have been given of everything; surely this is indeed the manifest bounty.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Solomon was David's heir. And he said: O mankind! Lo! we have been taught the language of birds, and have been given (abundance) of all things. This surely is evident favour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Solomon succeeded David. He said, \"Know, my people, that we have been taught the speech of birds and endowed with all good things. Surely this is God's manifest grace.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Sulaiman inherited from Daud. And he said: O mankind! verily have been taught the diction of we birds, and we have been vcuchsafed of every thing; and verily this is grace manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Solomon inherited from David, and he said, ‘O people! We have been taught the speech of the birds, and we have been given out of everything. Indeed this is a manifest advantage.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Solomon was David's heir. He said: \"O ye people! We have been taught the speech of birds, and on us has been bestowed (a little) of all things: this is indeed Grace manifest (from Allah.)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Sulaiman (Solomon) inherited (the knowledge of) Dawud (David). He said: \"O mankind! We have been taught the language of birds, and on us have been bestowed all things. This, verily, is an evident grace (from Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Solomon inherited David. He said: 'Know, my people, we have been taught the speech of birds and given everything. Surely, this is a clear bounty'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Solomon succeeded David. He said, “O people, we were taught the language of birds, and we were given from everything. This is indeed a real blessing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Solomon inherited David. He said, \"O people, we have been taught the language of birds, and we have been given from all things. Indeed, this is evident bounty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:16] And Solomon inherited from David, prophethood and knowledge exclusively from among all his other children; and he said, ‘O people, we have been taught the speech of the birds, that is, the ability to understand their sounds, and we have been given of all things, given to prophets and kings. Indeed this, gift, is the manifest, the evident, favour’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And Solomon was David's heir) as king instead of all the other sons of David who were 19 in number. (And he said) Solomon said: (0 mankind! Lo! we have been taught) we were given the understanding of (the language of birds, and have been given (abundance) of all things) and we were given the knowledge of everything in my kingdom. (This surely is evident favour) this is surely a great blessing from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عُلِّمْنَا مَنطِقَ ٱلطَّيْرِ } قالَ الإِمام زيد بن علي عليهما السلام: إنما أرادَ التَّعليم، إنهُ عُلِّمَ مَنطِق النَّملةِ من الطَّيرِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"We have taught the speech of birds,\" Imam Zayd ibn Ali said: He only meant to teach, for he was taught the speech of ants from birds.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَوَرِثَ سُلَيْمَانُ دَاوُودَ } يعني: بعدما انقرض داوود استخلف عنه سليمان عليه السلام\n وورث من نبوته وحكمته وحكومته\n وسخر له جميع ما سخر لداوود مع زيادات خلال عنه أبوه عليه السلام\n وهو تسخير الجن والريح ومنطق الطيق\n فإنها ما تيسر لأبيه { وَ } بعدما تمكن سليمان عليه السلام على مقر الحكومة والنبوة { قَالَ } يوماً للملأ الجالسين حوله تنويهاً وتشهيراً لنعم الله على نفسه: { يٰأَيُّهَا ٱلنَّاسُ عُلِّمْنَا } بلسان الوحي وترجمانه { مَنطِقَ ٱلطَّيْرِ وَأُوتِينَا } من فضل الله علينا { مِن كُلِّ شَيْءٍ } أي: كثير من الأشياء ما لم يُؤت مثله أحدٌ من العالمين { إِنَّ هَـٰذَا } الإعطاء والتخصيص والتفضل { لَهُوَ ٱلْفَضْلُ ٱلْمُبِينُ } [النمل: 16] الظاهر اللائح فضله على كل أحد\n والملك العظيم الذي لم يؤتَ أحدٌ من الأنبياء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { وورِثَ سليمانُ داودَ }\n وَرِثَ منه النبوة والملك دون سائر بنيه وكانوا تسعة عشر\n ووراثته للنبوة: انتقالها إليه بعد أبيه\n وإلا فالنبوة لا تورث\n { وقال يا أيها الناس عُلِّمنا منطلقَ الطير } تشهيراً لنعمة الله\n واعترافاً بمكانها\n ودعاء للناس إلى تصديقه بذكر المعجزة التي هي علم منطق الطير\n والمنطق: كل ما يصوَّت به من المفرد والمؤلّف\n والمفيد وغير المفيد\n وكان سليمان عليه السلام يفهم عنها كما يفهم بعضها بعضاً\n يُحكى أنه مرَّ على بلبل على شجرة\n يحرك رأسه\n ويميل ذنبه\n فقال لأصحابه: أتدرون ما يقول؟ قالوا: الله ونبيه أعلم\n قال يقول: إذا أكلت نصف تمرة فعلى الدنيا العَفَاء\n\nوصاحت فاختة\n فأخبر أنها تقول: ليت ذا الخلق لم يُخلقوا\n وصاح طاووس\n فقال: يقول: كما تدين تدان\n وصاح هُدهد\n فقال: يقول: من لا يرحم لا يُرحم\n وصاح صُّرَد - وهو طائر ضخم الرأس - فقال: يقول: استغفروا الله يا مذنبين\n وصاح طيطوى\n فقال: يقول: كل حي ميت\n وكل جديد بال\n وصاح خُطَّاف\n فقال: يقول: قَدِّموا خيراً تجدوه\n وصاح قُمْرِيّ\n فأخبر أنه يقول: سبحان ربي الأعلى\n وصاحت رخمة\n فقال: إنها تقول سبحان ربي الأعلى ملء أرضه وسمائه\n وفي رواية: هدرت حمامة\n فقال: إنها تقول: سبحان ربي الأعلى - مثل الرخمة - وقال: الغراب يدعو على العشَّار\n والحِدَأة تقول: كل شيء هالك إلا وجهه\n والقطاة تقول: من سكت سَلِمَ\n والببغاء تقول: ويل لمن الدنيا همه\n والديك يقول: اذكروا الله يا غافلين\n والنسر يقول: يا ابن آدم عش ما شئت\n آخرك الموت\n والعُقاب يقول: في البُعد من الناس أُنس\n والضفدع تقول: سبحان ربي القدوس\n والبازي يقول: سبحان ربي وبحمده\n المذكور في كل مكان\n والدراج يقول: الرحمن على العرش استوى\n والقنب يقول: إلهي العن مبغض آل محمد\n عليه الصلاة والسلام\n وقيل: إن سليمان كان يفهم صوت الحيوانات كلها\n وإنما خصَّ الطير لأنه معظم جنده\n ثم قال: { وأُوتينا من كل شيء } أي: ما نحتاج إليه\n والمراد به كثرة ما أُوتي\n كما تقول: فلان يقصده كل أحد\n ويعلم كل شيء\n كناية عن كثرة علمه\n { إنَّ هذا لهو الفضلُ } والإحسان من الله تعالى { المبين } أي: الواضح\n الذي لا يخفى على أحد\n أو: إن هذا الفضل الذي أوتيته هو الفضل المبين\n على أنه عليه السلام قاله على سبيل الشكر والمحمدة\n كما قال رسول الله صلى الله عليه وسلم:\n \" أَنَا سَيِّدُ وَلَدِ آدَمَ وَلاَ فَخْرَ \" \nأي: أقول هذا القول شكراً\n لا فخراً\n والنون في عُلمنا وأُوتينا نون الواحد المطاع\n وكان حينئذٍ ملكاً\n فكلم أهل طاعته على الحالة التي كان عليها\n وليس فيه تكبر ولا فخر لعصمة الأنبياء من ذلك\n والله تعالى أعلم\n الإشارة: أشرف العلوم وأعظمها وأعزها العلم بالله\n على سبيل الذوق والكشف والوجدان\n ولا يكون إلا من طريق التربية على يد شيخ كامل لأنه إذا حصل هذا العلم أغنى عن العلوم كلها\n وصغرت في جانبه\n حتى إن صاحب العلم بالله يعد الاشتغال بطلب علم الرسوم بطالة وانحطاطاً\n ومَثَله كمن عنده قناطير من الفضة\n ثم وجد جبلاً من الإكسير\n فهل يلتفت صاحبُ الإكسير إلى الفضة أو الفلوس؟ لأن من كانت أوقاته كلها مشاهدة ونظراً لوجه الملك\n كيف يلتفت إلى شيء سواه\n ولذلك قال الجنيد رضي الله عنه: لو نعلم تحت أديم السماء أشرف من هذا العلم\n الذي نتكلم فيه مع أصحابنا\n لسعيت إليه\n هـ\n\nوقال شيخ شيوخنا\n سيدي عبد الرحمن العارف: كنت أعرف أربعة عشر علماً\n فما أدركت علم الحقيقة\n سرطت ذلك كله\n ولم يبق إلا التفسير والحديث\n نتكلم فيه مع أصحابنا\n أو قريباً من هذا الكلام\n وقال شيخ شيوخنا\n سيدي عبد الرحمن المجذوب رضي الله عنه:\nوهذا أمر بيِّن عند أهل هذا الفن\n وقال الورتجبي: العلم علمان: علم البيان وعلم العيان\n علم البيان ما يكون بالوسائط الشرعية\n وعلم العيان مستفاد من الكشوفات الغيبية\n ثم قال: فالعلم البياني معروف بين العموم\n والعلم العياني مشهور بين الخصوص\n لم يطلع عليه إلا نبي أو وَليّ\n لأنه صدر من الحق لأهل شهوده\n من المحبين العارفين والموحدين والصديقين\n والأنبياء والمرسلين\n انظر بقية كلامه\n وقال أيضاً في قوله: { عُلِّمنا منطقَ الطير }: أفْهَم أن أصوات الطيور والوحوش وحركات الأكوان جميعاً هي خطابات من الله عز وجل للأنبياء والمرسلين\n والعارفين والصديقين\n يفهمونها من حيث أحوالهم ومقاماتهم\n فللأنبياء والمرسلين علم بمناطقها قطعياً\n ويمكن أن يقع ذلك بوحي\n لكن أكثر فهوم الأنبياء أنهم يفهمون من أصواتها ما يتعلق بحالهم\n بما يقع في قلوبهم من إلهام الله\n لا بأنهم يعرفون لغاتهم بعينها\n هـ\n قلت: وكذلك الأولياء يفهمون عنها ما يليق بمقاماتهم\n من ألفاظ\n أو أنس\n أو إعلام\n أو غير ذلك\n والله تعالى أعلم\n ولمّا أراد سليمان الغزو\n جمع جنوده\n كما قال تعالى: { وَحُشِرَ لِسْلَيْمَانَ جُنُودُهُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:15",
      "similarity": 0.5710731701054274
    },
    {
      "verse": "77:35",
      "similarity": 0.44919497007983866
    },
    {
      "verse": "38:30",
      "similarity": 0.44791043164586536
    },
    {
      "verse": "37:92",
      "similarity": 0.440327905976435
    },
    {
      "verse": "51:23",
      "similarity": 0.4258462693014533
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/27:16.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/27:16.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}