{
  "chapter": "النمل",
  "text": "فمكث غير بعيد فقال احطت بما لم تحط به وجئتك من سباۭ بنبا يقين",
  "translations": [
    {
      "translation": "However, it was not long delayed, and then it said, 'I have comprehended something you have not and bring you accurate intelligence from Sheba.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he was not long in coming, and reported: \"I have been around where you have not been. I come from Saba with positive news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not before long the hoopoe came up and said: \"I have obtained a knowledge which you could not. I have brought for you sure news about Sheba.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not long after the hoopoe came forward and said, \"I have information which you do not have. I have come from the land of Sheba with a true report.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Hudhud did not stay absent for long, and presenting himself submitted, “I have witnessed a matter that your majesty has not seen, and I have brought definite information to you from the city of Saba.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (the hoopoe) stayed not long, he said: \"I have grasped which you have not grasped and I have come to you from Saba' with true news.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he tarried not long, then said: I comprehend that which you do not comprehend and I have brought to you a sure information from Sheba.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he tarried not long, and said, 'I have comprehended that which thou hast not comprehended, and I have come from Sheba to thee with a sure tiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he was not long in coming, and he said: I have found out (a thing) that thou apprehendest not, and I come unto thee from Sheba with sure tidings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he was not long in coming, and said, \"I have learnt something you did not know. I have come to you from Sheba with reliable news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Buthe tarried not far, and he said: I have encompassed that which thou hast- not encompassed, and I come unto thee from Saba with a tidings sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He did not stay for long [before he turned up] and said, ‘I have alighted on something which you have not alighted on, and I have brought you from Sheba a definite report.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Hoopoe tarried not far: he (came up and) said: \"I have compassed (territory) which thou hast not compassed, and I have come to thee from Saba with tidings true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the hoopoe stayed not long, he (came up and) said: \"I have grasped (the knowledge of a thing) which you have not grasped and I have come to you from Saba' (Sheba) with true news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was not long in coming, and said: 'I know what you do not know. I come to you from Sheba with certain news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he did not stay for long. He said, “I have learnt something you did not know. I have come to you from Sheba, with reliable information.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the hoopoe stayed not long and said, \"I have encompassed [in knowledge] that which you have not encompassed, and I have come to you from Sheba with certain news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:22] But he did not remain (read fa-makutha or fa-makatha) long [in absence], in other words, [he was away only] for a short while, and came to Solomon humbly, with his head up and his wings and tail lowered. Solomon pardoned him and asked him about what he had encountered during his absence: and he said, ‘I have discovered something of which you have no knowledge, and I have brought you from Sheba (this may be read in declined form [min Saba’in] or left as indeclinable [min Saba’a]) — a tribe in Yemen, whose name is taken from the name of one of their ancestors (which is also the reason why it may be declined) — a verified report.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But he was not long in coming, and he said: I have found out (a thing) that thou apprehendest not) king! I reached a place that you have not reached and have come to know that which you do not, (and I come unto thee from Sheba) the city of Sheba (with sure tidings) with an amazing, true information.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِنَبَإٍ يَقِينٍ } معناه بِخيرٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَمَكَثَ } الهدهد بعد تفقد سليمان وتهديده زماناً { غَيْرَ بَعِيدٍ } مديد متطاول، ثمَّ حضر عنده بلا تراخٍ طويل { فَقَالَ } معتذراً لغيبته ومكثه: إنما مكثت وغبت عن خدمتك؛ لأني { أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ } أنت يا سيدي؛ يعني: تعلق إدراكي بمعلوم لم يتعلق به قبل لا علمي ولا علمك، ولا علم أحد من جنودك { وَ } بعد وقوفي واطلاعي به { جِئْتُكَ مِن } بلاد قبيلة { سَبَإٍ } من نواحي المغرب، وبمن ملك عليها { بِنَبَإٍ } وخبر { يَقِينٍ } [النمل: 22] مطابق للواقع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { فَمَكَثَ غيرَ بعيدٍ } أي: تفقد مكث سليمان حين تفقد الهدهد، وأرسل من ورائه غير زمان بعيد، وهو من الظهر إلى العصر - كما تقدم - أو: فمكث الهدهد في غيبته غير بعيد، خوفاً من سليمان، فالضمير إما لسليمان، أو: للهدهد، وهو الظاهر، ويرجحه قراءة: فتمكث\n وفي \" مكث \" لغتان: الضم والفتح\n ولما قدِمَ من غيبته، أحضر بين يديه، على الهيئة المتقدمة، ثم سأله عن غيبته، { فقال أَحطتُ بما لم تُحِطْ به } أي: أدركت علماً لم تُحط به أنت، أَلهم الله الهدهدَ فكافح سليمانَ بهذا الكلام، مع ما أوتي من فضل النبوة والعلوم الجمة، ابتلاء له عليه السلام في علمه، وتنبيهاً على أن في أدنى خلقه اضعفهم من أحاطه الله علماً بما لم يُحط به لتتصاغر إليه نفسه، ويصغر في عينه وعلمه، في جانب علم الله، رحمة به ولُطفاً في ترك الإعجاب، الذي هو فتنة العلماء\n\n\nثم قال: { وجئتك من سبأ } - بالصرف - اسماً للحيّ، أو: للأب الأكبر، وبعدمه اسماً للقبيلة\n { بنبأٍ يقين } ، والنبأ: الخبر الذي له شأن\n وقوله: { من سبأ بنبإٍ } من محاسن الكلام ويسمى البديع\n وقد حسن وبرع لفظاً ومعنىً، حيث فسر إبهامه بأبدع تفسير، وأراه أنه كان بصدد إقامة خدمة مهمة\n وعبّر عما جاء به بالنبأ، الذي هو الخبر الخطير والشأن الكبير، ووصفه بما وصفه به\n { وإني وجدتُ امرأةَ تملكهم } هو استئناف لبيان ما جاء به من النبأ، وتفسير له إثر الإجمال\n وهي بلقيس بنت شراحيل بن مالك بن ريان\n وكان أبوها ملك أرض اليمن كلها، ورث الملك من أربعين أباً\n وقيل: كان أبوها - اسمه الهدهاد - ملكاً عظيم الشأن، ملك أرض اليمن كلها، وأبى أن يتزوج منهم، فزوجوه امرأة من الجن، يقال لها \" ريحانة \" فولدت له بلقيس، ولم يكن له ولد غيرها\n قال أبو هريرة: قال النبي صلى الله عليه وسلم:\n\n \" كان أحد أبوي بلقيس جنياً \" \n\nفمات أبوها، فاختلف قومه فرقتين، وملّكوا أمرهم رجلاً قائماً بسيرته، حتى فجَر بحرم رعيته، فأدركت بلقيس الغيرة، فعرضت عليه نفسها، فتزوجته، فسقته الخمر، فسكر، فجزت رأسه، ونصبته على باب دارها فملكوها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:15",
      "similarity": 0.6703209024917102
    },
    {
      "verse": "17:106",
      "similarity": 0.3101361624960035
    },
    {
      "verse": "18:3",
      "similarity": 0.30968254847575355
    },
    {
      "verse": "43:77",
      "similarity": 0.30761435477778337
    },
    {
      "verse": "20:10",
      "similarity": 0.22718668424003752
    }
  ]
}