{
  "chapter": "النمل",
  "text": "قالت يايها الملؤا۟ انى القى الى كتب كريم",
  "translations": [
    {
      "translation": "(The Queen said): \"O nobles, a venerable letter has been delivered to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Queen said:\" Know my nobles that a gracious letter has been delivered to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The Queen of Sheba) said to her officials, \"A gracious letter has been dropped before me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The woman said, “O chieftains, indeed a noble letter has been dropped upon me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"O chiefs! Verily, here is delivered to me a noble letter, \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: O chief! surely an honorable letter has been delivered to me\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, 'O Council, see, a letter honourable has been cast unto me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The Queen of Sheba) said (when she received the letter): O chieftains! Lo! there hath been thrown unto me a noble letter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Queen of Sheba said, \"O Counsellors, an honourable letter has been delivered to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: O chiefs! verily there hath been cast unto me an honourable epistle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, ‘O [members of the] elite! Indeed a noble letter has been delivered to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The queen) said: \"Ye chiefs! here is delivered to me - a letter worthy of respect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"O chiefs! Verily! Here is delivered to me a noble letter,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She (the Queen of Sheba) said: 'O Council, look, an honorable letter has been dropped to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “O Counselors, a gracious letter was delivered to me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"O eminent ones, indeed, to me has been delivered a noble letter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:29] Then, she said, to the noblemen of her people: ‘O [members of the] council, lo! (read yā ayyuhā’l-mala’u innī, pronouncing [in the last two words] both hamzas; or by not pronouncing the second one and changing it into a wāw with kasra vowelling) a noble, a sealed, letter has been delivered to me.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "428 He did as Solomon commanded, and Balqis took the letter and went to meet her entourage. ((The Queen of Sheba) said: chieftains! Lo! there hath been thrown unto me a noble letter) a sealed letter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنِّيۤ أُلْقِيَ إِلَيَّ كِتَابٌ كَرِيمٌ } معناه حَسنٌ مَا فيهِ\n وقال: الكَريمُ: المَختومُ\n قال الإمام زيد بن علي عليهما السلام: كانَ سُليمانُ بن دَاود عليه السَّلامُ كَتَبَ إِلى بَلقيسَ، وكَانتْ بأَرضٍ يُقالُ لَها مَأْربٌ، على ثَلاثةِ أيامٍ من صنعاءَ وكَانَ أُولوا مَشهورتِها ثَلثمائةَ واثنى عَشَر رجلاَ، كُلُّ رَجلٍ منهُم عَلَى عَشرةِ آلافِ رجلٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nحيث { قَالَتْ } منادية مستفتية منهم: { يٰأَيُّهَا ٱلْمَلأُ إِنِّيۤ أُلْقِيَ إِلَيَّ } اليوم { كِتَابٌ كَرِيمٌ } [النمل: 29] وصفته بالكرامة؛ لأنها نائمة في قصرها والأبواب مغلقة عليها، فرأت في صدرها هذا بلا إحضار محضر، كأنهم قالوا: ممن؟ وما مضمونه؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقيل: نقرها، فانتبهت فزعة، أو: أتاها الجنود حولها، فوقف ساعة يرفرف فوق رؤوسهم، ثم طرح الكتاب في حجرها، وكانت قارئة، فلما رأت الخاتم { قالت } لأشرف قومها وهي خائفة: { يا أيها الملأ إني أُلقي إليَّ كتابٌ كريمٌ } ، وصفتْه بالكرم لكرم مضمونه إذ هو حق، أو: لأنه من ملك كريم، أو: لكونه مختوماً\n قال - عليه الصلاة والسلام -:\n\n \" كَرَمُ الكتابِ خَتْمُهُ \" \n\nأو: لكونه مصدراً بالتسمية، أو: لغرابة شأنه، ووصوله إليها على وجه خرق العادة",
      "translations": []
    }
  ]
}