{
  "chapter": "النمل",
  "text": "الله لا اله الا هو رب العرش العظيم",
  "translations": [
    {
      "translation": "Allah - there is no god but Him - the Lord of the Mighty Throne.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God: There is no god but He, the Lord of the glorious throne.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah - none is worthy of worship save He; He is the Lord of the Mighty Throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the only Lord and master of the Great Throne.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Allah – there is no True God except Him, the Owner of the Great Throne.” (Command of Prostration # 8)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, La ilaha illa Huwa, the Lord of the Supreme Throne!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, there is no god but He: He is the Lord of mighty power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God: there is no god but He, the Lord of the Mighty Throne.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah; there is no Allah save Him, the Lord of the Tremendous Throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God: there is no deity but He, the Lord of the mighty throne.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! there is no God but he, the Lord of the Magnificent Throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah—there is no god except Him—is the Lord of the Great Throne.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah!- there is no god but He!- Lord of the Throne Supreme!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, La ilaha illa Huwa (none has the right to be worshipped but He), the Lord of the Supreme Throne!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, there is no god except He, the Lord of the Mighty Throne'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God—There is no god but He, the Lord of the Sublime Throne.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah - there is no deity except Him, Lord of the Great Throne.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:26] God — there is no god except Him, the Lord of the Mighty Throne’ (this clause constitutes an [independent] new sentence, which is a eulogy comprising [praise of] the Throne of the Compassionate One to counter the [description of the] throne of Bilqīs: between the two, however, is an unfathomable difference).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah; there is no God save Him, the Lord of the tremendous Throne.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يظهر المكنون من الأمور، ولا يعلم خفيات الصدور { ٱللَّهُ } الواحد الأحد الصمد، الحي القيوم الذي { لاَ إِلَـٰهَ } أي: لا موجود في الوجود { إِلاَّ هُوَ رَبُّ ٱلْعَرْشِ ٱلْعَظِيمِ } [النمل: 26] المحيط بجميع ما لمع عليه برق تجلياته المتشعشة المتحددة المترتبة على أسمائه الذاتية الكاملة، المستدعية للظهور والبروز بإظهار ما كمن من الكمالات، المندمجة في الذات الأحدية إلى فضاء الوجود\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الله لا إله إلا هو ربُّ العرش العظيم } الذي هو أول الأجرام وأعظمهما\n ووصفُ الهدهد عرشَ الله بالعظم تعظيم له بالنسبة إلى سائر ما خلق من السموات والأرض\n وفي الخبر:\n\n \" إن السموات والأرض في جانب العرش كحلقة في فلاة \" \n\nووصفه عرش بلقيس تعظيم له بالنسبة إلى عروش أبناء جنسها من الملوك\n هذا آخر كلام الهدهد\n ثم دلهم على الماء فحفروا وشربوا، وملؤوا الركايا، والله تعالى أعلم\n الإشارة: هُدهد كل إنسان نفسه، فإذا تفقدها فوجدها غائبة عن الله، في أودية الغفلة، هددها بالعذاب الشديد، وبذبحها بأنواع المخالفة، حتى تأتيه بحجة واضحة، تعذر بها، فإن لم تأت بحجة عذَّبها وذبحها، بإدخالها في كل ما تكره ويثقل عليها، فتمكث غير بعيد، فتأتيه بالعلوم اللدنية، والأسرار الربانية، التي لم يحط بها علماً قبل ذلك، وتجيئه بالخبر اليقين، في العلم بالله، من عين اليقين، أو حق اليقين، فتخبره عن أحوال عامة أهل الحجاب، فتقول: إني وجدت إمرأة تملكهم، وهي نفسهم الأمارة، وأوتيت من كل شيء تشتهيه وتهواه، من غير وازع ولا قامع، ولها عرش عظيم، وهو سرير الغفلة والانهماك في حب الدنيا والشهوات\n أو: لها تسلط كبير على من ملكته، وجدتها وقومها يسجدون للسّوى، ويخضعون للهوى من دون الله، وزيّن لهم الشيطانُ ذلك، فصدهم عن طريق الوصول، فهم لا يهتدون إلى الوصول إلى الحضرة أبداً ما داموا كذلك لأن حضرة ملك الملوك محرمة على من هو لنفسه مملوك\n ألا يسجدوا بقلوبهم لله وحده، فإنه مطلع على خبايا القلوب والأسرار، وعلى ما يُسرون من الإخلاص، وما يُعلنون من الأعمال، التي توجب الاختصاص\n وبالله التوفيق\n ولما سمع سليمان كلام الهدهد أرسله بكتابه إلى بلقيس، كما قال تعالى: { قَالَ سَنَنظُرُ أَصَدَقْتَ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:129",
      "similarity": 0.7194305748398943
    },
    {
      "verse": "20:5",
      "similarity": 0.6881846308445824
    },
    {
      "verse": "23:86",
      "similarity": 0.6240529345916866
    },
    {
      "verse": "27:23",
      "similarity": 0.5858465856690975
    },
    {
      "verse": "23:116",
      "similarity": 0.5696205479027636
    }
  ]
}