{
  "chapter": "النمل",
  "text": "وجدتها وقومها يسجدون للشمس من دون الله وزين لهم الشيطن اعملهم فصدهم عن السبيل فهم لا يهتدون",
  "translations": [
    {
      "translation": "I found both her and her people prostrating to the sun instead of Allah. Shaytan has made their actions seem good to them and debarred them from the Way so they are not guided",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found that she and her people worship the sun in place of God, for Satan has made their deeds look attractive to them and has turned them away from the Path, so they do not find the way\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found that she and her people prostrate themselves before the sun rather than Allah. \" Satan has made their deeds appear attractive to them and has, thus, debarred them from the Right Path so they do not find true guidance\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people prostrating before the sun instead of God. Satan has made their deeds attractive to them. He has kept them away from the right path and they have no guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I found her and her nation prostrating before the sun instead of Allah, and Satan has made their deeds seem good to them thereby preventing them from the Straight Path – so they do not attain guidance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people worshipping the sun instead of Allah, and Shaytan has made their deeds fair seeming to them to prevent them from the way, so they have no guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people adoring the sun instead of Allah, and the Shaitan has made their deeds fair-seeming to them and thus turned them from the way, so they do not go aright\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people prostrating to the sun, apart from God; Satan has decked out fair their deeds to them and he has barred them from the way, and therefore they are not guided,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people worshipping the sun instead of Allah; and Satan maketh their works fairseeming unto them, and debarreth them from the way (of Truth), so that they go not aright;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people worshipping the sun, instead of God. Satan has made their conduct appear good to them, and has thus diverted them from the right path, so that they might not be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have found her and her people adoring the sun instead of Allah, and the Satan hath made their works fairseeming unto them, and hath barred them from the way, so they are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people prostrating to the sun instead of Allah, and Satan has made their deeds seem decorous to them—thus he has barred them from the way [of Allah], so they are not guided—\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people worshipping the sun besides Allah: Satan has made their deeds seem pleasing in their eyes, and has kept them away from the Path,- so they receive no guidance,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people worshipping the sun instead of Allah, and Shaitan (Satan) has made their deeds fair-seeming to them, and has barred them from (Allah's) Way, so they have no guidance,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But she and her people prostrate to the sun instead of Allah. And satan has made their deeds seem pleasing to them and barred them from the Path, and therefore they are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people worshiping the sun, instead of God. Satan made their conduct appear good to them, and diverted them from the path, so they are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found her and her people prostrating to the sun instead of Allah, and Satan has made their deeds pleasing to them and averted them from [His] way, so they are not guided,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:24] I found her and her people prostrating to the sun instead of God, and Satan has adorned for them their deeds and he has barred them from the Way, from the path of truth, so that they are not guided\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(I found her and her people worshipping the sun instead of Allah; and Satan maketh their works) their worship of the sun (fair-seeming unto them, and debarreth them from the way (of Truth)) the devil has barred them from the way of Truth and guidance, (so that they go not aright) to the way of truth and guidance:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَجَدتُّهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ } ويعبدونها { مِن دُونِ ٱللَّهِ } المستحق للتذلل والعبادة { وَ } من غاية جهلهم بالله، وغفلتهم عن كمال أوصافه وأسمائه الحسنى { زَيَّنَ لَهُمُ ٱلشَّيْطَانُ أَعْمَالَهُمْ } هذه وعبادتهم للشمس { فَصَدَّهُمْ } وصرفهم بتزيينه وتغريره { عَنِ ٱلسَّبِيلِ } السوي، الموصل إلى توحيد الحق الحقيقي بالعبودية والتذلل { فَهُمْ } بسبب تضليل الشيطان وتغريره، ورسوخهم على ما زُين لهم { لاَ يَهْتَدُونَ } [النمل: 24] إلى التوحيد بمقتضى فطرتهم الأصلية وجبلتهم الحقيقية\n\n\nفلا بدَّ لهم من مرشد كامل، وهادٍ مشفق يهديهم إلى سواء السبيل، مع أنهم من زمرة العقلاء المميِّزين بين الهداية والضلالة، ولكنهم بانهماكهم في الغفلة والغرور، زيَّن لهم الشيطان عبادة الشمس التي هي من جملة مظاهر الحق، مقتصرين العبادة عليها؛ لقصور نظرهم، ولو نبههم منبه نبيه على توحيد الله واستقلاله سبحانه في جميع مظاهره، لعل الله يوقظهم من منام الغفلة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وكانت بلقيس مجوسية، فلذلك قال: { وجدتُها وقومَها يسجدون للشمس من دون الله } أي: يعبدونها متجاوزين عبادة الله\n { وزيَّن لهم الشيطانُ أعمالهم } التي هي عبادة الشمس، ونظائرها من أصناف الكفر والمعاصي، { فصدَّهم عن السبيل } عن سبيل الرشد والصواب، وهو التوحيد { فهم لا يهتدون } إليه\n ولا يَبْعد من الهدهد التهدّي إلى معرفة الله، ووجوب السجود له، وحرمة السجود للشمس، إلهاماً من الله له، كما ألهمه وغيره من الطيور وسائر الحيوانات والمعارف اللطيفة، التي لا يكاد العقلاء، الراجحة العقول، يهتدون إليها\n وهذا من أسرارالربوبية، التي سرت في الأشياء، فوحّدَت الله تعالى، ولهجت بحمده\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:38",
      "similarity": 0.49157017082381993
    },
    {
      "verse": "47:1",
      "similarity": 0.39385427685705987
    },
    {
      "verse": "43:37",
      "similarity": 0.39335907131162745
    },
    {
      "verse": "43:62",
      "similarity": 0.3903143379724529
    },
    {
      "verse": "13:33",
      "similarity": 0.37504209682087586
    }
  ]
}