{
  "chapter": "النمل",
  "text": "وتفقد الطير فقال ما لى لا ارى الهدهد ام كان من الغائبين",
  "translations": [
    {
      "translation": "He inspected the birds and said, 'How is it that I do not see the hoopoe? Or is it absent without leave?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he reviewed the Tair, he said: \"How is it I do not see Hud-hud? Is he absent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On another occasion) Solomon inspected the birds and said: \"Why is it that I do not see the hoopoe? Is he among the absentees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Solomon) inspected the birds and said, \"How is it that I cannot see the hoopoe. Is he absent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he surveyed the birds – he therefore said, “What is to me that I do not see the Hudhud (hoopoe), or is he really absent?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He inspected the birds, and said: \"What is the matter that I see not the hoopoe Or is he among the absentees\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he reviewed the birds, then said: How is it I see not the hoopoe or is it that he is of the absentees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he reviewed the birds; then he said, 'How is it with me, that I do not see the hoopoe? Or is he among the absent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he sought among the birds and said: How is it that I see not the hoopoe, or is he among the absent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Solomon inspected the birds, and said, \"How is it that I do not see the hoopoe? Is he absent then?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he sought after the birds and said: what aileth me that I see not the hoopoe; is he among the absentees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[One day] he reviewed the birds, and said, ‘Why do I not see the hoopoe? Or is he absent?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he took a muster of the Birds; and he said: \"Why is it I see not the Hoopoe? Or is he among the absentees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He inspected the birds, and said: \"What is the matter that I see not the hoopoe? Or is he among the absentees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He reviewed the birds and said: 'Why is it that I do not see the hoopoe here? Or is he among the absent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he inspected the birds, and said, “Why do I not see the hoopoe? Or is he among the absentees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he took attendance of the birds and said, \"Why do I not see the hoopoe - or is he among the absent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:20] And he reviewed the birds, to see the hoopoe — which would locate water beneath the ground and indicate its location by pecking at it, whereupon the devils would extract it, for Solomon required it for when he prayed; but he could not see him — then he said, ‘Why is it that I do not see the hoopoe?, in other words, is there something preventing me from seeing him? Or is he among the absent?, and so I cannot see him   because he is absent?’ And when he became certain [of the hoopoe’s absence],\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَتَفَقَّدَ الطَّيْرَ فَقَالَ مَا لِيَ لَا أَرَى الْهُدْهُدَ أَمْ كَانَ مِنَ الْغَائِبِينَ (20) صيغة التفعُّل تدل على التكلف ، والتكلف : الطلب . واشتقاق { تفقّد } من الفَقْد يقتضي أن { تفقّد } بمعنى طلب الفَقد . ولكنهم توسعوا فيه فأطلقوه على طلب معرفة سبب الفقد ، أي معرفة ما أحدثه الفقد في شيء ، فالتفقد : البحث عن الفقد ليعرف بذلك أن الشيء لم ينقص وكان الطير من جملة الجند لأن كثيراً من الطير صالح للانتفاع به في أمور الجند فمنه الحمام الزاجل ، ومنه الهُدهد أيضاً لمعرفة الماء ، ومنه البزاة والصقور لصيد الملك وجنده ولجلب الطعام للجند من الصيد إذا حل الجند في القفار أو نفد الزاد . وللطير جنود يقومون بشؤونها . وتفقد الجند من شعار الملك والأمراء وهو من مقاصد حشر الجنود وتسييرها . والمعنى : تفقَّد الطيرَ في جملة ما تفقده ، فقال لمن يلون أمر الطير : { ما لي لا أرى الهدهد } .ومن واجبات ولاة الأمور تفقد أحوال الرعية وتفقد العمال ونحوهم بنفسه كما فعل عمر في خروجه إلى الشام سنة سبع عشرة هجرية ، أو بمن يكل إليه ذلك ، فقد جعل عمر محمد بن مسلمة الأنصاري يتفقد العمال .و { الهُدهد } : نوع من الطير وهو ما يقرقر ، وفي رائحته نتن وفوق رأسه قَزَعة سوداء ، وهو أسود البراثن ، أصفر الأجفان ، يقتات الحبوب والدود ، يرى الماء من بُعد ويحس به في باطن الأرض ، فإذا رَفرف على موضع عُلم أن به ماء ، وهذا سبب اتخاذه في جند سليمان . قال الجاحظ : يزعمون أنه هو الذي كان يدل سليمان على مواضع الماء في قعور الأرضين إذا أراد استنباط شيء منها .وقوله : { ما لي لا أرى الهدهد } استفهام عن شيء حصل له في حال عدم رؤيته الهدهد ، ف { ما } استفهام . واللام من قوله : { لي } للاختصاص . والمجرور باللام خبر عن { ما } الاستفهامية . والتقدير : ما الأمر الذي كان لي .وجملة : { لا أرى الهدهد } في موضع الحال من ياء المتكلم المجرورة باللام ، فالاستفهام عما حصل له في هذه الحال ، أي عن المانع لرؤية الهدهد . والكلام موجه إلى خفرائه ، يعني : أكان انتفاء رؤيتي الهدهد من عدم إحاطة نظري أم من اختفاء الهدهد؟ فالاستفهام حقيقي وهو كناية عن عدم ظهور الهدهد .و { أم } منقطعة لأنها لم تقع بعد همزة الاستفهام التي يطلب بها تعيين أحد الشيئين . و { أم } لا يفارقها تقدير معنى الاستفهام بعدها ، فأفادت هنا إضراب الانتقال من استفهام إلى استفهام آخر . والتقدير : بل أكان من الغائبين؟ وليست { أم } المنقطعة خاصة بالوقوع بعد الخبر بل كما تقع بعد الخبر تقع بعد الاستفهام .وصاحب «المفتاح» مثَّل بهذه الآية لاستعمال الاستفهام في التعجب والمثال يكفي فيه الفرض . ولما كان قول سليمان هذا صادراً بعد تقصّيه أحوال الطير ورجح ذلك عنده أنه غاب فقال : { لأعذبنه عذاباً شديداً أو لأذبحنه } لأن تغيبه من دون إذن عصيان يقتضي عقابه ، وذلك موكول لاجتهاد سليمان في المقدار الذي يراه استصلاحاً له إن كان يرجى صلاحه ، أو إعداماً له لئلا يلقِّن بالفساد غيرَه فيدخل الفساد في الجند وليكون عقابه نكالاً لغيره .فصمم سليمان على أنه يفعل به عقوبة جزاء على عدم حضوره في الجنود . ويؤخذ من هذا جواز عقاب الجندي إذا خالف ما عُيّن له من عمل أو تغيب عنه .وأما عقوبة الحيوان فإنما تكون عند تجاوزه المعتاد في أحواله . قال القرافي في «تنقيح الفصول» في آخر فصوله : سئل الشيخ عز الدين بن عبد السلام عن قتل الهرّ الموذي هل يجوز؟ فكتب وأنا حاضر : إذا خرجت أذيته عن عادة القطط وتكرر ذلك منه قتل اه . قال القرافي : فاحترز بالقيد الأول عما هو في طبع الهر من أكل اللحم إذا تُرك فإذا أكله لم يقتل لأنه طبعه ، واحترز بالقيد الثاني عن أن يكون ذلك منه على وجه القلة فإن ذلك لا يوجب قتله . قال القرافي : وقال أبو حنيفة : إذا آذت الهرة وقصد قتلها لا تعذب ولا تخنق بل تذبح بموسى حادة لقوله صلى الله عليه وسلم \" إن الله كتب الإحسان على كل شيء فإذا قتلتم فأحسنوا القِتْلة \" اه . وقال الشيخ ابن أبي زيد في «الرسالة» : ولا بأس إن شاء الله بقتل النمل إذا آذت ولم يُقدَر على تركها . فقول سليمان { لأعذبنه عذاباً شديداً } شريعة منسوخة .أما العقاب الخفيف للحيوان لتربيته وتأديبه كضرب الخيل لتعليم السير ونحو ذلك فهو مأذون فيه لمصلحة السير ، وكذلك السبق بين الخيل مع ما فيه من إتعابها لمصلحة السير عليها في الجيوش .و { أو } تفيد أحَدَ الأشياء فقوله : { أو ليأتيني بسلطان مبين } جعله ثالث الأمور التي جعلها جزاء لغيبته وهو أن يأتي بما يدفع به العقاب عن نفسه من عذر في التخلف مقبول .والسلطان : الحجة . والمبين : المظهر لحق المحتج بها . وهذه الزيادة من النبي سليمان استقصاء للهدهد في حقه لأن الغائب حجته معه .\n\n",
      "translations": [
        {
          "translation": "(And he sought among the birds) he inspected the birds (and said) when he could not see the hoopoe among them: (How is it that I see not the hoopoe) in his place, (or is he among the absent?)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وتفقد } حال طير القوى الروحانية ففقد هدهد القوة المفكرة لأن القوة المفكرة إذا كانت في طاعة الوهم كانت متخيلة والمفكرة غائبة بل معدومة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا سار سليمان - صلوات الرحمن عليه وسلام - ف يبعض أسفاره\n وكان الهدهد دائماً رائده\n وبريد عسكره ودليلهم على الماء عند الاحتياج\n إذ هو عالم به إلى حيث تعرفه تحت الأرض وتعين موضعه\n و كان يأمر سليمان عفاريت الجن ليحفروها ويخرجوا منها الماء لدى الحاجة\n\n\nفاحتاج سليمان عليه السلام يوماً من الأيام إلى الماء\n ولم يكن الهدهد حاضراً عنده فغضب عليه { وَتَفَقَّدَ ٱلطَّيْرَ } وتعرفه مفصلاً\n حتى يجده بينهم فلم يوجد مغاضباً عليه: { فَقَالَ } مغاضباً عليه: { مَالِيَ } أي: أي شيء عرض علي حتى صرت { لاَ أَرَى ٱلْهُدْهُدَ } بين الطيور\n أهو حاضر عندي\n مستور علي فلم أره { أَمْ كَانَ مِنَ ٱلْغَآئِبِينَ } [النمل: 20] المتخلفين عن خدمتي ورفاقتي؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وتفقَّدَ } سليمانُ { الطيرَ } أي: تعرف أحوال الطير تعرف َالمَلِك لمملكته\n حسبما تقتضيه عناية الملك بمملكته\n والاهتمام بكل جزء منها\n أو: تفقده لمعرفته بالماء\n أو لغير ذلك على ما يأتي\n فلما تفقده لم ير الهدهد فيما بينها\n والتفقد: طلب ما غاب عنك\n { فقال ماليَ لا أرى الهدهد } أساتر ستره؟ { أم كان من الغائبين } \n و \" أم \": بمعنى \" بل \"\n كأنه قال: ما لي لا أراه؟ ثم بدا له أنه غائب\n فأضرب عنه\n وقال: بل هو من الغائبين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:71",
      "similarity": 0.3745092778693877
    },
    {
      "verse": "12:72",
      "similarity": 0.20103901737259386
    },
    {
      "verse": "24:41",
      "similarity": 0.05883337507282748
    },
    {
      "verse": "7:131",
      "similarity": 0.05823636341452124
    },
    {
      "verse": "27:47",
      "similarity": 0.057685542263940785
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027020.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027020.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}