{
  "chapter": "النمل",
  "text": "انى وجدت امراة تملكهم واوتيت من كل شىء ولها عرش عظيم",
  "translations": [
    {
      "translation": "I found a woman ruling over them who has been given everything. She possesses a mighty throne.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found a woman reigning over them, and she has been favoured with everything; and she has a throne that is magnificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found there a woman ruling over them, one who has been endowed with all things and has a mighty throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found a woman ruling the people there and she possessed something of (almost) everything and a great throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I have seen a woman who rules over them, and she has been given from all things, and she has a mighty throne.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found a woman ruling over them, she has been given all things, and she has a great throne.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely I found a woman ruling over them, and she has been given abundance and she has a mighty throne:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found a woman ruling over them, and she has been given of everything, and she possesses a mighty throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! I found a woman ruling over them, and she hath been given (abundance) of all things, and hers is a mighty throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found a woman ruling over them, who has been given everything and she has a mighty throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily have found a woman ruling over them and she hath been vouchsafed somewhat of everything, and hers is a mighty throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found a woman ruling over them, and she has been given everything, and she has a great throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found (there) a woman ruling over them and provided with every requisite; and she has a magnificent throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found a woman ruling over them, and she has been given all things that could be possessed by any ruler of the earth, and she has a great throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There I found a woman ruling over them. She possess everything and has a great throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I found a woman ruling over them, and she was given of everything, and she has a magnificent throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, I found [there] a woman ruling them, and she has been given of all things, and she has a great throne.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:23] I found a woman ruling over them, in other words, she was their queen, her name Bilqīs; and she has been given [an abundance] of all things, that kings might require, in the way of machines and instruments, and she possesses a great throne — its length was 80 cubits, its width 40 cubits, its height 30 cubits, and was made of gold and silver, encrusted with pearls, rubies, chrysolite, and emeralds, with its legs made of rubies, chrysolite and emeralds, containing seven [inner] doors, the door of each chamber shut.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنِّي وَجَدْتُ امْرَأَةً تَمْلِكُهُمْ وَأُوتِيَتْ مِنْ كُلِّ شَيْءٍ وَلَهَا عَرْشٌ عَظِيمٌ (23) وتنكير { امرأة } وهو مفعول أول ل { وجدت } له حكم المبتدأ فهو كالابتداء بالنكرة إذا أريد بالنكرة التعجب من جنسها كقولهم : بقَرة تكلمتْ ، لأن المراد حكاية أمر عجيب عندهم أن تكون امرأة ملكة على قوم . ولذلك لم يقل : وجدتهم تملكهم امرأة .والإيتاء : الإعطاء ، وهو مشعر بأن المعطَى مرغوب فيه ، وهو مستعمل في لازمه وهو النول .ومعنى { أوتيت من كل شيء } نالت من كل شيء حسن من شؤون الملك . فعموم كل شيء عموم عرفي من جهتين يفسره المقام كما فسر قول سليمان { أوتينا من كل شيء } \\[ النمل : 16 \\] ، أي أوتيتْ من خصال الملوك ومن ذخائرهم وعددهم وجيوشهم وثراء مملكتهم وزخرفها ونحو ذلك من المحامد والمحاسن .وبناء فِعل { أوتيت } إلى المجهول إذ لا يتعلق الغرض بتعيين أسباب ما نالته بل المقصود ما نالته على أن الوسائل والأسباب شتى ، فمنه ما كان إرثاً من الملوك الذين سلفوها ، ومنه ما كان كسباً من كسبها واقتنائها ، ومنه ما وهبها الله من عقل وحكمة ، وما منَح بلادها من خصب ووفرة مياه . وقد كان اليونان يلقبون مملكة اليمن بالعربية السعيدة أخذاً من معنى اليُمْن في العربية ، وقال تعالى : { لقد كان لسبإٍ في مساكنهم آية جنتان عن يمين وشمال كلوا من رزق ربكم واشكُروا له بلدَةٌ طيبة وربٌ غفور } \\[ سبأ : 15 \\] . وأما رجاحة العقول ففي الحديث : «أتاكم أهل اليمن هُم أرق أفئدة ، الإيمان يَماننٍ ، والحكمةُ يمانية» فليس المراد خصوص ما آتاها الله في أصل خلقتها وخلقة أمتها وبلادها ، ولذا فلم يتعين الفاعل عرفاً . وكلّ من عند الله .وخص من نفائس الأشياء عرشها إذ كان عرشاً بديعاً ولم يكن لسليمان عرش مثله . وقد جاء في الإصحاح العاشر من سفر الملوك الأول ما يقتضي أن سليمان صنع كرسيَّهُ البديع بعد أن زارته ملكة سبأ . وسنشير إليه عند قوله تعالى : { أيُّكم يأتيني بعرشها } \\[ النمل : 38 \\] .والعظيم : مستعمل في عظمة القَدْر والنفاسة في ضخامة الهيكل والذات . وأعقب التنويه بشأنها بالحط من حال اعتقادهم إذ هم يسجدون ، أي يعبدون الشمس . ولأجل الاهتمام بهذا الخبر أعيد فعل وَجَدْتُها إنكاراً لكونهم يسجدون للشمس ، فذلك من انحطاط العقلية الاعتقادية فكان انحطاطهم في الجانب الغيبي من التفكير وهو ما يظهر فيه تفاوت عوض العقول على الحقائق لأنه جانب متمحّض لعمل الفكر لا يستعان فيه بالأدلة المحسوسة ، فلا جرم أن تضل فيه عقول كثير من أهل العقول الصحيحة في الشؤون الخاضعة للحواس . قال تعالى في المشركين { يعلمون ظاهراً من الحياة الدنيا وهم عن الآخرة هم غافلون أو لم يتفكروا في أنفسهم ما خلق الله السماوات والأرض وما بينهما إلا بالحق } \\[ الروم : 7 ، 8 \\] وكان عرب اليمن أيامئذ من عَبدة الشمس ثم دخلت فيهم الديانة اليهودية في زمن تُبّع أسْعَد من ملوك حِمير ، ولكونهم عبدة شمس كانوا يسمون عبد شمس كما تقدم في اسم سبأ .\n\n",
      "translations": [
        {
          "translation": "(Lo! I found a woman ruling over them) whose name is Balqis, (and she hath been given (abundance) of all things) she has been given the knowledge of all things in her country, (and hers is a mighty throne) adorned with gems, pearls, gold and silver.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لذلك ورثت منه الملك فملكت { وَ } من كمال عظمتها وشوكتها { أُوتِيَتْ مِن كُلِّ شَيْءٍ } نفائسه وعجائبه ما لا يُعد ولا يُحصى { وَلَهَا } من جملة البدائع { عَرْشٌ عَظِيمٌ } [النمل: 23] من جميع عروش أرباب الولاية والملك\n\n\nقيل: كان ثمانين ذراعاً في ثمانين\n وارتفاعه ثلاثين أو ثمانين أيضاً\n وهو متخذ من الذهب والفضة\n مكلل بالدر والزمرد\n والياقوت الأحمر والزبرجد الأخضر\n وكانت قوائمه من ياقوت أحمر وأخضر وزمرد\n وعليه سبعة بيوتات على كل بيت باب مغلق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولها عرشٌ عظيم }: كبير\n قيل: كان ثلاثين ذراعاً في ثلاثين عرضاً\n وقيل: كان ثمانين ذراعاً في ثمانين\n وطوله في الهواء: ثمانون\n وكان من ذهب وفضة\n مرصعاً بأنواع الجواهر\n وقوائمه من ياقوت أحمر وأخضر\n ودرّ\n وزبرجد\n وعليه سبعة أبيات\n في كل بيت باب مغلق\n واستصغر الهدهد حالها إلى حال سليمان\n فلذلك عظّم عرشها\n وقد أخفى الله تعالى ذلك على سليمان لحكمة\n كما أخفى مكان يوسف على يعقوب\n ليتحقق ضعف العبودية في جانب علم الربوبية\n وكانت بلقيس مجوسية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:26",
      "similarity": 0.5858465856690975
    },
    {
      "verse": "9:129",
      "similarity": 0.4760004099083537
    },
    {
      "verse": "20:5",
      "similarity": 0.4525289232804282
    },
    {
      "verse": "23:86",
      "similarity": 0.4504420174006842
    },
    {
      "verse": "23:116",
      "similarity": 0.42515017342473
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}