{
  "chapter": "النمل",
  "text": "اذهب بكتبى هذا فالقه اليهم ثم تول عنهم فانظر ماذا يرجعون",
  "translations": [
    {
      "translation": "Take this letter from me, and deliver it to them and withdraw, then see what reply they give in return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this letter of mine, deliver it to them, and then draw back from them, and observe what they do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this letter of mine and deliver it to them, then return and see what their reply will be.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Go with this letter of mine and drop it upon them – then move aside from them and see what they answer in return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go you with this letter of mine and deliver it to them, then draw back from them and see what they return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this my letter and hand it over to them, then turn away from them and see what (answer) they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this letter of mine, and cast it unto them, then turn back from them and see what they shall return '\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go with this my letter and throw it down unto them; then turn away and see what (answer) they return,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go with this letter of mine and lay it before them, then withdraw from them and see how they respond.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go thou with this epistle of mine, and cast it down unto them, and turn aside from them, and see how they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this letter of mine and deliver it to them. Then draw away from them and observe what [response] they return.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go thou, with this letter of mine, and deliver it to them: then draw back from them, and (wait to) see what answer they return\"...\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go you with this letter of mine, and deliver it to them, then draw back from them, and see what (answer) they return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take my letter, and drop it to them. Then turn aside and see what they shall return'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go with this letter of mine, and deliver it to them; then withdraw from them, and see how they respond.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take this letter of mine and deliver it to them. Then leave them and see what [answer] they will return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:28] Take this letter of mine and deliver it to them, that is, to Bilqīs and her people, then turn away, withdraw, from them, but remain close by them, and see what [response] they shall return’, [and see] what kind of response they shall give. Thus, he took it and approached her [Bilqīs]. But as her soldiers were all around her, he cast it into her private chamber. When she saw it, she shuddered and was consumed by fear. She read what it said.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Go with this my letter and throw it down unto them; then turn away) then move away such that they do not see you (and see what (answer) they return) when they read my letter,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱنْظُرْ مَاذَا يَرْجِعُونَ } معناه مَاذَا يَقُولونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أراد سليمان - صلوات الرحمن عليه وسلامه - أن يرسل رسولاً إلى بلفيس فكتب كتاباً هكذا: \" بسم الله الرحمن الرحيم، السلام على من اتبع الهدى، أما بعد، فلا تعلوا علي وأتوني مسلمين \" ثمَّ طبعه بالمسك وختمه بخاتمه، ثمَّ قال للهدهد: { ٱذْهَب بِّكِتَابِي هَـٰذَا فَأَلْقِهْ إِلَيْهِمْ } بحيث لم يتفطنوا بك وبأمرك { ثُمَّ تَوَلَّ } وانصرف { عَنْهُمْ } وكن متوارياً في قربهم { فَٱنْظُرْ } وتأمل { مَاذَا يَرْجِعُونَ } [النمل: 28] أي: ماذا يرجع ويرد بعضهم بعضاً من الكلام في المشاورة والمكالمة؟ فأخذ الهدهد الكتاب، وأتى بلقيس وهي نائمة في قصرها، فألقاه على نحرها، فلما استيقظت رأت الخاتم في نحرها، فرعدت وخضعت خوفاً، ثمَّ جلست مع أشراف قومها وتشاورت معهم في أمر الكتاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم تولّ عنهم } أي: تنح عنهم إلى مكان قريب، بحيث تراهم ولا يرونك، ليكون ما يقولون بمسمع منك، { فانظرْ ماذا يرجعون } أي: ما الذي يردُّون من الجواب، أو: ماذا يرجع بعضهم إلى بعض من القول\n فأخذ الهدهدُ الكتابَ بمنقاره، ودخل عليها من كوّة، فطرح الكتاب على نحرها، وهي راقدةٌ، وتوارى في الكوة",
      "translations": []
    }
  ]
}