{
  "chapter": "النمل",
  "text": "فمكث غير بعيد فقال احطت بما لم تحط به وجئتك من سباۭ بنبا يقين",
  "translations": [
    {
      "translation": "However, it was not long delayed, and then it said, 'I have comprehended something you have not and bring you accurate intelligence from Sheba.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he was not long in coming, and reported: \"I have been around where you have not been. I come from Saba with positive news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not before long the hoopoe came up and said: \"I have obtained a knowledge which you could not. I have brought for you sure news about Sheba.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not long after the hoopoe came forward and said, \"I have information which you do not have. I have come from the land of Sheba with a true report.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Hudhud did not stay absent for long, and presenting himself submitted, “I have witnessed a matter that your majesty has not seen, and I have brought definite information to you from the city of Saba.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (the hoopoe) stayed not long, he said: \"I have grasped which you have not grasped and I have come to you from Saba' with true news.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he tarried not long, then said: I comprehend that which you do not comprehend and I have brought to you a sure information from Sheba.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he tarried not long, and said, 'I have comprehended that which thou hast not comprehended, and I have come from Sheba to thee with a sure tiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he was not long in coming, and he said: I have found out (a thing) that thou apprehendest not, and I come unto thee from Sheba with sure tidings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he was not long in coming, and said, \"I have learnt something you did not know. I have come to you from Sheba with reliable news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Buthe tarried not far, and he said: I have encompassed that which thou hast- not encompassed, and I come unto thee from Saba with a tidings sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He did not stay for long [before he turned up] and said, ‘I have alighted on something which you have not alighted on, and I have brought you from Sheba a definite report.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Hoopoe tarried not far: he (came up and) said: \"I have compassed (territory) which thou hast not compassed, and I have come to thee from Saba with tidings true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the hoopoe stayed not long, he (came up and) said: \"I have grasped (the knowledge of a thing) which you have not grasped and I have come to you from Saba' (Sheba) with true news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He was not long in coming, and said: 'I know what you do not know. I come to you from Sheba with certain news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he did not stay for long. He said, “I have learnt something you did not know. I have come to you from Sheba, with reliable information.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the hoopoe stayed not long and said, \"I have encompassed [in knowledge] that which you have not encompassed, and I have come to you from Sheba with certain news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:22] But he did not remain (read fa-makutha or fa-makatha) long [in absence], in other words, [he was away only] for a short while, and came to Solomon humbly, with his head up and his wings and tail lowered. Solomon pardoned him and asked him about what he had encountered during his absence: and he said, ‘I have discovered something of which you have no knowledge, and I have brought you from Sheba (this may be read in declined form [min Saba’in] or left as indeclinable [min Saba’a]) — a tribe in Yemen, whose name is taken from the name of one of their ancestors (which is also the reason why it may be declined) — a verified report.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَمَكَثَ غَيْرَ بَعِيدٍ فَقَالَ أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِنْ سَبَإٍ بِنَبَإٍ يَقِينٍ (22) { مُّبِينٍ \\* فَمَكَثَ غَيْرَ بَعِيدٍ فَقَالَ أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِن سَبَإٍ بِنَبَإٍ يَقِينٍ \\* إِنِّى وَجَدتُّ امرأة تَمْلِكُهُمْ وَأُوتِيَتْ مِن كُلِّ شَىْءٍ وَلَهَا } { عَظِيمٌ \\* وَجَدتُّهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِن دُونِ الله وَزَيَّنَ لَهُمُ الشيطان أعمالهم } .الفاء لتفريع الحكاية عطفت جملة على جملة وضمير { مكث } للهدهد .والمكث : البقاء في المكان وملازمته زمناً ما ، وفعله من باب كرم ونصر . وقرأه الجمهور بالأول . وقرأ عاصم وروح عن يعقوب بالثاني .وأطلق المكث هنا على البُطْء لأنّ الهدهد لم يكن ماكثاً بمكان ولكنه كان يطير وينتقل ، فأطلق المكث على البُطء مجاز مرسل لأن المكث يستلزم زمناً .و { غير بعيد } صفة لاسم زمن أو اسم مكان محذوف منصوب على الظرفية ، أي مكث زمناً غير بعيد ، أو في مكان غير بعيد ، وكلا المعنيين يقتضي أنه رجع إلى سليمان بعد زمن قليل .و { غير بعيد } قريب قرباً يوصف بضد البعد ، أي يوشك أن يكون بعيداً . وهذا وجه إيثار التعبير ب { غيرَ بعيد } لأن { غير } تفيد دفع توهم أن يكون بعيداً ، وإنما يتوهم ذلك إذا كان القُرب يُشبه البُعد .والبُعد والقرب حقيقتهما من أوصاف المكان ويستعاران لقلة الحصة بتشبيه الزمن القصير بالمكان القريب وشاع ذلك حتى ساوى الحقيقة قال تعالى : { وما قوم لوط منكم ببعيد } \\[ هود : 89 \\] .والفاء في فقال } عاطفة على «مكُث» وجُعل القول عقيب المكث لأنه لما حضر صدر القول من جهته فالتعقيب حقيقي .والقولُ المسند إلى الهدهد إنْ حمل على حقيقة القول وهو الكلام الذي من شأنه أن ينطق به الناس ، فقول الهدهد هذا ليس من دلالة منطق الطير الذي عُلّمه سليمان لأن ذلك هو المنطق الدال على ما في نفوس الطير من المدركات وهي محدودة كما قدمنا بيانه عند قوله تعالى : { علّمنا منطق الطير } \\[ النمل : 16 \\] . وليس للهدهد قِبَل بإدراك ما اشتمل عليه القول المنسوب إليه ولا باستفادة الأحوال من مشاهدة الأقوام والبلدان حتى تَخطر في نفسه وحتى يعبر عنها بمنطقه الذي عُلّم سليمانُ دلالتَه كما قدمناه . فهذا وحي لسليمان أجراه الله على لسان الهدهد . وأما قول سليمان { سننظر أصدقتَ أم كنتَ من الكاذبين } \\[ النمل : 27 \\] فيجوز أن يكون سليمان خشي أن يكون ذلك الكلام الذي سمعه من تلقاء الهدهد كلاماً ألقاه الشيطان من جانب الهدهد ليضَلّل سليمان ويفتنه بالبحث عن مملكة موهومة ليسخر به كما يسخر بالمتثائِب ، فعزم سليمان على استثبات الخبر بالبحث الذي لا يترك ريبة في صحته خزياً للشيطان .ولنشتغل الآن بما اشتمل عليه هذا الكلام فابتداؤه ب { أحطتُ بما لم تُحِطْ به } تنبيه لسليمان بأن في مخلوقات الله ممالك وملوكاً تداني مُلكه أو تفوقه في بعض أحوال الملك جعله الله مثلاً له ، كما جعل عِلم الخضر مثلاً لموسى عليه السلام لئلا يغتر بانتهاء الأمر إلى ما بلغه هو .وفيه استدعاء لإقباله على ما سيُلقى إليه بشراشره لأهمية هذا المطلع في الكلام ، فإن معرفة أحوال الممالك والأمم من أهم ما يعنى به ملوك الصلاح ليكونوا على استعداد بما يُفاجئهم من تلقائها ، ولتكون من دواعي الازدياد من العمل النافع للمملكة بالاقتداء بالنافع من أحوال غيرها والانقباض عما في أحوال المملكة من الخلل بمشاهدة آثار مثله في غيرها .ومن فقرات الوزير ابن الخطيب الأندلسي : فأخبارُ الأقطار مما تُنِفق فيه الملوك أسمارها ، وترقم ببديع هالاته أقمارها ، وتستفيد منه حسن السِيَر ، والأمنَ من الغِيَر ، فتستعين على الدهر بالتجارب . . وتستدل بالشاهد على الغايب اه .والإحاطة : الاشتمال على الشيء وجعله في حَوزة المحيط . وهي هنا مستعارة لاستيعاب العلم بالمعلومات كقوله تعالى : { وكيف تصبر على ما لم تُحطْ به خُبراً } \\[ الكهف : 68 \\] فما صْدَقُ { ما لم تحط به } معلومات لم يحط بها علم سليمان .و { سبأ } : بهمزة في آخره وقد يخفف اسم رجل هو عَبَّشَمْس بن يشْجُب بن يَعرُب ابن قحطان . لُقب بسبأ . قالوا : لأنه أول من سبَى في غزوه . وكان الهمز فيه لتغييره العلمية عن المصدر . وهو جدّ جذم عظيم من أجذام العرب . وذريته كانوا باليمن ثم تفرقوا كما سيأتي في سورة سبأ . وأطلق هذا الاسم هنا على ديارهم لأن { من } ابتدائية وهي لابتداء الأمكنة غالباً .فاسم { سبأ } غلب على القبيلة المتناسلة من سبأ المذكور وهم من الجذم القحطاني المعروف بالعرب المستعربة ، أي الذين لم ينشأوا في بلاد العرب ولكنهم نزحوا من العراق إلى بلاد العرب ، وأول نازح منهم هو يَعرب ( بفتح التحتية وضم الراء ) بن قحطان ( وبالعبرانية يقطان ) بن عَابر بن شالخ بن أرفخشد ( وبالعبرانية أرفكشاد ) بن سَام بن نوح . وهذا النسب يتفق مع ما في سفر التكوين من سَام إلى عابر ، فمن عابر يفترق نسب القحطانيين من نسب العبرانيين؛ فأما أهل أنساب العرب فيجعلون لعابر ابنين أحدهما اسمه قحطان والآخر اسمه ( فالغ ) . وأما سفر التكوين فيجعل أنّ أحدهما اسمه ( يقطن ) ولا شك أنه المسمى عند العرب قحطان ، والآخر اسمه ( فالج ) بفاء في أوله وجيم في آخره ، فوقع تغيير في بعض حروف الاسمين لاختلاف اللغتين .ولما انتقل يعرب سكن جنوب البلاد العربية ( اليمن ) فاستقر بموضع بنى فيه مدينة ظَفارِ ( بفتح الظاء المشالة المعجمة وكسر الراء ) فهي أول مدينة في بلاد اليمن وانتشر أبناؤه في بلاد الجنوب الذي على البحر وهو بلاد ( حضرموت ) ثم بنى ابنه يَشجب ( بفتح التحتية وضم الجيم ) مدينة صنعاء وسمى البلاد باليمن ، ثم خلفه ابنه عَبَّشمس ( بتشديد الموحدة ومعناه ضوء الشمس ) وساد قومه ولقب سَبأ ( بفتحتين وهمزة في آخره ) واستقل بأهله فبنى مدينة مأرب حاضرة سبأ ، قال النابغة الجعدي :من سبأ الحاضرين مأرب إذ ... يبنون من دون سَيْله العَرِماوبين مأرب وصنعاء مسيرة ثلاث مراحل خفيفة .ثم جاء بعد سبأ ابنُه حِمْير ويلقب العَرنْجح ( أي العتيق ) ، ويظهر أنه جعل بلاده ظفار بعد أن انتقل أبناء يشجب منها إلى صنعاء . وفي المثَل : من ظَفَّر حَمَّر ، أي من دخل ظفار فليتكلم بالحميرية ، ولهذا المثل قصة .فكانت البلاد اليمنية أو القحطانية منقسمة إلى ثلاث قبائل : اليمنية ، والسبئية ، والحميرية . وكان على كل قبية مَلِك منها ، واستقلّت أفخاذهم بمواقع أطلقوا على الواحد منها اسم مخلاف ( بكسر الميم ) وكان لكل مخلاف رئيس يلقب بالقيل ويقال له : ذو كذا ، بالإضافة إلى اسم مخلافه ، مثل ذو رُعين . والملك الذي تتبعه الأقيال كلها ويحكم اليمن كلّها يلقب تُبَّع لأنه متبوع بأمراء كثيرين .وقد انفردت سبأ بالملك في حدود القرن السابع عشر قبل الهجرة وكان أشهر ملوكهم أو أولَهم الهَدهاد بن شرحبيل ويلقب اليَشَرَّح ( بفتح التحتية وفتح الشين المعجمة وفتح الراء مشددة وبحاء مهملة في آخره ) . ثم وليت بعده بلقيس ابنة شرحبيل أيضاً أو شراحيل ولم تكن ذات زوج فيما يظهر من سياق القرآن . وقيل كانت متزوجة شَدد بن زرعة ، فإن صح ذلك فلعله لم تطل مدته فمات . وكان أهل سَبأ صابئة يعبدون الشمس . وبقية ذكر حضارتهم تأتي في تفسير سورة سَبأ .و { أحطت } يقرأ بطاء مشددة لأنه التقاء طاء الكلمة وتاء المتكلم فقلبت هذه التاء طاء وأدغمتا .والباء في قوله : { بنبإ } للمصاحبة لأن النبأ كان مصاحباً للهدهد حين مجيئه ، والنبأ : الخبر المهم .وبين ب { سبأ } و { بنبإٍ } الجناس المزدوج . وفيه أيضاً جناس الخط وهو أن تكون صورة الكلمتين واحدة في الخَط وإنما تختلفان في النطق . ومنه قوله تعالى : { والذي هو يطعمني ويسقين وإذا مَرضت فهو يَشفين } \\[ الشعراء : 79 ، 80 \\] .ووصفه ب { يقين } تحقيق لكون ما سيلقى إليه شيء محقق لا شبهة فيه فوصف بالمصدر للمبالغة .وجملة : { إنى وجدت امرأة } بيان ل { نبأ } فلذلك لم تعطف . وإدخال ( إنّ ) في صدر هذه الجملة لأهمية الخبر إذ لم يكن معهوداً في بني إسرائيل أن تكون المرأة ملكاً .وفعل { تملكهم } هنا مشتق من المُلك بضم الميم وفعله كفعل مِلك الأشياء . وروي حديث هرقل «هل كان في آبائه مِن مَلَك» بفتح اللام ، أي كان مَلكاً ، ويفرق بين الفعلين بالمصدر فمصدر هذا مُلك بضم الميم ، والآخر بكسرها ، وضمير الجمع راجع إلى سبأ .وهذه المرأة أريد بها بلقيس ( بكسر الموحدة وسكون اللام وكسر القافِ ) ابنة شراحيل وفي ترتيبها مع ملوك سَبأ وتعيين اسمها واسم أبيها اضطراب للمؤرخين . والموثوق به أنها كانت معاصرة سليمان في أوائل القرن السابع عَشر قبل الهجرة وكانت امرأة عاقلة . ويقال : هي التي بَنت سُدّ مَأرب . وكانت حاضرةُ ملكها مأربَ مدينة عظيمة باليمن بينها وبين صنعاء مسيرة ثلاث مراحل وسيأتي ذكرها في سورة سبأ .\n\n",
      "translations": [
        {
          "translation": "(But he was not long in coming, and he said: I have found out (a thing) that thou apprehendest not) king! I reached a place that you have not reached and have come to know that which you do not, (and I come unto thee from Sheba) the city of Sheba (with sure tidings) with an amazing, true information.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِنَبَإٍ يَقِينٍ } معناه بِخيرٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"With a certain knowledge\" means with goodness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فمكث غير بعيد } أي: لم يطل زمان رياضتها لقدسيتها وما احتاجت إلى الإماتة لطهارتها حتى رجعت بسلطان مبين\n وتمرّنت في تركيب الحجج على أصح المناهج { فقال أحطت بما لم تحط به } من أحوال مدينة البدن وإدراك الجزئيات وتركيبها مع الكليات\n فإن القلب لا يدرك بذاته إلاّ بالكليات ولا يضمها إلى الجزئيات في تركيب القياس\n واستنتاج واستنباط الرأي إلا الفكر وبواسطته يحيط بأحوال العالمين ويجمع بين خيرات الدارين { وجئتك من سبأ } مدينة الجسد { بنبأ يقين } عيانيّ مشاهد بالحسّ\n { إني وجدت امرأة تملكهم } هي الروح الحيوانية\n المسمّاة باصطلاح القوم: النفس { وأوتيت من كل شيء } من الأسباب التي يدبرها البدن ويتم بها تملكه { ولها عرش عظيم } هو الطبيعة البدنية التي هي متكؤها بهيئة ارتفاعها من طبائع البسائط العنصرية التي هي المزاج المعتدل\n أو تؤوّل مدينة سبأ بالعالم الجسماني\n والعرش بالبدن",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَمَكَثَ } الهدهد بعد تفقد سليمان وتهديده زماناً { غَيْرَ بَعِيدٍ } مديد متطاول\n ثمَّ حضر عنده بلا تراخٍ طويل { فَقَالَ } معتذراً لغيبته ومكثه: إنما مكثت وغبت عن خدمتك\n لأني { أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ } أنت يا سيدي\n يعني: تعلق إدراكي بمعلوم لم يتعلق به قبل لا علمي ولا علمك\n ولا علم أحد من جنودك { وَ } بعد وقوفي واطلاعي به { جِئْتُكَ مِن } بلاد قبيلة { سَبَإٍ } من نواحي المغرب\n وبمن ملك عليها { بِنَبَإٍ } وخبر { يَقِينٍ } [النمل: 22] مطابق للواقع\n\n\nقال سليمان مبتهجاً\n مزيلاً لغيظه وغضبه\n مستكشفاً عنه: وما الخبر؟ قال الهدهد: { إِنِّي } بعدما وصلت إلى ديارهم بأقصر مدة { وَجَدتُّ } وصادفت { ٱمْرَأَةً تَمْلِكُهُمْ } اسمها بلقيس بنت شراحيل\n من نسل يعرب بن قحطان\n وأمها جنية\n لأنه ما كان يرى التزويج من الإنس\n ولم يكن له ولد غيرها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { فَمَكَثَ غيرَ بعيدٍ } أي: تفقد مكث سليمان حين تفقد الهدهد\n وأرسل من ورائه غير زمان بعيد\n وهو من الظهر إلى العصر - كما تقدم - أو: فمكث الهدهد في غيبته غير بعيد\n خوفاً من سليمان\n فالضمير إما لسليمان\n أو: للهدهد\n وهو الظاهر\n ويرجحه قراءة: فتمكث\n وفي \" مكث \" لغتان: الضم والفتح\n ولما قدِمَ من غيبته\n أحضر بين يديه\n على الهيئة المتقدمة\n ثم سأله عن غيبته\n { فقال أَحطتُ بما لم تُحِطْ به } أي: أدركت علماً لم تُحط به أنت\n أَلهم الله الهدهدَ فكافح سليمانَ بهذا الكلام\n مع ما أوتي من فضل النبوة والعلوم الجمة\n ابتلاء له عليه السلام في علمه\n وتنبيهاً على أن في أدنى خلقه اضعفهم من أحاطه الله علماً بما لم يُحط به لتتصاغر إليه نفسه\n ويصغر في عينه وعلمه\n في جانب علم الله\n رحمة به ولُطفاً في ترك الإعجاب\n الذي هو فتنة العلماء\n\nثم قال: { وجئتك من سبأ } - بالصرف - اسماً للحيّ\n أو: للأب الأكبر\n وبعدمه اسماً للقبيلة\n { بنبأٍ يقين } \n والنبأ: الخبر الذي له شأن\n وقوله: { من سبأ بنبإٍ } من محاسن الكلام ويسمى البديع\n وقد حسن وبرع لفظاً ومعنىً\n حيث فسر إبهامه بأبدع تفسير\n وأراه أنه كان بصدد إقامة خدمة مهمة\n وعبّر عما جاء به بالنبأ\n الذي هو الخبر الخطير والشأن الكبير\n ووصفه بما وصفه به\n { وإني وجدتُ امرأةَ تملكهم } هو استئناف لبيان ما جاء به من النبأ\n وتفسير له إثر الإجمال\n وهي بلقيس بنت شراحيل بن مالك بن ريان\n وكان أبوها ملك أرض اليمن كلها\n ورث الملك من أربعين أباً\n وقيل: كان أبوها - اسمه الهدهاد - ملكاً عظيم الشأن\n ملك أرض اليمن كلها\n وأبى أن يتزوج منهم\n فزوجوه امرأة من الجن\n يقال لها \" ريحانة \" فولدت له بلقيس\n ولم يكن له ولد غيرها\n قال أبو هريرة: قال النبي صلى الله عليه وسلم:\n \" كان أحد أبوي بلقيس جنياً \" \nفمات أبوها\n فاختلف قومه فرقتين\n وملّكوا أمرهم رجلاً قائماً بسيرته\n حتى فجَر بحرم رعيته\n فأدركت بلقيس الغيرة\n فعرضت عليه نفسها\n فتزوجته\n فسقته الخمر\n فسكر\n فجزت رأسه\n ونصبته على باب دارها فملكوها\n { وأُوتِيَتْ من كل شيءٍ } تحتاج إليه الملوك\n من العدة والآلة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:15",
      "similarity": 0.6703209024917102
    },
    {
      "verse": "17:106",
      "similarity": 0.3101361624960035
    },
    {
      "verse": "18:3",
      "similarity": 0.30968254847575355
    },
    {
      "verse": "43:77",
      "similarity": 0.30761435477778337
    },
    {
      "verse": "20:10",
      "similarity": 0.22718668424003752
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}