{
  "chapter": "النمل",
  "text": "الا يسجدوا۟ لله الذى يخرج الخبء فى السموت والارض ويعلم ما تخفون وما تعلنون",
  "translations": [
    {
      "translation": "and do not prostrate to Allah, Who brings out what is hidden in the heavens and the earth, and knows what you conceal and what you divulge.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To worship God who brings to light what is hidden in the heavens and the earth, and is cognisant of what you hide and what you disclose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that they would prostrate themselves before Allah Who brings to light all that is hidden in the heavens and the earth and knows all that you conceal and all that you reveal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Satan has done this) so that they will not worship God who brings forth whatever is hidden in the heavens and the earth and knows whatever you conceal or reveal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Why do they not prostrate to Allah, Who brings forth the things hidden in the heavens and the earth, and knows all what you hide and all what you disclose?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they do not prostrate themselves before Allah, Who brings to light what is hidden in the heavens and the earth, and knows what you conceal and what you reveal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they do not make obeisance to Allah, Who brings forth what is hidden in the heavens and the earth and knows what you hide and what you make manifest:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that they prostrate not themselves to God, who brings forth what is hidden in the heavens and earth; and He knows what you conceal and what you publish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they worship not Allah, Who bringeth forth the hidden in the heavens and the earth, and knoweth what ye hide and what ye proclaim,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they not worship God who brings forth what is hidden in the heavens and earth and knows both what you conceal and what you make known?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that they adore not Allah who bringeth forth the hidden in the heavens and the earth, and knoweth that which conceal and that which ye make known.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that they do not prostrate themselves to Allah, who brings forth the hidden in the heavens and the earth, and He knows whatever you hide and whatever you disclose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Kept them away from the Path), that they should not worship Allah, Who brings to light what is hidden in the heavens and the earth, and knows what ye hide and what ye reveal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Al-La (this word has two interpretations) (A) [As Shaitan (Satan) has barred them from Allah's Way] so that they do not worship (prostrate before) Allah, or (B) So that they may worship (prostrate before) Allah, Who brings to light what is hidden in the heavens and the earth, and knows what you conceal and what you reveal. [Tafsir At-Tabari, Vol. 19, Page 149]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not prostrate themselves to Allah who brings forth all that is concealed in the heavens and earth and He knows what they hide and what they reveal?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only they would worship God, who brings to light the mysteries of the heavens and the earth, and knows what you conceal and what you reveal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And] so they do not prostrate to Allah, who brings forth what is hidden within the heavens and the earth and knows what you conceal and what you declare -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:25] to prostrate themselves to God (allā yasjudū should be read as an yasjudū: the lā is extra and with it has been assimilated the nūn of an, similar to [the construction] where God says, li-allā ya‘lama ahlu’l-kitābi, so that the People of the Scripture may know [Q. 57:29]; the sentence functions as the direct object of yahtadūna, ‘guided’, whose ilā, ‘to’, has been omitted); [He] Who brings forth the hidden (al-khab’ is a verbal noun, with the same meaning as al-makhbū’, ‘that which is hidden’) of rain and plants, in the heavens and the earth, and He knows what they conceal, within their hearts, and what they proclaim, with their tongues.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So that they worship not Allah) and I said to them: \"0 you, prostrate to Allah\" it is also said that it is Solomon who said: \"why do they not prostrate to Allah?\" (Who bringeth forth the hidden in the heavens) the rain (and the earth) vegetation, (and knoweth what ye hide) of good and evil (and what ye proclaim) of good and evil,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُخْرِجُ ٱلْخَبْءَ } معناه المطرُ\n وقال: الخَفَايا\n\n",
      "translations": [
        {
          "translation": " The meaning of the { } is \"the rain falls.\"\n\n\nAnd he said, \"The secrets.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبأن قال لهم منادياً إياهم: { أَلاَّ يَسْجُدُواْ } يعني: تنبهوا أيها الفاقدون قبلة سجودكم وجهة معبودكم، أيها القوم الضالون المنصرفون عن المسجود الحقيقي والمعبود المعنوي، بل اسجدوا وتذللوا { للَّهِ } المتجلي في الأكوان، المنزه عن الحلول في الجهات والمكان، المقدس عن تتابع الساعات وتعاقب الأزمان، بل له شأن لا يشغله شأن ولا يجري عليه زمان ومكان { ٱلَّذِي يُخْرِجُ } يمقتضى علمه المحيط، وقدرته الكاملة الشاملة { ٱلْخَبْءَ } أي: الخفي المطوي المكنون { فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: سماوات الأسماء الإلهية، وأوصافه الذاتية الفاعلة، وأرض الطبيعة القابلة لقبول الانعكاس من الأسماء والأوصاف { وَيَعْلَمُ } سبحانه بعلمه الحضوري { مَا تُخْفُونَ } في سرائركم وضمائركم، بل بخفياتكم التي لا اطلاع عليها أصلاً بمقتضى قابلياتهم واستعداداتهم { وَمَا تُعْلِنُونَ } [النمل: 25] من أفعالهم وأحوالهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ألاَّ يسجدوا } بالتشديد، أي: فصدّهم عن السبيل لئلا، فحذف الجار، أي: لأجل ألا يسجدوا لله\n ويجوز أن تكون \" لا \" مزيدة، أي: فهم لا يهتدون إلى أن يسجدوا\n وقرئ: هلا يسجدون\n ومن قرأ بالتخفيف\n فالتقدير عنده: ألا يا هؤلاء اسجدوا، فألاَ للتنبيه، والمنادي محذوف، فمن شدّد لم يقف على { يهتدون } ، ومن خفف وقف ثم استأنف: ألا يا هؤلاء اسجدوا { لله الذي يُخرجُ الخَبْءَ } الشيء المخبوء المستور { في السماوات والأرض } ، قال قتادة: خبء السموات: المطر، وخبء الأرض: النبات\n واللفظ أعم من ذلك، { ويعلم ما يُخفون وما يُعلنون } عطف على \" يخرج \" ، إشارة إلى أنه تعالى يُخرج ما في العالم الإنساني من الخفايا، كما يُخرج ما في العالم الكبير من الخبايا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:38",
      "similarity": 0.1689274010140893
    },
    {
      "verse": "60:1",
      "similarity": 0.14539525058907393
    },
    {
      "verse": "11:5",
      "similarity": 0.1334696230589455
    },
    {
      "verse": "64:4",
      "similarity": 0.11397395393783773
    },
    {
      "verse": "2:77",
      "similarity": 0.11030241646839725
    }
  ]
}