{
  "chapter": "النمل",
  "text": "لاعذبنه عذابا شديدا او لاا۟ذبحنه او لياتينى بسلطن مبين",
  "translations": [
    {
      "translation": "I will certainly punish it most severely or slaughter it if it does not bring me clear authority.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will punish him severely, or cut his throat, unless he bring a valid excuse.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will inflict a severe punishment on him or maybe even slaughter him unless he comes forth with a convincing reason (for his absence).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall certainly punish him severely or slaughter him unless he has a good reason for his absence.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I will indeed punish him severely or slay him, or he must bring to me some clear evidence.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will surely punish him with a severe torment or slaughter him, unless he brings me a clear reason.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will most certainly punish him with a severe punishment, or kill him, or he shall bring to me a clear plea.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly I will chastise him with a terrible chastisement, or I will slaughter him, or he bring me a clear authority.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I verily will punish him with hard punishment or I verily will slay him, or he verily shall bring me a plain excuse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall surely punish him severely or order him to be executed, unless he gives me a good reason for his absence.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely I shall torment him with a severe torment, or I shall slaughter him, unless he bringeth unto me a warranty manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘I will punish him with a severe punishment, or I will behead him, unless he brings me a credible excuse.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will certainly punish him with a severe penalty, or execute him, unless he bring me a clear reason (for absence).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will surely punish him with a severe torment, or slaughter him, unless he brings me a clear reason.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, I will punish him with a terrible punishment, or I will slaughter him or he gives me a good reason'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will punish him most severely, or slay him, unless he gives me a valid excuse.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will surely punish him with a severe punishment or slaughter him unless he brings me clear authorization.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:21] He said, ‘Assuredly I will chastise him with a severe chastisement, by having [all] his feathers as well as his tail plucked and leaving him out in the sun, where he would not be able to escape from reptiles, or I will slaughter him, by slitting his throat, unless he brings me (read la-ya’tiyannī or la-ya’tinannī) a clear warrant’, plain manifest proof for his [having a valid] excuse.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "He said: if he is among the absent, then (I verily will punish him with hard punishment) I will pluck out his feathers; such was the punishment of the birds, (or I verily will slay him, or he verily shall bring me a plain excuse) an acceptable excuse.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لأُعَذِّبَنَّهُ عَذَاباً شَدِيداً } معناه أَنتِفُ رِيشَهُ وأُلقِيهِ في الشَّمسِ للنَملِ\n\n\n\n\nوقوله تعالى: { أَوْ لَيَأْتِيَنِّي بِسُلْطَانٍ مُّبِينٍ } معناه بحُجةٍ وبعُذرٍ بَيّنٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {I will punish him with a severe punishment} means that you pluck his mustache and throw him into the sun for the ants.\n\nAnd His saying, {Exalted is He}, \"Bring me a clear sign.\" Its meaning is with evidence and a clear excuse.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفوالله لو وجدته { لأُعَذِّبَنَّهُ عَذَاباً شَدِيداً } إلى حيث آمر بنتف ريشه وحبسه في حر الشمس مع ضده في محبس ضيق { أَوْ لأَاْذبَحَنَّهُ } حداً\n ليعتبر منه سائر الخَدَمَة { أَوْ لَيَأْتِيَنِّي } وليقيمنَّ على الإثبات عذره { بِسُلْطَانٍ مُّبِينٍ } [النمل: 21] حجة واضحة ظاهرة الدلالة\n مقبولة من ذوي الأعذار عند أولي الأبصار والاعتبار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لأُعذِّبَنَّه عذاباً شديداً } ، قيل: كان عذابه للطير: نتفه ريشه وتشميسه، أو: يجعله مع أضداده في قفص، أو: بالتفريق بينه وبين إلفه\n وعن بعضهم: أضيق السجون معاشرة الأضداد، ومفارقة الأحباب\n أو: نتفه، وطرحه بين يدي النحل تلدغه، أو: النمل تأكله\n وحلّ له تعذيب الهدهد لينزجر غيره، ولِما سخرت له الحيوانات - ولا يتم التسخير إلا بالتأديب - حلّ له التأديب\n { أو لأذْبحنَّه } ليعتبر به أبناء جنسه، { أو لَيَأْتِيَنِّي بسلطانٍ مبين } بحُجة تُبين عذره، والحلف في الحقيقة على أحد الأمرين، على تقدير عدم الثالث\n قال بعضهم: وسبب طلبته للهدهد، لإخلاله بالنوبة التي كان ينوبها\n وقيل: كانت الطير تظله، فأصابته لمعة من الشمس، فنظر، فرأى موضع الهدهد خالياً، فتفقده، وقيل: احتاج إلى الماء، وكان عِلْمُ ذلك إلى الهدهد، فتفقده، فلم يجده، فتوعده\n والسبب فيه: أن سليمان عليه السلام لَمَّا فرغ من بناء بيت المقدس، عزم على الخروج إلى أرض الحرم، للحج، فتجهز للمسير، وخرج بجنوده - كما تقدم - فبلغ الحرم، وأقام به، وكان ينحر كل يوم بمكة خمسة آلاف ناقة، ويذبح خمسة آلاف ثور، وعشرين ألف شاة، قرباناً\n وقال: إن هذا مكان يخرج منه نبي عزيزُ، صفته كذا وكذا، يُعطَى النصر على جميع من ناوأه، وتبلغ هيبته مسيرة شهر، القريب والبعيد في الحق عنده سواء، لا تأخذه في الله لومة لائم، دينه دين الحنيفية، فطوبى لمن أدركه وآمن به، وبيننا وبين خروجه زهاء ألف عام\n ثم قضى نسكه، وخرج نحو اليمن صباحاً، يؤم سهيلاً، فوافى صنعاء وقت الزوال، وذلك مسيرة شهر، فرأى أرضاً حسناء، تزهو خضرتها، فأحب النزول بها ليصلي ويتغذى، فطلبوا الماء فلم يجدوه، وكان الهدهد دليله على الماء، كان يرى الماء من تحت الأرض، كما نرى الماء في الزجاجة، فينقر الأرض فتجيء الشياطين يستخرجونه\n وبحث فيه القشيري بأن الهدهد متعدد في عسكره، إذا فقدوا واحداً بقي آخر، قال: اللهم إلا أن يكون ذلك الواحد مخصوصاً بمعرفة ذلك، والله أعلم\n هـ\n قال سعيد بن جبير: لما ذكر ابن عباس هذا الحديث: قال له نافع بن الأزرق: كيف ينظر الماء تحت الأرض، ولا يبصر الفخ حتى يقع فيه؟ قال ابن عباس: ويحك إذا جاء القدر حال دون البصر\n\n\nهـ\n قلت: ونافع هذا هو رأس الخوارج والمعتزلة\n فلما نزل سليمانُ، قال الهدهد: إن سليمان قد اشتغل بالنزول، فارتفع نحو السماء، ونظر طول الدنيا وعرضها، ونظر يميناً وشمالاً، فرأى بستاناً لبلقيس فيه هدهد\n وكان اسم هدهد سليمان \" يعفور \" واسم هدهد اليمن \" عنفير \"\n فقال هدهد اليمن لهدهد سليمان: من أين أقبلتَ وأين تريد؟ قال: أقبلتُ من الشام، مع صاحبي سليمان بن داود، قال: ومَن سليمان؟ قال: ملك الجن والإنس والشياطين والطير والوحوش والرياح، فمِن أين أنت؟ قال من هذه البلد، ملكها امرأة، يقال لها \" بلقيس \" تحت يديها اثنا عشر ألف قائد، تحت يد كل قائد مائة ألف مقاتل\n فانطلق معه، ونظر إلى بلقيس ومُلكها، ورجع إلى سليمان وقت العصر\n وكان سليمان قد فقده وقت الصلاة، فلم يجده، وكان على غير ماء\n قال ابن عباس: فدعا عريف الطير - وهو النسر - فسأله؟، فقال: ما أدري أين هو، فغضب سليمان وقال: لأُعذبنه\n\n\n إلخ، ثم دعا بالعقاب، سيد الطير، فقال: عليّ بالهدهد الساعة، فرفع العقاب نفسه نحو السماء، حتى التزق بالهواء، فنظر إلى الدنيا كالقصعة بين يدي أحدكم، فإذا هو بالهدهد مُقبلاً من نحو اليمن، فانقضّ نحوه، فقال له الهدهد: بحق الحق الذي قوّاك إلا ما رحمتني، فقال: ويلك، إن نبي الله حلف أن يعذبك ويذبحك\n ثم تلقته النسور والطير في العسكر، وقالوا له: لقد توعدك نبيُّ الله\n قال: أوَ ما استثنى؟ قالت: بلى، قال: { أوْ لَيأتيني بسلطان مبين }\n ثم دخل على سليمان، فرفع رأسه، وأرخَى ذنبه وجناحيه يجرهما على الأرض، تواضعاً لله ولسليمان، فقال سليمان: أين كنت؟ لأعذبنَّك\n\n\n فلما دنا منه أخذ سليمان برأسه، فمده إليه، فقال له الهدهد: يا نبي الله اذكر وقوفك بين يدي الله تعالى، بمنزلة وقوفي بين يديك، فارتعد سليمان وعفا عنه\n وقال عكرمة: إنما صُرف سليمان عن ذبح الهدهد لبره بوالديه، كان يلتقط الطعام ثم يزقه لهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:107",
      "similarity": 0.61758279105594
    },
    {
      "verse": "2:49",
      "similarity": 0.49274653670368956
    },
    {
      "verse": "14:6",
      "similarity": 0.4697142406622462
    },
    {
      "verse": "28:4",
      "similarity": 0.4298852046037093
    },
    {
      "verse": "2:67",
      "similarity": 0.4088823440404651
    }
  ]
}