{
  "chapter": "النمل",
  "text": "قال عفريت من الجن انا۠ ءاتيك به قبل ان تقوم من مقامك وانى عليه لقوى امين",
  "translations": [
    {
      "translation": "An ifreet of the jinn said, 'I will bring it to you before you get up from your seat. I am strong and trustworthy enough to do it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A crafty jinn said: \"I will bring it before you rise from your seat, for I am strong and trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A stalwart of the jinn said: \"I will bring it to you before you rise from your council. Surely I have the power to do so and I am trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A monstrous jinn said, \"I can bring it before you even stand up. I am powerful and trustworthy\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An extremely evil jinn said, “I will bring it in your presence before you disperse the assembly; and I am indeed strong and trustworthy upon it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An `Ifrit from the Jinn said: \"I will bring it to you before you rise from your place. And verily, I am indeed strong and trustworthy for such work.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One audacious among the jinn said: I will bring it to you before you rise up from your place; and most surely I am strong (and) trusty for it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An efreet of the jinns said, 'I will bring it to thee, before thou risest from thy place; I have strength for it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A stalwart of the jinn said: I will bring it thee before thou canst rise from thy place. Lo! I verily am strong and trusty for such work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A demon from among the jinn said, \"I will bring it to you before you get up from your seat. I am strong and trustworthy enough to do it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A giant from the jinns said: I shall bring it unto thee ere thou arisest from thy place; verily I am strong for it and trusty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An afreet from among the jinn said, ‘I will bring it to you before you rise from your place. I have the power to do it and am trustworthy.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said an 'Ifrit, of the Jinns: \"I will bring it to thee before thou rise from thy council: indeed I have full strength for the purpose, and may be trusted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An Ifrit (strong) from the jinns said: \"I will bring it to you before you rise from your place (council). And verily, I am indeed strong, and trustworthy for such work.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An efreet (an extremely strong jinn) among the jinn replied: 'I will bring it to you before you rise from your place; I have the strength and am trustworthy'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An imp of the sprites said, “I will bring it to you before you rise from your seat. I am strong and reliable enough to do it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A powerful one from among the jinn said, \"I will bring it to you before you rise from your place, and indeed, I am for this [task] strong and trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:39] An afreet from among the jinn — a [jinn who is] powerful and stalwart — said, ‘I will bring it to you before you rise from your place, the one in which you sit when adjudicating — the period from morning to midday. Indeed I have the strength for it, that is, for carrying it, and I am trustworthy’, over what it may contain of jewels and other [precious] things. Solomon said, ‘I want something faster than that!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A) mighty (stalwart of the jinn) called 'Amr (said: I will bring it thee before thou canst rise from your place) 429 before you leave your seat of judgement, for he used to sit for judgements until noon. (Lo! I verily am strong and trusty for such work) even though it is adorned with gems, pearls, gold and silver.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَالَ عِفْرِيتٌ مِّن ٱلْجِنِّ } وهو المُبالغُ فِي الشَّيءِ\n وقال: هو آصف بن الشيطان بن إبليس، والذي عِندهُ عِلمٌ من الكِتابِ: هو آصف بن بريخا الخَير\n\n\n\n\nوقوله تعالى: { قَبْلَ أَن تَقُومَ مِن مَّقَامِكَ } معناه مِن حِين أنْ تَجلِسَ للنَّاسِ إِلى أَنْ تَقومَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of the Most High: {Qala 'Ifritun min al-Jinni} and it is the one who is excessive in something.\n\n\nAnd he said: \"As-Sufi ibn Shaytan ibn Iblis is the one who has knowledge of the Book. He is As-Sufi ibn Barikh al-Khayr.\"\n\n\nAnd His saying, {before you stand up from your place}, means from the time you sit to the time you stand up.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قبل أن تقوم من مقامك } أي: ما دمت في مقام الصدر قبل الترقي إلى مقام السرّ\n فإنّ الوهم حينئذ ينعزل عن فعله بالهداية والمشايعة: { والذي عنده علم من الكتاب } هو العقل العملي الذي عنده بعض العلم وهو الحكمة العملية والشريعة من كتاب اللوح المحفوظ يسخرها ويقرّبها ويبعثها على الطاعات بتحبيب الكمال وحصول الشرف والذكر الجميل والكرامة إليها { قبل أن يرتدّ إليك طرفك } أي: نظرك إلى ذاتك وما ينبغي لها من الترقي إلى عالمك في عالم القدس لإدراك الحقائق والمعارف الكلية\n والمشاهدات الحقّة العينية\n فإنّ الكمال العمليّ مقدّم على الكمال الذوقيّ والكشفيّ { فلما رآه مستقرّاً عنده } ثابتاً على حالة اتصاله به\n متمرّناً في الطاعة غير متغير بالدواعي الشهوانية والنوازع الشيطانية { قال هذا من فضل ربي ليبلوني أأشكر } بالطاعة والعمل بالشريعة { أم أكفر } بالمعصية ومخالفة الشريعة\n أو أشكر عند التوفيق للطاعة بالسلوك في الطريقة والإقبال على الحضرة\n وتبديل الصفات\n ومراقبة التجليات\n أم أكفر بالاحتجاب برؤية الأعمال\n والإدبار عن الحق بالغرور والعجب\n والوقوف مع المعقول والعقل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:78",
      "similarity": 0.058097136865608634
    },
    {
      "verse": "18:39",
      "similarity": 0.05754342405625465
    },
    {
      "verse": "40:22",
      "similarity": 0.05495443084305457
    },
    {
      "verse": "28:26",
      "similarity": 0.051897973745457585
    },
    {
      "verse": "35:44",
      "similarity": 0.05041124826791005
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027039.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027039.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}