{
  "chapter": "النمل",
  "text": "قالت ان الملوك اذا دخلوا۟ قرية افسدوها وجعلوا۟ اعزة اهلها اذلة وكذلك يفعلون",
  "translations": [
    {
      "translation": "She said, 'When kings enter a city, they lay waste to it and make its mightiest inhabitants the most abased. That is what they too will do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"Surely when kings enter a city they destroy it and despoil the honour of its nobility. So will they do (to us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Queen said: \"When the kings enter a country they cause corruption in it and abase those of its people who are held in honour. This is what they are wont to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"When Kings enter a town they destroy it and disrespect its honorable people. That is what they will do, too.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “Indeed the kings, when they enter a township, destroy it and disgrace its honourable people; and this is what they do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"Verily, kings, when they enter a town, they destroy it and make the most honorable among its people the lowest. And thus they do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: Surely the kings, when they enter a town, ruin it and make the noblest of its people to be low, and thus they (always) do;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, 'Kings, when they enter a city, disorder it and make the mighty ones of its inhabitants abased. Even so they too will do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: Lo! kings, when they enter a township, ruin it and make the honour of its people shame. Thus will they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"Surely, when mighty kings invade a country, they despoil it and humiliate its noblest inhabitants, these men will do the same,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: verily the kings, when they enter a City, despoil it, and make the most powerful inhabitants thereof the most abased; so will they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, ‘Indeed when kings enter a town, they devastate it, and make the mightiest of its people the weakest. That is how they act.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"Kings, when they enter a country, despoil it, and make the noblest of its people its meanest thus do they behave.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: \"Verily! Kings, when they enter a town (country), they despoil it, and make the most honourable amongst its people low. And thus they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said: 'When kings enter a village, they ruin it and humiliate its nobles. And this they will do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, “When kings enter a city, they devastate it, and subjugate its dignified people. Thus they always do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She said, \"Indeed kings - when they enter a city, they ruin it and render the honored of its people humbled. And thus do they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:34] She said, ‘Indeed kings, when they enter a town, ruin it, with destruction, and reduce the mightiest of its inhabitants to the most abased. That is what they too will do, namely, the senders of this letter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then she pronounced words of wisdom. (She said: Lo! Kings) worldly kings, (when they enter a township) by force in instances of war and fighting, (ruin it) destroy it (and make the honour of its people shame) by beating, killing and exposing them to other things. (Thus will they do) Allah said: this is how worldly kings behave because of arrogance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَتْ } في جوابهم بعدما تأملت، وتعمقت في أمرها ورأيها: نعم، إن لنا كثرة وشجاعة منتشرة في أقطار الأرض بأسها وهيبتها، إلاَّ أن الحرب خداع، والقتال سجال لا تدرى عاقبتهما، ولا اعتماد على الكثرة والجراءة بعدما نفذ القضاء على الهزيمة، ومن المقدمات المسلمة { إِنَّ ٱلْمُلُوكَ } وأرباب القدرة الاستيلاء { إِذَا دَخَلُواْ قَرْيَةً } عنوةً وقهراً { أَفْسَدُوهَا } بأن غيروا لها أوضاعها { وَجَعَلُوۤاْ أَعِزَّةَ أَهْلِهَآ أَذِلَّةً } بالغلبة والاستيلاء { وَكَذٰلِكَ يَفْعَلُونَ } [النمل: 34] هؤلاء لو دخلوا على بلادنا هذه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فلما أحسنت منهم الميلَ إلى المحاربة مالتْ إلى المصالحة، فزيفت رأيهم، حيث { قالت إنَّ الملوك إِذا دخلوا قريةً } على منهاج المقاتلة والحرب، أو عنوة وقهراً { أفسدوها } بتخريب عمارتها، وإتلاف ما فيها من الأموال، { وجعلوا أَعِزَّةَ أهلها أذلةً } بالقتل والاسر والإجلاء، وغير ذلك من فنون الإهانة ليستقيم لهم مُلْكُهم وحدهم\n ثم قالت: { وكذلك يفعلون } أي: وهذه عادتهم المستمرة التي لاتتغير، لأنها كانت في بيت المملكة قديماً، أباً عن أب، فجربت الأمور، أو: يكون من قول الله تعالى، تصديقاً لقولها، أي: قال الله تعالى: وكذلك شأن الملوك إذا غلبوا وقهروا أفسدوا\n وأنشدوا في هذا المعنى:\n\nففي صحبة الملوك خطير كبير، وتعب عظيم، فمن قوي نوره، حتى يغلب على ظلمتهم، بحيث يتصرف فيهم، ولا يتصرفون فيه، فلا بأس بمعرفتهم، إن كان فيه نفع للناس بالشفاعة والنصيحة، وقد أقيم في هذا المقام الشيخ أبو حسن الشاذلي، وشيخ شيخنا مولاي العربي الدرقاوي - رضي الله عنهما - وكان تلميذاهما الشيخ أبو العباس المرسي، وشيخنا سيدي محمد البوزيدي الحسني - رضي الله عنهما - يفران من صحبتهم، أشد الفرار وهو أسلم\n والله تعالى أعلم\n الإشارة: قال صاحب الخصوصية لنفسه: سننظر أَصدقتِ في الخصوصية أم أنتِ من الكاذبين، اذهب بما معك من العلم، وذكّر به عباد الله، وألقه إليهم، ثم تولّ عنهم، وانظر ماذا يرجعون، فإن تأثروا بوعظك، وانتقش فيهم قولك، فأنتِ صادقة في ثبوت الخصوصية لديك لأن أهل العلم بالله إذا تكلموا وقع كلامهم في قلوب العباد، فحييت به قلوبهم وأرواحهم\n ومن لا خصوصية له صدت كلامه الآذان\n قالت حين أرادت التذكير: يا أيها الملاُ إني أُلقي إليّ في قلبي كتابٌ كريمٌ، وعلمٌ عظيم، فلا تعل عليّ وأتوني مسلمين، منقادين لما آمركم به، وقالت - لَمَّا تطهرت من الأكدار، وتحررت من الأغيار، وأحدقت بها جنود الأنوار: يا أيها الملأ - تعني جنود الأنوار - أفتوني في أمري الذي أريد ان أفعله، ما كنت قاطعة أمراً من الأمور، التي تتجلى في القلب، حتى تشهدون، وتشهدوا أنه رشد وحق، قالو: نحن أولو قوة وأولو بأس شديد، والأمر إليك، حيث تطهرت، فانظري ماذا تأمرين لأن النفس إذا تزكت وتخلصت وجب تصديقها فيما تهتم به، قالت: إن الملوك - أي: الواردات الإلهية التي تأتي من حضرة القهار، إذا دخلوا قرية، أي: قلب نفس، أفسدوا ظاهرها بالتخريب والتعذيب، وجعلوا أعزةَ أهلها أذلة، أي: أبدلوا عزها ذُلاً، وجاهها خمولاً، وغناها من الدنيا فقراً، وكذلك يفعلون\n\n\nوفي الحِكَم العطائية: \" متى وردت الواردات الإلهية عليك هدمت العوائد لديك، إن الملوك إذا دخلوا قرية أفسدوها، وجعلوا أعزة أهلها أذلة وكذلك يفعلون \"\n فكل وارد نزل بالإنسان ولم يغير عليه عوائده فهو كاذب، قال في الحِكَمِ: \" لا تزكين وارداً لم تعلم ثمرته، فليس المراد من السحابة الأمطار، وإنما المراد منها وجود الأثمار \"\n وبالله التوفيق\n ثم اشارت عليهم بإرسال الهدية لسليمان، كما قال تعالى: { وَإِنِّي مُرْسِلَةٌ إِلَيْهِمْ بِهَدِيَّةٍ\n\n\n }\n",
      "translations": []
    }
  ]
}