{
  "chapter": "النمل",
  "text": "قالوا۟ نحن او۟لوا۟ قوة واو۟لوا۟ باس شديد والامر اليك فانظرى ماذا تامرين",
  "translations": [
    {
      "translation": "They said, 'We possess strength and we possess great force. But the matter is in your hands so consider what you command.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We are men of valour, and brave fighters. It is for you to decide. So consider what you should command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We are strong and are given to vehement fighting. But the decision is yours. Therefore, consider what you would like to command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"We have great power and valor. You are the commander, so decide as you like\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We possess great strength and are great warriors, and the decision is yours, therefore consider what you will command.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We have great strength, and great ability for war, but it is for you to command; so think over what you will command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: We are possessors of strength and possessors of mighty prowess, and the command is yours, therefore see what you will command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'We possess force and we possess great might. The affair rests with thee; so consider what thou wilt command.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: We are lords of might and lords of great prowess, but it is for thee to command; so consider what thou wilt command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We are strong and our prowess in battle is great, but the decision is in your hands, so consider what you will command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: we are owners of power and owners of great violence, but the command is with thee; see then whatsoever thou shalt command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘We are powerful and possess a great might. But it is up to you to command. So consider what orders you will give.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We are endued with strength, and given to vehement war: but the command is with thee; so consider what thou wilt command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We have great strength, and great ability for war, but it is for you to command; so think over what you will command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied: 'We are possessors of force and great might. It is for you to command, so consider what you will'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We are a people of might and great courage, but the decision is yours, so consider what you wish to command.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We are men of strength and of great military might, but the command is yours, so see what you will command.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:33] They said, ‘We possess force and we possess great might, in other words, we are hardy in war. The matter is for you [to decide]. So see what you will command’, us, and we will obey you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: We are lords of might) we have weapons (and lords of great prowess) in war, (but it is for thee to command) we shall follow your command; (so consider what thou wilt command) and we will do it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما فوضت أمرها إليهم استعطافاً واستظهاراً { قَالُواْ } مستعلين مستكبرين على مقتضى أصحاب القدرة والقوة، وأرباب الجاه والثورة: { نَحْنُ } قوم { أُوْلُو قُوَّةٍ } وقدرةٍ تامةٍ عَدداً وعُدداً { وَأُولُو بَأْسٍ شَدِيدٍ } قد انتشر صيتنا في الآفاق بالشدة والشجاعة وأنواع الجراءة والاستيلاء، والصولة على الأعداء، فنحن هكذا ولا خوف لنا منهم { وَٱلأَمْرُ } بعد ذلك { إِلَيْكِ } ونحن عبيدك { فَٱنظُرِي مَاذَا تَأْمُرِينَ } [النمل: 33] من القتال والصلح، نعمل على وفق ما أمرتنا به\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا } في جوابها: { نحنُ أولو قوةٍ وأولو بأس شديد } أي: نجدة وشجاعة، فأرادوا بالقوة: قوة الأجساد والآلات، وبالبأس: النجدة والبلاء في الحرب\n { والأمرُ إليك } أي: هو موكل إليك { فانظري ماذا تأمرين } ، فنحن مطيعون إليك، فمُرينا بأمرك، نمتثل أمرك، ولا نخالفك\n كأنهم أشاروا عليها بالقتال، أو أرادوا: من أبناء الحرب، لا من أبناء الرأي والمشهورة، وأنت ذات الرأي والتدبير، فانظري ماذا تأمرين نتبع رأيك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:110",
      "similarity": 0.49961164978657563
    },
    {
      "verse": "10:101",
      "similarity": 0.49107064454145566
    },
    {
      "verse": "53:5",
      "similarity": 0.48318251575733273
    },
    {
      "verse": "37:85",
      "similarity": 0.4633483813824835
    },
    {
      "verse": "27:28",
      "similarity": 0.4600184311960647
    }
  ]
}