{
  "chapter": "النمل",
  "text": "فلما جاء سليمن قال اتمدونن بمال فما ءاتىن الله خير مما ءاتىكم بل انتم بهديتكم تفرحون",
  "translations": [
    {
      "translation": "When it reached Sulayman he said, 'Would you give me wealth when what Allah has given me is better than what He has given you? No, rather it is you who delight in your gift.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when the envoys came to Solomon he said: \"Do you wish to increase my wealth? Yet what God has given me is better than what He has given you. No. Be gratified in your present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, when (the envoy of the Queen) came to Solomon, he said: \"Do you want to aid me with wealth? Whatever Allah has granted me is much more than what He has given you. (Keep for yourselves) your gift in which you are exulting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When her Messengers came to Soloman, he said, \"Have you brought me wealth? What God has given to me is far better than what He has given to you, but you are happy with your gifts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the envoy came to Sulaiman, he said, “Are you helping me with wealth? What Allah has bestowed upon me is better than what He has given you; rather it is you who are delighted at your gift.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when (the messengers with the gift) came to Sulayman, he said: \"Will you help me in wealth What Allah has given me is better than that which He has given you! Nay, you rejoice in your gift!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he came to Sulaiman, he said: What! will you help me with wealth? But what Allah has given me is better than what He has given you. Nay, you are exultant because of your present;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he came to Solomon he said, 'What, would you succour me with wealth, and what God gave me is better than what He has given you? Nay, but instead you rejoice in your gift!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when (the envoy) came unto Solomon, (the King) said: What! Would ye help me with wealth? But that which Allah hath given me is better than that which He hath given you. Nay it is ye (and not I) who exult in your gift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when [the envoy] came to Solomon he said, \"What! Are you offering me wealth? But that which God has given me is better than that which He has given you. Yet you rejoice in your gift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he came unto Sulaiman, he said: are ye going to add riches to me. Then that which Allah hath vouchsafed unto me is better than that which He hath vouchsafed unto you. Aye! it is ye who exult in your present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when he came to Solomon, he said, ‘Are you aiding me with wealth? What Allah has given me is better than what He has given you. Indeed, you are proud of your gift!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when (the embassy) came to Solomon, he said: \"Will ye give me abundance in wealth? But that which Allah has given me is better than that which He has given you! Nay it is ye who rejoice in your gift!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when (the messengers with the present) came to Sulaiman (Solomon), he said: \"Will you help me in wealth? What Allah has given me is better than that which He has given you! Nay, you rejoice in your gift!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when he came to Solomon, he said: 'Is it wealth that you would give me, when Allah has given me that which is better than He has given to you? No, but instead you rejoice in your gift!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he came to Solomon, he said, “Are you supplying me with money? What God has given me is better than what He has given you. It is you who delight in your gift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they came to Solomon, he said, \"Do you provide me with wealth? But what Allah has given me is better than what He has given you. Rather, it is you who rejoice in your gift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:36] But when he, the envoy, came to Solomon, with the gift and the servants, he said, ‘Are you supplying me   with wealth? What God has given me, of prophethood and kingship, is better than what He has given you, of [the things of] this world. Nay, but it is you [and not I] who exult in your gift, for you pride yourselves upon [the possession of] the ornaments of this world!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "So when (the envoy) came unto Solomon) when her envoy went to Solomon, ((the King) said: What! Would ye help me with wealth) with a gift? (But that which Allah hath given me) of prophethood and kingship (is better than that which He hath given you) of wealth. (Nay it is ye (and not I) who exult in your gift) if it were to be returned to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا جَآءَ } الرسل { سُلَيْمَانَ } وحضروا عنده نظر إلأيهم بوجه حسن طلق\n وتكلم معهم ليناً حزيناً مخبراً عن أحوال ملكتهم ومملكتهم\n ثمَّ قال: ما أمركم ومصلحتكم؟ فأطعوا كتاب بلقيس فنظر فيه\n فإذا هي فصلت فيه جميع ممتحناتها\n قال سليمان عليه السلام: أين الحقة؟ فجيء بها فقال: إن فيها درة ثمينة غير مثقوبة\n وجزعة معوجة الثقب\n فأمر سليمان الأرضة فأخذت شعرة\n فدخلت في الدرة حتى خرجت من الجانب الآخر\n وأمر دودة أخرى حتى دخلت في الجزعة المعوجة الثقب بخيط حتى خرجت من الجانب الآخر\n وميَّز بين الجواري والغلمان بأن أمرهم بغسل وجوههم وأيديهم\n فكانت الجارية تأخذ الماء بإحدى يديها وتصب في الأخرى\n ثم تضر وجهها\n والغلام كما يأخذه يضرب به وجهه\n\n\nثمَّ أتوا ببقايا الهدايا المرسله فأبى سليمان عنها\n وردَّ كله إليهم مهدداً عليهم حيث { قَالَ أَتُمِدُّونَنِ } وتزيدونني { بِمَالٍ } يميل إليها أبناء الدنيا المحرومين عن اللذات الأخروية { فَمَآ آتَانِيَ ٱللَّهُ } المنعم المفضل عليَّ من الأمور الأخروية من النبوة والرسالة\n وتسخير الثقلين والرياح والطيور والوحوش\n وجميع من الجو وعلى وجه الأرض { خَيْرٌ مِّمَّآ آتَاكُمْ } من حطام الدنيا ومن مزخرفاتها الفانية\n فما لنا ميل والتفات إليها { بَلْ أَنتُمْ } وأمثالكم من أبناء الدنيا { بِهَدِيَّتِكُمْ } هذه { تَفْرَحُونَ } [النمل: 36] أي: تميلون وتسرون بها\n لفخركم بأمثال هذه الزخارف\n لقصور نظركم عليها وغفلتكم عن الأمور الأخروية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ذلك قوله تعالى: { فلما جاء سليمانَ } أي: جاء رسولها المنذرُ بن عمرو إليه { قال أتمدُّونَنِ بمالٍ } ، توبيخ وإنكار لإمدادهم إياه بالمال، مع علو شأنه وسعة سلطانه\n والتنكير للتحقير، والخطاب للرسول ومن معه، أو للرسول والمرسل تغليب للحاضر\n { فما آتانيَ الله } من النبوة والمُلك الذي لا غاية وراءه { خير مما آتاكم } أي: من المال الذي من جملته ما جئتم به، فلا حاجة لي إلى هديتكم، ولا وقْعَ لها عندي، ولعله عليه السلام إنما قال لهم هذه المقالة\n\n\n\n\n إلخ بعد ما جرى بينه وبينهم ما حكي من قصة الحُقّ وغيرها، لا أنه عليه السلام خاطبهم بها أول ما جاؤوه\n ثم قال لهم: { بل أنتم بهديتِكم تفرحون }\n الهدية: اسم للمُهدَى، كما أن العطية اسم للمُعطَى، فتضاف إلى المُهْدِي والمهدَى له\n والمعنى: أن ما عندي خير مما عندكم، وذلك أن الله تعالى آتاني الدين والمعرفة به، التي هي الغنى الأكبر، والحظ الأوفر، وأتاني من الدنيا ما لا يستزاد عليه، فكيف يرضى مثلي بأن يُمد بمال من قِبلكم؟ بل أنتم قوم لا تعلمون إلا ظاهراً من الحياة الدنيا، فلذلك تفرحون بما تزدادون ويُهدى إليكم لأنَّ ذلك مبلغ همتكم، وحالي خلاف ذلكم، فلا أرضى منكم بشيء، ولا أفرح إلا بالإيمان منكم، وترك ما أنتم عليه من المجوسية\n والإضراب راجع إلى معنى ما تقدم، كأنه قيل: أنا لا أفرح بما تمدونني به بل أنتم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:30",
      "similarity": 0.4856366377723417
    },
    {
      "verse": "10:58",
      "similarity": 0.4138780457003271
    },
    {
      "verse": "23:55",
      "similarity": 0.3874751898589826
    },
    {
      "verse": "74:12",
      "similarity": 0.38641402418749815
    },
    {
      "verse": "27:15",
      "similarity": 0.36267287746183374
    }
  ]
}