{
  "chapter": "النمل",
  "text": "وانى مرسلة اليهم بهدية فناظرةۢ بم يرجع المرسلون",
  "translations": [
    {
      "translation": "I will send them a gift and then wait and see what the messengers bring back.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But I will send them a gift and see what the envoys bring back (in return).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will send them a gift and then see with what answer my envoys return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will send a gift and we shall see what response the Messengers will bring.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I shall send a present to them, then see what reply the envoys bring.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But verily, I am going to send him a present, and see with what (answer) the messengers return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely I am going to send a present to them, and shall wait to see what (answer) do the apostles bring back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now I will send them a present, and see what the envoys bring back.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But lo! I am going to send a present unto them, and to see with what (answer) the messengers return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but I shall send them a present and see with what reply my envoys will return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So verily I am going to send a present unto them, and see with what answer the envoys come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will send them a gift, and see what the envoys bring back.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But I am going to send him a present, and (wait) to see with what (answer) return (my) ambassadors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But verily! I am going to send him a present, and see with what (answer) the messengers return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But I shall send them a gift and see what the messengers bring back'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am sending them a gift, and will see what the envoys bring back.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But indeed, I will send to them a gift and see with what [reply] the messengers will return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:35] Now I will send them a gift and wait to see with what [response] the envoys return’, in the way of accepting the gift or rejecting it. If it be a king [to whom we have sent it], he will accept it; but if it be a prophet, he will reject it. Thus, she sent male and female servants, one thousand in total, together with five hundred bricks of gold, a crown studded with jewels, and musk, ambergris and other things with an envoy carrying a letter. The hoopoe thus hurried back to bring the news to Solomon, who ordered bricks of gold and silver to be made and laid out across a [vast] square the distance of nine parasangs from his seat and for a towering wall of gold and silver to be constructed around it, and for the most splendid creatures of the land and the sea, together with the children of the jinn, to be brought to line the right and left sides of the square.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But lo! I am going to send a present unto them) to Solomon, (and to see with what (answer) the messengers return.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنِّي مُرْسِلَةٌ إِلَيْهِمْ بِهَدِيَّةٍ } معناه بآنيةٍ من ذَهبٍ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - Exalted be He: {And I am sent to them with a gift} [means that I am sent] with a gift of gold.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } ما يليق لنا اليوم، ولا يصلح بحالنا مقارعة باب المقاتلة والمصالحة أيضاً، بل { إِنِّي مُرْسِلَةٌ } رسلاً { إِلَيْهِمْ } أولاً مصحوبة { بِهَدِيَّةٍ } كثيرة لائقة بعظم شأنهم لأختبرهم { فَنَاظِرَةٌ } منتظرة بعد ذلك { بِمَ يَرْجِعُ ٱلْمُرْسَلُونَ } [النمل: 35] أي: بأي شيء يرجعون من عندهم بعد تجسسهم من أحوالهم وأطوارهم ومعاشهم مع رسلنا؛ حتى أعمل على ما يقتضى ما يرجعون، هذا من كمال عقلها ورزانتها في تدبيرات المملكة وصيانتها آداب السلطنة والإمارة وضبط المملكة\n\n\n\n\nورُوي أنها أرسلت منذر بن عمرو في وفد، وأرسلت معه غلمان على زي الجواري، وجواري على زي الغلمان، وحقة فيها درة عذراء لا ثقب فيها، وجزعة معوجة الثقب، وقالت: إن كان نبياً بيَّن الغلمان والجواري، وثقب الدرة ثقباً مستوياً، وسلك في الجزعة خيطاً، ومعها أموال عظام من لبنات الذهب والفضة، والعود والعنبر والكافور والمسك، وأجناس الجواهر والنفائس من كل شيء، فلما وصلوا معسكره رأوا عظمة ما شاهدوا مثلها ولا سمعوا من أحد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: في حكاية بلقيس - وكانت سيسة، قد سيست وساست، فقالت لقومها: { وإني مُرْسِلَةً إِليهم } سليمان وقومه، { بهديةٍ } أُصانعه بذلك عن ملكي، وأختبره، أملك هو أم نبي؟ { فناظرة } فمنتظرة { بمَ يرجعُ المرسلون } بأي شيء يرجعون، بقبولها أم بردها لأنها عرفت عادة الملوك، وحسن موقع الهدايا عندهم، فإن كان مَلِكاً قَبِلَها وانصرف\n وإن كان نبياً ردها ولم يَقبل منا إلا أن نتبعه على دينه، فبعثت خمسمائة غلام، عليهم ثياب الجواري وحُليهنِ، راكبين خيلاً، مغشاة بالديباج، محلاة اللجم والسروج بالذهب المرصع بالجوهر، وخمسمائة جارية على رِمَاك في زي الغلمان، وألف لبنة من ذهب وفضة، وتاجاً مكللاً بالدر والياقوت، وحُقاً فيه دُرة عذراء، وخرزة جزعية مثقوبة، معوجّة الثقب، وأرسلت رسلاً، وأمّرت عليهم المنذر بن عمرو وكتبت كتاباً فيه نسخة الهدية\n وقالت فيه: إذ كنتَ نبياً فميّز بين الوصفاء و الوصائف، وأخْبِر بما في الحُقّ، واثقب الدرّة ثقباً مستوياً، واسلك في الخرزة خيطاً\n ثم قالت للمنذر: إن نظر إليك نظر غضب فهو ملك، فلا يهولنك منظره، وإن رأيته ليناً لطيفاً فهو نبيّ\n فأقبل الهدهد، فأخبر سليمان الخبر كله، فأمر سليمانُ الجن فضربوا لبِنَات الذهب والفضة، وفرشوها في الميدان بين يديه طوله سبعة فراسخ، وجعلوا حول الميدان حائطاً، شرفه من الذهب والفضة، وأمر بأحسن الدواب في البر والبحر، فربطوها عن يمين الميدان و يساره، على اللبنات\n وأمر بأولاد الجن - وهم خلقٌ كثير – فأُقيموا عن اليمين واليسار، ثم قعد على سريره، والكراسي من جانبيه، واصطفت الشياطين صفوفاً فراسخ، والإنس صفوفاً فراسخ، والوحش والسباع والطيور والهوام كذلك فلما دنا القوم، ونظروا، بُهتوا، ورأوا الدواب تروث على اللبن، فتقاصرت إليهم أنفسهم، ورموا بما معهم من الهدايا\n ولما وقفوا بين يديه، نظر إليهم سليمان بوجهٍ طَلْقٍ، فأعطوه كتاب الملكة، فنظر فيه، فقال: أين الحُق؟ فأتى به، فحرّكه، وأخبره جبريل عليه السلام بما فيه\n فقال لهم: إن كان فيه كذا وكذا\n ثم أمر بالأرضَة فأخذت شعرة، ونفذت في الدرّة، فجعل رزقها في الشجر\n وأخذت دودة بيضاء الخيط بفيها ونفذت في ثقب الجزعة فجعل رزقها في الفواكه\n ودعا بالماء، وأمرهم أن يغسلوا وجوههم وأيديهم، فكانت الجارية تأخذ الماء بيدها فتجعله في الأخرى، ثم تضرب به وجهها، والغلام كما يأخذ الماء يضرب به وجهه فيميزهم بذلك\n ثم ردّ الهدية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "96:8",
      "similarity": 0.5760917106755421
    },
    {
      "verse": "75:23",
      "similarity": 0.5127762356321306
    },
    {
      "verse": "21:64",
      "similarity": 0.5102716077655053
    },
    {
      "verse": "35:4",
      "similarity": 0.5099674103246491
    },
    {
      "verse": "15:37",
      "similarity": 0.5016588708421961
    }
  ]
}