{
  "chapter": "النمل",
  "text": "قال عفريت من الجن انا۠ ءاتيك به قبل ان تقوم من مقامك وانى عليه لقوى امين",
  "translations": [
    {
      "translation": "An ifreet of the jinn said, 'I will bring it to you before you get up from your seat. I am strong and trustworthy enough to do it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A crafty jinn said: \"I will bring it before you rise from your seat, for I am strong and trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A stalwart of the jinn said: \"I will bring it to you before you rise from your council. Surely I have the power to do so and I am trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A monstrous jinn said, \"I can bring it before you even stand up. I am powerful and trustworthy\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An extremely evil jinn said, “I will bring it in your presence before you disperse the assembly; and I am indeed strong and trustworthy upon it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An `Ifrit from the Jinn said: \"I will bring it to you before you rise from your place. And verily, I am indeed strong and trustworthy for such work.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One audacious among the jinn said: I will bring it to you before you rise up from your place; and most surely I am strong (and) trusty for it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An efreet of the jinns said, 'I will bring it to thee, before thou risest from thy place; I have strength for it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A stalwart of the jinn said: I will bring it thee before thou canst rise from thy place. Lo! I verily am strong and trusty for such work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A demon from among the jinn said, \"I will bring it to you before you get up from your seat. I am strong and trustworthy enough to do it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A giant from the jinns said: I shall bring it unto thee ere thou arisest from thy place; verily I am strong for it and trusty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An afreet from among the jinn said, ‘I will bring it to you before you rise from your place. I have the power to do it and am trustworthy.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said an 'Ifrit, of the Jinns: \"I will bring it to thee before thou rise from thy council: indeed I have full strength for the purpose, and may be trusted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An Ifrit (strong) from the jinns said: \"I will bring it to you before you rise from your place (council). And verily, I am indeed strong, and trustworthy for such work.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An efreet (an extremely strong jinn) among the jinn replied: 'I will bring it to you before you rise from your place; I have the strength and am trustworthy'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An imp of the sprites said, “I will bring it to you before you rise from your seat. I am strong and reliable enough to do it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A powerful one from among the jinn said, \"I will bring it to you before you rise from your place, and indeed, I am for this [task] strong and trustworthy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:39] An afreet from among the jinn — a [jinn who is] powerful and stalwart — said, ‘I will bring it to you before you rise from your place, the one in which you sit when adjudicating — the period from morning to midday. Indeed I have the strength for it, that is, for carrying it, and I am trustworthy’, over what it may contain of jewels and other [precious] things. Solomon said, ‘I want something faster than that!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A) mighty (stalwart of the jinn) called 'Amr (said: I will bring it thee before thou canst rise from your place) 429 before you leave your seat of judgement, for he used to sit for judgements until noon. (Lo! I verily am strong and trusty for such work) even though it is adorned with gems, pearls, gold and silver.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَالَ عِفْرِيتٌ مِّن ٱلْجِنِّ } وهو المُبالغُ فِي الشَّيءِ\n وقال: هو آصف بن الشيطان بن إبليس، والذي عِندهُ عِلمٌ من الكِتابِ: هو آصف بن بريخا الخَير\n\n\n\n\nوقوله تعالى: { قَبْلَ أَن تَقُومَ مِن مَّقَامِكَ } معناه مِن حِين أنْ تَجلِسَ للنَّاسِ إِلى أَنْ تَقومَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ عِفْرِيتٌ } أي: خبيث مارد { مِّن ٱلْجِنِّ } اسمه ذكوان أو صخراً: { أَنَاْ آتِيكَ بِهِ قَبْلَ أَن تَقُومَ مِن مَّقَامِكَ } أي: مجلسك الذي تجلس عليه أنت للحكومة؛ إذ من دأبه الجلوس إلى وقت الزوال؛ يعني: آتيك به قبل إتيانها { وَإِنِّي عَلَيْهِ } أي: على حمل عرشها { لَقَوِيٌّ } أحمله بلا تزلزل أركانه وقوائمه { أَمِينٌ } [النمل: 39] لا أتصرف منه شيئاً من زينته وجواهره، فاستبطأ عليه السلام إتيانه، وطلب أسرع من ذلك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فال عِفْريتٌ من الجن } ، وهو المارد الخبيث، واسمه \" ذكوان \" ، أو: \" صَخْر \": { أنا آتيك به قبل أن تقوم من مقامك } أي: من مجلسك إلى الحكومة، وكان يجلس إلى تُسع النهار، وقيل: إلى نصفه\n { وإني عليه } على حمله { لقويُّ أمين } ، آتي به على ما هو عليه، لا أغير منه شيئاً ولا أُبدله، فقال سليمان عليه السلام، أريد أعجل من هذا، { قال الذي عنده علم من الكتاب }\n قيل هو: آصف بن برخيا – وزير سليمان عليه السلام، كان عنده اسمُ الله الأعظم، الذي إذا سئل به أجاب\n قيل هو: يا حيّ يا قيوم، أو: يا ذا الجلال والإكرام، أو: يا إلهنا وإله كل شيء، إلهاً واحداً، لا إله إلا أنت\n وليس الشأن معرفة الاسم، إنما الشأن أن يكون عين الاسم، أي: عين مسمى الاسم، حتى يكون أمره بأمر الله\n وقيل: هو الخضر، أو: جبريل، أو: ملك بيده كتاب المقادير، أرسل تعالى عند قول العفريت\n والأول أشهر",
      "translations": []
    }
  ]
}