{
  "chapter": "النمل",
  "text": "ارجع اليهم فلناتينهم بجنود لا قبل لهم بها ولنخرجنهم منها اذلة وهم صغرون",
  "translations": [
    {
      "translation": "Return to them. We will come to them with troops they cannot face and we will expel them from it abased and humiliated.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back to them. We shall soon come with our armies which they will not be able to face. We shall drive them out of (the land) with ignominy, and they will be humbled.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Envoy, go back to those who sent you and we shall certainly come upon them with hosts whom they will be unable to resist. We shall drive them out from there, and they will suffer humiliation and disgrace.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back to your people and we shall soon come there with an army which they will not be able to face. We shall drive them from their town, humble, and disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Go back to them – so we shall indeed come upon them with an army they cannot fight, and degrading them shall certainly drive them out from that city, so they will be humiliated.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back to them. We verily, shall come to them with armies that they cannot resist, and we shall drive them out from there in disgrace, and they will be abased.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back to them, so we will most certainly come to them with hosts which they shall have no power to oppose, and we will most certainly expel them therefrom in abasement, and they shall be in a state of ignominy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return thou to them; we shall assuredly come against them with hosts they have not power to resist, and we shall expel them from there, abased and utterly humbled.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return unto them. We verily shall come unto them with hosts that they cannot resist, and we shall drive them out from thence with shame, and they will be abased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back to them: we shall most certainly come upon them with forces which they will never be able to withstand, and shall most certainly cause them to be driven from their lands, disgraced and humbled!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back unto them. Then surely we shall come unto them with hosts which they cannot withstand, and we shall drive them forth therefrom abased and they shall be humbled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back to them, for we will come at them with hosts which they cannot face, and we will expel them from it, abased and degraded.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back to them, and be sure we shall come to them with such hosts as they will never be able to meet: We shall expel them from there in disgrace, and they will feel humbled (indeed).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Then Sulaiman (Solomon) said to the chief of her messengers who brought the present]: \"Go back to them. We verily shall come to them with hosts that they cannot resist, and we shall drive them out from there in disgrace, and they will be abased.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back then, we shall surely come against them with soldiers of which they have no power to oppose, and we shall drive them from there abased and humiliated'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go back to them. We will come upon them with troops they cannot resist; and we will expel them from there, disgraced and humiliated.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to them, for we will surely come to them with soldiers that they will be powerless to encounter, and we will surely expel them therefrom in humiliation, and they will be debased.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:37] Go back to them, with the gifts that you have brought, for We shall assuredly come to them with hosts which they will not be able to face and we shall expel them from there, from the land of Sheba (Saba’) — named [thus] after their tribal ancestor — humiliated, and they shall be utterly abased’, unless they come to me in submission. When the envoy returned to her with the gift, she had her throne placed inside seven doors inside her palace, with her palace inside seven palaces, and had all the doors locked with guards at them. She then prepared to make the journey to Solomon to see what he would command her. She departed with twelve thousand chieftains (qayl), each accompanied by thousands [of men] until when she came to within a parasang of him, he sensed her [arrival].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Return unto them) with their gift. (We verily shall come unto them with hosts) armies (that they cannot resist) which they have no power to stop, (and we shall drive them out from thence) from Sheba (with shame) with their hands tied to their necks, (and they will be abased) humiliated.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَنَأْتِيَنَّهُم بِجُنُودٍ لاَّ قِبَلَ لَهُمْ بِهَا } معناه لا طَاقَةَ لَهُمْ بِهَا\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {So I will come to them with armies no one can withstand}, meaning they have no power against it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱرْجِعْ } أيها الرسول { إِلَيْهِمْ } أي: إلى ملكتك ومن معها أي: إلى ملكتك ومن معها من الجنود\n وقل لهم: مطلوبي منهم الإيمان بالله المتوحد بالألوهية والربوبية\n والانقياد إليه والإطاعة لأحكامه فلهم الإتيان إليَّ مؤمنين مسلمين منقادين وإلا { فَلَنَأْتِيَنَّهُم بِجُنُودٍ } من الإنس والجن وأصناف الوحوش والطيور\n وأنواع الهوام والحشرات بالغة من الكثرة إلى حد { لاَّ قِبَلَ لَهُمْ بِهَا } أي: لا يسع لهم مقابلتها من بعيد\n فكيف ممانعتها ومقاتلتها؟! { وَ } بعدما لم يسع لهم المقابلة { لَنُخْرِجَنَّهُم مِّنْهَآ } أي: من بلادهم { أَذِلَّةً } ضعفاء ذليلين بأيدينا { وَهُمْ } حنيئذ { صَاغِرُونَ } [النمل: 37] مهانون أُسراء بأيدي هؤلاء العفاريت\n\n\nثمَّ لمَّا رجع رسلها مع ما أهدت من الهدايا على وجهها قالت بلقيس: قد عرف أنه ليس بملك\n بل نبي من الأنبياء مؤيد بأمر سماوي\n وما لنا طاقة مقاومة ومقابلة معه سوى المصالحة والإطاعة بأمره والحضور عنده\n\n\nثمَّ أرسلت بلقيس إليه - صلوات الرحمن عليه - ثانياً: إني قادمة إليك عن قريب فيهأت أسبابه حتى تخرج\n وجعلت سريرها داخل سبعة أبواب في قصرها\n وقصرها داخل سبعة قصور\n وأغلقت على الأبواب كلها\n وجعلت عليها حرساً متعددة\n وارتحلت إلى سليمان\n فلما دنت إليه رأى سليمان حين كان على سريره جماً غفيراً من السواد مسيرة فرسخ فسأل عنهم\n فقالوا: بلقيس أتت بجنودها مطيعين مسلمين\n\n{ قَالَ } سليمان لمن حوله من الج والإنس: { يٰأَيُّهَا ٱلْمَلأُ أَيُّكُمْ يَأْتِينِي بِعَرْشِهَا قَبْلَ أَن يَأْتُونِي } ويحضروا عندي { مُسْلِمِينَ } [النمل: 38] مؤمنين\n إذ بعدما أتوا لا يجوز إتيان عرشها إلا بإذنها\n إذ لا يصح نقل مال المسلم إلا بإذنه\n\n\n{ قَالَ عِفْرِيتٌ } أي: خبيث مارد { مِّن ٱلْجِنِّ } اسمه ذكوان أو صخراً: { أَنَاْ آتِيكَ بِهِ قَبْلَ أَن تَقُومَ مِن مَّقَامِكَ } أي: مجلسك الذي تجلس عليه أنت للحكومة\n إذ من دأبه الجلوس إلى وقت الزوال\n يعني: آتيك به قبل إتيانها { وَإِنِّي عَلَيْهِ } أي: على حمل عرشها { لَقَوِيٌّ } أحمله بلا تزلزل أركانه وقوائمه { أَمِينٌ } [النمل: 39] لا أتصرف منه شيئاً من زينته وجواهره\n فاستبطأ عليه السلام إتيانه\n وطلب أسرع من ذلك\n\n\n{ قَالَ ٱلَّذِي عِندَهُ عِلْمٌ } فائض له { مِّنَ ٱلْكِتَابِ } أي: من حضرة العلم الإلهي المعبر بالقضاء واللوح المحفوظ\n وعالم الأسماء والأعيان الثابتة\n به يقدر على إحضار شيء وإعدامه دفعة\n وكان هو وزيره آصف بن برخية\n قد انكشف عليه خواص الأسماء الإلهية ففعل بها ما فعل: { أَنَاْ آتِيكَ بِهِ قَبْلَ أَن يَرْتَدَّ إِلَيْكَ طَرْفُكَ } أي: قبل أن تعيد وتطبق أجفانك حين نظرك\n وهذا كناية عن كمال الرسعة والعجلة\n فأتى به طرشفة عين { فَلَمَّا رَآهُ } أي: سليمان العرش { مُسْتَقِرّاً عِندَهُ } قبل إتيان بلقيس { قَالَ } سليمان عليه السلام متوجهاً إلى ربه\n مذكراً نعمه الفائضة على نفسه\n مجدداً الشكر إياها: { هَـٰذَا } أي: حضور العرش العظيم الثقيل في غاية الثقل والعظمة في آنٍ و احدٍ\n مع أنه كان في مسافة بعيدة { مِن } جملة { فَضْلِ رَبِّي } عليَّ\n ومن عداد جلائل إنعامه وأفضاله إليَّ\n\n\nإنما تفضل سبحانه عليَّ بهذا { لِيَبْلُوَنِيۤ } ويختبروني { أَأَشْكُرُ } بمواظبة شكر نعمه المتواترة عليَّ\n بحيث أعجز عن أداء حق شكره\n وأعترف بالعجز والقصور عن إحاطة نعمه\n فيكف أداء حقوقها؟! { أَمْ أَكْفُرُ } لنعمه\n ولا أقسيم بمقام الشكر عليها\n وإن الإقامة والتوفيق عليها أيضاً من جملة نعمه وفضله وكرمه\n ولا عائدة من شكرنا إليه سبحانه\n إذ هو منزه عنها؟! بل { وَمَن شَكَرَ } على نعم الحق\n وصرفها على مقتضى ما جبلها الحق لأجله { فَإِنَّمَا يَشْكُرُ } الشاكر { لِنَفْسِهِ } لازدياد النعم عليها بمزيد الشكر { وَمَن كَفَرَ } فإنما يكفر لنفسه بانتقاص النعم عليها { فَإِنَّ رَبِّي غَنِيٌّ } في ذاته عن جميع العوائد { كَرِيمٌ } [النمل: 40] جواد لا يعلل فعله بالأغراض وإنعامه بالأعواض",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال للرسول: { ارجعْ إليهم } إلى بلقيس وقومها، وقل لهم: { فلَنَأْتينَّهم بجنودٍ لا قِبَلَ }: لا طاقة { لهم بها }\n وحقيقة القِبَل: المقابلة والمقاومة، أي: لا يقدرون أن يقابلوهم، { ولنُخْرجنّهم منها } أي: من سبأ { أذلةً وهم صاغرون }: أسارى مهانون\n فالذل: أن يذهب عنهم ما كانوا فيه من العز والملك، والصغار: أن يبقوا في أسر واستعباد\n فلما رجع إليها رسولها بالهدايا، وقصّ عليها القصة، قالت: هو نبي، وما لنا به طاقة\n ثم تجهزت للقائه، على ما يأتي إن شاء الله\n الإشارة: إذا توجه المريد إلى مولاه، توجهت إليه نفسه بأجنادها، وهي الدنيا، والجاه، والرئاسة، والحظوظ، والشهوات، فتُمده أولاً بمالٍ وجاه، تختبره، فإن علت همته، وقويت عزيمته، أعرض عن ذلك وأنكره، وقال: أتمدونني بمال حقير، وجاهٍ صغير، فلما آتاني الله من معرفته والغنى به خير مما آتاكم\n ثم يقول للوارد بذلك: ارجع إليهم – أي: للنفس وجنودها – فلنأتينهم بجنود من الأنوار لا قِبَل لهم بها، ولنخرجنهم منها - أي: قرية القلب - أذلة وهم صاغرون\n والله تعالى أعلم بأسرار كتابه\n ثم ذكر إيتان عرشها قبل إيتانها، فقال: { قَالَ يٰأَيُّهَا ٱلْمَلأُ\n\n\n }\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:53",
      "similarity": 0.45702676973251477
    },
    {
      "verse": "63:8",
      "similarity": 0.41384598076717377
    },
    {
      "verse": "7:13",
      "similarity": 0.41274527575350484
    },
    {
      "verse": "9:29",
      "similarity": 0.37269020550873205
    },
    {
      "verse": "7:119",
      "similarity": 0.3714003912781619
    }
  ]
}