{
  "chapter": "النمل",
  "text": "قال يقوم لم تستعجلون بالسيئة قبل الحسنة لولا تستغفرون الله لعلكم ترحمون",
  "translations": [
    {
      "translation": "He said, 'My people, why are you so anxious to hasten the bad before the good? If only you would ask for forgiveness from Allah, so that mercy might perhaps be shown to you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saleh) said: \"O people, why do you wish to hasten evil rather than good? Why not ask for God's forgiveness? You may well be forgiven.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Salih said: \"My people, why do you wish to hasten that evil rather than good should come upon you? Why should you not seek pardon from Allah so that mercy be shown to you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Salih said, \"My people, why do you commit sins so quickly before doing good? Would that you ask forgiveness from God so that perhaps He will have mercy upon you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O my people, why do you hasten upon the evil before the good? Why do you not seek forgiveness from Allah? Perhaps there may be mercy upon you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people! Why do you seek to hasten the evil before the good Why seek you not the forgiveness of Allah, that you may receive mercy\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my people! why do you seek to hasten on the evil before the good? Why do you not ask forgiveness of Allah so that you may be dealt with mercifully?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'O my people, why do you seek to hasten evil before good? Why do you not ask forgiveness of God? Haply so you will find mercy.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my people! Why will ye hasten on the evil rather than the good? Why will ye not ask pardon of Allah, that ye may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He urged them, \"O my people, why do you wish to hasten on the evil rather than the good? Why do you not ask forgiveness of God, so that you may be shown mercy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O my people! wherefore seek ye to hasten the evil before the good? Wherefore ask ye not forgiveness of Allah, that haply ye may be shewn mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘O My people! Why do you press for evil sooner than for good? Why do you not plead to Allah for forgiveness so that you may receive His mercy?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people! why ask ye to hasten on the evil in preference to the good? If only ye ask Allah for forgiveness, ye may hope to receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my people! Why do you seek to hasten the evil (torment) before the good (Allah's Mercy)? Why seek you not the Forgiveness of Allah, that you may receive mercy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My nation' he said, 'why do you wish to hasten evil rather than good? Why do you not ask the forgiveness of Allah, in order that you find mercy'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O my people, why are you quick to do evil rather than good? If only you would seek God’s forgiveness, so that you may be shown mercy.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"O my people, why are you impatient for evil instead of good? Why do you not seek forgiveness of Allah that you may receive mercy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:46] He said, to the deniers: ‘O my people, why do you [seek to] hasten on evil before [seeking] good?, in other words, [why do you seek to hasten on] chastisement instead of mercy, when you say, ‘If what you bring us is true, then bring us the chastisement!’ Why do you not ask God to forgive you, [your] idolatry, so that you might be shown mercy?’, and not be chastised.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَ يَا قَوْمِ لِمَ تَسْتَعْجِلُونَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ لَوْلَا تَسْتَغْفِرُونَ اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ (46)لما كان الاختصام بين الفريقين في شأن صالح ابتداء جيء بجواب صالح عما تضمنه اختصامهم من محاولتهم إفحامه بطلب نزول العذاب . فمقول صالح هذا ليس هو ابتداء دعوته فإنه تقدم قوله : { أن اعبُدوا الله } \\[ النمل : 45 \\] ولكنه جواب عمّا تضمنه اختصامهم معه ، ولذلك جاءت جملة : { قال يا قوم } مفصولة جرياً على طريقة المحاورة لأنها حكاية جواب عما تضمنه اختصامهم .واقتصر على مراجعة صالح قومَه في شأن غرورهم بظنهم أن تأخر العذاب أمارة على كذب الذي توعدهم به فإنهم قالوا : { فآتنا بما تَعِدُنا إن كنتَ من الصادقين } \\[ الأعراف : 70 \\] كما حكي عنهم في سورة الأعراف لأن الغرض هنا موعظة قريش في قولهم : { فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم } \\[ الأنفال : 32 \\] بحال ثمود المساوي لحالهم ليعلموا أن عاقبة ذلك مماثلة لعاقبة ثمود لتماثل الحالين قال تعالى : { ويستعجلونك بالعذاب ولولا أجل مسمّى لجاءهم العذاب ولَيَأتِينّهم بغتة وهم لا يشعرون } \\[ العنكبوت : 53 \\] .والاستفهام في قوله : { لم تستعجلون } إنكار لأخذهم بجانب العذاب دون جانب الرحمة .ف { السيئة } : صفة لمحذوف ، أي بالحالة السيئة ، وكذلك { الحسنة } .فيجوز أن يكون المراد ب { السيئة } الحالة السيئة في معاملتهم إياه بتكذيبهم إياه . والمراد بالحسنة ضدّ ذلك ، أي تصديقهم لما جاء به ، فالاستعجال : المبادرة . والباء للملابسة . ومفعول { تستعجلون } محذوف تقديره : تستعجلونني متلبسين بسيئة التكذيب . والمعنى : أنه أنكر عليهم أخذهم بطرف التكذيب إذ أعرضوا عن التدبر في دلائل صدقه ، أي إن كنتم مترددين في أمري فافرضوا صدقي ثم انظروا . وهذا استنزال بهم إلى النظر بدلاً عن الإعراض ، ولذلك جمع في كلامه بين السيئة والحسنة .ويجوز أن يكون المراد ب { السيئة } الحالةَ السيئة التي يترقبون حلولها ، وهي ما سألوا من تعجيل العذاب المحكي عنهم في سورة الأعراف ، وب { الحسنة } ضد ذلك أي حالة سلامتهم من حلول العذاب ف { السيئة } مفعول { تستعجلون } والباء مزيدة لتأكيد اللصوق مثل ما في قوله تعالى : { وامسحوا برؤوسكم } \\[ المائدة : 6 \\] .والمعنى : إنكار جعلهم تأخيرَ العذاب أمارةً على كذب الوعيد به وأن الأولى بهم أن يجعلوا امتداد السلامة أمارة على إمهال الله إياهم فيتقوا حلول العذاب ، أي لِمَ تبْقَون على التكذيب منتظرين حلول العذاب ، وكان الأجدر بكم أن تبادروا بالتصديق منتظرين عدم حلول العذاب بالمرة . وعلى كلا الوجهين فجواب صالح إياهم جار على الأسلوب الحكيم بجعل يقينهم بكذبه محمولاً على ترددهم بين صدقه وكذبه .وقوله : { قبل الحسنة } حال من { السيئة } . وهذا تنبيه لهم على خطئهم في ظنهم أنه لو كان صالح صادقاً فيما توعدهم به لعَجّل لهم به ، فما تأخيره إلا لأنه ليس بوعيد حق ، لأن العذاب أمر عظيم لا يجوز الدخول تحت احتماله في مجاري العقول . فالقبلية في قوله : { قبل الحسنة } مجاز في اختيار الأخذ بجانب احتمال السيئة وترجيحه على الأخذ بجانب الحسنة ، فكأنهم بادروا إليها فأخذوها قبل أن يأخذوا الحسنة .وظاهر الاستفهام أنه استفهام عن علة استعجالهم ، وإنما هو استفهام عن المعلول كناية عن انتفاء ما حقه أن يكون سبباً لاستعجال العذاب ، فالإنكار متوجه للاستعجال لا لعلته .ثم أُعقب الإنكار المقتضي طلب التخلية عن ذلك بتحريضهم على الإقلاع عن ذلك بالتوبة وطلب المغفرة لما مضى منهم ويرجون أن يرحمهم الله فلا يعذبهم ، وإن كان ما صدر منهم موجباً لاستمرار غضب الله عليهم ، إلا أن الله برحمته جعل التائب من الذنب كمن لم يذنب .\n\n",
      "translations": [
        {
          "translation": "(He said) Salih said to the disbelieving party: (0 my people! Why will ye hasten on the evil) the torment (rather than the good) rather than well-being and mercy? (Why will ye not ask pardon of Allah) why do you not repent of idolatry and denial and profess Allah's divine Oneness, (that ye may receive mercy) and escape the torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وما نحن عليه حق { لم تستعجلون بالسيئة } أي: الاستيلاء على القلب بالرذيلة { قبل } الإتيان بالفضيلة { لولا تستغفرون الله } بالتنوّر بنور التوحيد\n والتنصل عن الهيئات البدنية المظلمة { لعلكم ترحمون } بإفاضة الكمال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } صالح للمعرضين المكذبين: { يٰقَوْمِ } شأنكم الحذر والإعراض من عذاب الله ونكاله\n وعن موجبات قهره وأسباب عضبه { لِمَ تَسْتَعْجِلُونَ بِٱلسَّيِّئَةِ } الموجبة لأنواع العذاب والقهر الإلهي { قَبْلَ ٱلْحَسَنَةِ } المستجلبة لعموم الخيرات { لَوْلاَ } أي: هلاَّ { تَسْتَغْفِرُونَ ٱللَّهَ } العفو الغفور\n لكفركم وذنبكم الذي صدر عنكم { لَعَلَّكُمْ تُرْحَمُونَ } [النمل: 46] قبل نزول عذابه عليكم\n إذ حين نزول العذاب لا ينفع توبتكم واستغفاركم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الأعراف: 75- 76] { قال } عليه السلام للفريق الكافر\n بعد ما شاهد منهم ما شاهد من نهاية العتو والعناد\n حتى استعجلوا العذاب: { يا قوم لِمَ تستعجلون بالسيئة } بالعقوبة السيئة { قبلَ الحسنة } أي: التوبة الصالحة\n فتؤخرونها إلى حين نزولها\n حيث كانوا – من جهلهم وغوايتهم يقولون\n إن وقع العذاب تُبنا حينئذٍ\n وإلا فنحن على ما كنا عليه\n أو: لِمَ تستعجلون بالعذاب قبل الرحمة\n أو: بالمعصية قبل الطاعة\n { لولا تستغفرون الله }: هلا تطلبون المغفرة من كفركم بالتوبة والإيمان قبل نزوله\n { لعلكم تُرْحَمون } بالإجابة قبل النزول\n إذ لا قبول بعده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:83",
      "similarity": 0.48879508140389055
    },
    {
      "verse": "26:204",
      "similarity": 0.44581985373687044
    },
    {
      "verse": "37:176",
      "similarity": 0.44581985373687044
    },
    {
      "verse": "13:6",
      "similarity": 0.4346011368902564
    },
    {
      "verse": "19:84",
      "similarity": 0.3880532137846628
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027046.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027046.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:46.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}