{
  "chapter": "النمل",
  "text": "ان الذين لا يؤمنون بالءاخرة زينا لهم اعملهم فهم يعمهون",
  "translations": [
    {
      "translation": "As for those who do not have iman in the Next World. We have made their actions appear good to them and they wander about blindly.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We make their deeds attractive to those who do not believe in the Hereafter, so that they may wander in perplexity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who do not believe in the Hereafter, We have made their deeds seem attractive to them so they stumble around in perplexity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the deeds of those who do not believe in the life to come, attractive to them and they wander about blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not believe in the Hereafter – We have made their deeds seem good to them, so they are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe not in the Hereafter, We have made their deeds fair seeming to them, so that they wander about blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who do not believe in the hereafter, We have surely made their deeds fair-seeming to them, but they blindly wander on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe not in the Hereafter, We have decked out fair for them their works, and they wander blindly;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! as for those who believe not in the Hereafter, We have made their works fairseeming unto them so that they are all astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made those who do not believe in the Hereafter feel their actions appear good to them, so they wander blindly:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who believe not in the Hereafter - fairseeming unto them We have made their works, so that they wander perplexed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who do not believe in the Hereafter, We have made their deeds seem decorous to them, and so they are bewildered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who believe not in the Hereafter, We have made their deeds pleasing in their eyes; and so they wander about in distraction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe not in the Hereafter, We have made their deeds fair-seeming to them, so they wander about blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who do not believe in the Everlasting Life, We have decorated for them their works, and they wander blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who do not believe in the Hereafter: We made their deeds appear good to them, so they wander aimlessly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, for those who do not believe in the Hereafter, We have made pleasing to them their deeds, so they wander blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:4]   Truly those who do not believe in the Hereafter, We have adorned their, vile, deeds for them, by making such [deeds] seem sensuous so that they then deem them wholesome, and so they are bewildered, confused about why We deem these [deeds] to be vile.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! as for those who believe not in the Hereafter) those who do not believe in resurrection after death: Abu Jahl and his host, (We have made their works fair-seeming unto them) in their state of disbelief (so that they are all astray) so they proceed blindly, unable to see.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ الذين لا يؤمنون بالآخرة } من المحجوبين بتزين نفوسهم بكمالاتها وهيئات أعمالها { فهم يعمهون } يعمون بصائرهم عن إدراك صفات الحق وتجليات أنوارها وإلا لم يحجبوا بصفاتهم وأفعالهم بل فنوا عنها\n { أولئك الذين لهم سوء العذاب } بنيران الحجاب والحرمان عن لذات تجليات الصفات { وهم في الآخرة } ومقام كشف الذات في القيامة الكبرى { هم الأخسرون } لتكاثف حجابهم بصفاتهم وذواتهم فلا خلاق لهم من الجنتين ولذاتهما\n { وإنك لتلقى القرآن } أي: العقل القرآني { من لدن } أي: من عين جمع الوحدة في الصفات الأول الذي لا حجاب بينه وبين الحضرة الأحدية بل هو نفسه الحجاب الأقدس المفيض لكل الاستعدادات من العقول الفرقانية على أربابها من الأعيان الثابتة الإنسانية { حكيم } ذي حكمة بالغة تامّة وعلم محيط شامل\n اذكر من جملة علوم الحق وحكمه وقت قول موسى القلب { لأهله } من النفس والحواس الظاهرة والباطنة { امكثوا } واثبتوا ولا تشوّشوا وقتي بالحركات { إني آنست } بعين البصيرة { ناراً } أي: نار وما أعظمها هي نار العقل والفعال { سآتيكم منها بخبر } أي: علم بالطريقة إلى الله\n وكان حاله أنه ضلّ الطريقة إلى الله برعاية أغنام القوى البهيمية وزوجه النفس الحيوانية { أو آتيكم بشهاب قبيس } أي: بشعلة نورية تشرق عليكم حين اتصالي بالنار وتنوري بها { لعلكم تصطلون } عن برد الركون إلى البدن والسكون إليه وهوى لذاته فتشتاقوا بحركة تلك النار إلى جناتي وتسيرون بمحبتي إلى مقام الصدر\n { فلما جاءها نودي أن بُورِكَ } أي: كثر خير { من في النار } أي: هو موسى القلب الواصل إلى النار بتجليّات الصفات الإلهية ووجدان الكمالات الحقيقية ومقام المكالمة عن النبوّة { ومن حولها } من القوى الروحانية والملائكة السماوية بأنوار المكاشفة وأسرار العلوم والحِكَم والتأييدات القدسية والأحوال السريّة والذوقية { وسبحان الله ربّ العالمين } ونزّه ذات الله بتجرّدك عن الصفات النفسانية والغواشي الجسدانية والنقائص والمعائب",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على مقتضى سنته المستمرة في كتابه: { إِنَّ ٱلَّذِينَ لاَ يُؤْمِنُونَ } ولا يصدقون { بِٱلآخِرَةِ } عناداً ومكابرةً { زَيَّنَّا } وحسناً { لَهُمْ أَعْمَالَهُمْ } القبيحة الفاسدة الدنيوية\n وأمهلنا لهم علينا زماناً\n ليستحقوا أشد العذاب وأسوا العقاب { فَهُمْ } بواسطة إمهالنا إياهم في سكرتهم وغفلتهم { يَعْمَهُونَ } [النمل: 4] يترددون ويتحيرون بطرين بما لهم من الترفة والتنعم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { زيَّنَّا لهم أعمالهم } الخبيثة\n حيث جعلناها مشتهية للطبع\n محبوبة للنفس\n حتى رأوها حسنة\n كقوله:\n[فاطر: 8]\n { فهم يَعْمَهُونَ } يترددون في ضلالتهم\n كما يكون حال الضال عن الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:186",
      "similarity": 0.7536339538524888
    },
    {
      "verse": "2:15",
      "similarity": 0.691414881875012
    },
    {
      "verse": "6:110",
      "similarity": 0.5786632683142479
    },
    {
      "verse": "10:11",
      "similarity": 0.5523539193970853
    },
    {
      "verse": "15:72",
      "similarity": 0.5300999241977844
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/27:4.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/27:4.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}