{
  "chapter": "النمل",
  "text": "وصدها ما كانت تعبد من دون الله انها كانت من قوم كفرين",
  "translations": [
    {
      "translation": "She was (in fact) turned away by what she worshipped other than God, for she came of an unbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What prevented her (from accepting the True Faith) was her worshipping deities other than Allah, for she belonged to an unbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Her idols prevented her from believing in God and she was an infidel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the thing she used to worship instead of Allah prevented her; she was indeed from the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Saddaha that which she used to worship besides Allah has prevented her (from Islam), for she was of a disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what she worshipped besides Allah prevented her, surely she was of an unbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but that she served, apart from God, barred her, for she was of a people of unbelievers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (all) that she was wont to worship instead of Allah hindered her, for she came of disbelieving folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which she used to worship beside God had stopped her [from believing]; for she came of a disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which she was wont to worship instead of Allah hindered her; verily she was of an infidel people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She had been barred [from the way of Allah] by what she used to worship besides Allah, for she belonged to a faithless people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he diverted her from the worship of others besides Allah: for she was (sprung) of a people that had no faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which she used to worship besides Allah has prevented her (from Islam), for she was of a disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which she worshipped, other than Allah, had prevented her, for she came from an unbelieving nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But she was prevented by what she worshiped besides God; she belonged to a disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which she was worshipping other than Allah had averted her [from submission to Him]. Indeed, she was from a disbelieving people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:43] And what she worshipped besides God, that is, other than Him, barred her, from the worship of God, for she belonged to disbelieving folk’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (all) that she was wont to worship) the sun (instead of Allah hindered her) Solomon stopped her; it is also said that this means: Allah stopped her, (for she came of disbelieving folk) her folk were Zoroastrians.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من فضل الله إياها أنه { صَدَّهَا } وصرفها بعدما ظهر عندها نبوة سليمان عليه السلام { مَا كَانَت تَّعْبُدُ مِن دُونِ ٱللَّهِ } يعني: صرفها الحق عن عبادة الشمس؛ إذ عبدتها تقليداً لأسلافها { إِنَّهَا كَانَتْ } منتشئة { مِن قَوْمٍ كَافِرِينَ } [النمل: 43] جاحدين لله، عابدين للشمس\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وصدّها ما كانت تعبدُ من دون الله } ، هو من كلام سليمان، أي: وصدها عن العلم بما علمناه – أو: عن التقدم إلى الإسلام - عبادةُ الشمس وإقامتها بين ظهرانيِّ الكفرة، أو: من كلام تعالى، بياناً لما كان يمنعها من إظهار ما ادعته من الإسلام الآن، أي: صدَّها عن ذلك عبادتُها القديمة للشمس، { إنها كانت من قوم كافرين } أي: كانت من قوم راسخين في الكفر، ولذلك لم تكن قادرة على إظهار إسلامها، وهو بين ظهرانيهم، حتى دخلت تحت ملكة سليمان عليه السلام، أو: وصدها الله تعالى، أو: سليمان، عما كانت تعبد من دون الله، فحذف الجار وأوصل الفعل",
      "translations": []
    }
  ]
}