{
  "chapter": "النمل",
  "text": "فلما جاءت قيل اهكذا عرشك قالت كانه هو واوتينا العلم من قبلها وكنا مسلمين",
  "translations": [
    {
      "translation": "Then when she came, she was asked, 'Is your throne like this?' She said, 'It is exactly like it.' 'We were given knowledge before her and were already Muslims,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she arrived, they asked her: \"Is your throne like this?\" She said: \"As though this is it. We had come to have knowledge and already submitted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Queen arrived, she was asked: \"Is your throne like this one?\" She said: \"It seems as if it is the same. We had already come to know this and we had submitted ourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she came she was asked, \"Is your throne like this?\" She replied, \"It seems that this is it. We had received the knowledge before this and were submissive (to Solomon's power)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when she came, it was said to her, “Is your throne like this? She said, “As if this is it! And we came to know about this incident beforehand and submit (to you).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she came, it was said, \"Is your throne like this\" She said: \"As though it were the very same.\" And he said, \"Knowledge was bestowed on us before her, and we had submitted to Allah (as Muslims).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she came, it was said: Is your throne like this? She said: It is as it were the same, and we were given the knowledge before it, and we were submissive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when she came, it was said, 'Is thy throne like this?' She said, 'It seems the same.' 'And we were given the knowledge before her, and we were in surrender,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when she came, it was said (unto her): Is thy throne like this? She said: (It is) as though it were the very one. And (Solomon said): We were given the knowledge before her and we had surrendered (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she came to Solomon, she was asked, \"Is your throne like this?\" She replied, \"It looks as though it were the same, and we had been given knowledge [of your power] before this, and we have already submitted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when she arrived, it was said: is thy throne like unto? She said: it is as though it were it; and we have been vouchsafed the knowledge before this, and we have been Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she came, it was said [to her], ‘Is your throne like this one?’ She said, ‘It seems to be the same, and we were informed before it, and we had submitted.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she arrived, she was asked, \"Is this thy throne?\" She said, \"It was just like this; and knowledge was bestowed on us in advance of this, and we have submitted to Allah (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she came, it was said (to her): \"Is your throne like this?\" She said: \"(It is) as though it were the very same.\" And [Sulaiman (Solomon) said]: \"Knowledge was bestowed on us before her, and we were submitted to Allah (in Islam as Muslims before her).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she came she was asked: 'Is your throne like this' And she replied: 'It looks like it' And we were given the knowledge before her, and wereMuslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she arrived, it was said, “Is your throne like this?” She said, “As if this is it.” “We were given knowledge before her, and we were submissive.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she arrived, it was said [to her], \"Is your throne like this?\" She said, \"[It is] as though it was it.\" [Solomon said], \"And we were given knowledge before her, and we have been Muslims [in submission to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:42] So when she came, it was said, to her: ‘Is your throne like this?’ She said, ‘It as though it is the one’. She   had, in fact, recognised it; but she made a pretence to them just as they made a pretence to her, given that [when she was asked about the throne] it was not said, ‘Is this your throne?’, for had it been so, she would have replied, ‘Yes, it is’. When Solomon realised that she was perceptive and knowledgeable, he said: ‘And we were given the knowledge before her and we had submitted [to God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَلَمَّا جَاءَتْ قِيلَ أَهَكَذَا عَرْشُكِ قَالَتْ كَأَنَّهُ هُوَ وَأُوتِينَا الْعِلْمَ مِنْ قَبْلِهَا وَكُنَّا مُسْلِمِينَ (42) { يَهْتَدُونَ \\* فَلَمَّا جَآءَتْ قِيلَ أَهَكَذَا عَرْشُكِ قَالَتْ كَأَنَّهُ هُوَ وَأُوتِينَا العلم مِن قَبْلِهَا } .دل قوله : { لما جاءت } أنّ الملكة لما بلغها ما أجاب به سليمان رسلها أزمعت الحضور بنفسها لدى سليمان داخلة تحت نفوذ مملكته ، وأنها تجهزت للسفر إلى أورشليم بما يليق بمثلها .وقد طُوي خبر ارتحالها إذ لا غرض مُهِمّاً يتعلق به في موضع العبرة . والمقصود أنها خضعت لأمر سليمان وجاءته راغبة في الانتساب إليه .وبني فعل { قيل } للمجهول إذ لا يتعلق غرض بالقائل . والظاهر أن الذي قال ذلك هو سليمان .يجوز أن يكون عطفاً على قوله : { هذا من فضل ربي } \\[ النمل : 40 \\] الآية وما بينهما اعتراضاً ، أي هذا من قول سليمان .ويجوز أن يكون عطفاً على قوله : { ننظر أَتهتدي } \\[ النمل : 41 \\] الآية وما بينهما اعتراضاً كذلك ، ويجوز أن يكون عطفاً على { أهكذا عرشُك } وما بينهما اعتراضاً به جوابها ، أي وقيل أوتينا العلم من قبلها ، أي قال القائل : أهكذا عرشك ، أي قال سليمان ذلك في ملئه عقب اختيار رأيها شكراً لله على ما لديه من العلم ، أو قال بعض ملأ سليمان لبعض هذه المقالة . ولعلهم تخافتوا به أو رَطنوه بلغتهم العبرية بحيث لا تفهمهم . وقالوا ذلك بَهجين بأن فيهم من له من العلم ما ليس لملأ ملكة سبأ ، أي لا ننسى بما نُشاهده من بَهرجات هذه الملكة أننا في حالة عقلية أفضل . وأرادوا بالعلم علم الحكمة الذي علمه الله سليمان ورجال مملكته وتشاركهم بعض أهل سبأ في بعضه فقد كانوا أهل معرفة أنشأوا بها حضارة مبهتة .فمعنى : { من قبلها } إن حمل على ظاهره أن قومهم بني إسرائيل كانوا أسبق في معرفة الحكمة وحضارة الملك من أهل سبأ لأن الحكمة ظهرت في بني إسرائيل من عهد موسى ، فقد سن لهم الشريعة ، وأقام لهم نظام الجماعة ، وعلمهم أسلوب الحضارة بتخطيط رسوم مساكنهم وملابسهم ونظام الجيش والحرب والمواسم والمحافل . ثم أخذ ذلك يرتقي إلى أن بلغ غاية بعيدة في مدة سليمان ، فبهذا الاعتبار كان بنو إسرائيل أسبق إلى علم الحكمة قبل أهل سبأ ، وإن أريد ب { مِن قبلها } القبليةُ الاعتباريةُ وهي الفضل والتفوق في المزايا وهو الأليق بالمعنى كان المعنى : إنَّا أوسع وأقوى منها علماً ، كما قال النبي صلى الله عليه وسلم \" نحن الأولون السابقون بَيْد أنهم أوتوا الكتاب من قَبْلنا \" أي نحن الأولون في غايات الهدى ، وجعل مثلاً لذلك اهتداء أهل الإسلام ليوم الجمعة فقال : «وهذا يومهم الذي اختلفوا فيه فهدانا الله إليه» . فكان الأرجح أن يكون معنى { من قبلها } أنّا فائتونها في العلم وبالغون ما لم تبلغه . وزادوا في إظهار فضلهم عليها بذكر الناحية الدينية ، أي وكنا مسلمين دونها .وفي ذكر فعل الكون دلالة على تمكنهم من الإسلام منذ القدم .وصدّها هي عن الإسلام ما كانت تعبد من دون الله ، أي صدّها معبودها من دون الله ، ومتعلق الصد محذوف لدلالة الكلام عليه في قوله : { وكنا مسلمين } . وما كانت تعبده هو الشمس . وإسناد الصدّ إلى المعبود مجاز عقلي لأنه سبب صدها عن التوحيد كقوله تعالى : { وما زادُوهم غير تتبيب } \\[ هود : 101 \\] وقوله : { غَرَّ هؤلاء دينُهم } \\[ الأنفال : 49 \\] .وفي ذكر فعل الكون مرتين في { ما كانت تعبد } . و { إنها كانت من قوم كافرين } دلالة على تمكنها من عبادة الشمس وكان ذلك التمكن بسبب الانحدار من سلالة المشركين ، فالشرك منطبع في نفسها بالوراثة ، فالكفر قد أحاط بها بتغلغله في نفسها وبنشأتها عليه وبكونها بين قوم كافرين ، فمن أين يخلص إليها الهدى والإيمان . { كافرين\n\n",
      "translations": [
        {
          "translation": "(So, when she came, it was said (unto her)) Solomon said to her: (Is thy throne like this? She said: (It is) as though it were the very one. And (Solomon said): We were given the knowledge before her) Allah has given me [knowledge], by changing her throne and bringing to me, even before she arrived, (and we had surrendered (to Allah)) and we were sincere before she arrived.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فلما جاءت } مترقية إلى مقام القلب متنوّرة بأنواره\n متخلّقة بأخلاقه\n منقادة مستسلمة بجنودها { قيل أهكذا عرشك } أي: على هذه الصورة المغيرة عرشك أم على الصورة الأولى؟ أي: أهذا صورته المستوية التي ينبغي أن يكون عليها أم تلك\n وتلك منكوسة أم هذه { قالت كأنه هو } أي: كأنّ هذا بالنسبة إلى حالي هو بالنسبة إلى الحالة الأولى\n أي: إذا كنت متوجهة إلى جهة السفل كان عرشي على تلك الصورة مطابقاً لحالي { وأوتينا العلم } من قبل هذه الحالة\n أي: أوتيناه في الأزل عند ميثاق الفطرة { وكنا } منقادين قبل هذه النشأة إلا أننا نسينا فتذكرنا الساعة { وصدّها ما كانت تعبد } من شمس عقل المعاش بصرفها إلى التوحيد { إنها كانت من قوم } محجوبين عن الحق { قيل لها ادخلي الصرح } أي: مقام الصدر الذي هو صرح ممرّد مملس عن تقابل الأضداد وتخالف الطباع مستوياً بالتجرّد عن الموادّ من قوارير أنوار القلب الصافي المشبّه بالزجاجة في الصفاء والتنوّر { فلما رأته حسبته لجة } بحر الوحدة لكونه غاية رتبتها في التجرّد والترقي ونهاية كمالها في التداني والتلقي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا جَآءَتْ } بلقيس\n وهو في ذلك الصرح على السرير { قِيلَ } لها أولاً: { أَهَكَذَا عَرْشُكِ قَالَتْ } بعدما أمعنت نظرها نحو العرش: { كَأَنَّهُ هُوَ } أتت بكلمة التشبيه\n وقد تحقق عندها أنه هو\n صيانةً لنفسها عن الكذب { وَ } بعدما تفرست منه التصديق لقولها بادرت إلى تصديق نبوته\n فقالت: لا حاجة لا إلى اختبارك بأمثال هذه المعجزات حتى نؤمن لك\n إذ { أُوتِينَا } المتعلق منَّا بصدقك وتصديق نبوتك { ٱلْعِلْمَ مِن قَبْلِهَا } أي: قبل ظهور هذه المعجزة الخارقة للعادة بأمور اختبرناك بها { وَكُنَّا مُسْلِمِينَ } [النمل: 42] منقادين لك\n مسلمين نبوتك وتأييدك من قبل الحق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما جاءتْ } بلقيسُ سليمانَ عليه السلام\n وقد كان العرش بين يديه\n { قيل } من جهة سليمان\n أو بواسطة: { أهكذا عرشُكِ }؟ ولم يقل: أهذا عرشك لئلا يكون تلقيناً\n فيفوت ما هو المقصود من اختبار عقلها\n وقد قيل لسليمان – لما أراد تزوجها -: إن في عقلها شيئاً\n فاختبرها بذلك\n { قالت } - لما رأته -: { كأنه هو } فأجابت أحسن جواب\n فلم تقل: هو هو\n ولا: ليس به\n وذلك من رجاحة عقلها\n حيث لم تقل: هو هو مع علمها بحقيقة الحال\n ولِمَا شبّهوا عليها بقولهم: أهكذا عرشك شبهت عليهم بقولها: { كأنه هو } مع أنها علمت بعرشها حقيقة\n تلويحاً بما اعتراه بالتنكير من نوع مغايرة في الصفات مع اتحاد الذات\n ومراعاة لحسن الأدب في محاورته عليه السلام\n ولو قالوا: أهذا عرشك؟ لقالت: هو\n ثم قالت: { وأُوتينا العلم } بقدرة الله تعالى\n وبصحبة نبوتك { مِن قَبْلِها } من قَبل هذا الأمر\n أي: من قبل المعجزة التي شاهدنا الآن\n من أمر الهدهد\n وبما سمعناه من المنذر من الآيات الدالة على ذلك\n { وكُنا مسلمين } منقادين لك من ذلك الوقت\n وكأنها ظنت أنه أراد عليه السلام اختبار عقلها\n وإظهار المعجزة\n لتؤمن به\n فأظهرت أنها آمنت به قبل وصولها إليه\n أو قال سليمان: { وأُوتينا العلم } بالله تعالى وبكمال قدرته من قبل هذه الآية\n { وكنا مسلمين } موحدين\n أو: { وأُوتينا العلم } بإسلامها ومجيئها طائعةً { من قبل } مجيئها\n { وكنا مسلمين } موحّدين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:38",
      "similarity": 0.5261704571733606
    },
    {
      "verse": "27:26",
      "similarity": 0.43052584608469247
    },
    {
      "verse": "20:5",
      "similarity": 0.41754443993773827
    },
    {
      "verse": "17:42",
      "similarity": 0.40686938466246797
    },
    {
      "verse": "27:41",
      "similarity": 0.3763118569270782
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}