{
  "chapter": "النمل",
  "text": "قالوا۟ اطيرنا بك وبمن معك قال طئركم عند الله بل انتم قوم تفتنون",
  "translations": [
    {
      "translation": "They said, 'We see you, and those with you, as an evil omen.' He said, 'No, your evil omen is with Allah; you are merely a people undergoing a trial.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"You betoken evil, and those with you.\" (Saleh) replied: \"The evil you presage can only come from God. In reality you are a people under trial (for your own inauspiciousness).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We augur ill of you and those who are with you.\" Salih replied: \"Your augury is with Allah. The truth is that you are a people who are being tried.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We have an ill omen about you and your followers.\" Salih replied, God has made your ill fortune await you. You are a people on trial.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We consider you an evil omen, and your companions”; he said, “Your evil omen is with Allah – in fact you people have fallen into trial.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We augur an omen from you and those with you.\" He said: \"Your omen is of Allah; nay, but you are a people that are being tested.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: We have met with ill luck on account of you and on account of those with you. He said: The cause of your evil fortune is with Allah; nay, you are a people who are tried.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'We augur ill of thee and of those that are with thee.' He said, 'Your augury is with God; nay, but you are a people being proved.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: We augur evil of thee and those with thee. He said: Your evil augury is with Allah. Nay, but ye are folk that are being tested.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We see you and your followers as an evil omen.\" He replied, \"No, your evil omen is with God; the truth is that you are a people being put to the test.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: we augur ill of thee and of those who are with thee. He said: your augury is with Allah. Aye! ye are a people being tested.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘We take you and those who are with you for a bad omen.’ He said, ‘Your bad omens are from Allah. Indeed, you are a people being tested.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Ill omen do we augur from thee and those that are with thee\". He said: \"Your ill omen is with Allah; yea, ye are a people under trial.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We augur ill omen from you and those with you.\" He said: \"Your ill omen is with Allah; nay, but you are a people that are being tested.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'We predict an evil omen from you and those who are with you' He replied: 'Your prediction is with Allah, you are a nation being tested'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We consider you an ill omen, and those with you.” He said, “Your omen is with God. In fact, you are a people being tested.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We consider you a bad omen, you and those with you.\" He said, \"Your omen is with Allah. Rather, you are a people being tested.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:47] They said, ‘We augur evil (ittayyarnā is actually tatayyarnā, but the tā’ has been assimilated with the tā’, and a conjunctive hamza added) of you and of those who are with you’, namely, the believers — when they [the tribe of Thamūd] were deprived of rain and suffered hunger. He said, ‘Your evil augury is with God — He has given it to you; nay, but you are a people being tried’, being tested with good and evil [turns of fortune].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "430 (They said: We augur evil of thee and those with thee) they meant: the hardship that we face is due to your evil omen and the evil omen of those who believed in you. (He said) Salih said: (Your evil augury) your hardship as well as your comfort (is with Allah) are from Allah. (Nay, but ye are folk that are being tested) by hardship and comfort; it is also said that this means: you are forsaken rather than being given success.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱطَّيَّرْنَا بِكَ وَبِمَن مَّعَكَ } تشاءَ منا بِكَ وبِمن مَعَكَ\n\n\n\n\nوقوله تعالى: { بَلْ أَنتُمْ قَوْمٌ تُفْتَنُونَ } معناه تَبتلُونَ\n\n",
      "translations": [
        {
          "translation": " And His saying, {We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth.} [Fussilat 41:53] - He wills that we show them the signs in the horizons and within themselves.\n\n\nAnd His saying, \"Indeed, you are a people who are tried,\" means that you are being tested.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { اطيرنا بك } لمنعك إيانا من الحظوظ والترفه { طائركم عند الله } سبب خيركم وشرّكم من الله\n والرهط المفسدون الحواس: الغضب والشهوة والوهم والتخيل\n وتبييته: إهلاكه في ظلمة ليل النفس\n والوليّ: الروح\n ومكر الله بهم: إهلاكهم بهدّ جبال الأعضاء عليهم وتدميرهم في غارّ محلهم وتدمير قومهم بالصيحة التي هي النفخة الأولى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما ظهر عليهم أمارات قهر الله وغضبه إياهم ووقع الجدب بينهم { قَالُواْ } مغاضبين على صالح: { ٱطَّيَّرْنَا } أي: تطيرنا وتشاءمنا { بِكَ وَبِمَن مَّعَكَ } من المصدقين لك\n المتدينين بدينك\n إذ توارت علينا المصيبات مذ ظهرتم بدينكم هذا\n ووقعت الوقائع الهائلة بشؤمكم وحدوث دينكم\n وبعدما سمع منهم صالح ما سمع آيس عن إيمانهم وصلاحهم { قَالَ طَائِرُكُمْ } أي: سببكم الذي جاء منه شركم وخيركم { عِندَ ٱللَّهِ } وفي لوح قضائه وحضرة علمه\n كتب عليكم الخير والشر حسب ما صدر عنكم من الأعمال الصالحة والطالحة\n ولا معنى لتطيركم وتشاؤمكم بنا { بَلْ أَنتُمْ قَوْمٌ تُفْتَنُونَ } [النمل: 47] وتُخبرون بتفاقهم المحن\n وتلاطم أمواج الفتن\n كي تستغفروا وتندموا عما أنتم عليه من الكفر\n وتستأصلوا من الكفر والعصيان\n وتستأصلوا بنزول عذاب الله\n وبعدما سمعوا منه كلامه هذا قصدوا مقته وإهلاكه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا اطَّيَّرنا بك } تشاءمنا بك { وبمن معك } من المؤمنين لأنهم قُحِطوا عند مبعثه لكفرهم\n فنسبوه إلى مجيئه\n والأصل: تطيرنا\n وقرئ به\n فأدغمت التاء في الطاء\n وزيدت ألف وصل\n للسكون\n { قال } صالح عليه السلام: { طائِرُكُم عند الله } أي: سببكم الذي به ينالكم ما ينالكم من الخير والشر عند الله\n وهو قدره وقضاؤه\n أو: عملكم مكتوب عند الله\n فمنه نزل بكم ما نزل\n عقوبة لكم وفتنة\n ومنه:\n[الإسراء: 13] أي: ألزمناه جزاء عمله\n أو: ما قدر له في عنقه\n وأصله: أن المسافر كان إذا مرّ بطائر يزجره\n فإن مر إلى جهة اليمين تيمن\n وإن مر إلى ناحية الشمال تشاءم\n فلما نسبوا الخير والشر إلى الطائر استعير لما كان سببهما من قدر الله وقسمته\n أو: من عمل العبد الذي هو السبب في الرحمة والنقمة\n { بل أنتم قوم تُفتَنون }: تختبرون بتعاقب السراء والضراء\n أو: تعذبون\n أو: يفتنكم الشيطان بوسوسته إليكم الطيرة\n قال - عليه الصلاة والسلام -:\n \" لا عدوى ولا طِيَرة \" \nوقال أيضاً:\n \" إذا تطيرت فلا ترجع \" \nوالله تعالى أعلم\n الإشارة: سَير أهل التربية مع أهل زمانهم كسير الأنبياء مع أممهم\n إذا بعثهم الله إلى أهل زمانهم اختصموا فيهم\n ففريق يصدق وفريق يكذب\n فيطلبون الكرامة والبرهان\n ويتطيرون بهم وبمن تبعهم\n إن ظهرت بهم قهرية من عند الله\n كما رأينا ذلك كله\n وبالله التوفيق\n ثم ذكر اهتمامهم بقتل صالح وهلاكهم\n فقال: { وَكَانَ فِي ٱلْمَدِينَةِ تِسْعَةُ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:19",
      "similarity": 0.6001409307242431
    },
    {
      "verse": "7:131",
      "similarity": 0.47707891218199333
    },
    {
      "verse": "76:7",
      "similarity": 0.43439511110738876
    },
    {
      "verse": "38:19",
      "similarity": 0.39839031261370134
    },
    {
      "verse": "37:162",
      "similarity": 0.34817968024907364
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/27:47.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/27:47.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/27:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}