{
  "chapter": "النمل",
  "text": "قالوا۟ تقاسموا۟ بالله لنبيتنه واهله ثم لنقولن لوليه ما شهدنا مهلك اهله وانا لصدقون",
  "translations": [
    {
      "translation": "They said, 'Let us make an oath to one another by Allah that we will fall on him and his family in the night and then say to his protector, \"We did not witness the destruction of his family and we are telling the truth.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Let us swear by God that we will attack Saleh and his family at night, and later tell his heirs: 'We did not see his family destroyed, and we speak the truth.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Swear to one another in the name of Allah that we shall make a sudden night swoop on Salih and his family and will then tell their heirs that we did not witness the destruction of his family. We are indeed truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Let us swear by God to do away with him and his family during the night then tell his guardian that we did not see how he and his family had been destroyed, and we shall be telling the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Swearing by Allah they said to one another, “We will indeed attack him and his family at night, and then say to his heir, ‘We were not present at the time of slaying of this household, and indeed we are truthful.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Swear one to another by Allah that we shall make a secret night attack on him and his household, and thereafter we will surely say to his near relatives: `We witnessed not the destruction of his household, and verily, we are telling the truth.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Swear to each other by Allah that we will certainly make a sudden attack on him and his family by night, then we will say to his heir: We did not witness the destruction of his family, and we are most surely truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they said, 'Swear you, one to another, by God, \"We will attack him and his family by night, then we will tell his protector, We were not witnesses of the destruction of his family; and assuredly we are truthful men.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Swear one to another by Allah that we verily will attack him and his household by night, and afterward we will surely say unto his friend: We witnessed not the destruction of his household. And lo! we are truthtellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Let us bind ourselves by an oath sworn in the name of God that we shall attack Salih and his family by night, and to his protector [who demands retribution], we shall say, \"We were not present when they were slain. We are telling the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: swear one to anot her by God that we shall surely fall upon him and his household by night and thereafter we shall surely say unto his heir; We witnessed not the destruction of his household, and verily we are truthtellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Swear by Allah that we will attack him and his family by night. Then we will tell his heir that we were not present at the murder of his family and that we speak the truth.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Swear a mutual oath by Allah that we shall make a secret night attack on him and his people, and that we shall then say to his heir (when he seeks vengeance): 'We were not present at the slaughter of his people, and we are positively telling the truth.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Swear one to another by Allah that we shall make a secret night attack on him and his household, and afterwards we will surely say to his near relatives: 'We witnessed not the destruction of his household, and verily! We are telling the truth.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'Let us swear by Allah to attack him and his family at night, then we will tell his guardian we were not witnesses of the destruction of his family; and surely we are truthful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Swear by God to one another that we will attack him and his family by night, and then tell his guardian, 'We did not witness the murder of his family, and we are being truthful.'“\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Take a mutual oath by Allah that we will kill him by night, he and his family. Then we will say to his executor, 'We did not witness the destruction of his family, and indeed, we are truthful.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:49] They said, that is, some said to others, ‘Swear to one another by God that we will attack him by night (la-   nubayyitannahu; or [read] la-tubayyitunnahu, ‘that you will attack him by night’) together with his folk, that is, those who believed in him, in other words, [swear] that we will kill them at night; then we will surely say (la-naqūlanna; or [read] la-taqūlunna, ‘you surely will say’) to his heir, the avenger of his blood, that we did not witness, we were not present at, the destruction of his folk (read muhlika or mahlika, meaning ‘the destroying of them’ or ‘their death’ [respectively]), and so we do not know who killed them, and [that] indeed we are being truthful’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Swear one to another by Allah that we verily will attack him and his household by night) and kill them all, (and afterward we will surely say unto his friend) to his inheritors and relatives: (We witnessed not the destruction of his household) we did not witness the killing of Salih and his household. (And lo! we are truth tellers) they will believe us and no one will reject what we say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَقَاسَمُواْ بِٱللَّهِ } معناه تَحَالفُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {They have taken their oaths by Allah} means they have allied themselves with Allah.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n حيث { قَالُواْ } في ما بينهم: { تَقَاسَمُواْ بِٱللَّهِ } بأن حلف كل منكم عند صاحبه { لَنُبَيِّتَنَّهُ وَأَهْلَهُ } ونهلكنَّه قبل إلمام العذاب علينا { ثُمَّ لَنَقُولَنَّ لِوَلِيِّهِ } عند طلب ثأره مبالغين في الإنكار: { مَا شَهِدْنَا } في مدة عمرنا { مَهْلِكَ أَهْلِهِ } أي: المكان الذي أهلك فيه صالح\n فكيف قتلنا إياه؟! { وَ } نؤكد قولنا هذا بالقسم أيضاً عند وليه\n ونقسم { إِنَّا لَصَادِقُونَ } [النمل: 49] في قولنا هذا\n وما لنا علم بأهلاكه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا تقاسموا بالله }: استئناف لبيان بعض فسادهم\n وتقاسموا: إما أمر مقول لقالوا\n أي: تحالفوا أمر بعضهم بعضاً بالقسم على قتله\n وإما خبر حال\n أي: قالوا متقاسمين\n { لنُبَيِّتَنَّهُ }: لنقتلنه بياتاً\n أي: ليلاً\n { وأهلَه }: ولده ونساءه\n { ثم لنقولن لِوَلِيِّه } أي: لوليّ دمه: { ما شَهِدْنا مَهْلِكَ أهله } أي: ما حضرنا هلاكهم\n أو: وقت هلاكهم\n أو: مكانه فضلاً أن نتولى إهلاكهم\n { وإِنا لصادقون } فيما ذكرناه\n وهو إما من تمام المقول\n أو: حال\n أي: نقول ما نقول والحال أنا صادقون في ذلك لأن الشاهد للشيء غير المباشر له عرفاً\n ولأنا ما شهدنا مهلك أهله وحده\n بل مهلكه ومهلككم جميعاً\n كقولك: ما رأيت ثمَّ رجلاً\n أي: بل رجلين\n ولعل تحرجهم من الكذب في الأَيْمان مع كفرهم لِما تعودوا من تعجيل العقوبة للكاذب في القسامة كما كان أهل الشرك مع البيت الحرام في الجاهلية\n وكان تقاسمهم بعد أن أنذرهم بالعذاب\n وبعد قوله:\n[هود: 65]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:1",
      "similarity": 0.4530911989339538
    },
    {
      "verse": "69:38",
      "similarity": 0.44823105373760813
    },
    {
      "verse": "51:4",
      "similarity": 0.44698249013752384
    },
    {
      "verse": "15:90",
      "similarity": 0.44207807212835326
    },
    {
      "verse": "56:76",
      "similarity": 0.4309498863481707
    }
  ]
}