{
  "chapter": "النمل",
  "text": "فلما جاءت قيل اهكذا عرشك قالت كانه هو واوتينا العلم من قبلها وكنا مسلمين",
  "translations": [
    {
      "translation": "Then when she came, she was asked, 'Is your throne like this?' She said, 'It is exactly like it.' 'We were given knowledge before her and were already Muslims,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she arrived, they asked her: \"Is your throne like this?\" She said: \"As though this is it. We had come to have knowledge and already submitted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Queen arrived, she was asked: \"Is your throne like this one?\" She said: \"It seems as if it is the same. We had already come to know this and we had submitted ourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she came she was asked, \"Is your throne like this?\" She replied, \"It seems that this is it. We had received the knowledge before this and were submissive (to Solomon's power)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when she came, it was said to her, “Is your throne like this? She said, “As if this is it! And we came to know about this incident beforehand and submit (to you).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she came, it was said, \"Is your throne like this\" She said: \"As though it were the very same.\" And he said, \"Knowledge was bestowed on us before her, and we had submitted to Allah (as Muslims).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she came, it was said: Is your throne like this? She said: It is as it were the same, and we were given the knowledge before it, and we were submissive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when she came, it was said, 'Is thy throne like this?' She said, 'It seems the same.' 'And we were given the knowledge before her, and we were in surrender,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when she came, it was said (unto her): Is thy throne like this? She said: (It is) as though it were the very one. And (Solomon said): We were given the knowledge before her and we had surrendered (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she came to Solomon, she was asked, \"Is your throne like this?\" She replied, \"It looks as though it were the same, and we had been given knowledge [of your power] before this, and we have already submitted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when she arrived, it was said: is thy throne like unto? She said: it is as though it were it; and we have been vouchsafed the knowledge before this, and we have been Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she came, it was said [to her], ‘Is your throne like this one?’ She said, ‘It seems to be the same, and we were informed before it, and we had submitted.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she arrived, she was asked, \"Is this thy throne?\" She said, \"It was just like this; and knowledge was bestowed on us in advance of this, and we have submitted to Allah (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she came, it was said (to her): \"Is your throne like this?\" She said: \"(It is) as though it were the very same.\" And [Sulaiman (Solomon) said]: \"Knowledge was bestowed on us before her, and we were submitted to Allah (in Islam as Muslims before her).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when she came she was asked: 'Is your throne like this' And she replied: 'It looks like it' And we were given the knowledge before her, and wereMuslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When she arrived, it was said, “Is your throne like this?” She said, “As if this is it.” “We were given knowledge before her, and we were submissive.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when she arrived, it was said [to her], \"Is your throne like this?\" She said, \"[It is] as though it was it.\" [Solomon said], \"And we were given knowledge before her, and we have been Muslims [in submission to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:42] So when she came, it was said, to her: ‘Is your throne like this?’ She said, ‘It as though it is the one’. She   had, in fact, recognised it; but she made a pretence to them just as they made a pretence to her, given that [when she was asked about the throne] it was not said, ‘Is this your throne?’, for had it been so, she would have replied, ‘Yes, it is’. When Solomon realised that she was perceptive and knowledgeable, he said: ‘And we were given the knowledge before her and we had submitted [to God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So, when she came, it was said (unto her)) Solomon said to her: (Is thy throne like this? She said: (It is) as though it were the very one. And (Solomon said): We were given the knowledge before her) Allah has given me [knowledge], by changing her throne and bringing to me, even before she arrived, (and we had surrendered (to Allah)) and we were sincere before she arrived.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا جَآءَتْ } بلقيس، وهو في ذلك الصرح على السرير { قِيلَ } لها أولاً: { أَهَكَذَا عَرْشُكِ قَالَتْ } بعدما أمعنت نظرها نحو العرش: { كَأَنَّهُ هُوَ } أتت بكلمة التشبيه، وقد تحقق عندها أنه هو؛ صيانةً لنفسها عن الكذب { وَ } بعدما تفرست منه التصديق لقولها بادرت إلى تصديق نبوته، فقالت: لا حاجة لا إلى اختبارك بأمثال هذه المعجزات حتى نؤمن لك؛ إذ { أُوتِينَا } المتعلق منَّا بصدقك وتصديق نبوتك { ٱلْعِلْمَ مِن قَبْلِهَا } أي: قبل ظهور هذه المعجزة الخارقة للعادة بأمور اختبرناك بها { وَكُنَّا مُسْلِمِينَ } [النمل: 42] منقادين لك، مسلمين نبوتك وتأييدك من قبل الحق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما جاءتْ } بلقيسُ سليمانَ عليه السلام، وقد كان العرش بين يديه، { قيل } من جهة سليمان، أو بواسطة: { أهكذا عرشُكِ }؟ ولم يقل: أهذا عرشك لئلا يكون تلقيناً، فيفوت ما هو المقصود من اختبار عقلها، وقد قيل لسليمان – لما أراد تزوجها -: إن في عقلها شيئاً، فاختبرها بذلك\n { قالت } - لما رأته -: { كأنه هو } فأجابت أحسن جواب، فلم تقل: هو هو، ولا: ليس به، وذلك من رجاحة عقلها، حيث لم تقل: هو هو مع علمها بحقيقة الحال، ولِمَا شبّهوا عليها بقولهم: أهكذا عرشك شبهت عليهم بقولها: { كأنه هو } مع أنها علمت بعرشها حقيقة، تلويحاً بما اعتراه بالتنكير من نوع مغايرة في الصفات مع اتحاد الذات، ومراعاة لحسن الأدب في محاورته عليه السلام\n ولو قالوا: أهذا عرشك؟ لقالت: هو\n ثم قالت: { وأُوتينا العلم } بقدرة الله تعالى، وبصحبة نبوتك { مِن قَبْلِها } من قَبل هذا الأمر، أي: من قبل المعجزة التي شاهدنا الآن، من أمر الهدهد، وبما سمعناه من المنذر من الآيات الدالة على ذلك، { وكُنا مسلمين } منقادين لك من ذلك الوقت، وكأنها ظنت أنه أراد عليه السلام اختبار عقلها، وإظهار المعجزة، لتؤمن به\n فأظهرت أنها آمنت به قبل وصولها إليه\n أو قال سليمان: { وأُوتينا العلم } بالله تعالى وبكمال قدرته من قبل هذه الآية، { وكنا مسلمين } موحدين، أو: { وأُوتينا العلم } بإسلامها ومجيئها طائعةً { من قبل } مجيئها، { وكنا مسلمين } موحّدين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:38",
      "similarity": 0.5261704571733606
    },
    {
      "verse": "27:26",
      "similarity": 0.43052584608469247
    },
    {
      "verse": "20:5",
      "similarity": 0.41754443993773827
    },
    {
      "verse": "17:42",
      "similarity": 0.40686938466246797
    },
    {
      "verse": "27:41",
      "similarity": 0.3763118569270782
    }
  ]
}