{
  "chapter": "النمل",
  "text": "قل الحمد لله وسلم على عباده الذين اصطفى ءالله خير اما يشركون",
  "translations": [
    {
      "translation": "Say: 'Praise be to Allah and peace be upon His slaves whom He has chosen.' Is Allah better, or what you associate with Him?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"All praise be to God, and peace on those of His creatures whom He has chosen.\" Is God better or those they associate with Him --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, (O Muhammad): \"All praise be to Allah, and peace be on those of His servants whom He has chosen.\" (Ask them): \"Who is better: Allah or the false gods that they associate with Him as His partners?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"It is only God who deserves all praise. Peace be upon His chosen servants. Which is better God or the idols?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “All praise is to Allah, and peace upon His chosen bondmen; is Allah better or what you ascribe as His partners?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Praise and thanks be to Allah, and peace be on His servants whom He has chosen! Is Allah better, or what they ascribe as partners\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Praise be to Allah and peace on His servants whom He has chosen: is Allah better, or what they associate (with Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Praise belongs to God, and peace be on His servants whom He has chosen.' What, is God better, or that they associate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): Praise be to Allah, and peace be on His slaves whom He hath chosen! Is Allah best, or (all) that ye ascribe as partners (unto Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"All praise be to God, and peace be upon those servants of His whom He has chosen. Is God better, or what they associate with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: All praise unto Allah, and peace upon His bondmen whom He hath Chosen! Is Allah best, or that which they associate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘All praise belongs to Allah, and Peace be to the servants whom He has chosen.’ Is Allah better, or the partners they ascribe [to Him]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Praise be to Allah, and Peace on his servants whom He has chosen (for his Message). (Who) is better?- Allah or the false gods they associate (with Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Praise and thanks be to Allah, and peace be on His slaves whom He has chosen (for His Message)! Is Allah better, or (all) that you ascribe as partners (to Him)?\" (Of course, Allah is Better).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Praise belongs to Allah and peace be upon His worshipers whom He has chosen' Who is more worthier, Allah or that which they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Praise God, and peace be upon His servants whom He has selected. Is God better, or what they associate?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"Praise be to Allah, and peace upon His servants whom He has chosen. Is Allah better or what they associate with Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:59] Say, O Muhammad (s): ‘Praise be to God, for the destruction of the disbelievers of past communities, and peace be on His servants whom He has chosen’. Is God (read a-Allāhu, pronouncing both hamzas; or by substituting an alif for the second one; or by not pronouncing the second one but inserting an alif between the one not pronounced and the other one or without [such an insertion]) better, for those who worship Him, or the partners which they ascribe? (read [either] tushrikūna, ‘you ascribe’, or yushrikūna, ‘they ascribe’), [they being] the people of Mecca, [the partners they ascribe] to Him, in other words, are such gods better for those who worship them?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلِ الْحَمْدُ لِلَّهِ وَسَلَامٌ عَلَى عِبَادِهِ الَّذِينَ اصْطَفَى آَللَّهُ خَيْرٌ أَمَّا يُشْرِكُونَ (59){ المنذرين \\* قُلِ الحمد لِلَّهِ وسلام على عِبَادِهِ }لما استوفى غرض الاعتبار والإنذار حقه بذكر عواقب بعض الأمم التي كذبت الرسل وهي أشبه أحوالاً بأحوال المكذبين بمحمد صلى الله عليه وسلم وبالكتاب الذي أنزل عليه ، وفي خلال ذلك وحَفَافيه تسلية النبي صلى الله عليه وسلم على ما يلقاه من قومه أقبل الله بالخطاب إلى الرسول صلى الله عليه وسلم يلقنه ماذا يقوله عقب القصص والمواعظ السالفة استخلاصاً واستنتاجاً منها ، وشكر الله على المقصود منها .فالكلام استئناف والمناسبة ما علمت . أمر الرسول بالحمد على ما احتوت عليه القصص السابقة من نجاة الرسل من العذاب الحال بقومهم وعلى ما أعقبهم الله على صبرهم من النصر ورفعة الدرجات . وعلى أن أهلك الأعداء الظالمين كقوله { فقطع دابر القوم الذين ظلموا والحمد لله رب العالمين } \\[ الأنعام : 45 \\] ونظيره قوله في سورة العنكبوت ( 63 ) { قل الحمد لله بل أكثرهم لا يعقلون } وقوله في آخر هذه السورة ( 93 ) { وقل الحمد لله سيريكم } الآية . فأمر الرسول بحمد الله على ذلك باعتبار ما أفاده سوق تلك القصص من الإيماء إلى وعد الرسول بالنصر على أعدائه . فقوله قل الحمد لله } أمر للرسول صلى الله عليه وسلم بإنشاء حمد الله . وقد تقدمت صيغة الحمد في أول الفاتحة .وعطف على المأمور بأن يقوله من الحمد أمر بأن يتبعه بالسلام على الرسل الذين سبقوه قدراً لقدر ما تجشموه في نشر الدين الحق .وأصل { سلام } سلمت سلاماً ، مقصود منه الإنشاء فحذف الفعل وأقيم مفعوله المطلق بدلاً عنه . وعدل عن نصب المفعول المطلق إلى تصييره مبتدأ مرفوعا للدلالة على الثبات والدوام كما تقدم عند قوله { الحمد لله } في أول سورة الفاتحة ( 2 ) .والسلام في الأصل اسم يقوله القائل لمن يلاقيه بلفظ : سلام عليك ، أو السلام عليك . ومعناه سلامة وأمنٌ ثابت لك لا نكول فيه ، لما تؤذن به ( على ) من الاستعلاء المجازي المراد به التمكن كما في { أولئك على هدى من ربهم } \\[ البقرة : 5 \\] .وأصل المقصود منه هو التأمين عند اللقاء إذ قد تكون بين المتلاقين إحَن أو يكون من أحدهما إغراء بالآخر ، فكان لفظ ( السلام عليك ) كالعهد بالأمان . ثم لما كانت المفاتحة بذلك تدل على الابتداء بالإكرام والتلطف عند اللقاء ونية الإعانة والقرى ، شاع إطلاق كلمة : السلام عليك ، ونحوها عند قصد الإعراب عن التلطف والتكريم وتنوسي ما فيها من معنى بذل الأمن والسلامة ، فصار الناس يتقاولونها في غير مظان الريبة والمخافة فشاعت في العرب في أحيائهم وبيوتهم وصارت بمنزلة الدعاء الذي هو إعراب عن إضمار الخير للمدعو له بالسلامة في حياته . فلذلك قال تعالى { فإذا دخلتم بيوتاً فسلموا على أنفسكم تحية من عند الله مباركة طيبة } كما تقدم في سورة النور ( 61 ) وصار قول : السلام ، بمنزلة قول : حياك الله ، ولكنهم خصُّوا كلمة : ( حياك الله ) بملوكهم وعظمائهم فانتقلت كلمة ( السلام عليكم ) بهذا إلى طور آخر من أطوار استعمالها من عهد الجاهلية وقد قيل إنها كانت تحية للبشر من عهد آدم .ثم ذكر القرآن السلام من عند الله تعالى على معنى كونه معاملة منه سبحانه بكرامة الثناء وحسن الذكر للذين رضي الله عنهم من عباده في الدنيا كقوله حكاية عن عيسى إذ أنطقه بقوله { والسلام علي يوم ولدت ويوم أموت } \\[ مريم : 33 \\] . وكذلك في الآخرة وما في معناها من أحوال الأرواح بعد الموت كقوله عن عيسى { ويوم أبعث حياً } \\[ مريم : 33 \\] ، وقوله عن أهل الجنة { لهم فيها فاكهة ولهم ما يدعون سلام قولاً من رب رحيم } \\[ يس : 57 ، 58 \\] .وجاء في القرآن السلام على خمسة من الأنبياء في سورة الصافات . وأيضاً أمر الله الأمة بالسلام على رسولها فقال { يأ أيها الذين ءامنوا صلوا عليه وسلموا تسليماً } \\[ الأحزاب : 56 \\] أي قولوا : السلام عليك أيها النبي لأن مادة التفعيل قد يُؤتى بها للدلالة على قول منحوب من صيغة التفعيل ، فقوله : { سلّموا تسليماً معناه : قولوا كلمة السلام . مثل بسمل ، إذا قال : بسم الله ، وكبر ، إذا قال : الله أكبر . وفي الحديث تسبحون وتحمدون وتكبرون دبر كل صلاة ثلاثاً وثلاثين .ومعنى وسلام على عباده الذين اصطفى } إنشاء طلب من الله أن يسلم على أحد المصطفين ، أي أن يجعل لهم ذكراً حسناً في الملأ الأعلى .فإذا قال القائل : السلام على فلان؛ وفلان غائب أو في حكم الغائب كان ذلك قرينة على أن المقصود الدعاء له بسلام من الله عليه . فقد أزيل منه معنى التحية لا محالة وتعين للدعاء ، ولهذا نهى النبي صلى الله عليه وسلم المسلمين . عن أن يقولوا في التشهد : السلام على الله السلام على النبي السلام على فلان وفلان . فقال لهم \" إن الله هو السلام \" أي لا معنى للسلام على الله في مقام الدعاء لأن الله هو المدعو بأن يسلم على من يطلب له ذلك .فلما أمر تعالى في هذه السورة رسوله صلى الله عليه وسلم أن يقول { سلام على عباده الذين اصطفى } فقد عيّن له هذه الجملة ليقولها يسأل من الله أن يكرم عباده الذين اصطفى بالثناء عليهم في الملأ الأعلى وحسن الذكر ، إذ قصارى ما يستطيعه الحاضر من جزاء الغائب على حسن صنيعه أن يبتهل إلى الله أن ينفحه بالكرامة .والعباد الذين اصطفاهم الله في مقدمتهم الرسل والأنبياء ويشمل ذلك الصالحين من عباده كما في صيغة التشهد : «السلام علينا وعلى عباد الله الصالحين» . وسيأتي الكلام على التسليم على النبي صلى الله عليه وسلم في سورة الأحزاب .{ اصطفى ءَآللَّهُ خَيْرٌ أَمَّا }4 هذا مما أمر الرسول عليه الصلاة والسلام أن يقوله فأمر أن يقول : { الحمد لله وسلام على عباده الذين اصطفى } تمهيداً لقوله : { آللَّه خير أما تشركون } لأن العباد الذين اصطفاهم الله جاؤوا كلهم بحاصل هذه الجملة .وأمر أن يشرع في الاستدلال على مسامع المشركين فيقول لهم هذا الكلام ، بقرينة قوله { أما تشركون } بصيغة الخطاب في قراءة الجمهور ، ولأن المناسب للاستفهام أن يكون موجهاً إلى الذين أشركوا بالله ما لا يخلق ولا يرزق ولا يفيض النعم ولا يستجيب الدعاء ، فليس هذا لقصد إثبات التوحيد للمسلمين .والاستفهام مستعمل في الإلجاء وإلزام المخاطب بالإقرار بالحق وتنبيهه على خطئه . وهذا دليل إجمالي يقصد به ابتداء النظر في التحقيق بالإلهية والعبادة . فهذا من قبيل ما قال الباقلاني وإمام الحرمين وابن فورك إن أول الواجبات أول النظر أو القصد إلى النظر ثم تأتي بعده الأدلة التفصيلية ، وقد ناسب إجماله أنه دليل جامع لما يأتي من التفاصيل فلذلك جيء فيه بالاسم الجامع لمعاني الصفات كلها ، وهو اسم الجلالة . فقيل : { آللَّه خير } . وجيء فيما بعد بالاسم الموصول لما في صلاته من الصفات .وجاء { خير } بصيغة التفضيل لقصد مجاراة معتقدهم أن أصنامهم شركاء الله في الإلهية بحيث كان لهم حظ وافر من الخير في زعمهم ، فعبّر ب { خير } لإيهام أن المقام لإظهار رجحان إلهية الله تعالى على أصنامهم استدراجاً لهم في التنبيه على الخطأ مع التهكم بهم إذ آثروا عبادة الأصنام على عبادة الله . والعاقل لا يؤثر شيئاً على شيء إلا لداع يدعو إلى إيثاره ، ففي هذا الاستفهام عن الأفضل في الخير تنبيه لهم على الخطأ المفرط والجهل المورط لتنفتح بصائرهم إلى الحق إن أرادوا اهتداء . والمعنى : ءالله الحقيق بالإلهية أم ما تشركونهم معه .والاستفهام على حقيقته بقرينة وجود { أم } المعادلة للهمزة فإن التهكم يبنى على الاستعمال الحقيقي .وهذا الكلام كالمقدمة للأدلة الآتية جميعها على هذا الدليل الإجمالي كما ستعلمه . .وقرأ الجمهور { تشركون } بتاء الخطاب . وقرأه أبو عمرو وعاصم ويعقوب بياء الغيبة فيكون القول الذي أمر به النبي صلى الله عليه وسلم محكياً بالمعنى روعي فيه غيبة المشركين في مقام الخطاب بالأمر .و { ما } موصولة والعائد محذوف . والتقدير : ما يشركونها إياه ، أي أصنامكم .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad: (Praise be to Allah) thanks and gratitude to Allah for their destruction, (and peace) happiness and safety (be on His slaves whom He hath chosen!) whom He selected for prophethood; it is also said that this means: Allah selected them for Islam, and these are the community of Muhammad (pbuh) (Is Allah best) say, Muhammad, to the people of Mecca: is the worship of Allah better, (or (all) that ye ascribe as partners (unto Him)) or the worship of the idols which they associate with Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوقال سبحانه: { قُلِ } يا أكمل الرسل بعدما تلونا عليك بعض فضائل إخوانك تحميداً علينا من قبلهم\n وتسليماً منَّا إياهم: { ٱلْحَمْدُ } والثناء الكامل اللائق { لِلَّهِ } الواحد الأحد\n الحقيق بجميع المحامد والأثنية الصادرة عن ألسنة عموم من رش عليهم رشحات بحر وجوده\n وامتد عليهم أضلال أسمائه وصفاته بمقتضى وجوده { وَسَلاَمٌ } من سبحانه ورحمة نازلة على التواتر والتوالي { عَلَىٰ عِبَادِهِ ٱلَّذِينَ ٱصْطَفَىٰ } واختارهم من بين البرايا التائهين في بيداء الغفلة والضلال\n وتكميل الناقصين المنحطين عن رتبة الخلافة والنيابة بميلهم إلى قاذورات الدنيا العائقة عن الوصول إلى در الخلافة التي هي التوحيد المسقط لتوهم الإضافات مطلقاً\n\nقل يا أكمل الرسل بعدما ظهر الحق مستفهماً\n مقرعاً للمشركين المتخذين غير الله إلهاً جهلاً وعناداً: { ءَآللَّهُ } الواحد الأحد\n القادر المتقدر\n المدبر لأجله من معرفة مبدئه ومعاده { خَيْرٌ أَمَّا يُشْرِكُونَ } [النمل: 59] له عناداً ومكابرةً من الأظلال الهالكة في أنفسها\n المجبورة تحت قهر الله وقدرته الكاملة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: لنبيه - عليه الصلاة والسلام-: { قل الحمدُ لله } على ما أنعم به عليك من فنون النعم\n ومن جملتها: اطلاعك على أسرار علم غيوبه\n { وسلامٌ على عباده الذين اصطفى } لرسالته\n وقال ابن عباس وسفيان: هم أصحاب محمد صلى الله عليه وسلم\n اصطفاهم بصحبته - عليه الصلاة والسلام - وقال الكلبي: هم أمة محمد صلى الله عليه وسلم\n اصطفاهم الله لمعرفته وطاعته\n ثم قل لهم إلزاماً للحجة: { الله خير أما تشركون } أي: آلله الذي ذكرت شؤونه العظيمة خير\n أم ما تشركونه معه تعالى من الأصنام؟ ومرجع الترديد إلى التعرض بتبكيت الكفرة\n وتسفيه آرائهم الركيكة\n والتهكم بهم\n إذ من البيِّن أن ليس فيما أشركوه به تعالى شائبة خير\n حتى يمكن أن يوازن بينه وبين من لا خير إلا خيره\n ولا إله غيره\n وكان عليه الصلاة والسلام إذا قرأها قال:\n \" بلِ الله خيْرٌ\n وأَبْقَى\n وأجلُّ\n وأكْرَم \"\n \nثم عدَّد سبحانه الخيرات والمنافع\n الدالة على انفراده بالخيرية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:47",
      "similarity": 0.7210889069283289
    },
    {
      "verse": "37:153",
      "similarity": 0.6972115267483899
    },
    {
      "verse": "43:16",
      "similarity": 0.6970831955026598
    },
    {
      "verse": "22:75",
      "similarity": 0.6209247943934006
    },
    {
      "verse": "7:144",
      "similarity": 0.5503254989153387
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027059.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027059.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:59.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}