{
  "chapter": "النمل",
  "text": "فما كان جواب قومه الا ان قالوا۟ اخرجوا۟ ءال لوط من قريتكم انهم اناس يتطهرون",
  "translations": [
    {
      "translation": "the only response of his people was to say: 'Drive the family of Lut out of your city! They are people who keep themselves pure!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people had no answer except saying: \"Expel the family of Lot from your city. They are a people who would (rather) be pure!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But this had only one answer from his people. They said: \"Expel Lot's folk from your city. They pretend to be absolutely clean.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people had no answer but to say, \"Expel Lot and his family from the town for they want to be pure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore the answer of his people was nothing except that they said, “Expel the family of Lut from your township; these people wish purity!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was no other answer given by his people except that they said: \"Drive out the family of Lut from your city. Verily, these are men who want to be clean and pure!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the answer of his people was no other except that they ~s said: Turn out Lut's followers from your town; surely they are a people who would keep pure!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the only answer of his people was that they said, 'Expel the folk of Lot from your city; they are men that keep themselves clean!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the answer of his folk was naught save that they said: Expel the household of Lot from your township, for they (forsooth) are folk who would keep clean!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only answer of his people was, \"Drive out Lot and his family from the city. They are a people who make themselves out to be pure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there was no answer of his people save that they said: drive forth the family of Lut from your City, verily they are a people who would be pure!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the only answer of his people was that they said, ‘Expel Lot’s family from your town! They are indeed a puritanical lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But his people gave no other answer but this: they said, \"Drive out the followers of Lut from your city: these are indeed men who want to be clean and pure!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was no other answer given by his people except that they said: \"Drive out the family of Lout (Lot) from your city. Verily, these are men who want to be clean and pure!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet the only answer of his nation was that they said: 'Expel the family of Lot from your village, they are people who purified themselves'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the only response of his people was to say, “Expel the family of Lot from your town. They are purist people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the answer of his people was not except that they said, \"Expel the family of Lot from your city. Indeed, they are people who keep themselves pure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:56] But the only response of his people was that they said, ‘Expel Lot’s family from your town. They are indeed a folk who [prefer to] remain pure!’, from [coming unto] the rears of men.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But the answer of his folk was naught save that they said: Expel the household of Lot) Lot and his two daughters: Za'ura and Raytha (from your township) Sodom, (for they (forsooth) are folk who would keep clean) they exonerate themselves from sodomy! 431\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أُنَاسٌ يَتَطَهَّرُونَ } معناهُ من أَدبارِ الرِّجالِ والنِّساءِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"People who purify themselves\" - its meaning is from the backs of men and women.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَمَا كَانَ جَوَابَ قَوْمِهِ } بعدما سمعوا منه أنواع الشتنيعات والتقريعات { إِلاَّ أَن قَالُوۤاْ } من فرط انهماكهم في الغي والضلال\n ونهاية عمههم وسكرتهم في رق شهواتهم ولذاتهم البهيمية متشاورين بينهم\n متقاولين: { أَخْرِجُوۤاْ آلَ لُوطٍ مِّن قَرْيَتِكُمْ إِنَّهمْ أُنَاسٌ يَتَطَهَّرُونَ } [النمل: 56] عن أفعالنا ويتنزهون\n ولا مناسبة بيننا وبينهم\n فلهم أن يخرجوا من بيننا\n حتى لا يتلوثوا بأفعالنا ويتنزهون\n ولا مناسبة بيننا وبينهم\n فلهم أن يخرجوا من بيننا\n حتى لا يتلوثوا بأفعالنا\n إنما قالوا هكذا تهكماً واستهزاءً\n\n\nثمَّ لمَّا استحقوا نزول العذاب والإهلاك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فما كان جوابَ قومه } حين نهاهم عن تلك الفاحشة ودعاهم إلى الله، { إلا أن قالوا أَخْرِجوا آلَ لوط } أي: لوطاً ومتبعيه { من قريتكم إنهم أُناس يتطهرون } يتنزهون عن أفعالنا، أو: عن القاذورات، ويعدون فعلنا قذراً\n وعن ابن عباس: إنه استهزاء، كقوله:\n\n[هود: 87]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:82",
      "similarity": 0.8102468094385753
    },
    {
      "verse": "15:61",
      "similarity": 0.45177850837241623
    },
    {
      "verse": "15:59",
      "similarity": 0.4454220081559215
    },
    {
      "verse": "26:167",
      "similarity": 0.41632452277920434
    },
    {
      "verse": "37:133",
      "similarity": 0.4091468545258227
    }
  ]
}