{
  "chapter": "النمل",
  "text": "ائنكم لتاتون الرجال شهوة من دون النساء بل انتم قوم تجهلون",
  "translations": [
    {
      "translation": "Do you come with lust to men instead of women? You are a people who are deeply ignorant.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You lust after men in place of women. You are indeed a stolid people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you lustfully approach men instead of women? Nay, you engage in acts of sheer ignorance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you have carnal relations with men rather than women? You are ignorant people\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“What! You lustfully go towards men, leaving the women?! In fact, you are an ignorant people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you practice your lusts on men instead of women Nay, but you are a people who behave senselessly.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! do you indeed approach men lustfully rather than women? Nay, you are a people who act ignorantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do you approach men lustfully instead of women? No, you are a people that are ignorant.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Must ye needs lust after men instead of women? Nay, but ye are folk who act senselessly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Must you go lustfully to men instead of women? Indeed, you are a people who are deeply ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would ye go in lustfully unto men instead of women? Aye! ye are a people addicted to ignorant ways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you approach men with [sexual] desire instead of women?! Indeed, you are a senseless lot!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would ye really approach men in your lusts rather than women? Nay, ye are a people (grossly) ignorant!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you approach men in your lusts rather than women? Nay, but you are a people who behave senselessly.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you approach men lustfully instead of women! No, you are an ignorant nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you lust after men instead of women? You are truly ignorant people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you indeed approach men with desire instead of women? Rather, you are a people behaving ignorantly.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:55] What! Do you (read a-innakum, pronouncing both hamzas, or by not pronouncing the second and inserting an alif between the two in both cases) come unto men in lust instead of women? Nay, but you are truly a people in ignorance’, of the consequence of your action.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Must ye needs lust after men instead of women? Nay, but ye are folk who act senselessly) you are folk who ignore Allah's command.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَإِنَّكُمْ } أيها المسرفون المتسعبدون للشهوة { لَتَأْتُونَ ٱلرِّجَالَ } الذين هم مثلكم في الرجولية { شَهْوَةً مِّن دُونِ ٱلنِّسَآءِ } مع أن الحكمة الإلهية تقتضي إيتاءهن للتناسل وبقاء النوع كسائر أنواع الحيوان\n وهؤلاء مع جهلهم لا يخرجون عن مقتضى الحكمة\n وأنتم أيها الحمقى مع أنكم مجبولون على العقل الفطري المميِّز بين الذمائم من الأخلاق والأطوار وحميدتها\n تخرجون من مقتضاها { بَلْ أَنتُمْ } بفعلتكم هذه { قَوْمٌ تَجْهَلُونَ } [النمل: 55] منسلخون عن مقتضى العقل الإدراك المميِّز للإنسان عن سائر الحيوان\n بل أسوأ حالاً من الحيوانات العجم\n إذ لا يتأتى منها أمثال هذا إلا من الحمار الأرذل الأنزل\n انظروا ما هو شريككم في فعلتكم هذا أيها الحمقى المسرفون المفرطون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nوقال الفخر: لا تصدر المعصية من العالم قط وهو عالم، وحين صدورها منه هو جاهل لأنه رجح المرجوح وترجيح المرجوح جهل، ولذلك قال: { بل أنتم قوم تجهلون }\n هـ\n وفي الحديث:\n\n \" لا يَزني الزاني حين يزني وهو مؤمن \" \n\nإذ لو صدّق بإطلاع الحق عليه ما قدر على الزنى، لكنه جهل ذلك\n و { تُبصرون } ، من: بصر القلب\n وقيل: يُبصر بعضُكم بعضاً لأنهم كانوا يرتكبونها في ناديهم، معلنين بها، لا يستتر بعضهم من بعض، مَجانةً وانهماكاً في المعصية، أو: تُبصرون آثار العصاة قبلكم، وما نزل بهم\n { أئنكم لتَأْتون الرجالَ شهوةً } أي: للشهوة { من دون النساء } أي: إن الله تعالى إنما خلق الأنثى للذكر، ولم يخلق الذكر للذكر، ولا الأنثى للأنثى، فهي مضادة للهِ تعالى في حكمته، فلذلك كانت أشنع المعاصي، { بل أنتم قوم تجهلون } تفعلون فعل الجاهلين بقُبحها، أو: تجهلون العاقبة\n أو: بمعنى السفاهة والمجون، أي: بل أنتم سُفهاء ماجنون\n والتاء فيه - مع كونه صفة لقوم لكونهم في حيز الخطاب\n وكذا قوله:\n\n[النمل: 47]، غلّب الخطاب على الغيبة\n قال ابن عرفة: \" بل \" للانتقال، والانتقال في باب الذم إنما يكون عن أمر خفيف إلى ما هو أشد منه، وتقرير الأشدّية هنا: أن المضروب عنه راجع للقوة الحسية العملية، وهي منقطعة تنقضي بانقضاء ذلك الفعل والثاني راجع للقوة العلمية وهي دائمة لأن العلم بالشيء دائم، والعمل به منقطع غير دائم\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:81",
      "similarity": 0.7421301362179711
    },
    {
      "verse": "16:57",
      "similarity": 0.562896683539332
    },
    {
      "verse": "41:31",
      "similarity": 0.5413898168861224
    },
    {
      "verse": "77:42",
      "similarity": 0.5053892698331197
    },
    {
      "verse": "56:21",
      "similarity": 0.4087156101756751
    }
  ]
}