{
  "chapter": "النمل",
  "text": "قل الحمد لله وسلم على عباده الذين اصطفى ءالله خير اما يشركون",
  "translations": [
    {
      "translation": "Say: 'Praise be to Allah and peace be upon His slaves whom He has chosen.' Is Allah better, or what you associate with Him?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"All praise be to God, and peace on those of His creatures whom He has chosen.\" Is God better or those they associate with Him --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, (O Muhammad): \"All praise be to Allah, and peace be on those of His servants whom He has chosen.\" (Ask them): \"Who is better: Allah or the false gods that they associate with Him as His partners?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"It is only God who deserves all praise. Peace be upon His chosen servants. Which is better God or the idols?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “All praise is to Allah, and peace upon His chosen bondmen; is Allah better or what you ascribe as His partners?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Praise and thanks be to Allah, and peace be on His servants whom He has chosen! Is Allah better, or what they ascribe as partners\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Praise be to Allah and peace on His servants whom He has chosen: is Allah better, or what they associate (with Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Praise belongs to God, and peace be on His servants whom He has chosen.' What, is God better, or that they associate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): Praise be to Allah, and peace be on His slaves whom He hath chosen! Is Allah best, or (all) that ye ascribe as partners (unto Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"All praise be to God, and peace be upon those servants of His whom He has chosen. Is God better, or what they associate with Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: All praise unto Allah, and peace upon His bondmen whom He hath Chosen! Is Allah best, or that which they associate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘All praise belongs to Allah, and Peace be to the servants whom He has chosen.’ Is Allah better, or the partners they ascribe [to Him]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Praise be to Allah, and Peace on his servants whom He has chosen (for his Message). (Who) is better?- Allah or the false gods they associate (with Him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Praise and thanks be to Allah, and peace be on His slaves whom He has chosen (for His Message)! Is Allah better, or (all) that you ascribe as partners (to Him)?\" (Of course, Allah is Better).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Praise belongs to Allah and peace be upon His worshipers whom He has chosen' Who is more worthier, Allah or that which they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Praise God, and peace be upon His servants whom He has selected. Is God better, or what they associate?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"Praise be to Allah, and peace upon His servants whom He has chosen. Is Allah better or what they associate with Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:59] Say, O Muhammad (s): ‘Praise be to God, for the destruction of the disbelievers of past communities, and peace be on His servants whom He has chosen’. Is God (read a-Allāhu, pronouncing both hamzas; or by substituting an alif for the second one; or by not pronouncing the second one but inserting an alif between the one not pronounced and the other one or without [such an insertion]) better, for those who worship Him, or the partners which they ascribe? (read [either] tushrikūna, ‘you ascribe’, or yushrikūna, ‘they ascribe’), [they being] the people of Mecca, [the partners they ascribe] to Him, in other words, are such gods better for those who worship them?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (Praise be to Allah) thanks and gratitude to Allah for their destruction, (and peace) happiness and safety (be on His slaves whom He hath chosen!) whom He selected for prophethood; it is also said that this means: Allah selected them for Islam, and these are the community of Muhammad (pbuh) (Is Allah best) say, Muhammad, to the people of Mecca: is the worship of Allah better, (or (all) that ye ascribe as partners (unto Him)) or the worship of the idols which they associate with Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوقال سبحانه: { قُلِ } يا أكمل الرسل بعدما تلونا عليك بعض فضائل إخوانك تحميداً علينا من قبلهم، وتسليماً منَّا إياهم: { ٱلْحَمْدُ } والثناء الكامل اللائق { لِلَّهِ } الواحد الأحد، الحقيق بجميع المحامد والأثنية الصادرة عن ألسنة عموم من رش عليهم رشحات بحر وجوده، وامتد عليهم أضلال أسمائه وصفاته بمقتضى وجوده { وَسَلاَمٌ } من سبحانه ورحمة نازلة على التواتر والتوالي { عَلَىٰ عِبَادِهِ ٱلَّذِينَ ٱصْطَفَىٰ } واختارهم من بين البرايا التائهين في بيداء الغفلة والضلال، وتكميل الناقصين المنحطين عن رتبة الخلافة والنيابة بميلهم إلى قاذورات الدنيا العائقة عن الوصول إلى در الخلافة التي هي التوحيد المسقط لتوهم الإضافات مطلقاً\n\n\nقل يا أكمل الرسل بعدما ظهر الحق مستفهماً، مقرعاً للمشركين المتخذين غير الله إلهاً جهلاً وعناداً: { ءَآللَّهُ } الواحد الأحد، القادر المتقدر، المدبر لأجله من معرفة مبدئه ومعاده { خَيْرٌ أَمَّا يُشْرِكُونَ } [النمل: 59] له عناداً ومكابرةً من الأظلال الهالكة في أنفسها، المجبورة تحت قهر الله وقدرته الكاملة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: لنبيه - عليه الصلاة والسلام-: { قل الحمدُ لله } على ما أنعم به عليك من فنون النعم، ومن جملتها: اطلاعك على أسرار علم غيوبه، { وسلامٌ على عباده الذين اصطفى } لرسالته\n وقال ابن عباس وسفيان: هم أصحاب محمد صلى الله عليه وسلم، اصطفاهم بصحبته - عليه الصلاة والسلام - وقال الكلبي: هم أمة محمد صلى الله عليه وسلم، اصطفاهم الله لمعرفته وطاعته\n ثم قل لهم إلزاماً للحجة: { الله خير أما تشركون } أي: آلله الذي ذكرت شؤونه العظيمة خير، أم ما تشركونه معه تعالى من الأصنام؟ ومرجع الترديد إلى التعرض بتبكيت الكفرة، وتسفيه آرائهم الركيكة، والتهكم بهم، إذ من البيِّن أن ليس فيما أشركوه به تعالى شائبة خير، حتى يمكن أن يوازن بينه وبين من لا خير إلا خيره، ولا إله غيره\n وكان عليه الصلاة والسلام إذا قرأها قال:\n\n \" بلِ الله خيْرٌ، وأَبْقَى، وأجلُّ، وأكْرَم \"\n \n",
      "translations": []
    }
  ]
}