{
  "chapter": "النمل",
  "text": "امن يهديكم فى ظلمت البر والبحر ومن يرسل الريح بشرۢا بين يدى رحمته اءله مع الله تعلى الله عما يشركون",
  "translations": [
    {
      "translation": "He Who guides you in the darkness of land and sea and sends out the winds bringing advance news of His mercy. Is there another god besides Allah? May Allah be exalted above what they associate with Him!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who then really shows you the way in the darkness of the desert and the sea? And who sends breezes bringing news of His benevolence? Is there any other god along with God? He is far too exalted for what they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it Who guides you through the darkness on land and sea? And Who sends winds as heralds of good tidings ahead of His Mercy? Is there any god associated with Allah (in this task)? Exalted be Allah above whatever they associate with Him in His Divinity!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Are the idols worthier or) the One who guides you in the darkness of the land and sea and sends the winds bearing the glad news of His mercy? Is there any lord besides God? God is too exalted to be considered equal to anything else.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He Who shows you the path in the darkness of the land and the sea, and He Who sends the winds before His mercy, heralding glad tidings? Is there a God along with Allah?! Supremacy is to Allah above all that they ascribe as partners!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He Who guides you in the darkness of the land and the sea, and Who sends the winds as heralds of glad tidings, going before His mercy Is there any god with Allah Exalted be Allah above all that they associate as partners!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, Who guides you in utter darkness of the land and the sea, and Who sends the winds as good news before His mercy. Is there a god with Allah? Exalted by Allah above what they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who guides you in the shadows of the land and the sea and looses the winds, bearing good tidings before His mercy. Is there a god with God? High exalted be God, above that which they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (best) Who guideth you in the darkness of the land and the sea, He Who sendeth the winds as heralds of His mercy? Is there any Allah beside Allah? High Exalted be Allah from all that they ascribe as partner (unto Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who guides you in the darkness of the land and sea? Who sends the breezes as heralds of His mercy? Then, is there a deity besides God? Exalted is God above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not he best Who guideth you in the darknesses of the land and the sea, and Who sendeth the winds as heralds before His mercy Is there any god along with Allah? Exalted be Allah from all that they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who guides you in the darkness of land and sea and who sends the winds as harbingers of His mercy...? What! Is there a god besides Allah? Exalted is Allah above [having] any partners that they ascribe [to Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, Who guides you through the depths of darkness on land and sea, and Who sends the winds as heralds of glad tidings, going before His Mercy? (Can there be another) god besides Allah?- High is Allah above what they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (better than your gods) Who guides you in the darkness of the land and the sea, and Who sends the winds as heralds of glad tidings, going before His Mercy (rain)? Is there any ilah (god) with Allah? High Exalted be Allah above all that they associate as partners (to Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who guides you in the darkness of the land and sea, and sends the winds bearing glad tidings of His Mercy, is there a god with Allah? Exalted is Allah above what they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, who guides you through the darkness of land and sea, and who sends the winds as heralds of His mercy? Is there another god with God? Most exalted is God, above what they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He [not best] who guides you through the darknesses of the land and sea and who sends the winds as good tidings before His mercy? Is there a deity with Allah? High is Allah above whatever they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:63] Or He Who guides you, shows you the way to your destinations, in the darkness of the land and the sea, by the stars at night, and by [the various] landmarks during the day, and Who sends forth the winds as harbingers of His mercy, ahead of the rain. Is there a god with God? Exalted be God [high] above what, others, they associate, with Him!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is not He (best) Who guideth you) Who saves you (in the darkness of the land and the sea) from the turmoil of the land and the sea when you travel, (He Who sendeth the winds as heralds of His mercy) announcing the rain? (Is there any God beside Allah) who does this? (High exalted be Allah) Allah absolves Himself (from all that they ascribe as partner (unto Him)) of idols!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والرحمة العامة الشاملة تدعون وتعبدون { تَعَالَى ٱللَّهُ } المنزه في ذاته عن مشابهته للأمثال\n ومشاركته مع غيره في الآثار والأفعال\n سيما { عَمَّا يُشْرِكُونَ } [النمل: 63] له أولئك المشركون المسرفون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { أمَّن يهديكم في ظلمات البَرِّ والبحر } ليلاً، وبعلامات في الأرض نهاراً؟ أو: أمّن يهديكم إلى سلوك الطريق التي تُوصلكم إلى مقصدكم، وأنتم في ظلمات الليل، سواء كنتم في البر أو البحر؟ فلا هادي إلى ذلك إلا الله تعالى. { ومن يُرسل الرياح } ، أو بالإفراد. { نُشراً } بالنون - أي: تنشر السحاب إلى الموضع الذي أمر الله بإنزال المطر فيه، أو { بُشرا } - بالباء - أي مبشرة بالمطر { بين يدي رحمته } قدَّام المطر علامة عليه، { أإله مع الله } يفعل ذلك؟ { تعالى الله عما يُشركون }. وإظهار الاسم الجليل في موضع الإضمار للإشعار بعلِّية الحُكم، أي: تعالى الله وتنزّه بذاته المنفردة بالألوهية، المقتضية لكون كل المخلوقات مقهوراً تحت قدرته، عن وجود ما يشركونه به تعالى. الإشارة: أمّن يهديكم إلى حل ما أشكل عليكم، وأظلمت منه قلوبكم، من علم بَر الشرائع. وبحر الحقائق، فيهديكم في الأول إلى كشف الحق والصواب وفي الثاني إلى كشف الغطاء ورفع الحجاب، أو: في الأول إلى علم البيان، وفي الثاني إلى عين العيان بالذوق والوجدان. أو: في الأول إلى علم اليقين، وفي الثاني إلى عين اليقين وحق اليقين. ومَن يُرسل رياح الواردات الإلهية، بشارة بين يدي رحمته بالوصول إلى حضرته، وهو التوحيد الخاص. ولذلك ختمه بقوله: { تعالى الله عما يُشركون } من رؤية وجود السِّوى. ثم ذكر نوعاً آخر، فقال: { أَمَّن يَبْدَأُ ٱلْخَلْقَ ثُمَّ يُعيدُهُ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:41",
      "similarity": 0.41727757122073056
    },
    {
      "verse": "83:18",
      "similarity": 0.4150867544193573
    },
    {
      "verse": "6:97",
      "similarity": 0.4006217334221618
    },
    {
      "verse": "52:28",
      "similarity": 0.3700409716856865
    },
    {
      "verse": "82:13",
      "similarity": 0.3500222962946771
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027063.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027063.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}