{
  "chapter": "النمل",
  "text": "امن يبدؤا۟ الخلق ثم يعيده ومن يرزقكم من السماء والارض اءله مع الله قل هاتوا۟ برهنكم ان كنتم صدقين",
  "translations": [
    {
      "translation": "He Who originates creation and then regenerates it and provides for you from out of heaven and earth. Is there another god besides Allah? Say: 'Bring your proof if you are being truthful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who creates first then reverts it? And who gives you provision from the heavens and the earth? Is there any other god along with God? Tell them: \"Bring your proof, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it Who creates in the first instance and then repeats it? Who is it Who provides you with sustenance from the heavens and the earth? Is there any god associated with Allah (in these tasks)? Say: \"Bring forth your evidence, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Are the idols worthier or) the One who began the creation and who will turn it back, who gives you sustenance from the heavens and the earth? Is there any lord besides God? Say, \"Bring your proof if what you say is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He Who initiates the creation, then will create it again, and He Who provides you sustenance from the skies and the earth? Is there a God along with Allah?! Proclaim, “Bring your proof, if you are truthful!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He Who originates creation, and shall thereafter repeat it, and Who provides for you from heaven and earth Is there any god with Allah Say: \"Bring forth your proofs, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, Who originates the creation, then reproduces it and Who gives you sustenance from the heaven and the earth. Is there a god With Allah? Say: Bring your proof if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who originates creation, then brings it back again, and provides you out of heaven and earth. Is there a god with God? Say: 'Produce your proof, if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (best) Who produceth creation, then reproduceth it, and Who provideth for you from the heaven and the earth? Is there any Allah beside Allah? Say: Bring your proof, if ye are truthful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who originates creation, then regenerates it, and who gives you sustenance from heaven and earth? Then, is there a deity besides God?\" Say, \"Bring forward your proofs, if you are telling the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not he best Who originateth creation, and shall thereafter restoreth it, and Who provideth for you from the heaven and the earth? IS there any godl along with Allah? Say thou: bring your proof, if ye are truth-tellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who originates the creation, then He will bring it back, and who provides for you from the sky and the earth...? What! Is there a god besides Allah? Say, ‘Produce your evidence, if you are truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, Who originates creation, then repeats it, and who gives you sustenance from heaven and earth? (Can there be another) god besides Allah? Say, \"Bring forth your argument, if ye are telling the truth!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (better than your so-called gods) Who originates creation, and shall thereafter repeat it, and Who provides for you from heaven and earth? Is there any ilah (god) with Allah? Say, \"Bring forth your proofs, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who originates creation, then brings it back again, who gives you sustenance from the heaven and the earth, is there a god with Allah? Say: 'Bring us your proof if you are among the truthful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, who originates the creation and then repeats it, and who gives you livelihood from the sky and the earth? Is there another god with God? Say, “Produce your evidence, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He [not best] who begins creation and then repeats it and who provides for you from the heaven and earth? Is there a deity with Allah? Say, \"Produce your proof, if you should be truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:64] Or He Who originates creation, in the wombs, from a sperm-drop, then brings it back again, after death, as established by the proofs for this [resurrection], even if you do not acknowledge it; and Who provides for you from the heaven, rain, and [from] the earth, vegetation. Is there a god with God? In other words, none of the things mentioned is done by anyone other than God, and there is no god with Him. Say, O Muhammad (s): ‘Produce your proof, your definitive argument, if you are truthful’, about their being a god with Me who has done any of the things mentioned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is not He (best), Who produceth creation) He Who begins creation from a sperm drop, (then reproduceth it) after death, (and Who provideth for you from the heaven) through rain (and the earth) through vegetation? (Is there any God beside Allah) who has done this? (Say: Bring your proof, if ye are truthful) that there is any other god beside Allah!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمَّن يَبْدَؤُاْ } ويظهر { ٱلْخَلْقَ } أي: عموم المخلوقات والمكونات من كتم العجم بعدما لم يكن شيئاً مذكوراً برش نوره عليها، ومدّ ظله إليها بمقتضى لطفه وجماله { ثُمَّ } بعد إظهاره وإيجاده من { يُعيدُهُ } ويبعثه بعد إعدامه وإماتته بمقتضى قهره وجلاله { وَمَن يَرْزُقُكُم } ويقوم مزاجكم بأنواع الأغذية الحاصلة { مِّنَ } أسباب { ٱلسَّمَآءِ } قوابل { وٱلأَرْضِ أَإِلَـٰهٌ مَّعَ ٱللَّهِ } القادر المقتدر على إنشاء البدائع، وإبداء الغرائب والعجائب المكنونة في التراب؛ ليتكون غذاء لمن عليها من الحيوانات تثبتون وتشركون أيها الحمقى المسرفون، المشركون المكابرون، فإن أصروا على شركهم وكفرهم بعدما سمعوا قوارع الدلائل القاطعة، والشواهد الساطعة { قُلْ } لهم يا أكمل الرسل إلزاماً عليهم وتبكيتاً: { هَاتُواْ } أيها الحمقى { بُرْهَانَكُمْ } على دعواكم ألوهية معبوداتكم { إِن كُنتُمْ صَادِقِينَ } [النمل: 64] في هذه الدعوى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:24",
      "similarity": 0.8150668013018912
    },
    {
      "verse": "28:75",
      "similarity": 0.7592892786998615
    },
    {
      "verse": "2:111",
      "similarity": 0.7517111362953082
    },
    {
      "verse": "23:117",
      "similarity": 0.3797905493764723
    },
    {
      "verse": "4:174",
      "similarity": 0.37593822914719294
    }
  ]
}