{
  "chapter": "النمل",
  "text": "بل ادرك علمهم فى الءاخرة بل هم فى شك منها بل هم منها عمون",
  "translations": [
    {
      "translation": "No, their knowledge stoos short of the Next World. In fact they have doubts about it. In fact they are blind to it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Still less do they comprehend the life to come. In fact they are in doubt about it. Still more, they are blind to it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they have lost their knowledge of the Hereafter. They are steeped in doubt and uncertainty about it: rather they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their knowledge of the next life is no more than doubts. In fact, they are blind about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has their knowledge advanced so much as to know the Hereafter? On the contrary, they are in doubt concerning it; in fact they are blind towards it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, their knowledge will perceive that in the Hereafter. Nay, they are in doubt about it. Nay, they are in complete blindness about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, their knowledge respecting the hereafter is slight and hasty; nay, they are in doubt about it; nay, they are quite blind to it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nay, but their knowledge fails as to the Hereafter; nay, they are in doubt of it; nay, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but doth their knowledge reach to the Hereafter? Nay, for they are in doubt concerning it. Nay, for they cannot see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, their knowledge of the life to come stops short of the truth: they are [often] in doubt as to its reality: in fact, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! their knowledge attaineth not to the Hereafter, Aye! they are in doubt thereof. Aye! thereunto they are blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they comprehend the knowledge of the Hereafter? No, they are in doubt about it. Indeed, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Still less can their knowledge comprehend the Hereafter: Nay, they are in doubt and uncertainty thereanent; nay, they are blind thereunto!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they have no knowledge of the Hereafter. Nay, they are in doubt about it. Nay, they are blind about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, their knowledge fails them as to the Everlasting Life; no, they are in doubt about it, no, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, their knowledge of the Hereafter is confused. In fact, they are in doubt about it. In fact, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, their knowledge is arrested concerning the Hereafter. Rather, they are in doubt about it. Rather, they are, concerning it, blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:66] Nay, has their knowledge come to comprise (read adraka, similar to the [4th verbal] form akrama, ‘he was kind to’; a variant reading has iddāraka, which is actually tadāraka, with the tā’ changed into a dāl and assimilated with the [other] dāl, and a conjunctive hamza added, meaning, ‘attained’ or ‘caught up with’) the Hereafter?, such that they [have reason to] ask about the time of its coming — not so: Nay, for they are in doubt of it. Rather they are blind to it (‘amūna, ‘blind’, as in blindness of the heart; this [statement] is rhetorically more powerful than the preceding one; the origin [of the term] is ‘amiyūn, but the damma vowel is deemed too heavy for the yā’ and has been moved to the mīm, after dropping its kasra vowel).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nبَلِ ادَّارَكَ عِلْمُهُمْ فِي الْآَخِرَةِ بَلْ هُمْ فِي شَكٍّ مِنْهَا بَلْ هُمْ مِنْهَا عَمُونَ (66)و { بل } للإضراب الانتقالي من الإخبار عنهم ب { لا يشعرون أيان يبعثون } وهو ارتقاء إلى ما هو أغرب وأشد ارتقاء من تعييرهم بعدم شعورهم بوقت بعثهم إلى وصف علمهم بالآخرة التي البعث من أول أحوالها وهو الواسطة بينها وبين الدنيا بأنه علم متدارك أو مدرك .وقرأ الجمهور { إدَّارك } بهمز وصل في أوله وتشديد الدال على أن أصله ( تدارك ) فأدغمت تاء التفاعل في الدال لقرب مخرجيها بعد أن سكنت واجتُلِب همز الوصل للنطق بالساكن . قال الفراء وشمر : وهو تفاعل من الدّرك بتفحتين وهو اللحاق .وقد امتلكت اللغويين والمفسرين حيرة في تصوير معنى الآية على هذه القراءة تثار منه حيرة للناظر في توجيه الإضرابين اللذين بعد هذا الإضراب وكيف يكونان ارتقاء على مضمون هذا الانتقال ، وذكروا وجوهاً مثقلة بالتكلف .والذي أراه في تفسيرها على هذا الاعتبار اللغوي أن معنى التدارك هو أن علم بعضهم لَحِق علم بعض آخر في أمر الآخرة لأن العلم ، وهو جنسٌ ، لمّا أضيف إلى ضمير الجماعة حصل من معناه علوم عديدة بعدد أصناف الجماعات التي هي مدلول الضمير فصار المعنى : تداركت علومهم بعضها بعضاً .وذلك صالح لمعنيين : أولهما : أن يكون التدارك وهو التلاحق الذي هو استعمال مجازي يساوي الحقيقة ، أي تداركت علوم الحاضرين مع علوم أسلافهم ، أي تلاحقت وتتابعت فتلَّقى الخلف عن السلف علمَهم في الآخرة وتقلدوها عن غير بصيرة ولا نظر ، وذلك أنهم أنكروا البعث ويشعر لذلك قوله تعالى عقبه { وقال الذين كفروا أإذا كنّا تراباً وءاباؤنا أئنا لمخرجون لقد وعدنا هذا نحن وءاباؤنا من قبل إن هذا إلا أساطير الأولين } \\[ النمل : 67 68 \\] . وقريب من هذا قوله تعالى في سورة المؤمنين ( 81 ) { بل قالوا مثل ما قال الأولون }الوجه الثاني : أن يكون التدارك مستعملاً مجازاً مرسلاً في الاختلاط والاضطراب لأن التدارك والتلاحق يلزمه التداخل كما إذا لحقت جماعة من الناس جماعة أخرى أي لم يرسوا على أمر واختلفت أقوالهم اختلافاً يؤذن بتناقضها ، فهم ينفون البعث ثم يزعمون أن الأصنام شفعاؤهم عند الله من العذاب ، وهذا يقتضي إثبات البعث ولكنهم لا يعذبون ثم يتزودون تارة للآخرة ببعض أعمالهم التي منها : أنهم كانوا يحبسون الراحلة على قبر صاحبها ويتركونها لا تأكل ولا تشرب حتى تموت فيزعمون أن صاحبها يركبها ، ويسمونها البلية ، فذلك من اضطراب أمرهم في الآخرة .وفعل المضي على هذين الوجهين على أصله . وحرف ( في ) على هاذين الوجهين في تفسيرها على قراءة الجمهور مستعمل في السببية ، أي بسبب الآخرة .ويجوز وجه آخر وهو أن يكون { ادارك } مبالغة في ( أدْرَك ) ومفعوله محذوفاً تقديره : إدراكهم ، أي حصل لهم علمهم بوقت بعثهم في اليوم الذي يبعثون فيه ، أي يومئذ يوقنون بالبعث ، فيكون فعل المضي مستعملاً في معنى التحقق ، ويكون حرف ( في ) على أصله من الظرفية ..وقرأ ابن كثير وأبو عمرو وأبو جعفر { بل أدرك } بهمز قطع وسكون الدال ، ومعناه؛ انتهى علمهم في الآخرة . يقال : أدرك ، إذا فني . وفي ثبوت معنى فني لفعل أدرك خلاف بين أيمة اللغة ، فقد أثبته ابن المظفر في رواية شمّر عنه قال شمّر : ولم أسمعه لغيره ، وأثبته الزمخشري في «الكشاف» في هذه الآية وصاحب «القاموس» . وقال أبو منصور : هذا غير صحيح في لغة العرب وما علمت أحداً قال : أدرك الشيء إذا فني .وأقول قد ثبت في اللغة : أدركت الثمار ، إذا انتهى نضجها ، ونسبه في «تاج العروس» لليث ولابن جني وحسبك بإثبات هؤلاء الأثبات . قال الكواشي في «تبصرة المتذكر» : المعنى فني علمهم في الآخرة من أدركت الفاكهة ، إذا بلغت النضج وذلك مؤذن بفنائها وزوالها .فحاصل المعنى على قراءة الجمهور { وما يشعرون أيان يبعثون } وقد تلقى بعضهم عن بعض ما يعلمون في شأن الآخرة وهو ما اشتهر عنهم من إنكار الحياة الآخرة ، أو قد اضطرب ما يعلمونه في شأن الآخرة وأنهم سيعلمون ذلك لا محالة في يوم الدار الآخرة .وحاصل المعنى على قراءة ابن كثير وأبي عمرو وأبي جعفر : ما يشعرون أيّان يبعثون فإنهم لا علم لهم بالحياة الآخرة ، أي جهلوا الحياة الآخرة .أما عدد القراءات الشاذة في هذه الجملة فبلغت عشراً .وأما جملة { بل هم في شك منها } فهو إضراب انتقال للارتقاء من كونهم اضطرب علمهم في الآخرة ، أو تقلد خلفهم ما لقنه سلفهم ، أو من أنهم انتفى عملهم في الآخرة إلى أن ذلك الاضطراب في العلم قد أثار فيهم شكاً من وقوع الآخرة . و ( من ) للابتداء المجازي ، أي في شك ناشىء عن أمر الآخرة . وجيء بالجملة الاسمية للدلالة على ثبات الخبر ودوامه ، والظرفية للدلالة على إحاطة الشك بهم .وجملة { بل هم منها عمون } ارتقاء ثالث وهو آخر درجات الارتقاء في إثبات ضلالهم وهو أنهم عميان عن شأن الآخرة .و { عمون } : جمع عممٍ بالتنوين وهو فعل من العمى ، صاغوا له مثال المبالغة للدلالة على شدة العمى ، وهو تشبيه عدم العلم بالعمى ، وعادم العلم بالأعمى . وقال زهير :وأعلم علم اليوم والأمس قبله ... ولكنني عن علم ما في غدً عمفشبه ضلالهم عن البعث بالعمى في عدم الاهتداء إلى المطلوب تشبيه المعقول بالمحسوس .و ( من ) في قوله { منها عمون } للابتداء المجازي ، جعل عماهم وضلالهم في إثبات الآخرة كأنه ناشىء لهم من الآخرة إذ هي سبب عماهم ، أي إنكارها سبب ضلالهم . وفي الكلام مضاف محذوف تقديره : من إنكار وجودها عمون ، فالمجرور متعلق ب { عمون } . وقدم على متعلقه للاهتمام بهذا المتعلق وللرعاية على الفاصلة . وصيغت الجملة الاسمية للدلالة على الثبات كما في قوله { بل هم في شك منها } .وترتيب هذه الاضرابات الثلاثة ترتيب لتنزيل أحوالهم؛ فوصفوا أولاً بأنهم لا يشعرون بوقت البعث ثم بأنهم تلقفوا في شأن الآخرة التي البعث من شؤونها علماً مضطرباً أو جهلاً فخبطوا في شك ومرية ، فأعقبهم عمى وضلالة بحيث إن هذه الانتقالات مندرجة متصاعدة حتى لو قيل : بل أدّارك علمهم في الآخرة فهم في شك منها فهم منها عمون لحصل المراد .ولكن جاءت طريقة التدرج بالإضراب الانتقالي أجزل وأبهج وأروع وأدل على أن كلاً من هذه الأحوال المترتبة جدير بأن يعتبر فيه المعتبر باستقلاله لا بكونه متفرعاً على ما قبله ، وهذا البيان هو ما أشرت إليه آنفاً عند الكلام على قراءة الجمهور { أدّارك } من خفاء توجيه الإضرابين اللذين بعد الإضراب الأول .وضمائر جمع الغائبين في قوله { يشعرون ، ويبعثون ، علمهم ، هم في شك ، هم منها عمون } عائدة إلى ( من ) الموصولة في قوله تعالى { قل لا يعلم من في السموات والأرض الغيب إلا الله } . و ( من ) هذه وإن كانت من صيغ العموم فالضمائر المذكورة عائدة إليها بتخصيص عمومها ببعض من في الأرض وهم الذين يزعمون أنهم يعلمون الغيب من الكهان والعرّافين وسدنة الأصنام الذين يستقسمون للناس بالأزلام ، وهو تخصيص لفظي من دلالة السياق وهو من قسم المخصص المنفصل اللفظي . والخلاف الواقع بين علماء الأصول في اعتبار عود الضمير إلى بعض أفراد العام مخصصاً للعموم يقرب من أن يكون خلافاً لفظياً . ومنه قوله تعالى { وبُعُولَتُهنّ أحقّ بردهن } \\[ البقرة : 228 \\] فإن ضمير { بعولتهن } عائد إلى المطلقات الرجعيات من قوله تعالى { والمطلقات يتربصن بأنفسهن } \\[ البقرة : 228 \\] الذي هو عام للرجعيات وغيرهن .وبهذا تعلم أن التعبير ب { الذين كفروا } \\[ النمل : 67 \\] هنا ليس من الإظهار في مقام الإضمار لأن الذين كفروا أعم من ما صدق ( من ) في قوله { لا يعلم من في السماوات والأرض الغيب } .\n\n",
      "translations": [
        {
          "translation": "(Nay, but doth their knowledge reach to the Hereafter) their knowledge is in consensus that there is no Hereafter? (Nay, for they are in doubt concerning it) concerning the coming of the Hour. (Nay, for they cannot see it) they are blind, unable to see.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَلِ ٱدَّارَكَ عِلْمُهُمْ } معناه اجتمعَ\n\n",
      "translations": [
        {
          "translation": " But { } has gathered their knowledge.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلِ ٱدَّارَكَ } أي: بلغ وتدارك\n ووصل { عِلْمُهُمْ } أي: علم العلماء وأرباب الشعور والإدراك بعدما كوشفوا بإلهما الله وجذب من جانبه\n و { فِي } تحقق النشأة { ٱلآخِرَةِ } وما فيها من المعتقدات المحققة من الحشر والنشر\n والصراط والسؤال\n والجنة والنار\n والثواب والعقاب\n وجميع الأمور التي نطقت بها ألسنة الكتب والرسل { بَلْ هُمْ } أي: بل أكثر الناس { فِي شَكٍّ } وتردد { مِّنْهَا } أي: من الآخرة ومن الأمور الكائنة فيها { بَلْ هُم } أي: بل أكثرهم { مِّنْهَا } ومن الأمور الموعودة فيها { عَمُونَ } [النمل: 66] غافلون منكرون\n لا يعتقدون ولا يقبلون\n بل ينكرونها أشد إنكار\n ويكذبونها أبلغ تكذيب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قرأ الجمهور: \" ادّارَكَ \" بالمد\n وأصله: تدارك\n فأدغمت التاء في الدال\n ودخلت همزة وصل\n وقرأ عاصم في رواية أبي بكر: \" ادّرك \" \n وأصله: افتعل\n بمعنى تفاعل\n وقرأ ابن كثير وأبو عمرو: \" أدرك \" أفعل\n يقول الحق جل جلاله: { بل ادّارك } أي: تدارك وتناهى وتتابع أسباب { عِلْمُهم في الآخرة } أي: بالآخرة\n أو: في شأنها\n بما ذكرنا لهم من البراهين القطعية\n والحجج العقلية\n على كمال قدرتنا\n ومع ذلك لم يحصل لهم بها يقين\n { بل هم في شكٍّ منها } \n والمعنى: أن أسباب استحكام العلم وتكامله بأن القيامة لا ريب فيها قد حصلت لهم ومكّنوا من معرفته بما تتابع لهم من الدلائل\n زمع ذلك لم يحصل لهم شيء من علمها\n بل شكّوا\n أو: أدرك علمهم\n بمعنى: يدركهم في الآخرة حين يرون الأمر عياناً\n ولا ينفعهم ذلك\n قاله ابن عباس وغيره\n { بل هم } اليوم { في شكٍّ منها بل هم منها عَمُونَ } لا يُبصرون دلائلها\n ولا يلتفتون إلى العمل لها\n والإضرابات الثلاثة تنزيل لأحوالهم\n وتأكيد لجهلهم\n وصفهم أولاً بأنهم لا يشعرون بوقت البعث\n ثم بأنهم لا يعلمون أن القيامة كائنة مع تتابع أسباب علمها\n ثم بأنهم يخبطون في شك ومرية\n ثم بما هو اسوأ حالاً\n وهو العمى\n وجعل الآخرة مبدأ عماهم ومنشأه\n فلذا عداه بـ \" من \" دون \" عن \" لأن الكفر بالعاقبة والجزاء هو الذي منعهم عن التفكر والتدبر\n ووجه اتصال مضمون هذه الآية – وهو وصف المشركين – بإنكارهم البعث مع استحكام أسباب العلم والتمكن من المعرفة بما قبله\n وهو اختصاصه تعالى بعلم الغيب\n وأن العباد لا علم لهم بشيء بذلك: هو أنه لما ذكر أن العباد لا يعلمون الغيب\n وكان هذا بياناً لعجزهم\n ووصفاً لقصور علمهم\n وصل به أن عندهم عجزاً أبلغ منه\n وهو أنهم يقولون للكائن الذي لا بد من كونه – وهو وقت بعثهم\n ومجازاتهم على أعمالهم: لا يكون\n مع أن عندهم أسباب معرفة كونه\n لا محالة\n هـ\n قاله النسفي\n { وقال الذين كفروا أئذا كنا تراباً وآباؤنا أئنا لمخرَجُونَ } أي: أنُخرج من القبور أحياء إذا صرنا تراباً وآباؤنا\n وتكرير الاستفهام في \" أئذا \" و \" أَئِنا \" في قراءة عاصم\n وحمزة وخلف\n إنكار بعد إنكار\n وجحود بعد جحود\n ودليل على كفر مؤكد مبالغ فيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:61",
      "similarity": 0.5423191888676251
    },
    {
      "verse": "38:8",
      "similarity": 0.475274647350913
    },
    {
      "verse": "44:9",
      "similarity": 0.4562040803350171
    },
    {
      "verse": "34:21",
      "similarity": 0.43053588432588563
    },
    {
      "verse": "6:103",
      "similarity": 0.4054645754990961
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027066.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027066.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:66.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}