{
  "chapter": "النمل",
  "text": "امن جعل الارض قرارا وجعل خللها انهرا وجعل لها روسى وجعل بين البحرين حاجزا اءله مع الله بل اكثرهم لا يعلمون",
  "translations": [
    {
      "translation": "He Who made the earth a stable dwelling place and appointed rivers flowing through its midst and placed firmly embedded mountains on it and set a barrier between the two seas. Is there another god besides Allah? No indeed, but most of them do not know it!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who then made the earth a habitable place, and made the rivers (flow) in its valleys and dales, and placed upon it firm stabilisers, and kept a barrier between two bodies of water? Is there any other god along with God? In reality most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it Who has made the earth a place of resort, and has caused rivers to flow in its midst, and has placed upon it firm mountains, and has placed a barrier between two masses of water? Is there any god associated with Allah (in these tasks)? Nay; but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Are the idols worthier or) the One who has made the earth a resting place, the rivers flow from its valleys, the mountains as anchors and a barrier between the two seas? Is there any lord besides God? In fact, most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He Who made the earth for habitation, and placed rivers within it, and created mountains as anchors for it, and kept a barrier between the two seas? Is there a God along with Allah?! In fact, most of them are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He Who has made the earth as a fixed abode, and has placed rivers in its midst, and has placed firm mountains therein, and has set a barrier between the two seas (of salt and sweet water) Is there any ilah (god) with Allah Nay, but most of them know not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, Who made the earth a restingplace, and made in it rivers, and raised on it mountains and placed between the two seas a barrier. Is there a god with Allah? Nay! most of them do not know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who made the earth a fixed place and set amidst it rivers and appointed for it firm mountains and placed a partition between the two seas. Is there a god with God? Nay, but the most of them have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (best) Who made the earth a fixed abode, and placed rivers in the folds thereof, and placed firm hills therein, and hath set a barrier between the two seas? Is there any Allah beside Allah? Nay, but most of them know not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that made the earth a stable place to live in? Who made rivers flow through it? Who set mountains upon it and placed a barrier between the two seas? Is there another deity besides God? Indeed, most of them have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not he best Who hath made the earth a fixed abode and placed rivers in the midst thereof and placed Firm mountains thereon, and hath set a barrier between the two seas? IS there any god along with Allah? Nay! but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who made the earth an abode [for you], and made rivers [flowing] through it, and set firm mountains for it [’s stability], and set a barrier between the two seas...? What! Is there a god besides Allah? Indeed, most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, Who has made the earth firm to live in; made rivers in its midst; set thereon mountains immovable; and made a separating bar between the two bodies of flowing water? (can there be another) god besides Allah? Nay, most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (better than your gods) Who has made the earth as a fixed abode, and has placed rivers in its midst, and has placed firm mountains therein, and has set a barrier between the two seas (of salt and sweet water). Is there any ilah (god) with Allah? Nay, but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has established the earth a fixed place and set therein rivers; and set for it firm mountains and placed a barrier between the two seas, is there a god with Allah? No, most of them are without knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, who made the earth habitable, and made rivers flow through it, and set mountains on it, and placed a partition between the two seas? Is there another god with God? But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He [not best] who made the earth a stable ground and placed within it rivers and made for it firmly set mountains and placed between the two seas a barrier? Is there a deity with Allah? [No], but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:61] Or He Who made the earth an abode [of stability], that does not [constantly] shake beneath [the feet of] its inhabitants, and made rivers [to flow] throughout it and set firm mountains for it, with which He fixed the earth [in place], and set an isthmus between the two seas, between the sweet one and the salty one, the one not mixing with the other. Is there a god with God? Nay, but most of them have no knowledge, of His Oneness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمْ مَنْ جَعَلَ الْأَرْضَ قَرَارًا وَجَعَلَ خِلَالَهَا أَنْهَارًا وَجَعَلَ لَهَا رَوَاسِيَ وَجَعَلَ بَيْنَ الْبَحْرَيْنِ حَاجِزًا أَئِلَهٌ مَعَ اللَّهِ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ (61){ أم } للإضراب الانتقالي مثل أختها السابقة . وهذا انتقال من الاستدلال المشوب بالامتنان إلى الاستدلال المجرد بدلائل قدرته وعلمه بأن خلق المخلوقات العظيمة وبتدبيره نظامها حتى لا يطغى بعضها على بعض فيختل نظام الجميع .ولأجل كون الغرض من هذا الاستدلال إثبات عظم القدرة وحكمة الصنع لم يجيء خلاله بخطاب للمشركين كما جاء في قوله في الآية قبلها { وأنزل لكم من السماء ماء } \\[ النمل : 60 \\] الآية ، وإن كان هذا الصنع العجيب لا يخلو من لطف بالمخلوقات أراده خالقها ، ولكن ذلك غير مقصود بالقصد الأول من سوق الدليل هنا .والقرار : مصدر قرّ ، إذا ثبت وسكن . ووصف الأرض به للمبالغة ، أي ذات قرار . والمعنى جعل الأرض ثابتة قارّة غير مضطربة . وهذا تدبير عجيب ولا يُدرك تمام هذا الصنع العجيب إلا عند العلم بأن هذه الأرض سابحة في الهواء متحركة في كل لحظة وهي مع ذلك قارّة فيما يبدو لسكانها فهذا تدبير أعجب ، وفيه مع ذلك رحمة ونعمة . ولولا قرارها لكان الناس عليها متزلزلين مضطربين ولكانت أشغالهم مُعنتة لهم .ومع جعلها قراراً شقّ فيها الأنهار فجعلها خلالها . وخلال الشيء : منفرج ما بين أجزائه . والأنهار تشق الأرض في أخاديد فتجري خلال الأرض .والرواسي : الجبال ، جمع راسسٍ وهو الثابت . واللام في { لها } لام العلة ، أي الرواسي لأجلها أي لفائدتها ، فإن في تكوين الجبال حكمة لدفع الملاسة عن الأرض ليكون سيرها في الكرة الهوائية معدلاً غير شديد السرعة وبذلك دوام سيرها .وجعل الحاجز بين البحرين من بديع الحكمة ، وهو حاجز معنوي حاصل من دفع كلا الماءين : أحدهما الآخر عن الاختلاط به ، بسبب تفاوت الثقل النسبي لاختلاف الأجزاء المركب منها الماء الملح والماء العذب . فالحاحز حاجز من طبعهما وليس جسماً آخر فاصلاً بينهما ، وتقدم في سورة النحل .وهذا الجعل كناية عن خلق البحرين أيضاً لأن الحجز بينهما يقتضي خلقهما وخلق الملوحة والعذوبة فيهما .ثم ذيّل بالاستفهام الإنكاري وبالاستدراك بجملة مماثلة لما ذُيّل به الاستدلال الذي قبلها على طريقة التكرير تعديداً للإنكار وتمهيداً للتوبيخ بقوله { بل أكثرهم لا يعلمون . } وأوثر هنا نفي صفة العلم عن أكثر المشركين لقلة من ينظر في دقائق هذه المصنوعات وخصائصها منهم فإن اعتياد مشاهدتها من أول نشأة الناظر يذهله عما فيها من دلائل بديع الصنع . فأكثر المشركين يجهل ذلك ولا يهتدي بما فيه ، أما المؤمنون فقد نبههم القرآن إلى ذلك فهم يقرأون آياته المتكرر فيها الاستدلال والنظر .وهذه الدلائل لا تخلو عن نعمة من ورائها كما علمته آنفاً ولكنها سيقت هنا لإرادة الاستدلال لا للامتنان .\n\n",
      "translations": [
        {
          "translation": "(Is not He (best) Who made the earth a fixed abode, and placed rivers in the folds thereof) in the middle thereof, (and placed firm hills therein) on earth, (and hath set a barrier) preventing mixture (between the two seas) the sweet and salty seas? (Is there any God beside Allah) who has done this? (Nay, but most of them know not) most of them believe not!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمَّن جَعَلَ ٱلأَرْضَ قَرَاراً } أي: مقراً تستقرون عليها وتعيشون فيها\n مع ان طبع الماء يقتضي الإحاطة بجميع جوانبها\n بحيث لا يبدوا من كرة الأرض شيئاً خرجاً منه { وَ } بعد إبداء بعضها من الماء عنايةً من سبحانه إياكم { جَعَلَ خِلاَلَهَآ } أي: أوساط الأرض البادية { أَنْهَاراً } جارية\n تتميماً لأمور معاشكم عليها { وَجَعَلَ لَهَا رَوَاسِيَ } أي: الأرض رواسي\n أي: جبالاً شامخات\n وسير فيها معادن الفلزات\n ومنابع المياة ومراتع الحيوانات تتميماً وتكميلاً لمصالحكم ومعايشكم\n\n\n{ وَجَعَلَ } من كمال لطفه ومرحمته { بَيْنَ ٱلْبَحْرَيْنِ } العذب والمالح { حَاجِزاً أَإِلَـٰهٌ } مانعاً\n لئلا يختلط ويختل نظام معاشكم عليها\n أي: أتدعون أيها الجاهلون { مَّعَ ٱلله } المتوحد المتفرد في ذاته\n المستقل في تصرفاته الواقعة في مملكته؟! { بَلْ أَكْثَرُهُمْ } لانهماكهم في الغفلة والجهل عن الله وحق قدره وقدر ألوهيته { لاَ يَعْلَمُونَ } [النمل: 61] شيئاً من آداب عبوديته\n لذلك ينسبون إليه سبحانه ما لا يليق بشأنه جهلاً ومكابرةً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { أمَّن جعلَ الأرضَ قراراً } أي: قارة ثابتة، ليستقر عليها الإنسان والدواب، بإظهار بعضها من الماء، ودحوها وتسويتها، حسبما يدور عليه منافعهم. { وجعل خلالها } أواسطها { أنهاراً } جارية ينتفعون بها، { وجعل لها رواسيَ } أي: جبالاً ثوابت، تمنعها أن تميد بأهلها، ولتتكون فيها المعادن، وينبع من حضيضها المنابع. { وجعل بين البحرين } أي: العذب والمالح، أو: خليجي فارس والروم حاجزاً برزخاً مانعاً من المعارجة والمخالطة، { أإله مع الله } في الوجود، أو: في إبداع هذه البدائع؟ { بل أكثرهم لا يعلمون } شيئاً من الأشياء، ولذلك لا يفهمون بطلان ما هم عليه من الشرك مع كمال ظهوره. الإشارة: أم من جعل أرض النفوس قراراً، لتستقر عليها أحكام العبودية، وتتصرف فيها أقدار الربوبية، وجعل خلالها أنهاراً من علوم الشرائع، وما يتعلق بعالم الحكمة من الحِكَم والأحكام، وجعل لها جبالاً من العقل لتعرف صانعها ومدبرها، وجعل بين بحر الحقيقة والشريعة حاجزاً وبرزخاً، وهو نور العقل؟ فما دام العقل صاحياً ميّز بين الحقيقة والشريعة، فيلزمه التكليف، ويعطي كل ذي حق حقه. فإذا سكر وغاب نوره سقط التكليف. وقد تُشرق على نور قمر العقل شمسُ العرفان، فتغطيه مع وجود صحوه، فيميز بين الحقائق والشرائع، وتكون عبادته أدباً وشكراً. وبالله التوفيق. ثم ذكر نوعاً آخر، فقال: { أَمَّن يُجِيبُ ٱلْمُضْطَرَّ إِذَا دَعَاهُ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:47",
      "similarity": 0.7887868311537004
    },
    {
      "verse": "43:67",
      "similarity": 0.17938645393212294
    },
    {
      "verse": "79:32",
      "similarity": 0.16909765115438918
    },
    {
      "verse": "17:91",
      "similarity": 0.1690538308141479
    },
    {
      "verse": "17:73",
      "similarity": 0.16463946139375035
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027061.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027061.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:61.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}