{
  "chapter": "النمل",
  "text": "قل لا يعلم من فى السموت والارض الغيب الا الله وما يشعرون ايان يبعثون",
  "translations": [
    {
      "translation": "Say: 'No one in the heavens and the earth knows the Unseen except Allah.' They are not aware of when they will be raised.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"No one in the heavens and the earth has knowledge of the unknown except God, nor can they know when they will be raised again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"None in the heavens or on the earth has knowledge of the Unseen save Allah. They do not know when they will be raised to life.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad) say, \"No one in the heavens or the earth knows the unseen except God, and no one knows when they will be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “None in the heavens and the earth know the hidden by themselves, except Allah; and they do not know when they will be raised.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"None in the heavens and the earth knows the Unseen except Allah, nor can they perceive when they shall be resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: No one in the heavens and the earth knows the unseen but Allah; and they do not know when they shall be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'None knows the Unseen in the heavens and earth except God. And they are not aware when they shall be raised;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): None in the heavens and the earth knoweth the Unseen save Allah; and they know not when they will be raised (again).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"No one in the heavens and the earth has knowledge of the unseen except God.\" They do not know when they will be raised up again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: none in the heavens and the earth knoweth the Unseen save Allah; nor can they perceive when they will be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘No one in the heavens or the earth knows the Unseen except Allah, and they are not aware when they will be resurrected.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: None in the heavens or on earth, except Allah, knows what is hidden: nor can they perceive when they shall be raised up (for Judgment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"None in the heavens and the earth knows the Ghaib (unseen) except Allah, nor can they perceive when they shall be resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'None in the heavens or the earth knows the Unseen except Allah, and they are not aware when they shall be resurrected'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “No one in the heavens or on earth knows the future except God; and they do not perceive when they will be resurrected.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"None in the heavens and earth knows the unseen except Allah, and they do not perceive when they will be resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:65]   They [the disbelievers] also asked him when the Hour will come to pass, and the following was revealed: Say: ‘No one in the heavens or the earth knows, be it angels or human beings, the Unseen, namely, what is hidden from them, except God, He knows it, and they are not aware, the disbelievers of Mecca, like others, when, is the time in which, they will be resurrected.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "432 (Say) Muhammad, to the people of Mecca: (None in the heavens) among angels (and the earth) among created beings (knoweth the Unseen) the appointed time for the advent of the Hour and descent of torment (save Allah; and they know not) and created beings know not (when they will be raised (again)) from the graves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا يَشْعُرُونَ أَيَّانَ } معناه مَتى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تم إلزامك عليهم، وتبكيتك إياهم { قُل } يا أكمل الرسل كلاماً ناشئاً عن محض التوحيد، خالياً عن وصمة الكثرة مطلقاً: { لاَّ يَعْلَمُ مَن } ظهر { فِي ٱلسَّمَٰوٰتِ } أي: العلويات { و } من ظهر في { ٱلأَرْضِ } أي: السفليات من المظاهر المجبولة فيهما على فطرة الشعور والإدراك { ٱلْغَيْبَ } الذي غاب عن مداركهم وعقولهم وحواسهم { إِلاَّ ٱللَّهُ } المنزه عن الأماكن والأزمان، بل الكل في حيطة أسمائه وأوصافه، والمبرأ عن الاشتراك في جنس وعن الامتياز بفصل، فإنه واحد لا يشارك مع شيء عنه بشيء، بل وحدته لا كسائر الوحدات، ولا علمه كسائر العلوم، وكذا جميع صفاته وأسمائه، فإنه سبحانه يعلم بعلمه الحضوري جميع ما ظهر وبطن، وغاب وشهد بلا تفاوتٍ، بل الكل في ساحة عز حضوره على السواء بلا اختلافٍ من الخفاء والجلاء\n\n\n\n\n{ وَ } إن اجتهد أولئك الصالحون من أهل السماوات والأرضين { مَا يَشْعُرُونَ } ويدركون { أَيَّانَ يُبْعَثُونَ } [النمل: 65] أي: متى يبعثون، وفي أي آن يحشرون من قبور تعيناتهم، وأجداث هوياتهم؛ للوقوف بين يدي الله؛ وإن وصلوا بعدما اجتهدوا بتوفيق الله وتيسيره، إن وقوفهم بين يديه للعرض والجزاء كائن لا محالة، لكنهم ما وصلوا إلى مرتبة يسع لهم تعيين وقت الحشر والنشر؛ إذ يعبتر وقت البعث من جملة الغيوب التي استأثر الله بها، ولم يطلع أحداً من الأنبياء وأوليائه عليها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}