{
  "chapter": "النمل",
  "text": "قل لا يعلم من فى السموت والارض الغيب الا الله وما يشعرون ايان يبعثون",
  "translations": [
    {
      "translation": "Say: 'No one in the heavens and the earth knows the Unseen except Allah.' They are not aware of when they will be raised.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"No one in the heavens and the earth has knowledge of the unknown except God, nor can they know when they will be raised again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"None in the heavens or on the earth has knowledge of the Unseen save Allah. They do not know when they will be raised to life.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad) say, \"No one in the heavens or the earth knows the unseen except God, and no one knows when they will be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “None in the heavens and the earth know the hidden by themselves, except Allah; and they do not know when they will be raised.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"None in the heavens and the earth knows the Unseen except Allah, nor can they perceive when they shall be resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: No one in the heavens and the earth knows the unseen but Allah; and they do not know when they shall be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'None knows the Unseen in the heavens and earth except God. And they are not aware when they shall be raised;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): None in the heavens and the earth knoweth the Unseen save Allah; and they know not when they will be raised (again).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"No one in the heavens and the earth has knowledge of the unseen except God.\" They do not know when they will be raised up again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: none in the heavens and the earth knoweth the Unseen save Allah; nor can they perceive when they will be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘No one in the heavens or the earth knows the Unseen except Allah, and they are not aware when they will be resurrected.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: None in the heavens or on earth, except Allah, knows what is hidden: nor can they perceive when they shall be raised up (for Judgment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"None in the heavens and the earth knows the Ghaib (unseen) except Allah, nor can they perceive when they shall be resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'None in the heavens or the earth knows the Unseen except Allah, and they are not aware when they shall be resurrected'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “No one in the heavens or on earth knows the future except God; and they do not perceive when they will be resurrected.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"None in the heavens and earth knows the unseen except Allah, and they do not perceive when they will be resurrected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:65]   They [the disbelievers] also asked him when the Hour will come to pass, and the following was revealed: Say: ‘No one in the heavens or the earth knows, be it angels or human beings, the Unseen, namely, what is hidden from them, except God, He knows it, and they are not aware, the disbelievers of Mecca, like others, when, is the time in which, they will be resurrected.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ لَا يَعْلَمُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ الْغَيْبَ إِلَّا اللَّهُ وَمَا يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ (65) لما أبطلت الآيات السابقة إلهية أصنام المشركين بالأدلة المتظاهرة فانقطع دابر عقيدة الإشراك ثني عنان الإبطال إلى أثر من آثار الشرك وهو ادعاء علم الغيب بالكهانة وإخبار الجن ، كما كان يزعمه الكهان والعرافون وسدنة الأصنام . ويؤمن بذلك المشركون . وفي «معالم التنزيل» وغيره نزلت في المشركين حين سألوا رسول الله صلى الله عليه وسلم عن وقت قيام الساعة فما كان سؤالهم عن ذلك إلا لظنهم أن ادعاء العلم بوقتها من شأن النبوءة توصلاً لجحد النبوءة إن لم يعين لهم وقت الساعة فأبطلت الآية هذه المزاعم إبطالاً عاماً معياره الاستثناء بقوله { إلا الله . } وهو عام مراد به الخصوص أعني خصوص الكهان وسدنة بيوت الأصنام . وإنما سلك مسلك العموم لإبطال ما عسى أن يزعم من ذلك ، ولأن العموم أكثر فائدة وأوجز ، فإن ذلك حال أهل الشرك من بين من في السماوات والأرض . فالقصد هنا تزييف آثار الشرك وهو الكهانة ونحوها . وإذ قد كانت المخلوقات لا يعدون أن يكونوا من أهل السموات أو من أهل الأرض لانحصار عوالم الموجودات في ذلك كان قوله { لا يعلم من في السموات والأرض الغيب } في قوة لا يعلم أحد الغيب ، ولكن أطنب الكلام لقصد التنصيص على تعميم المخلوقات كلها فإن مقام علم العقيدة مقام بيان يناسبه الإطناب .واستثناء { إلا الله } منه لتأويل { من في السماوات والأرض } بمعنى : أحد ، فهو استثناء متصل على رأي المحققين وهو واقع من كلام منفي . فحق المستثنى أن يكون بدلاً من المستثنى منه في اللغة الفصحى فلذلك جاء اسم الجلالة مرفوعاً ولو كان الاستثناء منقطعاً لكانت اللغة الفصحى تنصب المستثنى .وبعد فإن دلائل تنزيه الله عن الحلول في المكان وعن مماثلة المخلوقات متوافرة فلذلك يجري استعمال القرآن والسنة على سنن الاستعمال الفصيح للعلم بأن المؤمن لا يتوهم ما لا يليق بجلال الله تعالى . ومن المفسرين من جعل الاستثناء منقطعاً وقوفاً عند ظاهر صلة { من في السماوات والأرض } لأن الله ينزّه عن الحلول في السماء والأرض .وأما من يتفضل الله عليه بأن يظهره على الغيب فذلك داخل في علم الله قال تعالى { عالم الغيب فلا يظهر على غيبه أحداً إلا من ارتضى من رسول } \\[ الجن : 26 ، 27 \\] . فأضاف ( غيب ) إلى ضمير الجلالة .وأردف هذا الخبر بإدماج انتفاء علم هؤلاء الزاعمين علم الغيب أنهم لا يشعرون بوقت بعثهم بل جحدوا وقوعه إثارة للتذكير بالبعث لشدة عناية القرآن بإثباته وتسفيه الذين أنكروه . فذلك موقع قوله { وما يشعرون أيان يبعثون ، } أي أن الذين يزعمون علم الغيب ما يشعرون بوقت بعثهم .و { أيان } اسم استفهام عن الزمان وهو معلِّق فعل { يشْعرون } عن العمل في مفعوليه . وهذا تورّكٌ وتعيير للمشركين فإنهم لا يؤمنون بالبعث بَلْةَ شعورهم بوقته .\n\n",
      "translations": [
        {
          "translation": "432 (Say) Muhammad, to the people of Mecca: (None in the heavens) among angels (and the earth) among created beings (knoweth the Unseen) the appointed time for the advent of the Hour and descent of torment (save Allah; and they know not) and created beings know not (when they will be raised (again)) from the graves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا يَشْعُرُونَ أَيَّانَ } معناه مَتى\n\n",
      "translations": [
        {
          "translation": " And they do not perceive how {and when} it will be.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n خالياً عن وصمة الكثرة مطلقاً: { لاَّ يَعْلَمُ مَن } ظهر { فِي ٱلسَّمَٰوٰتِ } أي: العلويات { و } من ظهر في { ٱلأَرْضِ } أي: السفليات من المظاهر المجبولة فيهما على فطرة الشعور والإدراك { ٱلْغَيْبَ } الذي غاب عن مداركهم وعقولهم وحواسهم { إِلاَّ ٱللَّهُ } المنزه عن الأماكن والأزمان\n بل الكل في حيطة أسمائه وأوصافه\n والمبرأ عن الاشتراك في جنس وعن الامتياز بفصل\n فإنه واحد لا يشارك مع شيء عنه بشيء\n بل وحدته لا كسائر الوحدات\n ولا علمه كسائر العلوم\n وكذا جميع صفاته وأسمائه\n فإنه سبحانه يعلم بعلمه الحضوري جميع ما ظهر وبطن\n وغاب وشهد بلا تفاوتٍ\n بل الكل في ساحة عز حضوره على السواء بلا اختلافٍ من الخفاء والجلاء\n\n\n{ وَ } إن اجتهد أولئك الصالحون من أهل السماوات والأرضين { مَا يَشْعُرُونَ } ويدركون { أَيَّانَ يُبْعَثُونَ } [النمل: 65] أي: متى يبعثون\n وفي أي آن يحشرون من قبور تعيناتهم\n وأجداث هوياتهم\n للوقوف بين يدي الله\n وإن وصلوا بعدما اجتهدوا بتوفيق الله وتيسيره\n إن وقوفهم بين يديه للعرض والجزاء كائن لا محالة\n لكنهم ما وصلوا إلى مرتبة يسع لهم تعيين وقت الحشر والنشر\n إذ يعبتر وقت البعث من جملة الغيوب التي استأثر الله بها\n ولم يطلع أحداً من الأنبياء وأوليائه عليها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولذلك قال: { وما يشعرون أيّان يُبعثون } أي: متى ينتشرون من القبور\n مع كونه مما لا بد لهم منه\n ومن أهل الأمور عندهم\n والله تعالى أعلم\n الإشارة: الرزق ثلاثة: رزق الأشباح\n ورزق القلوب\n ورزق الأرواح\n فرزق الأشباح معلوم\n ورزق القلوب: اليقين والطمأنينة\n ورزق الأرواح: المشاهدة والمكالمة\n قُل من يرزق قلوبكم وأرواحكم من سماء غيب القدرة وأرض الحكمة؟ فلا رازق سواه\n ولا برهان على وجود ما سواه\n ولا يعلم الغيب إلا الله\n أو: من كان وجوده بالله قد غاب في نور الله\n فَشَهِدَ الغيب بالله\n والله تعالى أعلم\n ولما نفى عنه علم الغيب\n والشعور بمآلهم\n أضرب عنه\n وبيّن أن ما تناهى فيه أسباب العلم به\n وهو مجيء يوم القيامة\n لم يحصل لهم به يقين\n فضلاً عن غيره\n فقال: { بَلِ ٱدَّارَكَ عِلْمُهُمْ فِي ٱلآخِرَةِ\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:21",
      "similarity": 0.8958659936582729
    },
    {
      "verse": "75:6",
      "similarity": 0.8026365166922227
    },
    {
      "verse": "51:12",
      "similarity": 0.7841240377325915
    },
    {
      "verse": "79:42",
      "similarity": 0.656524056387395
    },
    {
      "verse": "7:187",
      "similarity": 0.27331959833201347
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}