{
  "chapter": "النمل",
  "text": "امن خلق السموت والارض وانزل لكم من السماء ماء فانۢبتنا به حدائق ذات بهجة ما كان لكم ان تنۢبتوا۟ شجرها اءله مع الله بل هم قوم يعدلون",
  "translations": [
    {
      "translation": "He Who created the heavens and the earth and sends down water for you from the sky by which We indeed, but they are people who equate others with Him!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the heavens and the earth, who sends down water from the sky for you, with which He causes graceful gardens to grow? It was not in your power to make trees germinate. Is there any other god along with God. In fact they are a people who turn away (from the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that has created the heavens and the earth and sent down for you water from the sky and then We caused to grow therewith orchards full of beauty whose trees you could never grow. Is there any god associated with Allah (in these tasks)?\" Nay, they are a people who are veering away from the Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Are the idols worthier or) the One who has created the heavens and the earth, who has sent water from the sky for you, who has established delightful gardens and you could not even plant one tree? Is there any Lord besides God? In fact, the unbelievers are the ones who deviate from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He Who created the heavens and the earth, and sent down water from the sky for you; so We grew delightful gardens with it; you had no strength to grow its trees; is there a God along with Allah?! In fact they are those who shun the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He Who created the heavens and the earth, and sends down for you water from the sky, whereby We cause to grow wonderful gardens full of beauty and delight It is not in your ability to cause the growth of their trees. Is there any god with Allah Nay, but they are a people who ascribe equals!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, He Who created the heavens and the earth, and sent down for you water from the cloud; then We cause to grow thereby beautiful gardens; it is not possible for you that you should make the trees thereof to grow. Is there a god with Allah? Nay! they are people who deviate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who created the heavens and earth, and sent down for you out of heaven water; and We caused to grow therewith gardens full of loveliness whose trees you could never grow. Is there a god with God? Nay, but they are a people who assign to Him equals!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (best) Who created the heavens and the earth, and sendeth down for you water from the sky wherewith We cause to spring forth joyous orchards, whose trees it never hath been yours to cause to grow. Is there any Allah beside Allah? Nay, but they are folk who ascribe equals (unto Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the heavens and the earth and sends down water for you from the sky, by which We make luxuriant gardens grow, you could never make such trees grow in them, is it another deity besides God? No indeed, but they are a people who equate others with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not he best Who hath created the heavens and the earth, and Who sendeth down water for you from the heaven wherewith We cause beauteous orchards to grow up, whereof it was not possible for you to cause the trees to grow up! Is there any god along with Allah! Nay! but they are a people who equalise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who created the heavens and the earth, and sends down for you water from the sky, whereby We grow delightful gardens, whose trees you could never cause to grow...? What! Is there a god besides Allah? Indeed, they are a lot who equate [others with Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, Who has created the heavens and the earth, and Who sends you down rain from the sky? Yea, with it We cause to grow well-planted orchards full of beauty of delight: it is not in your power to cause the growth of the trees in them. (Can there be another) god besides Allah? Nay, they are a people who swerve from justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (better than your gods) Who created the heavens and the earth, and sends down for you water (rain) from the sky, whereby We cause to grow wonderful gardens full of beauty and delight? It is not in your ability to cause the growth of their trees. Is there any ilah (god) with Allah? Nay, but they are a people who ascribe equals (to Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who created the heavens and the earth, and sent water from the sky for you and caused gardens to grow full of beauty of which its tree you could never grow, is there a god with Allah? No, but they are a nation who set up equals with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, who created the heavens and the earth, and rains down water from the sky for you? With it We produce gardens full of beauty, whose trees you could not have produced. Is there another god with God? But they are a people who equate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[More precisely], is He [not best] who created the heavens and the earth and sent down for you rain from the sky, causing to grow thereby gardens of joyful beauty which you could not [otherwise] have grown the trees thereof? Is there a deity with Allah? [No], but they are a people who ascribe equals [to Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:60] Or He Who created the heavens and the earth, and sends down for you water from the heaven, whereby We cause to grow (there is a shift here from third person to that of the first person [plural]) splendid gardens (hadā’iq is the plural of hadīqa, which is an enclosed garden) whose trees you could never cause to grow?, because of you do not have the ability for it. Is there a god (a-ilāhun, here and in the seven instances in which it occurs, read by pronouncing both hamzas, or by not pronouncing the second, inserting an alif between the two in both cases) with God?, who has helped Him in [all of] this? In other words, there is no god with Him. Nay, but they are a people who ascribe equals [to Him], who associate with God others.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is not He (best) who created the heavens and the earth, and sendeth down for you water) rain (from the sky wherewith) by means of the rain (We cause to spring forth joyous) seemly (orchards) that which surrounds them of palm-trees and trees, (whose trees it never hath been yours to cause to grow) you never had the power to grow its trees. (Is there any God beside Allah) who has done this? (Nay, but they are folk who ascribe equals (unto Him)) they make the idols as equals to Him!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَنبَتْنَا بِهِ حَدَآئِقَ ذَاتَ بَهْجَةٍ } معناهُ جَنّاتٌ واحد[تُها] حَديقةٌ\n وذَاتُ بَهجةٍ: ذَاتُ حُسنٍ ويُراد بِها النَّخلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And We have caused to grow therein gardens of date palms and grapes}, means one garden [of date palms and grapes].\n\n\n{With a beautiful appearance: having beauty and desired by the palm tree.}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أمن خلق السموات والأرض } أي: المؤثر المطلق الموجد للكل من الأعيان الممكنة وصفاتها خير في التأثير والإيجاد\n أم ما لا وجود له\n فكيف بالتأثير والإيجاد\n { أإله مع الله } في التأثير والإيجاد { بل هم قوم يعدلون } عن الحق\n فيثبتون الباطل بالتوهم\n { أمن يهديكم } إلى نور ذاته { في ظلمات البرّ } أي: حجب الأكوان والأفعال { والبحر } أي: حجب الصفات { ومن يرسل } رياح النفحات محيية للقلوب من يدي رحمة التجليات\n { أمن يبدأ الخلق } باختفائه بأعيانهم واحتجابه بذواتهم { ثم يعيده } بإفنائهم في عين الجمع وإهلاكهم في ذاته بالطمس أو بإظهارهم في النشأة وإعادتهم إلى الفطرة { ومن يرزقكم من السماء } الغذاء الروحاني { و } من { الأرض } الجسماني إذ من السماء المعارف والحقائق ومن الأرض الحكم والأخلاق\n { وإذا وقع القول عليهم } أي: وإذا تحقق وقوع ما سبق في القضاء حكمنا به من الشقاوة الأبدية عليهم { أخرجنا لهم دابة } من صورة نفس كل شقيّ مختلفة الهيئات والأشكال هائلة\n بعيدة النسبة بين أطرافها وجوارحها على ما ذكر من قصتها بحسب تفاوت أخلاقها وملكاتها من أرض البدن قدّام القيامة الصغرى التي هي من أشراطها { تكلمهم } بلسان حياتها وصفاتها { أنّ الناس كانوا بآياتنا } قدرتنا على البعث { لا يوقنون }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قرع عليه سبحانه من التقريعات والتوبيخات ما قرع تتمياً لردعهم\n وتكميلاً لزجرهم فقالأ: { أَمَّنْ خَلَقَ ٱلسَّمَٰوَٰتِ } أي: عالم الأسباب العادية { وَٱلأَرْضَ } أي: عالم الطبيعة القابلة لقبول فيضان آثار الفواعل العلوية { وَ } من { أَنزَلَ لَكُمْ مِّنَ } جانب { ٱلسَّمَآءِ مَآءً } محيياً أموات الأراضي اليابسة بالطبع { فَأَنبَتْنَا بِهِ } أي: بالماء بعدما أنزلناه من جانب السماء { حَدَآئِقَ ذَاتَ بَهْجَةٍ } وبهاء ونضارة وصفاء { مَّا كَانَ } أي: ما صح وأمكن { لَكُمْ أَن تُنبِتُواْ شَجَرَهَا } بل ولا شجرة واحدة من جملة أشجارها\n لولا إمداد الله وإنباته إياها { أَإِلَـٰهٌ } أي: تدعون وتدَّعون إلهاً آخر { مَّعَ ٱللَّهِ } المدبر لمصالحكم بالاستقلال والإرادة والاختيار { بَلْ هُمْ } أي: المتخذون غير الله إلهاً { قَوْمٌ يَعْدِلُونَ } [النمل: 60] عن الحق الصريح الذي هو التوحيد إلى الباطل الذي هو الشرك في ألوهيته\n وإثبات الغير معه في الوجود\n وادعاء استحقاق العبادة إياه عناداً ومكابرةً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { أمّن خَلَق السماواتِ والأرضَ } \n \" أم \" هنا: منقطعة\n بخلاف { أمَّا تشكرون } أي: بل أمّن خلق العالم العلوي والسفلي\n وأفاض من كل واحد ما يليق به من الخيرات\n خير\n أم جماد لا يقدر على شيء؟ فمن: مبتدأ\n وخبرها: محذوف مع \" أم \" المعادلة للهمزة\n كما قررنا\n { وأنزل لكم من السماء ماءً }\n مطراً { فأنبتنا } \n التفت من الغيبة إلى التكلم تأكيداً لمعنى اختصاص الفعل به تعالى\n وإيذاناً بأن إنبات الحدائق المختلفة الأصناف والألوان\n والطعوم والأشكال\n مع بهجتها\n بماء واحد\n لا يقدر عليه غيره\n أي: فأخرجنا { به حدائقَ }: بساتين\n فالحديقة: بستان عليه حائط\n من: الإحداق\n وهو الإحاطة\n { ذاتَ بهجةٍ } أي: ذات حُسن ورونق\n تبتهج به النظار\n ولم يقل: ذوات: لأن المعنى: جماعة حدائق\n كما تقول: النساء ذهبت\n { ما كان لكم } ما صح وما أمكن لكم { أن تُنبتوا شجرها } فضلاً عن ثِمارها وسائر صفاتها البديعة المبهجة\n { أَإِلهٌ مع الله }؟ أي: أإله كائن مع الله\n الذي ذكرت أفعاله\n التي لا يقدر عليها غيره\n حتى يُتوهم جعله شريكاً له تعالى في العبادة؟ أو: أإله مع الله يفعل ذلك؟ { بل هم قوم يَعْدِلون }: بل هم قوم عادتهم العدول عن طريق الحق بالكلية\n والانحراف عن الاستقامة في كل أمر من الأمور\n فلذلك يفعلون ما يفعلون من الإشراك والجرائم\n أو: يعدلون به غيره فيُشركونه معه\n والله تعالى أعلم\n الإشارة: قل الحمد لله\n الذي كشف الحجب عن قلوب أوليائه\n وسلام على عباده الذين اصطفاهم لحضرته\n آلله خير\n أي: أشهود الله وحده في الوجود خير\n أم شهود الغير معه؟\n فتشركون في توحيدكم\n أمن خلق سموات أرواحكم\n وهيأها لشهود الربوبية\n وخلق أرض نفوسكم\n وهيأها لآداب العبودية\n وأنزل لكم من سماء الغيوب ماء الواردات الإلهية\n فأنبتنا به في قلوب العارفين بساتين المعرفة\n ذات بهجة ونزهة؟ ما كان لكم\n وفي طوقكم\n أن تُنبتوا في قلوبكم شجر المعرفة\n ولا ثمار المحبة\n أإله مع الله يمنّ عليكم بذلك؟\n بل هم قوم يعدلون عن طريق الوصول إلى هذه البساتين البهية لأنها محفوفة بالمكاره النفسية\n لا يقدر على سلوكها إلا الشجعان\n أهل الهمم العلية\n وبالله التوفيق\n ثم ذكر نوعاً آخر من دلائل توحيده\n فقال: { أَمَّن جَعَلَ ٱلأَرْضَ قَرَاراً\n\n\n }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:7",
      "similarity": 0.5546937106837523
    },
    {
      "verse": "80:30",
      "similarity": 0.5430348019425432
    },
    {
      "verse": "78:32",
      "similarity": 0.5196857456351843
    },
    {
      "verse": "22:5",
      "similarity": 0.19534209527358415
    },
    {
      "verse": "16:10",
      "similarity": 0.12368437816580086
    }
  ]
}