{
  "chapter": "النمل",
  "text": "وانك لتلقى القرءان من لدن حكيم عليم",
  "translations": [
    {
      "translation": "You receive the Qur'an directly from One who is All-Wise, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have been conveyed the Qur'an from One all-wise and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for you, (O Muhammad), you are receiving the Qur'an from the Most Wise, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), you have certainly received the Quran from the All-wise and All-knowing One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed you (O dear Prophet Mohammed – peace and blessings be upon him), are taught the Qur’an from the Wise, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, you are being taught the Qur'an from One, All-Wise, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely you are made to receive the Quran from the Wise, the Knowing Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou receivest the Koran from One All-wise, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! as for thee (Muhammad), thou verily receivest the Qur'an from the presence of One Wise, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have received this Quran from One who is all-wise, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily thou art receiving the Qur'an) from before the Wise, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed you receive the Quran from One who is all-wise, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to thee, the Qur'an is bestowed upon thee from the presence of one who is wise and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, you (O Muhammad SAW) are receiving the Quran from the One, All-Wise, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have received the Koran from the Wise, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are receiving the Quran from an All-Wise, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, [O Muhammad], you receive the Qur'an from one Wise and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:6] And truly you — this is an address to the Prophet (s) — are receiving the Qur’ān, it is being transmitted to you intensely, from One Wise, Knowing, in such [transmission].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِنَّكَ لَتُلَقَّى الْقُرْآَنَ مِنْ لَدُنْ حَكِيمٍ عَلِيمٍ (6)عطف على جملة : { تلك آيات القرآن } \\[ النمل : 1 \\] انتقال من التنويه بالقرآن إلى التنويه بالذي أنزل عليه بأن القرآن آيات دالة على أنه كتاب مبين . وذلك آية أنه من عند الله ، ثم بأنه آية على صدق من أنزل عليه إذْ أنبأه بأخبار الأنبياء والأمم الماضين التي ما كان يعلمها هو ولا قومه قبل القرآن . وما كان يعلم خاصة أهل الكتاب إلا قليلاً منها أكثره محرف . وأيضاً فهذا تمهيد لما يذكر بعده من القصص .و { تلقّى } مضارع لقاه مبنيٌّ للمجهول ، أي جعله لاقياً . واللُّقيُّ واللقاء : وصول أحد الشيئين إلى شيء آخر قصداً أو مصادفة . والتلقية : جعل الشيء لاقياً غيره ، قال تعالى : { ولقّاهم نضرة وسروراً } \\[ الإنسان : 11 \\] ، وهو هنا تمثيل لحال إنزال القرآن إلى النبي صلى الله عليه وسلم بحال التلقية كأنَّ جبريل سعَى للجمع بين النبي صلى الله عليه وسلم والقرآن .وإنما بني الفعل إلى غير مذكور للعلم بأنه الله أو جبريل ، والمعنى واحد : وهو أنك مؤتى الوحي من لدن حكيم عليم .وتأكيد الخبر لمجرد الاهتمام لأن المخاطب هو النبي وهو لا يتردد في ذلك ، أو يكون التأكيد موجهاً إلى السامعين من الكفار على طريقة التعريض .وفي إقحام اسم { لدُن } بين { مِن } و { حكيم } تنبيه على شدة انتساب القرآن إلى جانب الله تعالى ، فإن أصل { لدن } الدلالة على المكان مثل ( عند ) ثم شاع إطلاقها على ما هو من خصائص ما تضاف هي إليه تنويهاً بشأنه ، قال تعالى : { وعلَّمناه من لُدنَّا عِلماً } \\[ الكهف : 65 \\] .والحكيم : القوي الحكمة ، والعليم : الواسع العلم . وفي التنكير إيذان بتعظيم هذا الحكيم العليم كأنه قيل : من حكيم أيّ حكيم ، وعليم أيّ عليم .وفي الوصفين الشريفين مناسبة للمعطوف عليه وللممهَّد إليه ، فإن ما في القرآن دليل على حكمة وعلم من أوحى به ، وأن ما يذكر هنا من القصص وما يستخلص منها من المغازي والأمثال والموعظة ، من آثار حكمةٍ وعِلْم حكيممٍ عليم ، وكذلك ما في ذلك من تثبيت فؤاد الرسول صلى الله عليه وسلم\n\n",
      "translations": [
        {
          "translation": "(Lo! as for thee) Muhammad, (thou verily receivest the Qur'an) He says: Gabriel comes down to you with the Qur'an (from the presence of One Wise) in His command and judgement, (Aware) of His created beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنَّكَ لَتُلَقَّى ٱلْقُرْآنَ } معناه يُلقَى عَليكَ فَتأخُذْهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {And indeed, you will receive the Qur'an} means it will be given to you, so take it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأمتناناً له في إنزال القرآن إليه ووحيه عليه: { وَإِنَّكَ } يا أكمل الرسل\n لنجابة طينتك وطهارة فطرتك { لَتُلَقَّى ٱلْقُرْآنَ } ويؤتى بك\n وينزل إليك { مِن لَّدُنْ حَكِيمٍ } مبالغ في الإحكام والإتقان { عَلِيمٍ } [النمل: 6] باسعدادات الأنام\n وقابليتهم التي بها تتفاوت طبقاتهم فضلاً وكرامةً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: تُلَقَّى: مبني للمفعول. والفاعل هو الله لدلالة ما تقدم عليه، من قوله: { وإنه لتنزيل رب العالمين }. ولقى: يتعدى إلى واحد، وبالتضعيف إلى اثنين. وكأنه كان غائباً فلقيه، فالمفعول الأول صار نائباً. و \" القرآن \": مفعول ثان، أي: وإنك ليلقيك الله القرآن. يقول الحق جل جلاله: { وإِنك } يا محمد { لَتُلَقَّى القرآنَ } أي: لتؤتاه بطريق التلقية والتلقين { من لَدُنْ حكيمٍ عليم } أي: من عند أيّ حكيم وأيّ عليم، فالتنكير للتفخيم. وفي تفخيمه تفخيم لشأن القرآن. وتنصيص على علو طبقته - عليه الصلاة والسلام - في معرفته، والإحاطة بما فيه من العلوم والحِكَم والأسرار فإن من تلقى العلوم والحِكَم من الحكيم العليم يكون عَلَماً في إتقان العلوم والحِكَم. والجمع بينهما مع دخول العلم في الحكمة لعموم العلم، ودلالة الحكمة على إتقان الفعل، والإشعار بأن ما في القرآن من العلوم، منها ما هو حكمة، كالعقائد والشرائع، ومنها ما ليس كذلك، كالقصص والأخبار الغيبية. قاله أبو السعود. قال ابن عطية: في الآية رد على كفار قريش في قولهم: القرآن من تلقاء محمد. وقال القرطبي: الآية تمهيد لما يريد أن يسوق من الأقاصيص، وما في ذلك من لطائف حكمته ودقائق علمه، ومن آثار ذلك: قصة موسى { إذ قال لأهله... } إلخ. هـ. الإشارة: قال أبو بكر بن طاهر: وإنك لَتُلَقَّى القرآن من الحق حقيقية، وإن كنت تأخذه في الظاهر عن واسطة جبريل عليه السلام. قال تعالى:\n[الرحمن: 1، 2]هـ. قلت: العارفون بالله لا يسمعون القرآن إلا من لَدُنْ حكيم عليم، بلا واسطة، الواسطة محذوفة في نظرهم، فهم يسمعون من الله إلى الله، ويقرؤون بالله على الله، كما قال القائل: أنا بالله أنطق، ومن الله أسمع. ومما يحقق لك حذف الواسطة: قوله تعالى:\n[القيامة: 28] وسمعت شيخي البوزيدي رضي الله عنه، يقول: لا يكون الإنسان من الراسخين في العلم حتى يقرأ كله وهو مجموع فيه، أي: يقرأ بالله ويسمعه من الله. والله تعالى أعلم. ثم شرع في قصص الأنبياء تسلية لرسوله صلى الله عليه وسلم، فقال: { إِذْ قَالَ مُوسَىٰ لأَهْلِهِ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:67",
      "similarity": 0.7053651630821901
    },
    {
      "verse": "18:65",
      "similarity": 0.7022537847058193
    },
    {
      "verse": "11:1",
      "similarity": 0.6339501469360213
    },
    {
      "verse": "17:80",
      "similarity": 0.576516882155881
    },
    {
      "verse": "18:2",
      "similarity": 0.548991710776042
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}