{
  "chapter": "النمل",
  "text": "امن يجيب المضطر اذا دعاه ويكشف السوء ويجعلكم خلفاء الارض اءله مع الله قليلا ما تذكرون",
  "translations": [
    {
      "translation": "He Who responds to the oppressed when they call on Him and removes their distress, and has appointed you as khalifs on the earth. Is there another god besides Allah? How little you pay heed!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hears the cry of the anguished (soul) when it calls to Him, and relieves its suffering? And who made you trustees on the earth? Is there any other god along with God? How little it is that you reflect!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it Who heeds the prayers of the distressed when he calls out to Him and Who removes his affliction? And who is it Who makes you vicegerents of the earth? Is there any god associated with Allah (in this task)? How little do you reflect!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Are the idols worthier or) the One who answers the prayers of the distressed ones, removes their hardship, and makes you the successors in the land? Is there any lord besides God? In fact, you take very little heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or He Who answers the prayer of the helpless when he invokes Him and removes the evil, and makes you inheritors of the earth? Is there a God along with Allah?! Very little do they ponder!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He Who responds to the distressed one, when he calls on Him, and Who removes the evil, and makes you inheritors of the earth, generations after generations Is there any god with Allah Little is that you remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, Who answers the distressed one when he calls upon Him and removes the evil, and He will make you successors in the earth. Is there a god with Allah? Little is it that you mind!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who answers the constrained, when he calls unto Him, and removes the evil and appoints you to be successors in the earth. Is there a god with God? Little indeed do you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (best) Who answereth the wronged one when he crieth unto Him and removeth the evil, and hath made you viceroys of the earth? Is there any Allah beside Allah? Little do they reflect!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who responds to the oppressed when he calls out to Him, and relieves his suffering and who will make you inheritors of the earth? Then, is there a god besides God? How little you pay heed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not he best Who answereth the distressed when he calleth unto Him and removeth the evil, and hath made you the successors in the earth? Is there any god along with Allah? Little ye reflect!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He who answers the call of the distressed [person] when he invokes Him and removes his distress, and makes you successors on the earth...? What! Is there a god besides Allah? Little is the admonition that you take.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, Who listens to the (soul) distressed when it calls on Him, and Who relieves its suffering, and makes you (mankind) inheritors of the earth? (Can there be another) god besides Allah? Little it is that ye heed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (better than your gods) Who responds to the distressed one, when he calls Him, and Who removes the evil, and makes you inheritors of the earth, generations after generations. Is there any ilah (god) with Allah? Little is that you remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who answers the oppressed when he supplicates to Him and removes evil and appoints you as inheritors of the earth, is there a god with Allah? How little you remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, who answers the one in need when he prays to Him, and relieves adversity, and makes you successors on earth? Is there another god with God? How hardly you pay attention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He [not best] who responds to the desperate one when he calls upon Him and removes evil and makes you inheritors of the earth? Is there a deity with Allah? Little do you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:62] Or He Who answers the desperate one, the anguished person suffering harm, when he calls to Him and Who removes [his] distress, from him and from others, and makes you successors in the earth (the annexation [khulafā’a l-ardi, ‘successors of the earth’] has the same meaning as fī, ‘in’ [khulafā’a fī’l-ardi, ‘successors in the earth’]), in other words, each generation succeeding the one before it. Is there a god with God? Little do you remember, [little] are you admonished ([read] mā tadhakkarūna, ‘do you remember’; or [read] yadhdhakkarūna, ‘do they remember’, where [in both cases] the tā’ has been assimilated with the dhāl; the mā is extra, [used] to make less what is already ‘little’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is not He (best) who answereth the wronged one) in his distress (when he crieth unto Him) to drive away his misfortune (and removeth the evil) by removing misfortunes, (and hath made you vicegerents of the earth) the dwellers of the earth after the destruction of its people? (Is there any God beside Allah) who did this? (Little do they reflect!) they derive no admonition at all from this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمَّن يُجِيبُ ٱلْمُضْطَرَّ } القلق الحائر في أمره بلا رشد منه إلى مخرجه ومخلصه { إِذَا دَعَاهُ } دعوة مؤمل ضريع سواه سبحانه { وَ } من { يَكْشِفُ ٱلسُّوۤءَ } المتفاقم على ذوي الأحزان والملمات { وَ } من { يَجْعَلُكُمْ خُلَفَآءَ ٱلأَرْضِ } من الأسلاق الذين مضوا عليها { أَإِلَـٰهٌ مَّعَ ٱللَّهِ } الواحد الأحد الصمد تدعوان أيها الجاهلون المسرفون المكابرون\n ومن نهاية جهلكم وغفلتكم عن ألوهية الحق\n وغاية غيكم وضلالكم عن توحيده { قَلِيلاً مَّا تَذَكَّرُونَ } [النمل: 62] أي: قليلاً منكم تتذكرون آلاء الله ونعمائه المتواطئة المترادفة عليكم\n\n\n{ أَمَّن يَهْدِيكُمْ } ويرشدكم أيها الحمقى { فِي ظُلُمَاتِ ٱلْبَرِّ وَٱلْبَحْرِ } بالنجوم الزاهرات { وَمَن يُرْسِلُ ٱلرِّيَاحَ } المبشرات لتكون { بُشْرَاً بَيْنَ يَدَيْ رَحْمَتِهِ } أي: بشارة بالمطر المحيي لأموات الأرضي بأنواع النباتات\n والحيوانات المبقية لأصناف المخلوقات { أَإِلَـٰهٌ } قادر على أمثال هذه الأفعال المتقنة والآثار المحكمة { مَّعَ ٱللَّهِ } المستقل بالقدرة الكاملة والحكمة الباهرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الاضطرار: الافتعال من الضرورة، وهي الحاجة المحوجة إلى اللجأ، يقال: اضطره إلى كذا، واسم الفاعل والمفعول: مضطر، ويختلف التقدير. يقول الحق جل جلاله: { أَمَّنْ يُجيبُ المُضْطَّر إِذا دعاه } ، وهو من نزلت به شدة من شدائد الزمان، ألجأته إلى الدعاء والتضرع، كمرض، أو فقر، أو نازلة من نوازل الدهر ونوائبه، أو: المذنب إذا استغفر مبتهلاً، أو: المظلوم إذا دعا، أو: من رفع يديه ولم ير لنفسه حسنة يرجو بها القبول غير التوحيد، وهو منه على خطر، فهذه أنواع المضطر. وإجابة دعوته مقيدة بالحديث:\n \" الدّاعِي عَلَى ثَلاث مراتب، إما أن يُعجل له ما طلب، وإما أن يدخر له أفضل منه، وإما يدفع عنه من السوء مثله \" \nوأيضاً: إذا حصل الاضطرار الحقيقي حصلت الإجابة قطعاً، إما بعين المطلوب، أو بما هو أتم منه، وهو الرضا والتأييد. { ويكشفُ السُوءَ } وهو الذي يعتري الإنسان مما يسؤوه، كضرر أو جَور، { ويجعَلُكم خُلفاءَ الأرض } أي: خلفاء فيها، تتصرفون فيها كيف شئتم، بالسكنى وغيره، وراثة عمن كان قبلكم من الأمم، قرناً بعد قرن: أو: أو أراد بالخلافة الملك والتسلط. { أإله مع الله } الذي يفيض على الخلق هذه النعام الجسام، يمكن أن يعطيكم مثلها؟ { قليلاً ما تذكَّرون } أي: تذكراً قليلاً، أو: زماناً قليلاً تتذكرون فيه. و \" ما \": مزيدة، لتأكيد معنى القلة، التي أريد بها العدم، أو: ما يجري مجراه في الحقارة وعدم الجدوى. وتذييل الكلام بنفي عدم التذكر منهم إيذان بأن وجود التذكر مركوز في ذهن كل ذكي، وأنه من الوضوح بحيث لا يتوقف إلا على التوجه إليه وتذكره. والله تعالى أعلم. الإشارة: الاضطرار الحقيقي الذي لا تتخلف الإجابة عنه في الغالب: وهو أن يكون العبد في حال شدته كالغريق في البحر وحده، لا يرى لغياثه غير سيده. و قال ذو النون: هو الذي قطع العلائق عما دون الله. وقال سهل بن عبد الله: هو الذي رفع يديه إلى الله تعالى داعياً، ولم تكن له وسيلة من طاعة قدّمها. هـ. بل يقدم إساءته بين يديه، ليكون دعاؤه بلا شيء يستحق عليه الإجابة، إلا من محض الكرم. قال القشيري: يقال للجناية: سراية، فَمَن كان في الجناية مختاراً، فليس يسلم له دعوى الاضطرار عند سراية جرمه الذي سلف، وهو في ذلك مختار، فأكثر الناس أنهم مضطرون، وذلك الاضطرار سراية ما بَرَزَ منهم في حال اختيارهم، وما دام العبد يتوهم من نفسه شيئاً من الحَوْلِ والحِيل، ويرى لنفسه شيئاً من الأسباب يعتمد عليه، ويستند إليه، فليس بمضطر، إلا أن يرى نفسه كالغريق في البحر، والضَّالِّ في المتاهة. والمضطر يرى غِيَاثه بيد سَيِّدهِ، وزِمَامَه في قبضته، كالميت في يد غاسِله، ولا يرى لنفسه استحقاقاً في أن يجاب، بل اعتقاده في نفسه أنه من أهل السخط، ولا يقرأ اسمه في ديوان السعادة، ولا ينبغي للمضطر أن يستعين بأحدٍ في أن يدعو له لأن الله وَعَدَ الإجابة له لا من يدعو له.\nهـ. وبحث معه المحشي الفاسي في بعض ألفاظه، فانظره. قوله تعالى: { ويكشف السُوء }: أي: ما يسوء القلب وبحجبه عن مولاه، من أكدار وأغيار، وقوله: { ويجعلكم خلفاء الأرض } أي: تتصرفون في الوجود بأسره، بهمتكم، إن زال غم الحجاب عنكم، وشاهدتم ربكم بعين بصيرتكم وبصركم لأن نور البصيرة إذا استولى على البصر، بعد فتح البصيرة، غطى نوره، فلا يرى البصر إلا ما تراه البصيرة من أسرار الذات الأزلية القديمة. فمن بلغ هذا المقام كان خليفة الله في أرضه، يُملكه الوجود بأسره وما ذلك على الله بعزيز. ثم ذكر نوعاً آخر من دلائل توحيده، فقال: { أَمَّن يَهْدِيكُمْ فِي ظُلُمَاتِ ٱلْبَرِّ وَٱلْبَحْرِ... }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:84",
      "similarity": 0.7049971510455068
    },
    {
      "verse": "16:54",
      "similarity": 0.5387803598393203
    },
    {
      "verse": "44:15",
      "similarity": 0.5365803316525667
    },
    {
      "verse": "6:17",
      "similarity": 0.500655291278028
    },
    {
      "verse": "44:12",
      "similarity": 0.4744709436935934
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/027062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/027062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/27:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}