{
  "chapter": "النمل",
  "text": "بل ادرك علمهم فى الءاخرة بل هم فى شك منها بل هم منها عمون",
  "translations": [
    {
      "translation": "No, their knowledge stoos short of the Next World. In fact they have doubts about it. In fact they are blind to it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Still less do they comprehend the life to come. In fact they are in doubt about it. Still more, they are blind to it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they have lost their knowledge of the Hereafter. They are steeped in doubt and uncertainty about it: rather they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their knowledge of the next life is no more than doubts. In fact, they are blind about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has their knowledge advanced so much as to know the Hereafter? On the contrary, they are in doubt concerning it; in fact they are blind towards it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, their knowledge will perceive that in the Hereafter. Nay, they are in doubt about it. Nay, they are in complete blindness about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, their knowledge respecting the hereafter is slight and hasty; nay, they are in doubt about it; nay, they are quite blind to it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nay, but their knowledge fails as to the Hereafter; nay, they are in doubt of it; nay, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but doth their knowledge reach to the Hereafter? Nay, for they are in doubt concerning it. Nay, for they cannot see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, their knowledge of the life to come stops short of the truth: they are [often] in doubt as to its reality: in fact, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! their knowledge attaineth not to the Hereafter, Aye! they are in doubt thereof. Aye! thereunto they are blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they comprehend the knowledge of the Hereafter? No, they are in doubt about it. Indeed, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Still less can their knowledge comprehend the Hereafter: Nay, they are in doubt and uncertainty thereanent; nay, they are blind thereunto!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they have no knowledge of the Hereafter. Nay, they are in doubt about it. Nay, they are blind about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, their knowledge fails them as to the Everlasting Life; no, they are in doubt about it, no, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, their knowledge of the Hereafter is confused. In fact, they are in doubt about it. In fact, they are blind to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, their knowledge is arrested concerning the Hereafter. Rather, they are in doubt about it. Rather, they are, concerning it, blind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:66] Nay, has their knowledge come to comprise (read adraka, similar to the [4th verbal] form akrama, ‘he was kind to’; a variant reading has iddāraka, which is actually tadāraka, with the tā’ changed into a dāl and assimilated with the [other] dāl, and a conjunctive hamza added, meaning, ‘attained’ or ‘caught up with’) the Hereafter?, such that they [have reason to] ask about the time of its coming — not so: Nay, for they are in doubt of it. Rather they are blind to it (‘amūna, ‘blind’, as in blindness of the heart; this [statement] is rhetorically more powerful than the preceding one; the origin [of the term] is ‘amiyūn, but the damma vowel is deemed too heavy for the yā’ and has been moved to the mīm, after dropping its kasra vowel).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but doth their knowledge reach to the Hereafter) their knowledge is in consensus that there is no Hereafter? (Nay, for they are in doubt concerning it) concerning the coming of the Hour. (Nay, for they cannot see it) they are blind, unable to see.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَلِ ٱدَّارَكَ عِلْمُهُمْ } معناه اجتمعَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلِ ٱدَّارَكَ } أي: بلغ وتدارك، ووصل { عِلْمُهُمْ } أي: علم العلماء وأرباب الشعور والإدراك بعدما كوشفوا بإلهما الله وجذب من جانبه، و { فِي } تحقق النشأة { ٱلآخِرَةِ } وما فيها من المعتقدات المحققة من الحشر والنشر، والصراط والسؤال، والجنة والنار، والثواب والعقاب، وجميع الأمور التي نطقت بها ألسنة الكتب والرسل { بَلْ هُمْ } أي: بل أكثر الناس { فِي شَكٍّ } وتردد { مِّنْهَا } أي: من الآخرة ومن الأمور الكائنة فيها { بَلْ هُم } أي: بل أكثرهم { مِّنْهَا } ومن الأمور الموعودة فيها { عَمُونَ } [النمل: 66] غافلون منكرون، لا يعتقدون ولا يقبلون، بل ينكرونها أشد إنكار، ويكذبونها أبلغ تكذيب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قرأ الجمهور: \" ادّارَكَ \" بالمد، وأصله: تدارك، فأدغمت التاء في الدال، ودخلت همزة وصل\n وقرأ عاصم في رواية أبي بكر: \" ادّرك \" ، وأصله: افتعل، بمعنى تفاعل\n وقرأ ابن كثير وأبو عمرو: \" أدرك \" أفعل\n يقول الحق جل جلاله: { بل ادّارك } أي: تدارك وتناهى وتتابع أسباب { عِلْمُهم في الآخرة } أي: بالآخرة، أو: في شأنها، بما ذكرنا لهم من البراهين القطعية، والحجج العقلية، على كمال قدرتنا\n ومع ذلك لم يحصل لهم بها يقين، { بل هم في شكٍّ منها } ، والمعنى: أن أسباب استحكام العلم وتكامله بأن القيامة لا ريب فيها قد حصلت لهم ومكّنوا من معرفته بما تتابع لهم من الدلائل\n زمع ذلك لم يحصل لهم شيء من علمها، بل شكّوا\n أو: أدرك علمهم، بمعنى: يدركهم في الآخرة حين يرون الأمر عياناً، ولا ينفعهم ذلك\n قاله ابن عباس وغيره\n { بل هم } اليوم { في شكٍّ منها بل هم منها عَمُونَ } لا يُبصرون دلائلها، ولا يلتفتون إلى العمل لها\n والإضرابات الثلاثة تنزيل لأحوالهم، وتأكيد لجهلهم\n وصفهم أولاً بأنهم لا يشعرون بوقت البعث، ثم بأنهم لا يعلمون أن القيامة كائنة مع تتابع أسباب علمها، ثم بأنهم يخبطون في شك ومرية، ثم بما هو اسوأ حالاً، وهو العمى، وجعل الآخرة مبدأ عماهم ومنشأه، فلذا عداه بـ \" من \" دون \" عن \" لأن الكفر بالعاقبة والجزاء هو الذي منعهم عن التفكر والتدبر\n ووجه اتصال مضمون هذه الآية – وهو وصف المشركين – بإنكارهم البعث مع استحكام أسباب العلم والتمكن من المعرفة بما قبله، وهو اختصاصه تعالى بعلم الغيب، وأن العباد لا علم لهم بشيء بذلك: هو أنه لما ذكر أن العباد لا يعلمون الغيب، وكان هذا بياناً لعجزهم، ووصفاً لقصور علمهم، وصل به أن عندهم عجزاً أبلغ منه، وهو أنهم يقولون للكائن الذي لا بد من كونه – وهو وقت بعثهم، ومجازاتهم على أعمالهم: لا يكون، مع أن عندهم أسباب معرفة كونه، لا محالة\n هـ\n قاله النسفي\n { وقال الذين كفروا أئذا كنا تراباً وآباؤنا أئنا لمخرَجُونَ } أي: أنُخرج من القبور أحياء إذا صرنا تراباً وآباؤنا\n وتكرير الاستفهام في \" أئذا \" و \" أَئِنا \" في قراءة عاصم، وحمزة وخلف، إنكار بعد إنكار، وجحود بعد جحود، ودليل على كفر مؤكد مبالغ فيه",
      "translations": []
    }
  ]
}