{
  "chapter": "النمل",
  "text": "اذ قال موسى لاهله انى ءانست نارا سـاتيكم منها بخبر او ءاتيكم بشهاب قبس لعلكم تصطلون",
  "translations": [
    {
      "translation": "When Musa said to his people, 'I can make out a fire. I will bring you news from it or at least a burning brand so that hopefully you will be able to warm yourselves.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Moses said to his family: \"I see a fire. I shall bring you news from it, or bring an ember that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Recount to them) when Moses said to his family: \"I perceive something like fire: soon will I bring to you some information from there, or I will bring you a burning brand that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to his family, \"I have seen some fire. I shall bring you some news about it or some fire so that you can warmyourselves\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Moosa said to his wife, “I have sighted a fire; I will soon bring its news to you, or bring for you an ember from it so that you may warm yourselves.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Musa said to his household: \"Verily, I have seen a fire; I will bring you from there some information, or I will bring you a burning ember, that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Musa said to his family: Surely I see fire; I will bring to you from it some news, or I will bring to you therefrom a burning firebrand so that you may warm yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his people 'I observe a fire, and will bring you news of it, or I will bring you a flaming brand, that haply you shall warm yourselves.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Moses said unto his household: Lo! I spy afar off a fire; I will bring you tidings thence, or bring to you a borrowed flame that ye may warm yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell of Moses who said to his family, \"I have seen a fire. I will bring you news from there, or a burning brand for you to warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time Musa said unto his household: verily I perceive a fire afar; I shall forthwith bring you tidings thereof, or bring unto you a brand lighted therefrom, haply ye may warm yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his family, ‘Indeed I descry a fire! I will bring you some news from it, or bring you a firebrand so that you may warm yourselves.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! Moses said to his family: \"I perceive a fire; soon will I bring you from there some information, or I will bring you a burning brand to light our fuel, that ye may warm yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Musa (Moses) said to his household: \"Verily! I have seen a fire, I will bring you from there some information, or I will bring you a burning brand, that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his household: 'Indeed, I can see a fire far away. I will go and bring you news of it or I will bring you a lighted flame so that you can warm yourselves'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his family, “I have glimpsed a fire. I will bring you some news from it; or bring you a firebrand, that you may warm yourselves.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Mention] when Moses said to his family, \"Indeed, I have perceived a fire. I will bring you from there information or will bring you a burning torch that you may warm yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:7] Mention, when Moses said to his family, [to] his wife, during his journey from Midian [back] to Egypt: ‘Assuredly I notice, I see in the distance, a fire. I will bring you news from there, about the [journey’s] route — for he had lost his way — or bring you a firebrand (read as a genitive annexation [bi-shihābi qabasin] as an explication [of shihāb, ‘flame’]; or read without [annexation, bi-shihābin qabasin] meaning, a flame of fire at the end of a wick or a wooden stick) that perhaps you might warm yourselves’, (tastalūn: the tā’ replaces the tā’ of the [8th verbal form] ifta‘ala [sc. istalā]; it derives from salaya or saliya, ‘to be exposed to the blaze of fire’), [that perhaps] you might warm yourselves from the cold.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Remember) when Moses said unto his household) when he became unsure about the way: (Lo! I spy afar off a fire) on the left side of the road; stay here (I will bring you tidings thence) news about the right way to take, (or bring to you a borrowed flame that ye may warm yourselves) because this happened in a cold winter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنِّيۤ آنَسْتُ نَاراً } معناه أبصَرْتُها\n\n\n\n\nوقوله تعالى: { بِشِهَابٍ قَبَسٍ } معناهُ بشُعلةٍ بقَبسٍ مِنهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أخذ سبحانه بتعداد أرباب الطبقات والكرامة حثاً لحبيبه صلى الله عليه وسلم بالتوجه نحوه والتحنن إليه، والمواظبة على شكر نعمه، فبدأ بموسى - صلوات الرحمن عليه وسلامه - فقال مخاطباً لحبيبه صلى الله عليه وسلم: اذكر يا أكمل الرسل وقت { إِذْ قَالَ } أخوك { مُوسَىٰ } الكليم - صلوات الرحمن عليه - { لأَهْلِهِ } وزوجته ابنة شعيب عليه السلام حين سار معها من مدين إلى مصر، وهي حاملة، والليلة شاتية مظلمة، وهم ضالون عن الطريق فجاءها الطلق، واضطر موسى في أمرها، فرأى شعلة نار من بعيد، فقال لأهله: اثبتوا مكانكم\n\n\n\n\n{ إِنِّيۤ آنَسْتُ نَاراً سَآتِيكُمْ } ذا الساعة { مِّنْهَا بِخَبَرٍ } من الطريق، يخبر به من عندها؛ إذ النار قلما تخلو عن موقدين لها { أَوْ آتِيكُمْ } إن لم أجد عندها أحداً { بِشِهَابٍ } أي: جمر ذي { قَبَسٍ } أي: مقبوسة مشتعلة منها { لَّعَلَّكُمْ تَصْطَلُونَ } [النمل: 7] وتستدفئون من البرد، وتستضيئون منها للطريق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: واذكر { إِذْ قال موسى لأهله } زوجته ومن معه، عند مسيره من مدْين إلى مصر: { إِني آنستُ } أي: أبصرتُ { ناراً سآتيكم منها بخَبَرٍ } عن حال طريق التي ضل عنها\n والسين للدلالة على نوع بُعد في المسافة، وتأكيد الوعد\n { آو آتيكم بشهابٍ قبَسٍ } أي: شعلة نار مقبوسة، أي مأخوذة\n ومن نوّن فبدل، أو صفة، وعلى القراءتين فالمراد: تعيين المقصود الذي هو القبس، الجامع لمنفعتي الضياء والاصطلاء لأن من النار ما ليس بقبس، كالجمرة\n وكلتا العِدتين منه عليه السلام بطريق الظن، كما يُفصح عن ذلك ما في سورة طه، من صيغتي الترجي والترديد لأن الراجي إذا قوي رجاؤه يقول: سأفعل كذا، وسيكون كذا، مع تجويزه التخلف\n وأتى بأو لأنه بنى الرجاء على أنه إن لم يظفر بحاجتيه معاً لم يعدم واحدة منهما، إما هداية الطريق، وإما اقتباس النار، ولم يدر أنه ظافر بحاجته الكبرى، وهي عزّ الدنيا والآخرة\n واختلاف الألفاظ في هاتين السورتين، والقصة واحدة، دليل على نقل الحديث بالمعنى، وجواز النكاح بغير لفظ النكاح والتزويج\n قاله النسفي\n { لعلكم تَصْطَلُون } تستدفئون بالنار من البرد إذا أصابكم",
      "translations": []
    }
  ]
}