{
  "chapter": "النمل",
  "text": "فتوكل على الله انك على الحق المبين",
  "translations": [
    {
      "translation": "So put your trust in Allah. You are clearly on a path of truth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So you place your trust in God. Certainly you stand on positive truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So put your trust in Allah for you are on the manifest truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Trust in God for you follow the manifest truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore rely on Allah; you are indeed upon the clear Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, put your trust in Allah; surely, you are on manifest truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore rely on Allah; surely you are on the clear truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So put thy trust in God; thou art upon the manifest truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor (O Muhammad) put thy trust in Allah, for thou (standest) on the plain Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so put your trust in God. Surely you are on the path of manifest truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore put thy trust in Allah; verily thou art on manifest truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So put your trust in Allah, for you indeed stand on the manifest truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So put thy trust in Allah: for thou art on (the path of) manifest Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So put your trust in Allah; surely, you (O Muhammad SAW) are on manifest truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore put your trust in Allah, for you are upon a clear truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So rely on God. You are upon the clear truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So rely upon Allah; indeed, you are upon the clear truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:79] So rely on God, trust in Him, for you are indeed upon the manifest truth, [upon] the manifest religion: the sequel shall be in your favour, with victory over the disbelievers. God then draws comparisons between them and the dead, the deaf and the blind, saying:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore) Muhammad (put thy trust in Allah, for thou (standest) on the plain Truth) Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن كذبوك يا أكمل الرسل وكتابك، وجادلوا معك مراءً ومكابرةً { فَتَوَكَّلْ عَلَى ٱللَّهِ } المتكفل لحفظك وحضانتك { إِنَّكَ } في أمر دينك وكتابك ورسالتك وهدايتك، وفي جميع ما جئت به من قِبَل ربك { عَلَى ٱلْحَقِّ } والصدق الذي لا يأتيه الباطل والكذب من بين يديه ولا من خلفه { ٱلْمُبِينِ } [النمل: 79] الظاهر حقيته عند ذوي البصائر وأولي الألباب المستكشفين عن لبّ الأمور، المعرضين عن قشورها، فإن أعرضوا عنك ولم يقبلوا إرشادك وهدايتك لا تبال بهم وبإعراضهم وانصرافهم؛ إذ هم أموات عند التحقيق لا حياة لهم حقيقة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فتوكلْ على الله } ، الفاء لترتيب ما قبله من ذكر شؤونه - عز وجل - فإنها موجبة للتوكل عليه، داعية إلى الأمر به، أي: فتوكل على الله الذي هذا شأنه\n وهذه أوصافه، فإنه موجب لكل أحد يتوكل عليه، ويفوض جميع أموره إليه\n أو: فتوكل على الله ولا تُبالي بأعدادء الدين\n { إنك على الحق المبين } ، تعليل للأمر بالتوكل بأنه الحق الأبلج، وهو الدين الواضح الذي لا يتطرقه شك ولا ريب\n وفيه تنبيه على أن أصحاب الحق حقيق بالوثوق بالله في نصرته\n وقد تضمنت الآية من أولها ثناء على القرآن، بنفي ما رموه من كون أساطير الأولين\n ثم وصفه بكونه هدى ورحمة للمؤمنين\n ثم توعد الرامين له بحُكمه عليهم بما يستحقونه، ثم أمره بالتوكل عليه في كفايته أمرهم ومكرهم",
      "translations": []
    }
  ]
}