{
  "chapter": "النمل",
  "text": "ان ربك يقضى بينهم بحكمه وهو العزيز العليم",
  "translations": [
    {
      "translation": "Surely your Lord in His wisdom will decide between them. He is all-mighty and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord will decide between them by His judgement. He is All-Mighty, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord will judge among them according to His own decree. He is Majestic and All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord judges between them with His command; and He is the Almighty, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, your Lord will decide between them by His judgement. And He is the All-Mighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord will judge between them by his judgment, and He is the Mighty, the knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely thy Lord will decide between them by His Judgment; He is the All-mighty, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! thy Lord will judge between them of His wisdom, and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly your Lord will decide between them in His wisdom, He is the Almighty, the All Knowing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily thine Lord shall decide between them with His judgment, and He is the Mighty, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord will decide between them by His judgement, and He is the All-mighty, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily thy Lord will decide between them by His Decree: and He is Exalted in Might, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, your Lord will decide between them (various sects) by His Judgement. And He is the All-Mighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, by His Judgement, your Lord will decide between them. He is the Mighty, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord will judge between them by His wisdom. He is the Almighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your Lord will judge between them by His [wise] judgement. And He is the Exalted in Might, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[27:78] Surely your Lord will decide between them, as [He will] with others on the Day of Resurrection, of His judgement, that is, His justice. And He is the Mighty, the Victor, the Knower, of what He judges, so that none will be able to oppose Him in the way that the disbelievers have opposed His prophets in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! thy Lord will judge between them) between the Jews and Christians (of His wisdom) by His judgement and decree on the Day of Judgement, (and He is the Mighty) in retribution against them, (the Knower) He knows them and knows their punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِن رَبَّكَ } يا أكمل الرسل { يَقْضِي بَيْنَهُم } أي: بين المختلفين من بني إسرائيل { بِحُكْمِهِ } المستنبط من حكمته المتقنة { وَ } كيف لا { هُوَ ٱلْعَزِيزُ } الغالب في أحكامه المبرمة { ٱلْعَلِيمُ } [النمل: 78] في حكمته المتقنة المتفرعة على عدالته الحقيقية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إنَّ ربك يقضي بينهم } أي: بين بني إسرائيل، أو: بين من آمن بالقرآن ومن كفر به، { بحُكْمِه } أي: بعدله لأنه لا يحكم إلا بالعدل، فسمى المحكوم به حكماً\n أو: بحكمته، ويدل على قراءة من قرأ \" بِحِكَمه \": جمع: حِكمة لأن أحكامه تعالى كلها حِكَم بديعة\n { وهو العزيزُ } ، فلا يُردّ حُكمه وقضاؤه، { العَليمُ } بجميع الأشياء، ومن جملتها: من يقضي له ومن يقضي عليه\n أو: العزيز في انتقامه من المبطلين، العليم بالفصل بين المختلفين",
      "translations": []
    }
  ]
}